{"title": "Proxy Caching in Split TCP: Dynamics, Stability and Tail Asymptotics.", "fields": ["tcp global synchronization", "hstcp", "tcp hole punching", "tcp tuning", "tcp friendly rate control"], "abstract": "The split of a multihop, point to point TCP connection consists in replacing a plain, end-to-end TCP connection by a cascade of TCP connections. In such a cascade, connection n feeds connection n+1 through some proxy node n. This technique is used in a variety of contexts. In overlay networks, proxies are often peers of the underlying peer to peer network. Split TCP is also already proposed and largely adopted in wireless networks at the wired/wireless interface to separate links with vastly different characteristics. In order to avoid losses in the proxies, a backpressure mechanism is often used in this context. In this paper we develop a model for such a split TCP connection aimed at the analysis of the throughput dynamics on both links and that of the buffer occupancy in the proxy for long file transfers. The two main variants of Split TCP are considered: that with backpressure and that without. The study consists of two parts: the first part is purely experimental and is based on ns2 simulations. It allows us to identify complex interaction phenomena between TCP flow rates and proxy buffer occupancy, which seem to have been ignored by previous work on Split TCP. The second part of the paper is of mathematical nature. We establish the basic equations that govern the evolution of such a cascade and prove some of the experimental observations made in the first part. In particular, we give the conditions for system stability and we show the possibility of heavy tail asymptotics for proxy buffer occupancy and delays in the stationary regime.", "citation": "Citations (20)", "departments": ["French Institute for Research in Computer Science and Automation", "Institute for R ... nce and Control", "School of Mathe ... mputer Sciences"], "authors": ["François Baccelli.....http://dblp.org/pers/hd/b/Baccelli:Fran=ccedil=ois", "Giovanna Carofiglio.....http://dblp.org/pers/hd/c/Carofiglio:Giovanna", "Serguei Foss.....http://dblp.org/pers/hd/f/Foss:Serguei"], "conf": "infocom", "year": "2008", "pages": 5}