{"title": "Closed Form Solutions for Symmetric Water Filling Games.", "fields": ["water filling algorithm", "normal form game", "bisection method", "price of anarchy", "solution concept"], "abstract": "We study power control in optimization and game frameworks. In the optimization framework there is a single decision maker who assigns network resources and in the game framework users share the network resources according to Nash equilibrium. The solution of these problems is based on so-called water-filling technique, which in turn uses bisection method for solution of non-linear equations for Lagrange multipliers. Here we provide a closed form solution to the water-filling problem, which allows us to solve it in a finite number of operations. Also, we produce a closed form solution for the Nash equilibrium in symmetric Gaussian interference game with an arbitrary number of users. Even though the game is symmetric, there is an intrinsic hierarchical structure induced by the quantity of the resources available to the users. We use this hierarchical structure to perform a successive reduction of the game. In addition to its mathematical beauty, the explicit solution allows one to study limiting cases when the crosstalk coefficient is either small or large. We provide an alternative simple proof of the convergence of the iterative water filling algorithm. Furthermore, it turns out that the convergence of Iterative water filling algorithm slows down when the crosstalk coefficient is large. Using the closed form solution, we can avoid this problem. Finally, we compare the non-cooperative approach with the cooperative approach and show that the non-cooperative approach results in a more fair resource distribution.", "citation": "Citations (21)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Saint Petersburg State University"], "authors": ["Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan", "Konstantin Avrachenkov.....http://dblp.org/pers/hd/a/Avrachenkov:Konstantin", "Andrey Garnaev.....http://dblp.org/pers/hd/g/Garnaev:Andrey"], "conf": "infocom", "year": "2008", "pages": 9}