{"title": "Identity-based encryption with efficient revocation.", "fields": ["probabilistic encryption", "multiple encryption", "revocation", "public key cryptography", "keyfile", "plaintext aware encryption", "attribute based encryption", "public key infrastructure", "provable security"], "abstract": "Identity-based encryption (IBE) is an exciting alternative to public-key encryption, as IBE eliminates the need for a Public Key Infrastructure (PKI). The senders using an IBE do not need to look up the public keys and the corresponding certificates of the receivers, the identities (e.g. emails or IP addresses) of the latter are sufficient to encrypt. Any setting, PKI- or identity-based, must provide a means to revoke users from the system. Efficient revocation is a well-studied problem in the traditional PKI setting. However in the setting of IBE, there has been little work on studying the revocation mechanisms. The most practical solution requires the senders to also use time periods when encrypting, and all the receivers (regardless of whether their keys have been compromised or not) to update their private keys regularly by contacting the trusted authority. We note that this solution does not scale well -- as the number of users increases, the work on key updates becomes a bottleneck. We propose an IBE scheme that significantly improves key-update efficiency on the side of the trusted party (from linear to logarithmic in the number of users), while staying efficient for the users. Our scheme builds on the ideas of the Fuzzy IBE primitive and binary tree data structure, and is provably secure.", "citation": "Citations (643)", "year": "2008", "departments": ["Georgia Institute of Technology", "University of California, Los Angeles", "Georgia Institute of Technology"], "conf": "ccs", "authors": ["Alexandra Boldyreva.....http://dblp.org/pers/hd/b/Boldyreva:Alexandra", "Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Virendra Kumar.....http://dblp.org/pers/hd/k/Kumar:Virendra"], "pages": 10}