{"title": "Power to the people: Leveraging human physiological traits to control microprocessor frequency.", "fields": ["frequency scaling", "total system power", "laptop", "end user", "clock rate"], "abstract": "Any architectural optimization aims at satisfying the end user. However, modern architectures execute with little to no knowledge about the individual user. If architectures could determine whether their users are satisfied, they could provide higher efficiency; improved reliability, reduced power consumption, increased security, and a better user experience. A major reason for this limitation is their input devices. Specifically, the traditional input devices (e.g., the mouse and keyboard) provide limited information about the user. In this paper, we make a case for the addition of new biometric input devices for providing the computer information about the userpsilas physiological traits. We explore three biometric devices as potential sensors: an eye tracker, a galvanic skin response (GSR) sensor, and force sensors. We first present two user studies that explore the link between the sensor readings and user satisfaction when the performance of the processor is varied as a video game is being played. In the first study, we drastically drop the processor clock frequency at a set point in the game. In the second study, we set the clock frequency to randomly-selected levels during game play. Both studies show that there are significant changes in human physiological traits as performance decreases. More importantly, we show that physiological changes correlate strongly to the satisfaction levels reported by the users. Based upon these observations, we construct a Physiological Traits-based Power-management (PTP) system that can be applied to existing dynamic voltage and frequency scaling (DVFS) schemes. We apply PTP to a typical CPU-utilization-based adaptive DVFS policy and evaluate our scheme using a third user study. An aggressive version of our PTP scheme reduces the total system power consumption of a laptop by up to 33.3% for an application averaged across users (18.1% averaged across three applications), while a conservative version reduces the total system power consumption by up to 25.6% across users (11.4% averaged across three applications).", "citation": "Citations (66)", "departments": ["Northwestern University", "Northwestern University", "Northwestern University", "Northwestern University", "Northwestern University"], "authors": ["Alex Shye.....http://dblp.org/pers/hd/s/Shye:Alex", "Yan Pan.....http://dblp.org/pers/hd/p/Pan:Yan", "Benjamin Scholbrock.....http://dblp.org/pers/hd/s/Scholbrock:Benjamin", "J. Scott Miller.....http://dblp.org/pers/hd/m/Miller:J=_Scott", "Gokhan Memik.....http://dblp.org/pers/hd/m/Memik:Gokhan", "Peter A. Dinda.....http://dblp.org/pers/hd/d/Dinda:Peter_A=", "Robert P. Dick.....http://dblp.org/pers/hd/d/Dick:Robert_P="], "conf": "micro", "year": "2008", "pages": 12}