{"title": "Hybrid analytical modeling of pending cache hits, data prefetching, and MSHRs.", "fields": ["latency", "cas latency", "cache", "logic synthesis", "moving average", "superscalar", "processor design"], "abstract": "As the number of transistors integrated on a chip continues to increase, a growing challenge is accurately modeling performance in the early stages of processor design. Analytical models have been employed to rapidly search for higher performance designs, and can provide insights that detailed simulators may not. This paper proposes techniques to predict the impact of pending cache hits, hardware prefetching, and realistic miss status holding register (MSHR) resources on superscalar performance in the presence of long latency memory systems when employing hybrid analytical models that apply instruction trace analysis. Pending cache hits are secondary references to a cache block for which a request has already been initiated but has not yet completed. We find pending hits resulting from spatial locality and the fine-grained selection of instruction profile window blocks used for analysis both have non-negligible influences on the accuracy of hybrid analytical models and subsequently propose techniques to account for their effects. We then introduce techniques to estimate the performance impact of data prefetching by modeling the timeliness of prefetches and to account for a limited number of MSHRs by restricting the size of profile window blocks. As with earlier hybrid analytical models, our approach is roughly two orders of magnitude faster than detailed simulations. When modeling pending hits for a processor with unlimited outstanding misses we improve the accuracy of our baseline by a factor of 3.9, decreasing average error from 39.7% to 10.3%. When modeling a processor with data prefetching, a limited number of MSHRs, or both, the techniques result in an average error of 13.8%, 9.5% and 17.8%, respectively.", "citation": "Citations (24)", "departments": ["University of British Columbia", "University of British Columbia", "University of British Columbia", "University of British Columbia"], "authors": ["Xi E. Chen.....http://dblp.org/pers/hd/c/Chen:Xi_E=", "Tor M. Aamodt.....http://dblp.org/pers/hd/a/Aamodt:Tor_M="], "conf": "micro", "year": "2008", "pages": 12}