{"title": "The effectiveness of a QoE-based video output scheme for audio-video ip transmission.", "fields": ["quality of service", "quality of experience", "error concealment", "video quality", "packet loss"], "abstract": "This paper shows the effectiveness and feasibility of a video output scheme the authors proposed previously to enhance QoE (Quality of Experience) (i.e., perceptual QoS) of audio-video IP transmission. The scheme, SCS (Switching between error Concealment and frame Skipping), utilizes a tradeoff relation between spatial and temporal quality caused by video error concealment and video frame skipping, both of which cope with video packet loss. The scheme switches from error concealment to frame skipping when the percentage of video slices error-concealed in a frame exceeds a threshold value, which is a key to achieving high QoE with SCS. We propose a way of selecting appropriate threshold values on the basis of real-time estimation of QoE. For that purpose, we performed two experiments for four values of the threshold. One experiment is the measurement of application-level QoS and QoE, from which we confirm the effectiveness of SCS and derive multiple regression lines that estimate QoE from the application-level QoS. The other is the measurement of the percentage of the selected threshold value by the proposed way with the multiple regression lines. Examining the QoE measured by the first experiment when we adopt the selected threshold values in the second experiment, we find that the way gives appropriate selections in many cases and therefore the SCS with the way of threshold selection is feasible.", "citation": "Citations (28)", "departments": ["Nagoya Institute of Technology", "Nagoya Institute of Technology", "Nagoya Institute of Technology", "Nagoya Institute of Technology"], "authors": ["Shuji Tasaka.....http://dblp.org/pers/hd/t/Tasaka:Shuji", "Hikaru Yoshimi.....http://dblp.org/pers/hd/y/Yoshimi:Hikaru", "Akifumi Hirashima.....http://dblp.org/pers/hd/h/Hirashima:Akifumi", "Toshiro Nunome.....http://dblp.org/pers/hd/n/Nunome:Toshiro"], "conf": "mm", "year": "2008", "pages": 10}