{"title": "Efficiently answering reachability queries on very large directed graphs.", "fields": ["block graph", "implicit graph", "graph labeling", "tremaux tree", "transitive reduction"], "abstract": "Efficiently processing queries against very large graphs is an important research topic largely driven by emerging real world applications, as diverse as XML databases, GIS, web mining, social network analysis, ontologies, and bioinformatics. In particular, graph reachability has attracted a lot of research attention as reachability queries are not only common on graph databases, but they also serve as fundamental operations for many other graph queries. The main idea behind answering reachability queries in graphs is to build indices based on reachability labels. Essentially, each vertex in the graph is assigned with certain labels such that the reachability between any two vertices can be determined by their labels. Several approaches have been proposed for building these reachability labels; among them are interval labeling (tree cover) and 2-hop labeling. However, due to the large number of vertices in many real world graphs (some graphs can easily contain millions of vertices), the computational cost and (index) size of the labels using existing methods would prove too expensive to be practical. In this paper, we introduce a novel graph structure, referred to as  path-tree , to help labeling very large graphs. The path-tree cover is a spanning subgraph of  G  in a tree shape. We demonstrate both analytically and empirically the effectiveness of our new approaches.", "citation": "Citations (173)", "year": "2008", "departments": ["Kent State University", "Kent State University", "Kent State University", "IBM"], "conf": "sigmod", "authors": ["Ruoming Jin.....http://dblp.org/pers/hd/j/Jin:Ruoming", "Yang Xiang.....http://dblp.org/pers/hd/x/Xiang:Yang", "Ning Ruan.....http://dblp.org/pers/hd/r/Ruan:Ning", "Haixun Wang.....http://dblp.org/pers/hd/w/Wang:Haixun"], "pages": 14}