{"title": "Tool Support for Parametric Analysis of Large Software Simulation Systems.", "fields": ["supervised learning", "guidance navigation and control", "software system", "stateflow", "systems simulation"], "abstract": "The analysis of large and complex parameterized software systems, e.g., systems simulation in aerospace, is very complicated and time-consuming due to the large parameter space, and the complex, highly coupled nonlinear nature of the different system components. Thus, such systems are generally validated only in regions local to anticipated operating points rather than through characterization of the entire feasible operational envelope of the system. We have addressed the factors deterring such an analysis with a tool to support envelope assessment: we utilize a combination of advanced Monte Carlo generation with n-factor combinatorial parameter variations to limit the number of cases, but still explore important interactions in the parameter space in a systematic fashion. Additional test-cases, automatically generated from models (e.g., UML, Simulink, Stateflow) improve the coverage. The distributed test runs of the software system produce vast amounts of data, making manual analysis impossible. Our tool automatically analyzes the generated data through a combination of unsupervised Bayesian clustering techniques (AutoBayes) and supervised learning of critical parameter ranges using the treatment learner TAR3. The tool has been developed around the Trick simulation environment, which is widely used within NASA. We will present this tool with a GN&C (Guidance, Navigation and Control) simulation of a small satellite system.", "citation": "Citations (3)", "departments": ["West Virginia University", "RIACS/USRA, NAS ...  Ames, Ames, IA", "NASA", "NASA", "NASA"], "authors": ["Johann Schumann.....http://dblp.org/pers/hd/s/Schumann:Johann", "Karen Gundy-Burlet.....http://dblp.org/pers/hd/g/Gundy=Burlet:Karen", "Corina S. Pasareanu.....http://dblp.org/pers/hd/p/Pasareanu:Corina_S=", "Tim Menzies.....http://dblp.org/pers/hd/m/Menzies:Tim", "Tony Barrett.....http://dblp.org/pers/hd/b/Barrett:Tony"], "conf": "kbse", "year": "2008", "pages": 2}