{"title": "A Game-Theoretic Analysis of QoS in Wireless MAC.", "fields": ["throughput", "nash equilibrium", "random access", "bargaining problem", "incentive"], "abstract": "Many wireless network standards include quality-of-service (QoS) features at the MAC layer. These features provide nodes transmitting high priority delay sensitive traffic such as voice and video preferential access to the channel over nodes carrying low priority delay tolerant traffic such as file transfer and email. However, such schemes are unfair to low priority users, depriving them of equitable transmission opportunities, and causing throughput starvation for their applications. Such unfairness can provoke rational nodes carrying low priority traffic to falsely declare their traffic as high priority in order to maximize their throughput, thereby defeating the very purpose of QoS differentiation. In this paper, we provide game-theoretic analysis of a slotted Aloha like MAC that resembles the IEEE 802.11e MAC in many essential respects. Our MAC model allows traffic to be classified as either high-priority (HP) or low-priority (LP), and allows for both random access (contention) and polled (contention-free) channel access. We advocate an incentive mechanism to stimulate LP users to be truthful. This incentive mechanism makes use of the contention-free channel access feature of our MAC as an efficient and protocol-compliant mechanism to encourage low priority users to be truthful. We discuss appropriate utility functions for HP and LP traffic and use a fixed point analysis to derive the performance of the system in terms of the fraction of time the system is operated in contention-free mode. We find the condition for which our incentive mechanism results in a truthful Nash equilibrium, i.e., no user has an incentive to unilaterally lie about her traffic type. We then use the Nash bargaining solution (NBS) concept to suggest how an AP can pick an operating point using our incentive mechanism to ensure fairness and Pareto- optimality.", "citation": "Citations (25)", "departments": ["University of California, San Diego", "University of California, San Diego"], "authors": ["Pavan Nuggehalli.....http://dblp.org/pers/hd/n/Nuggehalli:Pavan", "Mahasweta Sarkar.....http://dblp.org/pers/hd/s/Sarkar:Mahasweta", "Kishor Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni:Kishor", "Ramesh R. Rao.....http://dblp.org/pers/hd/r/Rao:Ramesh_R="], "conf": "infocom", "year": "2008", "pages": 9}