{"title": "Peacock Hashing: Deterministic and Updatable Hashing for High Performance Networking.", "fields": ["rolling hash", "hopscotch hashing", "dynamic perfect hashing", "primary clustering", "feature hashing"], "abstract": "Hash tables are extensively used in networking to implement data-structures that associate a set of keys to a set of values, as they provide O(1), query, insert and delete operations. However, at moderate or high loads collisions are quite frequent which not only increases the access time, but also induces non- determinism in the performance. Due to this non-determinism, the performance of these hash tables degrades sharply in the multi-threaded network processor based environments, where a collection of threads perform the hashing operations in a loosely synchronized manner. In such systems, it is critical to keep the hash operations more deterministic. A recent series of papers have been proposed, which employs a compact on-chip memory to enable deterministic and fast hash queries. While effective, these schemes require substantial on- chip memory, roughly 10-bits for every entry in the hash table. This limits their general usability; specifically in the network processor context, where on-chip resources are scarce. In this paper, we propose a novel hash table construction called  Peacock   hash , which reduces the on-chip memory by more than 10-folds while keeping a high degree of determinism in performance. This significantly reduced on-chip memory not only makes Peacock hashing much more appealing for the general use but also makes it an attractive choice for the implementation of a hash hardware accelerator on a network processor.", "citation": "Citations (168)", "departments": ["Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis"], "authors": ["Sailesh Kumar.....http://dblp.org/pers/hd/k/Kumar:Sailesh", "Jonathan S. Turner.....http://dblp.org/pers/hd/t/Turner:Jonathan_S=", "Patrick Crowley.....http://dblp.org/pers/hd/c/Crowley:Patrick"], "conf": "infocom", "year": "2008", "pages": 5}