{"title": "Never Walk Alone: Uncertainty for Anonymity in Moving Objects Databases.", "fields": ["greedy algorithm", "data quality", "range query", "distortion", "outlier"], "abstract": "Preserving individual privacy when publishing data is a problem that is receiving increasing attention. According to the fc-anonymity principle, each release of data must be such that each individual is indistinguishable from at least k - 1 other individuals. In this paper we study the problem of anonymity preserving data publishing in moving objects databases. We propose a novel concept of k-anonymity based on co-localization that exploits the inherent uncertainty of the moving object's whereabouts. Due to sampling and positioning systems (e.g., GPS) imprecision, the trajectory of a moving object is no longer a polyline in a three-dimensional space, instead it is a cylindrical volume, where its radius delta represents the possible location imprecision: we know that the trajectory of the moving object is within this cylinder, but we do not know exactly where. If another object moves within the same cylinder they are indistinguishable from each other. This leads to the definition of (k,delta) -anonymity for moving objects databases. We first characterize the (k, delta)-anonymity problem and discuss techniques to solve it. Then we focus on the most promising technique by the point of view of information preservation, namely space translation. We develop a suitable measure of the information distortion introduced by space translation, and we prove that the problem of achieving (k,delta) -anonymity by space translation with minimum distortion is NP-hard. Faced with the hardness of our problem we propose a greedy algorithm based on clustering and enhanced with ad hoc pre-processing and outlier removal techniques. The resulting method, named NWA (Never Walk .Alone), is empirically evaluated in terms of data quality and efficiency. Data quality is assessed both by means of objective measures of information distortion, and by comparing the results of the same spatio-temporal range queries executed on the original database and on the (k, delta)-anonymized one. Experimental results show that for a wide range of values of delta and k, the relative error introduced is kept low, confirming that NWA produces high quality (k, delta)-anonymized data.", "citation": "Citations (441)", "departments": ["Istituto di Scienza e Tecnologie dell'Informazione", "Istituto di Scienza e Tecnologie dell'Informazione", "Comput. Eng. De ...  Ankara, Ankara"], "authors": ["Osman Abul.....http://dblp.org/pers/hd/a/Abul:Osman", "Francesco Bonchi.....http://dblp.org/pers/hd/b/Bonchi:Francesco", "Mirco Nanni.....http://dblp.org/pers/hd/n/Nanni:Mirco"], "conf": "icde", "year": "2008", "pages": 10}