{"title": "Reducing Maximum Stretch in Compact Routing.", "fields": ["static routing", "destination sequenced distance vector routing", "multipath routing", "equal cost multi path routing", "routing table"], "abstract": "It is important in communication networks to use routes that are as short as possible (i.e have low stretch) while keeping routing tables small. Recent advances in compact routing show that a stretch of 3 can be achieved while maintaining a sub- linear (in the size of the network) space at each node [14]. It is also known that no routing scheme can achieve stretch less than 3 with sub-linear space for arbitrary networks. In contrast, simulations on real-life networks have indicated that stretch less than 3 can indeed be obtained using sub-linear sized routing tables[6]. In this paper, we further investigate the space-stretch tradeoffs for compact routing by analyzing a specific class of graphs and by presenting an efficient algorithm that (approximately) finds the optimum space-stretch tradeoff for any given network. We first study a popular model of random graphs, known as Bernoulli random graphs or Erds-Renyi graphs, and prove that stretch less than 3 can be obtained in conjunction with sub- linear routing tables. In particular, stretch 2 can be obtained using routing tables that grow roughly as n 3/4  where n is the number of nodes in the network. Compact routing schemes often involve the selection of landmarks. We present a simple greedy scheme for landmark selection that takes a desired stretch s and a budget L on the number of landmarks as input, and produces a set of at most 0(L logn) landmarks that achieve stretch s. Our scheme produces routing tables that use no more than O(logn) more space than the optimum scheme for achieving stretch s with L landmarks. This may be a valuable tool for obtaining near-optimum stretch-space tradeoffs for specific graphs. We simulate this greedy scheme (and other heuristics) on multiple classes of random graphs as well as on Internet like graphs.", "citation": "Citations (53)", "departments": ["Stanford University", "Stanford University", "Stanford University"], "authors": ["Mihaela Enachescu.....http://dblp.org/pers/hd/e/Enachescu:Mihaela", "Mei Wang.....http://dblp.org/pers/hd/w/Wang:Mei", "Ashish Goel.....http://dblp.org/pers/hd/g/Goel:Ashish"], "conf": "infocom", "year": "2008", "pages": 5}