{"title": "Context-aware query suggestion by mining click-through and session data.", "fields": ["rdf query language", "ranking", "web query classification", "sargable", "web search query"], "abstract": "Query suggestion plays an important role in improving the usability of search engines. Although some recently proposed methods can make meaningful query suggestions by mining query patterns from search logs, none of them are context-aware - they do not take into account the immediately preceding queries as context in query suggestion. In this paper, we propose a novel context-aware query suggestion approach which is in two steps. In the  offine model-learning step , to address data sparseness, queries are summarized into concepts by clustering a click-through bipartite. Then, from session data a  concept sequence suffix tree  is constructed as the query suggestion model. In the  online query suggestion step , a user's search context is captured by mapping the query sequence submitted by the user to a sequence of concepts. By looking up the context in the concept sequence sufix tree, our approach suggests queries to the user in a context-aware manner. We test our approach on a large-scale search log of a commercial search engine containing 1:8 billion search queries, 2:6 billion clicks, and 840 million query sessions. The experimental results clearly show that our approach outperforms two baseline methods in both coverage and quality of suggestions.", "citation": "Citations (557)", "departments": ["University of Science and Technology of China", "Microsoft", "Simon Fraser University", "Nanyang Technological University", "Nankai University"], "authors": ["Huanhuan Cao.....http://dblp.org/pers/hd/c/Cao:Huanhuan", "Daxin Jiang.....http://dblp.org/pers/hd/j/Jiang:Daxin", "Jian Pei.....http://dblp.org/pers/hd/p/Pei:Jian", "Qi He.....http://dblp.org/pers/hd/h/He:Qi", "Zhen Liao.....http://dblp.org/pers/hd/l/Liao:Zhen", "Enhong Chen.....http://dblp.org/pers/hd/c/Chen:Enhong", "Hang Li.....http://dblp.org/pers/hd/l/Li_0001:Hang"], "conf": "kdd", "year": "2008", "pages": 9}