{"title": "A Mixed Reality Approach for Merging Abstract and Concrete Knowledge.", "fields": ["merge", "modeling and simulation", "abstract and concrete", "mixed reality", "knowledge transfer"], "abstract": "Mixed reality's (MR) ability to merge real and virtual spaces is applied to merging different knowledge types, such as abstract and concrete knowledge. To evaluate whether the merging of knowledge types can benefit learning, MR was applied to an interesting problem in anesthesia machine education. The virtual anesthesia machine (VAM) is an interactive, abstract 2D transparent reality simulation of the internal components and invisible gas flows of an anesthesia machine. It is widely used in anesthesia education. However when presented with an anesthesia machine, some students have difficulty transferring abstract VAM knowledge to the concrete real device. This paper presents the augmented anesthesia machine (AAM). The AAM applies a magic-lens approach to combine the VAM simulation and a real anesthesia machine. The AAM allows students to interact with the real anesthesia machine while visualizing how these interactions affect the internal components and invisible gas flows in the real world context. To evaluate the AAM's learning benefits, a user study was conducted. Twenty participants were divided into either the VAM (abstract only) or AAM (concrete+abstract) conditions. The results of the study show that MR can help users bridge their abstract and concrete knowledge, thereby improving their knowledge transfer into real world domains.", "citation": "Citations (30)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "University of Florida"], "authors": ["John Quarles.....http://dblp.org/pers/hd/q/Quarles:John", "Samsun (Sem) Lampotang.....http://dblp.org/pers/hd/l/Lampotang:Samsun_=Sem=", "Ira Fischler.....http://dblp.org/pers/hd/f/Fischler:Ira", "Paul A. Fishwick.....http://dblp.org/pers/hd/f/Fishwick:Paul_A=", "Benjamin Lok.....http://dblp.org/pers/hd/l/Lok:Benjamin"], "conf": "vr", "year": "2008", "pages": 8}