{"title": "MAC for Networks with Multipacket Reception Capability and Spatially Distributed Nodes.", "fields": ["network packet", "ultra wideband", "computer network", "multipacket reception", "physical layer", "throughput", "computer science", "computer security", "random access", "mimo"], "abstract": "The physical layer of future wireless networks will be based on novel radio technologies such as UWB and MIMO. One of the important capabilities of such technologies is the ability to capture a few packets simultaneously. This capability has the potential to improve the performance of the MAC layer. However, we show that in networks with spatially distributed nodes, reusing backoff mechanisms originally designed for narrow-band systems (e.g. CSMA/CA) is inefficient. It is well known that when networks with spatially distributed nodes operate with such MAC protocols, the channel may be captured by nodes that are near the destination, leading to unfairness. We show that when the physical layer enables multipacket reception, the negative implications of reusing the legacy protocols include not only such unfairness but also a significant throughput reduction. We present alternative backoff mechanisms and evaluate their performance via Markovian analysis and simulation. We show that our alternative backoff mechanisms can improve both overall throughput and fairness.", "citation": "Citations (93)", "departments": ["Massachusetts Institute of Technology", "Columbia University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Columbia University", "Texas Instruments", "Massachusetts Institute of Technology"], "authors": ["Guner D. Celik.....http://dblp.org/pers/hd/c/Celik:Guner_D=", "Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil", "Wajahat F. Khan.....http://dblp.org/pers/hd/k/Khan:Wajahat_F=", "Eytan Modiano.....http://dblp.org/pers/hd/m/Modiano:Eytan"], "conf": "infocom", "year": "2008", "pages": 9}