{"title": "Social networks and context-aware spam.", "fields": ["click through rate", "malware", "spamming", "email address harvesting", "social spam"], "abstract": "Social networks are popular for online communities. This paper evaluates the risk of sophisticated context-aware spam that could result from information sharing on social networks and discusses potential mitigation strategies. Unlike normal spam, context-aware spam would likely have a high click-through rate due to exploitation of authentic social connections. Context-aware spam could lead to more insidious attacks that try to install malware or steal passwords. In this paper, we analyzed Facebook, a popular social networking website. Our goal was to determine how many users were vulnerable to context-aware attack email and understand aspects of Facebook's design that make such attacks possible. We also classified different kinds of email attacks based on certain pieces of data such as birthdays, lists of friends, wall posts, and user news feeds. We analyzed Facebook starting from a single university e-mail address to calculate the number of users who would be vulnerable to each type of attack. We found that a hacker could send sophisticated context-aware email to approximately 85% of users. Furthermore, our analysis shows that people with private profiles are almost equally vulnerable to a subset of attacks. Finally, we discuss defense strategies. Some strategies would require users to coordinate their privacy policies with each other. We also suggest design improvements for social networks that may help reduce exposure to context-aware attack email.", "citation": "Citations (151)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Garrett Brown.....http://dblp.org/pers/hd/b/Brown:Garrett", "Travis Howe.....http://dblp.org/pers/hd/h/Howe:Travis", "Micheal Ihbe.....http://dblp.org/pers/hd/i/Ihbe:Micheal", "Atul Prakash.....http://dblp.org/pers/hd/p/Prakash:Atul", "Kevin Borders.....http://dblp.org/pers/hd/b/Borders:Kevin"], "conf": "cscw", "year": "2008", "pages": 10}