{"title": "Reachability Games and Game Semantics: Comparing Nondeterministic Programs.", "fields": ["nondeterministic algorithm", "expspace", "finitary", "pspace", "decidability"], "abstract": "We investigate the notions of may- and must-approximation in Erratic Idealized Algol (a nondeterministic extension of Idealized Algol), and give explicit characterizations of both using its game model. Notably, must-approximation is captured by a novel preorder on nondeterministic strategies, whose definition is formulated in terms of winning regions in a reachability game. The game is played on traces of one of the strategies and its objective is reaching a complete position without encountering any divergences. The concrete accounts of may- and must-approximation make it possible to derive tight complexity bounds for the corresponding decision problems in the finitary (finite datatypes) variant EIA f  of Erratic Idealized Algol. In fact we give a complete classification of the complexity of may- and must-approximation for fragments of EIA f  of bounded type order (for terms in beta-normal form). The complexity of the decidable cases ranges from PSPACE to 2-EXPTIME for may-approximation and from EXPSPACE to 3-EXPTIME for must-approximation. Our decidability results rely on a representation theorem for nondeterministic strategies which, for a given term, yields a single (finite or visibly pushdown) automaton capturing both traces and divergences of the corresponding strategy with two distinct sets of final states. The decision procedures producing optimal bounds incorporate numerous automata-theoretic techniques: complementation, determinization, computation of winning regions in reachability games over finite and pushdown graphs as well as product constructions. We see our work as a starting point of research that relates game semantics with other game-based theories.", "citation": "Citations (8)", "departments": ["University of Oxford"], "authors": ["Andrzej S. Murawski.....http://dblp.org/pers/hd/m/Murawski:Andrzej_S="], "conf": "lics", "year": "2008", "pages": 11}