{"title": "Distributed Operator Placement and Data Caching in Large-Scale Sensor Networks.", "fields": ["query optimization", "distributed database", "communication complexity", "tree", "raw data"], "abstract": "Recent advances in computer technology and wireless communications have enabled the emergence of stream-based sensor networks. In such sensor networks, real-time data are generated by a large number of distributed sources. Queries are made that may require sophisticated processing and filtering of the data. A query is represented by a query graph. In order to reduce the data transmission and to better utilize resources, it is desirable to place operators of the query graph inside the network, and thus to perform in-network processing. Moreover, given that various queries occur with different frequencies and that only a subset of sensor data may actually be queried, caching intermediate data objects inside the network can help improve query efficiency. In this paper, we consider the problem of placing both operators and intermediate data objects inside the network for a set of queries so as to minimize the total cost of storage, computation, and data transmission. We propose distributed algorithms that achieve optimal solutions for tree-structured query graph topologies and general network topologies. The algorithms converge in L max (.H Q  + 1) iterations, where L max  is the order of the diameter of the sensor network, and Hq represents the depth of the query graph, defined as the maximum number of operations needed for a raw data to become a final data. For a regular grid network and complete binary tree query graph, the complexity is 0(radic(N)log 2  M), where N is the number of nodes in the sensor network and M is the number of data objects in a query graph. The most attractive features of these algorithms are that they require only information exchanges between neighbors, can be executed asynchronously, are adaptive to cost change and topology change, and are resilient to node or link failures.", "citation": "Citations (69)", "departments": ["Urbana University", "IBM", "University of Massachusetts Amherst", "IBM"], "authors": ["Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei", "Zhen Liu.....http://dblp.org/pers/hd/l/Liu_0001:Zhen", "Donald F. Towsley.....http://dblp.org/pers/hd/t/Towsley:Donald_F=", "Cathy H. Xia.....http://dblp.org/pers/hd/x/Xia:Cathy_H="], "conf": "infocom", "year": "2008", "pages": 9}