{"title": "SRLG Failure Localization in All-Optical Networks Using Monitoring Cycles and Paths.", "fields": ["graph", "graph rewriting", "graph theory", "integer programming", "condition monitoring"], "abstract": "We introduce the concepts of monitoring paths (MPs) and monitoring cycles (MCs) for unique localization of shared risk linked group (SRLG) failures in all-optical networks. An SRLG failure is a failure of multiple links due to a failure of a common resource. MCs (MPs) start and end at same (distinct) monitoring location(s). They are constructed such that any SRLG failure results in the failure of a unique combination of paths and cycles. We derive necessary and sufficient conditions on the set of MCs and MPs needed for localizing an SRLG failure in an arbitrary graph. When a single monitoring location is employed, we show that a network must be (k + 2)-edge connected for localizing all SRLG failures with up to k links. For networks that are less than (k + 2)-edge connected, we derive necessary and sufficient condition on the placement of monitoring locations for unique localization of any SRLG failure of up to k links. We use these conditions to develop an algorithm for the placement of monitoring locations. We show a graph transformation technique that converts the problem of identifying MCs and MPs with multiple monitoring locations to a problem of identifying MCs with single monitoring location. We provide an integer linear program and a heuristic to identify MCs for networks with one monitoring location. Through extensive simulations, we demonstrate the effectiveness of the proposed monitoring technique.", "citation": "Citations (98)", "departments": ["University of Arizona", "University of Arizona", "University of Arizona"], "authors": ["Satyajeet Ahuja.....http://dblp.org/pers/hd/a/Ahuja:Satyajeet", "Srinivasan Ramasubramanian.....http://dblp.org/pers/hd/r/Ramasubramanian:Srinivasan", "Marwan Krunz.....http://dblp.org/pers/hd/k/Krunz:Marwan"], "conf": "infocom", "year": "2008", "pages": 9}