{"title": "Token tenure: PATCHing token counting using directory-based cache coherence.", "fields": ["indirection", "token ring", "cache coherence", "token bus network", "token passing"], "abstract": "Traditional coherence protocols present a set of difficult tradeoffs: the reliance of snoopy protocols on broadcast and ordered interconnects limits their scalability, while directory protocols incur a performance penalty on sharing misses due to indirection. This work introduces PATCH (Predictive/Adaptive Token Counting Hybrid), a coherence protocol that provides the scalability of directory protocols while opportunistically sending direct requests to reduce sharing latency. PATCH extends a standard directory protocol to track tokens and use token counting rules for enforcing coherence permissions. Token counting allows PATCH to support direct requests on an unordered interconnect, while a mechanism called token tenure uses local processor timeouts and the directorypsilas per-block point of ordering at the home node to guarantee forward progress without relying on broadcast. PATCH makes three main contributions. First, PATCH introduces token tenure, which provides broadcast-free forward progress for token counting protocols. Second, PATCH deprioritizes best-effort direct requests to match or exceed the performance of directory protocols without restricting scalability. Finally, PATCH provides greater scalability than directory protocols when using inexact encodings of sharers because only processors holding tokens need to acknowledge requests. Overall, PATCH is a ldquoone-size-fits-allrdquo coherence protocol that dynamically adapts to work well for small systems, large systems, and anywhere in between.", "citation": "Citations (39)", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania"], "authors": ["Arun Raghavan.....http://dblp.org/pers/hd/r/Raghavan:Arun", "Colin Blundell.....http://dblp.org/pers/hd/b/Blundell:Colin", "Milo M. K. Martin.....http://dblp.org/pers/hd/m/Martin:Milo_M=_K="], "conf": "micro", "year": "2008", "pages": 12}