{"title": "Unifying discriminative visual codebook generation with classifier training for object category recognition.", "fields": ["codebook", "contextual image classification", "discriminative model", "bag of words model in computer vision", "visual word"], "abstract": "The idea of representing images using a bag of visual words is currently popular in object category recognition. Since this representation is typically constructed using unsupervised clustering, the resulting visual words may not capture the desired information. Recent work has explored the construction of discriminative visual codebooks that explicitly consider object category information. However, since the codebook generation process is still disconnected from that of classifier training, the set of resulting visual words, while individually discriminative, may not be those best suited for the classifier. This paper proposes a novel optimization framework that unifies codebook generation with classifier training. In our approach, each image feature is encoded by a sequence of ldquovisual bitsrdquo optimized for each category. An image, which can contain objects from multiple categories, is represented using aggregates of visual bits for each category. Classifiers associated with different categories determine how well a given image corresponds to each category. Based on the performance of these classifiers on the training data, we augment the visual words by generating additional bits. The classifiers are then updated to incorporate the new representation. These two phases are repeated until the desired performance is achieved. Experiments compare our approach to standard clustering-based methods and with state-of-the-art discriminative visual codebook generation. The significant improvements over previous techniques clearly demonstrate the value of unifying representation and classification into a single optimization framework.", "citation": "Citations (240)", "year": "2008", "departments": ["Michigan State University", "Michigan State University", "Intel", "French Institute for Research in Computer Science and Automation"], "conf": "cvpr", "authors": ["Liu Yang.....http://dblp.org/pers/hd/y/Yang_0001:Liu", "Rong Jin.....http://dblp.org/pers/hd/j/Jin:Rong", "Rahul Sukthankar.....http://dblp.org/pers/hd/s/Sukthankar:Rahul", "Frédéric Jurie.....http://dblp.org/pers/hd/j/Jurie:Fr=eacute=d=eacute=ric"], "pages": -1}