{"title": "Decodability of group homomorphisms beyond the johnson bound.", "fields": ["list decoding", "homomorphism", "group code", "quotient group", "abelian group", "johnson bound", "order"], "abstract": "Given a pair of finite groups G and H, the set of homomorphisms from G to H form an error-correcting code where codewords differ in at least 1/2 the coordinates. We show that for every pair of  abelian  groups G and H, the resulting code is (locally) list-decodable from a fraction of errors arbitrarily close to its distance. At the heart of this result is the following combinatorial result: There is a fixed polynomial p(•) such that for every pair of abelian groups G and H, if the maximum fraction of agreement between two distinct homomorphisms from G to H is Λ, then for every e> 0 and every function f:G -> H, the number of homomorphisms that have agreement Λ + e with f is at most p(1/e). We thus give a broad class of codes whose list-decoding radius exceeds the \"Johnson bound\". Examples of such codes are rare in the literature, and for the ones that do exist, \"combinatorial\" techniques to analyze their list-decodability are limited. Our work is an attempt to add to the body of such techniques. We use the fact that abelian groups decompose into simpler ones and thus codes derived from homomorphisms over abelian groups may be viewed as certain \"compositions\" of simpler codes. We give techniques to lift list-decoding bounds for the component codes to bounds for the composed code. We believe these techniques may be of general interest.", "citation": "Citations (12)", "year": "2008", "departments": ["Weizmann Institute of Science", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "stoc", "authors": ["Irit Dinur.....http://dblp.org/pers/hd/d/Dinur:Irit", "Elena Grigorescu.....http://dblp.org/pers/hd/g/Grigorescu:Elena", "Swastik Kopparty.....http://dblp.org/pers/hd/k/Kopparty:Swastik", "Madhu Sudan.....http://dblp.org/pers/hd/s/Sudan:Madhu"], "pages": 10}