{"title": "Remote Profiling of Resource Constraints of Web Servers Using Mini-Flash Crowds.", "fields": ["phishing", "crowds", "server farm", "application server", "provisioning"], "abstract": "Unexpected surges in Web request traffic can exercise server-side resources (e.g., access bandwidth, processing, storage etc.) in undesirable ways. Administrators today do not have requisite tools to understand the impact of such \"flash crowds\" on their servers. Most Web servers either rely on over-provisioning and admission control, or use potentially expensive solutions like CDNs, to ensure high availability in the face of flash crowds. A more fine-grained understanding of the performance of individual server resources under emulated but realistic and controlled flash crowd-like conditions can aid administrators to make more efficient resource management decisions. In this paper, we present miniflash crowds (MFC) - a light-weight profiling service that reveals resource bottlenecks in a Web server infrastructure. MFC uses a set of controlled probes where an increasing number of distributed clients make synchronized requests that exercise specific resources or portions of a remote Web server. We carried out controlled lab-based tests and experiments in collaboration with operators of production servers. We show that our approach can faithfully track the impact of request loads on different server resources and provide useful insights to server operators on the constraints of different components of their infrastructure. We also present results from a measurement study of the provisioning of several hundred popular Web servers, a few hundred Web servers of startup companies, and about hundred phishing servers.", "citation": "Citations (9)", "departments": ["University of Wisconsin-Madison", "Carnegie Mellon University", "University of Wisconsin-Madison", "AT&T Labs", "IBM"], "authors": ["Pratap Ramamurthy.....http://dblp.org/pers/hd/r/Ramamurthy:Pratap", "Vyas Sekar.....http://dblp.org/pers/hd/s/Sekar:Vyas", "Aditya Akella.....http://dblp.org/pers/hd/a/Akella:Aditya", "Balachander Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Balachander", "Anees Shaikh.....http://dblp.org/pers/hd/s/Shaikh:Anees"], "conf": "usenix", "year": "2008", "pages": 14}