{"title": "Efficient bulk insertion into a distributed ordered table.", "fields": ["insertion time", "bin packing problem", "small number", "contiguity", "partition"], "abstract": "We study the problem of bulk-inserting records into tables in a system that horizontally range-partitions data over a large cluster of shared-nothing machines. Each table partition contains a contiguous portion of the table's key range, and must accept all records inserted into that range. Examples of such systems include BigTable[8] at Google, and PNUTS [15] at Yahoo! During bulk inserts into an existing table, if most of the inserted records end up going into a small number of data partitions, the obtained throughput may be very poor due to ineffective use of cluster parallelism. We propose a novel approach in which a  planning phase  is invoked before the actual insertions. By creating new partitions and intelligently distributing partitions across machines, the planning phase ensures that the insertion load will be well-balanced. Since there is a tradeoff between the cost of moving partitions and the resulting throughput gain, the planning phase must minimize the sum of partition movement time and insertion time. We show that this problem is a variation of NP-hard bin-packing, reduce it to a problem of packing vectors, and then give a solution with provable approximation guarantees. We evaluate our approach on a prototype system deployed on a cluster of 50 machines, and show that it yields significant improvements over more naive techniques.", "citation": "Citations (62)", "year": "2008", "departments": ["Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!"], "conf": "sigmod", "authors": ["Adam Silberstein.....http://dblp.org/pers/hd/s/Silberstein:Adam", "Brian F. Cooper.....http://dblp.org/pers/hd/c/Cooper:Brian_F=", "Utkarsh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Utkarsh", "Erik Vee.....http://dblp.org/pers/hd/v/Vee:Erik", "Ramana Yerneni.....http://dblp.org/pers/hd/y/Yerneni:Ramana", "Raghu Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Raghu"], "pages": 14}