{"title": "Improving NAND Flash Based Disk Caches.", "fields": ["flash file system", "flash memory controller", "bad sector", "universal memory", "flash memory emulator"], "abstract": "Flash is a widely used storage device that provides high density and low power, appealing properties for general purpose computing. Today, its usual application is in portable special purpose devices such as MP3 players. In this paper we examine its use in the server domain—a more general purpose environment. Aggressive process scaling and the use of multi-level cells continues to improve density ahead of Moore’s Law predictions, making Flash even more attractive as a general purpose memory solution. Unfortunately, reliability limits the use of Flash. To seriously consider Flash in the server domain, architectural support must exist to address this concern. This paper first shows how Flash can be used in today’s server platforms as a disk cache. It then proposes two improvements. The first improves performance and reliability by splitting Flash based disk caches into separate read and write regions. The second improves reliability by employing a programmable Flash memory controller. It can change the error code strength (number of correctable bits) and the number of bits that a memory cell can store (cell density) according to the demands of the application. Our studies show that Flash reduces overall power consumed by the system memory and hard disk drive up to 3 times while maintaining performance. We also show that Flash lifetime can be improved by a factor of 20 when using a programmable Flash memory controller, if some performance degradation (below 5%) is acceptable.", "citation": "Citations (327)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Taeho Kgil.....http://dblp.org/pers/hd/k/Kgil:Taeho", "David Roberts.....http://dblp.org/pers/hd/r/Roberts:David", "Trevor N. Mudge.....http://dblp.org/pers/hd/m/Mudge:Trevor_N="], "conf": "isca", "year": "2008", "pages": 12}