{"title": "On Constructions of Optical Queues with a Limited Number of Recirculations.", "fields": ["integer", "multiplexer", "integer sequence", "fifo", "brute force search"], "abstract": "Recently, there has been a lot of attention on the constructions of optical queues by using optical Switches and fiber Delay Lines (SDL). In this paper, we consider the constructions of optical queues with a limited number of recirculations through the fibers in such SDL constructions. Such a limitation on the number of recirculations comes from practical feasibility considerations, such as crosstalk, power loss, amplified spontaneous emission (ASE) from the Erbium doped fiber amplifiers (EDFA), and the pattern effect of the optical switches. We first transform the design of the fiber delays in such SDL constructions to an equivalent integer representation problem. Specifically, given 1 les k les M, we seek for an M-sequence d M   1  = (d 1 ,d 2 ,...,d m ) of positive integers to maximize the number of consecutive integers (starting from 0) that can be represented by the C-transform relative to d M   1  such that there are at most k 1-entries in their C-transforms. Then we give a class of greedy constructions so that d 1 , d 2 ,..., d M  are obtained recursively and the maximum number of representable consecutive integers by using d 1 ,d 2 ,...,d i  is larger than that by using d 1 ,d 2 ,...,d i-1  for all i. Furthermore, we obtain an explicit recursive expression for d 1 , d 2 ,..., d M  given by a greedy construction. Finally, we show that an optimal M-sequence (in the sense of achieving the maximum number of representable consecutive integers) can be given by a greedy construction. The solution of such an integer representation problem can be applied to the construction of optical 2-to-l FIFO multiplexers with a limited number of recirculations. We show that the complexity of searching for an optimal construction under our routing policy can be greatly reduced from exponential time to polynomial time by only considering the greedy constructions instead of performing an exhaustive search. Similar results can be obtained for linear compressors and linear decompressors with a limited number of recirculations.", "citation": "Citations (16)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Jay Cheng.....http://dblp.org/pers/hd/c/Cheng:Jay", "Cheng-Shang Chang.....http://dblp.org/pers/hd/c/Chang:Cheng=Shang", "Tsz-Hsuan Chao.....http://dblp.org/pers/hd/c/Chao:Tsz=Hsuan", "Duan-Shin Lee.....http://dblp.org/pers/hd/l/Lee:Duan=Shin", "Ching-Ming Lien.....http://dblp.org/pers/hd/l/Lien:Ching=Ming"], "conf": "infocom", "year": "2008", "pages": 9}