{"title": "A Novel Access Method for Supporting Absolute and Proportional Priorities in 802.11 WLANs.", "fields": ["quality of service", "idle", "throughput", "channel", "scalability"], "abstract": "Many researchers have addressed the problem of QoS differentiation in 802.11 wireless networks, however no method proposed so far benefits from all desirable properties: high aggregate throughput even for a large number of contending stations, fair allocation to all stations in the same class, fast adaptation to changing conditions, and support for absolute priorities. If we consider the IEEE 802.11e standard, its EDCA (enhanced distributed channel access) access method suffers from an increased collision rate when the number of stations increases. In this paper, we propose a novel access method that supports both relative proportional throughput allocation and absolute priorities in 802.11 wireless networks. The method is efficient, scalable, and fair. It builds on the idea of the Idle Sense method that provides the optimal throughput and fairness for 802.11 WLANs [1]: each station adjusts its contention window based on the observed average number of idle slots. We achieve absolute priority differentiation by setting the target value for the number of idle slots to a small value, so that the absolute priority class gains all the available throughput. The method also supports relative proportional throughput allocation in which several classes share the available throughput according to desired ratios. Our simulations show that the proposed method achieves its objectives of relative and absolute differentiation both with respect to the aggregated throughput and the speed of convergence. Unlike 802.11e EDCA, it presents very good scalability - the throughput remains almost constant in function of the number of contending stations.", "citation": "Citations (29)", "departments": ["Grenoble Inf. Lab., Grenoble", "Grenoble Inf. Lab., Grenoble", "Grenoble Inf. Lab., Grenoble"], "authors": ["Mohammad Nassiri.....http://dblp.org/pers/hd/n/Nassiri:Mohammad", "Martin Heusse.....http://dblp.org/pers/hd/h/Heusse:Martin", "Andrzej Duda.....http://dblp.org/pers/hd/d/Duda:Andrzej"], "conf": "infocom", "year": "2008", "pages": 9}