{"title": "From SODA to scotch: The evolution of a wireless baseband processor.", "fields": ["baseband processor", "hardware acceleration", "speedup", "datapath", "simd"], "abstract": "With the multitude of existing and upcoming wireless standards, it is becoming increasingly difficult for hardware-only baseband processing solutions to adapt to the rapidly changing wireless communication landscape. Software defined radio (SDR) promises to deliver a cost effective and flexible solution by implementing a wide variety of wireless protocols in software. In previous work, a fully programmable multicore architecture, SODA, was proposed that was able to meet the real-time requirements of 3G wireless protocols. SODA consists of one ARM control processor and four wide single instruction multiple data (SIMD) processing elements. Each processing element consists of a scalar and a wide 512-bit 32-lane SIMD datapath. A commercial prototype based on the SODA architecture, Ardbeg (named after a brand of Scotch whisky), has been developed. In this paper, we present the architectural evolution of going from a research design to a commercial prototype, including the goals, tradeoffs, and final design choices. Ardbegpsilas redesign process can be grouped into the following three major areas: optimizing the wide SIMD datapath, providing long instruction word (LIW) support for SIMD operations, and adding application-specific hardware accelerators. Because SODA was originally designed with 180 nm technology, the wide SIMD datapath is re-optimized in Ardbeg for 90 nm technology. This includes re-evaluating the most efficient SIMD width, designing a wider SIMD shuffle network, and implementing faster SIMD arithmetic units. Ardbeg also provides modest LIW support by allowing two SIMD operations to issue in the same cycle. This LIW execution supports SDR algorithmspsila most common parallel SIMD execution patterns with minimal hardware overhead. A viable commercial SDR solution must be competitive with existing ASIC solutions. Therefore, algorithm-specific hardware is added for performance bottleneck algorithms while still maintaining enough flexibility to support multiple wireless protocols. The combination of these architectural improvements allows Ardbeg to achieve 1.5-7x speedup over SODA across multiple wireless algorithms while consuming less power.", "citation": "Citations (113)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Mark Woh.....http://dblp.org/pers/hd/w/Woh:Mark", "Yuan Lin.....http://dblp.org/pers/hd/l/Lin_0002:Yuan", "Sangwon Seo.....http://dblp.org/pers/hd/s/Seo:Sangwon", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A=", "Trevor N. Mudge.....http://dblp.org/pers/hd/m/Mudge:Trevor_N=", "Chaitali Chakrabarti.....http://dblp.org/pers/hd/c/Chakrabarti:Chaitali", "Richard Bruce.....http://dblp.org/pers/hd/b/Bruce:Richard", "Danny Kershaw.....http://dblp.org/pers/hd/k/Kershaw:Danny", "Alastair Reid.....http://dblp.org/pers/hd/r/Reid:Alastair", "Mladen Wilder.....http://dblp.org/pers/hd/w/Wilder:Mladen", "Krisztián Flautner.....http://dblp.org/pers/hd/f/Flautner:Kriszti=aacute=n"], "conf": "micro", "year": "2008", "pages": 12}