{"title": "Finding frequent items in probabilistic data.", "fields": ["relational model", "uncertain data", "probabilistic database", "probabilistic logic", "ranking"], "abstract": "Computing statistical information on probabilistic data has attracted a lot of attention recently, as the data generated from a wide range of data sources are inherently fuzzy or uncertain. In this paper, we study an important statistical query on probabilistic data: finding the frequent items. One straightforward approach to identify the frequent items in a probabilistic data set is to simply compute the expected frequency of an item and decide if it exceeds a certain fraction of the expected size of the whole data set. However, this simple definition misses important information about the internal structure of the probabilistic data and the interplay among all the uncertain entities. Thus, we propose a new definition based on the  possible world semantics  that has been widely adopted for many query types in uncertain data management, trying to find all the items that are likely to be frequent in a randomly generated possible world. Our approach naturally leads to the study of ranking frequent items based on confidence as well.   Finding likely frequent items in probabilistic data turns out to be much more difficult. We first propose exact algorithms for offline data with either quadratic or cubic time. Next, we design novel sampling-based algorithms for streaming data to find all approximately likely frequent items with theoretically guaranteed high probability and accuracy. Our sampling schemes consume sublinear memory and exhibit excellent scalability. Finally, we verify the effectiveness and efficiency of our algorithms using both real and synthetic data sets with extensive experimental evaluations.", "citation": "Citations (231)", "year": "2008", "departments": ["Hong Kong University of Science and Technology", "Florida State University", "Hong Kong University of Science and Technology"], "conf": "sigmod", "authors": ["Qin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qin", "Feifei Li.....http://dblp.org/pers/hd/l/Li_0001:Feifei", "Ke Yi.....http://dblp.org/pers/hd/y/Yi:Ke"], "pages": 14}