{"title": "Entangled Games are Hard to Approximate.", "fields": ["soundness", "quantum entanglement", "combinatorics", "hardness of approximation", "no communication theorem", "quantum discord", "pspace", "interactive proof system", "discrete mathematics", "quantum", "approximation algorithm", "quantum network", "quantum pseudo telepathy", "one way quantum computer"], "abstract": "We establish the first hardness results for the problem of computing the value of one-round games played by a referee and a team of players who can share quantum entanglement. In particular, we show that it is NP-hard to approximate within an inverse polynomial the value of a one-round game with (i) quantum referee and two entangled players or (ii) classical referee and three entangled players. Previously it was not even known if computing the value exactly is NP-hard. We also describe a mathematical conjecture, which, if true, would imply hardness of approximation to within a constant.We start our proof by describing two ways to modify classical multi-player games to make them resistant to entangled players. We then show that a strategy for the modified game that uses entanglement can be \"rounded'' to one that does not. The results then follow from classical inapproximability bounds. Our work implies that, unless P = NP, the values of entangled-player games cannot be computed by semidefinite programs that are polynomial in the size of the referee's system, a method that has been successful for more restricted quantum games.", "citation": "Not cited", "departments": ["Tel Aviv University", "University of California, Berkeley", "University of California, Berkeley", "Principles of I ...  of Inf., Tokyo", "Principles of I ...  of Inf., Tokyo", "CWI, Amsterdam", "kempe@post.tau.ac.il", "hirotada@nii.ac ... eiji@nii.ac.jp", "bentoner@bentoner.com"], "authors": ["Julia Kempe.....http://dblp.org/pers/hd/k/Kempe:Julia", "Hirotada Kobayashi.....http://dblp.org/pers/hd/k/Kobayashi:Hirotada", "Keiji Matsumoto.....http://dblp.org/pers/hd/m/Matsumoto:Keiji", "Ben Toner.....http://dblp.org/pers/hd/t/Toner:Ben", "Thomas Vidick.....http://dblp.org/pers/hd/v/Vidick:Thomas"], "conf": "focs", "year": "2008", "pages": 10}