{"title": "Automatic Profiling of Network Event Sequences: Algorithm and Applications.", "fields": ["network management", "traffic analysis", "profiling", "network monitoring", "network management application"], "abstract": "The behavior of network entities, such as flows, sessions, hosts, and users, can often be described by communication event sequences in the time domain. For the purpose of many network measurement and monitoring tasks, it is desirable to have an accurate yet information-compact profiling of the behavior of massive event sequences. This paper proposes a new method to achieve this goal. On a given set of event sequences, the proposed method automatically learns a mixture model which fully captures the sequence behavior including both event pattern and duration between events. The learned mixture model is information-compact as it classifies sequences into a set of behavior templates, each of which is described by a Markov Chain. The model parameters are estimated in an iterative procedure which is developed from the Expectation Maximization algorithm. Two network management applications are proposed based on the method: a visualization tool for network administrators to conduct exploratory traffic analysis, and an efficient anomaly detection mechanism. In the evaluation, we validate the method accuracy as well as the usefulness of the two applications by using three networking datasets with different types: TCP packet traces, VoIP calls, and syslog traces in wireless networks.", "citation": "Citations (10)", "departments": ["Princeton University", "Princeton University", "Princeton University", "Princeton University", "Princeton University"], "authors": ["Xiaoqiao Meng.....http://dblp.org/pers/hd/m/Meng:Xiaoqiao", "Guofei Jiang.....http://dblp.org/pers/hd/j/Jiang:Guofei", "Hui Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Hui", "Haifeng Chen.....http://dblp.org/pers/hd/c/Chen:Haifeng", "Kenji Yoshihira.....http://dblp.org/pers/hd/y/Yoshihira:Kenji"], "conf": "infocom", "year": "2008", "pages": 5}