{"title": "Incremental Latent Semantic Indexing for Automatic Traceability Link Evolution Management.", "fields": ["goal driven software development process", "verification and validation", "resource oriented architecture", "software sizing", "package development process"], "abstract": "Maintaining traceability links among software artifacts is particularly important for many software engineering tasks. Even though automatic traceability link recovery tools are successful in identifying the semantic connections among software artifacts produced during software development, no existing traceability link management approach can effectively and automatically deal with software evolution. We propose a technique to automatically manage traceability link evolution and update the links in evolving software. Our novel technique, called incremental latent semantic indexing (iLSI), allows for the fast and low-cost LSI computation for the update of traceability links by analyzing the changes to software artifacts and by reusing the result from the previous LSI computation before the changes. We present our iLSI technique, and describe a complete automatic traceability link evolution management tool, TLEM, that is capable of interactively and quickly updating traceability links in the presence of evolving software artifacts. We report on our empirical evaluation with various experimental studies to assess the performance and usefulness of our approach.", "citation": "Citations (55)", "departments": ["Iowa State University", "Iowa State University", "Yuan Ze University", "Iowa State University", "Iowa State University"], "authors": ["Hsinyi Jiang.....http://dblp.org/pers/hd/j/Jiang:Hsinyi", "Tien N. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tien_N=", "Ing-Xiang Chen.....http://dblp.org/pers/hd/c/Chen:Ing=Xiang", "Hojun Jaygarl.....http://dblp.org/pers/hd/j/Jaygarl:Hojun", "Carl K. Chang.....http://dblp.org/pers/hd/c/Chang:Carl_K="], "conf": "kbse", "year": "2008", "pages": 10}