{"title": "Feasible Rate Allocation in Wireless Networks.", "fields": ["bounded function", "feasible region", "time complexity", "polynomial time approximation scheme", "network topology"], "abstract": "Rate allocation is a fundamental problem in the operation of a wireless network because of the necessity to schedule the operation of mutually interfering links between the nodes. Among the many reasons behind the importance of efficiently determining the membership of an arbitrary rate vector in the feasibility region, is its high relevance in optimal cross layer design. A key feature in a wireless network is that links without common nodes can also conflict (secondary interference constraints). While the node exclusive model problem has efficient algorithms, it has long been known that this is a hard problem with these additional secondary constraints. However, wireless networks are usually deployed in geographic areas that do not span the most general class of all graphs possible. This is the underlying theme of this paper, where we provide algorithms for two restricted instances of wireless network topologies. In the first tractable instance, we consider nodes placed arbitrarily in a region such that (a) the node density is bounded, and (b) a node can only transmit or interfere with other nodes that are within a certain limited radius. We obtain a simple (1 - epsi) polynomial-time approximation scheme for checking feasibility (for any epsi > 0). The second instance considers the membership problem of an arbitrary rate-vector in the feasible set, where the nodes are distributed within a slab of fixed width (there are no density assumptions). Specifically, the results in [13] are shown to extend to a much more general class of graphs, which we call the (d min ,d max ) class of graphs, and this generalization is used to obtain a strongly polynomial time algorithm that decides membership of a rate-vector where the hosts are distributed within an infinite corridor with fixed cross-section.", "citation": "Citations (8)", "departments": ["University of Illinois at Urbana–Champaign", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "University of Illinois at Urbana–Champaign"], "authors": ["Ramakrishna Gummadi.....http://dblp.org/pers/hd/g/Gummadi:Ramakrishna", "Kyomin Jung.....http://dblp.org/pers/hd/j/Jung:Kyomin", "Devavrat Shah.....http://dblp.org/pers/hd/s/Shah:Devavrat", "Ramavarapu S. Sreenivas.....http://dblp.org/pers/hd/s/Sreenivas:Ramavarapu_S="], "conf": "infocom", "year": "2008", "pages": 9}