{"title": "Trust-based recommendation systems: an axiomatic approach.", "fields": ["reputation system", "axiomatic system", "axiom", "social choice theory", "computational trust"], "abstract": "High-quality, personalized recommendations are a key feature in many online systems. Since these systems often have explicit knowledge of social network structures, the recommendations may incorporate this information. This paper focuses on networks that represent trust and recommendation systems that incorporate these trust relationships. The goal of a trust-based recommendation system is to generate personalized recommendations by aggregating the opinions of other users in the trust network.   In analogy to prior work on voting and ranking systems, we use the axiomatic approach from the theory of social choice. We develop a set of five natural axioms that a trust-based recommendation system might be expected to satisfy. Then, we show that no system can simultaneously satisfy all the axioms. However, for any subset of four of the five axioms we exhibit a recommendation system that satisfies those axioms. Next we consider various ways of weakening the axioms, one of which leads to a unique recommendation system based on random walks. We consider other recommendation systems, including systems based on personalized PageRank, majority of majorities, and minimum cuts, and search for alternative axiomatizations that uniquely characterize these systems.   Finally, we determine which of these systems are incentive compatible, meaning that groups of agents interested in manipulating recommendations can not induce others to share their opinion by lying about their votes or modifying their trust links. This is an important property for systems deployed in a monetized environment.", "citation": "Citations (229)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Weizmann Institute of Science", "Microsoft"], "authors": ["Reid Andersen.....http://dblp.org/pers/hd/a/Andersen:Reid", "Christian Borgs.....http://dblp.org/pers/hd/b/Borgs:Christian", "Jennifer T. Chayes.....http://dblp.org/pers/hd/c/Chayes:Jennifer_T=", "Uriel Feige.....http://dblp.org/pers/hd/f/Feige:Uriel", "Abraham D. Flaxman.....http://dblp.org/pers/hd/f/Flaxman:Abraham_D=", "Adam Kalai.....http://dblp.org/pers/hd/k/Kalai:Adam", "Vahab S. Mirrokni.....http://dblp.org/pers/hd/m/Mirrokni:Vahab_S=", "Moshe Tennenholtz.....http://dblp.org/pers/hd/t/Tennenholtz:Moshe"], "conf": "www", "year": "2008", "pages": 10}