{"title": "Distributed Spatial Anomaly Detection.", "fields": ["operator", "set estimation", "probabilistic logic", "parametric statistics", "false discovery rate"], "abstract": "Detection of traffic anomalies is an important problem that has been the focus of considerable research. Recent work has shown the utility of spatial detection of anomalies via crosslink traffic comparisons. In this paper we identify three advances that are needed to make such methods more useful and practical for network operators. First, anomaly detection methods should avoid global communication and centralized decision making. Second, nonparametric anomaly detection methods are needed to augment current parametric approaches. And finally, such methods should not just identify possible anomalies, but should also annotate each detection with some probabilistic qualifier of its importance. We propose a framework that simultaneously advances the current state of the art on all three fronts. We show that routers can effectively identify volume anomalies through crosslink comparison of traffic observed only on the router's own links. Second, we show that generalized quantile estimators are an effective way to identify high-dimensional sets of local traffic patterns that are potentially anomalous; such methods can be either parametric or nonparametric, and we evaluate both. Third, through the use of false discovery rate as a detection metric, we show that candidate anomalous patterns can be equipped with an estimate of a probability that they truly are anomalous. Overall, our framework provides network operators with an anomaly detection methodology that is distributed, effective, and easily interpretable. Part of the underlying statistical framework, which merges aspects of nonparametric set estimation and multiple hypothesis testing, is novel in itself, although the derivation of that framework is necessarily given elsewhere.", "citation": "Citations (77)", "departments": ["Boston University", "University of Michigan", "Boston University", "Boston University"], "authors": ["Parminder Chhabra.....http://dblp.org/pers/hd/c/Chhabra:Parminder", "Clayton D. Scott.....http://dblp.org/pers/hd/s/Scott:Clayton_D=", "Eric D. Kolaczyk.....http://dblp.org/pers/hd/k/Kolaczyk:Eric_D=", "Mark Crovella.....http://dblp.org/pers/hd/c/Crovella:Mark"], "conf": "infocom", "year": "2008", "pages": 9}