{"title": "Robust lower bounds for communication and stream computation.", "fields": ["hamming distance", "distributed computing", "combinatorics", "quantile", "pointer jumping", "data stream mining", "mathematics", "communication complexity", "computation", "discrete mathematics", "upper and lower bounds", "evaluation function", "theoretical computer science"], "abstract": "We study the communication complexity of evaluating functions when the input data is randomly allocated (according to some known distribution) amongst two or more players, possibly with information overlap. This naturally extends previously studied variable partition models such as the best-case and worst-case partition models [32,29]. We aim to understand whether the hardness of a communication problem holds for almost every allocation of the input, as opposed to holding for perhaps just a few atypical partitions.   A key application is to the heavily studied data stream model. There is a strong connection between our communication lower bounds and lower bounds in the data stream model that are \"robust\" to the ordering of the data. That is, we prove lower bounds for when the order of the items in the stream is chosen not adversarially but rather uniformly (or near-uniformly) from the set of all permuations. This random-order data stream model has attracted recent interest, since lower bounds here give stronger evidence for the inherent hardness of streaming problems. Our results include the first random-partition communication lower bounds for problems including multi-party set disjointness and gap-Hamming-distance. Both are tight. We also extend and improve previous results [19,7] for a form of pointer jumping that is relevant to the problem of selection (in particular, median finding). Collectively, these results yield lower bounds for a variety of problems in the random-order data stream model, including estimating the number of distinct elements, approximating frequency moments, and quantile estimation.", "citation": "Not cited", "year": "2008", "departments": ["Dartmouth College", "AT&T Labs", "University of California, San Diego"], "conf": "stoc", "authors": ["Amit Chakrabarti.....http://dblp.org/pers/hd/c/Chakrabarti:Amit", "Graham Cormode.....http://dblp.org/pers/hd/c/Cormode:Graham", "Andrew McGregor.....http://dblp.org/pers/hd/m/McGregor_0001:Andrew"], "pages": 10}