{"title": "On the Performance of IEEE 802.11 under Jamming.", "fields": ["qualnet", "universal software radio peripheral", "ieee 802 11", "jamming", "throughput"], "abstract": "In this paper, we study the performance of the IEEE 802.11 MAC protocol under a range of jammers that covers both channel-oblivious and channel-aware jamming. We study two channel-oblivious jammers: a periodic jammer that jams deterministically at a specified rate, and a memoryless jammer whose signals arrive according to a Poisson process. We also develop new models for channel-aware jamming, including a reactive jammer that only jams non-colliding transmissions and an omniscient jammer that optimally adjusts its strategy according to current states of the participating nodes. Our study comprises of a theoretical analysis of the saturation throughput of 802.11 under jamming, an extensive simulation study, and a testbed to conduct real world experimentation of jamming IEEE 802.11 using GNU Radio and USRP platform. In our theoretical analysis, we use a discrete-time Markov chain analysis to derive formulae for the saturation throughput of IEEE 802.11 under memoryless, reactive and omniscient jamming. One of our key results is a characterization of optimal omniscient jamming that establishes a lower bound on the saturation throughput of 802.11 under arbitrary jammer attacks. We validate the theoretical analysis by means of Qualnet simulations. Finally, we measure the real-world performance of periodic and memoryless jammers using our GNU radio jammer prototype.", "citation": "Citations (214)", "departments": ["Northeastern University", "Northeastern University", "Northeastern University", "Northeastern University", "Northeastern University"], "authors": ["Emrah Bayraktaroglu.....http://dblp.org/pers/hd/b/Bayraktaroglu:Emrah", "Christopher King.....http://dblp.org/pers/hd/k/King:Christopher", "Xin Liu.....http://dblp.org/pers/hd/l/Liu:Xin", "Guevara Noubir.....http://dblp.org/pers/hd/n/Noubir:Guevara", "Rajmohan Rajaraman.....http://dblp.org/pers/hd/r/Rajaraman:Rajmohan", "Bishal Thapa.....http://dblp.org/pers/hd/t/Thapa:Bishal"], "conf": "infocom", "year": "2008", "pages": 9}