{"title": "Attention-driven action retrieval with DTW-based 3d descriptor matching.", "fields": ["dynamic time warping", "salience", "visual perception", "soap", "video content analysis"], "abstract": "From visual perception viewpoint, actions in videos can capture high-level semantics for video content understanding and retrieval. However, action-level video retrieval meets great challenges, due to the interferences from global motions or concurrent actions, and the difficulties in robust action describing and matching. This paper presents a content-based action retrieval framework to enable effective search of near-duplicated actions in large-scale video database. Firstly, we present an attention shift model to distill and partition human-concerned saliency actions from global motions and concurrent actions. Secondly, to characterize each saliency action, we extract 3D-SIFT descriptor within its spatial-temporal region, which is robust against rotation, scale, and view point variances. Finally, action similarity is measured using Dynamic Time Warping (DTW) distance to offer tolerance for action duration variance and partial motion missing. Search efficiency in large-scale dataset is achieved by hierarchical descriptor indexing and approximate nearest-neighbor search. In validation, we present a prototype system VILAR to facilitate action search within \"Friends\" soap operas with excellent accuracy, efficiency, and human perception revealing ability.", "citation": "Citations (6)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology"], "authors": ["Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Xiaoshuai Sun.....http://dblp.org/pers/hd/s/Sun:Xiaoshuai", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Pengfei Xu.....http://dblp.org/pers/hd/x/Xu:Pengfei", "Tianqiang Liu.....http://dblp.org/pers/hd/l/Liu:Tianqiang", "Xianming Liu.....http://dblp.org/pers/hd/l/Liu:Xianming"], "conf": "mm", "year": "2008", "pages": 4}