{"title": "Optimization on a Budget: A Reinforcement Learning Approach.", "fields": ["heuristic", "controller", "reinforcement learning", "video tracking", "levenberg marquardt algorithm"], "abstract": "Many popular optimization algorithms, like the Levenberg-Marquardt algorithm (LMA), use heuristic-based \"controllers\" that modulate the behavior of the optimizer during the optimization process. For example, in the LMA a damping parameter λ is dynamically modified based on a set of rules that were developed using heuristic arguments. Reinforcement learning (RL) is a machine learning approach to learn optimal controllers from examples and thus is an obvious candidate to improve the heuristic-based controllers implicit in the most popular and heavily used optimization algorithms.\n\nImproving the performance of off-the-shelf optimizers is particularly important for time-constrained optimization problems. For example the LMA algorithm has become popular for many real-time computer vision problems, including object tracking from video, where only a small amount of time can be allocated to the optimizer on each incoming video frame.\n\nHere we show that a popular modern reinforcement learning technique using a very simple state space can dramatically improve the performance of general purpose optimizers, like the LMA. Surprisingly the controllers learned for a particular domain also work well in very different optimization domains. For example we used RL methods to train a new controller for the damping parameter of the LMA. This controller was trained on a collection of classic, relatively small, non-linear regression problems. The modified LMA performed better than the standard LMA on these problems. This controller also dramatically outperformed the standard LMA on a difficult computer vision problem for which it had not been trained. Thus the controller appeared to have extracted control rules that were not just domain specific but generalized across a range of optimization domains.", "citation": "Citations (5)", "year": "2008", "departments": ["University of California, San Diego", "University of Texas at Austin", "University of California, San Diego"], "conf": "nips", "authors": ["Paul Ruvolo.....http://dblp.org/pers/hd/r/Ruvolo:Paul", "Ian R. Fasel.....http://dblp.org/pers/hd/f/Fasel:Ian_R=", "Javier R. Movellan.....http://dblp.org/pers/hd/m/Movellan:Javier_R="], "pages": 8}