{"title": "Using assertions to help end-user programmers create dependable web macros.", "fields": ["macro", "web modeling", "programming by demonstration", "assertion", "software development process"], "abstract": "Web macros give web browser users ways to \"program\" tedious tasks, allowing those tasks to be repeated more quickly and reliably than when performed by hand. Web macros face dependability problems of their own, however: changes in websites or failure on the part of end-user programmers to anticipate possible macro behaviors can cause macros to act incorrectly, often in ways that are difficult to detect. We would like to provide at least some of the benefits of software engineering methodologies to the creators of web macros. To do this we adapt assertions to web-macro programming scenarios. While assertions are well-known to professional software engineers, our web macro assertions are unique in their focus on website evolution, are generated automatically, and encode the expectations and assumptions of a rapidly growing group of users who often have limited formal programming expertise. We have integrated our techniques for assertion generation and evaluation into a web macro tool, and performed an empirical study investigating its use. Our results show that the assertions can help web macro users detect macro failures and correct macro faults.", "citation": "Citations (25)", "departments": ["University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "Carnegie Mellon University"], "authors": ["Andhy Koesnandar.....http://dblp.org/pers/hd/k/Koesnandar:Andhy", "Sebastian G. Elbaum.....http://dblp.org/pers/hd/e/Elbaum:Sebastian_G=", "Gregg Rothermel.....http://dblp.org/pers/hd/r/Rothermel:Gregg", "Lorin Hochstein.....http://dblp.org/pers/hd/h/Hochstein:Lorin", "Christopher Scaffidi.....http://dblp.org/pers/hd/s/Scaffidi:Christopher", "Kathryn T. Stolee.....http://dblp.org/pers/hd/s/Stolee:Kathryn_T="], "conf": "sigsoft", "year": "2008", "pages": 11}