{"title": "Continuous Network Coding in Wireless Relay Networks.", "fields": ["link adaptation", "radio resource management", "linear network coding", "cooperative diversity", "key distribution in wireless sensor networks"], "abstract": "Network coding has recently been applied to wireless networks and has achieved some initial success. Researches in wireless network coding have been mostly focusing on utilizing the broadcast nature of the wireless networks. In this paper, we propose a novel network coding framework for wireless relay networks that also takes into consideration the fading and error prone nature of the wireless networks. First, we extend the traditional network coding in lossless networks which operates on 0-1 bits, to a new framework which defines network coding on the posterior probability of each bit. This new framework allows an imperfect decode-recode process at a relay node and avoids possible error propagation when a hard decision is made at the relay node. It implicitly integrates decode-and-forward and estimate-and-forward strategies for wireless network coding to address the technical issues of channel fading and transmission errors. The proposed approach is validated through both theoretical analysis and extensive simulations. Both analysis and simulation confirm that this new framework is able to achieve significant gain over traditional network coding. This new framework also enables the introduction of adaptive scheme into network coding. We demonstrate a basic adaptation scheme and present some preliminary experimental results. The proposed adaptive scheme will lay down an essential foundation in this emerging field of wireless network coding in order to address issues related to link heterogeneity.", "citation": "Citations (51)", "departments": ["University of Science and Technology, Sana'a", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Wei Pu.....http://dblp.org/pers/hd/p/Pu:Wei", "Chong Luo.....http://dblp.org/pers/hd/l/Luo:Chong", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "conf": "infocom", "year": "2008", "pages": 9}