{"title": "Maximal Recovery Network Coding under Topology Constraint.", "fields": ["low density parity check code", "systematic code", "variable length code", "data recovery", "linear network coding", "fountain code"], "abstract": "Network coding (NC) within wireless sensor networks (WSNs) can be viewed as the mapping of efficient channel codes to the data generated within the network. In particular, this perspective of code-on-network-graphs (CNG) can be exploited to map source data generated within WSN (of size K) to a variable nodes subset in low-density parity check (LDPC) codes. The resulting fixed size symbol stream when transmitted through the network suffers erasures. At sink, an average of  z  source symbols can be recovered by employing belief propagation decoding. In this paper, we determine CNG code ensembles that achieve maximal recovery (z/K) for different erasure rates and network topological constraints corresponding to node transmission range. An analytic framework to predict code performance under transmission range constraints is developed. Additionally, necessary condition for code stability was derived using fixed-point stability analysis. Optimal solutions for a WSN with 1000 nodes are determined using differential evolution algorithm. We outline a distributed algorithm for generating a sequence of encoded symbols adhering to the designed code ensemble. The performance of the designed CNG code is demonstrated to be superior to random NC and growth code based ensembles, as well as resilient to network size and inter-connectivity variations.", "citation": "Citations (1)", "departments": ["Michigan State University", "Michigan State University", "Michigan State University", "Michigan State University", "Adv. Video & Di ...  Camas, WA, USA", "Tata Res. Dev.  ... re, Pune, India"], "authors": ["Kiran Misra.....http://dblp.org/pers/hd/m/Misra:Kiran", "Shirish S. Karande.....http://dblp.org/pers/hd/k/Karande:Shirish_S=", "Hayder Radha.....http://dblp.org/pers/hd/r/Radha:Hayder"], "conf": "infocom", "year": "2008", "pages": 9}