{"title": "Social signal processing: state-of-the-art and future perspectives of an emerging domain.", "fields": ["social computing", "social cognition", "spite", "social competence", "social intelligence", "human intelligence", "laughter", "social consciousness", "human centered computing"], "abstract": "The ability to understand and manage social signals of a person we are communicating with is the core of social intelligence. Social intelligence is a facet of human intelligence that has been argued to be indispensable and perhaps the most important for success in life. This paper argues that next-generation computing needs to include the essence of social intelligence - the ability to recognize human social signals and social behaviours like politeness, and disagreement - in order to become more effective and more efficient. Although each one of us understands the importance of social signals in everyday life situations, and in spite of recent advances in machine analysis of relevant behavioural cues like blinks, smiles, crossed arms, laughter, and similar, design and development of automated systems for Social Signal Processing (SSP) are rather difficult. This paper surveys the past efforts in solving these problems by a computer, it summarizes the relevant findings in social psychology, and it proposes a set of recommendations for enabling the development of the next generation of socially-aware computing.", "citation": "Not cited", "departments": ["École Polytechnique Fédérale de Lausanne", "Imperial College London", "École Polytechnique Fédérale de Lausanne", "Massachusetts Institute of Technology", "Idiap Research Institute", "Imperial College London", "Idiap Research Institute", "Massachusetts Institute of Technology"], "authors": ["Alessandro Vinciarelli.....http://dblp.org/pers/hd/v/Vinciarelli:Alessandro", "Maja Pantic.....http://dblp.org/pers/hd/p/Pantic:Maja", "Hervé Bourlard.....http://dblp.org/pers/hd/b/Bourlard:Herv=eacute=", "Alex Pentland.....http://dblp.org/pers/hd/p/Pentland:Alex"], "conf": "mm", "year": "2008", "pages": 10}