{"title": "Experience in using a process language to define scientific workflow and generate dataset provenance.", "fields": ["documentation", "graph", "metadata", "data management", "workflow"], "abstract": "This paper describes our experiences in exploring the applicability of software engineering approaches to scientific data management problems. Specifically, this paper describes how process definition languages can be used to expedite production of scientific datasets as well as to generate documentation of their provenance. Our approach uses a process definition language that incorporates powerful semantics to encode scientific processes in the form of a Process Definition Graph (PDG). The paper describes how execution of the PDG-defined process can generate Dataset Derivation Graphs (DDGs), metadata that document how the scientific process developed each of its product datasets. The paper uses an example to show that scientific processes may be complex and to illustrate why some of the more powerful semantic features of the process definition language are useful in supporting clarity and conciseness in representing such processes. This work is similar in goals to work generally referred to as Scientific Workflow. The paper demonstrates the contribution that software engineering can make to this domain.", "citation": "Citations (24)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "Harvard University", "Texas State University", "University of Massachusetts Amherst"], "authors": ["Leon J. Osterweil.....http://dblp.org/pers/hd/o/Osterweil:Leon_J=", "Lori A. Clarke.....http://dblp.org/pers/hd/c/Clarke:Lori_A=", "Aaron M. Ellison.....http://dblp.org/pers/hd/e/Ellison:Aaron_M=", "Rodion M. Podorozhny.....http://dblp.org/pers/hd/p/Podorozhny:Rodion_M=", "Alexander E. Wise.....http://dblp.org/pers/hd/w/Wise:Alexander_E=", "Emery R. Boose.....http://dblp.org/pers/hd/b/Boose:Emery_R=", "Julian L. Hadley.....http://dblp.org/pers/hd/h/Hadley:Julian_L="], "conf": "sigsoft", "year": "2008", "pages": 11}