{"title": "ALPACAS: A Large-Scale Privacy-Aware Collaborative Anti-Spam System.", "fields": ["collaborative software", "internet privacy", "cryptography", "information privacy", "scalability"], "abstract": "While the concept of collaboration provides a natural defense against massive spam emails directed at large numbers of recipients, designing effective collaborative anti-spam systems raises several important research challenges. First and foremost, since emails may contain confidential information, any collaborative anti-spam approach has to guarantee strong privacy protection to the participating entities. Second, the continuously evolving nature of spam demands the collaborative techniques to be resilient to various kinds of camouflage attacks. Third, the collaboration has to be lightweight, efficient, and scalable. Towards addressing these challenges, this paper presents ALPACAS - a privacy-aware framework for collaborative spam filtering. In designing the ALPACAS framework, we make two unique contributions. The first is a feature-preserving message transformation technique that is highly resilient against the latest kinds of spam attacks. The second is a privacy-preserving protocol that provides enhanced privacy guarantees to the participating entities. Our experimental results conducted on a real email dataset shows that the proposed framework provides a 10 fold improvement in the false negative rate over the Bayesian-based Bogofilter when faced with one of the recent kinds of spam attacks. Further, the privacy breaches are extremely rare. This demonstrates the strong privacy protection provided by the ALPACAS system.", "citation": "Citations (17)", "departments": ["University of Georgia", "University of Georgia", "Secure Comput.  ...  Alpharetta, GA"], "authors": ["Zhenyu Zhong.....http://dblp.org/pers/hd/z/Zhong:Zhenyu", "Lakshmish Ramaswamy.....http://dblp.org/pers/hd/r/Ramaswamy:Lakshmish", "Kang Li.....http://dblp.org/pers/hd/l/Li_0001:Kang"], "conf": "infocom", "year": "2008", "pages": 9}