{"title": "Model checking transactional memories.", "fields": ["software transactional memory", "transactional memory", "liveness", "nondeterministic algorithm", "optimistic concurrency control", "serializability"], "abstract": "Model checking transactional memories (TMs) is difficult because of the unbounded number, length, and delay of concurrent transactions, as well as the unbounded size of the memory. We show that, under certain conditions satisfied by most TMs we know of, the model checking problem can be reduced to a finite-state problem, and we illustrate the use of the method by proving the correctness of several TMs, including two-phase locking, DSTM, and TL2. The safety properties we consider include strict serializability and opacity; the liveness properties include obstruction freedom, livelock freedom, and wait freedom. Our main contribution lies in the structure of the proofs, which are largely automated and not restricted to the TMs mentioned above. In a first step we show that every TM that enjoys certain structural properties either violates a requirement on some program with two threads and two shared variables, or satisfies the requirement on all programs. In the second step, we use a model checker to prove the requirement for the TM applied to a most general program with two threads and two variables. In the safety case, the model checker checks language inclusion between two finite-state transition systems, a nondeterministic transition system representing the given TM applied to a most general program, and a deterministic transition system representing a most liberal safe TM applied to the same program. The given TM transition system is nondeterministic because a TM can be used with different contention managers, which resolve conflicts differently. In the liveness case, the model checker analyzes fairness conditions on the given TM transition system.", "citation": "Citations (85)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Rachid Guerraoui.....http://dblp.org/pers/hd/g/Guerraoui:Rachid", "Thomas A. Henzinger.....http://dblp.org/pers/hd/h/Henzinger:Thomas_A=", "Barbara Jobstmann.....http://dblp.org/pers/hd/j/Jobstmann:Barbara", "Vasu Singh.....http://dblp.org/pers/hd/s/Singh:Vasu"], "conf": "pldi", "year": "2008", "pages": 11}