{"title": "Localization and mapping of surveillance cameras in city map.", "fields": ["computer vision", "city map", "computer graphics images", "camera auto calibration", "artificial intelligence"], "abstract": "Many large cities have installed surveillance cameras to monitor human activities for security purposes. An important surveillance application is to track the motion of an object of interest, e.g., a car or a human, using one or more cameras, and plot the motion path in a city map. To achieve this goal, it is necessary to localize the cameras in the city map and to determine the correspondence mappings between the positions in the city map and the camera views. Since the view of the city map is roughly orthogonal to the camera views, there are very few common features between the two views for a computer vision algorithm to correctly identify corresponding points automatically. This paper proposes a method for camera localization and position mapping that requires minimum user inputs. Given approximate corresponding points between the city map and a camera view identified by a user, the method computes the orientation and position of the camera in the city map, and determines the mapping between the positions in the city map and the camera view. Both quantitative tests and practical application test have been performed. It can obtain the best-fit solutions even though the user-specified correspondence is inaccurate. The performance of the method is assessed in both quantitative tests and practical application. Quantitative test results show that the method is accurate and robust in camera localization and position mapping. Application test results are very encouraging, showing the usefulness of the method in real applications.", "citation": "Citations (4)", "departments": ["National University of Singapore", "Takming University of Science and Technology", "National Taiwan University"], "authors": ["Wee Kheng Leow.....http://dblp.org/pers/hd/l/Leow:Wee_Kheng", "Cheng-Chieh Chiang.....http://dblp.org/pers/hd/c/Chiang:Cheng=Chieh", "Yi-Ping Hung.....http://dblp.org/pers/hd/h/Hung:Yi=Ping"], "conf": "mm", "year": "2008", "pages": 10}