{"title": "Empirical evidence of the benefits of workspace awareness in software configuration management.", "fields": ["user experience design", "software configuration management", "conflict resolution", "workspace", "engineering support"], "abstract": "In this paper, we present results from our empirical evaluations of a workspace awareness tool that we designed and implemented to augment the functionality of software configuration management systems. Particularly, we performed two user experiments directed at understanding the effectiveness of a workspace awareness tool in improving coordination and reducing conflicts. In the first experiment, we evaluated the tool through  text-based assignments  to avoid interference from the well-documented impact of individual differences among participants, as these differences are known to lessen the observable effect of proposed tools or to lead to them having no observable effect at all. This strategy of evaluating an application in a domain that is known to have less individual differences is novel and in our case particularly helpful in providing baseline quantifiable results. Upon this baseline, we performed a second experiment, with  code-based assignments , to validate that the tool's beneficial effects also occur in the case of programming. Together, our results provide quantitative evidence of the benefits of workspace awareness in software configuration management, as we demonstrate that it improves coordination and conflict resolution without inducing significant overhead in monitoring awareness cues.", "citation": "Citations (80)", "departments": ["Carnegie Mellon University", "University of California, Irvine", "University of California, Irvine"], "authors": ["Anita Sarma.....http://dblp.org/pers/hd/s/Sarma:Anita", "David F. Redmiles.....http://dblp.org/pers/hd/r/Redmiles:David_F=", "André van der Hoek.....http://dblp.org/pers/hd/h/Hoek:Andr=eacute=_van_der"], "conf": "sigsoft", "year": "2008", "pages": 11}