{"title": "Efficient top-k querying over social-tagging networks.", "fields": ["ranking", "intuition", "casual", "online community", "user generated content"], "abstract": "Online communities have become popular for publishing and searching content, as well as for finding and connecting to other users. User-generated content includes, for example, personal blogs, bookmarks, and digital photos. These items can be annotated and rated by different users, and these social tags and derived user-specific scores can be leveraged for searching relevant content and discovering subjectively interesting items. Moreover, the relationships among users can also be taken into consideration for ranking search results, the intuition being that you trust the recommendations of your close friends more than those of your casual acquaintances.   Queries for tag or keyword combinations that compute and rank the top-k results thus face a large variety of options that complicate the query processing and pose efficiency challenges. This paper addresses these issues by developing an incremental top-k algorithm with two-dimensional expansions: social expansion considers the strength of relations among users, and semantic expansion considers the relatedness of different tags. It presents a new algorithm, based on principles of threshold algorithms, by folding friends and related tags into the search space in an incremental on-demand manner. The excellent performance of the method is demonstrated by an experimental evaluation on three real-world datasets, crawled from deli.cio.us, Flickr, and LibraryThing.", "citation": "Citations (188)", "departments": ["Max Planck Society", "Max Planck Society", "Max Planck Society", "École Polytechnique Fédérale de Lausanne", "Max Planck Society"], "authors": ["Ralf Schenkel.....http://dblp.org/pers/hd/s/Schenkel:Ralf", "Tom Crecelius.....http://dblp.org/pers/hd/c/Crecelius:Tom", "Mouna Kacimi.....http://dblp.org/pers/hd/k/Kacimi:Mouna", "Sebastian Michel.....http://dblp.org/pers/hd/m/Michel_0001:Sebastian", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas", "Josiane Xavier Parreira.....http://dblp.org/pers/hd/p/Parreira:Josiane_Xavier", "Gerhard Weikum.....http://dblp.org/pers/hd/w/Weikum:Gerhard"], "conf": "sigir", "year": "2008", "pages": 8}