{"title": "SPADE: the system s declarative stream processing engine.", "fields": ["stream processing", "code generation", "optimizing compiler", "ranging", "operator"], "abstract": "In this paper, we present Spade - the System S declarative stream processing engine. System S is a large-scale, distributed data stream processing middleware under development at IBM T. J. Watson Research Center. As a front-end for rapid application development for System S, Spade provides (1) an intermediate language for flexible composition of parallel and distributed data-flow graphs, (2) a toolkit of type-generic, built-in stream processing operators, that support scalar as well as vectorized processing and can seamlessly inter-operate with user-defined operators, and (3) a rich set of stream adapters to ingest/publish data from/to outside sources. More importantly, Spade automatically brings performance optimization and scalability to System S applications. To that end, Spade employs a code generation framework to create highly-optimized applications that run natively on the Stream Processing Core (SPC), the execution and communication substrate of System S, and take full advantage of other System S services. Spade allows developers to construct their applications with fine granular stream operators without worrying about the performance implications that might exist, even in a distributed system. Spade's optimizing compiler automatically maps applications into appropriately sized execution units in order to minimize communication overhead, while at the same time exploiting available parallelism. By virtue of the scalability of the System S runtime and Spade's effective code generation and optimization, we can scale applications to a large number of nodes. Currently, we can run Spade jobs on ≈ 500 processors within more than 100 physical nodes in a tightly connected cluster environment. Spade has been in use at IBM Research to create real-world streaming applications, ranging from monitoring financial market feeds to radio telescopes to semiconductor fabrication lines.", "citation": "Citations (504)", "year": "2008", "departments": ["IBM", "IBM", "IBM", "University of Illinois at Chicago", "Georgia Institute of Technology"], "conf": "sigmod", "authors": ["Bugra Gedik.....http://dblp.org/pers/hd/g/Gedik:Bugra", "Henrique Andrade.....http://dblp.org/pers/hd/a/Andrade:Henrique", "Kun-Lung Wu.....http://dblp.org/pers/hd/w/Wu:Kun=Lung", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S=", "Myungcheol Doo.....http://dblp.org/pers/hd/d/Doo:Myungcheol"], "pages": 12}