{"title": "Flickr distance.", "fields": ["normalized google distance", "full text search", "triangle inequality", "wordnet", "automatic image annotation"], "abstract": "This paper presents Flickr distance, which is a novel measurement of the relationship between semantic concepts (objects, scenes) in visual domain. For each concept, a collection of images are obtained from Flickr, based on which the improved latent topic based visual language model is built to capture the visual characteristic of this concept. Then Flickr distance between different concepts is measured by the square root of Jensen-Shannon (JS) divergence between the corresponding visual language models. Comparing with WordNet, Flickr distance is able to handle far more concepts existing on the Web, and it can scale up with the increase of concept vocabularies. Comparing with Google distance, which is generated in textual domain, Flickr distance is more precise for visual domain concepts, as it captures the visual relationship between the concepts instead of their co-occurrence in text search results. Besides, unlike Google distance, Flickr distance satisfies triangular inequality, which makes it a more reasonable distance metric. Both subjective user study and objective evaluation show that Flickr distance is more coherent to human perception than Google distance. We also design several application scenarios, such as concept clustering and image annotation, to demonstrate the effectiveness of this proposed distance in image related applications.", "citation": "Citations (207)", "departments": ["University of Science and Technology of China", "Microsoft", "University of Science and Technology of China", "Microsoft", "Microsoft"], "authors": ["Lei Wu.....http://dblp.org/pers/hd/w/Wu:Lei", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Nenghai Yu.....http://dblp.org/pers/hd/y/Yu:Nenghai", "Wei-Ying Ma.....http://dblp.org/pers/hd/m/Ma:Wei=Ying", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2008", "pages": 10}