{"title": "Evaluating the effects of cache redundancy on profit.", "fields": ["latency", "cache", "cache only memory architecture", "redundancy", "revenue"], "abstract": "Previous works in computer architecture have mostly neglected revenue and/or profit, key factors driving any design decision. In this paper, we evaluate architectural techniques to optimize for revenue/profit. The continual trend of technology scaling and sub-wavelength lithography has caused transistor feature sizes to shrink into the nanoscale range. As a result, the effects of process variations on critical path delay and chip yields have amplified. A common concept to remedy the effects of variations is speed-binning, by which chips from a single batch are rated by a discrete range of frequencies and sold at different prices. An efficient binning distribution thus decides the profitability of the chip manufacturer. We propose and evaluate a cache-redundancy scheme called substitute cache, which allows the chip manufacturers to modify the number of chips in different bins. Particularly, this technique introduces a small fully associative array associated with each cache way to replicate the data elements that will be stored in the high latency lines, and hence can be effectively used to boost up the overall chip yield and also shift the chip binning distribution towards higher frequencies. We also develop models based on linear regression and neural networks to accurately estimate the chip prices from their architectural configurations. Using these estimation models, we find that our substitute cache scheme can potentially increase the revenue for the batch of chips by as much as 13.1%.", "citation": "Citations (16)", "departments": ["Northwestern University", "Northwestern University", "Northwestern University", "Northwestern University", "Iowa State University"], "authors": ["Abhishek Das.....http://dblp.org/pers/hd/d/Das:Abhishek", "Berkin Özisikyilmaz.....http://dblp.org/pers/hd/=/=Ouml=zisikyilmaz:Berkin", "Serkan Ozdemir.....http://dblp.org/pers/hd/o/Ozdemir:Serkan", "Gokhan Memik.....http://dblp.org/pers/hd/m/Memik:Gokhan", "Joseph Zambreno.....http://dblp.org/pers/hd/z/Zambreno:Joseph", "Alok N. Choudhary.....http://dblp.org/pers/hd/c/Choudhary:Alok_N="], "conf": "micro", "year": "2008", "pages": 11}