{"title": "Sketching in adversarial environments.", "fields": ["logarithm", "sketch", "adversarial system", "communication complexity", "symmetric difference", "adversary"], "abstract": "We formalize a realistic model for computations over massive data sets. The model, referred to as the adversarial sketch model, unifies the well-studied sketch and data stream models together with a cryptographic flavor that considers the execution of protocols in “hostile environments,” and provides a framework for studying the complexity of tasks involving massive data sets. In the adversarial sketch model several parties are interested in computing a joint function in the presence of an adversary that dynamically chooses their inputs. These inputs are provided to the parties in an on-line manner, and each party incrementally updates a compressed sketch of its input. The parties are not allowed to communicate, they do not share any secret information, and any public information they share is known to the adversary in advance. Then, the parties engage in a protocol in order to evaluate the function on their current inputs using only their sketches. In this paper we settle the complexity of two fundamental problems in this model: testing whether two massive data sets are equal, and approximating the size of their symmetric difference. For these problems we construct explicit protocols that are optimal up to polylogarithmic factors. Our main technical contribution is an explicit and deterministic encoding scheme that enjoys two seemingly conflicting properties: incrementality and high distance, which may be of independent interest.", "citation": "Citations (2)", "year": "2008", "departments": ["Microsoft", "Weizmann Institute of Science", "Microsoft", "Weizmann Institute of Science", "Weizmann Institute of Science"], "conf": "stoc", "authors": ["Ilya Mironov.....http://dblp.org/pers/hd/m/Mironov:Ilya", "Moni Naor.....http://dblp.org/pers/hd/n/Naor:Moni", "Gil Segev.....http://dblp.org/pers/hd/s/Segev:Gil"], "pages": 10}