{"title": "Dynamic Verification of MPI Programs with Reductions in Presence of Split Operations and Relaxed Orderings.", "fields": ["deadlock", "partial order reduction", "assertion", "wildcard", "program counter"], "abstract": "Dynamic verification methods are the natural choice for debugging real world programs when model extraction and maintenance are expensive. Message passing programs written using the MPI library fall under this category. Partial order reduction can be very effective for MPI programs because for each process, all its local computational steps, as well as many of its MPI calls, commute with the corresponding steps of all other processes. However, when dependencies arise among MPI calls, they are often a function of the runtime state. While this suggests the use of dynamic partial order reduction (DPOR), three aspects of MPI make previous DPOR algorithms inapplicable: (i) many MPI calls are allowed to complete out of program order; (ii) MPI has global synchronization operations (e.g.,  barrier ) that have a special weak semantics; and (iii) the runtime of MPI cannot, without intrusive modifications, be forced to pursue a specific interleaving because of MPI's liberal message matching rules, especially pertaining to `wildcard receives'. We describe our new dynamic verification algorithm `POE' that exploits the out of order completion semantics of MPI by delaying the issuance of MPI calls, issuing them only according to the formation of  match-sets , which are ample `big-step' moves. POE guarantees to manifest any feasible interleaving by dynamically rewriting wildcard receives by specific-source receives. This is the first dynamic model-checking algorithm with reductions for (a large subset of) MPI that guarantees to catch all deadlocks and local assertion violations, and is found to work well in practice.", "citation": "Citations (79)", "year": "2008", "departments": ["University of Utah", "University of Utah", "University of Utah"], "conf": "cav", "authors": ["Sarvani S. Vakkalanka.....http://dblp.org/pers/hd/v/Vakkalanka:Sarvani_S=", "Ganesh Gopalakrishnan.....http://dblp.org/pers/hd/g/Gopalakrishnan:Ganesh", "Robert M. Kirby.....http://dblp.org/pers/hd/k/Kirby:Robert_M="], "pages": 14}