{"title": "Event recognition: viewing the world with a third eye.", "fields": ["application domain", "annotation", "phenomenon", "geotagging", "adaboost"], "abstract": "Semantic event recognition based only on vision cues is a challenging problem. This problem is particularly acute when the application domain is unconstrained still images available on the Internet or in personal repositories. In recent years, it has been shown that metadata captured with pictures can provide valuable contextual cues complementary to the image content and can be used to improve classification performance. With the recent geotagging phenomenon, an important piece of metadata available with many geotagged pictures now on the World Wide Web is GPS information. In this study, we obtain satellite images corresponding to picture location data and investigate their novel use to recognize the picture-taking environment, as if through a third eye above the object. Additionally, we combine this inference with classical vision-based event detection methods and study the synergistic fusion of the two approaches. We employ both color- and structure-based visual vocabularies for characterizing ground and satellite images, respectively. Training of satellite image classifiers is done using a multiclass AdaBoost engine while the ground image classifiers are trained using SVMs. Modeling and prediction involve some of the most interesting semantic event-activity classes encountered in consumer pictures, including those that occur in residential areas, commercial areas, beaches, sports venues, and parks. The powerful fusion of the complementary views achieves significant performance improvement over the ground view baseline. With integrated GPS-capable cameras on the horizon, we believe that our line of research can revolutionize event recognition and media annotation in years to come.", "citation": "Citations (73)", "departments": ["Eastman Kodak Company", "Eastman Kodak Company", "Eastman Kodak Company", "Eastman Kodak Company"], "authors": ["Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo", "Jie Yu.....http://dblp.org/pers/hd/y/Yu_0001:Jie", "Dhiraj Joshi.....http://dblp.org/pers/hd/j/Joshi:Dhiraj", "Wei Hao.....http://dblp.org/pers/hd/h/Hao:Wei"], "conf": "mm", "year": "2008", "pages": 10}