{"title": "SpaceTwist: Managing the Trade-Offs Among Location Privacy, Query Performance, and Query Accuracy in Mobile Services.", "fields": ["ranking", "web query classification", "sargable", "web search query", "online aggregation"], "abstract": "In a mobile service scenario, users query a server for nearby points of interest but they may not want to disclose their locations to the service. Intuitively, location privacy may be obtained at the cost of query performance and query accuracy. The challenge addressed is how to obtain the best possible performance, subjected to given requirements for location privacy and query accuracy. Existing privacy solutions that use spatial cloaking employ complex server query processing techniques and entail the transmission of large quantities of intermediate result. Solutions that use transformation-based matching generally fall short in offering practical query accuracy guarantees. Our proposed framework, called SpaceTwist, rectifies these shortcomings for k nearest neighbor (kNN) queries. Starting with a location different from the user's actual location, nearest neighbors are retrieved incrementally until the query is answered correctly by the mobile terminal. This approach is flexible, needs no trusted middleware, and requires only well-known incremental NN query processing on the server. The framework also includes a server-side granular search technique that exploits relaxed query accuracy guarantees for obtaining better performance. The paper reports on empirical studies that elicit key properties of SpaceTwist and suggest that the framework offers very good performance and high privacy, at low communication cost.", "citation": "Citations (409)", "departments": ["Aalborg University", "Aalborg University", "Aalborg University", "Aalborg University"], "authors": ["Man Lung Yiu.....http://dblp.org/pers/hd/y/Yiu:Man_Lung", "Christian S. Jensen.....http://dblp.org/pers/hd/j/Jensen:Christian_S=", "Xuegang Huang.....http://dblp.org/pers/hd/h/Huang:Xuegang", "Hua Lu.....http://dblp.org/pers/hd/l/Lu_0001:Hua"], "conf": "icde", "year": "2008", "pages": 10}