{"title": "Ranking Automata and Games for Prioritized Requirements.", "fields": ["ranking", "special case", "modulo", "decision problem"], "abstract": "Requirements of reactive systems are usually specified by classifying system executions as desirable and undesirable. To specify  prioritized requirements, we propose to associate a rank with each execution. This leads to optimization analogs of verification and synthesis problems in which we compute the \"best\" requirement that can be satisfied or enforced from a given state. The classical definitions of acceptance criteria for automata can be generalized to ranking conditions. In particular, given a mapping of states to colors, the  Buchi ranking condition maps an execution to the highest color visited infinitely often by the execution, and the  cyclic ranking condition with cycle  k maps an execution to the modulo- k value of the highest color repeating infinitely often. The well-studied parity acceptance condition is a special case of cyclic ranking with cycle 2, and we show that the cyclic ranking condition can specify all  i¾? -regular ranking functions. We show that the classical characterizations of acceptance conditions by fixpoints over sets generalize to characterizations of ranking conditions by fixpoints over an appropriately chosen lattice of coloring functions. This immediately leads to symbolic algorithms for solving verification and synthesis problems. Furthermore, the precise complexity of a decision problem for ranking conditions is no more than the corresponding acceptance version, and in particular, we show how to solve Buchi ranking games in quadratic time.", "citation": "Citations (27)", "year": "2008", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania"], "conf": "cav", "authors": ["Rajeev Alur.....http://dblp.org/pers/hd/a/Alur:Rajeev", "Aditya Kanade.....http://dblp.org/pers/hd/k/Kanade:Aditya", "Gera Weiss.....http://dblp.org/pers/hd/w/Weiss:Gera"], "pages": 14}