{"title": "3D model matching with Viewpoint-Invariant Patches (VIP).", "fields": ["invariant", "ground truth", "solid modeling", "image registration", "iterative reconstruction"], "abstract": "The robust alignment of images and scenes seen from widely different viewpoints is an important challenge for camera and scene reconstruction. This paper introduces a novel class of viewpoint independent local features for robust registration and novel algorithms to use the rich information of the new features for 3D scene alignment and large scale scene reconstruction. The key point of our approach consists of leveraging local shape information for the extraction of an invariant feature descriptor. The advantages of the novel viewpoint invariant patch (VIP) are: that the novel features are invariant to 3D camera motion and that a single VIP correspondence uniquely defines the 3D similarity transformation between two scenes. In the paper we demonstrate how to use the properties of the VIPs in an efficient matching scheme for 3D scene alignment. The algorithm is based on a hierarchical matching method which tests the components of the similarity transformation sequentially to allow efficient matching and 3D scene alignment. We evaluate the novel features on real data with known ground truth information and show that the features can be used to reconstruct large scale urban scenes.", "citation": "Citations (225)", "year": "2008", "departments": ["University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill"], "conf": "cvpr", "authors": ["Changchang Wu.....http://dblp.org/pers/hd/w/Wu:Changchang", "Brian Clipp.....http://dblp.org/pers/hd/c/Clipp:Brian", "Xiaowei Li.....http://dblp.org/pers/hd/l/Li_0007:Xiaowei", "Jan-Michael Frahm.....http://dblp.org/pers/hd/f/Frahm:Jan=Michael", "Marc Pollefeys.....http://dblp.org/pers/hd/p/Pollefeys:Marc"], "pages": -1}