{"title": "How Physical Carrier Sense Affects System Throughput in IEEE 802.11 Wireless Networks.", "fields": ["ieee 802 11", "throughput", "inter access point protocol", "multiple access with collision avoidance for wireless", "channel"], "abstract": "In recent years, wireless ad hoc networks have become increasingly popular in both military and civilian applications due to their capability of building networks without the need for a pre-existing infrastructure. While a number of studies have been carried out to study the performance of IEEE 802.11 DCF in single-cell wireless LANs, the analysis of IEEE 802.11 DCF in multi-hop wireless networks with consideration of the effects of physical carrier sense, SINR, and collision caused by accumulative interference has been lacking. In this paper, we substantially extend Cali's work and rigorously model, with all these effects considered, channel activities governed by IEEE 802.11 DCF in multi-hop wireless networks. We show that as in single-cell WLANs, the choice of the contention window size can impact the system throughput in multi-hop wireless networks. However, the optimal value of the contention window size is quite different. Moreover, the optimal attempt probability p (the optimal window size) derived for multi-hop wireless networks with respect to maximizing the system throughput is larger (smaller) than that for single-cell WLANs. We also show that, given the minimal SINR threshold beta, the optimal carrier sense range is smaller than the conventional value used (provided that the contention window size is tuned accordingly).", "citation": "Citations (24)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Zheng Zeng.....http://dblp.org/pers/hd/z/Zeng:Zheng", "Yong Yang.....http://dblp.org/pers/hd/y/Yang:Yong", "Jennifer C. Hou.....http://dblp.org/pers/hd/h/Hou:Jennifer_C="], "conf": "infocom", "year": "2008", "pages": 9}