{"title": "DeCoR: A Delayed Commit and Rollback mechanism for handling inductive noise in processors.", "fields": ["ideal machine", "cache", "rollback", "current sensor", "commit"], "abstract": "Increases in peak current draw and reductions in the operating voltage of processors stress the importance of dealing with voltage fluctuations in processors. Noise-margin violations lead to undesired effects, like timing violations, which may result in incorrect execution of applications. Several recent architectural solutions for inductive noise have been proposed that, unfortunately, have a strong correlation to the underlying power-delivery package model and require a feedback loop that is largely constrained by the voltage/current sensor characteristics. The resulting solutions are not robust across a wide range of microprocessor designs and packaging technologies. This paper proposes a Delayed-commit and rollback scheme (DeCoR) that guarantees correctness, insensitive to the package model or the responsiveness of the voltage sensors. In particular, our approach recovers from, rather than attempting to avoid, voltage emergencies. This approach incurs a small performance penalty when compared to an ideal machine that does not have voltage emergencies. We show that explicit checkpoint-recovery schemes, intended to handle infrequent events, e.g., radiation-induced soft errors, suffer from large performance overheads for frequently-occurring voltage emergencies. DeCoR requires very few modifications to modern processor designs, as it leverages the existing store queue and reorder buffers. Unlike conventional designs that conservatively protect all components of the processor from inductive noise with overly-large timing margins, our approach only requires conservative protection of the architected register state and cache write paths.", "citation": "Citations (91)", "departments": ["Harvard University", "Harvard University", "Harvard University", "Harvard University", "Harvard University"], "authors": ["Meeta Sharma Gupta.....http://dblp.org/pers/hd/g/Gupta:Meeta_Sharma", "Krishna K. Rangan.....http://dblp.org/pers/hd/r/Rangan:Krishna_K=", "Michael D. Smith.....http://dblp.org/pers/hd/s/Smith_0001:Michael_D=", "Gu-Yeon Wei.....http://dblp.org/pers/hd/w/Wei:Gu=Yeon", "David M. Brooks.....http://dblp.org/pers/hd/b/Brooks:David_M="], "conf": "hpca", "year": "2008", "pages": 12}