{"title": "Clone detection in automotive model-based development.", "fields": ["software development", "automotive industry", "model based design", "software maintenance", "automotive engineering", "clone", "engineering", "automatic control", "software quality"], "abstract": "Model-based development is becoming an increasingly common development methodology. In important domains like embedded systems already major parts of the code are generated from models specified with domain-specific modelling languages. Hence, such models are nowadays an integral part of the software development and maintenance process and therefore have a major economic and strategic value for the software-developing organisations. Nevertheless almost no work has been done on a quality defect that is known to seriously hamper maintenance productivity in classic code-based development: Cloning. This paper presents an approach for the automatic detection of clones in large models as they are used in model-based development of control systems. The approach is based on graph theory and hence can be applied to most graphical data-flow languages. An industrial case study demonstrates the applicability of our approach for the detection of clones in Matlab/Simulink models that are widely used in model-based development of embedded systems in the automotive domain.", "citation": "Not cited", "departments": ["Information Technology University", "Information Technology University", "Information Technology University", "Information Technology University", "Information Technology University"], "authors": ["Florian Deissenboeck.....http://dblp.org/pers/hd/d/Deissenboeck:Florian", "Benjamin Hummel.....http://dblp.org/pers/hd/h/Hummel:Benjamin", "Elmar Jürgens.....http://dblp.org/pers/hd/j/J=uuml=rgens:Elmar", "Bernhard Schätz.....http://dblp.org/pers/hd/s/Sch=auml=tz:Bernhard", "Stefan Wagner.....http://dblp.org/pers/hd/w/Wagner_0001:Stefan", "Jean-Francois Girard.....http://dblp.org/pers/hd/g/Girard:Jean=Francois", "Stefan Teuchert.....http://dblp.org/pers/hd/t/Teuchert:Stefan"], "conf": "icse", "year": "2008", "pages": 10}