{"title": "Cost-based variable-length-gram selection for string collections to support approximate queries efficiently.", "fields": ["substring", "record linkage", "special case", "approximate string matching", "string"], "abstract": "Approximate queries on a collection of strings are important in many applications such as record linkage, spell checking, and Web search, where inconsistencies and errors exist in data as well as queries. Several existing algorithms use the concept of \"grams,\" which are substrings of strings used as signatures for the strings to build index structures. A recently proposed technique, called VGRAM, improves the performance of these algorithms by using a carefully chosen dictionary of variable-length grams based on their requencies in the string collection. Since an index structure using fixed-length grams can be viewed as a special case of VGRAM, a fundamental problem arises naturally: what is the relationship between the gram dictionary and the performance of queries? We study this problem in this paper. We propose a dynamic programming algorithm for computing a tight lower bound on the number of common grams shared by two similar strings in order to improve query performance. We analyze how a gram dictionary affects the index structure of the string collection and ultimately the performance of queries. We also propose an algorithm for automatically computing a dictionary of high-quality grams for a workload of queries. Our experiments on real data sets show the improvement on query performance achieved by these techniques. To our best knowledge, this study is the first cost-based quantitative approach to deciding good grams for approximate string queries.", "citation": "Citations (120)", "year": "2008", "departments": ["Northeastern University", "Northeastern University", "University of California, Irvine"], "conf": "sigmod", "authors": ["Xiaochun Yang.....http://dblp.org/pers/hd/y/Yang_0001:Xiaochun", "Bin Wang.....http://dblp.org/pers/hd/w/Wang_0015:Bin", "Chen Li.....http://dblp.org/pers/hd/l/Li_0001:Chen"], "pages": 12}