{"title": "Supporting table partitioning by reference in oracle.", "fields": ["oracle", "information lifecycle management", "partition", "product life cycle management", "row"], "abstract": "Partitioning is typically employed on large-scale data to improve manageability, availability, and performance. However, for tables connected by a referential constraint (capturing a parent-child relationship), the current approaches require individually partitioning each table thereby burdening the user with the task of maintaining the tables equi-partitioned, which not only is cumbersome but also error prone. This paper proposes a new partitioning method ( partition by reference ) that allows tables with a parent-child relationship to be logically equi-partitioned by inheriting the partition key from the parent table without duplicating the key columns. The partitioning key is resolved through an existing parent-child relationship, enforced by an active referential constraint. This logical dependency is used to automatically i) cascade partition maintenance operations performed on parent table to child tables, and ii) handle migration of child rows when partition key or parent key in parent table is updated, as a single atomic operation. This method has been introduced in Oracle Database 11gR1 with support for tables with both single level and composite partitioning methods. The paper describes the key concepts of table partitioning by reference method, discusses the design and implementation challenges, and presents an experimental study covering a usage scenario common in Information Life Cycle Management (ILM) applications.", "citation": "Citations (69)", "year": "2008", "departments": ["Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation"], "conf": "sigmod", "authors": ["George Eadon.....http://dblp.org/pers/hd/e/Eadon:George", "Eugene Inseok Chong.....http://dblp.org/pers/hd/c/Chong:Eugene_Inseok", "Shrikanth Shankar.....http://dblp.org/pers/hd/s/Shankar:Shrikanth", "Ananth Raghavan.....http://dblp.org/pers/hd/r/Raghavan:Ananth", "Jagannathan Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Jagannathan", "Souripriya Das.....http://dblp.org/pers/hd/d/Das:Souripriya"], "pages": 12}