{"title": "Optimal Boolean Matrix Decomposition: Application to Role Engineering.", "fields": ["heuristic", "matrix decomposition", "boolean algebra", "logical matrix", "heuristics"], "abstract": "A decomposition of a binary matrix into two matrices gives a set of basis vectors and their appropriate combination to form the original matrix. Such decomposition solutions are useful in a number of application domains including text mining, role engineering as well as knowledge discovery. While a binary matrix can be decomposed in several ways, however, certain decompositions better characterize the semantics associated with the original matrix in a succinct but comprehensive way. Indeed, one can find different decompositions optimizing different criteria matching various semantics. In this paper, we first present a number of variants to the optimal Boolean matrix decomposition problem that have pragmatic implications. We then present a unified framework for modeling the optimal binary matrix decomposition and its variants using binary integer programming. Such modeling allows us to directly adopt the huge body of heuristic solutions and tools developed for binary integer programming. Although the proposed solutions are applicable to any domain of interest, for providing more meaningful discussions and results, in this paper, we present the binary matrix decomposition problem in a role engineering context, whose goal is to discover an optimal and correct set of roles from existing permissions, referred to as the role mining problem (RMP). This problem has gained significant interest in recent years as role based access control has become a popular means of enforcing security in databases. We consider several variants of the above basic RMP, including the min-noise RMP, delta-approximate RMP and edge-RMP. Solutions to each of them aid security administrators in specific scenarios. We then model these variants as Boolean matrix decomposition and present efficient heuristics to solve them.", "citation": "Citations (145)", "departments": ["Rutgers University", "Rutgers University", "Rutgers University"], "authors": ["Haibing Lu.....http://dblp.org/pers/hd/l/Lu:Haibing", "Jaideep Vaidya.....http://dblp.org/pers/hd/v/Vaidya:Jaideep", "Vijayalakshmi Atluri.....http://dblp.org/pers/hd/a/Atluri:Vijayalakshmi"], "conf": "icde", "year": "2008", "pages": 10}