{"title": "Game-Theoretic Model for Collaborative Protocols in Selfish, Tariff-Free, Multihop Wireless Networks.", "fields": ["multi frequency network", "packet forwarding", "bridging", "key distribution in wireless sensor networks", "wireless wan"], "abstract": "Traditional networks are built on the assumption that network entities cooperate based on a mandatory network communication semantic to achieve desirable qualities such as efficiency and scalability. Over the years, this assumption has been eroded by the emergence of users that alter network behavior in a way to benefit themselves at the expense of others. At one extreme, a malicious user/node may eavesdrop on sensitive data or deliberately inject packets into the network to disrupt network operations. The solution to this generally lies in encryption and authentication. In contrast, a rational node acts only to achieve an outcome that he desires most. In such a case, cooperation is still achievable if the outcome is to the best interest of the node. The node misbehaviour problem would be more pronounced in multihop wireless networks like mobile ad hoc and sensor networks, which are typically made up of wireless battery-powered devices that must cooperate to forward packets for one another. But, cooperation may be hard to maintain as it consumes scarce resources such as bandwidth, computational power and battery power. This paper applies game theory to achieve collusive networking behavior in such network environments. In this work, pricing, promiscuous listening and mass punishments are avoided altogether. Our model builds on recent work in the field of Economics on the theory of imperfect private monitoring for the dynamic Bertrand oligopoly, and adapts it to the wireless multihop network. The model derives conditions for collusive packet forwarding, truthful routing broadcasts and packet acknowledgments under a lossy, wireless, multi-hop environment, thus capturing many important characteristics of the network layer and link layer in one integrated analysis that has not been achieved previously. Finally, we provide a proof of the viability of the model under a theoretical wireless environment.", "citation": "Citations (15)", "departments": ["National University of Singapore", "Agency for Science, Technology and Research"], "authors": ["See-Kee Ng.....http://dblp.org/pers/hd/n/Ng:See=Kee", "Winston Khoon Guan Seah.....http://dblp.org/pers/hd/s/Seah:Winston_Khoon_Guan"], "conf": "infocom", "year": "2008", "pages": 5}