{"title": "The Effects of Virtual Reality, Augmented Reality, and Motion Parallax on Egocentric Depth Perception.", "fields": ["virtual reality", "augmented reality", "optical head mounted display", "magnitude", "depth perception", "parallax"], "abstract": "As the use of virtual and augmented reality applications becomes more common, the need to fully understand how observers perceive spatial relationships grows more critical. One of the key requirements in engineering a practical virtual or augmented reality system is accurately conveying depth and layout. This requirement has frequently been assessed by measuring judgments of egocentric depth. These assessments have shown that observers in virtual reality (VR) perceive virtual space as compressed relative to the real-world, resulting in systematic underestimations of egocentric depth. Previous work has indicated that similar effects may be present in augmented reality (AR) as well.   This paper reports an experiment that directly measured egocentric depth perception in both VR and AR conditions; it is believed to be the first experiment to directly compare these conditions in the same experimental framework. In addition to VR and AR, two control conditions were studied: viewing real-world objects, and viewing real-world objects through a head-mounted display. Finally, the presence and absence of motion parallax was crossed with all conditions. Like many previous studies, this one found that depth perception was underestimated in VR, although the magnitude of the effect was surprisingly low. The most interesting finding was that no underestimation was observed in AR.", "citation": "Citations (116)", "departments": ["Mississippi State University", "Mississippi State University", "Mississippi State University", "Mississippi State University", "Ames Research Center", "Mississippi State University", "Mississippi State University", "Mississippi State University", "Mississippi State University"], "authors": ["Adam Jones.....http://dblp.org/pers/hd/j/Jones:Adam", "J. Edward Swan II.....http://dblp.org/pers/hd/s/Swan_II:J=_Edward", "Gurjot Singh.....http://dblp.org/pers/hd/s/Singh:Gurjot", "Eric Kolstad.....http://dblp.org/pers/hd/k/Kolstad:Eric"], "conf": "vr", "year": "2008", "pages": 2}