{"title": "A Holistic Approach to Decentralized Structural Damage Localization Using Wireless Sensor Networks.", "fields": ["latency", "key distribution in wireless sensor networks", "decentralized computing", "structural health monitoring", "architecture", "cyber physical system"], "abstract": "Wireless sensor networks (WSNs) have become an increasingly compelling platform for Structural Health Monitoring (SHM) applications, since they can be installed relatively inexpensively onto existing infrastructure. Existing approaches to SHM in WSNs typically address computing system issues or structural engineering techniques, but not both in conjunction. In this paper, we propose a holistic approach to SHM that integrates a decentralized computing architecture with the Damage Localization Assurance Criterion algorithm. In contrast to centralized approaches that require transporting large amounts of sensor data to a base station, our system pushes the execution of portions of the damage localization algorithm onto the sensor nodes, reducing communication costs by two orders of magnitude in exchange for moderate additional processing on each sensor. We present a prototype implementation of this system built using the TinyOS operating system running on the Intel Imote2 sensor network platform. Experiments conducted using two different physical structures demonstrate our system's ability to accurately localize structural damage. We also demonstrate that our decentralized approach reduces latency by 65.5% and energy consumption by 64.0% compared to a typical centralized solution.", "citation": "Citations (97)", "year": "2008", "departments": ["Washington University in St. Louis", "Washington University in St. Louis", "Purdue University", "Washington University in St. Louis", "Purdue University", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis"], "conf": "rtss", "authors": ["Gregory Hackmann.....http://dblp.org/pers/hd/h/Hackmann:Gregory", "Fei Sun.....http://dblp.org/pers/hd/s/Sun:Fei", "Nestor Castaneda.....http://dblp.org/pers/hd/c/Castaneda:Nestor", "Chenyang Lu.....http://dblp.org/pers/hd/l/Lu:Chenyang", "Shirley Dyke.....http://dblp.org/pers/hd/d/Dyke:Shirley"], "pages": 12}