{"title": "Dense Subsets of Pseudorandom Sets.", "fields": ["pseudorandom generators for polynomials", "proof by contradiction", "proof complexity", "combinatorics", "analytic proof", "pseudorandom number generator", "szemeredi regularity lemma", "discrete mathematics", "furstenberg s proof of the infinitude of primes", "pseudorandom generator theorem"], "abstract": "A theorem of Green, Tao, and Ziegler can be stated (roughly) as follows: ifR is a pseudorandom set, and D is a dense subset of R, then D may be modeled by a set M that is dense in the entire domain such that D and M are indistinguishable. (The precise statement refers to\"measures\" or distributions rather than sets.) The proof of this theorem is very general, and it applies to notions of pseudo-randomness and indistinguishability defined in terms of any family of distinguishers with some mild closure properties. The proof proceeds via iterative partitioning and an energy increment argument, in the spirit of the proof of the weak Szemeredi regularity lemma. The \"reduction\" involved in the proof has exponential complexity in the distinguishing probability. We present a new proof inspired by Nisan's proof of Impagliazzo's hardcore set theorem. The reduction in our proof has polynomial complexity in the distinguishing probability and provides a new characterization of the notion of \"pseudoentropy\" of a distribution. A proof similar to ours has also been independently discovered by Gowers [2]. We also follow the connection between the two theorems and obtain a new proof of Impagliazzo's hardcore set theorem via iterative partitioning and energy increment. While our reduction has exponential complexity in some parameters, it has the advantage that the hardcore set is efficiently recognizable.", "citation": "Citations (106)", "departments": ["Weizmann Institute of Science", "University of California, Berkeley", "University of California, Berkeley", "Harvard University"], "authors": ["Omer Reingold.....http://dblp.org/pers/hd/r/Reingold:Omer", "Luca Trevisan.....http://dblp.org/pers/hd/t/Trevisan:Luca", "Madhur Tulsiani.....http://dblp.org/pers/hd/t/Tulsiani:Madhur", "Salil P. Vadhan.....http://dblp.org/pers/hd/v/Vadhan:Salil_P="], "conf": "focs", "year": "2008", "pages": 10}