{"title": "Sensor-Aided Overlay Deployment and Relocation for Vast-Scale Sensor Networks.", "fields": ["software deployment", "network architecture", "sink", "overlay network", "overlay"], "abstract": "The overlay-based network architecture has been recognized as an effective way to deal with the funneling effect in sensor networks, where sensors closer to the sink are usually responsible for relaying more network traffic. Such funneling effect is particularly harmful when the number of sensors in the network is vast. In an overlay-based sensor network, a special type of resource-rich multi-radio mobile wireless devices (we call them syphons) are deployed along with sensors. Syphons form an overlay network and help nearby sensors relay their data to the sink via the overlay network, thus mitigating the funneling effect. In this paper, we study one of the fundamental challenges in overlay-based sensor networks: syphon deployment problem, i.e., how to deploy a limited number of syphons to cover a vast sensing field while maintaining the connectivity and balanced loads among them. We propose a novel sensor-aided overlay deployment and relocation (SODaR) protocolas a possible solution. The key idea is to take advantage of sensors' assistance and to relocate syphons by circling them around the sink in an orderly manner until all syphons are connected. Simulation results show that, with SODaR, syphons are able to self-form and self-maintain a connected tree structure which provides excellent load balancing among syphons with modest message and movement overhead.", "citation": "Citations (9)", "departments": ["Iowa State University", "Iowa State University", "Iowa State University", "Iowa State University"], "authors": ["Guanqun Yang.....http://dblp.org/pers/hd/y/Yang:Guanqun", "Bin Tong.....http://dblp.org/pers/hd/t/Tong:Bin", "Daji Qiao.....http://dblp.org/pers/hd/q/Qiao:Daji", "Wensheng Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Wensheng"], "conf": "infocom", "year": "2008", "pages": 9}