{"title": "Nested parallelism in transactional memory.", "fields": ["nested transaction", "software transactional memory", "transactional memory", "instruction level parallelism", "data parallelism", "parallel programming model", "atomicity", "task parallelism", "work stealing"], "abstract": "This paper investigates adding transactions with nested parallelism and nested transactions to a dynamically multithreaded parallel programming language that generates only series-parallel programs. We describe XConflict, a data structure that facilitates conflict detection for a software transactional memory system which supports transactions with nested parallelism and unbounded nesting depth. For languages that use a Cilk-like work-stealing scheduler, XConflict answers concurrent conflict queries in  O (1) time and can be maintained efficiently. In particular, for a program with  T  1  work and a span (or critical-path length) of  T  ∞ , the running time on  p  processors of the program augmented with XConflict is only  O ( T  1 / p  +  pT  ∞ ).   Using XConflict, we describe CWSTM, a runtime-system design for software transactional memory which supports transactions with nested parallelism and unbounded nesting depth of transactions. The CWSTM design provides transactional memory with eager updates, eager conflict detection, strong atomicity, and lazy cleanup on aborts. In the restricted case when no transactions abort and there are no concurrent readers, CWSTM executes a transactional computation on  p  processors also in time  O ( T  1 / p  +  pT  ∞ ). Although this bound holds only under rather optimistic assumptions, to our knowledge, this result is the first theoretical performance bound on a TM system that supports transactions with nested parallelism which is independent of the maximum nesting depth of transactions.", "citation": "Citations (90)", "year": "2008", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Instituto Superior Técnico", "Instituto Superior Técnico"], "conf": "ppopp", "authors": ["Kunal Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Kunal", "Jeremy T. Fineman.....http://dblp.org/pers/hd/f/Fineman:Jeremy_T=", "Jim Sukha.....http://dblp.org/pers/hd/s/Sukha:Jim"], "pages": 12}