{"title": "Single-level integrity and confidentiality protection for distributed shared memory multiprocessors.", "fields": ["system on a chip", "data integrity", "overhead", "multiprocessing", "distributed shared memory"], "abstract": "Multiprocessor computer systems are currently widely used in commercial settings to run critical applications. These applications often operate on sensitive data such as customer records, credit card numbers, and financial data. As a result, these systems are the frequent targets of attacks because of the potentially significant gain an attacker could obtain from stealing or tampering with such data. This provides strong motivation to protect the confidentiality and integrity of data in commercial multiprocessor systems through architectural support. Architectural support is able to protect against software-based attacks, and is necessary to protect against hardware-based attacks. In this work, we propose architectural mechanisms to ensure data confidentiality and integrity in Distributed Shared Memory multiprocessors which utilize a point-to-point based interconnection network. Our approach improves upon previous work in this area, mainly in the fact that our approach reduces performance overheads by significantly reducing the amount of cryptographic operations required. Evaluation results show that our approach can protect data confidentiality and integrity in a 16-processor DSM system with an average overhead of 1.6% and a maximum of only 7% across all SPLASH-2 applications.", "citation": "Citations (21)", "departments": ["North Carolina State University", "Georgia Institute of Technology", "North Carolina State University", "Georgia Institute of Technology", "North Carolina State University"], "authors": ["Brian Rogers.....http://dblp.org/pers/hd/r/Rogers:Brian", "Chenyu Yan.....http://dblp.org/pers/hd/y/Yan:Chenyu", "Siddhartha Chhabra.....http://dblp.org/pers/hd/c/Chhabra:Siddhartha", "Milos Prvulovic.....http://dblp.org/pers/hd/p/Prvulovic:Milos", "Yan Solihin.....http://dblp.org/pers/hd/s/Solihin:Yan"], "conf": "hpca", "year": "2008", "pages": 12}