{"title": "Perpendicular Intersection: Locating Wireless Sensors with Mobile Beacon.", "fields": ["signal strength", "sensor node", "perpendicular", "scalability", "sensor array", "pi"], "abstract": "Existing localization approaches are divided into two groups: 1) range based and 2) range free. The range-free schemes often suffer from poor accuracy and low scalability, whereas the range-based localization approaches heavily depend on extra hardware capabilities or on the absolute received signal strength indicator (RSSI) values, which is far from practical. In this paper, we propose a mobile-assisted localization scheme called Perpendicular Intersection (PI), setting up a delicate tradeoff between range-free and range-based approaches. Instead of directly mapping RSSI values into physical distances, by contrasting RSSI values from the mobile beacon to a sensor node, PI utilizes the geometric relationship of a perpendicular intersection to compute node positions. We have implemented the prototype of PI with 100 TelosB motes and evaluated PI in both indoor and outdoor environments. Through comprehensive experiments, we show that PI achieves high accuracy, significantly outperforming the existing range-based and the mobile-assisted localization schemes.", "citation": "Citations (139)", "year": "2008", "departments": ["Ocean University of China", "Ocean University of China", "Ocean University of China", "Ocean University of China", "Tsinghua University", "Ocean University of China", "Ocean University of China", "Ocean University of China", "Ocean University of China", "Hong Kong University of Science and Technology"], "conf": "rtss", "authors": ["Zhongwen Guo.....http://dblp.org/pers/hd/g/Guo:Zhongwen", "Ying Guo.....http://dblp.org/pers/hd/g/Guo:Ying", "Feng Hong.....http://dblp.org/pers/hd/h/Hong:Feng", "Xiaohui Yang.....http://dblp.org/pers/hd/y/Yang:Xiaohui", "Yuan He.....http://dblp.org/pers/hd/h/He_0004:Yuan", "Yuan Feng.....http://dblp.org/pers/hd/f/Feng:Yuan", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "pages": 10}