{"title": "Strategies for mapping dataflow blocks to distributed hardware.", "fields": ["operand", "dataflow", "distributed concurrency control", "thread", "concurrency control"], "abstract": "Distributed processors must balance communication and concurrency. When dividing instructions among the processors, key factors are the available concurrency, criticality of dependence chains, and communication penalties. The amount of concurrency determines the importance of the other factors: if concurrency is high, wider distribution of instructions is likely to tolerate the increased operand routing latencies. If concurrency is low, mapping dependent instructions close to one another is likely to reduce communication costs that contribute to the critical path. This paper explores these tradeoffs for distributed Explicit Dataflow Graph Execution (EDGE) architectures that execute blocks of dataflow instructions atomically. A runtime block mapper assigns instructions from a single thread to distributed hardware resources (cores) based on compiler-assigned instruction identifiers. We explore two approaches: fixed strategies that map all blocks to the same number of cores, and adaptive strategies that vary the number of cores for each block. The results show that best fixed strategy varies, based on the corespsila issue width. A simple adaptive strategy improves performance over the best fixed strategies for single and dual-issue cores, but its benefits decrease as the corespsila issue width increases. These results show that by choosing an appropriate runtime block mapping strategy, average performance can be increased by 18%, while simultaneously reducing average operand communication by 70%, saving energy as well as improving performance. These results indicate that runtime block mapping is a promising mechanism for balancing communication and concurrency in distributed processors.", "citation": "Citations (15)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "Microsoft", "University of Texas at Austin"], "authors": ["Behnam Robatmili.....http://dblp.org/pers/hd/r/Robatmili:Behnam", "Katherine E. Coons.....http://dblp.org/pers/hd/c/Coons:Katherine_E=", "Doug Burger.....http://dblp.org/pers/hd/b/Burger:Doug", "Kathryn S. McKinley.....http://dblp.org/pers/hd/m/McKinley:Kathryn_S="], "conf": "micro", "year": "2008", "pages": 12}