{"title": "ARTOO: adaptive random testing for object-oriented software.", "fields": ["fuzz testing", "orthogonal array testing", "black box testing", "data driven testing", "software reliability testing"], "abstract": "Intuition is often not a good guide to know which testing strategies will work best. There is no substitute for experimental analysis based on objective criteria: how many faults a strategy finds, and how fast. \"Random\" testing is an example of an idea that intuitively seems simplistic or even dumb, but when assessed through such criteria can yield better results than seemingly smarter strategies. The efficiency of random testing is improved if the generated inputs are evenly spread across the input domain. This is the idea of Adaptive Random Testing (ART).   ART was initially proposed for numerical inputs, on which a notion of distance is immediately available. To extend the ideas to the testing of object-oriented software, we have developed a notion of distance between objects and a new testing strategy called ARTOO, which selects as inputs objects that have the highest average distance to those already used as test inputs. ARTOO has been implemented as part of a tool for automated testing of object-oriented software.   We present the ARTOO concepts, their implementation, and a set of experimental results of its application. Analysis of the results shows in particular that, compared to a directed random strategy, ARTOO reduces the number of tests generated until the first fault is found, in some cases by as much as two orders of magnitude. ARTOO also uncovers faults that the random strategy does not find in the time allotted, and its performance is more predictable.", "citation": "Citations (196)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Ilinca Ciupa.....http://dblp.org/pers/hd/c/Ciupa:Ilinca", "Andreas Leitner.....http://dblp.org/pers/hd/l/Leitner:Andreas", "Manuel Oriol.....http://dblp.org/pers/hd/o/Oriol:Manuel", "Bertrand Meyer.....http://dblp.org/pers/hd/m/Meyer_0001:Bertrand"], "conf": "icse", "year": "2008", "pages": 10}