{"title": "Corey: An Operating System for Many Cores.", "fields": ["bottleneck", "multi core processor", "web server", "multiprocessing", "embedded operating system"], "abstract": "Multiprocessor application performance can be limited by the operating system when the application uses the operating system frequently and the operating system services use data structures shared and modified by multiple processing cores. If the application does not need the sharing, then the operating system will become an unnecessary bottleneck to the application's performance.\n\nThis paper argues that applications should control sharing: the kernel should arrange each data structure so that only a single processor need update it, unless directed otherwise by the application. Guided by this design principle, this paper proposes three operating system abstractions (address ranges, kernel cores, and shares) that allow applications to control inter-core sharing and to take advantage of the likely abundance of cores by dedicating cores to specific operating system functions.\n\nMeasurements of microbenchmarks on the Corey prototype operating system, which embodies the new abstractions, show how control over sharing can improve performance. Application benchmarks, using MapReduce and a Web server, show that the improvements can be significant for overall performance: MapReduce on Corey performs 25% faster than on Linux when using 16 cores. Hardware event counters confirm that these improvements are due to avoiding operations that are expensive on multicore machines.", "citation": "Citations (435)", "departments": ["Massachusetts Institute of Technology", "Fudan University", "Fudan University", "Fudan University", "Massachusetts Institute of Technology"], "authors": ["Silas Boyd-Wickizer.....http://dblp.org/pers/hd/b/Boyd=Wickizer:Silas", "Haibo Chen.....http://dblp.org/pers/hd/c/Chen:Haibo", "Rong Chen.....http://dblp.org/pers/hd/c/Chen_0001:Rong", "Yandong Mao.....http://dblp.org/pers/hd/m/Mao:Yandong", "M. Frans Kaashoek.....http://dblp.org/pers/hd/k/Kaashoek:M=_Frans", "Robert Tappan Morris.....http://dblp.org/pers/hd/m/Morris:Robert_Tappan", "Aleksey Pesterev.....http://dblp.org/pers/hd/p/Pesterev:Aleksey", "Lex Stein.....http://dblp.org/pers/hd/s/Stein:Lex", "Ming Wu.....http://dblp.org/pers/hd/w/Wu:Ming", "Yue-hua Dai.....http://dblp.org/pers/hd/d/Dai:Yue=hua", "Yang Zhang.....http://dblp.org/pers/hd/z/Zhang:Yang", "Zheng Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Zheng"], "conf": "osdi", "year": "2008", "pages": 15}