{"title": "An Efficient Identity-Based Batch Verification Scheme for Vehicular Sensor Networks.", "fields": ["authentication", "vehicular ad hoc network", "dedicated short range communications", "scalability", "digital signature"], "abstract": "With the adoption of state-of-the-art telecommunication technologies for sensing and collecting traffic related information, Vehicular Sensor Networks (VSNs) have emerged as a new application scenario that is envisioned to revolutionize the human driving experiences and traffic flow control systems. To avoid any possible malicious attack and resource abuse, employing a digital signature scheme is widely recognized as the most effective approach for VSNs to achieve authentication, integrity, and validity. However, when the number of signatures received by a Roadside Unit (RSU) becomes large, a scalability problem emerges immediately, where the RSU could be difficult to sequentially verify each received signature within 300 ms interval according to the current Dedicated Short Range Communications (DSRC) broadcast protocol. In this paper, we introduce an efficient batch signature verification scheme for communications between vehicles and RSUs (or termed vehicle- to-Infrastructure (V2I) communications), in which an RSU can verify multiple received signatures at the same time such that the total verification time can be dramatically reduced. We demonstrate that the proposed scheme can achieve conditional privacy preservation that is essential in VSNs, where each message launched by a vehicle is mapped to a distinct pseudo identity, while a trust authority can always retrieve the real identity of a vehicle from any pseudo identity. With the proposed scheme, since identity-based cryptography is employed in generating private keys for pseudo identities, certificates are not needed and thus transmission overhead can be significantly reduced.", "citation": "Citations (449)", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Chenxi Zhang.....http://dblp.org/pers/hd/z/Zhang:Chenxi", "Rongxing Lu.....http://dblp.org/pers/hd/l/Lu:Rongxing", "Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong", "Pin-Han Ho.....http://dblp.org/pers/hd/h/Ho:Pin=Han", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin"], "conf": "infocom", "year": "2008", "pages": 5}