{"title": "High performance dense linear algebra on a spatially distributed processor.", "fields": ["linear algebra", "matrix multiplication", "cache", "instruction level parallelism", "uniprocessor system"], "abstract": "As technology trends have limited the performance scaling of conventional processors, industry and academic research has turned to parallel architectures on a single chip, including distributed uniprocessors and multicore chips. This paper examines how to extend the archtypical operation of dense linear algebra, matrix multiply, to an emerging class of uniprocessor architectures characterized by a large number of independent functional units, register banks, and cache banks connected by a 2-D on-chip network. We extend the well known algorithm for matrix multiplication by Goto to this spatially distributed class of uniprocessor and describe the optimizations of the innermost kernel, a systolic-like algorithm running on a general purpose uniprocessor. The resulting implementation yields the first demonstration of high-performance in an application executing on the TRIPS processor hardware, a next-generation distributed processor core. We show that such processors are indeed capable of substantial improvements in single threaded performance provided their spatial topography is taken into account.", "citation": "Citations (7)", "year": "2008", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "conf": "ppopp", "authors": ["Jeffrey R. Diamond.....http://dblp.org/pers/hd/d/Diamond:Jeffrey_R=", "Behnam Robatmili.....http://dblp.org/pers/hd/r/Robatmili:Behnam", "Stephen W. Keckler.....http://dblp.org/pers/hd/k/Keckler:Stephen_W=", "Robert A. van de Geijn.....http://dblp.org/pers/hd/g/Geijn:Robert_A=_van_de", "Kazushige Goto.....http://dblp.org/pers/hd/g/Goto:Kazushige", "Doug Burger.....http://dblp.org/pers/hd/b/Burger:Doug"], "pages": 10}