{"title": "Colibri: fast mining of large static and dynamic graphs.", "fields": ["singular value decomposition", "low rank approximation", "adjacency matrix", "sparse matrix", "orders of magnitude"], "abstract": "Low-rank approximations of the adjacency matrix of a graph are essential in finding patterns (such as communities) and detecting anomalies. Additionally, it is desirable to track the low-rank structure as the graph evolves over time, efficiently and within limited storage. Real graphs typically have thousands or millions of nodes, but are usually very sparse. However, standard decompositions such as SVD do not preserve sparsity. This has led to the development of methods such as CUR and CMD, which seek a non-orthogonal basis by sampling the columns and/or rows of the sparse matrix.   However, these approaches will typically produce overcomplete bases, which wastes both space and time. In this paper we propose the family of  Colibri  methods to deal with these challenges. Our version for static graphs,  Colibri-S , iteratively finds a non-redundant basis and we prove that it has no loss of accuracy compared to the best competitors (CUR and CMD), while achieving significant savings in space and time: on real data,  Colibri-S  requires much less space and is  orders of magnitude  faster (in proportion to the square of the number of non-redundant columns). Additionally, we propose an efficient update algorithm for dynamic, time-evolving graphs,  Colibri-D . Our evaluation on a large, real network traffic dataset shows that  Colibri-D  is over  100 times  faster than the best published competitor (CMD).", "citation": "Citations (118)", "departments": ["Carnegie Mellon University", "IBM", "IBM", "University of Illinois at Chicago", "Carnegie Mellon University"], "authors": ["Hanghang Tong.....http://dblp.org/pers/hd/t/Tong:Hanghang", "Spiros Papadimitriou.....http://dblp.org/pers/hd/p/Papadimitriou:Spiros", "Jimeng Sun.....http://dblp.org/pers/hd/s/Sun:Jimeng", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S=", "Christos Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Christos"], "conf": "kdd", "year": "2008", "pages": 9}