{"title": "Order consistent change detection via fast statistical significance testing.", "fields": ["filter", "change detection", "ordinal number", "monotonic function", "quantization"], "abstract": "Robustness to illumination variations is a key requirement for the problem of change detection which in turn is a fundamental building block for many visual surveillance applications. The use of ordinal measures is a powerful way of filtering out illumination dependency in representing appearance, and several such measures have been proposed in the past for change detection. By design, these measures are invariant to unknown monotonic transformations that may be caused due to global illumination changes or automatic camera gain. However, previous work has left theoretical and practical gaps that limit their full potential from being realized. For instance, random noise has not been given a principled treatment. In this paper, we formulate the change detection problem in terms of order consistency and show that in the presence of noise with known statistical properties, significance tests for order consistency yield much better results than the state of the art. Since ordinal measures require a reordering of patches, they are usually expensive in practice (O(n*log n) at best). We improve upon this by connecting the problem to monotonic regression, and applying a fast algorithm from the corresponding literature. We also show that good trade offs between speed and accuracy can be made by quantization to achieve accurate and very fast matching algorithms in practice. We demonstrate superior performance on statistical simulations as well as real image sequences.", "citation": "Citations (10)", "year": "2008", "departments": ["Princeton University", "Princeton University", "Princeton University"], "conf": "cvpr", "authors": ["Maneesh Singh.....http://dblp.org/pers/hd/s/Singh:Maneesh", "Vasu Parameswaran.....http://dblp.org/pers/hd/p/Parameswaran:Vasu", "Visvanathan Ramesh.....http://dblp.org/pers/hd/r/Ramesh:Visvanathan"], "pages": -1}