{"title": "Address-branch correlation: A novel locality for long-latency hard-to-predict branches.", "fields": ["pointer", "branch predictor", "cache", "locality of reference", "instruction window"], "abstract": "Hard-to-predict branches depending on long-latency cache-misses have been recognized as a major performance obstacle for modern microprocessors. With the widening speed gap between memory and microprocessors, such long-latency branch mispredictions also waste substantial power/energy in executing instructions on wrong paths, especially for large instruction window processors. This paper presents a novel program locality that can be exploited to handle long-latency hard-to-predict branches. The locality is a result of an interesting program execution behavior: for some applications, major data structures or key components of the data structures tend to remain stable for a long time. If a hard-to-predict branch depends on such stable data, the address of the data rather than the data value is sufficient to determine the branch outcome. This way, a misprediction can be resolved much more promptly when the data access results in a long-latency cache miss. We call such locality address-branch correlation and we show that certain memory-intensive benchmarks, especially those with heavy pointer chasing, exhibit this locality. We then propose a low-cost auxiliary branch predictor to exploit address-branch correlation. Our experimental results show that the proposed scheme reduces the execution time by 6.3% (up to 27%) and energy consumption by 5.2% (up to 24%) for a set of memory-intensive benchmarks with a 9 kB prediction table when used with a state-of-art 16 kB TAGE predictor.", "citation": "Citations (13)", "departments": ["University of Central Florida", "University of Central Florida", "University of Central Florida", "University of Central Florida"], "authors": ["Hongliang Gao.....http://dblp.org/pers/hd/g/Gao:Hongliang", "Yi Ma.....http://dblp.org/pers/hd/m/Ma:Yi", "Martin Dimitrov.....http://dblp.org/pers/hd/d/Dimitrov:Martin", "Huiyang Zhou.....http://dblp.org/pers/hd/z/Zhou:Huiyang"], "conf": "hpca", "year": "2008", "pages": 12}