{"title": "An approach to detecting duplicate bug reports using natural language and execution information.", "fields": ["bug tracking system", "small number", "software bug", "public domain software", "natural language"], "abstract": "An open source project typically maintains an open bug repository so that bug reports from all over the world can be gathered. When a new bug report is submitted to the repository, a person, called a triager, examines whether it is a duplicate of an existing bug report. If it is, the triager marks it as duplicate and the bug report is removed from consideration for further work. In the literature, there are approaches exploiting only natural language information to detect duplicate bug reports. In this paper we present a new approach that further involves execution information. In our approach, when a new bug report arrives, its natural language information and execution information are compared with those of the existing bug reports. Then, a small number of existing bug reports are suggested to the triager as the most similar bug reports to the new bug report. Finally, the triager examines the suggested bug reports to determine whether the new bug report duplicates an existing bug report. We calibrated our approach on a subset of the Eclipse bug repository and evaluated our approach on a subset of the Firefox bug repository. The experimental results show that our approach can detect 67%-93% of duplicate bug reports in the Firefox bug repository, compared to 43%-72% using natural language information alone.", "citation": "Citations (439)", "departments": ["Peking University", "Peking University", "North Carolina State University", "University of Victoria", "Peking University"], "authors": ["Xiaoyin Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoyin", "Lu Zhang.....http://dblp.org/pers/hd/z/Zhang_0023:Lu", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "John Anvik.....http://dblp.org/pers/hd/a/Anvik:John", "Jiasu Sun.....http://dblp.org/pers/hd/s/Sun:Jiasu"], "conf": "icse", "year": "2008", "pages": 10}