{"title": "Interactive generation of integrated schemas.", "fields": ["star schema", "enumeration", "schema migration", "conceptual schema", "database schema"], "abstract": "Schema integration is the problem of creating a unified target schema based on a set of existing source schemas that relate to each other via specified correspondences. The unified schema gives a standard representation of the data, thus offering a way to deal with the heterogeneity in the sources. In this paper, we develop a method and a design tool that provide: 1) adaptive enumeration of multiple interesting integrated schemas, and 2) easy-to-use capabilities for refining the enumerated schemas via user interaction. Our method is a departure from previous approaches to schema integration, which do not offer a systematic exploration of the possible integrated schemas.   The method operates at a logical level, where we recast each source schema into a graph of concepts with Has-A relationships. We then identify matching concepts in different graphs by taking into account the correspondences between their attributes. For every pair of matching concepts, we have two choices: merge them into one integrated concept or keep them as separate concepts. We develop an algorithm that can systematically output, without duplication, all possible integrated schemas resulting from the previous choices. For each integrated schema, the algorithm also generates a mapping from the source schemas to the integrated schema that has precise information-preserving properties. Furthermore, we avoid a full enumeration, by allowing users to specify constraints on the merging process, based on the schemas produced so far. These constraints are then incorporated in the enumeration of the subsequent schemas. The result is an adaptive and interactive enumeration method that significantly reduces the space of alternative schemas, and facilitates the selection of the final integrated schema.", "citation": "Citations (82)", "year": "2008", "departments": ["University of California, Santa Cruz", "IBM", "IBM"], "conf": "sigmod", "authors": ["Laura Chiticariu.....http://dblp.org/pers/hd/c/Chiticariu:Laura", "Phokion G. Kolaitis.....http://dblp.org/pers/hd/k/Kolaitis:Phokion_G=", "Lucian Popa.....http://dblp.org/pers/hd/p/Popa_0001:Lucian"], "pages": 14}