{"title": "Channel Aware Distributed Scheduling for Exploiting Multi-Receiver Diversity and Multiuser Diversity in Ad-Hoc Networks: A Unified PHY/MAC Approach.", "fields": ["throughput", "optimal stopping", "random access", "channel", "physical layer"], "abstract": "We study channel aware distributed scheduling in ad hoc networks where many links contend for the common channel using random access, and the focus here is on the model where each transmitter node has multiple intended receivers. In such a network, channel probing takes place in two phases: 1) in phase I, all transmitters contend for the channel using random access to reserve the channel, and the probing to accomplish a successful channel contention takes a random duration; and 2) in phase II, subsequent probings are carried out to estimate the link conditions from the successful transmitter in phase I to its intended receivers, according to specific probing mechanisms, and the probing for each receiver takes a constant duration. In this paper, we shall study various probing mechanisms for utilizing multi-receiver diversity in phase II and multiuser diversity in phase I for ad hoc (peer-to-peer) communications. Clearly, further probing increases the likelihood of seeing better channel conditions for exploiting diversities, but at the cost of additional time. Therefore, channel probing must be done efficiently to balance the tradeoff between the throughput gain from better channel conditions and the probing cost. One main objective of this study is to characterize this tradeoff in a stochastic decision making framework. Specifically, we cast network throughput optimization as an optimal stopping problem, and then explore channel aware distributed scheduling to leverage multi-receiver diversity and multiuser diversity in a joint manner. We show that the optimal scheduling policies for all proposed probing mechanisms exhibit threshold structures, indicating that they are amenable to easy distributed implementation. We show that the optimal thresholds and the maximum network throughput can be obtained off-line by solving fixed point equations. We further develop iterative algorithms to compute the optimal thresholds and the throughput.", "citation": "Citations (11)", "departments": ["Arizona State University", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Electrical, Com ... chool of (ECEE)"], "authors": ["Dong Zheng.....http://dblp.org/pers/hd/z/Zheng:Dong", "Min Cao.....http://dblp.org/pers/hd/c/Cao:Min", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan", "P. R. Kumar.....http://dblp.org/pers/hd/k/Kumar:P=_R="], "conf": "infocom", "year": "2008", "pages": 9}