{"title": "Capacity of Asynchronous Random-Access Scheduling in Wireless Networks.", "fields": ["rate monotonic scheduling", "two level scheduling", "round robin scheduling", "fair share scheduling", "maximum throughput scheduling"], "abstract": "We study the throughput capacity of wireless networks which employ (asynchronous) random-access scheduling as opposed to deterministic scheduling. The central question we answer is: how should we set the channel-access probability for each link in the network so that the network operates close to its optimal throughput capacity? We design simple and distributed channel-access strategies for random-access networks which are provably competitive with respect to the optimal scheduling strategy, which is deterministic, centralized, and computationally infeasible. We show that the competitiveness of our strategies are nearly the best achievable via random-access scheduling, thus establishing fundamental limits on the performance of random- access. A notable outcome of our work is that random access compares well with deterministic scheduling when link transmission durations differ by small factors, and much worse otherwise. The distinguishing aspects of our work include modeling and rigorous analysis of asynchronous communication, asymmetry in link transmission durations, and hidden terminals under arbitrary link-conflict based wireless interference models.", "citation": "Citations (21)", "departments": ["Virginia Tech", "Virginia Bioinformatics Institute", "IBM"], "authors": ["Deepti Chafekar.....http://dblp.org/pers/hd/c/Chafekar:Deepti", "Dave Levin.....http://dblp.org/pers/hd/l/Levin:Dave", "V. S. Anil Kumar.....http://dblp.org/pers/hd/k/Kumar:V=_S=_Anil", "Madhav V. Marathe.....http://dblp.org/pers/hd/m/Marathe:Madhav_V=", "Srinivasan Parthasarathy.....http://dblp.org/pers/hd/p/Parthasarathy_0002:Srinivasan", "Aravind Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Aravind"], "conf": "infocom", "year": "2008", "pages": 9}