{"title": "XStream: a Signal-Oriented Data Stream Management System.", "fields": ["stream processing", "asynchronous communication", "data stream management system", "event stream processing", "memory management"], "abstract": "Sensors capable of sensing phenomena at high data rates on the order of tens to hundreds of thousands of samples per second are now widely deployed in many industrial, civil engineering, scientific, networking, and medical applications. In aggregate, these sensors easily generate several million samples per second that must be processed within milliseconds or seconds. The computation required includes both signal processing and event stream processing. XStream is a stream processing system for such applications. XStream introduces a new data type, the signal segment, which allows applications to manipulate isochronous (regularly spaced in time) collections of sensor samples more conveniently and efficiently than the asynchronous representation used in previous work. XStream includes a memory manager and scheduler optimizations tuned for processing signal segments at high speeds. In benchmark comparisons, we show that XStream outperforms a leading commercial stream processing system by more than three orders of magnitude. On one application, the commercial system processed 72.7 Ksamples/sec, while XStream processed 97.6 Msamples/sec.", "citation": "Citations (72)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Lewis Girod.....http://dblp.org/pers/hd/g/Girod:Lewis", "Yuan Mei.....http://dblp.org/pers/hd/m/Mei:Yuan", "Ryan Newton.....http://dblp.org/pers/hd/n/Newton:Ryan", "Stanislav Rost.....http://dblp.org/pers/hd/r/Rost:Stanislav", "Arvind Thiagarajan.....http://dblp.org/pers/hd/t/Thiagarajan:Arvind", "Hari Balakrishnan.....http://dblp.org/pers/hd/b/Balakrishnan:Hari", "Samuel Madden.....http://dblp.org/pers/hd/m/Madden:Samuel"], "conf": "icde", "year": "2008", "pages": 10}