{"title": "Online design bug detection: RTL analysis, flexible mechanisms, and evaluation.", "fields": ["formal verification", "bebugging", "software bug", "opensparc", "multiprocessing"], "abstract": "Higher level of resource integration and the addition of new features in modern multi-processors put a significant pressure on their verification. Although a large amount of resources and time are devoted to the verification phase of modern processors, many design bugs escape the verification process and slip into processors operating in the field. These design bugs often lead to lower quality products, lower customer satisfaction, diminishing brand/company reputation, or even expensive product recalls. This paper proposes a flexible, low-overhead mechanism to detect the occurrence of design bugs during on-line operation. First, we analyze the actual design bugs found and fixed in a commercial chip- multiprocessor, Sun's OpenSPARC Tl, to understand the behavior and characteristics of design bugs. Our RTL analysis of design bugs shows that the number of signals that need to be monitored to detect design bugs is significantly larger than suggested by previous studies that analyzed design bugs at a higher level using processor errata sheets. Second, based on the insights obtained from our analyses, we propose a programmable, distributed online design bug detection mechanism that incorporates the monitoring of bugs into the flip-flops of the design. The key contribution of our mechanism is its ability to monitor all control signals in the design rather than a set of signals selected at design time. As a result, it is very flexible: when a bug is discovered after the processor is shipped, it can be detected by monitoring the set of control signals that trigger the design bug. We develop an RTL prototype implementation of our mechanism on the OpenSPARC Tl chip multiprocessor. We found its area overhead to be 10% and its power consumption overhead to be 3.5% over the whole OpenSPARC Tl chip.", "citation": "Citations (73)", "departments": ["University of Michigan", "Carnegie Mellon University", "University of Michigan"], "authors": ["Kypros Constantinides.....http://dblp.org/pers/hd/c/Constantinides:Kypros", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur", "Todd M. Austin.....http://dblp.org/pers/hd/a/Austin:Todd_M="], "conf": "micro", "year": "2008", "pages": 12}