{"title": "First-Order Algorithm with O(ln(1/e)) Convergence for e-Equilibrium in Two-Person Zero-Sum Games.", "fields": ["inner loop", "interior point method", "exponential function", "zero sum game", "iterated function"], "abstract": "We propose an iterated version of Nesterov's first-order smoothing method for the two-person zero-sum game equilibrium problem minx∈Q1 maxy∈Q2 xT Ay = maxy∈Q2 minx∈Q1 xTAy. This formulation applies to matrix games as well as sequential games. Our new algorithmic scheme computes an E-equilibrium to this min-max problem in O(κ(A) In(1/E)) first-order iterations, where κ(A) is a certain condition measure of the matrix A. This improves upon the previous first-order methods which required O(1/E) iterations, and it matches the iteration complexity bound of interior-point methods in terms of the algorithm's dependence on E. Unlike the interior-point methods that are inapplicable to large games due to their memory requirements, our algorithm retains the small memory requirements of prior first-order methods. Our scheme supplements Nesterov's algorithm with an outer loop that lowers the target E between iterations (this target affects the amount of smoothing in the inner loop). We find it surprising that such a simple modification yields an exponential speed improvement. Finally, computational experiments both in matrix games and sequential games show that a significant speed improvement is obtained in practice as well, and the relative speed improvement increases with the desired accuracy (as suggested by the complexity bounds).", "citation": "Citations (25)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Andrew Gilpin.....http://dblp.org/pers/hd/g/Gilpin:Andrew", "Javier Peña.....http://dblp.org/pers/hd/p/Pe=ntilde=a:Javier", "Tuomas Sandholm.....http://dblp.org/pers/hd/s/Sandholm:Tuomas"], "conf": "aaai", "year": "2008", "pages": 8}