{"title": "Scalable network distance browsing in spatial databases.", "fields": ["distance", "database", "yen s algorithm", "scalability", "floyd warshall algorithm", "constrained shortest path first", "shortest path faster algorithm", "computer science"], "abstract": "An algorithm is presented for finding the  k  nearest neighbors in a spatial network in a best-first manner using network distance. The algorithm is based on precomputing the shortest paths between all possible vertices in the network and then making use of an encoding that takes advantage of the fact that the shortest paths from vertex  u  to all of the remaining vertices can be decomposed into subsets based on the first edges on the shortest paths to them from  u . Thus, in the worst case, the amount of work depends on the number of objects that are examined and the number of links on the shortest paths to them from  q , rather than depending on the number of vertices in the network. The amount of storage required to keep track of the subsets is reduced by taking advantage of their spatial coherence which is captured by the aid of a shortest path quadtree. In particular, experiments on a number of large road networks as well as a theoretical analysis have shown that the storage has been reduced from  O ( N  3 ) to  O ( N  1.5 ) (i.e., by an order of magnitude equal to the square root). The precomputation of the shortest paths along the network essentially decouples the process of computing shortest paths along the network from that of finding the neighbors, and thereby also decouples the domain  S  of the query objects and that of the objects from which the neighbors are drawn from the domain  V  of the vertices of the spatial network. This means that as long as the spatial network is unchanged, the algorithm and underlying representation of the shortest paths in the spatial network can be used with different sets of objects.", "citation": "Not cited", "year": "2008", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "conf": "sigmod", "authors": ["Hanan Samet.....http://dblp.org/pers/hd/s/Samet:Hanan", "Jagan Sankaranarayanan.....http://dblp.org/pers/hd/s/Sankaranarayanan:Jagan", "Houman Alborzi.....http://dblp.org/pers/hd/a/Alborzi:Houman"], "pages": 12}