{"title": "Mitigating the impact of hardware defects on multimedia applications: a cross-layer approach.", "fields": ["soft error", "exploit", "application layer", "middleware", "electronic system level design and verification"], "abstract": "Increasing exponentially with each technology generation, hardware-induced soft errors pose a significant threat for the reliability of mobile multimedia devices. Since traditional hardware error protection techniques incur significant power and performance overheads, this paper proposes a cooperative cross-layer approach that exploits existing error control schemes at the application layer to mitigate the impact of hardware defects. Specifically, we propose error detection codes in hardware, drop and forward recovery in middleware, and error-resilient video encoding at the application level to effectively and efficiently combat soft errors with minimal overheads. Experimental evaluation on standard test video streams demonstrates that our cooperative error-aware method for video encoding improves performance by 60% and energy consumption by 58% with even better reliability at the cost of only 3% quality degradation on average, as compared to an error correction code based hardware protection technique. Combining intelligent schemes to select a recovery mechanism can guide system designers to trade off multiple constraints such as performance, power, reliability, and QoS.", "citation": "Citations (13)", "departments": ["University of California, Irvine", "Arizona State University", "University of California, Irvine", "University of California, Irvine", "University of California, Irvine"], "authors": ["Kyoungwoo Lee.....http://dblp.org/pers/hd/l/Lee:Kyoungwoo", "Aviral Shrivastava.....http://dblp.org/pers/hd/s/Shrivastava:Aviral", "Minyoung Kim.....http://dblp.org/pers/hd/k/Kim:Minyoung", "Nikil D. Dutt.....http://dblp.org/pers/hd/d/Dutt:Nikil_D=", "Nalini Venkatasubramanian.....http://dblp.org/pers/hd/v/Venkatasubramanian:Nalini"], "conf": "mm", "year": "2008", "pages": 10}