{"title": "Muse: a system for understanding and designing mappings.", "fields": ["natural mapping", "correctness", "data exchange", "data mapping", "design tool"], "abstract": "Schema mappings are logical assertions that specify the relationships between a source and a target schema in a declarative way. The specification of such mappings is a fundamental problem in information integration. Mappings can be generated by existing mapping systems (semi-)automatically from a visual specification between two schemas. In general, the well-known 80-20 rule applies for mapping generation tools. They can automate 80% of the work, covering common cases and creating a mapping that is close to correct. However, ensuring complete correctness can still require intricate manual work to perfect portions of the mapping.   Previous research on mapping understanding and refinement and anecdotal evidence from mapping designers suggest that the mapping design process can be perfected by using data examples to explain the mapping and alternative mappings. We demonstrate Muse, a data example driven mapping design tool currently implemented on top of the Clio schema mapping system. Muse leverages data examples that are familiar to a designer to illustrate nuances of how a small change to a mapping specification changes its semantics. We demonstrate how Muse can differentiate between alternative mapping specifications and infer the desired mapping semantics based on the designer's actions on a short sequence of simple data examples.", "citation": "Citations (17)", "year": "2008", "departments": ["University of California, Santa Cruz", "University of California, Santa Cruz", "University of Toronto", "University of California, Santa Cruz", "University of California, Santa Cruz"], "conf": "sigmod", "authors": ["Bogdan Alexe.....http://dblp.org/pers/hd/a/Alexe:Bogdan", "Laura Chiticariu.....http://dblp.org/pers/hd/c/Chiticariu:Laura", "Renée J. Miller.....http://dblp.org/pers/hd/m/Miller:Ren=eacute=e_J=", "Daniel Pepper.....http://dblp.org/pers/hd/p/Pepper:Daniel", "Wang Chiew Tan.....http://dblp.org/pers/hd/t/Tan:Wang_Chiew"], "pages": 4}