{"title": "Low-power, high-performance analog neural branch prediction.", "fields": ["snap", "branch predictor", "analog device", "analog multiplier", "reduced cost"], "abstract": "Shrinking transistor sizes and a trend toward low-power processors have caused increased leakage, high per-device variation and a larger number of hard and soft errors. Maintaining precise digital behavior on these devices grows more expensive with each technology generation. In some cases, replacing digital units with analog equivalents allows similar computation to be performed at higher speed and lower power. The units that can most easily benefit from this approach are those whose results do not have to be precise, such as various types of predictors. We introduce the Scaled Neural Predictor (SNP), a highly accurate prediction algorithm that is infeasible in a purely digital implementation, but can be implemented using analog circuitry. Our analog implementation, the Scaled Neural Analog Predictor (SNAP), uses current summation in place of the expensive digital dot-product computation required in neural predictors. We show that the analog predictor can outperform digital neural predictors because of the reduced cost, in power and latency, of the key computations. The SNAP circuit is able to produce an accuracy nearly equivalent to an infeasible digital neural predictor that requires 128 additions per prediction. The analog version, however, can run at 3 GHz, with the analog portion of the prediction computation requiring approximately 7 milliwatts at a 45 nm technology, which is small compared to the power required for the table lookups in this and conventional predictors.", "citation": "Citations (26)", "departments": ["University of Texas at Austin", "University of Texas at San Antonio", "Microsoft"], "authors": ["Renée St. Amant.....http://dblp.org/pers/hd/a/Amant:Ren=eacute=e_St=", "Daniel A. Jiménez.....http://dblp.org/pers/hd/j/Jim=eacute=nez:Daniel_A=", "Doug Burger.....http://dblp.org/pers/hd/b/Burger:Doug"], "conf": "micro", "year": "2008", "pages": 12}