{"title": "Fair Scheduling through Packet Election.", "fields": ["proportionally fair", "fairness measure", "round robin scheduling", "fair queuing", "maximum throughput scheduling"], "abstract": "In this paper, we consider the problem of designing a scheduling algorithm for input queued switches, that is both fair as well as throughput optimal. Most of the existing literature on input-queued switch fairness criteria concentrates on flow-based fairness. Since a large fraction of network traffic is about \"short- flows\" there is a need for packet-based fairness criterion. The significant body of literature developed over the past two decades for packet-based scheduling algorithms is primarily concerned with throughput and delay, but not fairness. One of the reasons for such a state of affairs is the lack of a proper definition for packet-based fairness. The difficulty in defining fair stems from the fact that any reasonable notion of fairness must combine the well-known notion of fairness for a single-queue with the scheduling constraint of an input queued switch in an appropriate manner. As one of the main results of this paper, we define a notion of packet-based fair scheduling by identifying it as the selection of a winner in the following ranked election: packets are voters; schedules are candidates and each packet ranks different schedules based on their priorities. Drawing upon the seminal work of Goodman and Markowitz (1952) on ranked elections, we obtain a unique characterization of the fair schedule. Another important contribution of this paper is proving that the thus obtained fair scheduling algorithm is throughput optimal. There is no a priori reason why this should be true, and we introduce some non-standard proof techniques to prove the result. Our results suggest a framework for defining fair scheduling algorithm for a constrained packet network; a nonstandard method to prove throughput stability for algorithms, such as ours, that are not based on queue-sizes.", "citation": "Citations (6)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Srikanth Jagabathula.....http://dblp.org/pers/hd/j/Jagabathula:Srikanth", "Vishal Doshi.....http://dblp.org/pers/hd/d/Doshi:Vishal", "Devavrat Shah.....http://dblp.org/pers/hd/s/Shah:Devavrat"], "conf": "infocom", "year": "2008", "pages": 5}