{"title": "SybilLimit: A Near-Optimal Social Network Defense against Sybil Attacks.", "fields": ["network security", "internet privacy", "social network", "computer security", "sybil attack", "voting", "small number", "authorization"], "abstract": "Open-access distributed systems such as peer-to-peer systems are particularly vulnerable to  sybil attacks , where a malicious user creates multiple fake identities (called  sybil nodes ). Without a trusted central authority that can tie identities to real human beings, defending against sybil attacks is quite challenging. Among the small number of decentralized approaches, our recent SybilGuard protocol leverages a key insight on social networks to bound the number of sybil nodes accepted. Despite its promising direction, SybilGuard can allow a large number of sybil nodes to be accepted. Furthermore, SybilGuard assumes that social networks are fast-mixing, which has never been confirmed in the real world. This paper presents the novel SybilLimit protocol that leverages the same insight as SybilGuard, but offers dramatically improved and near-optimal guarantees. The number of sybil nodes accepted is reduced by a factor of  Θ(√n ), or around 200 times in our experiments for a million-node system. We further prove that SybilLimit's guarantee is at most a  logn  factor away from optimal when considering approaches based on fast-mixing social networks. Finally, based on three large-scale real-world social networks, we provide the first evidence that real-world social networks are indeed fast-mixing. This validates the fundamental assumption behind SybilLimit's and SybilGuard's approach.", "citation": "Citations (715)", "departments": ["National University of Singapore", "Intel", "Intel", "National University of Singapore", "National University of Singapore", "Intel", "National University of Singapore"], "authors": ["Haifeng Yu.....http://dblp.org/pers/hd/y/Yu:Haifeng", "Phillip B. Gibbons.....http://dblp.org/pers/hd/g/Gibbons:Phillip_B=", "Michael Kaminsky.....http://dblp.org/pers/hd/k/Kaminsky:Michael", "Feng Xiao.....http://dblp.org/pers/hd/x/Xiao:Feng"], "conf": "sp", "year": "2008", "pages": 15}