{"title": "On Wireless Social Community Networks.", "fields": ["service provider", "dynamic pricing", "municipal wireless network", "wireless site survey", "wireless wan"], "abstract": "Wireless social community networks are emerging as a new alternative to providing wireless data access in urban areas. By relying on users in the network deployment, a wireless community can rapidly deploy a high-quality data access infrastructure in an inexpensive way. But, the coverage of such a network is limited by the set of access points deployed by the users. Currently, it is not clear if this paradigm can serve as a replacement of existing centralized networks operating in licensed bands (such as cellular networks) or if it should be considered as a complimentary service only, with limited coverage. This question currently concerns many wireless network operators. In this paper, we study the dynamics of wireless social community networks by using a simple analytical model. In this model, users choose their service provider based on the subscription fee and the offered coverage. We show how the evolution of social community networks depends on their initial coverage, the subscription fee, and the user preferences for coverage. We conclude that by using an efficient static or dynamic pricing strategy, the wireless social community can obtain a high coverage. Using a game-theoretic approach, we then study a case where the mobile users can choose between the services provided by a licensed band operator and those of a social community. We show that for specific distribution of user preferences, there exists a Nash equilibrium for this non-cooperative game.", "citation": "Citations (90)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of Toronto", "École Polytechnique Fédérale de Lausanne"], "authors": ["Mohammad Hossein Manshaei.....http://dblp.org/pers/hd/m/Manshaei:Mohammad_Hossein", "Julien Freudiger.....http://dblp.org/pers/hd/f/Freudiger:Julien", "Márk Félegyházi.....http://dblp.org/pers/hd/f/F=eacute=legyh=aacute=zi:M=aacute=rk", "Peter Marbach.....http://dblp.org/pers/hd/m/Marbach:Peter", "Jean-Pierre Hubaux.....http://dblp.org/pers/hd/h/Hubaux:Jean=Pierre"], "conf": "infocom", "year": "2008", "pages": 9}