{"title": "GVT: a platform to create virtual environments for procedural training.", "fields": ["virtual training", "virtual reality", "simulation", "reuse", "virtual machine"], "abstract": "The use of virtual environments for training is strongly stimulated by important needs for training on sensitive equipments. Yet, developing such an application is often done without reusing existing components, which requires a huge amount of time. We present in this paper a full authoring platform to facilitate the development of both new virtual environments and pedagogical information for procedural training. This platform, named GVT (generic virtual training) relies on innovative models and provides authoring tools which allow capitalizing on the developments realized. We present a generic model named STORM, used to describe reusable behaviors for 3D objects and reusable interactions between those objects. We also present a scenario language named LORA which allows non computer scientists to author various and complex sequences of tasks in a virtual scene. Based on those models, as an industrial validation with Nexter-Group, more than fifty operational scenarios of maintenance training on military equipments have been realized so far. We have also set up an assessment campaign, and we expose in this paper the first results which show that GVT enables trainees to learn procedures efficiently. The platform keeps on evolving and training on collaborative procedures will soon be available.", "citation": "Citations (87)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Intelligence and National Security Alliance", "CERV-UBO, e-mai ... r@univ-brest.fr", "CERV-ENIB, e-ma ... tisseau@cerv.fr"], "authors": ["Stéphanie Gerbaud.....http://dblp.org/pers/hd/g/Gerbaud:St=eacute=phanie", "Nicolas Mollet.....http://dblp.org/pers/hd/m/Mollet:Nicolas", "Franck Ganier.....http://dblp.org/pers/hd/g/Ganier:Franck", "Bruno Arnaldi.....http://dblp.org/pers/hd/a/Arnaldi:Bruno", "Jacques Tisseau.....http://dblp.org/pers/hd/t/Tisseau:Jacques"], "conf": "vr", "year": "2008", "pages": 8}