{"title": "Facetnet: a framework for analyzing communities and their evolutions in dynamic networks.", "fields": ["time complexity", "non negative matrix factorization", "noisy data", "social network", "unified process"], "abstract": "We discover communities from social network data, and analyze the community evolution. These communities are inherent characteristics of human interaction in online social networks, as well as paper citation networks. Also, communities may evolve over time, due to changes to individuals' roles and social status in the network as well as changes to individuals' research interests. We present an innovative algorithm that deviates from the traditional two-step approach to analyze community evolutions. In the traditional approach, communities are first detected for each time slice, and then compared to determine correspondences. We argue that this approach is inappropriate in applications with noisy data. In this paper, we propose FacetNet for analyzing communities and their evolutions through a robust unified process. In this novel framework, communities not only generate evolutions, they also are regularized by the temporal smoothness of evolutions. As a result, this framework will discover communities that jointly maximize the fit to the observed data and the temporal evolution. Our approach relies on formulating the problem in terms of non-negative matrix factorization, where communities and their evolutions are factorized in a unified way. Then we develop an iterative algorithm, with proven low time complexity, which is guaranteed to converge to an optimal solution. We perform extensive experimental studies, on both synthetic datasets and real datasets, to demonstrate that our method discovers meaningful communities and provides additional insights not directly obtainable from traditional methods.", "citation": "Citations (382)", "departments": ["Arizona State University", "Arizona State University", "Yahoo!", "NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA"], "authors": ["Yu-Ru Lin.....http://dblp.org/pers/hd/l/Lin:Yu=Ru", "Yun Chi.....http://dblp.org/pers/hd/c/Chi:Yun", "Shenghuo Zhu.....http://dblp.org/pers/hd/z/Zhu:Shenghuo", "Hari Sundaram.....http://dblp.org/pers/hd/s/Sundaram:Hari", "Belle L. Tseng.....http://dblp.org/pers/hd/t/Tseng:Belle_L="], "conf": "www", "year": "2008", "pages": 10}