{"title": "SIFT-Bag kernel for video event analysis.", "fields": ["polynomial kernel", "radial basis function kernel", "string kernel", "tree kernel", "kernel embedding of distributions"], "abstract": "In this work, we present a SIFT-Bag based generative-to-discriminative framework for addressing the problem of video event recognition in unconstrained news videos. In the generative stage, each video clip is encoded as a bag of SIFT feature vectors, the distribution of which is described by a Gaussian Mixture Models (GMM). In the discriminative stage, the SIFT-Bag Kernel is designed for characterizing the property of Kullback-Leibler divergence between the specialized GMMs of any two video clips, and then this kernel is utilized for supervised learning in two ways. On one hand, this kernel is further refined in discriminating power for centroid-based video event classification by using the Within-Class Covariance Normalization approach, which depresses the kernel components with high-variability for video clips of the same event. On the other hand, the SIFT-Bag Kernel is used in a Support Vector Machine for margin-based video event classification. Finally, the outputs from these two classifiers are fused together for final decision. The experiments on the TRECVID 2005 corpus demonstrate that the mean average precision is boosted from the best reported 38.2% in [36] to 60.4% based on our new framework.", "citation": "Citations (126)", "departments": ["Urbana University", "Urbana University", "Columbia University", "Urbana University", "NUS, Singapore, Singapore"], "authors": ["Xi Zhou.....http://dblp.org/pers/hd/z/Zhou:Xi", "Xiaodan Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Xiaodan", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu", "Mark Hasegawa-Johnson.....http://dblp.org/pers/hd/h/Hasegawa=Johnson:Mark", "Thomas S. Huang.....http://dblp.org/pers/hd/h/Huang:Thomas_S="], "conf": "mm", "year": "2008", "pages": 10}