{"title": "Coordinated management of multiple interacting resources in chip multiprocessors: A machine learning approach.", "fields": ["performance metric", "quality of service", "phase change", "resource allocation", "resource management"], "abstract": "Efficient sharing of system resources is critical to obtaining high utilization and enforcing system-level performance objectives on chip multiprocessors (CMPs). Although several proposals that address the management of a single microarchitectural resource have been published in the literature, coordinated management of multiple interacting resources on CMPs remains an open problem. We propose a framework that manages multiple shared CMP resources in a coordinated fashion to enforce higher-level performance objectives. We formulate global resource allocation as a machine learning problem. At runtime, our resource management scheme monitors the execution of each application, and learns a predictive model of system performance as a function of allocation decisions. By learning each application's performance response to different resource distributions, our approach makes it possible to anticipate the system-level performance impact of allocation decisions at runtime with little runtime overhead. As a result, it becomes possible to make reliable comparisons among different points in a vast and dynamically changing allocation space, allowing us to adapt our allocation decisions as applications undergo phase changes. Our evaluation concludes that a coordinated approach to managing multiple interacting resources is key to delivering high performance in multiprogrammed workloads, but this is possible only if accompanied by efficient search mechanisms. We also show that it is possible to build a single mechanism that consistently delivers high performance under various important performance metrics.", "citation": "Citations (254)", "departments": ["Cornell University", "Microsoft", "Cornell University"], "authors": ["Ramazan Bitirgen.....http://dblp.org/pers/hd/b/Bitirgen:Ramazan", "Engin Ipek.....http://dblp.org/pers/hd/i/Ipek:Engin", "José F. Martínez.....http://dblp.org/pers/hd/m/Mart=iacute=nez:Jos=eacute=_F="], "conf": "micro", "year": "2008", "pages": 12}