{"title": "A p-norm Flow Optimization Problem in Dense Wireless Sensor Networks.", "fields": ["multi commodity flow problem", "maximum flow problem", "flow", "minimum cost flow problem", "vector optimization"], "abstract": "In a network with a high density of wireless nodes, we model flow of information by a continuous vector field known as the information flow vector field. We use a mathematical model that translates a communication network composed of a large but finite number of sensors into a continuum of nodes on which information flow is formulated by a vector field. The magnitude of this vector field is the intensity of the communication activity, and its orientation is the direction in which the traffic is forwarded. The information flow vector field satisfies a set of Neumann boundary conditions and a partial differential equation (PDE) involving the divergence of information, but the divergence constraint and Neumann boundary conditions do not specify the information flow vector field uniquely, and leave us freedom to optimize certain measures within their feasible set. Therefore, we introduce a  p-norm  flow optimization problem in which we minimize the  p-norm  of information flow vector field over the area of the network. This problem is a convex optimization problem, and we use sequential quadratic programming (SQP) to solve it. SQP is known for numerical stability and fast convergence to the optimal solution in convex optimization problems. By using standard SQP on  p-norm  flow optimization, we prove that the solution of each iteration of SQP is uniquely specified by an elliptic PDE with generalized Neumann boundary conditions. The  p-norm  flow optimization shows interesting properties for different values of  p . For example, if p is close to one, the information routes resemble the geometric shortest paths of the sources and sinks, and for  p  = 2, the information flow shows an analogy to electrostatics. For infinitely large values of  p , the problem minimizes the maximum magnitude of the information vector field over the network, and hence it achieves maximum load balancing.", "citation": "Citations (18)", "departments": ["University of Maryland, Baltimore", "University of Maryland, Baltimore", "University of Maryland, Baltimore"], "authors": ["Mehdi Kalantari.....http://dblp.org/pers/hd/k/Kalantari:Mehdi", "Masoumeh Haghpanahi.....http://dblp.org/pers/hd/h/Haghpanahi:Masoumeh", "Mark A. Shayman.....http://dblp.org/pers/hd/s/Shayman:Mark_A="], "conf": "infocom", "year": "2008", "pages": 5}