{"title": "Tradeoffs in designing accelerator architectures for visual computing.", "fields": ["multithreading", "memory hierarchy", "mimd", "uniprocessor system", "simd"], "abstract": "Visualization, interaction, and simulation (VIS) constitute a class of applications that is growing in importance. This class includes applications such as graphics rendering, video encoding, simulation, and computer vision. These applications are ideally suited for accelerators because of their parallelizability and demand for high throughput. We compile a benchmark suite, VIS- Bench, to serve as a proxy for this application class. We use VISBench to examine some important high level decisions for an accelerator architecture. We propose a highly parallel base architecture. We examine the need for synchronization and data communication. We also examine GPU-style SIMD execution and find that a MIMD architecture usually performs better. Given these high level choices, we use VISBench to explore the microarchitectural design space. We analyze area versus performance tradeoffs in designing individual cores and the memory hierarchy. We find that a design made of small, simple cores achieves much higher throughput than a general purpose uniprocessor. Further, we find that a limited amount of support for ILP within each core aids overall performance. We find that fine-grained multithreading improves performance, but only up to a point. We find that word-level (SSE-style) SIMD provides a poor performance to area ratio. Finally, we find that sufficient memory and cache bandwidth is essential to performance.", "citation": "Citations (39)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Aqeel Mahesri.....http://dblp.org/pers/hd/m/Mahesri:Aqeel", "Daniel R. Johnson.....http://dblp.org/pers/hd/j/Johnson:Daniel_R=", "Neal Clayton Crago.....http://dblp.org/pers/hd/c/Crago:Neal_Clayton", "Sanjay J. Patel.....http://dblp.org/pers/hd/p/Patel:Sanjay_J="], "conf": "micro", "year": "2008", "pages": 12}