{"title": "Globally Optimal Channel Assignment for Non-Cooperative Wireless Networks.", "fields": ["solution concept", "nash equilibrium", "strategic dominance", "repeated game", "channel allocation schemes"], "abstract": "Channel assignment is a very important topic in wireless networks. In this paper, we study FDMA channel assignment in a non-cooperative wireless network, where devices are selfish. Existing work on this problem has considered Nash equilibrium (NE), which is not a very strong solution concept and may not guarantee a good system-wide performance. In contrast, in this work we introduce a payment formula to ensure the existence of a strongly dominant strategy equilibrium (SDSE), a much stronger solution concept. We show that, when the system converges to a SDSE, it also achieves global optimality in terms of effective system-wide throughput. Furthermore, we extend our work to the case in which some radios have limited tunability. We show that, in this case, it is generally impossible to have a similar SDSE solution; but, with additional assumptions on the numbers of radios and the types of channels, etc., we can again achieve a SDSE solution that guarantees globally optimal effective system throughput in the entire system. Besides this extension, we also consider another extension of our strategic game, which is a repeated game that provides fairness. Finally, we evaluate our design in experiments. Our evaluations verify that the system does converge to the globally optimal channel assignment with our designed payment formula, and that the effective system- wide throughput is significantly higher than that of anarchy and Nash equilibrium (NE).", "citation": "Citations (102)", "year": "2008", "departments": ["University at Buffalo", "University at Buffalo", "University at Buffalo"], "conf": "infocom", "authors": ["Fan Wu.....http://dblp.org/pers/hd/w/Wu:Fan", "Sheng Zhong.....http://dblp.org/pers/hd/z/Zhong:Sheng", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming"], "pages": 9}