{"title": "The chow parameters problem.", "fields": ["e", "circuit complexity", "switching circuit theory", "uniform distribution", "algorithmics", "boolean function", "function representation", "fourier analysis", "special case"], "abstract": "In [Proceedings of the Second Symposium on Switching Circuit Theory and Logical Design (FOCS), 1961, pp. 34-38], Chow proved that every Boolean threshold function is uniquely determined by its degree-0 and degree-1 Fourier coefficients. These numbers became known as the Chow parameters. Providing an algorithmic version of Chow's theorem—i.e., efficiently constructing a representation of a threshold function given its Chow parameters—has remained open ever since. This problem has received significant study in the fields of circuit complexity, game theory and the design of voting systems, and learning theory. In this paper we effectively solve the problem, giving a randomized polynomial-time approximation scheme with the following behavior: Given the Chow parameters of a Boolean threshold function $f$ over $n$ bits and any constant $\\epsilon>0$, the algorithm runs in time $O(n^2\\log^2n)$ and with high probability outputs a representation of a threshold function $f'$ which is $\\epsilon$-close to $f$. Along the way we prove several new results of independent interest about Boolean threshold functions. In addition to various structural results, these include $\\tilde{O}(n^2)$-time learning algorithms for threshold functions under the uniform distribution in the following models: (i) the restricted focus of attention model, answering an open question of Birkendorf et al.; (ii) an agnostic-type model. This contrasts with recent results of Guruswami and Raghavendra who show NP-hardness for the problem under general distributions; (iii) the PAC model, with constant $\\epsilon$. Our $\\tilde{O}(n^2)$-time algorithm substantially improves on the previous best known running time and nearly matches the $\\Omega(n^2)$ bits of training data that any successful learning algorithm must use.", "citation": "Citations (64)", "year": "2008", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Columbia University", "rocco@cs.columbia.edu"], "conf": "stoc", "authors": ["Ryan O'Donnell.....http://dblp.org/pers/hd/o/O=Donnell:Ryan", "Rocco A. Servedio.....http://dblp.org/pers/hd/s/Servedio:Rocco_A="], "pages": 10}