{"title": "Understanding congestion control in multi-hop wireless mesh networks.", "fields": ["order one network protocol", "wireless mesh network", "switched mesh", "shared mesh", "ieee 802 11s"], "abstract": "Complex interference in static multi-hop wireless mesh networks can adversely affect transport protocol performance. Since TCP does not explicitly account for this, starvation and unfairness can result from the use of TCP over such networks. In this paper, we explore mechanisms for achieving fair and efficient congestion control for multi-hop wireless mesh networks. First, we design an AIMD-based rate-control protocol called Wireless Control Protocol (WCP) which recognizes that wireless congestion is a neighborhood phenomenon, not a node-local one, and appropriately reacts to such congestion. Second, we design a distributed rate controller that estimates the available capacity within each neighborhood, and divides this capacity to contending flows, a scheme we call Wireless Control Protocol with Capacity estimation (WCPCap). Using analysis, simulations, and real deployments, we find that our designs yield rates that are both fair and efficient, and achieve near optimal goodputs for all the topologies that we study. WCP achieves this level of performance while being extremely easy to implement. Moreover, WCPCap achieves the max-min rates for our topologies, while still being distributed and amenable to real implementation.", "citation": "Citations (137)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California"], "authors": ["Sumit Rangwala.....http://dblp.org/pers/hd/r/Rangwala:Sumit", "Apoorva Jindal.....http://dblp.org/pers/hd/j/Jindal:Apoorva", "Ki-Young Jang.....http://dblp.org/pers/hd/j/Jang:Ki=Young", "Konstantinos Psounis.....http://dblp.org/pers/hd/p/Psounis:Konstantinos", "Ramesh Govindan.....http://dblp.org/pers/hd/g/Govindan:Ramesh"], "conf": "mobicom", "year": "2008", "pages": 12}