{"title": "On End-to-End Throughput of Opportunistic Routing in Multirate and Multihop Wireless Networks.", "fields": ["transmitter", "throughput", "antenna diversity", "channel", "end to end principle"], "abstract": "Routing in multi-hop wireless networks presents a great challenge mainly due to unreliable wireless links and interference among concurrent transmissions. Recently, a new routing paradigm, opportunistic routing (OR), is proposed to cope with the unreliable transmissions by exploiting the broadcast nature and spatial diversity of the wireless medium. Previous studies on OR focused on networks with a single channel rate. The performance of OR in a multi-rate scenario is not carefully studied. In addition, although simulation and practical implementation have shown that OR achieves better throughput performance than that of traditional routing, there is no theoretical results on capacity enhancement provided by OR or network capacity bounds of OR. In this paper, we bridge these gaps by carrying out a comprehensive study on the impacts of multiple rates, interference, candidate selection and prioritization on the maximum end-to-end throughput or capacity of OR. Taking into consideration of wireless interference, we propose a new method of constructing transmission conflict graphs - we propose transmitter based conflict graph in contrast to link conflict graph. Then, we introduce the concept of concurrent transmitter sets to represent the constraints imposed by the transmission conflicts of OR, and formulate the maximum end-to-end throughput problem as a maximum-flow linear programming problem subject to the transmission conflict constraints. We also propose a rate selection scheme, and compare the throughput capacity of multi- rate OR with single-rate ones. We validate the analysis results by simulation, and show that OR has great potential to improve end- to-end throughput and system operating at multi-rates achieves higher throughput than that operating at any single rate.", "citation": "Citations (154)", "departments": ["Philips", "Worcester Polyt ... nst., Worcester", "Worcester Polyt ... nst., Worcester"], "authors": ["Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0001:Kai", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Hongqiang Zhai.....http://dblp.org/pers/hd/z/Zhai:Hongqiang"], "conf": "infocom", "year": "2008", "pages": 9}