{"title": "Probabilistic Verifiers: Evaluating Constrained Nearest-Neighbor Queries over Uncertain Data.", "fields": ["database theory", "probabilistic database", "range query", "query optimization", "uncertain data"], "abstract": "In applications like location-based services, sensor monitoring and biological databases, the values of the database items are inherently uncertain in nature. An important query for uncertain objects is the probabilistic nearest-neighbor query (PNN), which computes the probability of each object for being the nearest neighbor of a query point. Evaluating this query is computationally expensive, since it needs to consider the relationship among uncertain objects, and requires the use of numerical integration or Monte-Carlo methods. Sometimes, a query user may not be concerned about the exact probability values. For example, he may only need answers that have sufficiently high confidence. We thus propose the constrained nearest-neighbor query (C-PNN), which returns the IDs of objects whose probabilities are higher than some threshold, with a given error bound in the answers. The C-PNN can be answered efficiently with probabilistic verifiers. These are methods that derive the lower and upper bounds of answer probabilities, so that an object can be quickly decided on whether it should be included in the answer. We have developed three probabilistic verifiers, which can be used on uncertain data with arbitrary probability density functions. Extensive experiments were performed to examine the effectiveness of these approaches.", "citation": "Citations (185)", "departments": ["University of Minnesota", "University of Minnesota", "Dept. of Comput ...  Univ., Kowloon", "Dept. of Comput ...  Univ., Kowloon"], "authors": ["Reynold Cheng.....http://dblp.org/pers/hd/c/Cheng:Reynold", "Jinchuan Chen.....http://dblp.org/pers/hd/c/Chen:Jinchuan", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F=", "Chi-Yin Chow.....http://dblp.org/pers/hd/c/Chow:Chi=Yin"], "conf": "icde", "year": "2008", "pages": 10}