{"title": "Lest We Remember: Cold Boot Attacks on Encryption Keys.", "fields": ["physical access", "disk encryption", "dynamic random access memory", "motherboard", "on the fly encryption", "data remanence", "key", "cold boot attack"], "abstract": "Contrary to widespread assumption, dynamic RAM (DRAM), the main memory in most modern computers, retains its contents for several seconds after power is lost, even at room temperature and even if removed from a motherboard. Although DRAM becomes less reliable when it is not refreshed, it is not immediately erased, and its contents persist sufficiently for malicious (or forensic) acquisition of usable full-system memory images. We show that this phenomenon limits the ability of an operating system to protect cryptographic key material from an attacker with physical access to a machine. It poses a particular threat to laptop users who rely on disk encryption: we demonstrate that it could be used to compromise several popular disk encryption products without the need for any special devices or materials. We experimentally characterize the extent and predictability of memory retention and report that remanence times can be increased dramatically with simple cooling techniques. We offer new algorithms for finding cryptographic keys in memory images and for correcting errors caused by bit decay. Though we discuss several strategies for mitigating these risks, we know of no simple remedy that would eliminate them.", "citation": "Citations (1,173)", "year": "2008", "departments": ["University of Michigan", "Electronic Frontier Foundation", "Princeton University", "Princeton University", "Wind River Systems", "Princeton University", "Electronic Frontier Foundation", "Princeton University", "Princeton University", "Wind River Systems"], "conf": "uss", "authors": ["J. Alex Halderman.....http://dblp.org/pers/hd/h/Halderman:J=_Alex", "Seth D. Schoen.....http://dblp.org/pers/hd/s/Schoen:Seth_D=", "Nadia Heninger.....http://dblp.org/pers/hd/h/Heninger:Nadia", "William Clarkson.....http://dblp.org/pers/hd/c/Clarkson:William", "William Paul.....http://dblp.org/pers/hd/p/Paul:William", "Joseph A. Calandrino.....http://dblp.org/pers/hd/c/Calandrino:Joseph_A=", "Ariel J. Feldman.....http://dblp.org/pers/hd/f/Feldman:Ariel_J=", "Jacob Appelbaum.....http://dblp.org/pers/hd/a/Appelbaum:Jacob", "Edward W. Felten.....http://dblp.org/pers/hd/f/Felten:Edward_W="], "pages": 16}