{"title": "Estimating the Location and Orientation of Complex, Correlated Neural Activity using MEG.", "fields": ["data set", "bayesian probability", "beamforming", "interference", "electroencephalography"], "abstract": "The synchronous brain activity measured via MEG (or EEG) can be interpreted as arising from a collection (possibly large) of current dipoles or sources located throughout the cortex. Estimating the number, location, and orientation of these sources remains a challenging task, one that is significantly compounded by the effects of source correlations and the presence of interference from spontaneous brain activity, sensor noise, and other artifacts. This paper derives an empirical Bayesian method for addressing each of these issues in a principled fashion. The resulting algorithm guarantees descent of a cost function uniquely designed to handle unknown orientations and arbitrary correlations. Robust interference suppression is also easily incorporated. In a restricted setting, the proposed method is shown to have theoretically zero bias estimating both the location and orientation of multi-component dipoles even in the presence of correlations, unlike a variety of existing Bayesian localization methods or common signal processing techniques such as beamforming and sLORETA. Empirical results on both simulated and real data sets verify the efficacy of this approach.", "citation": "Citations (12)", "year": "2008", "departments": ["University of California, San Francisco", "University of California, San Francisco", "University of California, San Francisco", "University of California, San Francisco", "University of California, San Francisco"], "conf": "nips", "authors": ["David P. Wipf.....http://dblp.org/pers/hd/w/Wipf:David_P=", "Julia P. Owen.....http://dblp.org/pers/hd/o/Owen:Julia_P=", "Hagai Attias.....http://dblp.org/pers/hd/a/Attias:Hagai", "Kensuke Sekihara.....http://dblp.org/pers/hd/s/Sekihara:Kensuke", "Srikantan S. Nagarajan.....http://dblp.org/pers/hd/n/Nagarajan:Srikantan_S="], "pages": 8}