{"title": "Detecting 802.11 MAC Layer Spoofing Using Received Signal Strength.", "fields": ["spoofing attack", "protocol spoofing", "antenna diversity", "mac spoofing", "phenomenon"], "abstract": "MAC addresses can be easily spoofed in 802.11 wireless LANs. An adversary can exploit this vulnerability to launch a large number of attacks. For example, an attacker may masquerade as a legitimate access point to disrupt network services or to advertise false services, tricking nearby wireless stations. On the other hand, the received signal strength (RSS) is a measurement that is hard to forge arbitrarily and it is highly correlated to the transmitter's location. Assuming the attacker and the victim are separated by a reasonable distance, RSS can be used to differentiate them to detect MAC spoofing, as recently proposed by several researchers. By analyzing the RSS pattern of typical 802.11 transmitters in a 3-floor building covered by 20 air monitors, we observed that the RSS readings followed a mixture of multiple Gaussian distributions. We discovered that this phenomenon was mainly due to antenna diversity, a widely-adopted technique to improve the stability and robustness of wireless connectivity. This observation renders existing approaches ineffective because they assume a single RSS source. We propose an approach based on Gaussian mixture models, building RSS profiles for spoofing detection. Experiments on the same testbed show that our method is robust against antenna diversity and significantly outperforms existing approaches. At a 3% false positive rate, we detect 73.4%, 89.6% and 97.8% of attacks using the three proposed algorithms, based on local statistics of a single AM, combining local results from AMs, and global multi-AM detection, respectively.", "citation": "Citations (288)", "departments": ["Google", "Dartmouth College", "University of Massachusetts Lowell", "Dartmouth College", "Dartmouth College"], "authors": ["Yong Sheng.....http://dblp.org/pers/hd/s/Sheng:Yong", "Keren Tan.....http://dblp.org/pers/hd/t/Tan:Keren", "Guanling Chen.....http://dblp.org/pers/hd/c/Chen:Guanling", "David Kotz.....http://dblp.org/pers/hd/k/Kotz:David", "Andrew T. Campbell.....http://dblp.org/pers/hd/c/Campbell:Andrew_T="], "conf": "infocom", "year": "2008", "pages": 9}