{"title": "Pay-as-you-go user feedback for dataspace systems.", "fields": ["expected value of perfect information", "roomba", "schema matching", "data integration", "dataspaces"], "abstract": "A primary challenge to large-scale data integration is creating semantic equivalences between elements from different data sources that correspond to the same real-world entity or concept. Dataspaces propose a pay-as-you-go approach: automated mechanisms such as schema matching and reference reconciliation provide initial correspondences, termed  candidate matches , and then user feedback is used to incrementally confirm these matches. The key to this approach is to determine in what order to solicit user feedback for confirming candidate matches.   In this paper, we develop a decision-theoretic framework for ordering candidate matches for user confirmation using the concept of the  value of perfect information (VPI) . At the core of this concept is a  utility function  that quantifies the desirability of a given state; thus, we devise a utility function for dataspaces based on query result quality. We show in practice how to efficiently apply VPI in concert with this utility function to order user confirmations. A detailed experimental evaluation on both real and synthetic datasets shows that the ordering of user feedback produced by this VPI-based approach yields a dataspace with a significantly higher utility than a wide range of other ordering strategies. Finally, we outline the design of Roomba, a system that utilizes this decision-theoretic framework to guide a dataspace in soliciting user feedback in a pay-as-you-go manner.", "citation": "Citations (253)", "year": "2008", "departments": ["University of California, Berkeley", "University of California, Berkeley", "Google"], "conf": "sigmod", "authors": ["Shawn R. Jeffery.....http://dblp.org/pers/hd/j/Jeffery:Shawn_R=", "Michael J. Franklin.....http://dblp.org/pers/hd/f/Franklin:Michael_J=", "Alon Y. Halevy.....http://dblp.org/pers/hd/h/Halevy:Alon_Y="], "pages": 14}