{"title": "Floatcascade learning for fast imbalanced web mining.", "fields": ["web mining", "web query classification", "data classification", "cascading classifiers", "adaboost"], "abstract": "This paper is concerned with the problem of Imbalanced Classification (IC) in web mining, which often arises on the web due to the \"Matthew Effect\". As web IC applications usually need to provide online service for user and deal with large volume of data, classification speed emerges as an important issue to be addressed. In face detection, Asymmetric Cascade is used to speed up imbalanced classification by building a cascade structure of simple classifiers, but it often causes a loss of classification accuracy due to the iterative feature addition in its learning procedure. In this paper, we adopt the idea of cascade classifier in imbalanced web mining for fast classification and propose a novel asymmetric cascade learning method called FloatCascade to improve the accuracy. To the end, FloatCascade selects fewer yet more effective features at each stage of the cascade classifier. In addition, a decision-tree scheme is adopted to enhance feature diversity and discrimination capability for FloatCascade learning. We evaluate FloatCascade through two typical IC applications in web mining: web page categorization and citation matching. Experimental results demonstrate the effectiveness and efficiency of FloatCascade comparing to the state-of-the-art IC methods like Asymmetric Cascade, Asymmetric AdaBoost and Weighted SVM.", "citation": "Citations (2)", "departments": ["IBM", "Peking University", "IBM", "IBM", "IBM"], "authors": ["Xiaoxun Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiaoxun", "Xueying Wang.....http://dblp.org/pers/hd/w/Wang:Xueying", "Honglei Guo.....http://dblp.org/pers/hd/g/Guo:Honglei", "Zhili Guo.....http://dblp.org/pers/hd/g/Guo:Zhili", "Xian Wu.....http://dblp.org/pers/hd/w/Wu:Xian", "Zhong Su.....http://dblp.org/pers/hd/s/Su:Zhong"], "conf": "www", "year": "2008", "pages": 10}