{"title": "Implementing high availability memory with a duplication cache.", "fields": ["failover", "cache coloring", "ranging", "working set", "cache pollution"], "abstract": "High availability systems typically rely on redundant components and functionality to achieve fault detection, isolation and fail over. In the future, increases in error rates will make high availability important even in the commodity and volume market. Systems will be built out of chip multiprocessors (CMPs) with multiple identical components that can be configured to provide redundancy for high availability. However, the 100% overhead of making all components redundant is going to be unacceptable for the commodity market, especially when all applications might not require high availability. In particular, duplicating the entire memory like the current high availability systems (e.g. NonStop and Stratus) do is particularly problematic given the fact that system costs are going to be dominated by the cost of memory. In this paper, we propose a novel technique called a duplication cache to reduce the overhead of memory duplication in CMP-based high availability systems. A duplication cache is a reserved area of main memory that holds copies of pages belonging to the current write working set (set of actively modified pages) of running processes. All other pages are marked as read-only and are kept only as a single, shared copy. The size of the duplication cache can be configured dynamically at runtime and allows system designers to trade off the cost of memory duplication with minor performance overhead. We extensively analyze the effectiveness of our duplication cache technique and show that for a range of benchmarks memory duplication can be reduced by 60-90% with performance degradation ranging from 1-12%. On average, a duplication cache can reduce memory duplication by 60% for a performance overhead of 4% and by 90% for a performance overhead of 5%.", "citation": "Citations (12)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Nidhi Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Nidhi", "James E. Smith.....http://dblp.org/pers/hd/s/Smith_0001:James_E=", "Kewal K. Saluja.....http://dblp.org/pers/hd/s/Saluja:Kewal_K=", "Norman P. Jouppi.....http://dblp.org/pers/hd/j/Jouppi:Norman_P=", "Parthasarathy Ranganathan.....http://dblp.org/pers/hd/r/Ranganathan:Parthasarathy"], "conf": "micro", "year": "2008", "pages": 12}