{"title": "Matching images under unstable segmentations.", "fields": ["kernel", "merge", "adjacency list", "blossom algorithm", "belief propagation"], "abstract": "Region based features are getting popular due to their higher descriptive power relative to other features. However, real world images exhibit changes in image segments capturing the same scene part taken at different time, under different lighting conditions, from different viewpoints, etc. Segmentation algorithms reflect these changes, and thus segmentations exhibit poor repeatability. In this paper we address the problem of matching regions of similar objects under unstable segmentations. Merging and splitting of regions makes it difficult to find such correspondences using one-to-one matching algorithms. We present partial region matching as a solution to this problem. We assume that the high contrast, dominant contours of an object are fairly repeatable, and use them to compute partial matching cost (PMC) between regions. Region correspondences are obtained under region adjacency constraints encoded by region adjacency graph (RAG). We integrate PMC in a many-to-one label assignment framework for matching RAGs, and solve it using belief propagation. We show that our algorithm can match images of similar objects across unstable image segmentations. We also compare the performance of our algorithm with that of the standard one-to-one matching algorithm on three motion sequences. We conclude that our partial region matching approach is robust under segmentation irrepeatabilities.", "citation": "Citations (28)", "year": "2008", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Objectvideo Inc ... , VA-20191, USA"], "conf": "cvpr", "authors": ["Varsha Hedau.....http://dblp.org/pers/hd/h/Hedau:Varsha", "Himanshu Arora.....http://dblp.org/pers/hd/a/Arora:Himanshu", "Narendra Ahuja.....http://dblp.org/pers/hd/a/Ahuja:Narendra"], "pages": -1}