{"title": "Uncovering hidden loop level parallelism in sequential applications.", "fields": ["speculative multithreading", "implicit parallelism", "small number", "automatic parallelization", "scalable parallelism"], "abstract": "As multicore systems become the dominant mainstream computing technology, one of the most difficult challenges the industry faces is the software. Applications with large amounts of explicit thread-level parallelism naturally scale performance with the number of cores, but single-threaded applications realize little to no gains with additional cores. One solution to this problem is automatic parallelization that frees the programmer from the difficult task of parallel programming and offers hope for handling the vast amount of legacy single-threaded software. There is a long history of automatic parallelization for scientific applications, but the techniques have generally failed in the context of general-purpose software. Thread-level speculation overcomes the problem of memory dependence analysis by speculating unlikely dependences that serialize execution. However, this approach has lead to only modest performance gains. In this paper, we take another look at exploiting loop-level parallelism in single-threaded applications. We show that substantial amounts of loop-level parallelism is available in general-purpose applications, but it lurks beneath the surface and is often obfuscated by a small number of data and control dependences. We adapt and extend several code transformations from the instruction-level and scientific parallelization communities to uncover the hidden parallelism. Our results show that 61% of the dynamic execution of studied benchmarks can be parallelized with our techniques compared to 27% using traditional thread-level speculation techniques, resulting in a speedup of 1.84 on a four core system compared to 1.41 without transformations.", "citation": "Citations (120)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Hongtao Zhong.....http://dblp.org/pers/hd/z/Zhong:Hongtao", "Mojtaba Mehrara.....http://dblp.org/pers/hd/m/Mehrara:Mojtaba", "Steven A. Lieberman.....http://dblp.org/pers/hd/l/Lieberman:Steven_A=", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A="], "conf": "hpca", "year": "2008", "pages": 12}