{"title": "Reduced-reference estimation of channel-induced video distortion using distributed source coding.", "fields": ["distortion", "video quality", "streams", "distributed source coding", "macroblock"], "abstract": "Channel-induced distortion estimation is an important aspect in the delivery of video contents over IP networks: the QoS requirements of both content providers and content users conflict with the intrinsic best-effort nature of packet-switched networks, which may introduce annoying artifacts in the received streams due to channel errors or jitter. In this paper we propose a Reduced-Reference video quality assessment method, based on objective quality metrics, which enables distortion estimation at the macroblock level. The content provider transmits a small feature vector for each frame, starting from random projections computed for each macroblock. In order to reduce the bit rate of the transmitted feature vector, we encode it using Distributed Source Coding (DSC) tools. The content user decodes the feature vector using the received sequence as side information. Additionally, the end-user may take advantage of some prior information about the support of the errors in the frame in such a way that the required bit length of the transmitted feature vector is further reduced. In our experiments, using 4 random projections, the use of DSC enables a bit saving of 70% w.r.t. scalar quantization and transmission of the original feature vector; when also the a priori error map is available at the decoder, the average length of the transmitted partial reference can be further reduced by another 5% of average.", "citation": "Citations (10)", "year": "2008", "departments": ["Polytechnic University of Milan", "Polytechnic University of Milan", "Polytechnic University of Milan", "Polytechnic University of Milan"], "conf": "mm", "authors": ["Giuseppe Valenzise.....http://dblp.org/pers/hd/v/Valenzise:Giuseppe", "Matteo Naccari.....http://dblp.org/pers/hd/n/Naccari:Matteo", "Marco Tagliasacchi.....http://dblp.org/pers/hd/t/Tagliasacchi:Marco", "Stefano Tubaro.....http://dblp.org/pers/hd/t/Tubaro:Stefano"], "pages": 4}