{"title": "GhostGlove: haptic existence of the virtual world.", "fields": ["immersion", "haptic technology", "feeling", "sensation", "metaverse"], "abstract": "In the real world, we usually do not perceive haptic sensations consciously. However, if the haptic sensations are absent or if they are not of the desired quality, it would result in discomfort, and the existence of the world would be degraded. In order to eliminate the feelings of discomfort and represent genuine feelings of the existence of objects in virtual reality interactions, as shown in figure 2, we show that haptic sensations play a decisive role in inciting cognitive functions in a virtual environment. There are many researches on haptic displays for virtual reality interactions with the hand, such as CyberTouch and CyberGrasp [Immersion Corp.]. However, the represented sensation is still inadequate to provide us with the experience of feeling the definite existence of virtual objects or virtual creatures. Generally, it is considered that a complex and expensive device is required to provide realistic haptic sensations; many attempts to simplify the device would result in poor sensations, for example, simple vibrations. To merge the simplicity of the device and realistic sensation of existence, we propose a novel wearable haptic interface named “GhostGlove.” This device generates natural and realistic haptic sensations over the entire hand—on each finger and the palm—and integrates the perceptions on the entire hand along with the visual sensations to enables us to recognize the existence of the virtual world.", "citation": "Citations (15)", "departments": ["University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo"], "authors": ["Kouta Minamizawa.....http://dblp.org/pers/hd/m/Minamizawa:Kouta", "Sho Kamuro.....http://dblp.org/pers/hd/k/Kamuro:Sho", "Souichiro Fukamachi.....http://dblp.org/pers/hd/f/Fukamachi:Souichiro", "Naoki Kawakami.....http://dblp.org/pers/hd/k/Kawakami:Naoki", "Susumu Tachi.....http://dblp.org/pers/hd/t/Tachi:Susumu"], "conf": "siggraph", "year": "2008", "pages": 1}