{"title": "CRD: fast co-clustering on large datasets utilizing sampling-based matrix decomposition.", "fields": ["data matrix", "matrix decomposition", "biclustering", "synthetic data", "row"], "abstract": "The problem of simultaneously clustering columns and rows (co-clustering) arises in important applications, such as text data mining, microarray analysis, and recommendation system analysis. Compared with the classical clustering algorithms, co-clustering algorithms have been shown to be more effective in discovering hidden clustering structures in the data matrix. The complexity of previous co-clustering algorithms is usually  O ( m  X  n ), where  m  and  n  are the numbers of rows and columns in the data matrix respectively. This limits their applicability to data matrices involving a large number of columns and rows. Moreover, some huge datasets can not be entirely held in main memory during co-clustering which violates the assumption made by the previous algorithms. In this paper, we propose a general framework for fast co-clustering large datasets,  CRD . By utilizing recently developed sampling-based matrix decomposition methods,  CRD  achieves an execution time linear in  m  and  n . Also,  CRD  does not require the whole data matrix be in the main memory. We conducted extensive experiments on both real and synthetic data. Compared with previous co-clustering algorithms,  CRD  achieves competitive accuracy but with much less computational cost.", "citation": "Citations (20)", "year": "2008", "departments": ["University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill"], "conf": "sigmod", "authors": ["Feng Pan.....http://dblp.org/pers/hd/p/Pan:Feng", "Xiang Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiang", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0010:Wei"], "pages": 12}