{"title": "MobiQual: QoS-aware Load Shedding in Mobile CQ Systems.", "fields": ["quality of service", "real time computing", "load shedding", "mobile computing", "resource allocation"], "abstract": "Freshness and accuracy are two key measures of quality of service (QoS) in location-based, mobile continual queries (CQs). However, it is often difficult to provide both fresh and accurate CQ results due to (a) limited resources in computing and communication and (b) fast-changing load conditions caused by continuous mobile node movement. Thus a key challenge for a mobile CQ system is: How do we achieve the highest possible quality of the query results, in both freshness and accuracy, with currently available resources under changing load conditions? In this paper, we formulate this problem as a load shedding one, and develop MobiQual - a QoS-aware framework for performing both update load shedding and query load shedding. The design of MobiQual highlights three important features. (1)  Differentiated   load   shedding : Different amounts of query and update load shedding are applied to different groups of queries and mobile nodes, respectively. (2)  Per-query   QoS   specifications : The overall freshness and accuracy of the query results are maximized with individualized QoS specifications. (3)  Low-cost   adaptation : MobiQual dynamically adapts, with a minimal overhead, to changing load conditions and available resources. We show that, through a careful combination of update and query load shedding, the MobiQual approach leads to much higher freshness and accuracy in the query results in all cases, compared to existing approaches.", "citation": "Citations (5)", "departments": ["IBM", "IBM", "IBM", "Georgia Institute of Technology"], "authors": ["Bugra Gedik.....http://dblp.org/pers/hd/g/Gedik:Bugra", "Kun-Lung Wu.....http://dblp.org/pers/hd/w/Wu:Kun=Lung", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S=", "Ling Liu.....http://dblp.org/pers/hd/l/Liu_0001:Ling"], "conf": "icde", "year": "2008", "pages": 10}