{"title": "On the Design of Load Factor based Congestion Control Protocols for Next-Generation Networks.", "fields": ["bandwidth delay product", "transmission control protocol", "bandwidth management", "packet loss", "active queue management"], "abstract": "Load factor based congestion control schemes have shown to enhance network performance, in terms of utilization, packet loss and delay. In these schemes, using more accurate representation of network load levels is likely to lead to a more efficient way of communicating congestion information to hosts. Increasing the amount of congestion information, however, may end up adversely affecting the performance of the network. This paper focuses on this trade-off and addresses two important and challenging questions: (i) How many congestion levels should be represented by the feedback signal to provide near-optimal performance? and (ii) What window adjustment policies must be in place to ensure robustness in the face of congestion and achieve efficient and fair bandwidth allocations in high bandwidth-delay product (BDP) networks, while keeping low queues and negligible packet drop rates? Based on theoretical analysis and simulations, our results show that 3-bit feedback is sufficient for achieving near-optimal rate convergence to an efficient bandwidth allocation. While the performance gap between 2-bit and 3-bit schemes is large, gains follow the law of diminishing returns when more than 3 bits are used. Further, we show that using multiple levels for the multiplicative decrease policy enables the protocol to adjust its rate of convergence to fairness, rate variations and responsiveness to congestion based on the degree of congestion at the bottleneck. Based on these fundamental insights, we design multi-level feedback congestion control protocol (MLCP). In addition to being efficient, MLCP converges to a fair bandwidth allocation in the presence of diverse RTT flows while maintaining near-zero packet drop rate and low persistent queue length. These features coupled with MLCP's smooth rate variations make it a viable choice for many real-time applications. Using extensive packet- level simulations we show that the protocol is stable across a diverse range of network scenarios. A fluid model for the protocol shows that MLCP remains globally stable for the case of a single bottleneck link shared by identical round-trip time flows.", "citation": "Citations (78)", "departments": ["University of Pittsburgh", "University of Pittsburgh"], "authors": ["Ihsan Ayyub Qazi.....http://dblp.org/pers/hd/q/Qazi:Ihsan_Ayyub", "Taieb Znati.....http://dblp.org/pers/hd/z/Znati:Taieb"], "conf": "infocom", "year": "2008", "pages": 5}