{"title": "Universal semantic communication I.", "fields": ["semantic equivalence", "semantic web stack", "universality", "semantic computing", "computational complexity theory", "semantic grid", "software", "pspace complete", "theoretical computer science"], "abstract": "Is it possible for two intelligent beings to communicate meaningfully, without any common language or background? This question has interest on its own, but is especially relevant in the context of modern computational infrastructures where an increase in the diversity of computers is making the task of inter-computer interaction increasingly burdensome. Computers spend a substantial amount of time updating their software to increase their knowledge of other computing devices. In turn, for any pair of communicating devices, one has to design software that enables the two to talk to each other. Is it possible instead to let the two computing entities use their intelligence (universality as computers) to learn each others' behavior and attain a common understanding? What is 'common understanding?' We explore this question in this paper.   To formalize this problem, we suggest that one should study the 'goal of communication:' why are the two entities interacting with each other, and what do they hope to gain by it? We propose that by considering this question explicitly, one can make progress on the question of universal communication.   We start by considering a computational setting for the problem where the goal of one of the interacting players is to gain some computational wisdom from the other player. We show that if the second player is \"sufficiently\" helpful and powerful, then the first player can gain significant computational power (deciding PSPACE complete languages).   Our work highlights some of the definitional issues underlying the task of formalizing universal communication, but also suggests some interesting phenomena and highlights potential tools that may be used for such communication.", "citation": "Not cited", "year": "2008", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "stoc", "authors": ["Brendan Juba.....http://dblp.org/pers/hd/j/Juba:Brendan", "Madhu Sudan.....http://dblp.org/pers/hd/s/Sudan:Madhu"], "pages": 10}