{"title": "MCDB: a monte carlo approach to managing uncertain data.", "fields": ["uncertain data", "probabilistic database", "tuple", "sql", "query plan"], "abstract": "To deal with data uncertainty, existing probabilistic database systems augment tuples with attribute-level or tuple-level probability values, which are loaded into the database along with the data itself. This approach can severely limit the system's ability to gracefully handle complex or unforeseen types of uncertainty, and does not permit the uncertainty model to be dynamically parameterized according to the current state of the database. We introduce MCDB, a system for managing uncertain data that is based on a Monte Carlo approach. MCDB represents uncertainty via \"VG functions,\" which are used to pseudorandomly generate realized values for uncertain attributes. VG functions can be parameterized on the results of SQL queries over \"parameter tables\" that are stored in the database, facilitating what-if analyses. By storing parameters, and not probabilities, and by estimating, rather than exactly computing, the probability distribution over possible query answers, MCDB avoids many of the limitations of prior systems. For example, MCDB can easily handle arbitrary joint probability distributions over discrete or continuous attributes, arbitrarily complex SQL queries, and arbitrary functionals of the query-result distribution such as means, variances, and quantiles. To achieve good performance, MCDB uses novel query processing techniques, executing a query plan exactly once, but over \"tuple bundles\" instead of ordinary tuples. Experiments indicate that our enhanced functionality can be obtained with acceptable overheads relative to traditional systems.", "citation": "Citations (288)", "year": "2008", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "University of Florida"], "conf": "sigmod", "authors": ["Ravi Jampani.....http://dblp.org/pers/hd/j/Jampani:Ravi", "Fei Xu.....http://dblp.org/pers/hd/x/Xu:Fei", "Mingxi Wu.....http://dblp.org/pers/hd/w/Wu:Mingxi", "Luis Leopoldo Perez.....http://dblp.org/pers/hd/p/Perez:Luis_Leopoldo", "Christopher M. Jermaine.....http://dblp.org/pers/hd/j/Jermaine:Christopher_M=", "Peter J. Haas.....http://dblp.org/pers/hd/h/Haas:Peter_J="], "pages": 14}