{"title": "Multimodal observation systems.", "fields": ["information silo", "architecture", "streams", "video ethnography", "interconnection"], "abstract": "In recent years, we have seen a significant research interest in a number of multimodal sensing applications like surveillance, video ethnography, tele-presence, assisted living, life blogging etc. However, these applications are currently evolving as separate silos with no interconnection. Further, the individual application-centric architectures typically tend to focus on specific sensors, specific (hardwired) queries and deal with specific environments. We present a generic sensing architecture 'Observation System', which allows multiple users to undertake different applications through abstracted interaction with a common set of sensors. The observation system observes behavior of various objects in an environment and keeps a record of important events and activities in an eventbase. In this system, multifarious data collected from disparate sensors and other sources are correlated to understand and gain insights in the environment. The observation system has applications in many areas including but not limited to surveillance, traffic monitoring, ethnography, marketing, and healthcare. In this paper, we present the architecture and functionality of such a system and present details of activity detection using multiple sensor streams in a distributed sensing environment. We also present results of such an approach and potential extensions to the analysis of more complex activities and events.", "citation": "Citations (6)", "departments": ["National University of Singapore", "University of California, Irvine", "University of California, Irvine", "National University of Singapore"], "authors": ["Mukesh Kumar Saini.....http://dblp.org/pers/hd/s/Saini:Mukesh_Kumar", "Vivek K. Singh.....http://dblp.org/pers/hd/s/Singh:Vivek_K=", "Ramesh Jain.....http://dblp.org/pers/hd/j/Jain:Ramesh", "Mohan S. Kankanhalli.....http://dblp.org/pers/hd/k/Kankanhalli:Mohan_S="], "conf": "mm", "year": "2008", "pages": 4}