{"title": "Protocols and Lower Bounds for Failure Localization in the Internet.", "fields": ["shared secret", "internet protocol", "link control protocol", "security parameter", "universal composability"], "abstract": "A secure failure-localization path-quality-monitoring (FLPQM) protocols allows a sender to localize faulty links on a single path through a network to a receiver, even when intermediate nodes on the path behave adversarially. Such protocols were proposed as tools that enable Internet service providers to select high-performance paths through the Internet, or to enforce contractual obligations. We give the first formal definitions of security for FL-PQM protocols and construct: 1. A simple FL-PQM protocol that can localize a faulty link every time a packet is not correctly delivered. This protocol's communication overhead is O(1) additional messages of length O(n) per packet (where n is the security parameter). 2. A more efficient FL-PQM protocol that can localize a faulty link when a noticeable fraction of the packets sent during some time period are not correctly delivered. The number of additional messages is an arbitrarily small fraction of the total number of packets. We also prove lower bounds for such protocols: 1. Every secure FL-PQM protocol requires each intermediate node on the path to have some shared secret information (e.g. keys). 2. If secure FL-PQM protocols exist then so do one-way functions. 3. Every black-box construction of a FL-PQM protocol from a random oracle that securely localizes every packet and adds at most O(log n) messages overhead per packet requires each intermediate node to invoke the oracle.\n\nThese results show that implementing FL-PQM requires active cooperation (i.e. maintaining keys and agreeing on, and performing, cryptographic protocols) from all of the intermediate nodes along the path. This may be problematic in the Internet, where links operate at extremely high speeds, and intermediate nodes are owned by competing business entities with little incentive to cooperate.", "citation": "Citations (62)", "year": "2008", "departments": ["Princeton University", "Princeton University", "Princeton University"], "conf": "eurocrypt", "authors": ["Boaz Barak.....http://dblp.org/pers/hd/b/Barak:Boaz", "Sharon Goldberg.....http://dblp.org/pers/hd/g/Goldberg:Sharon", "David Xiao.....http://dblp.org/pers/hd/x/Xiao:David"], "pages": 20}