{"title": "Testudo: Heavyweight security analysis via statistical sampling.", "fields": ["overhead", "cache", "data flow analysis", "software bug", "taint checking"], "abstract": "Heavyweight security analysis systems, such as taint analysis and dynamic type checking, are powerful technologies used to detect security vulnerabilities and software bugs. Traditional software implementations of these systems have high instrumentation overhead and suffer from significant performance impacts. To mitigate these slowdowns, a few hardware-assisted techniques have been recently proposed. However, these solutions incur a large memory overhead and require hardware platform support in the form of tagged memory systems and extended bus designs. Due to these costs and limitations, the deployment of heavyweight security analysis solutions is, as of today, limited to the research lab. In this paper, we describe Testudo, a novel hardware approach to heavyweight security analysis that is based on statistical sampling of a programpsilas dataflow. Our dynamic distributed debugging reduces the memory overhead to a small storage space by selectively sampling only a few tagged variables to analyze during any particular execution of the program. Our system requires only small hardware modifications: it adds a small sample cache to the main processor and extends the pipeline registers to propagate analysis tags. To gain high analysis coverage, we rely on a population of users to run the program, sampling a different random set of variables during each new run. We show that we can achieve high coverage analysis at virtually no performance impact, even with a reasonably-sized population of users. In addition, our approach even scales to heavyweight debugging techniques by keeping per-user runtime overheads low despite performing traditionally costly analyses. Moreover, the low hardware cost of our implementation allows it to be easily distributed across large user populations, leading to a higher level of security analysis coverage than previously.", "citation": "Citations (12)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Joseph L. Greathouse.....http://dblp.org/pers/hd/g/Greathouse:Joseph_L=", "Ilya Wagner.....http://dblp.org/pers/hd/w/Wagner:Ilya", "David A. Ramos.....http://dblp.org/pers/hd/r/Ramos:David_A=", "Gautam Bhatnagar.....http://dblp.org/pers/hd/b/Bhatnagar:Gautam", "Todd M. Austin.....http://dblp.org/pers/hd/a/Austin:Todd_M=", "Valeria Bertacco.....http://dblp.org/pers/hd/b/Bertacco:Valeria", "Seth Pettie.....http://dblp.org/pers/hd/p/Pettie:Seth"], "conf": "micro", "year": "2008", "pages": 12}