{"title": "All-Optical Label Stacking: Easing the Trade-offs Between Routing and Architecture Cost in All-Optical Packet Switching.", "fields": ["multiprotocol label switching", "compromise", "packet switching", "label switching", "label distribution protocol"], "abstract": "All-optical label swapping (AOLS) forms a key technology towards the implementation of all-optical packet switching nodes (AOPS) for the future optical Internet. The capital expenditures of the deployment of AOLS increases with the size of the label spaces (i.e. the number of used labels), since a special optical device is needed for each recognized label on every node. Label space sizes are affected by the way in which demands are routed. For instance, while shortest-path routing leads to the usage of fewer labels but high link utilization, minimum interference routing leads to the opposite. This paper studies all-optical label stacking (AOLStack), which is an extension of the AOLS architecture. AOLStack aims at reducing label spaces while easing the compromise with link utilization. In this paper, an integer lineal program is proposed with the objective of analyzing the softening of the aforementioned trade-off due to AOLStack. Furthermore, a heuristic aiming at finding good solutions in polynomial-time is proposed as well. Simulation results show that AOLStack either a) reduces the label spaces with a low increase in the link utilization or, similarly, b) uses better the residual bandwidth to decrease the number of labels even more.", "citation": "Citations (11)", "departments": ["University of Girona", "University of Girona", "University of Girona", "Ghent University", "Ghent University"], "authors": ["Fernando Solano.....http://dblp.org/pers/hd/s/Solano:Fernando", "Ruth van Caenegem.....http://dblp.org/pers/hd/c/Caenegem:Ruth_van", "Didier Colle.....http://dblp.org/pers/hd/c/Colle:Didier", "José-Luis Marzo.....http://dblp.org/pers/hd/m/Marzo:Jos=eacute==Luis", "Mario Pickavet.....http://dblp.org/pers/hd/p/Pickavet:Mario", "Ramón Fabregat.....http://dblp.org/pers/hd/f/Fabregat:Ram=oacute=n", "Piet Demeester.....http://dblp.org/pers/hd/d/Demeester:Piet"], "conf": "infocom", "year": "2008", "pages": 9}