{"title": "Ad-hoc aggregations of ranked lists in the presence of hierarchies.", "fields": ["information discovery", "precomputation", "aggregation problem", "early stopping", "ranking"], "abstract": "A variety of web sites and web based services produce textual lists at varying time granularities ranked according to several criteria. For example, Google Trends produces lists of popular query keywords which can be visualized according to several criteria. At Flickr, lists of popular tags used to tag the images uploaded can be visualized as a cloud based on their popularity. Identification of the  k  most popular terms can be easily conducted by utilizing well known  rank aggregation  algorithms.   In this paper we take a different approach to information discovery from such ranked lists. We maintain the same rank aggregation framework but we  elevate  terms at a higher level by making use of popular  term hierarchies  commonly available. Under such a transformation we show that typical early stopping certificates available for rank aggregation algorithms are no longer applicable. Based on this observation, in this paper, we present a probabilistic framework for early stopping in this setting. We introduce a relaxed version of the rank aggregation problem involving a deterministic stopping condition with user specified precision. We introduce an algorithm  pH -- RA  for the solution of this problem. In addition we introduce techniques to improve the performance of  pH -- RA even further via precomputation utilizing a sparse set system. Through a detailed experimental evaluation using synthetic and real datasets we demonstrate the efficiency of our framework.", "citation": "Citations (10)", "year": "2008", "departments": ["University of Toronto", "University of Pennsylvania", "University of Toronto"], "conf": "sigmod", "authors": ["Nilesh Bansal.....http://dblp.org/pers/hd/b/Bansal:Nilesh", "Sudipto Guha.....http://dblp.org/pers/hd/g/Guha:Sudipto", "Nick Koudas.....http://dblp.org/pers/hd/k/Koudas:Nick"], "pages": 12}