{"title": "Inside the New Coolstreaming: Principles, Measurements and Performance Implications.", "fields": ["internet video", "dynamic priority scheduling", "workload", "end user", "resource distribution"], "abstract": "The peer-to-peer (P2P) based video streaming has emerged as a promising solution for Internet video distribution. Leveraging the resource available at end users, this approach poses great potential to scale in the Internet. We have now seen the commercial P2P streaming systems that are orders of magnitude larger than the earlier academic systems. We believe understanding its basic principles and limitations are important in the design of future systems. The Coolstreaming, first released in summer 2004, arguably represented the first successful large-scale P2P live streaming system. Since then, the system has been significantly modified and commercially launched. This paper takes an inside look at the new Coolstreaming system by exposing its design options and rationale behind them, and examines their implications on streaming performance. Specifically, by leveraging a large set of traces obtained from recent live event broadcast and extensive simulations, we study the workload characteristics, system dynamics, and impact from a variety of system parameters. We demonstrate that there is a highly skewed resource distribution in such systems and the performance is mostly affected by the system dynamics. In addition, we show that there are inherent correlations and fundamental trade-off among different system parameters, which can be further explored to enhance the system performance.", "citation": "Citations (370)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University"], "authors": ["Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Susu Xie.....http://dblp.org/pers/hd/x/Xie:Susu", "Yang Qu.....http://dblp.org/pers/hd/q/Qu:Yang", "Gabriel Yik Keung.....http://dblp.org/pers/hd/k/Keung:Gabriel_Yik", "Chuang Lin.....http://dblp.org/pers/hd/l/Lin:Chuang", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Xinyan Zhang.....http://dblp.org/pers/hd/z/Zhang:Xinyan"], "conf": "infocom", "year": "2008", "pages": 9}