{"title": "Bayesian video search reranking.", "fields": ["numerical linear algebra", "distance measures", "full text search", "ranking", "trecvid"], "abstract": "Content-based video search reranking can be regarded as a process that uses visual content to recover the \"true\" ranking list from the noisy one generated based on textual information. This paper explicitly formulates this problem in the Bayesian framework, i.e., maximizing the ranking score consistency among visually similar video shots while minimizing the ranking distance, which represents the disagreement between the objective ranking list and the initial text-based. Different from existing point-wise ranking distance measures, which compute the distance in terms of the individual scores, two new methods are proposed in this paper to measure the ranking distance based on the disagreement in terms of pair-wise orders. Specifically, hinge distance penalizes the pairs with reversed order according to the degree of the reverse, while preference strength distance further considers the preference degree. By incorporating the proposed distances into the optimization objective, two reranking methods are developed which are solved using quadratic programming and matrix computation respectively. Evaluation on TRECVID video search benchmark shows that the performance improvement up to 21% on TRECVID 2006 and 61.11% on TRECVID 2007 are achieved relative to text search baseline.", "citation": "Citations (188)", "departments": ["University of Science and Technology of China", "Microsoft", "Microsoft", "Zhejiang University", "University of Science and Technology of China"], "authors": ["Xinmei Tian.....http://dblp.org/pers/hd/t/Tian:Xinmei", "Linjun Yang.....http://dblp.org/pers/hd/y/Yang:Linjun", "Jingdong Wang.....http://dblp.org/pers/hd/w/Wang:Jingdong", "Yichen Yang.....http://dblp.org/pers/hd/y/Yang:Yichen", "Xiuqing Wu.....http://dblp.org/pers/hd/w/Wu:Xiuqing", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng"], "conf": "mm", "year": "2008", "pages": 10}