{"title": "Towards a Theory of Robust Localization Against Malicious Beacon Nodes.", "fields": ["bounded function", "beacon", "completeness", "local algorithm", "heuristic"], "abstract": "Localization in the presence of malicious beacon nodes is an important problem in wireless networks. Although significant progress has been made on this problem, some fundamental theoretical questions still remain unanswered: in the presence of malicious beacon nodes, what are the necessary and sufficient conditions to guarantee a bounded error during 2-dimensional location estimation? Under these necessary and sufficient conditions, what class of localization algorithms can provide that error bound? In this paper, we try to answer these questions. Specifically, we show that, when the number of malicious beacons is greater than or equal to some threshold, there is no localization algorithm that can have a bounded error. Furthermore, when the number of malicious beacons is below that threshold, we identify a class of localization algorithms that can ensure that the localization error is bounded. We also outline two algorithms in this class, one of which is guaranteed to finish in polynomial time (in the number of beacons providing information) in the worst case, while the other is based on a heuristic and is practically efficient. For completeness, we also extend the above results to the 3-dimensional case. Experimental results demonstrate that our solution has very good localization accuracy and computational efficiency.", "citation": "Citations (64)", "departments": ["University at Buffalo", "University at Buffalo", "University at Buffalo", "University at Buffalo"], "authors": ["Sheng Zhong.....http://dblp.org/pers/hd/z/Zhong:Sheng", "Murtuza Jadliwala.....http://dblp.org/pers/hd/j/Jadliwala:Murtuza", "Shambhu J. Upadhyaya.....http://dblp.org/pers/hd/u/Upadhyaya:Shambhu_J=", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming"], "conf": "infocom", "year": "2008", "pages": 9}