{"title": "Degree Bounded Network Design with Metric Costs.", "fields": ["degree", "triangle inequality", "distributed minimum spanning tree", "minimum degree spanning tree", "connectivity", "spanning tree", "bounded function"], "abstract": "Given a complete undirected graph, a cost function on edges, and a degree bound $B$, the degree bounded network design problem is to find a minimum cost simple subgraph with maximum degree $B$ satisfying given connectivity requirements. Even for a simple connectivity requirement such as finding a spanning tree, computing a feasible solution for the degree bounded network design problem is already NP-hard, and thus there is no polynomial factor approximation algorithm for this problem. In this paper, we show that when the cost function satisfies the triangle inequality, there are constant factor approximation algorithms for various degree bounded network design problems. In global edge-connectivity, there is a $(2+\\frac{1}{k})$-approximation algorithm for the minimum bounded degree $k$-edge-connected subgraph problem. In local edge-connectivity, there is a 4-approximation algorithm for the minimum bounded degree Steiner network problem when $r_{\\max}$ is even, and a 5.5-approximation algorithm when $r_{\\max}$ is odd, where $r_{\\max}$ is the maximum connectivity requirement. In global vertex-connectivity, there is a $(2+\\frac{k-1}{n}+\\frac{1}{k})$-approximation algorithm for the minimum bounded degree $k$-vertex-connected subgraph problem when $n\\geq2k$, where $n$ is the number of vertices. For spanning tree, there is a $(1+\\frac{1}{B-1})$-approximation algorithm for the minimum bounded degree spanning tree problem. These approximation algorithms return solutions with the smallest possible maximum degree, and in most cases the cost guarantee is obtained by comparing to the optimal cost when there are no degree constraints. This demonstrates that degree constraints can be incorporated into network design problems with metric costs. Our algorithms can be seen as a generalization of Christofides' algorithm for the metric traveling salesman problem. The main technical tool is a simplicity-preserving edge splitting-off operation, which is used to “short-cut” vertices with high degree while maintaining connectivity requirements and preserving simplicity of the solutions.", "citation": "Citations (14)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Yuk Hei Chan.....http://dblp.org/pers/hd/c/Chan:Yuk_Hei", "Wai Shing Fung.....http://dblp.org/pers/hd/f/Fung:Wai_Shing", "Lap Chi Lau.....http://dblp.org/pers/hd/l/Lau:Lap_Chi", "Chun Kong Yung.....http://dblp.org/pers/hd/y/Yung:Chun_Kong"], "conf": "focs", "year": "2008", "pages": 10}