{"title": "Circular, Linear, and Curvilinear Vection in a Large-screen Virtual Environment with Floor Projection.", "fields": ["optical flow", "motion perception", "curvilinear coordinates", "illusion", "sensation"], "abstract": "Vection is defined as the compelling sensation of illusory self- motion elicited by a moving sensory, usually visual, stimulus. This paper presents collected introspective data on the experience of linear, circular, and curvilinear vection. We evaluate the differences between twelve different trajectories and the influence of the floor projection on the illusion of self-motion. All of the simulated self- motions examined are of a constant velocity, except for a brief simulated initial acceleration. First, we find that linear translations to the left and right are perceived as the least convincing, while linear down is perceived as the most convincing of the linear trajectories. Second, we find that the floor projection significantly improves the introspective measures of linear vection experienced in a photorealistic three-dimensional town. Finally, we find that while linear forward vection is not perceived to be very convincing, curvilinear forward vection is reported to be as convincing as circular vection. Considering our experimental results, our suggestions for simulators and VE applications where vection is desirable is to increase the number of curvilinear trajectories (as opposed to linear ones) and, if possible, add floor projection in order to improve the illusory sense of self-motion.", "citation": "Citations (3)", "departments": ["Max Planck Society", "Max Planck Society", "Max Planck Society", "Max Planck Society"], "authors": ["Laura C. Trutoiu.....http://dblp.org/pers/hd/t/Trutoiu:Laura_C=", "Betty J. Mohler.....http://dblp.org/pers/hd/m/Mohler:Betty_J=", "Jörg Schulte-Pelkum.....http://dblp.org/pers/hd/s/Schulte=Pelkum:J=ouml=rg", "Heinrich H. Bülthoff.....http://dblp.org/pers/hd/b/B=uuml=lthoff:Heinrich_H="], "conf": "vr", "year": "2008", "pages": 6}