{"title": "Swarming on Optimized Graphs for n-Way Broadcast.", "fields": ["download", "planetlab", "data file", "swarming", "bittorrent"], "abstract": "In an n-way broadcast application each one of n overlay nodes wants to push its own distinct large data file to all other n-1 destinations as well as download their respective data files. BitTorrent-like swarming protocols are ideal choices for handling such massive data volume transfers. The original BitTorrent targets one-to-many broadcasts of a single file to a very large number of receivers and thus, by necessity, employs an almost random overlay topology, n-way broadcast applications on the other hand, owing to their inherent n-squared nature, are realizable only in small to medium scale networks. In this paper, we show that we can leverage this scale constraint to construct optimized overlay topologies that take into consideration the end-to-end characteristics of the network and as a consequence deliver far superior performance compared to random and myopic (local) approaches. We present the Max-Min and Max- Sum peer-selection policies used by individual nodes to select their neighbors. The first one strives to maximize the available bandwidth to the slowest destination, while the second maximizes the aggregate output rate. We design a swarming protocol suitable for n-way broadcast and operate it on top of overlay graphs formed by nodes that employ Max-Min or Max-Sum policies. Using trace-driven simulation and measurements from a PlanetLab prototype implementation, we demonstrate that the performance of swarming on top of our constructed topologies is far superior to the performance of random and myopic overlays. Moreover, we show how to modify our swarming protocol to allow it to accommodate selfish nodes.", "citation": "Citations (8)", "departments": ["Boston University", "Boston University", "Harvard University", "Boston University", "Boston University"], "authors": ["Georgios Smaragdakis.....http://dblp.org/pers/hd/s/Smaragdakis:Georgios", "Azer Bestavros.....http://dblp.org/pers/hd/b/Bestavros:Azer", "Nikolaos Laoutaris.....http://dblp.org/pers/hd/l/Laoutaris:Nikolaos", "John W. Byers.....http://dblp.org/pers/hd/b/Byers:John_W=", "Pietro Michiardi.....http://dblp.org/pers/hd/m/Michiardi:Pietro", "Mema Roussopoulos.....http://dblp.org/pers/hd/r/Roussopoulos:Mema"], "conf": "infocom", "year": "2008", "pages": 5}