{"title": "Auditing SQL Queries.", "fields": ["audit", "spatial query", "audit trail", "null", "privacy by design", "access control", "conjunctive query", "privacy software", "stored procedure", "privacy policy", "precomputation", "information security audit", "information privacy", "sql", "query by example", "on the fly", "expression", "unified model", "officer"], "abstract": "We study the problem of auditing a batch of SQL queries: given a forbidden view of a database that should have been kept confidential, a batch of queries that were posed over this database and answered, and a definition of suspiciousness, determine if the query batch is suspicious with respect to the forbidden view. We consider several notions of suspiciousness that span a spectrum both in terms of their disclosure detection guarantees and the tractability of auditing under them for different classes of queries. We identify a particular notion of suspiciousness, weak syntactic suspiciousness, that allows for an efficient auditor for a large class of conjunctive queries. The auditor can be used together with a specific set of forbidden views to detect disclosures of the association between individuals and their private attributes. Further it can also be used to prevent disclosures by auditing queries on the fly in an online setting. Finally, we tie in our work with recent research on query auditing and access control and relate the above definitions of suspiciousness to the notion of unconditional validity of a query introduced in database access control literature.", "citation": "Not cited", "departments": ["Stanford University", "Stanford University", "Google", "Microsoft", "Microsoft", "Stanford University", "Stanford University", "Stanford University", "Indian Institute of Technology Delhi", "Indian Institute of Technology Delhi", "Dept. of Comp.  ... , , New Delhi,", "I.I.T. Delhi, H ... Khas, New Delhi", "I.I.T. Delhi, H ... Khas, New Delhi", "N.S.I.T. Delhi, ... arka, New Delhi"], "authors": ["Rajeev Motwani.....http://dblp.org/pers/hd/m/Motwani:Rajeev", "Shubha U. Nabar.....http://dblp.org/pers/hd/n/Nabar:Shubha_U=", "Dilys Thomas.....http://dblp.org/pers/hd/t/Thomas:Dilys"], "conf": "icde", "year": "2008", "pages": 10}