{"title": "Multihop Local Pooling for Distributed Throughput Maximization in Wireless Networks.", "fields": ["pooling", "network planning and design", "throughput", "network topology", "distributed algorithm"], "abstract": "Efficient operation of wireless networks requires distributed routing and scheduling algorithms that take into account interference constraints. Recently, a few algorithms for networks with primary- or secondary-interference constraints have been developed. Due to their distributed operation, these algorithms can achieve only a guaranteed fraction of the maximum possible throughput. It was also recently shown that if a set of conditions (known as Local Pooling) is satisfied, simple distributed scheduling algorithms achieve 100% throughput. However, previous work regarding Local Pooling focused mostly on obtaining abstract conditions and on networks with single-hop interference or single-hop traffic. In this paper, we identify several graph classes that satisfy the Local Pooling conditions, thereby enabling the use of such graphs in network design algorithms. Then, we study the multihop implications of Local Pooling. We show that in many cases, as the interference degree increases, the Local Pooling conditions are more likely to hold. Consequently, although increased interference reduces the maximum achievable throughput of the network, it tends to enable distributed algorithms to achieve 100% of this throughput. Regarding multihop traffic, we show that if the network satisfies only the single-hop Local Pooling conditions, distributed joint routing and scheduling algorithms are not guaranteed to achieve maximum throughput. Therefore, we present new conditions for Multihop Local Pooling, under which distributed algorithms achieve 100% throughout. Finally, we identify network topologies in which the conditions hold and discuss the algorithmic implications of the results.", "citation": "Citations (88)", "departments": ["Columbia University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil", "Andrew Brzezinski.....http://dblp.org/pers/hd/b/Brzezinski:Andrew", "Eytan Modiano.....http://dblp.org/pers/hd/m/Modiano:Eytan"], "conf": "infocom", "year": "2008", "pages": 9}