{"title": "Grouping and optimization of XPath expressions in DB2 pureXML.", "fields": ["xpath", "xquery", "query plan", "xpath 2 0", "flwor"], "abstract": "Several XML DBMSs support XQuery and/or SQL/XML languages, which are based on navigational primitives in the form of XPath expressions. Typically, these systems either model each XPath step as a separate query plan operator, or employ holistic approaches that can evaluate multiple steps of a single XPath expression. There have also been proposals to execute as many XPath expressions as possible within a single FLWOR block simultaneously in a  data streaming  context.   We observe that blindly combining all possible XPath expressions for concurrent execution can result in significant performance degradation in a database system. We identify two main problems with this strategy. First, the simple strategy of grouping all XPath expressions on a single document does not always work if the query involves more than one data source or has nested query blocks. Second, merging XPath expressions may result in unnecessary execution of branches that can be filtered by predicates in other branches or elsewhere in the query. To rectify these problems, IBM ®  DB2 ®  pureXML\" adopts a combination of heuristic-based rewrite transformations, to decide which XPath expressions should be grouped for concurrent evaluation, and cost-based optimization to globally order the groups within the query execution plan, and locally order the branches within individual groups. Experimental evaluation confirms that selectively grouping multiple XPath expressions allows for better query evaluation performance and reduces the query optimization complexity. These optimization techniques have been implemented as part of IBM DB2 9.5 (pureXML).", "citation": "Citations (9)", "year": "2008", "departments": ["IBM", "IBM", "IBM", "IBM"], "conf": "sigmod", "authors": ["Andrey Balmin.....http://dblp.org/pers/hd/b/Balmin:Andrey", "Fatma Özcan.....http://dblp.org/pers/hd/=/=Ouml=zcan:Fatma", "Ashutosh Singh.....http://dblp.org/pers/hd/s/Singh:Ashutosh", "Edison Ting.....http://dblp.org/pers/hd/t/Ting:Edison"], "pages": 10}