{"title": "DySy: dynamic symbolic execution for invariant inference.", "fields": ["test case", "test suite", "the symbolic", "symbolic execution", "invariant"], "abstract": "Dynamically discovering likely program invariants from concrete test executions has emerged as a highly promising software engineering technique. Dynamic invariant inference has the advantage of succinctly summarizing both \"expected\" program inputs and the subset of program behaviors that is normal under those inputs. In this paper, we introduce a technique that can drastically increase the relevance of inferred invariants, or reduce the size of the test suite required to obtain good invariants. Instead of falsifying invariants produced by pre-set patterns, we determine likely program invariants by combining the concrete execution of actual test cases with a simultaneous  symbolic  execution of the same tests. The symbolic execution produces abstract conditions over program variables that the concrete tests satisfy during their execution. In this way, we obtain the benefits of dynamic inference tools like Daikon: the inferred invariants correspond to the observed program behaviors. At the same time, however, our inferred invariants are much more suited to the program at hand than Daikon's hard-coded invariant patterns. The symbolic invariants are literally derived from the program text itself, with appropriate value substitutions as dictated by symbolic execution.   We implemented our technique in the DySy tool, which utilizes a powerful symbolic execution and simplification engine. The results confirm the benefits of our approach. In Daikon's prime example benchmark, we infer the majority of the interesting Daikon invariants, while eliminating invariants that a human user is likely to consider irrelevant.", "citation": "Citations (216)", "departments": ["Georgia Institute of Technology", "Microsoft", "University of Oregon"], "authors": ["Christoph Csallner.....http://dblp.org/pers/hd/c/Csallner:Christoph", "Nikolai Tillmann.....http://dblp.org/pers/hd/t/Tillmann:Nikolai", "Yannis Smaragdakis.....http://dblp.org/pers/hd/s/Smaragdakis:Yannis"], "conf": "icse", "year": "2008", "pages": 10}