{"title": "Advanced Multi-Frame Rate Rendering Techniques.", "fields": ["parallel rendering", "alternate frame rendering", "software rendering", "3d rendering", "tiled rendering"], "abstract": "Multi-frame rate rendering is a parallel rendering technique that renders interactive parts of the scene on one graphics card while the rest of the scene is rendered asynchronously on a second graphics card. The resulting color and depth images of both render processes are composited and displayed. This paper presents advanced multi-frame rate rendering techniques, which remove limitations of the original approach and reduce artifacts. The interactive manipulation of light sources and their parameters affects the entire scene. Our multi-GPU deferred shading splits the rendering task into a rasterization and lighting pass and distributes the passes to the appropriate graphics card to enable light manipulations at high frame rates independent of the geometry complexity of the scene. We also developed a parallel volume rendering technique, which allows the manipulation of objects inside a translucent volume at high frame rates. Due to the asynchronous nature of multi-frame rate rendering artifacts may occur during the migration of objects from the slow to the fast graphics card, and vice versa. We show how proper state management can be used to avoid these artifacts almost completely. These techniques were developed in the context of a single-system multi-GPU setup, which considerably simplifies the implementation and increases performance.", "citation": "Citations (6)", "departments": ["Bauhaus University, Weimar", "Bauhaus University, Weimar", "University of Louisiana at Lafayette", "Bauhaus University, Weimar"], "authors": ["Jan P. Springer.....http://dblp.org/pers/hd/s/Springer:Jan_P=", "Christopher Lux.....http://dblp.org/pers/hd/l/Lux:Christopher", "Dirk Reiners.....http://dblp.org/pers/hd/r/Reiners:Dirk", "Bernd Froehlich.....http://dblp.org/pers/hd/f/Froehlich_0001:Bernd"], "conf": "vr", "year": "2008", "pages": 8}