{"title": "Pacemakers and Implantable Cardiac Defibrillators: Software Radio Attacks and Zero-Power Defenses.", "fields": ["patient safety", "programmer", "implantable cardioverter defibrillator", "compromise", "software defined radio"], "abstract": "Our study analyzes the security and privacy properties of an implantable cardioverter defibrillator (ICD). Introduced to the U.S. market in 2003, this model of ICD includes pacemaker technology and is designed to communicate wirelessly with a nearby external programmer in the 175 kHz frequency range. After partially reverse-engineering the ICD's communications protocol with an oscilloscope and a software radio, we implemented several software radio-based attacks that could compromise patient safety and patient privacy. Motivated by our desire to improve patient safety, and mindful of conventional trade-offs between security and power consumption for resource-constrained devices, we introduce three new zero-power defenses based on RF power harvesting. Two of these defenses are human-centric, bringing patients into the loop with respect to the security and privacy of their implantable medical devices (IMDs). Our contributions provide a scientific baseline for understanding the potential security and privacy risks of current and future IMDs, and introduce human-perceptible and zero-power mitigation techniques that address those risks. To the best of our knowledge, this paper is the first in our community to use general-purpose software radios to analyze and attack previously unknown radio communications protocols.", "citation": "Citations (506)", "departments": ["University of Washington", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Daniel Halperin.....http://dblp.org/pers/hd/h/Halperin:Daniel", "Thomas S. Heydt-Benjamin.....http://dblp.org/pers/hd/h/Heydt=Benjamin:Thomas_S=", "Benjamin Ransford.....http://dblp.org/pers/hd/r/Ransford:Benjamin", "Shane S. Clark.....http://dblp.org/pers/hd/c/Clark:Shane_S=", "Benessa Defend.....http://dblp.org/pers/hd/d/Defend:Benessa", "Will Morgan.....http://dblp.org/pers/hd/m/Morgan:Will", "Kevin Fu.....http://dblp.org/pers/hd/f/Fu:Kevin", "Tadayoshi Kohno.....http://dblp.org/pers/hd/k/Kohno:Tadayoshi", "William H. Maisel.....http://dblp.org/pers/hd/m/Maisel:William_H="], "conf": "sp", "year": "2008", "pages": 14}