{"title": "High-throughput pairwise point interactions in Anton, a specialized machine for molecular dynamics simulation.", "fields": ["cutoff", "massively parallel", "supercomputer", "pairwise comparison", "low latency"], "abstract": "Anton is a massively parallel special-purpose supercomputer designed to accelerate molecular dynamics (MD) simulations by several orders of magnitude, making possible for the first time the atomic-level simulation of many biologically important phenomena that take place over microsecond to millisecond time scales. The majority of the computation required for MD simulations involves the calculation of pairwise interactions between particles and/or gridpoints separated by no more than some specified cutoff radius. In Anton, such range-limited interactions are handled by a high-throughput interaction subsystem (HTIS). The HTIS on each of Antonpsilas 512 ASICs includes 32 computational pipelines running at 800 MHz, each producing a result on every cycle that would require approximately 50 arithmetic operations to compute on a general-purpose processor. In order to feed these pipelines and collect their results at a speed sufficient to take advantage of this computational power, Anton uses two novel techniques to limit inter- and intra-chip communication. The first is a recently developed parallelization algorithm for the range-limited N-body problem that offers major advantages in both asymptotic and absolute terms by comparison with traditional methods. The second is an architectural feature that processes pairs of points chosen from two point sets in time proportional to the product of the sizes of those sets, but with input and output volume proportional only to their sum. Together, these features allow Anton to perform pairwise interactions with very high throughput and unusually low latency, enabling MD simulations on time scales inaccessible to other general- and special-purpose parallel systems.", "citation": "Citations (22)", "departments": ["D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research"], "authors": ["Richard H. Larson.....http://dblp.org/pers/hd/l/Larson:Richard_H=", "John K. Salmon.....http://dblp.org/pers/hd/s/Salmon:John_K=", "Ron O. Dror.....http://dblp.org/pers/hd/d/Dror:Ron_O=", "Martin M. Deneroff.....http://dblp.org/pers/hd/d/Deneroff:Martin_M=", "Cliff Young.....http://dblp.org/pers/hd/y/Young:Cliff", "J. P. Grossman.....http://dblp.org/pers/hd/g/Grossman:J=_P=", "Yibing Shan.....http://dblp.org/pers/hd/s/Shan:Yibing", "John L. Klepeis.....http://dblp.org/pers/hd/k/Klepeis:John_L=", "David E. Shaw.....http://dblp.org/pers/hd/s/Shaw:David_E="], "conf": "hpca", "year": "2008", "pages": 12}