{"title": "Pergamum: Replacing Tape with Energy Efficient, Reliable, Disk-Based Archival Storage.", "fields": ["legacy system", "idle", "data loss", "guard", "random access"], "abstract": "As the world moves to digital storage for archival purposes, there is an increasing demand for reliable, low-power, cost-effective, easy-to-maintain storage that can still provide adequate performance for information retrieval and auditing purposes. Unfortunately, no current archival system adequately fulfills all of these requirements. Tape-based archival systems suffer from poor random access performance, which prevents the use of inter-media redundancy techniques and auditing, and requires the preservation of legacy hardware. Many disk-based systems are ill-suited for long-term storage because their high energy demands and management requirements make them cost-ineffective for archival purposes.\n\nOur solution, Pergamum, is a distributed network of intelligent, disk-based, storage appliances that stores data reliably and energy-efficiently. While existing MAID systems keep disks idle to save energy, Pergamum adds NVRAM at each node to store data signatures, metadata, and other small items, allowing deferred writes, metadata requests and inter-disk data verification to be performed while the disk is powered off. Pergamum uses both intra-disk and inter-disk redundancy to guard against data loss, relying on hash tree-like structures of algebraic signatures to efficiently verify the correctness of stored data. If failures occur, Pergamum uses staggered rebuild to reduce peak energy usage while rebuilding large redundancy stripes. We show that our approach is comparable in both startup and ongoing costs to other archival technologies and provides very high reliability. An evaluation of our implementation of Pergamum shows that it provides adequate performance.", "citation": "Citations (196)", "departments": ["University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz", "Network Appliance"], "authors": ["Mark W. Storer.....http://dblp.org/pers/hd/s/Storer:Mark_W=", "Kevin M. Greenan.....http://dblp.org/pers/hd/g/Greenan:Kevin_M=", "Ethan L. Miller.....http://dblp.org/pers/hd/m/Miller:Ethan_L=", "Kaladhar Voruganti.....http://dblp.org/pers/hd/v/Voruganti:Kaladhar"], "conf": "fast", "year": "2008", "pages": 16}