{"title": "Approximation Algorithms for Single-minded Envy-free Profit-maximization Problems with Limited Supply.", "fields": ["algorithmic game theory", "linear programming", "graph theory", "profit maximization", "approximation algorithm"], "abstract": "We present the first polynomial-time approximation algorithms for single-minded envy-free profit-maximization problems (Guruswami et al., 2005) with limited supply. Our algorithms return a pricing scheme and a subset of customers that are designated the winners, which satisfy the envy-freeness constraint, whereas in our analyses, we compare the profit of our solution against the optimal value of the corresponding social-welfare-maximization (SWM) problem of finding a winner-set with maximum total value. Our algorithms take any LP-based alpha-approximation algorithm for the corresponding SWM problem as input and return a solution that achieves profit at least OPT/O (alpha ldr log u max ), where OPT is the optimal value of the SWM problem, and u max  is the maximum supply of an item. This immediately yields approximation guarantees of O(radicmlog u max ) for the general single-minded envy-free problem; and O(log u max ) for the tollbooth and highway problems (Guruswami et al., 2005), and the graph-vertex pricing problem (Balcan and Blum, 2006) (alpha = O(1) for all the corresponding SWM problems). Since OPT is an upper bound on the maximum profit achievable by any solution (i.e., irrespective of whether the solution satisfies the envy-freeness constraint), our results directly carry over to the non-envy-free versions of these problems too. Our result also thus (constructively) establishes an upper bound of O(alpha ldr log u max ) on the ratio of (i) the optimum value of the profit-maximization problem and OPT; and (ii) the optimum profit achievable with and without the constraint of envy-freeness.", "citation": "Citations (55)", "departments": ["Cornell University", "University of Waterloo"], "authors": ["Maurice Cheung.....http://dblp.org/pers/hd/c/Cheung:Maurice", "Chaitanya Swamy.....http://dblp.org/pers/hd/s/Swamy:Chaitanya"], "conf": "focs", "year": "2008", "pages": 10}