{"title": "Direct Discriminative Pattern Mining for Effective Classification.", "fields": ["classification rule", "branch and bound", "discriminative model", "speedup", "ranking"], "abstract": "The application of frequent patterns in classification has demonstrated its power in recent studies. It often adopts a two-step approach: frequent pattern (or classification rule) mining followed by feature selection (or rule ranking). However, this two-step process could be computationally expensive, especially when the problem scale is large or the minimum support is low. It was observed that frequent pattern mining usually produces a huge number of \"patterns\" that could not only slow down the mining process but also make feature selection hard to complete. In this paper, we propose a direct discriminative pattern mining approach, DDPMine, to tackle the efficiency issue arising from the two-step approach. DDPMine performs a branch-and-bound search for directly mining discriminative patterns without generating the complete pattern set. Instead of selecting best patterns in a batch, we introduce a \"feature-centered\" mining approach that generates discriminative patterns sequentially on a progressively shrinking FP-tree by incrementally eliminating training instances. The instance elimination effectively reduces the problem size iteratively and expedites the mining process. Empirical results show that DDPMine achieves orders of magnitude speedup without any downgrade of classification accuracy. It outperforms the state-of-the-art associative classification methods in terms of both accuracy and efficiency.", "citation": "Citations (226)", "departments": ["University of Illinois at Urbana–Champaign", "IBM", "University of Illinois at Urbana–Champaign", "University of Illinois at Chicago"], "authors": ["Hong Cheng.....http://dblp.org/pers/hd/c/Cheng:Hong", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "conf": "icde", "year": "2008", "pages": 10}