{"title": "Dependence of Orientation Tuning on Recurrent Excitation and Inhibition in a Network Model of V1.", "fields": ["excitatory postsynaptic potential", "network model", "visual cortex", "hodgkin huxley model", "inhibitory postsynaptic potential"], "abstract": "The computational role of the local recurrent network in primary visual cortex is still a matter of debate. To address this issue, we analyze intracellular recording data of cat V1, which combine measuring the tuning of a range of neuronal properties with a precise localization of the recording sites in the orientation preference map. For the analysis, we consider a network model of Hodgkin-Huxley type neurons arranged according to a biologically plausible two-dimensional topographic orientation preference map. We then systematically vary the strength of the recurrent excitation and inhibition relative to the strength of the afferent input. Each parametrization gives rise to a different model instance for which the tuning of model neurons at different locations of the orientation map is compared to the experimentally measured orientation tuning of membrane potential, spike output, excitatory, and inhibitory conductances. A quantitative analysis shows that the data provides strong evidence for a network model in which the afferent input is dominated by strong, balanced contributions of recurrent excitation and inhibition. This recurrent regime is close to a regime of \"instability\", where strong, self-sustained activity of the network occurs. The firing rate of neurons in the best-fitting network is particularly sensitive to small modulations of model parameters, which could be one of the functional benefits of a network operating in this particular regime.", "citation": "Citations (3)", "year": "2008", "departments": ["Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "University of Rostock", "Control Group"], "conf": "nips", "authors": ["Klaus Wimmer.....http://dblp.org/pers/hd/w/Wimmer:Klaus", "Marcel Stimberg.....http://dblp.org/pers/hd/s/Stimberg:Marcel", "Robert Martin.....http://dblp.org/pers/hd/m/Martin:Robert", "Lars Schwabe.....http://dblp.org/pers/hd/s/Schwabe:Lars", "Jorge Mariño.....http://dblp.org/pers/hd/m/Mari=ntilde=o:Jorge", "James Schummers.....http://dblp.org/pers/hd/s/Schummers:James", "David C. Lyon.....http://dblp.org/pers/hd/l/Lyon:David_C=", "Mriganka Sur.....http://dblp.org/pers/hd/s/Sur:Mriganka", "Klaus Obermayer.....http://dblp.org/pers/hd/o/Obermayer:Klaus"], "pages": 8}