{"title": "Ditto: a system for opportunistic caching in multi-hop wireless networks.", "fields": ["order one network protocol", "wireless mesh network", "switched mesh", "shared mesh", "hop"], "abstract": "This paper presents the design, implementation, and evaluation of Ditto, a system that opportunistically caches overheard data to improve subsequent transfer throughput in wireless mesh networks. While mesh networks have been proposed as a way to provide cheap, easily deployable Internet access, they must maintain high transfer throughput to be able to compete with other last-mile technologies. Unfortunately, doing so is difficult because multi-hop wireless transmissions interfere with each other, reducing the available capacity on the network. This problem is particularly severe in common gateway-based scenarios in which nearly all transmissions go through one or a few gateways from the mesh network to the Internet.   Ditto exploits on-path as well as opportunistic caching based on overhearing to improve the throughput of data transfers and to reduce load on the gateways. It uses content-based naming to provide application independent caching at the granularity of small chunks, a feature that is key to being able to cache partially overheard data transfers. Our evaluation of Ditto shows that it can achieve significant performance gains for cached data, increasing throughput by up to 7x over simpler on-path caching schemes, and by up to an order of magnitude over no caching.", "citation": "Citations (68)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Fahad R. Dogar.....http://dblp.org/pers/hd/d/Dogar:Fahad_R=", "Amar Phanishayee.....http://dblp.org/pers/hd/p/Phanishayee:Amar", "Himabindu Pucha.....http://dblp.org/pers/hd/p/Pucha:Himabindu", "Olatunji Ruwase.....http://dblp.org/pers/hd/r/Ruwase:Olatunji", "David G. Andersen.....http://dblp.org/pers/hd/a/Andersen:David_G="], "conf": "mobicom", "year": "2008", "pages": 12}