{"title": "Shapeshifter: Dynamically changing pipeline width and speed to address process variations.", "fields": ["clock drift", "phenomenon", "cpu multiplier", "clock gating", "digital clock manager"], "abstract": "Process variations are a manufacturing phenomenon that result in some parameters of the transistors in a real chip to be different from those specified in the design. One impact of these variations is that the affected circuits may perform faster or slower than the design target. Unfortunately, only a small fraction of chips speed up whereas the vast majority incur slow downs. While die-to-die variations have been addressed by clock binning, within-die variations are increasing in importance with scaling. Clock binning in the presence of within-die variations results in slow clock speeds for dies with many components that can operate at higher clock speeds. A recent paper addressing within-die variations proposes variable-latency functional units and register file so that the fast instances of these components take fewer clock cycles to operate than the slower instances. However, in pipeline stages where the instances are interdependent, the fast instances would be held up by the slow instances. Also, variable latency may complicate timing-critical instruction scheduling. Instead of varying the number of clock cycles, we advocate varying the clock speed. Our scheme, called Shapeshifter, maintains high clock speeds during low-ILP program phases by using a narrower pipeline of only the faster instances, and reduces the clock speed only in the high-ILP phases which use all the instances. Shapeshifter simply turns off the slow instances, removing them from any interdependence among all the instances. Also, Shapeshifter requires minimal additions to the pipeline because almost all pipelines already support varying the clock speed for power management purposes. Using simulations, we show that Shapeshifter performs better than clock binning and the variable-latency approach.", "citation": "Citations (26)", "departments": ["Intel", "Intel", "Purdue University"], "authors": ["Eric Chun.....http://dblp.org/pers/hd/c/Chun:Eric", "Zeshan Chishti.....http://dblp.org/pers/hd/c/Chishti:Zeshan", "T. N. Vijaykumar.....http://dblp.org/pers/hd/v/Vijaykumar:T=_N="], "conf": "micro", "year": "2008", "pages": 12}