{"title": "Learning methods for lung tumor markerless gating in image-guided radiotherapy.", "fields": ["fiducial marker", "radiation therapy", "radiation", "template matching", "gating"], "abstract": "In an idealized gated radiotherapy treatment, radiation is delivered only when the tumor is at the right position. For gated lung cancer radiotherapy, it is difficult to generate accurate gating signals due to the large uncertainties when using external surrogates and the risk of pneumothorax when using implanted fiducial markers. In this paper, we investigate machine learning algorithms for markerless gated radiotherapy with fluoroscopic images. Previous approach utilizes template matching to localize the tumor position. Here, we investigate two ways to improve the precision of tumor target localization by applying: (1) an ensemble of templates where the representative templates are selected by Gaussian mixture clustering, and (2) a support vector machine (SVM) classifier with radial basis kernels. Template matching only considers images inside the gating window, but images outside the gating window might provide additional information. We take advantage of both states and re-cast the gating problem into a classification problem. Thus, we are able to use the SVM classifier for gated radiotherapy. To verify the effectiveness of the two proposed techniques, we apply them on five sequences of fluoroscopic images from five lung cancer patients against the gating signal of manually contoured tumors as ground truth. Our five-patient case study shows that both ensemble template matching and SVM are reasonable tools for image-guided markerless gated radiotherapy with an average of approximately 95% precision in terms of delivered target dose at approximately 35% duty cycle.", "citation": "Citations (2)", "departments": ["Northeastern University", "Northeastern University", "Harvard University", "Harvard University", "University of California, San Diego"], "authors": ["Ying Cui.....http://dblp.org/pers/hd/c/Cui:Ying", "Jennifer G. Dy.....http://dblp.org/pers/hd/d/Dy:Jennifer_G=", "Gregory C. Sharp.....http://dblp.org/pers/hd/s/Sharp:Gregory_C=", "Brian M. Alexander.....http://dblp.org/pers/hd/a/Alexander:Brian_M=", "Steve B. Jiang.....http://dblp.org/pers/hd/j/Jiang:Steve_B="], "conf": "kdd", "year": "2008", "pages": 9}