{"title": "Capturing Images with Sparse Informational Pixels using Projected 3D Tags.", "fields": ["photodetector", "augmented reality", "projector", "field of view", "image sensor"], "abstract": "In this paper, we propose a novel imaging system that enables the capture of photos and videos with sparse informational pixels. Our system is based on the projection and detection of 3D optical tags. We use an infrared (IR) projector to project temporally-coded (blinking) dots onto selected points in a scene. These tags are invisible to the human eye, but appear as clearly visible time-varying codes to an IR photosensor. As a proof of concept, we have built a prototype camera system (consisting of co-located visible and IR sensors) to simultaneously capture visible and IR images. When a user takes an image of a tagged scene using such a camera system, all the scene tags that are visible from the system's viewpoint are detected. In addition, tags that lie in the field of view but are occluded, and ones that lie just outside the field of view, are also automatically generated for the image. Associated with each tagged pixel is its 3D location and the identity of the object that the tag falls on. Our system can interface with conventional image recognition methods for efficient scene authoring, enabling objects in an image to be robustly identified using cheap cameras, minimal computations, and no domain knowledge. We demonstrate several applications of our system, including, photo-browsing, e-commerce, augmented reality, and objection localization.", "citation": "Citations (12)", "departments": ["University of Wisconsin-Madison", "Google", "Columbia University", "Mitsubishi Electric Research Laboratories", "Columbia University"], "authors": ["Li Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Li", "Neesha Subramaniam.....http://dblp.org/pers/hd/s/Subramaniam:Neesha", "Robert Lin.....http://dblp.org/pers/hd/l/Lin:Robert", "Ramesh Raskar.....http://dblp.org/pers/hd/r/Raskar:Ramesh", "Shree K. Nayar.....http://dblp.org/pers/hd/n/Nayar:Shree_K="], "conf": "vr", "year": "2008", "pages": 8}