{"title": "MPLOT: A Transport Protocol Exploiting Multipath Diversity Using Erasure Codes.", "fields": ["wireless mesh network", "forward error correction", "hybrid automatic repeat request", "goodput", "packet loss"], "abstract": "In this paper, we propose a novel transport protocol that effectively utilizes available bandwidth and diversity gains provided by heterogeneous, highly lossy paths. Our Multi-Path LOss-Tolerant (MPLOT) protocol can be used to provide significant gains in the goodput of wireless mesh networks, subject to bursty, correlated losses with average loss-rates as high as 50%, and random outage events. MPLOT makes intelligent use of erasure codes to guard against packets losses, and a Hybrid-ARQ/FEC scheme to reduce packet recovery latency, where the redundancy is adaptively provisioned into both proactive and reactive FECs. MPLOT uses dynamic packet mapping based on current path characteristics, and does not require packets to be delivered in sequence to ensure reliability. We present a theoretical analysis of the different design choices of MPLOT and show that MPLOT makes an optimal trade-off between goodput and delay constraints. We test MPLOT, through simulations, under a variety of test scenarios and show that it effectively exploits path diversity in addition to aggregating path bandwidths. We also show that MPLOT is fair to single-path protocols like TCP-SACK.", "citation": "Citations (55)", "departments": ["Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "AT&T", "Rensselaer Polytechnic Institute"], "authors": ["Vicky Sharma.....http://dblp.org/pers/hd/s/Sharma:Vicky", "Shivkumar Kalyanaraman.....http://dblp.org/pers/hd/k/Kalyanaraman:Shivkumar", "Koushik Kar.....http://dblp.org/pers/hd/k/Kar:Koushik", "K. K. Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:K=_K=", "Vijaynarayanan Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Vijaynarayanan"], "conf": "infocom", "year": "2008", "pages": 5}