{"title": "Power Awareness in Network Design and Routing.", "fields": ["router", "systems design", "network planning and design", "routing protocol", "communications protocol"], "abstract": "Exponential bandwidth scaling has been a fundamental driver of the growth and popularity of the Internet. However, increases in bandwidth have been accompanied by increases in power consumption, and despite sustained system design efforts to address power demand, significant technological challenges remain that threaten to slow future bandwidth growth. In this paper we describe the power and associated heat management challenges in today's routers. We advocate a broad approach to addressing this problem that includes making power-awareness a primary objective in the design and configuration of networks, and in the design and implementation of network protocols. We support our arguments by providing a case study of power demands of two standard router platforms that enables us to create a generic model for router power consumption. We apply this model in a set of target network configurations and use mixed integer optimization techniques to investigate power consumption, performance and robustness in static network design and in dynamic routing. Our results indicate the potential for significant power savings in operational networks by including power-awareness.", "citation": "Citations (828)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Joseph Chabarek.....http://dblp.org/pers/hd/c/Chabarek:Joseph", "Joel Sommers.....http://dblp.org/pers/hd/s/Sommers:Joel", "Paul Barford.....http://dblp.org/pers/hd/b/Barford:Paul", "Cristian Estan.....http://dblp.org/pers/hd/e/Estan:Cristian", "David Tsiang.....http://dblp.org/pers/hd/t/Tsiang:David", "Stephen J. Wright.....http://dblp.org/pers/hd/w/Wright:Stephen_J="], "conf": "infocom", "year": "2008", "pages": 9}