{"title": "Bandwidth-Aware Routing in Overlay Networks.", "fields": ["overlay", "bandwidth allocation", "ip forwarding", "overlay network", "key based routing"], "abstract": "In the absence of end-to-end quality of service (QoS), overlay routing has been used as an alternative to the default best effort Internet routing. Using end-to-end network measurement, the problematic parts of the path can be bypassed, resulting in improving the resiliency and robustness to failures. Studies have shown that overlay paths can give better latency, loss rate, and TCP throughput. Overlay routing also offers flexibility as different routes can be used based on application needs. There have been very few proposals of using bandwidth as the main metric of interest, which is of great concern in media applications. We introduce our scheme BARON (Bandwidth-Aware Routing in Overlay Networks) that utilizes capacity between the end hosts to identify viable overlay paths and measures available bandwidth to select the best route. We propose our path selection approaches, and using the measurements between 174 PlanetLab nodes and over 13,189 paths, we evaluate the usefulness of overlay routes in terms of bandwidth gain. Our results show that among 658,526 overlay paths, 25% have larger bandwidth than their native IP routes, and over 86% of (source, destination) pairs have at least one overlay route with larger bandwidth than the default IP routes. We also present the effectiveness of BARON in preserving the bandwidth requirement over time for a few selected Internet paths.", "citation": "Citations (64)", "departments": ["Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Sung-Ju Lee.....http://dblp.org/pers/hd/l/Lee:Sung=Ju", "Sujata Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Sujata", "Puneet Sharma.....http://dblp.org/pers/hd/s/Sharma:Puneet", "Praveen Yalagandula.....http://dblp.org/pers/hd/y/Yalagandula:Praveen", "Sujoy Basu.....http://dblp.org/pers/hd/b/Basu:Sujoy"], "conf": "infocom", "year": "2008", "pages": 9}