{"title": "Flat refractive geometry.", "fields": ["lens", "focal length", "caustic", "camera resectioning", "refraction", "nonlinear distortion", "parameterized complexity"], "abstract": "While the study of geometry has mainly concentrated on single viewpoint (SVP) cameras, there is growing attention to more general non-SVP systems. Here, we study an important class of systems that inherently have a non-SVP: a perspective camera imaging through an interface into a medium. Such systems are ubiquitous: They are common when looking into water-based environments. The paper analyzes the common flat-interface class of systems. It characterizes the locus of the viewpoints (caustic) of this class and proves that the SVP model is invalid in it. This may explain geometrical errors encountered in prior studies. Our physics-based model is parameterized by the distance of the lens from the medium interface, besides the focal length. The physical parameters are calibrated by a simple approach that can be based on a single frame. This directly determines the system geometry. The calibration is then used to compensate for modeled system distortion. Based on this model, geometrical measurements of objects are significantly more accurate than if based on an SVP model. This is demonstrated in real-world experiments. In addition, we examine by simulation the errors expected by using the SVP model. We show that when working at a constant range, the SVP model can be a good approximation.", "citation": "Citations (151)", "year": "2008", "departments": ["University of California, San Diego", "Technion – Israel Institute of Technology", "Woods Hole Oceanographic Institution", "Woods Hole Oceanographic Institution", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Woods Hole Oceanographic Institution"], "conf": "cvpr", "authors": ["Tali Treibitz.....http://dblp.org/pers/hd/t/Treibitz:Tali", "Yoav Y. Schechner.....http://dblp.org/pers/hd/s/Schechner:Yoav_Y=", "Hanumant Singh.....http://dblp.org/pers/hd/s/Singh:Hanumant"], "pages": -1}