{"title": "Supporting OLAP operations over imperfectly integrated taxonomies.", "fields": ["domain knowledge", "analytics", "online analytical processing", "preprocessor", "tree structure"], "abstract": "OLAP is an important tool in decision support. With the help of domain knowledge, such as hierarchies of attribute values, OLAP helps the user observe the effects of various decisions. One assumption of most OLAP operations is that the available domain knowledge is precise. In particular, they assume that the hierarchy of values over which the user can navigate forms a taxonomy. In this paper, we first note that when multiple heterogeneous data sources are involved in the gathering of the data and the associated domain knowledge, the integrated knowledge-base, constructed by combining locally available taxonomies based on the concept matchings, may not be a taxonomy itself. Specifically, existence of intersections among concepts from different sources compromises the tree-structure of the integrated taxonomy and prevents effective use of hierarchical navigation techniques, such as drill-down and roll-up. To cope with this, we introduce  concept un-classification , where a select few of the concepts are eliminated to ensure that the remaining structure is a navigable taxonomy, without concept intersections. Since un-classifying an originally classified data is not desirable, we consider ways to minimize un-classification in the process. We introduce a cost model which captures the imprecision caused by the un-classification process and we formulate the problem of finding an un-classification strategy which eliminates intersections and which adds minimal imprecision to the resulting structure. We show that, when performed naively, this task can be very costly and thus we propose a bottom-up preprocessing strategy which supports basic navigational analytics operations, such as drill-down and roll-up. Experiments over synthetic and real-life data verified the effectiveness and efficiency of our approach.", "citation": "Citations (16)", "year": "2008", "departments": ["Arizona State University", "Arizona State University", "University of California, Santa Barbara", "NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA"], "conf": "sigmod", "authors": ["Yan Qi.....http://dblp.org/pers/hd/q/Qi_0002:Yan", "K. Selçuk Candan.....http://dblp.org/pers/hd/c/Candan:K=_Sel=ccedil=uk", "Jun'ichi Tatemura.....http://dblp.org/pers/hd/t/Tatemura:Jun=ichi", "Songting Chen.....http://dblp.org/pers/hd/c/Chen:Songting", "Fenglin Liao.....http://dblp.org/pers/hd/l/Liao:Fenglin"], "pages": 14}