{"title": "On Signatures for Communication Graphs.", "fields": ["telecommunications network", "enterprise private network", "application software", "persistence", "digital signature"], "abstract": "Communications between individuals can be represented by (weighted, multi-) graphs. Many applications operate on communication graphs associated with telephone calls, emails, instant messages (IM), blogs, web forums, e-business relationships and so on. These applications include identifying repetitive fraudsters, message board aliases, multiusage of IP addresses, etc. Tracking electronic identities in communication networks can be achieved if we have a reliable \"signature\" for nodes and activities. While many examples of ad hoc signatures can be proposed for particular tasks, what is needed is a systematic study of the principles behind the usage of signatures for any task. We develop a formal framework for the use of signatures in communication graphs and identify three fundamental properties that are natural to signature schemes: persistence, uniqueness and robustness. We argue for the importance of these properties by showing how they impact a set of applications. We then explore several signature schemes - previously defined and new - in our framework and evaluate them on real data in terms of these properties. This provides insights into suitable signature schemes for desired applications. Finally, as case studies, we focus on two concrete applications in enterprise network traffic. We apply signature schemes to these problems and demonstrate their effectiveness.", "citation": "Citations (8)", "departments": ["AT&T Labs", "AT&T Labs", "Rutgers University", "Rutgers University"], "authors": ["Graham Cormode.....http://dblp.org/pers/hd/c/Cormode:Graham", "Flip Korn.....http://dblp.org/pers/hd/k/Korn:Flip", "S. Muthukrishnan.....http://dblp.org/pers/hd/m/Muthukrishnan:S=", "Yihua Wu.....http://dblp.org/pers/hd/w/Wu:Yihua"], "conf": "icde", "year": "2008", "pages": 10}