{"title": "Paths to stardom: calibrating the potential of a peer-based data management system.", "fields": ["search engine indexing", "completeness", "range query", "cayley graph", "peer to peer"], "abstract": "As peer-to-peer (P2P) networks become more familiar to the database community, intense interest has built up in using their scalability and resilience properties to scale database applications. Indexing methods are adapted on top of P2P networks and querying methods are developed to handle the data distribution on different nodes. These procedures largely depend on how nodes are connected to each other. So far, limited attempts have been made to compare all these systems in a generalized framework. This is because the systems are quite different from each other, and there are so many of them that brute force comparison is practically impossible. Fortunately, it has recently been observed that a large subset of the most important P2P networks share a common algebraic and combinatorial base, in the form of Cayley graphs.   The specific requirements of Peer-based Data Management Systems (PDMS), such as query completeness, range queries, load balancing, communication overhead, and scalability are strongly related to the properties of the underlying graphs, and naturally, some graphs are better than others. We conduct a comprehensive graph-theoretic analysis from the point of view of PDMS and identify the necessary conditions for a graph to be considered a potential network structure for a PDMS. In so doing, we provide a basis for the future development of such networks. We complement our analytical study with extensive experimental results and identify three measures that provide significant information about the potential of a [Cayley] graph to support the requirements of a PDMS.", "citation": "Citations (14)", "year": "2008", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "conf": "sigmod", "authors": ["Mihai Lupu.....http://dblp.org/pers/hd/l/Lupu:Mihai", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Y. C. Tay.....http://dblp.org/pers/hd/t/Tay:Y=_C="], "pages": 14}