{"title": "Atomic Vector Operations on Chip Multiprocessors.", "fields": ["software performance testing", "exploit", "multithreading", "sparse matrix", "simd"], "abstract": "The current trend is for processors to deliver dramatic improvements in parallel performance while only modestly improving serial performance. Parallel performance is harvested through vector/SIMD instructions as well as multithreading (through both multithreaded cores and chip multiprocessors). Vector parallelism can be more efficiently supported than multithreading, but is often harder for software to exploit. In particular, code with sparse data access patterns cannot easily utilize the vector/SIMD instructions of mainstream processors. Hardware to scatter and gather sparse data has previously been proposed to enable vector execution for these codes. However, on multithreaded architectures, a number of applications spend significant time on atomic operations (e.g., parallel reductions), which cannot be vectorized using previously proposed schemes. This paper proposes architectural support for atomic vector operations (referred to as GLSC) that addresses this limitation. GLSC extends scatter-gather hardware to support atomic memory operations. Our experiments show that the GLSC provides an average performance improvement on a set of important RMS kernels of 54% for 4-wide SIMD.", "citation": "Citations (33)", "departments": ["Intel", "Intel", "Intel", "Intel", "Intel"], "authors": ["Sanjeev Kumar.....http://dblp.org/pers/hd/k/Kumar:Sanjeev", "Daehyun Kim.....http://dblp.org/pers/hd/k/Kim:Daehyun", "Mikhail Smelyanskiy.....http://dblp.org/pers/hd/s/Smelyanskiy:Mikhail", "Yen-Kuang Chen.....http://dblp.org/pers/hd/c/Chen:Yen=Kuang", "Jatin Chhugani.....http://dblp.org/pers/hd/c/Chhugani:Jatin", "Christopher J. Hughes.....http://dblp.org/pers/hd/h/Hughes:Christopher_J=", "Changkyu Kim.....http://dblp.org/pers/hd/k/Kim:Changkyu", "Victor W. Lee.....http://dblp.org/pers/hd/l/Lee:Victor_W=", "Anthony D. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Anthony_D="], "conf": "isca", "year": "2008", "pages": 12}