{"title": "Spatial Outsourcing for Location-based Services.", "fields": ["performance metric", "location based service", "application software", "data management", "outsourcing"], "abstract": "The embedding of positioning capabilities in mobile devices and the emergence of location-based applications have created novel opportunities for utilizing several types of multidimensional data through spatial outsourcing. In this setting, a data owner (DO) delegates its data management tasks to a location-based service (LBS) that processes queries originating from several clients/subscribers. Because the LBS is not the real owner of the data, it must prove (to each client) the correctness of query output using an authenticated structure signed by the DO. Currently there is very narrow selection of multidimensional authenticated structures, among which the VR-tree is the best choice. Our first contribution is the MR-tree, a novel index suitable for spatial outsourcing. We show, analytically and experimentally, that the MR-tree outperforms the VR-tree, usually by orders of magnitude, on all performance metrics, including construction cost, index size, query and verification overhead. Motivated by the fact that successive queries by the same mobile client exhibit locality, we also propose a synchronized caching technique that utilizes the results of previous queries to reduce the size of the additional information sent to the client for verification purposes.", "citation": "Citations (98)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Boston University"], "authors": ["Yin Yang.....http://dblp.org/pers/hd/y/Yang:Yin", "Stavros Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos_0001:Stavros", "Dimitris Papadias.....http://dblp.org/pers/hd/p/Papadias:Dimitris", "George Kollios.....http://dblp.org/pers/hd/k/Kollios:George"], "conf": "icde", "year": "2008", "pages": 10}