{"title": "Improving Efficiency of Backup Reprovisioning in WDM Networks.", "fields": ["service level agreement", "mesh networking", "service provider", "backup", "service level"], "abstract": "Protection techniques for optical networks mainly rely on pre-allocated backup bandwidth, which may not be able to provide full protection guarantee when multiple failures occur in a network. To protect against multiple concurrent potential failures and to utilize the available resources more efficiently, strategies such as backup reprovisioning rearrange backups of protected connections after one failure occurs or, more generally, whenever the network state changes, e.g., when a new request arrives or terminates. Recently, new solutions for automatized management in Optical networks promise to allow customers to specify on-demand the terms of the service level agreement (SLA) to be guaranteed by the service provider. In this paper we show that is possible to further reduce the capacity requirements of backup reprovisioning techniques exploiting the knowledge, among the other service level specifications (SLS), of the connection holding-time. Our main contributions are as follows. First, we prove that the problem of backup reprovisioning for all the lightpaths requiring shared-path protection under a current network state is NP-complete. Second, we provide a mathematical ILP model of the reprovisioning problem considering the additional holding-time information. Third, since the problem is NP-complete and we can not efficiently rely on exact approaches, a new global reprovisioning algorithm called Ph-GBR is proposed which can significantly reduce the resource overbuild exploiting the information about connection durations. By means of simulative experiments, we compare capacity requirement and computational complexity of Ph-GBR to those of another holding-time unaware, yet efficient algorithm, called GBR, considering a dynamic traffic in a wavelength-convertible WDM mesh network scenario.", "citation": "Citations (18)", "departments": ["Politec. di Milano, Milan", "Politec. di Milano, Milan", "Politec. di Milano, Milan"], "authors": ["Massimo Tornatore.....http://dblp.org/pers/hd/t/Tornatore:Massimo", "Diego Lucerna.....http://dblp.org/pers/hd/l/Lucerna:Diego", "Achille Pattavina.....http://dblp.org/pers/hd/p/Pattavina:Achille"], "conf": "infocom", "year": "2008", "pages": 5}