{"title": "Performance and power optimization through data compression in Network-on-Chip architectures.", "fields": ["network packet", "multi core processor", "cache", "power optimization", "network on a chip"], "abstract": "The trend towards integrating multiple cores on the same die has accentuated the need for larger on-chip caches. Such large caches are constructed as a multitude of smaller cache banks interconnected through a packet-based network-on-chip (NoC) communication fabric. Thus, the NoC plays a critical role in optimizing the performance and power consumption of such non-uniform cache-based multicore architectures. While almost all prior NoC studies have focused on the design of router microarchitectures for achieving this goal, in this paper, we explore the role of data compression on NoC performance and energy behavior. In this context, we examine two different configurations that explore combinations of storage and communication compression: (1) Cache compression (CC) and (2) Compression in the NIC (NC). We also address techniques to hide the decompression latency by overlapping with NoC communication latency. Our simulation results with a diverse set of scientific and commercial benchmark traces reveal that CC can provide up to 33% reduction in network latency and up to 23% power savings. Even in the case of NC - where the data is compressed only when passing through the NoC fabric of the NUCA architecture and stored uncompressed - performance and power savings of up to 32% and 21%, respectively, can be obtained. These performance benefits in the interconnect translate up to 17% reduction in CPI. These benefits are orthogonal to any router architecture and make a strong case for utilizing compression for optimizing the performance and power envelope of NoC architectures. In addition, the study demonstrates the criticality of designing faster routers in shaping the performance behavior.", "citation": "Citations (88)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Reetuparna Das.....http://dblp.org/pers/hd/d/Das:Reetuparna", "Asit K. Mishra.....http://dblp.org/pers/hd/m/Mishra:Asit_K=", "Chrysostomos Nicopoulos.....http://dblp.org/pers/hd/n/Nicopoulos:Chrysostomos", "Dongkook Park.....http://dblp.org/pers/hd/p/Park:Dongkook", "Vijaykrishnan Narayanan.....http://dblp.org/pers/hd/n/Narayanan:Vijaykrishnan", "Ravishankar R. Iyer.....http://dblp.org/pers/hd/i/Iyer:Ravishankar_R=", "Mazin S. Yousif.....http://dblp.org/pers/hd/y/Yousif:Mazin_S=", "Chita R. Das.....http://dblp.org/pers/hd/d/Das:Chita_R="], "conf": "hpca", "year": "2008", "pages": 11}