{"title": "Evolving software product lines with aspects: an empirical study on design stability.", "fields": ["software architecture", "modular design", "aspect oriented programming", "software product line", "software maintenance"], "abstract": "Software product lines (SPLs) enable modular, large-scale reuse through a software architecture addressing multiple core and varying features. To reap the benefits of SPLs, their designs need to be stable. Design stability encompasses the sustenance of the product line's modularity properties in the presence of changes to both the core and varying features. It is usually assumed that aspect-oriented programming promotes better modularity and changeability of product lines than conventional variability mechanisms, such as conditional compilation. However, there is no empirical evidence on its efficacy to prolong design stability of SPLs through realistic development scenarios. This paper reports a quantitative study that evolves two SPLs to assess various design stability facets of their aspect-oriented implementations. Our investigation focused upon a multi-perspective analysis of the evolving product lines in terms of modularity, change propagation, and feature dependency. We have identified a number of scenarios which positively or negatively affect the architecture stability of aspectual SPLs.", "citation": "Citations (437)", "departments": ["Lancaster University", "Lancaster University", "Pontifical Catholic University of Rio de Janeiro", "Universidade Nova de Lisboa", "Computer Scienc ... versity, Brazil"], "authors": ["Eduardo Figueiredo.....http://dblp.org/pers/hd/f/Figueiredo:Eduardo", "Nélio Cacho.....http://dblp.org/pers/hd/c/Cacho:N=eacute=lio", "Cláudio Sant'Anna.....http://dblp.org/pers/hd/s/Sant=Anna:Cl=aacute=udio", "Mario Monteiro.....http://dblp.org/pers/hd/m/Monteiro:Mario", "Uirá Kulesza.....http://dblp.org/pers/hd/k/Kulesza:Uir=aacute=", "Alessandro Garcia.....http://dblp.org/pers/hd/g/Garcia:Alessandro", "Sérgio Soares.....http://dblp.org/pers/hd/s/Soares:S=eacute=rgio", "Fabiano Cutigi Ferrari.....http://dblp.org/pers/hd/f/Ferrari:Fabiano_Cutigi", "Safoora Shakil Khan.....http://dblp.org/pers/hd/k/Khan:Safoora_Shakil", "Fernando Castor Filho.....http://dblp.org/pers/hd/f/Filho:Fernando_Castor", "Francisco Dantas.....http://dblp.org/pers/hd/d/Dantas:Francisco"], "conf": "icse", "year": "2008", "pages": 10}