{"title": "Can chinese web pages be classified with english data source?", "fields": ["web query classification", "data web", "web modeling", "static web page", "web mapping"], "abstract": "As the World Wide Web in China grows rapidly, mining knowledge in Chinese Web pages becomes more and more important. Mining Web information usually relies on the machine learning techniques which require a large amount of labeled data to train credible models. Although the number of Chinese Web pages increases quite fast, it still lacks Chinese labeled data. However, there are relatively sufficient English labeled Web pages. These labeled data, though in different linguistic representations, share a substantial amount of semantic information with Chinese ones, and can be utilized to help classify Chinese Web pages. In this paper, we propose an information bottleneck based approach to address this cross-language classification problem. Our algorithm first translates all the Chinese Web pages to English. Then, all the Web pages, including Chinese and English ones, are encoded through an information bottleneck which can allow only limited information to pass. Therefore, in order to retain as much useful information as possible, the common part between Chinese and English Web pages is inclined to be encoded to the same code (i.e. class label), which makes the cross-language classification accurate. We evaluated our approach using the Web pages collected from Open Directory Project (ODP). The experimental results show that our method significantly improves several existing supervised and semi-supervised classifiers.", "citation": "Citations (105)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Hong Kong University of Science and Technology"], "authors": ["Xiao Ling.....http://dblp.org/pers/hd/l/Ling:Xiao", "Gui-Rong Xue.....http://dblp.org/pers/hd/x/Xue:Gui=Rong", "Wenyuan Dai.....http://dblp.org/pers/hd/d/Dai:Wenyuan", "Yun Jiang.....http://dblp.org/pers/hd/j/Jiang:Yun", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang", "Yong Yu.....http://dblp.org/pers/hd/y/Yu:Yong"], "conf": "www", "year": "2008", "pages": 10}