{"title": "The Inframetric Model for the Internet.", "fields": ["logarithm", "multiplicative function", "round trip delay time", "triangle inequality", "bounded function"], "abstract": "A large amount of algorithms has recently been designed for the Internet under the assumption that the distance defined by the round-trip delay (RTT) is a metric. Moreover, many of these algorithms (e.g., overlay network construction, routing scheme design, sparse spanner construction) rely on the assumption that the metric has bounded ball growth or bounded doubling dimension. This paper analyzes the validity of these assumptions and proposes a tractable model matching experimental observations. On the one hand, based on Skitter data collected by CAIDA and King matrices of Meridian and P2PSim projects, we verify that the ball growth of the Internet, as well as its doubling dimension, can actually be quite large. Nevertheless, we observed that the doubling dimension is much smaller when restricting the measures to balls of large enough radius. Moreover, by computing the number of balls of radius r required to cover balls of radius R > r, we observed that this number grows with R much slower than what is predicted by a large doubling dimension. On the other hand, based on data collected on the PlanetLab platform by the All-Sites-Pings project, we confirm that the triangle inequality does not hold for a significant fraction of the nodes. Nevertheless, we demonstrate that RTT measures satisfy a weak version of the triangle inequality: there exists a small constant p such that for any triple u, v, w, we have RTT(u,v) les rho-max{RTT(u,w),RTT(w,v)}. (Smaller bounds on p can even be obtained when the triple u, v, w is skewed). We call inframetric a distance function satisfying this latter inequality. Inframetrics subsume standard metrics and ultrametrics. Based on inframetrics and on our observations concerning the doubling dimension, we propose an analytical model for Internet RTT latencies. This model is tuned by a small set of parameters concerning the violation of the triangle inequality and the geometrical dimension of the network. We demonstrate the tractability of our model by designing a simple and efficient compact routing scheme with low stretch. Precisely, the scheme has constant multiplicative stretch and logarithmic additive stretch.", "citation": "Citations (31)", "departments": ["Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique"], "authors": ["Pierre Fraigniaud.....http://dblp.org/pers/hd/f/Fraigniaud:Pierre", "Emmanuelle Lebhar.....http://dblp.org/pers/hd/l/Lebhar:Emmanuelle", "Laurent Viennot.....http://dblp.org/pers/hd/v/Viennot:Laurent"], "conf": "infocom", "year": "2008", "pages": 9}