{"title": "Capacity constrained assignment in spatial databases.", "fields": ["graph", "euclidean geometry", "bipartite graph", "euclidean distance", "spatial database"], "abstract": "Given a point set  P  of customers (e.g., WiFi receivers) and a point set  Q  of service providers (e.g., wireless access points), where each  q  ∈  Q  has a capacity  q.k , the  capacity constrained assignment  (CCA) is a matching  M  ⊆  Q  ×  P  such that (i) each point  q  ∈  Q  ( p  ∈  P ) appears at most  k  times (at most once) in  M , (ii) the size of  M  is maximized (i.e., it comprises min{| P |, ∑  q ∈ Q    q . k  } pairs), and (iii) the total assignment cost (i.e., the sum of Euclidean distances within all pairs) is minimized. Thus, the CCA problem is to identify the assignment with the optimal overall quality; intuitively, the quality of  q 's service to  p  in a given ( q ,  p ) pair is anti-proportional to their distance. Although max-flow algorithms are applicable to this problem, they require the complete distance-based bipartite graph between  Q  and  P . For large spatial datasets, this graph is expensive to compute and it may be too large to fit in main memory. Motivated by this fact, we propose efficient algorithms for  optimal assignment  that employ novel edge-pruning strategies, based on the spatial properties of the problem. Additionally, we develop  approximate  (i.e., suboptimal) CCA solutions that provide a trade-off between result accuracy and computation cost, abiding by theoretical quality guarantees. A thorough experimental evaluation demonstrates the efficiency and practicality of the proposed techniques.", "citation": "Citations (52)", "year": "2008", "departments": ["University of Hong Kong", "Aalborg University", "Singapore Management University", "University of Hong Kong"], "conf": "sigmod", "authors": ["Leong Hou U.....http://dblp.org/pers/hd/u/U:Leong_Hou", "Man Lung Yiu.....http://dblp.org/pers/hd/y/Yiu:Man_Lung", "Kyriakos Mouratidis.....http://dblp.org/pers/hd/m/Mouratidis:Kyriakos", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos"], "pages": 14}