{"title": "PaCo: Probability-based path confidence prediction.", "fields": ["benchmark", "multithreading", "prioritization", "fetch", "root mean square deviation"], "abstract": "A path confidence estimate indicates the likelihood that the processor is currently fetching correct path instructions. Accurate path confidence prediction is critical for applications like pipeline gating and confidence-based SMT fetch prioritization. Previous work in this domain uses a threshold-and-count predictor, where the number of unresolved, low-confidence branches serves as an estimate of path confidence. This approach is inaccurate since it implicitly assumes that all low-confidence branches have the same mispredict rate, and that high-confidence branches never mispredict. We propose an alternative path confidence predictor designed from first principles, called PaCo, that directly estimates the probability that the processor is on the goodpath, and considers contributions from all branches, both high and low confidence. Even though it uses only modest hardware, PaCo can estimate the processorpsilas goodpath likelihood with very high accuracy, with an RMS error of 3.8%. We show that PaCo significantly outperforms threshold-and-count predictors in pipeline gating and SMT fetch prioritization. In pipeline gating, while the best conventional predictor can reduce badpath instructions executed by 7% with a small loss in performance, PaCo can reduce bad-path instructions by 32% without any performance loss. In SMT fetch prioritization, using PaCo instead of conventional path confidence predictors improves performance by up to 23%, and 5.5% on average.", "citation": "Citations (7)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Kshitiz Malik.....http://dblp.org/pers/hd/m/Malik:Kshitiz", "Mayank Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Mayank", "Vikram Dhar.....http://dblp.org/pers/hd/d/Dhar:Vikram", "Matthew I. Frank.....http://dblp.org/pers/hd/f/Frank:Matthew_I="], "conf": "hpca", "year": "2008", "pages": 12}