{"title": "Fast and robust numerical solutions to minimal problems for cameras with radial distortion.", "fields": ["floating point", "fundamental matrix", "point estimation", "distortion", "structure from motion", "eigendecomposition of a matrix", "essential matrix"], "abstract": "A number of minimal problems of structure from motion for cameras with radial distortion have recently been studied and solved in some cases. These problems are known to be numerically very challenging and in several cases there were no practical algorithms yielding solutions in floating point arithmetic. We make some crucial observations concerning the floating point implementation of Grobner basis computations and use these new insights to formulate fast and stable algorithms for two minimal problems with radial distortion previously solved in exact rational arithmetic only: (i) simultaneous estimation of essential matrix and a common radial distortion parameter for two partially calibrated views and six image point correspondences and (ii) estimation of fundamental matrix and two different radial distortion parameters for two uncalibrated views and nine image point correspondences. We demonstrate that these two problems can be efficiently solved in floating point arithmetic in simulated and real experiments. For comparison we have also invented a new non-minimal algorithm for estimating fundamental matrix and two different radial distortion parameters for two uncalibrated views and twelve image point correspondences based on a generalized eigenvalue problem.", "citation": "Citations (45)", "year": "2008", "departments": ["Czech Technical University in Prague", "Lund University", "Lund University", "Czech Technical University in Prague", "Lund University", "Lund University", "Czech Technical University in Prague", "Lund University", "Czech Technical University in Prague", "Lund University"], "conf": "cvpr", "authors": ["Martin Byröd.....http://dblp.org/pers/hd/b/Byr=ouml=d:Martin", "Zuzana Kukelova.....http://dblp.org/pers/hd/k/Kukelova:Zuzana", "Klas Josephson.....http://dblp.org/pers/hd/j/Josephson:Klas", "Tomás Pajdla.....http://dblp.org/pers/hd/p/Pajdla:Tom=aacute=s", "Kalle Åström.....http://dblp.org/pers/hd/=/=Aring=str=ouml=m:Kalle"], "pages": -1}