{"title": "The Spicy system: towards a notion of mapping quality.", "fields": ["scalability", "architecture", "schema matching", "multitier architecture", "schema"], "abstract": "We introduce the Spicy system, a novel approach to the problem of automatically selecting the best mappings among two data sources. Known schema mapping algorithms rely on value correspondences -- i.e. correspondences among semantically related attributes -- to produce complex transformations among data sources. Spicy brings together schema matching and mapping generation tools to further automate this process. A key observation, here, is that the quality of the mappings is strongly influenced by the quality of the input correspondences. To address this problem, Spicy adopts a three-layer architecture, in which a schema matching module is used to provide input to a mapping generation module. Then, a third module, the mapping verification module, is used to check candidate mappings and choose the ones that represent better transformations of the source into the target. At the core of the system stands a new technique for comparing the structure and actual content of trees, called structural analysis. Experimental results show that our mapping discovery algorithm achieves both good scalability and high precision in mapping selection.", "citation": "Citations (11)", "year": "2008", "departments": ["Indian Council of Agricultural Research", "Università dell ...  Potenza, Italy", "Università dell ...  Potenza, Italy", "Università dell ...  Potenza, Italy", "Università dell ...  Potenza, Italy"], "conf": "sigmod", "authors": ["Angela Bonifati.....http://dblp.org/pers/hd/b/Bonifati:Angela", "Giansalvatore Mecca.....http://dblp.org/pers/hd/m/Mecca:Giansalvatore", "Alessandro Pappalardo.....http://dblp.org/pers/hd/p/Pappalardo:Alessandro", "Salvatore Raunich.....http://dblp.org/pers/hd/r/Raunich:Salvatore", "Gianvito Summa.....http://dblp.org/pers/hd/s/Summa:Gianvito"], "pages": 6}