{"title": "Capacity of Arbitrary Wireless Networks.", "fields": ["job shop scheduling", "approximation algorithm", "approximation theory", "euclidean space", "power control"], "abstract": "In this work we study the problem of determining the throughput capacity of a wireless network. We propose a scheduling algorithm to achieve this capacity within an approximation factor. Our analysis is performed in the physical interference model, where nodes are arbitrarily distributed in Euclidean space. We consider the problem separately from the routing problem and the power control problem, i.e., all requests are single-hop, and all nodes transmit at a fixed power level. The existing solutions to this problem have either concentrated on special-case topologies, or presented optimality guarantees which become arbitrarily bad (linear in the number of nodes) depending on the network's topology. We propose the first scheduling algorithm with approximation guarantee independent of the topology of the network. The algorithm has a constant approximation guarantee for the problem of maximizing the number of links scheduled in one time-slot. Furthermore, we obtain a O(log n) approximation for the problem of minimizing the number of time slots needed to schedule a given set of requests. Simulation results indicate that our algorithm does not only have an exponentially better approximation ratio in theory, but also achieves superior performance in various practical network scenarios. Furthermore, we prove that the analysis of the algorithm is extendable to higher-dimensional Euclidean spaces, and to more realistic bounded-distortion spaces, induced by non-isotropic signal distortions. Finally, we show that it is NP-hard to approximate the scheduling problem to within n 1-epsiv  factor, for any constant epsiv > 0, in the non-geometric SINR model, in which path-loss is independent of the Euclidean coordinates of the nodes.", "citation": "Citations (262)", "departments": ["ETH Zurich", "ETH Zurich", "University of Iceland", "ETH Zurich"], "authors": ["Olga Goussevskaia.....http://dblp.org/pers/hd/g/Goussevskaia:Olga", "Roger Wattenhofer.....http://dblp.org/pers/hd/w/Wattenhofer:Roger", "Magnús M. Halldórsson.....http://dblp.org/pers/hd/h/Halld=oacute=rsson:Magn=uacute=s_M=", "Emo Welzl.....http://dblp.org/pers/hd/w/Welzl:Emo"], "conf": "infocom", "year": "2009", "pages": 9}