{"title": "Eye Tracking for Avatar Eye Gaze Control During Object-Focused Multiparty Interaction in Immersive Collaborative Virtual Environments.", "fields": ["immersion", "saccade", "gaze", "collaborative virtual environment", "user experience design"], "abstract": "In face-to-face collaboration, eye gaze is used both as a bidirectional signal to monitor and indicate focus of attention and action, as well as a resource to manage the interaction. In remote interaction supported by Immersive Collaborative Virtual Environments (ICVEs), embodied avatars representing and controlled by each participant share a virtual space. We report on a study designed to evaluate methods of avatar eye gaze control during an object-focused puzzle scenario performed between three networked CAVE TM -like systems. We compare tracked gaze, in which avatars' eyes are controlled by head-mounted mobile eye trackers worn by participants, to a gaze model informed by head orientation for saccade generation, and static gaze featuring non-moving eyes. We analyse task performance, subjective user experience, and interactional behaviour. While not providing statistically significant benefit over static gaze, tracked gaze is observed as the highest performing condition. However, the gaze model resulted in significantly lower task performance and increased error rate.", "citation": "Citations (26)", "departments": ["University College London", "University College London", "University of Reading", "University of Salford", "University of Roehampton"], "authors": ["William Steptoe.....http://dblp.org/pers/hd/s/Steptoe:William", "Oyewole Oyekoya.....http://dblp.org/pers/hd/o/Oyekoya:Oyewole", "Alessio Murgia.....http://dblp.org/pers/hd/m/Murgia:Alessio", "Robin Wolff.....http://dblp.org/pers/hd/w/Wolff:Robin", "John Rae.....http://dblp.org/pers/hd/r/Rae:John", "Estefania Guimaraes.....http://dblp.org/pers/hd/g/Guimaraes:Estefania", "David J. Roberts.....http://dblp.org/pers/hd/r/Roberts:David_J=", "Anthony Steed.....http://dblp.org/pers/hd/s/Steed:Anthony"], "conf": "vr", "year": "2009", "pages": 8}