{"title": "Optimizing complex extraction programs over evolving text data.", "fields": ["text corpus", "scratch", "data set", "snapshot", "speedup"], "abstract": "Most information extraction (IE) approaches have considered only static text corpora, over which we apply IE only once. Many real-world text corpora however are dynamic. They evolve over time, and so to keep extracted information up to date we often must apply IE repeatedly, to consecutive corpus snapshots. Applying IE  from scratch  to each snapshot can take a lot of time. To avoid doing this, we have recently developed Cyclex, a system that recycles previous IE results to speed up IE over subsequent corpus snapshots. Cyclex clearly demonstrated the promise of the recycling idea. The work itself however is limited in that it considers only IE programs that contain  a single IE ``blackbox.''  In practice, many IE programs are far more complex, containing  multiple IE blackboxes  connected in a compositional ``workflow.''   In this paper, we present Delex, a system that removes the above limitation. First we identify many difficult challenges raised by Delex, including modeling complex IE programs for recycling purposes, implementing the recycling process efficiently, and searching for an optimal execution plan in a vast plan space with different recycling alternatives. Next we describe our solutions to these challenges. Finally, we describe extensive experiments with both rule-based and learning-based IE programs over two real-world data sets, which demonstrate the utility of our approach.", "citation": "Citations (9)", "year": "2009", "departments": ["University of Wisconsin-Madison", "Texas State University", "University of Wisconsin-Madison", "Duke University", "Yahoo!"], "conf": "sigmod", "authors": ["Fei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Fei", "Byron J. Gao.....http://dblp.org/pers/hd/g/Gao:Byron_J=", "AnHai Doan.....http://dblp.org/pers/hd/d/Doan:AnHai", "Jun Yang.....http://dblp.org/pers/hd/y/Yang_0001:Jun", "Raghu Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Raghu"], "pages": 14}