{"title": "Discriminative Network Models of Schizophrenia.", "fields": ["naive bayes classifier", "brain activity and meditation", "markov random field", "discriminative model", "gaussian"], "abstract": "Schizophrenia is a complex psychiatric disorder that has eluded a characterization in terms of local abnormalities of brain activity, and is hypothesized to affect the collective, \"emergent\" working of the brain. We propose a novel data-driven approach to capture emergent features using functional brain networks [4] extracted from fMRI data, and demonstrate its advantage over traditional region-of-interest (ROI) and local, task-specific linear activation analyzes. Our results suggest that schizophrenia is indeed associated with disruption of global brain properties related to its functioning as a network, which cannot be explained by alteration of local activation patterns. Moreover, further exploitation of interactions by sparse Markov Random Field classifiers shows clear gain over linear methods, such as Gaussian Naive Bayes and SVM, allowing to reach 86% accuracy (over 50% baseline - random guess), which is quite remarkable given that it is based on a single fMRI experiment using a simple auditory task.", "citation": "Citations (24)", "year": "2009", "departments": ["IBM", "French Institute for Research in Computer Science and Automation", "French Institute of Health and Medical Research", "Paris Descartes University", "Neurospin, CEA, ... Saclay, France"], "conf": "nips", "authors": ["Guillermo A. Cecchi.....http://dblp.org/pers/hd/c/Cecchi:Guillermo_A=", "Irina Rish.....http://dblp.org/pers/hd/r/Rish:Irina", "Benjamin Thyreau.....http://dblp.org/pers/hd/t/Thyreau:Benjamin", "Bertrand Thirion.....http://dblp.org/pers/hd/t/Thirion:Bertrand", "Marion Plaze.....http://dblp.org/pers/hd/p/Plaze:Marion", "Marie-Laure Paillère-Martinot.....http://dblp.org/pers/hd/p/Paill=egrave=re=Martinot:Marie=Laure", "Catherine Martelli.....http://dblp.org/pers/hd/m/Martelli:Catherine", "Jean-Luc Martinot.....http://dblp.org/pers/hd/m/Martinot:Jean=Luc", "Jean-Baptiste Poline.....http://dblp.org/pers/hd/p/Poline:Jean=Baptiste"], "pages": 9}