{"title": "A Complete Characterization of Statistical Query Learning with Applications to Evolvability.", "fields": ["instance based learning", "sample exclusion dimension", "phenomenon", "generalization error", "active learning", "machine learning", "probably approximately correct learning", "evolutionary computation", "theoretical computer science", "evolvability", "computer science", "approximation algorithm", "evolutionary algorithm", "monotone polygon", "artificial intelligence", "algorithmic learning theory"], "abstract": "Statistical query (SQ) learning model of Kearns is a natural restriction of the PAC learning model in which a learning algorithm is allowed to obtain estimates of statistical properties of the examples but cannot see the examples themselves \\cite{Kearns:98}. We describe a new and simple characterization of the query complexity of learning in the SQ learning model. Unlike the previously known bounds on SQ learning \\cite{BlumFJ+:94, BshoutyFeldman:02, Yang:05, BalcazarCGKL:07, Simon:07} our characterization preserves the accuracy and the efficiency of learning. The preservation of accuracy implies that that our characterization gives the first characterization of the statistical query complexity in the agnostic learning framework of Haussler and Kearns, Schapire and Sellie \\cite{Haussler:92, KearnsSS:94}. The preservation of efficiency allows us to derive a new technique for the design of evolutionary algorithms in Valiant's model of evolvability \\cite{Valiant:09}. We use this technique to demonstrate the existence of a large class of monotone evolutionary learning algorithms based on square loss fitness estimation. These results differ significantly from the few known evolutionary algorithms and give evidence that evolvability in Valiant's model is a more versatile phenomenon than there had been previous reason to suspect.", "citation": "Citations (23)", "departments": ["IBM", "IBM"], "authors": ["Vitaly Feldman.....http://dblp.org/pers/hd/f/Feldman:Vitaly"], "conf": "focs", "year": "2009", "pages": 10}