{"title": "Top-k Exploration of Query Candidates for Efficient Keyword Search on Graph-Shaped (RDF) Data.", "fields": ["search engine indexing", "rdf", "database engine", "data model", "search algorithm"], "abstract": "Keyword queries enjoy widespread usage as they represent an intuitive way of specifying information needs. Recently, answering keyword queries on graph-structured data has emerged as an important research topic. The prevalent approaches build on dedicated indexing techniques as well as search algorithms aiming at finding substructures that connect the data elements matching the keywords. In this paper, we introduce a novel keyword search paradigm for graph-structured data, focusing in particular on the RDF data model. Instead of computing answers directly as in previous approaches, we first compute queries from the keywords, allowing the user to choose the appropriate query, and finally, process the query using the underlying database engine. Thereby, the full range of database optimization techniques can be leveraged for query processing. For the computation of queries, we propose a novel algorithm for the exploration of top-k matching subgraphs. While related techniques search the best answer trees, our algorithm is guaranteed to compute all k subgraphs with lowest costs, including cyclic graphs. By performing exploration only on a summary data structure derived from the data graph, we achieve promising performance improvements compared to other approaches.", "citation": "Citations (314)", "departments": ["Shanghai Jiao Tong University", "Inst. AIFB, Uni ... ruhe, Karlsruhe", "Inst. AIFB, Uni ... ruhe, Karlsruhe", "Web Inf. Syst., ... v. Delft, Delft"], "authors": ["Thanh Tran.....http://dblp.org/pers/hd/t/Tran_0001:Thanh", "Haofen Wang.....http://dblp.org/pers/hd/w/Wang:Haofen", "Sebastian Rudolph.....http://dblp.org/pers/hd/r/Rudolph:Sebastian", "Philipp Cimiano.....http://dblp.org/pers/hd/c/Cimiano:Philipp"], "conf": "icde", "year": "2009", "pages": 12}