{"title": "Complete information flow tracking from the gates up.", "fields": ["encryption", "programmer", "complete information", "key", "public key cryptography"], "abstract": "For many mission-critical tasks, tight guarantees on the flow of information are desirable, for example, when handling important cryptographic keys or sensitive financial data. We present a novel architecture capable of tracking all information flow within the machine, including all explicit data transfers and all implicit flows (those subtly devious flows caused by not performing conditional operations). While the problem is impossible to solve in the general case, we have created a machine that avoids the general-purpose programmability that leads to this impossibility result, yet is still programmable enough to handle a variety of critical operations such as public-key encryption and authentication. Through the application of our novel gate-level information flow tracking method, we show how all flows of information can be precisely tracked. From this foundation, we then describe how a class of architectures can be constructed, from the gates up, to completely capture all information flows and we measure the impact of doing so on the hardware implementation, the ISA, and the programmer.", "citation": "Citations (165)", "year": "2009", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "conf": "asplos", "authors": ["Mohit Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Mohit", "Hassan M. G. Wassel.....http://dblp.org/pers/hd/w/Wassel:Hassan_M=_G=", "Bita Mazloom.....http://dblp.org/pers/hd/m/Mazloom:Bita", "Shashidhar Mysore.....http://dblp.org/pers/hd/m/Mysore:Shashidhar", "Frederic T. Chong.....http://dblp.org/pers/hd/c/Chong:Frederic_T=", "Timothy Sherwood.....http://dblp.org/pers/hd/s/Sherwood:Timothy"], "pages": 12}