{"title": "Budget-Based Self-Optimized Incentive Search in Unstructured P2P Networks.", "fields": ["search cost", "file sharing", "service level", "distributed object", "hit rate"], "abstract": "Distributed object search is the primary function of Peer-to-Peer (P2P) file sharing system to locate and transfer the file. The predominant search schemes in unstructured P2P systems have their problems: flooding creates excessive traffic overhead and random walk prolongs search delay. Moreover, both use uniform Time-to-Live (TTL) control for all users, which makes them vulnerable to selfish user attacks, and results in the \"free-riding\" and \"tragedy of the commons\" problems. In this pa- per, we propose a Budget-based Self-optimized Incentive Search (BuSIS) protocol for unstructured P2P file sharing systems, which is robust to and restricts selfish user behaviors. Furthermore, our protocol lowers the search overhead while keeping high hit rate. BuSIS provides differentiated search service for selfish users and ties a user's contribution to its service level. We present the analytical models on expected search performance, associated search cost and the user satisfaction level. Extensive emulations have been conducted at large scale network scenarios to compare performance of BuSIS with flooding and random walk searches with and without selfish user behaviors. The experimental results show that BuSIS always has the lowest search overhead without sacrificing the hit rate. When serving selfish users, flooding and random walk performance degrade dramatically, while BuSIS gracefully keeps the hit rate only with 20% overhead of flooding and 25% of random walk.", "citation": "Citations (5)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "authors": ["Yi Hu.....http://dblp.org/pers/hd/h/Hu:Yi", "Min Feng.....http://dblp.org/pers/hd/f/Feng_0001:Min", "Laxmi N. Bhuyan.....http://dblp.org/pers/hd/b/Bhuyan:Laxmi_N=", "Vana Kalogeraki.....http://dblp.org/pers/hd/k/Kalogeraki:Vana"], "conf": "infocom", "year": "2009", "pages": 9}