{"title": "A Cooperative Spectrum Sensing Consensus Scheme in Cognitive Radios.", "fields": ["duplex", "consensus", "cognitive radio", "radio spectrum", "fading"], "abstract": "Cooperative spectrum sensing is attracting more attention in Cognitive Radio networks. This paper proposes a fully distributed consensus-based cooperative spectrum sensing scheme to cope with both fixed and random bidirectional connections among secondary users. In the proposed scheme, secondary users can maintain coordination based on only local interactions without a centralized common receiver. Moreover, we prove that even inter-connected with unreliable bidirectional communication links, secondary users can still make an average consensus. Simulation results show that the proposed scheme can have significantly lower missing detection probability and false alarm probability. I. INTRODUCTION Cognitive radio (CR) (1) is an enabling technology that im- proves the utilization of scarce radio spectrum resources. Since cognitive radios are considered as lower priority and they are secondary users of spectrum allocated to a primary user, a fundamental requirement is to avoid interference to potential primary users in their vicinity (2). In addition, primary user networks have no requirement to change their infrastructure for spectrum sharing with cognitive radios. Therefore, secondary users should be able to independently detect the presence of primary users through continuous spectrum sensing. Such spectrum sensing can be conducted either individually (or locally), in which each secondary user conducts radio detection and makes decision by itself, or cooperatively, in which a group of secondary users perform spectrum sensing by collaboration. Although some research activities have been conducted in cooperative spectrum sensing, most of them use a common receiver (fusion center) to do data fusion for the final decision whether or not the primary user is present. However, as indicated in (3), gathering the entire received data at one place may be very difficult under practical communication constraints. Furthermore, authors of (4) study the reporting channels between the cognitive users and the common receiver. The results show that there are limitations for the performance of cooperation when the reporting channels to the common receiver are under deep fading. In (5), a distributed consensus-based spectrum sensing scheme is introduced without using a centralized common receiver. This scheme is based on recent advances in consensus algorithms (6). An important motivational background of this area is initially related to the study of complex natural phenomena including flocking of birds, schooling of fish, swarming of honeybees, among others (7). A key feature of such models is that the population of agents can maintain coordination based on local interactions without centralized information exchange. Recently, consensus problems also play a crucial role in spacial distributed control models (6), and wireless sensor networks (8). Based on the work in (5), we extend the communication channels among secondary users from fixed bidirectional links to random bidirectional ones, and prove that in the latter condition, average consensus is still achievable. Extensive simulation results illustrate the effectiveness of the proposed scheme. It is shown that the proposed scheme can have both lower missing detection probability and lower false alarm probability compared to existing schemes. The rest of the paper is organized as follows. Section II presents some fundamental backgrounds, together with the definition of our consensus scheme. In Section III, the consensus algorithm is proposed under two conditions, the duplex communication links among secondary users are either fixed ones or occasionally disconnected due to channel fading and transmission errors. Some simulation results are given in Section IV. Finally, we conclude this study in Section V.", "citation": "Citations (76)", "departments": ["Carleton University", "Carleton University", "Carleton University"], "authors": ["Zhiqiang Li.....http://dblp.org/pers/hd/l/Li:Zhiqiang", "F. Richard Yu.....http://dblp.org/pers/hd/y/Yu:F=_Richard", "Minyi Huang.....http://dblp.org/pers/hd/h/Huang:Minyi"], "conf": "infocom", "year": "2009", "pages": 5}