{"title": "All Bits Are Not Equal - A Study of IEEE 802.11 Communication Bit Errors.", "fields": ["forward error correction", "orthogonal frequency division multiplexing", "ieee 802 11", "coding gain", "bit error rate"], "abstract": "In IEEE 802.11 Wireless LAN (WLAN) systems, techniques such as acknowledgement, retransmission, and transmission rate adaptation, are frame-level mechanisms designed for combating transmission errors. Recently sub-frame level mechanisms such as frame combining have been proposed by the research community. In this paper, we present results obtained from our bit error study for identifying sub-frame error patterns because we believe that identifiable bit error patterns can potentially introduce new opportunities in channel coding, network coding, forward error correction (FEC), and frame combining mechanisms. We have constructed a number of IEEE 802.11 wireless LAN testbeds and conducted extensive experiments to study the characteristics of bit errors and their location distribution. Conventional wisdom dictates that bit error probability is the result of channel condition and ought to follow corresponding distribution. However our measurement results identify three repeatable bit error patterns that are not induced by channel conditions. We have verified that such error patterns are present in WLAN transmissions in different physical environments and across different wireless LAN hardware platforms. We also discuss our current hypotheses for the reasons behind these bit error probability patterns and how identifying these patterns may help improving WLAN transmission robustness.", "citation": "Citations (21)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Bo Han.....http://dblp.org/pers/hd/h/Han:Bo", "Lusheng Ji.....http://dblp.org/pers/hd/j/Ji:Lusheng", "Seungjoon Lee.....http://dblp.org/pers/hd/l/Lee:Seungjoon", "Bobby Bhattacharjee.....http://dblp.org/pers/hd/b/Bhattacharjee:Bobby", "Robert R. Miller.....http://dblp.org/pers/hd/m/Miller:Robert_R="], "conf": "infocom", "year": "2009", "pages": 9}