{"title": "Query processing techniques for solid state drives.", "fields": ["hash join", "recursive join", "solid state drive", "ranging", "query plan"], "abstract": "Solid state drives perform random reads more than 100x faster than traditional magnetic hard disks, while offering comparable sequential read and write bandwidth. Because of their potential to speed up applications, as well as their reduced power consumption, these new drives are expected to gradually replace hard disks as the primary permanent storage media in large data centers. However, although they may benefit applications that stress random reads immediately, they may not improve database applications, especially those running long data analysis queries. Database query processing engines have been designed around the speed mismatch between random and sequential I/O on hard disks and their algorithms currently emphasize sequential accesses for disk-resident data.   In this paper, we investigate data structures and algorithms that leverage fast random reads to speed up selection, projection, and join operations in relational query processing. We first demonstrate how a column-based layout within each page reduces the amount of data read during selections and projections. We then introduce FlashJoin, a general pipelined join algorithm that minimizes accesses to base and intermediate relational data. FlashJoin's binary join kernel accesses only the join attributes, producing partial results in the form of a join index. Subsequently, its fetch kernel retrieves the attributes for later nodes in the query plan as they are needed. FlashJoin significantly reduces memory and I/O requirements for each join in the query. We implemented these techniques inside Postgres and experimented with an enterprise SSD drive. Our techniques improved query runtimes by up to 6x for queries ranging from simple relational scans and joins to full TPC-H queries.", "citation": "Citations (167)", "year": "2009", "departments": ["University of Toronto", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard"], "conf": "sigmod", "authors": ["Dimitris Tsirogiannis.....http://dblp.org/pers/hd/t/Tsirogiannis:Dimitris", "Stavros Harizopoulos.....http://dblp.org/pers/hd/h/Harizopoulos:Stavros", "Mehul A. Shah.....http://dblp.org/pers/hd/s/Shah:Mehul_A=", "Janet L. Wiener.....http://dblp.org/pers/hd/w/Wiener:Janet_L=", "Goetz Graefe.....http://dblp.org/pers/hd/g/Graefe:Goetz"], "pages": 14}