{"title": "The third homomorphism theorem on trees: downward & upward lead to divide-and-conquer.", "fields": ["homomorphism", "divide and conquer algorithms", "associative property", "generalization", "automatic parallelization"], "abstract": "Parallel programs on lists have been intensively studied. It is well known that associativity provides a good characterization for divide-and-conquer parallel programs. In particular, the third homomorphism theorem is not only useful for systematic development of parallel programs on lists, but it is also suitable for automatic parallelization. The theorem states that if two sequential programs iterate the same list leftward and rightward, respectively, and compute the same value, then there exists a divide-and-conquer parallel program that computes the same value as the sequential programs.   While there have been many studies on lists, few have been done for characterizing and developing of parallel programs on trees. Naive divide-and-conquer programs, which divide a tree at the root and compute independent subtrees in parallel, take time that is proportional to the height of the input tree and have poor scalability with respect to the number of processors when the input tree is ill-balanced.   In this paper, we develop a method for systematically constructing scalable divide-and-conquer parallel programs on trees, in which two sequential programs lead to a scalable divide-andconquer parallel program. We focus on paths instead of trees so as to utilize rich results on lists and demonstrate that associativity provides good characterization for scalable divide-and-conquer parallel programs on trees. Moreover, we generalize the third homomorphism theorem from lists to trees.We demonstrate the effectiveness of our method with various examples. Our results, being generalizations of known results for lists, are generic in the sense that they work well for all polynomial data structures.", "citation": "Citations (51)", "departments": ["University of Tokyo", "University of Tokyo", "National Institute of Informatics", "University of Tokyo"], "authors": ["Akimasa Morihata.....http://dblp.org/pers/hd/m/Morihata:Akimasa", "Kiminori Matsuzaki.....http://dblp.org/pers/hd/m/Matsuzaki:Kiminori", "Zhenjiang Hu.....http://dblp.org/pers/hd/h/Hu:Zhenjiang", "Masato Takeichi.....http://dblp.org/pers/hd/t/Takeichi:Masato"], "conf": "popl", "year": "2009", "pages": 9}