{"title": "A gauss function based approach for unbalanced ontology matching.", "fields": ["ontology based data integration", "suggested upper merged ontology", "lightweight ontology", "ontology alignment", "metadata management"], "abstract": "Ontology matching, aiming to obtain semantic correspondences between two ontologies, has played a key role in data exchange, data integration and metadata management. Among numerous matching scenarios, especially the applications cross multiple domains, we observe an important problem, denoted as unbalanced ontology matching which requires to find the matches between an ontology describing a local domain knowledge and another ontology covering the information over multiple domains, is not well studied in the community.   In this paper, we propose a novel Gauss Function based ontology matching approach to deal with this unbalanced ontology matching issue. Given a relative lightweight ontology which represents the local domain knowledge, we extract a \"similar\" sub-ontology from the corresponding heavyweight ontology and then carry out the matching procedure between this lightweight ontology and the newly generated sub-ontology. The sub-ontology generation is based on the influences between concepts in the heavyweight ontology. We propose a Gauss Function based method to properly calculate the influence values between concepts. In addition, we perform an extensive experiment to verify the effectiveness and efficiency of our proposed approach by using OAEI2007 tasks. Experimental results clearly demonstrate that our solution outperforms the existing methods in terms of precision, recall and elapsed time.", "citation": "Citations (29)", "year": "2009", "departments": ["Tsinghua University", "IBM", "Tsinghua University", "IBM", "Tsinghua University"], "conf": "sigmod", "authors": ["Qian Zhong.....http://dblp.org/pers/hd/z/Zhong:Qian", "Hanyu Li.....http://dblp.org/pers/hd/l/Li:Hanyu", "Juanzi Li.....http://dblp.org/pers/hd/l/Li:Juanzi", "Guo Tong Xie.....http://dblp.org/pers/hd/x/Xie:Guo_Tong", "Jie Tang.....http://dblp.org/pers/hd/t/Tang_0001:Jie", "Lizhu Zhou.....http://dblp.org/pers/hd/z/Zhou:Lizhu", "Yue Pan.....http://dblp.org/pers/hd/p/Pan:Yue"], "pages": 12}