{"title": "Lightweight Remote Image Management for Secure Code Dissemination in Wireless Sensor Networks.", "fields": ["mobile wireless sensor network", "visual sensor network", "key distribution in wireless sensor networks", "testbed", "current sensor"], "abstract": "Wireless sensor networks are considered ideal can- didates for a wide range of applications. It is desirable and sometimes necessary to reprogram sensor nodes through wireless links after they are deployed to remove bugs or add new functionalities. Several approaches (e.g., Seluge, Sluice) have been proposed recently for secure code dissemination in wireless sensor networks, all as security extensions to the state-of-the- art code dissemination system named Deluge. However, existing approaches all focused on securing the propagation of code images, but overlooked the security vulnerabilities in other image management aspects such as rebooting and erasing code images. In this paper, we identify the security vulnerabilities in epi- demic image management in all existing solutions to secure code dissemination in wireless sensor networks. Such vulnerabilities al- low an attacker to reboot a sensor network to undesirable images or erase critical images, exposing the network to security risks. We then develop a sequence of lightweight techniques to address these vulnerabilities. Our approach takes into consideration the limited resources on current sensor platforms, and removes the security vulnerabilities without introducing significant overhead. To evaluate the feasibility of our approach, we implement the proposed approach as a remote image management system named Seluge-ImageMan, which is intended to work with Seluge, a security extension to Deluge for injecting new code images. We perform a substantial set of experiments in the WiSeNeT sensor testbed, which consists of 72 MicaZ motes, to assess the performance overhead of Seluge-ImageMan. The experimental results indicate that our approach introduces very light overhead while completing the secure remote code image management solution for wireless sensor networks. I. INTRODUCTION Wireless sensor networks are considered ideal candidates for a wide range of applications, such as industry monitoring, data acquisition in hazardous environments, and military op- erations. It is desirable and sometimes necessary to reprogram the sensor nodes through wireless links after they are deployed due to the need of fixing bugs or adding new functionalities.", "citation": "Citations (14)", "departments": ["North Carolina State University", "North Carolina State University"], "authors": ["An Liu.....http://dblp.org/pers/hd/l/Liu:An", "Peng Ning.....http://dblp.org/pers/hd/n/Ning:Peng", "Chun Wang.....http://dblp.org/pers/hd/w/Wang:Chun"], "conf": "infocom", "year": "2009", "pages": 9}