{"title": "Practical off-chip meta-data for temporal memory streaming.", "fields": ["interleaved memory", "memory level parallelism", "memory architecture", "computing with memory", "instruction prefetch"], "abstract": "Prior research demonstrates that temporal memory streaming and related address-correlating prefetchers improve performance of commercial server workloads though increased memory level parallelism. Unfortunately, these prefetchers require large on-chip meta-data storage, making previously-proposed designs impractical. Hence, to improve practicality, researchers have sought ways to enable timely prefetch while locating meta-data entirely off-chip. Unfortunately, current solutions for off-chip meta-data increase memory traffic by over a factor of three. We observe three requirements to store meta-data off chip: minimal off-chip lookup latency, bandwidth-efficient meta-data updates, and off-chip lookup amortized over many prefetches. In this work, we show: (1) minimal off-chip meta-data lookup latency can be achieved through a hardware-managed main memory hash table, (2) bandwidth-efficient updates can be performed through probabilistic sampling of meta-data updates, and (3) off-chip lookup costs can be amortized by organizing meta-data to allow a single lookup to yield long prefetch sequences. Using these techniques, we develop Sampled Temporal Memory Streaming (STMS), a practical address-correlating prefetcher that keeps predictor meta-data in main memory while achieving 90% of the performance potential of idealized on-chip meta-data storage.", "citation": "Citations (23)", "departments": ["University of Michigan", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of Toronto"], "authors": ["Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F=", "Michael Ferdman.....http://dblp.org/pers/hd/f/Ferdman:Michael", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia", "Babak Falsafi.....http://dblp.org/pers/hd/f/Falsafi:Babak", "Andreas Moshovos.....http://dblp.org/pers/hd/m/Moshovos:Andreas"], "conf": "hpca", "year": "2009", "pages": 12}