{"title": "Learning HTN Method Preconditions and Action Models from Partial Observations.", "fields": ["domain knowledge", "hierarchical task network", "schema", "boolean satisfiability problem", "solver"], "abstract": "To apply hierarchical task network (HTN) planning to real-world planning problems, one needs to encode the HTN schemata and action models beforehand. However, acquiring such domain knowledge is difficult and time-consuming because the HTN domain definition involves a significant knowledge-engineering effort. A system that can learn the HTN planning domain knowledge automatically would save time and allow HTN planning to be used in domains where such knowledgeengineering effort is not feasible. In this paper, we present a formal framework and algorithms to acquire HTN planning domain knowledge, by learning the preconditions and effects of actions and preconditions of methods. Our algorithm, HTN-learner, first builds constraints from given observed decomposition trees to build action models and method preconditions. It then solves these constraints using a weighted MAX-SAT solver. The solution can be converted to action models and method preconditions. Unlike prior work on HTN learning, we do not depend on complete action models or state information. We test the algorithm on several domains, and show that our HTN-learner algorithm is both effective and efficient.", "citation": "Citations (26)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Lehigh University", "Hong Kong University of Science and Technology", "Lehigh University"], "authors": ["Hankz Hankui Zhuo.....http://dblp.org/pers/hd/z/Zhuo:Hankz_Hankui", "Derek Hao Hu.....http://dblp.org/pers/hd/h/Hu:Derek_Hao", "Chad Hogg.....http://dblp.org/pers/hd/h/Hogg:Chad", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang", "Hector Muñoz-Avila.....http://dblp.org/pers/hd/m/Mu=ntilde=oz=Avila:Hector"], "conf": "ijcai", "year": "2009", "pages": 7}