{"title": "Efficient Indices Using Graph Partitioning in RDF Triple Stores.", "fields": ["blank node", "cwm", "rdf schema", "rdf xml", "rdf query language"], "abstract": "With the advance of the Semantic Web, varying RDF data were increasingly generated, published, queried, and reused via the Web. For example, the DBpedia, a community effort to extract structured data from Wikipedia articles, broke 100 million RDF triples in its latest release. Initiated by Tim Berners-Lee,likewise, the Linking Open Data (LOD) project has published and interlinked many open licence datasets which consisted of over 2 billion RDF triples so far. In this context, fast query response over such large scaled data would be one of the challenges to existing RDF data stores. In this paper, we propose a novel triple indexing scheme to help RDF query engine fast locate the instances within a small scope. By considering the RDF data as a graph, we would partition the graph into multiple subgraph pieces and store them individually, over which a signature tree would be built up to index the URIs. When a query arrives, the signature tree index is used to fast locate the partitions that might include the matches of the query by its constant URIs. Our experiments indicate that the indexing scheme dramatically reduces the query processing time in most cases because many partitions would be early filtered out and the expensive exact matching is only performed over a quite small scope against the original dataset.", "citation": "Citations (23)", "departments": ["Fudan University", "IBM", "Fudan University", "East China Normal University", "IBM"], "authors": ["Ying Yan.....http://dblp.org/pers/hd/y/Yan:Ying", "Chen Wang.....http://dblp.org/pers/hd/w/Wang_0020:Chen", "Aoying Zhou.....http://dblp.org/pers/hd/z/Zhou:Aoying", "Weining Qian.....http://dblp.org/pers/hd/q/Qian:Weining", "Li Ma.....http://dblp.org/pers/hd/m/Ma_0002:Li", "Yue Pan.....http://dblp.org/pers/hd/p/Pan:Yue"], "conf": "icde", "year": "2009", "pages": 4}