{"title": "Event Recognition in Sensor Networks by Means of Grammatical Inference.", "fields": ["supervised learning", "probabilistic logic", "context free grammar", "raw data", "grammar induction"], "abstract": "Modern military and civilian surveillance applica- tions should provide end users with the high level representation of events observed by sensors rather than with the raw data measurements. Hence, there is a need for a system that can infer higher level meaning from collected sensor data. We demonstrate that probabilistic context free grammars (PCFGs) can be used as a basis for such a system. To recognize events from raw sensor network measurements, we use a PCFG inference method based on Stolcke(1994) and Chen(1996). We present a fast algorithm for deriving a concise probabilistic context free grammar from the given observational data. The algorithm uses an evaluation metric based on Bayesian formula for maximizing grammar a posteriori probability given the training data. We also present a real-world scenario of monitoring a parking lot and the simulation based on this scenario. We described the use of PCFGs to recognize events in the results of such a simulation. We finally demonstrate the deployment details of such an event recognition system. its construction. Second, we are using a novel method for fast calculation of the metric that takes advantage of the properties of the chunk and merge operations, originally introduced by Stolcke. Please note that what we are presenting in this paper is actually a supervised learning method because the definitions of the events to be recognized are initially given to the learning algorithm. Then, the recognition phase takes place during which new data are classified into events using the grammar created in the learning stage. The rest of the paper is organized as follows. We start with a basic introduction to PCFGs. The next section describes the previous work on PCFG inference methods and applications of PCFGs to event detection in WSNs. Then, we define our method for grammar inference and analyze its complexity. Finally, we present a real world scenario of parking lot monitoring and its simulations, as well as deployment details of such a system on a sensor network.", "citation": "Citations (15)", "departments": ["Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute"], "authors": ["Sahin Cem Geyik.....http://dblp.org/pers/hd/g/Geyik:Sahin_Cem", "Boleslaw K. Szymanski.....http://dblp.org/pers/hd/s/Szymanski:Boleslaw_K="], "conf": "infocom", "year": "2009", "pages": 9}