{"title": "Enhancing diversity, coverage and balance for summarization through structure learning.", "fields": ["rouge", "data set", "multi document summarization", "automatic summarization", "submodular set function"], "abstract": "Document summarization plays an increasingly important role with the exponential growth of documents on the Web. Many supervised and unsupervised approaches have been proposed to generate summaries from documents. However, these approaches seldom simultaneously consider summary diversity, coverage, and balance issues which to a large extent determine the quality of summaries. In this paper, we consider extract-based summarization emphasizing the following three requirements: 1) diversity in summarization, which seeks to reduce redundancy among sentences in the summary; 2) sufficient coverage, which focuses on avoiding the loss of the document's main information when generating the summary; and 3) balance, which demands that different aspects of the document need to have about the same relative importance in the summary. We formulate the extract-based summarization problem as learning a mapping from a set of sentences of a given document to a subset of the sentences that satisfies the above three requirements. The mapping is learned by incorporating several constraints in a structure learning framework, and we explore the graph structure of the output variables and employ structural SVM for solving the resulted optimization problem. Experiments on the DUC2001 data sets demonstrate significant performance improvements in terms of F1 and ROUGE metrics.", "citation": "Citations (116)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Georgia Institute of Technology", "Shanghai Jiao Tong University"], "authors": ["Liangda Li.....http://dblp.org/pers/hd/l/Li:Liangda", "Ke Zhou.....http://dblp.org/pers/hd/z/Zhou_0002:Ke", "Gui-Rong Xue.....http://dblp.org/pers/hd/x/Xue:Gui=Rong", "Hongyuan Zha.....http://dblp.org/pers/hd/z/Zha:Hongyuan", "Yong Yu.....http://dblp.org/pers/hd/y/Yu:Yong"], "conf": "www", "year": "2009", "pages": 10}