{"title": "Scheduling partition for order optimal capacity in large-scale wireless networks.", "fields": ["round robin scheduling", "two level scheduling", "least slack time scheduling", "genetic algorithm scheduling", "stride scheduling", "rate monotonic scheduling", "maximum throughput scheduling"], "abstract": "The capacity scaling property specifies the changes in network throughput when network size increases and serves as an essential performance evaluation metric for large-scale wireless networks. Existing results have been obtained based on the implicit assumption of negligible overhead in acquiring the network topology and synchronizing the link transmissions. In large networks, however, global topology collection and global link synchronization are infeasible with both the centralized and the distributed link scheduling schemes. This gap between the well-known capacity results and the impractical assumption on link scheduling potentially undermines our understanding of the  achievable  network capacity. Therefore, the following question remains open: can  localized  scheduling algorithms achieve the same order of capacity as their global counterpart? In this paper, we propose the  scheduling partition  methodology by decomposing a large network into many small autonomous scheduling zones, in which localized scheduling algorithms are implemented independently from one another. We prove that any localized scheduling algorithm that satisfies a set of sufficient and necessary conditions can yield the same order of capacity as the widely assumed global scheduling strategy. In comparison to the network dimension √ n , scheduling partition sizes Θ(√log  n ) and Θ(1) are sufficient for optimal capacity scaling in the random and the arbitrary node placement models respectively. We finally propose an example localized link scheduling algorithm to verify the capacity achieved by scheduling partition. Our results thus provide guidelines on the scheduling algorithm design toward maximum capacity scaling in large-scale wireless networks.", "citation": "Citations (20)", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University", "North Carolina State University"], "authors": ["Yi Xu.....http://dblp.org/pers/hd/x/Xu:Yi", "Wenye Wang.....http://dblp.org/pers/hd/w/Wang:Wenye"], "conf": "mobicom", "year": "2009", "pages": 12}