{"title": "Learning general optical flow subspaces for egomotion estimation and detection of motion anomalies.", "fields": ["subspace topology", "motion detection", "probabilistic logic", "generative model", "linear subspace"], "abstract": "This paper deals with estimation of dense optical flow and ego-motion in a generalized imaging system by exploiting probabilistic linear subspace constraints on the flow. We deal with the extended motion of the imaging system through an environment that we assume to have some degree of statistical regularity. For example, in autonomous ground vehicles the structure of the environment around the vehicle is far from arbitrary, and the depth at each pixel is often approximately constant. The subspace constraints hold not only for perspective cameras, but in fact for a very general class of imaging systems, including catadioptric and multiple-view systems. Using minimal assumptions about the imaging system, we learn a probabilistic subspace constraint that captures the statistical regularity of the scene geometry relative to an imaging system. We propose an extension to probabilistic PCA (Tipping and Bishop, 1999) as a way to robustly learn this subspace from recorded imagery, and demonstrate its use in conjunction with a sparse optical flow algorithm. To deal with the sparseness of the input flow, we use a generative model to estimate the subspace using only the observed flow measurements. Additionally, to identify and cope with image regions that violate subspace constraints, such as moving objects, objects that violate the depth regularity, or gross flow estimation errors, we employ a per-pixel Gaussian mixture outlier process. We demonstrate results of finding the optical flow subspaces and employing them to estimate dense flow and to recover camera motion for a variety of imaging systems in several different environments.", "citation": "Citations (36)", "year": "2009", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "cvpr", "authors": ["Richard Roberts.....http://dblp.org/pers/hd/r/Roberts_0001:Richard", "Christian Potthast.....http://dblp.org/pers/hd/p/Potthast:Christian", "Frank Dellaert.....http://dblp.org/pers/hd/d/Dellaert:Frank"], "pages": 8}