{"title": "Context-Aware Object Connection Discovery in Large Graphs.", "fields": ["information flow", "partition", "modularity", "graph database", "greedy algorithm"], "abstract": "Given a large graph and a set of objects, the task of object connection discovery is to find a subgraph that retains the best connection between the objects. Object connection discovery is useful to many important applications such as discovering the connection between different terrorist groups for counter-terrorism operations. Existing work considers only the connection between individual objects; however, in many real problems the objects usually have a context (e.g., a terrorist belongs to a terrorist group). We identify the context for the nodes in a large graph. We partition the graph into a set of communities based on the concept of modularity, where each community becomes naturally the context of the nodes within the community. By considering the context we also significantly improve the efficiency of object connection discovery, since we break down the big graph into much smaller communities. We first compute the best intra-community connection by maximizing the amount of information flow in the answer graph. Then, we extend the connection to the inter-community level by utilizing the community hierarchy relation, while the quality of the inter-community connection is also ensured by modularity. Our experiments show that our algorithm is three orders of magnitude faster than the state-of-the-art algorithm, while the quality of the query answer is comparable.", "citation": "Citations (62)", "departments": ["Hong Kong University of Science and Technology", "The Chinese University of Hong Kong", "Hong Kong University of Science and Technology", "The Chinese University of Hong Kong"], "authors": ["James Cheng.....http://dblp.org/pers/hd/c/Cheng:James", "Yiping Ke.....http://dblp.org/pers/hd/k/Ke:Yiping", "Wilfred Ng.....http://dblp.org/pers/hd/n/Ng:Wilfred", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu"], "conf": "icde", "year": "2009", "pages": 12}