{"title": "Efficient Processing of Warping Time Series Join of Motion Capture Data.", "fields": ["image warping", "motion capture", "dynamic programming", "speedup", "automatic summarization"], "abstract": "Discovering non-trivial matching subsequences from two time series is very useful in synthesizing novel time series. This can be applied to applications such as motion synthesis where smooth and natural motion sequences are often required to be generated from existing motion sequences. We first address this problem by defining it as a problem of l-e-join over two time series. Given two time series, the goal of l-e-join is to find those non-trivial matching subsequences by detecting maximal l-connections from the e-matching matrix of the two time series. Given a querying motion sequence, the l-e-join can be applied to retrieve all connectable motion sequences from a database of motion sequences. To support efficient l-e-join of time series, we propose a two-step filter-and-refine algorithm, called Warping Time Series Join (WTSJ) algorithm. The filtering step serves to prune those sparse regions of the e-matching matrix where there are no maximal l-connections without incurring costly computation. The refinement step serves to detect closed l-connections within regions that cannot be pruned by the filtering step. To speed up the computation of e-matching matrix, we propose a block-based time series summarization method, based on which the block-wise e-matching matrix is first computed. Lots of pairwise distance computation of elements can then be avoided by applying the filtering algorithm on the block-wise e-matching matrix.Extensive experiments on l-e-join of motion capture sequences are conducted. The results confirm the efficiency and effectiveness of our proposed algorithm in processing l-e-join of motion capture time series.", "citation": "Citations (11)", "departments": ["National University of Singapore", "Zhejiang University", "Zhejiang University", "National University of Singapore"], "authors": ["Yueguo Chen.....http://dblp.org/pers/hd/c/Chen:Yueguo", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Ke Chen.....http://dblp.org/pers/hd/c/Chen_0005:Ke", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin"], "conf": "icde", "year": "2009", "pages": 12}