{"title": "Estimating Hop Distance Between Arbitrary Host Pairs.", "fields": ["passive monitoring", "internet topology", "pairwise comparison", "hop", "border gateway protocol"], "abstract": "Establishing a clear and timely picture of Internet topology is complicated by many factors including the vast size and dynamic nature of the infrastructure. In this paper, we describe a methodology for estimating an important characteristic of Internet topology - the hop distance between arbitrary pairs of end hosts. Our goal is to develop an approach to pairwise hop distance estimation that is accurate, scalable, timely and does not require a significant measurement infrastructure. Our methodology is based on deploying a small set of landmark nodes that use trace route-like probes between each other to establish a set of accurate pairwise hop distances. The landmark nodes are also configured to collect source IP addresses and TTL values from passively monitored network packet traffic. We develop a novel multidimensional scaling algorithm that can be applied to both the passive and active measurements to generate pairwise hop distance estimates for all of the observed source host addresses. The basic algorithm is then enhanced to consider the autonomous system membership of source hosts via BGP routing information. We investigate the capabilities of our estimation algorithms using a set of synthetic network topologies. The results show that our method can generate highly accurate pairwise hop distance estimates over a range of network sizes and configurations, and landmark infrastructure sizes.", "citation": "Citations (12)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Brian Eriksson.....http://dblp.org/pers/hd/e/Eriksson:Brian", "Paul Barford.....http://dblp.org/pers/hd/b/Barford:Paul", "Robert D. Nowak.....http://dblp.org/pers/hd/n/Nowak:Robert_D="], "conf": "infocom", "year": "2009", "pages": 9}