{"title": "Local summarization and multi-level LSH for retrieving multi-variant audio tracks.", "fields": ["locality sensitive hashing", "information retrieval", "weighted arithmetic mean", "hash function", "automatic summarization"], "abstract": "In this paper we study the problem of detecting and grouping multi-variant audio tracks in large audio datasets. To address this issue, a fast and reliable retrieval method is necessary. But reliability requires elaborate representations of audio content, which challenges fast retrieval by similarity from a large audio database. To find a better tradeoff between retrieval quality and efficiency, we put forward an approach relying on local summarization and multi-level Locality-Sensitive Hashing (LSH). More precisely, each audio track is divided into multiple Continuously Correlated Periods (CCP) of variable length according to spectral similarity. The description for each CCP is calculated based on its Weighted Mean Chroma (WMC). A track is thus represented as a sequence of WMCs. Then, an adapted two-level LSH is employed for efficiently delineating a narrow relevant search region. The \"coarse\" hashing level restricts search to items having a non-negligible similarity to the query. The subsequent, \"refined\" level only returns items showing a much higher similarity. Experimental evaluations performed on a real multi-variant audio dataset confirm that our approach supports fast and reliable retrieval of audio track variants.", "citation": "Citations (14)", "departments": ["New Jersey Institute of Technology", "Conservatoire national des arts et métiers", "New Jersey Institute of Technology", "Hong Kong University of Science and Technology"], "authors": ["Yi Yu.....http://dblp.org/pers/hd/y/Yu_0001:Yi", "Michel Crucianu.....http://dblp.org/pers/hd/c/Crucianu:Michel", "Vincent Oria.....http://dblp.org/pers/hd/o/Oria:Vincent", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei"], "conf": "mm", "year": "2009", "pages": 10}