{"title": "Scalar Prefix Search: A New Route Lookup Algorithm for Next Generation Internet.", "fields": ["prefix code", "ternary search tree", "red black tree", "avl tree", "longest prefix match"], "abstract": "Currently, the increasing rate of routing lookups in Internet routers, the large number of prefixes and also the transition from IPV4 to IPV6, have caused Internet designers to propose new lookup algorithms and try to reduce the memory cost and the prefix search and update procedures times. Recently, some new algorithms are proposed trying to store the prefixes in a balanced tree to reduce the worst case prefix search and update times. These algorithms improve the search and update times compared to previous range based trees. In this paper it is shown that there is no need to treat the prefixes as ranges. It is only required to compare them like scalar values using a predefined rule. The method \"Scalar Prefix Search\" which is presented here, is built on this concept and combining it with the proposed store and search methods, interprets each prefix as a number without any encoding, the need to convert it to the prefix end points or to use the Trie based algorithms whose performance completely depends on IP address length. This method can be applied to many different tree structures. It is implemented using the Binary Search Tree and some other balanced trees such as RB-tree, AVL-tree and B-tree for both IPV4 and IPV6 prefixes. Comparison results show better lookup and update performance or superior storage requirements for Scalar Prefix Search in both average and worst cases, against current solutions like PIBT (1) and LPFST (2). Keywords-Prefix; Scalar; Match; search; update; Lookup", "citation": "Citations (18)", "departments": ["Isfahan University of Technology", "Isfahan University of Technology", "Isfahan University of Technology", "Isfahan University of Technology"], "authors": ["Mohammad Behdadfar.....http://dblp.org/pers/hd/b/Behdadfar:Mohammad", "Hossein Saidi.....http://dblp.org/pers/hd/s/Saidi:Hossein", "Hamid Alaei.....http://dblp.org/pers/hd/a/Alaei:Hamid", "Babak Samari.....http://dblp.org/pers/hd/s/Samari:Babak"], "conf": "infocom", "year": "2009", "pages": 9}