{"title": "Scalable detection of partial near-duplicate videos by visual-temporal consistency.", "fields": ["iterative refinement", "heuristic", "scalability", "flow network", "social media"], "abstract": "Following the exponential growth of social media, there now exist huge repositories of videos online. Among the huge volumes of videos, there exist large numbers of near-duplicate videos. Most existing techniques either focus on the fast retrieval of  full  copies or near-duplicates, or consider localization in a heuristic manner. This paper considers the scalable detection and localization of  partial  near-duplicate videos by jointly considering visual similarity and temporal consistency. Temporal constraints are embedded into a network structure as directed edges. Through the structure, partial alignment is novelly converted into a network flow problem where highly efficient solutions exist. To precisely decide the boundaries of the overlapping segments, pair-wise constraints generated from keypoint matching can be added to the network to iteratively refine the localization result. We demonstrate the effectiveness of partial alignment for three different tasks. The first task links partial segments in full-length movies to videos crawled from YouTube. The second task performs fast web video search, while the third performs near-duplicate shot and copy detection. The experimental result demonstrates the effectiveness and efficiency of the proposed method compared to state-of-the-art techniques.", "citation": "Citations (77)", "departments": ["City University of Hong Kong", "City University of Hong Kong", "National University of Singapore", "National University of Singapore"], "authors": ["Hung-Khoon Tan.....http://dblp.org/pers/hd/t/Tan:Hung=Khoon", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah", "Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2009", "pages": 10}