{"title": "FiConn: Using Backup Port for Server Interconnection in Data Centers.", "fields": ["network switch", "server farm", "data center network architectures", "data center", "node"], "abstract": "The goal of data center networking is to interconnect a large number of server machines with low equipment cost, high and balanced network capacity, and robustness to link/server faults. It is well understood that, the current practice where servers are connected by a tree hierarchy of network switches cannot meet these requirements (8), (9). In this paper, we explore a new server-interconnection struc- ture. We observe that the commodity server machines used in today's data centers usually come with two built-in Ethernet ports, one for network connection and the other left for backup purpose. We believe that, if both ports are actively used in network connections, we can build a low-cost interconnection structure without the expensive higher-level large switches. Our new network design, called FiConn, utilizes both ports and only the low-end commodity switches to form a scalable and highly effective structure. Although the server node degree is only two in this structure, we have proven that FiConn is highly scalable to encompass hundreds of thousands of servers with low diameter and high bisection width. The routing mechanism in FiConn balances different levels of links. We have further developed a low- overhead traffic-aware routing mechanism to improve effective link utilization based on dynamic traffic state. Simulation results have demonstrated that the routing mechanisms indeed achieve high networking throughput.", "citation": "Citations (210)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Dan Li.....http://dblp.org/pers/hd/l/Li_0001:Dan", "Chuanxiong Guo.....http://dblp.org/pers/hd/g/Guo:Chuanxiong", "Haitao Wu.....http://dblp.org/pers/hd/w/Wu:Haitao", "Kun Tan.....http://dblp.org/pers/hd/t/Tan:Kun", "Songwu Lu.....http://dblp.org/pers/hd/l/Lu:Songwu"], "conf": "infocom", "year": "2009", "pages": 10}