{"title": "Delaunay Triangulations in O(sort(n)) Time and More.", "fields": ["sort", "regular polygon", "convex position", "convex polytope", "nearest neighbor graph", "convex combination", "point set triangulation"], "abstract": "We present several results about Delaunay triangulations (DTs) and convex hulls in transdichotomous and hereditary settings: (i) the DT of a planar point set can be computed in expected time  O (sort( n )) on a word RAM, where sort( n ) is the time to sort  n  numbers. We assume that the word RAM supports the  shuffle  operation in constant time; (ii) if we know the ordering of a planar point set in  x - and in  y -direction, its DT can be found by a randomized algebraic computation tree of expected  linear  depth; (iii) given a universe  U  of points in the plane, we construct a data structure  D  for  Delaunay queries : for any  P  s  U ,  D  can find the DT of  P  in expected time  O (v P v log log v U v); (iv) given a universe  U  of points in 3-space in general convex position, there is a data structure  D  for  convex hull queries : for any  P  s  U ,  D  can find the convex hull of  P  in expected time  O (v P v (log log v U v) 2 ); (v) given a convex polytope in 3-space with  n  vertices which are colored with χ g 2 colors, we can split it into the convex hulls of the individual color classes in expected time  O ( n  (log log  n ) 2 ).   The results (i)--(iii) generalize to higher dimensions, where the expected running time now also depends on the complexity of the resulting DT. We need a wide range of techniques. Most prominently, we describe a reduction from DTs to nearest-neighbor graphs that relies on a new variant of randomized incremental constructions using  dependent  sampling.", "citation": "Citations (22)", "departments": ["Eindhoven University of Technology", "Free University of Berlin", "Princeton University", "Dept. of Math.  ... en, Netherlands"], "authors": ["Kevin Buchin.....http://dblp.org/pers/hd/b/Buchin:Kevin", "Wolfgang Mulzer.....http://dblp.org/pers/hd/m/Mulzer:Wolfgang"], "conf": "focs", "year": "2009", "pages": 10}