{"title": "Mining brain region connectivity for alzheimer's disease study via sparse inverse covariance estimation.", "fields": ["estimation of covariance matrices", "coordinate descent", "inverse", "covariance", "structural change"], "abstract": "Effective diagnosis of Alzheimer's disease (AD), the most common type of dementia in elderly patients, is of primary importance in biomedical research. Recent studies have demonstrated that AD is closely related to the structure change of the brain network, i.e., the connectivity among different brain regions. The connectivity patterns will provide useful imaging-based biomarkers to distinguish Normal Controls (NC), patients with Mild Cognitive Impairment (MCI), and patients with AD. In this paper, we investigate the sparse inverse covariance estimation technique for identifying the connectivity among different brain regions. In particular, a novel algorithm based on the block coordinate descent approach is proposed for the direct estimation of the inverse covariance matrix. One appealing feature of the proposed algorithm is that it allows the user feedback (e.g., prior domain knowledge) to be incorporated into the estimation process, while the connectivity patterns can be discovered automatically. We apply the proposed algorithm to a collection of FDG-PET images from 232 NC, MCI, and AD subjects. Our experimental results demonstrate that the proposed algorithm is promising in revealing the brain region connectivity differences among these groups.", "citation": "Citations (38)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Banner Alzheime ... hoenix, AZ, USA"], "authors": ["Liang Sun.....http://dblp.org/pers/hd/s/Sun_0001:Liang", "Rinkal Patel.....http://dblp.org/pers/hd/p/Patel:Rinkal", "Jun Liu.....http://dblp.org/pers/hd/l/Liu_0003:Jun", "Kewei Chen.....http://dblp.org/pers/hd/c/Chen:Kewei", "Teresa Wu.....http://dblp.org/pers/hd/w/Wu:Teresa", "Jing Li.....http://dblp.org/pers/hd/l/Li:Jing", "Eric Reiman.....http://dblp.org/pers/hd/r/Reiman:Eric", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping"], "conf": "kdd", "year": "2009", "pages": 10}