{"title": "Replacing Testing with Formal Verification in Intel CoreTM i7 Processor Execution Engine Validation.", "fields": ["intelligent verification", "runtime verification", "high level verification", "verification", "software verification"], "abstract": "Formal verification of arithmetic datapaths has been part of the estab- lished methodology for most Intel processor designs over the last years, usually in the role of supplementing more traditional coverage oriented testing activities. For the recent Intel Core TM i7 design we took a step further and used formal verification as the primary validation vehicle for the core execution cluster, the component responsible for the functional behaviour of all microinstructions. We applied symbolic simulation based formal verification techniques for full data- path, control and state validation for the cluster, and dropped coverage driven testing entirely. The project, involving some twenty person years of verification work, is one of the most ambitious formal verification efforts in the hardware industry to date. Our experiences show that under the right circumstances, full formal verification of a design component is a feasible, industrially viable and competitive validation approach.", "citation": "Citations (91)", "year": "2009", "departments": ["Intel", "Intel"], "conf": "cav", "authors": ["Roope Kaivola.....http://dblp.org/pers/hd/k/Kaivola:Roope", "Rajnish Ghughal.....http://dblp.org/pers/hd/g/Ghughal:Rajnish", "Naren Narasimhan.....http://dblp.org/pers/hd/n/Narasimhan:Naren", "Amber Telfer.....http://dblp.org/pers/hd/t/Telfer:Amber", "Jesse Whittemore.....http://dblp.org/pers/hd/w/Whittemore:Jesse", "Sudhindra Pandav.....http://dblp.org/pers/hd/p/Pandav:Sudhindra", "Anna Slobodová.....http://dblp.org/pers/hd/s/Slobodov=aacute=:Anna", "Christopher Taylor.....http://dblp.org/pers/hd/t/Taylor:Christopher", "Vladimir A. Frolov.....http://dblp.org/pers/hd/f/Frolov:Vladimir_A=", "Erik Reeber.....http://dblp.org/pers/hd/r/Reeber:Erik", "Armaghan Naik.....http://dblp.org/pers/hd/n/Naik:Armaghan"], "pages": 16}