{"title": "Compiler-assisted dynamic scheduling for effective parallelization of loop nests on multicore processors.", "fields": ["multi core processor", "dynamic priority scheduling", "cholesky decomposition", "lu decomposition", "automatic parallelization"], "abstract": "Recent advances in polyhedral compilation technology have made it feasible to automatically transform affine sequential loop nests for tiled parallel execution on multi-core processors. However, for multi-statement input programs with statements of different dimensionalities, such as Cholesky or LU decomposition, the parallel tiled code generated by existing automatic parallelization approaches may suffer from significant load imbalance, resulting in poor scalability on multi-core systems. In this paper, we develop a completely automatic parallelization approach for transforming input affine sequential codes into efficient parallel codes that can be executed on a multi-core system in a load-balanced manner. In our approach, we employ a compile-time technique that enables dynamic extraction of inter-tile dependences at run-time, and dynamic scheduling of the parallel tiles on the processor cores for improved scalable execution. Our approach obviates the need for programmer intervention and re-writing of existing algorithms for efficient parallel execution on multi-cores. We demonstrate the usefulness of our approach through comparisons using linear algebra computations: LU and Cholesky decomposition.", "citation": "Citations (72)", "year": "2009", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Louisiana State University", "Ohio State University"], "conf": "ppopp", "authors": ["Muthu Manikandan Baskaran.....http://dblp.org/pers/hd/b/Baskaran:Muthu_Manikandan", "Nagavijayalakshmi Vydyanathan.....http://dblp.org/pers/hd/v/Vydyanathan:Nagavijayalakshmi", "Uday Bondhugula.....http://dblp.org/pers/hd/b/Bondhugula:Uday", "J. Ramanujam.....http://dblp.org/pers/hd/r/Ramanujam:J=", "Atanas Rountev.....http://dblp.org/pers/hd/r/Rountev:Atanas", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P="], "pages": 10}