{"title": "Selfish Distributed Compression over Networks.", "fields": ["solution concept", "inefficiency", "price of anarchy", "distributed source coding", "linear network coding"], "abstract": "We consider the min-cost multicast problem (under network coding) with multiple correlated sources where each terminal wants to losslessly reconstruct all the sources. This can be considered as the network generalization of the classical distributed source coding (Slepian-Wolf) problem. We study the inefficiency brought forth by the selfish behavior of the terminals in this scenario by modeling it as a noncooperative game among the terminals. The solution concept that we adopt for this game is the popular local Nash equilibrium (Waldrop equilibrium) adapted for the scenario with multiple sources. The degradation in performance due to the lack of regulation is measured by the price of anarchy (POA), which is defined as the ratio between the cost of the worst possible Waldrop equilibrium and the socially optimum cost. Our main result is that in contrast with the case of independent sources, the presence of source correlations can significantly increase the price of anarchy. Towards establishing this result we make several contributions. We characterize the socially optimal flow and rate allocation in terms of four intuitive conditions. This result is a key technical contribution of this paper and is of independent interest as well. Next, we show that the Waldrop equilibrium is a socially optimal solution for a different set of (related) cost functions. Using this, we construct explicit examples that demonstrate that the POA > 1 and determine near- tight upper bounds on the POA as well. The main techniques in our analysis are Lagrangian duality theory and the usage of the supermodularity of conditional entropy. Finally, all the techniques and results in this paper will naturally extend to a large class of network information flow problems where the Slepian-Wolf polytope is replaced by any contra-polymatroid (or more generally polymatroid-like set), leading to a nice class of succinct multi-player games and allow the investigation of other practical and meaningful s-\ncenarios beyond network coding as well.", "citation": "Citations (4)", "departments": ["Iowa State University", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Aditya Ramamoorthy.....http://dblp.org/pers/hd/r/Ramamoorthy:Aditya", "Vwani P. Roychowdhury.....http://dblp.org/pers/hd/r/Roychowdhury:Vwani_P=", "Sumit K. Singh.....http://dblp.org/pers/hd/s/Singh:Sumit_K="], "conf": "infocom", "year": "2009", "pages": 5}