{"title": "Planarity Allowing Few Error Vertices in Linear Time.", "fields": ["hopcroft karp algorithm", "linkless embedding", "forbidden graph characterization", "book embedding", "polyhedral graph"], "abstract": "We show that for every fixed $k$, there is a linear time algorithm that decides whether or not a given graph has a vertex set $X$ of order at most $k$ such that $G-X$ is planar (we call this class of graphs {\\it $k$-apex}), and if this is the case, computes a drawing of the graph in the plane after deleting at most $k$ vertices. In fact, in this case, we shall determine the minimum value $l \\leq k$such that after deleting some $l$ vertices, the resulting graph is planar. If this is not the case, then the algorithm gives rise to a minor which is not $k$-apex and is minimal with this property. This answers the question posed by Cabello and Mohar in 2005, and by Kawarabayashi and Reed (STOC'07), respectively. Note that the case $k=0$ is the planarity case. Thus our algorithm can be viewed as a generalization of the seminal result by Hopcroft and Tarjan (J. ACM 1974), which determines if a given graph is planar in linear time. Our algorithm can be also compared to the algorithms by Mohar (STOC'96 and Siam J. Discrete Math 2001) for testing the embeddability of an input graph in a fixed surface in linear time, by Kawarabayashi and Mohar (STOC'08) for testing polyhedral embeddability of an input graph in a fixed surface in linear time, and by Kawarabayashi and Reed (STOC'07) for testing the fixed crossing number in linear time. Note that deciding the genus of $k$-apex graphs is NP-complete, even for $k=1$, as shown by Mohar. Thus $k$-apex graphs are very different from bounded genus graphs in a sense.%\\cite{Mo-apex}.In addition, for any fixed $c, k$, we apply our algorithm to obtain a linear time approximation scheme for weighted TSP, and for minimum weighted $c$-edge-connected submultigraph, respectively, for $k$-apex graphs. (In this case, an embedding of a $k$-apex graph is not given in the input). The first result generalizes the recent planar result by Klein (FOCS'05), while the second result generalizes Czumaj et al. (SODA'04). We also extend several optimization results for planar graphs by Baker (J. ACM. 1994) and others to $k$-apex graphs.", "citation": "Citations (27)", "departments": ["Nat. Inst. of I ... otsubasi, Japan"], "authors": ["Ken-ichi Kawarabayashi.....http://dblp.org/pers/hd/k/Kawarabayashi:Ken=ichi"], "conf": "focs", "year": "2009", "pages": 10}