{"title": "Accurate microarchitecture-level fault modeling for studying hardware faults.", "fields": ["fault injection", "stuck at fault", "power system protection", "microarchitecture", "software fault tolerance"], "abstract": "Decreasing hardware reliability is expected to impede the exploitation of increasing integration projected by Moore's Law. There is much ongoing research on efficient fault tolerance mechanisms across all levels of the system stack, from the device level to the system level. High-level fault tolerance solutions, such as at the microarchitecture and system levels, are commonly evaluated using statistical fault injections with microarchitecture-level fault models. Since hardware faults actually manifest at a much lower level, it is unclear if such high level fault models are acceptably accurate. On the other hand, lower level models, such as at the gate level, may be more accurate, but their increased simulation times make it hard to track the system-level propagation of faults. Thus, an evaluation of high-level reliability solutions entails the classical tradeoff between speed and accuracy. This paper seeks to quantify and alleviate this tradeoff. We make the following contributions: (1) We introduce SWAT-Sim, a novel fault injection infrastructure that uses hierarchical simulation to study the system-level manifestations of permanent (and transient) gate-level faults. For our experiments, SWAT-Sim incurs a small average performance overhead of under 3x, for the components we simulate, when compared to pure microarchitectural simulations. (2) We study system-level manifestations of faults injected under different microarchitecture-level and gate-level fault models and identify the reasons for the inability of microarchitecture-level faults to model gate-level faults in general. (3) Based on our analysis, we derive two probabilistic microarchitecture-level fault models to mimic gate-level stuck-at and delay faults. Our results show that these models are, in general, inaccurate as they do not capture the complex manifestation of gate-level faults. The inaccuracies in existing models and the lack of more accurate microarchitecture-level models motivate using infrastructures similar to SWAT-Sim to faithfully model the microarchitecture-level effects of gate-level faults.", "citation": "Citations (106)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Man-Lap Li.....http://dblp.org/pers/hd/l/Li:Man=Lap", "Pradeep Ramachandran.....http://dblp.org/pers/hd/r/Ramachandran:Pradeep", "Ulya R. Karpuzcu.....http://dblp.org/pers/hd/k/Karpuzcu:Ulya_R=", "Siva Kumar Sastry Hari.....http://dblp.org/pers/hd/h/Hari:Siva_Kumar_Sastry", "Sarita V. Adve.....http://dblp.org/pers/hd/a/Adve:Sarita_V="], "conf": "hpca", "year": "2009", "pages": 12}