{"title": "Network Performance Anomaly Detection and Localization.", "fields": ["selection algorithm", "jitter", "local algorithm", "simultaneous localization and mapping", "anomaly detection"], "abstract": "Detecting the occurrence and location of performance anomalies (e.g., high jitter or loss events) is critical to ensuring the effective operation of network infrastructures. In this paper we present a framework for detecting and localizing performance anomalies based on using an active probe-enabled measurement infrastructure deployed on the periphery of a network. Our framework has three components: an algorithm for detecting performance anomalies on a path, an algorithm for selecting which paths to probe at a given time in order to detect performance anomalies (where a path is defined as the set of links between two measurement nodes), and an algorithm for identifying the links that are causing an identified anomaly on a path (i.e., localizing). The problem of detecting an anomaly on a path is addressed by comparing probe-based measures of performance characteristics with performance guarantees for the network (e.g., SLAs). The path selection algorithm is designed to enable a tradeoff between ensuring that all links in a network are frequently monitored to detect performance anomalies, while minimizing probing overhead. The localization algorithm is designed to use existing path measurement data in such a way as to minimize the number of paths necessary for additional probing in order to identify the link(s) responsible for an observed performance anomaly. We assess the feasibility of our framework and algorithms by implementing them in ns-2 and conducting a set of simulation-based experiments using several different network topologies. Our results show that our method is able to accurately detect and localize performance anomalies in a timely fashion and with lower probe and computational overheads than previously proposed methodologies.", "citation": "Citations (107)", "departments": ["University of Wisconsin-Madison", "AT&T", "University of Wisconsin-Madison", "Colgate University"], "authors": ["Paul Barford.....http://dblp.org/pers/hd/b/Barford:Paul", "Nick G. Duffield.....http://dblp.org/pers/hd/d/Duffield:Nick_G=", "Amos Ron.....http://dblp.org/pers/hd/r/Ron:Amos", "Joel Sommers.....http://dblp.org/pers/hd/s/Sommers:Joel"], "conf": "infocom", "year": "2009", "pages": 9}