{"title": "Large-scale privacy protection in Google Street View.", "fields": ["face detection", "operating point", "information privacy", "license", "facial recognition system"], "abstract": "The last two years have witnessed the introduction and rapid expansion of products based upon large, systematically-gathered, street-level image collections, such as Google Street View, EveryScape, and Mapjack. In the process of gathering images of public spaces, these projects also capture license plates, faces, and other information considered sensitive from a privacy standpoint. In this work, we present a system that addresses the challenge of automatically detecting and blurring faces and license plates for the purpose of privacy protection in Google Street View. Though some in the field would claim face detection is “solved”, we show that state-of-the-art face detectors alone are not sufficient to achieve the recall desired for large-scale privacy protection. In this paper we present a system that combines a standard sliding-window detector tuned for a high recall, low-precision operating point with a fast post-processing stage that is able to remove additional false positives by incorporating domain-specific information not available to the sliding-window detector. Using a completely automatic system, we are able to sufficiently blur more than 89% of faces and 94 – 96% of license plates in evaluation sets sampled from Google Street View imagery.", "citation": "Citations (149)", "year": "2009", "departments": ["Google", "Google", "Google", "Google", "Google"], "conf": "iccv", "authors": ["Andrea Frome.....http://dblp.org/pers/hd/f/Frome:Andrea", "German Cheung.....http://dblp.org/pers/hd/c/Cheung:German", "Ahmad Abdulkader.....http://dblp.org/pers/hd/a/Abdulkader:Ahmad", "Marco Zennaro.....http://dblp.org/pers/hd/z/Zennaro:Marco", "Bo Wu.....http://dblp.org/pers/hd/w/Wu_0001:Bo", "Alessandro Bissacco.....http://dblp.org/pers/hd/b/Bissacco:Alessandro", "Hartwig Adam.....http://dblp.org/pers/hd/a/Adam:Hartwig", "Hartmut Neven.....http://dblp.org/pers/hd/n/Neven:Hartmut", "Luc Vincent.....http://dblp.org/pers/hd/v/Vincent:Luc"], "pages": 8}