{"title": "Understanding the Performance Gap Between Pull-Based Mesh Streaming Protocols and Fundamental Limits.", "fields": ["graph", "server", "linear network coding", "performance gap", "periodic graph"], "abstract": "Pull-based mesh streaming protocols have recently received much research attention, with successful commercial systems showing their viability in the Internet. Despite the remarkable popularity in real-world systems, the fundamental properties and limitations of pull-based protocols are not yet well understood from a theoretical perspective, as there exists no prior work that studies the performance gap between the fundamental limits and the actual performance. In this paper, we develop a unified framework based on trellis graph techniques to mathematically analyze and understand the performance of pull-based mesh streaming protocols, with a particular focus on such a performance gap. We show that there exists a significant performance gap that separates the actual and optimal performance of pull-based mesh protocols. Moreover, periodic buffer map exchanges account for most of this performance gap. Our analytical characterization of the performance gap brings us not only a better understanding of several fundamental tradeoffs in pull-based mesh protocols, but also important insights on the design of practical streaming systems that can achieve high streaming rates and short initial buffering delays. segments are pulled from appropriate neighbors, in order to meet their playback deadlines. Compared to push-based tree strategies, pull-based mesh strategies take advantage of the philosophy that gossiping segment availability is more resilient to peer dynamics and simpler to implement, which is com- monly adopted in BitTorrent-like file swarming systems. How- ever, such an advantage is achieved at the cost of increased delay of distributing streaming content to all participating peers, due to delays caused by periodic buffer map exchanges (3). Nevertheless, most real-world systems (e.g., PPLive) are implemented using pull-based mesh strategies, mainly due to their simplicity. Despite the remarkable popularity in real-world systems, a number of fundamental questions on pull-based mesh proto- cols are not yet well understood from a theoretical perspective: What are the fundamental limits of the performance of pull- based mesh protocols? How large is the gap between the fundamental limits and the actual performance? What factors account for most of the gap separating the actual and optimal performance of pull-based mesh protocols? In this paper, we seek to mathematically analyze and understand the perfor- mance of pull-based mesh protocols, with a particular focus on these important questions. To achieve this objective, we have developed a unified theoretical framework based on the concept of trellis graphs (4) and provided a number of new analytical results along this direction. With trellis graph techniques that have been traditionally used in the network coding literature (4), we have unified the treatment on the analysis of the fundamental limits and the actual performance of pull-based mesh protocols. This provides a solid theoretical foundation for the characterization of the performance gap between the fundamental limits and the actual performance. We perform an in-depth study of several important factors that account for the performance gap and quantify their impact on the performance of pull-based mesh protocols. Our analytical results show that there exists a significant performance gap between the fundamental limits and the actual performance of pull-based mesh protocols. Moreover, periodic buffer map exchanges account for most of the gap that separates the actual and optimal performance. To our knowledge, there has been no existing work in the literature that provides a thorough analytical understanding of pull-based mesh protocols, with a particular focus on both fundamental limits and the performance gap.", "citation": "Citations (72)", "departments": ["University of Toronto", "University of Toronto"], "authors": ["Chen Feng.....http://dblp.org/pers/hd/f/Feng:Chen", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2009", "pages": 9}