{"title": "On the Exploitation of CDF Based Wireless Scheduling.", "fields": ["fair share scheduling", "denial of service attack", "channel allocation schemes", "cumulative distribution function", "channel capacity", "throughput", "channel", "code division multiple access"], "abstract": "Channel-aware scheduling strategies - such as the CDF Scheduler (CS) algorithm for the CDMA/HDR systems - provide an effective mechanism for utilizing the channel data rate for improving throughput performance in wireless data networks by exploiting channel fluctuations. A highly desired property of such a scheduling strategy is that its algorithm will be stable, in the sense that no user has incentive \"cheating\" the algorithm in order to increase his/her channel share (on the account of others). We present a scheme by which coordination allows a group of users to gain permanent increase in both their time slot share and in their throughput, on the expense of others, by misreporting their rates. We show that for large populations consisting of regular and coordinated users in equal numbers, the ratio of allocated time slots between a coordinated user and a regular one converges to e - 1 ap 1.7. Our scheme targets the very fundamental principle of CS (as opposed to just attacking implementation aspects), which bases its scheduling decisions on the cumulative distribution function (CDF) of the channel rates reported by users. Our scheme works both for the continuous channel spectrum and the discrete channel spectrum versions of the problem.", "citation": "Citations (14)", "departments": ["Tel Aviv University", "Interdisciplinary Center Herzliya", "Tel Aviv University", "ETH Zurich", "Interdisciplinary Center Herzliya", "Tel Aviv University"], "authors": ["Udi Ben-Porat.....http://dblp.org/pers/hd/b/Ben=Porat:Udi", "Anat Bremler-Barr.....http://dblp.org/pers/hd/b/Bremler=Barr:Anat", "Hanoch Levy.....http://dblp.org/pers/hd/l/Levy:Hanoch"], "conf": "infocom", "year": "2009", "pages": 5}