{"title": "Considerations for Sizing Buffers in Optical Packet Switched Networks.", "fields": ["tcp global synchronization", "optical buffer", "tcp tuning", "tcp friendly rate control", "tcp acceleration"], "abstract": "Optical packet switches of the foreseeable future are expected to have severely limited buffering capability, since storage of optical signals remains a difficult and expensive operation. Our observations in simulation of TCP and real- time traffic in networks with such small buffers have revealed regions of anomalous performance in which losses for real-time traffic become higher as buffers get larger. The detrimental impact of larger optical buffers is studied in this paper and three new contributions are made. First, we develop a Markov chain model that allows analytical computation of loss. Our model validates observations from simulation, and opens the doors to an analytical understanding of how various factors affect the anomaly. Second, we study the anomaly under realistic traffic mixes containing persistent and non-persistent TCP flows, and show that the traffic mix does not significantly alter the anomaly. Third, we show that larger diversity in packet size between TCP and real-time traffic increases the severity of the anomaly, and is an important consideration when sizing optical switch buffers, particularly since real-time and TCP ACK packets are significantly smaller than the TCP data packets. Our study informs switch manufacturers and network operators of factors to consider when selecting optical buffer sizes in order to achieve desired performance balance between TCP and real-time traffic.", "citation": "Citations (28)", "departments": ["University of New South Wales", "University of New South Wales", "North Carolina State University"], "authors": ["Arun Vishwanath.....http://dblp.org/pers/hd/v/Vishwanath:Arun", "Vijay Sivaraman.....http://dblp.org/pers/hd/s/Sivaraman:Vijay", "George N. Rouskas.....http://dblp.org/pers/hd/r/Rouskas:George_N="], "conf": "infocom", "year": "2009", "pages": 9}