{"title": "Somnambule.", "fields": ["art", "psychology", "psychoanalysis", "performance art", "philosophy", "medicine", "surgery", "dream", "anesthesia", "history"], "abstract": "Objectif  Les somnambules presentent une instabilite du sommeil lent, en particulier du stade N3. L’activite des fuseaux du sommeil est precisement correlee a la stabilite du sommeil, mais cet outil n’a ete que rarement utilise chez les somnambules. Ce travail avait pour objectif de comparer l’activite des fuseaux en N3 des somnambules avec celle de sujets controles.    Methodes  Dix somnambules associes a 10 sujets sains controles pour l’âge et le sexe ont ete analyses. Un enregistrement de base et un enregistrement apres privation de sommeil de 38 heures ont ete realises. Les densites des fuseaux (11–16 Hz) ont ete mesurees automatiquement durant les stades N3 par des logiciels bases sur le filtrage et le seuillage du signal electroencephalographie a partir des derivations F3, C3 et P3 du systeme 10/20. Les densites de fuseaux en N3 durant le premier cycle de sommeil et pour l’ensemble de la nuit ont ete comparees entre les somnambules et les controles.    Resultats  Les somnambules ont presente une densite de fuseaux en N3 significativement plus basse que les controles durant le premier cycle de sommeil (1,56/min versus 2,22/min,  p  = 0,009) et durant l’ensemble de la nuit (1,50/min versus 1,86/min,  p  = 0,004). La privation de sommeil n’a pas affecte la difference de densites de fuseaux en N3 entre les somnambules et les controles.    Conclusion  Ces resultats suggerent que l’instabilite du sommeil lent chez les somnambules pourrait etre sous-tendue par une alteration quantitative de l’activite des fuseaux du sommeil.", "citation": "Not cited", "departments": ["CHU de Nancy, S ... , Nancy, France", "Centre d’Études ... ontréal, Canada", "Centre d’Études ... ontréal, Canada", "Centre d’Études ... ontréal, Canada", "Centre d’Études ... ontréal, Canada"], "authors": ["Kévin Sillam.....http://dblp.org/pers/hd/s/Sillam:K=eacute=vin", "Annie Luciani.....http://dblp.org/pers/hd/l/Luciani:Annie"], "conf": "mm", "year": "2009", "pages": 4}