{"title": "(Meta) Kernelization.", "fields": ["planar graph", "treewidth", "polynomial kernel", "dominating set", "bounded function", "kernelization", "covering problems"], "abstract": "Polynomial time preprocessing to reduce instance size is one of the most commonly deployed heuristics to tackle computationally hard problems. In a parameterized problem, every instance I comes with a positive integer k. The problem is said to admit a polynomial kernel if, in polynomial time, we can reduce the size of the instance I to a polynomial in k, while preserving the answer. In this paper, we show that all problems expressible in Counting Monadic Second Order Logic and satisfying a compactness property admit a polynomial kernel on graphs of bounded genus. Our second result is that all problems that have finite integer index and satisfy a weaker compactness condition admit a linear kernel on graphs of bounded genus. The study of kernels on planar graphs was initiated by a seminal paper of Alber, Fellows, and Niedermeier [J. ACM, 2004 ] who showed that Planar Dominating Set admits a linear kernel. Following this result, a multitude of problems have been shown to admit linear kernels on planar graphs by combining the ideas of Alber et al. with problem specific reduction rules. Our theorems unify and extend all previously known kernelization results for planar graph problems. Combining our theorems with the Erdos-Posa property we obtain various new results on linear kernels for a number of packing and covering problems.", "citation": "Citations (229)", "departments": ["Utrecht University", "University of Bergen", "University of Bergen", "Utrecht University", "University of Bergen", "Eindhoven University of Technology", "University of Bergen", "University of Bergen", "Utrecht University", "University of Bergen"], "authors": ["Hans L. Bodlaender.....http://dblp.org/pers/hd/b/Bodlaender:Hans_L=", "Fedor V. Fomin.....http://dblp.org/pers/hd/f/Fomin:Fedor_V=", "Daniel Lokshtanov.....http://dblp.org/pers/hd/l/Lokshtanov:Daniel", "Eelko Penninkx.....http://dblp.org/pers/hd/p/Penninkx:Eelko", "Saket Saurabh.....http://dblp.org/pers/hd/s/Saurabh_0001:Saket", "Dimitrios M. Thilikos.....http://dblp.org/pers/hd/t/Thilikos:Dimitrios_M="], "conf": "focs", "year": "2009", "pages": 10}