{"title": "Ordering, distinctness, aggregation, partitioning and DQP optimization in sybase ASE 15.", "fields": ["parallel processing", "enforcement", "relational database management system", "relocation", "query optimization"], "abstract": "The Sybase ASE RDBMS version 15 was subject to major enhancements, including semantic partitions and a full QP rewrite. The new ASE QP supports horizontal and vertical parallel processing over semantically partitioned tables, and many other modern QP techniques, as cost-based eager aggregation and cost-based join relocation DQP. In the new query optimizer, the ordering, distinctness, aggregation, partitioning, and DQP optimizations were based on a common framework: plan fragment equivalence classes and logical properties. Our main outcomes are a) an eager enforcement policy for ordering, partitioning and DQP location; b) a distinctness and aggregation optimization policy, opportunistically based on the eager ordering enforcement, and which has an optimization-time computational complexity similar to join processing; c) support for the user to force all of the above optimizer decisions, still guaranteeing a valid plan, based on the Abstract Plan technology. We describe the implementation of this solution in the ASE 15 optimizer. Finally, we give our experimental results: the generation of such complex plans comes with a small increase of the optimizer's SS size, hence within an acceptable optimization time; at execution, we have obtained performance improvements of orders of magnitude for some queries.", "citation": "Not cited", "year": "2009", "departments": ["Sybase", "Sybase", "Sybase", "Sybase", "Sybase"], "conf": "sigmod", "authors": ["Mihnea Andrei.....http://dblp.org/pers/hd/a/Andrei:Mihnea", "Xun Cheng.....http://dblp.org/pers/hd/c/Cheng:Xun", "Sudipto Chowdhuri.....http://dblp.org/pers/hd/c/Chowdhuri:Sudipto", "Curtis Johnson.....http://dblp.org/pers/hd/j/Johnson:Curtis", "Edwin Seputis.....http://dblp.org/pers/hd/s/Seputis:Edwin"], "pages": 8}