{"title": "Capabilities of Low-Power Wireless Jammers.", "fields": ["network packet", "authentication", "jamming", "corruption", "wireless network"], "abstract": "In this paper, motivated by the goal of modeling the fine-grain capabilities of jammers for the context of security in low-power wireless networks, we experimentally characterize jamming in networks of CC2420 radio motes and CC1000 radio motes. Our findings include that it is easy to locate J (relative to S and R) and choose its power level so that J can corrupt S's messages with high probability as well as corrupt individual S's bits with nontrivial probability. Internal jammers are however limited in at least two ways: One, it is hard for them to prevent R from detecting that it has received an uncorrupted message from S. And two, the outcome of their corruptions are not only not deterministic, even the probabilities of corrupted outcomes are time-varying. We therefore conclude that it is hard to predict the value resulting from colliding S's messages (bits) with J's messages (bits) and, conversely, to deduce the value sent by S's or J's from the corrupted value received by R. I. INTRODUCTION Interference has been extensively explored in the wireless network community for decades. It is typically considered a negative fact in the network. In contrast, several recent work (1), (6) show that it can also be exploited in cooperative settings to hide communications for security purpose. How- ever, there has been no systematic study on the capability of intentional interference (i.e., jamming) towards that goal. In this paper, we study the fine-grain abilities of jamming in low power wireless networks to successfully prevent and hide communications. Since jamming that is external to a network can be arbitrar- ily complex, we limit our attention in this paper to the case of self-jamming, where one or more nodes internal to the network collude to jam communications. The limited case is still of practical interest, not only because the resulting jamming abilities can be inherited by external environments, but also because in-network attacks are becoming increasingly plausi- ble as wireless networks evolve to supporting applications that are launched remotely and may therefore be compromised by remote attacks or applications that are not fully trusted. The fine-grain jamming capabilities we study in this paper focus on questions of corruption: How can J predictably corrupt the wireless communications from S to R ?C anJ force the corruption, with or without knowledge of the communications of S, so that the resulting value at R is predictable? Likewise, can J force the corruption so that the value sent by S or J can be recovered from the resulting value at R ?A nswers to these questions have important roles to play in the integrity, authentication, and confidentiality of communications in low- power wireless networks. Contributions. Our answers are based on both analysis and experiments on corruption at the level of bits as well as of packets. Our experiments use a simple protocol to implement internal jamming in CC2420 radio motes and", "citation": "Citations (19)", "departments": ["Ohio State University", "Ohio State University"], "authors": ["Lifeng Sang.....http://dblp.org/pers/hd/s/Sang:Lifeng", "Anish Arora.....http://dblp.org/pers/hd/a/Arora:Anish"], "conf": "infocom", "year": "2009", "pages": 5}