{"title": "Universal Blind Quantum Computation.", "fields": ["quantum cryptography", "quantum sort", "quantum algorithm", "quantum mechanics", "quantum computer", "bqp", "mathematics", "quantum network", "authentication protocol"], "abstract": "We present a protocol which allows a client to have a server carry out a quantum computation for her such that the client's inputs, outputs and computation remain perfectly private, and where she does not require any quantum computational power or memory. The client only needs to be able to prepare single qubits randomly chosen from a finite set and send them to the server, who has the balance of the required quantum computational resources. Our protocol is interactive: after the initial preparation of quantum states, the client and server use two-way classical communication which enables the client to drive the computation, giving single-qubit measurement instructions to the server, depending on previous measurement outcomes. Our protocol works for inputs and outputs that are either classical or quantum. We give an authentication protocol that allows the client to detect an interfering server; our scheme can also be made fault-tolerant. We also generalize our result to the setting of a purely classical client who communicates classically with two non-communicating entangled servers, in order to perform a blind quantum computation. By incorporating the authentication protocol, we show that any problem in BQP has an entangled two-prover interactive proof with a purely classical verifier. Our protocol is the first universal scheme which detects a cheating server, as well as the first protocol which does not require any quantum computation whatsoever on the client's side. The novelty of our approach is in using the unique features of measurement-based quantum computing which allows us to clearly distinguish between the quantum and classical aspects of a quantum computation.", "citation": "Not cited", "departments": ["University of Waterloo", "University of Waterloo", "University of Edinburgh"], "authors": ["Anne Broadbent.....http://dblp.org/pers/hd/b/Broadbent:Anne", "Joseph F. Fitzsimons.....http://dblp.org/pers/hd/f/Fitzsimons:Joseph_F=", "Elham Kashefi.....http://dblp.org/pers/hd/k/Kashefi:Elham"], "conf": "focs", "year": "2009", "pages": 10}