{"title": "An active learning approach for segmenting human activity datasets.", "fields": ["semi supervised learning", "supervised learning", "scale space segmentation", "active learning"], "abstract": "Human activity datasets collected under natural conditions are an important source of data. Since these contain multiple activities in unscripted sequence, temporal segmentation of multimodal datasets is an important precursor to recognition and analysis. Manual segmentation is prohibitively time consuming and unsupervised approaches for segmentation are unreliable since they fail to exploit the semantic context of the data. Gathering labels for supervised learning places a large workload on the human user since it is relatively easy to gather a mass of unlabeled data but expensive to annotate. This paper proposes an active learning approach for segmenting large motion capture datasets with both small training sets and working sets. Support Vector Machines (SVMs) are learned using an active learning paradigm; after the classifiers are initialized with a small set of labeled data, the users are iteratively queried for labels as needed. We propose a novel method for initializing the classifiers, based on unsupervised segmentation and clustering of the dataset. By identifying and training the SVM with points from pure clusters, we can improve upon a random sampling strategy for creating the query set. Our active learning approach improves upon the initial unsupervised segmentation used to initialize the classifier, while requiring substantially less data than a fully supervised method; the resulting segmentation is comparable to the latter while requiring significantly less effort from the user.", "citation": "Citations (4)", "departments": ["University of Central Florida", "University of Central Florida"], "authors": ["Liyue Zhao.....http://dblp.org/pers/hd/z/Zhao:Liyue", "Gita Sukthankar.....http://dblp.org/pers/hd/s/Sukthankar:Gita"], "conf": "mm", "year": "2009", "pages": 4}