{"title": "Dynamic plan generation for parameterized queries.", "fields": ["materialized view", "exploit", "cache", "sargable", "parameterized complexity"], "abstract": "Query processing in a DBMS typically involves two distinct phases: compilation, which generates the best plan and its corresponding execution steps, and execution, which evaluates these steps against database objects. For some queries, considerable resource savings can be achieved by skipping the compilation phase when the same query was previously submitted and its plan was already cached. In a number of important applications the same query, called a Parameterized Query (PQ), is repeatedly submitted in the same basic form but with different parameter values. PQ's are extensively used in both data update (e.g. batch update programs) and data access queries. There are tradeoffs associated with caching and re-using query plans such as space utilization and maintenance cost. Besides, pre-compiled plans may be suboptimal for a particular execution due to various reasons including data skew and inability to exploit value-based query transformation like materialized view rewrite and unsatisfiable predicate elimination. We address these tradeoffs by distinguishing two types of plans for PQ's: generic and specific plans. Generic plans are pre-compiled plans that are independent of the actual parameter values. Prior to execution, parameter values are plugged in to generic plans. In specific plans, parameter values are plugged prior to the compilation phase. This paper provides a practical framework for dynamically deciding between specific and generic plans for PQ's based on a mix of rule and cost based heuristics which are implemented in the Teradata 12.0 DBMS.", "citation": "Citations (17)", "year": "2009", "departments": ["Teradata", "Teradata", "Teradata", "Teradata", "Teradata"], "conf": "sigmod", "authors": ["Ahmad Ghazal.....http://dblp.org/pers/hd/g/Ghazal:Ahmad", "Dawit Yimam Seid.....http://dblp.org/pers/hd/s/Seid:Dawit_Yimam", "Ramesh Bhashyam.....http://dblp.org/pers/hd/b/Bhashyam:Ramesh", "Alain Crolotte.....http://dblp.org/pers/hd/c/Crolotte:Alain", "Manjula Koppuravuri.....http://dblp.org/pers/hd/k/Koppuravuri:Manjula", "Vinod G.....http://dblp.org/pers/hd/g/G:Vinod"], "pages": 8}