{"title": "Forward Decay: A Practical Time Decay Model for Streaming Systems.", "fields": ["data warehouse", "temporal database", "data stream management system", "exponential decay", "tuple"], "abstract": "Temporal data analysis in data warehouses and datastreaming systems often uses time decay to reduce the importance of older tuples, without eliminating their influence, on the results of the analysis. While exponential time decay is commonly used in practice, other decay functions (e.g. polynomial decay) are not, even though they have been identified as useful. We argue that this is because the usual definitions of time decay are \"backwards\": the decayed weight of a tuple is based on its age, measured backward from the current time. Since this age is constantly changing, such decay is too complex and unwieldy for scalable implementation. In this paper, we propose a new class of \"forward\" decay functions based on measuring forward from a fixed point in time. We show that this model captures the more practical models already known, such as exponential decay and landmark windows, but also includes a wide class of other types of time decay. We provide efficient algorithms to compute a variety of aggregates and draw samples under forward decay, and show that these are easy to implement scalably. Further, we provide empirical evidence that these can be executed in a production data stream management system with little or no overhead compared to the undecayed computations. Our implementation required no extensions to the query language or the DSMS, demonstrating that forward decay represents a practical model of time decay for systems that deal with time-based data.", "citation": "Citations (84)", "departments": ["AT&T Labs", "AT&T Labs", "AT&T Labs", "Iowa State University"], "authors": ["Graham Cormode.....http://dblp.org/pers/hd/c/Cormode:Graham", "Vladislav Shkapenyuk.....http://dblp.org/pers/hd/s/Shkapenyuk:Vladislav", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh", "Bojian Xu.....http://dblp.org/pers/hd/x/Xu:Bojian"], "conf": "icde", "year": "2009", "pages": 12}