{"title": "Voltage emergency prediction: Using signatures to reduce operating margins.", "fields": ["oracle", "operating margin", "threshold voltage", "microarchitecture", "superscalar"], "abstract": "Inductive noise forces microprocessor designers to sacrifice performance in order to ensure correct and reliable operation of their designs. The possibility of wide fluctuations in supply voltage means that timing margins throughout the processor must be set pessimistically to protect against worst-case droops and surges. While sensor-based reactive schemes have been proposed to deal with voltage noise, inherent sensor delays limit their effectiveness. Instead, this paper describes a voltage emergency predictor that learns the signatures of voltage emergencies (the combinations of control flow and microarchitectural events leading up to them) and uses these signatures to prevent recurrence of the corresponding emergencies. In simulations of a representative superscalar microprocessor in which fluctuations beyond 4% of nominal voltage are treated as emergencies (an aggressive configuration), these signatures can pinpoint the likelihood of an emergency some 16 cycles ahead of time with 90% accuracy. This lead time allows machines to operate with much tighter voltage margins (4% instead of 13%) and up to 13.5% higher performance, which closely approaches the 14.2% performance improvement possible with an ideal oracle-based predictor.", "citation": "Citations (86)", "departments": ["Harvard University", "Harvard University", "Harvard University", "Harvard University", "Harvard University"], "authors": ["Vijay Janapa Reddi.....http://dblp.org/pers/hd/r/Reddi:Vijay_Janapa", "Meeta Sharma Gupta.....http://dblp.org/pers/hd/g/Gupta:Meeta_Sharma", "Glenn H. Holloway.....http://dblp.org/pers/hd/h/Holloway:Glenn_H=", "Gu-Yeon Wei.....http://dblp.org/pers/hd/w/Wei:Gu=Yeon", "Michael D. Smith.....http://dblp.org/pers/hd/s/Smith_0001:Michael_D=", "David M. Brooks.....http://dblp.org/pers/hd/b/Brooks:David_M="], "conf": "hpca", "year": "2009", "pages": 12}