{"title": "Distinct Counting with a Self-Learning Bitmap.", "fields": ["computational statistics", "counting problem", "bitmap", "probabilistic logic", "binary number", "invariant", "cardinality", "memory management"], "abstract": "Estimating the number of distinct values is a fundamental problem in database that has attracted extensive research over the past two decades, due to its wide applications (especially in the Internet). Many algorithms have been proposed via sampling or sketching for obtaining statistical estimates that only require limited computing and memory resources. However, their performance in terms of relative estimation accuracy usually depends on the unknown cardinalities. In this paper, we address the following question: can a distinct counting algorithm have uniformly reliable performance, i.e. constant relative estimation errors for unknown cardinalities in a wide range, say from tens to millions? We propose a self-learning bitmap algorithm (S-bitmap) to answer this question. The S-bitmap is a bitmap obtained via a novel adaptive sampling process, where the bits corresponding to the sampled items are set to 1, and the sampling rates are learned from the number of distinct items already passed and reduced sequentially as more bits are set to 1.A unique property of S-bitmap is that its relative estimation error is truly stabilized, i.e. invariant to unknown cardinalities in a prescribed range. We demonstrate through both theoretical and empirical studies that with a given memory requirement, S-bitmap is not only uniformly reliable but more accurate than state-of-the-art algorithms such as the multiresolution bitmap \\cite{bitmap:2006} and Hyper LogLog algorithms \\cite{flajolet.et.al.07} under common practice settings.", "citation": "Citations (12)", "departments": ["Bell Labs", "Bell Labs"], "authors": ["Aiyou Chen.....http://dblp.org/pers/hd/c/Chen:Aiyou", "Jin Cao.....http://dblp.org/pers/hd/c/Cao:Jin"], "conf": "icde", "year": "2009", "pages": 4}