{"title": "Descriptive visual words and visual phrases for image applications.", "fields": ["human visual system model", "visualrank", "visual objects", "bag of words model in computer vision", "visual word"], "abstract": "The Bag-of-visual Words (BoW) image representation has been applied for various problems in the fields of multimedia and computer vision. The basic idea is to represent images as visual documents composed of repeatable and distinctive visual elements, which are comparable to the words in texts. However, massive experiments show that the commonly used visual words are not as expressive as the text words, which is not desirable because it hinders their effectiveness in various applications. In this paper, Descriptive Visual Words (DVWs) and Descriptive Visual Phrases (DVPs) are proposed as the visual correspondences to text words and phrases, where visual phrases refer to the frequently co-occurring visual word pairs. Since images are the carriers of visual objects and scenes, novel descriptive visual element set can be composed by the visual words and their combinations which are effective in representing certain visual objects or scenes. Based on this idea, a general framework is proposed for generating DVWs and DVPs from classic visual words for various applications. In a large-scale image database containing 1506 object and scene categories, the visual words and visual word pairs descriptive to certain scenes or objects are identified as the DVWs and DVPs. Experiments show that the DVWs and DVPs are compact and descriptive, thus are more comparable with the text words than the classic visual words. We apply the identified DVWs and DVPs in several applications including image retrieval, image re-ranking, and object recognition. The DVW and DVP combination outperforms the classic visual words by 19.5% and 80% in image retrieval and object recognition tasks, respectively. The DVW and DVP based image re-ranking algorithm: DWPRank outperforms the state-of-the-art VisualRank by 12.4% in accuracy and about 11 times faster in efficiency.", "citation": "Citations (259)", "departments": ["Chinese Academy of Sciences", "Microsoft", "Microsoft", "Chinese Academy of Sciences", "Microsoft"], "authors": ["Shiliang Zhang.....http://dblp.org/pers/hd/z/Zhang:Shiliang", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi", "Gang Hua.....http://dblp.org/pers/hd/h/Hua:Gang", "Qingming Huang.....http://dblp.org/pers/hd/h/Huang:Qingming", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2009", "pages": 10}