{"title": "Non-malleable extractors and symmetric key cryptography from weak secrets.", "fields": ["distributed computing", "security parameter", "information theoretic security", "random seed", "symmetric key algorithm", "computer science", "key agreement protocol", "theoretical computer science"], "abstract": "We study the question of basing symmetric key cryptography on weak secrets. In this setting, Alice and Bob share an n-bit secret W, which might not be uniformly random, but the adversary has at least k bits of uncertainty about it (formalized using conditional min-entropy). Since standard symmetric-key primitives require uniformly random secret keys, we would like to construct an authenticated key agreement protocol in which Alice and Bob use W to agree on a nearly uniform key R, by communicating over a public channel controlled by an active adversary Eve. We study this question in the information theoretic setting where the attacker is computationally unbounded. We show that single-round (i.e. one message) protocols do not work when k ≤ n/2, and require poor parameters even when n/2   On the other hand, for arbitrary values of k, we design a communication efficient two-round (challenge-response) protocol extracting nearly k random bits. This dramatically improves the previous construction of Renner and Wolf [32], which requires Θ(λ + log(n)) rounds where λ is the security parameter. Our solution takes a new approach by studying and constructing  \"non-malleable\" seeded randomness extractors  -- if an attacker sees a random seed X and comes up with an arbitrarily related seed X', then we bound the relationship between R= Ext(W;X) and R' = Ext(W;X').   We also extend our two-round key agreement protocol to the \"fuzzy\" setting, where Alice and Bob share \"close\" (but not equal) secrets W A  and W B , and to the Bounded Retrieval Model (BRM) where the size of the secret W is huge.", "citation": "Citations (112)", "departments": ["New York University", "New York Unvier ... w York, NY, USA"], "authors": ["Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "conf": "stoc", "year": "2009", "pages": 10}