{"title": "Semantic context transfer across heterogeneous sources for domain adaptive video search.", "fields": ["exploit", "trecvid", "test data", "wordnet", "semantic search"], "abstract": "Automatic video search based on semantic concept detectors has recently received significant attention. Since the number of available detectors is much smaller than the size of human vocabulary, one major challenge is to select appropriate detectors to response user queries. In this paper, we propose a novel approach that leverages heterogeneous knowledge sources for domain adaptive video search. First, instead of utilizing WordNet as most existing works, we exploit the context information associated with Flickr images to estimate query-detector similarity. The resulting measurement, named Flickr context similarity (FCS), reflects the co-occurrence statistics of words in image context rather than textual corpus. Starting from an initial detector set determined by FCS, our approach novelly transfers semantic context learned from test data domain to adaptively refine the query-detector similarity. The semantic context transfer process provides an effective means to cope with the domain shift between external knowledge source (e.g., Flickr context) and test data, which is a critical issue in video search. To the best of our knowledge, this work represents the first research aiming to tackle the challenging issue of domain change in video search. Extensive experiments on 120 textual queries over TRECVID 2005-2008 data sets demonstrate the effectiveness of semantic context transfer for domain adaptive video search. Results also show that the FCS is suitable for measuring query-detector similarity, producing better performance to various other popular measures.", "citation": "Citations (68)", "departments": ["City University of Hong Kong", "City University of Hong Kong", "Columbia University"], "authors": ["Yu-Gang Jiang.....http://dblp.org/pers/hd/j/Jiang:Yu=Gang", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "conf": "mm", "year": "2009", "pages": 10}