{"title": "Liquid water: obtaining the right answer for the right reasons.", "fields": ["partitioned global address space", "coupled cluster", "basis set", "intermolecular force", "experimental data"], "abstract": "Water is ubiquitous on our planet and plays an essential role in several key chemical and biological processes. Accurate models for water are crucial in understanding, controlling and predicting the physical and chemical properties of complex aqueous systems. Over the last few years we have been developing a molecular-level based approach for a macroscopic model for water that is based on the explicit description of the underlying intermolecular interactions between molecules in water clusters. In the absence of detailed experimental data for small water clusters, highly-accurate theoretical results are required to validate and parameterize model potentials. As an example of the benchmarks needed for the development of accurate models for the interaction between water molecules, for the most stable structure of (H 2 O) 20  we ran a coupled-cluster calculation on the ORNL's Jaguar petaflop computer that used over 100 TB of memory for a sustained performance of 487 TFLOP/s (double precision) on 96,000 processors, lasting for 2 hours. By this summer we will have studied multiple structures of both (H 2 O) 20  and (H 2 O) 24  and completed basis set and other convergence studies and anticipate the sustained performance rising close to 1 PFLOP/s.", "citation": "Citations (69)", "year": "2009", "departments": ["Oak Ridge National Laboratory", "Australian National University", "Oak Ridge National Laboratory", "Oak Ridge National Laboratory", "Pacific Northwest National Laboratory"], "conf": "sc", "authors": ["Edoardo Aprà.....http://dblp.org/pers/hd/a/Apr=agrave=:Edoardo", "Alistair P. Rendell.....http://dblp.org/pers/hd/r/Rendell:Alistair_P=", "Robert J. Harrison.....http://dblp.org/pers/hd/h/Harrison:Robert_J=", "Vinod Tipparaju.....http://dblp.org/pers/hd/t/Tipparaju:Vinod", "Wibe A. deJong.....http://dblp.org/pers/hd/d/deJong:Wibe_A=", "Sotiris S. Xantheas.....http://dblp.org/pers/hd/x/Xantheas:Sotiris_S="], "pages": -1}