{"title": "The Accordion Phenomenon: Analysis, Characterization, and Impact on DTN Routing.", "fields": ["oracle", "mobile radio", "accordion", "phenomenon", "bluetooth"], "abstract": "We analyze the dynamics of a mobility dataset collected in a pipelined disruption-tolerant network (DTN), a particular class of intermittently-connected wireless networks characterized by a one-dimensional topology. First, we collected and investigated traces of contact times among a thousand participants of a rollerblading tour in Paris. The dataset shows extreme dynamics in the mobility pattern of a large number of nodes. Most strikingly, fluctuations in the motion of the rollerbladers cause a typical accordion phenomenon - the topology expands and shrinks with time, thus influencing connection times and opportunities between participants. Second, we show through an analytical model that the accordion phenomenon, through the variation of the average node degree, has a major impact on the performance of epidemic dissemination. Finally, we test epidemic dissemination and other existing forwarding schemes on our traces, and argue that routing should adapt to the varying, though predictable, nature of the network. To this end, we propose DA-SW (density-aware spray-and-wait), a measurement-oriented variant of the spray-and-wait algorithm that tunes, in a dynamic fashion, the number of a message copies disseminated in the network. We show that DA-SW leads to performance results that are close to the best case (obtained with an oracle).", "citation": "Citations (241)", "departments": ["Thales Communications", "Thales Communications", "Thales Communications", "UPMC Univ Paris|Orange Labs", "UPMC Univ Paris|Orange Labs"], "authors": ["Pierre-Ugo Tournoux.....http://dblp.org/pers/hd/t/Tournoux:Pierre=Ugo", "Jeremie Leguay.....http://dblp.org/pers/hd/l/Leguay:Jeremie", "Farid Benbadis.....http://dblp.org/pers/hd/b/Benbadis:Farid", "Vania Conan.....http://dblp.org/pers/hd/c/Conan:Vania", "Marcelo Dias de Amorim.....http://dblp.org/pers/hd/a/Amorim:Marcelo_Dias_de", "John Whitbeck.....http://dblp.org/pers/hd/w/Whitbeck:John"], "conf": "infocom", "year": "2009", "pages": 9}