{"title": "Efficiently Selecting the Best Web Services.", "fields": ["linked data", "conjunctive query", "service discovery", "deductive reasoning", "ranking"], "abstract": "Emerging technologies and linking data initiatives have motivated the publication of a large number of datasets, and provide the basis for publishing Web services and tools to manage the available data. This wealth of resources opens a world of possibilities to satisfy user requests. However, Web services may have similar functionality and assess different performance; therefore, it is required to identify among the Web services that satisfy a user request, the ones with the best quality. In this paper we propose a hybrid approach that combines reasoning tasks with ranking techniques to aim at the selection of the Web services that best implement a user request. Web service functionalities are described in terms of input and output attributes annotated with existing ontologies, non-functionality is represented as Quality of Services (QoS) parameters, and user requests correspond to conjunctive queries whose sub-goals impose restrictions on the functionality and quality of the services to be selected. The ontology annotations are used in different reasoning tasks to infer service implicit properties and to augment the size of the service search space. Furthermore, QoS parameters are considered by a ranking metric to classify the services according to how well they meet a user non-functional condition. We assume that all the QoS parameters of the non-functional condition are equally important, and apply the Top-k Skyline approach to select the k services that best meet this condition. Our proposal relies on a two-fold solution which fires a deductive-based engine that performs different reasoning tasks to discover the services that satisfy the requested functionality, and an efficient implementation of the Top-k Skyline approach to compute the top-k services that meet the majority of the QoS constraints. Our Top-k Skyline solution exploits the properties of the Skyline Frequency metric and identifies the top-k services by just analyzing a subset of the services that meet the nonfunctional condition. We report on the effects of the proposed reasoning tasks, the quality of the top-k services selected by the ranking metric, and the performance of the proposed ranking techniques. Our results suggest that the number of services can be augmented by up two orders of magnitude. In addition, our ranking techniques are able to identify services that have the best values in at least half of the QoS parameters, while the performance is improved.", "citation": "Citations (5)", "departments": ["Simón Bolívar University", "Simón Bolívar University", "Simón Bolívar University", "RIADI Laborator ... ce, La Manouba"], "authors": ["Marlene Goncalves.....http://dblp.org/pers/hd/g/Goncalves:Marlene", "Maria-Esther Vidal.....http://dblp.org/pers/hd/v/Vidal:Maria=Esther", "Alfredo Regalado.....http://dblp.org/pers/hd/r/Regalado:Alfredo", "Nadia Yacoubi Ayadi.....http://dblp.org/pers/hd/a/Ayadi:Nadia_Yacoubi"], "conf": "vldb", "year": "2009", "pages": 20}