{"title": "Smart Trend-Traversal: A Low Delay and Energy Tag Arbitration Protocol for Large RFID Systems.", "fields": ["tree traversal", "proper frame", "collision", "aloha", "arbitration"], "abstract": "We propose a Smart Trend-Traversal (STT) protocol for RFID tag arbitration, which effectively reduces the collision overhead occurred in the arbitration process. STT, a Query Tree-based scheme, dynamically issues queries according to the online learned tag density and distribution; and therefore, it significantly reduces delay and energy consumption comparing with the existing Tree-based and Aloha-based protocols. Our analytic studies further show that the optimality of STT does not rely on any presumed network conditions, which is in sharp contrast to other available schemes and renders it a highly desirable and practical solution. I. INTRODUCTION The promising potentials of RFID technology such as inventory management and real-time monitoring have brought tremendous attentions to large-scale RFID systems. As a re- sult, tag arbitration is facing unprecedent challenges to achieve optimal or close-to-optimal efficiency, which otherwise may lead to significant delay and energy consumption and hinder RFID's wide application in large industrial systems. However, fast arbitration of massive tags is nontrivial to achieve in RFID systems, especially due to the limited compu- tation and communication capability of tags. The existing tag arbitration protocols can be grouped into two categories: the Aloha-based and the Tree-based. Both approaches, although taking completely different strategies to address the problem, are facing the common dilemma: performance degradation in large-scale RFID systems due to the excessive collisions in- curred. Not only does the collision increase the process delay, it also consumes extra energy, which is critical for the battery powered readers and active RFID tags. Several algorithms are proposed recently aiming to reduce the tag collision, but an optimal and practical solution for tag arbitration is hardly found in the literature. To provide the background to tag arbitration protocols, we briefly discuss the two categories of tag arbitration schemes. The Aloha algorithm is a probabilistic approach where the tags respond to the reader's query at random time (1)-(3). The frame slotted Aloha is further proposed by restricting tag responses within a frame (4)-(6). A proper frame size is essential to the frame slotted Aloha algorithm. To choose the frame size, the number of tags present must be known or estimated in prior. In general, the Aloha-based schemes are This work is supported in part by the National Science Foundation under", "citation": "Citations (70)", "departments": ["University of Louisiana at Lafayette", "University of Louisiana at Lafayette"], "authors": ["Lei Pan.....http://dblp.org/pers/hd/p/Pan:Lei", "Hongyi Wu.....http://dblp.org/pers/hd/w/Wu:Hongyi"], "conf": "infocom", "year": "2009", "pages": 5}