{"title": "Discovering Conditional Functional Dependencies.", "fields": ["computational fluid dynamics", "data integrity", "pattern recognition", "arity", "dependency theory", "artificial intelligence", "relational database", "computed tomography", "functional dependency", "association rule learning", "data integration", "computer science"], "abstract": "This paper investigates the discovery of conditional functional dependencies (CFDs). CFDs are a recent extension of functional dependencies (FDs) by supporting patterns of semantically related constants, and can be used as rules for cleaning relational data. However, finding quality CFDs is an expensive process that involves intensive manual effort. To effectively identify data cleaning rules, we develop techniques for discovering CFDs from relations. Already hard for traditional FDs, the discovery problem is more difficult for CFDs. Indeed, mining patterns in CFDs introduces new challenges. We provide three methods for CFD discovery. The first, referred to as CFDMiner, is based on techniques for mining closed item sets, and is used to discover constant CFDs, namely, CFDs with constant patterns only. Constant CFDs are particularly important for object identification, which is essential to data cleaning and data integration. The other two algorithms are developed for discovering general CFDs. One algorithm, referred to as CTANE, is a levelwise algorithm that extends TANE, a well-known algorithm for mining FDs. The other, referred to as FastCFD, is based on the depth-first approach used in FastFD, a method for discovering FDs. It leverages closed-item-set mining to reduce the search space. As verified by our experimental study, CFDMiner can be multiple orders of magnitude faster than CTANE and FastCFD for constant CFD discovery. CTANE works well when a given relation is large, but it does not scale well with the arity of the relation. FastCFD is far more efficient than CTANE when the arity of the relation is large; better still, leveraging optimization based on closed-item-set mining, FastCFD also scales well with the size of the relation. These algorithms provide a set of cleaning-rule discovery tools for users to choose for different applications.", "citation": "Citations (254)", "departments": ["University of Edinburgh", "University of Edinburgh", "Bell Labs", "Bell Labs", "University of Edinburgh", "University of Edinburgh", "University of British Columbia", "Bell Labs", "School of Informatics"], "authors": ["Wenfei Fan.....http://dblp.org/pers/hd/f/Fan:Wenfei", "Floris Geerts.....http://dblp.org/pers/hd/g/Geerts:Floris", "Laks V. S. Lakshmanan.....http://dblp.org/pers/hd/l/Lakshmanan:Laks_V=_S=", "Ming Xiong.....http://dblp.org/pers/hd/x/Xiong:Ming"], "conf": "icde", "year": "2009", "pages": 4}