{"title": "A Case for Automated Debugging Using Data Structure Repair.", "fields": ["debugging", "correctness", "software bug", "algorithmic program debugging", "program animation"], "abstract": "Automated debugging is becoming increasingly important as the size and complexity of software increases. This paper makes a case for using constraint-based data structure repair, a recently developed technique for fault recovery, as a basis for automated debugging. Data structure repair uses given structural integrity constraints for key data structures to monitor their correctness during the execution of a program. If a constraint violation is detected, repair performs mutations on the data structures, i.e., corrupt program state, and transforms it into another state, which satisfies the desired constraints. The primary goal of data structure repair is to transform an erroneous state into an acceptable state. Therefore, the mutations performed by repair actions provide a basis of debugging faults in code (assuming the errors are due to bugs). A key challenge to embodying this insight into a mechanical technique arises due to the difference in the concrete level of the program states and the abstract level of the program code: repair actions apply to concrete data structures that exist at runtime, whereas debugging applies to code. We observe that static structures (program variables) hold handles to dynamic structures (heap-allocated data), which allows bridging the gap between the abstract and concrete levels. We envision a tool-chain where a data structure repair tool generates repair logs that are used by a fault localization tool and a repair abstraction tool that apply in synergy to not only identify the location of fault(s) in code but also to synthesize debugging suggestions. An embodiment of our vision can significantly reduce the cost of developing reliable software.", "citation": "Citations (27)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Muhammad Zubair Malik.....http://dblp.org/pers/hd/m/Malik:Muhammad_Zubair", "Khalid Ghori.....http://dblp.org/pers/hd/g/Ghori:Khalid", "Bassem Elkarablieh.....http://dblp.org/pers/hd/e/Elkarablieh:Bassem", "Sarfraz Khurshid.....http://dblp.org/pers/hd/k/Khurshid:Sarfraz"], "conf": "kbse", "year": "2009", "pages": 5}