{"title": "Reducing Packet Losses in Networks of Commodity IEEE 802.15.4 Sensor Motes Using Cooperative Communication and Diversity Combination.", "fields": ["bit error rate", "channel state information", "received signal strength indication", "diversity combining", "ieee 802 15"], "abstract": "This paper presents the 'Poor Man's SIMO System' (PMSS) which combines two ideas, cooperative communication and diversity combination, to reduce packet losses over links in Wireless Sensor Networks (WSN). The work is based on the IEEE 802.15.4 standard and is distinct from previous works that apply the same concepts because it foregoes the need for any changes to mote hardware. We describe a Poor Man's SIMO System protocol that governs the cooperation between receivers. Three diversity combination methods are evaluated including selection diversity, equal gain and maximal ratio combining. The latter relies on a model of the instantaneous Bit Error Rate (BER) driven by Channel State Information (CSI), i.e. Received Signal Strength Indication (RSSI) and Link Quality Indication (LQI). First, we demonstrate the PMSS on residual bit error traces in a fully reproducible manner. This is followed by an implementation of PMSS in C# on the .NET Micro Framework edition of the recently released Imote2 WSN mote platform. Both, trace based analysis and implementation demonstrate significant improvements over the single receiver baseline configuration. We deliberately verified PMSS by residual bit error traces and implementation to avoid the use of simulators that depend on abstract models of wireless channels.", "citation": "Citations (14)", "departments": ["Michigan State University", "Michigan State University", "Michigan State University"], "authors": ["Muhammad Usman Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Muhammad_Usman", "Moonseong Kim.....http://dblp.org/pers/hd/k/Kim:Moonseong", "Hayder Radha.....http://dblp.org/pers/hd/r/Radha:Hayder"], "conf": "infocom", "year": "2009", "pages": 9}