{"title": "More is More: The Benefits of Denser Sensor Deployment.", "fields": ["square lattice", "lattice", "obstacle avoidance", "probabilistic logic", "hexagonal lattice", "grid", "sensor fusion"], "abstract": "Positioning disk-shaped sensors to optimize certain coverage parameters is a fundamental problem in ad hoc sensor networks. The hexagon lattice arrangement is known to be optimally efficient in the plane, even though 20.9p of the area is unnecessarily covered twice, however, the arrangement is very rigid—any movement of a sensor from its designated grid position (due to, e.g., placement error or obstacle avoidance) leaves some region uncovered, as would the failure of any one sensor. In this article, we consider how to arrange sensors in order to guarantee multiple coverage, that is,  k -coverage for some value  k  > 1. A naive approach is to superimpose multiple hexagon lattices, but for robustness reasons, we may wish to space sensors evenly apart.   We present two arrangement methods for  k -coverage: (1) optimizing a Riesz energy function in order to evenly distribute nodes, and (2) simply shrinking the hexagon lattice and making it denser. The first method often approximates the second, and so we focus on the latter. We show that a density increase tantamount to  k  copies of the lattice can yield  k ′-coverage, for  k ′ >  k  (e.g.,  k  = 11,  k ′ = 12 and  k  = 21,  k ′ = 24), by exploiting the double-coverage regions. Our examples' savings provably converge in the limit to the a 20.9p maximum. We also provide analogous results for the square lattice and its a 57p inefficiency (e.g.,  k  = 3,  k ′ = 4 and  k =5,  k ′ = 7) and show that for multi-coverage for some values of  k ′, the square lattice can actually be more efficient than the hexagon lattice.   We also explore other benefits of shrinking the lattice: Doing so allows all sensors to move about their intended positions independently while nonetheless guaranteeing full coverage and can also allow us to tolerate probabilistic sensor failure when providing 1-coverage or  k -coverage. We conclude by construing the shrinking factor as a budget to be divided among these three benefits.", "citation": "Citations (14)", "departments": ["City University of New York", "City University of New York", "City University of New York", "City University of New York", "IBM", "City University of New York", "City University of New York", "City University of New York", "City University of New York", "IBM"], "authors": ["Matthew P. Johnson.....http://dblp.org/pers/hd/j/Johnson:Matthew_P=", "Deniz Sariöz.....http://dblp.org/pers/hd/s/Sari=ouml=z:Deniz", "Amotz Bar-Noy.....http://dblp.org/pers/hd/b/Bar=Noy:Amotz", "Theodore Brown.....http://dblp.org/pers/hd/b/Brown:Theodore", "Dinesh C. Verma.....http://dblp.org/pers/hd/v/Verma:Dinesh_C=", "Chai Wah Wu.....http://dblp.org/pers/hd/w/Wu:Chai_Wah"], "conf": "infocom", "year": "2009", "pages": 9}