{"title": "SWIM: A Simple Model to Generate Small Mobile Worlds.", "fields": ["mobile ad hoc network", "mobile computing", "mobility model", "cellular network", "synthetic data"], "abstract": "This paper presents small world in motion (SWIM), a new mobility model for ad-hoc networking. SWIM is relatively simple, is easily tuned by setting just a few parameters, and generates traces that look real—synthetic traces have the same statistical properties of real traces. SWIM shows experimentally and theoretically the presence of the power law and exponential decay dichotomy of inter-contact time, and, most importantly, our experiments show that it can predict very accurately the performance of forwarding protocols. Index Terms—Mobility model, small world, simulations, for- warding protocols in mobile networks. I. INTRODUCTION it has been established clearly that models like RWP are not good to simulate human mobility, raising the need of new, more realistic mobility models for mobile ad-hoc networking. In this paper we present small world in motion (SWIM), a simple mobility model that generates small worlds. The model is very simple to implement and very efficient in simulations. The mobility pattern of the nodes is based on a simple intuition on human mobility: People go more often to places not very far from their home and where they can meet a lot of other people. By implementing this simple rule, SWIM is able to raise social behavior among nodes, which we believe to be the base of human mobility in real life. We validate our model using real traces and compare the distribution of inter-contact time, contact duration and number of contact distributions between nodes, showing that synthetic data that we generate match very well real data traces. Furthermore, we show that SWIM can predict well the performance of forwarding protocols. We compare the performance of two forwarding protocols— epidemic forwarding (9) and (a simplified version of) del- egation forwarding (10)—on both real traces and synthetic traces generated with SWIM. The performance of the two protocols on the synthetic traces accurately approximates their performance on real traces, supporting the claim that SWIM is an excellent model for human mobility. The rest of the paper is organized as follows: Section II briefly reports on current work in the field; in Section III we present the details of SWIM and we prove theoretically that the distribution of inter-contact time in SWIM has an exponential tail, as recently observed in real life experiments; Section V compares synthetic data traces to real traces and shows that the distribution of inter-contact time has a head that decays as a power law, again like in real experiments; in Section VI we show our experimental results on the behavior of two forwarding protocols on both synthetic and real traces; lastly, Section VII present some concluding remarks.", "citation": "Citations (203)", "departments": ["Sapienza University of Rome", "Sapienza University of Rome"], "authors": ["Alessandro Mei.....http://dblp.org/pers/hd/m/Mei:Alessandro", "Julinda Stefa.....http://dblp.org/pers/hd/s/Stefa:Julinda"], "conf": "infocom", "year": "2009", "pages": 8}