{"title": "Leakage-Resilient Public-Key Cryptography in the Bounded-Retrieval Model.", "fields": ["key distribution", "ciphertext", "quantum cryptography", "cryptographic primitive", "strong cryptography", "neural cryptography", "key size", "pkcs 1", "financial cryptography", "security parameter"], "abstract": "We study the design of cryptographic primitives resilient to key-leakage attacks, where an attacker can repeatedly and adaptively learn information about the secret key, subject only to the constraint that the overall amount of such information is bounded by some parameter ?. We construct a variety of leakage-resilient public-key systems including the first known identification schemes (ID), signature schemes and authenticated key agreement protocols (AKA). Our main result is an efficient three-round AKA in the Random-Oracle Model, which is resilient to key-leakage attacks that can occur prior-to and after a protocol execution. Our AKA protocol can be used as an interactive encryption scheme with qualitatively stronger privacy guarantees than non-interactive encryption schemes (constructed in prior and concurrent works), which are inherently insecure if the adversary can perform leakage attacks after seing a ciphertext.\n\nMoreover, our schemes can be flexibly extended to the Bounded-Retrieval Model, allowing us to tolerate very large absolute amount of adversarial leakage ? (potentially many gigabytes of information), only by increasing the size of the secret key and without any other loss of efficiency in communication or computation. Concretely, given any leakage parameter ?, security parameter ?, and any desired fraction 0 < ? ≤ 1, our schemes have the following properties: \nSecret key size is ?(1 + ?) + O(?).\nPublic key size is O(?), and independent of ?.\nCommunication complexity is O(?/?), and independent of ?.\nComputation reads O(?/? 2) locations of the secret key, independent of ?.\n\n\n\nLastly, we show that our schemes allow for repeated \"invisible updates\" of the secret key, allowing us to tolerate up to ? bits of leakage in between any two updates, and an unlimited amount of leakage overall. These updates require that the parties can securely store a short \"master update key\" (e.g. on a separate secure device protected against leakage), which is only used for updates and not during protocol execution. The updates are invisible in the sense that a party can update its secret key at any point in time, without modifying the public key or notifying the other users.", "citation": "Not cited", "departments": ["New York University", "New York University", "New York University"], "authors": ["Joël Alwen.....http://dblp.org/pers/hd/a/Alwen:Jo=euml=l", "Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "conf": "crypto", "year": "2009", "pages": 19}