{"title": "Towards automated performance diagnosis in a large IPTV network.", "fields": ["network element", "iptv", "ip multicast", "network operations center", "troubleshooting"], "abstract": "IPTV is increasingly being deployed and offered as a commercial service to residential broadband customers. Compared with traditional ISP networks, an IPTV distribution network (i) typically adopts a hierarchical instead of mesh-like structure, (ii) imposes more stringent requirements on both reliability and performance, (iii) has different distribution protocols (which make heavy use of IP multicast) and traffic patterns, and (iv) faces more serious scalability challenges in managing millions of network elements. These unique characteristics impose tremendous challenges in the effective management of IPTV network and service.   In this paper, we focus on characterizing and troubleshooting performance issues in one of the largest IPTV networks in North America. We collect a large amount of measurement data from a wide range of sources, including device usage and error logs, user activity logs, video quality alarms, and customer trouble tickets. We develop a novel diagnosis tool called Giza that is specifically tailored to the enormous scale and hierarchical structure of the IPTV network. Giza applies multi-resolution data analysis to quickly detect and localize regions in the IPTV distribution hierarchy that are experiencing serious performance problems. Giza then uses several statistical data mining techniques to troubleshoot the identified problems and diagnose their root causes. Validation against operational experiences demonstrates the effectiveness of Giza in detecting important performance issues and identifying interesting dependencies. The methodology and algorithms in Giza promise to be of great use in IPTV network operations.", "citation": "Citations (165)", "year": "2009", "departments": ["University of Texas at Austin", "AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "conf": "sigcomm", "authors": ["Ajay Anil Mahimkar.....http://dblp.org/pers/hd/m/Mahimkar:Ajay_Anil", "Zihui Ge.....http://dblp.org/pers/hd/g/Ge:Zihui", "Aman Shaikh.....http://dblp.org/pers/hd/s/Shaikh:Aman", "Jia Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jia", "Jennifer Yates.....http://dblp.org/pers/hd/y/Yates:Jennifer", "Yin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Yin", "Qi Zhao.....http://dblp.org/pers/hd/z/Zhao:Qi"], "pages": 12}