{"title": "Bayesian estimation of orientation preference maps.", "fields": ["bayesian hierarchical modeling", "bayes estimator", "gaussian process", "optical imaging", "covariance", "bayesian linear regression", "covariance function", "posterior probability"], "abstract": "Imaging techniques such as optical imaging of intrinsic signals, 2-photon calcium imaging and voltage sensitive dye imaging can be used to measure the functional organization of visual cortex across different spatial and temporal scales. Here, we present Bayesian methods based on Gaussian processes for extracting topographic maps from functional imaging data. In particular, we focus on the estimation of orientation preference maps (OPMs) from intrinsic signal imaging data. We model the underlying map as a bivariate Gaussian process, with a prior covariance function that reflects known properties of OPMs, and a noise covariance adjusted to the data. The posterior mean can be interpreted as an optimally smoothed estimate of the map, and can be used for model based interpolations of the map from sparse measurements. By sampling from the posterior distribution, we can get error bars on statistical properties such as preferred orientations, pinwheel locations or pinwheel counts. Finally, the use of an explicit probabilistic model facilitates interpretation of parameters and quantitative model comparisons. We demonstrate our model both on simulated data and on intrinsic signaling data from ferret visual cortex.", "citation": "Not cited", "year": "2009", "departments": ["Max Planck Society", "Max Planck Society", "Max Planck Society", "Max Planck Society", "Duke University", "Princeton University", "Max Planck Society", "External Organizations"], "conf": "nips", "authors": ["Jakob H. Macke.....http://dblp.org/pers/hd/m/Macke:Jakob_H=", "Sebastian Gerwinn.....http://dblp.org/pers/hd/g/Gerwinn:Sebastian", "Leonard E. White.....http://dblp.org/pers/hd/w/White:Leonard_E=", "Matthias Kaschube.....http://dblp.org/pers/hd/k/Kaschube:Matthias", "Matthias Bethge.....http://dblp.org/pers/hd/b/Bethge:Matthias"], "pages": 9}