{"title": "A Game-Theoretic Approach to Hypergraph Clustering.", "fields": ["hypergraph", "correlation clustering", "constrained clustering", "fuzzy clustering", "replicator equation", "pairwise comparison", "evolutionary game theory"], "abstract": "Hypergraph clustering refers to the process of extracting maximally coherent groups from a set of objects using high-order (rather than pairwise) similarities. Traditional approaches to this problem are based on the idea of partitioning the input data into a predetermined number of classes, thereby obtaining the clusters as a by-product of the partitioning process. In this paper, we offer a radically different view of the problem. In contrast to the classical approach, we attempt to provide a meaningful formalization of the very notion of a cluster and we show that game theory offers an attractive and unexplored perspective that serves our purpose well. To this end, we formulate the hypergraph clustering problem in terms of a noncooperative multiplayer “clustering game,” and show that a natural notion of a cluster turns out to be equivalent to a classical (evolutionary) game-theoretic equilibrium concept. We prove that the problem of finding the equilibria of our clustering game is equivalent to locally optimizing a polynomial function over the standard simplex, and we provide a discrete-time high-order replicator dynamics to perform this optimization, based on the Baum-Eagon inequality. Experiments over synthetic as well as real-world data are presented which show the superiority of our approach over the state of the art.", "citation": "Citations (117)", "year": "2009", "departments": ["Ca' Foscari University of Venice", "Ca' Foscari University of Venice", "Ca' Foscari University of Venice", "Ca' Foscari University of Venice"], "conf": "nips", "authors": ["Samuel Rota Bulò.....http://dblp.org/pers/hd/b/Bul=ograve=:Samuel_Rota", "Marcello Pelillo.....http://dblp.org/pers/hd/p/Pelillo:Marcello"], "pages": 9}