{"title": "TRUST: A General Framework for Truthful Double Spectrum Auctions.", "fields": ["spectral efficiency", "spectrum management", "forward auction", "frequency allocation", "spectrum auction"], "abstract": "We design truthful double spectrum auctions where multiple parties can trade spectrum based on their individual needs. Open, market-based spectrum trading motivates existing spectrum owners (as sellers) to lease their selected idle spectrum to new spectrum users, and provides new users (as buyers) the spectrum they desperately need. The most significant challenge is how to make the auction economic-robust (truthful in particular) while enabling spectrum reuse to improve spectrum utilization. Unfortunately, existing designs either do not consider spectrum reuse or become untruthful when applied to double spectrum auc- tions. We address this challenge by proposing TRUST, a general framework for truthful double spectrum auctions. TRUST takes as input any reusability-driven spectrum allocation algorithm, and applies a novel winner determination and pricing mechanism to achieve truthfulness and other economic properties while sig- nificantly improving spectrum utilization. To our best knowledge, TRUST is the first solution for truthful double spectrum auctions that enable spectrum reuse. Our results show that economic factors introduce a tradeoff between spectrum efficiency and economic robustness. TRUST makes an important contribution on enabling spectrum reuse to minimize such tradeoff. Due to their perceived fairness and allocation effi- ciency (13), auctions are among the best-known market- based mechanisms to distribute spectrum. In a well-designed auction, everyone has an equal opportunity to win and the spectrum is sold to bidders who value it the most. In the past decade, the FCC (Federal Communications Commission) and its counterparts across the world have been using single-sided auctions to assign spectrum to wireless service providers in terms of predetermined national/regional long-term leases. In this paper, we show that auctions can be designed to dynamically redistribute spectrum across multiple parties to meet their own demands. As shown in Figure 1, the auctioneer runs double spectrum auctions to enable multiple sellers and buyers to trade spectrum dynamically. In this way, existing spectrum owners (as sellers) can obtain financial gains by leasing their selected idle spectrum to new spectrum users; new users (as buyers) can access the spectrum they desperately need and in the format they truly desire. By multiplexing spectrum supply and demand in time and space, dynamic auctions can significantly improve spectrum utilization. In addition to enabling dynamic trading, our proposed spectrum auctions recognize that spectrum is reusable among bidders and exploit such reusability to improve auction ef- ficiency. Unlike conventional FCC-style auctions that target only national service providers, our auctions allow buyers to be Fig. 1. Multi-party spectrum trading based on double auctions. The auctioneer performs an auction among both sellers and buyers. Sellers provide idle spectrum pieces dynamically with regional coverage, while buyers request spectrum channels in local areas based on their demands. Each channel contributed by a seller can be reused by multiple non-conflicting buyers. small wireless networks, individual infrastructure networks or home networks. These small buyers seek local spectrum usage and thus can reuse spectrum in space. To distribute spectrum efficiently, one must exploit such spatial reusability.", "citation": "Citations (448)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Xia Zhou.....http://dblp.org/pers/hd/z/Zhou:Xia", "Haitao Zheng.....http://dblp.org/pers/hd/z/Zheng:Haitao"], "conf": "infocom", "year": "2009", "pages": 9}