{"title": "Position Based Cryptography.", "fields": ["strong cryptography", "key exchange", "cryptography", "public key cryptography", "secure two party computation", "information theoretic security", "storage model", "cryptography standards", "public key infrastructure", "computer science", "mathematics", "neural cryptography", "bounded function", "pkcs 1", "financial cryptography", "adversary", "theoretical computer science"], "abstract": "We consider what constitutes identities in cryptography. Typical examples include your name and your social-security number, or your fingerprint/iris-scan, or your address, or your (non-revoked) public-key coming from some trusted public-key infrastructure. In many situations, however, where you are defines your identity. For example, we know the role of a bank-teller behind a bullet-proof bank window not because she shows us her credentials but by merely knowing her location. In this paper, we initiate the study of cryptographic protocols where the identity (or other credentials and inputs) of a party are derived from its geographic location.\n\nWe start by considering the central task in this setting, i.e., securely verifying the position of a device. Despite much work in this area, we show that in the Vanilla (or standard) model, the above task (i.e., of secure positioning) is impossible to achieve. In light of the above impossibility result, we then turn to the Bounded Storage Model and formalize and construct information theoretically secure protocols for two fundamental tasks: \nSecure Positioning; and\nPosition Based Key Exchange.\n\n\n\nWe then show that these tasks are in fact universal in this setting --- we show how we can use them to realize Secure Multi-Party Computation.Our main contribution in this paper is threefold: to place the problem of secure positioning on a sound theoretical footing; to prove a strong impossibility result that simultaneously shows the insecurity of previous attempts at the problem; and to present positive results by showing that the bounded-storage framework is, in fact, one of the \"right\" frameworks (there may be others) to study the foundations of position-based cryptography.", "citation": "Not cited", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Nishanth Chandran.....http://dblp.org/pers/hd/c/Chandran:Nishanth", "Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Ryan Moriarty.....http://dblp.org/pers/hd/m/Moriarty:Ryan", "Rafail Ostrovsky.....http://dblp.org/pers/hd/o/Ostrovsky:Rafail"], "conf": "crypto", "year": "2009", "pages": 17}