{"title": "Non-linear Rewrite Closure and Weak Normalization.", "fields": ["normalization property", "closure", "rippling", "rewriting", "tree automaton", "transitive relation"], "abstract": "A rewrite closure is an extension of a term rewrite system with new rules, usually deduced by transitivity. Rewrite closures have the nice property that all rewrite derivations can be transformed into derivations of a simple form. This property has been useful for proving decidability results in term rewriting. Unfortunately, when the term rewrite system is not linear, the construction of a rewrite closure is quite challenging. In this paper, we construct a rewrite closure for term rewrite systems that satisfy two properties: the right-hand side term in each rewrite rule contains no repeated variable (right-linear) and contains no variable at depth greater than one (right-shallow). The left-hand side term is unrestricted, and in particular, it may be non-linear. As a consequence of the rewrite closure construction, we are able to prove decidability of the weak normalization problem for right-linear right-shallow term rewrite systems. Proving this result also requires tree automata theory. We use the fact that right-shallow right-linear term rewrite systems are regularity preserving. Moreover, their set of normal forms can be represented with a tree automaton with disequality constraints, and emptiness of this kind of automata, as well as its generalization to reduction automata, is decidable.", "citation": "Not cited", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "SRI International", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "SRI International"], "authors": ["Carles Creus.....http://dblp.org/pers/hd/c/Creus:Carles", "Guillem Godoy.....http://dblp.org/pers/hd/g/Godoy:Guillem", "Francesc Massanes.....http://dblp.org/pers/hd/m/Massanes:Francesc", "Ashish Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Ashish"], "conf": "lics", "year": "2009", "pages": 10}