{"title": "Wi-Sh: A Simple, Robust Credit Based Wi-Fi Community Network.", "fields": ["download", "nash equilibrium", "client", "system model", "pareto analysis"], "abstract": "Wireless community networks, where users share wireless bandwidth is attracting tremendous interest from academia and industry. Companies such as FON have been successful in attracting large communities of users. However, solutions such as FON either require users to buy specialized FON routers or firmware modifications to existing routers. In this paper we propose a solution which requires no such sophisticated hardware. An alternative is to provide a solution which requires users to download a client software on to their PCs. While the solution appears simple it raises several issues of incentivizing users to share their bandwidth and also issues of preventing users from cheating behaviors which give them an unfair advantage. In this paper, we propose a system and solution which (i) requires only software downloads on PCs, (ii) is robust to tampering of the software, and intermittent monitoring of an access point by the owner, (iii) a credit based mechanism whereby users earn credits for sharing bandwidth and punishment and pricing mechanism whereby users are charged at a higher price whenever they are caught misbehaving. By making simple but plausible assumptions about user behavior, we show via analysis and extensive simulations that the system converges to a Pareto optimal Nash equilibrium. We further validate our system model, by running trace driven simulations on real world data. We believe that the solution provided by Wi-Sh is an attractive and more credible alternative to solutions such as FON.", "citation": "Citations (24)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Xin Ai.....http://dblp.org/pers/hd/a/Ai:Xin", "Vikram Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Vikram", "Chen-Khong Tham.....http://dblp.org/pers/hd/t/Tham:Chen=Khong"], "conf": "infocom", "year": "2009", "pages": 9}