{"title": "BulkCompiler: high-performance sequential consistency through cooperative compiler and hardware support.", "fields": ["compiler correctness", "optimizing compiler", "program optimization", "hardware architecture", "sequential consistency"], "abstract": "A platform that supported Sequential Consistency (SC) for  all  codes --- not only the well-synchronized ones --- would simplify the task of programmers. Recently, several hardware architectures that support high-performance SC by committing groups of instructions at a time have been proposed. However, for a platform to support SC, it is insufficient that the hardware does; the compiler has to support SC as well.   This paper presents the hardware-compiler interface, and the main compiler ideas for  BulkCompiler , a simple compiler layer that works with the group-committing hardware to provide a  whole-system high-performance  SC platform. We introduce ISA primitives and software algorithms for BulkCompiler to drive instruction-group formation, and to transform code to exploit the groups. Our simulation results show that BulkCompiler not only enables a whole-system SC environment, but also one that actually outperforms a conventional platform that uses the more relaxed Java Memory Model by an average of 37%. The speedups come from code optimization inside software-assembled instruction groups.", "citation": "Citations (58)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Purdue University"], "authors": ["Wonsun Ahn.....http://dblp.org/pers/hd/a/Ahn:Wonsun", "Shanxiang Qi.....http://dblp.org/pers/hd/q/Qi:Shanxiang", "M. Nicolaides.....http://dblp.org/pers/hd/n/Nicolaides:M=", "Josep Torrellas.....http://dblp.org/pers/hd/t/Torrellas:Josep", "Jae-Woo Lee.....http://dblp.org/pers/hd/l/Lee:Jae=Woo", "Xing Fang.....http://dblp.org/pers/hd/f/Fang:Xing", "Samuel P. Midkiff.....http://dblp.org/pers/hd/m/Midkiff:Samuel_P=", "David C. Wong.....http://dblp.org/pers/hd/w/Wong_0001:David_C="], "conf": "micro", "year": "2009", "pages": 12}