{"title": "Join Optimization of Information Extraction Output: Quality Matters!", "fields": ["document retrieval", "recursive join", "information extraction", "hidden markov model", "sort merge join"], "abstract": "Information extraction (IE) systems are trained to extract specific relations from text databases. Real-world applications often require that the output of multiple IE systems be joined to produce the data of interest. To optimize the execution of a join of multiple extracted relations, it is not sufficient to consider only execution time. In fact, the quality of the join output is of critical importance: unlike in the relational world, different join execution plans can produce join results of widely different quality whenever IE systems are involved. In this paper, we develop a principled approach to understand, estimate, and incorporate output quality into the join optimization process over extracted relations. We argue that the output quality is affected by (a) the configuration of the IE systems used to process documents, (b) the document retrieval strategies used to retrieve documents, and (c) the actual join algorithm used. Our analysis considers several alternatives for these factors, and predicts the output quality---and, of course, the execution time---of the alternate execution plans. We establish the accuracy of our analytical models, as well as study the effectiveness of a quality-aware join optimizer, with a large-scale experimental evaluation over real-world text collections and state-of-the-art IE systems.", "citation": "Citations (20)", "departments": ["University of Wisconsin-Madison", "New York University", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Alpa Jain.....http://dblp.org/pers/hd/j/Jain:Alpa", "Panagiotis G. Ipeirotis.....http://dblp.org/pers/hd/i/Ipeirotis:Panagiotis_G=", "AnHai Doan.....http://dblp.org/pers/hd/d/Doan:AnHai", "Luis Gravano.....http://dblp.org/pers/hd/g/Gravano:Luis"], "conf": "icde", "year": "2009", "pages": 12}