{"title": "Distance metric learning from uncertain side information with application to automated photo tagging.", "fields": ["semantic gap", "standard test image", "user generated content", "full text search", "automatic image annotation"], "abstract": "Automated photo tagging  is essential to make massive unlabeled photos searchable by text search engines. Conventional image annotation approaches, though working reasonably well on small testbeds, are either computationally expensive or inaccurate when dealing with large-scale photo tagging. Recently, with the popularity of social networking websites, we observe a massive number of user-tagged images, referred to as \" social images \", that are available on the web. Unlike traditional web images, social images often contain tags and other user-generated content, which offer a new opportunity to resolve some long-standing challenges in multimedia. In this work, we aim to address the challenge of large-scale automated photo tagging by exploring the social images. We present a retrieval based approach for automated photo tagging. To tag a test image, the proposed approach first retrieves  k  social images that share the largest visual similarity with the test image. The tags of the test image are then derived based on the tagging of the similar images. Due to the well-known semantic gap issue, a regular Euclidean distance-based retrieval method often fails to find semantically relevant images. To address the challenge of semantic gap, we propose a novel  probabilistic distance metric learning  scheme that (1) automatically derives constraints from the uncertain side information, and (2) efficiently learns a distance metric from the derived constraints. We apply the proposed technique to automated photo tagging tasks based on a social image testbed with over 200,000 images crawled from Flickr. Encouraging results show that the proposed technique is effective and promising for automated photo tagging.", "citation": "Citations (86)", "departments": ["University of Science and Technology of China", "Nanyang Technological University", "Michigan State University", "ETH Zurich", "Microsoft"], "authors": ["Lei Wu.....http://dblp.org/pers/hd/w/Wu:Lei", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Rong Jin.....http://dblp.org/pers/hd/j/Jin:Rong", "Jianke Zhu.....http://dblp.org/pers/hd/z/Zhu:Jianke", "Nenghai Yu.....http://dblp.org/pers/hd/y/Yu:Nenghai"], "conf": "mm", "year": "2009", "pages": 10}