{"title": "The Curious Case of Benjamin Button.", "fields": ["art", "clinical psychology", "progeria", "literature", "politics", "psychoanalysis", "regression", "psychology", "humanities", "medical literature", "tears", "social psychology", "jazz", "mainstream", "psychotherapist", "performance art", "philosophy", "weir", "emotional expression", "dentistry", "progerin", "art history", "environmental ethics", "lost generation", "sadness", "psychiatry", "feeling", "neglect", "history"], "abstract": "The inspiration for the major motion picture starring Brad Pitt and Cate Blanchett, plus eighteen other stories by the beloved author of\"The Great Gatsby\" In the title story of this collection by one of America s greatest writers, a baby born in 1860 begins life as an old man and proceeds to age backward. F. Scott Fizgerald hinted at this kind of inversion when he called his era a generation grown up to find all Gods dead, all wars fought, all faiths in man shaken. Perhaps nowhere in American fiction has this Lost Generation been more vividly preserved than in Fitzgerald s short fiction. Spanning the early twentieth-century American landscape, this original collection captures, with Fitzgerald s signature blend of enchantment and disillusionment, America during the Jazz Age. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust theseries to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-datetranslations by award-winning translators.\"", "citation": "Not cited", "departments": ["Harvard University", "Stanford University", "New York University", "Florida State University", "University of Münster", "Temple University", "360 N. Bedford  ... ndrafen@mac.com", "Glenside, PA."], "authors": ["Timothy Enstice.....http://dblp.org/pers/hd/e/Enstice:Timothy"], "conf": "siggraph", "year": "2009", "pages": 2}