{"title": "Enabling high-fidelity neutron transport simulations on petascale architectures.", "fields": ["mockup", "nuclear reactor core", "neutron transport", "modeling and simulation", "petascale computing"], "abstract": "The UNIC code is being developed as part of the DOE's Nuclear Energy Advanced Modeling and Simulation (NEAMS) program. UNIC is an unstructured, deterministic neutron transport code that allows a highly detailed description of a nuclear reactor. The primary goal of our simulation efforts is to reduce the uncertainties and biases in reactor design calculations by progressively replacing existing multilevel averaging (homogenization) techniques with more direct solution methods based on first principles. Since the neutron transport equation is seven dimensional (three in space, two in angle, one in energy, and one in time), these simulations are among the most memory and computationally intensive in all of computational science. In order to model the complex physics of a reactor core, billions of spatial elements, hundreds of angles, and thousands of energy groups are necessary, leading to problem sizes with petascale degrees of freedom. Therefore, these calculations exhaust memory resources on current and even next-generation architectures. In this paper, we present UNIC simulation results for two important representative problems in reactor design and analysis---PHENIX and ZPR-6. In each case, UNIC shows good weak scalability on up to 163,840 cores of Blue Gene/P (Argonne) and 122,800 cores of XT5 (Oak Ridge). While our current per processor performance is less than ideal, we demonstrate a clear ability to effectively utilize the leadership computing platforms. Over the coming months, we aim to improve the per processor performance while maintaining the high parallel efficiency by employing better algorithms such as spatial  p - and  h -multigrid preconditioners, optimized matrix-tensor operations, and weighted partitioning for better load balancing. Combining these additional algorithmic improvements with the availability of larger parallel machines should allow us to realize our long-term goal of explicit geometry coupled multiphysics reactor simulations. In the long run, these high-fidelity simulations will be able to replace expensive mockup experiments and reduce the uncertainty in crucial reactor design and operational parameters.", "citation": "Citations (11)", "year": "2009", "departments": ["Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory"], "conf": "sc", "authors": ["Dinesh K. Kaushik.....http://dblp.org/pers/hd/k/Kaushik:Dinesh_K=", "Micheal Smith.....http://dblp.org/pers/hd/s/Smith:Micheal", "Allan B. Wollaber.....http://dblp.org/pers/hd/w/Wollaber:Allan_B=", "Barry F. Smith.....http://dblp.org/pers/hd/s/Smith:Barry_F=", "Andrew R. Siegel.....http://dblp.org/pers/hd/s/Siegel:Andrew_R=", "Won Sik Yang.....http://dblp.org/pers/hd/y/Yang:Won_Sik"], "pages": -1}