{"title": "PRIMA: archiving and querying historical data with evolving schemas.", "fields": ["star schema", "database schema", "schema migration", "schema evolution", "information schema"], "abstract": "Schema evolution poses serious challenges in historical data management. Traditionally, historical data have been archived either by (i) migrating them into the current schema version that is well-understood by users but compromising archival quality, or (ii) by maintaining them under the original schema version in which the data was originally created, leading to perfect archival quality, but forcing users to formulate queries against complex histories of evolving schemas. In the PRIMA system, we achieve the best of both approaches, by (i) archiving historical data under the schema version under which they were originally created, and (ii) letting users express temporal queries using the current schema version. Thus, in PRIMA, the system rewrites the queries to the (potentially many) pertinent versions of the evolving schema. Moreover, the system o ers automatic documentation of the schema history, and allows the users to pose temporal queries over the metadata history itself. The proposed demonstration highlights the system features exploiting both a synthetic-educational running example and the real-life evolution histories (schemas and data), which include hundreds of schema versions from Wikipedia and Ensembl. The demonstration off ers a thorough walk-through of the system features and a hands-on system testing phase, where the audiences are invited to directly interact with the advanced query interface of PRIMA.", "citation": "Citations (18)", "year": "2009", "departments": ["University of California, Los Angeles", "Polytechnic University of Milan", "University of California, Los Angeles", "University of California, Los Angeles"], "conf": "sigmod", "authors": ["Hyun Jin Moon.....http://dblp.org/pers/hd/m/Moon:Hyun_Jin", "Carlo Curino.....http://dblp.org/pers/hd/c/Curino:Carlo", "MyungWon Ham.....http://dblp.org/pers/hd/h/Ham:MyungWon", "Carlo Zaniolo.....http://dblp.org/pers/hd/z/Zaniolo:Carlo"], "pages": 4}