{"title": "Adaptive Scheduling of Web Transactions.", "fields": ["tardiness", "web page", "workflow", "dynamic web page", "database transaction"], "abstract": "In highly interactive dynamic web database systems, user satisfaction determines their success. In such systems, user requested web pages are dynamically created by executing a number of database queries or web transactions. In this paper, we model the interrelated transactions generating a web page as workflows and quantify the user satisfaction by associating dynamic web pages with soft-deadlines. Further, we model the importance of transactions in generating a page by associating different weights to transactions. Using this framework, system success is measured in terms of minimizing the deviation from the deadline (i.e., tardiness) and also minimizing the weighted such deviation (i.e., weighted tardiness). In order to efficiently support the materialization of dynamic web pages, we propose ASETS∗, which is a parameter-free adaptive scheduling algorithm that automatically adapts to, not only system load, but also transactions' characteristics (i.e., interdependencies, deadlines and weights). ASETS∗ prioritizes the execution of transactions with the objective of minimizing weighted tardiness. It is also capable of balancing the tradeoff between optimizing average- and worst-case performance when needed. The performance advantages of ASETS∗ are experimentally demonstrated.", "citation": "Citations (30)", "departments": ["University of Pittsburgh", "University of Toronto", "University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh"], "authors": ["Shenoda Guirguis.....http://dblp.org/pers/hd/g/Guirguis:Shenoda", "Mohamed A. Sharaf.....http://dblp.org/pers/hd/s/Sharaf:Mohamed_A=", "Panos K. Chrysanthis.....http://dblp.org/pers/hd/c/Chrysanthis:Panos_K=", "Alexandros Labrinidis.....http://dblp.org/pers/hd/l/Labrinidis:Alexandros", "Kirk Pruhs.....http://dblp.org/pers/hd/p/Pruhs:Kirk"], "conf": "icde", "year": "2009", "pages": 12}