{"title": "Minimizing Delay for Multicast-Streaming in Wireless Networks with Network Coding.", "fields": ["network packet", "dynamic priority scheduling", "linear network coding", "network delay", "reliable multicast"], "abstract": "Network coding is a method that promises to achieve the min-cut capacity in multicasts. However, pushing towards this gain in throughput comes with two sacrifices. Delay suffers as the decoding procedure requires buffering and is performed in batches of coded packets, and unfairness prevails in terms of delay increases between receivers with worse channel conditions and those with better channel conditions. In this paper, we focus on optimizing the delay performance in reliably multicasting a data stream to a set of one-hop receivers from the receiver perspective. We analyze the system based on queueing theory using semi-Markov chains from both the system-wide and receiver perspectives. We find that the average delay per received packet at the receivers' end can be minimized by appropriate scheduling of data packets and appropriate size of the coding buffer, which depends on the rate of incoming data stream and capacities of the receivers. To circumvent unduly computational complexities, we design a heuristic scheme which can achieve significant performance gain when compared to an existing method. Our scheme readily adapts the coding size to the dynamics of the system, and schedules data packets to be coded via some strict priority measure for optimized delay performance. We show through extensive simulations that our scheme gives low average delay at high streaming rates and narrows the performance gap between receivers with bad and good channel conditions.", "citation": "Citations (57)", "departments": ["Inst. for Infoc ... Res., Singapore", "Inst. for Infoc ... Res., Singapore", "Inst. for Infoc ... Res., Singapore"], "authors": ["Wai-Leong Yeow.....http://dblp.org/pers/hd/y/Yeow:Wai=Leong", "Anh Tuan Hoang.....http://dblp.org/pers/hd/h/Hoang:Anh_Tuan", "Chen-Khong Tham.....http://dblp.org/pers/hd/t/Tham:Chen=Khong"], "conf": "infocom", "year": "2009", "pages": 9}