{"title": "Finding Actionable Knowledge via Automated Comparison.", "fields": ["effective method", "software deployment", "data cube", "data visualization", "visual inspection"], "abstract": "The problem of finding interesting and actionable patterns is a major challenge in data mining. It has been studied by many data mining researchers. The issue is that data mining algorithms often generate too many patterns, which make it very hard for the user to find those truly useful ones. Over the years many techniques have been proposed. However, few have made it to real-life applications. At the end of 2005, we built a data mining system for Motorola (called Opportunity Map) to enable the user to explore the space of a large number of rules in order to find actionable knowledge. The approach is based on the concept of rule cubes and operations on rule cubes. A rule cube is similar to a data cube, but stores rules. Since its deployment, some issues have also been identified during the regular use of the system in Motorola. One of the key issues is that although the operations on rule cubes are flexible, each operation is primitive and has to be initiated by the user. Finding a piece of actionable knowledge typically involves many operations and intense visual inspections, which are labor-intensive and time-consuming. From interactions with our users, we identified a generic problem that is crucial for finding actionable knowledge. The problem involves extensive comparison of sub-populations and identification of the cause of their differences. This paper first defines the problem and then proposes an effective method to solve the problem automatically. To the best of our knowledge, there is no reported study of this problem. The new method has been added to the Opportunity Map system and is now in daily use in Motorola.", "citation": "Citations (6)", "departments": ["University of Illinois at Chicago", "University of Illinois at Chicago", "Motorola", "Motorola"], "authors": ["Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0016:Lei", "Bing Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bing", "Jeffrey Benkler.....http://dblp.org/pers/hd/b/Benkler:Jeffrey", "Chi Zhou.....http://dblp.org/pers/hd/z/Zhou:Chi"], "conf": "icde", "year": "2009", "pages": 12}