{"title": "A Spreadsheet Algebra for a Direct Data Manipulation Query Interface.", "fields": ["query optimization", "web query classification", "sql", "unary operation", "data manipulation language"], "abstract": "A spreadsheet-like \"direct manipulation\" interface is more intuitive for many non-technical database users compared to traditional alternatives, such as visual query builders. The construction of such a direct manipulation interfacemay appear straightforward, but there are some significant challenges. First, individual direct manipulation operations cannot be too complex, so expressive power has to be achieved through composing (long) sequences of small operations. Second, all intermediate results are visible to the user, so grouping and ordering are material after every small step. Third, users often find the need to modify previously specified queries. Since manipulations are specified one step at a time, there is no actual queryexpression to modify. Suitable means must be provided to address this need. Fourth, the order in which manipulations are performed by the user should not affect the results obtained, to avoid user confusion. We address the aforementioned challenges by designing a new spreadsheet algebra that: i) operates on recursively grouped multi-sets, ii) contains a selectively designed set of operators capable of expressing at least all single-block SQL queries and can be intuitively implemented in a spreadsheet, iii) enables query modification by the notion of modifiable query state, and iv) requires no ordering in unary data manipulation operators since they are all designed to commute. We built a prototype implementation of the spreadsheet algebra and show, through user studies with non-technical subjects, that the resultant query interface is easier to use than a standard commercial visual query builder.", "citation": "Citations (66)", "departments": ["University of Michigan", "University of Michigan"], "authors": ["Bin Liu.....http://dblp.org/pers/hd/l/Liu_0002:Bin", "H. V. Jagadish.....http://dblp.org/pers/hd/j/Jagadish:H=_V="], "conf": "icde", "year": "2009", "pages": 12}