{"title": "Dictionary-based order-preserving string compression for main memory column stores.", "fields": ["search engine indexing", "sorting", "string", "dictionary coder", "key", "versa", "integer", "compression"], "abstract": "Column-oriented database systems [19, 23] perform better than traditional row-oriented database systems on analytical workloads such as those found in decision support and business intelligence applications. Moreover, recent work [1, 24] has shown that lightweight compression schemes significantly improve the query processing performance of these systems. One such a lightweight compression scheme is to use a dictionary in order to replace long (variable-length) values of a certain domain with shorter (fixedlength) integer codes. In order to further improve expensive query operations such as sorting and searching, column-stores often use order-preserving compression schemes.   In contrast to the existing work, in this paper we argue that orderpreserving dictionary compression does not only pay off for attributes with a small fixed domain size but also for long string attributes with a large domain size which might change over time. Consequently, we introduce new data structures that efficiently support an order-preserving dictionary compression for (variablelength) string attributes with a large domain size that is likely to change over time. The main idea is that we model a dictionary as a table that specifies a mapping from string-values to arbitrary integer codes (and vice versa) and we introduce a novel indexing approach that provides efficient access paths to such a dictionary while compressing the index data. Our experiments show that our data structures are as fast as (or in some cases even faster than) other state-of-the-art data structures for dictionaries while being less memory intensive.", "citation": "Not cited", "year": "2009", "departments": ["ETH Zurich", "ETH Zurich", "SAP AG, Walldorf, Germany"], "conf": "sigmod", "authors": ["Carsten Binnig.....http://dblp.org/pers/hd/b/Binnig:Carsten", "Stefan Hildenbrand.....http://dblp.org/pers/hd/h/Hildenbrand:Stefan", "Franz Färber.....http://dblp.org/pers/hd/f/F=auml=rber:Franz"], "pages": 14}