{"title": "An efficient algorithm for partial order production.", "fields": ["graph entropy", "heap", "total order", "partially ordered set", "selection algorithm", "order by"], "abstract": "We consider the problem of partial order production: arrange the elements of an unknown totally ordered set $T$ into a target partially ordered set $S$ by comparing a minimum number of pairs in $T$. Special cases include sorting by comparisons, selection, multiple selection, and heap construction. We give an algorithm performing $ITLB+o(ITLB)+O(n)$ comparisons in the worst case. Here, $n$ denotes the size of the ground sets, and $ITLB$ denotes a natural information-theoretic lower bound on the number of comparisons needed to produce the target partial order. Our approach is to replace the target partial order by a weak order (that is, a partial order with a layered structure) extending it, without increasing the information-theoretic lower bound too much. We then solve the problem by applying an efficient multiple selection algorithm. The overall complexity of our algorithm is polynomial. This answers a question of Yao [SIAM J. Comput., 18 (1989), pp. 679-689]. We base our analysis on the entropy of the target partial order, a quantity that can be efficiently computed and provides a good estimate of the information-theoretic lower bound.", "citation": "Citations (10)", "departments": ["Université catholique de Louvain", "University of Waterloo", "Université libre de Bruxelles", "Université libre de Bruxelles", "Université libre de Bruxelles", "Université catholique de Louvain", "University of Waterloo", "jcardin@ulb.ac. ... oret@ulb.ac.be"], "authors": ["Jean Cardinal.....http://dblp.org/pers/hd/c/Cardinal:Jean", "Samuel Fiorini.....http://dblp.org/pers/hd/f/Fiorini:Samuel", "Gwenaël Joret.....http://dblp.org/pers/hd/j/Joret:Gwena=euml=l", "Raphaël M. Jungers.....http://dblp.org/pers/hd/j/Jungers:Rapha=euml=l_M=", "J. Ian Munro.....http://dblp.org/pers/hd/m/Munro:J=_Ian"], "conf": "stoc", "year": "2009", "pages": 8}