{"title": "Adaptive Early Packet Filtering for Defending Firewalls Against DoS Attacks.", "fields": ["firewall", "stateful firewall", "network packet", "denial of service attack", "access control list"], "abstract": "A major threat to data networks is based on the fact that some traffic can be expensive to classify and filter as it will undergo a longer than average list of filtering rules before being rejected by the default deny rule. An attacker with some information about the access-control list (ACL) deployed at a firewall or an intrusion detection and prevention system (IDS/IPS) can craft packets that will have maximum cost. In this paper, we present a technique that is light weight, traffic-adaptive and can be deployed on top of any filtering mech- anism to pre-filter unwanted expensive traffic. The technique utilizes Internet traffic characteristics coupled with a special carefully tuned representation of the policy to generate early defense policies. We use Boolean expressions built as binary decision diagrams (BDD) to represent relaxed versions of the policy that are faster to evaluate. Moreover, it is guaranteed that the technique will not add an overhead that will not be compensated by the gain in filtering time in the underlying filtering method. Evaluation has shown considerable savings to the overall filtering process, thus saving the firewall processing power and increasing overall throughput. Also, the overhead changes according to the traffic behavior, and can be tuned to guarantee its worst case time cost. regarding malicious activities. A filtering technique that is capable of performing regardless of the number of criteria fields will prove useful in a wide variety of devices. In this paper, we will describe an early filtering/decision technique that reduces the packet matching cost by a dy- namically changed pre-filtering phase that resides before the original firewall matching technique. Special consideration was given to having minimal on-line operations and reasonable overhead periodic maintenance. While in this paper we focus on firewalls, the technique is applicable to any device that performs packet matching based on a predefined deterministic policy. The actual implementation was written and deployed as a plug-in for the standard IPTables firewall. The technique is triggered prior to the start of the regular matching, and if a packet needs further processing it is passed to the next layer,", "citation": "Citations (66)", "departments": ["DePaul University", "DePaul University", "University of Waterloo"], "authors": ["Adel El-Atawy.....http://dblp.org/pers/hd/e/El=Atawy:Adel", "Ehab Al-Shaer.....http://dblp.org/pers/hd/a/Al=Shaer:Ehab", "Tung Tran.....http://dblp.org/pers/hd/t/Tran:Tung", "Raouf Boutaba.....http://dblp.org/pers/hd/b/Boutaba:Raouf"], "conf": "infocom", "year": "2009", "pages": 9}