{"title": "Path Diversity Aware Interdomain Routing.", "fields": ["policy based routing", "routing domain", "equal cost multi path routing", "path vector protocol", "multipath routing"], "abstract": "Abstract —As the Internet becomes the critical informationinfrastructure for both personal and business applications, fastand reliable routing protocols need to be designed to maintainthe performance of those applications in the presence of failures.Today’s interdomain routing protocol, BGP, is known to be slowin reacting and recovering from network failures. Increasing pathdiversity by advertising multiple paths is an effective strategyto achieve reliable interdomain routing. However, designing ascalable and efﬁcient multiple path advertisement to enhancethe reliability of interdomain routing is still challenging. In thispaper, we propose two path diversity aware routing protocols,D-BGP and B-BGP, to improve the resilience of interdomainrouting. The two protocols can establish multiple paths with lowrouting overhead by exploiting the path diversity existing in theunderlying network infrastructure. We evaluate the reliabilityimprovements by simulation. I. I NTRODUCTION With the continued growth of the Internet, new and largescale mission critical applications, such as Voice-over-IP(VoIP) applications, multiplayer games, and video confer-encing, are widely deployed. The reliability of the Internetbecomes very important to maintain the performance of thoseapplications. Unfortunately, Internet path failures are fairlycommon and can impact those applications [11], [10]. Tosupport these applications in the face of failures, it is cru-cial that the underlying network infrastructure provides highredundancy and that the routing system can fully exploit theredundancy of the underlying network infrastructure to quicklyrecover from failures.However, BGP, the current", "citation": "Citations (56)", "departments": ["Liberty University", "University of Massachusetts Amherst"], "authors": ["Feng Wang.....http://dblp.org/pers/hd/w/Wang_0017:Feng", "Lixin Gao.....http://dblp.org/pers/hd/g/Gao_0001:Lixin"], "conf": "infocom", "year": "2009", "pages": 9}