{"title": "Sequence Pattern Query Processing over Out-of-Order Event Streams.", "fields": ["intrusion detection system", "correctness", "event stream processing", "information retrieval", "streams", "complex event processing", "data mining", "computer science", "ranging", "out of order execution"], "abstract": "Complex event processing has become increasingly important in modern applications, ranging from RFID tracking for supply chain management to real-time intrusion detection. A key aspect of complex event processing is to extract patterns from event streams to make informed decisions in real-time. However, network latencies and machine failures may cause events to arrive out-of-order at the event processing engine. State-of-the-art event stream processing technology experiences significant challenges when faced with out-of-order data arrival including output blocking, huge system latencies, memory resource overflow, and incorrect result generation. To address these problems, we propose two alternate solutions: aggressive and conservative strategies respectively to process sequence pattern queries on out-of-order event streams. The aggressive strategy produces maximal output under the optimistic assumption that out-of-order event arrival is rare. In contrast, to tackle the unexpected occurrence of an out-of-order event and with it any premature erroneous result generation, appropriate error compensation methods are designed for the aggressive strategy. The conservative method works under the assumption that out-of-order data may be common, and thus produces output only when its correctness can be guaranteed. A partial order guarantee (POG) model is proposed under which such correctness can be guaranteed. For robustness under spiky workloads, both strategies are supplemented with persistent storage support and customized access policies. Our experimental study evaluates the robustness of each method, and compares their respective scope of applicability with state-of-art methods.", "citation": "Citations (109)", "departments": ["Massachusetts Institute of Technology", "Dept. of Comput ... , Worcester, MA", "Dept. of Comput ... , Worcester, MA", "Dept. of Comput ... , Worcester, MA", "Dept. of Comput ... , Worcester, MA"], "authors": ["Mo Liu.....http://dblp.org/pers/hd/l/Liu:Mo", "Ming Li.....http://dblp.org/pers/hd/l/Li_0008:Ming", "Denis Golovnya.....http://dblp.org/pers/hd/g/Golovnya:Denis", "Elke A. Rundensteiner.....http://dblp.org/pers/hd/r/Rundensteiner:Elke_A=", "Kajal T. Claypool.....http://dblp.org/pers/hd/c/Claypool:Kajal_T="], "conf": "icde", "year": "2009", "pages": 12}