{"title": "SmartCIS: integrating digital and physical environments.", "fields": ["data center", "query optimization", "data integrity", "data integration", "data stream mining"], "abstract": "With the increasing adoption of networked sensors, a new class of applications is emerging that combines data from the \"digital world\" with real-time sensor readings, in order to intelligently manage physical environments and systems (e.g., \"smart\" buildings, power grids, data centers). This leads to new challenges in providing programmability, performance, extensibility, and multi-purpose heterogeneous data acquisition. The ASPEN project addresses these challenges by extending data integrationtechniques to the distributed stream world, and adding new abstractions for physical phenomena. We describe the architecture and implementation of our ASPEN system and its showcase intelligent building application, SmartCIS, which was demonstrated at SIGMOD 2009. We summarize the new query processing algorithms we have developed for integrating highly distributed stream data sources, both in low-power sensor devices and traditional PCs and servers; describe query optimization techniques for federations of stream processors; and detail new capabilities such as incremental maintenance of recursive views. Our algorithms and techniques generalize across a wide range of data from RFID and light measurements to real-time machine usage monitoring, energy consumption and recursive query computation.", "citation": "Citations (14)", "year": "2009", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania"], "conf": "sigmod", "authors": ["Mengmeng Liu.....http://dblp.org/pers/hd/l/Liu:Mengmeng", "Svilen R. Mihaylov.....http://dblp.org/pers/hd/m/Mihaylov:Svilen_R=", "Zhuowei Bao.....http://dblp.org/pers/hd/b/Bao:Zhuowei", "Marie Jacob.....http://dblp.org/pers/hd/j/Jacob:Marie", "Zachary G. Ives.....http://dblp.org/pers/hd/i/Ives:Zachary_G=", "Boon Thau Loo.....http://dblp.org/pers/hd/l/Loo:Boon_Thau", "Sudipto Guha.....http://dblp.org/pers/hd/g/Guha:Sudipto"], "pages": 4}