{"title": "A cost semantics for self-adjusting computation.", "fields": ["asymptotic analysis", "bounded function", "trace distance", "extensional definition", "generalization"], "abstract": "Self-adjusting computation is an evaluation model in which programs can respond efficiently to small changes to their input data by using a change-propagation mechanism that updates computation by re-building only the parts affected by changes. Previous work has proposed language techniques for self-adjusting computation and showed the approach to be effective in a number of application areas. However, due to the complex semantics of change propagation and the indirect nature of previously proposed language techniques, it remains difficult to reason about the efficiency of self-adjusting programs and change propagation.   In this paper, we propose a cost semantics for self-adjusting computation that enables reasoning about its effectiveness. As our source language, we consider a direct-style λ-calculus with first-class mutable references and develop a notion of trace distance for source programs. To facilitate asymptotic analysis, we propose techniques for composing and generalizing concrete distances via trace contexts (traces with holes). We then show how to translate the source language into a self-adjusting target language such that the translation (1) preserves the extensional semantics of the source programs and the cost of from-scratch runs, and (2) ensures that change propagation between two evaluations takes time bounded by their relative distance. We consider several examples and analyze their effectiveness by considering upper and lower bounds.", "citation": "Citations (25)", "departments": ["Carnegie Mellon University", "Toyota Technological Institute at Chicago", "Toyota Technological Institute at Chicago"], "authors": ["Ruy Ley-Wild.....http://dblp.org/pers/hd/l/Ley=Wild:Ruy", "Umut A. Acar.....http://dblp.org/pers/hd/a/Acar:Umut_A=", "Matthew Fluet.....http://dblp.org/pers/hd/f/Fluet:Matthew"], "conf": "popl", "year": "2009", "pages": 14}