{"title": "Trap Coverage: Allowing Coverage Holes of Bounded Diameter in Wireless Sensor Networks.", "fields": ["bounded function", "probabilistic analysis of algorithms", "density estimation", "wireless sensor network", "trajectory"], "abstract": "Tracking of movements such as that of people, animals, vehicles, or of phenomena such as fire, can be achieved by deploying a wireless sensor network. So far only prototype systems have been deployed and hence the issue of scale has not become critical. Real-life deployments, however, will be at large scale and achieving this scale will become prohibitively expensive if we require every point in the region to be covered (i.e., full coverage), as has been the case in prototype deployments. In this paper we therefore propose a new model of coverage, called Trap Coverage, that scales well with large deployment regions. A sensor network providing Trap Coverage guarantees that any moving object or phenomena can move at most a (known) displacement before it is guaranteed to be detected by the network, for any trajectory and speed. Applications aside, trap coverage generalizes the de-facto model of full coverage by allowing holes of a given maximum diameter. From a prob- abilistic analysis perspective, the trap coverage model explains the continuum between percolation (when coverage holes become finite) and full coverage (when coverage holes cease to exist). We take first steps toward establishing a strong foundation for this new model of coverage. We derive reliable, explicit estimates for the density needed to achieve trap coverage with a given diameter when sensors are deployed randomly. Our density estimates are more accurate than those obtained using asymptotic critical conditions. We show by simulation that our analytical predictions of density are quite accurate even for small networks. We then propose polynomial-time algorithms to determine the level of trap coverage achieved once sensors are deployed on the ground. Finally, we point out several new research problems that arise by the introduction of the trap coverage model.", "citation": "Citations (103)", "departments": ["University of Memphis", "University of Memphis", "University of Memphis", "Ohio State University"], "authors": ["Paul Balister.....http://dblp.org/pers/hd/b/Balister:Paul", "Zizhan Zheng.....http://dblp.org/pers/hd/z/Zheng:Zizhan", "Santosh Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Santosh", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun"], "conf": "infocom", "year": "2009", "pages": 9}