{"title": "Scab.", "fields": ["inbred strain", "myrtaceae", "crop", "locus", "bulked segregant analysis", "psidium", "pestalotiopsis disseminata", "plant disease resistance", "gene family", "vomitoxin", "fusarium", "fusarium ear blight", "apple scab", "trichothecene", "introgression", "fusarium sporotrichioides", "gibberella zeae", "malus floribunda", "crop protection", "venturia inaequalis", "reproductive isolation", "fusarium culmorum", "plant pathology", "pestalotiopsis", "transgene", "cultivar", "chaff", "mycosis", "genetic marker", "fusarium langsethiae", "amplified fragment length polymorphism", "pestalotiopsis microspora", "bacterial artificial chromosome"], "abstract": "cab can be a devastating disease affecting all classes of wheat and other small grains. This fungal disease, also called Fusarium head blight (FHB), has the ability to completely destroy a potentially high-yielding crop within a few weeks of harvest. Lush, green fields become blighted seemingly overnight (Figs. 1 and 2). Frequent rainfalls, high humidities, and/or heavy dews that coincide with the flowering and early kernel-fill period of the crop favor infection and development of the disease. Damage from head scab is multifold: reduced yields, discolored, shriveled “tombstone” kernels (Figs. 3 to 5), contamination with mycotoxins, and reduction in seed quality. The disease also reduces test weight and lowers market grade. Difficulties in marketing, exporting, processing, and feeding scabby grain are experienced. In North America, Fusarium graminearum Schwabe (teleomorph Gibberella zeae (Schwein.) Petch; synonym = G. saubinetti) predominates among several Fusarium species that can cause scab (4,5,8,40,48,60). Other species may predominate in cooler climates or where crops other than wheat and corn are dominant (8,40,48,60). F. graminearum also is associated with stalk and ear rot of corn and may cause a root rot of cereals. The fungus persists and multiplies on infected crop residues of small grains and corn. The chaff, light-weight kernels, and other infected head debris of wheat and barley, returned to the soil surface during harvest, serve as important sites of overwintering of the fungus. Continued moist weather during the crop growing season favors development of the fungus, and spores are windblown or water-splashed onto heads of cereal crops. Wheat and barley are susceptible to head infection from the flowering (pollination) period up through the soft dough stage of kernel development. Spores of the causal fungus may land on the exposed anthers of the flower and then grow into the kernels, glumes, or other head parts. Excellent descriptions of the disease cycle and spore stages of the causal fungi have been published (4,8,21,40,48). Mycotoxins are frequently associated with the growth and invasion of cereal grains by scab fungi. The most common toxin associated with F. graminearum– infected grain is vomitoxin (deoxynivalenol). Vomitoxin is known to cause vomiting and feed refusal in nonruminant animals and poses a threat to other animals and humans if exposure levels are high (45). The presence of mycotoxins in infected grain further exacerbates the losses that scab can cause. Recent articles have reviewed the epidemiology, management, and history of scab outbreaks in the United States, Canada, Europe, Asia, and South America (5,40,45,48). As these papers indicate, numerous research and survey reports have described the worldwide occurrence and epidemic levels of scab during the past century. Yield loss reports have not always been based on replicated research trials, but extensive surveys of producers’ fields have provided assessments of head blighting severity, which were translated into yield loss estimates. In the United States, scab was found in 31 of 40 states surveyed in 1917, with losses estimated at 288,000 metric tons (10.6 million bushels), primarily in Ohio, Indiana, and Illinois (4). Scab caused an estimated loss of 2.18 million metric tons (80 million bushels) of winter and spring wheat throughout the United States in 1919 (14). Extensive field surveys", "citation": "Citations (1,726)", "departments": ["United States Department of Agriculture", "North Dakota State University", "North Dakota State University", "United States Department of Agriculture", "Purdue University", "United States Department of Agriculture", "Crop and Enviro ... e. TF10 8NB, UK", "Crop and Enviro ... e. TF10 8NB, UK", "Crop and Enviro ... e. TF10 8NB, UK", "Plant Pathology", "Crop Sciences"], "authors": ["Marjan Moghaddam.....http://dblp.org/pers/hd/m/Moghaddam:Marjan"], "conf": "siggraph", "year": "2009", "pages": 1}