{"title": "Hierarchical learning for tubular structure parsing in medical imaging: A study on coronary arteries using 3D CT Angiography.", "fields": ["parsing", "contextual image classification", "angiography", "coronary arteries", "voxel"], "abstract": "Automatic coronary artery centerline extraction from 3D CT Angiography (CTA) has significant clinical importance for diagnosis of atherosclerotic heart disease. The focus of past literature is dominated by segmenting the complete coronary artery system as trees by computer. Though the labeling of different vessel branches (defined by their medical semantics) is much needed clinically, this task has been performed manually. In this paper, we propose a hierarchical machine learning approach to tackle the problem of tubular structure parsing in medical imaging. It has a progressive three-tiered classification process at volumetric voxel level, vessel segment level, and inter-segment level. Generative models are employed to project from low-level, ambiguous data to class-conditional probabilities; and discriminative classifiers are trained on the upper-level structural patterns of probabilities to label and parse the vessel segments. Our method is validated by experiments of detecting and segmenting clinically defined coronary arteries, from the initial noisy vessel segment networks generated by low-level heuristics-based tracing algorithms. The proposed framework is also generically applicable to other tubular structure parsing tasks", "citation": "Citations (13)", "year": "2009", "departments": ["Siemens", "Siemens", "Siemens", "Siemens", "Siemens"], "conf": "iccv", "authors": ["Le Lu.....http://dblp.org/pers/hd/l/Lu:Le", "Jinbo Bi.....http://dblp.org/pers/hd/b/Bi:Jinbo", "Shipeng Yu.....http://dblp.org/pers/hd/y/Yu:Shipeng", "Zhigang Peng.....http://dblp.org/pers/hd/p/Peng:Zhigang", "Arun Krishnan.....http://dblp.org/pers/hd/k/Krishnan:Arun", "Xiang Sean Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiang_Sean"], "pages": 8}