{"title": "Detecting Spam Zombies by Monitoring Outgoing Messages.", "fields": ["malware", "identity theft", "spamming", "zombie", "sequential probability ratio test", "botnet", "campus network", "situated"], "abstract": "Compromised machines are one of the key security threats on the Internet; they are often used to launch various security attacks such as spamming and spreading malware, DDoS, and identity theft. Given that spamming provides a key economic incentive for attackers to recruit the large number of compromised machines, we focus on the detection of the compromised machines in a network that are involved in the spamming activities, commonly known as spam zombies. We develop an effective spam zombie detection system named SPOT by monitoring outgoing messages of a network. SPOT is designed based on a powerful statistical tool called Sequential Probability Ratio Test, which has bounded false positive and false negative error rates. In addition, we also evaluate the performance of the developed SPOT system using a two-month e-mail trace collected in a large US campus network. Our evaluation studies show that SPOT is an effective and efficient system in automatically detecting compromised machines in a network. For example, among the 440 internal IP addresses observed in the e-mail trace, SPOT identifies 132 of them as being associated with compromised machines. Out of the 132 IP addresses identified by SPOT, 126 can be either independently confirmed (110) or highly likely (16) to be compromised. Moreover, only seven internal IP addresses associated with compromised machines in the trace are missed by SPOT. In addition, we also compare the performance of SPOT with two other spam zombie detection algorithms based on the number and percentage of spam messages originated or forwarded by internal machines, respectively, and show that SPOT outperforms these two detection algorithms.", "citation": "Citations (114)", "departments": ["Florida State University", "Juniper Networks", "Florida State University", "University of Hawaii", "Florida State University", "Florida State University", "Florida State University", "Florida State University", "University of Hawaii at Manoa", "Florida State University"], "authors": ["Zhenhai Duan.....http://dblp.org/pers/hd/d/Duan:Zhenhai", "Peng Chen.....http://dblp.org/pers/hd/c/Chen_0006:Peng", "Fernando Sanchez.....http://dblp.org/pers/hd/s/Sanchez:Fernando", "Yingfei Dong.....http://dblp.org/pers/hd/d/Dong:Yingfei", "Mary Stephenson.....http://dblp.org/pers/hd/s/Stephenson:Mary", "James Michael Barker.....http://dblp.org/pers/hd/b/Barker:James_Michael"], "conf": "infocom", "year": "2009", "pages": 9}