{"title": "On Efficient Query Processing of Stream Counts on the Cell Processor.", "fields": ["stream processing", "effective method", "network processor", "microarchitecture", "hash function"], "abstract": "In recent years, the sketch-based technique has been presented as an effective method for counting stream items on processors with limited storage and processing capabilities, such as the network processors. In this paper, we examine the implementation of a sketch-based counting algorithm on the heterogeneous multi-core Cell processor. Like the network processors, the Cell also contains on-chip special processors with limited local memories. These special processors enable parallel processing of stream items using short-vector data-parallel (SIMD) operations. We demonstrate that the inaccuracies of the estimates computed by straightforward adaptations of current sketch-based counting approaches are exacerbated by increased inaccuracies in approximating counts of low frequency items, and by the inherent space limitations of the Cell processor. To address these concerns, we implement a sketch-based counting algorithm, FCM, that is specifically adapted for the Cell processor architecture. FCM incorporates novel capabilities for improving estimation accuracy using limited space by dynamically identifying low- and high-frequency stream items, and using a variable number of hash functions per item as determined by an item's current frequency phase. We experimentally demonstrate that with similar space consumption, FCM computes better frequency estimates of both the low- and high-frequency items than a naive parallelization of an existing stream counting algorithm. Using FCM as the kernel, our parallel algorithm is able to scale the over all performance linearly as well as improve the estimate accuracy as the number of processors is increased. Thus, this work demonstrates the importance of adapting the algorithm to the specifics of the underlying architecture.", "citation": "Citations (10)", "departments": ["Stanford University", "IBM", "IBM", "University of Illinois at Chicago"], "authors": ["Dina Thomas.....http://dblp.org/pers/hd/t/Thomas:Dina", "Rajesh Bordawekar.....http://dblp.org/pers/hd/b/Bordawekar:Rajesh", "Charu C. Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Charu_C=", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "conf": "icde", "year": "2009", "pages": 12}