{"title": "The effectiveness of intelligent scheduling for multicast video-on-demand.", "fields": ["distance vector multicast routing protocol", "xcast", "inter domain", "ip multicast", "pragmatic general multicast"], "abstract": "As more and more video content is made available and accessed on-demand, content and service providers face challenges of scale. Today's delivery mechanisms, especially unicast, require resources to scale linearly with the number of receivers and library sizes. Unlike these mechanisms, with multicast, the load on a server is relatively independent of the number of receivers. Adopting multicast for on-demand access, however, is challenging because of the need to temporally aggregate requests. In this paper, we investigate the importance of an intelligent scheduler and a good data model for achieving good aggregation of requests into multicast groups. We examine the use of an Earliest Deadline First (EDF)-like scheduler that aims to schedule the transmission of \"chunks\" of video according to their \"deadlines\" using multicast. We show through analysis that this approach is optimal in terms of the data transmitted by the server. Using trace data from an operational service, we show that our approach reduces server bandwidth by as much as 65% compared to traditional techniques such as unicast and cyclic multicast. Finally, our approach achieves good aggregation even when 50% of the users use a typical VoD stream-control function like skip, to view different parts of the video.", "citation": "Citations (24)", "departments": ["Princeton University", "Princeton University", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "authors": ["Vaneet Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Vaneet", "A. Robert Calderbank.....http://dblp.org/pers/hd/c/Calderbank:A=_Robert", "Vijay Gopalakrishnan.....http://dblp.org/pers/hd/g/Gopalakrishnan:Vijay", "Rittwik Jana.....http://dblp.org/pers/hd/j/Jana:Rittwik", "K. K. Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:K=_K=", "Fang Yu.....http://dblp.org/pers/hd/y/Yu:Fang"], "conf": "mm", "year": "2009", "pages": 10}