{"title": "Spatial-temporal causal modeling for climate change attribution.", "fields": ["attribution", "causal model", "climate model", "granger causality", "extreme value theory"], "abstract": "Attribution of climate change to causal factors has been based predominantly on simulations using physical climate models, which have inherent limitations in describing such a complex and chaotic system. We propose an alternative, data centric, approach that relies on actual measurements of climate observations and human and natural forcing factors. Specifically, we develop a novel method to infer causality from spatial-temporal data, as well as a procedure to incorporate extreme value modeling into our method in order to address the attribution of extreme climate events, such as heatwaves. Our experimental results on a real world dataset indicate that changes in temperature are not solely accounted for by solar radiance, but attributed more significantly to CO2 and other greenhouse gases. Combined with extreme value modeling, we also show that there has been a significant increase in the intensity of extreme temperatures, and that such changes in extreme temperature are also attributable to greenhouse gases. These preliminary results suggest that our approach can offer a useful alternative to the simulation-based approach to climate modeling and attribution, and provide valuable insights from a fresh perspective.", "citation": "Citations (86)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Aurelie C. Lozano.....http://dblp.org/pers/hd/l/Lozano:Aurelie_C=", "Hongfei Li.....http://dblp.org/pers/hd/l/Li:Hongfei", "Alexandru Niculescu-Mizil.....http://dblp.org/pers/hd/n/Niculescu=Mizil:Alexandru", "Yan Liu.....http://dblp.org/pers/hd/l/Liu_0002:Yan", "Claudia Perlich.....http://dblp.org/pers/hd/p/Perlich:Claudia", "Jonathan R. M. Hosking.....http://dblp.org/pers/hd/h/Hosking:Jonathan_R=_M=", "Naoki Abe.....http://dblp.org/pers/hd/a/Abe:Naoki"], "conf": "kdd", "year": "2009", "pages": 10}