{"title": "CSP gaps and reductions in the lasserre hierarchy.", "fields": ["mathematics", "unique games conjecture", "hierarchy", "discrete mathematics", "combinatorics", "graph coloring", "integer", "binary logarithm", "vertex cover"], "abstract": "We study integrality gaps for SDP relaxations of constraint satisfaction problems, in the hierarchy of SDPs defined by Lasserre. Schoenebeck [23] recently showed the first integrality gaps for these problems, showing that for MAX k-XOR, the ratio of the SDP optimum to the integer optimum may be as large as 2 even after Ω(n) rounds of the Lasserre hierarchy. We show that for the general MAX k-CSP problem, this ratio can be as large as 2 k /2k - e when the alphabet is binary and q k /q(q-1)k - e when the alphabet size a prime q, even after Ω(n) rounds of the Lasserre hierarchy. We also explore how to translate gaps for CSP into integrality gaps for other problems using reductions, and establish SDP gaps for Maximum Independent Set, Approximate Graph Coloring, Chromatic Number and Minimum Vertex Cover. For Independent Set and Chromatic Number, we show integrality gaps of n/2 O(√(log n log log n))  even after 2 Ω(√(log n log log n))  rounds. In case of Approximate Graph Coloring, for every constant l, we construct graphs with chromatic number Ω(2 l/2 /l 2 ), which admit a vector l-coloring for the SDP obtained by Ω(n) rounds. For Vertex Cover, we show an integrality gap of 1.36 for Ω(n δ ) rounds, for a small constant δ. The results for CSPs provide the first examples of Ω(n) round integrality gaps matching hardness results known only under the Unique Games Conjecture. This and some additional properties of the integrality gap instance, allow for gaps for in case of Independent Set and Chromatic Number which are stronger than the NP-hardness results known even under the Unique Games Conjecture.", "citation": "Not cited", "departments": ["University of California, Berkeley"], "authors": ["Madhur Tulsiani.....http://dblp.org/pers/hd/t/Tulsiani:Madhur"], "conf": "stoc", "year": "2009", "pages": 10}