{"title": "Face image modeling by multilinear subspace analysis with missing values.", "fields": ["m 2", "tensor", "multilinear subspace learning", "subspace topology", "multilinear principal component analysis", "approximation algorithm", "small number", "multilinear map"], "abstract": "Multilinear subspace analysis (MSA) is a promising methodology for pattern-recognition problems due to its ability in decomposing the data formed from the interaction of multiple factors. The MSA requires a large training set, which is well organized in a single tensor, which consists of data samples with all possible combinations of the contributory factors. However, such a “complete” training set is difficult (or impossible) to obtain in many real applications. The missing-value problem is therefore crucial to the practicality of the MSA but has been hardly investigated up to present. To solve the problem, this paper proposes an algorithm named M 2 SA, which is advantageous in real applications due to the following: 1) it inherits the ability of the MSA to decompose the interlaced semantic factors; 2) it does not depend on any assumptions on the data distribution; and 3) it can deal with a high percentage of missing values. M 2 SA is evaluated by face image modeling on two typical multifactorial applications, i.e., face recognition and facial age estimation. Experimental results show the effectiveness of M 2  SA even when the majority of the values in the training tensor are missing.", "citation": "Citations (66)", "departments": ["Southeast University", "Monash University", "Nanjing University", "Chinese Academy of Sciences", "Monash University", "Monash University", "Nanjing University", "University of Melbourne"], "authors": ["Xin Geng.....http://dblp.org/pers/hd/g/Geng:Xin", "Kate Smith-Miles.....http://dblp.org/pers/hd/s/Smith=Miles:Kate", "Zhi-Hua Zhou.....http://dblp.org/pers/hd/z/Zhou:Zhi=Hua", "Liang Wang.....http://dblp.org/pers/hd/w/Wang_0001:Liang"], "conf": "mm", "year": "2009", "pages": 4}