{"title": "Blueshift: Designing processors for timing speculation from the ground up.", "fields": ["blueshift", "microarchitecture", "processor design", "opensparc", "speedup"], "abstract": "Several recent processor designs have proposed to enhance performance by increasing the clock frequency to the point where timing faults occur, and by adding error-correcting support to guarantee correctness. However, such Timing Speculation (TS) proposals are limited in that they assume traditional design methodologies that are suboptimal under TS. In this paper, we present a new approach where the processor itself is designed from the ground up for TS. The idea is to identify and optimize the most frequently-exercised critical paths in the design, at the expense of the majority of the static critical paths, which are allowed to suffer timing errors. Our approach and design optimization algorithm are called BlueShift. We also introduce two techniques that, when applied under BlueShift, improve processor performance: On-demand Selective Biasing (OSB) and Path Constraint Tuning (PCT). Our evaluation with modules from the OpenSPARC T1 processor shows that, compared to conventional TS, BlueShift with OSB speeds up applications by an average of 8% while increasing the processor power by an average of 12%. Moreover, compared to a high-performance TS design, BlueShift with PCT speeds up applications by an average of 6% with an average processor power overhead of 23% . providing a way to speed up logic modules that is orthogonal to voltage scaling.", "citation": "Citations (104)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Brian Greskamp.....http://dblp.org/pers/hd/g/Greskamp:Brian", "Lu Wan.....http://dblp.org/pers/hd/w/Wan:Lu", "Ulya R. Karpuzcu.....http://dblp.org/pers/hd/k/Karpuzcu:Ulya_R=", "Jeffrey J. Cook.....http://dblp.org/pers/hd/c/Cook:Jeffrey_J=", "Josep Torrellas.....http://dblp.org/pers/hd/t/Torrellas:Josep", "Deming Chen.....http://dblp.org/pers/hd/c/Chen:Deming", "Craig B. Zilles.....http://dblp.org/pers/hd/z/Zilles:Craig_B="], "conf": "hpca", "year": "2009", "pages": 12}