{"title": "HYDRAstor: A Scalable Secondary Storage.", "fields": ["data as a service", "distributed hash table", "data consistency", "overlay network", "directed acyclic graph"], "abstract": "HYDRAstor is a scalable, secondary storage solution aimed at the enterprise market. The system consists of a back-end architectured as a grid of storage nodes built around a distributed hash table; and a front-end consisting of a layer of access nodes which implement a traditional file system interface and can be scaled in number for increased performance.\n\nThis paper concentrates on the back-end which is, to our knowledge, the first commercial implementation of a scalable, high-performance content-addressable secondary storage delivering global duplicate elimination, per-block user-selectable failure resiliency, self-maintenance including automatic recovery from failures with data and network overlay rebuilding.\n\nThe back-end programming model is based on an abstraction of a sea of variable-sized, content-addressed, immutable, highly-resilient data blocks organized in a DAG (directed acyclic graph). This model is exported with a low-level API allowing clients to implement new access protocols and to add them to the system on-line. The API has been validated with an implementation of the file system interface.\n\nThe critical factor for meeting the design targets has been the selection of proper data organization based on redundant chains of data containers. We present this organization in detail and describe how it is used to deliver required data services. Surprisingly, the most complex to deliver turned out to be on-demand data deletion, followed (not surprisingly) by the management of data consistency and integrity.", "citation": "Citations (289)", "departments": ["NEC Laboratories America", "NEC Laboratorie ... atories America", "NEC Laboratorie ... atories America", "NEC Laboratorie ... atories America", "NEC Laboratorie ... atories America"], "authors": ["Cezary Dubnicki.....http://dblp.org/pers/hd/d/Dubnicki:Cezary", "Leszek Gryz.....http://dblp.org/pers/hd/g/Gryz:Leszek", "Lukasz Heldt.....http://dblp.org/pers/hd/h/Heldt:Lukasz", "Michal Kaczmarczyk.....http://dblp.org/pers/hd/k/Kaczmarczyk:Michal", "Wojciech Kilian.....http://dblp.org/pers/hd/k/Kilian:Wojciech", "Przemyslaw Strzelczak.....http://dblp.org/pers/hd/s/Strzelczak:Przemyslaw", "Jerzy Szczepkowski.....http://dblp.org/pers/hd/s/Szczepkowski:Jerzy", "Cristian Ungureanu.....http://dblp.org/pers/hd/u/Ungureanu:Cristian", "Michal Welnicki.....http://dblp.org/pers/hd/w/Welnicki:Michal"], "conf": "fast", "year": "2009", "pages": 14}