{"title": "Detecting Selfish Exploitation of Carrier Sensing in 802.11 Networks.", "fields": ["network packet", "power control", "false positive rate", "bandwidth allocation", "throughput"], "abstract": "Recently, tuning the clear channel assessment (CCA) threshold in conjunction with power control has been considered for improving the performance of Wireless LANs. However, CCA tuning can be exploited by selfish nodes in order to obtain an unfair share of the available bandwidth. In particular, by increasing the CCA threshold, a selfish client can manipulate the carrier sensing mechanism to ignore the presence of other transmissions on the medium; consequently, it increases the probability of accessing the medium and therefore obtains a higher, unfair share of the available bandwidth. In this paper, we propose a novel approach to detect this misbehavior in WLANs. A key insight that leads to our approach is that a misbehaving node that has increased its CCA is unlikely to recognize low power receptions as legitimate packets; by intelligently sending low power probe messages, an AP can detect a misbehaving node with high probability. In a nutshell, our contributions are as follows: (a) We are the first to quantify the impact of selfish CCA tuning via extensive experimentation (b) We propose a novel lightweight scheme for detecting selfish nodes that inappropriately increase their CCA thresholds; we call our scheme CMD (for Carrier sensing Misbehavior Detection) (c) We perform extensive evaluations on an indoor 802.11 WLAN testbed to demonstrate that CMD detects misbehaving users with very high accuracy (approximately 95 % of the time). Furthermore, it only incurs a false positive rate of less than 5 % 1 .", "citation": "Citations (34)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "authors": ["Konstantinos Pelechrinis.....http://dblp.org/pers/hd/p/Pelechrinis:Konstantinos", "Guanhua Yan.....http://dblp.org/pers/hd/y/Yan:Guanhua", "Stephan Eidenbenz.....http://dblp.org/pers/hd/e/Eidenbenz:Stephan", "Srikanth V. Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Srikanth_V="], "conf": "infocom", "year": "2009", "pages": 9}