{"title": "Short-term audio-visual atoms for generic video concept classification.", "fields": ["codebook", "discriminative model", "computer vision", "multimedia", "clutter"], "abstract": "We investigate the challenging issue of joint audio-visual analysis of generic videos targeting at semantic concept detection. We propose to extract a novel representation, the Short-term Audio-Visual Atom (S-AVA), for improved concept detection. An S-AVA is defined as a short-term region track associated with regional visual features and background audio features. An effective algorithm, named Short-Term Region tracking with joint Point Tracking and Region Segmentation (STR-PTRS), is developed to extract S-AVAs from generic videos under challenging conditions such as uneven lighting, clutter, occlusions, and complicated motions of both objects and camera. Discriminative audio-visual codebooks are constructed on top of S-AVAs using Multiple Instance Learning. Codebook-based features are generated for semantic concept detection. We extensively evaluate our algorithm over Kodak's consumer benchmark video set from real users. Experimental results confirm significant performance improvements - over 120% MAP gain compared to alternative approaches using static region segmentation without temporal tracking. The joint audio-visual features also outperform visual features alone by an average of 8.5% (in terms of AP) over 21 concepts, with many concepts achieving more than 20%.", "citation": "Citations (73)", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Eastman Kodak Company"], "authors": ["Wei Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Wei", "Courtenay V. Cotton.....http://dblp.org/pers/hd/c/Cotton:Courtenay_V=", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu", "Dan Ellis.....http://dblp.org/pers/hd/e/Ellis:Dan", "Alexander C. Loui.....http://dblp.org/pers/hd/l/Loui:Alexander_C="], "conf": "mm", "year": "2009", "pages": 10}