{"title": "Reach.", "fields": ["research design", "rasirna", "cooperative diversity", "passive optical network", "alternative medicine", "robotics", "sampling", "health policy", "rna silencing", "educational technology", "pathology", "next generation network", "caret", "optical amplifier", "packet switching", "guideline", "family medicine", "flipped classroom", "applied research", "communications system", "snowball sampling", "trans acting sirna", "scalability", "risk analysis", "argonaute", "synchronization", "health services research", "health education", "rde 1", "data collection", "wavelength division multiplexing", "tetraplegia", "brain computer interface", "clinical practice", "cursor", "teacher education", "grasp", "selection bias", "flooding"], "abstract": "It started with a simple observation: students need their teachers present to answer questions or to provide help if they get stuck on an assignment; they don't need their teachers present to listen to a lecture or review content. From there, Jonathan Bergmann and Aaron Sams began the flipped classroom-students watched recorded lectures for homework and completed their assignments, labs, and tests in class with their teacher available.    What Bergmann and Sams found was that their students demonstrated a deeper understanding of the material than ever before. This is the authors story, and they're confident it can be yours too. Learn what a flipped classroom is and why it works and get the information you need to flip a classroom.    You'll also learn the flipped mastery model, where students learn at their own pace-furthering opportunities for personalised education. This simple concept is easily replicable in any classroom, doesn't cost much to implement, and helps foster self-directed learning. Once you flip, you wont want to go back!    The International Society for Technology in Education (ISTE) is the trusted source for professional development, knowledge generation, advocacy and leadership for innovation. ISTE is the premier membership association for educators and education leaders engaged in improving teaching and learning by advancing the effective use of technology in PK-12 and teacher education. Home of the National Educational Technology Standards (NETS), the Centre for Applied Research in Educational Technology (CARET), and ISTE's annual conference (formerly known as the National Educational Computing Conference, or NECC), ISTE represents more than 100,000 professionals worldwide. We support our members with information, networking opportunities, and guidance as they face the challenge of transforming education.", "citation": "Citations (981)", "departments": ["Motorola", "Siemens IT Solutions and Services", "Swansea University", "University of Leicester", "University of Leicester", "Stony Brook University", "Cold Spring Harbor Laboratory", "Cold Spring Harbor Laboratory", "Cold Spring Harbor Laboratory", "McMaster University", "McMaster University", "University of Medicine and Dentistry of New Jersey", "Brown University", "Cornell University", "Cornell University", "BT, Ipswich", "BT, Ipswich", "Istituto Nazion ... ri Regina Elena"], "authors": ["Luke Randall.....http://dblp.org/pers/hd/r/Randall:Luke"], "conf": "siggraph", "year": "2009", "pages": 1}