{"title": "Coordinated Task Scheduling, Allocation and Synchronization on Multiprocessors.", "fields": ["job shop scheduling", "dynamic priority scheduling", "posix threads", "critical section", "shared resource"], "abstract": "Chip-multiprocessors represent a dominant new shift in the field of processor design. Better utilization of such technology in the real-time context requires coordinated approaches to task allocation, scheduling, and synchronization. In this paper, we characterize various scheduling penalties arising from multiprocessor task synchronization, including (i) blocking delays on global critical sections, (ii) back-to-back execution due to jitter from blocking, and (iii) multiple priority inversions due to remote resource sharing. We analyze the impact of these scheduling penalties under different execution control policies (ECPs) which compensate for the scheduling penalties incurred by tasks due to remote blocking. Subsequently, we develop a synchronization-aware task allocation algorithm for explicitly accommodating these global task synchronization penalties. The key idea of our algorithm is to bundle tasks that access a common shared resource and co-locate them, thereby transforming global resource sharing into local sharing. This approach reduces the above-mentioned penalties associated with remote task synchronization. Experimental results indicate that such a coordinated approach to scheduling, allocation, and synchronization yields significant benefits (as much as 50% savings in terms of required number of processing cores). An implementation of this approach is available as a part of our RT-MAP library, which uses the pthreads implementation of Linux-2.6.22.", "citation": "Citations (139)", "year": "2009", "departments": ["Carnegie Mellon University", "Software Engineering Institute", "Carnegie Mellon University"], "conf": "rtss", "authors": ["Karthik Lakshmanan.....http://dblp.org/pers/hd/l/Lakshmanan:Karthik", "Dionisio de Niz.....http://dblp.org/pers/hd/n/Niz:Dionisio_de", "Ragunathan Rajkumar.....http://dblp.org/pers/hd/r/Rajkumar:Ragunathan"], "pages": 10}