{"title": "PortLand: a scalable fault-tolerant layer 2 data center network fabric.", "fields": ["data link layer", "network layer", "network architecture", "data center network architectures", "virtualization"], "abstract": "This paper considers the requirements for a scalable, easily manageable, fault-tolerant, and efficient data center network fabric. Trends in multi-core processors, end-host virtualization, and commodities of scale are pointing to future single-site data centers with millions of virtual end points. Existing layer 2 and layer 3 network protocols face some combination of limitations in such a setting: lack of scalability, difficult management, inflexible communication, or limited support for virtual machine migration. To some extent, these limitations may be inherent for Ethernet/IP style protocols when trying to support arbitrary topologies. We observe that data center networks are often managed as a single logical network fabric with a known baseline topology and growth model. We leverage this observation in the design and implementation of PortLand, a scalable, fault tolerant layer 2 routing and forwarding protocol for data center environments. Through our implementation and evaluation, we show that PortLand holds promise for supporting a ``plug-and-play\" large-scale, data center network.", "citation": "Citations (1,250)", "year": "2009", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "sigcomm", "authors": ["Radhika Niranjan Mysore.....http://dblp.org/pers/hd/m/Mysore:Radhika_Niranjan", "Andreas Pamboris.....http://dblp.org/pers/hd/p/Pamboris:Andreas", "Nathan Farrington.....http://dblp.org/pers/hd/f/Farrington:Nathan", "Nelson Huang.....http://dblp.org/pers/hd/h/Huang:Nelson", "Pardis Miri.....http://dblp.org/pers/hd/m/Miri:Pardis", "Sivasankar Radhakrishnan.....http://dblp.org/pers/hd/r/Radhakrishnan:Sivasankar", "Vikram Subramanya.....http://dblp.org/pers/hd/s/Subramanya:Vikram", "Amin Vahdat.....http://dblp.org/pers/hd/v/Vahdat:Amin"], "pages": 12}