{"title": "Sensor Network Navigation without Locations.", "fields": ["visual sensor network", "turn by turn navigation", "mobile robot navigation", "road map", "key distribution in wireless sensor networks", "dead reckoning", "navigation system", "cyber physical system"], "abstract": "We propose a pervasive usage of the sensor network infrastructure as a cyber-physical system for navigating internal users in locations of potential danger. Our proposed application differs from previous work in that they typically treat the sensor network as a media of data acquisition while in our navigation application, in-situ interactions between users and sensors become ubiquitous. In addition, human safety and time factors are critical to the success of our objective. Without any pre-knowledge of user and sensor locations, the design of an effective and efficient navigation protocol faces non-trivial challenges. We propose to embed a road map system in the sensor network without location information so as to provide users navigating routes with guaranteed safety. We accordingly design efficient road map updating mechanisms to rebuild the road map in the event of changes in dangerous areas. In this navigation system, each user only issues local queries to obtain their navigation route. The system is highly scalable for supporting multiple users simultaneously. We implement a prototype system with 36 TelosB motes to validate the effectiveness of this design. We further conduct comprehensive and large-scale simulations to examine the efficiency and scalability of the proposed approach under various environmental dynamics.", "citation": "Citations (90)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University", "Hong Kong University of Science and Technology", "Nanyang Technological University", "Tsinghua University", "Tsinghua University"], "authors": ["Mo Li.....http://dblp.org/pers/hd/l/Li:Mo", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Jiliang Wang.....http://dblp.org/pers/hd/w/Wang:Jiliang", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng"], "conf": "infocom", "year": "2009", "pages": 9}