{"title": "Proportional Fair Frequency-Domain Packet Scheduling for 3GPP LTE Uplink.", "fields": ["proportionally fair", "fair share scheduling", "frequency division multiple access", "round robin scheduling", "maximum throughput scheduling"], "abstract": "With the power consumption issue of mobile handset taken into account, single-carrier FDMA (SC-FDMA) has been selected for 3GPP long-term evolution (LTE) uplink multiple access scheme. Like in OFDMA downlink, it enables multiple users to be served simultaneously in uplink as well. However, its single carrier property requires that all the subcarriers allocated to a single user must be contiguous in frequency within each time slot. This contiguous allocation constraint limits the scheduling flexibility, and frequency-domain packet scheduling algorithms in such system need to incorporate this constraint while trying to maximize their own scheduling objectives. In this paper we explore this fundamental problem of LTE SC-FDMA uplink scheduling by adopting the conventional time-domain proportional fair algorithm to maximize its objective (i.e. proportional fair criteria) in the frequency-domain setting. We show the NP-hardness of the frequency-domain scheduling problem under this contiguous allocation constraint and present a set of practical algorithms fine tuned to this problem. We demonstrate that competitive performance can be achieved in terms of system throughput as well as fairness perspective, which is evaluated using 3GPP LTE system model simulations.", "citation": "Citations (305)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "Huawei", "University of California, Los Angeles"], "authors": ["Suk-Bok Lee.....http://dblp.org/pers/hd/l/Lee:Suk=Bok", "Ioannis Pefkianakis.....http://dblp.org/pers/hd/p/Pefkianakis:Ioannis", "Adam Meyerson.....http://dblp.org/pers/hd/m/Meyerson:Adam", "Shugong Xu.....http://dblp.org/pers/hd/x/Xu:Shugong", "Songwu Lu.....http://dblp.org/pers/hd/l/Lu:Songwu"], "conf": "infocom", "year": "2009", "pages": 5}