{"title": "Practical Cryptanalysis of iso/iec 9796-2 and emv Signatures.", "fields": ["payment card", "cryptanalysis", "computer science", "computer security", "cryptographic hash function", "modulus", "digital signature"], "abstract": "In 1999, Coron, Naccache and Stern discovered an existential signature forgery for two popular rsa signature standards, iso/iec 9796-1 and 2. Following this attack iso/iec 9796-1 was withdrawn. iso/iec 9796-2 was amended by increasing the message digest to at least 160 bits. Attacking this amended version required at least 261 operations.\n\nIn this paper, we exhibit algorithmic refinements allowing to attack the amended (currently valid) version of iso/iec 9796-2 for all modulus sizes. A practical forgery was computed in only two days using 19 servers on the Amazon ec2 grid for a total cost of $\\simeq\\mbox{{\\sc us\\$800}}$. The forgery was implemented for e = 2 but attacking odd exponents will not take longer. The forgery was computed for the rsa-2048 challenge modulus, whose factorization is still unknown.\n\nThe new attack blends several theoretical tools. These do not change the asymptotic complexity of Coron et al.'s technique but significantly accelerate it for parameter values previously considered beyond reach.\n\nWhile less efficient (us$45,000), the acceleration also extends to emv signatures. emv is an iso/iec 9796-2-compliant format with extra redundancy. Luckily, this attack does not threaten any of the 730 million emv payment cards in circulation for operational reasons.\n\nCosts are per modulus: after a first forgery for a given modulus, obtaining more forgeries is virtually immediate.", "citation": "Not cited", "departments": ["École Normale Supérieure", "École Normale Supérieure", "Université du L ... embourg l-1359", "Université du L ... embourg l-1359"], "authors": ["Jean-Sébastien Coron.....http://dblp.org/pers/hd/c/Coron:Jean=S=eacute=bastien", "David Naccache.....http://dblp.org/pers/hd/n/Naccache:David", "Mehdi Tibouchi.....http://dblp.org/pers/hd/t/Tibouchi:Mehdi", "Ralf-Philipp Weinmann.....http://dblp.org/pers/hd/w/Weinmann:Ralf=Philipp"], "conf": "crypto", "year": "2009", "pages": 17}