{"title": "Bridging the computation gap between programmable processors and hardwired accelerators.", "fields": ["reusability", "openrisc", "application specific integrated circuit", "electrical efficiency", "reduced instruction set computing"], "abstract": "New media and signal processing applications demand ever higher performance while operating within the tight power constraints of mobile devices. A range of hardware implementations is available to deliver computation with varying degrees of area and power efficiency, from general-purpose processors to application-specific integrated circuits (ASICs). The tradeoff of moving towards more efficient customized solutions such as ASICs is the lack of flexibility in terms of hardware reusability and programmability. In this paper, we propose a customized semi-programmable loop accelerator architecture that exploits the efficiency gains available through high levels of customization, while maintaining sufficient flexibility to execute multiple similar loops. A customized instance of the loop accelerator architecture is generated for a particular loop and then the data and control paths are proactively generalized in an efficient manner to increase flexibility. A compiler mapping phase is then able to map other loops onto the same hardware. The efficiency of the programmable accelerator is compared with non-programmable accelerators and with the OpenRISC 1200 general purpose processor. The programmable accelerator is able to achieve up to 34x better power efficiency and 30x better area efficiency than a simple general purpose processor, while trading off as little as 2x power and area efficiency to the non-programmable accelerator.", "citation": "Citations (83)", "departments": ["Nvidia", "University of Michigan", "University of Michigan", "Parakinetics, Inc., USA"], "authors": ["Kevin Fan.....http://dblp.org/pers/hd/f/Fan:Kevin", "Manjunath Kudlur.....http://dblp.org/pers/hd/k/Kudlur:Manjunath", "Ganesh S. Dasika.....http://dblp.org/pers/hd/d/Dasika:Ganesh_S=", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A="], "conf": "hpca", "year": "2009", "pages": 10}