{"title": "Spatial SINR Games Combining Base Station Placement and Mobile Association.", "fields": ["radio spectrum", "mobile radio", "single antenna interference cancellation", "frequency band", "stackelberg competition"], "abstract": "We study in this paper the question of determining locations of base stations (BSs) that may belong to the same or to competing service providers, taking into account the impact of these decisions on the behavior of intelligent mobile terminals who can connect to the base station that offers the best utility. We first study the SINR association-game: we determine the cells corresponding to each base stations, i.e. the locations at which mobile terminals prefer to connect to a given base station than to other. The signal to interference and noise ratio (SINR) is used as the quantity that determines the association. We make some surprising observations: (i) displacing a base station a little in one direction may result in a displacement of the boundary of the corresponding cell to the opposite direction; (ii) A cell corresponding to a BS may be the union of disconnected sub-cells. We then study the Stackelberg equilibrium in the combined BS location and mobile association problem: we determine where to locate the BSs so as to maximize the revenues obtained at the induced SINR mobile association game. We consider the cases of single frequency band and two frequency bands of operation. Finally, we also consider Stackelberg equilibria in two frequency systems with successive interference cancellation.", "citation": "Citations (59)", "departments": ["French Institute for Research in Computer Science and Automation", "Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science"], "authors": ["Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan", "Anurag Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Anurag", "Chandramani Kishore Singh.....http://dblp.org/pers/hd/s/Singh:Chandramani_Kishore", "Rajesh Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Rajesh"], "conf": "infocom", "year": "2009", "pages": 9}