{"title": "Detecting and tolerating asymmetric races.", "fields": ["lock", "executable", "thread", "critical section", "race condition"], "abstract": "This paper introduces ToleRace, a runtime system that allows programs to detect and even tolerate asymmetric data races. Asymmetric races are race conditions where one thread correctly acquires and releases a lock for a shared variable while another thread improperly accesses the same variable. ToleRace provides approximate isolation in the critical sections of lock-based parallel programs by creating a local copy of each shared variable when entering a critical section, operating on the local copies, and propagating the appropriate copies upon leaving the critical section. We start by characterizing all possible interleavings that can cause races and precisely describe the effect of ToleRace in each case. Then, we study the theoretical aspects of an oracle that knows exactly what type of interleaving has occurred. Finally, we present two software implementations of ToleRace and evaluate them on multithreaded applications from the SPLASH2 and PARSEC suites. Our implementation on top of a dynamic instrumentation tool, which works directly on executables and requires no source code modifications, incurs an overhead of a factor of two on average. Manually adding ToleRace to the source code of these applications results in an average overhead of 6.4 percent.", "citation": "Citations (79)", "year": "2009", "departments": ["Cornell University", "University of Texas at Austin", "Microsoft", "Microsoft", "Indian Institute of Science"], "conf": "ppopp", "authors": ["Paruj Ratanaworabhan.....http://dblp.org/pers/hd/r/Ratanaworabhan:Paruj", "Martin Burtscher.....http://dblp.org/pers/hd/b/Burtscher:Martin", "Darko Kirovski.....http://dblp.org/pers/hd/k/Kirovski:Darko", "Benjamin G. Zorn.....http://dblp.org/pers/hd/z/Zorn:Benjamin_G=", "Rahul Nagpal.....http://dblp.org/pers/hd/n/Nagpal:Rahul", "Karthik Pattabiraman.....http://dblp.org/pers/hd/p/Pattabiraman:Karthik"], "pages": 12}