{"title": "Respondent-Driven Sampling for Characterizing Unstructured Overlays.", "fields": ["snowball sampling", "random walk", "clustering coefficient", "overlay network", "overlay"], "abstract": "short-lived or high degree peers due to the dynamics of peer participation or the heterogeneity of peer degrees, respectively. This paper presents Respondent-Driven Sampling (RDS) as a promising technique for sampling unstructured P2P overlays. This allows one to accurately estimate the distribution of a desired peer property without capturing the entire overlay structure. RDS is a variant of snowball sampling that has been proposed and used in the social sciences to characterize hidden population in a society [9], [13]. We apply the RDS technique to unstructured P2P network and evaluate its performance over a wide range of static and dynamic graphs as well as a widely deployed P2P system. Throughout our evaluation, we compare and contrast the performance of the RDS technique with another sampling technique, namely Metropolized Random Walk (MRW), that we developed in our earlier work [16]. Our main findings can be summarized as follows: First, RDS outperforms MRW across all scenarios. In particular, RDS exhibits a significantly better performance than MRW when the overlay structure exhibits a combination of highly skewed node degrees and highly skewed (local) clustering coefficients. Second, our simulation and empirical evaluations reveal that both the RDS and MRW techniques can accurately estimate key peer properties over dynamic unstructured overlays. Third, our empirical evaluations suggest that the efficiency of the two sampling techniques in practice is lower than in our simulations involving synthetic graphs. We attribute this to our inability to capture accurate reference snapshots. The rest of the paper is organized as follows: Section II presents an overview of both the RDS and MRW techniques, and sketches our evaluation methodology. We examine both techniques over variety of static and dynamic graphs in Section III and IV, respectively. Section V presents the empirical evaluation of the two sampling techniques over Gnutella network.", "citation": "Citations (84)", "departments": ["University of Oregon", "University of Oregon", "University of Oregon", "AT&T Labs", "AT&T Labs"], "authors": ["Amir Hassan Rasti.....http://dblp.org/pers/hd/r/Rasti:Amir_Hassan", "Mojtaba Torkjazi.....http://dblp.org/pers/hd/t/Torkjazi:Mojtaba", "Reza Rejaie.....http://dblp.org/pers/hd/r/Rejaie:Reza", "Nick G. Duffield.....http://dblp.org/pers/hd/d/Duffield:Nick_G=", "Walter Willinger.....http://dblp.org/pers/hd/w/Willinger:Walter", "Daniel Stutzbach.....http://dblp.org/pers/hd/s/Stutzbach:Daniel"], "conf": "infocom", "year": "2009", "pages": 5}