{"title": "StatSnowball: a statistical approach to extracting entity relationships.", "fields": ["heuristic", "information extraction", "small number", "relationship extraction", "bootstrapping"], "abstract": "Traditional relation extraction methods require pre-specified relations and relation-specific human-tagged examples. Bootstrapping systems significantly reduce the number of training examples, but they usually apply heuristic-based methods to combine a set of strict hard rules, which limit the ability to generalize and thus generate a low recall. Furthermore, existing bootstrapping methods do not perform open information extraction (Open IE), which can identify various types of relations without requiring pre-specifications. In this paper, we propose a statistical extraction framework called  Statistical Snowball  (StatSnowball), which is a bootstrapping system and can perform both traditional relation extraction and Open IE.   StatSnowball uses the discriminative Markov logic networks (MLNs) and softens hard rules by learning their weights in a maximum likelihood estimate sense. MLN is a general model, and can be configured to perform different levels of relation extraction. In StatSnwoball, pattern selection is performed by solving an l 1 -norm penalized maximum likelihood estimation, which enjoys well-founded theories and efficient solvers. We extensively evaluate the performance of StatSnowball in different configurations on both a small but fully labeled data set and large-scale Web data. Empirical results show that StatSnowball can achieve a significantly higher recall without sacrificing the high precision during iterations with a small number of seeds, and the joint inference of MLN can improve the performance. Finally, StatSnowball is efficient and we have developed a working entity relation search engine called  Renlifang  based on it.", "citation": "Citations (306)", "departments": ["Tsinghua University", "Microsoft", "University of Science and Technology of China", "Tsinghua University", "Microsoft"], "authors": ["Jun Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Jun", "Zaiqing Nie.....http://dblp.org/pers/hd/n/Nie:Zaiqing", "Xiaojiang Liu.....http://dblp.org/pers/hd/l/Liu:Xiaojiang", "Bo Zhang.....http://dblp.org/pers/hd/z/Zhang_0010:Bo", "Ji-Rong Wen.....http://dblp.org/pers/hd/w/Wen:Ji=Rong"], "conf": "www", "year": "2009", "pages": 10}