{"title": "Building Specialized Multilingual Lexical Graphs Using Community Resources.", "fields": ["machine translation", "silk", "lexical item", "online community", "graph"], "abstract": "We are describing methods for compiling domain-dedicated multilingual terminological data from various resources. We focus on collecting data from online community users as a main source, therefore, our approach depends on acquiring contributions from volunteers (explicit approach), and it depends on analyzing users' behaviors to extract interesting patterns and facts (implicit approach). As a generic repository that can handle the collected multilingual terminological data, we are describing the concept of dedicated Multilingual Preterminological Graphs MPGs, and some automatic approaches for constructing them by analyzing the behavior of online community users. A Multilingual Preterminological Graph is a special lexical resource that contains massive amount of terms related to a special domain. We call it preterminological, because it is a raw material that can be used to build a standardized terminological repository. Building such a graph is difficult using traditional approaches, as it needs huge efforts by domain specialists and terminologists. In our approach, we build such a graph by analyzing the access log files of the website of the community, and by finding the important terms that have been used to search in that website, and their association with each other. We aim at making this graph as a seed repository so multilingual volunteers can contribute. We are experimenting this approach with the Digital Silk Road Project. We have used its access log files since its beginning in 2003, and obtained an initial graph of around 116000 terms. As an application, we used this graph to obtain a preter-minological multilingual database that is serving a CLIR system for the DSR project.", "citation": "Citations (1)", "departments": ["Joseph Fourier University", "Joseph Fourier University", "University of Tokyo", "National Institute of Informatics", "Joseph Fourier University"], "authors": ["Mohammad Daoud.....http://dblp.org/pers/hd/d/Daoud:Mohammad", "Christian Boitet.....http://dblp.org/pers/hd/b/Boitet:Christian", "Kyo Kageura.....http://dblp.org/pers/hd/k/Kageura:Kyo", "Asanobu Kitamoto.....http://dblp.org/pers/hd/k/Kitamoto:Asanobu", "Mathieu Mangeot.....http://dblp.org/pers/hd/m/Mangeot:Mathieu", "Daoud Daoud.....http://dblp.org/pers/hd/d/Daoud:Daoud"], "conf": "vldb", "year": "2009", "pages": 16}