{"title": "Time Valid One-Time Signature for Time-Critical Multicast Data Authentication.", "fields": ["xcast", "hash chain", "end to end delay", "source specific multicast", "data authentication algorithm"], "abstract": "It is challenging to provide authentication to time-critical multicast data, where low end-to-end delay is of crucial importance. Consequently, it requires not only efficient authentication algorithms to minimize computational cost, but also avoidance of buffering packets so that the data can be immediately processed once being presented. Desirable properties for a multicast authentication scheme also include small communication overhead, tolerance to packet loss, and resistance against malicious attacks. In this paper, we propose a novel signature model - Time Valid One-Time Signature (TV-OTS) - to boost the efficiency of regular one-time signature schemes. Based on the TV-OTS model, we design an efficient multicast authentication scheme \"TV-HORS\" to meet the above needs. TV-HORS combines one-way hash chains with TV-OTS to avoid frequent public key distribution. It provides fast signing/verification and buffering-free data processing, which make it one of the fastest multicast authentication schemes to date in terms of end-to-end computational latency (on the order of microseconds). In addition, TV-HORS has perfect tolerance to packet loss and strong robustness against malicious attacks. The communication overhead of TV-HORS is much smaller than regular OTS schemes, and even smaller than RSA signature. The only drawback of TV-HORS is a relatively large public key of size 8 KB to 10 KB, depending on parameters.", "citation": "Citations (86)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Qiyan Wang.....http://dblp.org/pers/hd/w/Wang:Qiyan", "Himanshu Khurana.....http://dblp.org/pers/hd/k/Khurana:Himanshu", "Ying Huang.....http://dblp.org/pers/hd/h/Huang:Ying", "Klara Nahrstedt.....http://dblp.org/pers/hd/n/Nahrstedt:Klara"], "conf": "infocom", "year": "2009", "pages": 9}