{"title": "Passive Loss Inference in Wireless Sensor Networks Based on Network Coding.", "fields": ["mobile wireless sensor network", "lossy compression", "network packet", "linear network coding", "key distribution in wireless sensor networks"], "abstract": "The highly stochastic nature of wireless environ- ments makes it desirable to monitor link loss rates in wireless sensor networks. In this paper, we study the loss inference problem in sensor networks with network coding. Unlike tra- ditional transmission protocols, network coding offers reliable communication without using control messages for individual packets. We show, however, that network coding changes the fundamental connection between path and link loss probabilities such that new inference algorithms need to be developed. As end- to-end data are not sufficient to compute link loss rates precisely, we propose inference algorithms based on Bayesian principles to discover the set of highly lossy links in sensor networks. We show that our algorithms achieve high detection and low false-positive rates through extensive simulations. I. INTRODUCTION Recent technological advances have made it feasible to de- ploy large-scale sensor networks using low-cost sensor nodes. However, as the scale of sensor networks becomes larger, two key challenges potentially arise. First, node failures .D ue to their inherent instability and energy constraints, sensor nodes are prone to failures. It would thus be useful to determine which set of nodes or which geographical areas within the network are experiencing high loss rates. Such information is potentially valuable to the design of fault-tolerant protocols or monitoring mechanisms, so that the problem areas may be re-deployed, and critical data may be rerouted to avoid these failure-prone areas suffering high loss rates. Second, bandwidth constraints. One cannot rely on the use of active acknowledgments, which are neither scalable nor bandwidth- efficient, in the design of sensor network protocols. This renders the direct collection of loss rate data impossible in", "citation": "Citations (19)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Yunfeng Lin.....http://dblp.org/pers/hd/l/Lin:Yunfeng", "Ben Liang.....http://dblp.org/pers/hd/l/Liang:Ben", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun"], "conf": "infocom", "year": "2009", "pages": 9}