{"title": "Audience selection for on-line brand advertising: privacy-friendly social network targeting.", "fields": ["business ethics", "social theory", "social network", "analogy", "user generated content"], "abstract": "This paper describes and evaluates privacy-friendly methods for extracting quasi-social networks from browser behavior on user-generated content sites, for the purpose of finding good audiences for brand advertising (as opposed to click maximizing, for example). Targeting social-network neighbors resonates well with advertisers, and on-line browsing behavior data counterintuitively can allow the identification of good audiences anonymously. Besides being one of the first papers to our knowledge on data mining for on-line brand advertising, this paper makes several important contributions. We introduce a framework for evaluating brand audiences, in analogy to predictive-modeling holdout evaluation. We introduce methods for extracting quasi-social networks from data on visitations to social networking pages, without collecting any information on the identities of the browsers or the content of the social-network pages. We introduce measures of brand proximity in the network, and show that audiences with high brand proximity indeed show substantially higher brand affinity. Finally, we provide evidence that the quasi-social network embeds a true social network, which along with results from social theory offers one explanation for the increase in brand affinity of the selected audiences.", "citation": "Citations (153)", "departments": ["NYU & Media6deg ... , New York, USA", "Media6degrees, New York, USA", "Coriolis Ventur ... , New York, USA", "NYU & Media6deg ... , New York, USA", "Coriolis Ventur ... , New York, USA"], "authors": ["Foster J. Provost.....http://dblp.org/pers/hd/p/Provost:Foster_J=", "Brian Dalessandro.....http://dblp.org/pers/hd/d/Dalessandro:Brian", "Rod Hook.....http://dblp.org/pers/hd/h/Hook:Rod", "Xiaohan Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiaohan", "Alan Murray.....http://dblp.org/pers/hd/m/Murray:Alan"], "conf": "kdd", "year": "2009", "pages": 10}