{"title": "Using a configurable processor generator for computer architecture prototyping.", "fields": ["memory architecture", "development environment", "tape out", "programming paradigm", "compiler"], "abstract": "Building hardware prototypes for computer architecture research is challenging. Unfortunately, development of the required software tools (compilers, debuggers, runtime) is even more challenging, which means these systems rarely run real applications. To overcome this issue, when developing our prototype platform, we used the Tensilica processor generator to produce a customized processor and corresponding software tools and libraries. While this base processor was very different from the streamlined custom processor we initially imagined, it allowed us to focus on our main objective---the design of a reconfigurable CMP memory system---and to successfully tape out an 8-core CMP chip with only a small group of designers. One person was able to handle processor configuration and hardware generation, support of a complete software tool chain, as well as developing the custom runtime software to support three different programming models. Having a sophisticated software tool chain not only allowed us to run more applications on our machine, it once again pointed out the need to use optimized code to get an accurate evaluation of architectural features.", "citation": "Citations (9)", "departments": ["Stanford University", "Stanford University", "Stanford University", "Hicamp Systems, Inc., USA", "Hicamp Systems, Inc., USA"], "authors": ["Alex Solomatnikov.....http://dblp.org/pers/hd/s/Solomatnikov:Alex", "Amin Firoozshahian.....http://dblp.org/pers/hd/f/Firoozshahian:Amin", "Ofer Shacham.....http://dblp.org/pers/hd/s/Shacham:Ofer", "Zain Asgar.....http://dblp.org/pers/hd/a/Asgar:Zain", "Megan Wachs.....http://dblp.org/pers/hd/w/Wachs:Megan", "Wajahat Qadeer.....http://dblp.org/pers/hd/q/Qadeer:Wajahat", "Stephen Richardson.....http://dblp.org/pers/hd/r/Richardson:Stephen", "Mark Horowitz.....http://dblp.org/pers/hd/h/Horowitz:Mark"], "conf": "micro", "year": "2009", "pages": 12}