{"title": "Hippocratic PostgreSQL.", "fields": ["k anonymity", "hippocratic oath", "information privacy", "hierarchy", "sql"], "abstract": "Privacy preservation has become an important requirement in information systems that deal with personal data. In many cases this requirement is imposed by laws that recognize the right of data owners to control whom their information is shared with and the purposes for which it can be shared. Hippocratic databases have been proposed as an answer to this privacy requirement; they extend the architecture of standard DBMSs with components that ensure personal data is handled in compliance with its associated privacy definitions. Previous work in Hippocratic databases has proposed the design of some of these components. Unfortunately, there has not been much work done to implement these components as an integral part of a DBMS and study the problems faced to realize the Hippocratic databases. The main goal of the 'Hippocratic PostgreSQL' project is to perform this implementation and study. The project includes the implementation of components to support limited disclosure, limited retention time, and management of multiple policies and policy versions. This demo presents the use of these components both from a terminal-based SQL command interface and through a Web-based healthcare application that makes use of the implemented database-level privacy features. Hippocratic PostgreSQL has the novel feature of augmenting both k-anonymity and generalization hierarchies into the Hippocratic DBMS engine functionality. Several interesting problems emerge as a result and their solutions are presented in the context of this demo.", "citation": "Citations (6)", "departments": ["Purdue University", "Purdue University", "Purdue University", "Purdue University"], "authors": ["Jalaja Padma.....http://dblp.org/pers/hd/p/Padma:Jalaja", "Yasin N. Silva.....http://dblp.org/pers/hd/s/Silva:Yasin_N=", "Muhammad U. Arshad.....http://dblp.org/pers/hd/a/Arshad:Muhammad_U=", "Walid G. Aref.....http://dblp.org/pers/hd/a/Aref:Walid_G="], "conf": "icde", "year": "2009", "pages": 4}