{"title": "Fair and balanced?: bias in bug-fix datasets.", "fields": ["predictive modelling", "software regression", "source code", "tracking system", "generalizability theory"], "abstract": "Software engineering researchers have long been interested in where and why bugs occur in code, and in predicting where they might turn up next. Historical bug-occurence data has been key to this research. Bug tracking systems, and code version histories, record when, how and by whom bugs were fixed; from these sources, datasets that relate file changes to bug fixes can be extracted. These historical datasets can be used to test hypotheses concerning processes of bug introduction, and also to build statistical bug prediction models. Unfortunately, processes and humans are imperfect, and only a  fraction  of bug fixes are actually labelled in source code version histories, and thus become available for study in the extracted datasets. The question naturally arises, are the bug fixes recorded in these historical datasets a fair representation of the full population of bug fixes? In this paper, we investigate historical data from several software projects, and find strong evidence of systematic bias. We then investigate the potential effects of \" unfair, imbalanced \" datasets on the performance of prediction techniques. We draw the lesson that bias is a critical problem that threatens both the effectiveness of processes that rely on biased datasets to build prediction models and the generalizability of hypotheses tested on biased data.", "citation": "Citations (312)", "departments": ["University of California, Davis", "University of Zurich", "University of California, Davis", "University of California, Davis", "University of Zurich"], "authors": ["Christian Bird.....http://dblp.org/pers/hd/b/Bird:Christian", "Adrian Bachmann.....http://dblp.org/pers/hd/b/Bachmann:Adrian", "Eirik Aune.....http://dblp.org/pers/hd/a/Aune:Eirik", "John Duffy.....http://dblp.org/pers/hd/d/Duffy:John", "Abraham Bernstein.....http://dblp.org/pers/hd/b/Bernstein:Abraham", "Vladimir Filkov.....http://dblp.org/pers/hd/f/Filkov:Vladimir", "Premkumar T. Devanbu.....http://dblp.org/pers/hd/d/Devanbu:Premkumar_T="], "conf": "sigsoft", "year": "2009", "pages": 10}