{"title": "Efficient approximate entity extraction with edit distance constraints.", "fields": ["edit distance", "prefix", "document processing", "named entity recognition", "enumeration"], "abstract": "Named entity recognition aims at extracting named entities from unstructured text. A recent trend of named entity recognition is finding approximate matches in the text with respect to a large dictionary of known entities, as the domain knowledge encoded in the dictionary helps to improve the extraction performance.   In this paper, we study the problem of approximate dictionary matching with edit distance constraints. Compared to existing studies using token-based similarity constraints, our problem definition enables us to capture typographical or orthographical errors, both of which are common in entity extraction tasks yet may be missed by token-based similarity constraints. Our problem is technically challenging as existing approaches based on  q -gram filtering have poor performance due to the existence of many short entities in the dictionary. Our proposed solution is based on an improved neighborhood generation method employing novel partitioning and prefix pruning techniques. We also propose an efficient document processing algorithm that minimizes unnecessary comparisons and enumerations and hence achieves good scalability. We have conducted extensive experiments on several publicly available named entity recognition datasets. The proposed algorithm outperforms alternative approaches by up to an order of magnitude.", "citation": "Citations (130)", "year": "2009", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "University of Technology, Sydney"], "conf": "sigmod", "authors": ["Wei Wang.....http://dblp.org/pers/hd/w/Wang_0011:Wei", "Chuan Xiao.....http://dblp.org/pers/hd/x/Xiao:Chuan", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Chengqi Zhang.....http://dblp.org/pers/hd/z/Zhang:Chengqi"], "pages": 12}