{"title": "A hybrid generative/discriminative classification framework based on free-energy terms.", "fields": ["generative model", "contextual image classification", "discriminative model", "feature", "generative design"], "abstract": "Hybrid, generative-discriminative, techniques have proven to be valuable approaches in tackling difficult object or scene recognition problems. In general, a generative model over the available data for each image class is first learned providing a relatively comprehensive statistical multi-level representation. In this way, new meaningful image features become available, which encode the degree of fitness of the data with respect to the model at different representation levels. Such features are then fed into a discriminative classifier which can exploit the intrinsic data separability. In this paper, we propose the use of variational free energy terms as feature vectors, so that the degree of fitness of the data and the uncertainty over the generative process are explicitly included in the data description. The proposed method is automatically superior to a pure generative classification, and we also experimentally validate it on a wide selection of generative models applied to challenging benchmarks in hard computer vision tasks such as scene, object, and shape recognition. In several instances, the proposed approach outperforms the current state-of-the-art techniques as for classification results, while also showing to be computationally inexpensive.", "citation": "Citations (28)", "year": "2009", "departments": ["University of Verona", "University of Verona", "University of Verona", "University of Verona", "Microsoft"], "conf": "iccv", "authors": ["Alessandro Perina.....http://dblp.org/pers/hd/p/Perina:Alessandro", "Marco Cristani.....http://dblp.org/pers/hd/c/Cristani:Marco", "Umberto Castellani.....http://dblp.org/pers/hd/c/Castellani:Umberto", "Vittorio Murino.....http://dblp.org/pers/hd/m/Murino:Vittorio", "Nebojsa Jojic.....http://dblp.org/pers/hd/j/Jojic:Nebojsa"], "pages": 8}