{"title": "Null Keys: Limiting Malicious Attacks Via Null Space Properties of Network Coding.", "fields": ["coding theory", "subspace topology", "linear network coding", "hash function", "block code"], "abstract": "The performance of randomized network coding can suffer significantly when malicious nodes corrupt the content of the exchanged blocks. Previous work have introduced error correcting codes by generalizing some well known bounds in coding theory. Such codes are based on introducing redundancy in space domain. Other approaches require the use of homomorphic hashing functions, which are computationally expensive. In this paper, we present a novel and computationally efficient security algorithm, referred to as Null Keys, to detect and contain malicious attacks based on the subspace properties of random linear network coding. The participating nodes verify the integrity of a block by checking if it belongs to the subspace spanned by the source blocks. This is possible when every node has a vector orthogonal to all the combinations of the source blocks. These vectors, referred to as null keys, belong to the null space of the source blocks and go through a random combination when distributed by the source. Unlike previous security approaches, our Null Keys algorithm allows nodes to rapidly detect corrupted blocks without changing the code or imposing redundancy on the exchanged data. We analytically evaluate the pollution produced by jamming attacks, and demonstrate the effectiveness of Null Keys by varying the strength of the malicious nodes. We also show, through extensive simulations, that the Null Keys approach is more effective than cooperative security using homomorphic hashing when it comes to limiting the pollution spread.", "citation": "Citations (154)", "departments": ["University of Toronto", "University of Toronto"], "authors": ["Elias Kehdi.....http://dblp.org/pers/hd/k/Kehdi:Elias", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun"], "conf": "infocom", "year": "2009", "pages": 9}