{"title": "Memory-efficient optimization of Gyrokinetic particle-to-grid interpolation for multicore processors.", "fields": ["multi core processor", "grid", "sparse matrix", "particle number", "kernel method"], "abstract": "We present multicore parallelization strategies for the particle-to-grid interpolation step in the Gyrokinetic Toroidal Code (GTC), a 3D particle-in-cell (PIC) application to study turbulent transport in magnetic-confinement fusion devices. Particle-grid interpolation is a known performance bottleneck in several PIC applications. In GTC, this step involves particles depositing charges to a 3D toroidal mesh, and multiple particles may contribute to the charge at a grid point. We design new parallel algorithms for the GTC charge deposition kernel, and analyze their performance on three leading multicore platforms. We implement thirteen different variants for this kernel and identify the best-performing ones given typical PIC parameters such as the grid size, number of particles per cell, and the GTC-specific particle Larmor radius variation. We find that our best strategies can be 2x faster than the reference optimized MPI implementation, and our analysis provides insight into desirable architectural features for high-performance PIC simulation codes.", "citation": "Citations (22)", "year": "2009", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Princeton Plasma Physics Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory"], "conf": "sc", "authors": ["Kamesh Madduri.....http://dblp.org/pers/hd/m/Madduri:Kamesh", "Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel", "Stéphane Ethier.....http://dblp.org/pers/hd/e/Ethier:St=eacute=phane", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid", "John Shalf.....http://dblp.org/pers/hd/s/Shalf:John", "Erich Strohmaier.....http://dblp.org/pers/hd/s/Strohmaier:Erich", "Katherine A. Yelick.....http://dblp.org/pers/hd/y/Yelick:Katherine_A="], "pages": -1}