{"title": "Random graphs and the parity quantifier.", "fields": ["prime", "graph property", "random graph", "indifference graph", "almost surely", "joint probability distribution", "quantifier elimination", "rational number", "parity", "random regular graph"], "abstract": "The classical zero-one law for first-order logic on random graphs says that for every first-order property p in the theory of graphs and every  p  ∈ (0,1), the probability that the random graph  G ( n ,  p ) satisfies p approaches either 0 or 1 as  n  approaches infinity. It is well known that this law fails to hold for any formalism that can express the parity quantifier: for certain properties, the probability that  G ( n , p ) satisfies the property need not converge, and for others the limit may be strictly between 0 and 1.   In this work, we capture the limiting behavior of properties definable in first order logic augmented with the parity quantifier, FOltr, over  G ( n , p ), thus eluding the above hurdles. Specifically, we establish the following “modular convergence law”.   For every FOltr sentence p, there are two explicitly computable rational numbers  a 0  ,  a 1  , such that for  i  ∈ {0,1}, as  n  approaches infinity, the probability that the random graph  G (2 n p i ,  p ) satisfies p approaches  a i  .   Our results also extend appropriately to FO equipped with Mod q  quantifiers for prime  q .   In the process of deriving this theorem, we explore a new question that may be of interest in its own right. Specifically, we study the joint distribution of the subgraph statistics modulo 2 of  G ( n , p ): namely, the number of copies, mod 2, of a fixed number of graphs  F  1 , …,  F  e  of bounded size in  G ( n , p ). We first show that every FOltr property p is almost surely determined by subgraph statistics modulo 2 of the above type. Next, we show that the limiting joint distribution of the subgraph statistics modulo 2 depends only on  n  mod 2, and we determine this limiting distribution completely. Interestingly, both these steps are based on a common technique using multivariate polynomials over finite fields and, in particular, on a new generalization of the Gowers norm.   The first step is analogous to the Razborov-Smolensky method for lower bounds for AC 0  with parity gates, yet stronger in certain ways. For instance, it allows us to obtain examples of simple graph properties that are exponentially uncorrelated with every FOltr sentence, which is something that is not known for AC 0 ltr.", "citation": "Citations (3)", "departments": ["University of California, Santa Cruz", "Massachusetts Institute of Technology", "University of California, Santa Cruz", "Massachusetts Institute of Technology"], "authors": ["Phokion G. Kolaitis.....http://dblp.org/pers/hd/k/Kolaitis:Phokion_G=", "Swastik Kopparty.....http://dblp.org/pers/hd/k/Kopparty:Swastik"], "conf": "stoc", "year": "2009", "pages": 10}