{"title": "Salvaging Merkle-Damgård for Practical Applications.", "fields": ["security of cryptographic hash functions", "double hashing", "swifft", "preimage attack", "sha 2"], "abstract": "Many cryptographic applications of hash functions are analyzed in the random oracle model. Unfortunately, most concrete hash functions, including the SHA family, use the iterative (strengthened) Merkle-Damgard transform applied to a corresponding compression function. Moreover, it is well known that the resulting \"structured\" hash function cannot be generically used as a random oracle, even if the compression function is assumed to be ideal. This leaves a large disconnect between theory and practice: although no attack is known for many concrete applications utilizing existing (Merkle-Damgard based) hash functions, there is no security guarantee either, even by idealizing the compression function.\n\nMotivated by this question, we initiate a rigorous and modular study of developing new notions of (still idealized) hash functions which would be (a) natural and elegant; (b) sufficient for arguing security of important applications; and (c) provably met by the (strengthened) Merkle-Damgard transform, applied to a \"strong enough\" compression function. In particular, we develop two such notions satisfying (a)-(c):  a preimage aware  function ensures that the attacker cannot produce a \"useful\" output of the function without already \"knowing\" the corresponding preimage, and a  public-use random oracle  , which is a random oracle that reveals to attackers messages queried by honest parties.", "citation": "Not cited", "year": "2009", "departments": ["New York University", "University of California, San Diego", "Portland State University"], "conf": "eurocrypt", "authors": ["Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Thomas Ristenpart.....http://dblp.org/pers/hd/r/Ristenpart:Thomas", "Thomas Shrimpton.....http://dblp.org/pers/hd/s/Shrimpton:Thomas"], "pages": 18}