{"title": "Robust motion estimation using trajectory spectrum learning: Application to aortic and mitral valve modeling from 4D TEE.", "fields": ["motion detection", "discrete fourier transform", "euclidean space", "linear subspace", "boosting"], "abstract": "In this paper we propose a robust and efficient approach to localizing and estimating the motion of non-rigid and articulated objects using marginal trajectory spectrum learning. Detecting the motion directly in the Euclidean space is often found difficult to guarantee a smooth and accurate result and might be affected by drifting. These issues, however, can be addressed effectively by formulating the motion estimation problem as spectrum detection in the trajectory space. The full trajectory space can be decomposed into orthogonal subspaces defined by generic bases, such as the Discrete Fourier Transform (DFT). The obtained representation is shown to be compact, facilitating efficient learning and optimization in its marginal spaces. In the training stage, local features are extended in the temporal domain to integrate the time coherence constraint and selected via boosting to form strong classifiers. An incremental optimization is performed in sparse marginal spaces learned from the training data. To maximize efficiency and robustness we constrain the search based on clusters of hypotheses defined in each subspace. Experiments demonstrate the performance of the proposed method on articulated motion estimation of aortic and mitral valves from ultrasound data. Our method is evaluated on 65 4D TEE sequences (1516 volumes) with the accuracy in the range of the inter-user variability of expert users. It provides in less than 60 seconds with an precision of 1.36 ± 0.32mm a personalized 4D model of aortic and mitral valves crucial for the clinical workflow.", "citation": "Citations (14)", "year": "2009", "departments": ["Princeton University", "Princeton University", "Princeton University", "Siemens", "Technische Universität München"], "conf": "iccv", "authors": ["Razvan Ioan Ionasec.....http://dblp.org/pers/hd/i/Ionasec:Razvan_Ioan", "Yang Wang.....http://dblp.org/pers/hd/w/Wang_0001:Yang", "Bogdan Georgescu.....http://dblp.org/pers/hd/g/Georgescu:Bogdan", "Ingmar Voigt.....http://dblp.org/pers/hd/v/Voigt:Ingmar", "Nassir Navab.....http://dblp.org/pers/hd/n/Navab:Nassir", "Dorin Comaniciu.....http://dblp.org/pers/hd/c/Comaniciu:Dorin"], "pages": 8}