{"title": "An O(k^3 log n)-Approximation Algorithm for Vertex-Connectivity Survivable Network Design.", "fields": ["combinatorics", "directed graph", "vertex", "approximation algorithm", "binary logarithm", "network planning and design", "small number"], "abstract": "In the Survivable Network Design problem (SNDP), we are given an undirected graph $G(V, E)$ with costs on edges, along with a connectivity requirement $r(u, v)$ for each pair $u, v$ of vertices. The goal is to find a minimum-cost subset $E^*$ of edges, that satisfies the given set of pairwise connectivity requirements. In the edge-connectivity version we need to ensure that there are $r(u, v)$ edge-disjoint paths for every pair $u, v$ of vertices, while in the vertex-connectivity version the paths are required to be vertex-disjoint. The edge-connectivity version of SNDP is known to have a 2-approximation. However, no non-trivial approximation algorithm has been known so far for the vertex version of SNDP, except for special cases of the problem. We present an extremely simple algorithm to achieve an $O(k^3 \\log |T|)$-approximation for this problem, where $k$ denotes the maximum connectivity requirement, and $T$ is the set of vertices that participate in one or more pairs with non-zero connectivity requirements. We also give a simple proof of the recently discovered $O(k^2 \\log |T|)$-approximation algorithm for the single-source version of vertex-connectivity SNDP. Our results establish a natural connection between vertex-connectivity and a well-understood generalization of edge-connectivity, namely, element-connectivity, in that, any instance of vertex-connectivity can be expressed by a small number of instances of the element-connectivity problem.", "citation": "Citations (70)", "departments": ["Toyota", "University of Pennsylvania"], "authors": ["Julia Chuzhoy.....http://dblp.org/pers/hd/c/Chuzhoy:Julia", "Sanjeev Khanna.....http://dblp.org/pers/hd/k/Khanna:Sanjeev"], "conf": "focs", "year": "2009", "pages": 5}