{"title": "Design and implementation of software-managed caches for multicores with local memory.", "fields": ["uniform memory access", "bus sniffing", "cache only memory architecture", "mesif protocol", "tag ram"], "abstract": "Heterogeneous multicores, such as Cell BE processors and GPGPUs, typically do not have caches for their accelerator cores because coherence traffic, cache misses, and latencies from different types of memory accesses add overhead and adversely affect instruction scheduling. Instead, the accelerator cores have internal local memory to place their code and data. Programmers of such heterogeneous multicore architectures must explicitly manage data transfers between the local memory of a core and the globally shared main memory. This is a tedious and errorprone programming task. A software-managed cache (SMC), implemented in local memory, can be programmed to automatically handle data transfers at runtime, thus simplifying the task of the programmer. In this paper, we propose a new software-managed cache design, called extended set-index cache (ESC). It has the benefits of both set-associative and fully associative caches. Its tag search speed is comparable to the set-associative cache and its miss rate is comparable to the fully associative cache. We examine various line replacement policies for SMCs, and discuss their trade-offs. In addition, we propose adaptive execution strategies that select the optimal cache line size and replacement policy for each program region at runtime. To evaluate the effectiveness of our approach, we implement the ESC and other SMC designs on the Cell BE architecture, and measure their performance with 8 OpenMP applications. The evaluation results show that the ESC outperforms other SMC designs. The results also show that our adaptive execution strategies work well with the ESC. In fact, our approach is applicable to all cores with access to both local and global memory in a multicore architecture.", "citation": "Citations (52)", "departments": ["Seoul National University", "Seoul National University", "IBM"], "authors": ["Sangmin Seo.....http://dblp.org/pers/hd/s/Seo:Sangmin", "Jaejin Lee.....http://dblp.org/pers/hd/l/Lee:Jaejin", "Zehra Sura.....http://dblp.org/pers/hd/s/Sura:Zehra"], "conf": "hpca", "year": "2009", "pages": 12}