{"title": "Barrier Coverage of Line-Based Deployed Wireless Sensor Networks.", "fields": ["poisson point process", "software deployment", "key distribution in wireless sensor networks", "poisson regression", "wireless sensor network"], "abstract": "Barrier coverage of wireless sensor networks has been studied intensively in recent years under the assumption that sensors are deployed uniformly at random in a large area (Poisson point process model). However, when sensors are deployed along a line (e.g., sensors are dropped from an aircraft along a given path), they would be distributed along the line with random off- sets due to wind and other environmental factors. It is important to study the barrier coverage of such line- based deployment strategy as it represents a more realistic sensor placement model than the Poisson point process model. This paper presents the first set of results in this direction. In particular, we establish a tight lower-bound for the existence of barrier coverage under line-based deployments. Our results show that the barrier coverage of the line-based deployments significantly outperforms that of the Poisson model when the random offsets are relatively small compared to the sensor's sensing range. We then study sensor deployments along multiple lines and show how barrier coverage is affected by the distance between adjacent lines and the random offsets of sensors. These results demonstrate that sensor deployment strategies have direct impact on the barrier coverage of wireless sensor networks. Different deployment strategies may result in significantly different barrier coverage. Therefore, in the planning and deployment of wireless sensor networks, the coverage goal and possible sensor deployment strategies must be carefully and jointly considered. The results obtained in this paper will provide important guidelines to the deployment and performance of wireless sensor networks for barrier coverage.", "citation": "Citations (207)", "departments": ["University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Massachusetts Lowell"], "authors": ["Anwar Saipulla.....http://dblp.org/pers/hd/s/Saipulla:Anwar", "Cédric Westphal.....http://dblp.org/pers/hd/w/Westphal:C=eacute=dric", "Benyuan Liu.....http://dblp.org/pers/hd/l/Liu:Benyuan", "Jie Wang.....http://dblp.org/pers/hd/w/Wang_0002:Jie"], "conf": "infocom", "year": "2009", "pages": 9}