{"title": "A Queueing Model Framework of PCE-Based Inter-Area Path Computation.", "fields": ["path computation element", "multiprotocol label switching", "fast path", "constrained shortest path first", "interior gateway protocol"], "abstract": "Path computation elements (PCE's) are used to com- pute end-to-end paths across multiple areas. Multiple PCE's may be dedicated to each area to provide sufficient path computation capacity and redundancy. An open problem is to which PCE to send the path computation request. This problem may be a non trivial problem if PCE's have uneven processing capacities. This paper presents a queueing model based on product form to estimate the latencies in path computation while accounting for the arrival rate of path computation requests. The model is used to find the PCE selection policy to minimize the overall expected latencies in path computation. Simulation studies demonstrate that the use of the simplistic product form approach yields reasonable approximations that are within up to 15% of the simulation results at practical offered loads. Keywords—PCE, PCEP, MPLS traffic engineering, load- balancing, inter-area I. Introduction Today's Internet has witnessed an increasing demand of mission-critical and real-time multimedia services. Service providers are required to achieve bandwidth optimization and strict quality of service guarantees. Multi protocol label switch- ing (MPLS) traffic engineering (TE) was introduced to meet these requirements. A fundamental building block of MPLS- TE is constrained-based path computation, which requires a TE database (TED) to represent the available network resources, and computes shortest paths based on a sub-graph derived from the TED by pruning the links not satisfying the given constraints. Most of today's TE solutions have been developed in the context of single domain, where a domain is a collection of network elements that share a common sphere of address management or path computational responsibility, such as an interior gateway protocol (IGP) area, an autonomous system (AS) or a generalized MPLS (GMPLS) region. In recent years the networking community has expressed an increasing interest in extending the scope of MPLS-TE to cope with multi domain scenarios. End-to-end inter-domain constrained path computation presents some challenges: 1) Optimality: the ability to maximize network utilization", "citation": "Citations (1)", "departments": ["University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas"], "authors": ["Juanjuan Yu.....http://dblp.org/pers/hd/y/Yu:Juanjuan", "Yue He.....http://dblp.org/pers/hd/h/He:Yue", "Kai Wu.....http://dblp.org/pers/hd/w/Wu_0001:Kai", "Marco Tacca.....http://dblp.org/pers/hd/t/Tacca:Marco", "Andrea Fumagalli.....http://dblp.org/pers/hd/f/Fumagalli:Andrea", "Jean-Philippe Vasseur.....http://dblp.org/pers/hd/v/Vasseur:Jean=Philippe"], "conf": "infocom", "year": "2009", "pages": 5}