{"title": "DDE: from dewey to a fully dynamic XML labeling scheme.", "fields": ["xml validation", "xml encryption", "xml schema editor", "xml database", "efficient xml interchange"], "abstract": "Labeling schemes lie at the core of query processing for many XML database management systems. Designing labeling schemes for dynamic XML documents is an important problem that has received a lot of research attention. Existing dynamic labeling schemes, however, often sacrifice query performance and introduce additional labeling cost to facilitate arbitrary updates even when the documents actually seldom get updated. Since the line between static and dynamic XML documents is often blurred in practice, we believe it is important to design a labeling scheme that is compact and efficient regardless of whether the documents are frequently updated or not. In this paper, we propose a novel labeling scheme called DDE (for Dynamic DEwey) which is tailored for both static and dynamic XML documents. For static documents, the labels of DDE are the same as those of dewey which yield compact size and high query performance. When updates take place, DDE can completely avoid re-labeling and its label quality is most resilient to the number and order of insertions compared to the existing approaches. In addition, we introduce Compact DDE (CDDE) which is designed to optimize the performance of DDE for insertions. Both DDE and CDDE can be incorporated into existing systems and applications that are based on dewey labeling scheme with minimum efforts. Experiment results demonstrate the benefits of our proposed labeling schemes over the previous approaches.", "citation": "Citations (108)", "year": "2009", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "conf": "sigmod", "authors": ["Liang Xu.....http://dblp.org/pers/hd/x/Xu:Liang", "Tok Wang Ling.....http://dblp.org/pers/hd/l/Ling:Tok_Wang", "Huayu Wu.....http://dblp.org/pers/hd/w/Wu_0001:Huayu", "Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng"], "pages": 12}