{"title": "Using large-scale web data to facilitate textual query based retrieval of consumer photos.", "fields": ["relevance feedback", "inverted index", "web query classification", "query expansion", "web search query"], "abstract": "The rapid popularization of digital cameras and mobile phone cameras has lead to an explosive growth of consumer photo collections. In this paper, we present a (quasi) real-time textual query based personal photo retrieval system by leveraging millions of web images and their associated rich textual descriptions (captions, categories, etc.). After a user provides a textual query ( e.g. , \"pool\"), our system exploits the inverted file method to automatically find the positive web images that are related to the textual query \"pool\" as well as the negative web images which are irrelevant to the textual query. Based on these automatically retrieved relevant and irrelevant web images, we employ two simple but effective classification methods,  k  Nearest Neighbor (kNN) and decision stumps, to rank personal consumer photos. To further improve the photo retrieval performance, we propose three new relevance feedback methods via cross-domain learning. These methods effectively utilize both the web images and the consumer images. In particular, our proposed cross-domain learning methods can learn robust classifiers with only a very limited amount of labeled consumer photos from the user by leveraging the pre-learned decision stumps at interactive response time. Extensive experiments on both consumer and professional stock photo datasets demonstrated the effectiveness and efficiency of our system, which is also inherently not limited by any predefined lexicon.", "citation": "Citations (26)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Eastman Kodak Company"], "authors": ["Yiming Liu.....http://dblp.org/pers/hd/l/Liu:Yiming", "Dong Xu.....http://dblp.org/pers/hd/x/Xu_0001:Dong", "Ivor W. Tsang.....http://dblp.org/pers/hd/t/Tsang:Ivor_W=", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo"], "conf": "mm", "year": "2009", "pages": 10}