{"title": "Supporting Database Applications as a Service.", "fields": ["search engine indexing", "sql", "software as a service", "data management", "bitmap"], "abstract": "Multi-tenant data management is a form of Software as a Service (SaaS), whereby a third party service provider hosts databases as a service and provides its customers with seamless mechanisms to create, store and access their databases at the host site. One of the main problems in such a system, as we shall discuss in this paper, is scalability, namely the ability to serve an increasing number of tenants without too much query performance degradation. A promising way to handle the scalability issue is to consolidate tuples from different tenants into the same shared tables. However, this approach introduces two problems: 1) The shared tables are too sparse. 2)Indexing on shared tables is not effective. To resolve the problems, we propose a multi-tenant database system called M-Store, which provides storage and indexing services for multi-tenants. To improve the scalability of the system, we develop two techniques in M-Store: Bitmap Interpreted Tuple(BIT) and Multi-Separated Index (MSI). BIT is efficient in that it does not store NULLs from unused attributes in the shared tables and MSI provides flexibility since it only indexes each tenant's own data on frequently accessed attributes. We extended MySQL based on our proposed design and conducted extensive experiments. The experimental results show that our proposed approach is a promising multi-tenancy storage and indexing scheme which can be easily integrated into existing DBMS.", "citation": "Citations (115)", "departments": ["National University of Singapore", "National University of Singapore", "Tsinghua University", "National University of Singapore"], "authors": ["Mei Hui.....http://dblp.org/pers/hd/h/Hui:Mei", "Dawei Jiang.....http://dblp.org/pers/hd/j/Jiang:Dawei", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Yuan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuan"], "conf": "icde", "year": "2009", "pages": 12}