{"title": "Label to region by bi-layer sparsity priors.", "fields": ["prior probability", "minification", "neural coding", "robustness", "automatic image annotation"], "abstract": "In this work, we investigate how to automatically reassign the manually annotated labels at the image-level to those contextually derived semantic regions. First, we propose a bi-layer sparse coding formulation for uncovering how an image or semantic region can be robustly reconstructed from the over-segmented image patches of an image set. We then harness it for the automatic label to region assignment of the entire image set. The solution to bi-layer sparse coding is achieved by convex  l  1 -norm minimization. The underlying philosophy of bi-layer sparse coding is that an image or semantic region can be sparsely reconstructed via the atomic image patches belonging to the images with common labels, while the robustness in label propagation requires that these selected atomic patches come from very few images. Each layer of sparse coding produces the image label assignment to those selected atomic patches and merged candidate regions based on the shared image labels. The results from all bi-layer sparse codings over all candidate regions are then fused to obtain the entire label to region assignments. Besides, the presenting bi-layer sparse coding framework can be naturally applied to perform image annotation on new test images. Extensive experiments on three public image datasets clearly demonstrate the effectiveness of our proposed framework in both label to region assignment and image annotation tasks.", "citation": "Citations (96)", "departments": ["Huazhong University of Science and Technology", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Xiaobai Liu.....http://dblp.org/pers/hd/l/Liu:Xiaobai", "Bin Cheng.....http://dblp.org/pers/hd/c/Cheng_0001:Bin", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai"], "conf": "mm", "year": "2009", "pages": 10}