{"title": "Lightweight web image reranking.", "fields": ["search engine indexing", "image retrieval", "intuition", "full text search", "image file formats"], "abstract": "Web image search is inspired by text search techniques; it mainly relies on indexing textual data that surround the image file. But retrieval results are often noisy and image processing techniques have been proposed to rerank images. Unfortunately, these techniques usually imply a computational overload that makes the reranking process intractable in real time. We introduce here a lightweight reranking method that compares each result not only to the other query results but also to an external, contrastive class of items. The external class contains diversified images; the intuition supporting our approach is that results that are visually similar to other query results but dissimilar to elements of the contrastive class are likely to be good answers. The success of visual reranking depends on the visual coherence of queries; we measure this coherence in order to evaluate the chances of success. Visual reranking tends to emerge near duplicate images and we complement it with a diversification function which ensures that different aspects of a query are presented to the user. Our method is evaluated against a standard search engine using 210 diversified queries. Significant improvements are reported for both quantitative and qualitative tests.", "citation": "Citations (20)", "departments": ["École nationale supérieure des télécommunications de Bretagne", "École nationale supérieure des télécommunications de Bretagne", "Exalead", "CEA LIST, Fonte ... x Roses, France"], "authors": ["Adrian Popescu.....http://dblp.org/pers/hd/p/Popescu_0001:Adrian", "Pierre-Alain Moëllic.....http://dblp.org/pers/hd/m/Mo=euml=llic:Pierre=Alain", "Ioannis Kanellos.....http://dblp.org/pers/hd/k/Kanellos:Ioannis", "Rémi Landais.....http://dblp.org/pers/hd/l/Landais:R=eacute=mi"], "conf": "mm", "year": "2009", "pages": 4}