{"title": "Mobility-Driven Scheduling in Wireless Networks.", "fields": ["proportionally fair", "fair share scheduling", "round robin scheduling", "fair queuing", "maximum throughput scheduling"], "abstract": "The design of scheduling policies for wireless data systems has been driven by a compromise between the objectives of high overall system throughput and the degree of fairness among users, while exploiting multi-user diversity, i.e., fast-fading variations. These policies have been thoroughly investigated in the absence of user mobility, i.e., without slow fading variations. In the present paper, we examine the impact of intra- and inter-cell user mobility on the trade-off between throughput and fairness, and on the suitable choice of alpha-fair scheduling policies. We consider a dynamic setting where users come and go over time as governed by random finite-size data transfers, and explicitly allow for users to roam around. It is demonstrated that the overall performance improves as the fairness parameter alpha is reduced, and in particular, that proportional fair scheduling may yield relatively poor performance, in sharp contrast to the standard scenario with only fast fading. Since a lower alpha tends to affect short-term fairness, we explore how to set the fairness parameter so as to strike the right balance between overall performance and short-term fairness. It is further established that mobility tends to improve the performance, even when the network operates under a local fair scheduling policy as opposed to a globally optimal strategy. We present extensive simulation results to confirm and illustrate the analytical findings.", "citation": "Citations (18)", "departments": ["Bell Labs", "Microsoft"], "authors": ["Sem C. Borst.....http://dblp.org/pers/hd/b/Borst:Sem_C=", "Nidhi Hegde.....http://dblp.org/pers/hd/h/Hegde:Nidhi", "Alexandre Proutière.....http://dblp.org/pers/hd/p/Prouti=egrave=re:Alexandre"], "conf": "infocom", "year": "2009", "pages": 9}