{"title": "Intra-module Inference.", "fields": ["software development", "soundness", "linked list", "assertion", "predicate abstraction"], "abstract": "Contract-based property checkers hold the potential for precise, scalable, and incremental reasoning. However, it is difficult to apply such checkers to large program modules because they require programmers to provide detailed contracts, including an interface specification, module invariants, and internal specifications. We argue that given a suitably rich assertion language, modest effort suffices to document the interface specification and the module invariants. However, the burden of providing internal specifications is still significant and remains a deterrent to the use of contract-based checkers. Therefore, we consider the problem of  intra-module inference  , which aims to infer annotations for internal procedures and loops, given the interface specification and the module invariants. We provide simple and scalable techniques to search for a broad class of desired internal annotations, comprising quantifiers and Boolean connectives, guided by the module specification. We have validated our ideas by building a prototype verifier and using it to verify several properties on Windows device drivers with zero false alarms and small annotation overhead. These drivers are complex; they contain thousands of lines and use dynamic data structures such as linked lists and arrays. Our technique significantly improves the soundness, precision, and coverage of verification of these programs compared to earlier techniques.", "citation": "Citations (12)", "year": "2009", "departments": ["Microsoft", "Microsoft", "University of Buenos Aires", "University of California, San Diego", "École Polytechnique Fédérale de Lausanne"], "conf": "cav", "authors": ["Shuvendu K. Lahiri.....http://dblp.org/pers/hd/l/Lahiri:Shuvendu_K=", "Shaz Qadeer.....http://dblp.org/pers/hd/q/Qadeer:Shaz", "Juan P. Galeotti.....http://dblp.org/pers/hd/g/Galeotti:Juan_P=", "Jan W. Voung.....http://dblp.org/pers/hd/v/Voung:Jan_W=", "Thomas Wies.....http://dblp.org/pers/hd/w/Wies:Thomas"], "pages": 16}