{"title": "Identity Aware Sensor Networks.", "fields": ["network packet", "header", "payload", "code rate", "communications protocol"], "abstract": "In a significant class of sensor-network applications, the identities of the reporting sensors constitute the bulk of the communicated data, whereas the message itself can be as small as a single bit—for instance, in many cases, sensors are used to detect whether and where a certain interesting condition occured, or to track incremental environmental changes at fixed locations. In such scenarios, the traditional network-protocol paradigm of separately specifying the source identity and the message in distinct fields leads to inefficient communication. This work addresses the question of how should communi- cation happen in such identity-aware sensor networks. We re- examine the traditional source-identity/message separation and propose a scheme for jointly encoding the two. We use this to develop a communication method for identity-aware sensor networks and show it to be energy efficient, simple to implement, and gracefully adaptable to scenarios frequently encountered in sensor networks—for instance, node failures, or large numbers of nodes where only few are active during each reporting round. I. INTRODUCTION In traditional network protocols, each packet carries its source identity in a dedicated header field, separately from the communicated message, which constitutes the packet's payload. To increase their information rate, several protocols use encoding or compression techniques that look to minimize the size of the message; to the best of our knowledge, none", "citation": "Citations (12)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Lorenzo Keller.....http://dblp.org/pers/hd/k/Keller:Lorenzo", "Mahdi Jafari Siavoshani.....http://dblp.org/pers/hd/s/Siavoshani:Mahdi_Jafari", "Christina Fragouli.....http://dblp.org/pers/hd/f/Fragouli:Christina", "Katerina J. Argyraki.....http://dblp.org/pers/hd/a/Argyraki:Katerina_J=", "Suhas N. Diggavi.....http://dblp.org/pers/hd/d/Diggavi:Suhas_N="], "conf": "infocom", "year": "2009", "pages": 9}