{"title": "Coalitional Games for Distributed Collaborative Spectrum Sensing in Cognitive Radio Networks.", "fields": ["false alarm", "cognitive radio", "trade off", "distributed algorithm", "cognitive network"], "abstract": "Collaborative spectrum sensing among secondary users (SUs) in cognitive networks is shown to yield a significant performance improvement. However, there exists an inherent trade off between the gains in terms of probability of detection of the primary user (PU) and the costs in terms of false alarm probability. In this paper, we study the impact of this trade off on the topology and the dynamics of a network of SUs seeking to reduce the interference on the PU through collaborative sensing. Moreover, while existing literature mainly focused on centralized solutions for collaborative sensing, we propose distributed collab- oration strategies through game theory. We model the problem as a non-transferable coalitional game, and propose a distributed algorithm for coalition formation through simple merge and split rules. Through the proposed algorithm, SUs can autonomously collaborate and self-organize into disjoint independent coalitions, while maximizing their detection probability taking into account the cooperation costs (in terms of false alarm). We study the stability of the resulting network structure, and show that a maximum number of SUs per formed coalition exists for the proposed utility model. Simulation results show that the proposed algorithm allows a reduction of up to 86.6% of the average missing probability per SU (probability of missing the detection of the PU) relative to the non-cooperative case, while maintaining a certain false alarm level. In addition, through simulations, we compare the performance of the proposed distributed solution with respect to an optimal centralized solution that minimizes the average missing probability per SU. Finally, the results also show how the proposed algorithm autonomously adapts the network topology to environmental changes such as mobility.", "citation": "Citations (213)", "departments": ["University of Oslo", "University of Houston", "CentraleSupélec", "University of Oslo", "Electrical and  ... ter Engineering"], "authors": ["Walid Saad.....http://dblp.org/pers/hd/s/Saad:Walid", "Zhu Han.....http://dblp.org/pers/hd/h/Han:Zhu", "Mérouane Debbah.....http://dblp.org/pers/hd/d/Debbah:M=eacute=rouane", "Are Hjørungnes.....http://dblp.org/pers/hd/h/Hj=oslash=rungnes:Are", "Tamer Basar.....http://dblp.org/pers/hd/b/Basar:Tamer"], "conf": "infocom", "year": "2009", "pages": 9}