{"title": "An Experimental Evaluation of Rate Adaptation for Multi-Antenna Systems.", "fields": ["spatial multiplexing", "multiplexing", "phy", "streams", "physical layer"], "abstract": "Increasingly wireless networks use multi-antenna nodes as in IEEE 802.11n and 802.16. The Physical layer (PHY) in such systems may use the antennas to provide multiple streams of data (spatial multiplexing) or to increase the robustness of fewer streams. These physical layers also provide support for sending packets at different rates by changing the modulation and coding of transmissions. Rate adaptation is the problem of choosing the best transmission mode for the current channel and in these systems requires choosing both the level of spatial multiplexing and the modulation and coding. Hydra is an experimental wireless network node prototype in which both the MAC and PHY are highly programmable. Hydra's PHY is essentially the 802.11n PHY, and currently supports two antennas and the same modulations and codings as 802.11n. Because of limitations of our hardware platform, the actual rates are a factor of 10 smaller than 802.11n. The MAC is essentially the 802.11 MAC with extensions, including the ability to feedback channel state or rate information from the receiver. Hydra was designed to allow experimentation with real radios, PHYs, and network stacks over real-world channels and it is well suited to studying rate adaptation in multi-antenna systems. To allow controlled experimentation, we also have the ability to perform experiments over emulated channels using exactly the same MAC and PHY used for RF transmissions. We present rate control experiments based on transmission over both real and emulated channels. Our experiments include measurements for single antenna systems and two antenna systems using a single or multiple spatial streams. We study rate adaptation algorithms using both explicit and implicit feedback from the receiver. A novel aspect of our results is the first experimental study of adaptation between single and multiple spatial streams for 802.11n style systems. Increasingly wireless networking technologies, including IEEE 802.11n and IEEE 802.16, support radios with multiple an- tennas. These antennas can be used to support multiple data streams (spatial multiplexing) or to increase robustness by tak- ing advantage of channel diversity (1), (2). Choosing between", "citation": "Citations (21)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Wonsoo Kim.....http://dblp.org/pers/hd/k/Kim:Wonsoo", "O. Khan.....http://dblp.org/pers/hd/k/Khan:O=", "Kien T. Truong.....http://dblp.org/pers/hd/t/Truong:Kien_T=", "Soon-Hyeok Choi.....http://dblp.org/pers/hd/c/Choi:Soon=Hyeok", "Robert Grant.....http://dblp.org/pers/hd/g/Grant:Robert", "Hyrum K. Wright.....http://dblp.org/pers/hd/w/Wright:Hyrum_K=", "Ketan Mandke.....http://dblp.org/pers/hd/m/Mandke:Ketan", "Robert C. Daniels.....http://dblp.org/pers/hd/d/Daniels:Robert_C=", "Robert W. Heath Jr......http://dblp.org/pers/hd/h/Heath_Jr=:Robert_W=", "Scott Nettles.....http://dblp.org/pers/hd/n/Nettles:Scott"], "conf": "infocom", "year": "2009", "pages": 9}