{"title": "FSCAV: fast seam carving for size adaptation of videos.", "fields": ["jitter", "display resolution", "cropping", "seam carving", "aspect ratio"], "abstract": "The presentation of multimedia data and especially of high resolution videos on small mobile devices is still a great challenge today. Both cropping of borders and scaling of frames may result in the removal of essential content of videos or lost details due to the reduced size of the visual content. Another major problem emerges if the aspect ratio of the original video and the display of the mobile device differ. User evaluations indicate that changing the aspect ratio may reduce the visual quality of videos significantly. In this paper, we present the new  FSCAV  algorithm ( F ast  S eam  C arving for  S ize  A daptation of  V ideos) to adapt the size of videos to the limited display resolution and different aspect ratios of handheld mobile devices. The general idea of the seam carving algorithm for still images is to remove seams in images so that the essential content is preserved. We extended this technique which works very well for images to create videos without jitter or visible artifacts. A major feature of our FSCAV algorithm is the low computational complexity which enables an efficient adaptation of videos to small screens. Nevertheless, severe distortions are clearly visible in some shots of the adapted videos. We present a new heuristic to identify shots with such a low visual quality. If the quality drops below a threshold, a different adaptation technique is used for this shot (e.g., scaling or cropping). User evaluations confirm a very high visual quality of our approach.", "citation": "Citations (34)", "departments": ["University of Mannheim", "University of Mannheim", "University of Mannheim", "University of Mannheim"], "authors": ["Stephan Kopf.....http://dblp.org/pers/hd/k/Kopf:Stephan", "Johannes Kiess.....http://dblp.org/pers/hd/k/Kiess:Johannes", "Hendrik Lemelson.....http://dblp.org/pers/hd/l/Lemelson:Hendrik", "Wolfgang Effelsberg.....http://dblp.org/pers/hd/e/Effelsberg:Wolfgang"], "conf": "mm", "year": "2009", "pages": 10}