{"title": "Static Validation of C Preprocessor Macros.", "fields": ["macro", "syntax", "streams", "abstract syntax tree", "preprocessor"], "abstract": "The widely used C preprocessor (CPP) is generally considered a source of difficulty for understanding and maintaining C/C++ programs. The main reason for this difficulty is CPP's purely lexical semantics, i.e., its treatment of both input and output as token streams. This can easily lead to errors that are difficult to diagnose, and it has been estimated that up to 20% of all macros are erroneous. To reduce such errors, more restrictive, replacement languages for CPP have been proposed to limit expanded macros to be valid C syntactic units. However, there is no practical tool that can effectively validate CPP\\ macros in legacy applications. In this paper, we introduce a novel, general characterization of inconsistent macro usage as a strong indicator of macro errors. Our key insight is that all applications of the same macro should behave similarly. In particular, we map each macro call c in a source file f to c's normalized syntactic constructs within the abstract syntax tree (AST) for f's preprocessed source, and use syntactic similarity as the basis for comparing macro calls of the same macro definition. Utilizing this characterization, we have developed an efficient algorithm to statically validate macro usage in C/C++ programs. We have implemented the algorithm; evaluation results show that our tool is effective in detecting common macro-related errors and reports few false positives, making it a practical tool for validating macro usage.", "citation": "Citations (5)", "departments": ["University of California, Davis", "University of California, Davis", "Lawrence Livermore National Laboratory", "University of California, Davis"], "authors": ["Andreas Saebjoernsen.....http://dblp.org/pers/hd/s/Saebjoernsen:Andreas", "Lingxiao Jiang.....http://dblp.org/pers/hd/j/Jiang:Lingxiao", "Daniel J. Quinlan.....http://dblp.org/pers/hd/q/Quinlan:Daniel_J=", "Zhendong Su.....http://dblp.org/pers/hd/s/Su:Zhendong"], "conf": "kbse", "year": "2009", "pages": 12}