{"title": "Aggregate Query Answering under Uncertain Schema Mappings.", "fields": ["small number", "well founded semantics", "failure semantics", "denotational semantics", "operational semantics"], "abstract": "Recent interest in managing uncertainty in data integration has led to the introduction of probabilistic schema mappings and the use of probabilistic methods to answer queries across multiple databases using two semantics: by-table and by-tuple. In this paper, we develop three possible semantics for aggregate queries: the range, distribution, and expected value semantics, and show that these three semantics combine with the by-table and by-tuple semantics in six ways. We present algorithms to process COUNT, AVG, SUM, MIN, and MAX queries under all six semantics and develop results on the complexity of processing such queries under all six semantics. We show that computing COUNT is in PTIME for all six semantics and computing SUM is in PTIME for all but the by-tuple/distribution semantics. Finally, we show that AVG, MIN, and MAX are PTIME computable for all by-table semantics and for the by-tuple/range semantics.We developed a prototype implementation and experimented with both real-world traces and simulated data. We show that, as expected, naive processing of aggregates does not scale beyond small databases with a small number of mappings. The results also show that the polynomial time algorithms are scalable up to several million tuples as well as with a large number of mappings.", "citation": "Citations (26)", "departments": ["Technion – Israel Institute of Technology", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Avigdor Gal.....http://dblp.org/pers/hd/g/Gal:Avigdor", "Maria Vanina Martinez.....http://dblp.org/pers/hd/m/Martinez:Maria_Vanina", "Gerardo I. Simari.....http://dblp.org/pers/hd/s/Simari:Gerardo_I=", "V. S. Subrahmanian.....http://dblp.org/pers/hd/s/Subrahmanian:V=_S="], "conf": "icde", "year": "2009", "pages": 12}