{"title": "Visual query suggestion.", "fields": ["rdf query language", "ranking", "web query classification", "sargable", "web search query"], "abstract": "Query suggestion is an effective approach to improve the usability of image search. Most existing search engines are able to automatically suggest a list of textual query terms based on users' current query input, which can be called Textual Query Suggestion. This paper proposes a new query suggestion scheme named Visual Query Suggestion (VQS) which is dedicated to image search. It provides a more effective query interface to formulate an intent-specific query by joint text and image suggestions. We show that VQS is able to more precisely and more quickly help users specify and deliver their search intents. When a user submits a text query, VQS first provides a list of suggestions, each containing a keyword and a collection of representative images in a dropdown menu. If the user selects one of the suggestions, the corresponding keyword will be added to complement the initial text query as the new text query, while the image collection will be formulated as the visual query. VQS then performs image search based on the new text query using text search techniques, as well as content-based visual retrieval to refine the search results by using the corresponding images as query examples. We compare VQS with three popular image search engines, and show that VQS outperforms these engines in terms of both the quality of query suggestion and search performance.", "citation": "Citations (197)", "departments": ["University of Science and Technology of China", "Microsoft", "Microsoft", "Microsoft", "University of Science and Technology of China"], "authors": ["Zheng-Jun Zha.....http://dblp.org/pers/hd/z/Zha:Zheng=Jun", "Linjun Yang.....http://dblp.org/pers/hd/y/Yang:Linjun", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Zengfu Wang.....http://dblp.org/pers/hd/w/Wang:Zengfu"], "conf": "mm", "year": "2009", "pages": 10}