{"title": "Fast gradient-descent methods for temporal-difference learning with linear function approximation.", "fields": ["function approximation", "temporal difference learning", "gradient descent", "linear function", "computer go", "compatibility"], "abstract": "Sutton, Szepesvari and Maei (2009) recently introduced the first temporal-difference learning algorithm compatible with both linear function approximation and off-policy training, and whose complexity scales only linearly in the size of the function approximator. Although their  gradient temporal difference  (GTD) algorithm converges reliably, it can be very slow compared to conventional linear TD (on on-policy problems where TD is convergent), calling into question its practical utility. In this paper we introduce two new related algorithms with better convergence rates. The first algorithm,  GTD2 , is derived and proved convergent just as GTD was, but uses a different objective function and converges significantly faster (but still not as fast as conventional TD). The second new algorithm,  linear TD with gradient correction , or  TDC , uses the same update rule as conventional TD except for an additional term which is initially zero. In our experiments on small test problems and in a Computer Go application with a million features, the learning rate of this algorithm was comparable to that of conventional TD. This algorithm appears to extend linear TD to off-policy learning with no penalty in performance while only doubling computational requirements.", "citation": "Not cited", "departments": ["University of Alberta", "University of Alberta", "McGill University", "Indian Institute of Science", "University of Alberta"], "authors": ["Richard S. Sutton.....http://dblp.org/pers/hd/s/Sutton:Richard_S=", "Hamid Reza Maei.....http://dblp.org/pers/hd/m/Maei:Hamid_Reza", "Doina Precup.....http://dblp.org/pers/hd/p/Precup:Doina", "Shalabh Bhatnagar.....http://dblp.org/pers/hd/b/Bhatnagar:Shalabh", "David Silver.....http://dblp.org/pers/hd/s/Silver:David", "Csaba Szepesvári.....http://dblp.org/pers/hd/s/Szepesv=aacute=ri:Csaba", "Eric Wiewiora.....http://dblp.org/pers/hd/w/Wiewiora:Eric"], "conf": "icml", "year": "2009", "pages": 8}