{"title": "Radiometric compensation using stratified inverses.", "fields": ["radiometry", "radiometric dating", "pixel", "sparse matrix", "matrix"], "abstract": "Through radiometric compensation, a projector-camera system can project a desired image onto a non-flat and non-white surface. This can be achieved by computing the inverse light transport of a scene. A light transport matrix is in general large and on the order of 10 6  × 10 6  elements. Therefore, computing the inverse light transport matrix is computationally and memory intensive. Two prior methods were proposed to simplify matrix inversion by ignoring scene inter-reflection between individual or clusters of camera pixels. However, compromising scene inter-reflection in spatial domain introduces spatial artifacts and how to systematically adjust the compensation quality is not obvious. In this work, we show how scene inter-reflection can be systematically approximated by stratifying the light transport of a scene. The stratified light transport enables a similar stratification in the inverse light transport. We can show that the stratified inverse light transport converges to the true inverse. For radiometric compensation, the set of stratified inverse light transport provides a systematic way of quantifying the tradeoff between computational efficiency and accuracy. The framework of stratified matrix inversion is general and can have other applications, especially for applications that involve large-size sparse matrices.", "citation": "Citations (11)", "year": "2009", "departments": ["Hewlett-Packard", "Institute for I ... arch, Singapore", "Institute for I ... arch, Singapore", "Institute for I ... arch, Singapore", "Institute for I ... arch, Singapore"], "conf": "iccv", "authors": ["Tian-Tsong Ng.....http://dblp.org/pers/hd/n/Ng:Tian=Tsong", "Ramanpreet Singh Pahwa.....http://dblp.org/pers/hd/p/Pahwa:Ramanpreet_Singh", "Jiamin Bai.....http://dblp.org/pers/hd/b/Bai:Jiamin", "Tony Q. S. Quek.....http://dblp.org/pers/hd/q/Quek:Tony_Q=_S=", "Kar-Han Tan.....http://dblp.org/pers/hd/t/Tan:Kar=Han"], "pages": 6}