{"title": "Visualized Elucidations of Ranking by Exploiting Object Relations.", "fields": ["ranking", "information system", "the internet", "object relations theory", "visualization"], "abstract": "For understanding human activity, a useful approach is to rank people according to the strength of their relations to a specified person. Similarly, rankings of objects based on such a relation are used in several fields. Several methods have been proposed for computing the strength of a relation between two objects. These methods do not present a reason why an object has a stronger relation to a specified object than another object has. Therefore, it is difficult for a user to understand a ranking obtained using these methods. On the other hand, the authors recently proposed a method for computing the strength of a relation through mining objects to elucidate the relation. We propose a ranking tool based on this method to afford a better understanding of a ranking. Our ranking tool has the following three characteristics for understanding a ranking: (1) it visualizes a relation by displaying objects that are important for elucidating the relation; (2) it classifies ranked objects into several groups, e.g., the two groups of \"petroleum exporting countries'' and \"petroleum consuming countries'' for ranking countries based on their respective relations to petroleum; and (3) it visualizes a reason explaining why an object has a stronger relation to a specified object than another object has. We explain novel ideas used in our ranking tool for understanding a ranking based on relations, and claim how effective the features of our tool are by presenting examples.", "citation": "Not cited", "departments": ["Kyoto University", "Kyoto University", "Kyoto University"], "authors": ["Xinpeng Zhang.....http://dblp.org/pers/hd/z/Zhang:Xinpeng", "Yasuhito Asano.....http://dblp.org/pers/hd/a/Asano:Yasuhito", "Masatoshi Yoshikawa.....http://dblp.org/pers/hd/y/Yoshikawa:Masatoshi"], "conf": "icde", "year": "2009", "pages": 4}