{"title": "On the Quality of Triangle Inequality Violation Aware Routing Overlay Architecture.", "fields": ["dsrflow", "policy based routing", "routing table", "equal cost multi path routing", "key based routing"], "abstract": "It is known that Internet routing policies for both intra- and inter-domain routing can naturally give rise to Triangle Inequality Violations (TIVs) with respect to Quality of Service (QoS) network metrics such as latencies between nodes. This motivates the exploitation of such TIVs phenomenon in network metrics to design TIV-aware routing overlay architecture which is capable of choosing quality overlay routing paths to improve end-to-end QoS without changing the underlying network ar- chitecture. Our idea is to find quality overlay routes between node pairs based on TIV optimization in terms of the latency and packet loss ratio, and that can offer near optimal routing quality in cost-effective and scalable manner. Our intuition to do this is to choose these overlay routes from a small set of transit nodes. We propose to assign nodes with transit selection frequency scores that are computed based on previous node usage for transit, and consolidate a small set of highly ranked transit nodes. For every node pair, we choose the best transit node in this small set for overlay routing, based on TIV optimization in latency and packet loss ratio. We analyze the quality of our TIV-aware routing overlay algorithm analytically and using real Internet measurements on latency and packet loss ratio. Our results show good quality performance in improving end-to-end QoS routing.", "citation": "Citations (11)", "departments": ["Carnegie Mellon University", "Kyushu Institute of Technology", "Service Integra ... orp., Musashino", "Service Integra ... orp., Musashino", "Service Integra ... orp., Musashino"], "authors": ["Ryoichi Kawahara.....http://dblp.org/pers/hd/k/Kawahara:Ryoichi", "Eng Keong Lua.....http://dblp.org/pers/hd/l/Lua:Eng_Keong", "Masato Uchida.....http://dblp.org/pers/hd/u/Uchida:Masato", "Satoshi Kamei.....http://dblp.org/pers/hd/k/Kamei:Satoshi", "Hideaki Yoshino.....http://dblp.org/pers/hd/y/Yoshino:Hideaki"], "conf": "infocom", "year": "2009", "pages": 5}