{"title": "Mining city landmarks from blogs by graph modeling.", "fields": ["hierarchy", "ranking", "pagerank", "collaborative filtering", "popularity"], "abstract": "Recent years have witnessed great prosperity in community-contributed multimedia. Discovering, extracting, and summarizing knowledge from these data enables us to make better sense of the world. In this paper, we report our work on mining famous city landmarks from blogs for personalized tourist suggestions. Our main contribution is a graph modeling framework to discover city landmarks by mining blog photo correlations with community supervision. This modeling fuses context, content, and community information in a style that simulates both static (PageRank) and dynamic (HITS) ranking models to highlight representative data from the consensus of blog users.   Preliminary, we identify geographical locations of page contents to harvest city sight photos from Web blogs, based on which we structure these photos into a Scene-View hierarchy* within each city. Our graph modeling consists of two phases: First, within a given scene, we present a PhotoRank algorithm to discover its representative views, which analogizes PageRank to model context and content photo correlations for graph-based popularity propagation. Second, among scenes within each city, we present a Landmark-HITS model to discover city landmarks, which integrates author correlations to infer scene popularity in a semi-supervised reinforcement manner. Based on graph modeling, we further achieve personalized tourist suggestions by the collaborative filtering of tourism logs and author correlations. Based on a real-world dataset from Windows Live Spaces blogs containing nearly 400,000 sight photos, we have deployed our framework in a VisualTourism system, with comparisons to state-of-the-arts. We also investigate how the city popularities, user locations (e.g. Asian or Euro. blog users), and sequential events (e.g. Olympic Games) influence our Landmark discovery results and the tourist suggestion tendencies.", "citation": "Citations (108)", "departments": ["Microsoft", "Harbin Institute of Technology", "Microsoft", "Harbin Institut ... , Harbin, China"], "authors": ["Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Wei-Ying Ma.....http://dblp.org/pers/hd/m/Ma:Wei=Ying"], "conf": "mm", "year": "2009", "pages": 10}