{"title": "Stel component analysis: Modeling spatial correlations in image class structure.", "fields": ["inference", "space partitioning", "component analysis", "probabilistic logic", "spatial correlation"], "abstract": "As a useful concept in the study of the low level image class structure, we introduce the notion of a structure element - `stel.' The notion is related to the notions of a pixel, superpixel, segment or a part, but instead of referring to an element or a region of a single image, stel is a probabilistic element of an entire image class. Stels often define clear object or scene parts as a consequence of the modeling constraint which forces the regions belonging to a single stel to have a tight distribution over local measurements, such as color or texture. This self-similarity within a region in a single image is typical of most meaningful image parts, even when in different images of similar objects the corresponding parts may not have similar local measurements. The stel itself is expected to be consistent within a class, yet flexible, which we accomplish using a novel approach we dubbed stel component analysis. Experimental results show how stel component analysis can assist in image/video segmentation and object recognition where, in particular, it can be used as an alternative of, or in conjunction with, bag-of-features and related classifiers, where stel inference provides a meaningful spatial partition of features.", "citation": "Citations (112)", "year": "2009", "departments": ["Microsoft", "University of Toronto", "Dipt. di Inf.,  ... , Verona, Italy", "Dipt. di Inf.,  ... , Verona, Italy", "Dipt. di Inf.,  ... , Verona, Italy"], "conf": "cvpr", "authors": ["Nebojsa Jojic.....http://dblp.org/pers/hd/j/Jojic:Nebojsa", "Alessandro Perina.....http://dblp.org/pers/hd/p/Perina:Alessandro", "Marco Cristani.....http://dblp.org/pers/hd/c/Cristani:Marco", "Vittorio Murino.....http://dblp.org/pers/hd/m/Murino:Vittorio", "Brendan J. Frey.....http://dblp.org/pers/hd/f/Frey:Brendan_J="], "pages": 8}