{"title": "MSeqGen: object-oriented unit-test generation via mining source code.", "fields": ["object type", "namespace", "unit testing", "code coverage", "object code"], "abstract": "An objective of unit testing is to achieve high structural coverage of the code under test. Achieving high structural overage of object-oriented code requires desirable method-call sequences that create and mutate objects. These sequences help generate target object states such as argument or receiver object states (in short as target states) of a method under test. Automatic generation of sequences for achieving target states is often challenging due to a large search space of possible sequences. On the other hand, code bases using object types (such as receiver or argument object types) include sequences that can be used to assist automatic test-generation approaches in achieving target states. In this paper, we propose a novel approach, called  MSeqGen , that mines code bases and extracts sequences related to receiver or argument object types of a method under test. Our approach uses these extracted sequences to enhance two state-of-the-art test-generation approaches: random testing and dynamic symbolic execution. We conduct two evaluations to show the effectiveness of our approach. Using sequences extracted by our approach, we show that a random testing approach achieves 8.7% (with a maximum of 20.0% for one namespace) higher branch coverage and a dynamic-symbolic-execution-based approach achieves 17.4% (with a maximum of 22.5% for one namespace) higher branch coverage than without using our approach. Such an improvement is significant as the branches that are not covered by these state-of-the-art approaches are generally quite difficult to cover.", "citation": "Citations (91)", "departments": ["North Carolina State University", "North Carolina State University", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Suresh Thummalapenta.....http://dblp.org/pers/hd/t/Thummalapenta:Suresh", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "Nikolai Tillmann.....http://dblp.org/pers/hd/t/Tillmann:Nikolai", "Jonathan de Halleux.....http://dblp.org/pers/hd/h/Halleux:Jonathan_de", "Wolfram Schulte.....http://dblp.org/pers/hd/s/Schulte:Wolfram"], "conf": "sigsoft", "year": "2009", "pages": 10}