{"title": "Instability of MaxWeight Scheduling Algorithms.", "fields": ["dynamic priority scheduling", "round robin scheduling", "phenomenon", "fair share scheduling", "queue", "throughput", "queueing theory", "premise", "instability", "rate monotonic scheduling", "earliest deadline first scheduling"], "abstract": "MaxWeight scheduling algorithms provide an ef- fective mechanism for achieving queue stability and guarantee- ing maximum throughput in a wide variety of scenarios. The maximum-stability guarantees however rely on the fundamental premise that the system consists of a fixed set of sessions with stationary ergodic traffic processes. In the present paper we examine a scenario where the population of active sessions varies over time, as sessions eventually end while new sessions occasionally start. We identify a simple necessary and sufficient condition for stability, and show that MaxWeight policies may fail to provide maximum stability. The intuitive explanation is that these policies tend to give preferential treatment to flows with large backlogs, so that the rate variations of flows with smaller backlogs are not fully exploited. In the usual framework with a fixed collection of flows, the latter phenomenon cannot persist since the flows with smaller backlogs will build larger queues and gradually start receiving more service. With a dynamic population of flows, however, MaxWeight policies may constantly get diverted to arriving flows, while neglecting the rate variations of a persistently growing number of flows in progress with relatively small remaining backlogs. We also perform extensive simulation experiments to corroborate the analytical findings.", "citation": "Not cited", "departments": ["Eindhoven University of Technology", "Eindhoven University of Technology", "Eindhoven University of Technology"], "authors": ["Peter M. van de Ven.....http://dblp.org/pers/hd/v/Ven:Peter_M=_van_de", "Sem C. Borst.....http://dblp.org/pers/hd/b/Borst:Sem_C=", "Seva Shneer.....http://dblp.org/pers/hd/s/Shneer:Seva"], "conf": "infocom", "year": "2009", "pages": 9}