{"title": "Web Query Recommendation via Sequential Query Prediction.", "fields": ["rdf query language", "ranking", "web query classification", "sargable", "web search query"], "abstract": "Web query recommendation has long been considered a key feature of search engines. Building a good Web query recommendation system, however, is very difficult due to the fundamental challenge of predicting users' search intent, especially given the limited user context information. In this paper, we propose a novel \"sequential query prediction\" approach that tries to grasp a user's search intent based on his/her past query sequence and its resemblance to historical query sequence models mined from massive search engine logs. Different query sequence models were examined, including the naive variable length N-gram model, Variable Memory Markov (VMM) model, and our proposed Mixture Variable Memory Markov (MVMM) model. Extensive experiments were conducted to benchmark our sequence prediction algorithms against two conventional pairwise approaches on large-scale search logs extracted from a commercial search engine. Results show that the sequence-wise approaches significantly outperform the conventional pair-wise ones in terms of prediction accuracy. In particular, our MVMM approach, consistently leads the pack, making it an effective and practical approach towards Web query recommendation.", "citation": "Citations (104)", "departments": ["Nanyang Technological University", "Microsoft", "Microsoft", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Qi He.....http://dblp.org/pers/hd/h/He:Qi", "Daxin Jiang.....http://dblp.org/pers/hd/j/Jiang:Daxin", "Zhen Liao.....http://dblp.org/pers/hd/l/Liao:Zhen", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Kuiyu Chang.....http://dblp.org/pers/hd/c/Chang:Kuiyu", "Ee-Peng Lim.....http://dblp.org/pers/hd/l/Lim:Ee=Peng", "Hang Li.....http://dblp.org/pers/hd/l/Li:Hang"], "conf": "icde", "year": "2009", "pages": 12}