{"title": "Tree Indexing on Flash Disks.", "fields": ["logarithm", "pointer", "speedup", "fractional cascading", "nearest neighbor search"], "abstract": "Large flash disks have become an attractive alternative to magnetic hard disks, due to their high random read performance, low energy consumption and other features. However, writes, especially random writes, on the flash disk are inherently much slower than reads because of the erase-before-write mechanism. To address this asymmetry of read-write speeds in indexing on the flash disk, we propose the FD-tree, a tree index designed with the logarithmic method and fractional cascading techniques. With the logarithmic method, an FD-tree consists of the head tree – a small B+-tree on the top, and a few levels of sorted runs of increasing sizes at the bottom. This design is write-optimized for the flash disk; in particular, an index search will potentially go through more levels or visit more nodes, but random writes are limited to the head tree and are subsequently transformed into sequential ones through merging into the lower runs. With the fractional cascading technique, we store pointers, called fences, in lower level runs to speed up the search. We evaluate the FD-tree in comparison with representative B+-tree variants under a variety of workloads. Our results show that the FD-tree has a similar search performance to the standard B+-tree, and a similar update performance to the write-optimized B+-tree variant. As a result, FD-tree outperforms all these B+-tree index variants on both update- and search-intensive workloads.", "citation": "Citations (124)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Yinan Li.....http://dblp.org/pers/hd/l/Li:Yinan", "Bingsheng He.....http://dblp.org/pers/hd/h/He:Bingsheng", "Qiong Luo.....http://dblp.org/pers/hd/l/Luo_0001:Qiong", "Ke Yi.....http://dblp.org/pers/hd/y/Yi:Ke"], "conf": "icde", "year": "2009", "pages": 4}