{"title": "Enhancing lifetime and security of PCM-based main memory with start-gap wear leveling.", "fields": ["wear leveling", "interleaved memory", "registered memory", "indirection", "semiconductor memory"], "abstract": "Phase Change Memory (PCM) is an emerging memory technology that can increase main memory capacity in a cost-effective and power-efficient manner. However, PCM cells can endure only a maximum of 10 7  - 10 8  writes, making a PCM based system have a lifetime of only a few years under ideal conditions. Furthermore, we show that non-uniformity in writes to different cells reduces the achievable lifetime of PCM system by 20x. Writes to PCM cells can be made uniform with  Wear-Leveling . Unfortunately, existing wear-leveling techniques require large storage tables and indirection, resulting in significant area and latency overheads.   We propose  Start-Gap , a simple, novel, and effective wear-leveling technique that uses only two registers. By combining  Start-Gap  with simple address-space randomization techniques we show that the achievable lifetime of the baseline 16GB PCM-based system is boosted from 5% (with no wear-leveling) to 97% of the theoretical maximum, while incurring a total storage overhead of less than 13 bytes and obviating the latency overhead of accessing large tables.   We also analyze the security vulnerabilities for memory systems that have limited write endurance, showing that under adversarial settings, a PCM-based system can fail in less than one minute. We provide a simple extension to  Start-Gap  that makes PCM-based systems robust to such malicious attacks.", "citation": "Citations (615)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Moinuddin K. Qureshi.....http://dblp.org/pers/hd/q/Qureshi:Moinuddin_K=", "John P. Karidis.....http://dblp.org/pers/hd/k/Karidis:John_P=", "Michele Franceschini.....http://dblp.org/pers/hd/f/Franceschini:Michele", "Vijayalakshmi Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Vijayalakshmi", "Luis Lastras.....http://dblp.org/pers/hd/l/Lastras:Luis", "Bülent Abali.....http://dblp.org/pers/hd/a/Abali:B=uuml=lent"], "conf": "micro", "year": "2009", "pages": 10}