{"title": "Bundling features for large scale partial-duplicate web image search.", "fields": ["feature", "visual word", "feature detection", "bag of words model in computer vision", "automatic image annotation"], "abstract": "In state-of-the-art image retrieval systems, an image is represented by a bag of visual words obtained by quantizing high-dimensional local image descriptors, and scalable schemes inspired by text retrieval are then applied for large scale image indexing and retrieval. Bag-of-words representations, however: 1) reduce the discriminative power of image features due to feature quantization; and 2) ignore geometric relationships among visual words. Exploiting such geometric constraints, by estimating a 2D affine transformation between a query image and each candidate image, has been shown to greatly improve retrieval precision but at high computational cost. In this paper we present a novel scheme where image features are bundled into local groups. Each group of bundled features becomes much more discriminative than a single feature, and within each group simple and robust geometric constraints can be efficiently enforced. Experiments in Web image search, with a database of more than one million images, show that our scheme achieves a 49% improvement in average precision over the baseline bag-of-words approach. Retrieval performance is comparable to existing full geometric verification approaches while being much less computationally expensive. When combined with full geometric verification we achieve a 77% precision improvement over the baseline bag-of-words approach, and a 24% improvement over full geometric verification alone.", "citation": "Citations (449)", "year": "2009", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "cvpr", "authors": ["Zhong Wu.....http://dblp.org/pers/hd/w/Wu:Zhong", "Qifa Ke.....http://dblp.org/pers/hd/k/Ke:Qifa", "Michael Isard.....http://dblp.org/pers/hd/i/Isard:Michael", "Jian Sun.....http://dblp.org/pers/hd/s/Sun_0001:Jian"], "pages": 8}