{"title": "PenLight: combining a mobile projector and a digital pen for dynamic visual overlay.", "fields": ["video projector", "overlay", "projector", "testbed", "interaction technique"], "abstract": "Digital pen systems, originally designed to digitize annotations made on physical paper, are evolving to permit a wider variety of applications. Although the type and quality of pen feedback (e.g., haptic, audio, and visual) have a huge impact on advancing the digital pen technology, dynamic visual feedback has yet to be fully investigated. In parallel, miniature projectors are an emerging technology with the potential to enhance visual feedback for small mobile computing devices. In this paper we present the PenLight system, which is a testbed to explore the interaction design space and its accompanying interaction techniques in a digital pen embedded with a spatially-aware miniature projector. Using our prototype, that simulates a miniature projection (via a standard video projector), we visually augment paper documents, giving the user immediate access to additional information and computational tools. We also show how virtual ink can be managed in single and multi-user environments to aid collaboration and data management. User evaluation with professional architects indicated promise of our proposed techniques and their potential utility in the paper-intensive domain of architecture.", "citation": "Citations (75)", "departments": ["University of Maryland, College Park", "Autodesk", "Autodesk", "Cornell University", "Autodesk"], "authors": ["Hyunyoung Song.....http://dblp.org/pers/hd/s/Song:Hyunyoung", "Tovi Grossman.....http://dblp.org/pers/hd/g/Grossman:Tovi", "George W. Fitzmaurice.....http://dblp.org/pers/hd/f/Fitzmaurice:George_W=", "François Guimbretière.....http://dblp.org/pers/hd/g/Guimbreti=egrave=re:Fran=ccedil=ois", "Azam Khan.....http://dblp.org/pers/hd/k/Khan:Azam", "Ramtin Attar.....http://dblp.org/pers/hd/a/Attar:Ramtin", "Gordon Kurtenbach.....http://dblp.org/pers/hd/k/Kurtenbach:Gordon"], "conf": "chi", "year": "2009", "pages": 10}