{"title": "Space-Constrained Gram-Based Indexing for Efficient Approximate String Search.", "fields": ["query optimization", "web query classification", "query expansion", "string searching algorithm", "web search query"], "abstract": "Answering approximate queries on string collections is important in applications such as data cleaning, query relaxation, and spell checking, where inconsistencies and errors exist in user queries as well as data. Many existing algorithms use gram-based inverted-list indexing structures to answer approximate string queries. These indexing structures are \"notoriously\" large compared to the size of their original string collection. In this paper, we study how to reduce the size of such an indexing structure to a given amount of space, while retaining ef?cient query processing. We ?rst study how to adopt existing inverted-list compression techniques to solve our problem. Then, we propose two novel approaches for achieving the goal: one is based on discarding gram lists, and one is based on combining correlated lists. They are both orthogonal to existing compression techniques, exploit a unique property of our setting, and offer new opportunities for improving query performance. For each approach we analyze its effect on query performance and develop algorithms for wisely choosing lists to discard or combine. Our extensive experiments on real data sets show that our approaches provide applications the ?exibility in deciding the tradeoff between query performance and indexing size, and can outperform existing compression techniques. An interesting and surprising ?nding is that while we can reduce the index size signi?cantly (up to 60% reduction) with tolerable performance penalties, for 20-40% reductions we can even improve query performance compared to original indexes.", "citation": "Citations (120)", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Irvine", "Renmin University of China"], "authors": ["Alexander Behm.....http://dblp.org/pers/hd/b/Behm:Alexander", "Shengyue Ji.....http://dblp.org/pers/hd/j/Ji:Shengyue", "Chen Li.....http://dblp.org/pers/hd/l/Li_0001:Chen", "Jiaheng Lu.....http://dblp.org/pers/hd/l/Lu:Jiaheng"], "conf": "icde", "year": "2009", "pages": 12}