{"title": "Dix.", "fields": ["wnt signaling pathway", "catenin", "cell fate determination", "cytoplasm", "dishevelled", "disease", "effector", "chikungunya", "cytoskeleton", "ellipse", "internal medicine", "axin1", "smoothing", "polymerization", "beta catenin", "endocrinology", "medicine", "outbreak", "spindle apparatus", "residual", "strike and dip", "virus", "asymmetric cell division", "grid", "point mutation", "gsk 3", "normal moveout", "influenza a virus", "inversion", "virology", "pandemic", "slowness", "azimuth", "bounded function"], "abstract": "Despite the complexity of wave propagation in anisotropic media, reflection moveout on conventional common-midpoint (CMP) spreads is usually well described by the normal-moveout (NMO) velocity defined in the zero-offset limit. In their recent work, Grechka and Tsvankin showed that the azimuthal variation of NMO velocity around a fixed CMP location generally has an elliptical form (i.e. plotting the NMO velocity in each azimuthal direction produces an ellipse) and is determined by the spatial derivatives of the slowness vector evaluated at the CMP location. This formalism is used here to develop exact solutions for the NMO velocity in anisotropic media of arbitrary symmetry. For the model of a single homogeneous layer above a dipping reflector, we obtain an explicit NMO expression valid for all pure modes and any orientation of the CMP line with respect to the reflector strike. The contribution of anisotropy to NMO velocity is contained in the slowness components of the zero-offset ray (along with the derivatives of the vertical slowness with respect to the horizontal slownesses) - quantities that can be found in a straightforward way from the Christoffel equation. If the medium above a dipping reflector is horizontally stratified, the effective NMO velocity is determined through a Dix-type average of the matrices responsible for the 'interval' NMO ellipses in the individual layers. This generalized Dix equation provides an analytic basis for moveout inversion in vertically inhomogeneous, arbitrarily anisotropic media. For models with a throughgoing vertical symmetry plane (i.e. if the dip plane of the reflector coincides with a symmetry plane of the overburden), the semi-axes of the NMO ellipse are found by the more conventional rms averaging of the interval NMO velocities in the dip and strike directions. Modelling of normal moveout in general heterogeneous anisotropic media requires dynamic ray tracing of only one (zero-offset) ray. Remarkably, the expressions for geometrical spreading along the zero-offset ray contain all the components necessary to build the NMO ellipse. This method is orders of magnitude faster than multi-azimuth, multi-offset ray tracing and, therefore, can be used efficiently in traveltime inversion and in devising fast dip-moveout (DMO) processing algorithms for anisotropic media. This technique becomes especially efficient if the model consists of homogeneous layers or blocks separated by smooth interfaces. The high accuracy of our NMO expressions is illustrated by comparison with ray-traced reflection traveltimes in piecewise-homogeneous, azimuthally anisotropic models. We also apply the generalized Dix equation to field data collected over a fractured reservoir and show that P-wave moveout can be used to find the depth-dependent fracture orientation and to evaluate the magnitude of azimuthal anisotropy.", "citation": "Citations (142)", "departments": ["Colorado School of Mines", "Colorado School of Mines", "Colorado School of Mines", "Hiroshima University", "National Presto Industries", "Hiroshima University", "Hiroshima University", "Hiroshima University", "Hiroshima University", "European Molecular Biology Organization", "Laboratory of Molecular Biology", "University of Hyogo", "Laboratory of Molecular Biology", "Hiroshima University", "Anschutz Medical Campus", "Anschutz Medical Campus", "Harvard University", "Anschutz Medical Campus", "Harvard University", "Réanimation néo ...  et pédiatrique", "Réanimation néo ...  et pédiatrique", "Réanimation néo ...  et pédiatrique", "Laboratoire de  ... int-Pierre (97)", "Réanimation néo ...  et pédiatrique"], "authors": ["Stephen Venning.....http://dblp.org/pers/hd/v/Venning:Stephen"], "conf": "siggraph", "year": "2009", "pages": 1}