{"title": "Detecting spammers and content promoters in online video social networks.", "fields": ["social relation", "social media", "support vector machine", "internet privacy", "spite", "feature extraction", "spamming", "social network", "computer science"], "abstract": "A number of online video social networks, out of which YouTube is the most popular, provides features that allow users to post a video as a response to a discussion topic. These features open opportunities for users to introduce polluted content, or simply pollution, into the system. For instance,  spammers  may post an unrelated video as response to a popular one aiming at increasing the likelihood of the  response  being viewed by a larger number of users. Moreover, opportunistic users-- promoters --may try to gain visibility to a specific video by posting a large number of (potentially unrelated) responses to boost the rank of the  responded video , making it appear in the top lists maintained by the system. Content pollution may jeopardize the trust of users on the system, thus compromising its success in promoting social interactions. In spite of that, the available literature is very limited in providing a deep understanding of this problem.   In this paper, we go a step further by addressing the issue of detecting video spammers and promoters. Towards that end, we manually build a test collection of real YouTube users, classifying them as spammers, promoters, and legitimates. Using our test collection, we provide a characterization of social and content attributes that may help distinguish each user class. We also investigate the feasibility of using a state-of-the-art supervised classification algorithm to detect spammers and promoters, and assess its effectiveness in our test collection. We found that our approach is able to correctly identify the majority of the promoters, misclassifying only a small percentage of legitimate users. In contrast, although we are able to detect a significant fraction of spammers, they showed to be much harder to distinguish from legitimate users.", "citation": "Citations (222)", "departments": ["Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais"], "authors": ["Fabrício Benevenuto.....http://dblp.org/pers/hd/b/Benevenuto:Fabr=iacute=cio", "Tiago Rodrigues.....http://dblp.org/pers/hd/r/Rodrigues:Tiago", "Virgílio A. F. Almeida.....http://dblp.org/pers/hd/a/Almeida:Virg=iacute=lio_A=_F=", "Jussara M. Almeida.....http://dblp.org/pers/hd/a/Almeida:Jussara_M=", "Marcos André Gonçalves.....http://dblp.org/pers/hd/g/Gon=ccedil=alves:Marcos_Andr=eacute="], "conf": "sigir", "year": "2009", "pages": 8}