{"title": "Effective XML Keyword Search with Relevance Oriented Ranking.", "fields": ["phrase search", "keyword density", "search analytics", "xml framework", "concept search"], "abstract": "Inspired by the great success of information retrieval (IR) style keyword search on the web, keyword search on XML has emerged recently. The difference between text database and XML database results in three new challenges: (1) Identify the user search intention, i.e. identify the XML node types that user wants to search for and search via. (2) Resolve keyword ambiguity problems: a keyword can appear as both a tag name and a text value of some node; a keyword can appear as the text values of different XML node types and carry different meanings. (3) As the search results are sub-trees of the XML document, new scoring function is needed to estimate its relevance to a given query. However, existing methods cannot resolve these challenges, thus return low result quality in term of query relevance. In this paper, we propose an IR-style approach which basically utilizes the statistics of underlying XML data to address these challenges. We first propose specific guidelines that a search engine should meet in both search intention identification and relevance oriented ranking for search results. Then based on these guidelines, we design novel formulae to identify the search for nodes and search via nodes of a query, and present a novel XML TF*IDF ranking strategy to rank the individual matches of all possible search intentions. Lastly, the proposed techniques are implemented in an XML keyword search engine called XReal, and extensive experiments show the effectiveness of our approach.", "citation": "Citations (231)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Renmin University of China"], "authors": ["Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng", "Tok Wang Ling.....http://dblp.org/pers/hd/l/Ling:Tok_Wang", "Bo Chen.....http://dblp.org/pers/hd/c/Chen:Bo", "Jiaheng Lu.....http://dblp.org/pers/hd/l/Lu:Jiaheng"], "conf": "icde", "year": "2009", "pages": 12}