{"title": "Modeling and understanding end-to-end class of service policies in operational networks.", "fields": ["private network", "class of service", "differentiated service", "access control list", "end to end principle"], "abstract": "Business and economic considerations are driving the extensive use of service differentiation in Virtual Private Networks (VPNs) operated for business enterprises today. The resulting Class of Service (CoS) designs embed complex policy decisions based on the described priorities of various applications, extent of bandwidth availability, and cost considerations. These inherently complex high-level policies are realized through low-level router configurations. The configuration process is tedious and error-prone given the highly intertwined nature of CoS configuration, the multiple router configurations over which the policies are instantiated, and the complex access control lists (ACLs) involved. Our contributions include (i) a formal approach to modeling CoS policies from router configuration files in a precise manner; (ii) a practical and computationally efficient tool that can determine the CoS treatment received by an arbitrary set of flows across multiple routers; and (iii) a validation of our approach in enabling applications such as troubleshooting, auditing, and visualization of network-wide CoS design, using router configuration data from a cross-section of 150 diverse enterprise VPNs. To our knowledge, this is the first effort aimed at modeling and analyzing CoS configurations.", "citation": "Citations (55)", "year": "2009", "departments": ["Purdue University", "AT&T Labs", "AT&T", "Purdue University", "AT&T Labs"], "conf": "sigcomm", "authors": ["Yu-Wei Eric Sung.....http://dblp.org/pers/hd/s/Sung:Yu=Wei_Eric", "Carsten Lund.....http://dblp.org/pers/hd/l/Lund:Carsten", "Mark Lyn.....http://dblp.org/pers/hd/l/Lyn:Mark", "Sanjay G. Rao.....http://dblp.org/pers/hd/r/Rao:Sanjay_G=", "Subhabrata Sen.....http://dblp.org/pers/hd/s/Sen:Subhabrata"], "pages": 12}