{"title": "Design, implementation and evaluation of an efficient opportunistic retransmission protocol.", "fields": ["network packet", "link layer", "retransmission", "testbed", "fading"], "abstract": "This paper presents an efficient opportunistic retransmission protocol (PRO, Protocol for Retransmitting Opportunistically) to improve the performance of IEEE 802.11 WLANs. PRO is a link-layer protocol that allows overhearing nodes to function as relays that retransmit on behalf of the source after they learn about a failed transmission. Relays with stronger connectivity to the destination have a higher chance of delivering the packet than the source does, thereby resulting in a more efficient use of the channel. PRO has four main features. First, channel reciprocity coupled with a run-time calibration process is used to estimate the instantaneous link quality to the destination. Second, a local qualification process filters out poor relays early. Third, a distributed relay selection algorithm chooses the best set of eligible relays among all qualified relays and prioritizes them. Finally, 802.11e Enhanced Distributed Channel Access (EDCA) is leveraged to make sure high priority relays transmit with high probability. PRO is designed to coexist with legacy 802.11 stations. We have implemented PRO in the driver of a commodity wireless card. Our extensive evaluation on both a controlled testbed and in the real world shows that PRO boosts throughput in diverse wireless environments, and especially in when there is significant contention for the channels, under fading, and with user mobility.", "citation": "Citations (111)", "departments": ["Cornell University", "Electrical and  ... sburgh, PA, USA", "School of Compu ... subrgh, PA, USA"], "authors": ["Mei-Hsuan Lu.....http://dblp.org/pers/hd/l/Lu:Mei=Hsuan", "Peter Steenkiste.....http://dblp.org/pers/hd/s/Steenkiste:Peter", "Tsuhan Chen.....http://dblp.org/pers/hd/c/Chen:Tsuhan"], "conf": "mobicom", "year": "2009", "pages": 12}