{"title": "Streaming HD H.264 encoder on programmable processors.", "fields": ["stream processing", "model based design", "encoder", "x86", "speedup"], "abstract": "Programmable processors have great advantage over dedicated ASIC design under intense time-to-market pressure. However, real-time encoding of high-definition (HD) H.264 video (up to 1080p) is a challenge to most existing programmable processors. On the other hand, model-based design is widely accepted in developing complex media program. Stream model, an emerging model-based programming method, shows surprising efficiency on many compute-intensive domains especially for media processing. On the basis, this paper proposes a set of streaming techniques for H.264 encoding, and then develops all of the code based on the X264 reference code. Our streaming H.264 encoder is a pure software implementation completely written in high-level language without special hardware/algorithm support. Real execution results show that our encoder achieves significant speedup over the original X264 encoder on various programmable architectures: on X86 Core TM 2 E8200 the speedup is 1.8x, on MIPS 4KEc the speedup is 3.7x, on TMS320 C6416 DSP the speedup is 5.5x, on stream processor STORM-SP16 G220 the speedup is 6.1x. Especially, on STORM processor, the streaming encoder achieves the performance of 30.6 frames per second for a 1080P HD sequence, satisfying the real-time requirement. These indicate that streaming is extremely efficient for this kind of media workload. Our work is also applicable for other media processing applications, and provides architecture insights into dedicated ASIC or FPGA HD H.264 encoders.", "citation": "Citations (17)", "departments": ["National University of Defense Technology", "National University of Defense Technology", "National University of Defense Technology", "National University of Defense Technology", "National University of Defense Technology"], "authors": ["Nan Wu.....http://dblp.org/pers/hd/w/Wu_0003:Nan", "Mei Wen.....http://dblp.org/pers/hd/w/Wen:Mei", "Wei Wu.....http://dblp.org/pers/hd/w/Wu:Wei", "Ju Ren.....http://dblp.org/pers/hd/r/Ren:Ju", "Huayou Su.....http://dblp.org/pers/hd/s/Su:Huayou", "Changqing Xun.....http://dblp.org/pers/hd/x/Xun:Changqing", "Chunyuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Chunyuan"], "conf": "mm", "year": "2009", "pages": 10}