{"title": "Locally vs. Globally Optimized Flow-Based Content Distribution to Mobile Nodes.", "fields": ["approximation algorithm", "mobility model", "ncos", "cellular network", "intelligent transportation system"], "abstract": "The paper deals with efficient distribution of timely information to flows of mobile devices. We consider the case where a set of Information Dissemination Devices (IDDs) broad- cast a limited amount of information to passing mobile nodes that are moving along well-defined paths. This is the case, for example, in intelligent transportation systems. We develop a novel model that captures the main aspects of the problem, and define a new optimization problem we call MBMAP (Maximum Benefit Message Assignment Problem). We study the computational complexity of this problem in the global and local cases, and provide new approximation algorithms. With the advance of mobile communication technologies, many new applications depend on the ability of the network to deliver timely information to the mobile nodes in real-time. Such applications can be found in the context of Intelligent Transportation Systems (ITSs), network centric operations (NCOs), sensor networks and cellular networks. There are several models for the dissemination of informa- tion to the mobile nodes. In this paper we consider a model where the mobile nodes do not pass the information to each other after they receive it from the disseminating devices. This is in contrast to the model proposed, for example, by (32), where vehicle-to-vehicle communication is considered. In addition, in the model we consider, the same information is delivered to all the nodes that pass by the same IDD. Another important aspect of our model is the considered mobility pattern. Instead of assuming random mobility, as in (27) and many other papers, we follow recent studies that in- dicate predictable mobility in mobile applications (29), which can be used to improve communication protocol performance. To capture this property, we assume that a mobility pattern is defined by flows. Namely, each mobile device belongs to one or more flows, and all the nodes of the same flow use the same path. Thus, they obtain the same benefit from the information distributed by every IDD.", "citation": "Citations (3)", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Mhameed Aezladen.....http://dblp.org/pers/hd/a/Aezladen:Mhameed", "Reuven Cohen.....http://dblp.org/pers/hd/c/Cohen:Reuven", "Danny Raz.....http://dblp.org/pers/hd/r/Raz:Danny"], "conf": "infocom", "year": "2009", "pages": 9}