{"title": "Decision Trees for Uncertain Data.", "fields": ["group method of data handling", "tuple", "uncertain data", "decision tree", "tree traversal", "decision tree learning", "statistic", "incremental decision tree"], "abstract": "Traditional decision tree classifiers work with data whose values are known and precise. We extend such classifiers to handle data with uncertain information. Value uncertainty arises in many applications during the data collection process. Example sources of uncertainty include measurement/quantization errors, data staleness, and multiple repeated measurements. With uncertainty, the value of a data item is often represented not by one single value, but by multiple values forming a probability distribution. Rather than abstracting uncertain data by statistical derivatives (such as mean and median), we discover that the accuracy of a decision tree classifier can be much improved if the \"complete information\" of a data item (taking into account the probability density function (pdf)) is utilized. We extend classical decision tree building algorithms to handle data tuples with uncertain values. Extensive experiments have been conducted which show that the resulting classifiers are more accurate than those using value averages. Since processing pdfs is computationally more costly than processing single values (e.g., averages), decision tree construction on uncertain data is more CPU demanding than that for certain data. To tackle this problem, we propose a series of pruning techniques that can greatly improve construction efficiency.", "citation": "Not cited", "departments": ["University of Hong Kong", "University of Hong Kong", "Yale University", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "Yale University", "University of Hong Kong", "University of Hong Kong"], "authors": ["Smith Tsang.....http://dblp.org/pers/hd/t/Tsang:Smith", "Ben Kao.....http://dblp.org/pers/hd/k/Kao:Ben", "Kevin Y. Yip.....http://dblp.org/pers/hd/y/Yip:Kevin_Y=", "Wai-Shing Ho.....http://dblp.org/pers/hd/h/Ho:Wai=Shing", "Sau Dan Lee.....http://dblp.org/pers/hd/l/Lee:Sau_Dan"], "conf": "icde", "year": "2009", "pages": 4}