{"title": "Hierarchical spatio-temporal context modeling for action recognition.", "fields": ["context model", "multiple kernel learning", "scale invariant feature transform", "stochastic matrix", "speedup"], "abstract": "The problem of recognizing actions in realistic videos is challenging yet absorbing owing to its great potentials in many practical applications. Most previous research is limited due to the use of simplified action databases under controlled environments or focus on excessively localized features without sufficiently encapsulating the spatio-temporal context. In this paper, we propose to model the spatio-temporal context information in a hierarchical way, where three levels of context are exploited in ascending order of abstraction: 1) point-level context (SIFT average descriptor), 2) intra-trajectory context (trajectory transition descriptor), and 3) inter-trajectory context (trajectory proximity descriptor). To obtain efficient and compact representations for the latter two levels, we encode the spatiotemporal context information into the transition matrix of a Markov process, and then extract its stationary distribution as the final context descriptor. Building on the multichannel nonlinear SVMs, we validate this proposed hierarchical framework on the realistic action (HOHA) and event (LSCOM) recognition databases, and achieve 27% and 66% relative performance improvements over the state-of-the-art results, respectively. We further propose to employ the Multiple Kernel Learning (MKL) technique to prune the kernels towards speedup in algorithm evaluation.", "citation": "Citations (444)", "year": "2009", "departments": ["National University of Singapore", "Chinese Academy of Sciences", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "conf": "cvpr", "authors": ["Ju Sun.....http://dblp.org/pers/hd/s/Sun:Ju", "Xiao Wu.....http://dblp.org/pers/hd/w/Wu_0004:Xiao", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Loong Fah Cheong.....http://dblp.org/pers/hd/c/Cheong:Loong_Fah", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng", "Jintao Li.....http://dblp.org/pers/hd/l/Li:Jintao"], "pages": 8}