{"title": "Dacota: Post-silicon validation of the memory subsystem in multi-core designs.", "fields": ["post silicon validation", "cache", "multi core processor", "integrated circuit design", "schedule"], "abstract": "The number of functional errors escaping design verification and being released into final silicon is growing, due to the increasing complexity and shrinking production schedules of modern processor designs. Recent trends towards chip multiprocessors (CMPs) are exacerbating the problem because of their complex and sometimes non-deterministic memory subsystems, prone to subtle but devastating bugs. This deteriorating situation calls for high-efficiency, high-coverage results in functional validation, results that are be achieved by leveraging the performance of post-silicon validation, that is, those verification tasks that are executed directly on prototype hardware. The orders-of-magnitude faster testing in post-silicon enables designers to achieve much higher coverage before customer release, but only if the limitations of this technology in diagnosis and internal node observability could be overcome. In this work, we unlock the full performance of post-silicon validation through Dacota, a new high-coverage solution for validating memory operation ordering in CMPs. When activated, Dacota reconfigures a portion of the cache storage to log memory accesses using a compact data-coloring scheme. Logs are periodically aggregated and checked by a distributed algorithm running in-situ on the CMP to verify correct memory operation ordering. When the design is ready for customer shipment, Dacota can be deactivated, releasing all cache storage, and only leaving a small silicon area footprint, less than 0.01% (three orders of magnitude smaller than previous solutions). We found experimentally that Dacota is effective in exposing memory subsystem bugs, and it delivers its high coverage capabilities at a 26% performance slowdown (only during validation) for real-world applications.", "citation": "Citations (55)", "departments": ["University of Michigan", "Undergraduate Education", "Electrical Engi ... and Engineering"], "authors": ["Andrew DeOrio.....http://dblp.org/pers/hd/d/DeOrio:Andrew", "Ilya Wagner.....http://dblp.org/pers/hd/w/Wagner:Ilya", "Valeria Bertacco.....http://dblp.org/pers/hd/b/Bertacco:Valeria"], "conf": "hpca", "year": "2009", "pages": 12}