{"title": "Light field video stabilization.", "fields": ["smart camera", "digital image processing", "vanishing point", "image based modeling and rendering", "light field", "computational photography", "image warping", "image stabilization", "structure from motion", "camera auto calibration", "video camera", "stereo camera"], "abstract": "We describe a method for producing a smooth, stabilized video from the shaky input of a hand-held light field video camera—specifically, a small camera array. Traditional stabilization techniques dampen shake with 2D warps, and thus have limited ability to stabilize a significantly shaky camera motion through a 3D scene. Other recent stabilization techniques synthesize novel views as they would have been seen along a virtual, smooth 3D camera path, but are limited to static scenes. We show that video camera arrays enable much more powerful video stabilization, since they allow changes in viewpoint for a single time instant. Furthermore, we point out that the straightforward approach to light field video stabilization requires computing structure-from-motion, which can be brittle for typical consumer-level video of general dynamic scenes. We present a more robust approach that avoids input camera path reconstruction. Instead, we employ a spacetime optimization that directly computes a sequence of relative poses between the virtual camera and the camera array, while minimizing acceleration of salient visual features in the virtual image plane. We validate our novel method by comparing it to state-of-the-art stabilization software, such as Apple iMovie and 2d3 SteadyMove Pro, on a number of challenging scenes.", "citation": "Not cited", "year": "2009", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "Adobe Systems", "Adobe Systems", "Northeastern University", "University of Zaragoza", "University of Zaragoza", "Shanghai Jiao Tong University", "Northeastern University"], "conf": "iccv", "authors": ["Brandon M. Smith.....http://dblp.org/pers/hd/s/Smith_0001:Brandon_M=", "Li Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Li", "Hailin Jin.....http://dblp.org/pers/hd/j/Jin:Hailin", "Aseem Agarwala.....http://dblp.org/pers/hd/a/Agarwala:Aseem"], "pages": 8}