{"title": "A crowdsourceable QoE evaluation framework for multimedia content.", "fields": ["internet access", "quality of experience", "economic cost", "ask price", "provisioning"], "abstract": "Until recently, QoE (Quality of Experience) experiments had to be conducted in academic laboratories; however, with the advent of ubiquitous Internet access, it is now possible to ask an Internet crowd to conduct experiments on their personal computers. Since such a crowd can be quite large, crowdsourcing enables researchers to conduct experiments with a more diverse set of participants at a lower economic cost than would be possible under laboratory conditions. However, because participants carry out experiments without supervision, they may give erroneous feedback perfunctorily, carelessly, or dishonestly, even if they receive a reward for each experiment.   In this paper, we propose a crowdsourceable framework to quantify the QoE of multimedia content. The advantages of our framework over traditional MOS ratings are: 1) it enables crowdsourcing because it supports systematic verification of participants' inputs; 2) the rating procedure is simpler than that of MOS, so there is less burden on participants; and 3) it derives interval-scale scores that enable subsequent quantitative analysis and QoE provisioning. We conducted four case studies, which demonstrated that, with our framework, researchers can outsource their QoE evaluation experiments to an Internet crowd without risking the quality of the results; and at the same time, obtain a higher level of participant diversity at a lower monetary cost.", "citation": "Citations (188)", "departments": ["Academia Sinica", "National Taiwan University", "National Taiwan University", "National Taiwan University"], "authors": ["Kuan-Ta Chen.....http://dblp.org/pers/hd/c/Chen:Kuan=Ta", "Chen-Chi Wu.....http://dblp.org/pers/hd/w/Wu:Chen=Chi", "Yu-Chun Chang.....http://dblp.org/pers/hd/c/Chang:Yu=Chun", "Chin-Laung Lei.....http://dblp.org/pers/hd/l/Lei:Chin=Laung"], "conf": "mm", "year": "2009", "pages": 10}