{"title": "On the effectiveness of secret key extraction from wireless signal strength in real environments.", "fields": ["lossy compression", "key generation", "adversary", "entropy", "randomness tests"], "abstract": "We evaluate the effectiveness of secret key extraction, for private communication between two wireless devices, from the received signal strength (RSS) variations on the wireless channel between the two devices. We use real world measurements of RSS in a variety of environments and settings. Our experimental results show that (i) in certain environments, due to lack of variations in the wireless channel, the extracted bits have very low entropy making these bits unsuitable for a secret key, (ii) an adversary can cause predictable key generation in these static environments, and (iii) in dynamic scenarios where the two devices are mobile, and/or where there is a significant movement in the environment, high entropy bits are obtained fairly quickly. Building on the strengths of existing secret key extraction approaches, we develop an environment adaptive secret key generation scheme that uses an adaptive lossy quantizer in conjunction with Cascade-based information reconciliation [7] and privacy amplification [14]. Our measurements show that our scheme, in comparison to the existing ones that we evaluate, performs the best in terms of generating high entropy bits at a high bit rate. The secret key bit streams generated by our scheme also pass the randomness tests of the NIST test suite [21] that we conduct.", "citation": "Citations (389)", "departments": ["University of Utah", "University of Utah", "University of Utah", "University of Utah", "University of Utah"], "authors": ["Suman Jana.....http://dblp.org/pers/hd/j/Jana:Suman", "Sriram Nandha Premnath.....http://dblp.org/pers/hd/p/Premnath:Sriram_Nandha", "Mike Clark.....http://dblp.org/pers/hd/c/Clark:Mike", "Sneha Kumar Kasera.....http://dblp.org/pers/hd/k/Kasera:Sneha_Kumar", "Neal Patwari.....http://dblp.org/pers/hd/p/Patwari:Neal", "Srikanth V. Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Srikanth_V="], "conf": "mobicom", "year": "2009", "pages": 12}