{"title": "Monitoring path nearest neighbor in road networks.", "fields": ["heuristic", "yen s algorithm", "k shortest path routing", "constrained shortest path first", "spatial database"], "abstract": "This paper addresses the problem of monitoring the  k  nearest neighbors to a dynamically changing path in road networks. Given a destination where a user is going to, this new query returns the  k -NN with respect to the shortest path connecting the destination and the user's current location, and thus provides a list of nearest candidates for reference by considering the whole coming journey. We name this query the  k -Path Nearest Neighbor query ( k -PNN). As the user is moving and may not always follow the shortest path, the query path keeps changing. The challenge of monitoring the  k -PNN for an arbitrarily moving user is to dynamically determine the update locations and then refresh the  k -PNN efficiently. We propose a three-phase  Best-first Network Expansion  (BNE) algorithm for monitoring the  k -PNN and the corresponding shortest path. In the searching phase, the BNE finds the shortest path to the destination, during which a candidate set that guarantees to include the  k -PNN is generated at the same time. Then in the  verification phase , a heuristic algorithm runs for examining candidates' exact distances to the query path, and it achieves significant reduction in the number of visited nodes. The  monitoring phase  deals with computing update locations as well as refreshing the  k -PNN in different user movements. Since determining the network distance is a costly process, an expansion tree and the candidate set are carefully maintained by the BNE algorithm, which can provide efficient update on the shortest path and the  k -PNN results. Finally, we conduct extensive experiments on real road networks and show that our methods achieve satisfactory performance.", "citation": "Citations (105)", "year": "2009", "departments": ["University of Queensland", "University of Queensland", "University of Queensland", "The Chinese University of Hong Kong"], "conf": "sigmod", "authors": ["Zaiben Chen.....http://dblp.org/pers/hd/c/Chen:Zaiben", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu"], "pages": 12}