{"title": "Local Search: Is Brute-Force Avoidable?", "fields": ["planar graph", "degree", "indifference graph", "pathwidth", "maximal independent set", "vertex cover"], "abstract": "Many local search algorithms are based on searching in the k-exchange neighborhood. This is the set of solutions that can be obtained from the current solution by exchanging at most k elements. As a rule of thumb, the larger k is, the better are the chances of finding an improved solution. However, for inputs of size n, a naive brute-force search of the k-exchange neighborhood requires n^O^(^k^) time, which is not practical even for very small values of k. We show that for several classes of sparse graphs, including planar graphs, graphs of bounded vertex degree and graphs excluding some fixed graph as a minor, an improved solution in the k-exchange neighborhood for many problems can be found much more efficiently. Our algorithms run in time O(@t(k)@?n^c), where @t is a function depending only on k and c is a constant independent of k and n. We demonstrate the applicability of this approach on a variety of problems including r-Center, Vertex Cover, Odd Cycle Transversal, Max-Cut, and Min-Bisection. In particular, on planar graphs, all our algorithms searching for a k-local improvement run in time O(2^O^(^k^)@?n^2), which is polynomial for k=O(logn). We complement these fixed-parameter tractable algorithms for k-local search with parameterized intractability results indicating that brute-force search is unavoidable in more general classes of graphs.", "citation": "Citations (38)", "departments": ["Charles Darwin University", "University of Bergen", "University of California, Berkeley", "Charles Darwin University", "Institute of Mathematical Sciences, Chennai", "University of Newcastle", "University of Newcastle", "University of Bergen", "University of Bergen", "University of Bergen"], "authors": ["Michael R. Fellows.....http://dblp.org/pers/hd/f/Fellows:Michael_R=", "Frances A. Rosamond.....http://dblp.org/pers/hd/r/Rosamond:Frances_A=", "Fedor V. Fomin.....http://dblp.org/pers/hd/f/Fomin:Fedor_V=", "Daniel Lokshtanov.....http://dblp.org/pers/hd/l/Lokshtanov:Daniel", "Saket Saurabh.....http://dblp.org/pers/hd/s/Saurabh_0001:Saket", "Yngve Villanger.....http://dblp.org/pers/hd/v/Villanger:Yngve"], "conf": "ijcai", "year": "2009", "pages": 6}