{"title": "Drowsy Transmission: Physical Layer Energy Optimization for Transmitting Random Packet Traffic.", "fields": ["network packet", "power management", "power optimization", "physical layer", "power control"], "abstract": "Energy efficiency has become increasingly important to mobile systems on which wireless interfaces are among the largest power consumers. While existing physical layer power optimization mostly focuses on improving the transmission effi- ciency, our recent work has showed that wireless interfaces can spend most of its time and energy in very short idle periods between transmitting two packets (9). In this work, we present a physical layer optimization method, drowsy transmission, which explicitly considers the power cost of such idle periods in physical layer power optimization through joint power con- trol/rate selection and power management. We provide a control theoretical formulation of the optimization problem and present a dynamic programming based solution and its approximation that is close form and practical. We further offer an on-line learning technique to cope with unknown channel and traffic. Using a power model from a commercial wireless network interface card, we demonstrate that drowsy transmission can reduce the energy per bit by 70% and 40% in comparison to power control/rate selection-based optimization and optimization with disjoint power control/rate selection and power management, respectively . Moreover, the achieved energy per bit is very close to the theoretical lower bound. Our evaluation shows that the proposed on-line learning technique can assess the channel and approach the performance under pre-known channel in as short as 200ms. We also show that our optimization introduces negligible packet delays.", "citation": "Citations (6)", "departments": ["University of Tennessee", "Rice University", "University of Tennessee"], "authors": ["Husheng Li.....http://dblp.org/pers/hd/l/Li:Husheng", "Lin Zhong.....http://dblp.org/pers/hd/z/Zhong_0001:Lin", "Kun Zheng.....http://dblp.org/pers/hd/z/Zheng:Kun"], "conf": "infocom", "year": "2009", "pages": 9}