{"title": "Age based scheduling for asymmetric multiprocessors.", "fields": ["fixed priority pre emptive scheduling", "stride scheduling", "round robin scheduling", "two level scheduling", "gang scheduling"], "abstract": "Asymmetric (or Heterogeneous) Multiprocessors are becoming popular in the current era of multi-cores due to their power efficiency and potential performance and energy efficiency. However, scheduling of multithreaded applications in Asymmetric Multiprocessors is still a challenging problem. Scheduling algorithms for Asymmetric Multiprocessors must not only be aware of asymmetry in processor performance, but have to consider the characteristics of application threads also.   In this paper, we propose a new scheduling policy, Age based scheduling, that assigns a thread with a larger remaining execution time to a fast core. Age based scheduling predicts the remaining execution time of threads based on their age, i.e., when the threads were created. These predictions are based on the insight that most threads that are created together tend to have similar execution durations. Using Age based scheduling, we improve the overall performance of several important multithreaded applications including Parsec and asymmetric benchmarks from Splash-II and Omp-SCR. Our evaluations show that Age based scheduling improves performance up to 37% compared to the state-of-the-art Asymmetric Multiprocessor scheduling policy and on average by 10.4% for the Parsec benchmarks. Our results also show that the Age based scheduling policy with profiling improves the average performance by 13.2% for the Parsec benchmarks.", "citation": "Citations (85)", "year": "2009", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "sc", "authors": ["Nagesh B. Lakshminarayana.....http://dblp.org/pers/hd/l/Lakshminarayana:Nagesh_B=", "Jaekyu Lee.....http://dblp.org/pers/hd/l/Lee:Jaekyu", "Hyesoon Kim.....http://dblp.org/pers/hd/k/Kim:Hyesoon"], "pages": -1}