{"title": "Communicating Eye-gaze Across a Distance: Comparing an Eye-gaze enabled Immersive Collaborative Virtual Environment, Aligned Video Conferencing, and Being Together.", "fields": ["immersion", "teleconference", "videoconferencing", "collaborative virtual environment", "collaborative software"], "abstract": "Eye gaze is an important and widely studied non-verbal resource in co-located social interaction. When we attempt to support tele-presence between people, there are two main technologies that can be used today: video-conferencing (VC) and collaborative virtual environments (CVEs). In VC, one can observe eye-gaze behaviour but practically the targets of eye-gaze are only correct if the participants remain relatively still. We attempt to support eye-gaze behaviour in an unconstrained manner by integrating eye-trackers into an Immersive CVE (ICVE) system. This paper aims to show that while both ICVE and VC allow people to discern being looked at and what else is looked at, when someone gazes into their space from another location, ICVE alone can continue to do this as people move. The conditions of aligned VC, ICVE, eye-gaze enabled ICVE and co-location are compared. The impact of factors of alignment, lighting, resolution, and perspective distortion are minimised through a set of pilot experiments, before a formal experiment records results for optimal settings. Results show that both VC and ICVE support eye-gaze in constrained situations, but only ICVE supports movement of the observer. We quantify the mis-judgements that are made and discuss how our findings might inform research into supporting eye-gaze through interpolated free viewpoint video based methods.", "citation": "Citations (33)", "departments": ["University of Salford", "University of Salford", "University of Roehampton", "University College London", "University of Salford"], "authors": ["David J. Roberts.....http://dblp.org/pers/hd/r/Roberts:David_J=", "Robin Wolff.....http://dblp.org/pers/hd/w/Wolff:Robin", "John Rae.....http://dblp.org/pers/hd/r/Rae:John", "Anthony Steed.....http://dblp.org/pers/hd/s/Steed:Anthony", "Rob Aspin.....http://dblp.org/pers/hd/a/Aspin:Rob", "Moira McIntyre.....http://dblp.org/pers/hd/m/McIntyre:Moira", "Adriana Pena.....http://dblp.org/pers/hd/p/Pena:Adriana", "Oyewole Oyekoya.....http://dblp.org/pers/hd/o/Oyekoya:Oyewole", "William Steptoe.....http://dblp.org/pers/hd/s/Steptoe:William"], "conf": "vr", "year": "2009", "pages": 8}