{"title": "Comprehensive query-dependent fusion using regression-on-folksonomies: a case study of multimodal music search.", "fields": ["information needs", "knowledge space", "folksonomy", "test data", "multimodal search"], "abstract": "The combination of heterogeneous knowledge sources has been widely regarded as an effective approach to boost retrieval accuracy in many information retrieval domains. While various technologies have been recently developed for information retrieval, multimodal music search has not kept pace with the enormous growth of data on the Internet. In this paper, we study the problem of integrating multiple online information sources to conduct effective query dependent fusion (QDF) of multiple search experts for music retrieval. We have developed a novel framework to construct a knowledge space of users' information need from online folksonomy data. With this innovation, a large number of comprehensive queries can be automatically constructed to train a better generalized QDF system against unseen user queries. In addition, our framework models QDF problem by regression of the optimal combination strategy on a query. Distinguished from the previous approaches, the regression model of QDF (RQDF) offers superior modeling capability with less constraints and more efficient computation. To validate our approach, a large scale test collection has been collected from different online sources, such as Last.fm, Wikipedia, and YouTube. All test data will be released to the public for better research synergy in multimodal music search. Our performance study indicates that the accuracy, efficiency, and robustness of the multimodal music search can be improved significantly by the proposed folksonomy-RQDF approach. In addition, since no human involvement is required to collect training examples, our approach offers great feasibility and practicality in system development.", "citation": "Citations (12)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Singapore Management University", "National University of Singapore"], "authors": ["Bingjun Zhang.....http://dblp.org/pers/hd/z/Zhang:Bingjun", "Qiaoliang Xiang.....http://dblp.org/pers/hd/x/Xiang:Qiaoliang", "Huanhuan Lu.....http://dblp.org/pers/hd/l/Lu:Huanhuan", "Jialie Shen.....http://dblp.org/pers/hd/s/Shen:Jialie", "Ye Wang.....http://dblp.org/pers/hd/w/Wang:Ye"], "conf": "mm", "year": "2009", "pages": 10}