{"title": "Mining spectrum usage data: a large-scale spectrum measurement study.", "fields": ["data collection", "data mining", "order statistic", "usage data", "channel", "spatial correlation"], "abstract": "Dynamic spectrum access has been a subject of extensive research activity in recent years. The increasing volume of literature calls for a deeper understanding of the characteristics of current spectrum utilization. In this paper we present a detailed spectrum measurement study, with data collected in the 20MHz to 3GHz spectrum band and at four locations concurrently in South China. We examine the first and second order statistics of the collected data, including channel occupancy/vacancy statistics, channel utilization within each individual wireless service, and the temporal, spectral, and spatial correlation of these measures. Main findings include that the channel vacancy durations follow an exponential-like distribution, but are not independently distributed over time, and that significant spectral and spatial correlations are found between channels of the same service. We then exploit such spectrum correlation to develop a 2-dimensional frequent pattern mining algorithm that can accurately predict channel availability based on past observations.", "citation": "Citations (238)", "departments": ["Hong Kong University of Science and Technology", "Beijing University of Posts and Telecommunications", "Hong Kong University of Science and Technology", "University of Michigan", "Beijing University of Posts and Telecommunications", "Peking University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Michigan", "Peking University"], "authors": ["Dawei Chen.....http://dblp.org/pers/hd/c/Chen:Dawei", "Sixing Yin.....http://dblp.org/pers/hd/y/Yin:Sixing", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian", "Mingyan Liu.....http://dblp.org/pers/hd/l/Liu:Mingyan", "Shufang Li.....http://dblp.org/pers/hd/l/Li:Shufang"], "conf": "mobicom", "year": "2009", "pages": 12}