{"title": "A Petri Net Based Debugging Environment for QVT Relations.", "fields": ["model transformation language", "model transformation", "operational semantics", "object constraint language", "debugging"], "abstract": "In the Model-Driven Architecture (MDA) paradigm the Query/View/Transformation (QVT) standard plays a vital role for model transformations. Especially the high-level declarative QVT Relations language, however, has not yet gained widespread use in practice. This is not least due to missing tool support in general and inadequate debugging support in particular. Transformation engines interpreting QVT Relations operate on a low level of abstraction, hide the operational semantics of a transformation and scatter metamodels, models, QVT code, and trace information across different artifacts. We therefore propose a model-based debugger representing QVT Relations on bases of TROPIC, a model transformation language utilizing a variant of Colored Petri Nets (CPNs). As a prerequisite for convenient debugging, TROPIC provides a homogeneous view on all artifacts of a transformation on basis of a single formalism. Besides that, this formalism also provides a runtime model, thus making the afore hidden operational semantics of the transformation explicit. Using an explicit runtime model allows to employ model-based techniques for debugging, e.g., using the Object Constraint Language (OCL) for simply defining breakpoints and querying the execution state of a transformation.", "citation": "Citations (20)", "departments": ["Vienna University of Technology", "Vienna University of Technology", "Vienna University of Technology", "Johannes Kepler University of Linz", "University of Vienna"], "authors": ["Manuel Wimmer.....http://dblp.org/pers/hd/w/Wimmer:Manuel", "Gerti Kappel.....http://dblp.org/pers/hd/k/Kappel:Gerti", "Johannes Schönböck.....http://dblp.org/pers/hd/s/Sch=ouml=nb=ouml=ck:Johannes", "Angelika Kusel.....http://dblp.org/pers/hd/k/Kusel:Angelika", "Werner Retschitzegger.....http://dblp.org/pers/hd/r/Retschitzegger:Werner", "Wieland Schwinger.....http://dblp.org/pers/hd/s/Schwinger:Wieland"], "conf": "kbse", "year": "2009", "pages": 12}