{"title": "Reconciling specialization and flexibility through compound circuits.", "fields": ["scalability", "benchmark", "vendor", "cost efficiency", "electrical efficiency"], "abstract": "While parallelism and multi-cores are receiving much attention as a major scalability path, customization is another, orthogonal and complementary, scalability path which can target not easily parallelizable programs or program sections. The key assets of customization are cost and power efficiency. The key limitation of customization is flexibility. However, we argue that there is no perfect balance between efficiency and flexibility, each system vendor may want to strike a different such balance. In this article, we present a method for achieving any desired balance between flexibility and efficiency by automatically combining any set of individual customization circuits into a larger compound circuit. This circuit is significantly more cost efficient than the simple union of all target circuits, and is configurable to behave as any of the target circuits, while avoiding the routing and configuration cost overhead of FPGAs. The more individual circuits are included, the larger the number of applications which can potentially benefit from this compound customization circuit, realizing flexibility at a minimal cost. Moreover, we observe that the compound circuit cost does not increase in proportion to the number of target applications, due to the wide range of common data-flow and control-flow patterns in programs. Currently, the target individual circuits correspond to loops, like most accelerators in embedded systems, but the aggregation method can accommodate circuits of any size. Using the UTDSP benchmarks and accelerators coupled with an embedded PowerPC405 processor, we show that this approach can yield an average performance improvement of 2.97, while the corresponding synthesized aggregate accelerator is 3 time smaller than the sum of individual accelerators for each target benchmark.", "citation": "Citations (34)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Thales Research ... ems Lab, France", "Thales Research ... ems Lab, France"], "authors": ["Sami Yehia.....http://dblp.org/pers/hd/y/Yehia:Sami", "Sylvain Girbal.....http://dblp.org/pers/hd/g/Girbal:Sylvain", "Hugues Berry.....http://dblp.org/pers/hd/b/Berry:Hugues", "Olivier Temam.....http://dblp.org/pers/hd/t/Temam:Olivier"], "conf": "hpca", "year": "2009", "pages": 12}