{"title": "PHY Aided MAC - A New Paradigm.", "fields": ["network packet", "phy", "contention based protocol", "polling", "physical layer"], "abstract": "Network protocols have traditionally been designed using a layered method in part because it is easier to implement some portions of network protocols in software and other portions must be implemented in hardware for performance reasons. These different implementation techniques enforce layer boundaries. In this paper, we show that with the advent of software defined radios, it becomes possible to blur those layer boundaries and produce higher performance network protocols as a result. In this paper we exploit a programmable physical layer and simultaneous transmission to have clients signal whether they have packets to send. By detecting the high energy at the simultaneous transmission, the AP gets the following information: a) which stations have packets to send and b) whether the traffic load is high, medium or low. Again, using the programmable physical layer, the AP schedules clients efficiently while wasting little of the spectrum on signaling overhead. The proposed protocol is a) fast, since no packet transmission is required for polling responses and all clients respond concurrently; b) reliable, as the poll response is contention free and c) scalable. We demonstrate the feasibility of implementing such a system using a FPGA based prototype software defined radio platform. We then show how the MAC protocol can scale using the QualNet network simulator and compare the performance to a contention based protocol.", "citation": "Citations (14)", "departments": ["University of Colorado Boulder", "University of Colorado Boulder", "University of Colorado Boulder", "University of Colorado Boulder"], "authors": ["Dola Saha.....http://dblp.org/pers/hd/s/Saha:Dola", "Aveek Dutta.....http://dblp.org/pers/hd/d/Dutta:Aveek", "Dirk Grunwald.....http://dblp.org/pers/hd/g/Grunwald:Dirk", "Douglas C. Sicker.....http://dblp.org/pers/hd/s/Sicker:Douglas_C="], "conf": "infocom", "year": "2009", "pages": 5}