{"title": "A Logic for Reasoning about Counterfactual Emotions.", "fields": ["undecidable problem", "formalism", "logical framework", "regret", "counterfactual thinking"], "abstract": "The aim of this work is to propose a logical framework for the specification of cognitive emotions that are based on counterfactual reasoning about agents' choices. The prototypical counterfactual emotion is regret. In order to meet this objective, we exploit the well-known STIT logic (Belnap et al. (2001) [9], Horty (2001) [30], Horty and Belnap (1995) [31]). STIT logic has been proposed in the domain of formal philosophy in the nineties and, more recently, it has been imported into the field of theoretical computer science where its formal relationships with other logics for multi-agent systems such as ATL and Coalition Logic (CL) have been studied. STIT is a very suitable formalism to reason about choices and capabilities of agents and groups of agents. Unfortunately, the version of STIT with agents and groups has been recently proved to be undecidable and not finitely axiomatizable. In this work we study a decidable and finitely axiomatizable fragment of STIT with agents and groups which is sufficiently expressive for our purpose of formalizing counterfactual emotions. We call dfSTIT our STIT fragment. After having extended dfSTIT with knowledge modalities, in the second part of article, we exploit it in order to formalize four types of counterfactual emotions: regret, rejoicing, disappointment, and elation. At the end of the article we present an application of our formalization of counterfactual emotions to a concrete example.", "citation": "Citations (73)", "departments": ["Institut de Rec ...  Cedex, France", "Institut de Rec ...  Cedex, France", "IRIT, Toulouse, France", "IRIT, Toulouse, France"], "authors": ["Emiliano Lorini.....http://dblp.org/pers/hd/l/Lorini:Emiliano", "François Schwarzentruber.....http://dblp.org/pers/hd/s/Schwarzentruber:Fran=ccedil=ois"], "conf": "ijcai", "year": "2009", "pages": 6}