{"title": "The PRISM Workwench: Database Schema Evolution without Tears.", "fields": ["web information system", "database schema", "schema migration", "schema evolution", "information schema"], "abstract": "Information Systems are subject to a perpetual evolution, which is particularly pressing in Web Information Systems, due to their distributed and often collaborative nature. Such continuous adaptation process, comes with a very high cost, because of the intrinsic complexity of the task and the serious rami?cations of such changes upon database-centric Information System softwares. Therefore, there is a need to automate and simplify the schema evolution process and to ensure predictability and logical independence upon schema changes. Current relational technology makes it easy to change the database content or to revise the underlaying storage and indexes but does little to support logical schema evolution which nowadays remains poorly supported by commercial tools. The PRISM system demonstrates a major new advance toward automating schema evolution (including query mapping and database conversion), by improving predictability, logical independence, and auditability of the process. In fact, PRISM exploits recent theoretical results on mapping composition, invertibility and query rewriting to provide DB Administrators with an intuitive, operational workbench usable in their everyday activities—thus enabling graceful schema evolution. In this demonstration, we will show (i) the functionality of PRISM and its supportive AJAX interface, (ii) its architecture built upon a simple SQL–inspired language of Schema Modi?cation Operators, and (iii) we will allow conference participants to directly interact with the system to test its capabilities. Finally, some of the most interesting evolution steps of popular Web Information Systems, such as Wikipedia, will be reviewed in a brief \"Saga of Famous Schema Evolutions\".", "citation": "Citations (26)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "Politec. di Milano DEI, Milan"], "authors": ["Carlo Curino.....http://dblp.org/pers/hd/c/Curino:Carlo", "Hyun Jin Moon.....http://dblp.org/pers/hd/m/Moon:Hyun_Jin", "MyungWon Ham.....http://dblp.org/pers/hd/h/Ham:MyungWon", "Carlo Zaniolo.....http://dblp.org/pers/hd/z/Zaniolo:Carlo"], "conf": "icde", "year": "2009", "pages": 4}