{"title": "List decoding tensor products and interleaved codes.", "fields": ["list decoding", "combinatorics", "reed muller code", "sequential decoding", "johnson bound", "discrete mathematics", "tensor product", "hamming code"], "abstract": "We design the first efficient algorithms and prove new combinatorial bounds for list decoding tensor products of codes and interleaved codes. We show that for every code, the ratio of its list decoding radius (LDR) to its minimum distance stays unchanged under the tensor product operation (rather than squaring, as one might expect). This gives the first efficient list decoders and new combinatorial bounds for some natural codes including multivariate polynomials where the degree in each variable is bounded. We show that for every code, its LDR remains unchanged under $m$-wise interleaving for an integer $m$. This generalizes a recent result of Dinur et al. [in Proceedings of the 40th ACM Symposium on Theory of Computing (STOC '08), 2008, pp. 275-284], who proved such a result for interleaved Hadamard codes (equivalently, linear transformations). Using the notion of generalized Hamming weights, we give better list size bounds for both the tensoring and interleaving of binary linear codes. By analyzing the weight distribution of these codes, we reduce the task of bounding the list size to one of bounding the number of close-by low-rank codewords. For decoding linear transformations, using rank reduction together with other ideas, we obtain list size bounds that are tight over small fields. Our results give better bounds on the LDR than what is obtained from the Johnson bound, and yield rather general families of codes decodable beyond the Johnson radius.", "citation": "Not cited", "departments": ["Microsoft", "Carnegie Mellon University", "Georgia Institute of Technology", "Microsoft", "University of Washington", "University of Washington"], "authors": ["Parikshit Gopalan.....http://dblp.org/pers/hd/g/Gopalan:Parikshit", "Venkatesan Guruswami.....http://dblp.org/pers/hd/g/Guruswami:Venkatesan", "Prasad Raghavendra.....http://dblp.org/pers/hd/r/Raghavendra:Prasad"], "conf": "stoc", "year": "2009", "pages": 10}