{"title": "Anima.", "fields": ["criticism", "intelligibility", "faculties of the soul", "intelligent network", "upload", "the thing", "physical modelling synthesis", "cognitive science", "operator", "formalism", "archetype", "gender history", "data sharing", "computer animation", "bibliography", "psychology", "gender psychology", "functional neuroimaging", "computer science", "kinesthetic learning", "transgender", "biomechanics", "composition", "physical body", "literature", "neuroimaging", "scalability", "transformational leadership", "brain mapping", "e commerce", "computer graphics images", "soul", "philosophy of mind", "information integration", "computer music", "cognition", "analytical psychology"], "abstract": "CORDIS-ANIMA is a digital, real-time, object modeling and simulation system. The simulated objects can be seen, heard, and manipulated. This system has been built at the ACROE in several stages since 1978. It constitutes the nucleus of a creation tool for computer music (CORDIS) and animated images (ANIMA). The raison d'8tre of this tool is to provide reproductions of physical objects from the real world. These objects can be musical instruments (in terms of objects that produce sound vibrations when subjected to some action), or they can be visible objects such as those we observe in the real world. The simulated copy (the simulacrum) of these objects is produced using a programmed digital device that can communicate with human operators through transducers associated with acoustic, visual, and gestural media. The gestural medium is a twoway channel; information can flow from the operator to the object (gestural action) and also from the object to the operator (tactile and kinesthetic feedback). What we seek is total simulation. Such a simulation must restore not only the sensorimotor aspects of the object (the gestural, tactile, acoustic, and visual aspects) but also its structure and behavior. This is not merely a synthesis of the effects produced by the object but a synthesis of the internal state of the object itself. Although the reasons for setting ourselves this objective are central to our work-the use of the computer in artistic creation--they are beyond the scope of this article, and are described in detail elsewhere (Cadoz, Luciani, and Florens 1981, 1984; Cadoz and Florens 1990, 1991; Florens 1990; Luciani 1985). What is CORDIS-ANIMA?", "citation": "Citations (159)", "year": "2009", "departments": ["University of Düsseldorf", "French Institute for Research in Computer Science and Automation", "University of Düsseldorf", "University of Düsseldorf", "University of Düsseldorf", "Vermont, USA", "Research Centre Julich (FZJ)"], "conf": "siggraph", "authors": ["Annabel Sebag.....http://dblp.org/pers/hd/s/Sebag:Annabel"], "pages": 1}