{"title": "Implementation and Evaluation of Cooperative Communication Schemes in Software-Defined Radio Testbed.", "fields": ["testbed", "universal software radio peripheral", "cooperative diversity", "mimo", "cognitive radio"], "abstract": "Cooperative communication is a promising technique for future wireless networks, which significantly improves link capacity and reliability by leveraging broadcast nature of wireless medium and exploiting cooperative diversity. However, most of existing works investigate its performance theoretically or by simulation. It has been widely accepted that simulations often fail to faithfully capture many real-world radio signal propagation effects, which can be overcome through developing physical wireless network testbeds. In this work, we build a cooperative testbed based on GNU Radio and Universal Software Radio Peripheral (USRP) platform, which is a promising open-source software-defined radio system. Both single-relay cooperation and multi-relay cooperation can be supported in our testbed. Some key techniques are provided to solve the main challenges during the testbed development: e.g., maximum ratio combine in single-relay transmission and synchronized transmission among multiple relays. Extensive experiments are carried out in the testbed to evaluate performance of various cooperative communication schemes. The results show that cooperative transmission achieves significant performance enhancement in terms of link reliability and end-to-end throughput.", "citation": "Citations (69)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Juncheng Jia.....http://dblp.org/pers/hd/j/Jia:Juncheng", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Eric M. K. Lo.....http://dblp.org/pers/hd/l/Lo:Eric_M=_K="], "conf": "infocom", "year": "2010", "pages": 9}