{"title": "Thread to strand binding of parallel network applications in massive multi-threaded systems.", "fields": ["microarchitecture", "dynamic priority scheduling", "simultaneous multithreading", "ultrasparc t2", "software pipelining"], "abstract": "In processors with several levels of hardware resource sharing,like CMPs in which each core is an SMT, the scheduling process becomes more complex than in processors with a single level of resource sharing, such as pure-SMT or pure-CMP processors. Once the operating system selects the set of applications to simultaneously schedule on the processor (workload), each application/thread must be assigned to one of the hardware contexts(strands). We call this last scheduling step the Thread to Strand Binding or TSB. In this paper, we show that the TSB impact on the performance of processors with several levels of shared resources is high. We measure a variation of up to 59% between different TSBs of real multithreaded network applications running on the UltraSPARC T2 processor which has three levels of resource sharing. In our view, this problem is going to be more acute in future multithreaded architectures comprising more cores, more contexts per core, and more levels of resource sharing.   We propose a resource-sharing aware TSB algorithm (TSBSched) that significantly facilitates the problem of thread to strand binding for software-pipelined applications, representative of multithreaded network applications. Our systematic approach encapsulates both, the characteristics of multithreaded processors under the study and the structure of the software pipelined applications. Once calibrated for a given processor architecture, our proposal does not require hardware knowledge on the side of the programmer, nor extensive profiling of the application. We validate our algorithm on the UltraSPARC T2 processor running a set of real multithreaded network applications on which we report improvements of up to 46% compared to the current state-of-the-art dynamic schedulers.", "citation": "Citations (9)", "year": "2010", "departments": ["Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Spanish National Research Council"], "conf": "ppopp", "authors": ["Petar Radojkovic.....http://dblp.org/pers/hd/r/Radojkovic:Petar", "Vladimir Cakarevic.....http://dblp.org/pers/hd/c/Cakarevic:Vladimir", "Javier Verdú.....http://dblp.org/pers/hd/v/Verd=uacute=:Javier", "Alex Pajuelo.....http://dblp.org/pers/hd/p/Pajuelo:Alex", "Francisco J. Cazorla.....http://dblp.org/pers/hd/c/Cazorla:Francisco_J=", "Mario Nemirovsky.....http://dblp.org/pers/hd/n/Nemirovsky:Mario", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "pages": 12}