{"title": "On-line Pricing of Secondary Spectrum Access with Unknown Demand Function and Call Length Distribution.", "fields": ["exponential distribution", "pricing strategies", "demand curve", "quality of service", "local optimum"], "abstract": "We consider a wireless provider who caters to two classes of customers, namely primary and secondary users. Primary users have long term contracts while secondary users are admitted and priced according to current availability of excess spectrum. Secondary users accept an advertised price with a certain probability defined by an underlying demand function. We analyze the problem of maximizing profit gained by admission of secondary users. Previous studies in the field usually assume that the demandfunction is known and that the call length distribution is also known and exponentially distributed. In this paper, we analyze more realistic settings where both of these quantities are unknown. Our main contribution is to derive near-optimal pricing strategies under such settings. We focus on occupancy-based pricing policies, which depend only on the total number of ongoing calls in the system. We first show that such policies are insensitive to call length distribution except through the mean. Next, we introduce a new on-line, occupancy-based pricing algorithm, called Measurement-based Threshold Pricing (MTP) that operates by measuring the reaction of secondary users to a specific price and does not require the demand function to be known. MTP optimizes a profit function that depends on price only. We prove that while the profit function can be multimodal, MTP converges to one of the local optima as fast as if the function were unimodal. Lastly, we provide numerical studies demonstrating the near-optimal performance of occupancy-based policies for diverse sets of call length distributions and demand functions and the quick convergence of MTP to near-optimal on-line profit.", "citation": "Citations (12)", "departments": ["Boston University", "Boston University", "Boston University"], "authors": ["Huseyin Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Huseyin", "Murat Alanyali.....http://dblp.org/pers/hd/a/Alanyali:Murat", "David Starobinski.....http://dblp.org/pers/hd/s/Starobinski:David"], "conf": "infocom", "year": "2010", "pages": 9}