{"title": "CompactDFA: Generic State Machine Compression for Scalable Pattern Matching.", "fields": ["content addressable memory", "deterministic finite automaton", "longest prefix match", "pattern matching", "memory management"], "abstract": "Pattern matching algorithms lie at the core of all contemporary Intrusion Detection Systems (IDS), making it intrinsic to reduce their speed and memory requirements. This paper focuses on the most popular class of pattern-matching algorithms, the Aho-Corasick--like algorithms, which are based on constructing and traversing a Deterministic Finite Automaton (DFA), representing the patterns. While this approach ensures deterministic time guarantees, modern IDSs need to deal with hundreds of patterns, thus requiring to store very large DFAs which usually do not fit in fast memory. This results in a major bottleneck on the throughput of the IDS, as well as its power consumption and cost. We propose a novel method to compress DFAs by observing that the name of the states is meaningless. While regular DFAs store separately each transition between two states, we use this degree of freedom and encode states in such a way that all transitions to a specific state can be represented by a single prefix that defines a set of current states. Our technique applies to a large class of automata, which can be categorized by simple properties. Then, the problem of pattern matching is reduced to the well-studied problem of Longest Prefix Matching (LPM) that can be solved either in TCAM, in commercially available IP-lookup chips, or in software. Specifically, we show that with a TCAM our scheme can reach a throughput of 10 Gbps with low power consumption.", "citation": "Citations (55)", "departments": ["Interdisciplinary Center Herzliya", "Columbia University", "Interdisciplinary Center Herzliya"], "authors": ["Anat Bremler-Barr.....http://dblp.org/pers/hd/b/Bremler=Barr:Anat", "David Hay.....http://dblp.org/pers/hd/h/Hay:David", "Yaron Koral.....http://dblp.org/pers/hd/k/Koral:Yaron"], "conf": "infocom", "year": "2010", "pages": 9}