{"title": "Building contextual visual vocabulary for large-scale image applications.", "fields": ["contextual image classification", "metric", "spatial contextual awareness", "bag of words model in computer vision", "visual word"], "abstract": "Not withstanding its great success and wide adoption in Bag-of-visual Words representation, visual vocabulary created from single image local features is often shown to be ineffective largely due to three reasons. First, many detected local features are not stable enough, resulting in many noisy and non-descriptive visual words in images. Second, single visual word discards the rich spatial contextual information among the local features, which has been proven to be valuable for visual matching. Third, the distance metric commonly used for generating visual vocabulary does not take the semantic context into consideration, which renders them to be prone to noise. To address these three confrontations, we propose an effective visual vocabulary generation framework containing three novel contributions: 1) we propose an effective unsupervised local feature refinement strategy; 2) we consider local features in groups to model their spatial contexts; 3) we further learn a discriminant distance metric between local feature groups, which we call discriminant group distance. This group distance is further leveraged to induce visual vocabulary from groups of local features. We name it contextual visual vocabulary, which captures both the spatial and semantic contexts. We evaluate the proposed local feature refinement strategy and the contextual visual vocabulary in two large-scale image applications: large-scale near-duplicate image retrieval on a dataset containing 1.5 million images and image search re-ranking tasks. Our experimental results show that the contextual visual vocabulary shows significant improvement over the classic visual vocabulary. Moreover, it outperforms the state-of-the-art Bundled Feature in the terms of retrieval precision, memory consumption and efficiency.", "citation": "Citations (136)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "IBM", "Chinese Academy of Sciences", "Peking University"], "authors": ["Shiliang Zhang.....http://dblp.org/pers/hd/z/Zhang:Shiliang", "Qingming Huang.....http://dblp.org/pers/hd/h/Huang:Qingming", "Gang Hua.....http://dblp.org/pers/hd/h/Hua:Gang", "Shuqiang Jiang.....http://dblp.org/pers/hd/j/Jiang:Shuqiang", "Wen Gao.....http://dblp.org/pers/hd/g/Gao_0001:Wen", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "conf": "mm", "year": "2010", "pages": 10}