{"title": "Finding Clusters in subspaces of very large, multi-dimensional datasets.", "fields": ["data point", "linear combination", "ranging", "linear subspace", "curse of dimensionality"], "abstract": "We propose the Multi-resolution Correlation Cluster detection (MrCC), a novel, scalable method to detect correlation clusters able to analyze dimensional data in the range of around 5 to 30 axes. Existing methods typically exhibit super-linear behavior in terms of space or execution time. MrCC employs a novel data structure based on multi-resolution and gains over previous approaches in: (a) it finds clusters that stand out in the data in a statistical sense; (b) it is linear on running time and memory usage regarding number of data points and dimensionality of subspaces where clusters exist; (c) it is linear in memory usage and quasi-linear in running time regarding space dimensionality; and (d) it is accurate, deterministic, robust to noise, does not require stating the number of clusters as input parameter, does not perform distance calculation and is able to detect clusters in subspaces generated by original axes or linear combinations of original axes, including space rotation. We performed experiments on synthetic data ranging from 5 to 30 axes and from 12k to 250k points, and MrCC outperformed in time five of the recent and related work, being in average 10 times faster than the competitors that also presented high accuracy results for every tested dataset. Regarding real data, MrCC found clusters at least 9 times faster than the competitors, increasing their accuracy in up to 34 percent.", "citation": "Citations (18)", "departments": ["University of São Paulo", "University of São Paulo", "Carnegie Mellon University", "University of São Paulo"], "authors": ["Robson Leonardo Ferreira Cordeiro.....http://dblp.org/pers/hd/c/Cordeiro:Robson_Leonardo_Ferreira", "Agma J. M. Traina.....http://dblp.org/pers/hd/t/Traina:Agma_J=_M=", "Christos Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Christos", "Caetano Traina Jr......http://dblp.org/pers/hd/t/Traina_Jr=:Caetano"], "conf": "icde", "year": "2010", "pages": 12}