{"title": "Design, Modeling, and Evaluation of a Scalable Multi-level Checkpointing System.", "fields": ["file system", "probabilistic logic", "mechanical efficiency", "software fault tolerance", "markov model"], "abstract": "High-performance computing (HPC) systems are growing more powerful by utilizing more hardware components. As the system mean-time-before-failure correspondingly drops, applications must checkpoint more frequently to make progress. However, as the system memory sizes grow faster than the bandwidth to the parallel file system, the cost of checkpointing begins to dominate application run times. Multi-level checkpointing potentially solves this problem through multiple types of checkpoints with different costs and different levels of resiliency in a single run. This solution employs lightweight checkpoints to handle the most common failure modes and relies on more expensive checkpoints for less common, but more severe failures. This theoretically promising approach has not been fully evaluated in a large- scale, production system context. We have designed the Scalable Checkpoint/Restart (SCR) library, a multi-level checkpoint system that writes checkpoints to RAM, Flash, or disk on the compute nodes in addition to the parallel file system. We present the performance and reliability properties of SCR as well as a probabilistic Markov model that predicts its performance on current and future systems. We show that multi-level checkpointing improves efficiency on existing large-scale systems and that this benefit increases as the system size grows. In particular, we developed low-cost checkpoint schemes that are 100x-1000x faster than the parallel file system and effective against 85% of our system failures. This leads to a gain in machine efficiency of up to 35%, and it reduces the the load on the parallel file system by a factor of two on current and future systems.", "citation": "Citations (428)", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory"], "authors": ["Adam Moody.....http://dblp.org/pers/hd/m/Moody:Adam", "Greg Bronevetsky.....http://dblp.org/pers/hd/b/Bronevetsky:Greg", "Kathryn Mohror.....http://dblp.org/pers/hd/m/Mohror:Kathryn", "Bronis R. de Supinski.....http://dblp.org/pers/hd/s/Supinski:Bronis_R=_de"], "conf": "sc", "year": "2010", "pages": 11}