{"title": "A Signal Processing View on Packet Sampling and Anomaly Detection.", "fields": ["temporal mean", "network packet", "aliasing", "filter", "anomaly detection"], "abstract": "Anomaly detection methods typically operate on preprocessed traffic traces. Firstly, most traffic capturing devices today employ random packet sampling, where each packet is selected with a certain probability, to cope with increasing link speeds. Secondly, temporal aggregation, where all packets in a measurement interval are represented by their temporal mean, is applied to transform the traffic trace to the observation timescale of interest for anomaly detection. These preprocessing steps affect the temporal correlation structure of traffic that is used by anomaly detection methods such as Kalman filtering or PCA, and have thus an impact on anomaly detection performance. Prior work has analyzed how packet sampling degrades the accuracy of anomaly detection methods; however, neither theoretical explanations nor solutions to the sampling problem have been provided. This paper makes the following key contributions: (i) It provides a thorough analysis and quantification of how random packet sampling and temporal aggregation modify the signal properties by introducing noise, distortion and aliasing. (ii) We show that aliasing introduced by the aggregation step has the largest impact on the correlation structure. (iii) We further propose to replace the aggregation step with a specifically designed low-pass filter that reduces the aliasing effect. (iv) Finally, we show that with our solution applied, the performance of anomaly detection systems can be considerably improved in the presence of packet sampling.", "citation": "Citations (26)", "departments": ["ETH Zurich", "Lancaster University", "Paris Research  ...  Paris, France"], "authors": ["Daniela Brauckhoff.....http://dblp.org/pers/hd/b/Brauckhoff:Daniela", "Kavé Salamatian.....http://dblp.org/pers/hd/s/Salamatian:Kav=eacute=", "Martin May.....http://dblp.org/pers/hd/m/May:Martin"], "conf": "infocom", "year": "2010", "pages": 9}