{"title": "Circuit-Switched Memory Access in Photonic Interconnection Networks for High-Performance Embedded Computing.", "fields": ["photonics", "electronics", "optical computing", "optical switch", "network on a chip"], "abstract": "As advancements in CMOS technology trend toward ever increasing core counts in chip multiprocessors for high-performance embedded computing, the discrepancy between on- and off-chip communication bandwidth continues to widen due to the power and spatial constraints of electronic off-chip signaling. Silicon photonics-based communication offers many advantages over electronics for network-on-chip design, namely power consumption that is effectively agnostic to distance traveled at the chip- and board-scale, even across chip boundaries. In this work we develop a design for a photonic network-on-chip with integrated DRAM I/O interfaces and compare its performance to similar electronic solutions using a detailed network-on-chip simulation. When used in a circuit-switched network, silicon nanophotonic switches offer higher bandwidth density and low power transmission, adding up to over 10x better performance and 3-5x lower power over the baseline for projective transform, matrix multiply, and Fast Fourier Transform (FFT), all key algorithms in embedded real-time signal and image processing.", "citation": "Citations (66)", "departments": ["Columbia University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Columbia University", "Columbia University"], "authors": ["Gilbert Hendry.....http://dblp.org/pers/hd/h/Hendry:Gilbert", "Eric Robinson.....http://dblp.org/pers/hd/r/Robinson:Eric", "Vitaliy Gleyzer.....http://dblp.org/pers/hd/g/Gleyzer:Vitaliy", "Johnnie Chan.....http://dblp.org/pers/hd/c/Chan:Johnnie", "Luca P. Carloni.....http://dblp.org/pers/hd/c/Carloni:Luca_P=", "Nadya Travinin Bliss.....http://dblp.org/pers/hd/b/Bliss:Nadya_Travinin", "Keren Bergman.....http://dblp.org/pers/hd/b/Bergman:Keren"], "conf": "sc", "year": "2010", "pages": 12}