{"title": "Green multimedia: informing people of their carbon footprint through two simple sensors.", "fields": ["greenhouse gas", "wearable computer", "carbon footprint", "accelerometer", "mobile phone"], "abstract": "In this work we discuss a new, but highly relevant, topic to the multimedia community; systems to inform individuals of their carbon footprint, which could ultimately effect change in community carbon footprint-related activities. The reduction of carbon emissions is now an important policy driver of many governments, and one of the major areas of focus is in reducing the energy demand from the consumers i.e. all of us individually.   In terms of CO2 generated from energy consumption, there are three predominant factors, namely electricity usage, thermal related costs, and transport usage. Standard home electricity and heating sensors can be used to measure the former two aspects, and in this paper we evaluate a novel technique to estimate an individual's transport-related carbon emissions through the use of a simple wearable accelerometer.   We investigate how providing this novel estimation of transport-related carbon emissions through an interactive web site and mobile phone app engages a set of users in becoming more aware of their carbon emissions. Our evaluations involve a group of 6 users collecting 25 million accelerometer readings and 12.5 million power readings vs. a control group of 16 users collecting 29.7 million power readings.", "citation": "Citations (6)", "departments": ["Dublin City University", "Dublin City University", "Dublin City University", "Dublin City University", "Dublin City University"], "authors": ["Aiden R. Doherty.....http://dblp.org/pers/hd/d/Doherty:Aiden_R=", "Zhengwei Qiu.....http://dblp.org/pers/hd/q/Qiu:Zhengwei", "Colum Foley.....http://dblp.org/pers/hd/f/Foley:Colum", "Hyowon Lee.....http://dblp.org/pers/hd/l/Lee:Hyowon", "Cathal Gurrin.....http://dblp.org/pers/hd/g/Gurrin:Cathal", "Alan F. Smeaton.....http://dblp.org/pers/hd/s/Smeaton:Alan_F="], "conf": "mm", "year": "2010", "pages": 10}