{"title": "A new approach to cross-modal multimedia retrieval.", "fields": ["latent dirichlet allocation", "explicit semantic analysis", "topic model", "concept search", "visual word"], "abstract": "The problem of joint modeling the text and image components of multimedia documents is studied. The text component is represented as a sample from a hidden topic model, learned with latent Dirichlet allocation, and images are represented as bags of visual (SIFT) features. Two hypotheses are investigated: that 1) there is a benefit to explicitly modeling correlations between the two components, and 2) this modeling is more effective in feature spaces with higher levels of abstraction. Correlations between the two components are learned with canonical correlation analysis. Abstraction is achieved by representing text and images at a more general, semantic level. The two hypotheses are studied in the context of the task of cross-modal document retrieval. This includes retrieving the text that most closely matches a query image, or retrieving the images that most closely match a query text. It is shown that accounting for cross-modal correlations and semantic abstraction both improve retrieval accuracy. The cross-modal model is also shown to outperform state-of-the-art image retrieval systems on a unimodal retrieval task.", "citation": "Citations (661)", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Nikhil Rasiwasia.....http://dblp.org/pers/hd/r/Rasiwasia:Nikhil", "Jose Costa Pereira.....http://dblp.org/pers/hd/p/Pereira:Jose_Costa", "Emanuele Coviello.....http://dblp.org/pers/hd/c/Coviello:Emanuele", "Gabriel Doyle.....http://dblp.org/pers/hd/d/Doyle:Gabriel", "Gert R. G. Lanckriet.....http://dblp.org/pers/hd/l/Lanckriet:Gert_R=_G=", "Roger Levy.....http://dblp.org/pers/hd/l/Levy:Roger", "Nuno Vasconcelos.....http://dblp.org/pers/hd/v/Vasconcelos:Nuno"], "conf": "mm", "year": "2010", "pages": 10}