{"title": "Illumination compensation based change detection using order consistency.", "fields": ["normalization", "change detection", "color normalization", "generality", "image texture"], "abstract": "We present a change detection method resistant to global and local illumination variations for use in visual surveillance scenarios. Approaches designed thus far for robustness to illumination change are generally based either on color normalization, texture (e.g. edges, rank order statistics, etc.), or illumination compensation. Normalization based methods sacrifice discriminability while texture based methods cannot operate on texture-less regions. Both types of method can produce large missing regions in the distance image which in turn pose problems for higherlevel processing tasks that may be shape or region-based and require accurate foreground masks (e.g. person detection and tracking, crowd segmentation, etc.). Texture based methods have an additional problem in that they produce false alarms due to textures induced by local illumination effects (e.g. cast shadows). In this paper we propose a compensation based approach for change detection. Prior work on compensation has largely taken an empirical approach, and has not dealt with the important problem of rejecting outliers when they dominate the scene. In contrast, our generative approach and systematic handling of outliers enables us to achieve robustness to illumination change while eliminating the problems mentioned above. Furthermore, the computational complexity of our method is low enough for real-time performance. Results comparing images taken under strongly different illumination conditions, demonstrate the power and generality of the proposed method.", "citation": "Citations (11)", "year": "2010", "departments": ["Princeton University", "Princeton University", "Princeton University"], "conf": "cvpr", "authors": ["Vasu Parameswaran.....http://dblp.org/pers/hd/p/Parameswaran:Vasu", "Maneesh Singh.....http://dblp.org/pers/hd/s/Singh:Maneesh", "Visvanathan Ramesh.....http://dblp.org/pers/hd/r/Ramesh:Visvanathan"], "pages": 8}