{"title": "SensorTune: a mobile auditory interface for DIY wireless sensor networks.", "fields": ["world wide web", "key distribution in wireless sensor networks", "wireless sensor network", "sonification", "computer network", "mobile computing", "wireless", "computer science"], "abstract": "Wireless Sensor Networks (WSNs) allow the monitoring of activity or environmental conditions over a large area, from homes to industrial plants, from agriculture fields to forests and glaciers. They can support a variety of applications, from assisted living to natural disaster prevention. WSNs can, however, be challenging to setup and maintain, reducing the potential for real-world adoption. To address this limitation, this paper introduces SensorTune, a novel mobile interface to support non-expert users in iteratively setting up a WSN. SensorTune uses non-speech audio to present to its users information regarding the connectivity of the network they are setting up, allowing them to decide how to extend it. To simplify the interpretation of the data presented, the system adopts the metaphor of tuning a consumer analog radio, a very common and well known operation. A user study was conducted in which 20 subjects setup real multi-hop networks inside a large building using a limited number of wireless nodes. Subjects repeated the task with SensorTune and with a comparable mobile GUI interface. Experimental results show a statistically significant difference in the task completion time and a clear preference of users for the auditory interface.", "citation": "Not cited", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Enrico Costanza.....http://dblp.org/pers/hd/c/Costanza:Enrico", "Jacques Panchard.....http://dblp.org/pers/hd/p/Panchard:Jacques", "Guillaume Zufferey.....http://dblp.org/pers/hd/z/Zufferey:Guillaume", "Julien Nembrini.....http://dblp.org/pers/hd/n/Nembrini:Julien", "Julien Freudiger.....http://dblp.org/pers/hd/f/Freudiger:Julien", "Jeffrey Huang.....http://dblp.org/pers/hd/h/Huang:Jeffrey", "Jean-Pierre Hubaux.....http://dblp.org/pers/hd/h/Hubaux:Jean=Pierre"], "conf": "chi", "year": "2010", "pages": 10}