{"title": "Cross-layer Optimization for Wireless Networks with Deterministic Channel Models.", "fields": ["distributed algorithm", "cross layer optimization", "physical layer", "stochastic approximation", "radio resource management", "approximation algorithm", "network performance"], "abstract": "Cross-layer optimization is a key step in wireless network design that coordinates the resources allocated to different layers in order to achieve globally optimal network performance. Existing work on cross-layer optimization for wireless networks often adopts simplistic physical-layer models for wireless channels, such as treating interference as noise or interference avoidance. This crude modeling of physical layer often leads to inefficient utilization of resources. In this paper, we adopt a deterministic channel model proposed in , , a simple abstraction of the physical layer that effectively captures the effect of channel strength, broadcast and superposition in wireless channels. This model allows us to go beyond “treating interference as noise” and as a consequence are able to achieve higher throughput and utility. Within the network utility maximization (NUM) framework, we study the cross-layer optimization for wireless networks based on this deterministic channel model. First, we extend the well-studied conflict graph model to capture the flow interactions over the deterministic channels and characterize the feasible rate region. Then we study distributed algorithms for general wireless multi-hop networks with both link-centric formulation and node-centric formulation. The convergence of algorithms is proved by applying Lyapunov stability theorem and stochastic approximation method. Further, we show the convergence to the bounded neighborhood of optimal solutions with probability one under constant step sizes and constant update intervals. Our numerical evaluations validate the analytical results and show the advantage of deterministic channel model over simple physical layer models such as treating interference as noise.", "citation": "Citations (13)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Cornell University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Cornell University", "The Chinese University of Hong Kong"], "authors": ["Ziyu Shao.....http://dblp.org/pers/hd/s/Shao:Ziyu", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Amir Salman Avestimehr.....http://dblp.org/pers/hd/a/Avestimehr:Amir_Salman", "Shuo-Yen Robert Li.....http://dblp.org/pers/hd/l/Li:Shuo=Yen_Robert"], "conf": "infocom", "year": "2010", "pages": 5}