{"title": "Stable Maximum Throughput Broadcast in Wireless Fading Channels.", "fields": ["broadcast radiation", "broadcast domain", "multimedia broadcast multicast service", "atomic broadcast", "maximum throughput scheduling"], "abstract": "This research considers network coded broadcast system with multi-rate transmission and dual queue stability constraints. Existing network coded broadcast systems consider single rate transmission without receiver queue constraints. First, we shall illustrate that broadcast without network coding cannot support maximum throughput in wireless fading channels. However, the network coded broadcast poses new constraints for the receivers to manage stable queues while the fading channel characteristics suggest the broadcast to operate at multi-rate to achieve higher throughput. In this research, we propose a joint scheduling and network coding (JSNC) strategy for such network coded broadcast system to achieve maximum throughput under queue stability constraint. In a single cell broadcast networks with exogenous arrivals of packets at the base station, we prove that JSNC can stabilize the system as long as the rate of the exogenous arrival flow is within the capacity region. Sufficient control parameters are provided in JSNC for trading off between sender's buffer and the receivers' buffers. JSNC can be viewed as a generalization of the classical backpressure scheduling rule to coded information flow. Alternatively, JSNC can also be viewed as an extension of network coding theory to queuing system.", "citation": "Citations (1)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "Microsoft", "Microsoft", "State University of New York System"], "authors": ["Wei Pu.....http://dblp.org/pers/hd/p/Pu:Wei", "Hao Cui.....http://dblp.org/pers/hd/c/Cui:Hao", "Chong Luo.....http://dblp.org/pers/hd/l/Luo:Chong", "Feng Wu.....http://dblp.org/pers/hd/w/Wu:Feng", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "conf": "infocom", "year": "2010", "pages": 9}