{"title": "Facilitating the Evaluation of Automated Negotiators using Peer Designed Agents.", "fields": ["negotiation", "generosity", "computer science", "knowledge management", "cognition"], "abstract": "Computer agents are increasingly deployed in settings in which they make decisions with people, such as electronic commerce, collaborative interfaces, and cognitive assistants. However, the scientific evaluation of computational strategies for human-computer decision-making is a costly process, involving time, effort and personnel. This paper investigates the use of Peer Designed Agents (PDA)—computer agents developed by human subjects—as a tool for facilitating the evaluation process of automatic negotiators that were developed by researchers. It compares the performance between automatic negotiators that interacted with PDAs to automatic negotiators that interacted with actual people in different domains. The experiments included more than 300 human subjects and 50 PDAs developed by students. Results showed that the automatic negotiators outperformed PDAs in the same situations in which they outperformed people, and that on average, they exhibited the same measure of generosity towards their negotiation partners. These patterns occurred for all types of domains, and for all types of automated negotiators, despite the fact that there were individual differences between the behavior of PDAs and people. The study thus provides an empirical proof that PDAs can alleviate the evaluation process of automatic negotiators, and facilitate their design.", "citation": "Citations (26)", "departments": ["Bar-Ilan University", "University of Maryland, College Park", "Bar-Ilan University", "Ben-Gurion University of the Negev"], "authors": ["Raz Lin.....http://dblp.org/pers/hd/l/Lin:Raz", "Sarit Kraus.....http://dblp.org/pers/hd/k/Kraus:Sarit", "Yinon Oshrat.....http://dblp.org/pers/hd/o/Oshrat:Yinon", "Ya'akov (Kobi) Gal.....http://dblp.org/pers/hd/g/Gal:Ya=akov_=Kobi="], "conf": "aaai", "year": "2010", "pages": -1}