{"title": "Improving Human Judgments by Decontaminating Sequential Dependencies.", "fields": ["rating scale", "theory of relativity", "conditional random field", "cognition", "human decontamination"], "abstract": "For over half a century, psychologists have been struck by how poor people are at expressing their internal sensations, impressions, and evaluations via rating scales. When individuals make judgments, they are incapable of using an absolute rating scale, and instead rely on reference points from recent experience. This relativity of judgment limits the usefulness of responses provided by individuals to surveys, questionnaires, and evaluation forms. Fortunately, the cognitive processes that transform internal states to responses are not simply noisy, but rather are influenced by recent experience in a lawful manner. We explore techniques to remove sequential dependencies, and thereby decontaminate a series of ratings to obtain more meaningful human judgments. In our formulation, decontamination is fundamentally a problem of inferring latent states (internal sensations) which, because of the relativity of judgment, have temporal dependencies. We propose a decontamination solution using a conditional random field with constraints motivated by psychological theories of relative judgment. Our exploration of decontamination models is supported by two experiments we conducted to obtain ground-truth rating data on a simple length estimation task. Our decontamination techniques yield an over 20% reduction in the error of human judgments.", "citation": "Citations (6)", "departments": ["University of California, San Diego", "University of Colorado Boulder", "University of California, San Diego", "University of Colorado Boulder", "University of Colorado Boulder"], "authors": ["Michael Mozer.....http://dblp.org/pers/hd/m/Mozer:Michael", "Harold Pashler.....http://dblp.org/pers/hd/p/Pashler:Harold", "Matthew H. Wilder.....http://dblp.org/pers/hd/w/Wilder:Matthew_H=", "Robert V. Lindsey.....http://dblp.org/pers/hd/l/Lindsey:Robert_V=", "Matt Jones.....http://dblp.org/pers/hd/j/Jones_0001:Matt", "Michael Jones.....http://dblp.org/pers/hd/j/Jones:Michael"], "conf": "nips", "year": "2010", "pages": 9}