{"title": "Approximation Algorithms for Many-to-Many Traffic Grooming in WDM Mesh Networks.", "fields": ["unicast", "traffic grooming", "mesh networking", "many to many", "routing and wavelength assignment"], "abstract": "A large number of network applications today allow several users to interact together using the many-to-many service mode. In many-to-many communication, also referred to as group communication, a session consists of a group of users (we refer to them as members), where each member transmits its traffic to all other members in the same group. In this paper, we address the problem of grooming sub-wavelength many-to-many traffic (e.g., OC-3) into high-bandwidth wavelength channels (e.g., OC-192) in WDM mesh networks. The cost of a WDM network is dominated by the cost of higher layer electronic ports (i.e., transceivers). A transceiver is needed for each initiation and termination of a lightpath. Therefore, our objective is to minimize the total number of lightpaths established. Unfortunately, the grooming problem even with unicast traffic has been shown to be NP-hard. For a number of special cases where the many-to-many traffic grooming problem is tractable, we efficiently derive the optimal solution, while in the general case, we introduce two novel approximation algorithms. We also consider the routing and wavelength assignment problem with the objective of minimizing the number of wavelengths used. Through extensive experiments, we show that the two algorithms use a number of lightpaths that is very close to that of a derived lower bound. Also, we compare the two algorithms on the several costs mentioned in the paper including the number of lightpaths and the number of wavelengths used.", "citation": "Citations (5)", "departments": ["Iowa State University", "Iowa State University"], "authors": ["Mohammad A. Saleh.....http://dblp.org/pers/hd/s/Saleh:Mohammad_A=", "Ahmed E. Kamal.....http://dblp.org/pers/hd/k/Kamal:Ahmed_E="], "conf": "infocom", "year": "2010", "pages": 9}