{"title": "Change Management in Enterprise IT Systems: Process Modeling and Capacity-optimal Scheduling.", "fields": ["rate monotonic scheduling", "two level scheduling", "round robin scheduling", "lottery scheduling", "earliest deadline first scheduling"], "abstract": "We provide a formal model for the Change Management process for Enterprise IT systems, and develop change scheduling algorithms that seek to attain the \"change capacity\" of the system. The change management process handles critical updates in the system that often use overlapping sets of servers, resulting in scheduling conflicts between the corresponding change classes. Furthermore, applications are typically associated with certain permissible downtime windows, which impose constraints on the timing of the change executions. Scheduling of changes for such systems represent a complex dynamic optimization question. In a limiting fluid regime, where changes are assumed nonatomic, we develop a scheduling policy that provably attains the change capacity of the system. We then propose and evaluate an atomic approximation of the optimal fluid scheduling policy, which is well suited for application to a real change management system. Simulation results demonstrate that the expected change execution delay and the capacity attained by the approximate policy is close to the best attainable values, when unavoidable capacity losses due to fragmentation effects are taken into account and is significantly better than a randomized scheduling policy.", "citation": "Citations (6)", "departments": ["Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "IBM", "IBM", "University of Pennsylvania"], "authors": ["Praveen Kumar Muthuswamy.....http://dblp.org/pers/hd/m/Muthuswamy:Praveen_Kumar", "Koushik Kar.....http://dblp.org/pers/hd/k/Kar:Koushik", "Sambit Sahu.....http://dblp.org/pers/hd/s/Sahu:Sambit", "Prashant Pradhan.....http://dblp.org/pers/hd/p/Pradhan:Prashant", "Saswati Sarkar.....http://dblp.org/pers/hd/s/Sarkar:Saswati"], "conf": "infocom", "year": "2010", "pages": 5}