{"title": "How to ConQueR why-not questions.", "fields": ["online aggregation", "view", "range query", "boolean conjunctive query", "sargable"], "abstract": "One useful feature that is missing from today's database systems is an explain capability that enables users to seek clarifications on unexpected query results. There are two types of unexpected query results that are of interest: the presence of unexpected tuples, and the absence of expected tuples (i.e., missing tuples). Clearly, it would be very helpful to users if they could pose follow-up  why  and  why-not  questions to seek clarifications on, respectively, unexpected and expected (but missing) tuples in query results. While the why questions can be addressed by applying established data provenance techniques, the problem of explaining the why-not questions has received very little attention. There are currently two explanation models proposed for why-not questions. The first model explains a missing tuple  t  in terms of modifications to the database such that  t  appears in the query result wrt the modified database. The second model explains by identifying the data manipulation operator in the query evaluation plan that is responsible for excluding  t  from the result. In this paper, we propose a new paradigm for explaining a why-not question that is based on automatically generating a refined query whose result includes both the original query's result as well as the user-specified missing tuple(s). In contrast to the existing explanation models, our approach goes beyond merely identifying the \"culprit\" query operator responsible for the missing tuple(s) and is useful for applications where it is not appropriate to modify the database to obtain missing tuples.", "citation": "Citations (134)", "year": "2010", "departments": ["National University of Singapore", "National University of Singapore"], "conf": "sigmod", "authors": ["Quoc Trung Tran.....http://dblp.org/pers/hd/t/Tran:Quoc_Trung", "Chee-Yong Chan.....http://dblp.org/pers/hd/c/Chan:Chee=Yong"], "pages": 12}