{"title": "Document recommendation in social tagging services.", "fields": ["semantic data model", "data set", "web page", "feature learning", "recommender system"], "abstract": "Social tagging services allow users to annotate various online resources with freely chosen keywords (tags). They not only facilitate the users in finding and organizing online resources, but also provide meaningful collaborative semantic data which can potentially be exploited by recommender systems. Traditional studies on recommender systems focused on user rating data, while recently social tagging data is becoming more and more prevalent. How to perform resource recommendation based on tagging data is an emerging research topic. In this paper we consider the problem of document (e.g. Web pages, research papers) recommendation using purely tagging data. That is, we only have data containing users, tags, documents and the relationships among them. We propose a novel graph-based representation learning algorithm for this purpose. The users, tags and documents are represented in the same semantic space in which two related objects are close to each other. For a given user, we recommend those documents that are sufficiently close to him/her. Experimental results on two data sets crawled from Del.icio.us and CiteULike show that our algorithm can generate promising recommendations and outperforms traditional recommendation algorithms.", "citation": "Citations (107)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University"], "authors": ["Ziyu Guan.....http://dblp.org/pers/hd/g/Guan:Ziyu", "Can Wang.....http://dblp.org/pers/hd/w/Wang_0001:Can", "Jiajun Bu.....http://dblp.org/pers/hd/b/Bu:Jiajun", "Chun Chen.....http://dblp.org/pers/hd/c/Chen:Chun", "Kun Yang.....http://dblp.org/pers/hd/y/Yang:Kun", "Deng Cai.....http://dblp.org/pers/hd/c/Cai:Deng", "Xiaofei He.....http://dblp.org/pers/hd/h/He:Xiaofei"], "conf": "www", "year": "2010", "pages": 10}