{"title": "CPMC: An Efficient Proximity Malware Coping Scheme in Smartphone-based Mobile Networks.", "fields": ["delegation", "computer worm", "malware", "redundancy", "intelligent network"], "abstract": "Smartphones are envisioned to provide promising applications and services. At the same time, smartphones are also increasingly becoming the target of malware. Many emerging malware can utilize the proximity of devices to propagate in a distributed manner, thus remaining unobserved and making detections substantially more challenging. Different from existing malware coping schemes, which are either totally centralized or purely distributed, we propose a Community-based Proximity Malware Coping scheme, CPMC. CPMC utilizes the social community structure, which reflects a stable and controllable granularity of security, in smartphone-based mobile networks. The CPMC scheme integrates short-term coping components, which deal with individual malware, and long-term evaluation components, which offer vulnerability evaluation towards individual nodes. A closeness-oriented delegation forwarding scheme combined with a community level quarantine method is proposed as the short-term coping components. These components contain a proximity malware by quickly propagating the signature of a detected malware into all communities while avoiding unnecessary redundancy. The long-term components offer vulnerability evaluation towards neighbors, based on the observed infection history, to help users make comprehensive communication decisions. Extensive real- and synthetic-trace driven simulation results are presented to to evaluate the effectiveness of CPMC.", "citation": "Citations (86)", "departments": ["Indiana University – Purdue University Indianapolis", "Florida Atlantic University", "Temple University"], "authors": ["Feng Li.....http://dblp.org/pers/hd/l/Li_0001:Feng", "Yinying Yang.....http://dblp.org/pers/hd/y/Yang:Yinying", "Jie Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jie"], "conf": "infocom", "year": "2010", "pages": 9}