{"title": "Deterministic identity testing of depth-4 multilinear circuits with bounded top fan-in.", "fields": ["combinatorics", "polynomial identity testing", "electronic circuit", "polynomial", "bounded function", "fan in", "sigma", "multilinear map"], "abstract": "We give the first sub-exponential time deterministic polynomial identity testing algorithm for depth-4 multilinear circuits with a small top fan-in. More accurately, our algorithm works for depth-4 circuits with a plus gate at the top (also known as ΣΠΣΠ circuits) and has a running time of exp(poly(log(n),log(s),k)) where n is the number of variables, s is the size of the circuit and k is the fan-in of the top gate. In particular, when the circuit is of polynomial (or quasi-polynomial) size, our algorithm runs in quasi-polynomial time. In [AV08], it was shown that derandomizing polynomial identity testing for general ΣΠΣΠ circuits implies a derandomization of polynomial identity testing in general arithmetic circuits. Prior to this work sub-exponential time deterministic algorithms were known for depth-$3$ circuits with small top fan-in and for very restricted versions of depth-4 circuits.   The main ingredient in our proof is a new structural theorem for multilinear ΣΠΣΠ(k) circuits. Roughly, this theorem shows that any nonzero multilinear ΣΠΣΠ(k) circuit contains an `embedded' nonzero multilinear ΣΠΣ(k) circuit. Using ideas from previous works on identity testing of sums of read-once formulas and of depth-3 multilinear circuits, we are able to exploit this structure and obtain an identity testing algorithm for multilinear ΣΠΣΠ(k) circuits.", "citation": "Citations (32)", "year": "2010", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "conf": "stoc", "authors": ["Zohar Shay Karnin.....http://dblp.org/pers/hd/k/Karnin:Zohar_Shay", "Partha Mukhopadhyay.....http://dblp.org/pers/hd/m/Mukhopadhyay:Partha", "Amir Shpilka.....http://dblp.org/pers/hd/s/Shpilka:Amir", "Ilya Volkovich.....http://dblp.org/pers/hd/v/Volkovich:Ilya"], "pages": 10}