{"title": "Risk-Aware Routing for Optical Transport Networks.", "fields": ["optical transport network", "path protection", "failure rate", "service level agreement", "mesh networking"], "abstract": "A Service Level Agreement (SLA) typically specifies the availability a Service Provider (SP) promises to a customer. In an Optical Transport Network, finding a lightpath for a connection is commonly based on whether the availability of a lightpath availability complies with the connection's SLA-requested availability. Because of the stochastic nature of network failures, the actual availability of a lightpath over a specific time period is subject to uncertainty, and the SLA is usually at risk. We consider the network uncertainty, and study routing to minimize the probability of SLA violation. First, we use a single-link model to study SLA Violation Risk (i.e., the probability of SLA violation) under different settings. We show that SLA Violation Risk may vary by paths and is affected by other factors (e.g., failure rate, connection holding time, etc.), and hence cannot be simply described by path availability. We then formulate the problem of risk-aware routing in mesh networks, in which routing decisions are dictated by SLA Violation Risk. In particular, we focus on devising a scheme capable of computing lightpath(s) that are likely to successfully accommodate a connection's SLA-requested availability. A novel technique is applied to convert links with heterogeneous failure profiles to reference links which capture the main risk features in a relative manner. Based on the \"reference link\" concept, we present a polynomial Risk-Aware Routing scheme using only limited failure information. In addition, we extend our Risk-Aware Routing scheme to incorporate shared path protection (SPP) when protection is needed. We evaluate the performance and demonstrate the effectiveness of our schemes in terms of SLA violation ratio and, more generally, contrast them with the generic availability-aware approaches.", "citation": "Citations (10)", "departments": ["University of California, Davis", "Polytechnic University of Milan", "University of California, Davis", "University of California, Davis"], "authors": ["Ming Xia.....http://dblp.org/pers/hd/x/Xia:Ming", "Massimo Tornatore.....http://dblp.org/pers/hd/t/Tornatore:Massimo", "Charles U. Martel.....http://dblp.org/pers/hd/m/Martel:Charles_U=", "Biswanath Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Biswanath"], "conf": "infocom", "year": "2010", "pages": 8}