{"title": "Low-complexity Scheduling Algorithms for Multi-channel Downlink Wireless Networks.", "fields": ["orthogonal frequency division multiplexing", "rate function", "throughput", "channel", "algorithm design"], "abstract": "This paper considers the problem of designing scheduling algorithms for multi-channel (e.g., OFDM) wireless downlink networks with n users/OFDM sub-channels. For this system, while the classical MaxWeight algorithm is known to be throughput-optimal, its buffer-overflow performance is very poor (formally, we show it has zero rate function in our setting). To address this, we propose a class of algorithms called iHLQF (iterated Heaviest matching with Longest Queues First) that is shown to be throughput optimal for a general class of arrival/channel processes, and also rate-function optimal (i.e., exponentially small buffer overflow probability) for certain arrival/channel processes. iHLQF however has higher complexity than MaxWeight (n^4 vs. n^2 respectively). To overcome this issue, we propose a new algorithm called SSG (Server-Side Greedy). We show that SSG is throughput optimal, results in a much better per-user buffer overflow performance than the MaxWeight algorithm (positive rate function for certain arrival/channel processes), and has a computational complexity ($n^2$) that is comparable to the MaxWeight algorithm. Thus, it provides a nice trade-off between buffer-overflow performance and computational complexity. These results are validated by both analysis and simulations.", "citation": "Citations (24)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "Iowa State University", "University of Illinois at Urbana–Champaign"], "authors": ["Shreeshankar Bodas.....http://dblp.org/pers/hd/b/Bodas:Shreeshankar", "Sanjay Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Sanjay", "Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei", "R. Srikant.....http://dblp.org/pers/hd/s/Srikant:R="], "conf": "infocom", "year": "2010", "pages": 9}