{"title": "Efficient large-scale image annotation by probabilistic collaborative multi-label propagation.", "fields": ["locality sensitive hashing", "annotation", "probabilistic logic", "kullback leibler divergence", "automatic image annotation"], "abstract": "Annotating large-scale image corpus requires huge amount of human efforts and is thus generally unaffordable, which directly motivates recent development of semi-supervised or active annotation methods. In this paper we revisit this notoriously challenging problem and develop a novel multi-label propagation scheme, whereby both the efficacy and accuracy of large-scale image annotation are further enhanced. Our investigation starts from a survey of previous graph propagation based annotation approaches, wherein we analyze their main drawbacks when scaling up to large-scale datasets and handling multi-label setting. Our proposed scheme outperforms the state-of-the-art algorithms by making the following contributions. 1) Unlike previous approaches that propagate over individual label independently, our proposed large-scale multi-label propagation (LSMP) scheme encodes the tag information of an image as a unit label confidence vector, which naturally imposes inter-label constraints and manipulates labels interactively. It then utilizes the probabilistic Kullback-Leibler divergence for problem formulation on multi-label propagation. 2) We perform the multi-label propagation on the so-called hashing-based L1-graph, which is efficiently derived with Locality Sensitive Hashing approach followed by sparse L1-graph construction within the individual hashing buckets. 3) An efficient and convergency provable iterative procedure is presented for problem optimization. Extensive experiments on NUS-WIDE dataset (both lite version with 56k images and full version with 270k images) well validate the effectiveness and scalability of the proposed approach.", "citation": "Citations (61)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Xiangyu Chen.....http://dblp.org/pers/hd/c/Chen:Xiangyu", "Yadong Mu.....http://dblp.org/pers/hd/m/Mu:Yadong", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2010", "pages": 10}