{"title": "Route skyline queries: A multi-preference path planning approach.", "fields": ["operator", "online analytical processing", "graph embedding", "skyline", "iterator"], "abstract": "In recent years, the research community introduced various methods for processing skyline queries in multidimensional databases. The skyline operator retrieves all objects being optimal w.r.t. an arbitrary linear weighting of the underlying criteria. The most prominent example query is to find a reasonable set of hotels which are cheap but close to the beach. In this paper, we propose an new approach for computing skylines on routes (paths) in a road network considering multiple preferences like distance, driving time, the number of traffic lights, gas consumption, etc. Since the consideration of different preferences usually involves different routes, a skyline-fashioned answer with relevant route candidates is highly useful. In our work, we employ graph embedding techniques to enable a best-first based graph exploration considering route preferences based on arbitrary road attributes. The core of our skyline query processor is a route iterator which iteratively computes the top routes according to (at least one) preference in an efficient way avoiding that route computations need to be issued from scratch in each iteration. Furthermore, we propose pruning techniques in order to reduce the search space. Our pruning strategies aim at pruning as many route candidates as possible during the graph exploration. Therefore, we are able to prune candidates which are only partially explored. Finally, we show that our approach is able to reduce the search space significantly and that the skyline can be computed in efficient time in our experimental evaluation.", "citation": "Citations (109)", "departments": ["Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich"], "authors": ["Hans-Peter Kriegel.....http://dblp.org/pers/hd/k/Kriegel:Hans=Peter", "Matthias Renz.....http://dblp.org/pers/hd/r/Renz:Matthias", "Matthias Schubert.....http://dblp.org/pers/hd/s/Schubert:Matthias"], "conf": "icde", "year": "2010", "pages": 12}