{"title": "Protecting Circuits from Leakage: the Computationally-Bounded and Noisy Cases.", "fields": ["distributed computing", "security parameter", "acc0", "electronic circuit", "computer science", "or gate", "bounded function", "boolean circuit", "leakage"], "abstract": "Physical computational devices leak side-channel information that may, and often does, reveal secret internal states. We present a general transformation that compiles any circuit into a new, functionally equivalent circuit which is resilient against well-defined classes of leakage. Our construction requires a small, stateless and computation-independent leak-proof component that draws random elements from a fixed distribution. In essence, we reduce the problem of shielding arbitrarily complex circuits to the problem of shielding a single, simple component.\n\nOur approach is based on modeling the adversary as a powerful observer that inspects the device via a limited measurement apparatus. We allow the apparatus to access all the bits of the computation (except those inside the leak-proof component) and the amount of leaked information to grow unbounded over time. However, we assume that the apparatus is limited either in its computational ability (namely, it lacks the ability to decode certain linear encodings and outputs a limited number of bits per iteration), or its precision (each observed bit is flipped with some probability). While our results apply in general to such leakage classes, in particular, we obtain security against:\n\nConstant depth circuits leakage, where the measurement apparatus can be implemented by an AC0 circuit (namely, a constant depth circuit composed of NOT gates and unbounded fan-in AND and OR gates), or an ACC0[p] circuit (which is the same as AC0, except that it also uses MODp gates) which outputs a limited number of bits.\n\nNoisy leakage, where the measurement apparatus reveals all the bits of the state of the circuit, perturbed by independent binomial noise. Namely, each bit of the computation is perturbed with probability p, and remains unchanged with probability 1−p.", "citation": "Not cited", "year": "2010", "departments": ["Katholieke Universiteit Leuven", "IBM", "Boston University", "Massachusetts Institute of Technology", "IBM"], "conf": "eurocrypt", "authors": ["Sebastian Faust.....http://dblp.org/pers/hd/f/Faust:Sebastian", "Tal Rabin.....http://dblp.org/pers/hd/r/Rabin:Tal", "Leonid Reyzin.....http://dblp.org/pers/hd/r/Reyzin:Leonid", "Eran Tromer.....http://dblp.org/pers/hd/t/Tromer:Eran", "Vinod Vaikuntanathan.....http://dblp.org/pers/hd/v/Vaikuntanathan:Vinod"], "pages": 22}