{"title": "Hive - a petabyte scale data warehouse using Hadoop.", "fields": ["scripting language", "data warehouse", "query language", "query optimization", "sql"], "abstract": "The size of data sets being collected and analyzed in the industry for business intelligence is growing rapidly, making traditional warehousing solutions prohibitively expensive. Hadoop [1] is a popular open-source map-reduce implementation which is being used in companies like Yahoo, Facebook etc. to store and process extremely large data sets on commodity hardware. However, the map-reduce programming model is very low level and requires developers to write custom programs which are hard to maintain and reuse. In this paper, we present Hive, an open-source data warehousing solution built on top of Hadoop. Hive supports queries expressed in a SQL-like declarative language - HiveQL, which are compiled into map-reduce jobs that are executed using Hadoop. In addition, HiveQL enables users to plug in custom map-reduce scripts into queries. The language includes a type system with support for tables containing primitive types, collections like arrays and maps, and nested compositions of the same. The underlying IO libraries can be extended to query data in custom formats. Hive also includes a system catalog - Metastore - that contains schemas and statistics, which are useful in data exploration, query optimization and query compilation. In Facebook, the Hive warehouse contains tens of thousands of tables and stores over 700TB of data and is being used extensively for both reporting and ad-hoc analyses by more than 200 users per month.", "citation": "Citations (945)", "departments": ["Facebook", "Facebook", "Facebook", "Facebook", "Facebook"], "authors": ["Ashish Thusoo.....http://dblp.org/pers/hd/t/Thusoo:Ashish", "Joydeep Sen Sarma.....http://dblp.org/pers/hd/s/Sarma:Joydeep_Sen", "Namit Jain.....http://dblp.org/pers/hd/j/Jain:Namit", "Zheng Shao.....http://dblp.org/pers/hd/s/Shao:Zheng", "Prasad Chakka.....http://dblp.org/pers/hd/c/Chakka:Prasad", "Ning Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Ning", "Suresh Anthony.....http://dblp.org/pers/hd/a/Anthony:Suresh", "Hao Liu.....http://dblp.org/pers/hd/l/Liu_0018:Hao", "Raghotham Murthy.....http://dblp.org/pers/hd/m/Murthy:Raghotham"], "conf": "icde", "year": "2010", "pages": 10}