{"title": "Visual tracking decomposition.", "fields": ["tracking system", "parallelizable manifold", "homography", "markov chain monte carlo", "visualization", "gaze", "eye tracking", "bittorrent tracker", "singular value decomposition", "control engineering", "computer vision", "salient", "salience", "algorithm design", "artificial intelligence", "markov process"], "abstract": "We propose a novel tracking algorithm that can work robustly in a challenging scenario such that several kinds of appearance and motion changes of an object occur at the same time. Our algorithm is based on a visual tracking decomposition scheme for the efficient design of observation and motion models as well as trackers. In our scheme, the observation model is decomposed into multiple basic observation models that are constructed by sparse principal component analysis (SPCA) of a set of feature templates. Each basic observation model covers a specific appearance of the object. The motion model is also represented by the combination of multiple basic motion models, each of which covers a different type of motion. Then the multiple basic trackers are designed by associating the basic observation models and the basic motion models, so that each specific tracker takes charge of a certain change in the object. All basic trackers are then integrated into one compound tracker through an interactive Markov Chain Monte Carlo (IMCMC) framework in which the basic trackers communicate with one another interactively while run in parallel. By exchanging information with others, each tracker further improves its performance, which results in increasing the whole performance of tracking. Experimental results show that our method tracks the object accurately and reliably in realistic videos where the appearance and motion are drastically changing over time.", "citation": "Not cited", "year": "2010", "departments": ["Seoul National University", "Seoul National University", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur"], "conf": "cvpr", "authors": ["Junseok Kwon.....http://dblp.org/pers/hd/k/Kwon:Junseok", "Kyoung Mu Lee.....http://dblp.org/pers/hd/l/Lee:Kyoung_Mu"], "pages": 8}