{"title": "Undecidability of Propositional Separation Logic and Its Neighbours.", "fields": ["propositional variable", "zeroth order logic", "dynamic logic", "well formed formula", "autoepistemic logic", "resolution", "predicate functor logic"], "abstract": "In this article, we investigate the logical structure of memory models of theoretical and practical interest. Our main interest is in “the logic behind a fixed memory model”, rather than in “a model of any kind behind a given logical system”. As an effective language for reasoning about such memory models, we use the formalism of separation logic. Our main result is that for any concrete choice of heap-like memory model, validity in that model is  undecidable  even for purely propositional formulas in this language.   The main novelty of our approach to the problem is that we focus on validity in specific, concrete memory models, as opposed to validity in general classes of models.   Besides its intrinsic technical interest, this result also provides new insights into the nature of their decidable fragments. In particular, we show that, in order to obtain such decidable fragments, either the formula language must be severely restricted or the valuations of propositional variables must be constrained.   In addition, we show that a number of propositional systems that approximate separation logic are undecidable as well. In particular, this resolves the open problems of decidability for Boolean BI and Classical BI.   Moreover, we provide one of the simplest undecidable propositional systems currently known in the literature, called “Minimal Boolean BI”, by combining the purely positive implication-conjunction fragment of Boolean logic with the laws of multiplicative *-conjunction, its unit and its adjoint implication, originally provided by intuitionistic multiplicative linear logic. Each of these two components is individually decidable: the implication-conjunction fragment of Boolean logic is co-NP-complete, and intuitionistic multiplicative linear logic is NP-complete.   All of our undecidability results are obtained by means of a direct encoding of Minsky machines.", "citation": "Citations (39)", "departments": ["University College London", "Queen Mary University of London", "Imperial College London", "Queen Mary University of London"], "authors": ["James Brotherston.....http://dblp.org/pers/hd/b/Brotherston:James", "Max I. Kanovich.....http://dblp.org/pers/hd/k/Kanovich:Max_I="], "conf": "lics", "year": "2010", "pages": 10}