{"title": "Approximations for the isoperimetric and spectral profile of graphs and related parameters.", "fields": ["isoperimetric inequality", "rayleigh quotient", "degree", "laplacian matrix", "bound graph"], "abstract": "The spectral profile of a graph is a natural generalization of the classical notion of its Rayleigh quotient. Roughly speaking, given a graph G, for each 0 G (δ) minimizes the Rayleigh quotient (from the variational characterization) of the spectral gap of the Laplacian matrix of G over vectors with support at most δ over a suitable probability measure. Formally, the spectral profile Λ G  of a graph G is a function Λ G  : [0,1/2] -> R defined as: Λ G (δ) def= min  x∈ R V d(supp(x))≤ δ   (∑g ij  (x i -x j ) 2 )/(∑ i  d i  x i  2 ) where g ij  is the weight of the edge (i,j) in the graph, d i  is the degree of vertex i, and d(\\supp(x)) is the fraction of edges incident on vertices within the support of vector x. While the notion of the spectral profile has numerous applications in Markov chain, it is also is closely tied to its isoperimetric profile of a graph. Specifically, the spectral profile is a relaxation for the problem of approximating edge expansion of small sets in graphs. In this work, we obtain an efficient algorithm that yields a log(1/δ)-factor approximation for the value of Λ G (δ). By virtue of its connection to edge-expansion, we also obtain an algorithm for the problem of approximating edge expansion of small linear sized sets in a graph. This problem was recently shown to be intimately connected to the Unique Games Conjecture in [18]. Finally, we extend the techniques to obtain approximation algorithms with similar guarantees for restricted eigenvalue problems on diagonally dominant matrices.", "citation": "Citations (30)", "year": "2010", "departments": ["Microsoft", "Princeton University", "Georgia Institute of Technology"], "conf": "stoc", "authors": ["Prasad Raghavendra.....http://dblp.org/pers/hd/r/Raghavendra:Prasad", "David Steurer.....http://dblp.org/pers/hd/s/Steurer:David", "Prasad Tetali.....http://dblp.org/pers/hd/t/Tetali:Prasad"], "pages": 10}