{"title": "Minimizing End-to-End Delay in Wireless Networks Using a Coordinated EDF Schedule.", "fields": ["end to end delay", "weighted fair queueing", "network packet", "network scheduler", "throughput"], "abstract": "We study the end-to-end delay bounds that can be achieved in wireless networks using packet deadlines. We assume a set of flows in the network, for which flow i has burst parameter σ_i, injection rate ρ_i, and path length K_i. It was already known that, in wireline networks, the Coordinated-Earliest-Deadline-First (CEDF) protocol can achieve and end-to-end delay of approximately (σ_i/ρ_i)+K_i, whereas other schedulers such as Weighted Fair Queuing, have end-to-end delay bounds of the form (σ_i + Ki)/ρ_i. For the case of wireless networks of arbitrary topology, the focus has typically been more on throughput optimality than minimizing delay. In this paper, we study the delay bounds that can be achieved by combining wireless link scheduling algorithms with a CEDF packet scheduler. We first present a centralized scheduler that has an end-to-end delay of approximately O(σ_i/ρ_i + Σ (l ε p_i) N / r_l), where r_l is the total rate of flows through link l, N is the number of links in the network, and p_i is the path followed by packets of flow i. We then show how to convert this into a distributed scheduler. We also study the extent to which results on the schedulability of packet deadlines can be carried over from the wireline to the wireless context. Lastly, we examine ways in which the theoretical schedulers considered in this paper can be transferred to a more practical random-access based setting. This work was supported by NSF contract CCF-0728980 and was performed while the first author was visiting Bell Labs in Summer, 2009.", "citation": "Citations (24)", "departments": ["University of Illinois at Urbana–Champaign", "Bell Labs"], "authors": ["Praveen Jayachandran.....http://dblp.org/pers/hd/j/Jayachandran:Praveen", "Matthew Andrews.....http://dblp.org/pers/hd/a/Andrews:Matthew"], "conf": "infocom", "year": "2010", "pages": 9}