{"title": "Large-scale music tag recommendation with explicit multiple attributes.", "fields": ["heuristics", "collaborative intelligence", "software deployment", "semantic similarity", "upload"], "abstract": "Social tagging can provide rich semantic information for large-scale retrieval in music discovery. Such collaborative intelligence, however, also generates a high degree of tags unhelpful to discovery, some of which obfuscate critical information. Towards addressing these shortcomings, tag recommendation for more robust music discovery is an emerging topic of significance for researchers. However, current methods do not consider diversity of music attributes, often using simple heuristics such as tag frequency for filtering out irrelevant tags. Music attributes encompass any number of perceived dimensions, for instance vocalness, genre, and instrumentation. Many of these are underrepresented by current tag recommenders. We propose a scheme for tag recommendation using Explicit Multiple Attributes based on tag semantic similarity and music content. In our approach, the attribute space is explicitly constrained at the outset to a set that minimizes semantic loss and tag noise, while ensuring attribute diversity. Once the user uploads or browses a song, the system recommends a list of relevant tags in each attribute independently. To the best of our knowledge, this is the first method to consider Explicit Multiple Attributes for tag recommendation. Our system is designed for large-scale deployment, on the order of millions of objects. For processing large-scale music data sets, we design parallel algorithms based on the MapReduce framework to perform large-scale music content and social tag analysis, train a model, and compute tag similarity. We evaluate our tag recommendation system on CAL-500 and a large-scale data set ($N = 77,448$ songs) generated by crawling Youtube and Last.fm. Our results indicate that our proposed method is both effective for recommending attribute-diverse relevant tags and efficient at scalable processing.", "citation": "Citations (14)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Zhendong Zhao.....http://dblp.org/pers/hd/z/Zhao:Zhendong", "Xinxi Wang.....http://dblp.org/pers/hd/w/Wang:Xinxi", "Qiaoliang Xiang.....http://dblp.org/pers/hd/x/Xiang:Qiaoliang", "Andy M. Sarroff.....http://dblp.org/pers/hd/s/Sarroff:Andy_M=", "Zhonghua Li.....http://dblp.org/pers/hd/l/Li:Zhonghua", "Ye Wang.....http://dblp.org/pers/hd/w/Wang:Ye"], "conf": "mm", "year": "2010", "pages": 10}