{"title": "Characterizing Interactive Behavior in a Large-Scale Operational IPTV Environment.", "fields": ["interactivity", "parametric model", "interactive television", "iptv", "capacity planning"], "abstract": "We investigate the user viewing activity for broadcast TV, pre-recorded content using Digital Video Recording (DVR) and video on demand (VoD) in an IP-based content distribution environment. Advanced stream control functions (play, pause, skip, rewind, etc.) provide users with a high level of interactivity, but place demands on the distribution infrastructure (servers, network, home-network) that can be difficult to manage at large scale. To support system design as well as network capacity planning, it is necessary to have a good model of user interaction. Using traces from a well-provisioned operational environment with a large user population, we first characterize interactivity for broadcast TV, DVR and VoD. We then develop parametric models of individual users stream control operations for VoD. Our analysis shows that interactive behavior is adequately characterized by two semi-Markov models, one for weekdays and another for weekends. We propose a parametric model for the underlying sojourn time distributions and show that it results in a superior fit compared to well known distributions (generalized Pareto and Weibull). In order to validate that our models faithfully capture user behavior, we compare the workload that a VoD server experiences in response to actual traces and synthetic data generated from our proposed models.", "citation": "Citations (11)", "departments": ["AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "authors": ["Vijay Gopalakrishnan.....http://dblp.org/pers/hd/g/Gopalakrishnan:Vijay", "Rittwik Jana.....http://dblp.org/pers/hd/j/Jana:Rittwik", "Ralph Knag.....http://dblp.org/pers/hd/k/Knag:Ralph", "K. K. Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:K=_K=", "Deborah F. Swayne.....http://dblp.org/pers/hd/s/Swayne:Deborah_F=", "Vinay A. Vaishampayan.....http://dblp.org/pers/hd/v/Vaishampayan:Vinay_A="], "conf": "infocom", "year": "2010", "pages": 5}