{"title": "Intentional networking: opportunistic exploitation of mobile network diversity.", "fields": ["distributed file system", "software defined networking", "networking hardware", "active networking", "delay tolerant networking"], "abstract": "Mobile devices face a diverse and dynamic set of networking options. Using those options to the fullest requires knowledge of application intent. This paper describes Intentional Networking, a simple but powerful mechanism for handling network diversity. Applications supply a declarative label for network transmissions, and the system matches transmissions to the most appropriate network. The system may also defer and re-order opportunistic transmissions subject to application-supplied mutual exclusion and ordering constraints. We have modified three applications to use Intentional Networking: BlueFS, a distributed file system for pervasive computing, Mozilla's Thunderbird e-mail client, and a vehicular participatory sensing application. We evaluated the performance of these applications using measurements obtained by driving a vehicle through WiFi and cellular 3G network coverage. Compared to an idealized solution that makes optimal use of all aggregated available networks but that lacks knowledge of application intent, Intentional Networking improves the latency of interactive messages from 48% to 13x, while adding no more than 7% throughput overhead.", "citation": "Citations (123)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "Ford Motor Company"], "authors": ["Brett D. Higgins.....http://dblp.org/pers/hd/h/Higgins:Brett_D=", "Azarias Reda.....http://dblp.org/pers/hd/r/Reda:Azarias", "Timur Alperovich.....http://dblp.org/pers/hd/a/Alperovich:Timur", "Jason Flinn.....http://dblp.org/pers/hd/f/Flinn:Jason", "Thomas J. Giuli.....http://dblp.org/pers/hd/g/Giuli:Thomas_J=", "Brian Noble.....http://dblp.org/pers/hd/n/Noble:Brian", "David Watson.....http://dblp.org/pers/hd/w/Watson:David"], "conf": "mobicom", "year": "2010", "pages": 12}