{"title": "Achieving Distributed Control through Model Checking.", "fields": ["distributed computing", "undecidable problem", "real time computing", "controller", "model checking", "computer science", "concurrency", "regular language", "deadlock"], "abstract": "We apply model checking of knowledge properties to the design of distributed controllers that enforce global constraints on concurrent systems. The problem of synthesizing a distributed controller is undecidable in the general case. We thus look at a variant of the synthesis problem that allows adding temporary synchronizations between processes. We calculate when processes can decide autonomously, based on their knowledge, whether to take or block an action so that the global constraint is not violated. The local knowledge of processes may not suffice to control the processes so as to achieve the global constraint without introducing new deadlocks. When individual processes cannot take a decision alone based on their knowledge, one may coordinate several processes to achieve joint knowledge in order to take joint decisions. A fixed coordination among sets of processes may severely degrade concurrency. Therefore, we propose the use of temporary coordinations. Since realizing such coordinations on a distributed platform induces communication overhead, we strive to minimize their number. We show how this framework is applied to the case of synthesizing a distributed controller for enforcing a priority order. Finally, we show that the general undecidability of distributed synthesis without adding synchronization holds even for the particular problem of enforcing a priority order.", "citation": "Citations (31)", "year": "2010", "departments": ["Bar-Ilan University", "Braunschweig University of Technology", "Bar-Ilan University", "VERIMAG, Centre ... , France 38610", "VERIMAG, Centre ... Gières, France", "VERIMAG, Centre ... Gières, France"], "conf": "cav", "authors": ["Susanne Graf.....http://dblp.org/pers/hd/g/Graf:Susanne", "Doron A. Peled.....http://dblp.org/pers/hd/p/Peled:Doron_A=", "Sophie Quinton.....http://dblp.org/pers/hd/q/Quinton:Sophie"], "pages": 14}