{"title": "Improving state-of-the-art OCR through high-precision document-specific modeling.", "fields": ["font", "optical character recognition", "training set", "tesseract", "data modeling"], "abstract": "Optical character recognition (OCR) remains a difficult problem for noisy documents or documents not scanned at high resolution. Many current approaches rely on stored font models that are vulnerable to cases in which the document is noisy or is written in a font dissimilar to the stored fonts. We address these problems by learning character models directly from the document itself, rather than using pre-stored font models. This method has had some success in the past, but we are able to achieve substantial improvement in error reduction through a novel method for creating nearly error-free document-specific training data and building character appearance models from this data. In particular, we first use the state-of-the-art OCR system Tesseract to produce an initial translation. Then, our method identifies a subset of words that we have high confidence have been recognized correctly and uses this subset to bootstrap document-specific character models. We present theoretical justification that a word in the selected subset is very unlikely to be incorrectly recognized, and empirical results on a data set of difficult historical newspaper scans demonstrating that we make only two errors in 56 documents. We then relax the theoretical constraint in order to create a larger training set, and using document-specific character models generated from this data, we are able to reduce the error over properly segmented characters by 34.1% overall from the initial Tesseract translation.", "citation": "Citations (15)", "year": "2010", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "Carnegie Mellon University", "University of Massachusetts Amherst"], "conf": "cvpr", "authors": ["Andrew Kae.....http://dblp.org/pers/hd/k/Kae:Andrew", "Gary B. Huang.....http://dblp.org/pers/hd/h/Huang:Gary_B=", "Carl Doersch.....http://dblp.org/pers/hd/d/Doersch:Carl", "Erik G. Learned-Miller.....http://dblp.org/pers/hd/l/Learned=Miller:Erik_G="], "pages": 8}