{"title": "USHER: Improving data quality with dynamic forms.", "fields": ["data integrity", "of the form", "data quality", "data set", "probabilistic logic", "computer science", "data mining", "information quality"], "abstract": "Data quality is a critical problem in modern databases. Data entry forms present the first and arguably best opportunity for detecting and mitigating errors, but there has been little research into automatic methods for improving data quality at entry time. In this paper, we propose USHER, an end-to-end system for form design, entry, and data quality assurance. Using previous form submissions, USHER learns a probabilistic model over the questions of the form. USHER then applies this model at every step of the data entry process to improve data quality. Before entry, it induces a form layout that captures the most important data values of a form instance as quickly as possible. During entry, it dynamically adapts the form to the values being entered, and enables real-time feedback to guide the data enterer toward their intended values. After entry, it re-asks questions that it deems likely to have been entered incorrectly. We evaluate all three components of USHER using two real-world data sets. Our results demonstrate that each component has the potential to improve data quality considerably, at a reduced cost when compared to current practice.", "citation": "Not cited", "departments": ["University of California, Berkeley", "Massachusetts Institute of Technology", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Massachusetts Institute of Technology", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["Kuang Chen.....http://dblp.org/pers/hd/c/Chen:Kuang", "Harr Chen.....http://dblp.org/pers/hd/c/Chen:Harr", "Neil Conway.....http://dblp.org/pers/hd/c/Conway:Neil", "Joseph M. Hellerstein.....http://dblp.org/pers/hd/h/Hellerstein:Joseph_M=", "Tapan S. Parikh.....http://dblp.org/pers/hd/p/Parikh:Tapan_S="], "conf": "icde", "year": "2010", "pages": 12}