{"title": "Stochastic Analysis of Non-Slotted Aloha in Wireless Ad-Hoc Networks.", "fields": ["rayleigh fading", "stochastic geometry", "fading", "aloha", "path loss"], "abstract": "In this paper we propose two analytically tractable stochastic models of non-slotted Aloha for Mobile Ad-hoc NETworks (MANETs): one model assumes a static pattern of nodes while the other assumes that the pattern of nodes varies over time. Both models feature transmitters randomly located in the Euclidean plane, according to a Poisson point process with the receivers randomly located at a fixed distance from the emitters. We concentrate on the so-called outage scenario, where a successful transmission requires a Signal-to-Interference-and-Noise Ratio (SINR) larger than a given threshold. With Rayleigh fading and the SINR averaged over the duration of the packet transmission, both models lead to closed form expressions for the probability of successful transmission. We show an excellent matching of these results with simulations. Using our models we compare the performances of non-slotted Aloha to previously studied slotted Aloha. We observe that when the path loss is not very strong both models, when appropriately optimized, exhibit similar performance. For stronger path loss non-slotted Aloha performs worse than slotted Aloha, however when the path loss exponent is equal to 4 its density of successfully received packets is still 75% of that in the slotted scheme. This is still much more than the 50% predicted by the well-known analysis where simultaneous transmissions are never successful. Moreover, in any path loss scenario, both schemes exhibit the same energy efficiency.", "citation": "Citations (30)", "departments": ["University of Wrocław", "French Institute for Research in Computer Science and Automation"], "authors": ["Bartlomiej Blaszczyszyn.....http://dblp.org/pers/hd/b/Blaszczyszyn:Bartlomiej", "Paul Mühlethaler.....http://dblp.org/pers/hd/m/M=uuml=hlethaler:Paul"], "conf": "infocom", "year": "2010", "pages": 9}