{"title": "SherLog: error diagnosis by connecting clues from run-time logs.", "fields": ["unavailability", "software quality", "software bug", "concurrency", "server"], "abstract": "Computer systems often fail due to many factors such as software bugs or administrator errors. Diagnosing such production run failures is an important but challenging task since it is difficult to reproduce them in house due to various reasons: (1) unavailability of users' inputs and file content due to privacy concerns; (2) difficulty in building the exact same execution environment; and (3) non-determinism of concurrent executions on multi-processors.   Therefore, programmers often have to diagnose a production run failure based on logs collected back from customers and the corresponding source code. Such diagnosis requires expert knowledge and is also too time-consuming, tedious to narrow down root causes. To address this problem, we propose a tool, called SherLog, that analyzes source code by leveraging information provided by run-time logs to infer what must or may have happened during the failed production run. It requires neither re-execution of the program nor knowledge on the log's semantics. It infers both control and data value information regarding to the failed execution.   We evaluate SherLog with 8 representative  real world  software failures (6 software bugs and 2 configuration errors) from 7 applications including 3 servers. Information inferred by SherLog are very useful for programmers to diagnose these evaluated failures. Our results also show that SherLog can analyze large server applications such as Apache with thousands of logging messages within only 40 minutes.", "citation": "Citations (216)", "year": "2010", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Waterloo", "University of California, San Diego"], "conf": "asplos", "authors": ["Ding Yuan.....http://dblp.org/pers/hd/y/Yuan:Ding", "Haohui Mai.....http://dblp.org/pers/hd/m/Mai:Haohui", "Weiwei Xiong.....http://dblp.org/pers/hd/x/Xiong:Weiwei", "Lin Tan.....http://dblp.org/pers/hd/t/Tan:Lin", "Yuanyuan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuanyuan", "Shankar Pasupathy.....http://dblp.org/pers/hd/p/Pasupathy:Shankar"], "pages": 12}