{"title": "On Channel-Discontinuity-Constraint Routing in Wireless Networks.", "fields": ["node", "distributed algorithm", "time division multiple access", "constrained shortest path first", "throughput", "spanner", "matching", "channel"], "abstract": "Multi-channel wireless networks are increasingly deployed as infrastructure networks, e.g. in metro areas. Network nodes frequently employ directional antennas to improve spatial throughput. In such networks, between two nodes, it is of interest to compute a path with a channel assignment for the links such that the path and link bandwidths are the same. This is achieved when any two consecutive links are assigned different channels, termed as ''Channel-Discontinuity-Constraint'' (CDC). CDC-paths are also useful in TDMA systems, where, preferably, consecutive links are assigned different time-slots. In the first part of this paper, we develop a t-spanner for CDC-paths using spatial properties; a sub-network containing O(n/@q) links, for any @q>0, such that CDC-paths increase in cost by at most a factor t= (1-2 sin(@q/2))^-^2. We propose a novel distributed algorithm to compute the spanner using an expected number of O(nlogn) fixed-size messages. In the second part, we present a distributed algorithm to find minimum-cost CDC-paths between two nodes using O(n^2) fixed-size messages, by developing an extension of Edmonds' algorithm for minimum-cost perfect matching. In a centralized implementation, our algorithm runs in O(n^2) time improving the previous best algorithm which requires O(n^3) running time. Moreover, this running time improves to O(n/@q) when used in conjunction with the spanner developed.", "citation": "Citations (1)", "departments": ["University of Arizona", "University of Arizona", "University of Arizona", "Duke University", "University of Arizona", "University of Arizona", "University of Arizona", "Duke University"], "authors": ["Swaminathan Sankararaman.....http://dblp.org/pers/hd/s/Sankararaman:Swaminathan", "Alon Efrat.....http://dblp.org/pers/hd/e/Efrat:Alon", "Srinivasan Ramasubramanian.....http://dblp.org/pers/hd/r/Ramasubramanian:Srinivasan", "Pankaj K. Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Pankaj_K="], "conf": "infocom", "year": "2010", "pages": 5}