{"title": "Image tag refinement towards low-rank, content-tag prior and error sparsity.", "fields": ["image retrieval", "proximal gradient methods", "column vector", "convex optimization", "gradient method"], "abstract": "The vast user-provided image tags on the popular photo sharing websites may greatly facilitate image retrieval and management. However, these tags are often imprecise and/or incomplete, resulting in unsatisfactory performances in tag related applications. In this work, the tag refinement problem is formulated as a decomposition of the user-provided tag matrix D into a low-rank refined matrix A and a sparse error matrix E, namely D = A + E, targeting the optimality measured by four aspects: 1) low-rank: A is of low-rank owing to the semantic correlations among the tags; 2) content consistency: if two images are visually similar, their tag vectors (i.e., column vectors of A) should also be similar; 3) tag correlation: if two tags co-occur with high frequency in general images, their co-occurrence frequency (described by two row vectors of A) should also be high; and 4) error sparsity: the matrix E is sparse since the tag matrix D is sparse and also humans can provide reasonably accurate tags. All these components finally constitute a constrained yet convex optimization problem, and an efficient convergence provable iterative procedure is proposed for the optimization based on accelerated proximal gradient method. Extensive experiments on two benchmark Flickr datasets, with 25K and 270K images respectively, well demonstrate the effectiveness of the proposed tag refinement approach.", "citation": "Citations (246)", "departments": ["National University of Singapore", "National University of Singapore", "University of Illinois at Urbana–Champaign"], "authors": ["Guangyu Zhu.....http://dblp.org/pers/hd/z/Zhu:Guangyu", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Yi Ma.....http://dblp.org/pers/hd/m/Ma_0001:Yi"], "conf": "mm", "year": "2010", "pages": 10}