{"title": "Overcoming an Untrusted Computing Base: Detecting and Removing Malicious Hardware Automatically.", "fields": ["system on a chip", "exception handling", "hardware compatibility list", "electronic circuit", "software system", "computer hardware", "embedded system", "design process", "software"], "abstract": "The computer systems security arms race between attackers and defenders has largely taken place in the domain of software systems, but as hardware complexity and design processes have evolved, novel and potent hardware-based security threats are now possible. This paper presents a hybrid hardware/software approach to defending against malicious hardware. We propose BlueChip, a defensive strategy that has both a design-time component and a runtime component. During the design verification phase, BlueChip invokes a new technique, unused circuit identification (UCI), to identify suspicious circuitry—those circuits not used or otherwise activated by any of the design verification tests. BlueChip removes the suspicious circuitry and replaces it with exception generation hardware. The exception handler software is responsible for providing forward progress by emulating the effect of the exception generating instruction in software, effectively providing a detour around suspicious hardware. In our experiments, BlueChip is able to prevent all hardware attacks we evaluate while incurring a small runtime overhead.", "citation": "Citations (192)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Pennsylvania", "University of Pennsylvania"], "authors": ["Matthew Hicks.....http://dblp.org/pers/hd/h/Hicks:Matthew", "Murph Finnicum.....http://dblp.org/pers/hd/f/Finnicum:Murph", "Samuel T. King.....http://dblp.org/pers/hd/k/King:Samuel_T=", "Milo M. K. Martin.....http://dblp.org/pers/hd/m/Martin:Milo_M=_K=", "Jonathan M. Smith.....http://dblp.org/pers/hd/s/Smith:Jonathan_M="], "conf": "sp", "year": "2010", "pages": 14}