{"title": "Communication, collaboration, and bugs: the social nature of issue tracking in small, collocated teams.", "fields": ["software development", "tracking system", "bittorrent tracker", "project manager", "spite"], "abstract": "Issue tracking systems help organizations manage issue reporting, assignment, tracking, resolution, and archiving. Traditionally, it is the Software Engineering community that researches issue tracking systems, where software defects are reported and tracked as 'bug reports' within an archival database. Yet, as issue tracking is fundamentally a social process, it is important to understand the design and use of issue tracking systems from that perspective. Consequently, we conducted a qualitative study of issue tracking systems as used by small, collocated software development teams. We found that an issue tracker is not just a database for tracking bugs, features, and inquiries, but also a focal point for communication and coordination for many stakeholders within and beyond the software team. Customers, project managers, quality assurance personnel, and programmers all contribute to the shared knowledge and persistent communication that exists within the issue tracking system. These results were all the more striking because in spite of teams being collocated--which afforded frequent, face-to-face communication--the issue tracker was still used as a fundamental communication channel. We articulate various real-world practices surrounding issue trackers and offer design considerations for future systems.", "citation": "Citations (96)", "departments": ["University of Calgary", "University of Calgary", "University of Calgary", "University of Calgary"], "authors": ["Dane Bertram.....http://dblp.org/pers/hd/b/Bertram:Dane", "Amy Voida.....http://dblp.org/pers/hd/v/Voida:Amy", "Saul Greenberg.....http://dblp.org/pers/hd/g/Greenberg:Saul", "Robert Walker.....http://dblp.org/pers/hd/w/Walker:Robert"], "conf": "cscw", "year": "2010", "pages": 10}