{"title": "Decoding Ipsilateral Finger Movements from ECoG Signals in Humans.", "fields": ["motor control", "brain computer interface", "primary motor cortex", "decoding methods", "stroke"], "abstract": "Several motor related Brain Computer Interfaces (BCIs) have been developed over the years that use activity decoded from the contralateral hemisphere to operate devices. Contralateral primary motor cortex is also the region most severely affected by hemispheric stroke. Recent studies have identified ipsilateral cortical activity in planning of motor movements and its potential implications for a stroke relevant BCI. The most fundamental functional loss after a hemispheric stroke is the loss of fine motor control of the hand. Thus, whether ipsilateral cortex encodes finger movements is critical to the potential feasibility of BCI approaches in the future. This study uses ipsilateral cortical signals from humans (using ECoG) to decode finger movements. We demonstrate, for the first time, successful finger movement detection using machine learning algorithms. Our results show high decoding accuracies in all cases which are always above chance. We also show that significant accuracies can be achieved with the use of only a fraction of all the features recorded and that these core features are consistent with previous physiological findings. The results of this study have substantial implications for advancing neuroprosthetic approaches to stroke populations not currently amenable to existing BCI techniques.", "citation": "Citations (3)", "departments": ["Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis"], "authors": ["Yuzong Liu.....http://dblp.org/pers/hd/l/Liu:Yuzong", "Mohit Sharma.....http://dblp.org/pers/hd/s/Sharma:Mohit", "Charles M. Gaona.....http://dblp.org/pers/hd/g/Gaona:Charles_M=", "Jonathan Breshears.....http://dblp.org/pers/hd/b/Breshears:Jonathan", "Jarod Roland.....http://dblp.org/pers/hd/r/Roland:Jarod", "Zachary Freudenburg.....http://dblp.org/pers/hd/f/Freudenburg:Zachary", "Kilian Q. Weinberger.....http://dblp.org/pers/hd/w/Weinberger:Kilian_Q=", "Eric Leuthardt.....http://dblp.org/pers/hd/l/Leuthardt:Eric"], "conf": "nips", "year": "2010", "pages": 9}