{"title": "Visualizing large-scale RDF data using Subsets, Summaries, and Sampling in Oracle.", "fields": ["cwm", "rdf schema", "rdf xml", "sparql", "web ontology language"], "abstract": "The paper addresses the problem of visualizing large scale RDF data via a 3-S approach, namely, by using, 1) Subsets: to present only relevant data for visualisation; both static and dynamic subsets can be specified, 2) Summaries: to capture the essence of RDF data being viewed; summarized data can be expanded on demand thereby allowing users to create hybrid (summary-detail) fisheye views of RDF data, and 3) Sampling: to further optimize visualization of large-scale data where a representative sample suffices. The visualization scheme works with both asserted and inferred triples (generated using RDF(S) and OWL semantics). This scheme is implemented in Oracle by developing a plug-in for the Cytoscape graph visualization tool, which uses functions defined in a Oracle PL/SQL package, to provide fast and optimized access to Oracle Semantic Store containing RDF data. Interactive visualization of a synthesized RDF data set (LUBM 1 million triples), two native RDF datasets (Wikipedia 47 million triples and UniProt 700 million triples), and an OWL ontology (eClassOwl with a large class hierarchy including over 25,000 OWL classes, 5,000 properties, and 400,000 class-properties) demonstrates the effectiveness of our visualization scheme.", "citation": "Citations (7)", "departments": ["Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation"], "authors": ["Seema Sundara.....http://dblp.org/pers/hd/s/Sundara:Seema", "Medha Atre.....http://dblp.org/pers/hd/a/Atre:Medha", "Vladimir Kolovski.....http://dblp.org/pers/hd/k/Kolovski:Vladimir", "Souripriya Das.....http://dblp.org/pers/hd/d/Das:Souripriya", "Zhe Wu.....http://dblp.org/pers/hd/w/Wu:Zhe", "Eugene Inseok Chong.....http://dblp.org/pers/hd/c/Chong:Eugene_Inseok", "Jagannathan Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Jagannathan"], "conf": "icde", "year": "2010", "pages": 12}