{"title": "Searching trajectories by locations: an efficiency study.", "fields": ["small set", "trajectory", "upper and lower bounds", "temporal database", "spatial database"], "abstract": "Trajectory search has long been an attractive and challenging topic which blooms various interesting applications in spatial-temporal databases. In this work, we study a new problem of searching trajectories by locations, in which context the query is only a small set of locations with or without an order specified, while the target is to find the  k Best-Connected Trajectories  ( k -BCT) from a database such that the  k -BCT best connect the designated locations geographically. Different from the conventional trajectory search that looks for similar trajectories w.r.t. shape or other criteria by using a sample query trajectory, we focus on the goodness of connection provided by a trajectory to the specified query locations. This new query can benefit users in many novel applications such as trip planning.   In our work, we firstly define a new similarity function for measuring how well a trajectory connects the query locations, with both spatial distance and order constraint being considered. Upon the observation that the number of query locations is normally small (e.g. 10 or less) since it is impractical for a user to input too many locations, we analyze the feasibility of using a general-purpose spatial index to achieve efficient  k -BCT search, based on a simple  Incremental k-NN based Algorithm  (IKNN). The IKNN effectively prunes and refines trajectories by using the devised lower bound and upper bound of similarity. Our contributions mainly lie in adapting the  best-first  and  depth-first k -NN algorithms to the basic IKNN properly, and more importantly ensuring the efficiency in both search effort and memory usage. An in-depth study on the adaption and its efficiency is provided. Further optimization is also presented to accelerate the IKNN algorithm. Finally, we verify the efficiency of the algorithm by extensive experiments.", "citation": "Citations (183)", "year": "2010", "departments": ["University of Queensland", "University of Queensland", "University of Queensland", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Zaiben Chen.....http://dblp.org/pers/hd/c/Chen:Zaiben", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang", "Yu Zheng.....http://dblp.org/pers/hd/z/Zheng_0004:Yu", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing"], "pages": 12}