{"title": "Topology Control for Effective Interference Cancellation in Multi-User MIMO Networks.", "fields": ["topology control", "multi user mimo", "single antenna interference cancellation", "mimo", "small number"], "abstract": "In Multi-User MIMO networks, receivers decode multiple concurrent signals using Successive Interference Cancellation (SIC). With SIC a weak target signal can be deciphered in the presence of stronger interfering signals. However, this is only feasible if each strong interfering signal satisfies a signal-to-noise-plus-interference ratio (SINR) requirement. This necessitates the appropriate selection of a subset of links that can be concurrently active in each receiver's neighborhood; in other words, a sub-topology consisting of links that can be simultaneously active in the network is to be formed. If the selected sub-topologies are of small size, the delay between the transmission opportunities on a link increases. Thus, care should be taken to form a limited number of sub-topologies. We find that the problem of constructing the minimum number of sub-topologies such that SIC decoding is successful with a desired probability threshold, is NP-hard. Given this, we propose MUSIC, a framework that greedily forms and activates sub-topologies, in a way that favors successful SIC decoding with a high probability. MUSIC also ensures that the number of selected sub-topologies is kept small. We provide both a centralized and a distributed version of our framework. We prove that our centralized version approximates the optimal solution for the considered problem. We also perform extensive simulations to demonstrate that (i) MUSIC forms a small number of sub-topologies that enable efficient SIC operations; the number of sub-topologies formed is at most 17% larger than the optimum number of topologies, discovered through exhaustive search (in small networks). (ii) MUSIC outperforms approaches that simply consider the number of antennas as a measure for determining the links that can be simultaneously active. Specifically, MUSIC provides throughput improvements of up to 4 times, as compared to such an approach, in various topological settings. The improvements can be directly attributable to a significantly higher probability of correct SIC based decoding with MUSIC.", "citation": "Citations (15)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "authors": ["Ece Gelal.....http://dblp.org/pers/hd/g/Gelal:Ece", "Konstantinos Pelechrinis.....http://dblp.org/pers/hd/p/Pelechrinis:Konstantinos", "Tae-Suk Kim.....http://dblp.org/pers/hd/k/Kim:Tae=Suk", "Ioannis Broustis.....http://dblp.org/pers/hd/b/Broustis:Ioannis", "Srikanth V. Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Srikanth_V=", "Bhaskar Rao.....http://dblp.org/pers/hd/r/Rao:Bhaskar"], "conf": "infocom", "year": "2010", "pages": 9}