{"title": "Probabilistic Distance-Based Arbitration: Providing Equality of Service for Many-Core CMPs.", "fields": ["arbitration", "latency", "differentiated service", "arbiter", "point to point", "virtual channel", "probabilistic logic"], "abstract": "Emerging many-core chip multiprocessors will integrate dozens of small processing cores with an on-chip interconnect consisting of point-to-point links. The interconnect enables the processing cores to not only communicate, but to share common resources such as main memory resources and I/O controllers. In this work, we propose an arbitration scheme to enable equality of service (EoS) in access to a chip’s shared resources. That is, we seek to remove any bias in a core’s access to a shared resource based on its location in the CMP. We propose using probabilistic arbitration combined with distance-based weights to achieve EoS and overcome the limitation of conventional round-robin arbiter. We describe how nonlinear weights need to be used with probabilistic arbiters and propose three different arbitration weight metrics – fixed weight, constantly increasing weight, and variably increasing weight. By only modifying the arbitration of an on-chip router, we do not require any additional buffers or virtual channels and create a simple, low-cost mechanism for achieving EoS. We evaluate our arbitration scheme across a wide range of traffic patterns. In addition to providing EoS, the proposed arbitration has additional benefits which include providing quality-of-service features (such as differentiated service) and providing fairness in terms of both throughput and latency that approaches the global fairness achieved with age-base arbitration – thus, providing a more stable network by achieving high sustained throughput beyond saturation.", "citation": "Not cited", "departments": ["KAIST", "KAIST", "Cray", "Google", "Princeton University"], "authors": ["Michael Mihn-Jong Lee.....http://dblp.org/pers/hd/l/Lee:Michael_Mihn=Jong", "John Kim.....http://dblp.org/pers/hd/k/Kim:John", "Dennis Abts.....http://dblp.org/pers/hd/a/Abts:Dennis", "Michael R. Marty.....http://dblp.org/pers/hd/m/Marty:Michael_R=", "Jae W. Lee.....http://dblp.org/pers/hd/l/Lee:Jae_W="], "conf": "micro", "year": "2010", "pages": 11}