{"title": "Cognitive Mobile Virtual Network Operator: Investment and Pricing with Supply Uncertainty.", "fields": ["cognitive radio", "mobile radio", "virtual network", "channel", "stackelberg competition"], "abstract": "This paper presents the first analytical study of optimal investment and pricing decisions of a cognitive mobile virtual network operator (C-MVNO) under spectrum supply uncertainty. Compared with a traditional MVNO who only obtains spectrum by long-term leasing contracts, a C-MVNO can acquire short-term spectrum by both sensing the empty \"spectrum holes\" of licensed bands and dynamically leasing from the spectrum owner. As a result, a C-MVNO can make flexible investment and pricing decisions to match the current demands of the secondary unlicensed users. Spectrum sensing is typically cheaper than dynamic spectrum leasing, but the obtained useful spectrum amount is random due to primary licensed users' stochastic traffic. The CMVNO needs to determine the optimal amounts of sensing and leasing spectrum, considering the trade-offs between cost and uncertainty. The C-MVNO also needs to determine the optimal retail price to sell the spectrum to the secondary unlicensed users, taking into account wireless heterogeneity of users such as different maximum transmission power levels and channel gains. We model and analyze these decisions and the interactions between the C-MVNO and secondary users as a multi-stage Stackelberg game. We show several interesting properties of the network equilibrium, such as threshold structures of the optimal investment and pricing decisions, independence between the optimal price and users' wireless characteristics, and fair and predictable spectrum allocations to the users. Compared with the traditional MVNO, spectrum sensing can significantly improve the C-MVNO's expected profit and users' payoffs.", "citation": "Citations (83)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "City University of Hong Kong"], "authors": ["Lingjie Duan.....http://dblp.org/pers/hd/d/Duan:Lingjie", "Jianwei Huang.....http://dblp.org/pers/hd/h/Huang:Jianwei", "Biying Shou.....http://dblp.org/pers/hd/s/Shou:Biying"], "conf": "infocom", "year": "2010", "pages": 9}