{"title": "Pareto discriminant analysis.", "fields": ["fuzzy classification", "multiclass classification", "zipf s law", "rank", "dimensionality reduction", "pairwise comparison", "software metric", "design of experiments", "sparse pca", "discriminant", "kullback leibler divergence", "linear discriminant analysis", "software project management", "decision tree learning", "expected value", "pareto distribution", "ranging", "critical value", "demographics", "regularization", "discriminative model", "optimal discriminant analysis", "small number", "pareto principle", "software development", "training set", "mutually exclusive events", "machine learning", "sequential analysis", "primate city"], "abstract": "Linear Discriminant Analysis (LDA) is a popular tool for multiclass discriminative dimensionality reduction. However, LDA suffers from two major problems: (1) It only optimizes the Bayes error for the case of unimodal Gaussian classes with equal covariances (assuming full rank matrices) and, (2) The multiclass extension maximizes the sum of pairwise distances between the classes, and does not “simultaneously” maximize each pairwise distance between the classes. This typically results in serious overlapping in the projected space between classes that are “close” in the input space. To solve these two problems, this paper proposes Pareto Discriminant Analysis (PARDA). Firstly, PARDA explicitly models each of the classes as a multidimensional Gaussian with a sample covariance. Secondly, PARDA decomposes the multiclass problem to a set of pairwise objective functions representing the pairwise distance between different classes. Unlike existing extensions of Fisher discriminant analysis (FDA) to multiclass problems, that typically maximize the sum of pairwise distances between classes, PARDA simultaneously maximizes each pairwise distance, thus encouraging the case that all classes are equidistant from each other in the lower dimensional space. Solving PARDA is a multiobjective optimization problem – simultaneously optimizing more than one, possibly conflicting, objective functions – and the resulting solution is known to be “Pareto Optimal”. Experimental results on synthetic data, several image data sets and data sets from the UCI repository show positive and encouraging results in favor of PARDA when compared with standard and state-of-the-art multiclass extensions of LDA.", "citation": "Not cited", "year": "2010", "departments": ["McGill University", "Carnegie Mellon University", "McGill University", "Carnegie Mellon University", "Carnegie Mellon University", "Berry College", "University of Alberta", "Carnegie Mellon University", "McGill University", "Pontifical Catholic University of Rio de Janeiro", "Universidade Federal de Santa Maria", "Federal University of Bahia", "Federal University of Rio de Janeiro", "Chinese Academy of Sciences", "University of Nebraska Omaha", "Chinese Academy of Sciences", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "Chinese Academy of Sciences", "Alcatel-Lucent"], "conf": "cvpr", "authors": ["Karim T. Abou-Moustafa.....http://dblp.org/pers/hd/a/Abou=Moustafa:Karim_T=", "Fernando De la Torre.....http://dblp.org/pers/hd/t/Torre:Fernando_De_la", "Frank P. Ferrie.....http://dblp.org/pers/hd/f/Ferrie:Frank_P="], "pages": 8}