{"title": "Connected substructure similarity search.", "fields": ["modular decomposition", "substructure", "graph database", "exploit", "nearest neighbor search"], "abstract": "Substructure similarity search is to retrieve graphs that approximately contain a given query graph. It has many applications, e.g., detecting similar functions among chemical compounds. The problem is challenging as even testing subgraph containment between two graphs is NP-complete. Hence, existing techniques adopt the filtering-and-verification framework with the focus on developing effective and efficient techniques to remove non-promising graphs.   Nevertheless, existing filtering techniques may be still unable to effectively remove many \"low\" quality candidates. To resolve this, in this paper we propose a novel indexing technique, GrafD-Index, to index graphs according to their \"distances\" to features. We characterize a tight condition under which the distance-based triangular inequality holds. We then develop lower and upper bounding techniques that exploit the GrafD-Index to (1) prune non-promising graphs and (2) include graphs whose similarities are guaranteed to exceed the given similarity threshold. Considering that the verification phase is not well studied and plays the dominant role in the whole process, we devise efficient algorithms to verify candidates. A comprehensive experiment using real datasets demonstrates that our proposed methods significantly outperform existing methods.", "citation": "Citations (55)", "year": "2010", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "The Chinese University of Hong Kong", "University of New South Wales"], "conf": "sigmod", "authors": ["Haichuan Shang.....http://dblp.org/pers/hd/s/Shang:Haichuan", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0011:Wei"], "pages": 12}