{"title": "Boosting spatial pruning: on optimal pruning of MBRs.", "fields": ["minimum bounding rectangle", "machine learning", "pruning", "boosting"], "abstract": "Fast query processing of complex objects, e.g. spatial or uncertain objects, depends on efficient spatial pruning of objects' approximations, which are typically minimum bounding rectangles (MBRs). In this paper, we propose a novel effective and efficient criterion to determine the spatial topology between multi-dimensional rectangles. Given three rectangles  R ,  A , and  B , in a multi-dimensional space, the task is to determine whether  A , is definitely closer to  R , than  B . This  domination  relation is used in many applications to perform spatial pruning. Traditional techniques apply spatial pruning based on minimal and maximal distance. These techniques however show significant deficiencies in terms of effectivity. We prove that our decision criterion is correct, complete, and efficient to compute even for high dimensional databases. In addition, we tackle the problem of computing the number of objects dominating an object  o . The challenge here is to incorporate objects that only partially dominate  o . In this work we will show how to detect such partial domination topology by using a modified version of our decision criterion. We propose strategies for conservatively and progressively estimating the total number of objects dominating an object. Our experiments show that the new pruning criterion, albeit very general and widely applicable, significantly outperforms current state-of-the-art pruning criteria.", "citation": "Citations (32)", "year": "2010", "departments": ["Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich"], "conf": "sigmod", "authors": ["Tobias Emrich.....http://dblp.org/pers/hd/e/Emrich:Tobias", "Hans-Peter Kriegel.....http://dblp.org/pers/hd/k/Kriegel:Hans=Peter", "Peer Kröger.....http://dblp.org/pers/hd/k/Kr=ouml=ger:Peer", "Matthias Renz.....http://dblp.org/pers/hd/r/Renz:Matthias", "Andreas Züfle.....http://dblp.org/pers/hd/z/Z=uuml=fle:Andreas"], "pages": 12}