{"title": "An Opportunistic Batch Bundle Authentication Scheme for Energy Constrained DTNs.", "fields": ["security service", "overhead", "message authentication code", "bundle", "delay tolerant networking"], "abstract": "Bundle Authentication is a critical security service in Delay Tolerant Networks (DTNs) that ensures authenticity and integrity of bundles during multi-hop transmissions. Public key signatures, which have been suggested in existing bundle security protocol specification, achieve bundle authentication at the cost of an increased computational, transmission overhead and a higher energy consumption, which is not desirable for energy-constrained DTNs. On the other hand, the unique ``store-carry-and-forward'' transmission characteristic of DTNs implies that bundles from distinct/common senders can be buffered opportunistically at some common intermediate nodes. This ``buffering'' characteristic distinguishes DTN from any other traditional wireless networks, for which an intermediate cache is not supported. To exploit such a buffering characteristic, in this paper, we propose an Opportunistic Batch Bundle Authentication Scheme (OBBA) to achieve efficient bundle authentication. The proposed scheme adopts batch verification techniques, allowing a computational overhead to be bounded by the number of opportunistic contacts instead of the number of messages. Furthermore, we introduce a novel concept of a fragment authentication tree to minimize communication cost by choosing an optimal tree height. Finally, we implement OBBA in a specific DTN scenario setting: pocket-switched networks on campus. The simulation results in terms of computation time, transmission overhead and power consumption are given to demonstrate the efficiency and effectiveness of the proposed schemes.", "citation": "Citations (63)", "departments": ["Shanghai Jiao Tong University", "University of Ontario Institute of Technology", "University of Waterloo", "University of Waterloo", "Shanghai Jiao Tong University"], "authors": ["Haojin Zhu.....http://dblp.org/pers/hd/z/Zhu:Haojin", "Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong", "Rongxing Lu.....http://dblp.org/pers/hd/l/Lu:Rongxing", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin", "Dongsheng Xing.....http://dblp.org/pers/hd/x/Xing:Dongsheng", "Zhenfu Cao.....http://dblp.org/pers/hd/c/Cao:Zhenfu"], "conf": "infocom", "year": "2010", "pages": 9}