{"title": "Virtual Appliance Content Distribution for a Global Infrastructure Cloud Service.", "fields": ["virtual appliance", "approximation algorithm", "cache", "schedule", "provisioning"], "abstract": "Cloud Computing in general and Virtualized Infrastructure Provisioning in particular, are significant trends with the potential to increase agility and lower costs of IT. An emerging cloud service is a virtual server shop, that allows cloud customers to order virtual appliances to be delivered virtually on the cloud. Like physical shops, customers want to customize the ordered products, e.g., have them pre-installed with their desired applications and pre-configured. Global cloud providers need to create customized virtual-server disk images and deliver them on time to meet the customer reservations and service level. This framework creates a new flavor of content distribution over the web, where large virtual server images need to be delivered to the target compute farms (either on the global cloud or on customer private clouds). In order to reduce provisioning time and meet reservation deadlines, one approach is to stage images on storage near the customer. This introduces an optimization problem of finding an optimal staging schedule, according to network bandwidth, pending reservations schedule, and customer value. This problem has some similarities to cache pre-filling and production-line scheduling. It combines scheduling, bandwidth considerations, and storage capacity constraints. In this paper we study the fundamental properties of this approach and formalize several flavors of the related optimization problem. We prove useful properties of the problem and then use those properties to provide exact efficient algorithms to solve it. We also derive efficient approximate solutions with proven error bounds.", "citation": "Citations (31)", "departments": ["IBM", "IBM", "IBM", "IBM"], "authors": ["Amir Epstein.....http://dblp.org/pers/hd/e/Epstein:Amir", "Dean H. Lorenz.....http://dblp.org/pers/hd/l/Lorenz:Dean_H=", "Ezra Silvera.....http://dblp.org/pers/hd/s/Silvera:Ezra", "Inbar Shapira.....http://dblp.org/pers/hd/s/Shapira:Inbar"], "conf": "infocom", "year": "2010", "pages": 9}