{"title": "Distributed Caching Algorithms for Content Distribution Networks.", "fields": ["quality of service", "base station", "cache", "edge device", "iptv", "queue", "cache algorithms", "software deployment", "channel"], "abstract": "The delivery of video content is expected to gain huge momentum, fueled by the popularity of user-generated clips, growth of VoD libraries, and wide-spread deployment of IPTV services with features such as CatchUp/PauseLive TV and NPVR capabilities. The `time-shifted' nature of these personalized applications defies the broadcast paradigm underlying conventional TV networks, and increases the overall bandwidth demands by orders of magnitude. Caching strategies provide an effective mechanism for mitigating these massive bandwidth requirements by replicating the most popular content closer to the network edge, rather than storing it in a central site. The reduction in the traffic load lessens the required transport capacity and capital expense, and alleviates performance bottlenecks. In the present paper, we develop light-weight cooperative cache management algorithms aimed at maximizing the traffic volume served from cache and minimizing the bandwidth cost. As a canonical scenario, we focus on a cluster of distributed caches, either connected directly or via a parent node, and formulate the content placement problem as a linear program in order to benchmark the globally optimal performance. Under certain symmetry assumptions, the optimal solution of the linear program is shown to have a rather simple structure. Besides interesting in its own right, the optimal structure offers valuable guidance for the design of low-complexity cache management and replacement algorithms. We establish that the performance of the proposed algorithms is guaranteed to be within a constant factor from the globally optimal performance, with far more benign worst-case ratios than in prior work, even in asymmetric scenarios. Numerical experiments for typical popularity distributions reveal that the actual performance is far better than the worst-case conditions indicate.", "citation": "Not cited", "departments": ["Bell Labs", "Carnegie Mellon University", "Bell Labs"], "authors": ["Sem C. Borst.....http://dblp.org/pers/hd/b/Borst:Sem_C=", "Varun Gupta.....http://dblp.org/pers/hd/g/Gupta:Varun", "Anwar Walid.....http://dblp.org/pers/hd/w/Walid:Anwar"], "conf": "infocom", "year": "2010", "pages": 9}