{"title": "Practical Scheduling Algorithms for Concurrent Transmissions in Rate-adaptive Wireless Networks.", "fields": ["genetic algorithm scheduling", "fixed priority pre emptive scheduling", "round robin scheduling", "lottery scheduling", "maximum throughput scheduling"], "abstract": "Optimal scheduling for concurrent transmissions in rate-nonadaptive wireless networks is NP-hard. Optimal scheduling in rate-adaptive wireless networks is even more difficult, because, due to mutual interference, each flow's throughput in a time slot is unknown before the scheduling decision of that slot is finalized. The capacity bound derived for rate-nonadaptive networks is no longer applicable either. In this paper, we first formulate the optimal scheduling problems with and without minimum per-flow throughput constraints. Given the hardness of the problems and the fact that the scheduling decisions should be made within a few milliseconds, we propose two simple yet effective searching algorithms which can quickly move towards better scheduling decisions. Thus, the proposed scheduling algorithms can achieve high network throughput and maintain long-term fairness among competing flows with low computational complexity. For the constrained optimization problem involved, we consider its dual problem and apply Lagrangian relaxation. We then incorporate a dual update procedure in the proposed searching algorithm to ensure that the searching results satisfy the constraints. Extensive simulations are conducted to demonstrate the effectiveness and efficiency of the proposed scheduling algorithms which are found to achieve throughputs close to the exhaustive searching results with much lower computational complexity.", "citation": "Citations (16)", "departments": ["University of Victoria", "University of Victoria", "University of Victoria"], "authors": ["Zhe Yang.....http://dblp.org/pers/hd/y/Yang:Zhe", "Lin Cai.....http://dblp.org/pers/hd/c/Cai_0001:Lin", "Wu-Sheng Lu.....http://dblp.org/pers/hd/l/Lu:Wu=Sheng"], "conf": "infocom", "year": "2010", "pages": 9}