{"title": "The NICE discussion room: integrating paper and digital media to support co-located group meetings.", "fields": ["digital media", "content creation", "usability", "multi user", "nice"], "abstract": "Current technological solutions that enable content creation and sharing during group discussion meetings are often cumbersome to use, and are commonly abandoned for traditional paper-based tools, which provide flexibility in supporting a wide range of working styles and task activities that may occur in a given meeting. Paper-based tools, however, have their own drawbacks; paper-based content is difficult to modify or replicate. We introduce a novel digital meeting room design, the NiCE Discussion Room, which integrates digital and paper tools into a cohesive system with an intuitive pen-based interface. The combination of digital and paper media provides groups with a flexible design solution that enables them to create, access, and share information and media from a variety of sources to facilitate group discussions. This paper describes the design solution, along with results from a user study conducted to evaluate the usability and utility of the system.", "citation": "Citations (127)", "departments": ["University of Waterloo", "University of Waterloo", "Upper Austria U ... enberg, Austria", "Upper Austria U ... enberg, Austria", "Upper Austria U ... enberg, Austria"], "authors": ["Michael Haller.....http://dblp.org/pers/hd/h/Haller:Michael", "Jakob Leitner.....http://dblp.org/pers/hd/l/Leitner:Jakob", "Thomas Seifried.....http://dblp.org/pers/hd/s/Seifried:Thomas", "James R. Wallace.....http://dblp.org/pers/hd/w/Wallace:James_R=", "Stacey D. Scott.....http://dblp.org/pers/hd/s/Scott:Stacey_D=", "Christoph Richter.....http://dblp.org/pers/hd/r/Richter:Christoph", "Peter Brandl.....http://dblp.org/pers/hd/b/Brandl:Peter", "Adam Gokcezade.....http://dblp.org/pers/hd/g/Gokcezade:Adam", "Seth E. Hunter.....http://dblp.org/pers/hd/h/Hunter:Seth_E="], "conf": "chi", "year": "2010", "pages": 10}