{"title": "Learning to photograph.", "fields": ["prior probability", "digital media", "digital photography", "ranking", "spatial correlation"], "abstract": "In this paper, we propose an intelligent photography system, which automatically and professionally generates/recommends user-favorite photo(s) from a wide view or a continuous view sequence. This task is quite challenging given that the evaluation of photo quality is under-determined and usually subjective. Motivated by the recent prevalence of online media, we present a solution y mining the underlying knowledge and experience of the photographers from massively crawled professional photos (about 100,000 images, which are highly ranked by users) of those popular photo sharing websites, e.g. Flickr.com. Generally far contexts are critical in characterizing the composition rules for professional photos, and thus we present a method called omni-range context modeling to learn the patch/object spatial correlation distribution for the concurrent patch/object pair of arbitrary distance. The learned photo omni-range context priors then serve as rules to guide the composition of professional photos. When a wide view is fed into the system, these priors are utilized together with other cues (e.g., placements of faces at different poses, patch number, etc) to form a posterior probability formulation for professional sub-view finding. Moreover, this system can function as intelligent professionalview guider based on real-time view quality assessment and the embedded compass (for recording capture direction). Beyond the salient areas targeted by most existing view recommendation algorithms, the proposed system targets at professional photo composition. Qualitative experiments as well as comprehensive user studies well demonstrate the validity and efficiency of the proposed omnirange context learning method as well as the automatic view finding framework.", "citation": "Citations (83)", "departments": ["University of Texas at San Antonio", "NUS, Singapore, Singapore", "NUS, Singapore, Singapore", "NUS, Singapore, Singapore"], "authors": ["Bin Cheng.....http://dblp.org/pers/hd/c/Cheng_0001:Bin", "Bingbing Ni.....http://dblp.org/pers/hd/n/Ni:Bingbing", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "conf": "mm", "year": "2010", "pages": 10}