{"title": "Semantic context modeling with maximal margin Conditional Random Fields for automatic image annotation.", "fields": ["semantic computing", "contextual image classification", "discriminative model", "hinge loss", "automatic image annotation"], "abstract": "Context modeling for Vision Recognition and Automatic Image Annotation (AIA) has attracted increasing attentions in recent years. For various contextual information and resources, semantic context has been exploited in AIA and brings promising results. However, previous works either casted the problem into structural classification or adopted multi-layer modeling, which suffer from the problems of scalability or model efficiency. In this paper, we propose a novel discriminative Conditional Random Field (CRF) model for semantic context modeling in AIA, which is built over semantic concepts and treats an image as a whole observation without segmentation. Our model captures the interactions between semantic concepts from both semantic level and visual level in an integrated manner. Specifically, we employ graph structure to model contextual relationships between semantic concepts. The potential functions are designed based on linear discriminative models, which enables us to propose a novel decoupled hinge loss function for maximal margin parameter estimation. We train the model by solving a set of independent quadratic programming problems with our derived contextual kernel. The experiments are conducted on commonly used benchmarks: Corel and TRECVID data sets for evaluation. The experimental results show that compared with the state-of-the-art methods, our method achieves significant improvement on annotation performance.", "citation": "Citations (29)", "year": "2010", "departments": ["Fudan University", "Fudan University", "Fudan University", "National University of Singapore", "City University ... HongKong, China"], "conf": "cvpr", "authors": ["Yu Xiang.....http://dblp.org/pers/hd/x/Xiang:Yu", "Xiangdong Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiangdong", "Zuotao Liu.....http://dblp.org/pers/hd/l/Liu:Zuotao", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah"], "pages": 8}