{"title": "Scheduling support for transactional memory contention management.", "fields": ["transactional memory", "distributed memory", "atomicity", "thread", "transaction processing"], "abstract": "Transactional Memory (TM) is considered as one of the most promising paradigms for developing concurrent applications. TM has been shown to scale well on >multiple cores when the data access pattern behaves \"well,\" i.e., when few conflicts are induced. In contrast, data patterns with frequent write sharing, with long transactions, or when many threads contend for a smaller number of cores, result in numerous conflicts. Until recently, TM implementations had little control of transactional threads, which remained under the supervision of the kernel's transaction-ignorant scheduler. Conflicts are thus traditionally resolved by consulting an STM-level  contention manager . Consequently, the contention managers of these \"conventional\" TM implementations suffer from a lack of precision and often fail to ensure reasonable performance in high-contention workloads.   Recently, scheduling-based TM contention-management has been proposed for increasing TM efficiency under high-contention [2, 5, 19]. However, only user-level schedulers have been considered. In this work, we propose, implement and evaluate several novel kernel-level scheduling support mechanisms for TM contention management. We also investigate different strategies for efficient communication between the kernel and the user-level TM library. To the best of our knowledge, our work is the first to investigate kernel-level support for TM contention management.   We have introduced kernel-level TM scheduling support into both the Linux and Solaris kernels. Our experimental evaluation demonstrates that lightweight kernel-level scheduling support significantly reduces the number of aborts while improving transaction throughput on various workloads.", "citation": "Citations (72)", "year": "2010", "departments": ["University of Neuchâtel", "University of Neuchâtel", "University of Neuchâtel", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev"], "conf": "ppopp", "authors": ["Walther Maldonado.....http://dblp.org/pers/hd/m/Maldonado:Walther", "Patrick Marlier.....http://dblp.org/pers/hd/m/Marlier:Patrick", "Pascal Felber.....http://dblp.org/pers/hd/f/Felber:Pascal", "Adi Suissa.....http://dblp.org/pers/hd/s/Suissa:Adi", "Danny Hendler.....http://dblp.org/pers/hd/h/Hendler:Danny", "Alexandra Fedorova.....http://dblp.org/pers/hd/f/Fedorova:Alexandra", "Julia L. Lawall.....http://dblp.org/pers/hd/l/Lawall:Julia_L=", "Gilles Muller.....http://dblp.org/pers/hd/m/Muller:Gilles"], "pages": 12}