{"title": "Rapid and accurate developmental stage recognition of C. elegans from high-throughput image data.", "fields": ["local consistency", "contextual image classification", "throughput", "evaluation function", "image segmentation"], "abstract": "We present a hierarchical principle for object recognition and its application to automatically classify developmental stages of C. elegans animals from a population of mixed stages. The object recognition machine consists of four hierarchical layers, each composed of units upon which evaluation functions output a label score, followed by a grouping mechanism that resolves ambiguities in the score by imposing local consistency constraints. Each layer then outputs groups of units, from which the units of the next layer are derived. Using this hierarchical principle, the machine builds up successively more sophisticated representations of the objects to be classified. The algorithm segments large and small objects, decomposes objects into parts, extracts features from these parts, and classifies them by SVM. We are using this system to analyze phenotypic data from C. elegans high-throughput genetic screens, and our system overcomes a previous bottleneck in image analysis by achieving near real-time scoring of image data. The system is in current use in a functioning C. elegans laboratory and has processed over two hundred thousand images for lab users.", "citation": "Citations (7)", "year": "2010", "departments": ["New York University", "New York University", "New York University", "New York University", "New York University"], "conf": "cvpr", "authors": ["Amelia G. White.....http://dblp.org/pers/hd/w/White:Amelia_G=", "Patricia G. Cipriani.....http://dblp.org/pers/hd/c/Cipriani:Patricia_G=", "Huey-Ling Kao.....http://dblp.org/pers/hd/k/Kao:Huey=Ling", "Brandon Lees.....http://dblp.org/pers/hd/l/Lees:Brandon", "Davi Geiger.....http://dblp.org/pers/hd/g/Geiger:Davi", "Eduardo Sontag.....http://dblp.org/pers/hd/s/Sontag:Eduardo", "Kristin C. Gunsalus.....http://dblp.org/pers/hd/g/Gunsalus:Kristin_C=", "Fabio Piano.....http://dblp.org/pers/hd/p/Piano:Fabio"], "pages": 8}