{"title": "Key Recovery Attacks of Practical Complexity on AES-256 Variants with up to 10 Rounds.", "fields": ["advanced encryption standard", "key", "block cipher", "brute force search", "related key attack"], "abstract": "AES is the best known and most widely used block cipher. Its three versions (AES-128, AES-192, and AES-256) differ in their key sizes (128 bits, 192 bits and 256 bits) and in their number of rounds (10, 12, and 14, respectively). While for AES-128, there are no known attacks faster than exhaustive search, AES-192 and AES-256 were recently shown to be breakable by attacks which require 2176 and 299.5 time, respectively. While these complexities are much faster than exhaustive search, they are completely non-practical, and do not seem to pose any real threat to the security of AES-based systems.\n\nIn this paper we aim to increase our understanding of AES security, and we concentrate on attacks with practical complexity, i.e., attacks that can be experimentally verified. We show attacks on reduced-round variants of AES-256 with up to 10 rounds with complexity which is feasible. One of our attacks uses only two related keys and 239 time to recover the complete 256-bit key of a 9-round version of AES-256 (the best previous attack on this variant required 4 related keys and 2120 time). Another attack can break a 10-round version of AES-256 in 245 time, but it uses a stronger type of related subkey attack (the best previous attack on this variant required 64 related keys and 2172 time). While the full AES-256 cannot be directly broken by these attacks, the fact that 10 rounds can be broken with such a low complexity raises serious concerns about the remaining safety margin offered by AES-256.", "citation": "Citations (182)", "year": "2010", "departments": ["University of Luxembourg", "École Normale Supérieure", "Hebrew University of Jerusalem", "University of Luxembourg", "Weizmann Institute of Science"], "conf": "eurocrypt", "authors": ["Alex Biryukov.....http://dblp.org/pers/hd/b/Biryukov:Alex", "Orr Dunkelman.....http://dblp.org/pers/hd/d/Dunkelman:Orr", "Nathan Keller.....http://dblp.org/pers/hd/k/Keller:Nathan", "Dmitry Khovratovich.....http://dblp.org/pers/hd/k/Khovratovich:Dmitry", "Adi Shamir.....http://dblp.org/pers/hd/s/Shamir:Adi"], "pages": 21}