{"title": "HydraFS: A High-Throughput File System for the HYDRAstor Content-Addressable Storage System.", "fields": ["file system", "content addressable storage", "self certifying file system", "block", "file system fragmentation"], "abstract": "A content-addressable storage (CAS) system is a valuable tool for building storage solutions, providing efficiency by automatically detecting and eliminating duplicate blocks; it can also be capable of high throughput, at least for streaming access. However, the absence of a standardized API is a barrier to the use of CAS for existing applications. Additionally, applications would have to deal with the unique characteristics of CAS, such as immutability of blocks and high latency of operations. An attractive alternative is to build a file system on top of CAS, since applications can use its interface without modification.\n\nMapping a file system onto a CAS system efficiently, so as to obtain high duplicate elimination and high throughput, requires a very different design than for a traditional disk subsystem. In this paper, we present the design, implementation, and evaluation of HydraFS, a file system built on top of HYDRAstor, a scalable, distributed, content-addressable block storage system. HydraFS provides high-performance reads and writes for streaming access, achieving 82-100% of the HYDRAstor throughput, while maintaining high duplicate elimination.", "citation": "Citations (152)", "departments": ["NEC Laboratories America", "NEC Laboratories America", "NEC Laboratories America", "NEC Laboratories America", "NEC Laboratories America"], "authors": ["Cristian Ungureanu.....http://dblp.org/pers/hd/u/Ungureanu:Cristian", "Benjamin Atkin.....http://dblp.org/pers/hd/a/Atkin:Benjamin", "Akshat Aranya.....http://dblp.org/pers/hd/a/Aranya:Akshat", "Salil Gokhale.....http://dblp.org/pers/hd/g/Gokhale:Salil", "Stephen Rago.....http://dblp.org/pers/hd/r/Rago:Stephen", "Grzegorz Calkowski.....http://dblp.org/pers/hd/c/Calkowski:Grzegorz", "Cezary Dubnicki.....http://dblp.org/pers/hd/d/Dubnicki:Cezary", "Aniruddha Bohra.....http://dblp.org/pers/hd/b/Bohra:Aniruddha"], "conf": "fast", "year": "2010", "pages": 14}