{"title": "Non-uniform deblurring for shaken images.", "fields": ["image restoration", "special case", "motion blur", "deblurring", "blind deconvolution"], "abstract": "Photographs taken in low-light conditions are often blurry as a result of camera shake, i.e. a motion of the camera while its shutter is open. Most existing deblurring methods model the observed blurry image as the convolution of a sharp image with a uniform blur kernel. However, we show that blur from camera shake is in general mostly due to the 3D rotation of the camera, resulting in a blur that can be significantly non-uniform across the image. We propose a new parametrized geometric model of the blurring process in terms of the rotational motion of the camera during exposure. This model is able to capture non-uniform blur in an image due to camera shake using a single global descriptor, and can be substituted into existing deblurring algorithms with only small modifications. To demonstrate its effectiveness, we apply this model to two deblurring problems; first, the case where a single blurry image is available, for which we examine both an approximate marginalization approach and a maximum a posteriori approach, and second, the case where a sharp but noisy image of the scene is available in addition to the blurry image. We show that our approach makes it possible to model and remove a wider class of blurs than previous approaches, including uniform blur as a special case, and demonstrate its effectiveness with experiments on synthetic and real images.", "citation": "Citations (483)", "year": "2010", "departments": ["École Normale Supérieure", "École Normale Supérieure", "University of Oxford", "École Normale Supérieure", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "University of Oxford", "École Normale Supérieure"], "conf": "cvpr", "authors": ["Oliver Whyte.....http://dblp.org/pers/hd/w/Whyte:Oliver", "Josef Sivic.....http://dblp.org/pers/hd/s/Sivic:Josef", "Andrew Zisserman.....http://dblp.org/pers/hd/z/Zisserman:Andrew", "Jean Ponce.....http://dblp.org/pers/hd/p/Ponce:Jean"], "pages": 8}