{"title": "Dyson: An Architecture for Extensible Wireless LANs.", "fields": ["software architecture", "controller", "software deployment", "testbed", "scripting language"], "abstract": "Dyson is a new software architecture for building customizable WLANs. While research in wireless networks has made great strides, these advancements have not seen the light of day in real WLAN deployments. One of the key reasons is that today's WLANs are not architected to embrace change. For example, system administrators cannot fine-tune the association policy for their particular environment: an administrator may know certain nodes in certain locations interfere with each other and cause a severe degradation in throughput, and hence, such associations must be avoided in the particular deployment. Dyson defines a set of APIs that allow clients and APs to send pertinent information such as radio channel conditions to a central controller. The central controller processes this information, to form a global view of the network. This global view, combined with historical information about spatial and temporal usage patterns, allows the central controller enact a rich set of policies to control the network's behavior. Dyson provides a Python-based scripting API that allows the central controller's policies to be extended for site-specific customizations and new optimizations that leverage historical knowledge. We have built a prototype implementation of Dyson, which currently runs on a 28-node testbed distributed across one floor of a typical academic building. Using this testbed, we examine various aspects of the architecture in detail, and demonstrate the ease of implementing a wide range of policies. Using Dyson, we demonstrate optimizing associations, handling VoIP clients, reserving airtime for specific users, and optimizing handoffs for mobile clients.", "citation": "Citations (83)", "departments": ["Harvard University", "Microsoft", "Microsoft", "Harvard University"], "authors": ["Rohan Murty.....http://dblp.org/pers/hd/m/Murty:Rohan", "Jitendra Padhye.....http://dblp.org/pers/hd/p/Padhye:Jitendra", "Alec Wolman.....http://dblp.org/pers/hd/w/Wolman:Alec", "Matt Welsh.....http://dblp.org/pers/hd/w/Welsh:Matt"], "conf": "usenix", "year": "2010", "pages": -1}