{"title": "iCoseg: Interactive co-segmentation with intelligent scribble guidance.", "fields": ["recommender system", "minification", "scribble", "image segmentation", "user in the loop"], "abstract": "This paper presents an algorithm for Interactive Co-segmentation of a foreground object from a group of related images. While previous approaches focus on unsupervised co-segmentation, we use successful ideas from the interactive object-cutout literature. We develop an algorithm that allows users to decide what foreground is, and then guide the output of the co-segmentation algorithm towards it via scribbles. Interestingly, keeping a user in the loop leads to simpler and highly parallelizable energy functions, allowing us to work with significantly more images per group. However, unlike the interactive single image counterpart, a user cannot be expected to exhaustively examine all cutouts (from tens of images) returned by the system to make corrections. Hence, we propose iCoseg, an automatic recommendation system that intelligently recommends where the user should scribble next. We introduce and make publicly available the largest co-segmentation datasetyet, the CMU-Cornell iCoseg Dataset, with 38 groups, 643 images, and pixelwise hand-annotated groundtruth. Through machine experiments and real user studies with our developed interface, we show that iCoseg can intelligently recommend regions to scribble on, and users following these recommendations can achieve good quality cutouts with significantly lower time and effort than exhaustively examining all cutouts.", "citation": "Citations (382)", "year": "2010", "departments": ["Carnegie Mellon University", "Cornell University", "Toyota Technological Institute at Chicago", "Eastman Kodak Company", "Cornell University"], "conf": "cvpr", "authors": ["Dhruv Batra.....http://dblp.org/pers/hd/b/Batra:Dhruv", "Adarsh Kowdle.....http://dblp.org/pers/hd/k/Kowdle:Adarsh", "Devi Parikh.....http://dblp.org/pers/hd/p/Parikh:Devi", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo", "Tsuhan Chen.....http://dblp.org/pers/hd/c/Chen:Tsuhan"], "pages": 8}