{"title": "High performance cache replacement using re-reference interval prediction (RRIP).", "fields": ["cache invalidation", "cache algorithms", "adaptive replacement cache", "smart cache", "cache pollution"], "abstract": "Practical cache replacement policies attempt to emulate optimal replacement by predicting the re-reference interval of a cache block. The commonly used LRU replacement policy always predicts a near-immediate re-reference interval on cache hits and misses. Applications that exhibit a distant re-reference interval perform badly under LRU. Such applications usually have a working-set larger than the cache or have frequent bursts of references to non-temporal data (called scans). To improve the performance of such workloads, this paper proposes cache replacement using Re-reference Interval Prediction (RRIP). We propose Static RRIP (SRRIP) that is scan-resistant and Dynamic RRIP (DRRIP) that is both scan-resistant and thrash-resistant. Both RRIP policies require only 2-bits per cache block and easily integrate into existing LRU approximations found in modern processors. Our evaluations using PC games, multimedia, server and SPEC CPU2006 workloads on a single-core processor with a 2MB last-level cache (LLC) show that both SRRIP and DRRIP outperform LRU replacement on the throughput metric by an average of 4% and 10% respectively. Our evaluations with over 1000 multi-programmed workloads on a 4-core CMP with an 8MB shared LLC show that SRRIP and DRRIP outperform LRU replacement on the throughput metric by an average of 7% and 9% respectively. We also show that RRIP outperforms LFU, the state-of the art scan-resistant replacement algorithm to-date. For the cache configurations under study, RRIP requires 2X less hardware than LRU and 2.5X less hardware than LFU.", "citation": "Citations (525)", "year": "2010", "departments": ["Intel", "Intel", "Intel", "Intel"], "conf": "isca", "authors": ["Aamer Jaleel.....http://dblp.org/pers/hd/j/Jaleel:Aamer", "Kevin B. Theobald.....http://dblp.org/pers/hd/t/Theobald:Kevin_B=", "Simon C. Steely Jr......http://dblp.org/pers/hd/s/Steely_Jr=:Simon_C=", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S="], "pages": 12}