{"title": "A shape-driven MRF model for the segmentation of organs in medical images.", "fields": ["segmentation based object categorization", "markov random field", "gibbs free energy", "maximum a posteriori estimation", "scale space segmentation"], "abstract": "In this paper, we present a knowledge-driven Markov Random Field (MRF) model for the segmentation of organs in medical images with particular emphasis on the incorporation of shape constraints into the segmentation problem. We cast the problem of image segmentation as the Maximum A Posteriori (MAP) estimation of a Markov Random Field which, in essence, is equivalent to the minimization of the corresponding Gibbs energy function. We then incorporate a set of constraints into the Gibbs energy function that collectively force the resulting segmentation contour/surface to have a shape similar to that of a given shape template. In particular, we introduce a flux-maximization constraint and a generalized template-based star-shape constraint that are encoded into the first- and second-order clique potentials of the Gibbs energy function, respectively. Our main contribution is in the translation of a set of global notions about the shape of the desired segmentation contour into a set of local measures that can be conveniently encoded into the Gibbs energy function and used in combination with other traditionally used constraints derived from image information. In our experiments, we demonstrate the application of the proposed method to the challenging problem of heart segmentation in non-contrast computed tomography (CT) data.", "citation": "Citations (13)", "year": "2010", "departments": ["University of Houston", "University of Houston", "University of Houston"], "conf": "cvpr", "authors": ["Deepak Roy Chittajallu.....http://dblp.org/pers/hd/c/Chittajallu:Deepak_Roy", "Shishir K. Shah.....http://dblp.org/pers/hd/s/Shah:Shishir_K=", "Ioannis A. Kakadiaris.....http://dblp.org/pers/hd/k/Kakadiaris:Ioannis_A="], "pages": 8}