{"title": "Network Reliability With Geographically Correlated Failures.", "fields": ["geometric probability", "survivability", "reliability", "computer science", "reliability engineering", "network planning and design", "network performance"], "abstract": "Fiber-optic networks are vulnerable to natural disasters, such as tornadoes or earthquakes, as well as to physical failures, such as an anchor cutting underwater fiber cables. Such real-world events occur in specific geographical locations and disrupt specific parts of the network. Therefore, the geography of the network determines the effect of physical events on the network's connectivity and capacity. In this paper, we develop tools to analyze network failures after a `random' geographic disaster. The random location of the disaster allows us to model situations where the physical failures are not targeted attacks. In particular, we consider disasters that take the form of a `random' line in a plane. Using results from geometric probability, we are able to calculate some network performance metrics to such a disaster in polynomial time. In particular, we can evaluate average two-terminal reliability in polynomial time under `random' line-cuts. This is in contrast to the case of independent link failures for which there exists no known polynomial time algorithm to calculate this reliability metric. We also present some numerical results to show the significance of geometry on the survivability of the network and discuss network design in the context of random line-cuts. Our novel approach provides a promising new direction for modeling and designing networks to lessen the effects of geographical disasters or attacks.", "citation": "Citations (169)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Sebastian Neumayer.....http://dblp.org/pers/hd/n/Neumayer:Sebastian", "Eytan Modiano.....http://dblp.org/pers/hd/m/Modiano:Eytan"], "conf": "infocom", "year": "2010", "pages": 9}