{"title": "IBM infosphere streams for scalable, real-time, intelligent transportation services.", "fields": ["stream processing", "infosphere", "point of interest", "extensibility", "intelligent transportation system"], "abstract": "With the widespread adoption of location tracking technologies like GPS, the domain of intelligent transportation services has seen growing interest in the last few years. Services in this domain make use of real-time location-based data from a variety of sources, combine this data with static location-based data such as maps and points of interest databases, and provide useful information to end-users. Some of the major challenges in this domain include i) scalability, in terms of processing large volumes of real-time and static data; ii) extensibility, in terms of being able to add new kinds of analyses on the data rapidly, and iii) user interaction, in terms of being able to support different kinds of one-time and continuous queries from the end-user. In this paper, we demonstrate the use of IBM InfoSphere Streams, a scalable stream processing platform, for tackling these challenges. We describe a prototype system that generates dynamic, multi-faceted views of transportation information for the city of Stockholm, using real vehicle GPS and road-network data. The system also continuously derives current traffic statistics, and provides useful value-added information such as shortest-time routes from real-time observed and inferred traffic conditions. Our performance experiments illustrate the scalability of the system. For instance, our system can process over 120000 incoming GPS points per second, combine it with a map containing over 600,000 links, continuously generate different kinds of traffic statistics and answer user queries.", "citation": "Citations (194)", "year": "2010", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "sigmod", "authors": ["Alain Biem.....http://dblp.org/pers/hd/b/Biem:Alain", "Eric Bouillet.....http://dblp.org/pers/hd/b/Bouillet:Eric", "Hanhua Feng.....http://dblp.org/pers/hd/f/Feng:Hanhua", "Anand Ranganathan.....http://dblp.org/pers/hd/r/Ranganathan:Anand", "Anton Riabov.....http://dblp.org/pers/hd/r/Riabov:Anton", "Olivier Verscheure.....http://dblp.org/pers/hd/v/Verscheure:Olivier", "Haris N. Koutsopoulos.....http://dblp.org/pers/hd/k/Koutsopoulos:Haris_N=", "Carlos Moran.....http://dblp.org/pers/hd/m/Moran:Carlos"], "pages": 12}