{"title": "Graphite: A distributed parallel simulator for multicores.", "fields": ["software development", "posix threads", "speedup", "design space exploration", "address space"], "abstract": "This paper introduces the Graphite open-source distributed parallel multicore simulator infrastructure. Graphite is designed from the ground up for exploration of future multi-core processors containing dozens, hundreds, or even thousands of cores. It provides high performance for fast design space exploration and software development. Several techniques are used to achieve this including: direct execution, seamless multicore and multi-machine distribution, and lax synchronization. Graphite is capable of accelerating simulations by distributing them across multiple commodity Linux machines. When using multiple machines, it provides the illusion of a single process with a single, shared address space, allowing it to run off-the-shelf pthread applications with no source code modification. Our results demonstrate that Graphite can simulate target architectures containing over 1000 cores on ten 8-core servers. Performance scales well as more machines are added with near linear speedup in many cases. Simulation slowdown is as low as 41× versus native execution.", "citation": "Citations (476)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Jason E. Miller.....http://dblp.org/pers/hd/m/Miller:Jason_E=", "Harshad Kasture.....http://dblp.org/pers/hd/k/Kasture:Harshad", "George Kurian.....http://dblp.org/pers/hd/k/Kurian:George", "Charles Gruenwald III.....http://dblp.org/pers/hd/g/Gruenwald_III:Charles", "Nathan Beckmann.....http://dblp.org/pers/hd/b/Beckmann:Nathan", "Christopher Celio.....http://dblp.org/pers/hd/c/Celio:Christopher", "Jonathan Eastep.....http://dblp.org/pers/hd/e/Eastep:Jonathan", "Anant Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Anant"], "conf": "hpca", "year": "2010", "pages": 12}