{"title": "BASIL: Automated IO Load Balancing Across Storage Devices.", "fields": ["hypervisor", "live migration", "virtualization", "disk array", "software system"], "abstract": "Live migration of virtual hard disks between storage arrays has long been possible. However, there is a dearth of online tools to perform automated virtual disk placement and IO load balancing across multiple storage arrays. This problem is quite challenging because the performance of IO workloads depends heavily on their own characteristics and that of the underlying storage device. Moreover, many device-specific details are hidden behind the interface exposed by storage arrays.\n\nIn this paper, we introduce BASIL, a novel software system that automatically manages virtual disk placement and performs load balancing across devices without assuming any support from the storage arrays. BASIL uses IO latency as a primary metric for modeling. Our technique involves separate online modeling of workloads and storage devices. BASIL uses these models to recommend migrations between devices to balance load and improve overall performance.\n\nWe present the design and implementation of BASIL in the context of VMware ESX, a hypervisor-based virtualization system, and demonstrate that the modeling works well for a wide range of workloads and devices. We evaluate the placements recommended by BASIL, and show that they lead to improvements of at least 25% in both latency and throughput for 80 percent of the hundreds of microbenchmark configurations we ran. When tested with enterprise applications, BASIL performed favorably versus human experts, improving latency by 18-27%.", "citation": "Citations (88)", "departments": ["VMware", "VMware", "VMware", "Carnegie Mellon University"], "authors": ["Ajay Gulati.....http://dblp.org/pers/hd/g/Gulati:Ajay", "Chethan Kumar.....http://dblp.org/pers/hd/k/Kumar:Chethan", "Irfan Ahmad.....http://dblp.org/pers/hd/a/Ahmad:Irfan", "Karan Kumar.....http://dblp.org/pers/hd/k/Kumar:Karan"], "conf": "fast", "year": "2010", "pages": 14}