{"title": "An interactive multimedia framework for digital heritage narratives.", "fields": ["dance", "interactive media", "educational institution", "folklore", "storytelling"], "abstract": "The cultural heritage of a region is conveyed by both tangible physical artifacts and intangible aspects in the form of stories, dance styles, rituals, etc. Hitherto, the task of creating digital representations for each of these aspects has been addressed in isolation, i.e. using specific media most suited to the artifact such as video, audio, three-dimensional (3D) models, scanning, etc. The challenge of bringing together these separate elements to create a coherent story, however, has remained unaddressed until recently. In this paper we present a unified digital framework that enables the integration of disparate representations of heritage elements into a holistic entity. Our approach results in a compelling and engaging narration that affords a unified user experience. Our solution supports both active (user-controlled explorations) and passive (watching pre-orchestrated narrations) user interactions.   We demonstrate the capabilities of our framework through a qualitative user study based on two rich interactive narratives built using our framework: (1) history and folklore surrounding a temple in South India, and (2) a historical account of an educational institution also in South India.", "citation": "Citations (13)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Neeharika Adabala.....http://dblp.org/pers/hd/a/Adabala:Neeharika", "Naren Datha.....http://dblp.org/pers/hd/d/Datha:Naren", "Joseph Joy.....http://dblp.org/pers/hd/j/Joy:Joseph", "Chinmay Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni:Chinmay", "Ajay Manchepalli.....http://dblp.org/pers/hd/m/Manchepalli:Ajay", "Aditya Sankar.....http://dblp.org/pers/hd/s/Sankar:Aditya", "Rebecca Walton.....http://dblp.org/pers/hd/w/Walton:Rebecca"], "conf": "mm", "year": "2010", "pages": 4}