{"title": "Delay Tolerant Event Collection in Sensor Networks with Mobile Sink.", "fields": ["exploit", "mobile radio", "communication complexity", "sink", "base station"], "abstract": "We are interested in event collection in a 2D region where sensors are deployed to detect and collect interested events. Using traditional multi-hop routing in wireless sensor networks to report events to a sink node or base station, will result in severe imbalanced energy consumption of static sensors. In addition, full connectivity among all the static sensors may not be possible in some cases since generally the sensors are randomly deployed in the target region. In this paper, we exploit a mobile sensor as the sink node to assist the event collection by controlling the movement of the mobile sink to collect static sensor readings. A key observation of our work is that an event has spatialtemporal correlation. Specifically, the same event can be detected by multiple nearby sensors within a period of time. Thus, it is more energy-efficient if the mobile sink can selectively communicate with only a portion of static sensors, while still collecting all the interested events. In this paper, we discuss the event collection problem by leveraging the mobility of the sink node and the spatial-temporal correlation of the event, in favor of maximizing the network lifetime with a guaranteed event collection rate. We first model the problem as sensor selection problem and show that it could be solved in polynomial time, if global knowledge of events is available and there is no velocity constraints on mobile sink. We also analyze the design of a feasible movement route for mobile sink to minimize the velocity requirements for a practical system. An online scheme is then proposed to relax the assumption about global knowledge of events and we prove that the expected event collection rate can be guaranteed in theory. Through comprehensive simulation on real trace data, we demonstrate that the network lifetime can be significantly extended, comparing to some other schemes.", "citation": "Citations (110)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Xing Xu.....http://dblp.org/pers/hd/x/Xu:Xing", "Ji Luo.....http://dblp.org/pers/hd/l/Luo:Ji", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian"], "conf": "infocom", "year": "2010", "pages": 9}