{"title": "Fidelity-Aware Utilization Control for Cyber-Physical Surveillance Systems.", "fields": ["fidelity", "controller", "cyber physical system", "cpu time", "testbed"], "abstract": "Recent years have seen the growing deployments of Cyber-Physical Systems (CPSs) in many mission-critical applications such as security, civil infrastructure, and transportation. These applications often impose stringent requirements on system sensing fidelity and timeliness. However, existing approaches treat these two concerns in isolation and hence are not suitable for CPSs where system fidelity and timeliness are dependent on each other because of the tight integration of computational and physical resources. In this paper, we propose a holistic approach called Fidelity-Aware Utilization Controller (FAUC) for Wireless Cyber-physical Surveillance (WCS) systems that combine low-end sensors with cameras for large-scale ad hoc surveillance in unplanned environments. By integrating data fusion with feedback control, FAUC can enforce a CPU utilization upper bound to ensure the system's real-time schedulability although CPU workloads vary significantly at runtime because of stochastic detection results. At the same time, FAUC optimizes system fidelity and adjusts the control objective of CPU utilization adaptively in the presence of variations of target/noise characteristics. We have implemented FAUC on a small-scale WCS testbed consisting of TelosB/Iris motes and cameras. Moreover, we conduct extensive simulations based on real acoustic data traces collected in a vehicle surveillance experiment. The testbed experiments and the trace-driven simulations show that FAUC can achieve robust fidelity and real-time guarantees in dynamic environments.", "citation": "Citations (15)", "year": "2010", "departments": ["Michigan State University", "Michigan State University", "Michigan State University", "Ohio State University", "University of Tennessee", "Michigan State University", "Michigan State University", "Michigan State University", "University of Tennessee", "University of Tennessee"], "conf": "rtss", "authors": ["Jinzhu Chen.....http://dblp.org/pers/hd/c/Chen:Jinzhu", "Rui Tan.....http://dblp.org/pers/hd/t/Tan:Rui", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Xiaorui Wang.....http://dblp.org/pers/hd/w/Wang:Xiaorui", "Xing Fu.....http://dblp.org/pers/hd/f/Fu:Xing"], "pages": 10}