{"title": "How do Superpeer Networks Emerge?", "fields": ["peer to peer", "exploit", "preferential attachment", "degree distribution", "bootstrapping"], "abstract": "In this paper, we develop an analytical framework which explains the emergence of superpeer networks on execution of the commercial peer-to-peer bootstrapping protocols by incoming nodes. Bootstrapping protocols exploit physical properties of the online peers like resource content, processing power, storage space, connectivity etc as well as take the finiteness of bandwidth of each online peer into consideration. With the help of rate equations, we show that execution of these protocols results in the emergence of superpeer nodes in the network - the exact degree distribution is evaluated. We validate the framework developed in this paper through extensive simulation. The analysis of the results shows that the amount of superpeers produced in the network depends on the protocol as well as the properties of the joining nodes. Interestingly, our analysis reveals that increase in the amount of resource and the number of resourceful nodes do not always help to increase the fraction of superpeer nodes in the network. The impact of the frequent leaving of the peers on the topology of the emerging network is also evaluated. As an application study, we show that our framework can explain the topological configuration of commercial Gnutella networks. The developed model can almost perfectly match the degree distribution of Gnutella network.", "citation": "Citations (13)", "departments": ["Indian Institute of Technology Kharagpur", "Indian Institute of Technology Kharagpur", "Indian Institute of Technology Kharagpur", "Indian Institute of Technology Kharagpur"], "authors": ["Bivas Mitra.....http://dblp.org/pers/hd/m/Mitra:Bivas", "Abhishek Kumar Dubey.....http://dblp.org/pers/hd/d/Dubey:Abhishek_Kumar", "Sujoy Ghose.....http://dblp.org/pers/hd/g/Ghose:Sujoy", "Niloy Ganguly.....http://dblp.org/pers/hd/g/Ganguly:Niloy"], "conf": "infocom", "year": "2010", "pages": 9}