{"title": "Scalable architecture and query optimization fortransaction-time DBs with evolving schemas.", "fields": ["semi structured model", "star schema", "sargable", "schema migration", "information schema"], "abstract": "The problem of archiving and querying the history of a database is made more complex by the fact that, along with the database content, the database schema also evolves with time. Indeed, archival quality can only be guaranteed by storing past database contents using the schema versions under which they were originally created. This causes major usability and scalability problems in preservation, retrieval and querying of databases with intense evolution histories, i.e., hundreds of schema versions. This scenario is common in web information systems and scientific databases that frequently accumulate that many versions in just a few years. Our system, Archival Information Management System ( AIMS ), solves this usability issue by letting users write queries against a chosen schema version and then performing for the users the rewriting and execution of queries on all appropriate schema versions.  AIMS  achieves scalability by using (i) an advanced storage strategy based on relational technology and attribute-level-timestamping of the history of the database content, (ii) suitable temporal indexing and clustering techniques, and (iii) novel temporal query optimizations. In particular, with  AIMS  we introduce a novel technique called  CoalNesT  that achieves unprecedented performance when temporal coalescing tuples fragmented by schema changes. Extensive experiments show that the performance and scalability thus achieved greatly exceeds those obtained by previous approaches. The  AIMS  technology is easily deployed by plugging into existing DBMS replication technologies, leading to very low overhead; moreover, by decoupling logical and physical layers provides multiple query interfaces, from the basic archive&query features considered in the upcoming SQL standards, to the much richer temporal XML/XQuery capabilities proposed by researchers.", "citation": "Citations (12)", "year": "2010", "departments": ["University of California, Los Angeles", "NEC Labs Americ ... ertino, CA, USA", "Massachusettes  ... bridge, MA, USA"], "conf": "sigmod", "authors": ["Hyun Jin Moon.....http://dblp.org/pers/hd/m/Moon:Hyun_Jin", "Carlo Curino.....http://dblp.org/pers/hd/c/Curino:Carlo", "Carlo Zaniolo.....http://dblp.org/pers/hd/z/Zaniolo:Carlo"], "pages": 12}