{"title": "Gaze awareness and interaction support in presentations.", "fields": ["paralanguage", "grasp", "information visualization", "gaze", "storytelling"], "abstract": "Modern digital presentation systems use rich media to bring highly sophisticated information visualization and highly effective storytelling capabilities to classrooms and corporate boardrooms. In this paper we address a number of issues that arise when the ubiquitous computer-projector setup is used in large venues like the cavernous auditoriums and hotel ballrooms often used in large scale academic meetings and industrial conferences. First, when the presenter is addressing a large audience the slide display needs to be very large and placed high enough so that it is clearly visible from all corners of the room. This makes it impossible for a presenter to walk up to the display and interact with the display with gestures, gaze, and other forms of paralanguage. Second, it is hard for the audience to know which part of the slide the presenter is looking at when he/she has to look the opposite way from the audience while interacting with the slide material. It is also hard for the presenter to see the audience in these cases. Even though there may be video captures of the presenter, slides, and even the audience, the above factors add up to make it very difficult for a user viewing either a live feed or a recording to grasp the interaction between all the components and participants of a presentation. We address these problems with a novel presentation system which creates a live video view that seamlessly combines the presenter and the presented material, capturing all graphical, verbal, and nonverbal channels of communication. The system also allows the local and remote audiences to have highly interactive exchanges with the presenter while creating a comprehensive view for recording or remote streaming.", "citation": "Citations (5)", "departments": ["Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Kar-Han Tan.....http://dblp.org/pers/hd/t/Tan:Kar=Han", "Dan Gelb.....http://dblp.org/pers/hd/g/Gelb:Dan", "Ramin Samadani.....http://dblp.org/pers/hd/s/Samadani:Ramin", "Ian N. Robinson.....http://dblp.org/pers/hd/r/Robinson:Ian_N=", "W. Bruce Culbertson.....http://dblp.org/pers/hd/c/Culbertson:W=_Bruce", "John G. Apostolopoulos.....http://dblp.org/pers/hd/a/Apostolopoulos:John_G="], "conf": "mm", "year": "2010", "pages": 4}