{"title": "Expressive and flexible access to web-extracted data: a keyword-based structured query language.", "fields": ["rdf query language", "search oriented architecture", "web search query", "sargable", "data control language"], "abstract": "Automated extraction of structured data from Web sources often leads to large heterogeneous knowledge bases (KB), with data and schema items numbering in the hundreds of thousands or millions. Formulating information needs with conventional structured query languages is difficult due to the sheer size of schema information available to the user. We address this challenge by proposing a new query language that blends keyword search with structured query processing over large information graphs with rich semantics. Our formalism for structured queries based on keywords combines the flexibility of keyword search with the expressiveness of structures queries.   We propose a solution to the resulting disambiguation problem caused by introducing keywords as primitives in a structured query language. We show how expressions in our proposed language can be rewritten using the vocabulary of the web-extracted KB, and how different possible rewritings can be ranked based on their syntactic relationship to the keywords in the query as well as their semantic coherence in the underlying KB.   An extensive experimental study demonstrates the efficiency and effectiveness of our approach. Additionally, we show how our query language fits into  QUICK , an end-to-end information system that integrates web-extracted data graphs with full-text search. In this system, the rewritten query describes an arbitrary topic of interest for which corresponding entities, and documents relevant to the entities, are efficiently retrieved.", "citation": "Citations (77)", "year": "2010", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo"], "conf": "sigmod", "authors": ["Jeffrey Pound.....http://dblp.org/pers/hd/p/Pound:Jeffrey", "Ihab F. Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Ihab_F=", "Grant E. Weddell.....http://dblp.org/pers/hd/w/Weddell:Grant_E="], "pages": 12}