{"title": "Universal Rigidity: Towards Accurate and Efficient Localization of Wireless Networks.", "fields": ["heuristic", "semidefinite programming", "rigidity", "speedup", "trilateration"], "abstract": "A fundamental problem in wireless ad-hoc and sensor networks is that of determining the positions of nodes. Often, such a problem is complicated by the presence of nodes whose positions cannot be uniquely determined. Most existing work uses the notion of global rigidity from rigidity theory to address the non-uniqueness issue. However, such a notion is not entirely satisfactory, as it has been shown that even if a network localization instance is known to be globally rigid, the problem of determining the node positions is still intractable in general. In this paper, we propose to use the notion of universal rigidity to bridge such disconnect. Although the notion of universal rigidity is more restrictive than that of global rigidity, it captures a large class of networks and is much more relevant to the efficient solvability of the network localization problem. Specifically, we show that both the problem of deciding whether a given network localization instance is universally rigid and the problem of determining the node positions of a universally rigid instance can be solved efficiently using semidefinite programming (SDP). Then, we give various constructions of universally rigid instances. In particular, we show that trilateration graphs are generically universally rigid, thus demonstrating not only the richness of the class of universally rigid instances, but also the fact that trilateration graphs possess much stronger geometric properties than previously known. Finally, we apply our results to design a novel edge sparsification heuristic that can reduce the size of the input network while provably preserving its original localization properties. One of the applications of such heuristic is to speed up existing convex optimization-based localization algorithms. Simulation results show that our speedup approach compares very favorably with existing ones, both in terms of accuracy and computation time.", "citation": "Citations (51)", "departments": ["Stanford University", "The Chinese University of Hong Kong", "Stanford University"], "authors": ["Zhisu Zhu.....http://dblp.org/pers/hd/z/Zhu:Zhisu", "Anthony Man-Cho So.....http://dblp.org/pers/hd/s/So:Anthony_Man=Cho", "Yinyu Ye.....http://dblp.org/pers/hd/y/Ye:Yinyu"], "conf": "infocom", "year": "2010", "pages": 9}