{"title": "An asymmetric distributed shared memory model for heterogeneous parallel systems.", "fields": ["software portability", "logical address", "symmetric multiprocessor system", "memory model", "distributed shared memory"], "abstract": "Heterogeneous computing combines general purpose CPUs with accelerators to efficiently execute both sequential control-intensive and data-parallel phases of applications. Existing programming models for heterogeneous computing rely on programmers to explicitly manage data transfers between the CPU system memory and accelerator memory.   This paper presents a new programming model for heterogeneous computing, called Asymmetric Distributed Shared Memory (ADSM), that maintains a shared logical memory space for CPUs to access objects in the accelerator physical memory but not vice versa. The asymmetry allows light-weight implementations that avoid common pitfalls of symmetrical distributed shared memory systems. ADSM allows programmers to assign data objects to performance critical methods. When a method is selected for accelerator execution, its associated data objects are allocated within the shared logical memory space, which is hosted in the accelerator physical memory and transparently accessible by the methods executed on CPUs.   We argue that ADSM reduces programming efforts for heterogeneous computing systems and enhances application portability. We present a software implementation of ADSM, called GMAC, on top of CUDA in a GNU/Linux environment. We show that applications written in ADSM and running on top of GMAC achieve performance comparable to their counterparts using programmer-managed data transfers. This paper presents the GMAC system and evaluates different design choices. We further suggest additional architectural support that will likely allow GMAC to achieve higher application performance than the current CUDA model.", "citation": "Citations (199)", "year": "2010", "departments": ["Polytechnic University of Catalonia", "University of Illinois at Urbana–Champaign", "Polytechnic University of Catalonia", "University of Illinois at Urbana–Champaign", "Polytechnic University of Catalonia"], "conf": "asplos", "authors": ["Isaac Gelado.....http://dblp.org/pers/hd/g/Gelado:Isaac", "Javier Cabezas.....http://dblp.org/pers/hd/c/Cabezas:Javier", "Nacho Navarro.....http://dblp.org/pers/hd/n/Navarro:Nacho", "John E. Stone.....http://dblp.org/pers/hd/s/Stone:John_E=", "Sanjay J. Patel.....http://dblp.org/pers/hd/p/Patel:Sanjay_J=", "Wen-mei W. Hwu.....http://dblp.org/pers/hd/h/Hwu:Wen=mei_W="], "pages": 12}