{"title": "A Reaction-Diffusion Model for Epidemic Routing in Sparsely Connected MANETs.", "fields": ["unicast", "mobile ad hoc network", "wave model", "probabilistic logic", "mixed model"], "abstract": "We propose and investigate a deterministic traveling wave model for the progress of epidemic routing in disconnected mobile ad hoc networks. In epidemic routing, broadcast or unicast is achieved by exploiting mobility: message-carrying nodes \"infect\" non message-carrying nodes when they come within communication range of them. Early probabilistic analyses of epidemic routing follow a \"well-mixed\" model which ignores the spatial distribution of the infected nodes, and hence do not provide good performance estimates unless the node density is very low. More recent work has pointed out that the infection exhibits wave-like characteristics, but does not provide a detailed model of the wave propagation. In this paper, we model message propagation using a reaction-diffusion partial differential equation that has a traveling wave solution, and show that the performance predictions made by the model closely match simulations in regimes where the well- mixed model breaks down. In particular, we show that well-mixed models are generally overly optimistic in regard to the scaling of the message delivery delay with problem parameters such as communication range, node density, and total area. In contrast to prior work, our model provides insight into the spatial distribution of the \"infection,\" and reveals that the performance is sensitive to the geometry of the deployment region, not just its area.", "citation": "Citations (22)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Daniel J. Klein.....http://dblp.org/pers/hd/k/Klein:Daniel_J=", "João Pedro Hespanha.....http://dblp.org/pers/hd/h/Hespanha:Jo=atilde=o_Pedro", "Upamanyu Madhow.....http://dblp.org/pers/hd/m/Madhow:Upamanyu"], "conf": "infocom", "year": "2010", "pages": 9}