{"title": "Impact of zooming and enhancing region of interests for optimizing user experience on mobile sports video.", "fields": ["subjective video quality", "user experience design", "video quality", "zoom", "pevq"], "abstract": "In mobile videos, small viewing size and bitrate limitation often cause unpleasant viewing experiences, which is particularly important for fast-moving sports videos. For optimizing the overall user experience of viewing sports videos on mobile phones, this paper explores the benefits of emphasizing Region of Interest (ROI) by 1) zooming in and 2) enhancing the quality. The main goal is to measure the effectiveness of these two approaches and determine which one is more effective. To obtain a more comprehensive understanding of the overall user experience, the study considers user's interest in video content and user's acceptance of the perceived video quality, and compares the user experience in sports videos with other content types such as talk shows. The results from a user study with 40 subjects demonstrate that zooming and ROI-enhancement are both effective in improving the overall user experience with talk show and mid-shot soccer videos. However, for the full-shot scenes in soccer videos, only zooming is effective while ROI-enhancement has a negative effect. Moreover, user's interest in video content directly affects not only the user experience and the acceptance of video quality, but also the effect of content type on the user experience. Finally, the overall user experience is closely related to the degree of the acceptance of video quality and the degree of the interest in video content. This study is valuable in exploiting effective approaches to improve user experience, especially in mobile sports video streaming contexts, whereby the available bandwidth is usually low or limited. It also provides further understanding of the influencing factors of user experience.", "citation": "Citations (21)", "departments": ["Faculty of Scie ... bane, Australia", "Faculty of Scie ... bane, Australia", "Faculty of Scie ... bane, Australia", "Faculty of Scie ... bane, Australia"], "authors": ["Wei Song.....http://dblp.org/pers/hd/s/Song_0007:Wei", "Dian Tjondronegoro.....http://dblp.org/pers/hd/t/Tjondronegoro:Dian", "Tony Shu-Hsien Wang.....http://dblp.org/pers/hd/w/Wang:Tony_Shu=Hsien", "Michael J. Docherty.....http://dblp.org/pers/hd/d/Docherty:Michael_J="], "conf": "mm", "year": "2010", "pages": 10}