{"title": "Optimal SINR-based Random Access.", "fields": ["throughput", "global optimization", "random access", "optimal design", "signal to interference plus noise ratio"], "abstract": "Random access protocols, such as Aloha, are commonly modeled in wireless ad-hoc networks by using the protocol model. However, it is well-known that the protocol model is not accurate and particularly it cannot account for aggregate interference from multiple interference sources. In this paper, we use the more accurate physical model, which is based on the signal-to-interference-plus-noise-ratio (SINR), to study optimization-based design in wireless random access systems, where the optimization variables are the transmission probabilities of the users. We focus on throughput maximization, fair resource allocation, and network utility maximization, and show that they entail non-convex optimization problems if the physical model is adopted. We propose two schemes to solve these problems. The first design is centralized and leads to the global optimal solution using a sum-of-squares technique. However, due to its complexity, this approach is only applicable to small-scale networks. The second design is distributed and leads to a close-to-optimal solution using the coordinate ascent method. This approach is applicable to medium-size and large-scale networks. Based on various simulations, we show that it is highly preferable to use the physical model for optimization-based random access design. In this regard, even a sub-optimal design based on the physical model can achieve a significantly better performance than an optimal design based on the inaccurate protocol model.", "citation": "Citations (14)", "departments": ["University of British Columbia", "University of British Columbia", "University of British Columbia"], "authors": ["Amir Hamed Mohsenian Rad.....http://dblp.org/pers/hd/r/Rad:Amir_Hamed_Mohsenian", "Vincent W. S. Wong.....http://dblp.org/pers/hd/w/Wong:Vincent_W=_S=", "Robert Schober.....http://dblp.org/pers/hd/s/Schober:Robert"], "conf": "infocom", "year": "2010", "pages": 9}