{"title": "Data summaries for on-demand queries over linked data.", "fields": ["information repository", "conjunctive query", "web query classification", "boolean conjunctive query", "web search query"], "abstract": "Typical approaches for querying structured Web Data collect (crawl) and pre-process (index) large amounts of data in a central data repository before allowing for query answering. However, this time-consuming pre-processing phase however leverages the benefits of Linked Data -- where structured data is accessible live and up-to-date at distributed Web resources that may change constantly -- only to a limited degree, as query results can never be current. An ideal query answering system for Linked Data should return current answers in a reasonable amount of time, even on corpora as large as the Web. Query processors evaluating queries directly on the live sources require knowledge of the contents of data sources. In this paper, we develop and evaluate an approximate index structure summarising graph-structured content of sources adhering to Linked Data principles, provide an algorithm for answering conjunctive queries over Linked Data on theWeb exploiting the source summary, and evaluate the system using synthetically generated queries. The experimental results show that our lightweight index structure enables complete and up-to-date query results over Linked Data, while keeping the overhead for querying low and providing a satisfying source ranking at no additional cost.", "citation": "Citations (220)", "departments": ["Karlsruhe Institute of Technology", "Max Planck Society", "National University of Ireland, Galway", "National University of Ireland, Galway", "Ilmenau Univers ... lmenau, Germany"], "authors": ["Andreas Harth.....http://dblp.org/pers/hd/h/Harth:Andreas", "Katja Hose.....http://dblp.org/pers/hd/h/Hose:Katja", "Marcel Karnstedt.....http://dblp.org/pers/hd/k/Karnstedt:Marcel", "Axel Polleres.....http://dblp.org/pers/hd/p/Polleres:Axel", "Kai-Uwe Sattler.....http://dblp.org/pers/hd/s/Sattler:Kai=Uwe", "Jürgen Umbrich.....http://dblp.org/pers/hd/u/Umbrich:J=uuml=rgen"], "conf": "www", "year": "2010", "pages": 10}