{"title": "Active knowledge: dynamically enriching RDF knowledge bases by web services.", "fields": ["rdf query language", "ws policy", "web search query", "social semantic web", "web modeling"], "abstract": "The proliferation of knowledge-sharing communities and the advances in information extraction have enabled the construction of large knowledge bases using the RDF data model to represent entities and relationships. However, as the Web and its latently embedded facts evolve, a knowledge base can never be complete and up-to-date. On the other hand, a rapidly increasing suite of Web services provide access to timely and high-quality information, but this is encapsulated by the service interface. We propose to leverage the information that could be dynamically obtained from Web services in order to enrich RDF knowledge bases on the fly whenever the knowledge base does not suffice to answer a user query.   To this end, we develop a sound framework for appropriately generating queries to encapsulated Web services and efficient algorithms for query execution and result integration. The query generator composes sequences of function calls based on the available service interfaces. As Web service calls are expensive, our method aims to reduce the number of calls in order to retrieve results with sufficient recall. Our approach is fully implemented in a complete prototype system named ANGIE 1 . The user can query and browse the RDF knowledge base as if it already contained all the facts from the Web services. This data, however, is gathered and integrated on the fly, transparently to the user. We demonstrate the viability and efficiency of our approach in experiments based on real-life data provided by popular Web services.", "citation": "Citations (33)", "year": "2010", "departments": ["Max Planck Society", "Microsoft", "Microsoft", "Max Planck Society", "University of Hong Kong"], "conf": "sigmod", "authors": ["Nicoleta Preda.....http://dblp.org/pers/hd/p/Preda:Nicoleta", "Gjergji Kasneci.....http://dblp.org/pers/hd/k/Kasneci:Gjergji", "Fabian M. Suchanek.....http://dblp.org/pers/hd/s/Suchanek:Fabian_M=", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas", "Wenjun Yuan.....http://dblp.org/pers/hd/y/Yuan:Wenjun", "Gerhard Weikum.....http://dblp.org/pers/hd/w/Weikum:Gerhard"], "pages": 12}