{"title": "Positional update handling in column stores.", "fields": ["data structure", "tuple", "data mining", "merge", "overhead", "database", "database transaction", "differential structure", "computer science"], "abstract": "In this paper we investigate techniques that allow for on-line updates to columnar databases, leaving intact their high read-only performance. Rather than keeping differential structures organized by the table key values, the core proposition of this paper is that this can better be done by keeping track of the tuple  position  of the modifications. Not only does this minimize the computational overhead of merging in differences into read-only queries, but this makes the differential structure oblivious of the value of the order keys, allowing it to avoid disk I/O for retrieving the order keys in read-only queries that otherwise do not need them - a crucial advantage for a column-store. We describe a new data structure for maintaining such positional updates, called the Positional Delta Tree (PDT), and describe detailed algorithms for PDT/column merging, updating PDTs, and for using PDTs in transaction management. In experiments with a columnar DBMS, we perform microbenchmarks on PDTs, and show in a TPC-H workload that PDTs allow quick on-line updates, yet significantly reduce their performance impact on read-only queries compared with classical value-based differential methods.", "citation": "Citations (75)", "year": "2010", "departments": ["VectorWise, Ams ... am, Netherlands", "VectorWise, Ams ... am, Netherlands", "CWI, Amsterdam, Netherlands", "CWI, Amsterdam, Netherlands", "CWI, Amsterdam, Netherlands"], "conf": "sigmod", "authors": ["Sándor Héman.....http://dblp.org/pers/hd/h/H=eacute=man:S=aacute=ndor", "Marcin Zukowski.....http://dblp.org/pers/hd/z/Zukowski:Marcin", "Niels J. Nes.....http://dblp.org/pers/hd/n/Nes:Niels_J=", "Lefteris Sidirourgos.....http://dblp.org/pers/hd/s/Sidirourgos:Lefteris", "Peter A. Boncz.....http://dblp.org/pers/hd/b/Boncz:Peter_A="], "pages": 12}