{"title": "Unsupervised learning of invariant features using video.", "fields": ["data set", "invariant", "test set", "scale invariant feature transform", "frame rate"], "abstract": "We present an algorithm that learns invariant features from real data in an entirely unsupervised fashion. The principal benefit of our method is that it can be applied without human intervention to a particular application or data set, learning the specific invariances necessary for excellent feature performance on that data. Our algorithm relies on the ability to track image patches over time using optical flow. With the wide availability of high frame rate video (eg: on the web, from a robot), good tracking is straightforward to achieve. The algorithm then optimizes feature parameters such that patches corresponding to the same physical location have feature descriptors that are as similar as possible while simultaneously maximizing the distinctness of descriptors for different locations. Thus, our method captures data or application specific invariances yet does not require any manual supervision. We apply our algorithm to learn domain-optimized versions of SIFT and HOG. SIFT and HOG features are excellent and widely used. However, they are general and by definition not tailored to a specific domain. Our domain-optimized versions offer a substantial performance increase for classification and correspondence tasks we consider. Furthermore, we show that the features our method learns are near the optimal that would be achieved by directly optimizing the test set performance of a classifier. Finally, we demonstrate that the learning often allows fewer features to be used for some tasks, which has the potential to dramatically improve computational concerns for very large data sets.", "citation": "Citations (27)", "year": "2010", "departments": ["Stanford University", "Stanford University"], "conf": "cvpr", "authors": ["David Stavens.....http://dblp.org/pers/hd/s/Stavens:David", "Sebastian Thrun.....http://dblp.org/pers/hd/t/Thrun:Sebastian"], "pages": 8}