{"title": "From Theory to Practice: Evaluating Static Channel Assignments on a Wireless Mesh Network.", "fields": ["order one network protocol", "wireless mesh network", "switched mesh", "shared mesh", "channel allocation schemes"], "abstract": "Multi-radio nodes in wireless mesh networks introduce extra complexity in utilizing channel resources. Depending on the configuration of the radios, bad mappings between radio to wireless frequencies may result in sub-optimal network topologies. Static channel assignments in wireless mesh networks have been studied in theory and through simulation but very little work has been done through experiments. This paper focuses on evaluating static channel assignments on a live wireless mesh network. We chose three popular types of static channel assignment algorithms for implementation and comparison purposes. The three types are breadth-first search, priority-based selection and integer linear programming. We find that there is no single channel assignment algorithm that does well overall. BFS algorithm can create the shortest paths to the gateway and also generate balanced channel usage topologies. The PBS algorithm can use all the best links in the network but have poor performance from each radio to the gateway. Overall, we find the channel assignments given by the algorithms to be suboptimal when applied to a live mesh network because temporal variations in the link quality metrics are not taken into account. Looking at the interflow and intraflow performance of these channel assignment algorithms in a live mesh network, we can conclude that routing protocols must be modified to take advantage of the underlying channel assignment algorithms.", "citation": "Citations (24)", "departments": ["University of California, Davis", "University of California, Davis"], "authors": ["Daniel Wu.....http://dblp.org/pers/hd/w/Wu:Daniel", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant"], "conf": "infocom", "year": "2010", "pages": 5}