{"title": "An automated, yet interactive and portable DB designer.", "fields": ["physical design", "interactive visualization", "database administrator", "workload", "heuristics"], "abstract": "Tuning tools attempt to configure a database to achieve optimal performance for a given workload. Selecting an optimal set of physical structures is computationally hard since it involves searching a vast space of possible configurations. Commercial DBMSs offer tools that can address this problem. The usefulness of such tools, however, is limited by their dependence on greedy heuristics, the need for a-priori (offline) knowledge of the workload, and lack of an optimal materialization schedule to get the best out of suggested design features. Moreover, the open source DBMSs do not provide any automated tuning tools.   This demonstration introduces a comprehensive physical designer for the PostgreSQL open source DBMS. The tool suggests design features for both offline and online workloads. It provides close to optimal suggestions for indexes for a given workload by modeling the problem as a combinatorial optimization problem and solving it by sophisticated and mature solvers. It also determines the interaction between indexes to suggest an effective materialization strategy for the selected indexes. The tool is interactive as it allows the database administrator (DBA) to suggest a set of candidate features and shows their benefits and interactions visually. For the demonstration we use large real-world scientific datasets and query workloads.", "citation": "Citations (8)", "year": "2010", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of California, Santa Cruz", "École Polytechnique Fédérale de Lausanne", "University of California, Santa Cruz"], "conf": "sigmod", "authors": ["Ioannis Alagiannis.....http://dblp.org/pers/hd/a/Alagiannis:Ioannis", "Debabrata Dash.....http://dblp.org/pers/hd/d/Dash:Debabrata", "Karl Schnaitter.....http://dblp.org/pers/hd/s/Schnaitter:Karl", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia", "Neoklis Polyzotis.....http://dblp.org/pers/hd/p/Polyzotis:Neoklis"], "pages": 4}