{"title": "Dynamic filtering: multi-purpose architecture support for language runtime systems.", "fields": ["runtime system", "transactional memory", "language based security", "bartok", "instruction set"], "abstract": "This paper introduces a new abstraction to accelerate the read-barriers and write-barriers used by language runtime systems. We exploit the fact that, dynamically, many barrier executions perform checks but no real work -- e.g., in generational garbage collection (GC), frequent checks are needed to detect the creation of inter-generational references, even though such references occur rarely in many workloads. We introduce a form of dynamic filtering that identifies redundant checks by (i) recording checks that have recently been executed, and (ii) detecting when a barrier is repeating one of these checks. We show how this technique can be applied to a variety of algorithms for GC, transactional memory, and language-based security. By supporting dynamic filtering in the instruction set, we show that the fast-paths of these barriers can be streamlined, reducing the impact on the quality of surrounding code. We show how we accelerate the barriers used for generational GC and transactional memory in the Bartok research compiler. With a 2048-entry filter, dynamic filtering eliminates almost all the overhead of the GC write-barriers. Dynamic filtering eliminates around half the overhead of STM over a non-synchronized baseline -- even when used with an STM that is already designed for low overhead, and which employs static analyses to avoid redundant operations.", "citation": "Citations (10)", "year": "2010", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "asplos", "authors": ["Tim Harris.....http://dblp.org/pers/hd/h/Harris_0001:Tim", "Sasa Tomic.....http://dblp.org/pers/hd/t/Tomic:Sasa", "Adrián Cristal.....http://dblp.org/pers/hd/c/Cristal:Adri=aacute=n", "Osman S. Unsal.....http://dblp.org/pers/hd/u/Unsal:Osman_S="], "pages": 14}