{"title": "Context-based indoor object detection as an aid to blind persons accessing unfamiliar environments.", "fields": ["optical character recognition", "geometric shape", "object type", "doors", "visual impairment"], "abstract": "Independent travel is a well known challenge for blind or visually impaired persons. In this paper, we propose a computer vision-based indoor wayfinding system for assisting blind people to independently access unfamiliar buildings. In order to find different rooms (i.e. an office, a lab, or a bathroom) and other building amenities (i.e. an exit or an elevator), we incorporate door detection with text recognition. First we develop a robust and efficient algorithm to detect doors and elevators based on general geometric shape, by combining edges and corners. The algorithm is generic enough to handle large intra-class variations of the object model among different indoor environments, as well as small inter-class differences between different objects such as doors and elevators. Next, to distinguish an office door from a bathroom door, we extract and recognize the text information associated with the detected objects. We first extract text regions from indoor signs with multiple colors. Then text character localization and layout analysis of text strings are applied to filter out background interference. The extracted text is recognized by using off-the-shelf optical character recognition (OCR) software products. The object type, orientation, and location can be displayed as speech for blind travelers.", "citation": "Citations (20)", "departments": ["City College of New York", "City College of New York", "City University of New York", "Lighthouse International"], "authors": ["Xiaodong Yang.....http://dblp.org/pers/hd/y/Yang_0001:Xiaodong", "Yingli Tian.....http://dblp.org/pers/hd/t/Tian:Yingli", "Chucai Yi.....http://dblp.org/pers/hd/y/Yi:Chucai", "Aries Arditi.....http://dblp.org/pers/hd/a/Arditi:Aries"], "conf": "mm", "year": "2010", "pages": 4}