{"title": "Chip Error Pattern Analysis in IEEE 802.15.4.", "fields": ["attenuation", "physical layer", "phy", "ieee 802 15", "effective method", "channel"], "abstract": "IEEE 802.15.4 standard specifies physical layer (PHY) and medium access control (MAC) sublayer protocols for low-rate and low-power communication applications. In this protocol, every 4-bit symbol is encoded into a sequence of 32 chips that are actually transmitted over the air. The 32 chips as a whole is also called a pseudonoise code (PN-Code). Due to complex channel conditions such as attenuation and interference, the transmitted PN-Code will often be received with some PN-Code chips corrupted. In this paper, we conduct a systematic analysis on these errors occurring at chip level. We find that there are notable error patterns corresponding to different cases. We then show that recognizing these patterns enables us to identify the channel condition in great details. We believe that understanding what happened to the transmission in our way can potentially bring benefit to channel coding, routing, and error correction protocol design. Finally, we propose Simple Rule, a simple yet effective method based on the chip error patterns to infer the link condition with an accuracy of over 96 percent in our evaluations.", "citation": "Citations (85)", "departments": ["Sun Yat-sen University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Haoyu Tan.....http://dblp.org/pers/hd/t/Tan:Haoyu", "Hoilun Ngan.....http://dblp.org/pers/hd/n/Ngan:Hoilun", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "infocom", "year": "2010", "pages": 5}