{"title": "Joint Energy Management and Resource Allocation in Rechargeable Sensor Networks.", "fields": ["energy conservation", "resource allocation", "energy management", "network utility", "local algorithm"], "abstract": "Energy harvesting sensor platforms have opened up a new dimension to the design of network protocols. In order to sustain the network operation, the energy consumption rate cannot be higher than the energy harvesting rate, otherwise, sensor nodes will eventually deplete their batteries. In contrast to traditional network resource allocation problems where the resources are static, the time-varying recharging rate presents a new challenge. In this paper, We first explore the performance of an efficient dual decomposition and subgradient method based algorithm, called QuickFix, for computing the data sampling rate and routes. However, fluctuations in recharging can happen at a faster time-scale than the convergence time of the traditional approach. This leads to battery outage and overflow scenarios, that are both undesirable due to missed samples and lost energy harvesting opportunities respectively. To address such dynamics, a local algorithm, called SnapIt, is designed to adapt the sampling rate with the objective of maintaining the battery at a target level. Our evaluations using the TOSSIM simulator show that QuickFix and SnapIt working in tandem can track the instantaneous optimum network utility while maintaining the battery at a target level. When compared with IFRC, a backpressure-based approach, our solution improves the total data rate by 42% on the average while significantly improving the network utility.", "citation": "Citations (170)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Ren-Shiou Liu.....http://dblp.org/pers/hd/l/Liu:Ren=Shiou", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun", "Can Emre Koksal.....http://dblp.org/pers/hd/k/Koksal:Can_Emre"], "conf": "infocom", "year": "2010", "pages": 9}