{"title": "Toque: designing a cooking-based programming language for and with children.", "fields": ["programming language implementation", "very high level programming language", "extensible programming", "fourth generation programming language", "symbolic programming"], "abstract": "An intergenerational design team of children (ages 7-11 years old) along with graduate students and faculty in computer science and information studies developed a programming language for children,  Toque . Concrete real-world cooking scenarios were used as programming metaphors to support an accessible programming learning experience. The  Wiimote  and  Nunchuk  were used as physical programming input devices. The programs that were created were pictorial recipes which dynamically controlled animations of an on-screen chef preparing virtual dishes in a graphical kitchen environment. Through multiple design sessions, programming strategies were explored, cooking metaphors were developed and, prototypes of the Toque environment were iterated. Results of these design experiences have shown us the importance of pair-programming, programming by storytelling, parallel programming, function-argument relationships, and the role of tangibility in overcoming challenges with constraints imposed by the system design.", "citation": "Citations (18)", "year": "2010", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "conf": "chi", "authors": ["Sureyya Tarkan.....http://dblp.org/pers/hd/t/Tarkan:Sureyya", "Vibha Sazawal.....http://dblp.org/pers/hd/s/Sazawal:Vibha", "Allison Druin.....http://dblp.org/pers/hd/d/Druin:Allison", "Evan Golub.....http://dblp.org/pers/hd/g/Golub:Evan", "Elizabeth M. Bonsignore.....http://dblp.org/pers/hd/b/Bonsignore:Elizabeth_M=", "Greg Walsh.....http://dblp.org/pers/hd/w/Walsh:Greg", "Zeina Atrash.....http://dblp.org/pers/hd/a/Atrash:Zeina"], "pages": 10}