{"title": "Learning kernels for variants of normalized cuts: Convex relaxations and applications.", "fields": ["relational model", "kernel", "matrix", "normalization", "basis set"], "abstract": "We propose a new algorithm for learning kernels for variants of the Normalized Cuts (NCuts) objective – i.e., given a set of training examples with known partitions, how should a basis set of similarity functions be combined to induce NCuts favorable distributions. Such a procedure facilitates design of good affinity matrices. It also helps assess the importance of different feature types for discrimination. Rather than formulating the learning problem in terms of the spectral relaxation, the alternative we pursue here is to work in the original discrete setting (i.e., the relaxation occurs much later). We show that this strategy is useful – while the initial specification seems rather difficult to optimize efficiently, a set of manipulations reveal a related model which permits a nice SDP relaxation. A salient feature of our model is that the eventual problem size is only a function of the number of input kernels and not the training set size. This relaxation also allows strong optimality guarantees, if certain conditions are satisfied. We show that the sub-kernel weights obtained provide a complementary approach for MKL based methods. Our experiments on Cal-tech101 and ADNI (a brain imaging dataset) show that the quality of solutions is competitive with the state-of-the-art.", "citation": "Citations (6)", "year": "2010", "departments": ["University of Wisconsin–Whitewater", "University of Wisconsin-Madison", "University of Illinois at Urbana–Champaign", "University of Wisconsin-Madison"], "conf": "cvpr", "authors": ["Lopamudra Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Lopamudra", "Vikas Singh.....http://dblp.org/pers/hd/s/Singh:Vikas", "Jiming Peng.....http://dblp.org/pers/hd/p/Peng:Jiming", "Chris Hinrichs.....http://dblp.org/pers/hd/h/Hinrichs:Chris"], "pages": 8}