{"title": "File Fragmentation over an Unreliable Channel.", "fields": ["asymptotically optimal algorithm", "file size", "bounded function", "phenomenon", "file system fragmentation"], "abstract": "It has been recently discovered that heavy-tailed file completion time can result from protocol interaction even when file sizes are light-tailed. A key to this phenomenon is the RESTART feature where if a file transfer is interrupted before it is completed, the transfer needs to restart from the beginning. In this paper, we show that independent or bounded fragmentation produces light-tailed file completion time as long as the file size is light-tailed, i.e., in this case, heavy-tailed file completion time can only originate from heavy-tailed file sizes. If the file size is heavy-tailed, then the file completion time is clearly heavy-tailed. For this case, we show that when the file size distribution is regularly varying, then under independent or bounded fragmentation, the completion time tail distribution function is asymptotically upper bounded by that of the original file size stretched by a constant factor. We then prove that if the failure distribution has non-decreasing failure rate, the expected completion time is minimized by dividing the file into equal sized fragments; this optimal fragment size is unique but depends on the file size. We also present a simple blind fragmentation policy where the fragment sizes are constant and independent of the file size and prove that it is asymptotically optimal. Finally, we bound the error in expected completion time due to error in modeling of the failure process.", "citation": "Citations (17)", "departments": ["California Institute of Technology", "Royal Institute of Technology", "Swinburne University of Technology", "California Institute of Technology", "California Institute of Technology"], "authors": ["Jayakrishnan Nair.....http://dblp.org/pers/hd/n/Nair:Jayakrishnan", "Martin Andreasson.....http://dblp.org/pers/hd/a/Andreasson:Martin", "Lachlan L. H. Andrew.....http://dblp.org/pers/hd/a/Andrew:Lachlan_L=_H=", "Steven H. Low.....http://dblp.org/pers/hd/l/Low:Steven_H=", "John Doyle.....http://dblp.org/pers/hd/d/Doyle:John"], "conf": "infocom", "year": "2010", "pages": 9}