{"title": "Multihop Transmission Opportunity in Wireless Multihop Networks.", "fields": ["wireless mesh network", "bit error rate", "throughput", "communications protocol", "traffic intensity"], "abstract": "Wireless multihop communication is becoming more important due to the increasing popularity of wireless sensor networks, wireless mesh networks, and mobile social networks. They are distinguished from conventional multihop networks in terms of scale, traffic intensity and/or node density. Being readily-available in most of 802.11 radios, multirate facility appears to be useful to address some of these issues and is particularly helpful in high-density scenarios where inter-node distance is short, demanding a prudent multirate adaptation algorithm. However, communication at high bit rates mandates a large number of hops for a given node pair and thus, can easily be depreciated as per-hop overhead at several layers of network protocol is aggregated over the increased number of hops. This paper presents a novel multihop, multirate adaptation mechanism, called Multihop Transmission OPportunity (MTOP), that allows a frame to be forwarded a number of hops consecutively but reduces the MAC-layer overhead between hops. This seemingly collision-prone multihop forwarding is proven to be safe via analysis and USRP/GNU Radio-based experiment. The idea of MTOP is in clear contrast to, but not mutually exclusive with, the conventional opportunistic transmission mechanism, referred to as TXOP, where a node transmits multiple frames back-to-back when it gets an opportunity. We conducted an extensive simulation study via ns-2, demonstrating the performance advantage of MTOP under a wide range of network scenarios.", "citation": "Citations (13)", "departments": ["Cleveland State University", "Cleveland State University", "University of Michigan", "Pohang University of Science and Technology", "Pohang University of Science and Technology"], "authors": ["Chansu Yu.....http://dblp.org/pers/hd/y/Yu:Chansu", "Tianning Shen.....http://dblp.org/pers/hd/s/Shen:Tianning", "Kang G. Shin.....http://dblp.org/pers/hd/s/Shin:Kang_G=", "Jeong-Yoon Lee.....http://dblp.org/pers/hd/l/Lee:Jeong=Yoon", "Young-Joo Suh.....http://dblp.org/pers/hd/s/Suh:Young=Joo"], "conf": "infocom", "year": "2010", "pages": 9}