{"title": "Asymmetry-Aware Real-Time Distributed Joint Resource Allocation in IEEE 802.22 WRANs.", "fields": ["ieee 802 22", "nonlinear programming", "distributed algorithm", "scalability", "channel allocation schemes"], "abstract": "In IEEE 802.22 Wireless Regional Area Networks (WRANs), each Base Station (BS) solves a complex resource allocation problem of simultaneously determining the channel to reuse, power for adaptive coverage, and Consumer Premise Equipments (CPEs) to associate with, while maximizing the total downstream capacity of CPEs. Although joint power and channel allocation is a classical problem, resource allocation in WRANs faces two unique challenges that has not yet been addressed: (1) the presence of small-scale incumbents such as wireless microphones (WMs), and (2) asymmetric interference patterns between BSs using omnidirectional antennas and CPEs using directional antennas. In this paper, we capture this asymmetry in upstream/downstream communications to propose an accurate and realistic WRAN-WM coexistence model that increases spatial reuse of TV spectrum while protecting small-scale incumbents. Based on the proposed model, we formulate the resource allocation problem as a mixed-integer nonlinear programming (MINLP) which is NP-hard. To solve the problem in real-time, we propose a suboptimal algorithm based on the Genetic Algorithm (GA), and extend the basic GA algorithm to a fully-distributed GA algorithm (dGA) that distributes computational cost over the network and achieves scalability via local cooperation between neighboring BSs. Using extensive simulation, the proposed dGA is shown to perform as good as 99.4- 99.8% of the optimal solution, while reducing the computational cost significantly.", "citation": "Citations (17)", "departments": ["University of Michigan", "University of Michigan"], "authors": ["Hyoil Kim.....http://dblp.org/pers/hd/k/Kim:Hyoil", "Kang G. Shin.....http://dblp.org/pers/hd/s/Shin:Kang_G="], "conf": "infocom", "year": "2010", "pages": 9}