{"title": "Total Bregman divergence and its applications to shape retrieval.", "fields": ["convex function", "weighted arithmetic mean", "bregman divergence", "kernel", "divergence"], "abstract": "Shape database search is ubiquitous in the world of bio-metric systems, CAD systems etc. Shape data in these domains is experiencing an explosive growth and usually requires search of whole shape databases to retrieve the best matches with accuracy and efficiency for a variety of tasks. In this paper, we present a novel divergence measure between any two given points in R n  or two distribution functions. This divergence measures the orthogonal distance between the tangent to the convex function (used in the definition of the divergence) at one of its input arguments and its second argument. This is in contrast to the ordinate distance taken in the usual definition of the Bregman class of divergences [4]. We use this orthogonal distance to redefine the Bregman class of divergences and develop a new theory for estimating the center of a set of vectors as well as probability distribution functions. The new class of divergences are dubbed the total Bregman divergence (TBD). We present the l\\-norm based TBD center that is dubbed the t-center which is then used as a cluster center of a class of shapes The t-center is weighted mean and this weight is small for noise and outliers. We present a shape retrieval scheme using TBD and the t-center for representing the classes of shapes from the MPEG-7 database and compare the results with other state-of-the-art methods in literature.", "citation": "Citations (57)", "year": "2010", "departments": ["University of Florida", "University of Florida", "RIKEN BSI", "Sony Computer Science Lab"], "conf": "cvpr", "authors": ["Meizhu Liu.....http://dblp.org/pers/hd/l/Liu:Meizhu", "Baba C. Vemuri.....http://dblp.org/pers/hd/v/Vemuri:Baba_C=", "Shun-ichi Amari.....http://dblp.org/pers/hd/a/Amari:Shun=ichi", "Frank Nielsen.....http://dblp.org/pers/hd/n/Nielsen:Frank"], "pages": 6}