{"title": "Flexible architectural support for fine-grain scheduling.", "fields": ["memory hierarchy", "fair share scheduling", "work stealing", "round robin scheduling", "generalized processor sharing"], "abstract": "To make efficient use of CMPs with tens to hundreds of cores, it is often necessary to exploit fine-grain parallelism. However, managing tasks of a few thousand instructions is particularly challenging, as the runtime must ensure load balance without compromising locality and introducing small overheads. Software-only schedulers can implement various scheduling algorithms that match the characteristics of different applications and programming models, but suffer significant overheads as they synchronize and communicate task information over the deep cache hierarchy of a large-scale CMP. To reduce these costs, hardware-only schedulers like Carbon, which implement task queuing and scheduling in hardware, have been proposed. However, a hardware-only solution fixes the scheduling algorithm and leaves no room for other uses of the custom hardware.   This paper presents a combined hardware-software approach to build fine-grain schedulers that retain the flexibility of software schedulers while being as fast and scalable as hardware ones. We propose asynchronous direct messages (ADM), a simple architectural extension that provides direct exchange of asynchronous, short messages between threads in the CMP without going through the memory hierarchy. ADM is sufficient to implement a family of novel, software-mostly schedulers that rely on low-overhead messaging to efficiently coordinate scheduling and transfer task information. These schedulers match and often exceed the performance and scalability of Carbon when using the same scheduling algorithm. When the ADM runtime tailors its scheduling algorithm to application characteristics, it outperforms Carbon by up to 70%.", "citation": "Citations (121)", "year": "2010", "departments": ["Stanford University", "Stanford University", "Stanford University"], "conf": "asplos", "authors": ["Daniel Sánchez.....http://dblp.org/pers/hd/s/S=aacute=nchez_0003:Daniel", "Richard M. Yoo.....http://dblp.org/pers/hd/y/Yoo:Richard_M=", "Christos Kozyrakis.....http://dblp.org/pers/hd/k/Kozyrakis:Christos"], "pages": 12}