{"title": "Elastic Rate Limiting for Spatially Biased Wireless Mesh Networks.", "fields": ["wireless mesh network", "default gateway", "rate limiting", "controller", "internetworking"], "abstract": "IEEE 802.11-based mesh networks can yield a throughput distribution among nodes that is spatially biased, with traffic originating from nodes that directly communicate with the gateway obtaining higher throughput than all other upstream traffic. In particular, if single-hop nodes fully utilize the gateway's resources, all other nodes communicating with the same gateway will attain very little (if any) throughput. In this paper, we show that it is sufficient to rate limit the single-hop nodes in order to give transmission opportunities to all other nodes. Based on this observation, we develop a new rate limiting scheme for 802.11 mesh networks, which counters the spatial bias effect and does not require, in principle, any control overhead. Our rate control mechanism is based on three key techniques. First, we exploit the system's inherent priority nature and control the throughput of the spatially disadvantaged nodes by only controlling the transmission rate of the spatially advantaged nodes. Namely, the single-hop nodes collectively behave as a proxy controller for multi-hop nodes in order to achieve the desired bandwidth distribution. Second, we devise a rate limiting scheme that enforces a utilization threshold for advantaged single-hop traffic and guarantees a small portion of the gateway resources for the disadvantaged multi-hop traffic. We infer demand for multi-hop flow bandwidth whenever gateway resource usage exceeds this threshold, and subsequently reduce the rates of the spatially advantaged single-hop nodes. Third, since the more bandwidth the spatially disadvantaged nodes attain, the easier they can \\emph{signal} their demands, we allow the bandwidth unavailable for the advantaged nodes to be elastic, i.e., the more the disadvantaged flows use the gateway resources, the higher the utilization threshold is. We develop an analytical model to study a system characterized by such priority, dynamic utilization thresholds, and control by proxy. Moreover, we use simulations to evaluate the proposed elastic rate limiting technique.", "citation": "Citations (14)", "departments": ["French Institute for Research in Computer Science and Automation", "Ben-Gurion University of the Negev", "University of Louisiana at Lafayette", "Rice University"], "authors": ["Vincenzo Mancuso.....http://dblp.org/pers/hd/m/Mancuso:Vincenzo", "Omer Gurewitz.....http://dblp.org/pers/hd/g/Gurewitz:Omer", "Ahmed K. F. Khattab.....http://dblp.org/pers/hd/k/Khattab:Ahmed_K=_F=", "Edward W. Knightly.....http://dblp.org/pers/hd/k/Knightly:Edward_W="], "conf": "infocom", "year": "2010", "pages": 9}