{"title": "Achieving Non-Inclusive Cache Performance with Inclusive Caches: Temporal Locality Aware (TLA) Cache Management Policies.", "fields": ["cache invalidation", "smart cache", "bus sniffing", "locality of reference", "cache pollution", "snoopy cache", "mesi protocol", "cache algorithms"], "abstract": "Inclusive caches are commonly used by processors to simplify cache coherence. However, the trade-off has been lower performance compared to non-inclusive and exclusive caches. Contrary to conventional wisdom, we show that the limited performance of inclusive caches is mostly due to inclusion victims—lines that are evicted from the core caches to satisfy the inclusion property—and not the reduced cache capacity of the hierarchy due to the duplication of data. These inclusion victims are incorrectly chosen for replacement because the last-level cache (LLC) is unaware of the temporal locality of lines in the core caches. We propose Temporal Locality Aware (TLA) cache management policies to allow an inclusive LLC to be aware of the temporal locality of lines in the core caches. We propose three TLA policies: Temporal Locality Hints (TLH), Early Core Invalidation (ECI), and Query Based Selection (QBS). All three policies improve inclusive cache performance without requiring any additional hardware structures. In fact, QBS performs similar to a non-inclusive cache hierarchy.", "citation": "Not cited", "departments": ["Intel", "Intel", "Massachusetts Institute of Technology", "Intel", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Aamer Jaleel.....http://dblp.org/pers/hd/j/Jaleel:Aamer", "Eric Borch.....http://dblp.org/pers/hd/b/Borch:Eric", "Malini Bhandaru.....http://dblp.org/pers/hd/b/Bhandaru:Malini", "Simon C. Steely Jr......http://dblp.org/pers/hd/s/Steely_Jr=:Simon_C=", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S="], "conf": "micro", "year": "2010", "pages": 12}