{"title": "Nonparametric Label-to-Region by search.", "fields": ["image retrieval", "contextual image classification", "cluster analysis", "scale invariant feature transform", "feature detection"], "abstract": "In this work, we investigate how to propagate annotated labels for a given single image from the image-level to their corresponding semantic regions, namely Label-to-Region (L2R), by utilizing the auxiliary knowledge from Internet image search with the annotated image labels as queries. A nonparametric solution is proposed to perform L2R for single image with complete labels. First, each label of the image is used as query for online image search engines to obtain a set of semantically related and visually similar images, which along with the input image are encoded as Bags-of-Hierarchical-Patches. Then, an efficient two-stage feature mining procedure is presented to discover those input-image specific, salient and descriptive features for each label from the proposed Interpolation SIFT (iSIFT) feature pool. These features consequently constitute a patch-level representation, and the continuity-biased sparse coding is proposed to select few patches from the online images with preference to larger patches to reconstruct a candidate region, which randomly merges the spatially connected patches of the input image. Such candidate regions are further ranked according to the reconstruction errors, and the top regions are used to derive the label confidence vector for each patch of the input image. Finally, a patch clustering procedure is performed as postprocessing to finalize L2R for the input image. Extensive experiments on three public databases demonstrate the encouraging performance of the proposed nonparametric L2R solution.", "citation": "Citations (18)", "year": "2010", "departments": ["Huazhong University of Science and Technology", "National University of Singapore", "Eastman Kodak Company", "National University of Singapore", "Panasonic"], "conf": "cvpr", "authors": ["Xiaobai Liu.....http://dblp.org/pers/hd/l/Liu:Xiaobai", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "ZhongYang Huang.....http://dblp.org/pers/hd/h/Huang:ZhongYang", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai"], "pages": 8}