{"title": "Sorting under partial information (without the ellipsoid algorithm).", "fields": ["sort", "partially ordered set", "ellipsoid method", "linear extension", "binary logarithm"], "abstract": "We revisit the well-known problem of sorting under partial information: sort a finite set given the outcomes of comparisons between some pairs of elements. The input is a partially ordered set $P$, and solving the problem amounts to discovering an unknown linear extension of P, using pairwise comparisons. The information-theoretic lower bound on the number of comparisons needed in the worst case is log e(P), the binary logarithm of the number of linear extensions of $P$. In a breakthrough paper, Jeff Kahn and Jeong Han Kim (STOC 1992) showed that there exists a polynomial-time algorithm for the problem achieving this bound up to a constant factor. Their algorithm invokes the ellipsoid algorithm at each iteration for determining the next comparison, making it impractical.   We develop efficient algorithms for sorting under partial information. Like Kahn and Kim, our approach relies on graph entropy. However, our algorithms differ in essential ways from theirs. Rather than resorting to convex programming for computing the entropy, we approximate the entropy, or make sure it is computed only once in a restricted class of graphs, permitting the use of a simpler algorithm. Specifically, we present: an O(n 2 ) algorithm performing O(log n ⋅ log e(P)) comparisons; an O(n 2.5 ) algorithm performing at most (1+e) log e(P) + O e(n)  comparisons; an O(n 2.5 ) algorithm performing O(log e(P)) comparisons. All our algorithms are simple to implement.", "citation": "Citations (12)", "year": "2010", "departments": ["Université libre de Bruxelles", "Université libre de Bruxelles", "Université libre de Bruxelles", "Massachusetts Institute of Technology", "University of Waterloo", "Université libre de Bruxelles", "Université libre de Bruxelles", "Université libre de Bruxelles", "Université catholique de Louvain", "University of Waterloo"], "conf": "stoc", "authors": ["Jean Cardinal.....http://dblp.org/pers/hd/c/Cardinal:Jean", "Samuel Fiorini.....http://dblp.org/pers/hd/f/Fiorini:Samuel", "Gwenaël Joret.....http://dblp.org/pers/hd/j/Joret:Gwena=euml=l", "Raphaël M. Jungers.....http://dblp.org/pers/hd/j/Jungers:Rapha=euml=l_M=", "J. Ian Munro.....http://dblp.org/pers/hd/m/Munro:J=_Ian"], "pages": 10}