{"title": "BIOFACE: a biometric face demonstrator.", "fields": ["eigenface", "face hallucination", "digital image processing", "three dimensional face recognition", "soft biometrics"], "abstract": "In this paper, a demonstrator called BIOFACE incorporating several facial biometric techniques is described. It includes the well established Eigenfaces and the recently published Tomofaces techniques, which perform face recognition based on facial appearance and dynamics, respectively. Both techniques are based on the space dimensionality reduction and the enrollment requires the projection of several positive face samples to the reduced space. Alternatively, BIOFACE also performs face recognition based on the matching of Scale Invariant Feature Transform (SIFT) features.   Moreover, BIOFACE extracts a facial soft biometric profile, which consists of a bag of facial soft biometric traits such as skin, hair, and eye color, the presence of glasses, beard and moustache. The fast and efficient detection of the facial soft biometrics is performed as a pre-processing step, and employed for pruning the search for the facial recognition module.   Finally, the demonstrator also detects facial events such as blinking, yawning and looking-away. The car driver scenario is a good example to exhibit the importance of such traits to detect fatigue.   The BIOFACE demonstrator is an attempt to show the potential and the performance of such facial processing techniques in a real-life scenario. The demonstrator is built using the C/C++ programming language, which is suitable for implementing image and video processing techniques due to its fast execution. On top of that, the Open Source Computer Vision Library (OpenCV), which is optimized for Intel processors, is used to implement the image processing algorithms.", "citation": "Citations (4)", "departments": ["Orange S.A.", "Institut Eurécom", "Institut Eurécom", "Institut Eurécom", "Institut Eurécom"], "authors": ["Mourad Ouaret.....http://dblp.org/pers/hd/o/Ouaret:Mourad", "Antitza Dantcheva.....http://dblp.org/pers/hd/d/Dantcheva:Antitza", "Rui Min.....http://dblp.org/pers/hd/m/Min:Rui", "Lionel Daniel.....http://dblp.org/pers/hd/d/Daniel:Lionel", "Jean-Luc Dugelay.....http://dblp.org/pers/hd/d/Dugelay:Jean=Luc"], "conf": "mm", "year": "2010", "pages": 4}