{"title": "A probabilistic image jigsaw puzzle solver.", "fields": ["constraint satisfaction problem", "solver", "jigsaw", "graphical model", "probabilistic logic", "mathematics", "pairwise comparison", "theoretical computer science"], "abstract": "We explore the problem of reconstructing an image from a bag of square, non-overlapping image patches, the jigsaw puzzle problem. Completing jigsaw puzzles is challenging and requires expertise even for humans, and is known to be NP-complete. We depart from previous methods that treat the problem as a constraint satisfaction problem and develop a graphical model to solve it. Each patch location is a node and each patch is a label at nodes in the graph. A graphical model requires a pairwise compatibility term, which measures an affinity between two neighboring patches, and a local evidence term, which we lack. This paper discusses ways to obtain these terms for the jigsaw puzzle problem. We evaluate several patch compatibility metrics, including the natural image statistics measure, and experimentally show that the dissimilarity-based compatibility – measuring the sum-of-squared color difference along the abutting boundary – gives the best results. We compare two forms of local evidence for the graphical model: a sparse-and-accurate evidence and a dense-and-noisy evidence. We show that the sparse-and-accurate evidence, fixing as few as 4 – 6 patches at their correct locations, is enough to reconstruct images consisting of over 400 patches. To the best of our knowledge, this is the largest puzzle solved in the literature. We also show that one can coarsely estimate the low resolution image from a bag of patches, suggesting that a bag of image patches encodes some geometric information about the original image.", "citation": "Citations (110)", "year": "2010", "departments": ["Massachusetts Institute of Technology", "Adobe Systems", "Massachusetts Institute of Technology"], "conf": "cvpr", "authors": ["Taeg Sang Cho.....http://dblp.org/pers/hd/c/Cho:Taeg_Sang", "Shai Avidan.....http://dblp.org/pers/hd/a/Avidan:Shai", "William T. Freeman.....http://dblp.org/pers/hd/f/Freeman:William_T="], "pages": 8}