{"title": "Optimizing one-shot recognition with micro-set learning.", "fields": ["3d single object recognition", "intelligent character recognition", "sketch recognition", "small number", "feature"], "abstract": "For object category recognition to scale beyond a small number of classes, it is important that algorithms be able to learn from a small amount of labeled data per additional class. One-shot recognition aims to apply the knowledge gained from a set of categories with plentiful data to categories for which only a single exemplar is available for each. As with earlier efforts motivated by transfer learning, we seek an internal representation for the domain that generalizes across classes. However, in contrast to existing work, we formulate the problem in a fundamentally new manner by optimizing the internal representation for the one-shot task using the notion of micro-sets. A micro-set is a sample of data that contains only a single instance of each category, sampled from the pool of available data, which serves as a mechanism to force the learned representation to explicitly address the variability and noise inherent in the one-shot recognition task. We optimize our learned domain features so that they minimize an expected loss over micro-sets drawn from the training set and show that these features generalize effectively to previously unseen categories. We detail a discriminative approach for optimizing one-shot recognition using micro-sets and present experiments on the Animals with Attributes and Caltech-101 datasets that demonstrate the benefits of our formulation.", "citation": "Citations (14)", "year": "2010", "departments": ["Cornell University", "University of Central Florida", "Carnegie Mellon University", "Max Planck Society"], "conf": "cvpr", "authors": ["Kevin D. Tang.....http://dblp.org/pers/hd/t/Tang:Kevin_D=", "Marshall F. Tappen.....http://dblp.org/pers/hd/t/Tappen:Marshall_F=", "Rahul Sukthankar.....http://dblp.org/pers/hd/s/Sukthankar:Rahul", "Christoph H. Lampert.....http://dblp.org/pers/hd/l/Lampert:Christoph_H="], "pages": 8}