{"title": "Quality-Driven Volcanic Earthquake Detection Using Wireless Sensor Networks.", "fields": ["false alarm", "energy consumption", "seismometer", "testbed", "instrumentation"], "abstract": "Volcano monitoring is of great interest to public safety and scientific explorations. However, traditional volcanic instrumentation such as broadband seismometers are expensive, power-hungry, bulky, and difficult to install. Wireless sensor networks (WSNs) offer the potential to monitor volcanoes at unprecedented spatial and temporal scales. However, current volcanic WSN systems often yield poor monitoring quality due to the limited sensing capability of low-cost sensors and unpredictable dynamics of volcanic activities. Moreover, they are designed only for short-term monitoring due to the high energy consumption of centralized data collection. In this paper, we propose a novel quality-driven approach to achieving real-time, in-situ, and long-lived volcanic earthquake detection. By employing novel in-network collaborative signal processing algorithms, our approach can meet stringent requirements on sensing quality (low false alarm/missing rate and precise earthquake onset time) at low power consumption. We have implemented our algorithms in TinyOS and conducted extensive evaluation on a testbed of 24 TelosB motes as well as simulations based on real data traces collected during 5.5 months on an active volcano. We show that our approach yields near-zero false alarm/missing rate and less than one second of detection delay while achieving up to 6-fold energy reduction over the current data collection approach.", "citation": "Citations (80)", "year": "2010", "departments": ["Michigan State University", "Michigan State University", "Michigan State University", "Georgia State University", "Washington State University"], "conf": "rtss", "authors": ["Rui Tan.....http://dblp.org/pers/hd/t/Tan:Rui", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Jinzhu Chen.....http://dblp.org/pers/hd/c/Chen:Jinzhu", "Wen-Zhan Song.....http://dblp.org/pers/hd/s/Song:Wen=Zhan", "Renjie Huang.....http://dblp.org/pers/hd/h/Huang:Renjie"], "pages": 10}