{"title": "3D video transcoding for virtual views.", "fields": ["bitstream", "scalable video coding", "video post processing", "heterogeneous network", "multiview video coding"], "abstract": "Recent emerging development of three dimensional video (3DV) has been vigorously driving the Multiview Video Coding (MVC) standard developed by Joint Video Team as an amendment to H.264/AVC and the new 3DV standard developed by MPEG. It is expected that 3DV contents will soon be available to various media consumers. Because of the heterogeneous networks and terminal devices, a variety of end users shall not have (1) the 3DV decoder and view synthesize software installed on their devices, and (2) adequate network bandwidth for 3DV content delivery. 3DV transcoder is therefore necessary for users without 3DV decoder to enjoy 3DV services, as well as for service providers to better control virtual view quality of all 3DV customers. In this paper, we report the first 3DV transcoding scheme for virtual view, which is able to generate bitstream of one single view that can be decoded by H.264/AVC. The key idea of the proposed transcoding is to appropriately generate candidate motion and modes based on motion information from other views in the original bitstream making best use of inter-view correlation. These candidate motion and modes are then properly used to encode a virtual view with significantly reduced complexity for decoding by H.264/AVC. Simulation results show that, compared to the straightforward cascade algorithm, the proposed transcoding experiences minor performance loss with a significantly reduced computation cost. Such low complexity transcoding can be deployed at various media gateways to deliver 3DV content to non-3DV devices.", "citation": "Citations (8)", "departments": ["University at Buffalo", "University at Buffalo"], "authors": ["Shujie Liu.....http://dblp.org/pers/hd/l/Liu_0001:Shujie", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "conf": "mm", "year": "2010", "pages": 4}