{"title": "Finding maximal cliques in massive networks by H*-graph.", "fields": ["strength of a graph", "intersection number", "simplex graph", "factor critical graph", "butterfly graph"], "abstract": "Maximal clique enumeration  ( MCE ) is a fundamental problem in graph theory and has important applications in many areas such as social network analysis and bioinformatics. The problem is extensively studied; however, the best existing algorithms require memory space linear in the size of the input graph. This has become a serious concern in view of the massive volume of today's fast-growing network graphs. Since MCE requires random access to different parts of a large graph, it is difficult to divide the graph into smaller parts and process one part at a time, because either the result may be incorrect and incomplete, or it incurs huge cost on merging the results from different parts. We propose a novel notion,  H*-graph , which defines the core of a network and extends to encompass the neighborhood of the core for MCE computation. We propose the first external-memory algorithm for MCE ( ExtMCE ) that uses the  H* -graph to bound the memory usage. We prove both the correctness and completeness of the result computed by ExtMCE. Extensive experiments verify that ExtMCE efficiently processes large networks that cannot be fit in the memory. We also show that the  H* -graph captures important properties of the network; thus, updating the maximal cliques in the  H* -graph retains the most essential information, with a low update cost, when it is infeasible to perform update on the entire network.", "citation": "Citations (82)", "year": "2010", "departments": ["Nanyang Technological University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Nanyang Technological University"], "conf": "sigmod", "authors": ["James Cheng.....http://dblp.org/pers/hd/c/Cheng:James", "Yiping Ke.....http://dblp.org/pers/hd/k/Ke:Yiping", "Ada Wai-Chee Fu.....http://dblp.org/pers/hd/f/Fu:Ada_Wai=Chee", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Linhong Zhu.....http://dblp.org/pers/hd/z/Zhu:Linhong"], "pages": 12}