{"title": "Learning to Optimally Exploit Multi-Channel Diversity in Wireless Systems.", "fields": ["transmitter", "channel state information", "cognitive radio", "fading", "receiver"], "abstract": "Consider a wireless system where a transmitter may send data to a set of receivers, or on various channels, experiencing random time-varying fading. The transmitter can send data to a single receiver or on a single channel at a time and may adapt its transmission power to the radio conditions of the chosen receiver/channel. Its objective is to implement a strategy defining at each time how to select the receiver/channel and transmission power, so as to maximize its throughput, i.e., its average sending rate, under an average power constraint. The optimization problem is easy when the fading conditions of all the receivers/channels are known. In many situations however, the instantaneous fading conditions are not known a priori, instead they have to be acquired, i.e., receivers/channels have to be probed, which consumes resources (time, spectrum, energy) in proportion of the number of probed receivers/channels. Hence, the transmitter may choose not to acquire the radio conditions of all the receivers/channels so as to spare resources for actual transmissions. In this paper, we aim at characterizing a joint probing, receiver/channel selection and power control strategy maximizing throughput. We provide an adaptive algorithm converging to the throughput optimal strategy. This algorithm may be used in a wide class of wireless systems with limited information, such as broadcast systems without a priori knowledge of the instantaneous Channel-State Information (CSI). But it can be also used to solve dynamic spectrum access problems such as those arising in cognitive radio systems, where secondary users can access large parts of the spectrum, but have to discover which portions of the spectrum offer more favorable radio conditions or less interference from primary users.", "citation": "Citations (18)", "departments": ["Indian Institute of Technology Bombay", "Microsoft", "Indian Institute of Technology Bombay"], "authors": ["Prasanna Chaporkar.....http://dblp.org/pers/hd/c/Chaporkar:Prasanna", "Alexandre Proutière.....http://dblp.org/pers/hd/p/Prouti=egrave=re:Alexandre", "Himanshu Asnani.....http://dblp.org/pers/hd/a/Asnani:Himanshu"], "conf": "infocom", "year": "2010", "pages": 9}