{"title": "Secure Message Transmission with Small Public Discussion.", "fields": ["message broker", "business", "secure two party computation", "secure multi party computation", "transmission", "communication complexity", "point to point", "computer security", "shared secret", "universal composability", "adversary", "communication source"], "abstract": "In the problem of secure message transmission in the public discussion model (SMT-PD), a sender wants to send a message MS ∈ {0,1} l  to a receiver privately and reliably. Sender and receiver are connected by n channels, also known as simple wires, up to of which may be maliciously controlled by a computationally unbounded adversary, as well as one public channel, which is reliable but not private. The SMT-PD abstraction has been shown instrumental in achieving secure multiparty computation on sparse networks, where a subset of the nodes are able to realize a broadcast functionality, which plays the role of the public channel. In this paper, we present the first SMT-PD protocol with sublinear (i.e., logarithmic in l, the message length) communication on the public channel. In addition, the protocol incurs a simple-wire communication complexity of O(ln/n-t), which, as we also show, is optimal. By contrast, the best known bounds in both public and simple channels were linear. Furthermore, our protocol has an optimal round complexity of (3, 2), meaning three rounds, two of which must invoke the public channel. Finally, we ask the question whether some of the lower bounds on resource use for a single execution of SMT-PD can be beaten on average through amortization. In other words, if sender and receiver must send several messages back and forth (where later messages depend on earlier ones), can they do better than the naïve solution of repeating an SMT-PD protocol each time? We show that amortization can indeed drastically reduce the use of the public channel; it is possible to limit the total number of uses of the public channel to two, no matter how many messages are ultimately sent between two nodes. (Since two uses of the public channel are required to send any reliable communication whatsoever, this is the best possible.).", "citation": "Not cited", "year": "2010", "departments": ["AT&T Labs", "University of California, Los Angeles", "AT&T Labs", "University of California, Los Angeles", "University of California, Los Angeles", "Dept. of Math., ... estone, ME, USA"], "conf": "eurocrypt", "authors": ["Juan A. Garay.....http://dblp.org/pers/hd/g/Garay:Juan_A=", "Clint Givens.....http://dblp.org/pers/hd/g/Givens:Clint", "Rafail Ostrovsky.....http://dblp.org/pers/hd/o/Ostrovsky:Rafail"], "pages": 20}