{"title": "Scalable face image retrieval with identity-based quantization and multi-reference re-ranking.", "fields": ["search engine indexing", "inverted index", "bag of words model", "hamming code", "visual word"], "abstract": "State-of-the-art image retrieval systems achieve scalability by using bag-of-words representation and textual retrieval methods, but their performance degrades quickly in the face image domain, mainly because they 1) produce visual words with low discriminative power for face images, and 2) ignore the special properties of the faces. The leading features for face recognition can achieve good retrieval performance, but these features are not suitable for inverted indexing as they are high-dimensional and global, thus not scalable in either computational or storage cost. In this paper we aim to build a scalable face image retrieval system. For this purpose, we develop a new scalable face representation using both local and global features. In the indexing stage, we exploit special properties of faces to design new component-based local features, which are subsequently quantized into visual words using a novel identity-based quantization scheme. We also use a very small hamming signature (40 bytes) to encode the discriminative global feature for each face. In the retrieval stage, candidate images are firstly retrieved from the inverted index of visual words. We then use a new multi-reference distance to re-rank the candidate images using the hamming signature. On a one-millon face database, we show that our local features and global hamming signatures are complementary — the inverted index based on local features provides candidate images with good recall, while the multi-reference re-ranking with global hamming signature leads to good precision. As a result, our system is not only scalable but also outperforms the linear scan retrieval system using the state-of-the-art face recognition feature in term of the quality.", "citation": "Citations (155)", "year": "2010", "departments": ["Tsinghua University", "Microsoft", "Microsoft", "Microsoft"], "conf": "cvpr", "authors": ["Zhong Wu.....http://dblp.org/pers/hd/w/Wu:Zhong", "Qifa Ke.....http://dblp.org/pers/hd/k/Ke:Qifa", "Jian Sun.....http://dblp.org/pers/hd/s/Sun_0001:Jian", "Heung-Yeung Shum.....http://dblp.org/pers/hd/s/Shum:Heung=Yeung"], "pages": 8}