{"title": "Routing for Energy Minimization in the Speed Scaling Model.", "fields": ["logarithm", "bounded function", "subadditivity", "superadditivity", "randomized rounding"], "abstract": "We study network optimization that considers energy minimization as an objective. Studies have shown that mechanisms such as speed scaling can significantly reduce the power consumption of telecommunication networks by matching the consumption of each network element to the amount of processing required for its carried traffic. Most existing research on speed scaling focuses on a single network element in isolation. We aim for a network-wide optimization. Specifically, we study a routing problem with the objective of provisioning guaranteed speed/bandwidth for a given demand matrix while minimizing energy consumption. Optimizing the routes critically relies on the characteristic of the energy curve $f(s)$, which is how energy is consumed as a function of the processing speed $s$. If $f$ is superadditive, we show that there is no bounded approximation in general for integral routing, i.e., each traffic demand follows a single path. This contrasts with the well-known logarithmic approximation for subadditive functions. However, for common energy curves such as polynomials $f(s) = \\mu s^{\\alpha}$, we are able to show a constant approximation via a simple scheme of randomized ounding. The scenario is quite different when a non-zero tartup cost $\\sigma$ ppears in the energy curve, e.g.\\ $f(s) = \\left\\{ \\begin{array}{ll} 0 & \\mbox{ if } s=0\\\\sigma + \\mu s^{\\alpha}& \\mbox{ if } s>0 \\end{array}\\right.$. For this case a constant approximation is no longer feasible. In fact, for any \\alpha>1$, we show an $\\Omega(\\log^{\\frac{1}{4}}N)$ hardness result under a common complexity assumption. Here $N$ is the size of the network.) On the positive side we present $O((\\sigma/\\mu)^{1/\\alpha})$ and $O(K)$ approximations, where $K$ is the number of demands.", "citation": "Citations (95)", "departments": ["Bell Labs", "Bell Labs", "University of California, San Diego", "U. Rey Juan Car ...  Madrid, Spain"], "authors": ["Matthew Andrews.....http://dblp.org/pers/hd/a/Andrews:Matthew", "Antonio Fernández.....http://dblp.org/pers/hd/f/Fern=aacute=ndez_0001:Antonio", "Lisa Zhang.....http://dblp.org/pers/hd/z/Zhang:Lisa", "Wenbo Zhao.....http://dblp.org/pers/hd/z/Zhao:Wenbo"], "conf": "infocom", "year": "2010", "pages": 9}