{"title": "Global iceberg detection over distributed data streams.", "fields": ["distributed database", "data stream", "data access", "data stream mining", "data security"], "abstract": "In today's Internet applications or sensor networks we often encounter large amounts of data spread over many physically distributed nodes. The sheer volume of the data and bandwidth constraints make it impractical to send all the data to one central node for query processing. Finding distributed icebergs—elements that may have low frequency at individual nodes but high aggregate frequency—is a problem that arises commonly in practice. In this paper we present a novel algorithm with two notable properties. First, its accuracy guarantee and communication cost are independent of the way in which element counts (for both icebergs and non-icebergs) are split amongst the nodes. Second, it works even when each distributed data set is a stream (i.e., one pass data access only). Our algorithm builds upon sketches constructed for the estimation of the second frequency moment (F 2 ) of data streams. The intuition of our idea is that when there are global icebergs in the union of these data streams the F 2  of the union becomes very large. This quantity can be estimated due to the summable nature of F 2  sketches. Our key innovation here is to establish tight theoretical guarantees of our algorithm, under certain reasonable assumptions, using an interesting combination of convex ordering theory and large deviation techniques.", "citation": "Citations (16)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "University of Miami", "Georgia Institute of Technology"], "authors": ["Haiquan (Chuck) Zhao.....http://dblp.org/pers/hd/z/Zhao:Haiquan_=Chuck=", "Ashwin Lall.....http://dblp.org/pers/hd/l/Lall:Ashwin", "Mitsunori Ogihara.....http://dblp.org/pers/hd/o/Ogihara:Mitsunori", "Jun (Jim) Xu.....http://dblp.org/pers/hd/x/Xu:Jun_=Jim="], "conf": "icde", "year": "2010", "pages": 12}