{"title": "Encrypting the internet.", "fields": ["network packet", "electronic media", "dynamic host configuration protocol", "internet traffic", "smart card", "network management", "unix", "java card", "multos", "computer forensics", "anonymity", "contactless smart card", "malware", "implementation", "encryption", "information hiding", "social cost", "data file", "digital signature", "convention", "software deployment", "inefficiency", "private network", "public key certificate", "permission", "option type", "database transaction", "open smart card development platform", "password", "ipsec", "license", "data center", "the internet", "reputation", "authorization", "management information systems", "digital forensic process", "theoretical computer science"], "abstract": "An information management system is described comprising one or more workstations running applications to allow a user of the workstation to connect to a network, such as the Internet. Each application has an analyzer, which monitors transmission data that the application is about to transmit to the network or about to receive from the network and which determines an appropriate action to take regarding that transmission data. Such actions may be extracting data from the transmission data, such as passwords and usernames, digital certificates or eCommerce transaction details for storage in a database; ensuring that the transmission data is transmitted at an encryption strength appropriate to the contents of the transmission data; determining whether a check needs to be made as to whether a digital certificate received in transmission data is in force, and determining whether a transaction about to be made by a user of one of the workstations needs third party approval before it is made. The analyzer may consult a policy data containing a policy to govern the workstations in order to make its determination. The information management system provides many advantages in the eCommerce environment to on-line trading companies, who may benefit by being able to regulate the transactions made by their staff according to their instructions in a policy data, automatically maintain records of passwords and business conducted on-line, avoid paying for unnecessary checks on the validity of digital certificates and ensure that transmissions of data made by their staff are always protected at an agreed strength of encryption.", "citation": "Citations (2,357)", "departments": ["CA Technologies", "Rutgers University", "University of Michigan", "Dartmouth College", "AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs", "MAYER YARON     ...   DECHOVICH ZAK", "MAYER YARON     ...   DECHOVICH ZAK"], "authors": ["Michael E. Kounavis.....http://dblp.org/pers/hd/k/Kounavis:Michael_E=", "Xiaozhu Kang.....http://dblp.org/pers/hd/k/Kang:Xiaozhu", "Ken Grewal.....http://dblp.org/pers/hd/g/Grewal:Ken", "Mathew Eszenyi.....http://dblp.org/pers/hd/e/Eszenyi:Mathew", "Shay Gueron.....http://dblp.org/pers/hd/g/Gueron:Shay", "David Durham.....http://dblp.org/pers/hd/d/Durham:David"], "conf": "sigcomm", "year": "2010", "pages": 12}