{"title": "Subexponential Algorithms for Unique Games and Related Problems.", "fields": ["unique games conjecture", "vertex", "disjoint sets", "spectral graph theory", "regular graph", "adjacency matrix", "max 3sat", "vertex cover"], "abstract": "Subexponential time approximation algorithms are presented for the U nique  G ames  and S mall -S et  E xpansion  problems. Specifically, for some absolute constant  c , the following two algorithms are presented.   (1) An exp( kn  e )-time algorithm that, given as input a  k -alphabet unique game on  n  variables that has an assignment satisfying 1-e c  fraction of its constraints, outputs an assignment satisfying 1-e fraction of the constraints.   (2) An exp( n  e /Δ)-time algorithm that, given as input an  n -vertex regular graph that has a set  S  of Δ n  vertices with edge expansion at most  e c  , outputs a set  S'  of at most Δ  n  vertices with edge expansion at most e.   subexponential algorithm is also presented with improved approximation to M ax  C ut , S parsest  C ut , and V ertex  C over  on some interesting subclasses of instances. These instances are graphs with low  threshold rank , an interesting new graph parameter highlighted by this work.   Khot's Unique Games Conjecture (UGC) states that it is  NP -hard to achieve approximation guarantees such as ours for U nique  G ames . While the results here stop short of refuting the UGC, they do suggest that U nique  G ames  are significantly easier than  NP -hard problems such as M ax  3-S at , M ax  3- Lin , L abel  C over , and more, which are believed not to have a subexponential algorithm achieving a nontrivial approximation ratio.   Of special interest in these algorithms is a new notion of graph decomposition that may have other applications. Namely, it is shown for every e >0 and every regular  n -vertex graph  G , by changing at most Δ fraction of  G 's edges, one can break  G  into disjoint parts so that the stochastic adjacency matrix of the induced graph on each part has at most  n  e  eigenvalues larger than 1-η, where η depends polynomially on e. The subexponential algorithm combines this decomposition with previous algorithms for U nique  G ames  on graphs with few large eigenvalues [Kolla and Tulsiani 2007; Kolla 2010].", "citation": "Citations (138)", "year": "2010", "departments": ["Princeton University", "Microsoft", "Cornell University", "Princeton University", "Princeton University", "Microsoft"], "conf": "focs", "authors": ["Sanjeev Arora.....http://dblp.org/pers/hd/a/Arora:Sanjeev", "Boaz Barak.....http://dblp.org/pers/hd/b/Barak:Boaz", "David Steurer.....http://dblp.org/pers/hd/s/Steurer:David"], "pages": 10}