{"title": "Opportunistic Routing in Multi-radio Multi-channel Multi-hop Wireless Networks.", "fields": ["network packet", "multiplexing", "transmitter", "co channel interference", "channel allocation schemes", "spatial multiplexing", "throughput", "antenna diversity", "hop"], "abstract": "Two major factors that limit the throughput in multi-hop wireless networks are the unreliability of wireless transmissions and co-channel interference. One promising technique that combats lossy wireless transmissions is opportunistic routing (OR). OR involves multiple forwarding candidates to relay packets by taking advantage of the broadcast nature and spacial diversity of the wireless medium. Furthermore, recent advances in multi-radio multi-channel transmission technology allows more concurrent transmissions in the network, and shows the potential of substantially improving the system capacity. However, the performance of OR in multi-radio multi-channel systems is still unknown, and the methodology of studying the performance of traditional routing (TR) can not be directly applied to OR. In this paper, we present our research on computing an end-to-end throughput bound of OR in multi-radio multi-channel systems. We formulate the capacity of OR as a linear programming (LP) problem which jointly solves the radio-channel assignment and transmission scheduling. Leveraging our analytical model, we gain the following insights into OR: 1) OR can achieve better performance than TR under different radio/channel configurations, however, in particular scenarios, TR is more preferable than OR; 2) OR can achieve comparable or even better performance than TR by using less radio resource; 3) for OR, the throughput gained from increasing the number of potential forwarding candidates becomes marginal.", "citation": "Citations (27)", "departments": ["University of California, Davis", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "University of California, Davis", "Dept. of Electr ... cester, MA, USA", "Dept. of Electr ... cester, MA, USA"], "authors": ["Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0001:Kai", "Zhenyu Yang.....http://dblp.org/pers/hd/y/Yang:Zhenyu", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing"], "conf": "infocom", "year": "2010", "pages": 5}