{"title": "Discrete Gene Regulatory Networks (dGRNs): A Novel Approach to Configuring Sensor Networks.", "fields": ["gene regulatory network", "adaptive algorithm", "duty cycle", "dynamic network analysis", "neighbor discovery protocol"], "abstract": "The operation of a sensor network is determined by a large number of parameters, such as the radio duty cycle, the frequency of neighbor discovery beacons, and the rate of sampling sensors. Writing adaptive algorithms to tune these parameters in dynamic network conditions is a challenging task that requires expert knowledge, and many design-test-rewrite cycles. This paper proposes a novel nature-inspired paradigm, termed discrete Gene Regulatory Network (dGRN), for configuring sensor networks. The idea is that nodes should regulate their parameters based on their local state and state communicated from neighbor nodes, in a similar manner that cells regulate their behavior based on local levels of protein concentrations, and proteins diffused from neighbor cells. The proposed dGRN paradigm has two major strengths: 1) it is general-purpose, and can be applied to a variety of parameter tuning problems; and 2) it generates parameter tuning code automatically removing the need for a human expert. We demonstrate the feasibility of the dGRN approach in a scenario where nodes must tune their sampling rates to track a moving target with a certain accuracy. The automatically generated code exhibits properties similar to the ones that one would expect from expert-designed code, such as aggressive sampling when the target moves fast and the sensing range is low, and relaxed sampling otherwise. Moreover, the automatically generated code causes nodes to communicate with each other to coordinate their tuning tasks, as one would expect from expert-designed code. The resulting dGRN code is evaluated both in a simulation environment, and in a real environment with eight T-Mote Sky nodes tracking a light-emitting target.", "citation": "Citations (14)", "departments": ["University of Oxford", "University of Oxford"], "authors": ["Andrew Markham.....http://dblp.org/pers/hd/m/Markham:Andrew", "Agathoniki Trigoni.....http://dblp.org/pers/hd/t/Trigoni:Agathoniki"], "conf": "infocom", "year": "2010", "pages": 9}