{"title": "Gaussian Process Latent Random Field.", "fields": ["latent variable model", "markov random field", "latent class model", "curse of dimensionality", "nonlinear dimensionality reduction"], "abstract": "The Gaussian process latent variable model (GPLVM) is an unsupervised probabilistic model for nonlinear dimensionality reduction. A supervised extension, called discriminative GPLVM (DGPLVM), incorporates supervisory information into GPLVM to enhance the classification performance. However, its limitation of the latent space dimensionality to at most C - 1 (C is the number of classes) leads to unsatisfactorily performance when the intrinsic dimensionality of the application is higher than C - 1. In this paper, we propose a novel supervised extension of GPLVM, called Gaussian process latent random field (GPLRF), by enforcing the latent variables to be a Gaussian Markov random field with respect to a graph constructed from the supervisory information. In GPLRF, the dimensionality of the latent space is no longer restricted to at most C - 1. This makes GPLRF much more flexible than DGPLVM in applications. Experiments conducted on both synthetic and real-world data sets demonstrate that GPLRF performs comparably with DGPLVM and other state-of-the-art methods on data sets with intrinsic dimensionality at most C - 1, and dramatically outperforms DG-PLVM on data sets when the intrinsic dimensionality exceeds C - 1.", "citation": "Citations (15)", "departments": ["Chinese Academy of Sciences", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Guoqiang Zhong.....http://dblp.org/pers/hd/z/Zhong:Guoqiang", "Wu-Jun Li.....http://dblp.org/pers/hd/l/Li:Wu=Jun", "Dit-Yan Yeung.....http://dblp.org/pers/hd/y/Yeung:Dit=Yan", "Xinwen Hou.....http://dblp.org/pers/hd/h/Hou:Xinwen", "Cheng-Lin Liu.....http://dblp.org/pers/hd/l/Liu:Cheng=Lin"], "conf": "aaai", "year": "2010", "pages": -1}