{"title": "Image segmentation with patch-pair density priors.", "fields": ["content based image retrieval", "segmentation based object categorization", "range segmentation", "feature detection", "automatic image annotation"], "abstract": "In this paper, we investigate how an unlabeled image corpus can facilitate the segmentation of any given image. A simple yet efficient multi-task joint sparse representation model is presented to augment the patch-pair similarities by harnessing the newly discovered patch-pair density priors. First, each image in over-segmented as a set of patches, and the adjacent patch-pair density priors, statistically calculated from the unlabeled image corpus, bring an intuitively explainable and informative observation that kindred patch-pairs generally have higher densities that inhomogeneous patch-pairs. Then for each adjacent patch-pair within the given image, high-density biased multi-task joint sparse reconstruction is pursued such that 1) both individual patches and patch-pair can be reconstructed with few patch-pairs from the unlabeled image corpus, and 2) the patch-pairs selected for reconstruction are high-density biased, namely, preferring patch-pairs belonging to the same semantic region. In this way, the overall reconstruction residue well conveys the discriminative information on whether these two patches belong to the same semantic region, and consequently the patch affinity matrix is augmented by reconstruction residues for all adjacent patch-pairs within the given image. The ultimate image segmentation is derived by employing the popular normalized cut approach over the augmented patch affinity matrix. Extensive image segmentation experiments over two public databases clearly demonstrate the superiority of the proposed solution over several state-of-the-art algorithms. Furthermore, the algorithmic practicality is well validated with comparison experiments on content-based image retrieval and multi-label image annotation performed over image segmentation outputs.", "citation": "Citations (4)", "departments": ["Huazhong University of Science and Technology", "National University of Singapore", "National University of Singapore", "Huazhong University of Science and Technology"], "authors": ["Xiaobai Liu.....http://dblp.org/pers/hd/l/Liu:Xiaobai", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai"], "conf": "mm", "year": "2010", "pages": 10}