{"title": "A Systematic Approach for Evolving VLAN Designs.", "fields": ["campus network", "trade off", "broadcasting", "snapshot", "virtual lan"], "abstract": "Enterprise networks are large and complex, and their designs must be frequently altered to adapt to changing organizational needs. The process of redesigning and reconfiguring enterprise networks is ad-hoc and error-prone, and configuration errors could cause serious issues such as network outages. In this paper, we take a step towards systematic evolution of network designs in the context of virtual local area networks (VLANs). We focus on VLANs given their importance and prevalence, the frequent need to change VLAN designs, and the time-consuming and error-prone process of making changes. We present algorithms for common design tasks encountered in evolving VLANs such as deciding which VLAN a new host must be assigned to. Our algorithms trade off multiple criteria such as broadcast traffic costs, and costs associated with maintaining spanning trees for each VLAN in the network, while honoring correctness and feasibility constraints on the design. Our algorithms also enable automatic detection of network-wide dependencies which must be factored when reconfiguring VLANs. We evaluate our algorithms on longitudinal snapshots of configuration files of a large-scale operational campus network obtained over a two year period. Our results show that our algorithms can produce significantly better designs than current practice, while avoiding errors and minimizing human work. Our unique data-sets also enable us to characterize VLAN related change activity in real networks, an important contribution in its own right.", "citation": "Citations (26)", "departments": ["Purdue University", "Purdue University", "Purdue University", "Purdue University"], "authors": ["Xin Sun.....http://dblp.org/pers/hd/s/Sun_0002:Xin", "Yu-Wei Eric Sung.....http://dblp.org/pers/hd/s/Sung:Yu=Wei_Eric", "Sunil Krothapalli.....http://dblp.org/pers/hd/k/Krothapalli:Sunil", "Sanjay G. Rao.....http://dblp.org/pers/hd/r/Rao:Sanjay_G="], "conf": "infocom", "year": "2010", "pages": 9}