{"title": "Fuzzy Keyword Search over Encrypted Data in Cloud Computing.", "fields": ["fuzzy set", "rendering", "encryption", "fuzzy control system", "database", "exploit", "fuzzy logic", "edit distance", "tree structure", "keyword density", "information privacy", "information retrieval", "cloud computing"], "abstract": "As Cloud Computing becomes prevalent, more and more sensitive information are being centralized into the cloud. For the protection of data privacy, sensitive data usually have to be encrypted before outsourcing, which makes effective data utilization a very challenging task. Although traditional searchable encryption schemes allow a user to securely search over encrypted data through keywords and selectively retrieve files of interest, these techniques support only exact keyword search. That is, there is no tolerance of minor typos and format inconsistencies which, on the other hand, are typical user searching behavior and happen very frequently. This significant drawback makes existing techniques unsuitable in Cloud Computing as it greatly affects system usability, rendering user searching experiences very frustrating and system efficacy very low. In this paper, for the first time we formalize and solve the problem of effective fuzzy keyword search over encrypted cloud data while maintaining keyword privacy. Fuzzy keyword search greatly enhances system usability by returning the matching files when users' searching inputs exactly match the predefined keywords or the closest possible matching files based on keyword similarity semantics, when exact match fails. In our solution, we exploit edit distance to quantify keywords similarity and develop an advanced technique on constructing fuzzy keyword sets, which greatly reduces the storage and representation overheads. Through rigorous security analysis, we show that our proposed solution is secure and privacy-preserving, while correctly realizing the goal of fuzzy keyword search.", "citation": "Not cited", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology", "Worcester Polytechnic Institute", "Illinois Institute of Technology"], "authors": ["Jin Li.....http://dblp.org/pers/hd/l/Li_0002:Jin", "Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong", "Ning Cao.....http://dblp.org/pers/hd/c/Cao_0001:Ning", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing"], "conf": "infocom", "year": "2010", "pages": 5}