{"title": "Privacy-Preserving Public Auditing for Data Storage Security in Cloud Computing.", "fields": ["audit", "access network", "public key cryptography", "data security", "outsourcing", "provisioning", "information privacy", "external auditor", "cloud computing security"], "abstract": "Cloud Computing is the long dreamed vision of computing as a utility, where users can remotely store their data into the cloud so as to enjoy the on-demand high quality applications and services from a shared pool of configurable computing resources. By data outsourcing, users can be relieved from the burden of local data storage and maintenance. However, the fact that users no longer have physical possession of the possibly large size of outsourced data makes the data integrity protection in Cloud Computing a very challenging and potentially formidable task, especially for users with constrained computing resources and capabilities. Thus, enabling public auditability for cloud data storage security is of critical importance so that users can resort to an external audit party to check the integrity of outsourced data when needed. To securely introduce an effective third party auditor (TPA), the following two fundamental requirements have to be met: 1) TPA should be able to efficiently audit the cloud data storage without demanding the local copy of data, and introduce no additional on-line burden to the cloud user; 2) The third party auditing process should bring in no new vulnerabilities towards user data privacy. In this paper, we utilize and uniquely combine the public key based homomorphic authenticator with random masking to achieve the privacy-preserving public cloud data auditing system, which meets all above requirements. To support efficient handling of multiple auditing tasks, we further explore the technique of bilinear aggregate signature to extend our main result into a multi-user setting, where TPA can perform multiple auditing tasks simultaneously. Extensive security and performance analysis shows the proposed schemes are provably secure and highly efficient.", "citation": "Not cited", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology", "Worcester Polytechnic Institute"], "authors": ["Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong", "Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing"], "conf": "infocom", "year": "2010", "pages": 9}