{"title": "Individualized ROI Optimization via Maximization of Group-wise Consistency of Structural and Functional Profiles.", "fields": ["simulated annealing", "brain mapping", "maximization", "optimization problem", "machine learning"], "abstract": "Functional segregation and integration are fundamental characteristics of the human brain. Studying the connectivity among segregated regions and the dynamics of integrated brain networks has drawn increasing interest. A very controversial, yet fundamental issue in these studies is how to determine the best functional brain regions or ROIs (regions of interests) for individuals. Essentially, the computed connectivity patterns and dynamics of brain networks are very sensitive to the locations, sizes, and shapes of the ROIs. This paper presents a novel methodology to optimize the locations of an individual's ROIs in the working memory system. Our strategy is to formulate the individual ROI optimization as a group variance minimization problem, in which group-wise functional and structural connectivity patterns, and anatomic profiles are defined as optimization constraints. The optimization problem is solved via the simulated annealing approach. Our experimental results show that the optimized ROIs have significantly improved consistency in structural and functional profiles across subjects, and have more reasonable localizations and more consistent morphological and anatomic profiles.", "citation": "Citations (39)", "departments": ["Northwestern Polytechnical University", "Northwestern Polytechnical University", "University of Georgia", "University of Georgia", "University of Georgia"], "authors": ["Kaiming Li.....http://dblp.org/pers/hd/l/Li:Kaiming", "Lei Guo.....http://dblp.org/pers/hd/g/Guo_0002:Lei", "Carlos Faraco.....http://dblp.org/pers/hd/f/Faraco:Carlos", "Dajiang Zhu.....http://dblp.org/pers/hd/z/Zhu:Dajiang", "Fan Deng.....http://dblp.org/pers/hd/d/Deng:Fan", "Tuo Zhang.....http://dblp.org/pers/hd/z/Zhang:Tuo", "Xi Jiang.....http://dblp.org/pers/hd/j/Jiang:Xi", "Degang Zhang.....http://dblp.org/pers/hd/z/Zhang:Degang", "Hanbo Chen.....http://dblp.org/pers/hd/c/Chen:Hanbo", "Xintao Hu.....http://dblp.org/pers/hd/h/Hu:Xintao", "L. Stephen Miller.....http://dblp.org/pers/hd/m/Miller:L=_Stephen", "Tianming Liu.....http://dblp.org/pers/hd/l/Liu:Tianming"], "conf": "nips", "year": "2010", "pages": 9}