{"title": "Limitations and Possibilities of Path Trading between Autonomous Systems.", "fields": ["network packet", "approximation algorithm", "autonomous system", "peering", "shortest path problem"], "abstract": "When forwarding packets in the Internet, Autonomous Systems (ASes) frequently choose the shortest path in their network to the next-hop AS in the BGP path, a strategy known as hot-potato routing. As a result, paths in the Internet are suboptimal from a global perspective. For peering ASes who exchange traffic without payments, path trading - complementary deviations from hot- potato routing - appears to be a desirable solution to deal with these inefficiencies. In recent years, path trading approaches have been suggested as means for interdomain traffic engineering between neighboring ASes, as well as between multiple ASes to achieve global efficiency. Surprisingly, little is known on the computational complexity of finding path trading solutions, or the conditions which guarantee the optimality or even approximability of a path trading protocol. In this paper we explore the computational feasibility of computing path trading solutions between peering ASes. We first show that finding a path trading solution between a pair of ASes is NP- complete, and that path-trading solutions are even NP-hard to approximate. We continue to explore the feasibility of implementing policies between multiple ASes and show that, even if the bilateral path trading problem is tractable for every AS pair in the set of trading ASes, path trading between multiple ASes is NP- hard, and NP-hard to approximate as well. Despite the above negative results, we show a pseudo-polynomial algorithm to compute path trading solutions. Thus, if the range of the instances is bounded, we show one can compute solutions efficiently for peering ASes. We evaluate the path trading algorithm on pairs of ASes using real network topologies. Specifically, we use real PoP-level maps of ASes in the Internet to show that path trading can substantially mitigate the inefficiencies associated with hot-potato routing.", "citation": "Citations (4)", "departments": ["Tel Aviv University", "University of California, Berkeley"], "authors": ["Yuval Shavitt.....http://dblp.org/pers/hd/s/Shavitt:Yuval", "Yaron Singer.....http://dblp.org/pers/hd/s/Singer:Yaron"], "conf": "infocom", "year": "2010", "pages": 9}