{"title": "Analyzing the Performance of Greedy Maximal Scheduling via Local Pooling and Graph Theory.", "fields": ["graph theory", "greedy randomized adaptive search procedure", "bipartite graph", "machine learning", "pooling", "throughput", "greedy algorithm", "scheduling", "network topology"], "abstract": "Efficient operation of wireless networks and switches requires using simple scheduling algorithms. In general, simple greedy algorithms (known as Greedy Maximal Scheduling - GMS) are guaranteed to achieve only a fraction of the maximum possible throughput. It was recently shown that in networks in which the  Local Pooling  conditions are satisfied, GMS achieves 100% throughput. Moreover, in networks in which the σ-Local Pooling conditions hold, GMS achieves σ% throughput. In this extended abstract, we characterize  all the network graphs in which Local Pooling holds under primary interference constraints . We then show that  in all bipartite graphs (i.e., input-queued switches) of size up to 7×n, GMS is guaranteed to achieve 66% throughput , thereby improving upon the previously known 50% lower bound. Finally, we study the performance of GMS in interference graphs and show that in certain specific topologies its performance could be very bad. Overall, we demonstrate that using graph theoretical techniques can significantly contribute to our understanding of greedy scheduling algorithms. The proofs of the results have been omitted for brevity and can be found in [1].", "citation": "Not cited", "departments": ["Columbia University", "Columbia University", "University of Warwick", "Princeton University", "Columbia University", "Columbia University", "Columbia University", "Paris Dauphine University", "Princeton University", "Columbia University", "Columbia University", "Columbia University", "University of Warwick", "Princeton University", "Columbia University"], "authors": ["Berk Birand.....http://dblp.org/pers/hd/b/Birand:Berk", "Maria Chudnovsky.....http://dblp.org/pers/hd/c/Chudnovsky:Maria", "Bernard Ries.....http://dblp.org/pers/hd/r/Ries:Bernard", "Paul D. Seymour.....http://dblp.org/pers/hd/s/Seymour:Paul_D=", "Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil", "Yori Zwols.....http://dblp.org/pers/hd/z/Zwols:Yori"], "conf": "infocom", "year": "2010", "pages": 9}