{"title": "Collaborative Data Compression Using Clustered Source Coding for Wireless Multimedia Sensor Networks.", "fields": ["cluster analysis", "coding gain", "context adaptive binary arithmetic coding", "coding tree unit", "speech coding"], "abstract": "Data redundancy caused by correlation has motivated the application of collaborative multimedia in-network processing for data filtering and compression in wireless multimedia sensor networks (WMSNs). This paper proposes an information theoretic data compression framework with an objective to maximize the overall compression of the visual information gathered in a WMSN. To achieve this, an entropy-based divergence measure (EDM) scheme is proposed to predict the compression efficiency of performing joint coding on the images collected by spatially correlated cameras. The novelty of EDM relies on its independence of the specific image types and coding algorithms, thereby providing a generic mechanism for prior evaluation of compression under different coding solutions. Utilizing the predicted results from EDM, a distributed multi-cluster coding protocol (DMCP) is proposed to construct a compression-oriented coding hierarchy. The DMCP aims to partition the entire network into a set of coding clusters such that the global coding gain is maximized. Moreover, in order to enhance decoding reliability at data sink, the DMCP also guarantees that each sensor camera is covered by at least two different coding clusters. Experiments on H.264 standards show that the proposed EDM can effectively predict the joint coding efficiency from multiple sources. Further simulations demonstrate that the proposed compression framework can reduce 10% - 23% total coding rate compared with the individual coding scheme, i.e., each camera sensor compresses its own image independently.", "citation": "Citations (73)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Pu Wang.....http://dblp.org/pers/hd/w/Wang:Pu", "Rui Dai.....http://dblp.org/pers/hd/d/Dai:Rui", "Ian F. Akyildiz.....http://dblp.org/pers/hd/a/Akyildiz:Ian_F="], "conf": "infocom", "year": "2010", "pages": 9}