{"title": "Detecting inconsistencies in distributed data.", "fields": ["functional dependency", "sql", "centralized database", "data quality", "tuple"], "abstract": "One of the central problems for data quality is inconsistency detection. Given a database D and a set Σ of dependencies as data quality rules, we want to identify tuples in D that violate some rules in Σ. When D is a centralized database, there have been effective SQL-based techniques for finding violations. It is, however, far more challenging when data in D is distributed, in which inconsistency detection often necessarily requires shipping data from one site to another. This paper develops techniques for detecting violations of conditional functional dependencies (CFDs) in relations that are fragmented and distributed across different sites. (1) We formulate the detection problem in various distributed settings as optimization problems, measured by either network traffic or response time. (2)We show that it is beyond reach in practice to find optimal detection methods: the detection problem is NP-complete when the data is partitioned either horizontally or vertically, and when we aim to minimize either data shipment or response time. (3) For data that is horizontally partitioned, we provide several algorithms to find violations of a set of CFDs, leveraging the structure of CFDs to reduce data shipment or increase parallelism. (4) We verify experimentally that our algorithms are scalable on large relations and complex CFDs. (5) For data that is vertically partitioned, we provide a characterization for CFDs to be checked locally without requiring data shipment, in terms of dependency preservation. We show that it is intractable to minimally refine a partition and make it dependency preserving.", "citation": "Citations (27)", "departments": ["University of Edinburgh", "University of Edinburgh", "University of Edinburgh", "University of Edinburgh"], "authors": ["Wenfei Fan.....http://dblp.org/pers/hd/f/Fan:Wenfei", "Floris Geerts.....http://dblp.org/pers/hd/g/Geerts:Floris", "Shuai Ma.....http://dblp.org/pers/hd/m/Ma:Shuai", "Heiko Müller.....http://dblp.org/pers/hd/m/M=uuml=ller:Heiko"], "conf": "icde", "year": "2010", "pages": 12}