{"title": "Extending Access Point Connectivity through Opportunistic Routing in Vehicular Networks.", "fields": ["network packet", "vehicular communication systems", "navigation system", "vehicular ad hoc network", "leverage"], "abstract": "Abstract-Nowadays, the navigation systems available on cars are becoming more and more sophisticated. They greatly improve the experience of drivers and passengers by enabling them to receive map and traffic updates, news feeds, advertisements, media files, etc. Unfortunately, the bandwidth available to each vehicle with the current technology is severely limited. There have been many reports on the inability of 3G networks to cope with large size file downloads, especially in dense and mobile settings. A possible alternative is provided by WiFi access points (APs) that are being installed in several countries along the main routes and in popular areas. Although this approach significantly increases the available bandwidth, it still does not provide a fully satisfactory solution due to the limited transmission range (usually a few hundred meters). In this paper we present a novel routing protocol, based on opportunistic vehicle to vehicle communication, to enable efficient multi-hop routing capabilities between mobile vehicles and APs. Unlike prior work, this protocol fully supports two- way communication, i.e., the traditional vehicle-to-AP as well as the more challenging AP-to-vehicle. We leverage the information offered by the navigation system in terms of final destination and path, to i) route packets to the closest AP and ii) to route replies back to the moving vehicle efficiently.", "citation": "Citations (81)", "departments": ["University of Cambridge", "Microsoft", "University of Cambridge"], "authors": ["Ilias Leontiadis.....http://dblp.org/pers/hd/l/Leontiadis:Ilias", "Paolo Costa.....http://dblp.org/pers/hd/c/Costa:Paolo", "Cecilia Mascolo.....http://dblp.org/pers/hd/m/Mascolo:Cecilia"], "conf": "infocom", "year": "2010", "pages": 5}