{"title": "Enhanced exploration of oral history archives through processed video and synchronized text transcripts.", "fields": ["contextual inquiry", "transaction log", "heuristic evaluation", "video library", "exploratory search"], "abstract": "A digital video library of over 900 hours of video and 18000 stories from The HistoryMakers was used by 266 students, faculty, librarians, and life-long learners interacting with a system providing multiple search and viewing capabilities over a trial period of several months. User demographics and actions were logged with this multimedia collection, providing quantitative and qualitative metrics on system use. These transaction logs were complemented with heuristic evaluation, interviews, and contextual inquiry with representative users. Collectively, these mixed methods informed the development of the next generation web-based interface for the HistoryMakers video oral histories to improve access to and dissemination of this rich cultural resource. In particular, the feature of a synchronized text transcript in the video player for the narratives merited further investigation. Such an interface has not seen widespread use in digital video players available on the web, yet was valued highly by oral history archive viewers. A user study with 27 participants measured the utility of the HistoryMakers web interface incorporating the synchronized transcript video player for stated fact-finding and open-ended tasks. For life oral histories, an aligned text transcript is valued for both tasks, with the video rated significantly more useful for open-ended tasks over fact-finding. These results suggest a task-dependent role of modality in presentation of oral histories, with synchronized transcripts rated highly across tasks.", "citation": "Citations (3)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "The HistoryMake ... hicago, IL, USA"], "authors": ["Michael G. Christel.....http://dblp.org/pers/hd/c/Christel:Michael_G=", "Scott M. Stevens.....http://dblp.org/pers/hd/s/Stevens:Scott_M=", "Bryan Maher.....http://dblp.org/pers/hd/m/Maher:Bryan", "Julieanna Richardson.....http://dblp.org/pers/hd/r/Richardson:Julieanna"], "conf": "mm", "year": "2010", "pages": 10}