{"title": "Chip and PIN is Broken.", "fields": ["chip authentication program", "atm card", "card security code", "debit card", "chargeback"], "abstract": "EMV is the dominant protocol used for smart card payments worldwide, with over 730 million cards in circulation. Known to bank customers as “Chip and PIN”, it is used in Europe; it is being introduced in Canada; and there is pressure from banks to introduce it in the USA too. EMV secures credit and debit card transactions by authenticating both the card and the customer presenting it through a combination of cryptographic authentication codes, digital signatures, and the entry of a PIN. In this paper we describe and demonstrate a protocol flaw which allows criminals to use a genuine card to make a payment without knowing the card’s PIN, and to remain undetected even when the merchant has an online connection to the banking network. The fraudster performs a man-in-the-middle attack to trick the terminal into believing the PIN verified correctly, while telling the card that no PIN was entered at all. The paper considers how the flaws arose, why they remained unknown despite EMV’s wide deployment for the best part of a decade, and how they might be fixed. Because we have found and validated a practical attack against the core functionality of EMV, we conclude that the protocol is broken. This failure is significant in the field of protocol design, and also has important public policy implications, in light of growing reports of fraud on stolen EMV cards. Frequently, banks deny such fraud victims a refund, asserting that a card cannot be used without the correct PIN, and concluding that the customer must be grossly negligent or lying. Our attack can explain a number of these cases, and exposes the need for further research to bridge the gap between the theoretical and practical security of bank payment systems. It also demonstrates the need for the next version of EMV to be engineered properly.", "citation": "Citations (217)", "departments": ["University of Cambridge", "University of Cambridge", "University of Cambridge", "University of Cambridge"], "authors": ["Steven J. Murdoch.....http://dblp.org/pers/hd/m/Murdoch:Steven_J=", "Saar Drimer.....http://dblp.org/pers/hd/d/Drimer:Saar", "Ross J. Anderson.....http://dblp.org/pers/hd/a/Anderson:Ross_J=", "Mike Bond.....http://dblp.org/pers/hd/b/Bond:Mike"], "conf": "sp", "year": "2010", "pages": 14}