{"title": "Shoestring: probabilistic soft error reliability on the cheap.", "fields": ["fault injection", "soft error", "software deployment", "probabilistic logic", "compile time"], "abstract": "Aggressive technology scaling provides designers with an ever increasing budget of cheaper and faster transistors. Unfortunately, this trend is accompanied by a decline in individual device reliability as transistors become increasingly susceptible to soft errors. We are quickly approaching a new era where resilience to soft errors is no longer a luxury that can be reserved for just processors in high-reliability, mission-critical domains. Even processors used in mainstream computing will soon require protection. However, due to tighter profit margins, reliable operation for these devices must come at little or no cost. This paper presents Shoestring, a minimally invasive software solution that provides high soft error coverage with very little overhead, enabling its deployment even in commodity processors with \"shoestring\" reliability budgets. Leveraging intelligent analysis at compile time, and exploiting low-cost, symptom-based error detection, Shoestring is able to focus its efforts on protecting statistically-vulnerable portions of program code. Shoestring effectively applies instruction duplication to protect only those segments of code that, when subjected to a soft error, are likely to result in user-visible faults without first exhibiting symptomatic behavior. Shoestring is able to recover from an additional 33.9% of soft errors that are undetected by a symptom-only approach, achieving an overall user-visible failure rate of 1.6%. This reliability improvement comes at a modest performance overhead of 15.8%.", "citation": "Citations (207)", "year": "2010", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "conf": "asplos", "authors": ["Shuguang Feng.....http://dblp.org/pers/hd/f/Feng:Shuguang", "Shantanu Gupta.....http://dblp.org/pers/hd/g/Gupta:Shantanu", "Amin Ansari.....http://dblp.org/pers/hd/a/Ansari:Amin", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A="], "pages": 12}