{"title": "Structure-Preserving Signatures and Commitments to Group Elements.", "fields": ["random oracle", "oblivious transfer", "group signature", "commitment scheme", "blind signature", "cryptographic hash function", "bilinear interpolation", "cryptographic primitive"], "abstract": "A modular approach for cryptographic protocols leads to a simple design but often inefficient constructions. On the other hand, ad hoc constructions may yield efficient protocols at the cost of losing conceptual simplicity. We suggest structure-preserving commitments and signatures to overcome this dilemma and provide a way to construct modular protocols with reasonable efficiency, while retaining conceptual simplicity.\n\nWe focus on schemes in bilinear groups that preserve parts of the group structure, which makes it easy to combine them with other primitives such as non-interactive zero-knowledge proofs for bilinear groups.\n\nWe say that a signature scheme is structure-preserving if its verification keys, signatures, and messages are elements in a bilinear group, and the verification equation is a conjunction of pairing-product equations. If moreover the verification keys lie in the message space, we call them automorphic. We present several efficient instantiations of automorphic and structure-preserving signatures, enjoying various other additional properties, such as simulatability. Among many applications, we give three examples: adaptively secure round-optimal blind signature schemes, a group signature scheme with efficient concurrent join, and an efficient instantiation of anonymous proxy signatures.\n\nA further contribution is homomorphic trapdoor commitments to group elements which are also length reducing. In contrast, the messages of previous homomorphic trapdoor commitment schemes are exponents.", "citation": "Citations (272)", "departments": ["École Normale Supérieure", "University College London", "New York University", "National Institute of Information and Communications Technology", "Institute of Science and Technology Austria", "University College London", "IBM", "Information Sha ... oration, Japan", "NTT Secure Plat ... Japan 180-8585", "Security Fundam ... Japan 184-8795"], "authors": ["Masayuki Abe.....http://dblp.org/pers/hd/a/Abe:Masayuki", "Georg Fuchsbauer.....http://dblp.org/pers/hd/f/Fuchsbauer:Georg", "Jens Groth.....http://dblp.org/pers/hd/g/Groth:Jens", "Kristiyan Haralambiev.....http://dblp.org/pers/hd/h/Haralambiev:Kristiyan", "Miyako Ohkubo.....http://dblp.org/pers/hd/o/Ohkubo:Miyako"], "conf": "crypto", "year": "2010", "pages": 28}