{"title": "Ricardo: integrating R and Hadoop.", "fields": ["research center", "terabyte", "ranging", "data management", "analytics"], "abstract": "Many modern enterprises are collecting data at the most detailed level possible, creating data repositories ranging from terabytes to petabytes in size. The ability to apply sophisticated statistical analysis methods to this data is becoming essential for marketplace competitiveness. This need to perform deep analysis over huge data repositories poses a significant challenge to existing statistical software and data management systems. On the one hand, statistical software provides rich functionality for data analysis and modeling, but can handle only limited amounts of data; e.g., popular packages like R and SPSS operate entirely in main memory. On the other hand, data management systems - such as MapReduce-based systems - can scale to petabytes of data, but provide insufficient analytical functionality. We report our experiences in building Ricardo, a scalable platform for deep analytics. Ricardo is part of the eXtreme Analytics Platform (XAP) project at the IBM Almaden Research Center, and rests on a decomposition of data-analysis algorithms into parts executed by the R statistical analysis system and parts handled by the Hadoop data management system. This decomposition attempts to minimize the transfer of data across system boundaries. Ricardo contrasts with previous approaches, which try to get along with only one type of system, and allows analysts to work on huge datasets from within a popular, well supported, and powerful analysis environment. Because our approach avoids the need to re-implement either statistical or data-management functionality, it can be used to solve complex problems right now.", "citation": "Citations (218)", "year": "2010", "departments": ["University of California, Santa Barbara", "IBM", "IBM", "IBM", "IBM"], "conf": "sigmod", "authors": ["Sudipto Das.....http://dblp.org/pers/hd/d/Das:Sudipto", "Yannis Sismanis.....http://dblp.org/pers/hd/s/Sismanis:Yannis", "Kevin S. Beyer.....http://dblp.org/pers/hd/b/Beyer:Kevin_S=", "Rainer Gemulla.....http://dblp.org/pers/hd/g/Gemulla:Rainer", "Peter J. Haas.....http://dblp.org/pers/hd/h/Haas:Peter_J=", "John McPherson.....http://dblp.org/pers/hd/m/McPherson:John"], "pages": 12}