{"title": "An empirical analysis of team review approaches for teaching quality software development.", "fields": ["personal software process", "software technical review", "software development process", "software walkthrough", "software peer review"], "abstract": "Reviews are an integral part of the software development process. They are one of the key methodologies that undergraduates study in order to develop quality software. Despite their importance, reviews are rarely used in software engineering projects at the baccalaureate level. This paper demonstrates results from a study conducted on students at baccalaureate level enrolled in a one-semester software engineering course at the National University of Computer and Emerging Sciences -- Foundation for Advancement of Science and Technology (NUCES-FAST) in Pakistan. The objectives of the study are: to determine how the various team review techniques help to educate students about the importance of the review process and find which technique is more suitable for teaching reviews to undergraduates. Two variations on team review are proposed: Similar Domain Review (SDR) and Cross-Domain Review (CDR) without author. The paper presents a comparison of the proposed and existing team review techniques and measures their effectiveness in terms of defect detection. The results show that the proposed variation SDR is more effective in defect detection than CDR (with/without author). Another interesting result is that the proposed CDR-without author is better than CDR with author (the existing team review approach). Also, early defect detection enabled students to incorporate changes and improve the software quality.", "citation": "Citations (1)", "departments": ["National University of Computer and Emerging Sciences", "National University of Computer and Emerging Sciences", "University of Agriculture, Faisalabad", "National University of Computer and Emerging Sciences", "National University of Computer and Emerging Sciences"], "authors": ["Amna Humayun.....http://dblp.org/pers/hd/h/Humayun:Amna", "Wafa Basit.....http://dblp.org/pers/hd/b/Basit:Wafa", "Ghulam A. Farrukh.....http://dblp.org/pers/hd/f/Farrukh:Ghulam_A=", "Fakhar Lodhi.....http://dblp.org/pers/hd/l/Lodhi:Fakhar", "Rabea Aden.....http://dblp.org/pers/hd/a/Aden:Rabea"], "conf": "icse", "year": "2010", "pages": 9}