{"title": "Approximate image color correlograms.", "fields": ["binary image", "visual word", "automatic image annotation", "feature detection", "caltech 101"], "abstract": "The recent explosion in Internet usage and the growing amount of digital images caused by the more and more ubiquitous presence of digital cameras has created a demand for effective and flexible techniques for automatic image retrieval. As the volume of the data increases, memory and processing requirements need to correspondingly increase at the same rapid pace, and this is often prohibitively expensive. Image collections on this scale make performing even the most common and simple image processing and machine learning tasks non trivial. In this paper we present a method to reduce the computational complexity of a widely known method for image indexing and retrieval based on a second order statistical measure. The aim of the paper is twofold: Q1) is it possible to efficiently extract an approximate distribution of the image features with a resulting low error? Q2) how the resulting approximate distribution affects the similarity-based accuracy? In particular, we propose a sampling method to approximate the distribution of correlograms, adopting a Monte Carlo approach to compute the distribution on a subset of pixels uniformly sampled from the original image. A further variant is to sample the neighborhood of each pixel too. Validation on the Caltech 101 dataset proved that the proposed approximate distribution, obtained with a considerable decrease of the computational time, has an error very low when compared to the exact distribution. Result obtained in the second experiment on a similarity-based ranking task are encouraging.", "citation": "Citations (5)", "departments": ["University of Bari", "University of Bari", "University of Bari", "University of Bari"], "authors": ["Claudio Taranto.....http://dblp.org/pers/hd/t/Taranto:Claudio", "Nicola Di Mauro.....http://dblp.org/pers/hd/m/Mauro:Nicola_Di", "Stefano Ferilli.....http://dblp.org/pers/hd/f/Ferilli:Stefano", "Floriana Esposito.....http://dblp.org/pers/hd/e/Esposito:Floriana"], "conf": "mm", "year": "2010", "pages": 4}