{"title": "ROX: The robustness of a run-time XQuery optimizer against correlated data.", "fields": ["xpath", "xquery", "cardinality", "joins", "best execution"], "abstract": "We demonstrate ROX, a run-time optimizer of XQueries, that focuses on finding the best execution order of XPath steps and relational joins in an XQuery. The problem of join ordering has been extensively researched, but the proposed techniques are still unsatisfying. These either rely on a cost model which might result in inaccurate estimations, or explore only a restrictive number of plans from the search space. ROX is developed to tackle these problems. ROX does not need any cost model, and defers query optimization to run-time intertwining optimization and execution steps. In every optimization step, sampling techniques are used to estimate the cardinality of unexecuted steps and joins to make a decision which sequence of operators to process next. Consequently, each execution step will provide updated and accurate knowledge about intermediate results, which will be used during the next optimization round. This demonstration will focus on: (i) illustrating the steps that ROX follows and the decisions it makes to choose a good join order, (ii) showing ROX's robustness in the face of data with different degree of correlation, (iii) comparing the performance of the plan chosen by ROX to different plans picked from the search space, (iv) proving that the run-time overhead needed by ROX is restricted to a small fraction of the execution time.", "citation": "Citations (3)", "departments": ["University of Twente", "University of Twente", "CWI, Amsterdam, ... The Netherlands", "CWI, Amsterdam, ... The Netherlands"], "authors": ["Riham Abdel Kader.....http://dblp.org/pers/hd/k/Kader:Riham_Abdel", "Peter A. Boncz.....http://dblp.org/pers/hd/b/Boncz:Peter_A=", "Stefan Manegold.....http://dblp.org/pers/hd/m/Manegold:Stefan", "Maurice van Keulen.....http://dblp.org/pers/hd/k/Keulen:Maurice_van"], "conf": "icde", "year": "2010", "pages": 4}