{"title": "Mining API mapping for language migration.", "fields": ["human error", "database", "java", "application programming interface", "business requirements"], "abstract": "To address business requirements and to survive in competing markets, companies or open source organizations often have to release different versions of their projects in different languages. Manually migrating projects from one language to another (such as from Java to C#) is a tedious and error-prone task. To reduce manual effort or human errors, tools can be developed for automatic migration of projects from one language to another. However, these tools require the knowledge of how Application Programming Interfaces (APIs) of one language are mapped to APIs of the other language, referred to as API mapping relations. In this paper, we propose a novel approach, called MAM ( M ining API  M apping), that mines API mapping relations from one language to another using API client code. MAM accepts a set of projects each with two versions in two languages and mines API mapping relations between those two languages based on how APIs are used by the two versions. These mined API mapping relations assist in migration of projects from one language to another. We implemented a tool and conducted two evaluations to show the effectiveness of MAM. The results show that our tool mines 25,805 unique mapping relations of APIs between Java and C# with more than 80% accuracy. The results also show that mined API mapping relations help reduce 54.4% compilation errors and 43.0% defects during migration of projects with an existing migration tool, called Java2CSharp. The reduction in compilation errors and defects is due to our new mined mapping relations that are not available with the existing migration tool.", "citation": "Citations (99)", "departments": ["Chinese Academy of Sciences", "North Carolina State University", "North Carolina State University", "Peking University", "Institute of So ...  Beijing, China"], "authors": ["Hao Zhong.....http://dblp.org/pers/hd/z/Zhong:Hao", "Suresh Thummalapenta.....http://dblp.org/pers/hd/t/Thummalapenta:Suresh", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "Lu Zhang.....http://dblp.org/pers/hd/z/Zhang_0023:Lu", "Qing Wang.....http://dblp.org/pers/hd/w/Wang:Qing"], "conf": "icse", "year": "2010", "pages": 10}