{"title": "Error-resilient perceptual coding for networked haptic interaction.", "fields": ["network packet", "round trip delay time", "haptic perception", "packet loss", "communication source"], "abstract": "The performance of haptic interaction across communication networks critically depends on the successful reconstruction of the bidirectionally transmitted haptic signals, and hence on the quality of the communication channel. We propose a novel error-resilient data reduction scheme for haptic communication which exploits known limits of human haptic perception. Particularly, we show that missing haptic information due to packet loss may strongly impair the user's experience during haptic interaction. We present and compare methods that eliminate the disturbing artifacts resulting out of packet loss. Our approach keeps the estimated impact of packet losses below human perception thresholds. A tree of possible cases (packets received or not received) and their respective occurrence probabilities is maintained at the sender side, and the system predicts unacceptable error cases to decide whether extra packets should be sent. We introduce different criteria that can be employed to trigger additional packets. In our experiments, we evaluate both the objective data reduction performance and the subjective system transparency by performing extensive tests using packet loss probability and round trip time as parameters. The proposed scheme shows excellent performances in terms of data reduction while sustaining good subjective ratings for a wide range of packet loss values and round trip times.", "citation": "Citations (9)", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München"], "authors": ["Fernanda Brandi.....http://dblp.org/pers/hd/b/Brandi:Fernanda", "Julius Kammerl.....http://dblp.org/pers/hd/k/Kammerl:Julius", "Eckehard G. Steinbach.....http://dblp.org/pers/hd/s/Steinbach:Eckehard_G="], "conf": "mm", "year": "2010", "pages": 10}