{"title": "Discovery-driven graph summarization.", "fields": ["categorical variable", "domain knowledge", "group method of data handling", "categorization", "automatic summarization"], "abstract": "Large graph datasets are ubiquitous in many domains, including social networking and biology. Graph summarization techniques are crucial in such domains as they can assist in uncovering useful insights about the patterns hidden in the underlying data. One important type of graph summarization is to produce small and informative summaries based on user-selected node attributes and relationships, and allowing users to interactively drill-down or roll-up to navigate through summaries with different resolutions. However, two key components are missing from the previous work in this area that limit the use of this method in practice. First, the previous work only deals with categorical node attributes. Consequently, users have to manually bucketize numerical attributes based on domain knowledge, which is not always possible. Moreover, users often have to manually iterate through many resolutions of summaries to identify the most interesting ones. This paper addresses both these key issues to make the interactive graph summarization approach more useful in practice. We first present a method to automatically categorize numerical attributes values by exploiting the domain knowledge hidden inside the node attributes values and graph link structures. Furthermore, we propose an interestingness measure for graph summaries to point users to the potentially most insightful summaries. Using two real datasets, we demonstrate the effectiveness and efficiency of our techniques.", "citation": "Citations (126)", "departments": ["University of Wisconsin-Madison", "IBM", "University of Wisconsin-Madison"], "authors": ["Ning Zhang.....http://dblp.org/pers/hd/z/Zhang_0013:Ning", "Yuanyuan Tian.....http://dblp.org/pers/hd/t/Tian:Yuanyuan", "Jignesh M. Patel.....http://dblp.org/pers/hd/p/Patel:Jignesh_M="], "conf": "icde", "year": "2010", "pages": 12}