{"title": "Learning incoherent sparse and low-rank patterns from multiple tasks.", "fields": ["regularization", "semidefinite programming", "proximal gradient methods for learning", "multi task learning", "proximal gradient methods", "cardinality"], "abstract": "We consider the problem of learning incoherent sparse and low-rank patterns from multiple tasks. Our approach is based on a linear multitask learning formulation, in which the sparse and low-rank patterns are induced by a cardinality regularization term and a low-rank constraint, respectively. This formulation is nonconvex; we convert it into its convex surrogate, which can be routinely solved via semidefinite programming for small-size problems. We propose employing the general projected gradient scheme to efficiently solve such a convex surrogate; however, in the optimization formulation, the objective function is nondifferentiable and the feasible domain is nontrivial. We present the procedures for computing the projected gradient and ensuring the global convergence of the projected gradient scheme. The computation of the projected gradient involves a constrained optimization problem; we show that the optimal solution to such a problem can be obtained via solving an unconstrained optimization subproblem and a Euclidean projection subproblem. We also present two projected gradient algorithms and analyze their rates of convergence in detail. In addition, we illustrate the use of the presented projected gradient algorithms for the proposed multitask learning formulation using the least squares loss. Experimental results on a collection of real-world data sets demonstrate the effectiveness of the proposed multitask learning formulation and the efficiency of the proposed projected gradient algorithms.", "citation": "Citations (130)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Jianhui Chen.....http://dblp.org/pers/hd/c/Chen:Jianhui", "Ji Liu.....http://dblp.org/pers/hd/l/Liu_0002:Ji", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping"], "conf": "kdd", "year": "2010", "pages": 10}