{"title": "On Approximation of New Optimization Methods for Assessing Network Vulnerability.", "fields": ["heuristic", "network planning and design", "vulnerability assessment", "approximation algorithm"], "abstract": "Assessing network vulnerability before potential disruptive events such as natural disasters or malicious attacks is vital for network planning and risk management. It enables us to seek and safeguard against most destructive scenarios in which the overall network connectivity falls dramatically. Existing vulnerability assessments mainly focus on investigating the inhomogeneous properties of graph elements, node degree for example, however, these measures and the corresponding heuristic solutions can provide neither an accurate evaluation over general network topologies, nor performance guarantees to large scale networks. To this end, in this paper, we investigate a measure called pairwise connectivity and formulate this vulnerability assessment problem as a new graph-theoretical optimization problem called β-disruptor, which aims to discover the set of critical node/edges, whose removal results in the maximum decline of the global pairwise connectivity. Our results consist of the NP-Completeness and inapproximability proof of this problem, an O(log n loglog n) pseudo-approximation algorithm for detecting the set of critical nodes and an O(log^1.5 n) pseudo-approximation algorithm for detecting the set of critical edges. In addition, we devise an efficient heuristic algorithm and validate the performance of the our model and algorithms through extensive simulations.", "citation": "Citations (74)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Missouri–Kansas City", "University of Pittsburgh"], "authors": ["Thang N. Dinh.....http://dblp.org/pers/hd/d/Dinh:Thang_N=", "Ying Xuan.....http://dblp.org/pers/hd/x/Xuan:Ying", "My T. Thai.....http://dblp.org/pers/hd/t/Thai:My_T=", "E. K. Park.....http://dblp.org/pers/hd/p/Park:E=_K=", "Taieb Znati.....http://dblp.org/pers/hd/z/Znati:Taieb"], "conf": "infocom", "year": "2010", "pages": 9}