{"title": "Exploiting Multiple-Antenna Diversity for Shared Secret Key Generation in Wireless Networks.", "fields": ["shared secret", "pre shared key", "key generator", "antenna diversity", "key generation"], "abstract": "Generating a secret key between two parties by extracting the shared randomness in the wireless fading channel is an emerging area of research. Previous works focus mainly on single-antenna systems. Multiple-antenna devices have the potential to provide more randomness for key generation than single-antenna ones. However, the performance of key generation using multiple-antenna devices in a real environment remains unknown. Different from the previous theoretical work on multiple-antenna key generation, we propose and implement a shared secret key generation protocol, Multiple-Antenna KEy generator (MAKE) using off-the-shelf 802.11n multiple-antenna devices. We also conduct extensive experiments and analysis in real indoor and outdoor mobile environments. Using the shared randomness extracted from measured Received Signal Strength Indicator (RSSI) to generate keys, our experimental results show that using laptops with three antennas, MAKE can increase the bit generation rate by more than four times over single-antenna systems. Our experiments validate the effectiveness of using multi-level quantization when there is enough mutual information in the channel. Our results also show the trade-off between bit generation rate and bit agreement ratio when using multi-level quantization. We further find that even if an eavesdropper has multiple antennas, she cannot gain much more information about the legitimate channel.", "citation": "Citations (174)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0001:Kai", "Daniel Wu.....http://dblp.org/pers/hd/w/Wu:Daniel", "An (Jack) Chan.....http://dblp.org/pers/hd/c/Chan:An_=Jack=", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant"], "conf": "infocom", "year": "2010", "pages": 9}