{"title": "Beyond active noun tagging: Modeling contextual interactions for multi-class active learning.", "fields": ["contextual image classification", "multiclass classification", "noun", "pragmatics", "context model"], "abstract": "We present an active learning framework to simultaneously learn appearance and contextual models for scene understanding tasks (multi-class classification). Existing multi-class active learning approaches have focused on utilizing classification uncertainty of regions to select the most ambiguous region for labeling. These approaches, however, ignore the contextual interactions between different regions of the image and the fact that knowing the label for one region provides information about the labels of other regions. For example, the knowledge of a region being sea is informative about regions satisfying the “on” relationship with respect to it, since they are highly likely to be boats. We explicitly model the contextual interactions between regions and select the question which leads to the maximum reduction in the combined entropy of all the regions in the image (image entropy). We also introduce a new methodology of posing labeling questions, mimicking the way humans actively learn about their environment. In these questions, we utilize the regions linked to a concept with high confidence as anchors, to pose questions about the uncertain regions. For example, if we can recognize water in an image then we can use the region associated with water as an anchor to pose questions such as “what is above water?”. Our active learning framework also introduces questions which help in actively learning contextual concepts. For example, our approach asks the annotator: “What is the relationship between boat and water?” and utilizes the answer to reduce the image entropies throughout the training dataset and obtain more relevant training examples for appearance models.", "citation": "Citations (82)", "year": "2010", "departments": ["University of Maryland, College Park", "Carnegie Mellon University"], "conf": "cvpr", "authors": ["Behjat Siddiquie.....http://dblp.org/pers/hd/s/Siddiquie:Behjat", "Abhinav Gupta.....http://dblp.org/pers/hd/g/Gupta:Abhinav"], "pages": 8}