{"title": "Graphical XQuery in the aqualogic data services platform.", "fields": ["data as a service", "xquery", "information integration", "service oriented architecture", "data access"], "abstract": "The AquaLogic Data Services Platform (ALDSP) is a middleware platform developed at BEA Systems for building services, referred to as data services, that integrate, access, and manipulate information coming from multiple heterogeneous sources of data (including databases, files, and other services). ALDSP uses functions that produce and consume XML to model heterogeneous information sources, so the integration logic for data access services in ALDSP is specified declaratively using the XQuery language. A challenge that we faced in developing ALDSP was providing effective graphical tooling to help data service developers to develop information integration queries. In this paper, we describe the graphical XQuery Editor (XQE) that resulted from our attempt to tackle this challenge. XQE handles the full XQuery language and provides a robust two-way editing experience involving both graphical and source views of each query. XQE is novel in being the first commercial graphical XQuery editor to support both of these features.", "citation": "Citations (2)", "year": "2010", "departments": ["University of California, Irvine", "University of California, Irvine", "Oracle Corporation", "Oracle Corporation", "SAP, Palo Alto, CA, USA"], "conf": "sigmod", "authors": ["Vinayak R. Borkar.....http://dblp.org/pers/hd/b/Borkar:Vinayak_R=", "Michael J. Carey.....http://dblp.org/pers/hd/c/Carey_0001:Michael_J=", "Sebu Koleth.....http://dblp.org/pers/hd/k/Koleth:Sebu", "Alexander Kotopoulis.....http://dblp.org/pers/hd/k/Kotopoulis:Alexander", "Kautul Mehta.....http://dblp.org/pers/hd/m/Mehta:Kautul", "Joshua Spiegel.....http://dblp.org/pers/hd/s/Spiegel:Joshua", "Sachin Thatte.....http://dblp.org/pers/hd/t/Thatte:Sachin", "Till Westmann.....http://dblp.org/pers/hd/w/Westmann:Till"], "pages": 12}