{"title": "Decoupling contention management from scheduling.", "fields": ["lock", "load management", "concurrency", "thread", "concurrency control"], "abstract": "Many parallel applications exhibit unpredictable communication between threads, leading to contention for shared objects. The choice of contention management strategy impacts strongly the performance and scalability of these applications: spinning provides maximum performance but wastes significant processor resources, while blocking-based approaches conserve processor resources but introduce high overheads on the critical path of computation. Under situations of high or changing load, the operating system complicates matters further with arbitrary scheduling decisions which often preempt lock holders, leading to long serialization delays until the preempted thread resumes execution.   We observe that contention management is orthogonal to the problems of scheduling and load management and propose to decouple them so each may be solved independently and effectively. To this end, we propose a load control mechanism which manages the number of active threads in the system separately from any contention which may exist. By isolating contention management from damaging interactions with the OS scheduler, we combine the efficiency of spinning with the robustness of blocking. The proposed load control mechanism results in stable, high performance for both lightly and heavily loaded systems, requires no special privileges or modifications at the OS level, and can be implemented as a library which benefits existing code.", "citation": "Citations (62)", "year": "2010", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Carnegie Mellon University"], "conf": "asplos", "authors": ["Ryan Johnson.....http://dblp.org/pers/hd/j/Johnson_0001:Ryan", "Radu Stoica.....http://dblp.org/pers/hd/s/Stoica:Radu", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia", "Todd C. Mowry.....http://dblp.org/pers/hd/m/Mowry:Todd_C="], "pages": 12}