{"title": "Influence of tactile feedback and presence on egocentric distance perception in virtual environments.", "fields": ["immersion", "perception", "tactile sensor", "situated", "metaverse"], "abstract": "A number of studies have reported that distance judgments are underestimated in virtual environments (VE) when compared to those made in the real world. Studies have also reported that providing users with visual feedback in the VE improves their distance perception and made them feel more immersed in the virtual world. In this study, we investigated the effect of tactile feedback and visual manipulation of the VE on egocentric distance perception. In contrast to previous studies which have focused on task-specific and error-corrective feedback (for example, providing knowledge about the errors in distance estimations), we demonstrate that exploratory feedback is sufficient for reducing errors in distance estimation. In Experiment 1, the effects of different types of feedback (visual, tactile and visual plus tactile) on distance judgments were studied. Tactile feedback was given to participants as they explored and touched objects in a VE. Results showed that distance judgments improved in the VE regardless of the type of sensory feedback provided. In Experiment 2, we presented a real world environment to the participants and then situated them in a VE that was either a replica or an altered representation of the real world environment. Results showed that participants made significant underestimation in their distance judgments when the VE was not a replica of the physical space. We further found that providing both visual and tactile feedback did not reduce distance compression in such a situation. These results are discussed in the light of the nature of feedback provided and how assumptions about the VE may affect distance perception in virtual environments.", "citation": "Citations (3)", "departments": ["Mount Holyoke College", "Mount Holyoke College", "Mount Holyoke College", "Stetson University"], "authors": ["Farahnaz Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Farahnaz", "Joseph D. Cohen.....http://dblp.org/pers/hd/c/Cohen:Joseph_D=", "Katherine S. Binder.....http://dblp.org/pers/hd/b/Binder:Katherine_S=", "Claude L. Fennema.....http://dblp.org/pers/hd/f/Fennema:Claude_L="], "conf": "vr", "year": "2010", "pages": 8}