{"title": "Data desensitization of customer data for use in optimizer performance experiments.", "fields": ["group method of data handling", "high availability", "string", "desensitization", "data warehouse"], "abstract": "Improving the performance and functionality of database system optimizers requires experimentation on real customer data. Often these data are of sensitive nature and the only way to keep them is by applying a non-reversible transformation to obfuscate them. However, in order that the database optimizer generates exactly the same query plans as for the sensitive data, the transformation has to preserve the order and some important properties of the data distribution. Unfortunately, existing data obfuscation techniques do not preserve all of these properties and therefore are not applicable in this context. In this paper we present a Desensitizer tool that we have developed for optimizer performance experiments of HP's Neoview high availability data warehousing product. The tool is based on novel numeric and string desensitization algorithms which are agnostic to the database system. We explain the core concepts behind the algorithms, how they preserve the required data properties and important implementation considerations that were made. We present the architecture of the Desensitizer tool and results of the extensive validation that we conducted.", "citation": "Citations (6)", "departments": ["Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Universidad de Sonora", "Universidad de Sonora"], "authors": ["Malú Castellanos.....http://dblp.org/pers/hd/c/Castellanos:Mal=uacute=", "Bin Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Bin", "Ivo Jimenez.....http://dblp.org/pers/hd/j/Jimenez:Ivo", "Perla Ruiz.....http://dblp.org/pers/hd/r/Ruiz:Perla", "Miguel Durazo.....http://dblp.org/pers/hd/d/Durazo:Miguel", "Umeshwar Dayal.....http://dblp.org/pers/hd/d/Dayal:Umeshwar", "Lily Jow.....http://dblp.org/pers/hd/j/Jow:Lily"], "conf": "icde", "year": "2010", "pages": 12}