{"title": "Information Quality Aware Routing in Event-Driven Sensor Networks.", "fields": ["wireless routing protocol", "destination sequenced distance vector routing", "geographic routing", "path vector protocol", "zone routing protocol"], "abstract": "Upon the occurrence of a phenomenon of interest in a wireless sensor network, multiple sensors may be activated, leading to data implosion and redundancy. Data aggregation and/or fusion techniques exploit spatio-temporal correlation among sensory data to reduce traffic load and mitigate congestion. However, this is often at the expense of loss in Information Quality (IQ) of data that is collected at the fusion center. In this work, we address the problem of finding the least-cost routing tree that satisfies a given IQ constraint. We note that the optimal least-cost routing solution is a variation of the classical NP-hard Steiner tree problem in graphs, which incurs high overheads as it requires knowledge of the entire network topology and individual IQ contributions of each activated sensor node. We tackle these issues by proposing: (i) a topology-aware histogram-based aggregation structure that encapsulates the cost of including the IQ contribution of each activated node in a compact and efficient way; and (ii) a greedy heuristic to approximate and prune a least-cost aggregation routing path. We show that the performance of our IQ-aware routing protocol is: (i) bounded by a distance-based aggregation tree that collects data from all the activated nodes; and (ii) comparable to another IQ-aware routing protocol that uses an exhaustive brute-force search to approximate and prune the least-cost aggregation tree.", "citation": "Citations (55)", "departments": ["National University of Singapore", "National University of Singapore", "Institute for I ... rch, Singapore", "Institute for I ... rch, Singapore", "Institute for I ... rch, Singapore"], "authors": ["Hwee-Xian Tan.....http://dblp.org/pers/hd/t/Tan:Hwee=Xian", "Mun Choon Chan.....http://dblp.org/pers/hd/c/Chan:Mun_Choon", "Wendong Xiao.....http://dblp.org/pers/hd/x/Xiao:Wendong", "Peng Yong Kong.....http://dblp.org/pers/hd/k/Kong:Peng_Yong", "Chen-Khong Tham.....http://dblp.org/pers/hd/t/Tham:Chen=Khong"], "conf": "infocom", "year": "2010", "pages": 9}