{"title": "PHANTOM: predicting performance of parallel applications on large-scale parallel machines using a single node.", "fields": ["open problem", "cost efficiency", "multi core processor", "network simulation", "debugging"], "abstract": "For designers of large-scale parallel computers, it is greatly desired that performance of parallel applications can be predicted at the design phase. However, this is difficult because the execution time of parallel applications is determined by several factors, including sequential computation time in each process, communication time and their convolution. Despite previous efforts, it remains an open problem to estimate sequential computation time in each process accurately and efficiently for large-scale parallel applications on non-existing target machines.   This paper proposes a novel approach to predict the sequential computation time accurately and efficiently. We assume that there is at least one node of the target platform but the whole target system need not be available. We make two main technical contributions. First, we employ deterministic replay techniques to execute any process of a parallel application on a single node at real speed. As a result, we can simply measure the real sequential computation time on a target node for each process one by one. Second, we observe that computation behavior of processes in parallel applications can be clustered into a few groups while processes in each group have similar computation behavior. This observation helps us reduce measurement time significantly because we only need to execute representative parallel processes instead of all of them.   We have implemented a performance prediction framework, called PHANTOM, which integrates the above computation-time acquisition approach with a trace-driven network simulator. We validate our approach on several platforms. For ASCI Sweep3D, the error of our approach is less than 5% on 1024 processor cores. Compared to a recent regression-based prediction approach, PHANTOM presents better prediction accuracy across different platforms.", "citation": "Citations (130)", "year": "2010", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University"], "conf": "ppopp", "authors": ["Jidong Zhai.....http://dblp.org/pers/hd/z/Zhai:Jidong", "Wenguang Chen.....http://dblp.org/pers/hd/c/Chen:Wenguang", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin"], "pages": 10}