{"title": "Twister Networks and Their Applications to Load-Balanced Switches.", "fields": ["network packet", "circular shift", "load balanced switch", "multistage interconnection networks", "bipartite graph"], "abstract": "Inspired by the recent development of optical queueing theory, in this paper we study a class of multistage interconnection networks (MINs), called {\\em twister networks}. Unlike the usual recursive constructions of MINs (either by two-stage expansion or by three-stage expansion), twister networks are constructed {\\em directly} by a concatenation of bipartite networks. Moreover, the biadjacency matrices of these bipartite networks are sums of subsets of the powers of the circular shift matrix. Though MINs have been studied extensively in the literature, we show there are several {\\em distinct} properties for twister networks, including routability and conditionally nonblocking properties. In particular, we show that a twister network satisfying (A1) in the paper is routable, and packets can be self-routed through the twister network by using the $\\cal C$-transform developed in optical queueing theory. Moreover, we define an $N$-modulo distance and use it to show that a twister network satisfying (A2) in the paper is conditionally nonblocking if the $N$-modulo distance between any two outputs is not greater than two times of the $N$-modulo distance between the corresponding two inputs. Such a conditionally nonblocking property allows us to show that a twister network with $N$ inputs/outputs can be used as a $p \\times p$ rotator and a $p \\times p$ symmetric TDM switch for any $2 \\le p \\le N$. As such, one can use a twister network as the switch fabric for a two-stage load balanced switch that is capable of providing incremental update of the number of linecards.", "citation": "Citations (4)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Ching-Ming Lien.....http://dblp.org/pers/hd/l/Lien:Ching=Ming", "Cheng-Shang Chang.....http://dblp.org/pers/hd/c/Chang:Cheng=Shang", "Jay Cheng.....http://dblp.org/pers/hd/c/Cheng:Jay", "Duan-Shin Lee.....http://dblp.org/pers/hd/l/Lee:Duan=Shin", "Jou-Ting Liao.....http://dblp.org/pers/hd/l/Liao:Jou=Ting"], "conf": "infocom", "year": "2010", "pages": 9}