{"title": "Linear Programming Models For Multi-Channel P2P Streaming Systems.", "fields": ["implementation", "performance metric", "bandwidth allocation", "dynamic bandwidth allocation", "channel allocation schemes"], "abstract": "Most of the commercial P2P video streaming deployments support hundreds of channels and are referred to as multichannel systems. Measurement studies show that bandwidth resources of different channels are highly unbalanced and thus recent research studies have proposed various protocols to improve the streaming qualities for all channels by enabling cross-channel cooperation among multiple channels. However, there is no general framework for comparing existing and potential designs for multi-channel P2P systems. The goal of this paper is to establish tractable models for answering the fundamental question in multi-channel system designs: Under what circumstances, should a particular design be used to achieve the desired streaming quality with the lowest implementation complexity? To achieve this goal, we first classify existing and potential designs into three categories, namely Naive Bandwidth allocation Approach (NBA), Passive Channel-aware bandwidth allocation Approach (PCA) and Active Channel-aware bandwidth allocation Approach (ACA). Then, we define the bandwidth satisfaction ratio as a performance metric to develop linear programming models for the three designs. The proposed models are independent of implementations and can be efficiently solved due to the linear property, which provides a way of numerically exploring the design space of multi-channel systems and developing closedform solutions for special systems.", "citation": "Citations (23)", "departments": ["University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln"], "authors": ["Miao Wang.....http://dblp.org/pers/hd/w/Wang:Miao", "Lisong Xu.....http://dblp.org/pers/hd/x/Xu:Lisong", "Byrav Ramamurthy.....http://dblp.org/pers/hd/r/Ramamurthy:Byrav"], "conf": "infocom", "year": "2010", "pages": 5}