{"title": "Temporally-aware algorithms for document classification.", "fields": ["naive bayes classifier", "weighting", "medline", "document classification", "supervised learning"], "abstract": "Automatic Document Classification (ADC) is still one of the major information retrieval problems. It usually employs a supervised learning strategy, where we first build a classification model using pre-classified documents and then use this model to classify unseen documents. The majority of supervised algorithms consider that all documents provide equally important information. However, in practice, a document may be considered more or less important to build the classification model according to several factors, such as its timeliness, the venue where it was published in, its authors, among others. In this paper, we are particularly concerned with the impact that temporal effects may have on ADC and how to minimize such impact. In order to deal with these effects, we introduce a  temporal weighting function  (TWF) and propose a methodology to determine it for document collections. We applied the proposed methodology to ACM-DL and Medline and found that the TWF of both follows a lognormal. We then extend three ADC algorithms (namely kNN, Rocchio and Naive Bayes) to incorporate the TWF. Experiments showed that the temporally-aware classifiers achieved significant gains, outperforming (or at least matching) state-of-the-art algorithms.", "citation": "Citations (28)", "departments": ["Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Fed. Univ. São  ... Del Rei, Brazil"], "authors": ["Thiago Salles.....http://dblp.org/pers/hd/s/Salles:Thiago", "Leonardo C. da Rocha.....http://dblp.org/pers/hd/r/Rocha:Leonardo_C=_da", "Gisele L. Pappa.....http://dblp.org/pers/hd/p/Pappa:Gisele_L=", "Fernando Mourão.....http://dblp.org/pers/hd/m/Mour=atilde=o:Fernando", "Wagner Meira Jr......http://dblp.org/pers/hd/m/Meira_Jr=:Wagner", "Marcos André Gonçalves.....http://dblp.org/pers/hd/g/Gon=ccedil=alves:Marcos_Andr=eacute="], "conf": "sigir", "year": "2010", "pages": 8}