{"title": "Fast approximate correlation for massive time-series data.", "fields": ["graph partition", "approximation algorithm", "discrete fourier transform", "exact algorithm", "response time"], "abstract": "We consider the problem of computing all-pair correlations in a warehouse containing a large number (e.g., tens of thousands) of time-series (or,  signals ). The problem arises in automatic discovery of patterns and anomalies in data intensive applications such as data center management, environmental monitoring, and scientific experiments. However, with existing techniques, solving the problem for a large stream warehouse is extremely expensive, due to the problem's inherent quadratic I/O and CPU complexities.   We propose novel algorithms, based on Discrete Fourier Transformation (DFT) and graph partitioning, to reduce the end-to-end response time of an all-pair correlation query. To minimize I/O cost, we partition a massive set of input signals into smaller batches such that caching the signals one batch at a time maximizes data reuse and minimizes disk I/O. To reduce CPU cost, we propose two approximation algorithms. Our first algorithm efficiently computes approximate correlation coefficients of similar signal pairs within a given error bound. The second algorithm efficiently identifies, without any false positives or negatives, all signal pairs with correlations above a given threshold. For many real applications, our approximate solutions are as useful as corresponding exact solutions, due to our strict error guarantees. However, compared to the state-of-the-art exact algorithms, our algorithms are up to 17x faster for several real datasets.", "citation": "Citations (111)", "year": "2010", "departments": ["University of California, Riverside", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Abdullah Mueen.....http://dblp.org/pers/hd/m/Mueen:Abdullah", "Suman Nath.....http://dblp.org/pers/hd/n/Nath:Suman", "Jie Liu.....http://dblp.org/pers/hd/l/Liu:Jie"], "pages": 12}