{"title": "Know Thy Neighbor: Towards Optimal Mapping of Contacts to Social Graphs for DTN Routing.", "fields": ["spectral graph theory", "mobility model", "online algorithm", "social graph", "centrality"], "abstract": "Delay Tolerant Networks (DTN) are networks of self-organizing wireless nodes, where end-to-end connectivity is intermittent. In these networks, forwarding decisions are generally made using locally collected knowledge about node behavior (e.g., past contacts between nodes) to predict future contact opportunities. The use of complex network analysis has been recently suggested to perform this prediction task and improve the performance of DTN routing. Contacts seen in the past are aggregated to a social graph, and a variety of metrics (e.g., centrality and similarity) or algorithms (e.g., community detection) have been proposed to assess the utility of a node to deliver a content or bring it closer to the destination. In this paper, we argue that it is not so much the choice or sophistication of social metrics and algorithms that bears the most weight on performance, but rather the mapping from the mobility process generating contacts to the aggregated social graph. We first study two well-known DTN routing algorithms - SimBet and BubbleRap - that rely on such complex network analysis, and show that their performance heavily depends on how the mapping (contact aggregation) is performed. What is more, for a range of synthetic mobility models and real traces, we show that improved performances (up to a factor of 4 in terms of delivery ratio) are consistently achieved for a relatively narrow range of aggregation levels only, where the aggregated graph most closely reflects the underlying mobility structure. To this end, we propose an online algorithm that uses concepts from unsupervised learning and spectral graph theory to infer this 'correct' graph structure; this algorithm allows each node to locally identify and adjust to the optimal operating point, and achieves good performance in all scenarios considered.", "citation": "Citations (216)", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich"], "authors": ["Theus Hossmann.....http://dblp.org/pers/hd/h/Hossmann:Theus", "Thrasyvoulos Spyropoulos.....http://dblp.org/pers/hd/s/Spyropoulos:Thrasyvoulos", "Franck Legendre.....http://dblp.org/pers/hd/l/Legendre:Franck"], "conf": "infocom", "year": "2010", "pages": 9}