{"title": "ASF: AMD64 Extension for Lock-Free Data Structures and Transactional Memory.", "fields": ["data structure", "parallel computing", "advanced synchronization facility", "transactional memory", "non blocking algorithm", "cpu cache", "out of order execution"], "abstract": "Advanced Synchronization Facility (ASF) is an AMD64 hardware extension for lock-free data structures and transactional memory. It provides a speculative region that atomically executes speculative accesses in the region. Five new instructions are added to demarcate the region, use speculative accesses selectively, and control the speculative hardware context. Programmers can use speculative regions to build flexible multi-word atomic primitives with no additional software support by relying on the minimum guarantee of available ASF hardware resources for lock-free programming. Transactional programs with high-level TM language constructs can either be compiled directly to the ASF code or be linked to software TM systems that use ASF to accelerate transactional execution. In this paper we develop an out-of-order hardware design to implement ASF on a future AMD processor and evaluate it with an in-house simulator. The experimental results show that the combined use of the L1 cache and the LS unit is very helpful for the performance robustness of ASF-based lock free data structures, and that the selective use of speculative accesses enables transactional programs to scale with limited ASF hardware resources.", "citation": "Not cited", "departments": ["Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Jae-Woong Chung.....http://dblp.org/pers/hd/c/Chung:Jae=Woong", "Luke Yen.....http://dblp.org/pers/hd/y/Yen:Luke", "Stephan Diestelhorst.....http://dblp.org/pers/hd/d/Diestelhorst:Stephan", "Martin Pohlack.....http://dblp.org/pers/hd/p/Pohlack:Martin", "Michael Hohmuth.....http://dblp.org/pers/hd/h/Hohmuth:Michael", "David Christie.....http://dblp.org/pers/hd/c/Christie:David", "Dan Grossman.....http://dblp.org/pers/hd/g/Grossman:Dan"], "conf": "micro", "year": "2010", "pages": 12}