{"title": "The Emptiness Problem for Tree Automata with Global Constraints.", "fields": ["monad", "predicate", "cardinality", "generalization", "decidability"], "abstract": "We define tree automata with global constraints (TAGC), generalizing the class of tree automata with global equality and disequality constraints (TAGED). TAGC can test for equality and disequality between subterms whose positions are defined by the states reached during a computation. In particular, TAGC can check that all the subterms reaching a given state are distinct. This constraint is related to monadic key constraints for XML documents, meaning that every two distinct positions of a given type have different values. We prove decidability of the emptiness problem for TAGC. This solves, in particular, the open question of decidability of emptiness for TAGED. We further extend our result by allowing global arithmetic constraints for counting the number of occurrences of some state or the number of different subterms reaching some state during a computation. We also allow local equality and disequality tests between sibling positions and the extension to unranked ordered trees. As a consequence of our results for TAGC, we prove the decidability of a fragment of the monadic second order logic on trees extended with predicates for equality and disequality between subtrees, and cardinality.", "citation": "Citations (16)", "departments": ["French Institute for Research in Computer Science and Automation", "university of lille", "Univ. Politec.  ... arcelona, Spain", "Univ. Politec.  ... arcelona, Spain", "Univ. Politec.  ... arcelona, Spain"], "authors": ["Luis Barguñó.....http://dblp.org/pers/hd/b/Bargu=ntilde==oacute=:Luis", "Carles Creus.....http://dblp.org/pers/hd/c/Creus:Carles", "Guillem Godoy.....http://dblp.org/pers/hd/g/Godoy:Guillem", "Florent Jacquemard.....http://dblp.org/pers/hd/j/Jacquemard:Florent", "Camille Vacher.....http://dblp.org/pers/hd/v/Vacher:Camille"], "conf": "lics", "year": "2010", "pages": 10}