{"title": "SecureBlox: customizable secure distributed data processing.", "fields": ["hash join", "computer security model", "datalog", "software system", "system requirements specification"], "abstract": "We present  SecureBlox , a declarative system that unifies a distributed query processor with a security policy framework. SecureBlox decouples security concerns from system specification, allowing easy reconfiguration of a system's security properties to suit a given execution environment. Our implementation of SecureBlox is a series of extensions to  LogicBlox , an emerging commercial Datalog-based platform for enterprise software systems. SecureBlox enhances LogicBlox to enable distribution and static meta-programmability, and makes novel use of existing LogicBlox features such as integrity constraints. SecureBlox allows meta-programmability via  BloxGenerics  - a language extension for compile-time code generation based on the security requirements and trust policies of the deployed environment. We present and evaluate detailed use-cases in which SecureBlox enables diverse applications, including an authenticated declarative routing protocol with encrypted advertisements and an authenticated and encrypted parallel hash join operation. Our results demonstrate SecureBlox's abilities to specify and implement a wide range of different security constructs for distributed systems as well as to enable tradeoffs between performance and security.", "citation": "Citations (19)", "year": "2010", "departments": ["University of California, Berkeley", "University of Pennsylvania", "University of Pennsylvania", "LogicBlox, Atlanta, GA, USA", "LogicBlox, Atlanta, GA, USA"], "conf": "sigmod", "authors": ["William R. Marczak.....http://dblp.org/pers/hd/m/Marczak:William_R=", "Shan Shan Huang.....http://dblp.org/pers/hd/h/Huang:Shan_Shan", "Martin Bravenboer.....http://dblp.org/pers/hd/b/Bravenboer:Martin", "Micah Sherr.....http://dblp.org/pers/hd/s/Sherr:Micah", "Boon Thau Loo.....http://dblp.org/pers/hd/l/Loo:Boon_Thau", "Molham Aref.....http://dblp.org/pers/hd/a/Aref:Molham"], "pages": 12}