{"title": "Yongzheng emperor's interactive tabletop: seamless multimedia system in a museum context.", "fields": ["exhibition", "emperor", "harmony", "gesture", "tangible user interface"], "abstract": "In this paper, we propose the seamless multimedia system  Yongzheng Emperor's interactive tabletop , which has been incorporated into the special exhibition \"Harmony and Integrity: The Yongzheng Emperor and His Times\" at the National Palace Museum in Taiwan. The multimedia system features the innovative use of physical artifacts - Yongzheng figurines and a model of Yongzheng-era calendar clock as tangible user interfaces, which have been used to activate on the Surface the emperor's life at court and chronological events of his times. Museum audiences can naturally and intuitively explore the Emperor's stories by the use of hand gestures. The system vividly connects the modern world of the audiences with the emperor's virtual world, engaging museum audiences in the most interactive and compelling way to learn about the emperor. The paper aims to present the development of the seamless tabletop system in a historical museum context, including design principles, implementation, applications, and effectiveness of the system. Our contribution in this project is to demonstrate a new exhibition display model for the museum sector.", "citation": "Citations (2)", "departments": ["National Taiwan University", "National Palace Museum", "National Taiwan University", "National Taiwan University", "National Taiwan University"], "authors": ["Chun-Ko Hsieh.....http://dblp.org/pers/hd/h/Hsieh:Chun=Ko", "I-Ling Liu.....http://dblp.org/pers/hd/l/Liu:I=Ling", "Neng-Hao Yu.....http://dblp.org/pers/hd/y/Yu:Neng=Hao", "Yueh-Hsuan Chiang.....http://dblp.org/pers/hd/c/Chiang:Yueh=Hsuan", "Hsiang-Tao Wu.....http://dblp.org/pers/hd/w/Wu:Hsiang=Tao", "Ying-Jui Chen.....http://dblp.org/pers/hd/c/Chen:Ying=Jui", "Yi-Ping Hung.....http://dblp.org/pers/hd/h/Hung:Yi=Ping"], "conf": "mm", "year": "2010", "pages": 4}