{"title": "Tag-based web photo retrieval improved by batch mode re-tagging.", "fields": ["batch processing", "inverted index", "upload", "social media", "annotation"], "abstract": "Web photos in social media sharing websites such as Flickr are generally accompanied by rich but noisy textual descriptions (tags, captions, categories, etc.). In this paper, we proposed a tag-based photo retrieval framework to improve the retrieval performance for Flickr photos by employing a novel batch mode re-tagging method. The proposed batch mode re-tagging method can automatically refine noisy tags of a group of Flickr photos uploaded by the same user within a short period by leveraging millions of training web images and their associated rich textual descriptions. Specifically, for one group of Flickr photos, we construct a group-specific lexicon which contains only the tags of all photos within the group. For each query tag, we employ the inverted file method to automatically find loosely labeled training web images. We propose a SVM with Augmented Features, referred to as AFSVM, to learn adapted classifiers to refine the annotation tags of photos by leveraging the existing SVM classifiers of popular tags, which are associated with a large amount of positive training web images. Moreover, to further refine the annotation tags of photos in the same group, we additionally introduce an objective function that utilizes the visual similarities of photos within the group as well as the semantic proximities of their tags. Based on the refined tags, photos can be retrieved according to more reliable relevance scores. Extensive experiments demonstrate the effectiveness of our framework.", "citation": "Citations (96)", "year": "2010", "departments": ["University of Rochester", "School of Compu ... sity, Singapore", "School of Compu ... sity, Singapore", "School of Compu ... sity, Singapore"], "conf": "cvpr", "authors": ["Lin Chen.....http://dblp.org/pers/hd/c/Chen:Lin", "Dong Xu.....http://dblp.org/pers/hd/x/Xu_0001:Dong", "Ivor Wai-Hung Tsang.....http://dblp.org/pers/hd/t/Tsang:Ivor_Wai=Hung", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo"], "pages": 7}