{"title": "Locality-constrained Linear Coding for image classification.", "fields": ["contextual image classification", "k nearest neighbors algorithm", "linear classifier", "linear code", "caltech 101"], "abstract": "The traditional SPM approach based on bag-of-features (BoF) requires nonlinear classifiers to achieve good image classification performance. This paper presents a simple but effective coding scheme called Locality-constrained Linear Coding (LLC) in place of the VQ coding in traditional SPM. LLC utilizes the locality constraints to project each descriptor into its local-coordinate system, and the projected coordinates are integrated by max pooling to generate the final representation. With linear classifier, the proposed approach performs remarkably better than the traditional nonlinear SPM, achieving state-of-the-art performance on several benchmarks. Compared with the sparse coding strategy [22], the objective function used by LLC has an analytical solution. In addition, the paper proposes a fast approximated LLC method by first performing a K-nearest-neighbor search and then solving a constrained least square fitting problem, bearing computational complexity of O(M + K 2 ). Hence even with very large codebooks, our system can still process multiple frames per second. This efficiency significantly adds to the practical values of LLC for real applications.", "citation": "Citations (3,043)", "year": "2010", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Akiira Media Sy ... lto, California", "NEC Laboratorie ... ino, California", "NEC Laboratorie ... ino, California"], "conf": "cvpr", "authors": ["Jinjun Wang.....http://dblp.org/pers/hd/w/Wang:Jinjun", "Jianchao Yang.....http://dblp.org/pers/hd/y/Yang:Jianchao", "Kai Yu.....http://dblp.org/pers/hd/y/Yu_0001:Kai", "Fengjun Lv.....http://dblp.org/pers/hd/l/Lv:Fengjun", "Thomas S. Huang.....http://dblp.org/pers/hd/h/Huang:Thomas_S=", "Yihong Gong.....http://dblp.org/pers/hd/g/Gong:Yihong"], "pages": 8}