{"title": "Sequential Rationality in Cryptographic Protocols.", "fields": ["nash equilibrium", "subgame perfect equilibrium", "cryptographic primitive", "correlated equilibrium", "computer science", "subgame", "cryptographic protocol", "rationality", "solution concept", "game theory", "theoretical computer science"], "abstract": "Much of the literature on rational cryptography focuses on analyzing the strategic properties of cryptographic protocols. However, due to the presence of computationally-bounded players and the asymptotic nature of cryptographic security, a definition of sequential rationality for this setting has thus far eluded researchers.   We propose a new framework for overcoming these obstacles, and provide the first definitions of computational solution concepts that guarantee sequential rationality. We argue that natural computational variants of subgame perfection are too strong for cryptographic protocols. As an alternative, we introduce a weakening called threat-free Nash equilibrium that is more permissive but still eliminates the undesirable “empty threats” of nonsequential solution concepts.   To demonstrate the applicability of our framework, we revisit the problem of implementing a mediator for correlated equilibria [Dodis et al 2000], and propose a variant of their protocol that is sequentially rational for a nontrivial class of correlated equilibria. Our treatment provides a better understanding of the conditions under which mediators in a correlated equilibrium can be replaced by a stable protocol.", "citation": "Not cited", "year": "2010", "departments": ["Northwestern University", "Weizmann Institute of Science", "Interdisciplinary Center Herzliya", "Northwestern University", "Weizmann Institute of Science", "Interdisciplinary Center Herzliya"], "conf": "focs", "authors": ["Ronen Gradwohl.....http://dblp.org/pers/hd/g/Gradwohl:Ronen", "Noam Livne.....http://dblp.org/pers/hd/l/Livne:Noam", "Alon Rosen.....http://dblp.org/pers/hd/r/Rosen:Alon"], "pages": 10}