{"title": "Polynomial shape from shading.", "fields": ["structured light", "planar", "inference", "computer facial animation", "cylinder", "line search", "surface reconstruction", "photometric stereo", "polynomial", "poisson s equation", "polynomial texture mapping", "parametric statistics", "regular polygon", "degree of a polynomial", "semidefinite programming", "random field", "tikhonov regularization", "quadric", "displacement mapping", "laser scanning", "robust regression", "reflectometry", "polynomial regression", "image scaling", "3d reconstruction", "texture mapping", "shading", "smoothness", "rendering", "facial motion capture", "estimator", "photometry"], "abstract": "We present a novel method for acquisition, modeling, compression, and synthesis of realistic facial deformations using polynomial displacement maps. Our method consists of an analysis phase where the relationship between motion capture markers and detailed facial geometry is inferred, and a synthesis phase where novel detailed animated facial geometry is driven solely by a sparse set of motion capture markers. For analysis, we record the actor wearing facial markers while performing a set of training expression clips. We capture real-time high-resolution facial deformations, including dynamic wrinkle and pore detail, using interleaved structured light 3D scanning and photometric stereo. Next, we compute displacements between a neutral mesh driven by the motion capture markers and the high-resolution captured expressions. These geometric displacements are stored in a  polynomial displacement map  which is parameterized according to the local deformations of the motion capture dots. For synthesis, we drive the polynomial displacement map with new motion capture data. This allows the recreation of large-scale muscle deformation, medium and fine wrinkles, and dynamic skin pore detail. Applications include the compression of existing performance data and the synthesis of new performances. Our technique is independent of the underlying geometry capture system and can be used to automatically generate high-frequency wrinkle and pore details on top of many existing facial animation systems.", "citation": "Citations (131)", "year": "2010", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California", "University of the Arts London", "University of Leoben", "University of Leoben", "University of Toronto", "University of Toronto", "University of Tokyo", "National University of Singapore", "Microsoft", "University of Tokyo", "Brown University", "Brown University", "University of Toronto", "University of Toronto", "University of Toronto", "Simon Fraser University", "Simon Fraser University"], "conf": "cvpr", "authors": ["Ady Ecker.....http://dblp.org/pers/hd/e/Ecker:Ady", "Allan D. Jepson.....http://dblp.org/pers/hd/j/Jepson:Allan_D="], "pages": 8}