{"title": "Social audio features for advanced music retrieval interfaces.", "fields": ["music information retrieval", "mobile music", "objective approach", "collaborative filtering", "metadata"], "abstract": "The size of personal music collections has constantly increased over the past years. As a result, the traditional metadata based lists to browse these collections have reached their limits. Interfaces that are based on music similarity offer an alternative and thus are increasingly gaining attention. Music similarity is typically either derived from audio-features (objective approach) or from user driven information sources, such as collaborative filtering or social tags (subjective approach). Studies show that the latter techniques outperform audio-based approaches when it comes to describe the perceived music similarity. However, subjective approaches typically only define pairwise relations as opposed to the global notion of similarity given by audio-feature spaces. Many of the proposed interfaces for similarity based music access inherently depend on this global notion and are thus not applicable to user driven music similarity measures. The first contribution of this paper is a high dimensional music space that is based on user driven similarity measures. It combines the advantages of audio-feature spaces (global view) with the advantages of subjective sources that better reflect the users' perception. The proposed space compactly represents similarity and therefore is well suited for offline use, such as in mobile applications. To demonstrate the practical applicability, the second contribution is a comprehensive mobile music player that incorporates several smart interfaces to access the user's music collection. Based on this application, we finally present a large-scale user study that underlines the benefits of the introduced interfaces and shows their great user acceptance.", "citation": "Citations (13)", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich"], "authors": ["Michael Kuhn.....http://dblp.org/pers/hd/k/Kuhn_0002:Michael", "Roger Wattenhofer.....http://dblp.org/pers/hd/w/Wattenhofer:Roger", "Samuel Welten.....http://dblp.org/pers/hd/w/Welten:Samuel"], "conf": "mm", "year": "2010", "pages": 10}