{"title": "Max-Contribution: On Optimal Resource Allocation in Delay Tolerant Networks.", "fields": ["approximation algorithm", "dynamic priority scheduling", "dynamic programming", "communication complexity", "schedule"], "abstract": "This is by far the first paper considering joint optimization of link scheduling, routing and replication for disruption-tolerant networks (DTNs). The optimization problems for resource allocation in DTNs are typically solved using dynamic programming which requires knowledge of future events such as meeting schedules and durations. This paper defines a new notion of optimality for DTNs, called snapshot optimality where nodes are not clairvoyant, i.e., cannot look ahead into future events, and thus decisions are made using only contemporarily available knowledge. Unfortunately, the optimal solution for snapshot optimality still requires solving an NP-hard problem of maximum weight independent set and a global knowledge of who currently owns a copy and what their delivery probabilities are. This paper presents a new efficient approximation algorithm, called Distributed Max-Contribution (DMC) that performs greedy scheduling, routing and replication based only on locally and contemporarily available information. Through a simulation study based on real GPS traces tracking over 4000 taxies for about 30 days in a large city, DMC outperforms existing heuristically engineered resource allocation algorithms for DTNs.", "citation": "Citations (114)", "departments": ["KAIST", "KAIST", "KAIST", "North Carolina State University", "North Carolina State University"], "authors": ["Kyunghan Lee.....http://dblp.org/pers/hd/l/Lee:Kyunghan", "Yung Yi.....http://dblp.org/pers/hd/y/Yi:Yung", "Jaeseong Jeong.....http://dblp.org/pers/hd/j/Jeong:Jaeseong", "Hyungsuk Won.....http://dblp.org/pers/hd/w/Won:Hyungsuk", "Injong Rhee.....http://dblp.org/pers/hd/r/Rhee:Injong", "Song Chong.....http://dblp.org/pers/hd/c/Chong:Song"], "conf": "infocom", "year": "2010", "pages": 9}