{"title": "Visual-olfactory display using olfactory sensory map.", "fields": ["aroma", "feeling", "sensory system", "sensation", "distance transform"], "abstract": "Olfactory displays which exist now can only present the set of scents which was prepared beforehand because a set of ―primary odors\" has not been found. In this paper, we focus on development of an olfactory display using cross modality which can represent more patterns of scents than the patterns of scents prepared. Due to cross modal effect between vision and olfaction, human tends to feel not olfactory but visual stimulation as scents. First, we asked subjects to smell various aroma chemicals and evaluate their similarity. Based on the data of similarity among aromas, we built a map of smell distance. Next, we selected a few aroma chemicals from the smell distance map and implemented a visual and olfactory display. Then we conducted an assessment experiment of the display. We presented various pictures and the selected aroma chemicals to subjects and asked them what kind of scent they smelled like. In this experiment, we succeed in giving subjects feeling more patterns of scents than the number of selected aroma chemicals. Also, we succeed in making not olfactory stimulation by aroma chemicals but visual stimulation by pictures as scents. In particular, we find that the visual effect on olfactory sensation is more strong when the distance between the picture and the aroma chemicals is close than when the distance is far.", "citation": "Citations (13)", "departments": ["University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo"], "authors": ["Aiko Nambu.....http://dblp.org/pers/hd/n/Nambu:Aiko", "Takuji Narumi.....http://dblp.org/pers/hd/n/Narumi:Takuji", "Kunihiro Nishimura.....http://dblp.org/pers/hd/n/Nishimura:Kunihiro", "Tomohiro Tanikawa.....http://dblp.org/pers/hd/t/Tanikawa:Tomohiro", "Michitaka Hirose.....http://dblp.org/pers/hd/h/Hirose:Michitaka"], "conf": "vr", "year": "2010", "pages": 4}