{"title": "Is transactional programming actually easier?", "fields": ["transactional leadership", "transactional memory", "optimistic concurrency control", "atomicity", "transaction processing"], "abstract": "Chip multi-processors (CMPs) have become ubiquitous, while tools that ease concurrent programming have not. The promise of increased performance for all applications through ever more parallel hardware requires good tools for concurrent programming, especially for average programmers. Transactional memory (TM) has enjoyed recent interest as a tool that can help programmers program concurrently.   The transactional memory (TM) research community is heavily invested in the claim that programming with transactional memory is easier than alternatives (like locks), but evidence for or against the veracity of this claim is scant. In this paper, we describe a user-study in which 237 undergraduate students in an operating systems course implement the same programs using coarse and fine-grain locks, monitors, and transactions. We surveyed the students after the assignment, and examined their code to determine the types and frequency of programming errors for each synchronization technique. Inexperienced programmers found baroque syntax a barrier to entry for transactional programming. On average, subjective evaluation showed that students found transactions harder to use than coarse-grain locks, but slightly easier to use than fine-grained locks. Detailed examination of synchronization errors in the students' code tells a rather different story. Overwhelmingly, the number and types of programming errors the students made was much lower for transactions than for locks. On a similar programming problem, over 70% of students made errors with fine-grained locking, while less than 10% made errors with transactions.", "citation": "Citations (151)", "year": "2010", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "conf": "ppopp", "authors": ["Christopher J. Rossbach.....http://dblp.org/pers/hd/r/Rossbach:Christopher_J=", "Owen S. Hofmann.....http://dblp.org/pers/hd/h/Hofmann:Owen_S=", "Emmett Witchel.....http://dblp.org/pers/hd/w/Witchel:Emmett"], "pages": 10}