{"title": "Throughput, Delay, and Mobility in Wireless Ad Hoc Networks.", "fields": ["mobile ad hoc network", "throughput", "mobility model", "random walk", "end to end delay"], "abstract": "Throughput capacity in wireless ad hoc networks has been studied extensively under many different mobility models such as i.i.d. mobility model, Brownian mobility model, random walk model, and so on. Most of these research works assume global mobility, i.e., each node moves around in the whole network, and the results show that a constant per-node throughput can be achieved at the cost of very high expected average end-to-end delay. Thus, we are having a very big gap here, either low throughput and low delay in static networks or high throughput and high delay in mobile networks. In this paper, employing a more practical restricted random mobility model, we try to fill in this gap. Specifically, we assume a network of unit area with n nodes is evenly divided into n^{2α} cells with an area of n^{-2α} where 0 ≤ α ≤ 1/2, each of which is further evenly divided into squares with an area of n^{-2β} where 0 ≤ α ≤ β ≤1/2. All nodes can only move inside the cell which they are initially distributed in, and at the beginning of each time slot, every node moves from its current square to a uniformly chosen point in an uniformly chosen adjacent square. Proposing a new multi-hop relay scheme, we present an upper bound and a lower bound on per-node throughput capacity and expected average end-to-end delay, respectively. We finally explicitly show smooth trade-offs between throughput and delay by controlling nodes' mobility.", "citation": "Citations (102)", "departments": ["Mississippi State University", "University of Florida", "University of Tsukuba"], "authors": ["Pan Li.....http://dblp.org/pers/hd/l/Li_0001:Pan", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang", "Jie Li.....http://dblp.org/pers/hd/l/Li:Jie"], "conf": "infocom", "year": "2010", "pages": 9}