{"title": "Public-Key Encryption in the Bounded-Retrieval Model.", "fields": ["deterministic encryption", "filesystem level encryption", "56 bit encryption", "attribute based encryption", "40 bit encryption", "key wrap", "link encryption"], "abstract": "We construct the first public-key encryption scheme in the Bounded-Retrieval Model (BRM), providing security against various forms of adversarial “key leakage” attacks. In this model, the adversary is allowed to learn arbitrary information about the decryption key, subject only to the constraint that the overall amount of “leakage” is bounded by at most l bits. The goal of the BRM is to design cryptographic schemes that can flexibly tolerate arbitrarily leakage bounds l (few bits or many Gigabytes), by only increasing the size of secret key proportionally, but keeping all the other parameters — including the size of the public key, ciphertext, encryption/decryption time, and the number of secret-key bits accessed during decryption — small and independent of l.\n\nAs our main technical tool, we introduce the concept of an Identity-Based Hash Proof System (IB-HPS), which generalizes the notion of hash proof systems of Cramer and Shoup [CS02] to the identity-based setting. We give three different constructions of this primitive based on: (1) bilinear groups, (2) lattices, and (3) quadratic residuosity. As a result of independent interest, we show that an IB-HPS almost immediately yields an Identity-Based Encryption (IBE) scheme which is secure against (small) partial leakage of the target identity’s decryption key. As our main result, we use IB-HPS to construct public-key encryption (and IBE) schemes in the Bounded-Retrieval Model.", "citation": "Not cited", "year": "2010", "departments": ["New York University", "New York University", "Weizmann Institute of Science", "Weizmann Institute of Science", "Google"], "conf": "eurocrypt", "authors": ["Joël Alwen.....http://dblp.org/pers/hd/a/Alwen:Jo=euml=l", "Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Moni Naor.....http://dblp.org/pers/hd/n/Naor:Moni", "Gil Segev.....http://dblp.org/pers/hd/s/Segev:Gil", "Shabsi Walfish.....http://dblp.org/pers/hd/w/Walfish:Shabsi", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "pages": 22}