{"title": "Social action tracking via noise tolerant time-varying factor graphs.", "fields": ["markov random field", "social dynamics", "social heuristics", "social actions", "factor graph"], "abstract": "It is well known that users' behaviors (actions) in a social network are influenced by various factors such as personal interests, social influence, and global trends. However, few publications systematically study how social actions evolve in a dynamic social network and to what extent different factors affect the user actions.   In this paper, we propose a Noise Tolerant Time-varying Factor Graph Model (NTT-FGM) for modeling and predicting social actions. NTT-FGM simultaneously models social network structure, user attributes and user action history for better prediction of the users' future actions. More specifically, a user's action at time  t  is generated by her latent state at  t , which is influenced by her attributes, her own latent state at time  t -1 and her neighbors' states at time  t  and  t -1. Based on this intuition, we formalize the social action tracking problem using the NTT-FGM model; then present an efficient algorithm to learn the model, by combining the ideas from both continuous linear system and Markov random field.   Finally, we present a case study of our model on predicting future social actions. We validate the model on three different types of real-world data sets. Qualitatively, our model can uncover some interesting patterns of the social dynamics. Quantitatively, experimental results show that the proposed method outperforms several baseline methods for action prediction.", "citation": "Citations (101)", "departments": ["Tsinghua University", "Tsinghua University", "IBM", "Huazhong University of Science and Technology", "Beihang University"], "authors": ["Chenhao Tan.....http://dblp.org/pers/hd/t/Tan:Chenhao", "Jie Tang.....http://dblp.org/pers/hd/t/Tang_0001:Jie", "Jimeng Sun.....http://dblp.org/pers/hd/s/Sun:Jimeng", "Quan Lin.....http://dblp.org/pers/hd/l/Lin:Quan", "Fengjiao Wang.....http://dblp.org/pers/hd/w/Wang:Fengjiao"], "conf": "kdd", "year": "2010", "pages": 10}