{"title": "Discriminative K-SVD for dictionary learning in face recognition.", "fields": ["discriminative model", "approximation algorithm", "k svd", "linear classifier", "sparse approximation"], "abstract": "In a sparse-representation-based face recognition scheme, the desired dictionary should have good representational power (i.e., being able to span the subspace of all faces) while supporting optimal discrimination of the classes (i.e., different human subjects). We propose a method to learn an over-complete dictionary that attempts to simultaneously achieve the above two goals. The proposed method, discriminative K-SVD (D-KSVD), is based on extending the K-SVD algorithm by incorporating the classification error into the objective function, thus allowing the performance of a linear classifier and the representational power of the dictionary being considered at the same time by the same optimization procedure. The D-KSVD algorithm finds the dictionary and solves for the classifier using a procedure derived from the K-SVD algorithm, which has proven efficiency and performance. This is in contrast to most existing work that relies on iteratively solving sub-problems with the hope of achieving the global optimal through iterative approximation. We evaluate the proposed method using two commonly-used face databases, the Extended YaleB database and the AR database, with detailed comparison to 3 alternative approaches, including the leading state-of-the-art in the literature. The experiments show that the proposed method outperforms these competing methods in most of the cases. Further, using Fisher criterion and dictionary incoherence, we also show that the learned dictionary and the corresponding classifier are indeed better-posed to support sparse-representation-based recognition.", "citation": "Citations (949)", "year": "2010", "departments": ["Arizona State University", "Arizona State University"], "conf": "cvpr", "authors": ["Qiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Qiang", "Baoxin Li.....http://dblp.org/pers/hd/l/Li:Baoxin"], "pages": 8}