{"title": "PR-join: a non-blocking join achieving higher early result rate with statistical guarantees.", "fields": ["ripple", "online aggregation", "data stream mining", "joins", "order of magnitude"], "abstract": "Online aggregation is a promising solution to achieving fast early responses for interactive ad-hoc queries that compute aggregates on a large amount of data. Essential to the success of online aggregation is a good non-blocking join algorithm that enables both (i) high early result rates with statistical guarantees and (ii) fast end-to-end query times. We analyze existing non-blocking join algorithms and find that they all provide sub-optimal early result rates, and those with fast end-to-end times achieve them only by further sacrificing their early result rates.   We propose a new non-blocking join algorithm,  Partitioned expanding Ripple Join  (PR-Join), which achieves considerably higher early result rates than previous non-blocking joins, while also delivering fast end-to-end query times. PR-Join performs separate, ripple-like join operations on individual hash partitions, where the width of a ripple expands multiplicatively over time. This contrasts with the non-partitioned, fixed-width ripples of Block Ripple Join. Assuming, as in previous non-blocking join studies, that the input relations are in random order, PR-Join ensures representative early results that are amenable to statistical guarantees. We show both analytically and with real-machine experiments that PR-Join achieves over an order of magnitude higher early result rates than previous non-blocking joins. We also discuss the benefits of using a flash-based SSD for temporary storage, showing that PR-Join can then achieve close to optimal end-to-end performance. Finally, we consider the joining of finite data streams that arrive over time, and find that PR-Join achieves similar or higher result rates than RPJ, the state-of-the-art algorithm specialized for that domain.", "citation": "Citations (14)", "year": "2010", "departments": ["Intel", "Intel", "Microsoft"], "conf": "sigmod", "authors": ["Shimin Chen.....http://dblp.org/pers/hd/c/Chen:Shimin", "Phillip B. Gibbons.....http://dblp.org/pers/hd/g/Gibbons:Phillip_B=", "Suman Nath.....http://dblp.org/pers/hd/n/Nath:Suman"], "pages": 12}