{"title": "ParaLog: enabling and accelerating online parallel monitoring of multithreaded applications.", "fields": ["slicing", "debugging", "exploit", "overhead", "thread"], "abstract": "Instruction-grain lifeguards  monitor the events of a running application at the level of individual instructions in order to identify and help mitigate application bugs and security exploits. Because such lifeguards impose a 10-100X slowdown on existing platforms, previous studies have proposed hardware designs to accelerate lifeguard processing. However, these accelerators are either tailored to a specific class of lifeguards or suitable only for monitoring singlethreaded programs.   We present ParaLog, the first design of a system enabling fast online parallel monitoring of multithreaded parallel applications. ParaLog supports a broad class of software-defined lifeguards. We show how three existing accelerators can be enhanced to support online multithreaded monitoring, dramatically reducing lifeguard overheads. We identify and solve several challenges in monitoring parallel applications and/or parallelizing these accelerators, including (i) enforcing inter-thread data dependences, (ii) dealing with inter-thread effects that are not reflected in coherence traffic, (iii) dealing with unmonitored operating system activity, and (iv) ensuring lifeguards can access shared metadata with negligible synchronization overheads. We present our system design for both Sequentially Consistent and Total Store Ordering processors. We implement and evaluate our design on a 16 core simulated CMP, using benchmarks from SPLASH-2 and PARSEC and two lifeguards: a data-flow tracking lifeguard and a memory-access checker lifeguard. Our results show that (i) our parallel accelerators improve performance by 2-9X and 1.13-3.4X for our two lifeguards, respectively, (ii) we are 5-126X faster than the time-slicing approach required by existing techniques, and (iii) our average overheads for applications with eight threads are 51% and 28% for the two lifeguards, respectively.", "citation": "Citations (37)", "year": "2010", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Intel", "Intel", "École Polytechnique Fédérale de Lausanne"], "conf": "asplos", "authors": ["Evangelos Vlachos.....http://dblp.org/pers/hd/v/Vlachos:Evangelos", "Michelle L. Goodstein.....http://dblp.org/pers/hd/g/Goodstein:Michelle_L=", "Michael A. Kozuch.....http://dblp.org/pers/hd/k/Kozuch:Michael_A=", "Shimin Chen.....http://dblp.org/pers/hd/c/Chen:Shimin", "Babak Falsafi.....http://dblp.org/pers/hd/f/Falsafi:Babak", "Phillip B. Gibbons.....http://dblp.org/pers/hd/g/Gibbons:Phillip_B=", "Todd C. Mowry.....http://dblp.org/pers/hd/m/Mowry:Todd_C="], "pages": 14}