{"title": "Maximizing the Contact Opportunity for Vehicular Internet Access.", "fields": ["internet access", "data as a service", "wimax", "software deployment", "scalability"], "abstract": "With increasing popularity of media enabled hand-helds, the need for high data-rate services for mobile users is evident. Large-scale Wireless LANs (WLANs) can provide such a service, but they are expensive to deploy and maintain. Open WLAN access-points (APs), on the other hand, need no new deployments, but can offer only opportunistic services with no guarantees on short term throughput. In contrast, a carefully planned sparse deployment of roadside WiFi provides an economically scalable infrastructure with quality of service assurance to mobile users. In this paper, we propose to study the deployment techniques with respect to roadside WiFi. In particular, we present a new metric, called Contact Opportunity, as a characterization of a roadside WiFi network. Informally, the contact opportunity for a given deployment measures the fraction of distance or time that a mobile user is in contact with some AP when moving through a certain path. Such a metric is closely related to the quality of data service that a mobile user might experience while driving through the system. We then present an efficient deployment method that maximizes the worst case contact opportunity under a budget constraint. We further show how to extend this concept and the deployment techniques to a more intuitive metric -- the average throughput -- by taking various dynamic elements into account. Simulations over a real road network and experimental results show that our approach achieves more than 200% higher minimum contact opportunity, 30%-100% higher average contact opportunity and a significantly improved distribution of average throughput compared with two commonly used baseline algorithms.", "citation": "Citations (110)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "University of Memphis"], "authors": ["Zizhan Zheng.....http://dblp.org/pers/hd/z/Zheng:Zizhan", "Zhixue Lu.....http://dblp.org/pers/hd/l/Lu:Zhixue", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun", "Santosh Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Santosh"], "conf": "infocom", "year": "2010", "pages": 9}