{"title": "Pricing under Constraints in Access Networks: Revenue Maximization and Congestion Management.", "fields": ["yield management", "broadband networks", "price discrimination", "flat rate", "nonlinear pricing"], "abstract": "This paper investigates pricing of Internet connectivity services in the context of a monopoly ISP selling broadband access to consumers. We first study the optimal combination of flat-rate and usage-based access price components for maximization of ISP revenue, subject to a capacity constraint on the data-rate demand. Next, we consider time-varying consumer utilities for broadband data rates that can result in uneven demand for data-rate over time. Practical considerations limit the viability of altering prices over time to smoothen out the demanded data-rate. Despite such constraints on pricing, our analysis reveals that the ISP can retain the revenue by setting a low usage fee and dropping packets of consumer demanded data that exceed capacity. Regulatory attention on ISP congestion management discourages such ``technical\" practices and promotes economics based approaches. We characterize the loss in ISP revenue from an economics based approach. Regulatory requirements further impose limitations on price discrimination across consumers, and we derive the revenue loss to the ISP from such restrictions. We then develop partial recovery of revenue loss through non-linear pricing that does not explicitly discriminate across consumers. While determination of the access price is ultimately based on additional considerations beyond the scope of this paper, the analysis here can serve as a benchmark to structure access price in broadband access networks.", "citation": "Citations (111)", "departments": ["Princeton University", "Princeton University", "Princeton University", "Arizona State University"], "authors": ["Prashanth Hande.....http://dblp.org/pers/hd/h/Hande:Prashanth", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung", "A. Robert Calderbank.....http://dblp.org/pers/hd/c/Calderbank:A=_Robert", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan"], "conf": "infocom", "year": "2010", "pages": 9}