{"title": "Personalized Web search with location preferences.", "fields": ["ranking", "personalization", "information privacy", "ontology", "mobile search"], "abstract": "As the amount of Web information grows rapidly, search engines must be able to retrieve information according to the user's preference. In this paper, we propose a new web search personalization approach that captures the user's interests and preferences in the form of concepts by mining search results and their clickthroughs. Due to the important role location information plays in mobile search, we separate concepts into content concepts and location concepts, and organize them into ontologies to create an ontology-based, multi-facet (OMF) profile to precisely capture the user's content and location interests and hence improve the search accuracy. Moreover, recognizing the fact that different users and queries may have different emphases on content and location information, we introduce the notion of content and location entropies to measure the amount of content and location information associated with a query, and click content and location entropies to measure how much the user is interested in the content and location information in the results. Accordingly, we propose to define personalization effectiveness based on the entropies and use it to balance the weights between the content and location facets. Finally, based on the derived ontologies and personalization effectiveness, we train an SVM to adapt a personalized ranking function for re-ranking of future search. We conduct extensive experiments to compare the precision produced by our OMF profiles and that of a baseline method. Experimental results show that OMF improves the precision significantly compared to the baseline.", "citation": "Citations (114)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Pennsylvania State University"], "authors": ["Kenneth Wai-Ting Leung.....http://dblp.org/pers/hd/l/Leung:Kenneth_Wai=Ting", "Dik Lun Lee.....http://dblp.org/pers/hd/l/Lee:Dik_Lun", "Wang-Chien Lee.....http://dblp.org/pers/hd/l/Lee:Wang=Chien"], "conf": "icde", "year": "2010", "pages": 12}