{"title": "An Auction Framework for Spectrum Allocation with Interference Constraint in Cognitive Radio Networks.", "fields": ["open spectrum", "bandwidth allocation", "frequency allocation", "auction algorithm", "correlated equilibrium"], "abstract": "Extensive research in recent years has shown the benefits of \\textit{cognitive radio} technologies to improve the flexibility and efficiency of spectrum utilization. This new communication paradigm, however, requires a well-designed spectrum allocation mechanism. In this paper, we propose an auction framework for cognitive radio networks to allow unlicensed secondary users (SUs) to share the available spectrum of licensed primary users (PUs) fairly and efficiently, subject to the interference temperature constraint at each PU. To study the competition among SUs, we formulate a non-cooperative multiple-PU multiple-SU auction game and study the structure of the resulting equilibrium by solving a non-continuous two-dimensional optimization problem. A distributed algorithm is developed in which each SU updates its strategy based on local information to converge to the equilibrium. We then extend the proposed auction framework to the more challenging scenario with free spectrum bands. We develop an algorithm based on the no-regret learning to reach a correlated equilibrium of the auction game. The proposed algorithm, which can be implemented distributedly based on local observation, is especially suited in decentralized adaptive learning environments as cognitive radio networks. Finally, through numerical experiments, we demonstrate the effectiveness of the proposed auction framework in achieving high efficiency and fairness in spectrum allocation.", "citation": "Citations (108)", "departments": ["University of Paris-Sud", "Polytechnic University of Milan", "Télécom ParisTech", "Télécom ParisTech"], "authors": ["Lin Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lin", "Stefano Iellamo.....http://dblp.org/pers/hd/i/Iellamo:Stefano", "Marceau Coupechoux.....http://dblp.org/pers/hd/c/Coupechoux:Marceau", "Philippe Godlewski.....http://dblp.org/pers/hd/g/Godlewski:Philippe"], "conf": "infocom", "year": "2010", "pages": 9}