{"title": "Multi-task warped Gaussian process for personalized age estimation.", "fields": ["overfitting", "kernel", "cross validation", "estimator", "multi task learning"], "abstract": "Automatic age estimation from facial images has aroused research interests in recent years due to its promising potential for some computer vision applications. Among the methods proposed to date, personalized age estimation methods generally outperform global age estimation methods by learning a separate age estimator for each person in the training data set. However, since typical age databases only contain very limited training data for each person, training a separate age estimator using only training data for that person runs a high risk of overfitting the data and hence the prediction performance is limited. In this paper, we propose a novel approach to age estimation by formulating the problem as a multi-task learning problem. Based on a variant of the Gaussian process (GP) called warped Gaussian process (WGP), we propose a multi-task extension called multi-task warped Gaussian process (MTWGP). Age estimation is formulated as a multi-task regression problem in which each learning task refers to estimation of the age function for each person. While MTWGP models common features shared by different tasks (persons), it also allows task-specific (person-specific) features to be learned automatically. Moreover, unlike previous age estimation methods which need to specify the form of the regression functions or determine many parameters in the functions using inefficient methods such as cross validation, the form of the regression functions in MTWGP is implicitly defined by the kernel function and all its model parameters can be learned from data automatically. We have conducted experiments on two publicly available age databases, FG-NET and MORPH. The experimental results are very promising in showing that MTWGP compares favorably with state-of-the-art age estimation methods.", "citation": "Citations (143)", "year": "2010", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "conf": "cvpr", "authors": ["Yu Zhang.....http://dblp.org/pers/hd/z/Zhang_0006:Yu", "Dit-Yan Yeung.....http://dblp.org/pers/hd/y/Yeung:Dit=Yan"], "pages": 8}