{"title": "Distance Estimation by Constructing The Virtual Ruler in Anisotropic Sensor Networks.", "fields": ["ruler", "uniform distribution", "measurement uncertainty", "key distribution in wireless sensor networks", "isotropy"], "abstract": "Distance estimation is fundamental for many functionalities of wireless sensor networks and has been studied intensively in recent years. A critical challenge in distance estimation is handling anisotropic problems in sensor networks. Compared with isotropic networks, anisotropic networks are more intractable in that their properties vary according to the directions of measurement. Anisotropic properties result from various factors, such as geographic shapes, irregular radio patterns, node densities, and impacts from obstacles. In this paper, we study the problem of measuring irregularity of sensor networks and evaluating its impact on distance estimation. In particular, we establish a new metric to measure irregularity along a path in sensor networks, and identify turning nodes where a considered path is inflected. Furthermore, we develop an approach to construct a virtual ruler for distance estimation between any pair of sensor nodes. The construction of a virtual ruler is carried out according to distance measurements among beacon nodes. However, it does not require beacon nodes to be deployed uniformly throughout sensor networks. Compared with existing methods, our approach neither assumes global knowledge of boundary recognition nor relies on uniform distribution of beacon nodes. Therefore, this approach is robust and applicable in practical environments. Simulation results show that our approach outperforms some previous methods, such as DVDistance and PDM.", "citation": "Citations (17)", "departments": ["Southeast University", "Southeast University", "Temple University"], "authors": ["Yun Wang.....http://dblp.org/pers/hd/w/Wang:Yun", "Kai Li.....http://dblp.org/pers/hd/l/Li:Kai", "Jie Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jie"], "conf": "infocom", "year": "2010", "pages": 9}