{"title": "Value-aware Resource Allocation for Service Guarantees in Networks.", "fields": ["network packet", "distributed algorithm", "value of information", "network utility", "information transfer", "controller", "network congestion"], "abstract": "The traditional formulation of the total value of information transfer is a multi-commodity flow problem. Here, each data source is seen as generating a commodity along a fixed route, and the objective is to maximize the total system throughput under some concept of fairness, subject to capacity constraints of the links used. This problem is well studied under the framework of network utility maximization and has led to several different distributed congestion control schemes. However, this idea of value does not capture the fact that flows might associate value, not just with throughput, but with link-quality metrics such as packet delay, jitter and so on. The traditional congestion control problem is redefined to include individual source preferences. It is assumed that degradation in link quality seen by a flow adds up on the links it traverses, and the total utility is maximized in such a way that the quality degradation seen by each source is bounded by a value that it declares. Decoupling source-dissatisfaction and link- degradation through an ``effective capacity'' variable, a distributed and provably optimal resource allocation algorithm is designed, to maximize system utility subject to these quality constraints. The applicability of our controller in different situations is illustrated, and results are supported through numerical examples.", "citation": "Citations (6)", "departments": ["Texas A&M University", "Texas A&M University", "Texas A&M University", "Texas A&M University", "Ericsson", "Texas A&M University", "Texas A&M University"], "authors": ["Parimal Parag.....http://dblp.org/pers/hd/p/Parag:Parimal", "Srinivas Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Srinivas", "Jean-François Chamberland.....http://dblp.org/pers/hd/c/Chamberland:Jean=Fran=ccedil=ois"], "conf": "infocom", "year": "2010", "pages": 9}