{"title": "An 80-Fold Speedup, 15.0 TFlops Full GPU Acceleration of Non-Hydrostatic Weather Model ASUCA Production Code.", "fields": ["grid computing", "porting", "speedup", "cuda", "gpu cluster"], "abstract": "Regional weather forecasting demands fast simulation over fine-grained grids, resulting in extremely memory- bottlenecked computation, a difficult problem on conventional supercomputers. Early work on accelerating mainstream weather code WRF using GPUs with their high memory performance, however, resulted in only minor speedup due to partial GPU porting of the huge code. Our full CUDA porting of the high- resolution weather prediction model ASUCA is the first such one we know to date; ASUCA is a next-generation, production weather code developed by the Japan Meteorological Agency, similar to WRF in the underlying physics (non-hydrostatic model). Benchmark on the 528 (NVIDIA GT200 Tesla) GPU TSUBAME Supercomputer at the Tokyo Institute of Technology demonstrated over 80-fold speedup and good weak scaling achieving 15.0 TFlops in single precision for 6956 x 6052 x 48 mesh. Further benchmarks on TSUBAME 2.0, which will embody over 4000 NVIDIA Fermi GPUs and deployed in October 2010, will be presented.", "citation": "Citations (138)", "departments": ["Tokyo Institute of Technology", "Tokyo Institute of Technology", "Japan Meteorol. Agency, Japan", "Japan Meteorol. Agency, Japan", "Japan Meteorol. Agency, Japan"], "authors": ["Takashi Shimokawabe.....http://dblp.org/pers/hd/s/Shimokawabe:Takashi", "Takayuki Aoki.....http://dblp.org/pers/hd/a/Aoki:Takayuki", "Chiashi Muroi.....http://dblp.org/pers/hd/m/Muroi:Chiashi", "Junichi Ishida.....http://dblp.org/pers/hd/i/Ishida:Junichi", "Kohei Kawano.....http://dblp.org/pers/hd/k/Kawano:Kohei", "Toshio Endo.....http://dblp.org/pers/hd/e/Endo:Toshio", "Akira Nukada.....http://dblp.org/pers/hd/n/Nukada:Akira", "Naoya Maruyama.....http://dblp.org/pers/hd/m/Maruyama:Naoya", "Satoshi Matsuoka.....http://dblp.org/pers/hd/m/Matsuoka:Satoshi"], "conf": "sc", "year": "2010", "pages": 11}