{"title": "Tunable Locally-Optimal Geographical Forwarding in Wireless Sensor Networks With Sleep-Wake Cycling Nodes.", "fields": ["network packet", "look ahead", "sink", "markov decision process", "hop"], "abstract": "We consider a wireless sensor network whose main function is to detect certain infrequent alarm events, and to forward alarm packets to a base station, using geographical forwarding. The nodes know their locations, and they sleep-wake cycle, waking up periodically but not synchronously. In this situation, when a node has a packet to forward to the sink, there is a trade-off between how long this node waits for a suitable neighbor to wake up and the progress the packet makes towards the sink once it is forwarded to this neighbor. Hence, in choosing a relay node, we consider the problem of minimizing delay subject to a constraint on the progress. By constraint relaxation, we formulate this next hop relay selection problem as a Markov decision process (MDP). The exact optimal solution (BF (Best Forward)) can be found, but is computationally intensive. Next, we consider a simplified model in which the times between the wake up instants of successive candidate relay nodes are assumed to be i.i.d. and exponentially distributed. The optimal policy (SF (Simplified Forward)) for this model is a simple one-step-look-ahead rule. Simulations show that SF is very close in performance to BF, even for a reasonably small node density. We then study the end-to-end performance of SF in comparison with two extremal policies: Max Forward (MF) and First Forward (FF), and an end-to-end delay minimizing policy proposed by Kim et al. We find that, with appropriate choice of one hop average progress constraint, SF can be tuned to provide a favorable trade-off between end-to-end packet delay and the number of hops in the forwarding path.", "citation": "Citations (31)", "departments": ["Indian Institute of Science", "Indian Institute of Science"], "authors": ["Kolar Purushothama Naveen.....http://dblp.org/pers/hd/n/Naveen:Kolar_Purushothama", "Anurag Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Anurag"], "conf": "infocom", "year": "2010", "pages": 9}