{"title": "NOrec: streamlining STM by abolishing ownership records.", "fields": ["software transactional memory", "transactional memory", "software system", "thread", "backward compatibility"], "abstract": "Drawing inspiration from several previous projects, we present an ownership-record-free software transactional memory (STM) system that combines extremely low overhead with unusually clean semantics. While unlikely to scale to hundreds of active threads, this \"NOrec\" system offers many appealing features: very low fast-path latency--as low as any system we know of that admits concurrent updates; publication and privatization safety; livelock freedom; a small, constant amount of global metadata, and full compatibility with existing data structure layouts; no false conflicts due to hash collisions; compatibility with both managed and unmanaged languages, and both static and dynamic compilation; and easy acccommodation of closed nesting, inevitable (irrevocable) transactions, and starvation avoidance mechanisms. To the best of our knowledge, no extant STM system combines this set of features.   While transactional memory for processors with hundreds of cores is likely to require hardware support, software implementations will be required for backward compatibility with current and near-future processors with 2--64 cores, as well as for fall-back in future machines when hardware resources are exhausted. Our experience suggests that NOrec may be an ideal candidate for such a software system. We also observe that it has considerable appeal for use within the operating system, and in systems that require both closed nesting and publication safety.", "citation": "Citations (302)", "year": "2010", "departments": ["University of Rochester", "Lehigh University", "University of Rochester"], "conf": "ppopp", "authors": ["Luke Dalessandro.....http://dblp.org/pers/hd/d/Dalessandro:Luke", "Michael F. Spear.....http://dblp.org/pers/hd/s/Spear:Michael_F=", "Michael L. Scott.....http://dblp.org/pers/hd/s/Scott:Michael_L="], "pages": 12}