{"title": "Differentially private aggregation of distributed time-series with transformation and encryption.", "fields": ["laplace transform", "encryption", "news aggregator", "discrete fourier transform", "differential privacy"], "abstract": "We propose the first differentially private aggregation algorithm for distributed time-series data that offers good practical utility without any trusted server. This addresses two important challenges in participatory data-mining applications where (i) individual users collect temporally correlated time-series data (such as location traces, web history, personal health data), and (ii) an untrusted third-party aggregator wishes to run aggregate queries on the data.   To ensure differential privacy for time-series data despite the presence of temporal correlation, we propose the Fourier Perturbation Algorithm (FPA  k  ). Standard differential privacy techniques perform poorly for time-series data. To answer  n  queries, such techniques can result in a noise of Θ( n ) to each query answer, making the answers practically useless if  n  is large. Our FPA  k   algorithm perturbs the Discrete Fourier Transform of the query answers. For answering  n  queries, FPA  k   improves the expected error from Θ( n ) to roughly Θ( k ) where  k  is the number of Fourier coefficients that can (approximately) reconstruct all the  n  query answers. Our experiments show that  k   n  for many real-life data-sets resulting in a huge error-improvement for FPA  k  .   To deal with the absence of a trusted central server, we propose the Distributed Laplace Perturbation Algorithm (DLPA) to add noise in a distributed way in order to guarantee differential privacy. To the best of our knowledge, DLPA is the first distributed differentially private algorithm that can scale with a large number of users: DLPA outperforms the only other distributed solution for differential privacy proposed so far, by reducing the computational load per user from  O ( U ) to  O (1) where  U  is the number of users.", "citation": "Citations (358)", "year": "2010", "departments": ["University of Washington", "Micorosoft Rese ... edmond, WA, USA"], "conf": "sigmod", "authors": ["Vibhor Rastogi.....http://dblp.org/pers/hd/r/Rastogi:Vibhor", "Suman Nath.....http://dblp.org/pers/hd/n/Nath:Suman"], "pages": 12}