{"title": "ISP-Enabled Behavioral Ad Targeting without Deep Packet Inspection.", "fields": ["deep packet inspection", "web page", "online advertising", "web navigation", "server"], "abstract": "Online advertising is a rapidly growing industry currently dominated by the search engine 'giant' Google. In an attempt to tap into this huge market, Internet Service Providers (ISPs) started deploying deep packet inspection techniques to track and collect user browsing behavior. However, such techniques violate wiretap laws that explicitly prevent intercepting the contents of communication without gaining consent from consumers. In this paper, we show that it is possible for ISPs to extract user browsing patterns without inspecting contents of communication. Our contributions are threefold. First, we develop a methodology and implement a system that is capable of extracting web browsing features from stored non- content based records of online communication, which could be legally shared. When such browsing features are correlated with information collected by independently crawling the Web, it becomes possible to recover the actual web pages accessed by clients. Second, we systematically evaluate our system on the Internet and demonstrate that it can successfully recover user browsing patterns with high accuracy. Finally, our findings call for a comprehensive legislative reform that would not only enable fair competition in the online advertising business, but more importantly, protect the consumer rights in a more effective way.", "citation": "Citations (2)", "departments": ["University of Granada", "University of Electronic Science and Technology of China", "University of Granada", "Northwestern University"], "authors": ["Gabriel Maciá-Fernández.....http://dblp.org/pers/hd/m/Maci=aacute==Fern=aacute=ndez:Gabriel", "Yong Wang.....http://dblp.org/pers/hd/w/Wang:Yong", "Rafael Rodríguez-Gómez.....http://dblp.org/pers/hd/r/Rodr=iacute=guez=G=oacute=mez:Rafael", "Aleksandar Kuzmanovic.....http://dblp.org/pers/hd/k/Kuzmanovic:Aleksandar"], "conf": "infocom", "year": "2010", "pages": 9}