{"title": "Petascale Direct Numerical Simulation of Blood Flow on 200K Cores and Heterogeneous Architectures.", "fields": ["coprocessor", "petascale computing", "multithreading", "x86", "gpu cluster"], "abstract": "We present a fast, petaflop-scalable algorithm for Stokesian particulate flows. Our goal is the direct simulation of blood, which we model as a mixture of a Stokesian fluid (plasma) and red blood cells (RBCs). Directly simulating blood is a challenging multiscale, multiphysics problem. We report simulations with up to 200 million deformable RBCs. The largest simulation amounts to 90 billion unknowns in space. In terms of the number of cells, we improve the state-of-the art by several orders of magnitude: the previous largest simulation, at the same physical fidelity as ours, resolved the flow of O(1,000-10,000) RBCs. Our approach has three distinct characteristics: (1) we faithfully represent the physics of RBCs by using nonlinear solid mechanics to capture the deformations of each cell; (2) we accurately resolve the long-range, N-body, hydrodynamic interactions between RBCs (which are caused by the surrounding plasma); and (3) we allow for the highly non-uniform distribution of RBCs in space. The new method has been implemented in the software library MOBO (for “Moving Boundaries”). We designed MOBO to support parallelism at all levels, including inter-node distributed memory parallelism, intra-node shared memory parallelism, data parallelism (vectorization), and fine-grained multithreading for GPUs. We have implemented and optimized the majority of the computation kernels on both Intel/AMD x86 and NVidia's Tesla/Fermi platforms for single and double floating point precision. Overall, the code has scaled on 256 CPU-GPUs on the Teragrid's Lincoln cluster and on 200,000 AMD cores of the Oak Ridge national Laboratory's Jaguar PF system. In our largest simulation, we have achieved 0.7 Petaflops/s of sustained performance on Jaguar.", "citation": "Citations (157)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "New York University", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Abtin Rahimian.....http://dblp.org/pers/hd/r/Rahimian:Abtin", "Ilya Lashuk.....http://dblp.org/pers/hd/l/Lashuk:Ilya", "Shravan K. Veerapaneni.....http://dblp.org/pers/hd/v/Veerapaneni:Shravan_K=", "Aparna Chandramowlishwaran.....http://dblp.org/pers/hd/c/Chandramowlishwaran:Aparna", "Dhairya Malhotra.....http://dblp.org/pers/hd/m/Malhotra:Dhairya", "Logan Moon.....http://dblp.org/pers/hd/m/Moon:Logan", "Rahul S. Sampath.....http://dblp.org/pers/hd/s/Sampath:Rahul_S=", "Aashay Shringarpure.....http://dblp.org/pers/hd/s/Shringarpure:Aashay", "Jeffrey S. Vetter.....http://dblp.org/pers/hd/v/Vetter:Jeffrey_S=", "Richard W. Vuduc.....http://dblp.org/pers/hd/v/Vuduc:Richard_W=", "Denis Zorin.....http://dblp.org/pers/hd/z/Zorin:Denis", "George Biros.....http://dblp.org/pers/hd/b/Biros:George"], "conf": "sc", "year": "2010", "pages": 11}