{"title": "The automatic design of feature spaces for local image descriptors using an ensemble of non-linear feature extractors.", "fields": ["contextual image classification", "metric", "feature", "feature detection", "learning automata"], "abstract": "The design of feature spaces for local image descriptors is an important research subject in computer vision due to its applicability in several problems, such as visual classification and image matching. In order to be useful, these descriptors have to present a good trade off between discriminating power and robustness to typical image deformations. The feature spaces of the most useful local descriptors have been manually designed based on the goal above, but this design often limits the use of these descriptors for some specific matching and visual classification problems. Alternatively, there has been a growing interest in producing feature spaces by an automatic combination of manually designed feature spaces, or by an automatic selection of feature spaces and spatial pooling methods, or by the use of distance metric learning methods. While most of these approaches are usually applied to specific matching or classification problems, where test classes are the same as training classes, a few works aim at the general feature transform problem where the training classes are different from the test classes. The hope in the latter works is the automatic design of a universal feature space for local descriptor matching, which is the topic of our work. In this paper, we propose a new incremental method for learning automatically feature spaces for local descriptors. The method is based on an ensemble of non-linear feature extractors trained in relatively small and random classification problems with supervised distance metric learning techniques. Results on two widely used public databases show that our technique produces competitive results in the field.", "citation": "Citations (6)", "year": "2010", "departments": ["Instituto Superior Técnico"], "conf": "cvpr", "authors": ["Gustavo Carneiro.....http://dblp.org/pers/hd/c/Carneiro:Gustavo"], "pages": 8}