{"title": "Interactive Locking, Zero-Knowledge PCPs, and Unconditional Cryptography.", "fields": ["oblivious transfer", "distributed computing", "commitment scheme", "cryptography", "secure multi party computation", "zero knowledge proof", "stateless protocol", "mathematics", "theoretical computer science"], "abstract": "Motivated by the question of basing cryptographic protocols on stateless tamper-proof hardware tokens, we revisit the question of unconditional two-prover zero-knowledge proofs for NP. We show that such protocols exist in the interactive PCP model of Kalai and Raz (ICALP '08), where one of the provers is replaced by a PCP oracle. This strengthens the feasibility result of Ben-Or, Goldwasser, Kilian, and Wigderson (STOC '88) which requires two stateful provers. In contrast to previous zero-knowledge PCPs of Kilian, Petrank, and Tardos (STOC '97), in our protocol both the prover and the PCP oracle are efficient given an NP witness.\n\nOur main technical tool is a new primitive that we call interactive locking, an efficient realization of an unconditionally secure commitment scheme in the interactive PCP model. We implement interactive locking by adapting previous constructions of interactive hashing protocols to our setting, and also provide a direct construction which uses a minimal amount of interaction and improves over our interactive hashing based constructions.\n\nFinally, we apply the above results towards showing the feasibility of basing unconditional cryptography on stateless tamper-proof hardware tokens, and obtain the following results. (1) We show that if tokens can be used to encapsulate other tokens, then there exist unconditional and statistically secure (in fact, UC secure) protocols for general secure computation. (2) Even if token encapsulation is not possible, there are unconditional and statistically secure commitment protocols and zero-knowledge proofs for NP. (3) Finally, if token encapsulation is not possible, then no protocol can realize statistically secure oblivious transfer.", "citation": "Not cited", "departments": ["Microsoft", "Technion – Israel Institute of Technology", "Princeton University", "University of California, Los Angeles"], "authors": ["Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Yuval Ishai.....http://dblp.org/pers/hd/i/Ishai:Yuval", "Mohammad Mahmoody.....http://dblp.org/pers/hd/m/Mahmoody:Mohammad", "Amit Sahai.....http://dblp.org/pers/hd/s/Sahai:Amit"], "conf": "crypto", "year": "2010", "pages": 18}