{"title": "Robust and Fast Pattern Matching for Intrusion Detection.", "fields": ["regular expression", "backtracking", "pattern matching", "blossom algorithm", "deterministic algorithm"], "abstract": "The rule language of an Intrusion Detection System (IDS) plays a critical role in its effectiveness. A rule language must be expressive, in order to describe attack patterns as precisely as possible. It must also allow for a matching algorithm with predictable and low complexity, in order to ensure robustness against denial-of-service attacks. Unfortunately, these requirements often conflict. We show, for instance, that a single rule, when coupled with a backtracking matching algorithm, can bring the processing rate down to nearly ONE packet per second. Performance vulnerabilities of this type are known for patterns described using regular expressions, and can be avoided by using a deterministic matching algorithm. Increasingly, however, rules are being written using the more powerful regex syntax, which includes non-regular features such as back-references. The matching algorithm for general regex's is based on backtracking, and is thus vulnerable to attacks. The main contribution of this paper is a deterministic algorithm for the full regex syntax, which builds upon the deterministic algorithm for regular expressions. We provide a (rough) complexity bound on the worst-case performance, and show that this bound can be tightened through compile-time analysis of the regex structure. These bounds can be used as an admissibility check, to isolate expressions that require further analysis. Finally, we present an implementation of these algorithms in the context of the Snort IDS, and experimental results on several packet traces which show substantial improvement over the backtracking algorithm.", "citation": "Citations (27)", "departments": ["Bell Labs", "Bell Labs"], "authors": ["Kedar S. Namjoshi.....http://dblp.org/pers/hd/n/Namjoshi:Kedar_S=", "Girija J. Narlikar.....http://dblp.org/pers/hd/n/Narlikar:Girija_J="], "conf": "infocom", "year": "2010", "pages": 9}