{"title": "Optimal Channel Choice for Collaborative Ad-Hoc Dissemination.", "fields": ["metropolis hastings algorithm", "greedy algorithm", "assignment problem", "dissemination", "heuristics"], "abstract": "Collaborative ad-hoc dissemination of information has been proposed as an efficient means to disseminate information among devices in a wireless ad-hoc network. Devices help in forwarding the information channels to the entire network, by disseminating the channels they subscribe to, plus others. We consider the case where devices have a limited amount of storage that they are willing to devote to the public good, and thus have to decide which channels they are willing to help disseminate. We are interested in finding channel selection strategies which optimize the dissemination time across the channels. We first consider a simple model under the random mixing assumption; we show that channel dissemination time can be characterized in terms of the number of nodes that forward this channel. Then we show that maximizing a social welfare is equivalent to an assignment problem, whose solution can be obtained by a centralized greedy algorithm. We show empirical evidence, based on Zune data, that there is a substantial difference between the utility of the optimal assignment and heuristics that were used in the past. We also show that the optimal assignment can be approximated in a distributed way by a Metropolis-Hastings sampling algorithm. We also give a variant that accounts for battery level. This leads to a practical channel selection and re-selection algorithm that can be implemented without any central control.", "citation": "Citations (55)", "departments": ["University of Copenhagen", "École Polytechnique Fédérale de Lausanne", "Microsoft"], "authors": ["Liang Hu.....http://dblp.org/pers/hd/h/Hu:Liang", "Jean-Yves Le Boudec.....http://dblp.org/pers/hd/b/Boudec:Jean=Yves_Le", "Milan Vojnovic.....http://dblp.org/pers/hd/v/Vojnovic:Milan"], "conf": "infocom", "year": "2010", "pages": 9}