{"title": "SMARTINT: A system for answering queries over web databases using attribute dependencies.", "fields": ["data integration", "precision and recall", "database normalization", "foreign key", "tuple"], "abstract": "Many web databases can be seen as providing partial and overlapping information about entities in the world. To answer queries effectively, we need to integrate the information about the individual entities that are fragmented over multiple sources. At first blush this is just the inverse of traditional database normalization problem - rather than go from a universal relation to normalized tables, we want to reconstruct the universal relation given the tables (sources). The standard way of reconstructing the entities will involve joining the tables. Unfortunately, because of the autonomous and decentralized way in which the sources are populated, they often do not have Primary Key - Foreign Key relations. While tables do share attributes, naive joins over these shared attributes can result in reconstruction of many spurious entities thus seriously compromising precision. Our system, SMARTINT is aimed at addressing the problem of data integration in such scenarios. Given a query, our system uses the Approximate Functional Dependencies(AFDs) to piece together a tree of relevant tables and schemas for joining them. The result tuples produced by our system are able to strike a favorable balance between precision and recall.", "citation": "Citations (4)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Ravi Gummadi.....http://dblp.org/pers/hd/g/Gummadi:Ravi", "Anupam Khulbe.....http://dblp.org/pers/hd/k/Khulbe:Anupam", "Aravind Kalavagattu.....http://dblp.org/pers/hd/k/Kalavagattu:Aravind", "Sanil Salvi.....http://dblp.org/pers/hd/s/Salvi:Sanil", "Subbarao Kambhampati.....http://dblp.org/pers/hd/k/Kambhampati:Subbarao"], "conf": "icde", "year": "2010", "pages": 4}