{"title": "Measurement and Diagnosis of Address Misconfigured P2P Traffic.", "fields": ["search engine indexing", "phenomenon", "bittorrent", "upload", "honeypot", "root cause", "internet traffic"], "abstract": "Misconfigured P2P traffic caused by bugs in volunteer-developed P2P software or by attackers is prevalent. It influences both end users and ISPs. In this paper, we discover and study address-misconfigured P2P traffic, a major class of such misconfiguration. P2P address misconfiguration is a phenomenon in which a large number of peers send P2P file downloading requests to a ``random'' target on the Internet. On measuring three Honeynet datasets spanning four years and across five different /8 networks, we find address-misconfigured P2P traffic on average contributes 38.9% of Internet background radiation, increasing by more than 100% every year. In this paper, we design the P2PScope, a measurement tool, to detect and diagnose such unwanted traffic. We find, in all the P2P systems, address misconfiguration is caused by resource mapping contamination, i.e., the sources returned for a given file ID through P2P indexing are not valid. Different P2P systems have different reasons for such contamination. For eMule, we find that the root cause is mainly a network byte ordering problem in the eMule Source Exchange protocol. For BitTorrent misconfiguration, one reason is that anti-P2P companies actively inject bogus peers into the P2P system. Another reason is that the KTorrent implementation has a byte order problem. We also design approaches to detect anti-P2P peers without false positives.", "citation": "Citations (12)", "departments": ["Northwestern University", "Yahoo!", "Northwestern University", "Northwestern University", "Yahoo!", "Northwestern University", "Northwestern University", "NEC Laboratories America, Inc."], "authors": ["Zhichun Li.....http://dblp.org/pers/hd/l/Li:Zhichun", "Anup Goyal.....http://dblp.org/pers/hd/g/Goyal:Anup", "Yan Chen.....http://dblp.org/pers/hd/c/Chen_0004:Yan", "Aleksandar Kuzmanovic.....http://dblp.org/pers/hd/k/Kuzmanovic:Aleksandar"], "conf": "infocom", "year": "2010", "pages": 9}