{"title": "COMPASS: a programmable data prefetcher using idle GPU shaders.", "fields": ["graphics processing unit", "instruction prefetch", "idle", "shader", "data parallelism"], "abstract": "A traditional fixed-function graphics accelerator has evolved into a programmable general-purpose graphics processing unit over the last few years. These powerful computing cores are mainly used for accelerating graphics applications or enabling low-cost scientific computing. To further reduce the cost and form factor, an emerging trend is to integrate GPU along with the memory controllers onto the same die with the processor cores. However, given such a system-on-chip, the GPU, while occupying a substantial part of the silicon, will sit idle and contribute nothing to the overall system performance when running non-graphics workloads or applications lack of data-level parallelism. In this paper, we propose COMPASS, a compute shader-assisted data prefetching scheme, to leverage the GPU resource for improving single-threaded performance on an integrated system. By harnessing the GPU shader cores with very lightweight architectural support, COMPASS can emulate the functionality of a hardware-based prefetcher using the idle GPU and successfully improve the memory performance of single-thread applications. Moreover, thanks to its flexibility and programmability, one can implement the best performing prefetch scheme to improve each specific application as demonstrated in this paper. With COMPASS, we envision that a future application vendor can provide a custom-designed COMPASS shader bundled with its software to be loaded at runtime to optimize the performance. Our simulation results show that COMPASS can improve the single-thread performance of memory-intensive applications by 68% on average.", "citation": "Citations (21)", "year": "2010", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "asplos", "authors": ["Dong Hyuk Woo.....http://dblp.org/pers/hd/w/Woo:Dong_Hyuk", "Hsien-Hsin S. Lee.....http://dblp.org/pers/hd/l/Lee:Hsien=Hsin_S="], "pages": 14}