{"title": "Retiring Replicants: Congestion Control for Intermittently-Connected Networks.", "fields": ["stochastic modelling", "approximation algorithm", "markov process", "network congestion", "limiting"], "abstract": "The widespread availability of mobile wireless devices offers growing opportunities for the formation of temporary networks with only intermittent connectivity. These intermittently-connected networks (ICNs) typically lack stable end-to-end paths. In order to improve the delivery rates of the networks, new store-carry-and-forward protocols have been proposed which often use message replication as a forwarding mechanism. Message replication is effective at improving delivery, but given the limited resources of ICN nodes, such as buffer space, bandwidth and energy, as well as the highly dynamic nature of these networks, replication can easily overwhelm node resources. In this work we propose a novel node-based replication management algorithm which addresses buffer congestion by dynamically limiting the replication a node performs during each encounter. The insight for our algorithm comes from a stochastic model of message delivery in ICNs with constrained buffer space. We show through simulation that our algorithm is effective, nearly tripling delivery rates in some scenarios, and imposes little overhead.", "citation": "Citations (89)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Nathanael Thompson.....http://dblp.org/pers/hd/t/Thompson:Nathanael", "Samuel C. Nelson.....http://dblp.org/pers/hd/n/Nelson:Samuel_C=", "Mehedi Bakht.....http://dblp.org/pers/hd/b/Bakht:Mehedi", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F=", "Robin Kravets.....http://dblp.org/pers/hd/k/Kravets:Robin"], "conf": "infocom", "year": "2010", "pages": 9}