{"title": "Chaotic invariants of Lagrangian particle trajectories for anomaly detection in crowded scenes.", "fields": ["optical flow", "invariant", "lyapunov exponent", "correlation dimension", "anomaly detection"], "abstract": "A novel method for crowd flow modeling and anomaly detection is proposed for both coherent and incoherent scenes. The novelty is revealed in three aspects. First, it is a unique utilization of particle trajectories for modeling crowded scenes, in which we propose new and efficient representative trajectories for modeling arbitrarily complicated crowd flows. Second, chaotic dynamics are introduced into the crowd context to characterize complicated crowd motions by regulating a set of chaotic invariant features, which are reliably computed and used for detecting anomalies. Third, a probabilistic framework for anomaly detection and localization is formulated. The overall work-flow begins with particle advection based on optical flow. Then particle trajectories are clustered to obtain representative trajectories for a crowd flow. Next, the chaotic dynamics of all representative trajectories are extracted and quantified using chaotic invariants known as maximal Lyapunov exponent and correlation dimension. Probabilistic model is learned from these chaotic feature set, and finally, a maximum likelihood estimation criterion is adopted to identify a query video of a scene as normal or abnormal. Furthermore, an effective anomaly localization algorithm is designed to locate the position and size of an anomaly. Experiments are conducted on known crowd data set, and results show that our method achieves higher accuracy in anomaly detection and can effectively localize anomalies.", "citation": "Citations (375)", "year": "2010", "departments": ["University of Central Florida", "University of Central Florida", "University of Central Florida"], "conf": "cvpr", "authors": ["Shandong Wu.....http://dblp.org/pers/hd/w/Wu:Shandong", "Brian E. Moore.....http://dblp.org/pers/hd/m/Moore:Brian_E=", "Mubarak Shah.....http://dblp.org/pers/hd/s/Shah:Mubarak"], "pages": 7}