{"title": "Diversity-Rate Trade-off in Erasure Networks.", "fields": ["linear network coding", "forward error correction", "diversity gain", "binary erasure channel", "online codes"], "abstract": "This paper addresses a fundamental trade-off between rate and the diversity gain of an end-to-end connection in an erasure network. The erasure network is modeled by a directed graph whose links are orthogonal erasure channels. Furthermore, the erasure network is assumed to be non-ergodic, meaning that the erasure status of the links are assumed to be fixed during each block of transmission and change independently from block to block. The erasure status of the links is assumed to be known only by the destination node. First, we study the homogeneous erasure networks in which the links have the same erasure probability and capacity. We derive the optimum trade-off between diversity gain and the end-to-end rate and prove that a variant of the conventional routing strategy combined with an appropriate forward error correction at the end-nodes achieves the optimum diversity-rate trade-off. Next, we consider the general erasure networks in which different links may have different values of erasure probability and capacity. We prove that there exist general erasure networks for which any conventional routing strategy fails to achieve the optimum diversity-rate trade-off. However, for any general erasure graph, we show that there exists a linear network coding strategy which achieves the optimum diversity-rate trade-off. Unlike the previous works which suggest the potential benefit of linear network coding in the error-free multicast scenario (in terms of the achievable rate), our result introduces the benefit of linear network coding in the erasure single-source single-destination scenario (in terms of the diversity gain). Finally, we study the diversity-rate trade-off through simulations. The erasure graphs are constructed according to the Barabasi-Albert random model which is known to capture the scale-free property of the practical packet switched networks like the Internet. The error probability is depicted for different network strategies and different rate values. The depicted results confirm the trade-off between the rate and the diversity gain for each network strategy. Moreover, the diversity gain is plotted versus the rate for different conventional routing and the linear network coding strategies. It is observed that linear network coding outperforms all conventional routing strategies in terms of the diversity gain.", "citation": "Citations (4)", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Shahab Oveis Gharan.....http://dblp.org/pers/hd/g/Gharan:Shahab_Oveis", "Shervan Fashandi.....http://dblp.org/pers/hd/f/Fashandi:Shervan", "Amir K. Khandani.....http://dblp.org/pers/hd/k/Khandani:Amir_K="], "conf": "infocom", "year": "2010", "pages": 9}