{"title": "TopBT: A Topology-Aware and Infrastructure-Independent BitTorrent Client.", "fields": ["internet traffic", "bittorrent", "internet hosting service", "application layer", "content delivery network"], "abstract": "BitTorrent (BT) has carried out a significant and continuously increasing portion of Internet traffic. While several designs have been recently proposed and implemented to improve the resource utilization by bridging the application layer (overlay) and the network layer (underlay), these designs are largely dependent on Internet infrastructures, such as ISPs and CDNs. In addition, they also demand large-scale deployments of their systems to work effectively. Consequently, they require multiefforts far beyond individual users' ability to be widely used in the Internet. In this paper, aiming at building an infrastructure-independent user-level facility, we present our design, implementation, and evaluation of a topology-aware BT system, called TopBT, to significantly improve the overall Internet resource utilization without degrading user downloading performance. The unique feature of TopBT client lies in that a TopBT client actively discovers network proximities (to connected peers), and uses both proximities and transmission rates to maintain fast downloading while reducing the transmitting distance of the BT traffic and thus the Internet traffic. As a result, a TopBT client neither requires feeds from major Internet infrastructures, such as ISPs or CDNs, nor requires large-scale deployment of other TopBT clients on the Internet to work effectively. We have implemented TopBT based on widely used open-source BT client code base, and made the software publicly available. By deploying TopBT and other BitTorrent clients on hundreds of Internet hosts, we show that on average TopBT can reduce about 25% download traffic while achieving a 15% faster download speed compared to several prevalent BT clients. TopBT has been widely used in the Internet by many users all over the world.", "citation": "Citations (91)", "departments": ["Microsoft", "Ohio State University", "Ohio State University", "George Mason University", "Yahoo!"], "authors": ["Shansi Ren.....http://dblp.org/pers/hd/r/Ren:Shansi", "Enhua Tan.....http://dblp.org/pers/hd/t/Tan:Enhua", "Tian Luo.....http://dblp.org/pers/hd/l/Luo:Tian", "Songqing Chen.....http://dblp.org/pers/hd/c/Chen:Songqing", "Lei Guo.....http://dblp.org/pers/hd/g/Guo_0004:Lei", "Xiaodong Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiaodong"], "conf": "infocom", "year": "2010", "pages": 9}