{"title": "FAST: fast architecture sensitive tree search on modern CPUs and GPUs.", "fields": ["tree traversal", "fractal tree index", "microarchitecture", "queries per second", "cpu cache"], "abstract": "In-memory tree structured index search is a fundamental database operation. Modern processors provide tremendous computing power by integrating multiple cores, each with wide vector units. There has been much work to exploit modern processor architectures for database primitives like scan, sort, join and aggregation. However, unlike other primitives, tree search presents significant challenges due to irregular and unpredictable data accesses in tree traversal.   In this paper, we present FAST, an extremely fast architecture sensitive layout of the index tree. FAST is a binary tree logically organized to optimize for architecture features like page size, cache line size, and SIMD width of the underlying hardware. FAST eliminates impact of memory latency, and exploits thread-level and datalevel parallelism on both CPUs and GPUs to achieve 50 million (CPU) and 85 million (GPU) queries per second, 5X (CPU) and 1.7X (GPU) faster than the best previously reported performance on the same architectures. FAST supports efficient bulk updates by rebuilding index trees in less than 0.1 seconds for datasets as large as 64Mkeys and naturally integrates compression techniques, overcoming the memory bandwidth bottleneck and achieving a 6X performance improvement over uncompressed index search for large keys on CPUs.", "citation": "Citations (251)", "year": "2010", "departments": ["Intel", "Intel", "Intel", "Oracle Corporation", "Intel"], "conf": "sigmod", "authors": ["Changkyu Kim.....http://dblp.org/pers/hd/k/Kim:Changkyu", "Jatin Chhugani.....http://dblp.org/pers/hd/c/Chhugani:Jatin", "Nadathur Satish.....http://dblp.org/pers/hd/s/Satish:Nadathur", "Eric Sedlar.....http://dblp.org/pers/hd/s/Sedlar:Eric", "Anthony D. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Anthony_D=", "Tim Kaldewey.....http://dblp.org/pers/hd/k/Kaldewey:Tim", "Victor W. Lee.....http://dblp.org/pers/hd/l/Lee:Victor_W=", "Scott A. Brandt.....http://dblp.org/pers/hd/b/Brandt:Scott_A=", "Pradeep Dubey.....http://dblp.org/pers/hd/d/Dubey:Pradeep"], "pages": 12}