{"title": "On the Feasibility and Efficacy of Protection Routing in IP Networks.", "fields": ["policy based routing", "routing domain", "multipath routing", "equal cost multi path routing", "virtual routing and forwarding"], "abstract": "With network components increasingly reliable, routing is playing an ever greater role in determining network reliability. This has spurred much activity in improving routing stability and reaction to failures and rekindled interest in centralized routing solutions, at least within a single routing domain. Centralizing decisions eliminates uncertainty and many inconsistencies and offers added flexibility in computing routes that meet different criteria. However, it also introduces new challenges, especially in reacting to failures where centralization can increase latency. This paper leverages the flexibility afforded by centralized routing to address these challenges. Specifically, we explore when and how standby backup forwarding options can be activated while waiting for an update from the centralized server after the failure of an individual component (link or node). We provide analytical insight into the feasibility of such backups as a function of network structure and quantify their computational complexity. We also develop an efficient heuristic reconciling protectability and performance, and demonstrate its effectiveness in a broad range of scenarios. The results should facilitate deployments of centralized routing solutions.", "citation": "Citations (67)", "departments": ["University of Pennsylvania", "University of Massachusetts Amherst", "University of Pennsylvania", "University of Minnesota", "University of Pennsylvania", "University of Massachusetts Amherst", "University of Pennsylvania", "University of Minnesota"], "authors": ["Kin Wah Kwong.....http://dblp.org/pers/hd/k/Kwong:Kin_Wah", "Lixin Gao.....http://dblp.org/pers/hd/g/Gao:Lixin", "Roch Guérin.....http://dblp.org/pers/hd/g/Gu=eacute=rin:Roch", "Zhi-Li Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhi=Li"], "conf": "infocom", "year": "2010", "pages": 9}