{"title": "Leaping Multiple Headers in a Single Bound: Wire-Speed Parsing Using the Kangaroo System.", "fields": ["packet forwarding", "multiprotocol label switching", "network packet", "parse tree", "tree traversal"], "abstract": "More fundamental than IP lookups and packet classification in routers is the extraction of fields such as IP Dest and TCP Ports that determine packet forwarding. While parsing of packet fields used to be easy, new shim layers (e.g., MPLS, 802.1Q, MAC-in-MAC) of possibly variable length have greatly increased the worst-case path in the parse tree. The problem is exacerbated by the need to accommodate new packet headers and to extract other higher layer fields. Programmable routers for projects such as GENI will need such flexible parsers. In this paper, we describe the design and implementation of the Kangaroo system, a flexible packet parser that can run at 40 Gbps even for worst-case packet headers. Because conventional solutions that traverse the parse tree one protocol at a time are too slow, Kangaroo uses lookahead to parse several protocol headers in one step using a new architecture in which a CAM directs the next set of bytes to be extracted. The challenge is to keep the number of CAM entries from growing exponentially with the amount of lookahead. We deal with this challenge using a non-uniform traversal of the parse tree, and an offline dynamic programming algorithm that calculates the optimal walk. Our experiments on a NetFPGA prototype show a speedup of 2 compared to an architecture with a lookahead of 1. The architecture can be implemented as a parsing block in a standard 400 MHz ASIC at 40 Gbps using less than 1% of chip area.", "citation": "Citations (21)", "departments": ["University of California, San Diego", "Cisco Systems, Inc.", "Cisco Systems, Inc.", "University of California, San Diego"], "authors": ["Christos Kozanitis.....http://dblp.org/pers/hd/k/Kozanitis:Christos", "John Huber.....http://dblp.org/pers/hd/h/Huber:John", "Sushil Singh.....http://dblp.org/pers/hd/s/Singh:Sushil", "George Varghese.....http://dblp.org/pers/hd/v/Varghese:George"], "conf": "infocom", "year": "2010", "pages": 9}