{"title": "Continuous analytics over discontinuous streams.", "fields": ["stream processing", "analytics", "failover", "data stream mining", "low latency"], "abstract": "Continuous analytics systems that enable query processing over steams of data have emerged as key solutions for dealing with massive data volumes and demands for low latency. These systems have been heavily influenced by an assumption that data streams can be viewed as sequences of data that arrived more or less in order. The reality, however, is that streams are not often so well behaved and disruptions of various sorts are endemic. We argue, therefore, that stream processing needs a fundamental rethink and advocate a unified approach toward continuous analytics over discontinuous streaming data. Our approach is based on a simple insight - using techniques inspired by data parallel query processing, queries can be performed over independent  sub-streams  with arbitrary time ranges in parallel, generating partial results. The consolidation of the partial results over each sub-stream can then be deferred to the time at which the results are actually used on an on-demand basis. In this paper, we describe how the Truviso Continuous Analytics system implements this type of  order-independent  processing. Not only does the approach provide the first real solution to the problem of processing streaming data that arrives arbitrarily late, it also serves as a critical building block for solutions to a host of hard problems such as parallelism, recovery, transactional consistency, high availability, failover, and replication.", "citation": "Citations (93)", "year": "2010", "departments": ["Truviso, Inc.,  ... r City, CA, USA", "Truviso, Inc.,  ... r City, CA, USA", "Truviso, Inc.,  ... r City, CA, USA", "Truviso, Inc.,  ... r City, CA, USA", "Truviso, Inc.,  ... r City, CA, USA"], "conf": "sigmod", "authors": ["Sailesh Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Sailesh", "Michael J. Franklin.....http://dblp.org/pers/hd/f/Franklin:Michael_J=", "Jeffrey Davis.....http://dblp.org/pers/hd/d/Davis:Jeffrey", "Daniel Farina.....http://dblp.org/pers/hd/f/Farina:Daniel", "Pasha Golovko.....http://dblp.org/pers/hd/g/Golovko:Pasha", "Alan Li.....http://dblp.org/pers/hd/l/Li:Alan", "Neil Thombre.....http://dblp.org/pers/hd/t/Thombre:Neil"], "pages": 12}