{"title": "Discriminative codeword selection for image representation.", "fields": ["data matrix", "codebook", "k means clustering", "discriminative model", "image retrieval"], "abstract": "Bag of features (BoF) representation has attracted an increasing amount of attention in large scale image processing systems. BoF representation treats images as loose collections of local invariant descriptors extracted from them. The visual codebook is generally constructed by using an unsupervised algorithm such as K-means to quantize the local descriptors into clusters. Images are then represented by the frequency histograms of the codewords contained in them. To build a compact and discriminative codebook, codeword selection has become an indispensable tool. However, most of the existing codeword selection algorithms are supervised and the human labeling may be very expensive. In this paper, we consider the problem of unsupervised codeword selection, and propose a novel algorithm called Discriminative Codeword Selection (DCS). Motivated from recent studies on discriminative clustering, the central idea of our proposed algorithm is to select those codewords so that the cluster structure of the image database can be best respected. Specifically, a multi-output linear function is fitted to model the relationship between the data matrix after codeword selection and the indicator matrix. The most discriminative codewords are thus defined as those leading to minimal fitting error. Experiments on image retrieval and clustering have demonstrated the effectiveness of the proposed method.", "citation": "Citations (16)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University"], "authors": ["Lijun Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Lijun", "Chun Chen.....http://dblp.org/pers/hd/c/Chen:Chun", "Jiajun Bu.....http://dblp.org/pers/hd/b/Bu:Jiajun", "Zhengguang Chen.....http://dblp.org/pers/hd/c/Chen:Zhengguang", "Shulong Tan.....http://dblp.org/pers/hd/t/Tan:Shulong", "Xiaofei He.....http://dblp.org/pers/hd/h/He:Xiaofei"], "conf": "mm", "year": "2010", "pages": 10}