{"title": "Efficient querying and maintenance of network provenance at internet-scale.", "fields": ["network management station", "network architecture", "query language", "network simulation", "network management"], "abstract": "Network accountability, forensic analysis, and failure diagnosis are becoming increasingly important for network management and security. Such capabilities often utilize  network provenance  - the ability to issue queries over network meta-data. For example, network provenance may be used to trace the path a message traverses on the network as well as to determine how message data were derived and which parties were involved in its derivation.   This paper presents the design and implementation of ExSPAN, a  generic and extensible  framework that achieves efficient network provenance in a distributed environment. We utilize the database notion of  data provenance  to \"explain\" the existence of  any  network state, providing a versatile mechanism for network provenance. To achieve such flexibility at Internet-scale, ExSPAN uses declarative networking in which network protocols can be modeled as continuous queries over distributed streams and specified concisely in a declarative query language. We extend existing data models for provenance developed in database literature to enable distribution at Internet-scale, and investigate numerous optimization techniques to maintain and query distributed network provenance efficiently. The ExSPAN prototype is developed using RapidNet, a declarative networking platform based on the emerging ns-3 toolkit. Experiments over a simulated network and an actual deployment in a testbed environment demonstrate that our system supports a wide range of distributed provenance computations efficiently, resulting in significant reductions in bandwidth costs compared to traditional approaches.", "citation": "Citations (139)", "year": "2010", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania"], "conf": "sigmod", "authors": ["Wenchao Zhou.....http://dblp.org/pers/hd/z/Zhou:Wenchao", "Micah Sherr.....http://dblp.org/pers/hd/s/Sherr:Micah", "Tao Tao.....http://dblp.org/pers/hd/t/Tao:Tao", "Xiaozhou Li.....http://dblp.org/pers/hd/l/Li:Xiaozhou", "Boon Thau Loo.....http://dblp.org/pers/hd/l/Loo:Boon_Thau", "Yun Mao.....http://dblp.org/pers/hd/m/Mao:Yun"], "pages": 12}