{"title": "A novel virtual world based HCI paradigm for multimedia scholarly communication.", "fields": ["verifiable secret sharing", "scientific communication", "scholarly communication", "e science", "metaverse"], "abstract": "The sharing of academic knowledge through printed publications has been widely and successfully utilized for more than a hundred years. However, the need to process huge amounts of data in scientific analysis and communicate its results to the scientific community has presented a big challenge for researchers in the data-intensive era. In addition to providing accurate and flexible graphical representations of data, the entire research process should ideally be made verifiable by peers. While web-based tools have been proposed to address this problem, most of them lack important features for scientific work such as real-time collaboration, powerful multimedia visualization and interaction, and environment persistency. Therefore, in this paper, we will propose the use of virtual world technology to address these issues. In particular, we will give an overview of the different methods that we have implemented in the context of multimedia interaction, which is considered the most critical factor in the development of virtual worlds as sound platforms for human-centered multimedia systems.", "citation": "Not cited", "departments": ["National Institute of Informatics", "National Institute of Informatics", "National Institute of Informatics", "National Institute of Informatics", "National Institute of Informatics"], "authors": ["Arturo Nakasone.....http://dblp.org/pers/hd/n/Nakasone:Arturo", "Tiago da Silva.....http://dblp.org/pers/hd/s/Silva:Tiago_da", "Andreas Budde.....http://dblp.org/pers/hd/b/Budde:Andreas", "Kugamoorthy Gajananan.....http://dblp.org/pers/hd/g/Gajananan:Kugamoorthy", "Tri T. Truong.....http://dblp.org/pers/hd/t/Truong:Tri_T=", "Helmut Prendinger.....http://dblp.org/pers/hd/p/Prendinger:Helmut"], "conf": "mm", "year": "2010", "pages": 4}