{"title": "Minimum Energy per Bit for Wideband Wireless Multicasting: Performance of Decode-and-Forward.", "fields": ["wideband", "additive white gaussian noise", "fading", "channel", "path loss"], "abstract": "We study the minimum energy per bit required for communicating a message to all the destination nodes in a wireless network. The physical layer is modeled as an additive white Gaussian noise channel affected by circularly symmetric fading. The fading coefficients are known at neither transmitters nor receivers. We provide an information-theoretic lower bound on the energy requirement of multicasting in arbitrary wireless networks as the solution of a linear program. We study the broadcast performance of decode-and-forward operating in the non-coherent wideband scenario, and compare it with the lower bounds. For arbitrary networks with k nodes, the energy requirement of decode-and-forward is within a factor of (k-1) of the lower bound regardless of the magnitude of channel gains. We also show that decode-and-forward achieves the minimum energy per bit in networks that can be represented as directed acyclic graphs, thus establishing the exact minimum energy per bit for this class of networks. We also study regular networks where the area is divided into cells, each cell containing at least k_{\\min} and at most k_{\\max} nodes placed arbitrarily within the cell. A path loss model (with path loss exponent α>2) dictates the channel gains between the nodes. It is shown that the ratio between the upper bound using decode-and-forward based flooding, and the lower bound is at most a constant times (k_{\\max})^(α+2)/(k_{\\min}).", "citation": "Citations (7)", "departments": ["Princeton University", "Princeton University", "Princeton University"], "authors": ["Aman Jain.....http://dblp.org/pers/hd/j/Jain:Aman", "Sanjeev R. Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni:Sanjeev_R=", "Sergio Verdú.....http://dblp.org/pers/hd/v/Verd=uacute=:Sergio"], "conf": "infocom", "year": "2010", "pages": 9}