{"title": "Non-homogeneous generalization in privacy preserving data publishing.", "fields": ["data publishing", "homogeneous", "anonymity", "uniformization", "tuple"], "abstract": "Most previous research on privacy-preserving data publishing, based on the  k -anonymity model, has followed the simplistic approach of homogeneously giving the same generalized value in all quasi-identifiers within a partition. We observe that the anonymization error can be reduced if we follow a non-homogeneous generalization approach for groups of size larger than  k . Such an approach would allow tuples within a partition to take different generalized quasi-identifier values. Anonymization following this model is not trivial, as its direct application can easily violate  k -anonymity. In addition, non-homogeneous generalization allows for additional types of attack, which should be considered in the process. We provide a methodology for verifying whether a non-homogeneous generalization violates  k -anonymity. Then, we propose a technique that generates a non-homogeneous generalization for a partition and show that its result satisfies  k -anonymity, however by straightforwardly applying it, privacy can be compromised if the attacker knows the anonymization algorithm. Based on this, we propose a randomization method that prevents this type of attack and show that  k -anonymity is not compromised by it. Nonhomogeneous generalization can be used on top of any existing partitioning approach to improve its utility. In addition, we show that a new partitioning technique tailored for non-homogeneous generalization can further improve quality. A thorough experimental evaluation demonstrates that our methodology greatly improves the utility of anonymized data in practice.", "citation": "Citations (69)", "year": "2010", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong"], "conf": "sigmod", "authors": ["Wai Kit Wong.....http://dblp.org/pers/hd/w/Wong:Wai_Kit", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos", "David Wai-Lok Cheung.....http://dblp.org/pers/hd/c/Cheung:David_Wai=Lok"], "pages": 12}