{"title": "A generic framework for event detection in various video domains.", "fields": ["data point", "scripting language", "semi supervised learning", "distributive property", "video tracking"], "abstract": "Event detection is essential for the extensively studied video analysis and understanding area. Although various approaches have been proposed for event detection, there is a lack of a generic event detection framework that can be applied to various video domains (e.g. sports, news, movies, surveillance). In this paper, we present a generic event detection approach based on semi-supervised learning and Internet vision. Concretely, a Graph-based Semi-Supervised Multiple Instance Learning (GSSMIL) algorithm is proposed to jointly explore small-scale expert labeled videos and large-scale unlabeled videos to train the event models to detect video event boundaries. The expert labeled videos are obtained from the analysis and alignment of well-structured video related text (e.g. movie scripts, web-casting text, close caption). The unlabeled data are obtained by querying related events from the video search engine (e.g. YouTube) in order to give more distributive information for event modeling. A critical issue of GSSMIL in constructing a graph is the weight assignment, where the weight of an edge specifies the similarity between two data points. To tackle this problem, we propose a novel Multiple Instance Learning Induced Similarity (MILIS) measure by learning instance sensitive classifiers. We perform the thorough experiments in three popular video domains: movies, sports and news. The results compared with the state-of-the-arts are promising and demonstrate our proposed approach is performance-effective.", "citation": "Citations (22)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "National University of Singapore", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Tianzhu Zhang.....http://dblp.org/pers/hd/z/Zhang:Tianzhu", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng", "Guangyu Zhu.....http://dblp.org/pers/hd/z/Zhu:Guangyu", "Si Liu.....http://dblp.org/pers/hd/l/Liu_0001:Si", "Hanqing Lu.....http://dblp.org/pers/hd/l/Lu:Hanqing"], "conf": "mm", "year": "2010", "pages": 10}