{"title": "Towards semantic embedding in visual vocabulary.", "fields": ["visual word", "visual search", "wordnet", "bag of words model in computer vision", "hidden markov random field"], "abstract": "Visual vocabulary serves as a fundamental component in many computer vision tasks, such as object recognition, visual search, and scene modeling. While state-of-the-art approaches build visual vocabulary based solely on visual statistics of local image patches, the correlative image labels are left unexploited in generating visual words. In this work, we present a semantic embedding framework to integrate semantic information from Flickr labels for supervised vocabulary construction. Our main contribution is a Hidden Markov Random Field modeling to supervise feature space quantization, with specialized considerations to label correlations: Local visual features are modeled as an Observed Field, which follows visual metrics to partition feature space. Semantic labels are modeled as a Hidden Field, which imposes generative supervision to the Observed Field with WordNet-based correlation constraints as Gibbs distribution. By simplifying the Markov property in the Hidden Field, both unsupervised and supervised (label independent) vocabularies can be derived from our framework. We validate our performances in two challenging computer vision tasks with comparisons to state-of-the-arts: (1) Large-scale image search on a Flickr 60,000 database; (2) Object recognition on the PASCAL VOC database.", "citation": "Citations (35)", "year": "2010", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology"], "conf": "cvpr", "authors": ["Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Xiaoshuai Sun.....http://dblp.org/pers/hd/s/Sun:Xiaoshuai", "Bineng Zhong.....http://dblp.org/pers/hd/z/Zhong:Bineng", "Wen Gao.....http://dblp.org/pers/hd/g/Gao_0001:Wen"], "pages": 8}