{"title": "Developing next generation ADLs through MDE techniques.", "fields": ["software design description", "resource oriented architecture", "architecture description language", "software architecture description", "functional software architecture"], "abstract": "Despite the flourishing of languages to describe software architectures, existing Architecture Description Languages (ADLs) are still far away from what it is actually needed. In fact, while they support a traditional perception of a Software Architecture (SA) as a set of constituting elements (such as components, connectors and interfaces), they mostly fail to capture multiple stakeholders concerns and their design decisions that represent a broader view of SA being accepted today. Next generation ADLs must cope with various and ever evolving stakeholder concerns by employing  semantic extension mechanisms .   In this paper we present a framework, called byADL - Build Your ADL, for developing a new generation of ADLs. byADL exploits model-driven techniques that provide the needed technologies to allow a software architect, starting from existing ADLs, to define its own new generation ADL by: i) adding domain specificities, new architectural views, or analysis aspects, ii) integrating ADLs with development processes and methodologies, and iii) customizing ADLs by fine tuning them. The framework is put in practice in different scenarios showing the incremental extension and customization of the Darwin ADL.", "citation": "Citations (31)", "departments": ["Università dell ... L'Aquila, Italy", "Università dell ... L'Aquila, Italy", "Università dell ... L'Aquila, Italy", "Università dell ... L'Aquila, Italy", "Università dell ... L'Aquila, Italy"], "authors": ["Davide Di Ruscio.....http://dblp.org/pers/hd/r/Ruscio:Davide_Di", "Ivano Malavolta.....http://dblp.org/pers/hd/m/Malavolta:Ivano", "Henry Muccini.....http://dblp.org/pers/hd/m/Muccini:Henry", "Patrizio Pelliccione.....http://dblp.org/pers/hd/p/Pelliccione:Patrizio", "Alfonso Pierantonio.....http://dblp.org/pers/hd/p/Pierantonio:Alfonso"], "conf": "icse", "year": "2010", "pages": 10}