{"title": "Axial light field for curved mirrors: Reflect your perspective, widen your view.", "fields": ["curved mirror", "light field", "aliasing", "catadioptric system", "caustic"], "abstract": "Mirrors have been used to enable wide field-of-view (FOV) catadioptric imaging. The mapping between the incoming and reflected light rays depends non-linearly on the mirror shape and has been well-studied using caustics. We analyze this mapping using two-plane light field parameterization, which provides valuable insight into the geometric structure of reflected rays. Using this analysis, we study the problem of generating a single-viewpoint virtual perspective image for catadioptric systems, which is unachievable for several common configurations. Instead of minimizing distortions appearing in a single image, we propose to capture all the rays required to generate a virtual perspective by capturing a light field. We consider rotationally symmetric mirrors and show that a traditional planar light field results in significant aliasing artifacts. We propose axial light field, captured by moving the camera along the mirror rotation axis, for efficient sampling and to remove aliasing artifacts. This allows us to computationally generate wide FOV virtual perspectives using a wider class of mirrors than before, without using scene priors or depth estimation. We analyze the relationship between the axial light field parameters and the FOV/resolution of the resulting virtual perspective. Real results using a spherical mirror demonstrate generating 140° FOV virtual perspective using multiple 30° FOV images.", "citation": "Citations (14)", "year": "2010", "departments": ["Mitsubishi Electric Research Laboratories", "Mitsubishi Electric Research Laboratories", "Mitsubishi Electric Research Laboratories", "Mitsubishi Electric Research Laboratories"], "conf": "cvpr", "authors": ["Yuichi Taguchi.....http://dblp.org/pers/hd/t/Taguchi:Yuichi", "Amit K. Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Amit_K=", "Srikumar Ramalingam.....http://dblp.org/pers/hd/r/Ramalingam:Srikumar", "Ashok Veeraraghavan.....http://dblp.org/pers/hd/v/Veeraraghavan:Ashok"], "pages": 8}