{"title": "Inferring and mitigating a link's hindering transmissions in managed 802.11 wireless networks.", "fields": ["node", "throughput", "inference", "testbed", "limiting"], "abstract": "In 802.11 managed wireless networks, the manager can address under-served links by rate-limiting the conflicting nodes. In order to determine to what extent each conflicting node is responsible for the poor performance, the manager needs to understand the coordination among conflicting nodes' transmissions. In this paper, we present a management framework called MIDAS (Management, Inference, and Diagnostics using Activity Share). We introduce the concept of Activity Share which characterizes the coordination among any set of network nodes in terms of the time they spend transmitting simultaneously. Unfortunately, the Activity Share cannot be locally measured by the nodes. Thus, MIDAS comprises an inference tool which, based on a combined physical, protocol, and statistical approach, infers the Activity Share by using a small set of passively collected, time-aggregate local channel measurements reported by the nodes. MIDAS uses the estimated Activity Share as the input of a simple model that predicts how limiting the transmission rate of any conflicting node would benefit the throughput of the under-served link. The model is based on the current network conditions, thus representing the first throughput model using online measurements. We implemented our tool on real hardware and deployed it on an indoor testbed. Our extensive validation combines testbed experiments and simulations. The results show that MIDAS infers the Activity Share with an average normalized relative error below 12% in all testbed experiments.", "citation": "Citations (16)", "departments": ["Rice University", "Ben-Gurion University of the Negev", "Rice University"], "authors": ["Eugenio Magistretti.....http://dblp.org/pers/hd/m/Magistretti:Eugenio", "Omer Gurewitz.....http://dblp.org/pers/hd/g/Gurewitz:Omer", "Edward W. Knightly.....http://dblp.org/pers/hd/k/Knightly:Edward_W="], "conf": "mobicom", "year": "2010", "pages": 12}