{"title": "Partial replay of long-running applications.", "fields": ["instrumentation", "symbolic execution", "snapshot", "symbolic data analysis", "overhead"], "abstract": "Bugs in deployed software can be extremely difficult to track down. Invasive logging techniques, such as logging all non-deterministic inputs, can incur substantial runtime overheads. This paper shows how symbolic analysis can be used to re-create path equivalent executions for very long running programs such as databases and web servers. The goal is to help developers debug such long-running programs by allowing them to walk through an execution of the last few requests or transactions leading up to an error. The challenge is to provide this functionality without the high runtime overheads associated with traditional replay techniques based on input logging or memory snapshots. Our approach achieves this by recording a small amount of information about program execution, such as the direction of branches taken, and then using symbolic analysis to reconstruct the execution of the last few inputs processed by the application, as well as the state of memory before these inputs were executed.   We implemented our technique in a new tool called bbr. In this paper, we show that it can be used to replay bugs in long-running single-threaded programs starting from the middle of an execution. We show that bbr incurs low recording overhead (avg. of 10%) during program execution, which is much less than existing replay schemes. We also show that it can reproduce real bugs from web servers, database systems, and other common utilities.", "citation": "Citations (14)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Alvin Cheung.....http://dblp.org/pers/hd/c/Cheung:Alvin", "Armando Solar-Lezama.....http://dblp.org/pers/hd/s/Solar=Lezama:Armando", "Samuel Madden.....http://dblp.org/pers/hd/m/Madden:Samuel"], "conf": "sigsoft", "year": "2011", "pages": 11}