{"title": "Integrating code search into the development session.", "fields": ["code word", "kpi driven code analysis", "redundant code", "code review", "legacy code"], "abstract": "To support rapid and efficient software development, we propose to demonstrate our tool, integrating code search into software development process. For example, a developer, right during writing a module, can find a code piece sharing the same syntactic structure from a large code corpus representing the wisdom of other developers in the same team (or in the universe of open-source code). While there exist commercial code search engines on the code universe, they treat software as text (thus oblivious of syntactic structure), and fail at finding semantically related code. Meanwhile, existing tools, searching for syntactic clones, do not focus on efficiency, focusing on “post-mortem” usage scenario of detecting clones “after” the code development is completed. In clear contrast, we focus on optimizing efficiency for syntactic code search and making this search “interactive” for large-scale corpus, to complement the existing two lines of research. From our demonstration, we will show how such interactive search supports rapid software development, as similarly claimed lately in SE and HCI communities [1], [2]. As an enabling technology, we design efficient index building and traversal techniques, optimized for code corpus and code search workload. Our tool can identify relevant code in the corpus of 1.7 million code pieces in a sub-second response time, without compromising any accuracy obtained by a state-of-the-art tool, as we report our extensive evaluation results in [3].", "citation": "Citations (9)", "departments": ["Pohang University of Science and Technology", "Pohang University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Mu-Woong Lee.....http://dblp.org/pers/hd/l/Lee:Mu=Woong", "Seung-won Hwang.....http://dblp.org/pers/hd/h/Hwang:Seung=won", "Sunghun Kim.....http://dblp.org/pers/hd/k/Kim_0001:Sunghun"], "conf": "icde", "year": "2011", "pages": 4}