{"title": "Timely data delivery in a realistic bus network.", "fields": ["network packet", "bus network", "time horizon", "graph", "vehicle routing problem", "local bus", "tree traversal"], "abstract": "WiFi-enabled buses and stops may form the backbone of a metropolitan delay-tolerant network, which exploits nearby communications, temporary storage at stops, and predictable bus mobility to deliver non-real-time information. This paper studies the routing problem in such a network. Assuming that the bus schedule is known, we maximize the delivery probability by a given deadline for each packet. Our approach takes the randomness into account, which stems from road traffic conditions, passengers boarding and alighting, and other factors that affect bus mobility. In this sense, this paper is one of the first to tackle quasi-deterministic mobility scenarios. We propose a simple stochastic model for bus arrivals at stops, supported by a study of real-life traces collected in a large urban network. A succinct graph representation of this model allows us to devise an optimal (under our model) single-copy routing algorithm and then extend it to cases where several copies of the same data are permitted. Through an extensive simulation study, we compare the optimal routing algorithm with three other approaches: 1) minimizing the expected traversal time over our graph; 2) maximizing the delivery probability over an infinite time-horizon; and 3) a recently proposed heuristic based on bus frequencies. We show that our optimal algorithm shows the best performance, but it essentially reduces to minimizing the expected traversal time. When transmissions frequently fail (more than half of the times), the algorithm behaves similarly to a heuristic that maximizes the delivery probability over an infinite time horizon. For reliable transmissions and values of deadlines close to the expected delivery time, the multicopy extension requires only ten copies to almost reach the performance of the costly flooding approach.", "citation": "Citations (65)", "departments": ["Bell Labs", "Hebrew University of Jerusalem", "French Institute for Research in Computer Science and Automation", "An-Najah National University", "Bell Labs", "Polytechnic University of Turin", "Hebrew University of Jerusalem", "French Institute for Research in Computer Science and Automation", "Polytechnic University of Turin", "Dipt. di Elettr ... o, Turin, Italy"], "authors": ["Utku Günay Acer.....http://dblp.org/pers/hd/a/Acer:Utku_G=uuml=nay", "Paolo Giaccone.....http://dblp.org/pers/hd/g/Giaccone:Paolo", "David Hay.....http://dblp.org/pers/hd/h/Hay:David", "Giovanni Neglia.....http://dblp.org/pers/hd/n/Neglia:Giovanni", "Saed Tarapiah.....http://dblp.org/pers/hd/t/Tarapiah:Saed"], "conf": "infocom", "year": "2011", "pages": 5}