{"title": "Blind navigation with a wearable range camera and vibrotactile helmet.", "fields": ["collision", "visual impairment", "background subtraction", "gesture", "gesture recognition"], "abstract": "We present a way finding system that uses a range camera and an array of vibrotactile elements which we built into a helmet.   The range camera is a Kinect 3D sensor from Microsoft that is meant to be kept stationary, and used to watch the user (i.e., to detect the person's gestures). Rather than using the camera to look at the user, we reverse the situation, by putting the Kinect range camera on a helmet for being worn by the user. In our case, the Kinect is in motion rather than stationary.   Whereas stationary cameras have previously been used for gesture recognition, which the Kinect does very well, in our new modality, we take advantage of the Kinect's resilience against rapidly changing background scenery, where the background in our case is now in motion (i.e., a conventional wearable camera would be presented with a constantly changing background that is difficult to manage by mere background subtraction).   The goal of our project is collision avoidance for blind or visually impaired individuals, and for workers in harsh environments such as industrial environments with significant 3-dimensional obstacles, as well as for use in low-light environments.", "citation": "Citations (74)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Steve Mann.....http://dblp.org/pers/hd/m/Mann:Steve", "Jason Huang.....http://dblp.org/pers/hd/h/Huang:Jason", "Ryan E. Janzen.....http://dblp.org/pers/hd/j/Janzen:Ryan_E=", "Raymond Chun Hing Lo.....http://dblp.org/pers/hd/l/Lo:Raymond_Chun_Hing", "Valmiki Rampersad.....http://dblp.org/pers/hd/r/Rampersad:Valmiki", "Alexander Chen.....http://dblp.org/pers/hd/c/Chen:Alexander", "Taqveer Doha.....http://dblp.org/pers/hd/d/Doha:Taqveer"], "conf": "mm", "year": "2011", "pages": 4}