{"title": "QoF: Towards comprehensive path quality measurement in wireless sensor networks.", "fields": ["collection tree protocol", "network packet", "key distribution in wireless sensor networks", "packet forwarding", "sensor node", "packet loss"], "abstract": "Due to its large scale and constrained communication radius, a wireless sensor network mostly relies on multi-hop transmissions to deliver a data packet along a sequence of nodes. It is of essential importance to measure the forwarding quality of multi-hop paths and such information shall be utilized in designing efficient routing strategies. Existing metrics like ETX, ETF mainly focus on quantifying the link performance in between the nodes while overlooking the forwarding capabilities inside the sensor nodes. The experience on manipulating GreenOrbs, a large-scale sensor network with 330 nodes, reveals that the quality of forwarding inside each sensor node is at the least an equally important factor that contributes to the path quality in data delivery. In this paper we propose QoF, Quality of Forwarding, a new metric which explores the performance in the gray zone inside a node left unattended in previous studies. By combining the QoF measurements within a node and over a link, we are able to comprehensively measure the intact path quality in designing efficient multi-hop routing protocols. We implement QoF and build a modified Collection Tree Protocol (CTP). We evaluate the data collection performance in a testbed consisting of 50 TelosB nodes, and compare it with the original CTP protocol. The experimental results show that our approach takes both transmission cost and forwarding reliability into consideration, thus achieving a high throughput for data collection.", "citation": "Citations (15)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Zhejiang University", "Nanyang Technological University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Nanyang Technological University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Jiliang Wang.....http://dblp.org/pers/hd/w/Wang:Jiliang", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Mo Li.....http://dblp.org/pers/hd/l/Li:Mo", "Wei Dong.....http://dblp.org/pers/hd/d/Dong_0001:Wei", "Yuan He.....http://dblp.org/pers/hd/h/He_0004:Yuan"], "conf": "infocom", "year": "2011", "pages": 9}