{"title": "User subscription dynamics and revenue maximization in communications markets.", "fields": ["duopoly", "revenue", "maximization", "non cooperative game", "monopoly"], "abstract": "In order to understand the complex interactions between different technologies in a communications market, it is of fundamental importance to understand how technologies affect the demand of users and competition between network service providers (NSPs). To this end, we analyze user subscription dynamics and revenue maximization in monopoly and duopoly communications markets. First, by considering a monopoly market with only one NSP, we investigate the impact of technologies on the users' dynamic subscription. It is shown that, for any price charged by the NSP, there exists a unique equilibrium point of the considered user subscription dynamics. We also provide a sufficient condition under which the user subscription dynamics converges to the equilibrium point starting from any initial point. We then derive upper and lower bounds on the optimal price and market share that maximize the NSP's revenue. Next, we turn to the analysis of a duopoly market and show that, for any charged prices, the equilibrium point of the considered user subscription dynamics exists and is unique. As in a monopoly market, we derive a sufficient condition on the technologies of the NSPs that ensures the user subscription dynamics to reach the equilibrium point. Then, we model the NSP competition using a non-cooperative game, in which the two NSPs choose their market shares independently, and provide a sufficient condition that guarantees the existence of at least one pure Nash equilibrium in the market competition game.", "citation": "Citations (19)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Shaolei Ren.....http://dblp.org/pers/hd/r/Ren:Shaolei", "Jaeok Park.....http://dblp.org/pers/hd/p/Park:Jaeok", "Mihaela van der Schaar.....http://dblp.org/pers/hd/s/Schaar:Mihaela_van_der"], "conf": "infocom", "year": "2011", "pages": 9}