{"title": "Handling network uncertainty in heterogeneous wireless networks.", "fields": ["heuristic", "throughput", "fuzzy logic", "topsis"], "abstract": "With the constant evolution of wireless communication access technologies, there is a clear trend for mobile clients (MC) to be equipped with multiple interfaces for simultaneous access to different types of networks. This has been denominated a heterogeneous wireless networks. However, in order to achieve a desired quality of service while satisfying the user's requirements, MCs must take advantage of the inherent characteristics of these access technologies, and rely on adaptable decision making mechanism for data forwarding. Unfortunately, route selection satisfying multiple constraints has proven to be NP-Complete, and although various heuristic algorithms have been proposed, they assume that the network state information is static and both the user's and networks constraints are clearly specified. This paper focuses on the imprecise and dynamic nature of the network conditions while satisfying multiple - often contradicting - constraints. A fuzzy logic model is proposed which aims at translating the uncertainty factor of the network conditions to accurate values using the fuzzy logic tools and techniques. We then perform a thorough analysis of the metric values offered by various wireless technologies, and derive crisp values for the imprecise network parameters. A sensitivity analysis reflecting the performance of, and relative importance of metrics on each network is carried out. These results are shown to impact user's decision in handing over data to the appropriate interface.", "citation": "Citations (19)", "departments": ["University of Cincinnati", "University of Cincinnati", "University of Cincinnati"], "authors": ["Talmai Oliveira.....http://dblp.org/pers/hd/o/Oliveira:Talmai", "Srisudha Mahadevan.....http://dblp.org/pers/hd/m/Mahadevan:Srisudha", "Dharma P. Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Dharma_P="], "conf": "infocom", "year": "2011", "pages": 9}