{"title": "Peering through the iframe.", "fields": ["malware", "component based software engineering", "peering", "exploit", "software security assurance"], "abstract": "Drive-by-download attacks have become the method of choice for cyber-criminals to infect machines with malware. Previous research has focused on developing techniques to detect web sites involved in drive-by-download attacks, and on measuring their prevalence by crawling large portions of the Internet. In this paper, we take a different approach at analyzing and understanding drive-by-download attacks. Instead of horizontally searching the Internet for malicious pages, we examine in depth one drive-by-download campaign, that is, the coordinated efforts used to spread malware. In particular, we focus on the Mebroot campaign, which we periodically monitored and infiltrated over several months, by hijacking parts of its infrastructure and obtaining network traces at an exploit server. By studying the Mebroot drive-by-download campaign from the inside, we could obtain an in-depth and comprehensive view into the entire life-cycle of this campaign and the involved parties. More precisely, we could study the security posture of the victims of drive-by attacks (e.g., by measuring the prevalence of vulnerable software components and the effectiveness of software updating mechanisms), the characteristics of legitimate web sites infected during the campaign (e.g., the infection duration), and the modus operandi of the miscreants controlling the campaign.", "citation": "Citations (15)", "departments": ["University of California, Santa Barbara", "University of Birmingham", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Brett Stone-Gross.....http://dblp.org/pers/hd/s/Stone=Gross:Brett", "Marco Cova.....http://dblp.org/pers/hd/c/Cova:Marco", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "conf": "infocom", "year": "2011", "pages": 5}