{"title": "Improving datacenter performance and robustness with multipath TCP.", "fields": ["h tcp", "multipath propagation", "rout", "robustness", "tcp acceleration", "data center", "throughput", "multipath tcp", "zeta tcp"], "abstract": "The latest large-scale data centers offer higher aggregate bandwidth and robustness by creating multiple paths in the core of the net- work. To utilize this bandwidth requires different flows take different paths, which poses a challenge. In short, a single-path transport seems ill-suited to such networks.   We propose using Multipath TCP as a replacement for TCP in such data centers, as it can effectively and seamlessly use available bandwidth, giving improved throughput and better fairness on many topologies. We investigate what causes these benefits, teasing apart the contribution of each of the mechanisms used by MPTCP.   Using MPTCP lets us rethink data center networks, with a different mindset as to the relationship between transport protocols, rout- ing and topology. MPTCP enables topologies that single path TCP cannot utilize. As a proof-of-concept, we present a dual-homed variant of the FatTree topology. With MPTCP, this outperforms FatTree for a wide range of workloads, but costs the same.   In existing data centers, MPTCP is readily deployable leveraging widely deployed technologies such as ECMP. We have run MPTCP on Amazon EC2 and found that it outperforms TCP by a factor of three when there is path diversity. But the biggest benefits will come when data centers are designed for multipath transports.", "citation": "Not cited", "departments": ["Politehnica University of Bucharest", "Université catholique de Louvain", "University College London", "University College London", "University College London"], "authors": ["Costin Raiciu.....http://dblp.org/pers/hd/r/Raiciu:Costin", "Sébastien Barré.....http://dblp.org/pers/hd/b/Barr=eacute=:S=eacute=bastien", "Christopher Pluntke.....http://dblp.org/pers/hd/p/Pluntke:Christopher", "Adam Greenhalgh.....http://dblp.org/pers/hd/g/Greenhalgh:Adam", "Damon Wischik.....http://dblp.org/pers/hd/w/Wischik:Damon", "Mark Handley.....http://dblp.org/pers/hd/h/Handley:Mark"], "conf": "sigcomm", "year": "2011", "pages": 12}