{"title": "Real-time human pose recognition in parts from single depth images.", "fields": ["contextual image classification", "frame rate", "intermediate language", "articulated body pose estimation", "pose", "3d pose estimation", "invariant"], "abstract": "We propose a new method to quickly and accurately predict human  pose ---the 3D positions of body joints---from a single depth image, without depending on information from preceding frames. Our approach is strongly rooted in current object recognition strategies. By designing an intermediate representation in terms of body parts, the difficult pose estimation problem is transformed into a simpler per-pixel classification problem, for which efficient machine learning techniques exist. By using computer graphics to synthesize a very large dataset of training image pairs, one can train a classifier that estimates body part labels from test images invariant to pose, body shape, clothing, and other irrelevances. Finally, we generate confidence-scored 3D proposals of several body joints by reprojecting the classification result and finding local modes.   The system runs in under 5ms on the Xbox 360. Our evaluation shows high accuracy on both synthetic and real test sets, and investigates the effect of several training parameters. We achieve state-of-the-art accuracy in our comparison with related work and demonstrate improved generalization over exact whole-skeleton nearest neighbor matching.", "citation": "Citations (3,689)", "year": "2011", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Xbox Incubation", "Xbox Incubation"], "conf": "cvpr", "authors": ["Jamie Shotton.....http://dblp.org/pers/hd/s/Shotton:Jamie", "Andrew W. Fitzgibbon.....http://dblp.org/pers/hd/f/Fitzgibbon:Andrew_W=", "Mat Cook.....http://dblp.org/pers/hd/c/Cook:Mat", "Toby Sharp.....http://dblp.org/pers/hd/s/Sharp:Toby", "Mark Finocchio.....http://dblp.org/pers/hd/f/Finocchio:Mark", "Richard Moore.....http://dblp.org/pers/hd/m/Moore_0003:Richard", "Alex Kipman.....http://dblp.org/pers/hd/k/Kipman:Alex", "Andrew Blake.....http://dblp.org/pers/hd/b/Blake_0001:Andrew"], "pages": 8}