{"title": "Energy-efficient mechanisms for managing thread context in throughput processors.", "fields": ["win32 thread information block", "memory data register", "stack register", "register window", "memory address register"], "abstract": "Modern graphics processing units (GPUs) use a large number of hardware threads to hide both function unit and memory access latency. Extreme multithreading requires a complicated thread scheduler as well as a large register file, which is expensive to access both in terms of energy and latency. We present two complementary techniques for reducing energy on massively-threaded processors such as GPUs. First, we examine register file caching to replace accesses to the large main register file with accesses to a smaller structure containing the immediate register working set of active threads. Second, we investigate a two-level thread scheduler that maintains a small set of active threads to hide ALU and local memory access latency and a larger set of pending threads to hide main memory latency. Combined with register file caching, a two-level thread scheduler provides a further reduction in energy by limiting the allocation of temporary register cache resources to only the currently active subset of threads. We show that on average, across a variety of real world graphics and compute workloads, a 6-entry per-thread register file cache reduces the number of reads and writes to the main register file by 50% and 59% respectively. We further show that the active thread count can be reduced by a factor of 4 with minimal impact on performance, resulting in a 36% reduction of register file energy.", "citation": "Citations (225)", "year": "2011", "departments": ["University of Texas at Austin", "University of Illinois at Urbana–Champaign", "Nvidia", "University of Texas at Austin", "Stanford University"], "conf": "isca", "authors": ["Mark Gebhart.....http://dblp.org/pers/hd/g/Gebhart:Mark", "Daniel R. Johnson.....http://dblp.org/pers/hd/j/Johnson:Daniel_R=", "David Tarjan.....http://dblp.org/pers/hd/t/Tarjan:David", "Stephen W. Keckler.....http://dblp.org/pers/hd/k/Keckler:Stephen_W=", "William J. Dally.....http://dblp.org/pers/hd/d/Dally:William_J=", "Erik Lindholm.....http://dblp.org/pers/hd/l/Lindholm:Erik", "Kevin Skadron.....http://dblp.org/pers/hd/s/Skadron:Kevin"], "pages": 12}