{"title": "Moser and tardos meet Lovász.", "fields": ["lattice reduction", "asymptotically optimal algorithm", "special case", "lovasz local lemma", "compromise"], "abstract": "Beck's early work [3] gave an efficient version of the Lovasz Local Lemma(LLL) with significant compromise in the parameters. Following several improvements [1,7,4,13], Moser [8], and Moser and Tardos [9] obtained asymptotically optimal results in terms of the maximal degree.   For a fixed dependency graph G the exact criterion under which LLL applies is given by Shearer in [12]. For a dependency structure G, let LO(G) be the set of those probability assignments to the nodes of G for which the Lovasz Local Lemma holds. We show that: Both the sequential and parallel ersions of the Moser-Tardos algorithm are efficient up to the Shearer's bound, by giving a tighter analysis. We also prove that, whenever p ∈ LO(G)/(1+e), the expected running times of the sequential and parallel versions are at most n/e and O(1/e log n/e), the later when e  general  LLL). Our alternative proof for the Shearer's bound not only highlights the connection between the variable and general versions of LLL, but also illustrates that variants of the Moser-Tardos algorithm can be useful in existence proofs. We obtain new formulas for phase transitions in the hardcore lattice gas model, non-trivially equivalent to the ones studied by Scott and Sokal [10]. We prove that if p ∈ LO(G)/(1+e), the running time of the Moser-Tardos algorithm is polynomial not only in the number of events, but also in the number of variables. This extends one of the results from the more recent work of Haeupler, Saha, and Srinivasan [6]. Our new formulas immediately give a majorizing lemma that connects LLL bounds on different graphs. We show that the LLL bound for the (special case of the) variable version is sometimes larger than for the general version. This is the first known separation between the variable and the general versions of LLL.", "citation": "Citations (63)", "year": "2011", "departments": ["Rutgers University", "Rutgers University"], "conf": "stoc", "authors": ["Kashyap Babu Rao Kolipaka.....http://dblp.org/pers/hd/k/Kolipaka:Kashyap_Babu_Rao", "Mario Szegedy.....http://dblp.org/pers/hd/s/Szegedy:Mario"], "pages": 10}