{"title": "Multivariate amortized resource analysis.", "fields": ["longest common subsequence problem", "m 2", "unary operation", "amortized analysis", "data type", "type inference"], "abstract": "We study the problem of automatically analyzing the worst-case resource usage of procedures with several arguments. Existing automatic analyses based on amortization, or sized types bound the resource usage or result size of such a procedure by a sum of unary functions of the sizes of the arguments.   In this paper we generalize this to arbitrary multivariate polynomial functions thus allowing bounds of the form  mn  which had to be grossly overestimated by  m 2 +n 2   before. Our framework even encompasses bounds like  ∗ i,j≤n  m_i m j   where the  m i   are the sizes of the entries of a list of length  n .   This allows us for the first time to derive useful resource bounds for operations on matrices that are represented as lists of lists and to considerably improve bounds on other super-linear operations on lists such as longest common subsequence and removal of duplicates from lists of lists.   Furthermore, resource bounds are now closed under composition which improves accuracy of the analysis of composed programs when some or all of the components exhibit super-linear resource or size behavior.   The analysis is based on a novel multivariate amortized resource analysis. We present it in form of a type system for a simple first-order functional language with lists and trees, prove soundness, and describe automatic type inference based on linear programming.   We have experimentally validated the automatic analysis on a wide range of examples from functional programming with lists and trees. The obtained bounds were compared with actual resource consumption. All bounds were asymptotically tight, and the constants were close or even identical to the optimal ones.", "citation": "Citations (110)", "departments": ["Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Yale University", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich"], "authors": ["Jan Hoffmann.....http://dblp.org/pers/hd/h/Hoffmann_0002:Jan", "Klaus Aehlig.....http://dblp.org/pers/hd/a/Aehlig:Klaus", "Martin Hofmann.....http://dblp.org/pers/hd/h/Hofmann_0001:Martin"], "conf": "popl", "year": "2011", "pages": 14}