{"title": "Adding regular expressions to graph reachability and pattern queries.", "fields": ["forbidden graph characterization", "implicit graph", "coxeter graph", "butterfly graph", "factor critical graph", "universal graph"], "abstract": "It is increasingly common to find graphs in which edges are of different types, indicating a variety of relationships. For such graphs we propose a class of reachability queries and a class of graph patterns, in which an edge is specified with a regular expression of a certain form, expressing the connectivity of a data graph via edges of various types. In addition, we define graph pattern matching based on a revised notion of graph simulation. On graphs in emerging applications such as social networks, we show that these queries are capable of finding more sensible information than their traditional counterparts. Better still, their increased expressive power does not come with extra complexity. Indeed, (1) we investigate their containment and minimization problems, and show that these fundamental problems are in quadratic time for reachability queries and are in cubic time for pattern queries. (2) We develop an algorithm for answering reachability queries, in quadratic time as for their traditional counterpart. (3) We provide two cubic-time algorithms for evaluating graph pattern queries, as opposed to the NP-completeness of graph pattern matching via subgraph isomorphism. (4) The effectiveness and efficiency of these algorithms are experimentally verified using real-life data and synthetic data.", "citation": "Citations (127)", "departments": ["University of Edinburgh", "Harbin Institute of Technology", "Harbin Institute of Technology", "Beihang University", "Qatar Foundation", "University of Edinburgh", "University of Edinburgh", "Harbin Institute of Technology", "University of Edinburgh", "University of Edinburgh", "University of Edinburgh"], "authors": ["Wenfei Fan.....http://dblp.org/pers/hd/f/Fan:Wenfei", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Shuai Ma.....http://dblp.org/pers/hd/m/Ma:Shuai", "Nan Tang.....http://dblp.org/pers/hd/t/Tang_0001:Nan", "Yinghui Wu.....http://dblp.org/pers/hd/w/Wu:Yinghui"], "conf": "icde", "year": "2011", "pages": 12}