{"title": "Multiple feature hashing for real-time large scale near-duplicate video retrieval.", "fields": ["search engine indexing", "feature hashing", "video tracking", "hamming space", "hash function"], "abstract": "Near-duplicate video retrieval (NDVR) has recently attracted lots of research attention due to the exponential growth of online videos. It helps in many areas, such as copyright protection, video tagging, online video usage monitoring, etc. Most of existing approaches use only a single feature to represent a video for NDVR. However, a single feature is often insufficient to characterize the video content. Besides, while the accuracy is the main concern in previous literatures, the scalability of NDVR algorithms for large scale video datasets has been rarely addressed. In this paper, we present a novel approach - Multiple Feature Hashing (MFH) to tackle both the accuracy and the scalability issues of NDVR. MFH preserves the local structure information of each individual feature and also globally consider the local structures for all the features to learn a group of hash functions which map the video keyframes into the Hamming space and generate a series of binary codes to represent the video dataset. We evaluate our approach on a public video dataset and a large scale video dataset consisting of 132,647 videos, which was collected from YouTube by ourselves. The experiment results show that the proposed method outperforms the state-of-the-art techniques in both accuracy and efficiency.", "citation": "Citations (219)", "departments": ["University of Queensland", "Carnegie Mellon University", "University of Queensland", "University of Queensland", "Hefei University of Technology"], "authors": ["Jingkuan Song.....http://dblp.org/pers/hd/s/Song:Jingkuan", "Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang"], "conf": "mm", "year": "2011", "pages": 10}