{"title": "Global contrast based salient region detection.", "fields": ["image retrieval", "grabcut", "object detection", "image segmentation", "kadir brady saliency detector"], "abstract": "Automatic estimation of salient object regions across images, without any prior assumption or knowledge of the contents of the corresponding scenes, enhances many computer vision and computer graphics applications. We introduce a regional contrast based salient object detection algorithm, which simultaneously evaluates global contrast differences and spatial weighted coherence scores. The proposed algorithm is simple, efficient, naturally multi-scale, and produces full-resolution, high-quality saliency maps. These saliency maps are further used to initialize a novel iterative version of GrabCut, namely SaliencyCut, for high quality unsupervised salient object segmentation. We extensively evaluated our algorithm using traditional salient object detection datasets, as well as a more challenging Internet image dataset. Our experimental results demonstrate that our algorithm consistently outperforms 15 existing salient object detection and segmentation methods, yielding higher precision and better recall rates. We also show that our algorithm can be used to efficiently extract salient object masks from Internet images, enabling effective sketch-based image retrieval (SBIR) via simple shape comparisons. Despite such noisy internet images, where the saliency regions are ambiguous, our saliency guided image retrieval achieves a superior retrieval rate compared with state-of-the-art SBIR methods, and additionally provides important target object region information.", "citation": "Citations (2,600)", "year": "2011", "departments": ["Tsinghua University", "Tsinghua University", "King Abdullah University of Science and Technology", "Lehigh University", "Tsinghua University"], "conf": "cvpr", "authors": ["Ming-Ming Cheng.....http://dblp.org/pers/hd/c/Cheng:Ming=Ming", "Guo-Xin Zhang.....http://dblp.org/pers/hd/z/Zhang:Guo=Xin", "Niloy J. Mitra.....http://dblp.org/pers/hd/m/Mitra:Niloy_J=", "Xiaolei Huang.....http://dblp.org/pers/hd/h/Huang:Xiaolei", "Shi-Min Hu.....http://dblp.org/pers/hd/h/Hu:Shi=Min"], "pages": 8}