{"title": "Structure-sensitive superpixels via geodesic distance.", "fields": ["edge detection", "feature vector", "geodesic", "homogeneity", "energy functional", "geometric flow", "market segmentation", "image compression"], "abstract": "Segmenting images into superpixels as supporting regions for feature vectors and primitives to reduce computational complexity has been commonly used as a fundamental step in various image analysis and computer vision tasks. In this paper, we describe the structure-sensitive superpixel technique by exploiting Lloyd’s algorithm with the geodesic distance. Our method generates smaller superpixels to achieve relatively low under-segmentation in structure-dense regions with high intensity or color variation, and produces larger segments to increase computational efficiency in structure-sparse regions with homogeneous appearance. We adopt geometric flows to compute geodesic distances amongst pixels. In the segmentation procedure, the density of over-segments is automatically adjusted through iteratively optimizing an energy functional that embeds color homogeneity, structure density. Comparative experiments with the Berkeley database show that the proposed algorithm outperforms the prior arts while offering a comparable computational efficiency as TurboPixels. Further applications in image compression, object closure extraction and video segmentation demonstrate the effective extensions of our approach.", "citation": "Citations (109)", "year": "2011", "departments": ["Peking University", "Peking University", "Peking University", "Microsoft", "Peking University", "Peking University", "Peking University", "Microsoft Research Asia (China)", "Peking University", "Peking University"], "conf": "iccv", "authors": ["Gang Zeng.....http://dblp.org/pers/hd/z/Zeng:Gang", "Peng Wang.....http://dblp.org/pers/hd/w/Wang:Peng", "Jingdong Wang.....http://dblp.org/pers/hd/w/Wang:Jingdong", "Rui Gan.....http://dblp.org/pers/hd/g/Gan:Rui", "Hongbin Zha.....http://dblp.org/pers/hd/z/Zha:Hongbin"], "pages": 8}