{"title": "How do fixes become bugs?", "fields": ["end user", "software regression", "vendor", "software bug", "commercial software"], "abstract": "Software bugs affect system reliability. When a bug is exposed in the field, developers need to fix them. Unfortunately, the bug-fixing process can also introduce errors, which leads to buggy patches that further aggravate the damage to end users and erode software vendors' reputation.   This paper presents a comprehensive characteristic study on incorrect bug-fixes from large operating system code bases including Linux, OpenSolaris, FreeBSD and also a mature commercial OS developed and evolved over the last 12 years, investigating not only themistake patterns during bug-fixing but also the possible human reasons in the development process when these incorrect bug-fixes were introduced. Our major findings include: (1) at least 14.8%--24.4% of sampled fixes for post-release bugs in these large OSes are incorrect and have made impacts to end users. (2) Among several common bug types, concurrency bugs are the most difficult to fix correctly: 39% of concurrency bug fixes are incorrect. (3) Developers and reviewers for incorrect fixes usually do not have enough knowledge about the involved code. For example, 27% of the incorrect fixes are made by developers who have never touched the source code files associated with the fix. Our results provide useful guidelines to design new tools and also to improve the development process. Based on our findings, the commercial software vendor whose OS code we evaluated is building a tool to improve the bug fixing and code reviewing process.", "citation": "Citations (176)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of California, San Diego", "NetApp", "NetApp"], "authors": ["Zuoning Yin.....http://dblp.org/pers/hd/y/Yin:Zuoning", "Ding Yuan.....http://dblp.org/pers/hd/y/Yuan:Ding", "Yuanyuan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuanyuan", "Shankar Pasupathy.....http://dblp.org/pers/hd/p/Pasupathy:Shankar", "Lakshmi N. Bairavasundaram.....http://dblp.org/pers/hd/b/Bairavasundaram:Lakshmi_N="], "conf": "sigsoft", "year": "2011", "pages": 11}