{"title": "Evaluating the viability of process replication reliability for exascale systems.", "fields": ["mean time between failures", "supercomputer", "overhead", "mission critical", "state machine replication"], "abstract": "As high-end computing machines continue to grow in size, issues such as fault tolerance and reliability limit application scalability. Current techniques to ensure progress across faults, like checkpoint-restart, are increasingly problematic at these scales due to excessive overheads predicted to more than double an application's time to solution. Replicated computing techniques, particularly state machine replication, long used in distributed and mission critical systems, have been suggested as an alternative to checkpoint-restart. In this paper, we evaluate the viability of using state machine replication as the primary fault tolerance mechanism for upcoming exascale systems. We use a combination of modeling, empirical analysis, and simulation to study the costs and benefits of this approach in comparison to checkpoint/restart on a wide range of system parameters. These results, which cover different failure distributions, hardware mean time to failures, and I/O bandwidths, show that state machine replication is a potentially useful technique for meeting the fault tolerance demands of HPC applications on future exascale platforms.", "citation": "Citations (217)", "departments": ["Sandia National Laboratories", "Sandia National Laboratories", "Sandia National Laboratories", "Sandia National Laboratories", "Sandia National Laboratories"], "authors": ["Kurt B. Ferreira.....http://dblp.org/pers/hd/f/Ferreira:Kurt_B=", "Jon Stearley.....http://dblp.org/pers/hd/s/Stearley:Jon", "James H. Laros III.....http://dblp.org/pers/hd/l/Laros_III:James_H=", "Ron Oldfield.....http://dblp.org/pers/hd/o/Oldfield:Ron", "Kevin T. Pedretti.....http://dblp.org/pers/hd/p/Pedretti:Kevin_T=", "Ron Brightwell.....http://dblp.org/pers/hd/b/Brightwell:Ron", "Rolf Riesen.....http://dblp.org/pers/hd/r/Riesen:Rolf", "Patrick G. Bridges.....http://dblp.org/pers/hd/b/Bridges:Patrick_G=", "Dorian C. Arnold.....http://dblp.org/pers/hd/a/Arnold:Dorian_C="], "conf": "sc", "year": "2011", "pages": 12}