{"title": "Efficient Methods for Overlapping Group Lasso.", "fields": ["convex function", "regularization", "duality", "proximal gradient methods for learning", "gradient descent", "feature selection", "operator", "lasso"], "abstract": "The group Lasso is an extension of the Lasso for feature selection on (predefined) nonoverlapping groups of features. The nonoverlapping group structure limits its applicability in practice. There have been several recent attempts to study a more general formulation where groups of features are given, potentially with overlaps between the groups. The resulting optimization is, however, much more challenging to solve due to the group overlaps. In this paper, we consider the efficient optimization of the overlapping group Lasso penalized problem. We reveal several key properties of the proximal operator associated with the overlapping group Lasso, and compute the proximal operator by solving the smooth and convex dual problem, which allows the use of the gradient descent type of algorithms for the optimization. Our methods and theoretical results are then generalized to tackle the general overlapping group Lasso formulation based on the e q  norm. We further extend our algorithm to solve a nonconvex overlapping group Lasso formulation based on the capped norm regularization, which reduces the estimation bias introduced by the convex penalty. We have performed empirical evaluations using both a synthetic and the breast cancer gene expression dataset, which consists of 8,141 genes organized into (overlapping) gene sets. Experimental results show that the proposed algorithm is more efficient than existing state-of-the-art algorithms. Results also demonstrate the effectiveness of the nonconvex formulation for overlapping group Lasso.", "citation": "Citations (154)", "departments": ["Arizona State University", "Princeton University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Lei Yuan.....http://dblp.org/pers/hd/y/Yuan_0001:Lei", "Jun Liu.....http://dblp.org/pers/hd/l/Liu_0003:Jun", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping"], "conf": "nips", "year": "2011", "pages": 9}