{"title": "Multi-path routing and rate allocation for multi-source video on-demand streaming in wireless mesh networks.", "fields": ["wireless mesh network", "multi source", "server", "multipath routing", "network congestion"], "abstract": "We study the multi-source video on-demand application in multi-channel multi-radio wireless mesh networks. When a user initiates a new video request, the application can stream the video not only from the media servers, but also from the peers that have buffered the video. The multi-path multi-source video on-demand streaming has been applied in wired networks with great success. However, it remains a challenging task in wireless networks due to wireless interference. In this paper, we first focus on the problem of finding the maximum number of high-quality and independent paths from the user to the servers or peers for each VoD request by considering the effect of wireless interference. We formulate it as a constrained maximum independent paths problem, and propose two efficient heuristic path discovery algorithms. Based on the multiple paths discovered, we further propose a joint routing and rate allocation algorithm, which minimizes the network congestion caused by the new VoD session. The algorithm is aware of the optimization for both existing and potential VoD sessions in the wireless mesh network. We evaluate our algorithms with real video traces. Simulation results demonstrate that our algorithm not only improves the average video streaming performance over all the coexisting VoD sessions in the network, but also increases the network's capacity of satisfying more subsequent VoD requests.", "citation": "Citations (23)", "departments": ["Michigan State University", "Michigan State University", "Michigan State University"], "authors": ["Yong Ding.....http://dblp.org/pers/hd/d/Ding_0002:Yong", "Yang Yang.....http://dblp.org/pers/hd/y/Yang:Yang", "Li Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Li"], "conf": "infocom", "year": "2011", "pages": 9}