{"title": "The Minimum k-way Cut of Bounded Size is Fixed-Parameter Tractable.", "fields": ["vertex", "minimum cut", "planar graph", "maximum cut", "parameterized complexity"], "abstract": "We consider the minimum $k$-way cut problem for unweighted undirected graphs with a size bound $s$ on the number of cut edges allowed. Thus we seek to remove as few edges as possible so as to split a graph into $k$ components, or report that this requires cutting more than $s$ edges. We show that this problem is fixed-parameter tractable (FPT) with the standard parameterization in terms of the solution size $s$. More precisely, for $s=O(1)$, we present a quadratic time algorithm. Moreover, we present a much easier linear time algorithm for planar graphs and bounded genus graphs. Our tractability result stands in contrast to known W[1] hardness of related problems. Without the size bound, Downey et al.~[2003] proved that the minimum $k$-way cut problem is W[1] hard with parameter $k$, and this is even for simple unweighted graphs. Downey et al.~asked about the status for planar graphs. We get linear time with fixed parameter $k$ for simple planar graphs since the minimum $k$-way cut of a planar graph is of size at most $6k$. More generally, we get FPT with parameter $k$ for any graph class with bounded average degree. A simple reduction shows that vertex cuts are at least as hard as edge cuts, so the minimum $k$-way vertex cut is also W[1] hard with parameter $k$. Marx [2004] proved that finding a minimum $k$-way vertex cut of size $s$ is also W[1] hard with parameter $s$. Marx asked about the FPT status with edge cuts, which we prove tractable here. We are not aware of any other cut problem where the vertex version is W[1] hard but the edge version is FPT, e.g., Marx [2004] proved that the $k$-terminal cut problem is FPT parameterized by the cut size, both for edge and vertex cuts.", "citation": "Citations (22)", "year": "2011", "departments": ["AT&T Labs", "Nat. Inst. of I ... ., Tokyo, Japan"], "conf": "focs", "authors": ["Ken-ichi Kawarabayashi.....http://dblp.org/pers/hd/k/Kawarabayashi:Ken=ichi", "Mikkel Thorup.....http://dblp.org/pers/hd/t/Thorup:Mikkel"], "pages": 10}