{"title": "Risk sensitive optimal control framework applied to delay tolerant networks.", "fields": ["peer to peer", "multiplicative function", "power control", "markov decision process", "delay tolerant networking"], "abstract": "Epidemics dynamics can describe the dissemination of information in delay tolerant networks, in peer to peer networks and in content delivery networks. The control of such dynamics has thus gained a central role in all of these areas. However, a major difficulty in this context is that the objective functions to be optimized are often not additive in time but are rather multiplicative. The classical objective function in DTNs, i.e., the successful delivery probability of a message within a given deadline, falls precisely in this category, because it takes often the form of the expectation of the exponent of some integral cost. So far, models involving such costs have been solved by interchanging the order of expectation and the exponential function. While reducing the problem to a standard optimal control problem, this interchange is only tight in the mean field limit obtained as the population tends to infinity. In this paper we identify a general framework from optimal control in finance, known as risk sensitive control, which let us handle the original (multiplicative) cost and obtain solutions to several novel control problems in DTNs. In particular, we can derive the structure of state-dependent controls that optimize transmission power at the source node. Further, we can account for the propagation loss factor of the wireless medium while obtaining these controls, and, finally, we address power control at the destination node, resulting in a novel threshold optimal activation policy. Combined optimal power control at source and destination nodes is also obtained.", "citation": "Citations (4)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "University of California, Berkeley", "Tata Institute of Fundamental Research", "CREATE-NET, Trento, Italy"], "authors": ["Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan", "Veeraruna Kavitha.....http://dblp.org/pers/hd/k/Kavitha:Veeraruna", "Francesco De Pellegrini.....http://dblp.org/pers/hd/p/Pellegrini:Francesco_De", "Vijay Kamble.....http://dblp.org/pers/hd/k/Kamble:Vijay", "Vivek S. Borkar.....http://dblp.org/pers/hd/b/Borkar:Vivek_S="], "conf": "infocom", "year": "2011", "pages": 9}