{"title": "Minimalist open-page: a DRAM page-mode scheduling policy for the many-core era.", "fields": ["dram", "instruction prefetch", "memory bandwidth", "universal memory", "microarchitecture"], "abstract": "Contemporary DRAM systems have maintained impressive scaling by managing a careful balance between performance, power, and storage density. In achieving these goals, a significant sacrifice has been made in DRAM's operational complexity. To realize good performance, systems must properly manage the significant number of structural and timing restrictions of the DRAM devices. DRAM's use is further complicated in many-core systems where the memory interface is shared among multiple cores/threads competing for memory bandwidth.   The use of the \"Page-mode\" feature of DRAM devices can mitigate many DRAM constraints. Current open-page policies attempt to garner the highest level of page hits. In an effort to achieve this, such greedy schemes map sequential address sequences to a single DRAM resource. This non-uniform resource usage pattern introduces high levels of conflict when multiple workloads in a many-core system map to the same set of resources.   In this paper we present a scheme that provides a careful balance between the benefits (increased performance and decreased power), and the detractors (unfairness) of page-mode accesses. In our  Minimalist  approach, we target \"just enough\" page-mode accesses to garner page-mode benefits, avoiding system unfairness. We use a fair memory hashing scheme to control the maximum number of page mode hits, and direct the memory scheduler with processor-generated prefetch meta-data.", "citation": "Citations (123)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Dimitris Kaseridis.....http://dblp.org/pers/hd/k/Kaseridis:Dimitris", "Jeffrey Stuecheli.....http://dblp.org/pers/hd/s/Stuecheli:Jeffrey", "Lizy Kurian John.....http://dblp.org/pers/hd/j/John:Lizy_Kurian"], "conf": "micro", "year": "2011", "pages": 12}