{"title": "Strategyproof auctions for balancing social welfare and fairness in secondary spectrum markets.", "fields": ["auction theory", "spectrum management", "max min fairness", "spectrum auction", "fairness measure"], "abstract": "Secondary spectrum access is emerging as a promising approach for mitigating the spectrum scarcity in wireless networks. Coordinated spectrum access for secondary users can be achieved using periodic spectrum auctions. Recent studies on such auction design mostly neglect the repeating nature of such auctions, and focus on greedily maximizing social welfare. Such auctions can cause subsets of users to experience starvation in the long run, reducing their incentive to continue participating in the auction. It is desirable to increase the diversity of users allocated spectrum in each auction round, so that a trade-off between social welfare and fairness is maintained. We study truthful mechanisms towards this objective, for both local and global fairness criteria. For local fairness, we introduce randomization into the auction design, such that each user is guaranteed a minimum probability of being assigned spectrum. Computing an optimal, interference-free spectrum allocation is NP-Hard; we present an approximate solution, and tailor a payment scheme to guarantee truthful bidding is a dominant strategy for all secondary users. For global fairness, we adopt the classic maxmin fairness criterion. We tailor another auction by applying linear programming techniques for striking the balance between social welfare and max-min fairness, and for finding feasible channel allocations. In particular, a pair of primal and dual linear programs are utilized to guide the probabilistic selection of feasible allocations towards a desired tradeoff in expectation.", "citation": "Citations (109)", "departments": ["University of Calgary", "University of Calgary", "University of Hong Kong"], "authors": ["Ajay Gopinathan.....http://dblp.org/pers/hd/g/Gopinathan:Ajay", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan"], "conf": "infocom", "year": "2011", "pages": 9}