{"title": "Towards low bit rate mobile visual search with multiple-channel coding.", "fields": ["low bit", "exploit", "channel code", "visual search", "ranking"], "abstract": "In this paper, we propose a multiple-channel coding scheme to extract compact visual descriptors for low bit rate mobile visual search. Different from previous visual search scenarios that send the query image, we make use of the ever growing mobile computational capability to directly extract compact visual descriptors at the mobile end. Meanwhile, stepping forward from the state-of-the-art compact descriptor extractions, we exploit the rich contextual cues at the mobile end (such as GPS tags for mobile visual search and 2D barcodes or RFID tags for mobile product search), together with the visual statistics at the reference database, to learn multiple coding channels. Therefore, we describe the query with one of many forms of high-dimensional visual signature, which is subsequently mapped to one or more channels and compressed. The compression function within each channel is learnt based on a novel robust PCA scheme, with specific consideration to preserve the retrieval ranking capability of the original signature. We have deployed our scheme on both iPhone4 and HTC DESIRE 7 to search ten million landmark images in a low bit rate setting. Quantitative comparisons to the state-of-the-arts demonstrate our significant advantages in descriptor compactness (with orders of magnitudes improvement) and retrieval mAP in mobile landmark, product, and CD/book cover search.", "citation": "Citations (45)", "departments": ["Peking University", "Peking University", "Peking University", "Harbin Institute of Technology", "Microsoft"], "authors": ["Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Ling-Yu Duan.....http://dblp.org/pers/hd/d/Duan:Ling=Yu", "Jie Chen.....http://dblp.org/pers/hd/c/Chen_0006:Jie", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Yong Rui.....http://dblp.org/pers/hd/r/Rui:Yong", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu", "Wen Gao.....http://dblp.org/pers/hd/g/Gao_0001:Wen"], "conf": "mm", "year": "2011", "pages": 10}