{"title": "CVC4.", "fields": ["source code", "license", "solver", "satisfiability modulo theories", "control engineering", "engineering", "computer simulation", "architecture", "flatness", "computer science", "programming language", "software"], "abstract": "CVC4 is a solver for Satisfiability Modulo Theories (SMT). This tutorial aims to give participants an overview of SMT, describe the main features of CVC4, and walk through in-depth examples using CVC4 to demonstrate how to solve real problems with an SMT solver. We will provide a detailed description of various aspects of CVC4's internals, including its architecture, its capacity for dealing with quantifiers, its finite model finder, and the linear arithmetic solver. We will show examples of software and hardware verification problems, and how they are encoded and handled by these features in CVC4.\n\nParticipants are expected to have only a basic knowledge of what SMT is. This tutorial will give casual users a taste of encoding complex, real-world problems in SMT and effectively using CVC4 to solve them. Participants will be left with some knowledge of what goes on inside a modern SMT solver and some of the practical issues that arise in using them.\n\nCVC4, jointly developed at New York University and the University of Iowa, is freely available for both research and commercial use under an open-source license. The organizers of this tutorial are all architects and implementors of CVC4 and have extensive expertise in the area of SMT.", "citation": "Not cited", "year": "2011", "departments": ["Polytechnic University of Catalonia", "University of Iowa", "New York University", "New York University", "University of Iowa", "Mechanical Engi ... g 100083,China)"], "conf": "cav", "authors": ["Clark Barrett.....http://dblp.org/pers/hd/b/Barrett:Clark", "Christopher L. Conway.....http://dblp.org/pers/hd/c/Conway:Christopher_L=", "Morgan Deters.....http://dblp.org/pers/hd/d/Deters:Morgan", "Liana Hadarean.....http://dblp.org/pers/hd/h/Hadarean:Liana", "Dejan Jovanovic.....http://dblp.org/pers/hd/j/Jovanovic:Dejan", "Tim King.....http://dblp.org/pers/hd/k/King_0001:Tim", "Andrew Reynolds.....http://dblp.org/pers/hd/r/Reynolds:Andrew", "Cesare Tinelli.....http://dblp.org/pers/hd/t/Tinelli:Cesare"], "pages": 7}