{"title": "Leveraging change blindness for redirection in virtual environments.", "fields": ["change blindness", "immersion", "illusion", "workspace", "metaverse"], "abstract": "We present change blindness redirection, a novel technique for allowing the user to walk through an immersive virtual environment that is considerably larger than the available physical workspace. In contrast to previous redirection techniques, this approach, based on a dynamic environment model, does not introduce any visual-vestibular conflicts from manipulating the mapping between physical and virtual motions, nor does it require breaking presence to stop and explicitly reorient the user. We conducted two user studies to evaluate the effectiveness of the change blindness illusion when exploring a virtual environment that was an order of magnitude larger than the physical walking space. Despite the dynamically changing environment, participants were able to draw coherent sketch maps of the environment structure, and pointing task results indicated that they were able to maintain their spatial orientation within the virtual world. Only one out of 77 participants across both both studies definitively noticed that a scene change had occurred, suggesting that change blindness redirection provides a remarkably compelling illusion. Secondary findings revealed that a wide field-of-view increases pointing accuracy and that experienced gamers reported greater sense of presence than those with little or no experience with 3D video games.", "citation": "Citations (78)", "departments": ["University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "USC Institute f ... ve Technologies", "USC Institute f ... ve Technologies", "USC Institute f ... ve Technologies"], "authors": ["Evan A. Suma.....http://dblp.org/pers/hd/s/Suma:Evan_A=", "Seth Clark.....http://dblp.org/pers/hd/c/Clark:Seth", "David M. Krum.....http://dblp.org/pers/hd/k/Krum:David_M=", "Samantha L. Finkelstein.....http://dblp.org/pers/hd/f/Finkelstein:Samantha_L=", "Mark T. Bolas.....http://dblp.org/pers/hd/b/Bolas:Mark_T=", "Zachary Wartell.....http://dblp.org/pers/hd/w/Wartell:Zachary"], "conf": "vr", "year": "2011", "pages": 8}