{"title": "Peta-scale phase-field simulation for dendritic solidification on the TSUBAME 2.0 supercomputer.", "fields": ["multi core processor", "dendrite", "supercomputer", "grid"], "abstract": "The mechanical properties of metal materials largely depend on their intrinsic internal microstructures. To develop engineering materials with the expected properties, predicting patterns in solidified metals would be indispensable. The phase-field simulation is the most powerful method known to simulate the micro-scale dendritic growth during solidification in a binary alloy. To evaluate the realistic description of solidification, however, phase-field simulation requires computing a large number of complex nonlinear terms over a fine-grained grid. Due to such heavy computational demand, previous work on simulating three-dimensional solidification with phase-field methods was successful only in describing simple shapes. Our new simulation techniques achieved scales unprecedentedly large, sufficient for handling complex dendritic structures required in material science. Our simulations on the GPU-rich TSUBAME 2.0 supercomputer at the Tokyo Institute of Technology have demonstrated good weak scaling and achieved 1.017 PFlops in single precision for our largest configuration, using 4,000 GPUs along with 16,000 CPU cores.", "citation": "Citations (148)", "departments": ["Tokyo Institute of Technology", "Tokyo Institute of Technology", "Kyoto Institute of Technology", "Tokyo Institute of Technology", "Tokyo Institute of Technology"], "authors": ["Takashi Shimokawabe.....http://dblp.org/pers/hd/s/Shimokawabe:Takashi", "Takayuki Aoki.....http://dblp.org/pers/hd/a/Aoki:Takayuki", "Tomohiro Takaki.....http://dblp.org/pers/hd/t/Takaki:Tomohiro", "Toshio Endo.....http://dblp.org/pers/hd/e/Endo:Toshio", "Akinori Yamanaka.....http://dblp.org/pers/hd/y/Yamanaka:Akinori", "Naoya Maruyama.....http://dblp.org/pers/hd/m/Maruyama:Naoya", "Akira Nukada.....http://dblp.org/pers/hd/n/Nukada:Akira", "Satoshi Matsuoka.....http://dblp.org/pers/hd/m/Matsuoka:Satoshi"], "conf": "sc", "year": "2011", "pages": 11}