{"title": "Pipelining packet scheduling in a low latency optical packet switch.", "fields": ["job shop scheduling", "network packet", "pipeline", "random access", "low latency"], "abstract": "Optical switching architectures with electronic buffers have been proposed to tackle the lack of optical Random Access Memories (RAM). Out of these architectures, the OpCut switch [1] achieves low latency and minimizes optical-electronic-optical (O/E/O) conversions by allowing packets to cut-through the switch. In an OpCut switch, a packet is converted and sent to the electronic buffers only if it cannot be directly routed to the switch output. As the length of a time slot shrinks with the increase of the line card rate in such a high-speed system, it may become too stringent to calculate a schedule in each single time slot. In such a case, pipelining scheduling can be adopted to relax the time constraint. In this paper, we present a novel mechanism to pipeline the packet scheduling in the OpCut switch by adopting multiple “sub-schedulers.” The computation of a complete schedule for each time slot is done under the collaboration of sub-schedulers and spans multiple time slots, while at any time schedules for different time slots are being calculated simultaneously. We present the implementation details when two sub-schedulers are adopted, and show that in this case our pipelining mechanism eliminates duplicate scheduling which is a common problem in a pipelined environment. With an arbitrary number of sub-schedulers, the duplicate scheduling problem becomes very difficult to eliminate due to the increased scheduling complexity. Nevertheless, we propose several approaches to reducing it. Finally, to minimize the extra delay introduced by pipelining as well as the overall average packet delay under all traffic intensities, we further propose an adaptive pipelining scheme. Our simulation results show that the pipelining mechanism effectively reduces scheduler complexity while maintaining good system performance.", "citation": "Citations (2)", "departments": ["Stony Brook University", "Florida State University", "Stony Brook University"], "authors": ["Lin Liu.....http://dblp.org/pers/hd/l/Liu_0004:Lin", "Zhenghao Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenghao", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2011", "pages": 9}