{"title": "Cache Games - Bringing Access-Based Cache Attacks on AES to Practice.", "fields": ["ciphertext", "cache", "parallel computing", "smart cache", "plaintext", "bus sniffing", "aes implementations", "advanced encryption standard", "cache algorithms", "related key attack"], "abstract": "Side channel attacks on cryptographic systems exploit information gained from physical implementations rather than theoretical weaknesses of a scheme. In recent years, major achievements were made for the class of so called access-driven cache attacks. Such attacks exploit the leakage of the memory locations accessed by a victim process. In this paper we consider the AES block cipher and present an attack which is capable of recovering the full secret key in almost real time for AES-128, requiring only a very limited number of observed encryptions. Unlike previous attacks, we do not require any information about the plaintext (such as its distribution, etc.). Moreover, for the first time, we also show how the plaintext can be recovered without having access to the cipher text at all. It is the first working attack on AES implementations using compressed tables. There, no efficient techniques to identify the beginning of AES rounds is known, which is the fundamental assumption underlying previous attacks. We have a fully working implementation of our attack which is able to recover AES keys after observing as little as 100 encryptions. It works against the OpenS SL 0.9.8n implementation of AES on Linux systems. Our spy process does not require any special privileges beyond those of a standard Linux user. A contribution of probably independent interest is a denial of service attack on the task scheduler of current Linux systems (CFS), which allows one to observe (on average) every single memory access of a victim process.", "citation": "Citations (297)", "departments": ["Bern University of Applied Sciences", "Bern University of Applied Sciences", "Bern University of Applied Sciences"], "authors": ["David Gullasch.....http://dblp.org/pers/hd/g/Gullasch:David", "Endre Bangerter.....http://dblp.org/pers/hd/b/Bangerter:Endre", "Stephan Krenn.....http://dblp.org/pers/hd/k/Krenn:Stephan"], "conf": "sp", "year": "2011", "pages": 16}