{"title": "Connectivity maintenance in mobile wireless networks via constrained mobility.", "fields": ["mobile ad hoc network", "testbed", "mobile telephony", "physical layer", "adaptive system", "network topology"], "abstract": "We explore distributed mechanisms for maintaining the physical layer connectivity of a mobile wireless network while still permitting significant area coverage. Moreover, we require that these mechanisms maintain connectivity despite the unpredictable wireless propagation behavior found in complex real-world environments. To this end, we propose the Spreadable Connected Autonomic Network (SCAN) algorithm, a fully distributed, on-line, low overhead mechanism for maintaining the connectivity of a mobile wireless network. SCAN leverages knowledge of the local (2-hop) network topology to enable each node to intelligently halt its own movement and thereby avoid network partitioning events. By relying on topology data instead of locality information and deterministic connectivity models, SCAN can be applied in a wide range of realistic operational environments. We believe it is for precisely this reason that, to our best knowledge, SCAN was the first such approach to be implemented in hardware. Here, we present results from our implementation of SCAN, finding that our mobile robotic testbed maintains full connectivity over 99% of the time. Moreover, SCAN achieves this in a complex indoor environment, while still allowing testbed nodes to cover a significant area.", "citation": "Citations (55)", "departments": ["Princeton University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "authors": ["Joshua Reich.....http://dblp.org/pers/hd/r/Reich:Joshua", "Vishal Misra.....http://dblp.org/pers/hd/m/Misra:Vishal", "Dan Rubenstein.....http://dblp.org/pers/hd/r/Rubenstein:Dan", "Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil"], "conf": "infocom", "year": "2011", "pages": 9}