{"title": "High performance database logging using storage class memory.", "fields": ["logging", "database transaction", "atomicity", "concurrency", "transaction processing"], "abstract": "Storage class memory (SCM), a new generation of memory technology, offers non-volatility, high-speed, and byte-addressability, which combines the best properties of current hard disk drives (HDD) and main memory. With these extraordinary features, current systems and software stacks need to be redesigned to get significantly improved performance by eliminating disk input/output (I/O) barriers; and simpler system designs by avoiding complicated data format transformations. In current DBMSs, logging and recovery are the most important components to enforce the atomicity and durability of a database. Traditionally, database systems rely on disks for logging transaction actions and log records are forced to disks when a transaction commits. Because of the slow disk I/O speed, logging becomes one of the major bottlenecks for a DBMS. Exploiting SCM as a persistent memory for transaction logging can significantly reduce logging overhead. In this paper, we present the detailed design of an SCM-based approach for DBMSs logging, which achieves high performance by simplified system design and better concurrency support. We also discuss solutions to tackle several major issues arising during system recovery, including hole detection, partial write detection, and any-point failure recovery. This new logging approach is used to replace the traditional disk based logging approach in DBMSs. To analyze the performance characteristics of our SCM-based logging approach, we implement the prototype on IBM SolidDB. In common circumstances, our experimental results show that the new SCM-based logging approach provides as much as 7 times throughput improvement over disk-based logging in the Telecommunication Application Transaction Processing (TATP) benchmark.", "citation": "Citations (85)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Ru Fang.....http://dblp.org/pers/hd/f/Fang:Ru", "Hui-I Hsiao.....http://dblp.org/pers/hd/h/Hsiao:Hui=I", "Bin He.....http://dblp.org/pers/hd/h/He:Bin", "C. Mohan.....http://dblp.org/pers/hd/m/Mohan_0001:C=", "Yun Wang.....http://dblp.org/pers/hd/w/Wang:Yun"], "conf": "icde", "year": "2011", "pages": 11}