{"title": "Towards multi-semantic image annotation with graph regularized exclusive group lasso.", "fields": ["semantic computing", "semantic similarity", "smoothing", "semantic gap", "automatic image annotation"], "abstract": "To bridge the semantic gap between low level feature and human perception, most of the existing algorithms aim mainly at annotating images with concepts coming from only one semantic space, e.g. cognitive or affective. The naive combination of the outputs from these spaces will implicitly force the conditional independence and ignore the correlations among the spaces. In this paper, to exploit the comprehensive semantic of images, we propose a general framework for harmoniously integrating the above multiple semantics, and investigating the problem of learning to annotate images with training images labeled in two or more correlated semantic spaces, such as fascinating nighttime, or exciting cat. This kind of semantic annotation is more oriented to real world search scenario. Our proposed approach outperforms the baseline algorithms by making the following contributions. 1) Unlike previous methods that annotate images within only one semantic space, our proposed multi-semantic annotation associates each image with labels from multiple semantic spaces. 2) We develop a multi-task linear discriminative model to learn a linear mapping from features to labels. The tasks are correlated by imposing the exclusive group lasso regularization for competitive feature selection, and the graph Laplacian regularization to deal with insufficient training sample issue. 3) A Nesterov-type smoothing approximation algorithm is presented for efficient optimization of our model. Extensive experiments on NUS-WIDEEmotive dataset (56k images) with 8×81 emotive cognitive concepts and Object&Scene datasets from NUS-WIDE well validate the effectiveness of the proposed approach.", "citation": "Citations (13)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Nanjing University of Science and Technology", "Advanced Technology Center"], "authors": ["Xiangyu Chen.....http://dblp.org/pers/hd/c/Chen:Xiangyu", "Xiaotong Yuan.....http://dblp.org/pers/hd/y/Yuan:Xiaotong", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "Yong Rui.....http://dblp.org/pers/hd/r/Rui:Yong", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2011", "pages": 10}