{"title": "Near-optimal private approximation protocols via a black box transformation.", "fields": ["symmetric function", "importance sampling", "quadratic growth", "subspace topology", "computable function"], "abstract": "We show the following transformation: any two-party protocol for outputting a (1+e)-approximation to f(x,y) = ∑ j=1  n  g(x j , y j ) with probability at least 2/3, for any non-negative efficienty computable function g, can be transformed into a two-party private approximation protocol with only a polylogarithmic factor loss in communication, computation, and round complexity. In general it is insufficient to use secure function evaluation or fully homomorphic encryption on a standard, non-private protocol for approximating f. This is because the approximation may reveal information about x and y that does not follow from f(x,y). Applying our transformation and variations of it, we obtain near-optimal private approximation protocols for a wide range of problems in the data stream literature for which previously nothing was known. We give near-optimal private approximation protocols for the l p -distance for every p ≥ 0, for the heavy hitters and importance sampling problems with respect to any l p -norm, for the max-dominance and other dominant l p -norms, for the distinct summation problem, for entropy, for cascaded frequency moments, for subspace approximation and block sampling, and for measuring independence of datasets. Using a result for data streams, we obtain private approximation protocols with polylogarithmic communication for every non-decreasing and symmetric function g(x j ,y j ) = h(x j -y j ) with at most quadratic growth. If the original (non-private) protocol is a simultaneous protocol, e.g., a sketching algorithm, then our only cryptographic assumption is efficient symmetric computationally-private information retrieval; otherwise it is fully homomorphic encryption. For all but one of these problems, the original protocol is a sketching algorithm. Our protocols generalize straightforwardly to more than two parties.", "citation": "Citations (4)", "year": "2011", "departments": ["IBM"], "conf": "stoc", "authors": ["David P. Woodruff.....http://dblp.org/pers/hd/w/Woodruff:David_P="], "pages": 10}