{"title": "Fast Nonnegative Matrix Tri-Factorization for Large-Scale Data Co-Clustering.", "fields": ["matrix multiplication", "non negative matrix factorization", "biclustering", "factorization", "nonnegative matrix"], "abstract": "Nonnegative Matrix Factorization (NMF) based coclustering methods have attracted increasing attention in recent years because of their mathematical elegance and encouraging empirical results. However, the algorithms to solve NMF problems usually involve intensive matrix multiplications, which make them computationally inefficient. In this paper, instead of constraining the factor matrices of NMF to be nonnegative as existing methods, we propose a novel Fast Nonnegative Matrix Trifactorization (FNMTF) approach to constrain them to be cluster indicator matrices, a special type of nonnegative matrices. As a result, the optimization problem of our approach can be decoupled, which results in much smaller size subproblems requiring much less matrix multiplications, such that our approach works well for large-scale input data. Moreover, the resulted factor matrices can directly assign cluster labels to data points and features due to the nature of indicator matrices. In addition, through exploiting the manifold structures in both data and feature spaces, we further introduce the Locality Preserved FNMTF (LP-FNMTF) approach, by which the clustering performance is improved. The promising results in extensive experimental evaluations validate the effectiveness of the proposed methods.", "citation": "Citations (66)", "year": "2011", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington"], "conf": "ijcai", "authors": ["Hua Wang.....http://dblp.org/pers/hd/w/Wang:Hua", "Feiping Nie.....http://dblp.org/pers/hd/n/Nie:Feiping", "Heng Huang.....http://dblp.org/pers/hd/h/Huang:Heng", "Fillia Makedon.....http://dblp.org/pers/hd/m/Makedon:Fillia"], "pages": 6}