{"title": "MorphCache: A Reconfigurable Adaptive Multi-level Cache hierarchy.", "fields": ["cache invalidation", "bus sniffing", "snoopy cache", "smart cache", "cache pollution"], "abstract": "Given the diverse range of application characteristics that chip multiprocessors (CMPs) need to cater to, a “one-cache-topology-fits-all” design philosophy will clearly be inadequate. In this paper, we propose MorphCache, a Reconfigurable Adaptive Multi-level Cache hierarchy. Mor-phCache dynamically tunes a multi-level cache topology in a CMP to allow significantly different cache topologies to exist on the same architecture. Starting from per-core L2 and L3 cache slices as the basic design point, MorphCache alters the cache topology dynamically by merging or splitting cache slices and modifying the accessibility of different cache slice groups to different cores in a CMP. We evaluated MorphCache on a 16 core CMP on a full system simulator and found that it significantly improves both average throughput and harmonic mean of speedups of diverse multithreaded and multiprogrammed workloads. Specifically, our results show that MorphCache improves throughput of the multiprogrammed mixes by 29.9% over a topology with all-shared L2 and L3 caches and 27.9% over a topology with per core private L2 cache and shared L3 cache. In addition, we also compared MorphCache to partitioning a single shared cache at each level using promotion/insertion pseudo-partitioning (PIPP) [28] and managing per-core private cache at each level using dynamic spill receive caches (DSR) [18]. We found that MorphCache improves average throughput by 6.6% over PIPP and by 5.7% over DSR when applied to both L2 and L3 caches.", "citation": "Citations (24)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Shekhar Srikantaiah.....http://dblp.org/pers/hd/s/Srikantaiah:Shekhar", "Emre Kultursay.....http://dblp.org/pers/hd/k/Kultursay:Emre", "Tao Zhang.....http://dblp.org/pers/hd/z/Zhang_0032:Tao", "Mahmut T. Kandemir.....http://dblp.org/pers/hd/k/Kandemir:Mahmut_T=", "Mary Jane Irwin.....http://dblp.org/pers/hd/i/Irwin:Mary_Jane", "Yuan Xie.....http://dblp.org/pers/hd/x/Xie_0001:Yuan"], "conf": "hpca", "year": "2011", "pages": 12}