{"title": "Global weighted fairness guaranteed congestion avoidance protocol for wireless sensor networks.", "fields": ["flow control", "sensor node", "fairness measure", "adaptive control", "maximum throughput scheduling"], "abstract": "In wireless sensor networks, congestion not only leads to buffer overflowing, but also increases delays and lowers network throughput with a lot of wasted energy due to retransmissions. Therefore an effective solution should be proposed to avoid congestion to increase energy efficiency and prolong the lifetime of network. Traditional solutions work in an open-loop fashion and hence fail to adapt to the change of network after network deployment. In this paper, we propose a novel decentralized rate control based congestion avoidance protocol (RCCAP), which is an adaptive rate control algorithm based on the combination of discrete proportional-integral-derivative (PID) control method and single neuron. The main idea of RCCAP is to ensure that the buffer length of each sensor node is as close as possible to an ideal length by a feedback control loop that adaptively calibrates the total rate of data packets entering in each sensor node periodically according to the information collected by the node recently. In addition, we prove the stability of system based on Lyapunov stability theory. We also prove that global weighted fairness metrics f M  = 1 − O(M −2 ), where M is the number of periods, under the condition that the system is stable when time approaches infinity. Our approach has been evaluated on a real wireless sensor network testbed. Detailed experimental results demonstrate that the global weighted fairness of RCCAP achieves 99% on average, which is much stronger than the existing rate-based congestion control protocol. Moreover, RCCAP achieves 52% and 18% gains in network throughput and global weighted fairness over PCCP on average, respectively.", "citation": "Citations (4)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology"], "authors": ["Guohua Li.....http://dblp.org/pers/hd/l/Li:Guohua", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong"], "conf": "infocom", "year": "2011", "pages": 5}