{"title": "A first look at inter-data center traffic characteristics via Yahoo! datasets.", "fields": ["data center", "operator", "netflow", "the internet", "heuristics"], "abstract": "Effectively managing multiple data centers and their traffic dynamics pose many challenges to their operators, as little is known about the characteristics of inter-data center (D2D) traffic. In this paper we present a first study of D2D traffic characteristics using the anonymized NetFlow datasets collected at the border routers of five major Yahoo! data centers. Our contributions are mainly two-fold: i) we develop novel heuristics to infer the Yahoo! IP addresses and localize their locations from the anonymized NetFlow datasets, and ii) we study and analyze both D2D and client traffic characteristics and the correlations between these two types of traffic. Our study reveals that Yahoo! uses a hierarchical way of deploying data centers, with several satellite data centers distributed in other countries and backbone data centers distributed in US locations. For Yahoo! US data centers, we separate the client-triggered D2D traffic and background D2D traffic from the aggregate D2D traffic using port based correlation, and study their respective characteristics. Our findings shed light on the interplay of multiple data centers and their traffic dynamics within a large content provider, and provide insights to data center designers and operators as well as researchers.", "citation": "Citations (188)", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "University of Minnesota", "Arizona State University"], "authors": ["Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0002:Yingying", "Sourabh Jain.....http://dblp.org/pers/hd/j/Jain:Sourabh", "Vijay Kumar Adhikari.....http://dblp.org/pers/hd/a/Adhikari:Vijay_Kumar", "Zhi-Li Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhi=Li", "Kuai Xu.....http://dblp.org/pers/hd/x/Xu:Kuai"], "conf": "infocom", "year": "2011", "pages": 9}