{"title": "Shape-constrained Gaussian process regression for facial-point-based head-pose normalization.", "fields": ["gaussian process", "pose", "data model", "normalization", "facial expression", "gaussian function", "kriging", "point distribution model"], "abstract": "Given the facial points extracted from an image of a face in an arbitrary pose, the goal of facial-point-based head-pose normalization is to obtain the corresponding facial points in a predefined pose (e.g., frontal). This involves inference of complex and high-dimensional mappings due to the large number of the facial points employed, and due to differences in head-pose and facial expression. Most regression-based approaches for learning such mappings focus on modeling correlations only between the inputs (i.e., the facial points in a non-frontal pose) and the outputs (i.e., the facial points in the frontal pose), but not within the inputs and the outputs of the model. This makes these models prone to errors due to noise and outliers in test data, often resulting in anatomically impossible facial configurations formed by their predictions. To address this, we propose Shape-constrained Gaussian Process (SC-GP) regression for facial-point-based head-pose normalization. Specifically, a deformable face-shape model is used to learn a face-shape prior, which is placed on both the input and the output of GP regression in order to constrain the model predictions to anatomically feasible facial configurations. Our extensive experiments on both synthetic and real image data show that the proposed approach generalizes well across poses and handles successfully noise and outliers in test data. In addition, the proposed model outperforms previously proposed approaches to facial-point-based head-pose normalization.", "citation": "Citations (11)", "year": "2011", "departments": ["Imperial College London", "Imperial College London", "Imperial College London", "Imperial College London"], "conf": "iccv", "authors": ["Ognjen Rudovic.....http://dblp.org/pers/hd/r/Rudovic:Ognjen", "Maja Pantic.....http://dblp.org/pers/hd/p/Pantic:Maja"], "pages": 8}