{"title": "C4: A new paradigm for providing incentives in multi-hop wireless networks.", "fields": ["unicast", "linear network coding", "virtual currency", "commodity currency", "hop"], "abstract": "For a multi-hop wireless network (MWN) consisting of mobile nodes controlled by independent self-interested users, incentive mechanism is essential for motivating mobile nodes to cooperate and forward packets for each other. Existing solutions such as barter based, virtual-currency based and reputation based schemes are either less effective or incur high implementation costs, and therefore do not fit well with the unique requirements of MWNs. In this paper, we propose a novel and promising incentive paradigm, Controlled Coded packets as virtual Commodity Currency (C4), to induce cooperative behaviors in MWNs. In our C4, through introducing several techniques from network coding, coded information packets are utilized as a new kind of virtual currency to facilitate packet/service exchanges among self-interested nodes in a MWN. Since the virtual currency implemented in this way also carries useful data information, it is the counterpart of the so-called commodity currency in the physical world, and the overhead brought by C4 is extremely small compared to traditional schemes. We theoretically show that C4 is perfectly efficient to support MWNs with broadcast and multicast traffics. For pure unicast communications, by adjusting the grouping parameter, our C4 provides a systematic way to smoothly trade incentive effectiveness for implementation cost, and traditional barter based and virtual-currency based schemes are just two extreme cases of C4. We also show that when our C4 is combined with the social network formed by mobile users in the MWN, the implementation costs can be further reduced without sacrificing incentive effectiveness.", "citation": "Citations (26)", "departments": ["University of Florida", "Xidian University", "University of Florida", "University of Florida"], "authors": ["Chi Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Chi", "Xiaoyan Zhu.....http://dblp.org/pers/hd/z/Zhu:Xiaoyan", "Yang Song.....http://dblp.org/pers/hd/s/Song_0005:Yang", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang"], "conf": "infocom", "year": "2011", "pages": 9}