{"title": "Spotter: A model based active geolocation service.", "fields": ["location awareness", "geolocation", "planetlab", "probabilistic logic", "network delay"], "abstract": "The localization of Internet hosts opens space for a wide scope of applications, from targeted, location aware content provision to localizing illegal content. In this paper we present a novel probabilistic approach, called Spotter, for estimating the geographic position of Internet devices with remarkable precision. While the existing methods use landmark specific calibration for building their internal models we show that the delay-distance data follow a generic distribution for each landmark. Hence, instead of describing the delay-distance space in a landmark specific manner our proposed method handles all the calibration points together and derives a common delay-distance model. This fundamental discovery indicates that, in contrast to prior techniques, Spotter is less prone to measurement errors and other anomalies such as indirect routing. To demonstrate the robustness and the accuracy of Spotter we test the performance on PlanetLab nodes as well as on a more realistic reference set collected by CAIDA explicitly for geolocation comparison purposes. To the best of our knowledge, we are the first to use this novel ground truth containing over 23000 network routers with their geographic locations.", "citation": "Citations (86)", "departments": ["Eötvös Loránd University", "Eötvös Loránd University", "Eötvös Loránd University", "Eötvös Loránd University", "Eötvös Loránd University"], "authors": ["Sándor Laki.....http://dblp.org/pers/hd/l/Laki:S=aacute=ndor", "Péter Mátray.....http://dblp.org/pers/hd/m/M=aacute=tray:P=eacute=ter", "Péter Hága.....http://dblp.org/pers/hd/h/H=aacute=ga:P=eacute=ter", "Tamas Sebok.....http://dblp.org/pers/hd/s/Sebok:Tamas", "István Csabai.....http://dblp.org/pers/hd/c/Csabai:Istv=aacute=n", "Gábor Vattay.....http://dblp.org/pers/hd/v/Vattay:G=aacute=bor"], "conf": "infocom", "year": "2011", "pages": 9}