{"title": "A Comparison of Lex Bounds for Multiset Variables in Constraint Programming.", "fields": ["local consistency", "multiset", "expressivity", "cardinality", "lexicographical order"], "abstract": "Set and multiset variables in constraint programming have typically been represented using subset bounds. However, this is a weak representation that neglects potentially useful information about a set such as its cardinality. For set variables, the length-lex (LL) representation successfully provides information about the length (cardinality) and position in the lexicographic ordering. For multiset variables, where elements can be repeated, we consider richer representations that take into account additional information. We study eight different representations in which we maintain bounds according to one of the eight different orderings: length-(co)lex (LL/LC), variety-(co)lex (VL/VC), length-variety-(co)lex (LVL/LVC), and variety-length-(co)lex (VLL/VLC) orderings. These representations integrate together information about the cardinality, variety (number of distinct elements in the multiset), and position in some total ordering. Theoretical and empirical comparisons of expressiveness and compactness of the eight representations suggest that length-variety-(co)lex (LVL/LVC) and variety-length-(co)lex (VLL/VLC) usually give tighter bounds after constraint propagation. We implement the eight representations and evaluate them against the subset bounds representation with cardinality and variety reasoning. Results demonstrate that they offer significantly better pruning and runtime.", "citation": "Citations (1)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "NICTA"], "authors": ["Yat Chiu Law.....http://dblp.org/pers/hd/l/Law:Yat_Chiu", "Jimmy Ho-Man Lee.....http://dblp.org/pers/hd/l/Lee:Jimmy_Ho=Man", "May Hiu-Chun Woo.....http://dblp.org/pers/hd/w/Woo:May_Hiu=Chun", "Toby Walsh.....http://dblp.org/pers/hd/w/Walsh:Toby"], "conf": "aaai", "year": "2011", "pages": -1}