{"title": "Wi-Fi 2.0: Price and quality competitions of duopoly cognitive radio wireless service providers with time-varying spectrum availability.", "fields": ["internet access", "duopoly", "cognitive radio", "service provider", "service quality"], "abstract": "The whitespaces (WS) in the legacy spectrum provide new opportunities for the future Wi-Fi-like Internet access, often called Wi-Fi 2.0, since service quality can be greatly enhanced thanks to the better propagation characteristics of the WS than the ISM bands. In the Wi-Fi 2.0 networks, each wireless service provider (WSP) temporarily leases a licensed spectrum band from the licensees and opportunistically utilizes it during the absence of the legacy users. The WSPs in Wi-Fi 2.0 thus face unique challenges since spectrum availability of the leased channel is time-varying due to the ON/OFF spectrum usage patterns of the legacy users, which necessitates the eviction control of in-service customers at the return of legacy users. As a result, to maximize its profit, a WSP should consider both channel leasing and eviction costs to optimally determine a spectrum band to lease and a service tariff. In this paper, we consider a duopoly Wi-Fi 2.0 market where two co-located WSPs compete for the spectrum and customers. The competition between the WSPs is analyzed using game theory to derive the Nash Equilibria (NE) of the price (of the service tariffs) and the quality (of the leased channel, in terms of channel utilization) competitions. The NE existence condition and market entry barriers are also derived. Via an extensive numerical analysis, we show the tradeoffs between leasing/eviction cost, customer arrivals, and channel usage patterns by the legacy users.", "citation": "Citations (25)", "departments": ["IBM", "University of Michigan", "University of Michigan"], "authors": ["Hyoil Kim.....http://dblp.org/pers/hd/k/Kim:Hyoil", "Jaehyuk Choi.....http://dblp.org/pers/hd/c/Choi:Jaehyuk", "Kang G. Shin.....http://dblp.org/pers/hd/s/Shin:Kang_G="], "conf": "infocom", "year": "2011", "pages": 9}