{"title": "Stateless Cryptographic Protocols.", "fields": ["lossy compression", "cryptographic primitive", "one way function", "secure multi party computation", "resource reservation protocol", "zero knowledge proof", "public key certificate", "wide mouth frog protocol", "oblivious transfer", "tunneling protocol", "ip fragmentation", "otway rees protocol", "overhead", "internet protocol control protocol", "default gateway", "hypertext transfer protocol over secure socket layer", "authentication protocol", "software token", "commitment scheme", "public key cryptography", "secure two party computation", "user datagram protocol", "challenge handshake authentication protocol", "multihoming", "certificate server", "oblivious ram", "stateless protocol", "ipsec", "online certificate status protocol", "host identity protocol", "oakley protocol", "key agreement protocol", "universal composability"], "abstract": "A number of works have investigated using tamper-proof hardware tokens as tools to achieve a variety of cryptographic tasks. In particular, Goldreich and Ostrovsky considered the problem of software protection via oblivious RAM. Goldwasser, Kalai, and Rothblum introduced the concept of one-time programs: in a one-time program, an honest sender sends a set of simple hardware tokens to a (potentially malicious) receiver. The hardware tokens allow the receiver to execute a secret program specified by the sender’s tokens exactly once (or, more generally, up to a fixed t times). A recent line of work initiated by Katz examined the problem of achieving UC-secure computation using hardware tokens.\n\nMotivated by the goal of unifying and strengthening these previous notions, we consider the general question of basing secure computation on hardware tokens. We show that the following tasks, which cannot be realized in the “plain” model, become feasible if the parties are allowed to generate and exchange tamper-proof hardware tokens.\n\nUnconditional and non-interactive secure computation. We show that by exchanging simple stateful hardware tokens, any functionality can be realized with unconditional security against malicious parties. In the case of two-party functionalities f(x,y) which take their inputs from a sender and a receiver and deliver their output to the receiver, our protocol is non-interactive and only requires a unidirectional communication of simple stateful tokens from the sender to the receiver. This strengthens previous feasibility results for one-time programs both by providing unconditional security and by offering general protection against malicious senders. As is typically the case for unconditionally secure protocols, our protocol is in fact UC-secure. This improves over previous works on UC-secure computation based on hardware tokens, which provided computational security under cryptographic assumptions.\n\nInteractive secure computation from stateless tokens based on one-way functions. We show that stateless hardware tokens are sufficient to base general secure (in fact, UC-secure) computation on the existence of one-way functions.\n\nObfuscation from stateless tokens. We consider the problem of realizing non-interactive secure computation from stateless tokens for functionalities which allow the receiver to provide an arbitrary number of inputs (these are the only functionalities one can hope to realize non-interactively with stateless tokens). By building on recent techniques for resettably secure computation, we obtain a general positive result under standard cryptographic assumptions. This gives the first general feasibility result for program obfuscation using stateless tokens, while strengthening the standard notion of obfuscation by providing security against a malicious sender.", "citation": "Citations (157)", "year": "2011", "departments": ["University of California, Los Angeles", "Technion – Israel Institute of Technology", "University of California, Los Angeles", "Microsoft", "University of California, Los Angeles", "National Chiao Tung University", "National Chiao Tung University", "National Chiao Tung University", "Microsoft", "Technion – Israel Institute of Technology", "Princeton University", "University of California, Los Angeles", "Boeing Phantom Works", "Boeing Phantom Works", "Boeing Phantom Works", "RWTH Aachen University", "RWTH Aachen University", "RWTH Aachen University", "RWTH Aachen University", "University of Manchester", "University of Manchester", "University of Manchester", "University of Manchester", "Microsoft", "University of Illinois at Urbana–Champaign", "BULL S.A. (68,  ... uveciennes, FR)", "BULL S.A. (68,  ... uveciennes, FR)", "BULL S.A. (68,  ... uveciennes, FR)"], "conf": "focs", "authors": ["Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Hemanta K. Maji.....http://dblp.org/pers/hd/m/Maji:Hemanta_K="], "pages": 10}