{"title": "Multi-Perspective Linking of News Articles within a Repository.", "fields": ["data mining", "news analytics", "text processing", "granularity", "distinctive feature"], "abstract": "Given the number of online sources for news, the volumes of news generated are so daunting that gaining insight from these collections become impossible without some aid to link them. Semantic linking of news articles facilitates grouping of similar or relevant news stories together for ease of human consumption. For example, a political analyst may like to have a single view of all news articles that report visits of State heads of different countries to a single country to make an in-depth analytical report on the possible impacts of all associated events. It is likely that no news source links all the relevant news together. In this paper, we discuss a multi-resolution, multi-perspective news analysis system that can link news articles collected from diverse sources over a period of time. The distinctive feature of the proposed news linking system is its capability to simultaneously link news articles and stories at multiple levels of granularity. At the lowest level several articles reporting the same event are linked together. Higher level groupings are more contextual and semantic. We have deployed a range of algorithms that use statistical text processing and Natural Language Processing techniques. The system is incremental in nature and depicts how stories have evolved over time along with main actors and activities. It also illustrates how a single story diverges into multiple themes or multiple stories converge due to conceptual similarity. Accuracy of linking thematically and conceptually linked news articles are also presented.", "citation": "Citations (4)", "year": "2011", "departments": ["Tata Consultancy Services", "Tata Consultancy Services", "Tata Consultancy Services", "Tata Consultancy Services"], "conf": "ijcai", "authors": ["Arpit Khurdiya.....http://dblp.org/pers/hd/k/Khurdiya:Arpit", "Lipika Dey.....http://dblp.org/pers/hd/d/Dey:Lipika", "Nidhi Raj.....http://dblp.org/pers/hd/r/Raj:Nidhi", "S. K. Mirajul Haque.....http://dblp.org/pers/hd/h/Haque:S=_K=_Mirajul"], "pages": 6}