{"title": "Dynamic parallelization of JavaScript applications using an ultra-lightweight speculation mechanism.", "fields": ["unobtrusive javascript", "multithreading", "javascript", "speedup", "speculative execution"], "abstract": "As the web becomes the platform of choice for execution of more complex applications, a growing portion of computation is handed off by developers to the client side to reduce network traffic and improve application responsiveness. Therefore, the client-side component, often written in JavaScript, is becoming larger and more compute-intensive, increasing the demand for high performance JavaScript execution. This has led to many recent efforts to improve the performance of JavaScript engines in the web browsers. Furthermore, considering the wide-spread deployment of multi-cores in today's computing systems, exploiting parallelism in these applications is a promising approach to meet their performance requirement. However, JavaScript has traditionally been treated as a sequential language with no support for multithreading, limiting its potential to make use of the extra computing power in multicore systems. In this work, to exploit hardware concurrency while retaining traditional sequential programming model, we develop ParaScript, an automatic runtime parallelization system for JavaScript applications on the client's browser. First, we propose an optimistic runtime scheme for identifying parallelizable regions, generating the parallel code on-the-fly, and speculatively executing it. Second, we introduce an ultra-lightweight software speculation mechanism to manage parallel execution. This speculation engine consists of a selective checkpointing scheme and a novel runtime dependence detection mechanism based on reference counting and range-based array conflict detection. Our system is able to achieve an average of 2.18× speedup over the Firefox browser using 8 threads on commodity multi-core systems, while performing all required analyses and conflict detection dynamically at runtime.", "citation": "Citations (31)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Mojtaba Mehrara.....http://dblp.org/pers/hd/m/Mehrara:Mojtaba", "Po-Chun Hsu.....http://dblp.org/pers/hd/h/Hsu:Po=Chun", "Mehrzad Samadi.....http://dblp.org/pers/hd/s/Samadi:Mehrzad", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A="], "conf": "hpca", "year": "2011", "pages": 12}