{"title": "Complementary hashing for approximate nearest neighbor search.", "fields": ["linear hashing", "hopscotch hashing", "dynamic perfect hashing", "feature hashing", "open addressing"], "abstract": "Recently, hashing based Approximate Nearest Neighbor (ANN) techniques have been attracting lots of attention in computer vision. The data-dependent hashing methods, e.g., Spectral Hashing, expects better performance than the data-blind counterparts, e.g., Locality Sensitive Hashing (LSH). However, most data-dependent hashing methods only employ a single hash table. When higher recall is desired, they have to retrieve exponentially growing number of hash buckets around the bucket containing the query, which may drag down the precision rapidly. In this paper, we propose a so-called complementary hashing approach, which is able to balance the precision and recall in a more effective way. The key idea is to employ multiple complementary hash tables, which are learned sequentially in a boosting manner, so that, given a query, its true nearest neighbors missed from the active bucket of one hash table are more likely to be found in the active bucket of the next hash table. Compared with LSH that also can exploit multiple hash tables, our approach is more effective to find true NNs, thanks to the complementarity property of the hash tables from our approach. Experimental results on large scale ANN search show that the proposed method significantly improves the performance and outperforms the state-of-the-art.", "citation": "Citations (147)", "year": "2011", "departments": ["University of Science and Technology of China", "Microsoft Research Asia (China)", "Huawei", "Peking University", "Microsoft Research Asia (China)"], "conf": "iccv", "authors": ["Hao Xu.....http://dblp.org/pers/hd/x/Xu:Hao", "Jingdong Wang.....http://dblp.org/pers/hd/w/Wang:Jingdong", "Zhu Li.....http://dblp.org/pers/hd/l/Li:Zhu", "Gang Zeng.....http://dblp.org/pers/hd/z/Zeng:Gang", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng", "Nenghai Yu.....http://dblp.org/pers/hd/y/Yu:Nenghai"], "pages": 8}