{"title": "Anonymous communication with network coding against traffic analysis attack.", "fields": ["unicast", "network packet", "linear network coding", "encryption", "traffic analysis"], "abstract": "Flow untraceability is one critical requirement for anonymous communication with network coding, which prevents malicious attackers with wiretapping and traffic analysis abilities from relating the senders to the receivers, using linear dependency of the received packets. There have recently been proposals advocating encryptions on the Global Encoding Vectors (GEV) of network coding to thwart such attacks [1], [2]. Nevertheless, there has been no exploration of the capability of networking coding itself, to constitute more efficient and effective algorithms which guarantee anonymity. In this paper, we design a novel, simple, and effective linear network coding mechanism (ALNCode) to achieve flow untraceability in a communication network with multiple unicast flows. With solid theoretical analysis, we first show that linear network coding (LNC) can be applied to thwart traffic analysis attacks without the need of encrypting GEVs. Our key idea is to mix multiple flows at their intersection nodes by generating downstream GEVs from the common basis of upstream GEVs belonging to multiple flows, in order to hide the correlation of upstream and downstream GEVs in each flow. We then design a deterministic LNC scheme to implement our idea, by which the downstream GEVs produced are guaranteed to obfuscate their correlation with the corresponding upstream GEVs. We also give extensive theoretical analysis on the intersection probability of GEV bases and the influential factors to the effectiveness of our scheme, as well as the algorithm complexity to support its efficiency.", "citation": "Citations (21)", "departments": ["City University of Hong Kong", "City University of Hong Kong", "University of Hong Kong", "University of Puerto Rico at Mayagüez", "University of Science and Technology of China"], "authors": ["Jin Wang.....http://dblp.org/pers/hd/w/Wang_0009:Jin", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Kejie Lu.....http://dblp.org/pers/hd/l/Lu:Kejie", "Naijie Gu.....http://dblp.org/pers/hd/g/Gu:Naijie"], "conf": "infocom", "year": "2011", "pages": 9}