{"title": "An industrial case study on quality impact prediction for evolving service-oriented software.", "fields": ["reverse engineering", "performance prediction", "service orientation", "service oriented architecture", "process control"], "abstract": "Systematic decision support for architectural design decisions is a major concern for software architects of evolving service-oriented systems. In practice, architects often analyse the expected performance and reliability of design alternatives based on prototypes or former experience. Model-driven prediction methods claim to uncover the tradeoffs between different alternatives quantitatively while being more cost-effective and less error-prone. However, they often suffer from weak tool support and focus on single quality attributes. Furthermore, there is limited evidence on their effectiveness based on documented industrial case studies. Thus, we have applied a novel, model-driven prediction method called Q-ImPrESS on a large-scale process control system consisting of several million lines of code from the automation domain to evaluate its evolution scenarios. This paper reports our experiences with the method and lessons learned. Benefits of Q-ImPrESS are the good architectural decision support and comprehensive tool framework, while one drawback is the time-consuming data collection.", "citation": "Citations (16)", "departments": ["Ladenburg Thalmann", "Ladenburg Thalmann", "Ladenburg Thalmann", "Ladenburg Thalmann", "University of Paderborn"], "authors": ["Heiko Koziolek.....http://dblp.org/pers/hd/k/Koziolek:Heiko", "Bastian Schlich.....http://dblp.org/pers/hd/s/Schlich:Bastian", "Carlos G. Bilich.....http://dblp.org/pers/hd/b/Bilich:Carlos_G=", "Roland Weiss.....http://dblp.org/pers/hd/w/Weiss:Roland", "Steffen Becker.....http://dblp.org/pers/hd/b/Becker:Steffen", "Klaus Krogmann.....http://dblp.org/pers/hd/k/Krogmann:Klaus", "Mircea Trifu.....http://dblp.org/pers/hd/t/Trifu:Mircea", "Raffaela Mirandola.....http://dblp.org/pers/hd/m/Mirandola:Raffaela", "Anne Koziolek.....http://dblp.org/pers/hd/k/Koziolek:Anne"], "conf": "icse", "year": "2011", "pages": 10}