{"title": "Agnostic diagnosis: Discovering silent failures in wireless sensor networks.", "fields": ["network packet", "key distribution in wireless sensor networks", "wireless sensor network", "graph", "real time computing", "computer network", "network performance"], "abstract": "In wireless sensor networks (WSNs), diagnosis is a crucial and challenging task due to the distributed nature and stringent resources. Most previous approaches are supervised, relying on a-priori knowledge of network faults. On the other hand, our experience with GreenOrbs, a long-term large-scale WSN system, reveals the need of diagnosis in an agnostic manner. Specifically, in addition to predefined faults (i.e., with known types and symptoms), silent failures that are unknown beforehand, account for a large fraction of network performance degradation. Currently, there is no effective solution for silent failures because they are often diverse and highly system-related. In this paper, we propose Agnostic Diagnosis (AD), an online lightweight failure detection approach. AD is motivated by the fact that the system metrics (e.g., radio-on time, number of packets transmitted) of GreenOrbs sensors usually exhibit certain correlation patterns. Violations of such patterns indicate potential silent failures. We accordingly design a correlation graph, which systematically characterizes internal correlations inside a node. Silent failures are discovered by tracking the changes and anomalies of correlation graphs. We implement AD on a working WSN consisting of 330 nodes. Our experimental results demonstrate the advantages of AD to discover silent failures, effectively expanding the capacity and scope of WSN diagnosis.", "citation": "Citations (102)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Hong Kong", "Tsinghua University"], "authors": ["Xin Miao.....http://dblp.org/pers/hd/m/Miao:Xin", "Kebin Liu.....http://dblp.org/pers/hd/l/Liu:Kebin", "Yuan He.....http://dblp.org/pers/hd/h/He_0004:Yuan", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Dimitris Papadias.....http://dblp.org/pers/hd/p/Papadias:Dimitris"], "conf": "infocom", "year": "2011", "pages": 9}