{"title": "Just-in-Time Analytics on Large File Systems.", "fields": ["journaling file system", "torrent file", "file system fragmentation", "global namespace", "self certifying file system", "versioning file system"], "abstract": "As file systems reach the petabytes scale, users and administrators are increasingly interested in acquiring high-level analytical information for file management and analysis. Two particularly important tasks are the processing of aggregate and top-k queries which, unfortunately, cannot be quickly answered by hierarchical file systems such as ext3 and NTFS. Existing pre-processing based solutions, e.g., file system crawling and index building, consume a significant amount of time and space (for generating and maintaining the indexes) which in many cases cannot be justified by the infrequent usage of such solutions. In this paper, we advocate that user interests can often be sufficiently satisfied by approximate - i.e., statistically accurate - answers. We develop Glance, a just-in-time sampling-based system which, after consuming a small number of disk accesses, is capable of producing extremely accurate answers for a broad class of aggregate and top-k queries over a file system without the requirement of any prior knowledge. We use a number of real-world file systems to demonstrate the efficiency, accuracy and scalability of Glance.", "citation": "Citations (20)", "departments": ["George Washington University", "George Washington University", "George Washington University", "University of Texas at Arlington", "Johns Hopkins University", "George Washington University", "George Washington University", "University of Delaware", "University of Texas at Arlington", "Johns Hopkins University"], "authors": ["H. Howie Huang.....http://dblp.org/pers/hd/h/Huang:H=_Howie", "Nan Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Nan", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0082:Wei", "Gautam Das.....http://dblp.org/pers/hd/d/Das_0001:Gautam", "Alexander S. Szalay.....http://dblp.org/pers/hd/s/Szalay:Alexander_S="], "conf": "fast", "year": "2011", "pages": 14}