{"title": "Traffic-tracing gateway (TTG).", "fields": ["traffic congestion reconstruction with kerner s three phase theory", "traffic generation model", "default gateway", "evening", "call second"], "abstract": "Traffic density in wireless networks is time- and space-varying as users move from one area to another. For example, the majority of traffic stays in residential areas in the early morning and late evening; but moves to business or commercial areas in daytime. Therefore, it is challenging to efficiently locate base stations during network planning stage, due to the time-varying traffic distribution. Base stations vary from highly congested to seldom utilized depending on time. However, measurement studies show that the movement of the traffic density is highly predictable, and the traffic always travel along similar routes among different parts in a city or town during one day or over a week. Therefore, we introduce the traffic-tracing gateway (TTG), which acts as the base station that tracks the movement of the traffic. Given the traffic distribution of a period, we design an algorithm to determine the optimal trajectories of TTGs that can cover the maximum traffic. Our solution framework can optimally deploy TTGs in the congested areas to provide better coverage and relieve congestion. Our simulation studies based on realistic user mobility show that TTGs can result in significant improvement over fixed infrastructure based network across multiple metrics in multiple scenarios.", "citation": "Not cited", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["Haiping Liu.....http://dblp.org/pers/hd/l/Liu:Haiping", "Xiaoling Qiu.....http://dblp.org/pers/hd/q/Qiu:Xiaoling", "Dipak Ghosal.....http://dblp.org/pers/hd/g/Ghosal:Dipak", "Chen-Nee Chuah.....http://dblp.org/pers/hd/c/Chuah:Chen=Nee", "Xin Liu.....http://dblp.org/pers/hd/l/Liu_0002:Xin", "Yueyue Fan.....http://dblp.org/pers/hd/f/Fan:Yueyue"], "conf": "infocom", "year": "2011", "pages": 9}