{"title": "Cloud download: using cloud utilities to achieve high-quality content distribution for unpopular videos.", "fields": ["download", "internet traffic", "cache", "data rate units", "software deployment"], "abstract": "Video content distribution dominates the Internet traffic. The state-of-the-art techniques generally work well in distributing popular videos, but do not provide satisfactory content distribution service for unpopular videos due to low data health or low data transfer rate. In recent years, the worldwide deployment of cloud utilities provides us with a novel perspective to consider the above problem. We propose and implement the cloud download scheme, which achieves high-quality video content distribution by using cloud utilities to guarantee the data health and enhance the data transfer rate. Specifically, a user sends his video request to the cloud which subsequently downloads the video from the Internet and stores it in the cloud cache. Then the user can usually retrieve his requested video (whether popular or unpopular) from the cloud with high data rate in any place at any time, via the intra-cloud data transfer acceleration. Running logs of our real deployed commercial system (named VideoCloud) confirm the effectiveness and efficiency of cloud download. The users' average data transfer rate of unpopular videos exceeds 1.6 Mbps, and over 80% of the data transfer rates are more than 300 Kbps which is the basic playback rate of online videos. Our study provides practical experiences and valuable heuristics for making use of cloud utilities to achieve efficient Internet services.", "citation": "Citations (51)", "departments": ["Tencent", "Peking University", "Tencent", "Peking University"], "authors": ["Yan Huang.....http://dblp.org/pers/hd/h/Huang:Yan", "Zhenhua Li.....http://dblp.org/pers/hd/l/Li_0001:Zhenhua", "Gang Liu.....http://dblp.org/pers/hd/l/Liu:Gang", "Yafei Dai.....http://dblp.org/pers/hd/d/Dai:Yafei"], "conf": "mm", "year": "2011", "pages": 10}