{"title": "Auto-locating and fix-propagating for HTML validation errors to PHP server-side code.", "fields": ["client side scripting", "web application development", "static web page", "html", "web development"], "abstract": "Checking/correcting HTML validation errors in Web pages is helpful for Web developers in finding/fixing bugs. However, existing validating/fixing tools work well only on static HTML pages and do not help fix the corresponding server code if validation errors are found in HTML pages, due to several challenges with dynamically generated pages in Web development. We propose PhpSync, a novel automatic locating/fixing tool for HTML validation errors in PHP-based Web applications. Given an HTML page produced by a server-side PHP program, PhpSync uses Tidy, an HTML validating/correcting tool to find the validation errors in that HTML page. If errors are detected, it leverages the fixes from Tidy in the given HTML page and propagates them to the corresponding location(s) in PHP code. Our core solutions include 1) a symbolic execution algorithm on the given PHP program to produce a single tree-based model, called D-model, which approximately represents its possible client page outputs, 2) an algorithm mapping any text in the given HTML page to the text(s) in the node(s) of the D-model and then to the PHP code, and 3) a fix-propagating algorithm from the fixes in the HTML page to the PHP code via the D-model and the mapping algorithm. Our empirical evaluation shows that on average, PhpSync achieves 96.7% accuracy in locating the corresponding locations in PHP code from client pages, and 95% accuracy in propagating the fixes to the server-side code.", "citation": "Citations (26)", "departments": ["Iowa State University", "Iowa State University", "Iowa State University", "Iowa State University"], "authors": ["Hung Viet Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Hung_Viet", "Hoan Anh Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Hoan_Anh", "Tung Thanh Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tung_Thanh", "Tien N. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tien_N="], "conf": "kbse", "year": "2011", "pages": 10}