{"title": "Program transformations for asynchronous query submission.", "fields": ["program transformation", "web query classification", "query expansion", "sargable", "web search query"], "abstract": "Synchronous execution of queries or Web service requests forces the calling application to block until the query/request is satisfied. The performance of applications can be significantly improved by asynchronous submission of queries, which allows the application to perform other processing instead of blocking while the query is executed, and to concurrently issue multiple queries. Concurrent submission of multiple queries can allow the query execution engine to better utilize multiple processors and disks, and to reorder disk IO requests to minimize seeks. Concurrent submission also reduces the impact of network round-trip latency and delays at the database, when processing multiple queries. However, manually writing applications to exploit asynchronous query submission is tedious. In this paper we address the issue of automatically transforming a program written assuming synchronous query submission, to one that exploits asynchronous query submission. Our program transformation method is based on dataflow analysis and is framed as a set of transformation rules. Our rules can handle query executions within loops, unlike some of the earlier work in this area. We have built a tool that implements our transformation techniques on Java code that uses JDBC calls; our tool can be extended to handle Web service calls. We have carried out a detailed experimental study on several real-life applications rewritten using our transformation techniques. The experimental study shows the effectiveness of the proposed rewrite techniques, both in terms of their applicability and performance gains achieved.", "citation": "Citations (17)", "departments": ["Indian Institute of Technology Bombay", "Indian Institute of Technology, Hyderabad", "Indian Institute of Technology Bombay", "Indian Institute of Technology Bombay"], "authors": ["Mahendra Chavan.....http://dblp.org/pers/hd/c/Chavan:Mahendra", "Ravindra Guravannavar.....http://dblp.org/pers/hd/g/Guravannavar:Ravindra", "Karthik Ramachandra.....http://dblp.org/pers/hd/r/Ramachandra_0002:Karthik", "S. Sudarshan.....http://dblp.org/pers/hd/s/Sudarshan_0001:S="], "conf": "icde", "year": "2011", "pages": 12}