{"title": "MUSIZ: a generic framework for music resizing with stretching and cropping.", "fields": ["fold", "cropping", "animation", "smoothing", "resizing"], "abstract": "Content-aware music adaption, i.e. music resizing, in temporal constraints starts drawing attention from multimedia communities because of the need of real-world scenarios, e.g. animation production and radio advertisement production. The goal of music resizing is to change the length of a music track to a user preferred length using a series of basic operations, e.g. compression, prolonging, cropping and repeating. The only existing music resizing approach so far, called LyDAR, suffers from some limitations. For example, it cannot support prolonging a music track and cannot compress music pieces with very small stretch rates. In this paper, we propose MUSIZ, a generic framework for MUsic reSIZing. Observing the diversity of quality degradation for different segments, we propose the concept of stretch-resistance to measure the degree of quality degradation after a segment is stretched. MUSIZ stretches high stretch-resistance segments intensively and relieves low stretch-resistance segments to reduce the negative impact on the stretched music piece. For short length resizing requests, we develop a contiguity-preservative cropping algorithm to remove segments before stretching, while smoothing the abrupt change at the joint between two segments. Comprehensive experimental results show that MUSIZ is superior to the existing approaches.", "citation": "Citations (5)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Zhang Liu.....http://dblp.org/pers/hd/l/Liu:Zhang", "Chaokun Wang.....http://dblp.org/pers/hd/w/Wang:Chaokun", "Yiyuan Bai.....http://dblp.org/pers/hd/b/Bai:Yiyuan", "Hao Wang.....http://dblp.org/pers/hd/w/Wang:Hao", "Jianmin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianmin"], "conf": "mm", "year": "2011", "pages": 10}