{"title": "Statistical behavior of embeddedness and communities of overlapping cliques in online social networks.", "fields": ["network model", "evolving networks", "hierarchical network model", "degree distribution", "embeddedness"], "abstract": "Degree distribution of nodes, especially a power law degree distribution, has been regarded as one of the most significant structural characteristics of social and information networks. Node degree, however, only discloses the first-order structure of a network. Higher-order structures such as the edge embeddedness and the size of communities may play more important roles in many online social networks. In this paper, we provide empirical evidence on the existence of rich higher-order structural characteristics in online social networks, develop mathematical models to interpret and model these characteristics, and discuss their various applications in practice. In particular, 1) We show that the embeddedness distribution of links in social networks has interesting and rich behavior that cannot be captured by well-known network models. 2) We formally prove that random k-tree, a recent model for complex networks, has a power law embeddedness distribution, and show empirically that the random k-tree model can be used to capture the rich behavior of higherorder structures we observed in real-world social network. 3) Going beyond the embeddedness, we show that a variant of the random k-tree model can be used to capture the power law distribution of the size of communities of overlapping cliques discovered recently.", "citation": "Citations (9)", "departments": ["University of Victoria", "University of British Columbia", "University of Victoria", "University of British Columbia"], "authors": ["Ajay Sridharan.....http://dblp.org/pers/hd/s/Sridharan:Ajay", "Yong Gao.....http://dblp.org/pers/hd/g/Gao_0001:Yong", "Kui Wu.....http://dblp.org/pers/hd/w/Wu_0001:Kui", "James Nastos.....http://dblp.org/pers/hd/n/Nastos:James"], "conf": "infocom", "year": "2011", "pages": 5}