{"title": "Efficient data streaming with on-chip accelerators: Opportunities and challenges.", "fields": ["scalability", "streams", "data stream mining", "power budget", "data access"], "abstract": "The transistor density of microprocessors continues to increase as technology scales. Microprocessors designers have taken advantage of the increased transistors by integrating a significant number of cores onto a single die. However, a large number of cores are met with diminishing returns due to software and hardware scalability issues and hence designers have started integrating on-chip special-purpose logic units (i.e., accelerators) that were previously available as PCI-attached units. It is anticipated that more accelerators will be integrated on-chip due to the increasing abundance of transistors and the fact that not all logic can be powered at all times due to power budget limits. Thus, on-chip accelerator architectures deserve more attention from the research community. There is a wide spectrum of research opportunities for design and optimization of accelerators. This paper attempts to bring out some insights by studying the data access streams of on-chip accelerators that hopefully foster some future research in this area. Specifically, this paper uses a few simple case studies to show some of the common characteristics of the data streams introduced by on-chip accelerators, discusses challenges and opportunities in exploiting these characteristics to optimize the power and performance of accelerators, and then analyzes the effectiveness of some simple optimizing extensions proposed.", "citation": "Citations (24)", "departments": ["IBM", "Chinese Academy of Sciences", "IBM", "IBM", "IBM"], "authors": ["Rui Hou.....http://dblp.org/pers/hd/h/Hou:Rui", "Lixin Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Lixin", "Michael C. Huang.....http://dblp.org/pers/hd/h/Huang:Michael_C=", "Kun Wang.....http://dblp.org/pers/hd/w/Wang:Kun", "Hubertus Franke.....http://dblp.org/pers/hd/f/Franke:Hubertus", "Yi Ge.....http://dblp.org/pers/hd/g/Ge:Yi", "Xiaotao Chang.....http://dblp.org/pers/hd/c/Chang:Xiaotao"], "conf": "hpca", "year": "2011", "pages": 9}