{"title": "An empirical evaluation of battery power consumption for streaming data transmission to mobile devices.", "fields": ["battery", "real time streaming protocol", "traffic shaping", "upload", "mobile device"], "abstract": "Internet streaming applications are becoming increasingly popular on mobile devices. However, receiving streaming services on mobile devices is often constrained by their limited battery power supply. Various techniques have been proposed to save battery power consumption on mobile devices, mainly focusing on how much data to transmit and how to transmit.   In this paper, we conduct an experiment-based study with 11 Internet streaming applications using different streaming protocols. Our goal is to empirically investigate the battery power consumption on the wireless network interface for receiving streaming data via different approaches. Through measurement and analysis, we find that (1) the Chunk-based streaming is widely used in practice and it is most power-efficient because the traffic shaping technique is adopted to utilize PSM on mobile devices to save battery power consumption; however, it may cause quality degradation from time to time; (2) reducing streaming data transmission (by switching to a lower streaming quality) can marginally help save battery power consumption in RTSP, Pseudo streaming, and Chunk-based streaming applications; but it is effective for P2P streaming applications; (3) P2P streaming to mobile devices is not power-efficient because of the additional transmission of control traffic and uploading traffic; and reducing upload alone does not help for battery power saving. Our investigation provides new insights and some guidelines for the current Internet mobile streaming services and calls for further research on more power-efficient and scalable Internet mobile streaming protocols.", "citation": "Citations (35)", "departments": ["George Mason University", "Microsoft", "George Mason University", "George Mason University"], "authors": ["Yao Liu.....http://dblp.org/pers/hd/l/Liu_0001:Yao", "Lei Guo.....http://dblp.org/pers/hd/g/Guo_0004:Lei", "Fei Li.....http://dblp.org/pers/hd/l/Li_0001:Fei", "Songqing Chen.....http://dblp.org/pers/hd/c/Chen:Songqing"], "conf": "mm", "year": "2011", "pages": 10}