{"title": "Improving the realism in motion-based driving simulators by adapting tilt-translation technique to human perception.", "fields": ["acceleration", "driving simulator", "perception", "vehicle dynamics", "simulation"], "abstract": "While modern dynamic driving simulators equipped with six degrees-of-freedom (6-DOF) hexapods and X-Y platforms have improved realism, mechanical limitations prevent them from offering a fully realistic driving experience. Solutions are often sought in the ”washout” algorithm, with linear accelerations simulated by an empirically chosen combination of translation and tilt-coordination, based on the incapacity of otolith organs to distinguish between inclination of the head and linear acceleration. In this study, we investigated the most effective combination of tilt and translation to provide a realistic perception of movement. We tested 3 different braking intensities (deceleration), each with 5 inverse proportional tilt/translation ratios. Subjects evaluated braking intensity using an indirect method corresponding to a 2-Alternative-Forced-Choice Paradigm. We find that perceived intensity of braking depends on the tilt/translation ratio used: for small and average decelerations (0.6 and 1.0m/s 2 ), increased tilt yielded an increased overestimation of braking, inverse proportionally with intensity; for high decelerations (1.4m/s 2 ), on half the conditions braking was overestimated with more tilt than translation and underestimated with more translation than tilt. We define a mathematical function describing the relationship between tilt, translation and the desired level of deceleration, intended as a supplement to motion cueing algorithms, that should improve the realism of driving simulations.", "citation": "Citations (3)", "departments": ["Aix-Marseille University", "Aix-Marseille University", "PSA Peugeot-Cit ...  Velizy, France", "PSA Peugeot-Cit ...  Velizy, France"], "authors": ["Anca Stratulat.....http://dblp.org/pers/hd/s/Stratulat:Anca", "Vincent Roussarie.....http://dblp.org/pers/hd/r/Roussarie:Vincent", "Jean-Louis Vercher.....http://dblp.org/pers/hd/v/Vercher:Jean=Louis", "Christophe Bourdin.....http://dblp.org/pers/hd/b/Bourdin:Christophe"], "conf": "vr", "year": "2011", "pages": 4}