{"title": "Throughput and delay analysis of hybrid wireless networks with multi-hop uplinks.", "fields": ["bounded function", "end to end delay", "telecommunications link", "cellular architecture", "hop"], "abstract": "How much information can one send through a random ad hoc network of n nodes, if overlaid with a cellular architecture of m base stations? This network model is commonly referred to as hybrid wireless networks and our paper analyzes the above question by characterizing its throughput capacity. Although several research efforts related to throughput capacity exist in the area of hybrid wireless networks, most of these solutions under-explore the capacity analysis. Their results particularly indicate that one can realize only a less than log or no gain on capacity, as compared to pure ad hoc networks, when ?? scales slower than some threshold. This unsatisfying capacity gain is due to the fact that the base stations were not properly exploited while formulating the capacity analysis. Moreover, these research efforts also assume an one-hop wireless uplink between a node and its associated base station. Nevertheless, with those power-constrained wireless nodes, this assumption clearly indicates an unrealistic scenario. In this paper, we establish the bounds on capacity and delay by resolving the issues in existing efforts and at the heart of our analysis lies a simple routing policy known as same cell routing policy. Our findings particularly stipulate that whether m = O(n over log n) or Ω(n over log n), each node can realize a throughput that scales, sublinearly or linearly, with m. This is in fact a significant result as opposed to previous efforts which claims that if m grows slower than some threshold, the benefit of augmenting those base stations to the original ad hoc network is insignificant. Our analysis also shows that for a maximum per node throughput Λ(n,m), the average end-to-end delay in a hybrid network can be bounded by Θ(Λ(n,m)n over m), which has an inverse relationship to m.", "citation": "Citations (40)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology"], "authors": ["Devu Manikantan Shila.....http://dblp.org/pers/hd/s/Shila:Devu_Manikantan", "Yu Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Yu", "Tricha Anjali.....http://dblp.org/pers/hd/a/Anjali:Tricha"], "conf": "infocom", "year": "2011", "pages": 9}