{"title": "Scalable implementations of accurate excited-state coupled cluster theories: application of high-level methods to porphyrin-based systems.", "fields": ["cray xt5", "coupled cluster", "excited state", "parallel algorithm", "scalability"], "abstract": "The development of reliable tools for excited-state simulations is very important for understanding complex processes in the broad class of light harvesting systems and optoelectronic devices. Over the last years we have been developing equation of motion coupled cluster (EOMCC) methods capable of tackling these problems. In this paper we discuss the parallel performance of EOMCC codes which provide accurate description of excited-state correlation effects. Two aspects are discussed in detail: (1) a new algorithm for the iterative EOMCC methods based on improved parallel task scheduling algorithms, and (2) parallel algorithms for the non-iterative methods describing the effect of triply excited configurations. We demonstrate that the most computationally intensive non-iterative part can take advantage of 210,000 cores of the Cray XT5 system at the Oak Ridge Leadership Computing Facility (OLCF), achieving over 80% parallel efficiency. In particular, we demonstrate the importance of the computationally demanding non-iterative many-body methods in matching experimental level of accuracy for several porphyrin-based systems.", "citation": "Citations (17)", "departments": ["Environmental Molecular Sciences Laboratory", "Pacific Northwest National Laboratory", "Cray", "Oak Ridge National Laboratory", "Oak Ridge National Laboratory"], "authors": ["Karol Kowalski.....http://dblp.org/pers/hd/k/Kowalski:Karol", "Sriram Krishnamoorthy.....http://dblp.org/pers/hd/k/Krishnamoorthy:Sriram", "Ryan M. Olson.....http://dblp.org/pers/hd/o/Olson:Ryan_M=", "Vinod Tipparaju.....http://dblp.org/pers/hd/t/Tipparaju:Vinod", "Edoardo Aprà.....http://dblp.org/pers/hd/a/Apr=agrave=:Edoardo"], "conf": "sc", "year": "2011", "pages": 10}