{"title": "Extracting ultra-scale Lattice Boltzmann performance via hierarchical and distributed auto-tuning.", "fields": ["grid computing", "multithreading", "posix threads", "thread", "simd"], "abstract": "We are witnessing a rapid evolution of HPC node architectures and on-chip parallelism as power and cooling constraints limit increases in microprocessor clock speeds. In this work, we demonstrate a hierarchical approach towards effectively extracting performance for a variety of emerging multicore-based supercomputing platforms. Our examined application is a structured grid-based Lattice Boltzmann computation that simulates homogeneous isotropic turbulence in magnetohydrodynamics. First, we examine sophisticated sequential auto-tuning techniques including loop transformations, virtual vectorization, and use of ISA-specific intrinsics. Next, we present a variety of parallel optimization approaches including programming model exploration (flat MPI, MPI/OpenMP, and MPI/Pthreads), as well as data and thread decomposition strategies designed to mitigate communication bottlenecks. Finally, we evaluate the impact of our hierarchical tuning techniques using a variety of problem sizes via large-scale simulations on state-of-the-art Cray XT4, Cray XE6, and IBM BlueGene/P platforms. Results show that our unique tuning approach improves performance and energy requirements by up to 3.4× using 49,152 cores, while providing a portable optimization methodology for a variety of numerical methods on forthcoming HPC systems.", "citation": "Citations (26)", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory"], "authors": ["Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid", "Jonathan Carter.....http://dblp.org/pers/hd/c/Carter:Jonathan", "John Shalf.....http://dblp.org/pers/hd/s/Shalf:John"], "conf": "sc", "year": "2011", "pages": 12}