{"title": "Diffuse reflectance imaging with astronomical applications.", "fields": ["diffuse reflection", "radiance", "sextant", "albedo", "visibility"], "abstract": "Diffuse objects generally tell us little about the surrounding lighting, since the radiance they reflect blurs together incident lighting from many directions. In this paper we discuss how occlusion geometry can help invert diffuse reflectance to recover lighting or surface albedo. Self-occlusion in the scene can be regarded as a form of coding, creating high frequencies that improve the conditioning of diffuse light transport. Our analysis builds on a basic observation that diffuse reflectors with sufficiently detailed geometry can fully resolve the incident lighting. Using a Bayesian framework, we propose a novel reconstruction method based on high-resolution photography, taking advantage of visibility changes near occlusion boundaries. We also explore the limits of single-pixel observations as the diffuse reflector (and potentially the lighting) vary over time. Diffuse reflectance imaging is particularly relevant for astronomy applications, where diffuse reflectors arise naturally but the incident lighting and camera position cannot be controlled. To test our approaches, we first study the feasibility of using the moon as a diffuse reflector to observe the earth as seen from space. Next we present a reconstruction of Mars using historical photometry measurements not previously used for this purpose. As our results suggest, diffuse reflectance imaging expands our notion of what can qualify as a camera.", "citation": "Citations (7)", "year": "2011", "departments": ["Weizmann Institute of Science", "Massachusetts Institute of Technology", "TTIC, USA", "Big Bear Solar  ... bservatory, USA"], "conf": "iccv", "authors": ["Samuel W. Hasinoff.....http://dblp.org/pers/hd/h/Hasinoff:Samuel_W=", "Anat Levin.....http://dblp.org/pers/hd/l/Levin:Anat", "Philip R. Goode.....http://dblp.org/pers/hd/g/Goode:Philip_R=", "William T. Freeman.....http://dblp.org/pers/hd/f/Freeman:William_T="], "pages": 8}