{"title": "SciHadoop: array-based query processing in Hadoop.", "fields": ["data set", "query optimization", "logical data model", "netcdf", "byte"], "abstract": "Hadoop has become the de facto platform for large-scale data analysis in commercial applications, and increasingly so in scientific applications. However, Hadoop's byte stream data model causes inefficiencies when used to process scientific data that is commonly stored in highly-structured, array-based binary file formats resulting in limited scalability of Hadoop applications in science. We introduce Sci-Hadoop, a Hadoop plugin allowing scientists to specify logical queries over array-based data models. Sci-Hadoop executes queries as map/reduce programs defined over the logical data model. We describe the implementation of a Sci-Hadoop prototype for NetCDF data sets and quantify the performance of five separate optimizations that address the following goals for several representative aggregate queries: reduce total data transfers, reduce remote reads, and reduce unnecessary reads. Two optimizations allow holistic aggregate queries to be evaluated opportunistically during the map phase; two additional optimizations intelligently partition input data to increase read locality, and one optimization avoids block scans by examining the data dependencies of an executing query to prune input partitions. Experiments involving a holistic function show run-time improvements of up to 8x, with drastic reductions of IO, both locally and over the network.", "citation": "Citations (123)", "departments": ["University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz"], "authors": ["Joe B. Buck.....http://dblp.org/pers/hd/b/Buck:Joe_B=", "Noah Watkins.....http://dblp.org/pers/hd/w/Watkins:Noah", "Jeff LeFevre.....http://dblp.org/pers/hd/l/LeFevre:Jeff", "Kleoni Ioannidou.....http://dblp.org/pers/hd/i/Ioannidou:Kleoni", "Carlos Maltzahn.....http://dblp.org/pers/hd/m/Maltzahn:Carlos", "Neoklis Polyzotis.....http://dblp.org/pers/hd/p/Polyzotis:Neoklis", "Scott A. Brandt.....http://dblp.org/pers/hd/b/Brandt:Scott_A="], "conf": "sc", "year": "2011", "pages": 11}