{"title": "Universal and robust distributed network codes.", "fields": ["node", "distributed algorithm", "schwartz zippel lemma", "linear network coding", "linear code"], "abstract": "Random linear network codes can be designed and implemented in a distributed manner, with low computational complexity. However, these codes are classically implemented [1] over finite fields whose size depends on some global network parameters (size of the network, the number of sinks) that may be unknown prior to code design. Also, the entire network code may have to be redesigned when a new node joins. In this work, we present the first universal and robust distributed linear network coding schemes. Our schemes are universal since they are independent of all network parameters. They are robust since in case nodes join or leave, the remaining nodes do not need to change their coding operations and the receivers can still decode. They are distributed since nodes need only have topological information about the part of the network upstream of them, which can be naturally streamed as part of the communication protocol. We present both probabilistic and deterministic schemes that are all asymptotically rate-optimal in the coding block-length, and have guarantees of correctness. Our probabilistic designs are computationally efficient, with order-optimal complexity. Our deterministic designs guarantee zero error decoding, albeit via codes with high computational complexity in general. Our coding schemes are based on network codes over “scalable fields”. Instead of choosing coding coefficients from one field at every node as in [1], each node uses linear coding operations over an “effective field-size” which depends on the node's distance from the source node. The analysis of our schemes requires technical tools that may be of independent interest. In particular, we generalize the Schwartz-Zippel lemma [2] by proving a nonuniform version, wherein variables are chosen from sets of possibly different sizes. We also provide a novel robust distributed algorithm to assign unique IDs to network nodes.", "citation": "Citations (5)", "departments": ["California Institute of Technology", "The Chinese University of Hong Kong", "California Institute of Technology", "The Chinese University of Hong Kong"], "authors": ["Tracey Ho.....http://dblp.org/pers/hd/h/Ho:Tracey", "Sidharth Jaggi.....http://dblp.org/pers/hd/j/Jaggi:Sidharth", "Svitlana Vyetrenko.....http://dblp.org/pers/hd/v/Vyetrenko:Svitlana", "Lingxiao Xia.....http://dblp.org/pers/hd/x/Xia:Lingxiao"], "conf": "infocom", "year": "2011", "pages": 9}