{"title": "Optimizing information credibility in social swarming applications.", "fields": ["heuristic", "discrete optimization", "credibility", "stochastic optimization", "swarming", "stochastic programming"], "abstract": "With the advent of smartphone technology, it has become possible to conceive of entirely new classes of applications. Social swarming, in which users armed with smartphones are directed by a central director to report on events in the physical world, has several real-world applications. In this paper, we focus on the following problem: how does the director optimize the selection of reporters to deliver credible corroborating information about an event? We first propose a model, based on common intuitions of believability, about the credibility of information. We then cast the problem as a discrete optimization problem, and introduce optimal centralized solutions and an approximate solution amenable to decentralized implementation whose performance is about 20% off on average from the optimal while being 3 orders of magnitude more computationally efficient. More interesting, a time-averaged version of the problem is amenable to a novel stochastic utility optimization formulation, and can be solved optimally, while in some cases yielding decentralized solutions.", "citation": "Citations (20)", "departments": ["University of Southern California", "City University of New York", "City University of New York", "University of Southern California", "University of Southern California", "University of Southern California", "City University of New York", "Brooklyn College", "University of Southern California", "University of Southern California"], "authors": ["Bin Liu.....http://dblp.org/pers/hd/l/Liu_0004:Bin", "Peter Terlecky.....http://dblp.org/pers/hd/t/Terlecky:Peter", "Amotz Bar-Noy.....http://dblp.org/pers/hd/b/Bar=Noy:Amotz", "Ramesh Govindan.....http://dblp.org/pers/hd/g/Govindan:Ramesh", "Michael J. Neely.....http://dblp.org/pers/hd/n/Neely:Michael_J="], "conf": "infocom", "year": "2011", "pages": 5}