{"title": "Cost Effective Storage using Extent Based Dynamic Tiering.", "fields": ["unit cost", "capital cost", "operating cost", "dynamic demand", "leverage"], "abstract": "Multi-tier systems that combine SSDs with SAS/FC and/or SATA disks mitigate the capital cost burden of SSDs, while benefiting from their superior I/O performance per unit cost and low power. Though commercial SSD-based multi-tier solutions are available, configuring such a system with the optimal number of devices per tier to achieve performance goals at minimum cost remains a challenge. Furthermore, these solutions do not leverage the opportunity to dynamically consolidate load and reduce power/operating cost.\n\nOur extent-based dynamic tiering solution, EDT, addresses these limitations via two key components of its design. A Configuration Adviser EDT-CA determines the adequate mix of storage devices to buy and install to satisfy a given workload at minimum cost, and a Dynamic Tier Manager EDT-DTM performs dynamic extent placement once the system is running to satisfy performance requirements while minimizing dynamic power consumption. Key to the cost minimization of EDT-CA is its ability to simulate the dynamic extent placement afforded by EDT-DTM. Key to the overall effectiveness of EDT-DTM is its ability to consolidate load within tiers when feasible, rapidly respond to unexpected changes in the workload, and carefully control the overhead due to extent migration. Our results using production workloads show that EDT incurs lower capital and operating cost, consumes less power, and delivers similar or better performance relative to SAS-only storage systems as well as other simpler approaches to extent-based tiering.", "citation": "Citations (176)", "departments": ["Florida International University", "IBM", "IBM", "IBM", "Florida International University"], "authors": ["Jorge Guerra.....http://dblp.org/pers/hd/g/Guerra:Jorge", "Himabindu Pucha.....http://dblp.org/pers/hd/p/Pucha:Himabindu", "Joseph S. Glider.....http://dblp.org/pers/hd/g/Glider:Joseph_S=", "Wendy Belluomini.....http://dblp.org/pers/hd/b/Belluomini:Wendy", "Raju Rangaswami.....http://dblp.org/pers/hd/r/Rangaswami:Raju"], "conf": "fast", "year": "2011", "pages": 14}