{"title": "TLSync: support for multiple fast barriers using on-chip transmission lines.", "fields": ["latency", "broadcasting", "multi core processor", "thread", "low latency"], "abstract": "As the number of cores on a single-chip grows, scalable barrier synchronization becomes increasingly difficult to implement. In software implementations, such as the tournament barrier, a larger number of cores results in a longer latency for each round and a larger number of rounds. Hardware barrier implementations require significant dedicated wiring, e.g., using a reduction (arrival) tree and a notification (release) tree, and multiple instances of this wiring are needed to support multiple barriers (e.g., when concurrently executing multiple parallel applications).   This paper presents TLSync, a novel hardware barrier implementation that uses the high-frequency part of the spectrum in a transmission-line broadcast network, thus leaving the transmission line network free for non-modulated (baseband) data transmission. In contrast to other implementations of hardware barriers, TLSync allows multiple thread groups to each have its own barrier. This is accomplished by allocating different bands in the radio-frequency spectrum to different groups. Our circuit-level and electromagnetic models show that the worst-case latency for a TLSync barrier is 4ns to 10ns, depending on the size of the frequency band allocated to each group, and our cycle-accurate architectural simulations show that low-latency TLSync barriers provide significant performance and scalability benefits to barrier-intensive applications.", "citation": "Citations (30)", "year": "2011", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "isca", "authors": ["Jungju Oh.....http://dblp.org/pers/hd/o/Oh:Jungju", "Milos Prvulovic.....http://dblp.org/pers/hd/p/Prvulovic:Milos", "Alenka G. Zajic.....http://dblp.org/pers/hd/z/Zajic:Alenka_G="], "pages": 12}