{"title": "Modeling social strength in social media community via kernel-based learning.", "fields": ["learning to rank", "social computing", "social heuristics", "social behavior", "interpersonal ties"], "abstract": "Modeling continuous social strength rather than conventional binary social ties in the social network can lead to a more precise and informative description of social relationship among people. In this paper, we study the problem of social strength modeling (SSM) for the users in a social media community, who are typically associated with diverse form of data. In particular, we take Flickr---the most popular online photo sharing community---as an example, in which users are sharing their experiences through substantial amounts of multimodal contents (e.g., photos, tags, geo-locations, friend lists) and social behaviors (e.g., commenting and joining interest groups). Such heterogeneous data in Flickr bring opportunities yet challenges to the research community for SSM. One of the key issues in SSM is how to effectively explore the heterogeneous data and how to optimally combine them to measure the social strength. In this paper, we present a kernel-based learning to rank framework for inferring the social strength of Flickr users, which involves two learning stages. The first stage employs a kernel target alignment algorithm to integrate the heterogeneous data into a holistic similarity space. With the learned kernel, the second stage rectifies the pair-wise learning to rank approach to estimating the social strength. By learning the social strength graph, we are able to conduct collaborative recommendation and collective classification. The promising results show that the learning-based approach is effective for SSM. Despite being focused on Flickr, our technique can be applied to model social strength of users in any other social media community.", "citation": "Citations (58)", "departments": ["Nanyang Technological University", "Microsoft", "Nanyang Technological University", "Microsoft", "Microsoft"], "authors": ["Jinfeng Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Jinfeng", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2011", "pages": 10}