{"title": "Copperhead: compiling an embedded data parallel language.", "fields": ["parallel language", "source lines of code", "cuda", "data parallelism", "python"], "abstract": "Modern parallel microprocessors deliver high performance on applications that expose substantial fine-grained data parallelism. Although data parallelism is widely available in many computations, implementing data parallel algorithms in low-level languages is often an unnecessarily difficult task. The characteristics of parallel microprocessors and the limitations of current programming methodologies motivate our design of Copperhead, a high-level data parallel language embedded in Python. The Copperhead programmer describes parallel computations via composition of familiar data parallel primitives supporting both flat and nested data parallel computation on arrays of data. Copperhead programs are expressed in a subset of the widely used Python programming language and interoperate with standard Python modules, including libraries for numeric computation, data visualization, and analysis. In this paper, we discuss the language, compiler, and runtime features that enable Copperhead to efficiently execute data parallel code. We define the restricted subset of Python which Copperhead supports and introduce the program analysis techniques necessary for compiling Copperhead code into efficient low-level implementations. We also outline the runtime support by which Copperhead programs interoperate with standard Python modules. We demonstrate the effectiveness of our techniques with several examples targeting the CUDA platform for parallel programming on GPUs. Copperhead code is concise, on average requiring 3.6 times fewer lines of code than CUDA, and the compiler generates efficient code, yielding 45-100% of the performance of hand-crafted, well optimized CUDA code.", "citation": "Citations (213)", "year": "2011", "departments": ["University of California, Berkeley", "Nvidia", "University of California, Berkeley"], "conf": "ppopp", "authors": ["Bryan Catanzaro.....http://dblp.org/pers/hd/c/Catanzaro:Bryan", "Michael Garland.....http://dblp.org/pers/hd/g/Garland:Michael", "Kurt Keutzer.....http://dblp.org/pers/hd/k/Keutzer:Kurt"], "pages": 10}