{"title": "1/", "fields": ["response evaluation criteria in solid tumors", "perovskite solar cell", "sonidegib", "distinct population segment", "effective population size", "impaired fasting glucose", "variant call format", "nivolumab", "gestational diabetes", "lag3", "wahlund effect", "methylammonium lead halide", "absorption", "genome wide association study", "immunodeficiency", "sequential decoding", "pembrolizumab", "clinical endpoint", "type 1 diabetes", "trihalide", "bcjr algorithm", "turbo equalizer", "confusion", "pre exposure prophylaxis", "serodiscordant", "electron hole", "serial concatenated convolutional codes", "immune related response criteria", "f statistics", "human genetic variation", "hptn 052", "impaired glucose tolerance", "microsatellite enrichment", "1000 genomes project", "caprisa 004", "pidilizumab", "imputation", "ipilimumab", "insulin resistance", "concatenated error correction code"], "abstract": "Abstract   Background  Assessment of the change in tumour burden is an important feature of the clinical evaluation of cancer therapeutics: both tumour shrinkage (objective response) and disease progression are useful endpoints in clinical trials. Since RECIST was published in 2000, many investigators, cooperative groups, industry and government authorities have adopted these criteria in the assessment of treatment outcomes. However, a number of questions and issues have arisen which have led to the development of a revised RECIST guideline (version 1.1). Evidence for changes, summarised in separate papers in this special issue, has come from assessment of a large data warehouse (>6500 patients), simulation studies and literature reviews.    Highlights of revised RECIST 1.1  Major changes include:  Number   of   lesions   to   be   assessed : based on evidence from numerous trial databases merged into a data warehouse for analysis purposes, the number of lesions required to assess tumour burden for response determination has been reduced from a maximum of 10 to a maximum of five total (and from five to two per organ, maximum).  Assessment   of   pathological   lymph  nodes is now incorporated: nodes with a  short  axis of ⩾15 mm are considered measurable and assessable as target lesions. The short axis measurement should be included in the sum of lesions in calculation of tumour response. Nodes that shrink to  Confirmation   of   response  is required for trials with response primary endpoint but is no longer required in randomised studies since the control arm serves as appropriate means of interpretation of data.  Disease   progression  is clarified in several aspects: in addition to the previous definition of progression in target disease of 20% increase in sum, a 5 mm absolute increase is now required as well to guard against over calling PD when the total sum is very small. Furthermore, there is guidance offered on what constitutes ‘unequivocal progression’ of non-measurable/non-target disease, a source of confusion in the original RECIST guideline. Finally, a section on detection of new lesions, including the interpretation of FDG-PET scan assessment is included.  Imaging   guidance : the revised RECIST includes a new imaging appendix with updated recommendations on the optimal anatomical assessment of lesions.    Future work  A key question considered by the RECIST Working Group in developing RECIST 1.1 was whether it was appropriate to move from anatomic unidimensional assessment of tumour burden to either volumetric anatomical assessment or to functional assessment with PET or MRI. It was concluded that, at present, there is not sufficient standardisation or evidence to abandon anatomical assessment of tumour burden. The only exception to this is in the use of FDG-PET imaging as an adjunct to determination of progression. As is detailed in the final paper in this special issue, the use of these promising newer approaches requires appropriate clinical validation studies.", "citation": "Citations (11,644)", "departments": ["Queen's University", "GlaxoSmithKline", "European Organisation for Research and Treatment of Cancer", "Memorial Sloan Kettering Cancer Center", "Mayo Clinic", "University of North Carolina at Chapel Hill", "Fred Hutchinson Cancer Research Center", "FHI 360", "FHI 360", "Johns Hopkins University", "Harvard University", "Johns Hopkins University", "Yale University", "University of Michigan", "Harvard University", "Wellcome Trust Sanger Institute", "University of Michigan", "Illumina", "Johns Hopkins University", "University of Oxford", "University of Oxford", "Istituto Italiano di Tecnologia", "University of Oxford", "Istituto Italiano di Tecnologia", "École Normale Supérieure", "École Normale Supérieure", "École Normale Supérieure", "Newcastle University", "University of Montpellier", "University of Montpellier", "UNC Project", "International D ... ield, Australia"], "authors": ["Amos Beimel.....http://dblp.org/pers/hd/b/Beimel:Amos", "Yehuda Lindell.....http://dblp.org/pers/hd/l/Lindell:Yehuda", "Eran Omri.....http://dblp.org/pers/hd/o/Omri:Eran", "Ilan Orlov.....http://dblp.org/pers/hd/o/Orlov:Ilan"], "conf": "crypto", "year": "2011", "pages": 20}