{"title": "Knowledge transfer with low-quality data: A feature extraction issue.", "fields": ["synthetic data", "transfer of learning", "external data representation", "data cluster", "subspace topology", "neural coding", "knowledge transfer", "sparse approximation"], "abstract": "Effectively utilizing readily available auxiliary data to improve predictive performance on new modeling tasks is a key problem in data mining. In this research, the goal is to transfer knowledge between sources of data, particularly when ground-truth information for the new modeling task is scarce or is expensive to collect where leveraging any auxiliary sources of data becomes a necessity. Toward seamless knowledge transfer among tasks, effective representation of the data is a critical but yet not fully explored research area for the data engineer and data miner. Here, we present a technique based on the idea of sparse coding, which essentially attempts to find an embedding for the data by assigning feature values based on subspace cluster membership. We modify the idea of sparse coding by focusing the identification of shared clusters between data when source and target data may have different distributions. In our paper, we point out cases where a direct application of sparse coding will lead to a failure of knowledge transfer. We then present the details of our extension to sparse coding, by incorporating distribution distance estimates for the embedded data, and show that the proposed algorithm can overcome the shortcomings of the sparse coding algorithm on synthetic data and achieve improved predictive performance on a real world chemical toxicity transfer learning task.", "citation": "Citations (31)", "departments": ["University of Kansas", "University of Kansas", "University of Kansas", "University of Kansas", "University of Kansas", "University of Kansas"], "authors": ["Brian Quanz.....http://dblp.org/pers/hd/q/Quanz:Brian", "Jun Huan.....http://dblp.org/pers/hd/h/Huan:Jun", "Meenakshi Mishra.....http://dblp.org/pers/hd/m/Mishra:Meenakshi"], "conf": "icde", "year": "2011", "pages": 11}