{"title": "Energy provisioning in wireless rechargeable sensor networks.", "fields": ["wireless", "energy harvesting", "key distribution in wireless sensor networks", "activity recognition", "provisioning", "mobile wireless sensor network", "exploit", "experimental data", "continuous operation"], "abstract": "Wireless rechargeable sensor networks (WRSNs) have emerged as an alternative to solving the challenges of size and operation time posed by traditional battery-powered systems. In this paper, we study a WRSN built from the industrial wireless identification and sensing platform (WISP) and commercial off-the-shelf RFID readers. The paper-thin WISP tags serve as sensors and can harvest energy from RF signals transmitted by the readers. This kind of WRSNs is highly desirable for indoor sensing and activity recognition and is gaining attention in the research community. One fundamental question in WRSN design is how to deploy readers in a network to ensure that the WISP tags can harvest sufficient energy for continuous operation. We refer to this issue as the energy provisioning problem. Based on a practical wireless recharge model supported by experimental data, we investigate two forms of the problem: point provisioning and path provisioning. Point provisioning uses the least number of readers to ensure that a static tag placed in any position of the network will receive a sufficient recharge rate for sustained operation. Path provisioning exploits the potential mobility of tags (e.g., those carried by human users) to further reduce the number of readers necessary: mobile tags can harvest excess energy in power-rich regions and store it for later use in power-deficient regions. Our analysis shows that our deployment methods, by exploiting the physical characteristics of wireless recharging, can greatly reduce the number of readers compared with those assuming traditional coverage models.", "citation": "Not cited", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Purdue University", "Michigan State University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Purdue University", "Michigan State University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Michigan State University"], "authors": ["Shibo He.....http://dblp.org/pers/hd/h/He:Shibo", "Jiming Chen.....http://dblp.org/pers/hd/c/Chen:Jiming", "Fachang Jiang.....http://dblp.org/pers/hd/j/Jiang:Fachang", "David K. Y. Yau.....http://dblp.org/pers/hd/y/Yau:David_K=_Y=", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Youxian Sun.....http://dblp.org/pers/hd/s/Sun:Youxian"], "conf": "infocom", "year": "2011", "pages": 9}