{"title": "COREMU: a scalable and portable parallel full-system emulator.", "fields": ["source lines of code", "multi core processor", "concurrency", "uniprocessor system", "scalability"], "abstract": "This paper presents the open-source COREMU, a scalable and portable parallel emulation framework that decouples the complexity of parallelizing full-system emulators from building a mature sequential one. The key observation is that CPU cores and devices in current (and likely future) multiprocessors are loosely-coupled and communicate through well-defined interfaces. Based on this observation, COREMU emulates multiple cores by creating multiple instances of existing sequential emulators, and uses a thin library layer to handle the inter-core and device communication and synchronization, to maintain a consistent view of system resources. COREMU also incorporates lightweight memory transactions, feedback-directed scheduling, lazy code invalidation and adaptive signal control to provide scalable performance. To make COREMU useful in practice, we also provide some preliminary tools and APIs that can help programmers to diagnose performance problems and (concurrency) bugs. A working prototype, which reuses the widely-used QEMU as the sequential emulator, is with only 2500 lines of code (LOCs) changes to QEMU. It currently supports x64 and ARM platforms, and can emulates up to 255 cores running commodity OSes with practical performance, while QEMU cannot scale above 32 cores. A set of performance evaluation against QEMU indicates that, COREMU has negligible uniprocessor emulation overhead, performs and scales significantly better than QEMU. We also show how COREMU could be used to diagnose performance problems and concurrency bugs of both OS kernel and parallel applications.", "citation": "Citations (59)", "year": "2011", "departments": ["Fudan University", "Fudan University", "Fudan University", "Fudan University", "Fudan University"], "conf": "ppopp", "authors": ["Zhaoguo Wang.....http://dblp.org/pers/hd/w/Wang:Zhaoguo", "Ran Liu.....http://dblp.org/pers/hd/l/Liu_0003:Ran", "Yufei Chen.....http://dblp.org/pers/hd/c/Chen:Yufei", "Xi Wu.....http://dblp.org/pers/hd/w/Wu_0001:Xi", "Haibo Chen.....http://dblp.org/pers/hd/c/Chen:Haibo", "Weihua Zhang.....http://dblp.org/pers/hd/z/Zhang:Weihua", "Binyu Zang.....http://dblp.org/pers/hd/z/Zang:Binyu"], "pages": 10}