{"title": "Predicting occupation via human clothing and contexts.", "fields": ["contextual image classification", "feature extraction", "clothing", "feature", "iterative reconstruction"], "abstract": "Predicting human occupations in photos has great application potentials in intelligent services and systems. However, using traditional classification methods cannot reliably distinguish different occupations due to the complex relations between occupations and the low-level image features. In this paper, we investigate the human occupation prediction problem by modeling the appearances of human clothing as well as surrounding context. The human clothing, regarding its complex details and variant appearances, is described via part-based modeling on the automatically aligned patches of human body parts. The image patches are represented with semantic-level patterns such as clothes and haircut styles using methods based on sparse coding towards informative and noise-tolerant capacities. This description of human clothing is proved to be more effective than traditional methods. Different kinds of surrounding context are also investigated as a complementarity of human clothing features in the cases that the background information is available. Experiments are conducted on a well labeled image database that contains more than 5; 000 images from 20 representative occupation categories. The preliminary study shows the human occupation is reasonably predictable using the proposed clothing features and possible context.", "citation": "Citations (85)", "year": "2011", "departments": ["National University of Singapore", "Microsoft Research Asia (China)", "Department of E ... ring, Singapore", "Department of E ... ring, Singapore"], "conf": "iccv", "authors": ["Zheng Song.....http://dblp.org/pers/hd/s/Song:Zheng", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "pages": 8}