{"title": "Minimum error bounded efficient ℓ1 tracker with occlusion detection.", "fields": ["bounded function", "subspace topology", "bittorrent tracker", "linear least squares", "speedup"], "abstract": "Recently, sparse representation has been applied to visual tracking to find the target with the minimum reconstruction error from the target template subspace. Though effective, these L1 trackers require high computational costs due to numerous calculations for `1 minimization. In addition, the inherent occlusion insensitivity of the `1 minimization has not been fully utilized. In this paper, we propose an efficient L1 tracker with minimum error bound and occlusion detection which we call Bounded Particle Resampling (BPR)-L1 tracker. First, the minimum error bound is quickly calculated from a linear least squares equation, and serves as a guide for particle resampling in a particle filter framework. Without loss of precision during resampling, most insignificant samples are removed before solving the computationally expensive `1 minimization function. The BPR technique enables us to speed up the L1 tracker without sacrificing accuracy. Second, we perform occlusion detection by investigating the trivial coefficients in the `1 minimization. These coefficients, by design, contain rich information about image corruptions including occlusion. Detected occlusions enhance the template updates to effectively reduce the drifting problem. The proposed method shows good performance as compared with several state-of-the-art trackers on challenging benchmark sequences.", "citation": "Citations (418)", "year": "2011", "departments": ["Intel", "Temple University", "Temple University", "Nanjing University", "Air Force Research Laboratory"], "conf": "cvpr", "authors": ["Xue Mei.....http://dblp.org/pers/hd/m/Mei:Xue", "Haibin Ling.....http://dblp.org/pers/hd/l/Ling:Haibin", "Yi Wu.....http://dblp.org/pers/hd/w/Wu_0001:Yi", "Erik Blasch.....http://dblp.org/pers/hd/b/Blasch:Erik", "Li Bai.....http://dblp.org/pers/hd/b/Bai:Li"], "pages": 8}