{"title": "The Steiner Multigraph Problem: Wildlife Corridor Design for Multiple Species.", "fields": ["multigraph", "wildlife conservation", "wildlife corridor", "computational sustainability", "species of concern"], "abstract": "The conservation of wildlife corridors between existing habitat preserves is important for combating the effects of habitat loss and fragmentation facing species of concern. We introduce the Steiner Multigraph Problem to model the problem of minimum-cost wildlife corridor design for multiple species with different landscape requirements. This problem can also model other analogous settings in wireless and social networks. As a generalization of Steiner forest, the goal is to find a minimum-cost subgraph that connects multiple sets of terminals. In contrast to Steiner forest, each set of terminals can only be connected via a subset of the nodes. Generalizing Steiner forest in this way makes the problem NP-hard even when restricted to two pairs of terminals. However, we show that if the node subsets have a nested structure, the problem admits a fixed-parameter tractable algorithm in the number of terminals. We successfully test exact and heuristic solution approaches on a wildlife corridor instance for wolverines and lynx in western Montana, showing that though the problem is computationally hard, heuristics perform well, and provably optimal solutions can still be obtained.", "citation": "Citations (10)", "departments": ["Cornell University", "Cornell University", "United States Forest Service", "United States Forest Service", "United States Forest Service"], "authors": ["Katherine J. Lai.....http://dblp.org/pers/hd/l/Lai:Katherine_J=", "Carla P. Gomes.....http://dblp.org/pers/hd/g/Gomes:Carla_P=", "Michael K. Schwartz.....http://dblp.org/pers/hd/s/Schwartz:Michael_K=", "Kevin S. McKelvey.....http://dblp.org/pers/hd/m/McKelvey:Kevin_S=", "David E. Calkin.....http://dblp.org/pers/hd/c/Calkin:David_E=", "Claire A. Montgomery.....http://dblp.org/pers/hd/m/Montgomery:Claire_A="], "conf": "aaai", "year": "2011", "pages": -1}