{"title": "A real-time multicast routing scheme for multi-hop switched fieldbuses.", "fields": ["xcast", "networked control system", "protocol independent multicast", "shared medium", "source specific multicast"], "abstract": "The rapid scaling up of Networked Control Systems (NCS) is forcing traditional single-hop shared medium industrial fieldbuses (a.k.a. fieldbuses) to evolve toward multi-hop switched fieldbuses. Such evolution faces many challenges. The first is the re-design of switch architecture. To meet the real-time nature of NCS traffic, and to lay a smooth evolution path for switch manufacturers, it is widely agreed that a (if not the) promising switch architecture is an input queueing crossbar architecture running TDMA scheduling. The second challenge is real-time multicast. NCS applications usually involve complex distributed multiple-input-multiple-output interactions, which by their nature necessitate real-time multicast. In shared medium fieldbuses, real-time multicast is straightforward as data sent to the medium is heard by all nodes. On multi-hop switched fieldbuses, however, real-time multicast becomes non-trivial. In this paper, we prove real-time multicast on multi-hop switched fieldbuses is NP-Hard. What is more, real-time multicast on multi-hop switched fieldbuses is fundamentally different from Internet multicast, due to real-time requirement and the homogeneous input queueing crossbar switch architecture. Particularly, switch external links' capacities are no longer mutually independent. Such drastic change of assumptions warrants developing new routing algorithms, and a heuristic algorithm is hereby proposed.", "citation": "Citations (5)", "departments": ["McGill University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Department of ECE, USA"], "authors": ["Lixiong Chen.....http://dblp.org/pers/hd/c/Chen:Lixiong", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Qixin Wang.....http://dblp.org/pers/hd/w/Wang:Qixin", "Yufei Wang.....http://dblp.org/pers/hd/w/Wang:Yufei"], "conf": "infocom", "year": "2011", "pages": 9}