{"title": "Extreme-Value Theorems for Optimal Multidimensional Pricing.", "fields": ["hazard ratio", "revenue", "polynomial time approximation scheme", "approximation algorithm", "bounded function", "binary logarithm", "time complexity", "extreme value theory", "monotone polygon"], "abstract": "We provide a Polynomial Time Approximation Scheme for the multi-dimensional unit-demand pricing problem, when the buyer's values are independent (but not necessarily identically distributed.) For all epsilon>0, we obtain a (1+epsilon)-factor approximation to the optimal revenue in time polynomial, when the values are sampled from Monotone Hazard Rate (MHR) distributions, quasi-polynomial, when sampled from regular distributions, and polynomial in n^{poly(log r)}, when sampled from general distributions supported on a set [u_min, r u_min]. We also provide an additive PTAS for all bounded distributions. Our algorithms are based on novel extreme value theorems for MHR and regular distributions, and apply probabilistic techniques to understand the statistical properties of revenue distributions, as well as to reduce the size of the search space of the algorithm. As a byproduct of our techniques, we establish structural properties of optimal solutions. We show that, for all epsilon >0, g(1/epsilon) distinct prices suffice to obtain a (1+epsilon)-factor approximation to the optimal revenue for MHR distributions, where g(1/epsilon) is a quasi-linear function of 1/epsilon that does not depend on the number of items. Similarly, for all epsilon>0 and n>0, g(1/epsilon \\cdot log n) distinct prices suffice for regular distributions, where n is the number of items and g() is a polynomial function. Finally, in the i.i.d. MHR case, we show that, as long as the number of items is a sufficiently large function of 1/epsilon, a single price suffices to achieve a (1+epsilon)-factor approximation. Our results represent significant progress to the single-bidder case of the multidimensional optimal mechanism design problem, following Myerson's celebrated work on optimal mechanism design [Myerson 1981].", "citation": "Citations (72)", "year": "2011", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "McGill University", "Massachusetts Institute of Technology"], "conf": "focs", "authors": ["Yang Cai.....http://dblp.org/pers/hd/c/Cai_0001:Yang", "Constantinos Daskalakis.....http://dblp.org/pers/hd/d/Daskalakis:Constantinos"], "pages": 10}