{"title": "Eyo: Device-Transparent Personal Storage.", "fields": ["desktop management interface", "computer data storage", "sync", "transparency", "network topology"], "abstract": "Users increasingly store data collections such as digital photographs on multiple personal devices, each of which typically offers a storage management interface oblivious to the contents of the user's other devices. As a result, collections become disorganized and drift out of sync.\n\nThis paper presents Eyo, a novel personal storage system that provides device transparency: a user can think in terms of \"file X\", rather than \"file X on device Y\", and will see the same set of files on all personal devices. Eyo allows a user to view and manage the entire collection of objects from any of their devices, even from disconnected devices and devices with too little storage to hold all the object content. Eyo synchronizes these collections across any network topology, including direct peer-to-peer links. Eyo provides applications with a storage API with first-class access to object version history in order to resolve update conflicts automatically.\n\nExperiments with several applications using Eyo-- media players, a photo editor, a podcast manager, and an email interface--show that device transparency requires only minor application changes, and matches the storage and bandwidth capabilities of typical portable devices.", "citation": "Citations (20)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Yale University", "Massachusetts Institute of Technology", "Quanta Research Cambridge"], "authors": ["Jacob Strauss.....http://dblp.org/pers/hd/s/Strauss:Jacob", "Justin Mazzola Paluska.....http://dblp.org/pers/hd/p/Paluska:Justin_Mazzola", "Chris Lesniewski-Laas.....http://dblp.org/pers/hd/l/Lesniewski=Laas:Chris", "Bryan Ford.....http://dblp.org/pers/hd/f/Ford:Bryan", "Robert Tappan Morris.....http://dblp.org/pers/hd/m/Morris:Robert_Tappan", "M. Frans Kaashoek.....http://dblp.org/pers/hd/k/Kaashoek:M=_Frans"], "conf": "usenix", "year": "2011", "pages": -1}