{"title": "Flooding-resilient broadcast authentication for VANETs.", "fields": ["broadcast communication network", "vehicular ad hoc network", "software deployment", "elliptic curve digital signature algorithm", "communication source"], "abstract": "Digital signatures are one of the fundamental security primitives in Vehicular Ad-Hoc Networks (VANETs) because they provide authenticity and non-repudiation in broadcast communication. However, the current broadcast authentication standard in VANETs is vulnerable to signature flooding: excessive signature verification requests that exhaust the computational resources of victims. In this paper, we propose two efficient broadcast authentication schemes, Fast Authentication (FastAuth) and Selective Authentication (SelAuth), as two countermeasures to signature flooding. FastAuth secures periodic single-hop beacon messages. By exploiting the sender's ability to predict its own future beacons, FastAuth enables 50 times faster verification than previous mechanisms using the Elliptic Curve Digital Signature Algorithm. SelAuth secures multi-hop applications in which a bogus signature may spread out quickly and impact a significant number of vehicles. SelAuth pro- vides fast isolation of malicious senders, even under a dynamic topology, while consuming only 15%--30% of the computational resources compared to other schemes. We provide both analytical and experimental evaluations based on real traffic traces and NS-2 simulations. With the near-term deployment plans of VANET on all vehicles, our approaches can make VANETs practical.", "citation": "Citations (80)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "General Motors"], "authors": ["Hsu-Chun Hsiao.....http://dblp.org/pers/hd/h/Hsiao:Hsu=Chun", "Ahren Studer.....http://dblp.org/pers/hd/s/Studer:Ahren", "Chen Chen.....http://dblp.org/pers/hd/c/Chen_0013:Chen", "Adrian Perrig.....http://dblp.org/pers/hd/p/Perrig:Adrian", "Fan Bai.....http://dblp.org/pers/hd/b/Bai:Fan", "Bhargav Bellur.....http://dblp.org/pers/hd/b/Bellur:Bhargav", "Aravind Iyer.....http://dblp.org/pers/hd/i/Iyer:Aravind"], "conf": "mobicom", "year": "2011", "pages": 12}