{"title": "Struck: Structured output tracking with kernels.", "fields": ["contextual image classification", "object model", "pose", "frame rate", "bittorrent tracker", "video tracking", "structured support vector machine"], "abstract": "Adaptive tracking-by-detection methods are widely used in computer vision for tracking arbitrary objects. Current approaches treat the tracking problem as a classification task and use online learning techniques to update the object model. However, for these updates to happen one needs to convert the estimated object position into a set of labelled training examples, and it is not clear how best to perform this intermediate step. Furthermore, the objective for the classifier (label prediction) is not explicitly coupled to the objective for the tracker (accurate estimation of object position). In this paper, we present a framework for adaptive visual object tracking based on structured output prediction. By explicitly allowing the output space to express the needs of the tracker, we are able to avoid the need for an intermediate classification step. Our method uses a kernelized structured output support vector machine (SVM), which is learned online to provide adaptive tracking. To allow for real-time application, we introduce a budgeting mechanism which prevents the unbounded growth in the number of support vectors which would otherwise occur during tracking. Experimentally, we show that our algorithm is able to outperform state-of-the-art trackers on various benchmark videos. Additionally, we show that we can easily incorporate additional features and kernels into our framework, which results in increased performance.", "citation": "Citations (1,766)", "year": "2011", "departments": ["Oxford Brookes University", "Oxford Brookes University", "Oxford Brookes University", "University of Oxford", "Stanford University", "Nankai University", "Obvious Enginee ... United Kingdom", "import.io, Lond ... United Kingdom"], "conf": "iccv", "authors": ["Sam Hare.....http://dblp.org/pers/hd/h/Hare:Sam", "Amir Saffari.....http://dblp.org/pers/hd/s/Saffari:Amir", "Philip H. S. Torr.....http://dblp.org/pers/hd/t/Torr:Philip_H=_S="], "pages": 8}