{"title": "Season: Shelving interference and joint identification in large-scale RFID systems.", "fields": ["collision", "protocol stack", "interference", "throughput", "radio frequency identification"], "abstract": "Prior work on anti-collision for Radio Frequency IDentification (RFID) systems usually schedule adjacent readers to exclusively interrogate tags for avoiding reader collisions. Although such a pattern can effectively deal with collisions, the lack of readers' collaboration wastes numerous time on the scheduling process and dramatically degrades the throughput of identification. Even worse, the tags within the overlapped interrogation regions of adjacent readers (termed as contentious tags), even if the number of such tags is very small, introduce a significant delay to the identification process. In this paper, we propose a new strategy for collision resolution. First, we shelve the collisions and identify the tags that do not involve reader collisions. Second, we perform a joint identification, in which adjacent readers collaboratively identify the contentious tags. In particular, we find that neighboring readers can cause a new type of collisions, cross-tag-collision, which may impede the joint identification. We propose a protocol stack, named Season, to undertake the tasks in two phases and solve the cross-tag-collision. We conduct extensive simulations and preliminary implementation to demonstrate the efficiency of our scheme. The results show that our scheme can achieve above 6 times improvement on the identification throughput in a large-scale dense reader environment.", "citation": "Citations (80)", "departments": ["Xi'an Jiaotong University", "Xi'an Jiaotong University", "Xi'an Jiaotong University", "Tongji University", "University of Southern Denmark"], "authors": ["Lei Yang.....http://dblp.org/pers/hd/y/Yang_0025:Lei", "Jinsong Han.....http://dblp.org/pers/hd/h/Han:Jinsong", "Yong Qi.....http://dblp.org/pers/hd/q/Qi:Yong", "Cheng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cheng", "Tao Gu.....http://dblp.org/pers/hd/g/Gu:Tao", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2011", "pages": 9}