{"title": "The resilience of WDM networks to probabilistic geographical failures.", "fields": ["geometric networks", "network access protection", "wavelength division multiplexing", "vulnerability", "probabilistic logic", "interdependent networks", "psychological resilience"], "abstract": "Telecommunications networks, and in particular optical WDM networks, are vulnerable to large-scale failures in their physical infrastructure, resulting from physical attacks (such as an electromagnetic pulse attack) or natural disasters (such as solar flares, earthquakes, and floods). Such events happen at specific geographical locations and disrupt specific parts of the network, but their effects cannot be determined exactly in advance. Therefore, we provide a unified framework to model network vulnerability when the event has a probabilistic nature, defined by an arbitrary probability density function. Our framework captures scenarios with a number of simultaneous attacks, when network components consist of several dependent subcomponents, and in which either a 1 + 1 or a 1:1 protection plan is in place. We use computational geometric tools to provide efficient algorithms to identify vulnerable points within the network under various metrics. Then, we obtain numerical results for specific backbone networks, demonstrating the applicability of our algorithms to real-world scenarios. Our novel approach allows to identify locations that require additional protection efforts (e.g., equipment shielding). Overall, the paper demonstrates that using computational geometric techniques can significantly contribute to our understanding of network resilience.", "citation": "Citations (176)", "departments": ["Duke University", "University of Arizona", "Duke University", "Hebrew University of Jerusalem", "Duke University", "Duke University", "University of Arizona", "Duke University", "Hebrew University of Jerusalem", "University of Arizona"], "authors": ["Pankaj K. Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Pankaj_K=", "Alon Efrat.....http://dblp.org/pers/hd/e/Efrat:Alon", "Shashidhara K. Ganjugunte.....http://dblp.org/pers/hd/g/Ganjugunte:Shashidhara_K=", "David Hay.....http://dblp.org/pers/hd/h/Hay:David", "Swaminathan Sankararaman.....http://dblp.org/pers/hd/s/Sankararaman:Swaminathan", "Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil"], "conf": "infocom", "year": "2011", "pages": 9}