{"title": "RCDC: a relaxed consistency deterministic computer.", "fields": ["memory ordering", "runtime system", "nondeterministic algorithm", "memory model", "deterministic system"], "abstract": "Providing deterministic execution significantly simplifies the debugging, testing, replication, and deployment of multithreaded programs. Recent work has developed deterministic multiprocessor architectures as well as compiler and runtime systems that enforce determinism in current hardware. Such work has incidentally imposed strong memory-ordering properties. Historically, memory ordering has been relaxed in favor of higher performance in shared memory multiprocessors and, interestingly, determinism exacerbates the cost of strong memory ordering. Consequently, we argue that relaxed memory ordering is vital to achieving faster deterministic execution.   This paper introduces RCDC, a deterministic multiprocessor architecture that takes advantage of relaxed memory orderings to provide high-performance deterministic execution with low hardware complexity. RCDC has two key innovations: a hybrid HW/SW approach to enforcing determinism; and a new deterministic execution strategy that leverages data-race-free-based memory models (e.g., the models for Java and C++) to improve performance and scalability without sacrificing determinism, even in the presence of races. In our hybrid HW/SW approach, the only hardware mechanisms required are software-controlled store buffering and support for precise instruction counting; we do not require speculation. A runtime system uses these mechanisms to enforce determinism for arbitrary programs.   We evaluate RCDC using PARSEC benchmarks and show that relaxing memory ordering leads to performance and scalability close to nondeterministic execution without requiring any form of speculation. We also compare our new execution strategy to one based on TSO (total-store-ordering) and show that some applications benefit significantly from the extra relaxation. We also evaluate a software-only implementation of our new deterministic execution strategy.", "citation": "Citations (95)", "year": "2011", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "conf": "asplos", "authors": ["Joseph Devietti.....http://dblp.org/pers/hd/d/Devietti:Joseph", "Jacob Nelson.....http://dblp.org/pers/hd/n/Nelson:Jacob", "Tom Bergan.....http://dblp.org/pers/hd/b/Bergan:Tom", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Dan Grossman.....http://dblp.org/pers/hd/g/Grossman:Dan"], "pages": 12}