{"title": "Action recognition in videos acquired by a moving camera using motion decomposition of Lagrangian particle trajectories.", "fields": ["3d single object recognition", "match moving", "motion compensation", "video tracking", "invariant"], "abstract": "Recognition of human actions in a video acquired by a moving camera typically requires standard preprocessing steps such as motion compensation, moving object detection and object tracking. The errors from the motion compensation step propagate to the object detection stage, resulting in miss-detections, which further complicates the tracking stage, resulting in cluttered and incorrect tracks. Therefore, action recognition from a moving camera is considered very challenging. In this paper, we propose a novel approach which does not follow the standard steps, and accordingly avoids the aforementioned difficulties. Our approach is based on Lagrangian particle trajectories which are a set of dense trajectories obtained by advecting optical flow over time, thus capturing the ensemble motions of a scene. This is done in frames of unaligned video, and no object detection is required. In order to handle the moving camera, we propose a novel approach based on low rank optimization, where we decompose the trajectories into their camera-induced and object-induced components. Having obtained the relevant object motion trajectories, we compute a compact set of chaotic invariant features which captures the characteristics of the trajectories. Consequently, a SVM is employed to learn and recognize the human actions using the computed motion features. We performed intensive experiments on multiple benchmark datasets and two new aerial datasets called ARG and APHill, and obtained promising results.", "citation": "Citations (166)", "year": "2011", "departments": ["University of Central Florida", "University of Central Florida", "University of Central Florida"], "conf": "iccv", "authors": ["Shandong Wu.....http://dblp.org/pers/hd/w/Wu:Shandong", "Omar Oreifej.....http://dblp.org/pers/hd/o/Oreifej:Omar", "Mubarak Shah.....http://dblp.org/pers/hd/s/Shah:Mubarak"], "pages": 8}