{"title": "ACCESS: Smart scheduling for asymmetric cache CMPs.", "fields": ["cache invalidation", "bus sniffing", "snoopy cache", "smart cache", "cache pollution"], "abstract": "In current Chip-multiprocessors (CMPs), a significant portion of the die is consumed by the last-level cache. Until recently, the balance of cache and core space has been primarily guided by the needs of single applications. However, as multiple applications or virtual machines (VMs) are consolidated on such a platform, researchers have observed that not all VMs or applications require significant amount of cache space. In order to take advantage of this phenomenon, we explore the use of asymmetric last-level caches in a CMP platform. While asymmetric cache CMPs provide the benefit of reduced power and area, it is important to build in hardware/software support to appropriately schedule applications on to cores with suitable cache capacity. In this paper, we address this problem with our ACCESS architecture comprising of: (a) asymmetric caches across a group of cores, (b) hardware support that enables prediction of cache performance on the different sized caches and (c) OS scheduler support to make use of the prediction capability and appropriately schedule applications on to core with suitable cache capacity. Measurements on a working prototype using SPEC2006 benchmarks show that our ACCESS architecture can effectively schedule jobs in an asymmetric cache CMP and provide 23% performance improvement compared to a naive scheduler, and is 97% close to an oracle scheduler in making schedules.", "citation": "Citations (22)", "departments": ["Intel", "Pennsylvania State University", "Intel", "Intel", "Intel"], "authors": ["Xiaowei Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaowei", "Asit K. Mishra.....http://dblp.org/pers/hd/m/Mishra:Asit_K=", "Li Zhao.....http://dblp.org/pers/hd/z/Zhao:Li", "Ravishankar R. Iyer.....http://dblp.org/pers/hd/i/Iyer:Ravishankar_R=", "Zhen Fang.....http://dblp.org/pers/hd/f/Fang:Zhen", "Sadagopan Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Sadagopan", "Srihari Makineni.....http://dblp.org/pers/hd/m/Makineni:Srihari", "Paul Brett.....http://dblp.org/pers/hd/b/Brett:Paul", "Chita R. Das.....http://dblp.org/pers/hd/d/Das:Chita_R="], "conf": "hpca", "year": "2011", "pages": 12}