{"title": "Energy efficient clustering for WSN-based structural health monitoring.", "fields": ["domain knowledge", "modal analysis", "condition monitoring", "distributed algorithm", "structural health monitoring"], "abstract": "In recent years, research on using wireless sensor networks (WSNs) for structural health monitoring (SHM) has attracted increasing attention. Unlike other monitoring applications, detection of possible structure damage requires significant amount of domain knowledge that computer science researchers are usually unfamiliar with. As a result, most previous work in WSN-based SHM was done by researchers in civil engineering. However, civil researchers often tend to solve practical engineering problems but rarely consider designing a system in an optimal way, particularly when the limited wireless bandwidth and restricted resources of WSNs need to be addressed. Through the collaboration with civil researchers, we demonstrate that optimization design can significantly help improve the performance of a WSN-based SHM system. We consider a fundamental problem in SHM: modal analysis, which is used to obtain the dynamic structural vibration characteristics. Cluster-based modal analysis approach is adopted. In each cluster, the vibration characteristics are identified and then are assembled together. Different from other applications, clustering in this approach should meet some extra requirements of modal analysis. Moreover, cluster size should be optimized to minimize the total energy consumption. This clustering problem is formally formulated and proven to be NP complete. Two centralized and one distributed algorithms are proposed to solve the problem. The effectiveness and efficiency of the proposed cluster-based modal analysis along with the clustering algorithms are evaluated using both simulation and experiments.", "citation": "Citations (95)", "departments": ["Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Sun Yat-sen University"], "authors": ["Xuefeng Liu.....http://dblp.org/pers/hd/l/Liu:Xuefeng", "Jiannong Cao.....http://dblp.org/pers/hd/c/Cao:Jiannong", "Steven Lai.....http://dblp.org/pers/hd/l/Lai:Steven", "Chao Yang.....http://dblp.org/pers/hd/y/Yang:Chao", "Hejun Wu.....http://dblp.org/pers/hd/w/Wu:Hejun", "Youlin Xu.....http://dblp.org/pers/hd/x/Xu:Youlin"], "conf": "infocom", "year": "2011", "pages": 9}