{"title": "HyPer: A hybrid OLTP&OLAP main memory database system based on virtual memory snapshots.", "fields": ["transaction data", "virtual memory", "online analytical processing", "transaction processing", "online transaction processing"], "abstract": "The two areas of online transaction processing (OLTP) and online analytical processing (OLAP) present different challenges for database architectures. Currently, customers with high rates of mission-critical transactions have split their data into two separate systems, one database for OLTP and one so-called data warehouse for OLAP. While allowing for decent transaction rates, this separation has many disadvantages including data freshness issues due to the delay caused by only periodically initiating the Extract Transform Load-data staging and excessive resource consumption due to maintaining two separate information systems. We present an efficient hybrid system, called HyPer, that can handle both OLTP and OLAP simultaneously by using hardware-assisted replication mechanisms to maintain consistent snapshots of the transactional data. HyPer is a main-memory database system that guarantees the ACID properties of OLTP transactions and executes OLAP query sessions (multiple queries) on the same, arbitrarily current and consistent snapshot. The utilization of the processor-inherent support for virtual memory management (address translation, caching, copy on update) yields both at the same time: unprecedentedly high transaction rates as high as 100000 per second and very fast OLAP query response times on a single system executing both workloads in parallel. The performance analysis is based on a combined TPC-C and TPC-H benchmark.", "citation": "Citations (439)", "departments": ["Technische Universität München", "Technische Universität München"], "authors": ["Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas"], "conf": "icde", "year": "2011", "pages": 12}