{"title": "A novel packet size based covert channel attack against anonymizer.", "fields": ["transmission control protocol", "compromise", "network packet", "covert channel", "architecture"], "abstract": "Anonymizer is a proprietary anonymous communication system. We discovered its architecture and found that the size of web packets through Anonymizer are very dynamic at the client. Motivated by this finding, we investigated a novel packet size based covert channel attack, against the anonymity service. In the attack, one attacker manipulates the web packet size between the web server and Anonymizer and embed signal symbols into the target traffic. An accomplice at the user side can sniff the traffic and recognize the secret signal. We developed intelligent and robust algorithms to cope with the packet size distortion incurred by Anonymizer and Internet. We developed several techniques to make the attack harder to detect: (i) We pick up right packets of web objects to manipulate in order to preserve the regularity of the TCP packet size dynamics; (ii) We adopt the Monte Carlo sampling technique to preserve the distribution of the web packet size despite manipulation. We have implemented the attack over Anonymizer and conducted extensive analysis and experimental evaluations. It is observed that the attack is highly efficient and requires only tens of packets to compromise the anonymous web surfing. The experimental results are consistent with our theoretical analysis.", "citation": "Citations (7)", "departments": ["Southeast University", "University of Massachusetts Lowell", "City University of Hong Kong", "Towson University", "Ohio State University"], "authors": ["Zhen Ling.....http://dblp.org/pers/hd/l/Ling:Zhen", "Xinwen Fu.....http://dblp.org/pers/hd/f/Fu:Xinwen", "Weijia Jia.....http://dblp.org/pers/hd/j/Jia:Weijia", "Wei Yu.....http://dblp.org/pers/hd/y/Yu_0002:Wei", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong"], "conf": "infocom", "year": "2011", "pages": 5}