{"title": "Chalk sounds: the effects of dynamic synthesized audio on workspace awareness in distributed groupware.", "fields": ["collaborative software", "radar", "multimedia", "workspace", "empirical evidence"], "abstract": "Awareness of other people's activity is an important part of shared-workspace collaboration, and is typically supported using visual awareness displays such as radar views. These visual presentations are limited in that the user must be able to see and attend to the view in order to gather awareness information. Using audio to convey awareness information does not suffer from these limitations, and previous research has shown that audio can provide valuable awareness in distributed settings. In this paper we evaluate the effectiveness of synthesized dynamic audio information, both on its own and as an adjunct to a visual radar view. We developed a granular-synthesis engine that produces realistic chalk sounds for off-screen activity in a groupware workspace, and tested the audio awareness in two ways. First, we measured people's ability to identify off-screen activities using only sound, and found that people are almost as accurate with synthesized sounds as with real sounds. Second, we tested dynamic audio awareness in a realistic groupware scenario, and found that adding audio to a radar view significantly improved awareness of off-screen activities in situations where it was difficult to see or attend to the visual display. Our work provides new empirical evidence about the value of dynamic synthesized audio in distributed groupware.", "citation": "Citations (13)", "departments": ["University of Saskatchewan", "University of Saskatchewan", "University of Saskatchewan", "University of Glasgow"], "authors": ["Carl Gutwin.....http://dblp.org/pers/hd/g/Gutwin:Carl", "Oliver S. Schneider.....http://dblp.org/pers/hd/s/Schneider:Oliver_S=", "Robert Xiao.....http://dblp.org/pers/hd/x/Xiao:Robert", "Stephen A. Brewster.....http://dblp.org/pers/hd/b/Brewster:Stephen_A="], "conf": "cscw", "year": "2011", "pages": 10}