{"title": "Multicell coordination via joint scheduling, beamforming and power spectrum adaptation.", "fields": ["macrocell", "spatial multiplexing", "femtocell", "proportionally fair", "beamforming", "cellular network", "telecommunications link", "picocell"], "abstract": "The mitigation of intercell interference is a central issue for future-generation wireless cellular networks where frequencies are reused aggressively and where hierarchical cellular structures may heavily overlap. The paper examines the benefit of coordinating transmission strategies and resource allocation schemes across multiple cells for interference mitigation. For a multicell network serving multiple users per cell sectors and where both the base-stations and the remote users are equipped with multiple antennas, this paper proposes a joint proportionally fair scheduling, spatial multiplexing, and power spectrum adaptation method that coordinates multiple base-stations with an objective of optimizing the overall network utility. The proposed scheme optimizes the user schedule, transmit and receive beamforming vectors, and transmit power spectra jointly, while taking into consideration both the intercell and intracell interference and the fairness among the users. The proposed system is shown to significantly improve the overall network throughput while maintaining fairness as compared to a conventional network with per-cell zero-forcing beamforming and with fixed transmit power spectrum. The proposed system goes toward the vision of a fully coordinated multicell network, whereby transmission strategies and resource allocation schemes (rather than transmit signals) are coordinated across the base-stations as a first step.", "citation": "Citations (119)", "departments": ["University of Toronto", "Samsung", "Samsung", "University of Toronto", "Electronics and Telecommunications Research Institute", "Samsung"], "authors": ["Wei Yu.....http://dblp.org/pers/hd/y/Yu_0001:Wei", "Taesoo Kwon.....http://dblp.org/pers/hd/k/Kwon:Taesoo", "Changyong Shin.....http://dblp.org/pers/hd/s/Shin:Changyong"], "conf": "infocom", "year": "2011", "pages": 9}