{"title": "Power shifting in Thrifty Interconnection Network.", "fields": ["network delay", "workload", "network information system", "power budget", "speedup"], "abstract": "This paper presents two complementary techniques to manage the power consumption of large-scale systems with a packet-switched interconnection network. First, we propose Thrifty Interconnection Network (TIN), where the network links are activated and de-activated dynamically with little or no overhead by using inherent system events to timely trigger link activation or de-activation. Second, we propose Network Power Shifting (NPS) that dynamically shifts the power budget between the compute nodes and their corresponding network components. TIN activates and trains the links in the interconnection network, just-in-time before the network communication is about to happen, and thriftily puts them into a low-power mode when communication is finished, hence reducing unnecessary network power consumption. Furthermore, the compute nodes can absorb the extra power budget shifted from its attached network components and increase their processor frequency for higher performance with NPS. Our simulation results on a set of real-world workload traces show that TIN can achieve on average 60% network power reduction, with the support of only one low-power mode. When NPS is enabled, the two together can achieve 12% application performance improvement and 13% overall system energy reduction. Further performance improvement is possible if the compute nodes can speed up more and fully utilize the extra power budget reinvested from the thrifty network with more aggressive cooling support.", "citation": "Citations (19)", "departments": ["IBM", "IBM", "IBM", "Chinese Academy of Sciences", "IBM"], "authors": ["Jian Li.....http://dblp.org/pers/hd/l/Li:Jian", "Wei Huang.....http://dblp.org/pers/hd/h/Huang:Wei", "Charles Lefurgy.....http://dblp.org/pers/hd/l/Lefurgy:Charles", "Lixin Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Lixin", "Wolfgang E. Denzel.....http://dblp.org/pers/hd/d/Denzel:Wolfgang_E=", "Richard R. Treumann.....http://dblp.org/pers/hd/t/Treumann:Richard_R=", "Kun Wang.....http://dblp.org/pers/hd/w/Wang:Kun"], "conf": "hpca", "year": "2011", "pages": 12}