{"title": "Content-aware caching and traffic management in content distribution networks.", "fields": ["queue", "cache", "data file", "throughput", "queueing theory"], "abstract": "The rapid increase of content delivery over the Internet has led to the proliferation of content distribution networks (CDNs). Management of CDNs requires algorithms for request routing, content placement, and eviction in such a way that user delays are small. We abstract the system of frontend source nodes and backend caches of the CDN in the likeness of the input and output nodes of a switch. In this model, queues of requests for different pieces of content build up at the source nodes, which route these requests to a cache that contains the requested content. For each request that is routed to a cache, a corresponding data file is transmitted back to the requesting source across links of finite capacity. Caches are of finite size, and the content of the caches can be refreshed periodically. Our objective is to design policies for request routing, content placement and content eviction with the goal of small user delays. Stable policies ensure the finiteness of the request queues, while good polices also lead to short queue lengths. We first design a throughput-optimal algorithm that solves the routing-placement-eviction problem. The design yields insight into the impact of different cache refresh policies on queue length, and we construct throughput optimal algorithms that engender short queue lengths. We illustrate the potential of our approach through simulations on different CDN topologies.", "citation": "Citations (56)", "departments": ["Texas A&M University", "Texas A&M University", "Texas A&M University", "Iowa State University"], "authors": ["Meghana M. Amble.....http://dblp.org/pers/hd/a/Amble:Meghana_M=", "Parimal Parag.....http://dblp.org/pers/hd/p/Parag:Parimal", "Srinivas Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Srinivas", "Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei"], "conf": "infocom", "year": "2011", "pages": 9}