{"title": "Velocity-dependent dynamic curvature gain for redirected walking.", "fields": ["preferred walking speed", "automatic gain control", "simulator sickness", "redirected walking", "curvature", "controller", "rotation"], "abstract": "The aim of Redirected Walking (RDW) is to redirect a person along their path of travel in a Virtual Environment (VE) in order to increase the virtual space that can be explored in a given tracked area. Among other techniques, the user is redirected on a curved real-world path while visually walking straight in the VE (curvature gain). In this paper, we describe two experiments we conducted to test and extend RDW techniques. In Experiment 1, we measured the effect of walking speed on the detection threshold for curvature of the walking path. In a head-mounted display (HMD) VE, we found a decreased sensitivity for curvature for the slowest walking speed. When participants walked at 0.75 m/s, their detection threshold was approximately 0.1m −1  (radius of approximately 10m). In contrast, for faster walking speeds (>1.0m/s), we found a significantly lower detection threshold of approximately 0.036m −1  (radius of approximately 27m). In Experiment 2, we implemented many well known redirection techniques into one dynamic RDW application. We integrated a large virtual city model and investigated RDW for free exploration. Further, we implemented a dynamic RDW controller which made use of the results from Experiment 1 by dynamically adjusting the applied curvature gain depending on the actual walking velocity of the user. In addition, we investigated the possible role of avatars to slow the users down or make them rotate their heads while exploring. Both the dynamic curvature gain controller and the avatar controller were evaluated in Experiment 2. We measured the average distance that was walked before reaching the boundaries of the tracked area. The mean walked distance was significantly larger in the condition where the dynamic gain controller was applied. This distance increased from approximately 15m for static gains to approximately 22m for dynamic gains. This did not come at the cost of an increase in simulator sickness. Applying the avatar controller did reveal an effect on walking distance or simulator sickness.", "citation": "Citations (29)", "departments": ["Max Planck Society", "Max Planck Society", "Max Planck Society", "Reutlingen University", "Max Planck Society", "Max Planck Society", "Max Planck Society", "Max Planck Society", "Reutlingen University", "Max Planck Society"], "authors": ["Christian T. Neth.....http://dblp.org/pers/hd/n/Neth:Christian_T=", "Jan L. Souman.....http://dblp.org/pers/hd/s/Souman:Jan_L=", "David Engel.....http://dblp.org/pers/hd/e/Engel:David", "Uwe Kloos.....http://dblp.org/pers/hd/k/Kloos:Uwe", "Heinrich H. Bülthoff.....http://dblp.org/pers/hd/b/B=uuml=lthoff:Heinrich_H=", "Betty J. Mohler.....http://dblp.org/pers/hd/m/Mohler:Betty_J="], "conf": "vr", "year": "2011", "pages": 8}