{"title": "Searching the past: an improved shape descriptor to retrieve maya hieroglyphs.", "fields": ["image retrieval", "histogram", "maya", "annotation", "shape context"], "abstract": "Archaeologists often spend significant time looking at traditional printed catalogs to identify and classify historical images. Our collaborative efforts between archaeologists and multimedia researchers seek to develop a tool to retrieve two specific types of ancient Maya visual information: hieroglyphs and iconographic elements. Towards that goal we present two contributions in this paper. The first one is the introduction and analysis of a new dataset of 3400+ Maya hieroglyphs, whose compilation involved manual search, annotation and segmentation by experts. This dataset presents several challenges for visual description and automatic retrieval as it is rich in complex visual details. The second and main contribution is the in-depth analysis of the Histogram Of Orientation Shape Context (HOOSC), and more precisely, the development of 4 improvements that were designed to handle the visual complexity of Maya hieroglyphs: open contours, mixture of thick and thin lines, hatches, large instance variability, and a variety of internal details. Experiments demonstrate that the adequate combination of our improvements to retrieve Maya hieroglyphs, provides results with roughly 20% more precision compared to the original HOOSC descriptor. Complementary results with the MPEG-7 shape dataset validate (or not) the proposed improvements, showing that the design of appropriate descriptors depends on the nature of the shapes one deals with.", "citation": "Citations (12)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "National Instit ... co City, Mexico"], "authors": ["Edgar Roman-Rangel.....http://dblp.org/pers/hd/r/Roman=Rangel:Edgar", "Carlos Pallan Gayol.....http://dblp.org/pers/hd/g/Gayol:Carlos_Pallan", "Jean-Marc Odobez.....http://dblp.org/pers/hd/o/Odobez:Jean=Marc", "Daniel Gatica-Perez.....http://dblp.org/pers/hd/g/Gatica=Perez:Daniel"], "conf": "mm", "year": "2011", "pages": 10}