{"title": "Broadband internet performance: a view from the gateway.", "fields": ["access point name", "internet connection sharing", "residential gateway", "network access point", "integrated access device"], "abstract": "We present the first study of network access link performance measured directly from home gateway devices. Policymakers, ISPs, and users are increasingly interested in studying the performance of Internet access links. Because of many confounding factors in a home network or on end hosts, however, thoroughly understanding access network performance requires deploying measurement infrastructure in users' homes as gateway devices. In conjunction with the Federal Communication Commission's study of broadband Internet access in the United States, we study the throughput and latency of network access links using longitudinal measurements from nearly 4,000 gateway devices across 8 ISPs from a deployment of over 4,200 devices. We study the performance users achieve and how various factors ranging from the user's choice of modem to the ISP's traffic shaping policies can affect performance. Our study yields many important findings about the characteristics of existing access networks. Our findings also provide insights into the ways that access network performance should be measured and presented to users, which can help inform ongoing broader efforts to benchmark the performance of access networks.", "citation": "Citations (336)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "University of Paris", "University of N ... , Napoli, Italy", "SamKnows, Londo ...  United Kingdom"], "authors": ["Srikanth Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Srikanth", "Walter de Donato.....http://dblp.org/pers/hd/d/Donato:Walter_de", "Nick Feamster.....http://dblp.org/pers/hd/f/Feamster:Nick", "Renata Teixeira.....http://dblp.org/pers/hd/t/Teixeira:Renata", "Sam Crawford.....http://dblp.org/pers/hd/c/Crawford:Sam", "Antonio Pescapè.....http://dblp.org/pers/hd/p/Pescap=egrave=:Antonio"], "conf": "sigcomm", "year": "2011", "pages": 12}