{"title": "Novasky: Cinematic-quality VoD in a P2P storage cloud.", "fields": ["source lines of code", "campus network", "end user", "server", "design objective"], "abstract": "In this paper, we present Novasky, a real-world Video-on-Demand (VoD) system capable of delivering cinematic-quality video streams to end users. The foundation of the Novasky design is a peer-to-peer (P2P) storage cloud, storing and refreshing media streams in a decentralized fashion using local storage spaces of end users. We present our design objectives in Novasky, and how these objectives are achieved using a collection of unique mechanisms, with respect to caching strategies, coding mechanisms, and the maintenance of the supply-demand relationship when it comes to media availability in the P2P storage cloud. The production Novasky system has been implemented with over 100,000 lines of code. It has been deployed in the Tsinghua University campus network, operational since September 2009, attracting 10,000 users to date, and providing over 1,000 cinematic-quality video streams with bit rates of 1 – 2 Mbps. Based on real-world traces collected over 6 months, we show that Novasky can achieve rapid startups within 4 – 9 seconds, and extremely short seek latencies within 3 seconds. Our empirical experiences with Novasky may bring valuable insights to future designs of production-quality P2P storage cloud systems.", "citation": "Citations (30)", "departments": ["Hong Kong University of Science and Technology", "Tsinghua University", "Hong Kong University of Science and Technology", "University of Toronto", "Tsinghua University"], "authors": ["Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Shijun Shen.....http://dblp.org/pers/hd/s/Shen:Shijun", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Hao Yin.....http://dblp.org/pers/hd/y/Yin:Hao", "Sanli Li.....http://dblp.org/pers/hd/l/Li:Sanli"], "conf": "infocom", "year": "2011", "pages": 9}