{"title": "An efficient regular expressions compression algorithm from a new perspective.", "fields": ["regular expression", "pattern matching", "deterministic finite automaton", "sparse matrix", "memory management"], "abstract": "Deep packet inspection plays a increasingly important role in network security devices and applications, which use more regular expressions to depict patterns. DFA engine is usually used as a classical representation for regular expressions to perform pattern matching, because it only need O(1) time to process one input character. However, DFAs of regular expression sets require large amount of memory, which limits the practical application of regular expressions in high-speed networks. Some compression algorithms have been proposed to address this issue in recent literatures. In this paper, we reconsider this problem from a new perspective, namely observing the characteristic of transition distribution inside each state, which is different from previous algorithms that observe transition characteristic among states. Furthermore, we introduce a new compression algorithm which can reduce 95% memory usage of DFA stably without significant impact on matching speed. Moreover, our work is orthogonal to previous compression algorithms, such as D2FA, δFA. Our experiment results show that applying our work to them will have several times memory reduction, and matching speed of up to dozens of times comparing with original δFA in software implementation.", "citation": "Citations (24)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Tingwen Liu.....http://dblp.org/pers/hd/l/Liu:Tingwen", "Yifu Yang.....http://dblp.org/pers/hd/y/Yang:Yifu", "Yanbing Liu.....http://dblp.org/pers/hd/l/Liu:Yanbing", "Yong Sun.....http://dblp.org/pers/hd/s/Sun:Yong", "Li Guo.....http://dblp.org/pers/hd/g/Guo_0001:Li"], "conf": "infocom", "year": "2011", "pages": 9}