{"title": "Implementing Gentry's Fully-Homomorphic Encryption Scheme.", "fields": ["homomorphic encryption", "bootstrapping", "megabyte", "gigabyte", "public key cryptography"], "abstract": "We describe a working implementation of a variant of Gentry's fully homomorphic encryption scheme (STOC 2009), similar to the variant used in an earlier implementation effort by Smart and Vercauteren (PKC 2010). Smart and Vercauteren implemented the underlying \"somewhat homomorphic\" scheme, but were not able to implement the bootstrapping functionality that is needed to get the complete scheme to work. We show a number of optimizations that allow us to implement all aspects of the scheme, including the bootstrapping functionality.\n\nOur main optimization is a key-generation method for the underlying somewhat homomorphic encryption, that does not require full polynomial inversion. This reduces the asymptotic complexity from O(n2.5) to O(n1.5) when working with dimension-n lattices (and practically reducing the time from many hours/days to a few seconds/minutes). Other optimizations include a batching technique for encryption, a careful analysis of the degree of the decryption polynomial, and some space/time trade-offs for the fully-homomorphic scheme.\n\nWe tested our implementation with lattices of several dimensions, corresponding to several security levels. From a \"toy\" setting in dimension 512, to \"small,\" \"medium,\" and \"large\" settings in dimensions 2048, 8192, and 32768, respectively. The public-key size ranges in size from 70 Megabytes for the \"small\" setting to 2.3 Gigabytes for the \"large\" setting. The time to run one bootstrapping operation (on a 1-CPU 64- bit machine with large memory) ranges from 30 seconds for the \"small\" setting to 30 minutes for the \"large\" setting.", "citation": "Citations (848)", "year": "2011", "departments": ["IBM", "IBM"], "conf": "eurocrypt", "authors": ["Craig Gentry.....http://dblp.org/pers/hd/g/Gentry:Craig", "Shai Halevi.....http://dblp.org/pers/hd/h/Halevi:Shai"], "pages": 20}