{"title": "A real-time database architecture for motion capture data.", "fields": ["data architecture", "real time database", "dynamic time warping", "small number", "quarter pixel motion"], "abstract": "Due to the popularity of motion capture data in many applications, such as games, movies and virtual environments, huge collections of motion capture data are now available. It is becoming important to store these data in compressed form while being able to retrieve them without much overhead. However, there is little work that addresses both issues together. In this paper, we address these two issues by proposing a novel database architecture. First, we propose a lossless compression algorithm to compress the motion clips, which is based on a novel Alpha Parallelogram Predictor (APP) to estimate the degree of freedom (DOF) of each child joint from its immediate neighbors and parents that have already been processed. Second, we propose to store selected eigenvalues and eigenvectors of each motion clip, which only require a very small amount of memory overheads, for faster filtering of irrelevant motions. Based on this architecture, real-time queries become a three-step process. In the first two steps, we perform a quick filtering to identify relevant motion clips in the database through a two-level indexing structure. In the third step, only a small number of candidate clips are uncompressed and accurately matched with a Dynamic Time Warping algorithm. Our results show that users can efficiently search clips from this losslessly compressed motion database.", "citation": "Citations (9)", "departments": ["Dalian Nationalities University", "City University of Hong Kong", "Zhejiang University", "City University of Hong Kong", "Dalian Nationalities University"], "authors": ["Pengjie Wang.....http://dblp.org/pers/hd/w/Wang:Pengjie", "Rynson W. H. Lau.....http://dblp.org/pers/hd/l/Lau:Rynson_W=_H=", "Mingmin Zhang.....http://dblp.org/pers/hd/z/Zhang:Mingmin", "Jiang Wang.....http://dblp.org/pers/hd/w/Wang:Jiang", "Haiyu Song.....http://dblp.org/pers/hd/s/Song:Haiyu", "Zhigeng Pan.....http://dblp.org/pers/hd/p/Pan:Zhigeng"], "conf": "mm", "year": "2011", "pages": 4}