{"title": "DARP: Distance-aware relay placement in WiMAX mesh networks.", "fields": ["wimax", "steiner tree problem", "mesh networking", "sss", "channel capacity"], "abstract": "The emerging WiMAX technology (IEEE 802.16) is the fourth generation standard for low-cost, high-speed and long-range wireless communications for a large variety of civilian and military applications. IEEE 802.16j has introduced the concept of mesh network model and a special type of node called Relay Station (RS) for traffic relay for Subscriber Stations (SSs). A WiMAX mesh network is able to provide larger wireless coverage, higher network capacity and Non-Line-Of-Sight (NLOS) communications. This paper studies a Distance-Aware Relay Placement (DARP) problem in WiMAX mesh networks, which considers a more realistic model that takes into account physical constraints such as channel capacity, signal strength and network topology, which were largely ignored in previous studies. The goal here is to deploy the minimum number of RSs to meet system requirements such as user data rate requests, signal quality and network topology. We divide the DARP problem into two sub-problems, LOwer-tier Relay Coverage (LORC) Problem and Minimum Upper-tier Steiner Tree (MUST) Problem. For LORC problem, we present two approximation algorithms based on independent set and hitting set, respectively. For MUST problem, an efficient approximation algorithm is provided and proved. Then, an approximation solution for DARP is proposed and proved which combines the solutions of the two sub-problems. We also present numerical results confirming the theoretical analysis of our schemes as the first solution for the DARP problem.", "citation": "Citations (18)", "departments": ["North Dakota State University", "North Dakota State University", "Arizona State University", "Syracuse University", "Princeton University"], "authors": ["Weiyi Zhang.....http://dblp.org/pers/hd/z/Zhang:Weiyi", "Shi Bai.....http://dblp.org/pers/hd/b/Bai:Shi", "Guoliang Xue.....http://dblp.org/pers/hd/x/Xue:Guoliang", "Jian Tang.....http://dblp.org/pers/hd/t/Tang_0008:Jian", "Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang"], "conf": "infocom", "year": "2011", "pages": 9}