{"title": "Variability-aware parsing in the presence of lexical macros and conditional compilation.", "fields": ["parser combinator", "macro", "top down parsing", "bottom up parsing", "conditional compilation"], "abstract": "In many projects, lexical preprocessors are used to manage different variants of the project (using conditional compilation) and to define compile-time code transformations (using macros). Unfortunately, while being a simple way to implement variability, conditional compilation and lexical macros hinder automatic analysis, even though such analysis is urgently needed to combat variability-induced complexity. To analyze code with its variability, we need to parse it without preprocessing it. However, current parsing solutions use unsound heuristics, support only a subset of the language, or suffer from exponential explosion. As part of the TypeChef project, we contribute a novel variability-aware parser that can parse almost all unpreprocessed code without heuristics in practicable time. Beyond the obvious task of detecting syntax errors, our parser paves the road for further analysis, such as variability-aware type checking. We implement variability-aware parsers for Java and GNU C and demonstrate practicability by parsing the product line MobileMedia and the entire X86 architecture of the Linux kernel with 6065 variable features.", "citation": "Citations (227)", "departments": ["Philipps Univer ... arburg, Germany", "Philipps Univer ... arburg, Germany", "Philipps Univer ... arburg, Germany", "Philipps Univer ... arburg, Germany", "Philipps Univer ... arburg, Germany"], "authors": ["Christian Kästner.....http://dblp.org/pers/hd/k/K=auml=stner:Christian", "Paolo G. Giarrusso.....http://dblp.org/pers/hd/g/Giarrusso:Paolo_G=", "Tillmann Rendel.....http://dblp.org/pers/hd/r/Rendel:Tillmann", "Sebastian Erdweg.....http://dblp.org/pers/hd/e/Erdweg:Sebastian", "Klaus Ostermann.....http://dblp.org/pers/hd/o/Ostermann:Klaus", "Thorsten Berger.....http://dblp.org/pers/hd/b/Berger:Thorsten"], "conf": "oopsla", "year": "2011", "pages": 20}