{"title": "From low-distortion norm embeddings to explicit uncertainty relations and efficient information locking.", "fields": ["quantum cryptography", "randomness extractor", "quantum state", "entropic uncertainty", "quantum information science", "quantum capacity", "quantum error correction"], "abstract": "Quantum uncertainty relations are at the heart of many quantum cryptographic protocols performing classically impossible tasks. One operational manifestation of these uncertainty relations is a purely quantum effect referred to as information locking. A locking scheme can be viewed as a cryptographic protocol in which a uniformly random n-bit message is encoded in a quantum system using a classical key of size much smaller than n. Without the key, no measurement of this quantum state can extract more than a negligible amount of information about the message (the message is \"locked\"). Furthermore, knowing the key, it is possible to recover (or \"unlock\") the message.   In this paper, we make the following contributions by exploiting a connection between uncertainty relations and low-distortion embeddings of L2 into L1. * We introduce the notion of metric uncertainty relations and connect it to low-distortion embeddings of L2 into L1. A metric uncertainty relation also implies an entropic uncertainty relation. * We prove that random bases satisfy uncertainty relations with a stronger definition and better parameters than previously known. Our proof is also considerably simpler than earlier proofs. We apply this result to show the existence of locking schemes with key size independent of the message length. * We give efficient constructions of bases satisfying metric uncertainty relations. These bases are computable by quantum circuits of almost linear size. This leads to the first explicit construction of a strong information locking scheme. Moreover, we present a locking scheme that can in principle be implemented with current technology. These constructions are obtained by adapting an explicit norm embedding due to Indyk (2007) and an extractor construction of Guruswami, Umans and Vadhan (2009). * We apply our metric uncertainty relations to give communication protocols that perform equality-testing of n-qubit states. We prove that this task can be performed by a single message protocol using O(log(1/e)) qubits and n bits of communication, where e is an error parameter. We also give a single message protocol that uses O(log^2 n) qubits, where the computation of the sender is efficient.", "citation": "Citations (13)", "year": "2011", "departments": ["McGill University", "McGill University", "Tata Institute of Fundamental Research", "McGill University", "McGill University", "Tata Institute of Fundamental Research"], "conf": "stoc", "authors": ["Omar Fawzi.....http://dblp.org/pers/hd/f/Fawzi:Omar", "Patrick M. Hayden.....http://dblp.org/pers/hd/h/Hayden:Patrick_M=", "Pranab Sen.....http://dblp.org/pers/hd/s/Sen:Pranab"], "pages": 10}