{"title": "Stochastic skyline operator.", "fields": ["uncertain data", "skyline", "optimal decision", "curse of dimensionality", "expected utility hypothesis"], "abstract": "In many applications involving the multiple criteria optimal decision making, users may often want to make a personal trade-off among all optimal solutions. As a key feature, the skyline in a multi-dimensional space provides the minimum set of candidates for such purposes by removing all points not preferred by any (monotonic) utility/scoring functions; that is, the skyline removes all objects not preferred by any user no mater how their preferences vary. Driven by many applications with uncertain data, the probabilistic skyline model is proposed to retrieve uncertain objects based on skyline probabilities. Nevertheless, skyline probabilities cannot capture the preferences of monotonic utility functions. Motivated by this, in this paper we propose a novel skyline operator, namely stochastic skyline. In the light of the expected utility principle, stochastic skyline guarantees to provide the minimum set of candidates for the optimal solutions over all possible monotonic multiplicative utility functions. In contrast to the conventional skyline or the probabilistic skyline computation, we show that the problem of stochastic skyline is NP-complete with respect to the dimensionality. Novel and efficient algorithms are developed to efficiently compute stochastic skyline over multi-dimensional uncertain data, which run in polynomial time if the dimensionality is fixed. We also show, by theoretical analysis and experiments, that the size of stochastic skyline is quite similar to that of conventional skyline over certain data. Comprehensive experiments demonstrate that our techniques are efficient and scalable regarding both CPU and IO costs.", "citation": "Citations (34)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "University of New South Wales"], "authors": ["Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Muhammad Aamir Cheema.....http://dblp.org/pers/hd/c/Cheema:Muhammad_Aamir"], "conf": "icde", "year": "2011", "pages": 12}