{"title": "Efficient maintenance of common keys in archives of continuous query results from deep websites.", "fields": ["invariant", "exploit", "snapshot", "key", "key space"], "abstract": "In many real-world applications, it is important to create a local archive containing versions of structured results of continuous queries (queries that are evaluated periodically) submitted to autonomous database-driven Web sites (e.g., deep Web). Such history of digital information is a potential gold mine for all kinds of scientific, media and business analysts. An important task in this context is to maintain the set of common keys of the underlying archived results as they play pivotal role in data modeling and analysis, query processing, and entity tracking. A set of attributes in a structured data is a common key iff it is a key for all versions of the data in the archive. Due to the data-driven nature of key discovery from the archive, unlike traditional keys, the common keys are not temporally invariant. That is, keys identified in one version may be different from those in another version. Hence, in this paper, we propose a novel technique to maintain common keys in an archive containing a sequence of versions of evolutionary continuous query results. Given the current common key set of existing versions and a new snapshot, we propose an algorithm called COKE (COmmon KEy maintenancE) which incrementally maintains the common key set without undertaking expensive minimal keys computation from the new snapshot. Furthermore, it exploits certain interesting evolutionary features of real-world data to further reduce the computation cost. Our exhaustive empirical study demonstrates that COKE has excellent performance and is orders of magnitude faster than a baseline approach for maintenance of common keys.", "citation": "Citations (3)", "departments": ["Nanyang Technological University", "Nanyang Technological University"], "authors": ["Fajar Ardian.....http://dblp.org/pers/hd/a/Ardian:Fajar", "Sourav S. Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick:Sourav_S="], "conf": "icde", "year": "2011", "pages": 12}