{"title": "A Case for NUMA-aware Contention Management on Multicore Systems.", "fields": ["interleaved memory", "flat memory model", "cache only memory architecture", "uniform memory access", "memory hierarchy", "non uniform memory access"], "abstract": "On multicore systems contention for shared resources occurs when memory-intensive threads are co-scheduled on cores that share parts of the memory hierarchy, such as last-level caches and memory controllers. Previous work investigated how contention could be addressed via scheduling. A contention-aware scheduler separates competing threads onto separate memory hierarchy domains to eliminate resource sharing and, as a consequence, mitigate contention. However, all previous work on contention-aware scheduling assumed that the underlying system is UMA (uniform memory access latencies, single memory controller). Modern multicore systems, however, are NUMA, which means that they feature non-uniform memory access latencies and multiple memory controllers. We discovered that contention management is a lot more difficult on NUMA systems, because the scheduler must not only consider the placement of threads, but also the placement of their memory. This is mostly required to eliminate contention for memory controllers contrary to the popular belief that remote access latency is the dominant concern. In this work we quantify the effects on performance imposed by resource contention and remote access latency. This analysis inspires the design of a contention-aware scheduling algorithm for NUMA systems. This algorithm significantly outperforms a NUMA-unaware algorithm proposed before as well as the default Linux scheduler. We also investigate memory migration strategies, which are the necessary part of the NUMA contention-aware scheduling algorithm. Finally, we propose and evaluate a new contention management algorithm that is priority-aware.", "citation": "Citations (263)", "departments": ["Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Simon Fraser University"], "authors": ["Sergey Blagodurov.....http://dblp.org/pers/hd/b/Blagodurov:Sergey", "Sergey Zhuravlev.....http://dblp.org/pers/hd/z/Zhuravlev:Sergey", "Mohammad Dashti.....http://dblp.org/pers/hd/d/Dashti:Mohammad", "Alexandra Fedorova.....http://dblp.org/pers/hd/f/Fedorova:Alexandra"], "conf": "usenix", "year": "2011", "pages": -1}