{"title": "An improved GLMNET for l1-regularized logistic regression.", "fields": ["regularization", "linear classifier", "local convergence", "elastic net regularization", "optimization problem", "coordinate descent", "general linear model"], "abstract": "Recently, Yuan et al. (2010) conducted a comprehensive comparison on software for L1-regularized classification. They concluded that a carefully designed coordinate descent implementation CDN is the fastest among state-of-the-art solvers. In this paper, we point out that CDN is less competitive on loss functions that are expensive to compute. In particular, CDN for logistic regression is much slower than CDN for SVM because the logistic loss involves expensive exp/log operations.\n\nIn optimization, Newton methods are known to have fewer iterations although each iteration costs more. Because solving the Newton sub-problem is independent of the loss calculation, this type of methods may surpass CDN under some circumstances. In L1-regularized classification, GLMNET by Friedman et al. is already a Newton-type method, but experiments in Yuan et al. (2010) indicated that the existing GLMNET implementation may face difficulties for some largescale problems. In this paper, we propose an improved GLMNET to address some theoretical and implementation issues. In particular, as a Newton-type method, GLMNET achieves fast local convergence, but may fail to quickly obtain a useful solution. By a careful design to adjust the effort for each iteration, our method is efficient for both loosely or strictly solving the optimization problem. Experiments demonstrate that our improved GLMNET ismore efficient than CDN for L1-regularized logistic regression.", "citation": "Citations (159)", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University"], "authors": ["Guo-Xun Yuan.....http://dblp.org/pers/hd/y/Yuan:Guo=Xun", "Chia-Hua Ho.....http://dblp.org/pers/hd/h/Ho:Chia=Hua", "Chih-Jen Lin.....http://dblp.org/pers/hd/l/Lin:Chih=Jen"], "conf": "kdd", "year": "2011", "pages": 9}