{"title": "Leftover Hash Lemma, Revisited.", "fields": ["leftover hash lemma", "key derivation function", "randomness extractor", "pseudorandom generator", "universal hashing"], "abstract": "The famous Leftover Hash Lemma (LHL) states that (almost) universal hash functions are good randomness extractors. Despite its numerous applications, LHL-based extractors suffer from the following two limitations: - Large Entropy Loss: to extract v bits from distribution X of minentropy m which are e-close to uniform, one must set v ≤ m - 2 log (1/e), meaning that the entropy loss L = m - v ≥ 2 log (1/e). For many applications, such entropy loss is too large. - Large Seed Length: the seed length n of (almost) universal hash function required by the LHL must be at least n ≥ min(u - v, v + 2 log (1/e) - O(1), where u is the length of the source, and must grow with the number of extracted bits.\n\nQuite surprisingly, we show that both limitations of the LHL - large entropy loss and large seed - can be overcome (or, at least, mitigated) in various important scenarios. First, we show that entropy loss could be reduced to L = log(1/e) for the setting of deriving secret keys for a wide range of cryptographic applications. Specifically, the security of these schemes with an LHL-derived key gracefully degrades from e to at most e + √e2-L. (Notice that, unlike standard LHL, this bound is meaningful even when one extracts more bits than the min-entropy we have!) Based on these results we build a general computational extractor that enjoys low entropy loss and can be used to instantiate a generic key derivation function for any cryptographic application.\n\nSecond, we study the soundness of the natural expand-then-extract approach, where one uses a pseudorandom generator (PRG) to expand a short \"input seed\" S into a longer \"output seed\" S', and then use the resulting S' as the seed required by the LHL (or, more generally, by any randomness extractor). We show that, in general, the expandthen-extract approach is not sound if the Decisional Diffie-Hellman assumption is true. Despite that, we show that it is sound either: (1) when extracting a \"small\" (logarithmic in the security of the PRG) number of bits; or (2) in minicrypt. Implication (2) suggests that the expandthen-extract approach is likely secure when used with \"practical\" PRGs, despite lacking a reductionist proof of security!", "citation": "Citations (80)", "departments": ["Microsoft", "New York University", "IBM", "Université catholique de Louvain", "CWI Amsterdam"], "authors": ["Boaz Barak.....http://dblp.org/pers/hd/b/Barak:Boaz", "Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Hugo Krawczyk.....http://dblp.org/pers/hd/k/Krawczyk:Hugo", "Olivier Pereira.....http://dblp.org/pers/hd/p/Pereira:Olivier", "Krzysztof Pietrzak.....http://dblp.org/pers/hd/p/Pietrzak:Krzysztof", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier", "Yu Yu.....http://dblp.org/pers/hd/y/Yu_0001:Yu"], "conf": "crypto", "year": "2011", "pages": 20}