{"title": "Text-based image retrieval using progressive multi-instance learning.", "fields": ["data set", "contextual image classification", "exploit", "visual word", "automatic image annotation"], "abstract": "Relevant and irrelevant images collected from the Web (e.g., Flickr.com) have been employed as loosely labeled training data for image categorization and retrieval. In this work, we propose a new approach to learn a robust classifier for text-based image retrieval (TBIR) using relevant and irrelevant training web images, in which we explicitly handle noise in the loose labels of training images. Specifically, we first partition the relevant and irrelevant training web images into clusters. By treating each cluster as a “bag” and the images in each bag as “instances”, we formulate this task as a multi-instance learning problem with constrained positive bags, in which each positive bag contains at least a portion of positive instances. We present a new algorithm called MIL-CPB to effectively exploit such constraints on positive bags and predict the labels of test instances (images). Observing that the constraints on positive bags may not always be satisfied in our application, we additionally propose a progressive scheme (referred to as Progressive MIL-CPB, or PMIL-CPB) to further improve the retrieval performance, in which we iteratively partition the top-ranked training web images from the current MIL-CPB classifier to construct more confident positive “bags” and then add these new “bags” as training data to learn the subsequent MIL-CPB classifiers. Comprehensive experiments on two challenging real-world web image data sets demonstrate the effectiveness of our approach.", "citation": "Citations (71)", "year": "2011", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "conf": "iccv", "authors": ["Wen Li.....http://dblp.org/pers/hd/l/Li_0001:Wen", "Lixin Duan.....http://dblp.org/pers/hd/d/Duan:Lixin", "Dong Xu.....http://dblp.org/pers/hd/x/Xu_0001:Dong", "Ivor Wai-Hung Tsang.....http://dblp.org/pers/hd/t/Tsang:Ivor_Wai=Hung"], "pages": 7}