{"title": "Close the loop: Joint blind image restoration and recognition with sparse representation prior.", "fields": ["standard test image", "training set", "image restoration", "motion blur", "sparse approximation"], "abstract": "Most previous visual recognition systems simply assume ideal inputs without real-world degradations, such as low resolution, motion blur and out-of-focus blur. In presence of such unknown degradations, the conventional approach first resorts to blind image restoration and then feeds the restored image into a classifier. Treating restoration and recognition separately, such a straightforward approach, however, suffers greatly from the defective output of the ill-posed blind image restoration. In this paper, we present a joint blind image restoration and recognition method based on the sparse representation prior to handle the challenging problem of face recognition from low-quality images, where the degradation model is realistic and totally unknown. The sparse representation prior states that the degraded input image, if correctly restored, will have a good sparse representation in terms of the training set, which indicates the identity of the test image. The proposed algorithm achieves simultaneous restoration and recognition by iteratively solving the blind image restoration in pursuit of the sparest representation for recognition. Based on such a sparse representation prior, we demonstrate that the image restoration task and the recognition task can benefit greatly from each other. Extensive experiments on face datasets under various degradations are carried out and the results of our joint model shows significant improvements over conventional methods of treating the two tasks independently.", "citation": "Citations (129)", "year": "2011", "departments": ["Northwestern Polytechnical University", "University of Illinois at Urbana–Champaign", "Northwestern Polytechnical University", "United States Army Research Laboratory", "University of Illinois at Urbana–Champaign"], "conf": "iccv", "authors": ["Haichao Zhang.....http://dblp.org/pers/hd/z/Zhang:Haichao", "Jianchao Yang.....http://dblp.org/pers/hd/y/Yang:Jianchao", "Yanning Zhang.....http://dblp.org/pers/hd/z/Zhang:Yanning", "Nasser M. Nasrabadi.....http://dblp.org/pers/hd/n/Nasrabadi:Nasser_M=", "Thomas S. Huang.....http://dblp.org/pers/hd/h/Huang:Thomas_S="], "pages": 8}