{"title": "Throughput and delay scaling of general cognitive networks.", "fields": ["cognitive radio", "interdependent networks", "hierarchical network model", "dynamic network analysis", "cognitive network"], "abstract": "There has been recent interest within the networking research community to understand how performance scales in cognitive networks with overlapping n primary nodes and m secondary nodes. Two important metrics, i.e., throughput and delay, are studied in this paper. We first propose a simple and extendable decision model, i.e., the hybrid protocol model, for the secondary nodes to exploit spatial gap among primary transmissions for frequency reuse. Then a framework for general cognitive networks is established based on the hybrid protocol model to analyze the occurrence of transmission opportunities for secondary nodes. We show that in the case that the transmission range of the secondary network is smaller than that of the primary network in order, as long as the primary network operates in a generalized round-robin TDMA fashion, the hybrid protocol model suffice to guide the secondary network to achieve the same throughput and delay scaling as a standalone network, without harming the transmissions of the primary network. Our approach is general in the sense that we only make a few weak assumptions on both networks, and therefore obtains a wide variety of results. We show secondary networks can obtain the same order of throughput and delay as standalone networks when primary networks are classic static networks, networks with random walk mobility, hybrid networks, multicast networks, hierarchically cooperative networks or clustered networks. Our work presents a relatively complete picture of the performance scaling of cognitive networks and provides fundamental insight on the design of them.", "citation": "Citations (51)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Wentao Huang.....http://dblp.org/pers/hd/h/Huang:Wentao", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing"], "conf": "infocom", "year": "2011", "pages": 9}