{"title": "Enabling and scaling biomolecular simulations of 100 million atoms on petascale machines with a multicore-optimized message-driven runtime.", "fields": ["cray xt5", "memory footprint", "parallel i o", "jaguar", "petascale computing"], "abstract": "A 100-million-atom biomolecular simulation with NAMD is one of the three benchmarks for the NSF-funded sustainable petascale machine. Simulating this large molecular system on a petascale machine presents great challenges, including handling I/O, large memory footprint and getting good strong-scaling results. In this paper, we present parallel I/O techniques to enable the simulation. A new SMP model is designed to efficiently utilize ubiquitous wide multicore clusters by extending the Charm++ asynchronous message-driven runtime. We exploit node-aware techniques to optimize both the application and the underlying SMP runtime. Hierarchical load balancing is further exploited to scale NAMD to the full Jaguar PF Cray XT5 (224,076 cores) at Oak Ridge National Laboratory, both with and without PME full electrostatics, achieving 93% parallel efficiency (vs 6720 cores) at 9 ms per step for a simple cutoff calculation. Excellent scaling is also obtained on 65,536 cores of the Intrepid Blue Gene/P at Argonne National Laboratory.", "citation": "Citations (64)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Chao Mei.....http://dblp.org/pers/hd/m/Mei:Chao", "Yanhua Sun.....http://dblp.org/pers/hd/s/Sun:Yanhua", "Gengbin Zheng.....http://dblp.org/pers/hd/z/Zheng:Gengbin", "Eric J. Bohm.....http://dblp.org/pers/hd/b/Bohm:Eric_J=", "Laxmikant V. Kalé.....http://dblp.org/pers/hd/k/Kal=eacute=:Laxmikant_V=", "James C. Phillips.....http://dblp.org/pers/hd/p/Phillips:James_C=", "Chris Harrison.....http://dblp.org/pers/hd/h/Harrison:Chris"], "conf": "sc", "year": "2011", "pages": 11}