{"title": "Semantics of Caching with SPOCA: A Stateless, Proportional, Optimally-Consistent Addressing Algorithm.", "fields": ["cache", "disk buffer", "cpu cache", "stateless protocol", "content delivery network"], "abstract": "A key measure for the success of a Content Delivery Network is controlling cost of the infrastructure required to serve content to its end users. In this paper, we take a closer look at how Yahoo! efficiently serves millions of videos from its video library. A significant portion of this video library consists of a large number of relatively unpopular user-generated content and a small set of popular videos that changes over time.\n\nYahoo!'s initial architecture to handle the distribution of videos to Internet clients used shared storage to hold the videos and a hardware load balancer to handle failures and balance the load across the front-end server that did the actual transfers to the clients. The front-end servers used both their memory and hard drives as caches for the content they served. We found that this simple architecture did not use the front-end server caches effectively.\n\nWe were able to improve our front-end caching while still being able to tolerate faults, gracefully handle the addition and removal of servers, and take advantage of geographic locality when serving content. We describe our solution, called SPOCA (Stateless, Proportional, Optimally-Consistent Addressing), which reduce disk cache misses from 5% to less than 1%, and increase memory cache hits from 45% to 80% and thereby result ing in the overall cache hits from 95% to 99.6%. Unlike other consistent addressing mechanisms, SPOCA facilitates nearly-optimal load balancing.", "citation": "Citations (9)", "departments": ["Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!"], "authors": ["Ashish Chawla.....http://dblp.org/pers/hd/c/Chawla:Ashish", "Benjamin Reed.....http://dblp.org/pers/hd/r/Reed:Benjamin", "Karl Juhnke.....http://dblp.org/pers/hd/j/Juhnke:Karl", "Ghousuddin Syed.....http://dblp.org/pers/hd/s/Syed:Ghousuddin"], "conf": "usenix", "year": "2011", "pages": -1}