{"title": "A Formal Study of Power Variability Issues and Side-Channel Attacks for Nanoscale Devices.", "fields": ["hamming weight", "physical security", "countermeasure", "microelectronics", "side channel attack", "information leakage"], "abstract": "Variability is a central issue in deep submicron technologies, in which it becomes increasingly difficult to produce two chips with the same behavior. While the impact of variability is well understood from the microelectronic point of view, very few works investigated its significance for cryptographic implementations. This is an important concern as 65-nanometer and smaller technologies are soon going to equip an increasing number of security-enabled devices. Based on measurements performed on 20 prototype chips of an AES S-box, this paper provides the first comprehensive treatment of variability issues for side-channel attacks. We show that technology scaling implies important changes in terms of physical security. First, common leakage models (e.g. based on the Hamming weight of the manipulated data) are no longer valid as the size of transistors shrinks, even for standard CMOS circuits. This impacts both the evaluation of hardware countermeasures and formal works assuming that independent computations lead to independent leakage. Second, we discuss the consequences of variability for profiled side-channel attacks. We study the extend to which a leakage model that is carefully profiled for one device can lead to successful attacks against another device. We also define the perceived information to quantify this context, which generalizes the notion of mutual information with possibly degraded leakage models. Our results exhibit that existing side-channel attacks are not perfectly suited to this new context. They constitute an important step in better understanding the challenges raised by future technologies for the theory and practice of leakage resilient cryptography.", "citation": "Citations (135)", "year": "2011", "departments": ["Université catholique de Louvain", "Université catholique de Louvain", "Université catholique de Louvain", "Université catholique de Louvain", "Université catholique de Louvain"], "conf": "eurocrypt", "authors": ["Mathieu Renauld.....http://dblp.org/pers/hd/r/Renauld:Mathieu", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier", "Nicolas Veyrat-Charvillon.....http://dblp.org/pers/hd/v/Veyrat=Charvillon:Nicolas", "Dina Kamel.....http://dblp.org/pers/hd/k/Kamel:Dina", "Denis Flandre.....http://dblp.org/pers/hd/f/Flandre:Denis"], "pages": 20}