{"title": "Efficient core decomposition in massive networks.", "fields": ["strength of a graph", "factor critical graph", "hypercube graph", "k edge connected graph", "degeneracy"], "abstract": "The k-core of a graph is the largest subgraph in which every vertex is connected to at least k other vertices within the subgraph. Core decomposition finds the k-core of the graph for every possible k. Past studies have shown important applications of core decomposition such as in the study of the properties of large networks (e.g., sustainability, connectivity, centrality, etc.), for solving NP-hard problems efficiently in real networks (e.g., maximum clique finding, densest subgraph approximation, etc.), and for large-scale network fingerprinting and visualization. The k-core is a well accepted concept partly because there exists a simple and efficient algorithm for core decomposition, by recursively removing the lowest degree vertices and their incident edges. However, this algorithm requires random access to the graph and hence assumes the entire graph can be kept in main memory. Nevertheless, real-world networks such as online social networks have become exceedingly large in recent years and still keep growing at a steady rate. In this paper, we propose the first external-memory algorithm for core decomposition in massive graphs. When the memory is large enough to hold the graph, our algorithm achieves comparable performance as the in-memory algorithm. When the graph is too large to be kept in the memory, our algorithm requires only O(k max ) scans of the graph, where k max  is the largest core number of the graph. We demonstrate the efficiency of our algorithm on real networks with up to 52.9 million vertices and 1.65 billion edges.", "citation": "Citations (125)", "departments": ["Nanyang Technological University", "Chinese Academy of Sciences", "Nanyang Technological University", "University of Waterloo"], "authors": ["James Cheng.....http://dblp.org/pers/hd/c/Cheng:James", "Yiping Ke.....http://dblp.org/pers/hd/k/Ke:Yiping", "Shumo Chu.....http://dblp.org/pers/hd/c/Chu:Shumo", "M. Tamer Özsu.....http://dblp.org/pers/hd/=/=Ouml=zsu:M=_Tamer"], "conf": "icde", "year": "2011", "pages": 12}