{"title": "Towards accurate and efficient representation of image irradiance of convex-Lambertian objects under unknown near lighting.", "fields": ["harmonic analysis", "orthonormal basis", "function approximation", "basis function", "radiance"], "abstract": "Surface irradiance signals are turned into outgoing radiance through the surface reflectance function, which can be significantly perturbed by the illumination conditions. Due to their low-frequency nature, irradiance signals can be represented using low-order basis functions, where spherical harmonics (SH) have been extensively used to provide such basis. When capturing image irradiance from a single viewpoint, the visible part of the object's surface constructs the upper hemisphere of the surface normals where the SH are no longer orthonormal. This reduced domain paves the way for even lower-dimensional approximation since full spherical representation is not needed. While harmonic basis are known to be optimal under distant light, light coming from near-by objects and indoor environments are common near light scenarios; it is essential to relax distant light assumption. Considering light source(s) distributed uniformly over the upper hemisphere, we propose the use of hemispherical harmonics (HSH) to model image irradiance of convex Lambertian objects perceived from single viewpoint under unknown near illumination. We prove analytically, and experimentally validated, that the Lambertian kernel has a more compact harmonic expansion in the hemispherical domain when compared to its spherical counterpart. We illustrate that HSH provide an efficient and accurate low-dimensional representation of image irradiance of Lambertian objects under near lighting conditions in contrast to SH.", "citation": "Citations (6)", "year": "2011", "departments": ["University of Louisville", "University of Louisville", "University of Louisville"], "conf": "iccv", "authors": ["Shireen Y. Elhabian.....http://dblp.org/pers/hd/e/Elhabian:Shireen_Y=", "Ham M. Rara.....http://dblp.org/pers/hd/r/Rara:Ham_M=", "Aly A. Farag.....http://dblp.org/pers/hd/f/Farag:Aly_A="], "pages": 6}