{"title": "On adaptive-width channel allocation in non-cooperative, multi-radio wireless networks.", "fields": ["solution concept", "nash equilibrium", "strategic dominance", "radio spectrum", "channel allocation schemes"], "abstract": "Due to the limitation of radio spectrum resource and fast growing of wireless applications, careful channel allocation is highly needed to mitigate the performance degradation of wireless networks because of interference among different users. While most of the existing works consider allocating fixed-width channels, combining contiguous channels may provide an alternative way to better utilize the available channels. In this paper, we study the problem of adaptive-width channel allocation from a game-theoretic point of view, in which the nodes are rational and always pursue their own objectives. We first model the problem as a strategic game, and show the existence of Nash equilibrium (NE), when there is no exogenous factor to influence players' behavior. We further propose a charging scheme to influence the players' behavior, by which the system is guaranteed to converge to a Dominant Strategy Equilibrium (DSE), a solution concept that gives participants much stronger incentives. We show that, when the system converges to a DSE, it also achieves global optimality, in terms of system-wide throughput without starvation. Numerical results verify that with our charging scheme, the system-wide throughput obtained is higher as compared to the throughput obtained when system is in NE.", "citation": "Citations (34)", "departments": ["Shanghai Jiao Tong University", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Shanghai Jiao Tong University"], "authors": ["Fan Wu.....http://dblp.org/pers/hd/w/Wu_0006:Fan", "Nikhil Singh.....http://dblp.org/pers/hd/s/Singh:Nikhil", "Nitin H. Vaidya.....http://dblp.org/pers/hd/v/Vaidya:Nitin_H=", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai"], "conf": "infocom", "year": "2011", "pages": 9}