{"title": "In defense of soft-assignment coding.", "fields": ["probabilistic logic", "contextual image classification", "context adaptive variable length coding", "context adaptive binary arithmetic coding", "linear network coding"], "abstract": "In object recognition, soft-assignment coding enjoys computational efficiency and conceptual simplicity. However, its classification performance is inferior to the newly developed sparse or local coding schemes. It would be highly desirable if its classification performance could become comparable to the state-of-the-art, leading to a coding scheme which perfectly combines computational efficiency and classification performance. To achieve this, we revisit soft-assignment coding from two key aspects: classification performance and probabilistic interpretation. For the first aspect, we argue that the inferiority of soft-assignment coding is due to its neglect of the underlying manifold structure of local features. To remedy this, we propose a simple modification to localize the soft-assignment coding, which surprisingly achieves comparable or even better performance than existing sparse or local coding schemes while maintaining its computational advantage. For the second aspect, based on our probabilistic interpretation of the soft-assignment coding, we give a probabilistic explanation to the magic max-pooling operation, which has successfully been used by sparse or local coding schemes but still poorly understood. This probability explanation motivates us to develop a new mix-order max-pooling operation which further improves the classification performance of the proposed coding scheme. As experimentally demonstrated, the localized soft-assignment coding achieves the state-of-the-art classification performance with the highest computational efficiency among the existing coding schemes.", "citation": "Citations (479)", "year": "2011", "departments": ["Australian National University", "Australian National University", "Australian National University"], "conf": "iccv", "authors": ["Lingqiao Liu.....http://dblp.org/pers/hd/l/Liu:Lingqiao", "Lei Wang.....http://dblp.org/pers/hd/w/Wang_0001:Lei", "Xinwang Liu.....http://dblp.org/pers/hd/l/Liu:Xinwang"], "pages": 8}