{"title": "PhotoNet: A Similarity-Aware Picture Delivery Service for Situation Awareness.", "fields": ["visual communication", "redundancy", "situation awareness", "content centric networking", "information quality"], "abstract": "We propose PhotoNet, a picture delivery service for camera sensor networks. PhotoNet is motivated by the needs of disaster-response applications, where a group of survivors and first responders may survey damage and send images to a rescue center in the absence of a functional communication infrastructure. The protocol runs on mobile devices, handling opportunistic forwarding (when they come in contact) and in-network storage. It assigns priorities to images for forwarding and replacement depending on the degree of similarity (or dissimilarity) among them, such that scarce resources are assigned to delivery of most ``deserving'' content first. Prioritization aims at reducing semantic redundancy such as that between pictures of the same scene at the same location taken from slightly different angles. This is in contrast to redundancy among identical objects and among time series data. PhotoNet delivers more diverse pictures in terms of event coverage suppressing logically redundant content belonging to the same event. We show that, in resource constrained networks, reducing semantic redundancy can significantly improve the utility of the service.", "citation": "Citations (62)", "year": "2011", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "rtss", "authors": ["Md. Yusuf Sarwar Uddin.....http://dblp.org/pers/hd/u/Uddin:Md=_Yusuf_Sarwar", "Hongyan Wang.....http://dblp.org/pers/hd/w/Wang:Hongyan", "Fatemeh Saremi.....http://dblp.org/pers/hd/s/Saremi:Fatemeh", "Guo-Jun Qi.....http://dblp.org/pers/hd/q/Qi:Guo=Jun", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F=", "Thomas S. Huang.....http://dblp.org/pers/hd/h/Huang:Thomas_S="], "pages": 10}