{"title": "Flexible use of cloud resources through profit maximization and price discrimination.", "fields": ["data center", "cloud computing security", "price discrimination", "profit maximization", "scalability"], "abstract": "Modern frameworks, such as Hadoop, combined with abundance of computing resources from the cloud, offer a significant opportunity to address long standing challenges in distributed processing. Infrastructure-as-a-Service clouds reduce the investment cost of renting a large data center while distributed processing frameworks are capable of efficiently harvesting the rented physical resources. Yet, the performance users get out of these resources varies greatly because the cloud hardware is shared by all users. The value for money cloud consumers achieve renders resource sharing policies a key player in both cloud performance and user satisfaction. In this paper, we employ microeconomics to direct the allotment of cloud resources for consumption in highly scalable master-worker virtual infrastructures. Our approach is developed on two premises: the cloud-consumer always has a budget and cloud physical resources are limited. Using our approach, the cloud administration is able to maximize per-user financial profit. We show that there is an equilibrium point at which our method achieves resource sharing proportional to each user's budget. Ultimately, this approach allows us to answer the question of how many resources a consumer should request from the seemingly endless pool provided by the cloud.", "citation": "Citations (104)", "departments": ["National and Kapodistrian University of Athens", "National and Kapodistrian University of Athens", "Columbia University", "National and Kapodistrian University of Athens", "Columbia University"], "authors": ["Konstantinos Tsakalozos.....http://dblp.org/pers/hd/t/Tsakalozos:Konstantinos", "Herald Kllapi.....http://dblp.org/pers/hd/k/Kllapi:Herald", "Eva Sitaridi.....http://dblp.org/pers/hd/s/Sitaridi:Eva", "Mema Roussopoulos.....http://dblp.org/pers/hd/r/Roussopoulos:Mema", "Dimitris Paparas.....http://dblp.org/pers/hd/p/Paparas:Dimitris", "Alex Delis.....http://dblp.org/pers/hd/d/Delis:Alex"], "conf": "icde", "year": "2011", "pages": 12}