{"title": "FindU: Privacy-preserving personal profile matching in mobile social networks.", "fields": ["encryption", "user profile", "secure multi party computation", "information sensitivity", "information privacy"], "abstract": "Making new connections according to personal preferences is a crucial service in mobile social networking, where the initiating user can find matching users within physical proximity of him/her. In existing systems for such services, usually all the users directly publish their complete profiles for others to search. However, in many applications, the users' personal profiles may contain sensitive information that they do not want to make public. In this paper, we propose FindU, the first privacy-preserving personal profile matching schemes for mobile social networks. In FindU, an initiating user can find from a group of users the one whose profile best matches with his/her; to limit the risk of privacy exposure, only necessary and minimal information about the private attributes of the participating users is exchanged. Several increasing levels of user privacy are defined, with decreasing amounts of exchanged profile information. Leveraging secure multi-party computation (SMC) techniques, we propose novel protocols that realize two of the user privacy levels, which can also be personalized by the users. We provide thorough security analysis and performance evaluation on our schemes, and show their advantages in both security and efficiency over state-of-the-art schemes.", "citation": "Citations (243)", "departments": ["Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "University of Arkansas at Little Rock", "Worcester Polytechnic Institute"], "authors": ["Ming Li.....http://dblp.org/pers/hd/l/Li_0003:Ming", "Ning Cao.....http://dblp.org/pers/hd/c/Cao_0001:Ning", "Shucheng Yu.....http://dblp.org/pers/hd/y/Yu:Shucheng", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing"], "conf": "infocom", "year": "2011", "pages": 9}