{"title": "On-the-fly elimination of dynamic irregularities for GPU computing.", "fields": ["massively parallel", "profiling", "general purpose computing on graphics processing units", "cuda", "thread"], "abstract": "The power-efficient massively parallel Graphics Processing Units (GPUs) have become increasingly influential for general-purpose computing over the past few years. However, their efficiency is sensitive to dynamic irregular memory references and control flows in an application. Experiments have shown great performance gains when these irregularities are removed. But it remains an open question how to achieve those gains through software approaches on modern GPUs.   This paper presents a systematic exploration to tackle dynamic irregularities in both control flows and memory references. It reveals some properties of dynamic irregularities in both control flows and memory references, their interactions, and their relations with program data and threads. It describes several heuristics-based algorithms and runtime adaptation techniques for effectively removing dynamic irregularities through data reordering and job swapping. It presents a framework, G-Streamline, as a unified software solution to dynamic irregularities in GPU computing. G-Streamline has several distinctive properties. It is a pure software solution and works on the fly, requiring no hardware extensions or offline profiling. It treats both types of irregularities at the same time in a holistic fashion, maximizing the whole-program performance by resolving conflicts among optimizations. Its optimization overhead is largely transparent to GPU kernel executions, jeopardizing no basic efficiency of the GPU application. Finally, it is robust to the presence of various complexities in GPU applications. Experiments show that G-Streamline is effective in reducing dynamic irregularities in GPU computing, producing speedups between 1.07 and 2.5 for a variety of applications.", "citation": "Citations (190)", "year": "2011", "departments": ["College of William & Mary", "College of William & Mary", "College of William & Mary", "College of William & Mary", "College of William & Mary"], "conf": "asplos", "authors": ["Eddy Z. Zhang.....http://dblp.org/pers/hd/z/Zhang:Eddy_Z=", "Yunlian Jiang.....http://dblp.org/pers/hd/j/Jiang:Yunlian", "Ziyu Guo.....http://dblp.org/pers/hd/g/Guo:Ziyu", "Kai Tian.....http://dblp.org/pers/hd/t/Tian:Kai", "Xipeng Shen.....http://dblp.org/pers/hd/s/Shen:Xipeng"], "pages": 12}