{"title": "A Novel Technique for Avoiding Plateaus of Greedy Best-First Search in Satisficing Planning.", "fields": ["beam search", "heuristic", "best first search", "incremental heuristic search", "satisficing", "heuristic function", "dbfs"], "abstract": "Heuristic functions play an important role in drastically improving performance of satisficing planners based on greedy best-first search (GBFS). While automatic generation of heuristic functions (e.g., (Hoffmann and Nebel 2001; Helmert 2006)) enables state-of-the-art satisficing planners to solve very complicated planning problems including benchmarks in the International Planning Competitions, accurate evaluations of nodes still remain as a challenging task.   Although GBFS is fundamental and powerful in planning, it has an essential drawback when heuristic functions return inaccurate estimates. Assume that a heuristic function underestimates the difficulties of unpromising nodes. Then, since GBFS must expand nodes with small heuristic values first, it spends most of time in searching only unpromising areas and delays moving to the promising part.  Previous work tackles this issue by adding a  diversity  to search, which is an ability in simultaneously exploring different parts of the search space to bypass large errors in heuristic functions. Several algorithms combined with diversity (e.g., K-best-first search (KBFS) in (Felner, Kraus, and Korf 2003)) are empirically shown to be superior to naive best-first search algorithms. However, they still have limited diversity, since they do not immediately expand nodes mistakenly evaluated as very unpromising ones.  This paper presents a new technique called  diverse best-first search (DBFS) , which incorporates a diversity into search in a different way than previous search-based approaches. We show empirical results clearly showing that DBFS is effective in satisficing planning.", "citation": "Not cited", "departments": ["Tokyo Institute of Technology", "Tokyo Institute of Technology", "Tokyo Institute of Technology", "Tokyo Institute of Technology"], "authors": ["Tatsuya Imai.....http://dblp.org/pers/hd/i/Imai:Tatsuya", "Akihiro Kishimoto.....http://dblp.org/pers/hd/k/Kishimoto:Akihiro"], "conf": "aaai", "year": "2011", "pages": -1}