{"title": "When does content float? Characterizing availability of anchored information in opportunistic content sharing.", "fields": ["computer network", "mobility model", "distributed computing", "systems design", "mobile telephony"], "abstract": "We consider an opportunistic content sharing system designed to store and distribute local spatio-temporal “floating” information in uncoordinated P2P fashion relying solely on the mobile nodes passing through the area of interest, referred to as the anchor zone. Nodes within the anchor zone exchange the information in opportunistic manner, i.e., whenever two nodes come within each others' transmission range. Outside the anchor zone, the nodes are free to delete the information, since it is deemed relevant only for the nodes residing inside the anchor zone. Due to the random nature of the operation, there are no guarantees, e.g., for the information availability. By means of analytical models, we show that such a system, without any supporting infrastructure, can be a viable and surprisingly reliable option for content sharing as long as a certain criterion, referred to as the criticality condition, is met. The important quantity is the average number of encounters a randomly chosen node experiences during its sojourn time in the anchor zone, which again depends on the communication range and the mobility pattern. The theoretical studies are complemented with simulation experiments with various mobility models showing good agreement with the analytical results.", "citation": "Citations (98)", "departments": ["Aalto University", "Aalto University", "Aalto University", "Helsinki Institute for Information Technology", "Aalto University"], "authors": ["Esa Hyytiä.....http://dblp.org/pers/hd/h/Hyyti=auml=:Esa", "Jorma T. Virtamo.....http://dblp.org/pers/hd/v/Virtamo:Jorma_T=", "Pasi E. Lassila.....http://dblp.org/pers/hd/l/Lassila:Pasi_E=", "Jussi Kangasharju.....http://dblp.org/pers/hd/k/Kangasharju:Jussi", "Jörg Ott.....http://dblp.org/pers/hd/o/Ott:J=ouml=rg"], "conf": "infocom", "year": "2011", "pages": 9}