{"title": "OpenIMAJ and ImageTerrier: Java libraries and tools for scalable multimedia analysis and indexing of images.", "fields": ["content based image retrieval", "search engine indexing", "cluster analysis", "image retrieval", "java"], "abstract": "OpenIMAJ and ImageTerrier are recently released open-source libraries and tools for experimentation and development of multimedia applications using Java-compatible programming languages. OpenIMAJ (the Open toolkit for Intelligent Multimedia Analysis in Java) is a collection of libraries for multimedia analysis. The image libraries contain methods for processing images and extracting state-of-the-art features, including SIFT. The video and audio libraries support both cross-platform capture and processing. The clustering and nearest-neighbour libraries contain efficient, multi-threaded implementations of clustering algorithms. The clustering library makes it possible to easily create BoVW representations for images and videos. OpenIMAJ also incorporates a number of tools to enable extremely-large-scale multimedia analysis using distributed computing with Apache Hadoop.   ImageTerrier is a scalable, high-performance search engine platform for content-based image retrieval applications using features extracted with the OpenIMAJ library and tools. The ImageTerrier platform provides a comprehensive test-bed for experimenting with image retrieval techniques. The platform incorporates a state-of-the-art implementation of the single-pass indexing technique for constructing inverted indexes and is capable of producing highly compressed index data structures.", "citation": "Citations (67)", "departments": ["University of Southampton", "University of Southampton", "University of Southampton"], "authors": ["Jonathon S. Hare.....http://dblp.org/pers/hd/h/Hare:Jonathon_S=", "Sina Samangooei.....http://dblp.org/pers/hd/s/Samangooei:Sina", "David Dupplaw.....http://dblp.org/pers/hd/d/Dupplaw:David"], "conf": "mm", "year": "2011", "pages": 4}