{"title": "Understanding robustness of mobile networks through temporal network measures.", "fields": ["complex network", "cellular network", "dynamic network analysis", "spite", "network simulation"], "abstract": "The application of complex network theory to communication systems has led to several important results. Nonetheless, previous research has often neglected to take into account their temporal properties, which in many real scenarios play a pivotal role. Mainly because of mobility, transmission delays or protocol design, a communication network should not be considered only as a static entity. At the same time, network robustness has come extensively under scrutiny. Understanding whether networked systems can undergo structural damage and yet perform efficiently is crucial to both their protection against failures and to the design of new applications. In spite of this, it is still unclear what type of resilience we may expect in a network that continuously changes over time. In this work we present the first attempt to define the concept of temporal network robustness: we describe a measure of network robustness for time-varying networks and we show how it performs on different classes of random models by means of analytical and numerical evaluation. Particularly, we show how static approximation can wrongly indicate high robustness of fragile networks when adopted in mobile time-varying networks, while a temporal approach captures more accurately the system performance.", "citation": "Citations (10)", "departments": ["University of Cambridge", "University of Cambridge", "University of Cambridge", "BBN Technologies", "IBM"], "authors": ["Salvatore Scellato.....http://dblp.org/pers/hd/s/Scellato:Salvatore", "Ilias Leontiadis.....http://dblp.org/pers/hd/l/Leontiadis:Ilias", "Cecilia Mascolo.....http://dblp.org/pers/hd/m/Mascolo:Cecilia", "Prithwish Basu.....http://dblp.org/pers/hd/b/Basu:Prithwish", "Murtaza Zafer.....http://dblp.org/pers/hd/z/Zafer:Murtaza"], "conf": "infocom", "year": "2011", "pages": 5}