{"title": "SMM: A data stream management system for knowledge discovery.", "fields": ["query optimization", "knowledge extraction", "data stream management system", "data stream mining", "sql"], "abstract": "The problem of supporting data mining applications proved to be difficult for database management systems and it is now proving to be very challenging for data stream management systems (DSMSs), where the limitations of SQL are made even more severe by the requirements of continuous queries. The major technical advances that achieved separately on DSMSs and on data stream mining algorithms have failed to converge and produce powerful data stream mining systems. Such systems, however, are essential since the traditional pull-based approach of cache mining is no longer applicable, and the push-based computing mode of data streams and their bursty traffic complicate application development. For instance, to write mining applications with quality of service (QoS) levels approaching those of DSMSs, a mining analyst would have to contend with many arduous tasks, such as support for data buffering, complex storage and retrieval methods, scheduling, fault-tolerance, synopsis-management, load shedding, and query optimization. Our Stream Mill Miner (SMM) system solves these problems by providing a data stream mining workbench that combines the ease of specifying high-level mining tasks, as in Weka, with the performance and QoS guarantees of a DSMS. This is accomplished in three main steps. The first is an open and extensible DSMS architecture where KDD queries can be easily expressed as user-defined aggregates (UDAs)—our system combines that with the efficiency of synoptic data structures and mining-aware load shedding and optimizations. The second key component of SMM is its integrated library of fast mining algorithms that are light enough to be effective on data streams. The third advanced feature of SMM is a Mining Model Definition Language (MMDL) that allows users to define the flow of mining tasks, integrated with a simple box&arrow GUI, to shield the mining analyst from the complexities of lower-level queries. SMM is the first DSMS capable of online mining and this paper describes its architecture, design, and performance on mining queries.", "citation": "Citations (17)", "departments": ["Google", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "Indian Council of Agricultural Research"], "authors": ["Hetal Thakkar.....http://dblp.org/pers/hd/t/Thakkar:Hetal", "Nikolay Laptev.....http://dblp.org/pers/hd/l/Laptev:Nikolay", "Hamid Mousavi.....http://dblp.org/pers/hd/m/Mousavi:Hamid", "Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan", "Vincenzo Russo.....http://dblp.org/pers/hd/r/Russo:Vincenzo", "Carlo Zaniolo.....http://dblp.org/pers/hd/z/Zaniolo:Carlo"], "conf": "icde", "year": "2011", "pages": 12}