{"title": "Conformal visualization for partially-immersive platforms.", "fields": ["rendering", "graphics pipeline", "volume rendering", "data visualization", "retargeting"], "abstract": "Current VR systems such as the CAVE provide an effective platform for the immersive exploration of large 3D data. A major limitation is that in most cases at least one display surface, such as a ceiling or a back wall, is missing due to space, access or cost constraints. This partially-immersive visualization results in a substantial loss of visual information that may be acceptable for some applications; however, it becomes a major obstacle for critical tasks that need to utilize the users' entire field of vision. We have developed a conformal rendering pipeline for the visualization of datasets on partially-immersive platforms. The angle-preserving conformal mapping approach is used to render the 360° view directly onto arbitrary display configurations. It has the desirable property of preserving shapes locally, which is important for identifying shape-based features in the data. Our conformal visualization technique is applicable to rasterization, volume rendering and real-time raytracing, and in contrast to image-based retargeting approaches, it constructs accurate, artifact-free stereoscopic images. We demonstrate our conformal visualization pipeline in the 5-sided CAVE for Immersive Virtual Colonoscopy, as well as architectural and abstract data exploration. Our user study shows that on the visual polyp detection task, conformal visualization leads to improved sensitivity at comparable examination times against the traditional rendering approach.", "citation": "Citations (3)", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Kaloian Petkov.....http://dblp.org/pers/hd/p/Petkov:Kaloian", "Charilaos Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos:Charilaos", "Min Zhang.....http://dblp.org/pers/hd/z/Zhang:Min", "Arie E. Kaufman.....http://dblp.org/pers/hd/k/Kaufman:Arie_E=", "Xianfeng Gu.....http://dblp.org/pers/hd/g/Gu:Xianfeng"], "conf": "vr", "year": "2011", "pages": 8}