{"title": "The Increasing Cost Tree Search for Optimal Multi-Agent Pathfinding.", "fields": ["cons", "search tree", "speedup", "pathfinding", "machine learning", "search algorithm", "bidirectional search"], "abstract": "We address the problem of optimal pathfinding for multiple agents. Given a start state and a goal state for each of the agents, the task is to find minimal paths for the different agents while avoiding collisions. Previous work on solving this problem optimally, used traditional single-agent search variants of the A* algorithm. We present a novel formalization for this problem which includes a search tree called the increasing cost tree (ICT) and a corresponding search algorithm, called the increasing cost tree search (ICTS) that finds optimal solutions. ICTS is a two-level search algorithm. The high-level phase of ICTS searches the increasing cost tree for a set of costs (cost per agent). The low-level phase of ICTS searches for a valid path for every agent that is constrained to have the same cost as given by the high-level phase. We analyze this new formalization, compare it to the A* search formalization and provide the pros and cons of each. Following, we show how the unique formalization of ICTS allows even further pruning of the state space by grouping small sets of agents and identifying unsolvable combinations of costs. Experimental results on various domains show the benefits and limitations of our new approach. A speedup of up to 3 orders of magnitude was obtained in some cases.", "citation": "Citations (124)", "year": "2011", "departments": ["Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev"], "conf": "ijcai", "authors": ["Guni Sharon.....http://dblp.org/pers/hd/s/Sharon:Guni", "Roni Stern.....http://dblp.org/pers/hd/s/Stern:Roni", "Meir Goldenberg.....http://dblp.org/pers/hd/g/Goldenberg:Meir", "Ariel Felner.....http://dblp.org/pers/hd/f/Felner:Ariel"], "pages": 6}