{"title": "Image classification by non-negative sparse coding, low-rank and sparse decomposition.", "fields": ["contextual image classification", "matrix decomposition", "k svd", "sparse matrix", "sparse approximation"], "abstract": "We propose an image classification framework by leveraging the non-negative sparse coding, low-rank and sparse matrix decomposition techniques (LR-Sc +  SPM). First, we propose a new non-negative sparse coding along with max pooling and spatial pyramid matching method (Sc +  SPM) to extract local features' information in order to represent images, where non-negative sparse coding is used to encode local features. Max pooling along with spatial pyramid matching (SPM) is then utilized to get the feature vectors to represent images. Second, motivated by the observation that images of the same class often contain correlated (or common) items and specific (or noisy) items, we propose to leverage the low-rank and sparse matrix recovery technique to decompose the feature vectors of images per class into a low-rank matrix and a sparse error matrix. To incorporate the common and specific attributes into the image representation, we still adopt the idea of sparse coding to recode the Sc +  SPM representation of each image. In particular, we collect the columns of the both matrixes as the bases and use the coding parameters as the updated image representation by learning them through the locality-constrained linear coding (LLC). Finally, linear SVM classifier is leveraged for the final classification. Experimental results show that the proposed method achieves or outperforms the state-of-the-art results on several benchmarks.", "citation": "Citations (159)", "year": "2011", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "University of Texas at San Antonio", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "cvpr", "authors": ["Chunjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Chunjie", "Jing Liu.....http://dblp.org/pers/hd/l/Liu_0001:Jing", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng", "Hanqing Lu.....http://dblp.org/pers/hd/l/Lu:Hanqing", "Songde Ma.....http://dblp.org/pers/hd/m/Ma:Songde"], "pages": 8}