{"title": "Stackelberg games for energy-efficient power control in wireless networks.", "fields": ["transmitter", "heterogeneous network", "stackelberg competition", "cognitive radio", "pareto principle"], "abstract": "This paper addresses the power control problem in wireless networks where transmitters choose their control policy freely and selfishly in order to maximize their individual energy-efficiency. In this framework, two new scenarios are studied in details: 1. a scenario where a fraction of the transmitters can observe the power levels of the other transmitters while the latter have no sensing capabilities; 2. a scenario where the observation structure is triangular, that is, the k th  transmitter can observe the k - 1 th  transmitters (which corresponds to a multi-level hierarchical game). In both scenarios the equilibrium analysis (existence, uniqueness, determination, efficiency) is conducted. In scenario 1, it is proved that the game outcome Pareto dominates the one obtained when no transmitters can sense the others. Taking the sensing cost into account, a simple condition under which being a follower (namely a transmitter who senses) is better than a leader is provided. Interestingly, the existence of an optimum fraction of cognitive transmitters in terms of sum utility is proved in the case where the sensing cost is neglected. In scenario 2, it is proved analytically that knowing more leads to a better utility and the game outcome Pareto dominates the solution with no sensing. The derived results are illustrated by numerical results and provide some insights on how to deploy cognitive radios in heterogeneous networks in terms of sensing capabilities", "citation": "Citations (16)", "departments": ["University of Paris-Sud", "University of Paris-Sud", "Lab. Informatiq ...  84911 - FRANCE"], "authors": ["Gaoning He.....http://dblp.org/pers/hd/h/He:Gaoning", "Samson Lasaulce.....http://dblp.org/pers/hd/l/Lasaulce:Samson", "Yezekael Hayel.....http://dblp.org/pers/hd/h/Hayel:Yezekael"], "conf": "infocom", "year": "2011", "pages": 5}