{"title": "MaxFirst for MaxBRkNN.", "fields": ["space partitioning", "goto", "orders of magnitude", "recurrent neural network", "nearest neighbor search"], "abstract": "The MaxBRNN problem finds a region such that setting up a new service site within this region would guarantee the maximum number of customers by proximity. This problem assumes that each customer only uses the service provided by his/her nearest service site. However, in reality, a customer tends to go to his/her k nearest service sites. To handle this, MaxBRNN can be extended to the MaxBRkNN problem which finds an optimal region such that setting up a service site in this region guarantees the maximum number of customers who would consider the site as one of their k nearest service locations. We further generalize the MaxBRkNN problem to reflect the real world scenario where customers may have different preferences for different service sites, and at the same time, service sites may have preferred targeted customers. In this paper, we present an efficient solution called MaxFirst to solve this generalized MaxBRkNN problem. The algorithm works by partitioning the space into quadrants and searches only in those quadrants that potentially contain an optimal region. During the space partitioning, we compute the upper and lower bounds of the size of a quadrant's BRkNN, and use these bounds to prune the unpromising quadrants. Experiment results show that MaxFirst can be two to three orders of magnitude faster than the state-of-the-art algorithm.", "citation": "Citations (51)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "Institute for I ... arch, Singapore"], "authors": ["Zenan Zhou.....http://dblp.org/pers/hd/z/Zhou:Zenan", "Wei Wu.....http://dblp.org/pers/hd/w/Wu:Wei", "Xiaohui Li.....http://dblp.org/pers/hd/l/Li_0002:Xiaohui", "Mong-Li Lee.....http://dblp.org/pers/hd/l/Lee:Mong=Li", "Wynne Hsu.....http://dblp.org/pers/hd/h/Hsu:Wynne"], "conf": "icde", "year": "2011", "pages": 12}