{"title": "Optimal relay location and power allocation for low SNR broadcast relay channels.", "fields": ["relay channel", "relay", "geometric programming", "disjoint sets", "convex hull"], "abstract": "We consider the broadcast relay channel (BRC), where a single source transmits to multiple destinations with the help of a relay, in the limit of a large bandwidth. We address the problem of optimal relay positioning and power allocations at source and relay, to maximize the multicast rate from source to all destinations. To solve such a network planning problem, we develop a three-faceted approach based on an underlying information theoretic model, computational geometric aspects, and network optimization tools. Firstly, assuming superposition coding and frequency division between the source and the relay, the information theoretic framework yields a hypergraph model of the wideband BRC, which captures the dependency of achievable rate-tuples on the network topology. As the relay position varies, so does the set of hyperarcs constituting the hypergraph, rendering the combinatorial nature of optimization problem. We show that the convex hull C of all nodes in the 2-D plane can be divided into disjoint regions corresponding to distinct hyperarcs sets. These sets are obtained by superimposing all k-th order Voronoi tessellation of C. We propose an easy and efficient algorithm to compute all hyperarc sets, and prove they are polynomially bounded. Then, we circumvent the combinatorial nature of the problem by introducing continuous switch functions, that allows adapting the network hypergraph in a continuous manner. Using this switched hypergraph approach, we model the original problem as a continuous yet non-convex network optimization program. Ultimately, availing on the techniques of geometric programming and p-norm surrogate approximation, we derive a good convex approximation. We provide a detailed characterization of the problem for collinearly located destinations, and then give a generalization for arbitrarily located destinations. Finally, we show strong gains for the optimal relay positioning compared to seemingly interesting positions.", "citation": "Citations (12)", "departments": ["Technische Universität München", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Mohit Thakur.....http://dblp.org/pers/hd/t/Thakur:Mohit", "Nadia Fawaz.....http://dblp.org/pers/hd/f/Fawaz:Nadia", "Muriel Médard.....http://dblp.org/pers/hd/m/M=eacute=dard:Muriel"], "conf": "infocom", "year": "2011", "pages": 9}