{"title": "On the efficiency of collaborative caching in ISP-aware P2P networks.", "fields": ["cache", "mobile computing", "peering", "telecommunications service", "server"], "abstract": "Collaborative ISP caching has been advocated to reduce the otherwise significant amount of costly inter-ISP traffic generated by peer-to-peer (P2P) applications. The fundamental design criteria employed by ISP cache servers are, however, not well understood, with respect to dynamic P2P traffic patterns, ISP peering policies and cache server capacity constraints. In particular, there is a lack of investigations on the design and analysis of resource allocation mechanisms with awareness of inter-ISP traffic and ISP policies in the context of collaborative ISP caching — which is our focus in this study. In this paper, by characterizing practical inter-ISP traffic patterns, we have developed a theoretical framework to analyze representative cache resource allocation schemes within the design space of collaborative caching, with a particular focus on minimizing costly inter-ISP traffic. The optimization framework incorporates both locality-aware and locality-unaware peer selection strategies and ISP peering agreements, in order to examine their respective effects on the design of ISP collaborative caching mechanisms. Our analyses not only help us understand the traffic characteristics of existing P2P systems in light of realistic elements, but also offer fundamental insights into designing collaborative ISP caching mechanisms.", "citation": "Citations (28)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Toronto", "Huazhong University of Science and Technology"], "authors": ["Jie Dai.....http://dblp.org/pers/hd/d/Dai:Jie", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai"], "conf": "infocom", "year": "2011", "pages": 9}