{"title": "High-performance lattice QCD for multi-core based parallel systems using a cache-friendly hybrid threaded-MPI approach.", "fields": ["operator", "cache", "multi core processor", "lattice qcd", "memory management"], "abstract": "Lattice Quantum Chromo-dynamics (LQCD) is a computationally challenging problem that solves the discretized Dirac equation in the presence of an SU(3) gauge field. Its key operation is a matrix-vector product, known as the Dslash operator. We have developed a novel multicore architecture-friendly implementation of the Wilson-Dslash operator which delivers 75 Gflops (single-precision) on an Intel® Xeon® Processor X5680 achieving 60% computational efficiency for datasets that fit in the last-level cache. For datasets larger than the last-level cache, this performance drops to 50 Gflops. Our performance is 2–3X higher than a well-known implementation from the Chroma software suite when running on the same hardware platform. The novel implementation of LQCD reported in this paper is based on recently published the 3.5D spatial and 4.5D temporal tiling schemes. Both blocking schemes significantly reduce LQCD external memory bandwidth requirements, delivering a more compute-bound implementation. The performance advantage of our schemes will become more significant as the gap between compute flops and external memory bandwidth continues to grow. We demonstrate very good cluster-level scalability of our implementation: for a lattice of 32 3  × 256 sites, we achieve over 4 Tflops when strong-scaled to a 128 node system (1536 cores total). For the same lattice size, a full Conjugate Gradients Wilson-Dslash operator, achieves 2.95 Tflops.", "citation": "Citations (10)", "departments": ["Intel", "Intel", "Georgia Institute of Technology", "Thomas Jefferson National Accelerator Facility", "Intel"], "authors": ["Mikhail Smelyanskiy.....http://dblp.org/pers/hd/s/Smelyanskiy:Mikhail", "Karthikeyan Vaidyanathan.....http://dblp.org/pers/hd/v/Vaidyanathan:Karthikeyan", "Jee W. Choi.....http://dblp.org/pers/hd/c/Choi:Jee_W=", "Bálint Joó.....http://dblp.org/pers/hd/j/Jo=oacute=:B=aacute=lint", "Jatin Chhugani.....http://dblp.org/pers/hd/c/Chhugani:Jatin", "Michael A. Clark.....http://dblp.org/pers/hd/c/Clark:Michael_A=", "Pradeep Dubey.....http://dblp.org/pers/hd/d/Dubey:Pradeep"], "conf": "sc", "year": "2011", "pages": 11}