{"title": "Visual correlation-based image gathering for wireless multimedia sensor networks.", "fields": ["heuristic", "image sensor", "image compression", "communication complexity", "approximation algorithm"], "abstract": "In wireless multimedia sensor networks (WMSNs), visual correlation exist among multiple nearby cameras, thus leading to considerable redundancy in the collected images. This paper addresses the problem of timely and efficiently gathering visually correlated images from camera sensors. Towards this, three fundamental problems are considered, namely, MinMax Degree Hub Location (MDHL), Minimum Sum-entropy Camera Assignment (MSCA), and Maximum Lifetime Scheduling (MLS). The MDHL problem aims to find the optimal locations to place the multimedia processing hubs, which operate on different channels for concurrently collecting images from adjacent cameras, such that the number of channels required for frequency reuse is minimized. With the locations of the hubs determined by the MDHL problem, the objective of the MSCA problem is to assign each camera to a hub in such a way that the global compression gain is maximized by jointly encoding the visually correlated images gathered by each hub. At last, given a hub and its associated cameras, the MLS problem targets at designing a schedule for the cameras such that the network lifetime of the cameras is maximized by letting highly correlated cameras perform differential coding on the fly. It is proven in this paper that the MDHL problem is NP-complete, and the others are NP-hard. Consequently, approximation and heuristic algorithms are proposed. Since the designed algorithms only take the camera settings as inputs, they are independent of specific multimedia applications. Experiments and simulations show that the proposed image gathering schemes effectively enhance network throughput and image compression performance.", "citation": "Citations (22)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Pu Wang.....http://dblp.org/pers/hd/w/Wang:Pu", "Rui Dai.....http://dblp.org/pers/hd/d/Dai:Rui", "Ian F. Akyildiz.....http://dblp.org/pers/hd/a/Akyildiz:Ian_F="], "conf": "infocom", "year": "2011", "pages": 9}