{"title": "The power of comparative reasoning.", "fields": ["ordinal number", "minhash", "special case", "rank correlation", "nearest neighbor search"], "abstract": "Rank correlation measures are known for their resilience to perturbations in numeric values and are widely used in many evaluation metrics. Such ordinal measures have rarely been applied in treatment of numeric features as a representational transformation. We emphasize the benefits of ordinal representations of input features both theoretically and empirically. We present a family of algorithms for computing ordinal embeddings based on partial order statistics. Apart from having the stability benefits of ordinal measures, these embeddings are highly nonlinear, giving rise to sparse feature spaces highly favored by several machine learning methods. These embeddings are deterministic, data independent and by virtue of being based on partial order statistics, add another degree of resilience to noise. These machine-learning-free methods when applied to the task of fast similarity search outperform state-of-the-art machine learning methods with complex optimization setups. For solving classification problems, the embeddings provide a nonlinear transformation resulting in sparse binary codes that are well-suited for a large class of machine learning algorithms. These methods show significant improvement on VOC 2010 using simple linear classifiers which can be trained quickly. Our method can be extended to the case of polynomial kernels, while permitting very efficient computation. Further, since the popular Min Hash algorithm is a special case of our method, we demonstrate an efficient scheme for computing Min Hash on conjunctions of binary features. The actual method can be implemented in about 10 lines of code in most languages (2 lines in MAT-LAB), and does not require any data-driven optimization.", "citation": "Citations (99)", "year": "2011", "departments": ["Google", "Google", "Google", "Google"], "conf": "iccv", "authors": ["Jay Yagnik.....http://dblp.org/pers/hd/y/Yagnik:Jay", "Dennis Strelow.....http://dblp.org/pers/hd/s/Strelow:Dennis", "David A. Ross.....http://dblp.org/pers/hd/r/Ross:David_A=", "Ruei-Sung Lin.....http://dblp.org/pers/hd/l/Lin:Ruei=Sung"], "pages": 8}