{"title": "Towards cross-category knowledge propagation for learning visual concepts.", "fields": ["inductive transfer", "instance based learning", "semantic similarity", "category theory", "knowledge transfer"], "abstract": "In recent years, knowledge transfer algorithms have become one of most the active research areas in learning visual concepts. Most of the existing learning algorithms focuses on leveraging the knowledge transfer process which is specific to a given category. However, in many cases, such a process may not be very effective when a particular target category has very few samples. In such cases, it is interesting to examine, whether it is feasible to use cross-category knowledge for improving the learning process by exploring the knowledge in correlated categories. Such a task can be quite challenging due to variations in semantic similarities and differences between categories, which could either help or hinder the cross-category learning process. In order to address this challenge, we develop a cross-category label propagation algorithm, which can directly propagate the inter-category knowledge at instance level between the source and the target categories. Furthermore, this algorithm can automatically detect conditions under which the transfer process can be detrimental to the learning process. This provides us a way to know when the transfer of cross-category knowledge is both useful and desirable. We present experimental results on real image and video data sets in order to demonstrate the effectiveness of our approach.", "citation": "Citations (55)", "year": "2011", "departments": ["University of Illinois at Urbana–Champaign", "IBM", "Advanced Technology Center", "University of Texas at San Antonio", "University of Illinois at Urbana–Champaign"], "conf": "cvpr", "authors": ["Guo-Jun Qi.....http://dblp.org/pers/hd/q/Qi:Guo=Jun", "Charu C. Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Charu_C=", "Yong Rui.....http://dblp.org/pers/hd/r/Rui:Yong", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi", "Shiyu Chang.....http://dblp.org/pers/hd/c/Chang:Shiyu", "Thomas S. Huang.....http://dblp.org/pers/hd/h/Huang:Thomas_S="], "pages": 8}