{"title": "Analyzing Blockwise Lattice Algorithms Using Dynamical Systems.", "fields": ["lattice reduction", "lattice problem", "binary logarithm", "compromise", "affine transformation"], "abstract": "Strong lattice reduction is the key element for most attacks against lattice-based cryptosystems. Between the strongest but impractical HKZ reduction and the weak but fast LLL reduction, there have been several attempts to find efficient trade-offs. Among them, the BKZ algorithm introduced by Schnorr and Euchner [FCT'91] seems to achieve the best time/quality compromise in practice. However, no reasonable complexity upper bound is known for BKZ, and Gama and Nguyen [Eurocrypt' 08] observed experimentally that its practical runtime seems to grow exponentially with the lattice dimension. In this work, we show that BKZ can be terminated long before its completion, while still providing bases of excellent quality. More precisely, we show that if given as inputs a basis (bi)i ≤ n e Qn × n of a lattice L and a block-size β, and if terminated after Ω (n3/β2(log n + log logmaxi ||bi||)) calls to a β-dimensional HKZ-reduction (or SVP) subroutine, then BKZ returns a basis whose first vector has norm ≤ 2vβn-1/2(β-1)+3/2 ċ (det L)1/n, where vβ ≤ β is the maximum of Hermite's constants in dimensions ≤ β. To obtain this result, we develop a completely new elementary technique based on discrete-time affine dynamical systems, which could lead to the design of improved lattice reduction algorithms.", "citation": "Citations (68)", "departments": ["École normale supérieure de Lyon", "École normale supérieure de Lyon", "École normale supérieure de Lyon"], "authors": ["Guillaume Hanrot.....http://dblp.org/pers/hd/h/Hanrot:Guillaume", "Xavier Pujol.....http://dblp.org/pers/hd/p/Pujol:Xavier", "Damien Stehlé.....http://dblp.org/pers/hd/s/Stehl=eacute=:Damien"], "conf": "crypto", "year": "2011", "pages": 18}