{"title": "Rethinking the library OS from the top down.", "fields": ["working set", "queued sequential access method", "basic sequential access method", "basic direct access method", "process management"], "abstract": "This paper revisits an old approach to operating system construc-tion, the library OS, in a new context. The idea of the library OS is that the personality of the OS on which an application depends runs in the address space of the application. A small, fixed set of abstractions connects the library OS to the host OS kernel, offering the promise of better system security and more rapid independent evolution of OS components.   We describe a working prototype of a Windows 7 library OS that runs the latest releases of major applications such as Microsoft Excel, PowerPoint, and Internet Explorer. We demonstrate that desktop sharing across independent, securely isolated, library OS instances can be achieved through the pragmatic reuse of net-working protocols. Each instance has significantly lower overhead than a full VM bundled with an application: a typical application adds just 16MB of working set and 64MB of disk footprint. We contribute a new ABI below the library OS that enables application mobility. We also show that our library OS can address many of the current uses of hardware virtual machines at a fraction of the overheads. This paper describes the first working prototype of a full commercial OS redesigned as a library OS capable of running significant applications. Our experience shows that the long-promised benefits of the library OS approach better protection of system integrity and rapid system evolution are readily obtainable.", "citation": "Citations (181)", "year": "2011", "departments": ["Stony Brook University", "Massachusetts Institute of Technology", "Microsoft", "Microsoft", "Microsoft"], "conf": "asplos", "authors": ["Donald E. Porter.....http://dblp.org/pers/hd/p/Porter:Donald_E=", "Silas Boyd-Wickizer.....http://dblp.org/pers/hd/b/Boyd=Wickizer:Silas", "Jon Howell.....http://dblp.org/pers/hd/h/Howell:Jon", "Reuben Olinsky.....http://dblp.org/pers/hd/o/Olinsky:Reuben", "Galen C. Hunt.....http://dblp.org/pers/hd/h/Hunt:Galen_C="], "pages": 14}