{"title": "Markov Random Field-based fitting of a subdivision-based geometric atlas.", "fields": ["mesh generation", "markov random field", "graphical model", "polygon mesh", "polygon"], "abstract": "An accurate labeling of a multi-part, complex anatomical structure (e.g., brain) is required in order to compare data across images for spatial analysis. It can be achieved by fitting an object-specific geometric atlas that is constructed using a partitioned, high-resolution deformable mesh and tagging each of its polygons with a region label. Subdivision meshes have been used to construct such an atlas because they can provide a compact representation of a partitioned, multi-resolution, object-specific mesh structure using only a few control points. However, automated fitting of a subdivision mesh-based geometric atlas to an anatomical structure in an image is a difficult problem and has not been sufficiently addressed. In this paper, we propose a novel Markov Random Field-based method for fitting a planar, multi-part subdivision mesh to anatomical data. The optimal fitting of the atlas is obtained by determining the optimal locations of the control points. We also tackle the problem of landmark matching in tandem with atlas fitting by constructing a single graphical model to impose pose-invariant, landmark-based geometric constraints on atlas deformation. The atlas deformation is also governed by additional constraints imposed by the mesh's geometric properties and the object boundary. We demonstrate the potential of the proposed method on the difficult problem of segmenting a mouse brain and its interior regions in gene expression images which exhibit large intensity and shape variability. We obtain promising results when compared with manual annotations and prior methods.", "citation": "Citations (7)", "year": "2011", "departments": ["University of Houston", "University of Houston", "University of Houston", "Washington University in St. Louis", "Pacific Northwest National Laboratory"], "conf": "iccv", "authors": ["Uday Kurkure.....http://dblp.org/pers/hd/k/Kurkure:Uday", "Yen H. Le.....http://dblp.org/pers/hd/l/Le:Yen_H=", "Nikos Paragios.....http://dblp.org/pers/hd/p/Paragios:Nikos", "Tao Ju.....http://dblp.org/pers/hd/j/Ju:Tao", "James P. Carson.....http://dblp.org/pers/hd/c/Carson:James_P=", "Ioannis A. Kakadiaris.....http://dblp.org/pers/hd/k/Kakadiaris:Ioannis_A="], "pages": 8}