{"title": "Moguls: a model to explore the memory hierarchy for bandwidth improvements.", "fields": ["uniform memory access", "interleaved memory", "dynamic bandwidth allocation", "computing with memory", "cache pollution"], "abstract": "In recent years, the increasing number of processor cores and limited increases in main memory bandwidth have led to the problem of the  bandwidth wall , where memory bandwidth is becoming a performance bottleneck. This is especially true for emerging latency-insensitive, bandwidth-sensitive applications. Designing the memory hierarchy for a platform with an emphasis on maximizing bandwidth within a fixed power budget becomes one of the key challenges. To facilitate architects to quickly explore the design space of memory hierarchies, we propose an analytical performance model called Moguls. The Moguls model estimates the performance of an application on a system, using the bandwidth demand of the application for a range of cache capacities and the bandwidth provided by the system with those capacities. We show how to extend this model with appropriate approximations to optimize a cache hierarchy under a power constraint. The results show how many levels of cache should be designed, and what the capacity, bandwidth, and technology of each level should be. In addition, we study memory hierarchy design with hybrid memory technologies, which shows the benefits of using multiple technologies for future computing systems.", "citation": "Citations (19)", "year": "2011", "departments": ["Pennsylvania State University", "Intel", "Intel", "Pennsylvania State University", "Pennsylvania State University"], "conf": "isca", "authors": ["Guangyu Sun.....http://dblp.org/pers/hd/s/Sun:Guangyu", "Christopher J. Hughes.....http://dblp.org/pers/hd/h/Hughes:Christopher_J=", "Changkyu Kim.....http://dblp.org/pers/hd/k/Kim:Changkyu", "Jishen Zhao.....http://dblp.org/pers/hd/z/Zhao:Jishen", "Cong Xu.....http://dblp.org/pers/hd/x/Xu:Cong", "Yuan Xie.....http://dblp.org/pers/hd/x/Xie_0001:Yuan", "Yen-Kuang Chen.....http://dblp.org/pers/hd/c/Chen:Yen=Kuang"], "pages": 12}