{"title": "Capacity scaling of multihop cellular networks.", "fields": ["throughput", "stochastic geometry models of wireless networks", "cellular network", "telecommunications link", "channel capacity"], "abstract": "Wireless cellular networks are large-scale networks in which asymptotic capacity investigation is no longer a cliche. A substantial body of work has been carried out to improve the capacity of cellular networks by introducing ad hoc communications, resulting in the so-called multihop cellular networks. Most of the previous research allows ad hoc transmissions between certain source and destination pairs to alleviate base stations' relay burden. However, since reports show that Internet data traffic is becoming more and more dominant in cellular networks, we explore in this paper the capacity of multihop cellular networks with all traffic going through base stations and ad hoc transmissions only acting as relay. We first investigate the capacity of regular multihop cellular networks where both nodes and base stations are regularly placed. By fully exploiting the link rate variability, we find that multihop cellular networks can have higher per-node throughput than traditional cellular networks by a scaling factor of log 2 n. Then, for the first time we extend our study to the capacity of heterogeneous multihop cellular networks where nodes are distributed according to a general Inhomogeneous Poisson Process and base stations are randomly placed. We show that under certain conditions multihop cellular networks can also outperform traditional cellular networks by a scaling factor of log 2 n. Moreover, both throughput-fairness and bandwidth-fairness are considered as fairness constraints for both kinds of networks.", "citation": "Citations (27)", "departments": ["Mississippi State University", "Chinese Academy of Sciences", "University of Florida"], "authors": ["Pan Li.....http://dblp.org/pers/hd/l/Li_0001:Pan", "Xiaoxia Huang.....http://dblp.org/pers/hd/h/Huang:Xiaoxia", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang"], "conf": "infocom", "year": "2011", "pages": 9}