{"title": "Adaptive algorithms for detecting community structure in dynamic social networks.", "fields": ["mobile ad hoc network", "evolving networks", "cellular network", "organizational network analysis", "dynamic network analysis"], "abstract": "Social networks exhibit a very special property: community structure. Understanding the network community structure is of great advantages. It not only provides helpful information in developing more social-aware strategies for social network problems but also promises a wide range of applications enabled by mobile networking, such as routings in Mobile Ad Hoc Networks (MANETs) and worm containments in cellular networks. Unfortunately, understanding this structure is very challenging, especially in dynamic social networks where social activities and interactions are evolving rapidly. Can we quickly and efficiently identify the network community structure? Can we adaptively update the network structure based on previously known information instead of recomputing from scratch? In this paper, we present Quick Community Adaptation (QCA), an adaptive modularity-based method for identifying and tracing community structure of dynamic online social networks. Our approach has not only the power of quickly and efficiently updating network communities, through a series of changes, by only using the structures identified from previous network snapshots, but also the ability of tracing the evolution of community structure over time. To illustrate the effectiveness of our algorithm, we extensively test QCA on real-world dynamic social networks including ENRON email network, arXiv e-print citation network and Facebook network. Finally, we demonstrate the bright applicability of our algorithm via a realistic application on routing strategies in MANETs. The comparative results reveal that social-aware routing strategies employing QCA as a community detection core outperform current available methods.", "citation": "Citations (219)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida"], "authors": ["Nam P. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Nam_P=", "Thang N. Dinh.....http://dblp.org/pers/hd/d/Dinh:Thang_N=", "Ying Xuan.....http://dblp.org/pers/hd/x/Xuan:Ying", "My T. Thai.....http://dblp.org/pers/hd/t/Thai:My_T="], "conf": "infocom", "year": "2011", "pages": 9}