{"title": "Wireless link scheduling under physical interference model.", "fields": ["wireless", "latency", "distributed computing", "schedule", "power control", "interference", "job shop scheduling", "computer science", "scheduling", "radio resource management"], "abstract": "Link scheduling is a fundamental problem in multihop wireless networks because the capacities of the communication links in multihop wireless networks, rather than being fixed, vary with the underlying link schedule subject to the wireless interference constraint. The majority of algorithmic works on link scheduling in multihop wireless networks assume binary interference models such as the 802.11 interference model and the protocol interference model, which often put severe restrictions on interference constraints for practical applicability of the link schedules. On the other hand, while the physical interference model is much more realistic, the link scheduling problem under physical interference model is notoriously hard to resolve and been studied only recently by a few works. This paper conducts a full-scale algorithmic study of link scheduling for maximizing throughput capacity or minimizing the communication latency in multihop wireless networks under the physical interference model. We build a unified algorithmic framework and develop approximation algorithms for link scheduling with or without power control.", "citation": "Not cited", "departments": ["Illinois Institute of Technology", "Georgetown University", "City University of Hong Kong", "City University of Hong Kong", "Illinois Institute of Technology"], "authors": ["Peng-Jun Wan.....http://dblp.org/pers/hd/w/Wan:Peng=Jun", "Ophir Frieder.....http://dblp.org/pers/hd/f/Frieder:Ophir", "Xiaohua Jia.....http://dblp.org/pers/hd/j/Jia:Xiaohua", "F. Frances Yao.....http://dblp.org/pers/hd/y/Yao:F=_Frances", "XiaoHua Xu.....http://dblp.org/pers/hd/x/Xu:XiaoHua", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie"], "conf": "infocom", "year": "2011", "pages": 8}