{"title": "Hardware/software techniques for DRAM thermal management.", "fields": ["memory bandwidth", "universal memory", "write buffer", "memory controller", "cpu cache"], "abstract": "The performance of the main memory is an important factor on overall system performance. To improve DRAM performance, designers have been increasing chip densities and the number of memory modules. However, these approaches increase power consumption and operating temperatures: temperatures in existing DRAM modules can rise to over 95°C. Another important property of DRAM temperature is the large variation in DRAM chip temperatures. In this paper, we present our analysis collected from measurements on a real system indicating that temperatures across DRAM chips can vary by over 10°C. This work aims to minimize this variation as well as the peak DRAM temperature. We first develop a thermal model to estimate the temperature of DRAM chips and validate this model against real temperature measurements. We then propose three hardware and software schemes to reduce peak temperatures. The first technique introduces a new cache line replacement policy that reduces the number of accesses to the overheating DRAM chips. The second technique utilizes a Memory Write Buffer to improve the access efficiency of the overheated chips. The third scheme intelligently allocates pages to relatively cooler ranks of the DIMM. Our experiments show that in a high performance memory system, our schemes reduce the peak DRAM chip temperature by as much as 8.39°C over 10 workloads (5.36°C on average). Our schemes also improve performance mainly due to reduction in thermal emergencies: for a baseline system with memory bandwidth throttling scheme, the IPC is improved by as much as 15.8% (4.1% on average).", "citation": "Citations (29)", "departments": ["Northwestern University", "Northwestern University", "Stanford University", "Northwestern University", "Northwestern University"], "authors": ["Song Liu.....http://dblp.org/pers/hd/l/Liu:Song", "Brian Leung.....http://dblp.org/pers/hd/l/Leung:Brian", "Alexander Neckar.....http://dblp.org/pers/hd/n/Neckar:Alexander", "Seda Ogrenci Memik.....http://dblp.org/pers/hd/m/Memik:Seda_Ogrenci", "Gokhan Memik.....http://dblp.org/pers/hd/m/Memik:Gokhan", "Nikos Hardavellas.....http://dblp.org/pers/hd/h/Hardavellas:Nikos"], "conf": "hpca", "year": "2011", "pages": 11}