{"title": "Bayesian Chain Classifiers for Multidimensional Classification.", "fields": ["conditional independence", "random subspace method", "class variable", "classifier chains", "chaining"], "abstract": "In multidimensional classification the goal is to assign an instance to a set of different classes. This task is normally addressed either by defining a compound class variable with all the possible combinations of classes (label power-set methods, LPMs) or by building independent classifiers for each class (binary-relevance methods, BRMs). However, LPMs do not scale well and BRMs ignore the dependency relations between classes. We introduce a method for chaining binary Bayesian classifiers that combines the strengths of classifier chains and Bayesian networks for multidimensional classification. The method consists of two phases. In the first phase, a Bayesian network (BN) that represents the dependency relations between the class variables is learned from data. In the second phase, several chain classifiers are built, such that the order of the class variables in the chain is consistent with the class BN. At the end we combine the results of the different generated orders. Our method considers the dependencies between class variables and takes advantage of the conditional independence relations to build simplified models. We perform experiments with a chain of naive Bayes classifiers on different benchmark multidimensional datasets and show that our approach outperforms other state-of-the-art methods.", "citation": "Citations (107)", "year": "2011", "departments": ["Technical University of Madrid", "Technical University of Madrid", "Computer Scienc ... Puebla, Mexico", "Computer Scienc ... Puebla, Mexico", "Computer Scienc ... Puebla, Mexico"], "conf": "ijcai", "authors": ["Julio H. Zaragoza.....http://dblp.org/pers/hd/z/Zaragoza:Julio_H=", "Luis Enrique Sucar.....http://dblp.org/pers/hd/s/Sucar:Luis_Enrique", "Eduardo F. Morales.....http://dblp.org/pers/hd/m/Morales:Eduardo_F=", "Concha Bielza.....http://dblp.org/pers/hd/b/Bielza:Concha", "Pedro Larrañaga.....http://dblp.org/pers/hd/l/Larra=ntilde=aga:Pedro"], "pages": 6}