{"title": "Decidability of Definability.", "fields": ["countable set", "universal quantification", "tournament", "existential quantification", "universal algebra", "decidability", "ramsey theory"], "abstract": "For a fixed countably infinite structure Γ with finite relational signature  τ , we study the following computational problem: input are quantifier-free  τ -formulas  ϕ                     0 ,  ϕ                     1 , …,  ϕ                                            n                      that define relations  R                     0 ,  R                     1 , …,  R n                      over Γ. The question is whether the relation  R                     0  is primitive positive definable from  R                     1 , …,  R n                     , i.e., definable by a first-order formula that uses only relation symbols for  R                     1 , …,  R n                     , equality, conjunctions, and existential quantification (disjunction, negation, and universal quantification are forbidden).                  We show decidability of this problem for all structures Γ that have a first-order definition in an ordered homogeneous structure Δ with a finite relational signature whose age is a Ramsey class and determined by finitely many forbidden substructures. Examples of structures Γ with this property are the order of the rationals, the random graph, the homogeneous universal poset, the random tournament, all homogeneous universal  C -relations, and many more. We also obtain decidability of the problem when we replace primitive positive definability by existential positive, or existential definability. Our proof makes use of universal algebraic and model theoretic concepts, Ramsey theory, and a recent characterization of Ramsey classes in topological dynamics.", "citation": "Citations (74)", "departments": ["École Polytechnique", "École Normale Supérieure", "Équipe de Logiq ... n.ac.at/pinsker", "Équipe de Logiq ... ussieu.fr~todor", "Equipe de Logiq ... , Paris, France", "Equipe de Logiq ... , Paris, France"], "authors": ["Manuel Bodirsky.....http://dblp.org/pers/hd/b/Bodirsky:Manuel", "Michael Pinsker.....http://dblp.org/pers/hd/p/Pinsker:Michael", "Todor Tsankov.....http://dblp.org/pers/hd/t/Tsankov:Todor"], "conf": "lics", "year": "2011", "pages": 8}