{"title": "Adaptive delay-based congestion control for high bandwidth-delay product networks.", "fields": ["h tcp", "tcp friendly rate control", "cubic tcp", "explicit congestion notification", "tcp westwood plus"], "abstract": "The design of an end-to-end Internet congestion control protocol that could achieve high utilization, fair sharing of bottleneck bandwidth, and fast convergence while remaining TCP-friendly is an ongoing challenge that continues to attract considerable research attention. This paper presents ACP, an Adaptive end-to-end Congestion control Protocol that achieves the above goals in high bandwidth-delay product networks where TCP becomes inefficient. The main contribution of ACP is a new form of congestion window control, combining the estimation of the bottleneck queue size and a measure of fair sharing. Specifically, upon detecting congestion, ACP decreases the congestion window size by the exact amount required to empty the bottleneck queue while maintaining high utilization, while the increases of the congestion window are based on a “fairness ratio” metric of each flow, which ensures fast convergence to a fair equilibrium. We demonstrate the benefits of ACP using both ns-2 simulation and experimental measurements of a Linux prototype implementation. In particular, we show that the new protocol is TCP-friendly and allows TCP and ACP flows to coexist in various circumstances, and that ACP indeed behaves more fairly than other TCP variants under heterogeneous round-trip times (RTT).", "citation": "Citations (25)", "departments": ["University of Sydney", "Seoul National University", "Seoul National University", "Hanyang University", "University of Sydney"], "authors": ["Hyungsoo Jung.....http://dblp.org/pers/hd/j/Jung:Hyungsoo", "Shin Gyu Kim.....http://dblp.org/pers/hd/k/Kim:Shin_Gyu", "Heon Young Yeom.....http://dblp.org/pers/hd/y/Yeom:Heon_Young", "Sooyong Kang.....http://dblp.org/pers/hd/k/Kang:Sooyong", "Lavy Libman.....http://dblp.org/pers/hd/l/Libman:Lavy"], "conf": "infocom", "year": "2011", "pages": 9}