{"title": "Multiple timescale dispatch and scheduling for stochastic reliability in smart grids with wind generation integration.", "fields": ["job shop scheduling", "energy supply", "fair share scheduling", "round robin scheduling", "dynamic priority scheduling"], "abstract": "Integrating volatile renewable energy resources into the bulk power grid is challenging, due to the reliability requirement that the load and generation in the system remain balanced all the time. In this study, we tackle this challenge for smart grid with integrated wind generation, by leveraging multi-timescale dispatch and scheduling. Specifically, we consider smart grids with two classes of energy users - traditional energy users and opportunistic energy users (e.g., smart meters or smart appliances), and investigate pricing and dispatch at two timescales, via day-ahead scheduling and real-time scheduling. In day-ahead scheduling, with the statistical information on wind generation and energy demands, we characterize the optimal procurement of the energy supply and the day-ahead retail price for the traditional energy users; in real-time scheduling, with the realization of wind generation and the load of traditional energy users, we optimize real-time prices to manage the opportunistic energy users so as to achieve system-wide reliability. More specifically, when the opportunistic users are non-persistent, we obtain closed-form solutions to the two-level scheduling problem. For the persistent case, we treat the scheduling problem as a multi-timescale Markov decision process. We show that it can be recast, explicitly, as a classic Markov decision process with continuous state and action spaces, the solution to which can be found via standard techniques.", "citation": "Citations (131)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Miao He.....http://dblp.org/pers/hd/h/He:Miao", "Sugumar Murugesan.....http://dblp.org/pers/hd/m/Murugesan:Sugumar", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan"], "conf": "infocom", "year": "2011", "pages": 5}