{"title": "Birdlets: Subordinate categorization using volumetric primitives and pose-normalized appearance.", "fields": ["active appearance model", "pose", "determinative", "normalization", "categorization"], "abstract": "Subordinate-level categorization typically rests on establishing salient distinctions between part-level characteristics of objects, in contrast to basic-level categorization, where the presence or absence of parts is determinative. We develop an approach for subordinate categorization in vision, focusing on an avian domain due to the fine-grained structure of the category taxonomy for this domain. We explore a pose-normalized appearance model based on a volumetric poselet scheme. The variation in shape and appearance properties of these parts across a taxonomy provides the cues needed for subordinate categorization. Training pose detectors requires a relatively large amount of training data per category when done from scratch; using a subordinate-level approach, we exploit a pose classifier trained at the basic-level, and extract part appearance and shape information to build subordinate-level models. Our model associates the underlying image pattern parameters used for detection with corresponding volumetric part location, scale and orientation parameters. These parameters implicitly define a mapping from the image pixels into a pose-normalized appearance space, removing view and pose dependencies, facilitating fine-grained categorization from relatively few training examples.", "citation": "Citations (189)", "year": "2011", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of California, Berkeley", "University of Maryland, College Park", "University of California, Berkeley"], "conf": "iccv", "authors": ["Ryan Farrell.....http://dblp.org/pers/hd/f/Farrell:Ryan", "Om Oza.....http://dblp.org/pers/hd/o/Oza:Om", "Ning Zhang.....http://dblp.org/pers/hd/z/Zhang_0014:Ning", "Vlad I. Morariu.....http://dblp.org/pers/hd/m/Morariu:Vlad_I=", "Trevor Darrell.....http://dblp.org/pers/hd/d/Darrell:Trevor", "Larry S. Davis.....http://dblp.org/pers/hd/d/Davis:Larry_S="], "pages": 8}