{"title": "A data layout optimization framework for NUCA-based multicores.", "fields": ["exploit", "cache", "multi core processor", "data access", "program optimization"], "abstract": "Future multicore architectures are likely to include a large number of cores connected using an on-chip network with Non-uniform Cache Access (NUCA). In such architectures, whether a data request is satisfied from a local cache or a remote cache can make an important difference. To exploit this NUCA property, prior research explored both architectural enhancements as well as compiler-based code optimization strategies. In this work, we take an alternate view, and explore data layout optimizations to improve locality of data accesses in a NUCA-based system. Our proposed approach includes three steps: array tiling, computation-to-core mapping, and layout customization. The first of these tries to identify the affinity between data and computation taking into account parallelization information, with the goal of minimizing remote accesses. The second step maps computations (and their associated data) to cores with the goal of minimizing average distance-to-data, and the last step further customizes the memory layout taking into account the data placement policy adopted by the underlying architecture. We evaluated the success of this three-step approach in enhancing on-chip cache behavior using all application programs from the SPECOMP suite on a full-system simulator. Our results show that the proposed approach improves on average data access latency and execution time by 24.7% and 18.4%, respectively, in the case of static NUCA, and 18.1% and 12.7%, respectively, in the case of dynamic NUCA.", "citation": "Citations (8)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Yuanrui Zhang.....http://dblp.org/pers/hd/z/Zhang:Yuanrui", "Wei Ding.....http://dblp.org/pers/hd/d/Ding:Wei", "Mahmut T. Kandemir.....http://dblp.org/pers/hd/k/Kandemir:Mahmut_T=", "Jun Liu.....http://dblp.org/pers/hd/l/Liu_0008:Jun", "Ohyoung Jang.....http://dblp.org/pers/hd/j/Jang:Ohyoung"], "conf": "micro", "year": "2011", "pages": 12}