{"title": "EnerJ: approximate data types for safe and general low-power computation.", "fields": ["small number", "programmer", "hardware architecture", "programming paradigm", "data type"], "abstract": "Energy is increasingly a first-order concern in computer systems. Exploiting energy-accuracy trade-offs is an attractive choice in applications that can tolerate inaccuracies. Recent work has explored exposing this trade-off in programming models. A key challenge, though, is how to  isolate parts of the program that must be precise from those that can be approximated  so that a program functions correctly even as quality of service degrades.   We propose using type qualifiers to declare data that may be subject to approximate computation. Using these types, the system automatically maps approximate variables to low-power storage, uses low-power operations, and even applies more energy-efficient algorithms provided by the programmer. In addition, the system can statically guarantee isolation of the precise program component from the approximate component. This allows a programmer to control explicitly how information flows from approximate data to precise data. Importantly, employing static analysis eliminates the need for dynamic checks, further improving energy savings. As a proof of concept, we develop EnerJ, an extension to Java that adds approximate data types. We also propose a hardware architecture that offers explicit approximate storage and computation. We port several applications to EnerJ and show that our extensions are expressive and effective; a small number of annotations lead to significant potential energy savings (10%-50%) at very little accuracy cost.", "citation": "Citations (549)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Adrian Sampson.....http://dblp.org/pers/hd/s/Sampson:Adrian", "Werner Dietl.....http://dblp.org/pers/hd/d/Dietl:Werner", "Emily Fortuna.....http://dblp.org/pers/hd/f/Fortuna:Emily", "Danushen Gnanapragasam.....http://dblp.org/pers/hd/g/Gnanapragasam:Danushen", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Dan Grossman.....http://dblp.org/pers/hd/g/Grossman:Dan"], "conf": "pldi", "year": "2011", "pages": 11}