{"title": "Sampling + DMR: practical and low-overhead permanent fault detection.", "fields": ["fault injection", "stuck at fault", "fault model", "fault coverage", "dual modular redundancy"], "abstract": "With technology scaling, manufacture-time and in-field permanent faults are becoming a fundamental problem. Multi-core architectures with spares can tolerate them by detecting and isolating faulty cores, but the required fault detection coverage becomes effectively 100% as the number of permanent faults increases. Dual-modular redundancy(DMR) can provide 100% coverage without assuming device-level fault models, but its overhead is excessive.   In this paper, we explore a simple and low-overhead mechanism we call Sampling-DMR: run in DMR mode for a small percentage (1% of the time for example) of each periodic execution window (5 million cycles for example). Although Sampling-DMR can leave some errors undetected, we argue the permanent fault coverage is 100% because it can detect all faults eventually. Sampling-DMR thus introduces a system paradigm of restricting all permanent faults' effects to small finite windows of error occurrence.   We prove an ultimate upper bound exists on total missed errors and develop a probabilistic model to analyze the distribution of the number of undetected errors and detection latency. The model is validated using full gate-level fault injection experiments for an actual processor running full application software. Sampling-DMR outperforms conventional techniques in terms of fault coverage, sustains similar detection latency guarantees, and limits energy and performance overheads to less than 2%.", "citation": "Citations (69)", "year": "2011", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "conf": "isca", "authors": ["Shuou Nomura.....http://dblp.org/pers/hd/n/Nomura:Shuou", "Matthew D. Sinclair.....http://dblp.org/pers/hd/s/Sinclair:Matthew_D=", "Chen-Han Ho.....http://dblp.org/pers/hd/h/Ho:Chen=Han", "Venkatraman Govindaraju.....http://dblp.org/pers/hd/g/Govindaraju:Venkatraman", "Marc de Kruijf.....http://dblp.org/pers/hd/k/Kruijf:Marc_de", "Karthikeyan Sankaralingam.....http://dblp.org/pers/hd/s/Sankaralingam:Karthikeyan"], "pages": 12}