{"title": "E-MiLi: energy-minimizing idle listening in wireless networks.", "fields": ["network packet", "clock rate", "software defined radio", "idle", "dynamic frequency scaling", "wireless network"], "abstract": "WiFi interface is known to be a primary energy consumer in mobile devices, and idle listening (IL) is the dominant source of energy consumption in WiFi. Most existing protocols, such as the 802.11 power-saving mode (PSM), attempt to reduce the time spent in IL by sleep scheduling. However, through an extensive analysis of real-world traffic, we found more than 60% of energy is consumed in IL, even with PSM enabled. To remedy this problem, we propose E-MiLi (Energy-Minimizing idle Listening) that reduces the power consumption in IL, given that the time spent in IL has already been optimized by sleep scheduling. Observing that radio power consumption decreases proportionally to its clock-rate, E-MiLi adaptively downclocks the radio during IL, and reverts to full clock-rate when an incoming packet is detected or a packet has to be transmitted. E-MiLi incorporates sampling rate invariant detection, ensuring accurate packet detection and address filtering even when the receiver's sampling clock-rate is much lower than the signal bandwidth. Further, it employs an opportunistic downclocking mechanism to optimize the efficiency of switching clock-rate, based on a simple interface to existing MAC-layer scheduling protocols. We have implemented E-MiLi on the USRP software radio platform. Our experimental evaluation shows that E-MiLi can detect packets with close to 100% accuracy even with downclocking by a factor of 16. When integrated with 802.11, E-MiLi can reduce energy consumption by around 44% for 92% of users in real-world wireless networks.", "citation": "Citations (150)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Xinyu Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Xinyu", "Kang G. Shin.....http://dblp.org/pers/hd/s/Shin:Kang_G="], "conf": "mobicom", "year": "2011", "pages": 12}