{"title": "Video from a single coded exposure photograph using a learned over-complete dictionary.", "fields": ["control unit", "sparse approximation", "liquid crystal on silicon", "temporal resolution", "image sensor"], "abstract": "Cameras face a fundamental tradeoff between the spatial and temporal resolution - digital still cameras can capture images with high spatial resolution, but most high-speed video cameras suffer from low spatial resolution. It is hard to overcome this tradeoff without incurring a significant increase in hardware costs. In this paper, we propose techniques for sampling, representing and reconstructing the space-time volume in order to overcome this tradeoff. Our approach has two important distinctions compared to previous works: (1) we achieve sparse representation of videos by learning an over-complete dictionary on video patches, and (2) we adhere to practical constraints on sampling scheme which is imposed by architectures of present image sensor devices. Consequently, our sampling scheme can be implemented on image sensors by making a straightforward modification to the control unit. To demonstrate the power of our approach, we have implemented a prototype imaging system with per-pixel coded exposure control using a liquid crystal on silicon (LCoS) device. Using both simulations and experiments on a wide range of scenes, we show that our method can effectively reconstruct a video from a single image maintaining high spatial resolution.", "citation": "Citations (145)", "year": "2011", "departments": ["Sony Broadcast & Professional Research Laboratories", "Rochester Institute of Technology", "Columbia University", "Sony Broadcast & Professional Research Laboratories", "Columbia University"], "conf": "iccv", "authors": ["Yasunobu Hitomi.....http://dblp.org/pers/hd/h/Hitomi:Yasunobu", "Jinwei Gu.....http://dblp.org/pers/hd/g/Gu:Jinwei", "Mohit Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Mohit", "Tomoo Mitsunaga.....http://dblp.org/pers/hd/m/Mitsunaga:Tomoo", "Shree K. Nayar.....http://dblp.org/pers/hd/n/Nayar:Shree_K="], "pages": 8}