{"title": "Mercury: A fast and energy-efficient multi-level cell based Phase Change Memory system.", "fields": ["memory architecture", "phase change memory", "microarchitecture", "process variation", "multi level cell"], "abstract": "Phase Change Memory (PCM) is one of the most promising technologies among emerging non-volatile memories. PCM stores data in crystalline and amorphous phases of the GST material using large differences in their electrical resistivity. Although it is possible to design a high capacity memory system by storing multiple bits at intermediate levels between the highest and lowest resistance states of PCM, it is difficult to obtain the tight distribution required for accurate reading of the data. Moreover, the required programming latency and energy for a Multiple Level PCM (MLC-PCM) cell is not trivial and can act as a major hurdle in adopting multilevel PCM in a high-density memory architecture design. Furthermore, the effect of process variation (PV) on PCM cell exacerbates the variability in necessary programming current and hence the target resistance spread, leading to the demand for high-latency, multi-iteration-based programming-and-verify write schemes for MLC-PCM. PV-aware control of programming current, programming using staircase down current pulses and programming using increasing reset current pulses are some of the traditional techniques used to achieve optimum programming energy, write latency and accuracy, but they usually target on optimizing only one aspect of the design. In this paper, we address the high-write latency and process variation issues of MLC-PCM by introducing Mercury: A fast and energy efficient multi-level cell based phase change memory architecture. Mercury adapts the programming scheme of a multi-level PCM cell by taking into consideration the initial state of the cell, the target resistance to be programmed and the effect of process variation on the programming current profile of the cell. The proposed techniques act at circuit as well as microarchitecture levels. Simulation results show that Mercury achieves 10% saving in programming latency and 25% saving in programming energy for the PCM memory system compared to that of the traditional methods.", "citation": "Citations (74)", "departments": ["University of Florida", "University of Florida", "University of Florida"], "authors": ["Madhura Joshi.....http://dblp.org/pers/hd/j/Joshi:Madhura", "Wangyuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Wangyuan", "Tao Li.....http://dblp.org/pers/hd/l/Li_0006:Tao"], "conf": "hpca", "year": "2011", "pages": 12}