{"title": "Content-based photo quality assessment.", "fields": ["contextual image classification", "ground truth", "categorization", "image segmentation", "brightness", "feature extraction", "computer vision", "artificial intelligence"], "abstract": "Automatically assessing photo quality from the perspective of visual aesthetics is of great interest in high-level vision research and has drawn much attention in recent years. In this paper, we propose content-based photo quality assessment using regional and global features. Under this framework, subject areas, which draw the most attentions of human eyes, are first extracted. Then regional features extracted from subject areas and the background regions are combined with global features to assess the photo quality. Since professional photographers may adopt different photographic techniques and may have different aesthetic criteria in mind when taking different types of photos (e.g. landscape versus portrait), we propose to segment regions and extract visual features in different ways according to the categorization of photo content. Therefore we divide the photos into seven categories based on their content and develop a set of new subject area extraction methods and new visual features, which are specially designed for different categories. This argument is supported by extensive experimental comparisons of existing photo quality assessment approaches as well as our new regional and global features over different categories of photos. Our new features significantly outperform the state-of-the-art methods. Another contribution of this work is to construct a large and diversified benchmark database for the research of photo quality assessment. It includes 17, 613 photos with manually labeled ground truth.", "citation": "Citations (187)", "year": "2011", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "conf": "iccv", "authors": ["Wei Luo.....http://dblp.org/pers/hd/l/Luo:Wei", "Xiaogang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaogang", "Xiaoou Tang.....http://dblp.org/pers/hd/t/Tang:Xiaoou"], "pages": 8}