{"title": "Separating succinct non-interactive arguments from all falsifiable assumptions.", "fields": ["random oracle", "one way function", "falsifiability", "theoretical physics", "mathematics", "adversary", "witness"], "abstract": "An argument system for NP is succinct, if its communication complexity is polylogarithmic the instance and witness sizes. The seminal works of Kilian '92 and Micali '94 show that such arguments can be constructed under standard cryptographic hardness assumptions with four rounds of interaction, and that they be made non-interactive in the random-oracle model. However, we currently do not have any construction of succinct non-interactive arguments (SNARGs) in the standard model with a proof of security under any simple cryptographic assumption.   In this work, we give a broad black-box separation result, showing that black-box reductions cannot be used to prove the security of any SNARG construction based on any falsifiable cryptographic assumption. This includes essentially all common assumptions used in cryptography (one-way functions, trapdoor permutations, DDH, RSA, LWE etc.). More generally, we say that an assumption is falsifiable if it can be modeled as an interactive game between an adversary and an efficient challenger that can efficiently decide if the adversary won the game. This is similar, in spirit, to the notion of falsifiability of Naor '03, and captures the fact that we can efficiently check if an adversarial strategy breaks the assumption.   Our separation result also extends to designated verifier SNARGs, where the verifier needs a trapdoor associated with the CRS to verify arguments, and slightly succinct SNARGs, whose size is only required to be sublinear in the statement and witness size.", "citation": "Citations (228)", "year": "2011", "departments": ["IBM", "New York Unvier ... w York, NY, USA"], "conf": "stoc", "authors": ["Craig Gentry.....http://dblp.org/pers/hd/g/Gentry:Craig", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "pages": 10}