{"title": "To preempt or not: Tackling bid and time-based cheating in online spectrum auctions.", "fields": ["english auction", "bin packing problem", "frequency allocation", "bidding", "spectrum auction"], "abstract": "Online spectrum auctions offer ample flexibility for bidders to request and obtain spectrum on-the-fly. Such flexibility, however, opens up new vulnerabilities to bidder manipulation. Aside from rigging their bids, selfish bidders can falsely report their arrival time to game the system and obtain unfair advantage over others. Such time-based cheating is easy to perform yet produces severe damage to auction performance. We propose Topaz, a truthful online spectrum auction design that distributes spectrum efficiently while discouraging bidders from misreporting their bids or time report. Topaz makes three key contributions. First, Topaz applies a 3D bin packing mechanism to distribute spectrum across time, space and frequency, exploiting spatial and time reuse to improve allocation efficiency. Second, Topaz enforces truthfulness using a novel temporal-smoothed critical value based pricing. Capturing the temporal and spatial dependency among bidders who arrive subsequently, this pricing effectively diminishes gain from bid and/or time-cheating. Finally, Topaz offers a “scalable” winner preemption to address the uncertainty of future arrivals at each decision time, which significantly boosts auction revenue. We analytically prove Topaz's truthfulness, which does not require any knowledge of bidder behavior, or an optimal spectrum allocation to enforce truthfulness. Using empirical arrival and bidding models, we perform simulations to demonstrate the efficiency of Topaz. We show that proper winner preemption improves auction revenue by 45–65% at a minimum cost of spectrum utilization.", "citation": "Citations (93)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Lara B. Deek.....http://dblp.org/pers/hd/d/Deek:Lara_B=", "Xia Zhou.....http://dblp.org/pers/hd/z/Zhou:Xia", "Kevin C. Almeroth.....http://dblp.org/pers/hd/a/Almeroth:Kevin_C=", "Haitao Zheng.....http://dblp.org/pers/hd/z/Zheng:Haitao"], "conf": "infocom", "year": "2011", "pages": 9}