{"title": "Reading between the tags to predict real-world size-class for visually depicted objects in images.", "fields": ["crowdsourcing", "selection", "multimedia information retrieval", "generalization", "automatic image annotation"], "abstract": "Multimedia information retrieval stands to benefit from the availability of additional information about tags and how they relate to the content visually depicted in images. We propose a generic approach that contributes to improving the informativeness of image tags by combining generalizations about the distributional tendencies of physical objects in the real world and statistics of natural language use patterns that have been mined from the Web. The approach, which we refer to as 'Reading between the Tags,' provides for each tag associated with an image, first, a prediction concerning  corporeality , i.e., whether or not the tag denotes a physical entity, and, then, concerning the real-world size of that entity, i.e., large, medium or small. Mining takes place using a set of Language Use Frames (LUFs) that are composed of natural language neighborhoods characteristic of tag classes. We validate our approach with a series of experiments on a set of images from the MIRFLICKR data set using ground truth created with standard crowdsourcing techniques. The main experiments demonstrate the effectiveness of our approach for size-class prediction. A further experiment shows that size-class prediction can be improved and made image-specific using general and relatively small sets of visual concepts. A final experiment confirms that the set of LUFs can also be chosen automatically via statistical feature selection.", "citation": "Citations (10)", "departments": ["Delft University of Technology", "Delft University of Technology", "Delft University of Technology"], "authors": ["Martha Larson.....http://dblp.org/pers/hd/l/Larson:Martha", "Christoph Kofler.....http://dblp.org/pers/hd/k/Kofler:Christoph", "Alan Hanjalic.....http://dblp.org/pers/hd/h/Hanjalic:Alan"], "conf": "mm", "year": "2011", "pages": 10}