{"title": "The role of attractiveness in web image search.", "fields": ["attractiveness", "index selection", "end user", "ranking", "semantic search"], "abstract": "Existing web image search engines are mainly designed to optimize topical relevance. However, according to our user study, attractiveness is becoming a more and more important factor for web image search engines to satisfy users' search intentions. Important as it can be, web image attractiveness from the search users' perspective has not been sufficiently recognized in both the industry and the academia. In this paper, we present a definition of web image attractiveness with three levels according to the end users' feedback, including perceptual quality, aesthetic sensitivity and affective tune. Corresponding to each level of the definition, various visual features are investigated on their applicability to attractiveness estimation of web images. To further deal with the unreliability of visual features induced by the large variations of web images, we propose a contextual approach to integrate the visual features with contextual cues mined from image EXIF information and the associated web pages. We explore the role of attractiveness by applying it to various stages of a web image search engine, including the online ranking and the interactive reranking, as well as the offline index selection. Experimental results on three large-scale web image search datasets demonstrate that the incorporation of attractiveness can bring more satisfaction to 80% of the users for ranking/reranking search results and 30.5% index coverage improvement for index selection, compared to the conventional relevance based approaches.", "citation": "Citations (53)", "departments": ["Peking University", "Microsoft", "Peking University", "Microsoft", "Microsoft"], "authors": ["Bo Geng.....http://dblp.org/pers/hd/g/Geng:Bo", "Linjun Yang.....http://dblp.org/pers/hd/y/Yang:Linjun", "Chao Xu.....http://dblp.org/pers/hd/x/Xu_0006:Chao", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2011", "pages": 10}