{"title": "The SystemT IDE: an integrated development environment for information extraction rules.", "fields": ["business analytics", "regular expression", "iterative and incremental development", "ranging", "semantic search"], "abstract": "Information Extraction (IE)-the problem of extracting structured information from unstructured text - has become the key enabler for many enterprise applications such as semantic search, business analytics and regulatory compliance. While rule-based IE systems are widely used in practice due to their well-known \"explainability,\" developing high-quality information extraction rules is known to be a labor-intensive and time-consuming iterative process.   Our demonstration showcases SystemT IDE, the integrated development environment for SystemT, a state-of-the-art rule-based IE system from IBMResearch that has been successfully embedded in multiple IBM enterprise products. SystemT IDE facilitates the development, test and analysis of high-quality IE rules by means of sophisticated techniques, ranging from data management to machine learning. We show how to build high-quality IE annotators using a suite of tools provided by SystemT IDE, including computing data provenance, learning basic features such as regular expressions and dictionaries, and automatically refining rules based on labeled examples.", "citation": "Citations (12)", "year": "2011", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "sigmod", "authors": ["Laura Chiticariu.....http://dblp.org/pers/hd/c/Chiticariu:Laura", "Vivian Chu.....http://dblp.org/pers/hd/c/Chu:Vivian", "Sajib Dasgupta.....http://dblp.org/pers/hd/d/Dasgupta:Sajib", "Thilo W. Goetz.....http://dblp.org/pers/hd/g/Goetz:Thilo_W=", "Howard Ho.....http://dblp.org/pers/hd/h/Ho:Howard", "Rajasekar Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Rajasekar", "Alexander Lang.....http://dblp.org/pers/hd/l/Lang:Alexander", "Yunyao Li.....http://dblp.org/pers/hd/l/Li_0001:Yunyao", "Bin Liu.....http://dblp.org/pers/hd/l/Liu_0002:Bin", "Sriram Raghavan.....http://dblp.org/pers/hd/r/Raghavan:Sriram", "Frederick Reiss.....http://dblp.org/pers/hd/r/Reiss:Frederick", "Shivakumar Vaithyanathan.....http://dblp.org/pers/hd/v/Vaithyanathan:Shivakumar", "Huaiyu Zhu.....http://dblp.org/pers/hd/z/Zhu:Huaiyu"], "pages": 4}