{"title": "Transfer Learning to Predict Missing Ratings via Heterogeneous User Feedbacks.", "fields": ["recommender system", "matrix decomposition", "transfer of learning", "collaborative filtering", "knowledge transfer"], "abstract": "Data sparsity due to missing ratings is a major challenge for collaborative filtering (CF) techniques in recommender systems. This is especially true for CF domains where the ratings are expressed numerically. We observe that, while we may lack the information in numerical ratings, we may have more data in the form of binary ratings. This is especially true when users can easily express themselves with their likes and dislikes for certain items. In this paper, we explore how to use the binary preference data expressed in the form of like/dislike to help reduce the impact of data sparsity of more expressive numerical ratings. We do this by transferring the rating knowledge from some auxiliary data source in binary form (that is, likes or dislikes), to a target numerical rating matrix. Our solution is to model both numerical ratings and like/dislike in a principled way, using a novel framework of Transfer by Collective Factorization (TCF). In particular, we construct the shared latent space collectively and learn the data-dependent effect separately. A major advantage of the TCF approach over previous collective matrix factorization (or bifactorization) methods is that we are able to capture the data-dependent effect when sharing the data-independent knowledge, so as to increase the over-all quality of knowledge transfer. Experimental results demonstrate the effectiveness of TCF at various sparsity levels as compared to several state-of-the-art methods.", "citation": "Citations (91)", "year": "2011", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "conf": "ijcai", "authors": ["Weike Pan.....http://dblp.org/pers/hd/p/Pan:Weike", "Nathan Nan Liu.....http://dblp.org/pers/hd/l/Liu:Nathan_Nan", "Evan Wei Xiang.....http://dblp.org/pers/hd/x/Xiang:Evan_Wei", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "pages": 6}