{"title": "Kinship verification from facial images under uncontrolled conditions.", "fields": ["support vector machine", "visual descriptors", "annotation", "spatial analysis", "kinship"], "abstract": "In this paper, we present an automatic kinship verification system based on facial image analysis under uncontrolled conditions. While a large number of studies on human face analysis have been performed in the literature, there are a few attempts on automatic face analysis for kinship verification, possibly due to lacking of such publicly available databases and great challenges of this problem. To this end, we collect a kinship face database by searching 400+ pairs of public figures and celebrities from the internet, and automatically detect them with the Viola-Jones face detector. Then, we propose a new spatial pyramid learning-based (SPLE) feature descriptor for face representation and apply support vector machine (SVM) for kinship verification. The proposed system has the following three characteristics: 1) no manual human annotation of face landmarks is required and the kinship information is automatically obtained from the original pair of images; 2) both local appearance information and global spatial information have been effectively utilized in the proposed SPLE feature descriptor, and better performance can be obtained than state-of-the-art feature descriptors in our application; 3) the performance of our proposed system is comparable to that of human observers.", "citation": "Citations (80)", "departments": ["Capital Normal University", "Beijing Normal University", "Nanyang Technological University", "Capital Normal University", "Capital Normal University"], "authors": ["Xiuzhuang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiuzhuang", "Junlin Hu.....http://dblp.org/pers/hd/h/Hu:Junlin", "Jiwen Lu.....http://dblp.org/pers/hd/l/Lu:Jiwen", "Yuanyuan Shang.....http://dblp.org/pers/hd/s/Shang:Yuanyuan", "Yong Guan.....http://dblp.org/pers/hd/g/Guan:Yong"], "conf": "mm", "year": "2011", "pages": 4}