{"title": "QsCores: trading dark silicon for scalable energy efficiency with quasi-specific cores.", "fields": ["design flow", "specint", "power budget", "processor design", "dark silicon"], "abstract": "Transistor density continues to increase exponentially, but power dissipation per transistor is improving only slightly with each generation of Moore's law. Given the constant chip-level power budgets, this exponentially decreases the percentage of transistors that can switch at full frequency with each technology generation. Hence, while the transistor budget continues to increase exponentially, the power budget has become the dominant limiting factor in processor design. In this regime, utilizing transistors to design specialized cores that optimize energy-per-computation becomes an effective approach to improve system performance.   To trade transistors for energy efficiency in a scalable manner, we propose  Quasi-specific Cores , or QsCores, specialized processors capable of executing multiple  general-purpose  computations while providing an order of magnitude more energy efficiency than a general-purpose processor. The QsCores design flow is based on the insight that similar code patterns exist within and across applications. Our approach exploits these similar code patterns to ensure that a small set of specialized cores support a large number of commonly used computations.   We evaluate QsCores's ability to target both a single application library (e.g., data structures) as well as a diverse workload consisting of applications selected from different domains (e.g., SPECINT, EEMBC, and Vision). Our results show that QsCores can provide 18.4 x better energy efficiency than general-purpose processors while reducing the amount of specialized logic required to support the workload by up to 66%.", "citation": "Citations (139)", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Ganesh Venkatesh.....http://dblp.org/pers/hd/v/Venkatesh:Ganesh", "Jack Sampson.....http://dblp.org/pers/hd/s/Sampson:Jack", "Nathan Goulding-Hotta.....http://dblp.org/pers/hd/g/Goulding=Hotta:Nathan", "Sravanthi Kota Venkata.....http://dblp.org/pers/hd/v/Venkata:Sravanthi_Kota", "Michael Bedford Taylor.....http://dblp.org/pers/hd/t/Taylor:Michael_Bedford", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "conf": "micro", "year": "2011", "pages": 12}