{"title": "Efficient complex operators for irregular codes.", "fields": ["coprocessor", "pipeline", "specint", "datapath", "clock rate"], "abstract": "Complex “fat operators” are important contributors to the efficiency of specialized hardware. This paper introduces two new techniques for constructing efficient fat operators featuring up to dozens of operations with arbitrary and irregular data and memory dependencies. These techniques focus on minimizing critical path length and load-use delay, which are key concerns for irregular computations. Selective Depipelining(SDP) is a pipelining technique that allows fat operators containing several, possibly dependent, memory operations. SDP allows memory requests to operate at a faster clock rate than the datapath, saving power in the datapath and improving memory performance. Cachelets are small, customized, distributed L0 caches embedded in the datapath to reduce load-use latency. We apply these techniques to Conservation Cores(c-cores) to produce coprocessors that accelerate irregular code regions while still providing superior energy efficiency. On average, these enhanced c-cores reduce EDP by 2× and area by 35% relative to c-cores. They are up to 2.5× faster than a general-purpose processor and reduce energy consumption by up to 8× for a variety of irregular applications including several SPECINT benchmarks.", "citation": "Citations (26)", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Jack Sampson.....http://dblp.org/pers/hd/s/Sampson:Jack", "Ganesh Venkatesh.....http://dblp.org/pers/hd/v/Venkatesh:Ganesh", "Nathan Goulding-Hotta.....http://dblp.org/pers/hd/g/Goulding=Hotta:Nathan", "Saturnino Garcia.....http://dblp.org/pers/hd/g/Garcia:Saturnino", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven", "Michael Bedford Taylor.....http://dblp.org/pers/hd/t/Taylor:Michael_Bedford"], "conf": "hpca", "year": "2011", "pages": 12}