{"title": "GUARDS - Innovative Application of Game Theory for National Airport Security.", "fields": ["airport security", "software deployment", "knowledge acquisition", "game theory", "stackelberg competition"], "abstract": "We describe an innovative application of a novel game-theoretic approach for a national scale security deployment. Working with the United States Transportation Security Administration (TSA), we have developed a new application called GUARDS to allocate the TSA's limited resources across hundreds of security activities to provide protection at over 400 United States airports. Similar security applications (e.g., ARMOR and IRIS) have focused on one-off tailored applications and one security activity (e.g. checkpoints) per application, GUARDS on the other hand faces three new key issues: (i) reasoning about hundreds of heterogeneous security activities; (ii) reasoning over diverse potential threats; (iii) developing a system designed for hundreds of end-users. Since a national deployment precludes tailoring to specific airports, our key ideas are: (i) creating a new game-theoretic framework that allows for heterogeneous defender activities and compact modeling of a large number of threats; (ii) developing an efficient solution technique based on general purpose Stackelberg game solvers; (iii) taking a partially centralized approach for knowledge acquisition. The scheduling assistant has been delivered to the TSA and is currently undergoing evaluation for scheduling practices at an undisclosed airport. If successful, the TSA intends to incorporate the system into their unpredictable scheduling practices nationwide.", "citation": "Citations (15)", "year": "2011", "departments": ["University of Southern California", "University of Southern California", "University of Texas at El Paso", "Transportation Security Administration", "APEX STORE-Tech ... eland Security"], "conf": "ijcai", "authors": ["James Pita.....http://dblp.org/pers/hd/p/Pita:James", "Milind Tambe.....http://dblp.org/pers/hd/t/Tambe:Milind", "Christopher Kiekintveld.....http://dblp.org/pers/hd/k/Kiekintveld:Christopher", "Shane Cullen.....http://dblp.org/pers/hd/c/Cullen:Shane", "Erin Steigerwald.....http://dblp.org/pers/hd/s/Steigerwald:Erin"], "pages": 6}