{"title": "A distributed and privacy preserving algorithm for identifying information hubs in social networks.", "fields": ["graph", "friendship graph", "friendship", "information privacy", "distributed algorithm"], "abstract": "This paper addresses the problem of identifying the top-k information hubs in a social network. Identifying top-k information hubs is crucial for many applications such as advertising in social networks where advertisers are interested in identifying hubs to whom free samples can be given. Existing solutions are centralized and require time stamped information about pair-wise user interactions and can only be used by social network owners as only they have access to such data. Existing distributed and privacy preserving algorithms suffer from poor accuracy. In this paper, we propose a new algorithm to identify information hubs that preserves user privacy. The intuition is that highly connected users tend to have more interactions with their neighbors than less connected users. Our method can identify hubs without requiring a central entity to access the complete friendship graph. We achieve this by fully distributing the computation using the Kempe-McSherry algorithm to address user privacy concerns. To the best of our knowledge, the proposed algorithm represents an arguably first attempt that (1) uses friendship graphs (instead of interaction graphs), (2) employs a truly distributed method over friendship graphs, and (3) maintains user privacy by not requiring them to disclose their friend associations and interactions, for identifying information hubs in social networks. We evaluate the effectiveness of our proposed technique using a real-world Facebook data set containing about 3.1 million users and more than 23 million friendship links. The results of our experiments show that our algorithm is 50% more accurate than existing distributed algorithms. Results also show that the proposed algorithm can estimate the rank of the top-k information hubs users more accurately than existing approaches.", "citation": "Citations (19)", "departments": ["Michigan State University", "Michigan State University", "Michigan State University", "Michigan State University"], "authors": ["Muhammad Usman Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Muhammad_Usman", "Muhammad Zubair Shafiq.....http://dblp.org/pers/hd/s/Shafiq:Muhammad_Zubair", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Hayder Radha.....http://dblp.org/pers/hd/r/Radha:Hayder"], "conf": "infocom", "year": "2011", "pages": 5}