{"title": "Copernicus: a new paradigm for parallel adaptive molecular dynamics.", "fields": ["message passing", "multithreading", "distributed data store", "thread", "simd"], "abstract": "Biomolecular simulation is a core application on supercomputers, but it is exceptionally difficult to achieve the strong scaling necessary to reach biologically relevant timescales. Here, we present a new paradigm for parallel adaptive molecular dynamics and a publicly available implementation: Copernicus. This framework combines performance-leading molecular dynamics parallelized on three levels (SIMD, threads, and message-passing) with kinetic clustering, statistical model building and real-time result monitoring. Copernicus enables execution as single parallel jobs with automatic resource allocation. Even for a small protein such as villin (9,864 atoms), Copernicus exhibits near-linear strong scaling from 1 to 5,376 AMD cores. Starting from extended chains we observe structures 0.6 A from the native state within 30h, and achieve sufficient sampling to predict the native state without  a priori  knowledge after 80--90h. To match Copernicus' efficiency, a classical simulation would have to exceed 50 microseconds per day, currently infeasible even with custom hardware designed for simulations.", "citation": "Citations (21)", "departments": ["Royal Institute of Technology", "Stanford University", "Royal Institute of Technology", "University of Virginia", "Stanford University"], "authors": ["Sander Pronk.....http://dblp.org/pers/hd/p/Pronk:Sander", "Per Larsson.....http://dblp.org/pers/hd/l/Larsson:Per", "Iman Pouya.....http://dblp.org/pers/hd/p/Pouya:Iman", "Gregory R. Bowman.....http://dblp.org/pers/hd/b/Bowman:Gregory_R=", "Imran S. Haque.....http://dblp.org/pers/hd/h/Haque:Imran_S=", "Kyle Beauchamp.....http://dblp.org/pers/hd/b/Beauchamp:Kyle", "Berk Hess.....http://dblp.org/pers/hd/h/Hess:Berk", "Vijay S. Pande.....http://dblp.org/pers/hd/p/Pande:Vijay_S=", "Peter M. Kasson.....http://dblp.org/pers/hd/k/Kasson:Peter_M=", "Erik Lindahl.....http://dblp.org/pers/hd/l/Lindahl:Erik"], "conf": "sc", "year": "2011", "pages": 10}