{"title": "Checkpointing strategies for parallel jobs.", "fields": ["weibull distribution", "heuristic", "periodic graph", "software fault tolerance", "exponential function"], "abstract": "This work provides an analysis of checkpointing strategies for minimizing expected job execution times in an environment that is subject to processor failures. In the case of both sequential and parallel jobs, we give the optimal solution for exponentially distributed failure inter-arrival times, which, to the best of our knowledge, is the first rigorous proof that periodic checkpointing is optimal. For non-ex-ponentially distributed failures, we develop a dynamic programming algorithm to maximize the amount of work completed before the next failure, which provides a good heuristic for minimizing the expected execution time. Our work considers various models of job parallelism and of parallel checkpointing overhead. We first perform extensive simulation experiments assuming that failures follow Exponential or Weibull distributions, the latter being more representative of real-world systems. The obtained results not only corroborate our theoretical findings, but also show that our dynamic programming algorithm significantly outperforms previously proposed solutions in the case of Weibull failures. We then discuss results from simulation experiments that use failure logs from production clusters. These results confirm that our dynamic programming algorithm significantly outperforms existing solutions for real-world clusters.", "citation": "Citations (97)", "departments": ["École normale supérieure de Lyon", "École normale supérieure de Lyon", "École normale supérieure de Lyon", "French Institute for Research in Computer Science and Automation", "Univ. of Hawai' ... , Honolulu, USA"], "authors": ["Marin Bougeret.....http://dblp.org/pers/hd/b/Bougeret:Marin", "Henri Casanova.....http://dblp.org/pers/hd/c/Casanova:Henri", "Mikaël Rabie.....http://dblp.org/pers/hd/r/Rabie:Mika=euml=l", "Yves Robert.....http://dblp.org/pers/hd/r/Robert:Yves", "Frédéric Vivien.....http://dblp.org/pers/hd/v/Vivien:Fr=eacute=d=eacute=ric"], "conf": "sc", "year": "2011", "pages": 11}