{"title": "Discovering Life Cycle Assessment Trees from Impact Factor Databases.", "fields": ["life cycle assessment", "pairwise comparison", "resource depletion", "impact factor", "feature selection"], "abstract": "In recent years, environmental sustainability has received widespread attention due to continued depletion of natural resources and degradation of the environment. Life cycle assessment (LCA) is a methodology for quantifying multiple environmental impacts of a product, across its entire life cycle – from creation to use to discard. The key object of interest in LCA is the inventory tree, with the desired product as the root node and the materials and processes used across its life cycle as the children. The total impact of the parent in any environmental category is a linear combination of the impacts of the children in that category. LCA has generally been used in 'forward' mode: given an inventory tree and impact factors of its children, the task is to compute the impact factors of the root, i.e., the product being modeled. We propose a data mining approach to solve the inverse problem, where the task is to infer inventory trees from a database of environmental factors. This is an important problem with applications in not just understanding what parts and processes constitute a product but also in designing and developing more sustainable alternatives. Our solution methodology is one of feature selection but set in the context of a non-negative least squares problem. It organizes numerous non-negative least squares fits over the impact factor database into a set of pairwise membership relations which are then summarized into candidate trees in turn yielding a consensus tree. We demonstrate the applicability of our approach over real LCA datasets obtained from a large computer manufacturer.", "citation": "Citations (10)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Naren Sundaravaradan.....http://dblp.org/pers/hd/s/Sundaravaradan:Naren", "Debprakash Patnaik.....http://dblp.org/pers/hd/p/Patnaik:Debprakash", "Naren Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Naren", "Manish Marwah.....http://dblp.org/pers/hd/m/Marwah:Manish", "Amip Shah.....http://dblp.org/pers/hd/s/Shah:Amip"], "conf": "aaai", "year": "2011", "pages": -1}