{"title": "Leveraging existing instrumentation to automatically infer invariant-constrained models.", "fields": ["regular expression", "correctness", "system model", "user experience design", "debugging"], "abstract": "Computer systems are often difficult to debug and understand. A common way of gaining insight into system behavior is to inspect execution logs and documentation. Unfortunately, manual inspection of logs is an arduous process and documentation is often incomplete and out of sync with the implementation.   This paper presents  Synoptic , a tool that helps developers by inferring a concise and accurate system model. Unlike most related work, Synoptic does not require developer-written scenarios, specifications, negative execution examples, or other complex user input. Synoptic processes the logs most systems already produce and requires developers only to specify a set of regular expressions for parsing the logs.   Synoptic has two unique features. First, the model it produces satisfies three kinds of temporal invariants mined from the logs, improving accuracy over related approaches. Second, Synoptic uses refinement and coarsening to explore the space of models. This improves model efficiency and precision, compared to using just one approach.   In this paper, we formally prove that Synoptic always produces a model that satisfies exactly the temporal invariants mined from the log, and we argue that it does so efficiently. We empirically evaluate Synoptic through two user experience studies, one with a developer of a large, real-world system and another with 45 students in a distributed systems course. Developers used Synoptic-generated models to verify known bugs, diagnose new bugs, and increase their confidence in the correctness of their systems. None of the developers in our evaluation had a background in formal methods but were able to easily use Synoptic and detect implementation bugs in as little as a few minutes.", "citation": "Citations (141)", "departments": ["University of Washington", "University of Washington", "Saarland University", "University of Washington", "University of Washington"], "authors": ["Ivan Beschastnikh.....http://dblp.org/pers/hd/b/Beschastnikh:Ivan", "Yuriy Brun.....http://dblp.org/pers/hd/b/Brun:Yuriy", "Sigurd Schneider.....http://dblp.org/pers/hd/s/Schneider:Sigurd", "Michael Sloan.....http://dblp.org/pers/hd/s/Sloan:Michael", "Michael D. Ernst.....http://dblp.org/pers/hd/e/Ernst:Michael_D="], "conf": "sigsoft", "year": "2011", "pages": 11}