{"title": "Delay-capacity tradeoffs for mobile networks with Lévy walks and Lévy flights.", "fields": ["scaling", "mobility model", "random walk", "brownian motion", "levy flight"], "abstract": "This paper analytically derives the delay-capacity tradeoffs for Levy mobility: Levy walks and Levy flights. Levy mobility is a random walk with a power-law flight distribution. α is the power-law slope of the distribution and 0 < α ≤ 2. While in Levy flight, each flight takes a constant flight time, in Levy walk, it has a constant velocity which incurs strong spatio-temporal correlation as flight time depends on traveling distance. Levy mobility is of special interest because it is known that Levy mobility and human mobility share several common features including heavy-tail flight distributions. Humans highly influence the mobility of nodes (smartphones and cars) in real mobile networks as they carry or drive mobile nodes. Understanding the fundamental delay-capacity tradeoffs of Levy mobility provides important insight into understanding the performance of real mobile networks. However, its power-law nature and strong spatio-temporal correlation make the scaling analysis non-trivial. This is in contrast to other random mobility models including Brownian motion, random waypoint and i.i.d. mobility which are amenable for a Markovian analysis. By exploiting the asymptotic characterization of the joint spatio-temporal probability density functions of Levy models, the order of critical delay, the minimum delay required to achieve more throughput than Θ(1/√n) where n is the number of nodes in the network, is obtained. The results indicate that in Levy walk, there is a phase transition that for 0 < α < 1, the critical delay is constantly Θ(n 1/2 ) and for 1 ≤ α ≤ 2, is Θ(n α/2 ). In contrast, Levy flight has critical delay Θ(n α/ 2) for 0 < a ≤ 2.", "citation": "Citations (25)", "departments": ["North Carolina State University", "Ohio State University", "KAIST", "North Carolina State University", "KAIST"], "authors": ["Kyunghan Lee.....http://dblp.org/pers/hd/l/Lee:Kyunghan", "Yoora Kim.....http://dblp.org/pers/hd/k/Kim:Yoora", "Song Chong.....http://dblp.org/pers/hd/c/Chong:Song", "Injong Rhee.....http://dblp.org/pers/hd/r/Rhee:Injong", "Yung Yi.....http://dblp.org/pers/hd/y/Yi:Yung"], "conf": "infocom", "year": "2011", "pages": 9}