{"title": "CoreRacer: a practical memory race recorder for multicore x86 TSO processors.", "fields": ["uniform memory access", "registered memory", "cache coloring", "cache only memory architecture", "distributed shared memory"], "abstract": "Shared memory multiprocessors are difficult to program because of the non-deterministic ways in which the memory operations from different threads interleave. To address this issue, many hardware-based memory race recorders have been proposed that efficiently log an ordering of the shared memory interleavings between threads for deterministic replay. These approaches are challenging to integrate into current processors because they change the cache subsystem or the coherence protocol, and they mostly support a sequentially consistent memory model.   In this paper, we describe  CoreRacer , a chunk-based memory race recorder architecture for multicore x86 TSO processors. CoreRacer does not modify the cache subsystem and yet it still integrates into the x86 TSO memory model. We show that by leveraging a specific x86 feature, the invariant timestamp, CoreRacer maintains ordering among chunks without piggybacking on cache coherence messages. We provide a detailed implementation and evaluation of CoreRacer on a cycle-accurate x86 simulator. We show that its integration cost into x86 is minimal and its overhead has negligible effect on performance.", "citation": "Citations (18)", "departments": ["Intel", "Intel", "Intel", "Intel", "Intel"], "authors": ["Gilles Pokam.....http://dblp.org/pers/hd/p/Pokam:Gilles", "Cristiano Pereira.....http://dblp.org/pers/hd/p/Pereira:Cristiano", "Shiliang Hu.....http://dblp.org/pers/hd/h/Hu:Shiliang", "Ali-Reza Adl-Tabatabai.....http://dblp.org/pers/hd/a/Adl=Tabatabai:Ali=Reza", "Justin Emile Gottschlich.....http://dblp.org/pers/hd/g/Gottschlich:Justin_Emile", "Jungwoo Ha.....http://dblp.org/pers/hd/h/Ha:Jungwoo", "Youfeng Wu.....http://dblp.org/pers/hd/w/Wu:Youfeng"], "conf": "micro", "year": "2011", "pages": 10}