{"title": "A framework for mobile data gathering with load balanced clustering and MIMO uploading.", "fields": ["polling", "latency", "sink", "mimo", "scalability"], "abstract": "In this paper, a three-layer framework is proposed for mobile data collection in wireless sensor networks, which includes the sensor layer, cluster head layer, and mobile collector (called SenCar) layer. The framework employs distributed load balanced clustering and MIMO uploading techniques, which is referred to as LBC-MU. The objective is to achieve good scalability, long network lifetime and low data collection latency. At the sensor layer, a distributed load balanced clustering (LBC) algorithm is proposed for sensors to self-organize themselves into clusters. In contrast to existing clustering methods, our scheme generates multiple cluster heads in each cluster to balance the work load and facilitate MIMO data uploading. At the cluster head layer, the inter-cluster transmission range is carefully chosen to guarantee the connectivity among the clusters. Multiple cluster heads within a cluster cooperate with each other to perform energy-saving inter-cluster communications. Through inter-cluster transmissions, cluster head information is forwarded to the SenCar for its moving trajectory planning. At the mobile collector layer, the SenCar is equipped with two antennas, which enables multiple cluster heads to simultaneously upload data to the SenCar. The trajectory planning for the SenCar is optimized to fully utilize MIMO uploading capability by properly selecting polling points in each cluster. By visiting each selected polling point, the SenCar can efficiently gather data from cluster heads and transport the data to the static data sink. Extensive simulations are conducted to evaluate the effectiveness of the proposed LBC-MU scheme. The results show that when each cluster has at most two cluster heads, LBC-MU can reduce the maximum number of transmissions a sensor performs by 90% and the average number of transmissions by 88% compared with the enhanced relay routing scheme. It also results in 25% shorter average data latency compared with the mobile collection scheme with single-head clustering.", "citation": "Citations (21)", "departments": ["Stony Brook University", "Stony Brook University"], "authors": ["Miao Zhao.....http://dblp.org/pers/hd/z/Zhao:Miao", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2011", "pages": 9}