{"title": "Massively parallel XML twig filtering using dynamic programming on FPGAs.", "fields": ["xml", "exploit", "twig", "throughput", "massively parallel"], "abstract": "In recent years, XML-based Publish-Subscribe Systems have become popular due to the increased demand of timely event-notification. Users (or subscribers) pose complex profiles on the structure and content of the published messages. If a profile matches the message, the message is forwarded to the interested subscriber. As the amount of published content continues to grow, current software-based systems will not scale. We thus propose a novel architecture to exploit parallelism of twig matching on FPGAs. This approach yields up to three orders of magnitude higher throughput when compared to conventional approaches bound by the sequential aspect of software computing. This paper, presents a novel method for performing unordered holistic twig matching on FPGAs without any false positives, and whose throughput is independent of the complexity of the user queries or the characteristics of the input XML stream. Furthermore, we present experimental comparison of different granularities of twig matching, namely path-based (root-to-leaf) and pair-based (parent-child or ancestor-descendant).We provide comprehensive experiments that compare the throughput, area utilization and the accuracy of matching (percent of false positives) of our holistic, path-based and pair-based FPGA approaches.", "citation": "Citations (18)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "authors": ["Roger Moussalli.....http://dblp.org/pers/hd/m/Moussalli:Roger", "Mariam Salloum.....http://dblp.org/pers/hd/s/Salloum:Mariam", "Walid A. Najjar.....http://dblp.org/pers/hd/n/Najjar:Walid_A=", "Vassilis J. Tsotras.....http://dblp.org/pers/hd/t/Tsotras:Vassilis_J="], "conf": "icde", "year": "2011", "pages": 12}