{"title": "Increasing the effectiveness of directory caches by deactivating coherence for private memory blocks.", "fields": ["directory", "bus sniffing", "cache coherence", "cpu cache", "uniprocessor system"], "abstract": "To meet the demand for more powerful high-performance shared-memory servers, multiprocessor systems must incorporate efficient and scalable cache coherence protocols, such as those based on directory caches. However, the limited directory cache size of the increasingly larger systems may cause frequent evictions of directory entries and, consequently, invalidations of cached blocks, which severely degrades system performance.   A significant percentage of the referred memory blocks are only accessed by one processor (even in parallel applications) and, therefore, do not require coherence maintenance. Taking advantage of techniques that dynamically identify those private blocks, we propose to deactivate the coherence protocol for them and to treat them as uniprocessor systems do. The protocol deactivation allows directory caches to omit the tracking of an appreciable quantity of blocks, which reduces their load and increases their effective size. Since the operating system collaborates on the detection of private blocks, our proposal only requires minor modifications.   Simulation results show that, thanks to our proposal, directory caches can avoid the tracking of about 57% of the accessed blocks and their capacity can be better exploited. This contributes either to shorten the runtime of parallel applications by 15% while keeping directory cache size or to maintain system performance while using directory caches 8 times smaller.", "citation": "Citations (157)", "year": "2011", "departments": ["Polytechnic University of Valencia", "Polytechnic University of Valencia", "Polytechnic University of Valencia", "Polytechnic University of Valencia", "Polytechnic University of Valencia"], "conf": "isca", "authors": ["Blas Cuesta.....http://dblp.org/pers/hd/c/Cuesta:Blas", "Alberto Ros.....http://dblp.org/pers/hd/r/Ros:Alberto", "María Engracia Gómez.....http://dblp.org/pers/hd/g/G=oacute=mez:Mar=iacute=a_Engracia", "Antonio Robles.....http://dblp.org/pers/hd/r/Robles:Antonio", "José Duato.....http://dblp.org/pers/hd/d/Duato:Jos=eacute="], "pages": 12}