{"title": "Learning to judge image search results.", "fields": ["incremental heuristic search", "metasearch engine", "search analytics", "best first search", "fringe search"], "abstract": "Given the explosive growth of the Web and the popularity of image sharing Web sites, image retrieval plays an increasingly important role in our daily lives. Search engines aim to provide beneficial image search results to users in response to queries. The quality of image search results depends on many factors: chosen search algorithms, ranking functions, indexing features, the base image database, etc. Applying different settings for these factors generates search result lists with varying levels of quality. Previous research has shown that no setting can always perform optimally for all queries. Therefore, given a set of search result lists generated by different settings, it is crucial to automatically determine which result list is the best in order to present it to users. This paper proposes a novel method to automatically identify the best search result list from a number of candidates. There are three main innovations in this paper. First, we propose a preference learning model to quantitatively study the best image search result identification problem. Second, we propose a set of valuable preference learning related features by exploring the visual characters of returned images. Third, our method shows promising potential in applications such as reranking ability assessment and optimal search engine selection. Experiments on two image search datasets show that our method achieves about 80% prediction accuracy for reranking ability assessment, and selects optimal search engine for about 70% queries correctly.", "citation": "Citations (14)", "departments": ["University of Science and Technology of China", "Texas State University", "Microsoft", "University of Texas at San Antonio"], "authors": ["Xinmei Tian.....http://dblp.org/pers/hd/t/Tian:Xinmei", "Yijuan Lu.....http://dblp.org/pers/hd/l/Lu:Yijuan", "Linjun Yang.....http://dblp.org/pers/hd/y/Yang:Linjun", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "conf": "mm", "year": "2011", "pages": 10}