{"title": "Continuous monitoring of distance-based outliers over data streams.", "fields": ["heuristic", "continuous monitoring", "synthetic data", "data stream mining", "outlier"], "abstract": "Anomaly detection is considered an important data mining task, aiming at the discovery of elements (also known as outliers) that show significant diversion from the expected case. More specifically, given a set of objects the problem is to return the suspicious objects that deviate significantly from the typical behavior. As in the case of clustering, the application of different criteria lead to different definitions for an outlier. In this work, we focus on distance-based outliers: an object x is an outlier if there are less than k objects lying at distance at most R from x. The problem offers significant challenges when a stream-based environment is considered, where data arrive continuously and outliers must be detected on-the-fly. There are a few research works studying the problem of continuous outlier detection. However, none of these proposals meets the requirements of modern stream-based applications for the following reasons: (i) they demand a significant storage overhead, (ii) their efficiency is limited and (iii) they lack flexibility. In this work, we propose new algorithms for continuous outlier monitoring in data streams, based on sliding windows. Our techniques are able to reduce the required storage overhead, run faster than previously proposed techniques and offer significant flexibility. Experiments performed on real-life as well as synthetic data sets verify our theoretical study.", "citation": "Citations (85)", "departments": ["Department of I ... aloniki, Greece", "Department of I ... aloniki, Greece", "Department of I ... aloniki, Greece", "Department of I ... aloniki, Greece", "Department of I ... aloniki, Greece"], "authors": ["Maria Kontaki.....http://dblp.org/pers/hd/k/Kontaki:Maria", "Anastasios Gounaris.....http://dblp.org/pers/hd/g/Gounaris:Anastasios", "Apostolos N. Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos:Apostolos_N=", "Kostas Tsichlas.....http://dblp.org/pers/hd/t/Tsichlas:Kostas", "Yannis Manolopoulos.....http://dblp.org/pers/hd/m/Manolopoulos:Yannis"], "conf": "icde", "year": "2011", "pages": 12}