{"title": "Maximizing lifetime for the shortest path aggregation tree in wireless sensor networks.", "fields": ["longest path problem", "shortest path tree", "k shortest path routing", "constrained shortest path first", "widest path problem"], "abstract": "In many applications of wireless sensor networks, a sensor node senses the environment to get data and delivers them to the sink via a single hop or multi-hop path. Many systems use a tree rooted at the sink as the underlying routing structure. Since the sensor node is energy constrained, how to construct a good tree to prolong the lifetime of the network is an important problem. We consider this problem under the scenario where nodes have different initial energy, and they can do in-network aggregation. In previous works, it has been proved that finding a maximum lifetime tree from all feasible spanning trees is NP-complete. Since delay is also an important element in time-critical applications, and shortest path trees intuitively have short delay, it is imperative to find a shortest path tree with long lifetime. This paper studies the problem of maximizing the lifetime of data aggregation trees, which are limited to shortest path trees. We find that when it is restricted to shortest path trees, the original problem is in P. We transform the problem into a general version of semi-matching problem, and show that the problem can be solved by min-cost max-flow approach in polynomial time. Also we design a distributed solution. Simulation results show that our approach greatly improves the lifetime of the network and is more competitive when it is applied in a dense network.", "citation": "Citations (116)", "departments": ["Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Dijun Luo.....http://dblp.org/pers/hd/l/Luo:Dijun", "Xiaojun Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Xiaojun", "Xiaobing Wu.....http://dblp.org/pers/hd/w/Wu:Xiaobing", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai"], "conf": "infocom", "year": "2011", "pages": 9}