{"title": "Merkle Puzzles in a Quantum World.", "fields": ["quantum capacity", "quantum walk", "quantum cryptography", "element distinctness problem", "merkle s puzzles"], "abstract": "In 1974, Ralph Merkle proposed the first unclassified scheme for secure communications over insecure channels. When legitimate communicating parties are willing to spend an amount of computational effort proportional to some parameter N, an eavesdropper cannot break into their communication without spending a time proportional to N2, which is quadratically more than the legitimate effort. We showed in an earlier paper that Merkle's schemes are completely insecure against a quantum adversary, but that their security can be partially restored if the legitimate parties are also allowed to use quantum computation: the eavesdropper needed to spend a time proportional to N3/2 to break our earlier quantum scheme. Furthermore, all previous classical schemes could be broken completely by the onslaught of a quantum eavesdropper and we conjectured that this is unavoidable.\n\nWe give two novel key agreement schemes in the spirit of Merkle's. The first one can be broken by a quantum adversary that makes an effort proportional to N5/3 to implement a quantum random walk in a Johnson graph reminiscent of Andris Ambainis' quantum algorithm for the element distinctness problem. This attack is optimal up to logarithmic factors. Our second scheme is purely classical, yet it cannot be broken by a quantum eavesdropper who is only willing to expend effort proportional to that of the legitimate parties.", "citation": "Citations (14)", "departments": ["Université de Montréal", "University of Calgary", "Université de Montréal", "Université de Montréal", "University of Paris-Sud"], "authors": ["Gilles Brassard.....http://dblp.org/pers/hd/b/Brassard:Gilles", "Peter Høyer.....http://dblp.org/pers/hd/h/H=oslash=yer:Peter", "Kassem Kalach.....http://dblp.org/pers/hd/k/Kalach:Kassem", "Marc Kaplan.....http://dblp.org/pers/hd/k/Kaplan:Marc", "Sophie Laplante.....http://dblp.org/pers/hd/l/Laplante:Sophie", "Louis Salvail.....http://dblp.org/pers/hd/s/Salvail:Louis"], "conf": "crypto", "year": "2011", "pages": 20}