{"title": "Bloom Filter Guided Transaction Scheduling.", "fields": ["job shop scheduling", "transactional memory", "concurrency control", "distributed transaction", "database transaction"], "abstract": "Contention management is an important design component to a transactional memory system. Without effective contention management to ensure forward progress, a transactional memory system can experience live-lock, which is difficult to debug in parallel programs. Early work in contention management focused on heuristic managers that reacted to conflicts between transactions by picking the most appropriate transaction to abort. Reactive methods allow conflicts to happen repeatedly as they do not try to prevent future conflicts from happening. These shortcomings of reactive contention managers have led to proposals that approach contention management as a scheduling problem — proactive managers. Proactive techniques range from throttling execution in predicted periods of high contention to preventing groups of transactions running concurrently that are predicted likely to conflict. We propose a novel transaction scheduling scheme called “Bloom Filter Guided Transaction Scheduling” (BFGTS), that uses a combination of simple hardware and Bloom filter heuristics to guide scheduling decisions and provide enhanced performance in high contention situations. We compare to two state-of-the-art transaction schedulers, “Adaptive Transaction Scheduling” and “Proactive Transaction Scheduling” and show that BFGTS attains up to a 4.6× and 1.7× improvement on high contention benchmarks respectively. Across all benchmarks it shows a 35% and 25% average performance improvement respectively.", "citation": "Citations (30)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Geoffrey Blake.....http://dblp.org/pers/hd/b/Blake:Geoffrey", "Ronald G. Dreslinski.....http://dblp.org/pers/hd/d/Dreslinski:Ronald_G=", "Trevor N. Mudge.....http://dblp.org/pers/hd/m/Mudge:Trevor_N="], "conf": "hpca", "year": "2011", "pages": 12}