{"title": "Why nothing matters: the impact of zeroing.", "fields": ["compromise", "memory bandwidth", "cache", "memory safety", "ranging"], "abstract": "Memory safety defends against inadvertent and malicious misuse of memory that may compromise program correctness and security. A critical element of memory safety is zero initialization. The direct cost of zero initialization is surprisingly high: up to 12.7%, with average costs ranging from 2.7 to 4.5% on a high performance virtual machine on IA32 architectures. Zero initialization also incurs indirect costs due to its memory bandwidth demands and cache displacement effects. Existing virtual machines either: a) minimize direct costs by zeroing in large blocks, or b) minimize indirect costs by zeroing in the allocation sequence, which reduces cache displacement and bandwidth. This paper evaluates the two widely used zero initialization designs, showing that they make different tradeoffs to achieve very similar performance. Our analysis inspires three better designs: (1) bulk zeroing with cache-bypassing (non-temporal) instructions to reduce the direct and indirect zeroing costs simultaneously, (2) concurrent non-temporal bulk zeroing that exploits parallel hardware to move work off the application's critical path, and (3) adaptive zeroing, which dynamically chooses between (1) and (2) based on available hardware parallelism. The new software strategies offer speedups sometimes greater than the direct overhead, improving total performance by 3% on average. Our findings invite additional optimizations and microarchitectural support.", "citation": "Citations (62)", "departments": ["Australian National University", "Australian National University", "Australian National University", "École Polytechnique Fédérale de Lausanne", "University of Texas at Austin"], "authors": ["Xi Yang.....http://dblp.org/pers/hd/y/Yang:Xi", "Stephen M. Blackburn.....http://dblp.org/pers/hd/b/Blackburn:Stephen_M=", "Daniel Frampton.....http://dblp.org/pers/hd/f/Frampton:Daniel", "Jennifer B. Sartor.....http://dblp.org/pers/hd/s/Sartor:Jennifer_B=", "Kathryn S. McKinley.....http://dblp.org/pers/hd/m/McKinley:Kathryn_S="], "conf": "oopsla", "year": "2011", "pages": 18}