{"title": "Maximum Covariance Unfolding : Manifold Learning for Bimodal Data.", "fields": ["embedding", "voxel", "spectral graph theory", "semidefinite programming", "nonlinear dimensionality reduction"], "abstract": "We propose maximum covariance unfolding (MCU), a manifold learning algorithm for simultaneous dimensionality reduction of data from different input modalities. Given high dimensional inputs from two different but naturally aligned sources, MCU computes a common low dimensional embedding that maximizes the cross-modal (inter-source) correlations while preserving the local (intra-source) distances. In this paper, we explore two applications of MCU. First we use MCU to analyze EEG-fMRI data, where an important goal is to visualize the fMRI voxels that are most strongly correlated with changes in EEG traces. To perform this visualization, we augment MCU with an additional step for metric learning in the high dimensional voxel space. Second, we use MCU to perform cross-modal retrieval of matched image and text samples from Wikipedia. To manage large applications of MCU, we develop a fast implementation based on ideas from spectral graph theory. These ideas transform the original problem for MCU, one of semidefinite programming, into a simpler problem in semidefinite quadratic linear programming.", "citation": "Citations (22)", "year": "2011", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "nips", "authors": ["Vijay Mahadevan.....http://dblp.org/pers/hd/m/Mahadevan:Vijay", "Chi Wah Wong.....http://dblp.org/pers/hd/w/Wong:Chi_Wah", "Jose Costa Pereira.....http://dblp.org/pers/hd/p/Pereira:Jose_Costa", "Tom Liu.....http://dblp.org/pers/hd/l/Liu:Tom", "Nuno Vasconcelos.....http://dblp.org/pers/hd/v/Vasconcelos:Nuno", "Lawrence K. Saul.....http://dblp.org/pers/hd/s/Saul:Lawrence_K="], "pages": 9}