{"title": "A \"string of feature graphs\" model for recognition of complex activities in natural videos.", "fields": ["feature model", "region of interest", "activity recognition", "dynamic programming", "string"], "abstract": "Videos usually consist of activities involving interactions between multiple actors, sometimes referred to as complex activities. Recognition of such activities requires modeling the spatio-temporal relationships between the actors and their individual variabilities. In this paper, we consider the problem of recognition of complex activities in a video given a query example. We propose a new feature model based on a string representation of the video which respects the spatio-temporal ordering. This ordered arrangement of local collections of features (e.g., cuboids, STIP), which are the characters in the string, are initially matched using graph-based spectral techniques. Final recognition is obtained by matching the string representations of the query and the test videos in a dynamic programming framework which allows for variability in sampling rates and speed of activity execution. The method does not require tracking or recognition of body parts, is able to identify the region of interest in a cluttered scene, and gives reasonable performance with even a single query example. We test our approach in an example-based video retrieval framework with two publicly available complex activity datasets and provide comparisons against other methods that have studied this problem.", "citation": "Citations (130)", "year": "2011", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "conf": "iccv", "authors": ["Utkarsh Gaur.....http://dblp.org/pers/hd/g/Gaur:Utkarsh", "Yingying Zhu.....http://dblp.org/pers/hd/z/Zhu:Yingying", "Bi Song.....http://dblp.org/pers/hd/s/Song:Bi", "Amit K. Roy-Chowdhury.....http://dblp.org/pers/hd/r/Roy=Chowdhury:Amit_K="], "pages": 8}