{"title": "Exploiting temporal dependency for opportunistic forwarding in urban vehicular networks.", "fields": ["vehicular ad hoc network", "icts", "redundancy", "mobility model", "hop"], "abstract": "Inter-contact times (ICTs) between moving vehicles are one of the key metrics in vehicular networks, and they are also central to forwarding algorithms and the end-to-end delay. Recent study on the tail distribution of ICTs based on theoretical mobility models and empirical trace data shows that the delay between two consecutive contact opportunities drops exponentially. While theoretical results facilitate problem analysis, how to design practical opportunistic forwarding protocols in vehicular networks, where messages are delivered in carry-and-forward fashion, is still unclear. In this paper, we study three large sets of Global Positioning System (GPS) traces of more than ten thousand public vehicles, collected from Shanghai and Shenzhen, two metropolises in China. By mining the temporal correlation and the evolution of ICTs between each pair of vehicles, we use higher order Markov chains to characterize urban vehicular mobility patterns, which adapt as ICTs between vehicles continuously get updated. Then, the next hop for message forwarding is determined based on the previous ICTs. With our message forwarding strategy, it can dramatically increase delivery ratio (up to 80%) and reduce end-to-end delay (up to 50%) while generating similar network traffic comparing to current strategies based on the delivery probability or the expected delay.", "citation": "Citations (84)", "departments": ["University of Waterloo", "Xi'an Jiaotong University", "Shanghai Jiao Tong University", "University of Waterloo", "University of Waterloo"], "authors": ["Hongzi Zhu.....http://dblp.org/pers/hd/z/Zhu:Hongzi", "Shan Chang.....http://dblp.org/pers/hd/c/Chang:Shan", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu", "Kshirasagar Naik.....http://dblp.org/pers/hd/n/Naik:Kshirasagar", "Sherman X. Shen.....http://dblp.org/pers/hd/s/Shen:Sherman_X="], "conf": "infocom", "year": "2011", "pages": 9}