{"title": "Difficulty guided image retrieval using linear multiview embedding.", "fields": ["relevance feedback", "small set", "subspace topology", "image retrieval", "embedding"], "abstract": "Existing image retrieval systems suffer from a radical performance variance for different queries. The bad initial search results for \"difficult\" queries may greatly degrade the performance of their subsequent refinements, especially the refinement that utilizes the information mined from the search results, e.g., pseudo relevance feedback based reranking. In this paper, we tackle this problem by proposing a query difficulty guided image retrieval system, which selectively performs reranking according to the estimated query difficulty. To improve the performance of both reranking and difficulty estimation, we apply multiview embedding (ME) to images represented by multiple different features for integrating a joint subspace by preserving the neighborhood information in each feature space. However, existing ME approaches suffer from both \"out of sample\" and huge computational cost problems, and cannot be applied to online reranking or offline large-scale data processing for practical image retrieval systems. Therefore, we propose a linear multiview embedding algorithm which learns a linear transformation from a small set of data and can effectively infer the subspace features of new data. Empirical evaluations on both Oxford and 500K ImageNet datasets suggest the effectiveness of the proposed difficulty guided retrieval system with LME.", "citation": "Citations (6)", "departments": ["Peking University", "Peking University", "National University of Singapore", "University of Technology, Sydney", "Microsoft"], "authors": ["Yangxi Li.....http://dblp.org/pers/hd/l/Li:Yangxi", "Bo Geng.....http://dblp.org/pers/hd/g/Geng:Bo", "Zheng-Jun Zha.....http://dblp.org/pers/hd/z/Zha:Zheng=Jun", "Dacheng Tao.....http://dblp.org/pers/hd/t/Tao:Dacheng", "Linjun Yang.....http://dblp.org/pers/hd/y/Yang:Linjun", "Chao Xu.....http://dblp.org/pers/hd/x/Xu_0006:Chao"], "conf": "mm", "year": "2011", "pages": 4}