{"title": "A Unified Continuous Greedy Algorithm for Submodular Maximization.", "fields": ["greedy algorithm", "algorithmic game theory", "submodular set function", "modular form", "vector optimization"], "abstract": "The study of combinatorial problems with a sub modular objective function has attracted much attention in recent years, and is partly motivated by the importance of such problems to economics, algorithmic game theory and combinatorial optimization. Classical works on these problems are mostly combinatorial in nature. Recently, however, many results based on continuous algorithmic tools have emerged. The main bottleneck of such continuous techniques is how to approximately solve a non-convex relaxation for the sub modular problem at hand. Thus, the efficient computation of better fractional solutions immediately implies improved approximations for numerous applications. A simple and elegant method, called ``continuous greedy'', successfully tackles this issue for monotone sub modular objective functions, however, only much more complex tools are known to work for general non-monotone sub modular objectives. In this work we present a new unified continuous greedy algorithm which finds approximate fractional solutions for both the non-monotone and monotone cases, and improves on the approximation ratio for many applications. For general non-monotone sub modular objective functions, our algorithm achieves an improved approximation ratio of about $1/e$. For monotone sub modular objective functions, our algorithm achieves an approximation ratio that depends on the density of the poly tope defined by the problem at hand, which is always at least as good as the previously known best approximation ratio of $1 - 1/e$. Some notable immediate implications are an improved $1/e$-approximation for maximizing a non-monotone sub modular function subject to a matroid or $O(1)$-knapsack constraints, and information-theoretic tight approximations for Sub modular Max-SAT and Sub modular Welfare with $k$ players, for {\\em any} number of players $k$. A framework for sub modular optimization problems, called the \\emph{contention resolution framework}, was introduced recently by Chekuri et al. The improved approximation ratio of the unified continuous greedy algorithm implies improved approximation ratios for many problems through this framework. Moreover, via a parameter called \\emph{stopping time}, our algorithm merges the relaxation solving and re-normalization steps of the framework, and achieves, for some applications, further improvements. We also describe new monotone balanced contention resolution schemes for various matching, scheduling and packing problems, thus, improving the approximations achieved for these problems via the framework.", "citation": "Citations (112)", "year": "2011", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "conf": "focs", "authors": ["Moran Feldman.....http://dblp.org/pers/hd/f/Feldman:Moran", "Joseph Naor.....http://dblp.org/pers/hd/n/Naor:Joseph", "Roy Schwartz.....http://dblp.org/pers/hd/s/Schwartz:Roy"], "pages": 10}