{"title": "Automatic tag generation and ranking for sensor-rich outdoor videos.", "fields": ["ranking", "video tracking", "video processing", "geospatial analysis", "web application"], "abstract": "Video tag annotations have become a useful and powerful feature to facilitate video search in many social media and web applications. The majority of tags assigned to videos are supplied by users - a task which is time consuming and may result in annotations that are subjective and lack precision. A number of studies have utilized content-based extraction techniques to automate tag generation. However, these methods are compute-intensive and challenging to apply across domains. Here, we describe a complementary approach for generating tags based on the geographic properties of videos. With today's sensor-equipped smartphones, the location and orientation of a camera can be continuously acquired in conjunction with the captured video stream. Our novel technique utilizes these sensor meta-data to automatically tag outdoor videos in a two step process. First, we model the viewable scenes of the video as geometric shapes by means of its accompanied sensor data and determine the geographic objects that are visible in the video by querying geo-information databases through the viewable scene descriptions. Subsequently we extract textual information about the visible objects to serve as tags. Second, we define six criteria to score the tag relevance and rank the obtained tags based on these scores. Then we associate the tags with the video and the accurately delimited segments of the video. To evaluate the proposed technique we implemented a prototype tag generator and conducted a user study. The results demonstrate significant benefits of our method in terms of automation and tag utility.", "citation": "Citations (57)", "departments": ["National University of Singapore", "National University of Singapore", "University of Southern California", "National University of Singapore"], "authors": ["Zhijie Shen.....http://dblp.org/pers/hd/s/Shen:Zhijie", "Sakire Arslan Ay.....http://dblp.org/pers/hd/a/Ay:Sakire_Arslan", "Seon Ho Kim.....http://dblp.org/pers/hd/k/Kim:Seon_Ho", "Roger Zimmermann.....http://dblp.org/pers/hd/z/Zimmermann:Roger"], "conf": "mm", "year": "2011", "pages": 10}