{"title": "SolarCore: Solar energy driven multi-core architecture power management.", "fields": ["power management", "green computing", "carbon footprint", "grid parity", "solar power"], "abstract": "The global energy crisis and environmental concerns (e.g. global warming) have driven the IT community into the green computing era. Of clean, renewable energy sources, solar power is the most promising. While efforts have been made to improve the performance-per-watt, conventional architecture power management schemes incur significant solar energy loss since they are largely workload-driven and unaware of the supply-side attributes. Existing solar power harvesting techniques improve the energy utilization but increase the environmental burden and capital investment due to the inclusion of large-scale batteries. Moreover, solar power harvesting itself cannot guarantee high performance without appropriate load adaptation. To this end, we propose SolarCore, a solar energy driven, multi-core architecture power management scheme that combines maximal power provisioning control and workload run-time optimization. Using real-world meteorological data across different geographic sites and seasons, we show that SolarCore is capable of achieving the optimal operation condition (e.g. maximal power point) of solar panels autonomously under various environmental conditions with a high green energy utilization of 82% on average. We propose efficient heuristics for allocating the time varying solar power across multiple cores and our algorithm can further improve the workload performance by 10.8% compared with that of round-robin adaptation, and at least 43% compared with that of conventional fixed-power budget control. This paper makes the first step on maximally reducing the carbon footprint of computing systems through the usage of renewable energy sources. We expect that the novel joint optimization techniques proposed in this paper will contribute to building a truly sustainable, high-performance computing environment.", "citation": "Citations (94)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida"], "authors": ["Chao Li.....http://dblp.org/pers/hd/l/Li_0009:Chao", "Wangyuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Wangyuan", "Chang-Burm Cho.....http://dblp.org/pers/hd/c/Cho:Chang=Burm", "Tao Li.....http://dblp.org/pers/hd/l/Li_0006:Tao"], "conf": "hpca", "year": "2011", "pages": 12}