{"title": "Fully secure pairwise and triple key distribution in wireless sensor networks using combinatorial designs.", "fields": ["key distribution", "pairwise comparison", "key management", "key distribution in wireless sensor networks", "public key cryptography"], "abstract": "We address pairwise and (for the first time) triple key establishment problems in wireless sensor networks (WSN). We use combinatorial designs to establish pairwise keys between nodes in a WSN. A BIBD(v; b; r; k; λ) (or t - (v; b; r; k; λ)) design can be mapped to a sensor network, where v represents the size of the key pool, b represents the maximum number of nodes that the network can support, k represents the size of the key chain. Any pair (or t-subset) of keys occurs together uniquely in exactly λ nodes. λ = 2 and λ = 3 are used to establish unique pairwise or triple keys. Our pairwise key distribution is the first one that is fully secure (none of the links among uncompromised nodes is affected) and applicable for mobile sensor networks (as key distribution is independent on the connectivity graph), while preserving low storage, computation and communication requirements. We also use combinatorial trades to establish pairwise keys. This is the first time that trades are being applied to key management. We describe a new construction of Strong Steiner Trades. We introduce a novel concept of triple key distribution, in which a common key is established between three nodes. This allows secure passive monitoring of forwarding progress in routing tasks. We present a polynomial-based approach and a combinatorial approach (using trades) for triple key distribution.", "citation": "Citations (57)", "departments": ["University of Ottawa", "University of Ottawa", "University of Ottawa"], "authors": ["Sushmita Ruj.....http://dblp.org/pers/hd/r/Ruj:Sushmita", "Amiya Nayak.....http://dblp.org/pers/hd/n/Nayak:Amiya", "Ivan Stojmenovic.....http://dblp.org/pers/hd/s/Stojmenovic:Ivan"], "conf": "infocom", "year": "2011", "pages": 5}