{"title": "Consensus extraction from heterogeneous detectors to improve performance over network traffic anomaly detection.", "fields": ["operator", "probabilistic logic", "intrusion detection system", "discriminative model", "anomaly detection"], "abstract": "Network operators are continuously confronted with malicious events, such as port scans, denial-of-service attacks, and spreading of worms. Due to the detrimental effects caused by these anomalies, it is critical to detect them promptly and effectively. There have been numerous softwares, algorithms, or rules developed to conduct anomaly detection over traffic data. However, each of them only has limited descriptions of the anomalies, and thus suffers from high false positive/false negative rates. In contrast, the combination of multiple atomic detectors can provide a more powerful anomaly capturing capability when the base detectors complement each other. In this paper, we propose to infer a discriminative model by reaching consensus among multiple atomic anomaly detectors in an unsupervised manner when there are very few or even no known anomalous events for training. The proposed algorithm produces a perevent based non-trivial weighted combination of the atomic detectors by iteratively maximizing the probabilistic consensus among the output of the base detectors applied to different traffic records. The resulting model is different and not obtainable using Bayesian model averaging or weighted voting. Through experimental results on three network anomaly detection datasets, we show that the combined detector improves over the base detectors by 10% to 20% in accuracy.", "citation": "Citations (5)", "departments": ["University of Illinois at Urbana–Champaign", "IBM", "IBM", "IBM", "IBM"], "authors": ["Jing Gao.....http://dblp.org/pers/hd/g/Gao:Jing", "Wei Fan.....http://dblp.org/pers/hd/f/Fan_0001:Wei", "Deepak S. Turaga.....http://dblp.org/pers/hd/t/Turaga:Deepak_S=", "Olivier Verscheure.....http://dblp.org/pers/hd/v/Verscheure:Olivier", "Xiaoqiao Meng.....http://dblp.org/pers/hd/m/Meng:Xiaoqiao", "Lu Su.....http://dblp.org/pers/hd/s/Su:Lu", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "infocom", "year": "2011", "pages": 5}