{"title": "Subscriber assignment for wide-area content-based publish/subscribe.", "fields": ["coreset", "heuristics", "approximation algorithm", "randomized rounding", "greedy algorithm"], "abstract": "We study the problem of assigning subscribers to brokers in a wide-area content-based publish/subscribe system. A good assignment should consider both subscriber interests in the event space and subscriber locations in the network space, and balance multiple performance criteria including bandwidth, delay, and load balance. The resulting optimization problem is NP-complete, so systems have turned to heuristics and/or simpler algorithms that ignore some performance criteria. Evaluating these approaches has been challenging because optimal solutions remain elusive for realistic problem sizes. To enable proper evaluation, we develop a Monte Carlo approximation algorithm with good theoretical properties and robustness to workload variations. To make it computationally feasible, we combine the ideas of linear programming, randomized rounding, coreset, and iterative reweighted sampling. We demonstrate how to use this algorithm as a yardstick to evaluate other algorithms, and why it is better than other choices of yardsticks. With its help, we show that a simple greedy algorithm works well for a number of workloads, including one generated from publicly available statistics on Google Groups. We hope that our algorithms are not only useful in their own right, but our principled approach toward evaluation will also be useful in future evaluation of solutions to similar problems in content-based publish/subscribe.", "citation": "Citations (2)", "departments": ["Duke University", "Duke University", "Duke University", "Duke University", "Duke University", "Duke University"], "authors": ["Albert Yu.....http://dblp.org/pers/hd/y/Yu:Albert", "Pankaj K. Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Pankaj_K=", "Jun Yang.....http://dblp.org/pers/hd/y/Yang_0001:Jun"], "conf": "icde", "year": "2011", "pages": 12}