{"title": "STAP: A social-tier-assisted packet forwarding protocol for achieving receiver-location privacy preservation in VANETs.", "fields": ["packet forwarding", "network packet", "adversary", "information privacy", "security analysis"], "abstract": "Receiver-location privacy is an important security requirement in privacy-preserving Vehicular Ad hoc Networks (VANETs), yet the unavailable receiver's location information makes many existing packet forwarding protocols inefficient in VANETs. To tackle this challenging issue, in this paper, we propose an efficient social-tier-assisted packet forwarding protocol, called STAP, for achieving receiver-location privacy preservation in VANETs. Specifically, by observing the phenomena that vehicles often visit some social spots, such as well-traversed shopping malls and busy intersections in a city environment, we deploy storage-rich Roadside Units (RSUs) at social spots and form a virtual social tier with them. Then, without knowing the receiver's exact location information, a packet can be first forwarded and disseminated in the social tier. Later, once the receiver visits one of social spots, it can successfully receive the packet. Detailed security analysis shows that the proposed STAP protocol can protect the receiver's location privacy against an active global adversary, and achieve vehicle's conditional privacy preservation as well. In addition, performance evaluation via extensive simulations demonstrates its efficiency in terms of high delivery ratio and low average delay.", "citation": "Citations (89)", "departments": ["University of Ontario Institute of Technology", "University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong", "Rongxing Lu.....http://dblp.org/pers/hd/l/Lu:Rongxing", "Xiaohui Liang.....http://dblp.org/pers/hd/l/Liang:Xiaohui", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin"], "conf": "infocom", "year": "2011", "pages": 9}