{"title": "Colorizing tags in tag cloud: a novel query-by-tag music search system.", "fields": ["music information retrieval", "search engine indexing", "tag cloud", "mouse button", "probabilistic logic"], "abstract": "This paper presents a novel content-based query-by-tag music search system for an untagged music database. We design a new tag query interface that allows users to input multiple tags with multiple levels of preference (denoted as an MTML query) by colorizing desired tags in a web-based tag cloud interface. When a user clicks and holds the left mouse button (or presses and holds his/her finger on a touch screen) on a desired tag, the color of the tag will change cyclically according to a color map (from dark blue to bright red), which represents the level of preference (from 0 to 1). In this way, the user can easily organize and check the query of multiple tags with multiple levels of preference through the colored tags. To effect the MTML content-based music retrieval, we introduce a probabilistic fusion model (denoted as GMFM), which consists of two mixture models, namely a Gaussian mixture model and a multinomial mixture model. GMFM can jointly model the auditory features and tag labels of a song. Two indexing methods and their corresponding matching methods, namely pseudo song-based matching and tag affinity-based matching, are incorporated into the pre-learned GMFM. We evaluate the proposed system on the MajorMiner and CAL-500 datasets. The experimental results demonstrate the effectiveness of GMFM and the potential of using MTML queries to search music from an untagged music database.", "citation": "Citations (14)", "departments": ["National Taiwan University", "National Taiwan University", "Academia Sinica", "Academia Sinica", "National Taiwan University"], "authors": ["Ju-Chiang Wang.....http://dblp.org/pers/hd/w/Wang:Ju=Chiang", "Yu-Chin Shih.....http://dblp.org/pers/hd/s/Shih:Yu=Chin", "Meng-Sung Wu.....http://dblp.org/pers/hd/w/Wu:Meng=Sung", "Hsin-Min Wang.....http://dblp.org/pers/hd/w/Wang:Hsin=Min", "Shyh-Kang Jeng.....http://dblp.org/pers/hd/j/Jeng:Shyh=Kang"], "conf": "mm", "year": "2011", "pages": 10}