{"title": "Fast and scalable secret key generation exploiting channel phase randomness in wireless networks.", "fields": ["group key", "narrowband", "key generation", "fading", "key"], "abstract": "Recently, there has been great interest in physical layer security techniques that exploit the randomness of wireless channels for securely extracting cryptographic keys. Several interesting approaches have been developed and demonstrated for their feasibility. The state-of-the-art, however, still has much room for improving their practicality. This is because i) the key bit generation rate supported by most existing approaches is very low which significantly limits their practical usage given the intermittent connectivity in mobile environments; ii) existing approaches suffer from the scalability and flexibility issues, i.e., they cannot be directly extended to support efficient group key generation and do not suit for static environments. With these observations in mind, we present a new secret key generation approach that utilizes the uniformly distributed phase information of channel responses to extract shared cryptographic keys under narrowband multipath fading models. The proposed approach enjoys a high key bit generation rate due to its efficient introduction of multiple randomized phase information within a single coherence time interval as the keying sources. The proposed approach also provides scalability and flexibility because it relies only on the transmission of periodical extensions of unmodulated sinusoidal beacons, which allows effective accumulation of channel phases across multiple nodes. The proposed scheme is thoroughly evaluated through both analytical and simulation studies. Compared to existing work that focus on pairwise key generation, our approach is highly scalable and can improve the analytical key bit generation rate by a couple of orders of magnitude.", "citation": "Citations (180)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology", "KAIST"], "authors": ["Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Hai Su.....http://dblp.org/pers/hd/s/Su:Hai", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Kwangjo Kim.....http://dblp.org/pers/hd/k/Kim:Kwangjo"], "conf": "infocom", "year": "2011", "pages": 9}