{"title": "Overflow management with multipart packets.", "fields": ["network packet", "forward error correction", "randomized algorithm", "schedule", "packet switching", "competitive analysis", "goodput"], "abstract": "We study an abstract setting, where the basic information units (called “superpackets”) do not fit into a single packet, and are therefore spread over multiple packets. We assume that a superpacket is useful only if the number of its delivered packets is above a certain threshold. Our focus of attention is communication link ingresses, where large arrival bursts result in dropped packets. The algorithmic question we address is which packets to drop so as to maximize goodput. Specifically, suppose that each superpacket consists of k packets, and that a superpacket can be reconstructed if at most β · k of its packets are lost, for some given parameter 0 ≤ β < 1. We present a simple online distributed randomized algorithm in this model, and prove that in any scenario, its expected goodput is at least equation, where OPT denotes the best possible goodput by any algorithm, and σ denotes the size of the largest burst (the bound can be improved as a function of burst-size variability). We also analyze the effect of buffers on goodput under the assumption of fixed burst size, and show that in this case, when the buffer is not too small, our algorithm can attain, with high probability, (1 − e) goodput utilization for any e > 0. Finally, we present some simulation results that demonstrate that the behavior of our algorithm in practice is far better than our worst-case analytical bounds.", "citation": "Citations (15)", "departments": ["Tel Aviv University", "Tel Aviv University", "Tel Aviv University", "Tel Aviv University", "Tel Aviv University", "Tel Aviv University"], "authors": ["Yishay Mansour.....http://dblp.org/pers/hd/m/Mansour:Yishay", "Boaz Patt-Shamir.....http://dblp.org/pers/hd/p/Patt=Shamir:Boaz", "Dror Rawitz.....http://dblp.org/pers/hd/r/Rawitz:Dror"], "conf": "infocom", "year": "2011", "pages": 9}