{"title": "Sensing cognitive multitasking for a brain-based adaptive user interface.", "fields": ["human multitasking", "human robot interaction", "adaptive user interface", "frustration", "task switching"], "abstract": "Multitasking has become an integral part of work environments, even though people are not well-equipped cognitively to handle numerous concurrent tasks effectively. Systems that support such multitasking may produce better performance and less frustration. However, without understanding the user's internal processes, it is difficult to determine optimal strategies for adapting interfaces, since all multitasking activity is not identical. We describe two experiments leading toward a system that detects cognitive multitasking processes and uses this information as input to an adaptive interface. Using functional near-infrared spectroscopy sensors, we differentiate four cognitive multitasking processes. These states cannot readily be distinguished using behavioral measures such as response time, accuracy, keystrokes or screen contents. We then present our human-robot system as a proof-of-concept that uses real-time cognitive state information as input and adapts in response. This prototype system serves as a platform to study interfaces that enable better task switching, interruption management, and multitasking.", "citation": "Citations (52)", "year": "2011", "departments": ["Tufts University", "Tufts University", "Tufts University", "Tufts University", "Tufts University"], "conf": "chi", "authors": ["Erin Treacy Solovey.....http://dblp.org/pers/hd/s/Solovey:Erin_Treacy", "Francine Lalooses.....http://dblp.org/pers/hd/l/Lalooses:Francine", "Krysta Chauncey.....http://dblp.org/pers/hd/c/Chauncey:Krysta", "Douglas Weaver.....http://dblp.org/pers/hd/w/Weaver:Douglas", "Margarita Parasi.....http://dblp.org/pers/hd/p/Parasi:Margarita", "Matthias Scheutz.....http://dblp.org/pers/hd/s/Scheutz:Matthias", "Angelo Sassaroli.....http://dblp.org/pers/hd/s/Sassaroli:Angelo", "Sergio Fantini.....http://dblp.org/pers/hd/f/Fantini:Sergio", "Paul W. Schermerhorn.....http://dblp.org/pers/hd/s/Schermerhorn:Paul_W=", "Audrey Girouard.....http://dblp.org/pers/hd/g/Girouard:Audrey", "Robert J. K. Jacob.....http://dblp.org/pers/hd/j/Jacob:Robert_J=_K="], "pages": 10}