{"title": "Network warehouses: Efficient information distribution to mobile users.", "fields": ["wireless mesh network", "lossy compression", "multicast", "routing protocol", "mobile ad hoc network"], "abstract": "We consider the problem of distributing time-sensitive information from a collection of sources to mobile users traversing a wireless mesh network. Our strategy is to distributively select a set of well-placed nodes (warehouses) to act as intermediaries between the information sources and clusters of users. Warehouses are selected via the distributed construction of Hierarchical Well-Separated Trees (HSTs), which are sparse structures that induce a natural spatial clustering of the network. Unlike many traditional multicast protocols, our approach is not data driven. Rather, it is agnostic to the number and position of sources as well as to the mobility patterns of users. Whereas source-rooted tree multicast algorithms construct a separate routing infrastructure to support each source, our sparse and flexible infrastructure is precomputed and efficiently reused by sources and users, its cost amortized over time. Moreover, the route acquisition delay inherent in on-demand wireless ad hoc network protocols is avoided by exploiting the HST addressing scheme. Our algorithm ensures with high probability a guaranteed stretch bound for the information delivery path, and is robust to lossy links and node failure by providing alternative HST-induced routes. Nearby users are clustered and their requests aggregated, further reducing communication overhead.", "citation": "Citations (9)", "departments": ["Stanford University", "Stanford University", "Commonwealth Scientific and Industrial Research Organisation", "Stanford University", "Stanford University"], "authors": ["Arik Motskin.....http://dblp.org/pers/hd/m/Motskin:Arik", "Ian Downes.....http://dblp.org/pers/hd/d/Downes:Ian", "Branislav Kusy.....http://dblp.org/pers/hd/k/Kusy:Branislav", "Omprakash Gnawali.....http://dblp.org/pers/hd/g/Gnawali:Omprakash", "Leonidas J. Guibas.....http://dblp.org/pers/hd/g/Guibas:Leonidas_J="], "conf": "infocom", "year": "2011", "pages": 9}