{"title": "The extensibility framework in Microsoft StreamInsight.", "fields": ["subject matter expert", "correctness", "stream processing", "file server", "extensibility"], "abstract": "Microsoft StreamInsight (StreamInsight, for brevity) is a platform for developing and deploying streaming applications, which need to run continuous queries over high-data-rate streams of input events. StreamInsight leverages a well-defined temporal stream model and operator algebra, as the underlying basis for processing long-running continuous queries over event streams. This allows StreamInsight to handle imperfections in event delivery and to provide correctness guarantees on the generated output. StreamInsight natively supports a diverse range of off-the-shelf streaming operators. In order to cater to a much broader range of customer scenarios and applications, StreamInsight has recently introduced a new extensibility infrastructure. With this infrastructure, StreamInsight enables developers to integrate their domain expertise within the query pipeline in the form of user defined modules (functions, operators, and aggregates). This paper describes the extensibility framework in StreamInsight; an ongoing effort at Microsoft SQL Server to support the integration of user-defined modules in a stream processing system. More specifically, the paper addresses the extensibility problem from three perspectives: the query writer's perspective, the user defined module writer's perspective, and the system's internal perspective. The paper introduces and addresses a range of new and subtle challenges that arise when we try to add extensibility to a streaming system, in a manner that is easy to use, powerful, and practical. We summarize our experience and provide future directions for supporting stream-oriented workloads in different business domains.", "citation": "Citations (39)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Mohamed H. Ali.....http://dblp.org/pers/hd/a/Ali:Mohamed_H=", "Badrish Chandramouli.....http://dblp.org/pers/hd/c/Chandramouli:Badrish", "Jonathan Goldstein.....http://dblp.org/pers/hd/g/Goldstein:Jonathan", "Roman Schindlauer.....http://dblp.org/pers/hd/s/Schindlauer:Roman"], "conf": "icde", "year": "2011", "pages": 12}