{"title": "Coached active learning for interactive video search.", "fields": ["interactive video", "semi supervised learning", "trecvid", "coaching", "active learning"], "abstract": "Active learning with uncertainty sampling has been popularly employed in implementing interactive video search, due to its promise to reduce labeling efforts. However, since the ultimate goal of interactive search is to find as many relevant shots as possible, the purely explorative learning strategy always places conventional active learning in a dilemma whether to explore uncertain areas for a better understanding of query distribution or to harvest in certain areas for more relevant instances. In this paper, we propose a novel paradigm of active learning, where a coaching process is introduced to guide the leaner by jointly consulting an estimated prior query distribution and a posterior query distribution indicated by current classifier outcomes. To bypass the difficulty of estimating the prior query distribution from a limited number of labeled relevant instances, we propose to estimate the distribution using a set of semantic distributions which are statistically from the same distributions as the labeled relevant instances. With the coaching of both prior and posterior query distributions, the learning can be conducted and scheduled with a global perspective, and thus can explicitly balance the trade-off between exploitation and exploration. The results of the experiments on TRECVID 2005--2009 datasets validate the efficiency and effectiveness of our approach, which outperforms the conventional active learning methods with uncertainty sampling and also shows superiority to several state-of-the art interactive video search systems.", "citation": "Citations (7)", "departments": ["Sichuan University", "Sichuan University"], "authors": ["Xiao-Yong Wei.....http://dblp.org/pers/hd/w/Wei:Xiao=Yong", "Zhen-Qun Yang.....http://dblp.org/pers/hd/y/Yang:Zhen=Qun"], "conf": "mm", "year": "2011", "pages": 10}