{"title": "A nonparametric Riemannian framework on tensor field with application to foreground segmentation.", "fields": ["manifold", "tensor", "pseudo riemannian manifold", "riemannian geometry", "information geometry", "kernel density estimation", "tensor field", "riemannian manifold"], "abstract": "Background modeling on tensor field has recently been proposed for foreground detection tasks. Taking into account the Riemannian structure of the tensor manifold, recent research has focused on developing parametric methods on the tensor domain, e.g. mixture of Gaussians (GMM). However, in some scenarios, simple parametric models do not accurately explain the physical processes. Kernel density estimators (KDEs) have been successful to model, on Euclidean sample spaces, the nonparametric nature of complex, time varying, and non-static backgrounds. Founded on a mathematically rigorous KDE paradigm on general Riemannian manifolds recently proposed in the literature, we define a KDE specifically to operate on the tensor manifold in order to nonparametrically reformulate the existing tensor-based algorithms. We present a mathematically sound framework for nonparametric modeling on tensor field to foreground detection. We endow the tensor manifold with two well-founded Riemannian metrics, i.e. Affine-Invariant and Log-Euclidean. Theoretical aspects are presented and the metrics are compared experimentally. By inducing a space with a null curvature, the Log-Euclidean metric considerably simplifies the scheme, from a practical point of view, while maintaining the mathematical soundness and the excellent segmentation performance. Theoretic analysis and experimental results demonstrate the promise and effectiveness of this framework.", "citation": "Citations (22)", "year": "2011", "departments": ["University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra"], "conf": "iccv", "authors": ["Rui Caseiro.....http://dblp.org/pers/hd/c/Caseiro:Rui", "João F. Henriques.....http://dblp.org/pers/hd/h/Henriques:Jo=atilde=o_F=", "Pedro Martins.....http://dblp.org/pers/hd/m/Martins_0004:Pedro", "Jorge P. Batista.....http://dblp.org/pers/hd/b/Batista:Jorge_P="], "pages": 8}