{"title": "Capacity of dual-radio multi-channel wireless sensor networks for continuous data collection.", "fields": ["unicast", "wireless network", "multicast", "bandwidth", "channel"], "abstract": "Data collection is an important operation of wireless sensor networks (WSNs). The performance of data collection can be measured by its achievable network capacity. Most existing works focus on the capacity of unicast, multicast or snapshot data collection in single-radio single-channel wireless networks, and no dedicated works consider the continuous data collection capacity for WSNs in detail under the protocol interference model. In this paper, we first propose a multi-path scheduling algorithm for the snapshot data collection in single-radio multi-channel WSNs and prove that its achievable network capacity is at least equation, which is a tighter lower bound compared with the previously best result in [5] which is W over 8ρ 2 , where W is the bandwidth over a channel, H is the number of the available orthogonal channels, ρ is the ratio of the interference radius over the transmission radius of a sensor and o(ρ) is a linear equation of ρ. For the continuous data collection problem, although the authors in [5] claim that data collection can be pipelined with existing works, we find that such an idea cannot actually improve network capacity. We explain the reason for this and propose a novel continuous data collection method for dual-radio multi-channel WSNs. This method significantly speeds up the data collection process, and achieves a capacity of equation when Δ e  ≤ 12, or equation when Δ e  > 12, where n is the number of sensors, M is a constant value and usually M ≪ n, and Δ e  is the maximum number of leaf nodes having a same parent node in the routing tree (i.e. data collection tree). The simulation results also indicate that the proposed algorithms significantly improve network capacity compared with the existing works.", "citation": "Citations (51)", "departments": ["Georgia State University", "Georgia State University", "City University of Hong Kong"], "authors": ["Shouling Ji.....http://dblp.org/pers/hd/j/Ji:Shouling", "Yingshu Li.....http://dblp.org/pers/hd/l/Li:Yingshu", "Xiaohua Jia.....http://dblp.org/pers/hd/j/Jia:Xiaohua"], "conf": "infocom", "year": "2011", "pages": 9}