{"title": "A Hierarchical Architecture for Adaptive Brain-Computer Interfacing.", "fields": ["brain computer interface", "humanoid robot", "architecture", "robot", "interfacing"], "abstract": "Brain-computer interfaces (BCIs) allow a user to directly control devices such as cursors and robots using brain signals. Non-invasive BCIs, e.g., those based on electroencephalographic (EEG) signals recorded from the scalp, suffer from low signal-to-noise ratio which limits the bandwidth of control. Invasive BCIs allow fine-grained control but can leave users exhausted since control is typically exerted on a moment-by-moment basis. In this paper, we address these problems by proposing a new adaptive hierarchical architecture for brain-computer interfacing. The approach allows a user to teach the BCI new skills on-the-fly; these learned skills are later invoked directly as high-level commands, relieving the user of tedious low-level control. We report results from four subjects who used a hierarchical EEG-based BCI to successfully train and control a humanoid robot in a virtual home environment. Gaussian processes were used for learning high-level commands, allowing a BCI to switch between autonomous and user-guided modes based on the current estimate of uncertainty. We also report the first instance of multi-tasking in a BCI, involving simultaneous control of two different devices by a single user. Our results suggest that hierarchical BCIs can provide a flexible and robust way of controlling complex robotic devices in real-world environments.", "citation": "Citations (17)", "year": "2011", "departments": ["University of Washington", "University of Washington", "Graz University of Technology", "University of Washington"], "conf": "ijcai", "authors": ["Mike Chung.....http://dblp.org/pers/hd/c/Chung:Mike", "Willy Cheung.....http://dblp.org/pers/hd/c/Cheung:Willy", "Reinhold Scherer.....http://dblp.org/pers/hd/s/Scherer:Reinhold", "Rajesh P. N. Rao.....http://dblp.org/pers/hd/r/Rao:Rajesh_P=_N="], "pages": 6}