{"title": "It's who you know: graph mining using recursive structural features.", "fields": ["graph", "transfer of learning", "recursion", "null model", "graph kernel"], "abstract": "Given a graph, how can we extract good features for the nodes? For example, given two large graphs from the same domain, how can we use information in one to do classification in the other (i.e., perform across-network classification or transfer learning on graphs)? Also, if one of the graphs is anonymized, how can we use information in one to de-anonymize the other? The key step in all such graph mining tasks is to find effective node features. We propose ReFeX (Recursive Feature eXtraction), a novel algorithm, that recursively combines local (node-based) features with neighborhood (egonet-based) features; and outputs regional features -- capturing \"behavioral\" information. We demonstrate how these powerful regional features can be used in within-network and across-network classification and de-anonymization tasks -- without relying on homophily, or the availability of class labels. The contributions of our work are as follows: (a) ReFeX is scalable and (b) it is effective, capturing regional (\"behavioral\") information in large graphs. We report experiments on real graphs from various domains with over 1M edges, where ReFeX outperforms its competitors on typical graph mining tasks like network classification and de-anonymization.", "citation": "Citations (146)", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Carnegie Mellon University", "Carnegie Mellon University", "Rutgers University"], "authors": ["Keith Henderson.....http://dblp.org/pers/hd/h/Henderson:Keith", "Brian Gallagher.....http://dblp.org/pers/hd/g/Gallagher:Brian", "Lei Li.....http://dblp.org/pers/hd/l/Li_0005:Lei", "Leman Akoglu.....http://dblp.org/pers/hd/a/Akoglu:Leman", "Tina Eliassi-Rad.....http://dblp.org/pers/hd/e/Eliassi=Rad:Tina", "Hanghang Tong.....http://dblp.org/pers/hd/t/Tong:Hanghang", "Christos Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Christos"], "conf": "kdd", "year": "2011", "pages": 9}