{"title": "Geometric complexity theory and tensor rank.", "fields": ["tensor product", "representation theory", "matrix multiplication", "geometric complexity theory", "rank"], "abstract": "Mulmuley and Sohoni [GCT1, SICOMP 2001; GCT2, SICOMP 2008] proposed to view the permanent versus determinant problem as a specific orbit closure problem and to attack it by methods from geometric invariant and representation theory. We adopt these ideas towards the goal of showing lower bounds on the border rank of specific tensors, in particular for matrix multiplication. We thus study specific orbit closure problems for the group G =GL(W 1 ) x GL(W 2 ) x GL(W 3 ) acting on the tensor product W=W 1  ⊗ W 2  ⊗ W 3  of complex finite dimensional vector spaces. Let G s  =SL(W 1 ) x SL(W 2 ) x SL(W 3 ). A key idea from [GCT2] is that the irreducible G s -representations occurring in the coordinate ring of the G-orbit closure of a stable tensor w ∈ W are exactly those having a nonzero invariant with respect to the stabilizer group of w.   However, we prove that by considering G s -representations, only trivial lower bounds on border rank can be shown. It is thus necessary to study G-representations, which leads to geometric extension problems that are beyond the scope of the subgroup restriction problems emphasized in [GCT1, GCT2] and its follow up papers. We prove a very modest lower bound on the border rank of matrix multiplication tensors using G-representations. This shows at least that the barrier for G s -representations can be overcome. To advance, we suggest the coarser approach to replace the semigroup of representations of a tensor by its moment polytope. We prove first results towards determining the moment polytopes of matrix multiplication and unit tensors.", "citation": "Citations (61)", "year": "2011", "departments": ["University of Paderborn", "University of Paderborn"], "conf": "stoc", "authors": ["Peter Bürgisser.....http://dblp.org/pers/hd/b/B=uuml=rgisser:Peter", "Christian Ikenmeyer.....http://dblp.org/pers/hd/i/Ikenmeyer:Christian"], "pages": 10}