{"title": "Maximizing throughput in wireless networks with finite internal buffers.", "fields": ["network packet", "multicast", "throughput", "blossom algorithm", "schedule"], "abstract": "In this paper, we consider the problem for maximizing the throughput of a discrete-time wireless network, where only certain sets of links can transmit simultaneously. It is well known that each set of such links can be represented by a configuration vector and the convex hull of the configuration vectors determines the capacity region of the wireless network. In the literature, packet scheduling polices that stabilize any admissible traffic in the capacity region are mostly related to the maximum weighted matching algorithm (MWM) that identifies the most suitable configuration vector in every time slot. Unlike the MWM algorithm, we propose a dynamic frame sizing (DFS) algorithm that also stabilizes any admissible traffic in the capacity region. The DFS algorithm, as an extension of our previous work for wired networks, also does not have a fixed frame size. To determine the frame size, an optimization problem needs to be solved at the beginning of each frame. Once the frame size is determined, a hierarchical smooth schedule is devised to determine both the schedule for configuration vectors and the schedule for multicast traffic flows in each link. Under the assumption of Bernoulli arrival processes with admissible rates, we show that the number of packets of each multicast traffic flow inside the wireless network is bounded above by a constant and thus one only requires to implement a finite internal buffer in each link in such a wireless network.", "citation": "Citations (2)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Ching-Ming Lien.....http://dblp.org/pers/hd/l/Lien:Ching=Ming", "Cheng-Shang Chang.....http://dblp.org/pers/hd/c/Chang:Cheng=Shang", "Jay Cheng.....http://dblp.org/pers/hd/c/Cheng:Jay", "Duan-Shin Lee.....http://dblp.org/pers/hd/l/Lee:Duan=Shin"], "conf": "infocom", "year": "2011", "pages": 9}