{"title": "Well-Supported Semantics for Description Logic Programs.", "fields": ["well founded semantics", "predicate functor logic", "higher order logic", "formal semantics", "axiomatic semantics"], "abstract": "[Fages, 1994] introduces the notion of well-supportedness as a key requirement for the semantics of normal logic programs and characterizes the standard answer set semantics in terms of the well-supportedness condition. With the property of well-supportedness, answer sets are guaranteed to be free of circular justifications. In this paper, we extend Fages' work to description logic programs (or DL-programs). We introduce two forms of well-supportedness for DL-programs. The first one defines weakly well-supported models that are free of circular justifications caused by positive literals in rule bodies. The second one defines strongly well-supported models that are free of circular justifications caused by either positive or negative literals. We then define two new answer set semantics for DL-programs and characterize them in terms of the weakly and strongly well-supported models, respectively. The first semantics is based on an extended Gelfond-Lifschitz transformation and defines weakly well-supported answer sets that are free of circular justifications for the class of DL-programs without negative dlatoms. The second semantics defines strongly well-supported answer sets which are free of circular justifications for all DL-programs. We show that the existing answer set semantics for DL-programs, such as the weak answer set semantics, the strong answer set semantics, and the FLP-based answer set semantics, satisfy neither the weak nor the strong well-supportedness condition, even for DL-programs without negative dl-atoms. This explains why their answer sets incur circular justifications.", "citation": "Citations (20)", "year": "2011", "departments": ["Chinese Academy of Sciences"], "conf": "ijcai", "authors": ["Yi-Dong Shen.....http://dblp.org/pers/hd/s/Shen:Yi=Dong"], "pages": 6}