{"title": "Towards exploratory hypothesis testing and analysis.", "fields": ["exploratory data analysis", "confounding", "simpson s paradox", "testing hypotheses suggested by the data", "statistical hypothesis testing"], "abstract": "Hypothesis testing is a well-established tool for scientific discovery. Conventional hypothesis testing is carried out in a hypothesis-driven manner. A scientist must first formulate a hypothesis based on his/her knowledge and experience, and then devise a variety of experiments to test it. Given the rapid growth of data, it has become virtually impossible for a person to manually inspect all the data to find all the interesting hypotheses for testing. In this paper, we propose and develop a data-driven system for automatic hypothesis testing and analysis. We define a hypothesis as a comparison between two or more sub-populations. We find sub-populations for comparison using frequent pattern mining techniques and then pair them up for statistical testing. We also generate additional information for further analysis of the hypotheses that are deemed significant. We conducted a set of experiments to show the efficiency of the proposed algorithms, and the usefulness of the generated hypotheses. The results show that our system can help users (1) identify significant hypotheses; (2) isolate the reasons behind significant hypotheses; and (3) find confounding factors that form Simpson's Paradoxes with discovered significant hypotheses.", "citation": "Citations (10)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Data Mining Dep ... arch, Singapore", "Data Mining Dep ... arch, Singapore"], "authors": ["Guimei Liu.....http://dblp.org/pers/hd/l/Liu:Guimei", "Mengling Feng.....http://dblp.org/pers/hd/f/Feng:Mengling", "Yue Wang.....http://dblp.org/pers/hd/w/Wang_0006:Yue", "Limsoon Wong.....http://dblp.org/pers/hd/w/Wong:Limsoon", "See-Kiong Ng.....http://dblp.org/pers/hd/n/Ng:See=Kiong", "Tzia Liang Mah.....http://dblp.org/pers/hd/m/Mah:Tzia_Liang", "Edmund Jon Deoon Lee.....http://dblp.org/pers/hd/l/Lee:Edmund_Jon_Deoon"], "conf": "icde", "year": "2011", "pages": 12}