{"title": "A Formalization of the Security Features of Physical Functions.", "fields": ["fault injection", "key generation", "block cipher", "cryptographic primitive", "physical unclonable function"], "abstract": "Physical attacks against cryptographic devices typically take advantage of information leakage (e.g., side-channels attacks) or erroneous computations (e.g., fault injection attacks). Preventing or detecting these attacks has become a challenging task in modern cryptographic research. In this context intrinsic physical properties of integrated circuits, such as Physical(ly) Unclonable Functions~(PUFs), can be used to complement classical cryptographic constructions, and to enhance the security of cryptographic devices. PUFs have recently been proposed for various applications, including anti-counterfeiting schemes, key generation algorithms, and in the design of block ciphers. However, currently only rudimentary security models for PUFs exist, limiting the confidence in the security claims of PUF-based security primitives. A useful model should at the same time (i) define the security properties of PUFs abstractly and naturally, allowing to design and formally analyze PUF-based security solutions, and (ii) provide practical quantification tools allowing engineers to evaluate PUF instantiations. In this paper, we present a formal foundation for security primitives based on PUFs. Our approach requires as little as possible from the physics and focuses more on the main properties at the heart of most published works on PUFs: robustness (generation of stable answers), unclonability (not provided by algorithmic solutions), and unpredictability. We first formally define these properties and then show that they can be achieved by previously introduced PUF instantiations. We stress that such a consolidating work allows for a meaningful security analysis of security primitives taking advantage of physical properties, becoming increasingly important in the development of the next generation secure information systems.", "citation": "Citations (155)", "departments": ["University of Mannheim", "Katholieke Universiteit Leuven", "Fraunhofer Society", "Université catholique de Louvain", "Tech. Univ. Dar ... mstadt, Germany"], "authors": ["Frederik Armknecht.....http://dblp.org/pers/hd/a/Armknecht:Frederik", "Roel Maes.....http://dblp.org/pers/hd/m/Maes:Roel", "Ahmad-Reza Sadeghi.....http://dblp.org/pers/hd/s/Sadeghi:Ahmad=Reza", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier", "Christian Wachsmann.....http://dblp.org/pers/hd/w/Wachsmann:Christian"], "conf": "sp", "year": "2011", "pages": 16}