{"title": "Supervised local subspace learning for continuous head pose estimation.", "fields": ["overfitting", "image noise", "subspace topology", "feature", "generative model"], "abstract": "Head pose estimation from images has recently attracted much attention in computer vision due to its diverse applications in face recognition, driver monitoring and human computer interaction. Most successful approaches to head pose estimation formulate the problem as a nonlinear regression between image features and continuous 3D angles (i.e. yaw, pitch and roll). However, regression-like methods suffer from three main drawbacks: (1) They typically lack generalization and overfit when trained using a few samples. (2) They fail to get reliable estimates over some regions of the output space (angles) when the training set is not uniformly sampled. For instance, if the training data contains under-sampled areas for some angles. (3) They are not robust to image noise or occlusion. To address these problems, this paper presents Supervised Local Subspace Learning (SL 2 ), a method that learns a local linear model from a sparse and non-uniformly sampled training set. SL 2  learns a mixture of local tangent spaces that is robust to under-sampled regions, and due to its regularization properties it is also robust to over-fitting. Moreover, because SL 2  is a generative model, it can deal with image noise. Experimental results on the CMU Multi-PIE and BU-3DFE database show the effectiveness of our approach in terms of accuracy and computational complexity.", "citation": "Citations (81)", "year": "2011", "departments": ["Carnegie Mellon University", "Graz University of Technology", "Carnegie Mellon University", "Graz University of Technology"], "conf": "cvpr", "authors": ["Dong Huang.....http://dblp.org/pers/hd/h/Huang:Dong", "Markus Storer.....http://dblp.org/pers/hd/s/Storer:Markus", "Fernando De la Torre.....http://dblp.org/pers/hd/t/Torre:Fernando_De_la", "Horst Bischof.....http://dblp.org/pers/hd/b/Bischof:Horst"], "pages": 8}