{"title": "An actuated physical puppet as an input device for controlling a digital manikin.", "fields": ["haptic technology", "control character", "joint stiffness", "upload", "input device"], "abstract": "We present an actuated handheld puppet system for controlling the posture of a virtual character. Physical puppet devices have been used in the past to intuitively control character posture. In our research, an actuator is added to each joint of such an input device to provide physical feedback to the user. This enhancement offers many benefits. First, the user can upload pre-defined postures to the device to save time. Second, the system is capable of dynamically adjusting joint stiffness to counteract gravity, while allowing control to be maintained with relatively little force. Third, the system supports natural human body behaviors, such as whole-body reaching and joint coupling. This paper describes the user interface and implementation of the proposed technique and reports the results of expert evaluation. We also conducted two user studies to evaluate the effectiveness of our method.", "citation": "Citations (21)", "year": "2011", "departments": ["National Institute of Advanced Industrial Science and Technology", "Keio University", "Keio University", "JST ERATO, Tokyo, Japan", "JST ERATO, Tokyo, Japan"], "conf": "chi", "authors": ["Wataru Yoshizaki.....http://dblp.org/pers/hd/y/Yoshizaki:Wataru", "Yuta Sugiura.....http://dblp.org/pers/hd/s/Sugiura:Yuta", "Albert C. Chiou.....http://dblp.org/pers/hd/c/Chiou:Albert_C=", "Sunao Hashimoto.....http://dblp.org/pers/hd/h/Hashimoto:Sunao", "Masahiko Inami.....http://dblp.org/pers/hd/i/Inami:Masahiko", "Takeo Igarashi.....http://dblp.org/pers/hd/i/Igarashi:Takeo", "Yoshiaki Akazawa.....http://dblp.org/pers/hd/a/Akazawa:Yoshiaki", "Katsuaki Kawachi.....http://dblp.org/pers/hd/k/Kawachi:Katsuaki", "Satoshi Kagami.....http://dblp.org/pers/hd/k/Kagami:Satoshi", "Masaaki Mochimaru.....http://dblp.org/pers/hd/m/Mochimaru:Masaaki"], "pages": 10}