{"title": "Exploiting MIMO antennas in cooperative cognitive radio networks.", "fields": ["spatial multiplexing", "multi user mimo", "mimo", "spectral efficiency", "3g mimo"], "abstract": "Recently, a new paradigm for cognitive radio networks has been advocated, where primary users (PUs) recruit some secondary users (SUs) to cooperatively relay the primary traffic. However, all existing work on such cooperative cognitive radio networks (CCRNs) operate in the temporal domain. The PU needs to give out a dedicated portion of channel access time to the SUs for transmitting the secondary data in exchange for the SUs' cooperation, which limits the performance of both PUs and SUs. On the other hand, Multiple Input Multiple Output (MIMO) enables transmission of multiple independent data streams and suppression of interference via beam-forming in the spatial domain over MIMO antenna elements to provide significant performance gains. Researches have not yet explored how to take advantage of the MIMO technique in CCRNs. In this paper, we propose a novel MIMO-CCRN framework, which enables the SUs to utilize the capability provided by the MIMO to cooperatively relay the traffic for the PUs while concurrently accessing the same channel to transmit their own traffic. We design the MIMO-CCRN architecture by considering both the temporal and spatial domains to improve spectrum efficiency. Further we provide theoretical analysis for the primary and secondary transmission rate under MIMO cooperation and then formulate an optimization model based on a Stackelberg game to maximize the utilities of PUs and SUs. Evaluation results show that both primary and secondary users achieve higher utility by leveraging MIMO spatial cooperation in MIMO-CCRN than with conventional schemes.", "citation": "Citations (102)", "departments": ["New York University", "Technicolor", "Huawei", "New York University"], "authors": ["Sha Hua.....http://dblp.org/pers/hd/h/Hua:Sha", "Hang Liu.....http://dblp.org/pers/hd/l/Liu:Hang", "Mingquan Wu.....http://dblp.org/pers/hd/w/Wu:Mingquan", "Shivendra S. Panwar.....http://dblp.org/pers/hd/p/Panwar:Shivendra_S="], "conf": "infocom", "year": "2011", "pages": 9}