{"title": "SmartTrace: Finding similar trajectories in smartphone networks without disclosing the traces.", "fields": ["porting", "exploit", "software deployment", "android", "participatory sensing"], "abstract": "In this demonstration paper, we present a powerful distributed framework for finding similar trajectories in a smartphone network, without disclosing the traces of participating users. Our framework, exploits opportunistic and participatory sensing in order to quickly answer queries of the form: “Report objects (i.e., trajectories) that follow a similar spatio-temporal motion to Q, where Q is some query trajectory.” SmartTrace, relies on an in-situ data storage model, where geo-location data is recorded locally on smartphones for both performance and privacy reasons. SmartTrace then deploys an efficient top-K query processing algorithm that exploits distributed trajectory similarity measures, resilient to spatial and temporal noise, in order to derive the most relevant answers to Q quickly and efficiently. Our demonstration shows how the SmartTrace algorithmics are ported on a network of Android-based smartphone devices with impressive query response times. To demonstrate the capabilities of SmartTrace during the conference, we will allow the attendees to query local smartphone networks in the following two modes: i) Interactive Mode, where devices will be handed out to participants aiming to identify who is moving similar to the querying node; and ii) Trace-driven Mode, where a large-scale deployment can be launched in order to show how the K most similar trajectories can be identified quickly and efficiently. The conference attendees will be able to appreciate how interesting spatio-temporal search applications can be implemented efficiently (for performance reasons) and without disclosing the complete user traces to the query processor (for privacy reasons) 1 . For instance, an attendee might be able to determine other attendees that have participated in common sessions, in order to initiate new discussions and collaborations, without knowing their trajectory or revealing his/her own trajectory either.", "citation": "Citations (23)", "departments": ["University of Cyprus", "University of Cyprus", "University of Cyprus", "National and Kapodistrian University of Athens"], "authors": ["Constantinos Costa.....http://dblp.org/pers/hd/c/Costa:Constantinos", "Christos Laoudias.....http://dblp.org/pers/hd/l/Laoudias:Christos", "Demetrios Zeinalipour-Yazti.....http://dblp.org/pers/hd/z/Zeinalipour=Yazti:Demetrios", "Dimitrios Gunopulos.....http://dblp.org/pers/hd/g/Gunopulos:Dimitrios"], "conf": "icde", "year": "2011", "pages": 4}