{"title": "Retrieval-based face annotation by weak label regularized local coordinate coding.", "fields": ["image retrieval", "unsupervised learning", "automatic image annotation", "graph", "scalability", "content based image retrieval", "annotation", "sparse matrix"], "abstract": "This paper investigates a retrieval-based annotation paradigm of mining web facial images for automated face annotation. In general, there are two key challenges for such an annotation paradigm. The first challenge is how to efficiently retrieve a short list of most similar facial images from facial image databases, and the second challenge is how to effectively perform annotation by exploiting these similar facial images and their weak labels which are often noisy and incomplete. In this paper, we mainly focus on tackling the second challenge of the retrieval-based face annotation paradigm. In particular, we propose an effective Weak Label Regularized Local Coordinate Coding (WLRLCC) technique, which exploits the local coordinate coding principle in learning sparse features, and at the same time employs the graph-based weak label regularization principle to enhance the weak labels of the short list of similar facial images. We present an efficient optimization algorithm to solve the WLRLCC task, and develop an effective sparse reconstruction scheme to perform the final face name annotation. We conduct a set of extensive empirical studies on a large-scale facial image database withatotal of 6,000 persons and over 600,000 web facial images, in which encouraging results show that the proposed WLRLCC algorithm significantly boosts the performance of the regular retrieval-based face annotation approaches.", "citation": "Citations (62)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Zhejiang University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Zhejiang University", "Microsoft"], "authors": ["Dayong Wang.....http://dblp.org/pers/hd/w/Wang:Dayong", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Ying He.....http://dblp.org/pers/hd/h/He_0001:Ying", "Jianke Zhu.....http://dblp.org/pers/hd/z/Zhu:Jianke"], "conf": "mm", "year": "2011", "pages": 10}