{"title": "The wireless multicast coalition game and the non-cooperative association problem.", "fields": ["xcast", "pragmatic general multicast", "ip multicast", "source specific multicast", "multicast address"], "abstract": "We study in this paper the problem of sharing the cost of a multicast service in a wireless network. In a wireless network, multiple users can decode the same signal of the base station provided the received power exceeds a certain minimum threshold. In this work, the cost for broadcasting is taken to be the transmission power. We begin by proposing various schemes to share the cost, and study their properties. We then study the association problem where an user has options of either joining the multicast group or opting for a unicast connection at a given cost. Next, we extend the association problem to the scenarios with partial information - a user knows his own power requirement, but has to make decision without knowledge of the number of other users in the network and their requirements. The unicast alternative that each mobile has, results in limitations on the coverage (area covered by the multicast service) and the capacity (number of users connected to the multicast service). We derive the expected capacity and coverage as a function of the cost sharing mechanism. We finally extend the model to the case where users have the option of joining any one from a given set of multicast service providers. A user's power requirement depends on its association, but its cost share depends on the association profile of all the users. We study the joint problem of the cost allocation and the equilibrium association.", "citation": "Citations (13)", "departments": ["Indian Institute of Science", "French Institute for Research in Computer Science and Automation"], "authors": ["Chandramani Kishore Singh.....http://dblp.org/pers/hd/s/Singh:Chandramani_Kishore", "Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan"], "conf": "infocom", "year": "2011", "pages": 9}