{"title": "Multi-task low-rank affinity pursuit for image segmentation.", "fields": ["matrix norm", "segmentation based object categorization", "scale space segmentation", "feature detection", "minimum spanning tree based segmentation"], "abstract": "This paper investigates how to boost region-based image segmentation by pursuing a new solution to fuse multiple types of image features. A collaborative image segmentation framework, called multi-task low-rank affinity pursuit, is presented for such a purpose. Given an image described with multiple types of features, we aim at inferring a unified affinity matrix that implicitly encodes the segmentation of the image. This is achieved by seeking the sparsity-consistent low-rank affinities from the joint decompositions of multiple feature matrices into pairs of sparse and low-rank matrices, the latter of which is expressed as the production of the image feature matrix and its corresponding image affinity matrix. The inference process is formulated as a constrained nuclear norm and l 2;1 -norm minimization problem, which is convex and can be solved efficiently with the Augmented Lagrange Multiplier method. Compared to previous methods, which are usually based on a single type of features, the proposed method seamlessly integrates multiple types of features to jointly produce the affinity matrix within a single inference step, and produces more accurate and reliable segmentation results. Experiments on the MSRC dataset and Berkeley segmentation dataset well validate the superiority of using multiple features over single feature and also the superiority of our method over conventional methods for feature fusion. Moreover, our method is shown to be very competitive while comparing to other state-of-the-art methods.", "citation": "Citations (172)", "year": "2011", "departments": ["National University of Singapore", "National University of Singapore", "Microsoft Research Asia (China)", "Panasonic", "National University of Singapore"], "conf": "iccv", "authors": ["Bin Cheng.....http://dblp.org/pers/hd/c/Cheng_0001:Bin", "Guangcan Liu.....http://dblp.org/pers/hd/l/Liu:Guangcan", "Jingdong Wang.....http://dblp.org/pers/hd/w/Wang:Jingdong", "ZhongYang Huang.....http://dblp.org/pers/hd/h/Huang:ZhongYang", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "pages": 8}