{"title": "Scalable multi-dimensional user intent identification using tree structured distributions.", "fields": ["wordnet", "contextualization", "fastq format", "user intent", "web search query"], "abstract": "The problem of identifying user intent has received considerable attention in recent years, particularly in the context of improving the search experience via query contextualization. Intent can be characterized by multiple dimensions, which are often not observed from query words alone. Accurate identification of Intent from query words remains a challenging problem primarily because it is extremely difficult to discover these dimensions. The problem is often significantly compounded due to lack of representative training sample. We present a generic, extensible framework for learning the multi-dimensional representation of user intent from the query words. The approach models the latent relationships between facets using tree structured distribution which leads to an efficient and convergent algorithm, FastQ, for identifying the multi-faceted intent of users based on just the query words. We also incorporated WordNet to extend the system capabilities to queries which contain words that do not appear in the training data. Empirical results show that FastQ yields accurate identification of intent when compared to a gold standard.", "citation": "Citations (10)", "departments": ["Chalmers University of Technology", "Andrés Bello National University", "Yahoo!", "Indian Institute of Science", "Chalmers University of Technology"], "authors": ["Vinay Jethava.....http://dblp.org/pers/hd/j/Jethava:Vinay", "Liliana Calderón-Benavides.....http://dblp.org/pers/hd/c/Calder=oacute=n=Benavides:Liliana", "Ricardo A. Baeza-Yates.....http://dblp.org/pers/hd/b/Baeza=Yates:Ricardo_A=", "Chiranjib Bhattacharyya.....http://dblp.org/pers/hd/b/Bhattacharyya:Chiranjib", "Devdatt P. Dubhashi.....http://dblp.org/pers/hd/d/Dubhashi:Devdatt_P="], "conf": "sigir", "year": "2011", "pages": 10}