{"title": "Beyond MLU: An application-centric comparison of traffic engineering schemes.", "fields": ["download", "static routing", "throughput", "traffic engineering", "optimization problem"], "abstract": "Traffic engineering (TE) has been long studied as a network optimization problem, but its impact on user-perceived application performance has received little attention. Our paper takes a first step to address this disparity. Using real traffic matrices and topologies from three ISPs, we conduct very large-scale experiments simulating ISP traffic as an aggregate of a large number of TCP flows. Our application-centric, empirical approach yields two rather unexpected findings. First, link utilization metrics, and MLU in particular, are poor predictors of application performance. Despite significant differences in MLU, all TE schemes and even a static shortest-path routing scheme achieve nearly identical application performance. Second, application adaptation in the form of location diversity, i.e., the ability to download content from multiple potential locations, significantly improves the capacity achieved by all schemes. Even the ability to download from just 2–4 locations enables all TE schemes to achieve near-optimal capacity, and even static routing to be within 30% of optimal. Our findings call into question the value of TE as practiced today, and compel us to significantly rethink the TE problem in the light of application adaptation.", "citation": "Citations (13)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Abhigyan Sharma.....http://dblp.org/pers/hd/s/Sharma:Abhigyan", "Aditya Kumar Mishra.....http://dblp.org/pers/hd/m/Mishra:Aditya_Kumar", "Vikas Kumar.....http://dblp.org/pers/hd/k/Kumar:Vikas", "Arun Venkataramani.....http://dblp.org/pers/hd/v/Venkataramani:Arun"], "conf": "infocom", "year": "2011", "pages": 9}