{"title": "Celerity: a low-delay multi-party conferencing solution.", "fields": ["dead peer detection", "end to end delay", "server", "video quality", "teleconference", "testbed", "peer to peer"], "abstract": "In this paper, we attempt to revisit the problem of multi-party conferencing from a practical perspective, and to rethink the design space involved in this problem. We believe that an emphasis on low end-to-end delays between any two parties in the conference is a must, and the source sending rate in a session should adapt to bandwidth availability and congestion. We present  Celerity , a multi-party conferencing solution specifically designed to achieve our objectives. It is entirely Peer-to-Peer (P2P), and as such eliminating the cost of maintaining centrally administered servers. It is designed to deliver video with low end-to-end delays, at quality levels commensurate with available network resources over arbitrary network topologies where  bottlenecks can be anywhere in the network . This is in contrast to commonly assumed P2P scenarios where bandwidth bottlenecks reside only at the edge of the network. The highlight in our design is a distributed and adaptive rate control protocol, that can discover and adapt to arbitrary topologies and network conditions quickly, converging to efficient link rate allocations allowed by the underlying network. In accordance with adaptive link rate control, source video encoding rates are also dynamically controlled to optimize video quality. We have implemented  Celerity  in a prototype system, and demonstrate its superior performance over existing solutions in a local experimental testbed and over the Internet.", "citation": "Citations (25)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "University of Toronto", "Alcatel-Lucent", "Facebook", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "University of Toronto", "Google", "Facebook"], "authors": ["Xiangwen Chen.....http://dblp.org/pers/hd/c/Chen:Xiangwen", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Yao Zhao.....http://dblp.org/pers/hd/z/Zhao:Yao", "Yunnan Wu.....http://dblp.org/pers/hd/w/Wu:Yunnan", "Jin Li.....http://dblp.org/pers/hd/l/Li_0001:Jin"], "conf": "mm", "year": "2011", "pages": 10}