{"title": "Informative feature selection for object recognition via Sparse PCA.", "fields": ["image segmentation", "sparse pca", "structure from motion", "scale invariant feature transform", "feature"], "abstract": "Bag-of-words (BoW) methods are a popular class of object recognition methods that use image features (e.g., SIFT) to form visual dictionaries and subsequent histogram vectors to represent object images in the recognition process. The accuracy of the BoW classifiers, however, is often limited by the presence of uninformative features extracted from the background or irrelevant image segments. Most existing solutions to prune out uninformative features rely on enforcing pairwise epipolar geometry via an expensive structure-from-motion (SfM) procedure. Such solutions are known to break down easily when the camera transformation is large or when the features are extracted from low-resolution, low-quality images. In this paper, we propose a novel method to select informative object features using a more efficient algorithm called Sparse PCA. First, we show that using a large-scale multiple-view object database, informative features can be reliably identified from a highdimensional visual dictionary by applying Sparse PCA on the histograms of each object category. Our experiment shows that the new algorithm improves recognition accuracy compared to the traditional BoW methods and SfM methods. Second, we present a new solution to Sparse PCA as a semidefinite programming problem using the Augmented Lagrangian Method. The new solver outperforms the state of the art for estimating sparse principal vectors as a basis for a low-dimensional subspace model.", "citation": "Citations (69)", "year": "2011", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "iccv", "authors": ["Nikhil Naikal.....http://dblp.org/pers/hd/n/Naikal:Nikhil", "Allen Y. Yang.....http://dblp.org/pers/hd/y/Yang:Allen_Y=", "Shankar Sastry.....http://dblp.org/pers/hd/s/Sastry:Shankar"], "pages": 8}