{"title": "Bag of textons for image segmentation via soft clustering and convex shift.", "fields": ["texton", "kernel density estimation", "fuzzy clustering", "scale space segmentation", "image texture"], "abstract": "We propose an unsupervised image segmentation method based on texton similarity and mode seeking. The input image is first convolved with a filter-bank, followed by soft clustering on its filter response to generate textons. The input image is then superpixelized where each belonging pixel is regarded as a voter and a soft voting histogram is constructed for each superpixel by averaging its voters' posterior texton probabilities. We further propose a modified mode seeking method — called convex shift — to group superpixels and generate segments. The distribution of superpixel histograms is modeled nonparametrically in the histogram space, using Kullback-Leibler divergence (K-L divergence) and kernel density estimation. We show that each kernel shift step can be formulated as a convex optimization problem with linear constraints. Experiment on image segmentation shows that convex shift performs mode seeking effectively on an enforced histogram structure, grouping visually similar superpixels. With the incorporation of texton and soft voting, our method generates reasonably good segmentation results on natural images with relatively complex contents, showing significant superiority over traditional mode seeking based segmentation methods, while outperforming or being comparable to state of the art methods.", "citation": "Citations (11)", "year": "2012", "departments": ["Hong Kong University of Science and Technology", "Robotics Institute", "Hong Kong University of Science and Technology", "Multimedia Lab, ... S, China 518055"], "conf": "cvpr", "authors": ["Zhiding Yu.....http://dblp.org/pers/hd/y/Yu:Zhiding", "Ang Li.....http://dblp.org/pers/hd/l/Li:Ang", "Oscar C. Au.....http://dblp.org/pers/hd/a/Au:Oscar_C=", "Chunjing Xu.....http://dblp.org/pers/hd/x/Xu:Chunjing"], "pages": 8}