{"title": "Approximately Bisimilar Symbolic Models for Digital Control Systems.", "fields": ["lyapunov function", "transition system", "discrete system", "limiting factor", "piecewise"], "abstract": "Symbolic approaches to control hybrid systems construct a discrete approximately-bisimilar abstraction of a continuous control system and apply automata-theoretic techniques to construct controllers enforcing given specifications. For the class of digital control systems (i.e., whose control signals are piecewise constant) satisfying incremental input-to-state stability (δ-ISS), existing techniques to compute discrete abstractions begin with a quantization of the state and input sets, and show that the quantized system is approximately bisimilar to the original if the sampling time is sufficiently large or if the Lyapunov functions of the system decrease fast enough. If the sampling time is not sufficiently large, the former technique fails to apply. While abstraction based on Lyapunov functions may be applicable, because of the conservative nature of Lyapunov functions in practice, the size of the discrete abstraction may be too large for subsequent analyses.\n\nIn this paper, we propose a technique to compute discrete approximately-bisimilar abstractions of δ-ISS digital control systems. Our technique quantizes the state and input sets, but is based on multiple sampling steps: instead of requiring that the sampling time is sufficiently large (which may not hold), the abstract transition system relates states multiple sampling steps apart.\n\nWe show on practical examples that the discrete state sets computed by our procedure can be several orders of magnitude smaller than existing approaches, and can compute symbolic approximate-bisimilar models even when other existing approaches do not apply or time-out. Since the size of the discrete state set is the main limiting factor in the application of symbolic control, our results enable symbolic control of larger systems than was possible before.", "citation": "Citations (19)", "year": "2012", "departments": ["Max Planck Society", "University of California, Los Angeles"], "conf": "cav", "authors": ["Rupak Majumdar.....http://dblp.org/pers/hd/m/Majumdar:Rupak", "Majid Zamani.....http://dblp.org/pers/hd/z/Zamani:Majid"], "pages": 16}