{"title": "Delayed Continuous-Time Markov Chains for Genetic Regulatory Circuits.", "fields": ["deterministic system", "markov chain", "computation", "transition rate matrix", "electronic circuit"], "abstract": "Continuous-time Markov chains (CTMC) with their rich theory and efficient simulation algorithms have been successfully used in modeling stochastic processes in diverse areas such as computer science, physics, and biology. However, systems that comprise non-instantaneous events cannot be accurately and efficiently modeled with CTMCs. In this paper we define delayed CTMCs, an extension of CTMCs that allows for the specification of a lower bound on the time interval between an event's initiation and its completion, and we propose an algorithm for the computation of their behavior. Our algorithm effectively decomposes the computation into two stages: a pure CTMC governs event initiations while a deterministic process guarantees lower bounds on event completion times. Furthermore, from the nature of delayed CTMCs, we obtain a parallelized version of our algorithm. We use our formalism to model genetic regulatory circuits (biological systems where delayed events are common) and report on the results of our numerical algorithm as run on a cluster. We compare performance and accuracy of our results with results obtained by using pure CTMCs.", "citation": "Citations (7)", "year": "2012", "departments": ["Institute of Science and Technology Austria", "Institute of Science and Technology Austria", "Institute of Science and Technology Austria", "Institute of Science and Technology Austria", "Institute of Science and Technology Austria"], "conf": "cav", "authors": ["Calin C. Guet.....http://dblp.org/pers/hd/g/Guet:Calin_C=", "Ashutosh Gupta.....http://dblp.org/pers/hd/g/Gupta:Ashutosh", "Thomas A. Henzinger.....http://dblp.org/pers/hd/h/Henzinger:Thomas_A=", "Maria Mateescu.....http://dblp.org/pers/hd/m/Mateescu:Maria", "Ali Sezgin.....http://dblp.org/pers/hd/s/Sezgin:Ali"], "pages": 16}