{"title": "EleSense: Elevator-assisted wireless sensor data collection for high-rise structure monitoring.", "fields": ["structural health monitoring", "sensor fusion", "throughput", "key distribution in wireless sensor networks", "cost efficiency"], "abstract": "Wireless sensor networks have been widely suggested to be used in Cyber-Physical Systems for Structural Health Monitoring. However, for nowadays high-rise structures (e.g., the Guangzhou New TV Tower, peaking at 600m above ground), the extensive vertical dimension creates enormous challenges toward sensor data collection, beyond those addressed in state-of-the-art mote-like systems. One example is the data transmission from the sensor nodes to the base station. Given the long span of the civil structures, neither a strategy of long-range one-hop data transmission nor short-range hop-by-hop communication is cost-efficient. In this paper, we propose EleSense, a novel high-rise structure monitoring framework that uses elevators to assist data collection. In EleSense, an elevator is attached with the base station and collects data when it moves to serve passengers; as such, the communication distance can be effectively reduced. To maximize the benefit, we formulate the problem as a cross-layer optimization problem and propose a centralized algorithm to solve it optimally. We further propose a distributed implementation to accommodate the hardware capability of sensor nodes and address other practical issues. Through extensive simulations, we show that EleSense has achieved a significant throughput gain over the case without elevators and a straightforward 802.11 MAC scheme without the cross-layer optimization. Moreover, EleSense can greatly reduce the communication costs while maintaining good fairness and reliability. We also conduct a case study with real experiments and data sets on the Guangzhou New TV Tower, which further validates the effectiveness of our EleSense.", "citation": "Citations (3)", "departments": ["Simon Fraser University", "Hong Kong Polytechnic University", "Simon Fraser University"], "authors": ["Feng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Feng", "Dan Wang.....http://dblp.org/pers/hd/w/Wang_0002:Dan", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan"], "conf": "infocom", "year": "2012", "pages": 9}