{"title": "Superedge grouping for object localization by combining appearance and shape information.", "fields": ["object detection", "image noise", "edge detection", "computation", "bag of words model in computer vision"], "abstract": "Both appearance and shape play important roles in object localization and object detection. In this paper, we propose a new superedge grouping method for object localization by incorporating both boundary shape and appearance information of objects. Compared with the previous edge grouping methods, the proposed method does not subdivide detected edges into short edgels before grouping. Such long, unsubdivided superedges not only facilitate the incorporation of object shape information into localization, but also increase the robustness against image noise and reduce computation. We identify and address several important problems in achieving the proposed superedge grouping, including gap filling for connecting superedges, accurate encoding of region-based information into individual edges, and the incorporation of object-shape information into object localization. In this paper, we use the bag of visual words technique to quantify the region-based appearance features of the object of interest. We find that the proposed method, by integrating both boundary and region information, can produce better localization performance than previous subwindow search and edge grouping methods on most of the 20 object categories from the VOC 2007 database. Experiments also show that the proposed method is roughly 50 times faster than the previous edge grouping method.", "citation": "Citations (7)", "year": "2012", "departments": ["University of South Carolina", "University of Toronto", "University of South Carolina", "University of South Carolina", "University of Toronto"], "conf": "cvpr", "authors": ["Zhiqi Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhiqi", "Sanja Fidler.....http://dblp.org/pers/hd/f/Fidler:Sanja", "Jarrell W. Waggoner.....http://dblp.org/pers/hd/w/Waggoner:Jarrell_W=", "Yu Cao.....http://dblp.org/pers/hd/c/Cao:Yu", "Sven J. Dickinson.....http://dblp.org/pers/hd/d/Dickinson:Sven_J=", "Jeffrey Mark Siskind.....http://dblp.org/pers/hd/s/Siskind:Jeffrey_Mark", "Song Wang.....http://dblp.org/pers/hd/w/Wang_0002:Song"], "pages": 8}