{"title": "Geodesic flow kernel for unsupervised domain adaptation.", "fields": ["kernel", "contextual image classification", "geodesic", "adaptability", "unsupervised learning"], "abstract": "In real-world applications of visual recognition, many factors — such as pose, illumination, or image quality — can cause a significant mismatch between the source domain on which classifiers are trained and the target domain to which those classifiers are applied. As such, the classifiers often perform poorly on the target domain. Domain adaptation techniques aim to correct the mismatch. Existing approaches have concentrated on learning feature representations that are invariant across domains, and they often do not directly exploit low-dimensional structures that are intrinsic to many vision datasets. In this paper, we propose a new kernel-based method that takes advantage of such structures. Our geodesic flow kernel models domain shift by integrating an infinite number of subspaces that characterize changes in geometric and statistical properties from the source to the target domain. Our approach is computationally advantageous, automatically inferring important algorithmic parameters without requiring extensive cross-validation or labeled data from either domain. We also introduce a metric that reliably measures the adaptability between a pair of source and target domains. For a given target domain and several source domains, the metric can be used to automatically select the optimal source domain to adapt and avoid less desirable ones. Empirical studies on standard datasets demonstrate the advantages of our approach over competing methods.", "citation": "Citations (785)", "year": "2012", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "University of Texas at Austin"], "conf": "cvpr", "authors": ["Boqing Gong.....http://dblp.org/pers/hd/g/Gong:Boqing", "Yuan Shi.....http://dblp.org/pers/hd/s/Shi:Yuan", "Fei Sha.....http://dblp.org/pers/hd/s/Sha:Fei", "Kristen Grauman.....http://dblp.org/pers/hd/g/Grauman:Kristen"], "pages": 8}