{"title": "Pre-Symptomatic Prediction of Plant Drought Stress Using Dirichlet-Aggregation Regression on Hyperspectral Images.", "fields": ["matrix decomposition", "interpretability", "computational problem", "dirichlet distribution", "hyperspectral imaging"], "abstract": "Pre-symptomatic drought stress prediction is of great relevance in precision plant protection, ultimately helping to meet the challenge of \"How to feed a hungry world?\". Unfortunately, it also presents unique computational problems in scale and interpretability: it is a temporal, large-scale prediction task, e.g., when monitoring plants over time using hyperspectral imaging, and features are 'things' with a 'biological' meaning and interpretation and not just mathematical abstractions computable for any data. In this paper we propose Dirichletaggregation regression (DAR) to meet the challenge. DAR represents all data by means of convex combinations of only few extreme ones computable in linear time and easy to interpret. Then, it puts a Gaussian process prior on the Dirichlet distributions induced on the simplex spanned by the extremes. The prior can be a function of any observed meta feature such as time, location, type of fertilization, and plant species. We evaluated DAR on two hyperspectral image series of plants over time with about 2 (resp. 5:8) Billion matrix entries. The results demonstrate that DAR can be learned efficiently and predicts stress well before it becomes visible to the human eye.", "citation": "Citations (9)", "departments": ["Fraunhofer Society", "Fraunhofer Society", "Fraunhofer Society", "Fraunhofer Society", "Game Analytics  ... hagen, Denmark"], "authors": ["Kristian Kersting.....http://dblp.org/pers/hd/k/Kersting:Kristian", "Zhao Xu.....http://dblp.org/pers/hd/x/Xu_0001:Zhao", "Mirwaes Wahabzada.....http://dblp.org/pers/hd/w/Wahabzada:Mirwaes", "Christian Bauckhage.....http://dblp.org/pers/hd/b/Bauckhage:Christian", "Christian Thurau.....http://dblp.org/pers/hd/t/Thurau:Christian", "Christoph Römer.....http://dblp.org/pers/hd/r/R=ouml=mer:Christoph", "Agim Ballvora.....http://dblp.org/pers/hd/b/Ballvora:Agim", "Uwe Rascher.....http://dblp.org/pers/hd/r/Rascher:Uwe", "Jens Leon.....http://dblp.org/pers/hd/l/Leon:Jens", "Lutz Plümer.....http://dblp.org/pers/hd/p/Pl=uuml=mer:Lutz"], "conf": "aaai", "year": "2012", "pages": -1}