{"title": "A General Method for Estimating Correlated Aggregates over a Data Stream.", "fields": ["logarithm", "streaming algorithm", "of the form", "data stream mining", "linear space", "symmetric difference", "identifier", "sublinear function"], "abstract": "On a stream $${\\fancyscript{S}}$$S of two dimensional data items $$(x,y)$$(x,y) where $$x$$x is an item identifier and $$y$$y is a numerical attribute, a correlated aggregate query $$C(\\sigma ,AGG,{\\fancyscript{S}})$$C(?,AGG,S) asks to first apply a selection predicate $$\\sigma $$? along the $$y$$y dimension, followed by an aggregation $$AGG$$AGG along the $$x$$x dimension. For selection predicates of the form $$(y  c), where parameter $$c$$c is provided at query time, we present new streaming algorithms and lower bounds for estimating correlated aggregates. Our main result is a general method that reduces the estimation of a correlated aggregate $$AGG$$AGG to the streaming computation of $$AGG$$AGG over an entire stream, for an aggregate that satisfies certain conditions. This results in the first sublinear space algorithms for the correlated estimation of a large family of statistics, including frequency moments. Our experimental validation shows that the memory requirements of these algorithms are significantly smaller than existing linear storage solutions, and that these achieve a fast per-record processing time. We also study the setting when items have weights. In the case when weights can be negative, we give a strong space lower bound which holds even if the algorithm is allowed up to a logarithmic number of passes over the data. We complement this with a small space algorithm which uses a logarithmic number of passes.", "citation": "Citations (13)", "departments": ["Iowa State University", "IBM", "Iowa State University", "IBM"], "authors": ["Srikanta Tirthapura.....http://dblp.org/pers/hd/t/Tirthapura:Srikanta", "David P. Woodruff.....http://dblp.org/pers/hd/w/Woodruff:David_P="], "conf": "icde", "year": "2012", "pages": 12}