{"title": "Efficient scrub mechanisms for error-prone emerging memories.", "fields": ["memory cell", "memory architecture", "ferroelectric ram", "overhead", "phenomenon"], "abstract": "Many memory cell technologies are being considered as possible replacements for DRAM and Flash technologies, both of which are nearing their scaling limits. While these new cells (PCM, STT-RAM, FeRAM, etc.) promise high density, better scaling, and non-volatility, they introduce new challenges. Solutions at the architecture level can help address some of these problems; e.g., prior research has proposed wear-leveling and hard error tolerance mechanisms to overcome the limited write endurance of PCM cells. In this paper, we focus on the soft error problem in PCM, a topic that has received little attention in the architecture community. Soft errors in DRAM memories are typically addressed by having SECDED support and a scrub mechanism. The scrub mechanism scans the memory looking for a single-bit error and corrects it before the line experiences a second uncorrectable error. However, PCM (and other emerging memories) are prone to new sources of soft errors. In particular, multi-level cell (MLC) PCM devices will suffer from resistance drift, that increases the soft error rate and incurs high overheads for the scrub mechanism. This paper is the first to study the design of architectural scrub mechanisms, especially when tailored to the drift phenomenon in MLC PCM. Many of our solutions will also apply to other soft-error prone emerging memories. We first show that scrub overheads can be reduced with support for strong ECC codes and a lightweight error detection operation. We then design different scrub algorithms that can adaptively trade-off soft and hard errors. Using an approach that combines all proposed solutions, our scrub mechanism yields a 96.5% reduction in uncorrectable errors, a 24.4 × decrease in scrub-related writes, and a 37.8% reduction in scrub energy, relative to a basic scrub algorithm used in modern DRAM systems.", "citation": "Citations (83)", "departments": ["University of Utah", "University of Utah", "University of Utah", "IBM", "University of Utah"], "authors": ["Manu Awasthi.....http://dblp.org/pers/hd/a/Awasthi:Manu", "Manjunath Shevgoor.....http://dblp.org/pers/hd/s/Shevgoor:Manjunath", "Kshitij Sudan.....http://dblp.org/pers/hd/s/Sudan:Kshitij", "Bipin Rajendran.....http://dblp.org/pers/hd/r/Rajendran:Bipin", "Rajeev Balasubramonian.....http://dblp.org/pers/hd/b/Balasubramonian:Rajeev", "Viji Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Viji"], "conf": "hpca", "year": "2012", "pages": 12}