{"title": "DEAR: Delay-bounded Energy-constrained Adaptive Routing in wireless sensor networks.", "fields": ["network packet", "bounded function", "special case", "base station", "maximum flow problem"], "abstract": "Reliability and energy efficiency are critical issues in wireless sensor networks. In this work, we study Delay-bounded Energy-constrained Adaptive Routing (DEAR) problem with reliability, differential delay, and transmission energy consumption constraints in wireless sensor networks. We aim to route the connections in a manner such that link failure does not shut down the entire stream but allows a continuing flow for a significant portion of the traffic along multiple paths. This flexibility enabled by a multi-path routing scheme has the tradeoff of differential delay among the different paths. This requires increased memory in the base station to buffer the traffic until the data arrives on all the paths. Therefore, differential delay between the multiple paths should be bounded in a range to reduce additional hardware cost in the base station. Moreover, the energy consumption constraint should also be satisfied when transmitting packets among multiple paths. We present a pseudo-polynomial time solution to solve a special case of DEAR, representing edge delays as integers. Next, an (1+α)-approximation algorithm is proposed to solve the optimization version of the DEAR problem. An efficient heuristic is provided for the DEAR problem. We present numerical results confirming the advantage of our schemes as the first solution for the DEAR problem.", "citation": "Citations (23)", "departments": ["University of Minnesota", "AT&T Labs", "Arizona State University", "Syracuse University", "Princeton University"], "authors": ["Shi Bai.....http://dblp.org/pers/hd/b/Bai:Shi", "Weiyi Zhang.....http://dblp.org/pers/hd/z/Zhang:Weiyi", "Guoliang Xue.....http://dblp.org/pers/hd/x/Xue:Guoliang", "Jian Tang.....http://dblp.org/pers/hd/t/Tang_0008:Jian", "Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang"], "conf": "infocom", "year": "2012", "pages": 9}