{"title": "π-TM: Pessimistic invalidation for scalable lazy hardware transactional memory.", "fields": ["commit", "transactional memory", "correctness", "workaround", "transaction processing"], "abstract": "Lazy hardware transactional memory has been shown to be more efficient at extracting available concurrency than its eager counterpart. However, it poses scalability challenges at commit time as existence of conflicts among concurrent transactions is not known prior to commit. Non-conflicting transactions may have to wait before committing, severely affecting performance in certain workloads. Early conflict detection can be employed to allow such transactions to commit simultaneously. In this paper we show that the potential of this technique has not yet been fully utilized, with design choices in prior work severely burdening common-case transactional execution to avoid some relatively uncommon correctness concerns. The paper quantifies the severity of the problem and develops μ-TM, an early conflict detection — lazy conflict resolution design. This design highlights how, with modest extensions to existing directory-based coherence protocols, information regarding possible conflicts can be effectively used to achieve true parallelism at commit without burdening the common-case. We leverage the observation that contention is typically seen on only a small fraction of shared data accessed by coarse-grained transactions. Pessimistic invalidation of such lines when committing or aborting, therefore, enables fast common-case execution. Our results show that μ-TM performs consistently well and, in particular, far better than previous work on early conflict detection in lazy HTM. We also identify a pathological scenario that lazy designs with early conflict detection suffer from and propose a simple hardware workaround to sidestep it.", "citation": "Citations (12)", "departments": ["Chalmers University of Technology", "University of Murcia", "University of Murcia", "University of Murcia", "Chalmers University of Technology"], "authors": ["Anurag Negi.....http://dblp.org/pers/hd/n/Negi:Anurag", "J. Rubén Titos Gil.....http://dblp.org/pers/hd/g/Gil:J=_Rub=eacute=n_Titos", "Manuel E. Acacio.....http://dblp.org/pers/hd/a/Acacio:Manuel_E=", "José M. García.....http://dblp.org/pers/hd/g/Garc=iacute=a_0001:Jos=eacute=_M=", "Per Stenström.....http://dblp.org/pers/hd/s/Stenstr=ouml=m:Per"], "conf": "hpca", "year": "2012", "pages": 12}