{"title": "On Exploiting degrees-of-freedom in whitespaces.", "fields": ["power control", "wimax", "throughput", "whitespace", "channel"], "abstract": "TV Whitespaces, recently opened up by the FCC for unlicensed use by wireless devices, are seen as a potential cellular offload solution, especially in dense metros. However, under the new database-driven guidelines, there are typically very few whitespace bands available in such dense metros to a high-powered fixed device, which plays the role of a cellular base station in whitespaces. To address the lack of degrees-of-freedom (DoF) with this traditional architecture of one high-powered serving device, we propose a novel base station design that co-locates and networks together many low-powered devices to act as a multiple-antenna array. Lower-powered whitespace devices have access to more spectral DoF, a property that is unique to whitespaces. In the first part of the paper, we solve an array design problem where we estimate the size of the array required to meet long-term (worst-case) throughput targets. Using extensive simulations, we show that by effectively exploiting both spatial and spectral DoF, the array design outperforms the traditional design in most network conditions. Specifically, the proposed design can support throughputs of the order of a WiMAX cell running applications such as high-definition television. In the second part of the paper, we turn our attention to the operational aspects of such a design. Recognizing that the proposed array can potentially contain hundreds of elements, we propose a dynamic ON-OFF power control algorithm that operates in conjunction with the MaxWeight data scheduling algorithm and responds to the current network state - queues and channels - of the system, thus making the system power-efficient.", "citation": "Citations (3)", "departments": ["University of Texas at Austin", "IBM", "IBM", "IBM"], "authors": ["Harish Ganapathy.....http://dblp.org/pers/hd/g/Ganapathy:Harish", "Mukundan Madhavan.....http://dblp.org/pers/hd/m/Madhavan:Mukundan", "Malolan Chetlur.....http://dblp.org/pers/hd/c/Chetlur:Malolan", "Shivkumar Kalyanaraman.....http://dblp.org/pers/hd/k/Kalyanaraman:Shivkumar"], "conf": "infocom", "year": "2012", "pages": 9}