{"title": "Discriminative illumination: Per-pixel classification of raw materials based on optimal projections of spectral BRDF.", "fields": ["contextual image classification", "multiclass classification", "discriminative model", "bidirectional reflectance distribution function", "pixel", "ray"], "abstract": "Classifying raw, unpainted materials — metal, plastic, ceramic, fabric, etc. — is an important yet challenging task for computer vision. Previous works measure subsets of surface spectral reflectance as features for classification. However, acquiring the full spectral reflectance is time-consuming and error-prone. In this paper, we propose to use coded illumination to directly measure discriminative features for material classification. Optimal illumination patterns — which we call “discriminative illumination” — are learned from training samples, after projecting to which, the spectral reflectance of different materials are maximally separated. This projection is automatically realized by the integration of incident light for surface reflection. While a single discriminative illumination is capable of linear, two-class classification, we show that multiple discriminative illuminations can be used for nonlinear and multi-class classification. We also show theoretically the proposed method has higher signal-to-noise ratio than previous methods due to light multiplexing. Finally, we construct a LED-based multi-spectral dome and use the discriminative illumination method for classifying a variety of raw materials, including metal (aluminum, alloy, steel, stainless steel, brass and copper), plastic, ceramic, fabric and wood. Experimental results demonstrate the effectiveness of the proposed method.", "citation": "Citations (24)", "year": "2012", "departments": ["Rochester Institute of Technology", "Rochester Institute of Technology", "Rochester Institute of Technology", "Rochester Institute of Technology"], "conf": "cvpr", "authors": ["Jinwei Gu.....http://dblp.org/pers/hd/g/Gu:Jinwei", "Chao Liu.....http://dblp.org/pers/hd/l/Liu:Chao"], "pages": 8}