{"title": "Laser speckle photography for surface tampering detection.", "fields": ["speckle pattern", "aperture", "coherence", "speckle imaging", "computational photography"], "abstract": "It is often desirable to detect whether a surface has been touched, even when the changes made to that surface are too subtle to see in a pair of before and after images. To address this challenge, we introduce a new imaging technique that combines computational photography and laser speckle imaging. Without requiring controlled laboratory conditions, our method is able to detect surface changes that would be indistinguishable in regular photographs. It is also mobile and does not need to be present at the time of contact with the surface, making it well suited for applications where the surface of interest cannot be constantly monitored. Our approach takes advantage of the fact that tiny surface deformations cause phase changes in reflected coherent light which alter the speckle pattern visible under laser illumination. We take before and after images of the surface under laser light and can detect subtle contact by correlating the speckle patterns in these images. A key challenge we address is that speckle imaging is very sensitive to the location of the camera, so removing and reintroducing the camera requires high-accuracy viewpoint alignment. To this end, we use a combination of computational rephotog-raphy and correlation analysis of the speckle pattern as a function of camera translation. Our technique provides a reliable way of detecting subtle surface contact at a level that was previously only possible under laboratory conditions. With our system, the detection of these subtle surface changes can now be brought into the wild.", "citation": "Citations (8)", "year": "2012", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Google", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "cvpr", "authors": ["Yi-Chang Shih.....http://dblp.org/pers/hd/s/Shih:Yi=Chang", "Abe Davis.....http://dblp.org/pers/hd/d/Davis:Abe", "Samuel W. Hasinoff.....http://dblp.org/pers/hd/h/Hasinoff:Samuel_W=", "Frédo Durand.....http://dblp.org/pers/hd/d/Durand:Fr=eacute=do", "William T. Freeman.....http://dblp.org/pers/hd/f/Freeman:William_T="], "pages": 8}