{"title": "Temporal Analytics on Big Data for Web Advertising.", "fields": ["analytics", "behavioral targeting", "page view", "data processing system", "temporal database"], "abstract": "\"Big Data\" in map-reduce (M-R) clusters is often fundamentally temporal in nature, as are many analytics tasks over such data. For instance, display advertising uses Behavioral Targeting (BT) to select ads for users based on prior searches, page views, etc. Previous work on BT has focused on techniques that scale well for offline data using M-R. However, this approach has limitations for BT-style applications that deal with temporal data: (1) many queries are temporal and not easily expressible in M-R, and moreover, the set-oriented nature of M-R front-ends such as SCOPE is not suitable for temporal processing, (2) as commercial systems mature, they may need to also directly analyze and react to real-time data feeds since a high turnaround time can result in missed opportunities, but it is difficult for current solutions to naturally also operate over real-time streams. Our contributions are twofold. First, we propose a novel framework called TiMR (pronounced timer), that combines a time-oriented data processing system with a M-R framework. Users write and submit analysis algorithms as temporal queries - these queries are succinct, scale-out-agnostic, and easy to write. They scale well on large-scale offline data using TiMR, and can work unmodified over real-time streams. We also propose new cost-based query fragmentation and temporal partitioning schemes for improving efficiency with TiMR. Second, we show the feasibility of this approach for BT, with new temporal algorithms that exploit new targeting opportunities. Experiments using real data from a commercial ad platform show that TiMR is very efficient and incurs orders-of-magnitude lower development effort. Our BT solution is easy and succinct, and performs up to several times better than current schemes in terms of memory, learning time, and click-through-rate/coverage.", "citation": "Citations (102)", "departments": ["Microsoft", "Microsoft", "IBM"], "authors": ["Badrish Chandramouli.....http://dblp.org/pers/hd/c/Chandramouli:Badrish", "Jonathan Goldstein.....http://dblp.org/pers/hd/g/Goldstein:Jonathan", "Songyun Duan.....http://dblp.org/pers/hd/d/Duan:Songyun"], "conf": "icde", "year": "2012", "pages": 12}