{"title": "iTree: Efficiently discovering high-coverage configurations using interaction trees.", "fields": ["configuration space", "test set", "decision tree", "software configuration management", "iterative learning control", "machine learning", "empirical process", "software system", "cluster analysis", "software"], "abstract": "Software configurability has many benefits, but it also makes programs much harder to test, as in the worst case the program must be tested under every possible configuration. One potential remedy to this problem is combinatorial interaction testing (CIT), in which typically the developer selects a strength t and then computes a covering array containing all t-way configuration option combinations. However, in a prior study we showed that several programs have important high-strength interactions (combinations of a subset of configuration options) that CIT is highly unlikely to generate in practice. In this paper, we propose a new algorithm called interaction tree discovery (iTree) that aims to identify sets of configurations to test that are smaller than those generated by CIT, while also including important high-strength interactions missed by practical applications of CIT. On each iteration of iTree, we first use low-strength CIT to test the program under a set of configurations, and then apply machine learning techniques to discover new interactions that are potentially responsible for any new coverage seen. By repeating this process, iTree builds up a set of configurations likely to contain key high-strength interactions. We evaluated iTree by comparing the coverage it achieves versus covering arrays and randomly generated configuration sets. Our results strongly suggest that iTree can identify high-coverage sets of configurations more effectively than traditional CIT or random sampling.", "citation": "Citations (19)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Charles Song.....http://dblp.org/pers/hd/s/Song:Charles", "Adam A. Porter.....http://dblp.org/pers/hd/p/Porter:Adam_A=", "Jeffrey S. Foster.....http://dblp.org/pers/hd/f/Foster:Jeffrey_S="], "conf": "icse", "year": "2012", "pages": 11}