{"title": "Cooperative Virtual Power Plant Formation Using Scoring Rules.", "fields": ["distributed generation", "mains electricity", "probabilistic logic", "environmentally friendly", "grid", "virtual power plant", "predictability"], "abstract": "The growing focus on sustainable and environmentally friendly energy production has resulted in the proliferation of distributed energy resources (DERs), mainly based on renewable sources like wind and sunlight. However, their small size and the intermittent nature of their supply means that such generators cannot easily be assimilated into the current electricity network (Grid) like conventional generators. Against this background, Virtual Power Plants are fast emerging as a solution to this problem whereby a large number of small energy generators may be aggregated together such that they exhibit the characteristics like a traditional generator in terms of predictability and robustness. In this work, we propose a method to promote the formation of such \"cooperative\" VPPs (CVPPs) using multi-agent technology. In particular, we design a payment mechanism that encourages DERs to join CVPPs with large overall production. Our method is based on strictly proper scoring rules and elicits accurate probabilistic estimates of energy production from the CVPPs---and in turn, the member DERs---which aids in the planning of the supply schedule at the Grid.\n\nWe empirically evaluate our approach using the real-world setting of 16 commercial wind farms in the UK, and we show that our mechanism incentivises real DERs to form CVPPs and, moreover, it outperforms the current state of the art payment mechanism developed for this problem.", "citation": "Citations (73)", "departments": ["University of Southampton", "Technical University of Crete", "University of Southampton", "University of Southampton", "University of Southampton", "Technical University of Crete", "University of Southampton", "University of Southampton", "Secure Meters L ... Winchester, UK", "Secure Meters L ... Winchester, UK"], "authors": ["Valentin Robu.....http://dblp.org/pers/hd/r/Robu:Valentin", "Ramachandra Kota.....http://dblp.org/pers/hd/k/Kota:Ramachandra", "Georgios Chalkiadakis.....http://dblp.org/pers/hd/c/Chalkiadakis:Georgios", "Alex Rogers.....http://dblp.org/pers/hd/r/Rogers:Alex", "Nicholas R. Jennings.....http://dblp.org/pers/hd/j/Jennings:Nicholas_R="], "conf": "aaai", "year": "2012", "pages": -1}