{"title": "Operating system framed in case of mistaken identity: measuring the success of web-based spoofing attacks on OS password-entry dialogs.", "fields": ["installation", "login", "trusted path", "spoofing attack", "windows vista"], "abstract": "When asking users to enter credentials, today's desktop operating systems often use windows that provide scant evidence that a trusted path has been established; evidence that would allow a user to know that a request is genuine and that the password will not be read by untrusted principals. We measure the efficacy of web-based attacks that spoof these operating system credential-entry windows to steal users' device-login passwords. We recruited 504 users of Amazon's Mechanical Turk to evaluate a series of games on third-party websites. The third such website indicated that it needed to install software from the publisher that provided the participants' operating system: Microsoft's Silverlight for Windows Vista/7 users and Apple's QuickTime for Mac OS users. The website then displayed a spoofed replica of a window the participant's client operating system would use to request a user's device credentials. In our most effective attacks, over 20% of participants entered passwords that they later admitted were the genuine credentials used to login to their devices. Even among those who declined to enter their credentials, many participants were oblivious to the spoofing attack. Participants were more likely to confirm that they were worried about the consequences of installing software from a legitimate source than to report that they thought the credential-entry window might have appeared as a result of an attempt to steal their password.", "citation": "Citations (7)", "year": "2012", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Microsoft"], "conf": "ccs", "authors": ["Cristian Bravo-Lillo.....http://dblp.org/pers/hd/b/Bravo=Lillo:Cristian", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith", "Julie S. Downs.....http://dblp.org/pers/hd/d/Downs:Julie_S=", "Saranga Komanduri.....http://dblp.org/pers/hd/k/Komanduri:Saranga", "Stuart E. Schechter.....http://dblp.org/pers/hd/s/Schechter:Stuart_E=", "Manya Sleeper.....http://dblp.org/pers/hd/s/Sleeper:Manya"], "pages": 13}