{"title": "Evaluating depth perception of volumetric data in semi-immersive VR.", "fields": ["motion compensation", "immersion", "interaction technique", "rendering", "depth perception", "parallax", "stereoscopy"], "abstract": "Displays supporting stereoscopy and head-coupled motion parallax can enhance human perception of complex 3D datasets. This has been studied extensively for datasets containing 3D surfaces and 3D networks but less for so volumetric data. Volumetric data is characterized by a heavy presence of transparency, occlusion and highly ambiguous spatial structure. There are many different rendering and visualization algorithms and interactive techniques that enhance perception of volume data and these techniques' effectiveness have been evaluated. However, the effect of VR displays on perception of volume data is less well studied. Therefore, we conduct two experiments on how various display conditions affect a participant's depth perception accuracy of a volumetric dataset. A demographic pre-questionnaire also allows us to separate the accuracy differences between participants with more and less experience with 3D games and VR. Our results show an overall benefit for stereo with head-tracking for enhancing perception of depth in volumetric data. Our study also suggests that familiarity with 3D games and VR type technology affects the users'ability to perceive such data and affects the accuracy boost due to VR displays.", "citation": "Not cited", "departments": ["University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte"], "authors": ["Isaac Cho.....http://dblp.org/pers/hd/c/Cho:Isaac", "Wenwen Dou.....http://dblp.org/pers/hd/d/Dou:Wenwen", "Zachary Wartell.....http://dblp.org/pers/hd/w/Wartell:Zachary", "William Ribarsky.....http://dblp.org/pers/hd/r/Ribarsky:William", "Xiaoyu Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoyu"], "conf": "vr", "year": "2012", "pages": 2}