{"title": "AstroShelf: understanding the universe through scalable navigation of a galaxy of annotations.", "fields": ["scalability", "data stream", "annotation", "big data", "workflow"], "abstract": "This demo presents AstroShelf, our on-going effort to enable astrophysicists to collaboratively investigate celestial objects using data originating from multiple sky surveys, hosted at different sites. The AstroShelf platform combines database and data stream, workflow and visualization technologies to provide a means for querying and displaying telescope images (in a Google Sky manner), visualizations of spectrum data, and for managing annotations. In addition to the user interface, AstroShelf supports a programmatic interface (available as a web service), which allows astrophysicists to incorporate functionality from AstroShelf in their own programs. A key feature is Live Annotations which is the detection and delivery of events or annotations to users in real-time, based on their profiles. We demonstrate the capabilities of AstroShelf through real end-user exploration scenarios (with participation from \"stargazers\" in the audience), in the presence of simulated annotation workloads executed through web services.", "citation": "Citations (12)", "year": "2012", "departments": ["University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh"], "conf": "sigmod", "authors": ["Panayiotis Neophytou.....http://dblp.org/pers/hd/n/Neophytou:Panayiotis", "Roxana Gheorghiu.....http://dblp.org/pers/hd/g/Gheorghiu:Roxana", "Rebecca Hachey.....http://dblp.org/pers/hd/h/Hachey:Rebecca", "Timothy Luciani.....http://dblp.org/pers/hd/l/Luciani:Timothy", "Di Bao.....http://dblp.org/pers/hd/b/Bao:Di", "Alexandros Labrinidis.....http://dblp.org/pers/hd/l/Labrinidis:Alexandros", "G. Elisabeta Marai.....http://dblp.org/pers/hd/m/Marai:G=_Elisabeta", "Panos K. Chrysanthis.....http://dblp.org/pers/hd/c/Chrysanthis:Panos_K="], "pages": 4}