{"title": "Secret Sharing Schemes for Very Dense Graphs.", "fields": ["independent set", "dense graph", "access structure", "secret sharing", "graph", "vertex", "upper and lower bounds", "complement graph"], "abstract": "A secret-sharing scheme realizes a graph if every two vertices connected by an edge can reconstruct the secret while every independent set in the graph does not get any information on the secret. Similar to secret-sharing schemes for general access structures, there are gaps between the known lower bounds and upper bounds on the share size for graphs. Motivated by the question of what makes a graph \"hard\" for secret-sharing schemes, we study very dense graphs, that is, graphs whose complement contains few edges. We show that if a graph with n vertices contains $$\\left {\\begin{array}{c}n\\\\ 2\\end{array}}\\right -n^{1+\\beta }$$ edges for some constant $$0 \\le \\beta <1$$, then there is a scheme realizing the graph with total share size of $$\\tilde{O}n^{5/4+3\\beta /4}$$. This should be compared to $$On^2/\\log n$$ --- the best upper bound known for general graphs. Thus, if a graph is \"hard\", then the graph and its complement should have many edges. We generalize these results to nearly complete k-homogeneous access structures for a constant k. To complement our results, we prove lower bounds for secret-sharing schemes realizing very dense graphs, e.g., for linear secret-sharing schemes we prove a lower bound of $$\\varOmega n^{1+\\beta /2}$$.", "citation": "Citations (207)", "departments": ["Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Universitat Rov ... rragona, Spain", "Universitat Rov ... rragona, Spain"], "authors": ["Amos Beimel.....http://dblp.org/pers/hd/b/Beimel:Amos", "Oriol Farràs.....http://dblp.org/pers/hd/f/Farr=agrave=s:Oriol", "Yuval Mintz.....http://dblp.org/pers/hd/m/Mintz:Yuval"], "conf": "crypto", "year": "2012", "pages": 18}