{"title": "Neighborhood repulsed metric learning for kinship verification.", "fields": ["metric", "biometrics", "discriminative model", "formal verification", "kinship"], "abstract": "Kinship verification from facial images is an interesting and challenging problem in computer vision, and there are very limited attempts on tackle this problem in the literature. In this paper, we propose a new neighborhood repulsed metric learning (NRML) method for kinship verification. Motivated by the fact that interclass samples (without a kinship relation) with higher similarity usually lie in a neighborhood and are more easily misclassified than those with lower similarity, we aim to learn a distance metric under which the intraclass samples (with a kinship relation) are pulled as close as possible and interclass samples lying in a neighborhood are repulsed and pushed away as far as possible, simultaneously, such that more discriminative information can be exploited for verification. To make better use of multiple feature descriptors to extract complementary information, we further propose a multiview NRML (MNRML) method to seek a common distance metric to perform multiple feature fusion to improve the kinship verification performance. Experimental results are presented to demonstrate the efficacy of our proposed methods. Finally, we also test human ability in kinship verification from facial images and our experimental results show that our methods are comparable to that of human observers.", "citation": "Citations (255)", "year": "2012", "departments": ["Agency for Science, Technology and Research", "Beijing Normal University", "Capital Normal University", "Capital Normal University", "Nanyang Technological University"], "conf": "cvpr", "authors": ["Jiwen Lu.....http://dblp.org/pers/hd/l/Lu:Jiwen", "Junlin Hu.....http://dblp.org/pers/hd/h/Hu:Junlin", "Xiuzhuang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiuzhuang", "Yuanyuan Shang.....http://dblp.org/pers/hd/s/Shang:Yuanyuan", "Yap-Peng Tan.....http://dblp.org/pers/hd/t/Tan:Yap=Peng", "Gang Wang.....http://dblp.org/pers/hd/w/Wang_0012:Gang"], "pages": 8}