{"title": "Entity Search Strategies for Mashup Applications.", "fields": ["web query classification", "query expansion", "mashup", "web search query", "semantic search"], "abstract": "Programmatic data integration approaches such as mashups have become a viable approach to dynamically integrate web data at runtime. Key data sources for mashups include entity search engines and hidden databases that need to be queried via source-specific search interfaces or web forms. Current mashups are typically restricted to simple query approaches such as using keyword search. Such approaches may need a high number of queries if many objects have to be found. Furthermore, the effectiveness of the queries may be limited, i.e., they may miss relevant results. We therefore propose more advanced search strategies that aim at finding a set of entities with high efficiency and high effectiveness. Our strategies use different kinds of queries that are determined by source-specific query generators. Furthermore, the queries are selected based on the characteristics of input entities. We introduce a flexible model for entity search strategies that includes a ranking of candidate queries determined by different query generators. We describe different query generators and outline their use within four entity search strategies. These strategies apply different query ranking and selection approaches to optimize efficiency and effectiveness. We evaluate our search strategies in detail for two domains: product search and publication search. The comparison with a standard keyword search shows that the proposed search strategies provide significant improvements in both domains.", "citation": "Citations (10)", "departments": ["Leipzig University", "Leipzig University", "Leipzig University"], "authors": ["Stefan Endrullis.....http://dblp.org/pers/hd/e/Endrullis:Stefan", "Andreas Thor.....http://dblp.org/pers/hd/t/Thor:Andreas", "Erhard Rahm.....http://dblp.org/pers/hd/r/Rahm:Erhard"], "conf": "icde", "year": "2012", "pages": 12}