{"title": "Composite Cores: Pushing Heterogeneity Into a Core.", "fields": ["multi core processor", "overhead", "single core", "characteristic energy", "controller"], "abstract": "Heterogeneous multicore systems -- comprised of multiple cores with varying capabilities, performance, and energy characteristics -- have emerged as a promising approach to increasing energy efficiency. Such systems reduce energy consumption by identifying phase changes in an application and migrating execution to the most efficient core that meets its current performance requirements. However, due to the overhead of switching between cores, migration opportunities are limited to coarse-grained phases (hundreds of millions of instructions), reducing the potential to exploit energy efficient cores. We propose Composite Cores, an architecture that reduces switching overheads by bringing the notion of heterogeneity within a single core. The proposed architecture pairs big and little compute µEngines that together can achieve high performance and energy efficiency. By sharing much of the architectural state between the µEngines, the switching overhead can be reduced to near zero, enabling fine-grained switching and increasing the opportunities to utilize the little µEngine without sacrificing performance. An intelligent controller switches between the µEngines to maximize energy efficiency while constraining performance loss to a configurable bound. We evaluate Composite Cores using cycle accurate micro architectural simulations and a detailed power model. Results show that, on average, the controller is able to map 25% of the execution to the little µEngine, achieving an 18% energy savings while limiting performance loss to 5%.", "citation": "Citations (143)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Andrew Lukefahr.....http://dblp.org/pers/hd/l/Lukefahr:Andrew", "Shruti Padmanabha.....http://dblp.org/pers/hd/p/Padmanabha:Shruti", "Reetuparna Das.....http://dblp.org/pers/hd/d/Das:Reetuparna", "Faissal M. Sleiman.....http://dblp.org/pers/hd/s/Sleiman:Faissal_M=", "Ronald G. Dreslinski.....http://dblp.org/pers/hd/d/Dreslinski:Ronald_G=", "Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F=", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A="], "conf": "micro", "year": "2012", "pages": 12}