{"title": "Collaboration in cognitive tutor use in latin America: field study and design recommendations.", "fields": ["tutor", "educational technology", "latin americans", "collaborative learning", "cognitive tutor"], "abstract": "Technology has the promise to transform educational prac-tices worldwide. In particular, cognitive tutoring systems are an example of educational technology that has been ex-tremely effective at improving mathematics learning over traditional classroom instruction. However, studies on the effectiveness of tutor software have been conducted mainly in the United States, Canada, and Western Europe, and little is known about how these systems might be used in other contexts with differing classroom practices and values. To understand this question, we studied the usage of mathematics tutoring software for middle school at sites in three Latin American countries: Brazil, Mexico, and Costa Rica. While cognitive tutors were designed for individual use, we found that students in these classrooms worked collaboratively, engaging in interdependently paced work and conducting work away from their own computer. In this paper we present design recommendations for how cognitive tutors might be incorporated into different classroom practices, and better adapted for student needs in these environments.", "citation": "Citations (21)", "departments": ["Carnegie Mellon University", "Arizona State University", "Worcester Polytechnic Institute", "Universidad Veracruzana", "University of Costa Rica"], "authors": ["Amy Ogan.....http://dblp.org/pers/hd/o/Ogan:Amy", "Erin Walker.....http://dblp.org/pers/hd/w/Walker:Erin", "Ryan Shaun Joazeiro de Baker.....http://dblp.org/pers/hd/b/Baker:Ryan_Shaun_Joazeiro_de", "Genaro Rebolledo-Mendez.....http://dblp.org/pers/hd/r/Rebolledo=Mendez:Genaro", "Maynor Jimenez Castro.....http://dblp.org/pers/hd/c/Castro:Maynor_Jimenez", "Tania Laurentino.....http://dblp.org/pers/hd/l/Laurentino:Tania", "Adriana M. J. B. de Carvalho.....http://dblp.org/pers/hd/c/Carvalho:Adriana_M=_J=_B=_de"], "conf": "chi", "year": "2012", "pages": 10}