{"title": "Timed Relational Abstractions for Sampled Data Control Systems.", "fields": ["hybrid automaton", "bounded function", "controller", "correctness", "transition system"], "abstract": "In this paper, we define timed relational abstractions for verifying sampled data control systems. Sampled data control systems consist of a plant, modeled as a hybrid system and a synchronous controller, modeled as a discrete transition system. The controller computes control inputs and/or sends control events to the plant based on the periodically sampled state of the plant. The correctness of the system depends on the controller design as well as an appropriate choice of the controller sampling period.\n\nOur approach constructs a timed relational abstraction of the hybrid plant by replacing the continuous plant dynamics by relations. These relations map a state of the plant to states reachable within the sampling time period. We present techniques for building timed relational abstractions, while taking care of discrete transitions that can be taken by the plant between samples. The resulting abstractions are better suited for the verification of sampled data control systems. The abstractions focus on the states that can be observed by the controller at the sample times, while abstracting away behaviors between sample times conservatively. The resulting abstractions are discrete, infinite-state transition systems. Thus conventional verification tools can be used to verify safety properties of these abstractions. We use k-induction to prove safety properties and bounded model checking (BMC) to find potential falsifications. We present our idea, its implementation and results on many benchmark examples.", "citation": "Citations (18)", "year": "2012", "departments": ["University of Colorado Boulder", "University of Colorado Boulder", "SRI International"], "conf": "cav", "authors": ["Aditya Zutshi.....http://dblp.org/pers/hd/z/Zutshi_0001:Aditya", "Sriram Sankaranarayanan.....http://dblp.org/pers/hd/s/Sankaranarayanan:Sriram", "Ashish Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Ashish"], "pages": 19}