{"title": "PRAGUE: Towards Blending Practical Visual Subgraph Query Formulation and Query Processing.", "fields": ["rdf query language", "spatial query", "web query classification", "sargable", "web search query"], "abstract": "In a previous paper, we laid out the vision of a novel graph query processing paradigm where instead of processing a visual query graph after its construction, it interleaves visual query formulation and processing by exploiting the latency offered by the GUI to filter irrelevant matches and prefetch partial query results [8]. Our first attempt at implementing this vision, called GBLENDER [8], shows significant improvement in system response time (SRT) for sub graph containment queries. However, GBLENDER suffers from two key drawbacks, namely inability to handle visual sub graph similarity queries and inefficient support for visual query modification, limiting its usage in practical environment. In this paper, we propose a novel algorithm called PRAGUE (Practical visu Al Graph QUery Blender), that addresses these limitations by exploiting a novel data structure called spindle-shaped graphs (SPIG). A SPIG succinctly records various information related to the set of super graphs of a newly added edge in the visual query fragment. Specifically, PRAGUE realizes a unified visual framework to support SPIG-based processing of modification-efficient sub graph containment and similarity queries. Extensive experiments on real-world and synthetic datasets demonstrate effectiveness of PRAGUE.", "citation": "Citations (11)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Hong Kong Baptist University", "Fudan University"], "authors": ["Changjiu Jin.....http://dblp.org/pers/hd/j/Jin:Changjiu", "Sourav S. Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick:Sourav_S=", "Byron Choi.....http://dblp.org/pers/hd/c/Choi:Byron", "Shuigeng Zhou.....http://dblp.org/pers/hd/z/Zhou:Shuigeng"], "conf": "icde", "year": "2012", "pages": 12}