{"title": "Toward simple criteria to establish capacity scaling laws for wireless networks.", "fields": ["vehicular ad hoc network", "ad hoc wireless distribution service", "adaptive quality of service multi hop routing", "optimized link state routing protocol", "physical layer"], "abstract": "Capacity scaling laws offer fundamental understanding on the trend of user throughput behavior when the network size increases. Since the seminal work of Gupta and Kumar, there have been active research efforts in developing capacity scaling laws for ad hoc networks under various advanced physical layer technologies. These efforts led to many custom-designed solutions, most of which were intellectually challenging and lacked universal properties that can be extended to address scaling laws of ad hoc networks with other physical layer technologies. In this paper, we present a set of simple yet powerful tool that can be applied to quickly determine the capacity scaling laws for various physical layer technologies under the protocol model. We prove the correctness of our proposed criteria and demonstrate their usage through a number of case studies, such as ad hoc networks with directional antenna, MIMO, multi-channel multi-radio, cognitive radio, and multiple packet reception. These simple criteria will serve as powerful tools to networking researchers to obtain throughput scaling laws of ad hoc networks under different physical layer technologies, particularly those to be developed in the future.", "citation": "Citations (14)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech", "United States Naval Research Laboratory"], "authors": ["Canming Jiang.....http://dblp.org/pers/hd/j/Jiang:Canming", "Yi Shi.....http://dblp.org/pers/hd/s/Shi_0001:Yi", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Sastry Kompella.....http://dblp.org/pers/hd/k/Kompella:Sastry", "Scott F. Midkiff.....http://dblp.org/pers/hd/m/Midkiff:Scott_F="], "conf": "infocom", "year": "2012", "pages": 9}