{"title": "Differentially Private Histogram Publication.", "fields": ["heuristic", "adaptive histogram equalization", "range query", "histogram matching", "histogram", "data set", "differential privacy"], "abstract": "Differential privacy (DP) is a promising scheme for releasing the results of statistical queries on sensitive data, with strong privacy guarantees against adversaries with arbitrary background knowledge. Existing studies on DP mostly focus on simple aggregations such as counts. This paper investigates the publication of DP-compliant histograms, which is an important analytical tool for showing the distribution of a random variable, e.g., hospital bill size for certain patients. Compared to simple aggregations whose results are purely numerical, a histogram query is inherently more complex, since it must also determine its structure, i.e., the ranges of the bins. As we demonstrate in the paper, a DP-compliant histogram with finer bins may actually lead to significantly lower accuracy than a coarser one, since the former requires stronger perturbations in order to satisfy DP. Moreover, the histogram structure itself may reveal sensitive information, which further complicates the problem. Motivated by this, we propose two novel algorithms, namely Noise First and Structure First, for computing DP-compliant histograms. Their main difference lies in the relative order of the noise injection and the histogram structure computation steps. Noise First has the additional benefit that it can improve the accuracy of an already published DP-complaint histogram computed using a naiive method. Going one step further, we extend both solutions to answer arbitrary range queries. Extensive experiments, using several real data sets, confirm that the proposed methods output highly accurate query answers, and consistently outperform existing competitors.", "citation": "Citations (118)", "departments": ["Northeastern University", "Nanyang Technological University", "Northeastern University", "Northeastern University", "Nanyang Technological University", "Northeastern University", "Adv. Digital Sc ... pore, Singapore", "Adv. Digital Sc ... pore, Singapore", "Advanced Digita ... ore, Singapore", "Advanced Digita ... ore, Singapore"], "authors": ["Jia Xu.....http://dblp.org/pers/hd/x/Xu:Jia", "Zhenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenjie", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Yin Yang.....http://dblp.org/pers/hd/y/Yang:Yin", "Ge Yu.....http://dblp.org/pers/hd/y/Yu_0001:Ge"], "conf": "icde", "year": "2012", "pages": 12}