{"title": "Iterative optimization for the data center.", "fields": ["data set", "data center", "optimizing compiler", "cpu time", "compiler"], "abstract": "Iterative optimization is a simple but powerful approach that searches for the best possible combination of compiler optimizations for a given workload. However, each program, if not each data set, potentially favors a different combination. As a result, iterative optimization is plagued by several practical issues that prevent it from being widely used in practice: a large number of runs are required for finding the best combination; the process can be data set dependent; and the exploration process incurs significant overhead that needs to be compensated for by performance benefits.Therefore, while iterative optimization has been shown to have significant performance potential, it is seldomly used in production compilers.   In this paper, we propose Iterative Optimization for the Data Center (IODC): we show that servers and data centers offer a context in which all of the above hurdles can be overcome. The basic idea is to spawn different combinations across workers and recollect performance statistics at the master, which then evolves to the optimum combination of compiler optimizations. IODC carefully manages costs and benefits, and is transparent to the end user. We evaluate IODC using both MapReduce and throughput compute-intensive server applications. In order to reflect the large number of users interacting with the system, we gather a very large collection of data sets (at least 1000 and up to several million unique data sets per program), for a total storage of 10.7TB, and 568 days of CPU time. We report an average performance improvement of 1.48×, and up to 2.08×, for the MapReduce applications, and 1.14×, and up to 1.39×, for the throughput compute-intensive server applications.", "citation": "Citations (7)", "year": "2012", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Ghent University", "French Institute for Research in Computer Science and Automation", "Chinese Academy of Sciences"], "conf": "asplos", "authors": ["Yang Chen.....http://dblp.org/pers/hd/c/Chen:Yang", "Shuangde Fang.....http://dblp.org/pers/hd/f/Fang:Shuangde", "Lieven Eeckhout.....http://dblp.org/pers/hd/e/Eeckhout:Lieven", "Olivier Temam.....http://dblp.org/pers/hd/t/Temam:Olivier", "Chengyong Wu.....http://dblp.org/pers/hd/w/Wu:Chengyong"], "pages": 12}