{"title": "Adaptive Set-Granular Cooperative Caching.", "fields": ["cas latency", "cache", "cpu cache", "smart cache", "granularity"], "abstract": "Current Chip Multiprocessors (CMPs) consist of several cores, cache memories and interconnection networks in the same chip. Private last level cache (LLC) configurations assign a static portion of the LLC to each core. This provides lower latency and isolation, at the cost of depriving the system of the possibility of reassigning underutilized resources. A way of taking advantage of underutilized resources in other private LLCs in the same chip is to use the coherence mechanism to determine the state of those caches and spill lines to them. Also, it is well known that memory references are not uniformly distributed across the sets of a set-associative cache. Therefore, applying a uniform spilling policy to all the sets in a cache may not be the best option. This paper proposes Adaptive Set-Granular Cooperative Caching (ASCC), which measures the degree of stress of each set and performs spills between spiller and potential receiver sets, while it tackles capacity problems. Also, it adds a neutral state to prevent sets from being either spillers or receivers when it could be harmful. Furthermore, we propose Adaptive Variable-Granularity Cooperative Caching (AVGCC), which dynamically adjusts the granularity for applying these policies. Both techniques have a negligible storage overhead and can adapt to many core environments using scalable structures. AVGCC improved average performance by 7.8% and reduced average memory latency by 27% related to a traditional private LLC configuration in a 4-core CMP. Finally, we propose an extension of AVGCC to provide Quality of Service that increases the average performance gain to 8.1%.", "citation": "Citations (11)", "departments": ["Computer Archit ... a Coruña, Spain", "Computer Archit ... a Coruña, Spain", "Computer Archit ... a Coruña, Spain"], "authors": ["Dyer Rolán.....http://dblp.org/pers/hd/r/Rol=aacute=n:Dyer", "Basilio B. Fraguela.....http://dblp.org/pers/hd/f/Fraguela:Basilio_B=", "Ramon Doallo.....http://dblp.org/pers/hd/d/Doallo:Ramon"], "conf": "hpca", "year": "2012", "pages": 12}