{"title": "Reputation-based incentive protocols in crowdsourcing applications.", "fields": ["crowdsourcing", "pareto efficiency", "reputation", "repeated game", "outsourcing"], "abstract": "Crowdsourcing websites (e.g. Yahoo! Answers, Amazon Mechanical Turk, and etc.) emerged in recent years that allow requesters from all around the world to post tasks and seek help from an equally global pool of workers. However, intrinsic incentive problems reside in crowdsourcing applications as workers and requester are selfish and aim to strategically maximize their own benefit. In this paper, we propose to provide incentives for workers to exert effort using a novel game-theoretic model based on repeated games. As there is always a gap in the social welfare between the non-cooperative equilibria emerging when workers pursue their self-interests and the desirable Pareto efficient outcome, we propose a novel class of incentive protocols based on social norms which integrates reputation mechanisms into the existing pricing schemes currently implemented on crowdsourcing websites, in order to improve the performance of the non-cooperative equilibria emerging in such applications. We first formulate the exchanges on a crowdsourcing website as a two-sided market where requesters and workers are matched and play gift-giving games repeatedly. Subsequently, we study the protocol designer's problem of finding an optimal and sustainable (equilibrium) protocol which achieves the highest social welfare for that website. We prove that the proposed incentives protocol can make the website operate close to Pareto efficiency. Moreover, we also examine an alternative scenario, where the protocol designer aims at maximizing the revenue of the website and evaluate the performance of the optimal protocol.", "citation": "Citations (183)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Yu Zhang.....http://dblp.org/pers/hd/z/Zhang_0025:Yu", "Mihaela van der Schaar.....http://dblp.org/pers/hd/s/Schaar:Mihaela_van_der"], "conf": "infocom", "year": "2012", "pages": 9}