{"title": "Action recognition for human-marionette interaction.", "fields": ["dance", "performing arts", "multimedia", "interactive art", "puppetry"], "abstract": "In this paper, we propose a human-marionette interaction system based on a human action recognition approach for applications to  interactive artistic puppetry  and a  mimicking-marionette game . We developed an intelligent marionette called \"i-marionette\" that is controlled by a sophisticated control device to achieve various human actions. Moreover, we utilized an action recognition approach to enable the i-marionette to learn and recognize complex dance movements. The idea of artistic puppetry is to present a conflict scenario between two different cultural worlds: the  performer  is active and represents the culture of modern technology based in the real world. In contrast, the  i - marionette  represents traditional culture and is passive and based in a virtual world. The active performer guides the passive  i -marionette to form a space-time connection between the real world and the virtual world. The  i -marionette mimics the performer's action, while the performer also mimics the i-marionette's action. The performance represents an artistic conception in which humans invent technology and the  i -marionette is manipulated by human control. However, in this interactive circle, the human is implicitly affected by the i-marionette. In our mimicking-marionette game, a player mimics the  i -marionette's action. Subsequently, our human action recognition system measures the action similarity between the player and the  i -marionette, and our system provides a similarity score.", "citation": "Citations (3)", "departments": ["National Taiwan University", "Graduate Instit ... ity, Taiwan Roc", "Dept. of Comput ... ity, Taiwan Roc", "Graduate Instit ... ity, Taiwan Roc"], "authors": ["Shih-Yao Lin.....http://dblp.org/pers/hd/l/Lin_0001:Shih=Yao", "Chuen-Kai Shie.....http://dblp.org/pers/hd/s/Shie:Chuen=Kai", "Shen-Chi Chen.....http://dblp.org/pers/hd/c/Chen:Shen=Chi", "Yi-Ping Hung.....http://dblp.org/pers/hd/h/Hung:Yi=Ping"], "conf": "mm", "year": "2012", "pages": 10}