{"title": "A time-efficient information collection protocol for large-scale RFID systems.", "fields": ["warehouse", "inventory control", "synchronization", "bloom filter", "inefficiency"], "abstract": "Sensor-enabled RFID technology has generated a lot of interest from industries lately. Integrated with miniaturized sensors, RFID tags could provide not only the IDs but also valuable real-time information about the state of the corresponding objects or the surrounding environment, which is beneficial to many practical applications, such as warehouse management and inventory control. In this paper, we study the problem on how to design efficient protocols to collect such sensor information from numerous tags in a large-scale RFID system with a number of readers deployed. Different from information collection in the small RFID system covered by only one reader, in the multi-reader scenario, each reader has to first find out which tags located in its interrogation region in order to read information from them. We start with two categories of warm-up solutions that are directly extended from the existing information collection protocols for single-reader RFID systems, and show that all of them do not work well for the multi-reader information collection problem due to their inefficiency of identifying the interrogated tags. Then, we propose a novel solution, called the Bloom filter based Information Collection protocol (BIC). In BIC, the interrogated tag identification can be efficiently achieved with a distributively constructed Bloom filter, which significantly reduces the communication overhead and thus the protocol execution time. Extensive simulations show that BIC performs better than all the warm-up solutions and its execution time is within 3 times of the lower bound.", "citation": "Citations (56)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "University of Florida"], "authors": ["Hao Yue.....http://dblp.org/pers/hd/y/Yue:Hao", "Chi Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Chi", "Miao Pan.....http://dblp.org/pers/hd/p/Pan:Miao", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang", "Shigang Chen.....http://dblp.org/pers/hd/c/Chen:Shigang"], "conf": "infocom", "year": "2012", "pages": 9}