{"title": "Stochastic optimal multirate multicast in socially selfish wireless networks.", "fields": ["xcast", "lyapunov optimization", "linear network coding", "protocol independent multicast", "source specific multicast"], "abstract": "Multicast supporting non-uniform receiving rates is an effective means of data dissemination to receivers with diversified bandwidth availability. Designing efficient rate control, routing and capacity allocation to achieve optimal multirate multicast has been a difficult problem in fixed wireline networks, let alone wireless networks with random channel fading and volatile node mobility. The challenge escalates if we consider also the selfishness of users who prefer to relay data for others with strong social ties. Such social selfishness of users is a new constraint in network protocol design. Its impact on efficient multicast in wireless networks has yet to be explored especially when multiple receiving rates are allowed. In this paper, we design an efficient, social-aware multirate multicast scheme that can maximize the overall utility of socially selfish users in a wireless network, and its distributed implementation. We model social preferences of users as differentiated costs for packet relay, which are weighted by the strength of social tie between the relay and the destination. Stochastic Lyapunov optimization techniques are utilized to design optimal scheduling of multicast transmissions, which are combined with multi-resolution coding and random linear network coding. With rigorous theoretical analysis, we study the optimality, stability, and complexity of our algorithm, as well as the impact of social preferences. Empirical studies further confirm the superiority of our algorithm under different social selfishness patterns.", "citation": "Citations (8)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Calgary", "University of Hong Kong", "University of Hong Kong"], "authors": ["Hongxing Li.....http://dblp.org/pers/hd/l/Li:Hongxing", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Wei Huang.....http://dblp.org/pers/hd/h/Huang:Wei", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2012", "pages": 9}