{"title": "Image colorization using similar images.", "fields": ["coherence", "chromatic scale", "color image", "computer vision", "pixel"], "abstract": "We present a new example-based method to colorize a gray image. As input, the user needs only to supply a reference color image which is semantically similar to the target image. We extract features from these images at the resolution of superpixels, and exploit these features to guide the colorization process. Our use of a superpixel representation speeds up the colorization process. More importantly, it also empowers the colorizations to exhibit a much higher extent of spatial consistency in the colorization as compared to that using independent pixels. We adopt a fast cascade feature matching scheme to automatically find correspondences between superpixels of the reference and target images. Each correspondence is assigned a confidence based on the feature matching costs computed at different steps in the cascade, and high confidence correspondences are used to assign an initial set of chromatic values to the target superpixels. To further enforce the spatial coherence of these initial color assignments, we develop an image space voting framework which draws evidence from neighboring superpixels to identify and to correct invalid color assignments. Experimental results and user study on a broad range of images demonstrate that our method with a fixed set of parameters yields better colorization results as compared to existing methods.", "citation": "Citations (71)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore"], "authors": ["Raj Kumar Gupta.....http://dblp.org/pers/hd/g/Gupta:Raj_Kumar", "Alex Yong Sang Chia.....http://dblp.org/pers/hd/c/Chia:Alex_Yong_Sang", "Deepu Rajan.....http://dblp.org/pers/hd/r/Rajan:Deepu", "Ee Sin Ng.....http://dblp.org/pers/hd/n/Ng:Ee_Sin", "Zhiyong Huang.....http://dblp.org/pers/hd/h/Huang:Zhiyong"], "conf": "mm", "year": "2012", "pages": 10}