{"title": "Strong Complementarity and Non-locality in Categorical Quantum Mechanics.", "fields": ["quantum", "diagrammatic reasoning", "quantum nonlocality", "complementarity", "categorical quantum mechanics"], "abstract": "Categorical quantum mechanics studies quantum theory in the framework of dagger-compact closed categories. Using this framework, we establish a tight relationship between two key quantum theoretical notions: non-locality and complementarity. In particular, we establish a direct connection between Mermin-type non-locality scenarios, which we generalise to an arbitrary number of parties, using systems of arbitrary dimension, and performing arbitrary measurements, and a new stronger notion of complementarity which we introduce here. Our derivation of the fact that strong complementarity is a necessary condition for a Mermin scenario provides a crisp operational interpretation for strong complementarity. We also provide a complete classification of strongly complementary observables for quantum theory, something which has not yet been achieved for ordinary complementarity. Since our main results are expressed in the (diagrammatic) language of dagger-compact categories, they can be applied outside of quantum theory, in any setting which supports the purely algebraic notion of strongly complementary observables. We have therefore introduced a method for discussing non-locality in a wide variety of models in addition to quantum theory. The diagrammatic calculus substantially simplifies (and sometimes even trivialises) many of the derivations, and provides new insights. In particular, the diagrammatic computation of correlations clearly shows how local measurements interact to yield a global overall effect. In other words, we depict non-locality.", "citation": "Citations (36)", "departments": ["University of Oxford", "University of Oxford", "Beihang University", "Lab. d'Inf. Qua ... ussels, Belgium"], "authors": ["Bob Coecke.....http://dblp.org/pers/hd/c/Coecke:Bob", "Ross Duncan.....http://dblp.org/pers/hd/d/Duncan:Ross", "Aleks Kissinger.....http://dblp.org/pers/hd/k/Kissinger:Aleks", "Quanlong Wang.....http://dblp.org/pers/hd/w/Wang:Quanlong"], "conf": "lics", "year": "2012", "pages": 10}