{"title": "A Meta-language for MDX Queries in eLog Business Solution.", "fields": ["data modeling", "online analytical processing", "query language", "business intelligence", "data warehouse"], "abstract": "The adoption of business intelligence technology in industries is growing rapidly. Business managers are not satisfied with ad hoc and static reports and they ask for more flexible and easy to use data analysis tools. Recently, application interfaces that expand the range of operations available to the user, hiding the underlying complexity, have been developed. The paper presents eLog, a business intelligence solution designed and developed in collaboration between the database group of the University of Modena and Reggio Emilia and eBilling, an Italian SME supplier of solutions for the design, production and automation of documentary processes for top Italian companies. eLog enables business managers to define OLAP reports by means of a web interface and to customize analysis indicators adopting a simple meta-language. The framework translates the user's reports into MDX queries and is able to automatically select the data cube suitable for each query. Over 140 medium and large companies have exploited the technological services of eBilling S.p.A. to manage their documents flows. In particular, eLog services have been used by the major media and telecommunications Italian companies and their foreign annex, such as Sky, Media set, H3G, Tim Brazil etc. The largest customer can provide up to 30 millions mail pieces within 6 months (about 200 GB of data in the relational DBMS). In a period of 18 months, eLog could reach 150 millions mail pieces (1 TB of data) to handle.", "citation": "Citations (1)", "departments": ["University of Modena and Reggio Emilia", "University of Modena and Reggio Emilia", "University of Modena and Reggio Emilia", "University of Modena and Reggio Emilia", "eBilling S.p.A., Modena, Italy"], "authors": ["Sonia Bergamaschi.....http://dblp.org/pers/hd/b/Bergamaschi:Sonia", "Matteo Interlandi.....http://dblp.org/pers/hd/i/Interlandi:Matteo", "Mario Longo.....http://dblp.org/pers/hd/l/Longo:Mario", "Laura Po.....http://dblp.org/pers/hd/p/Po:Laura", "Maurizio Vincini.....http://dblp.org/pers/hd/v/Vincini:Maurizio"], "conf": "icde", "year": "2012", "pages": 12}