{"title": "Coding and replication co-design for interactive multiview video streaming.", "fields": [], "abstract": "Multiview video refers to the simultaneous capturing of multiple video views with an array of closely spaced cameras. In an interactive multiview video streaming (IMVS) system, a client can play back the content in time in a single view, and may observe a scene of interest by switching to different viewpoints. Users independently choose their own view navigation paths through the high-dimensional multiview data. Distributed servers are deployed to collaboratively replicate video content in order to support user scalability. Such a system typically presents challenges in both coding and content replication. In coding, the multiview video must be encoded in order to support efficient view-switching and distributed replication. In content replication, it is important to decide which data blocks to store at each server to facilitate view-switches at any time. In this paper, we co-design a coding structure and a distributed content replication strategy. First, we propose a coding structure based on redundant P-frames and distributed source coding (DSC) frames to achieve efficiency in coding, view switches and content replication. We then propose a heuristic-based distributed and cooperative replication strategy to take advantage of the correlation between the multiple views for resource-effective content delivery. Simulation results show that our coding and replication co-design is cost-effective in supporting IMVS services.", "citation": "Citations (18)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "National Institute of Informatics", "École Polytechnique Fédérale de Lausanne"], "authors": ["Huan Huang.....http://dblp.org/pers/hd/h/Huang:Huan", "Bo Zhang.....http://dblp.org/pers/hd/z/Zhang:Bo", "S.-H. Gary Chan.....http://dblp.org/pers/hd/c/Chan:S==H=_Gary", "Gene Cheung.....http://dblp.org/pers/hd/c/Cheung:Gene", "Pascal Frossard.....http://dblp.org/pers/hd/f/Frossard:Pascal"], "conf": "infocom", "year": "2012", "pages": 5}