{"title": "How Does Your Password Measure Up? The Effect of Strength Meters on Password Creation.", "fields": ["password", "password strength", "cognitive password", "meter", "usability"], "abstract": "To help users create stronger text-based passwords, many web sites have deployed password meters that provide visual feedback on password strength. Although these meters are in wide use, their effects on the security and usability of passwords have not been well studied.\n\nWe present a 2,931-subject study of password creation in the presence of 14 password meters. We found that meters with a variety of visual appearances led users to create longer passwords. However, significant increases in resistance to a password-cracking algorithm were only achieved using meters that scored passwords stringently. These stringent meters also led participants to include more digits, symbols, and uppercase letters.\n\nPassword meters also affected the act of password creation. Participants who saw stringent meters spent longer creating their password and were more likely to change their password while entering it, yet they were also more likely to find the password meter annoying. However, the most stringent meter and those without visual bars caused participants to place less importance on satisfying the meter. Participants who saw more lenient meters tried to fill the meter and were averse to choosing passwords a meter deemed \"bad\" or \"poor.\" Our findings can serve as guidelines for administrators seeking to nudge users towards stronger passwords.", "citation": "Citations (206)", "year": "2012", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "uss", "authors": ["Blase Ur.....http://dblp.org/pers/hd/u/Ur:Blase", "Patrick Gage Kelley.....http://dblp.org/pers/hd/k/Kelley:Patrick_Gage", "Saranga Komanduri.....http://dblp.org/pers/hd/k/Komanduri:Saranga", "Joel Lee.....http://dblp.org/pers/hd/l/Lee:Joel", "Michael Maass.....http://dblp.org/pers/hd/m/Maass:Michael", "Michelle L. Mazurek.....http://dblp.org/pers/hd/m/Mazurek:Michelle_L=", "Timothy Passaro.....http://dblp.org/pers/hd/p/Passaro:Timothy", "Richard Shay.....http://dblp.org/pers/hd/s/Shay:Richard", "Timothy Vidas.....http://dblp.org/pers/hd/v/Vidas:Timothy", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Nicolas Christin.....http://dblp.org/pers/hd/c/Christin:Nicolas", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith"], "pages": 16}