{"title": "Joint UFH and power control for effective wireless anti-jamming communication.", "fields": ["power control", "transmission delay", "frequency hopping spread spectrum", "power budget", "communication source"], "abstract": "Jamming-resistant communication without preshared secrets has received extensive attention recently and is commonly tackled by utilizing the technique of uncoordinated frequency hopping (UFH). However, existing approaches exhibit significant performance constraints due to the use of UFH at both the sender and the receiver sides. To improve the state of the art, in this paper we aim to significantly improve the performance of the anti-jamming system in the presence of a power-limited jammer. Specifically, we for the first time jointly consider UFH and power control and pose these two techniques into a uniform framework. The proposed approach utilizes online learning theory to determine both the hopping channels and the transmitting powers based on the history of channel status. By dividing the transmission power into multiple levels, the sender with a limited power budget is able to choose both the sending channels and the corresponding transmission power. The sender keeps refining its knowledge of channel status to improve future channel selection and power allocation based on the feedback information from the receiver. We analytically show that, in presence of a power-limited jammer, the average transmission delay of our system is bounded by equation with high probability. Extensive simulations are conducted to demonstrate the effectiveness of our scheme against various jamming attacks.", "citation": "Citations (11)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology"], "authors": ["Kaihe Xu.....http://dblp.org/pers/hd/x/Xu:Kaihe", "Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui"], "conf": "infocom", "year": "2012", "pages": 9}