{"title": "Learning hierarchical representations for face verification with convolutional deep belief networks.", "fields": ["boltzmann machine", "local binary patterns", "deep learning", "convolutional code", "convolutional deep belief networks"], "abstract": "Most modern face recognition systems rely on a feature representation given by a hand-crafted image descriptor, such as Local Binary Patterns (LBP), and achieve improved performance by combining several such representations. In this paper, we propose deep learning as a natural source for obtaining additional, complementary representations. To learn features in high-resolution images, we make use of convolutional deep belief networks. Moreover, to take advantage of global structure in an object class, we develop local convolutional restricted Boltzmann machines, a novel convolutional learning model that exploits the global structure by not assuming stationarity of features across the image, while maintaining scalability and robustness to small misalignments. We also present a novel application of deep learning to descriptors other than pixel intensity values, such as LBP. In addition, we compare performance of networks trained using unsupervised learning against networks with random filters, and empirically show that learning weights not only is necessary for obtaining good multilayer representations, but also provides robustness to the choice of the network architecture parameters. Finally, we show that a recognition system using only representations obtained from deep learning can achieve comparable accuracy with a system using a combination of hand-crafted image descriptors. Moreover, by combining these representations, we achieve state-of-the-art results on a real-world face verification database.", "citation": "Citations (300)", "year": "2012", "departments": ["University of Massachusetts Amherst", "University of Michigan", "University of Massachusetts Amherst"], "conf": "cvpr", "authors": ["Gary B. Huang.....http://dblp.org/pers/hd/h/Huang:Gary_B=", "Honglak Lee.....http://dblp.org/pers/hd/l/Lee:Honglak", "Erik G. Learned-Miller.....http://dblp.org/pers/hd/l/Learned=Miller:Erik_G="], "pages": 8}