{"title": "CPU-assisted GPGPU on fused CPU-GPU architectures.", "fields": ["uniform memory access", "cpu shielding", "cpu cache", "bogomips", "cpu modes"], "abstract": "This paper presents a novel approach to utilize the CPU resource to facilitate the execution of GPGPU programs on fused CPU-GPU architectures. In our model of fused architectures, the GPU and the CPU are integrated on the same die and share the on-chip L3 cache and off-chip memory, similar to the latest Intel Sandy Bridge and AMD accelerated processing unit (APU) platforms. In our proposed CPU-assisted GPGPU, after the CPU launches a GPU program, it executes a pre-execution program, which is generated automatically from the GPU kernel using our proposed compiler algorithms and contains memory access instructions of the GPU kernel for multiple thread-blocks. The CPU pre-execution program runs ahead of GPU threads because (1) the CPU pre-execution thread only contains memory fetch instructions from GPU kernels and not floating-point computations, and (2) the CPU runs at higher frequencies and exploits higher degrees of instruction-level parallelism than GPU scalar cores. We also leverage the prefetcher at the L2-cache on the CPU side to increase the memory traffic from CPU. As a result, the memory accesses of GPU threads hit in the L3 cache and their latency can be drastically reduced. Since our pre-execution is directly controlled by user-level applications, it enjoys both high accuracy and flexibility. Our experiments on a set of benchmarks show that our proposed pre-execution improves the performance by up to 113% and 21.4% on average.", "citation": "Citations (94)", "departments": ["North Carolina State University", "North Carolina State University", "Advanced Micro Devices", "North Carolina State University"], "authors": ["Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi", "Ping Xiang.....http://dblp.org/pers/hd/x/Xiang:Ping", "Mike Mantor.....http://dblp.org/pers/hd/m/Mantor:Mike", "Huiyang Zhou.....http://dblp.org/pers/hd/z/Zhou:Huiyang"], "conf": "hpca", "year": "2012", "pages": 12}