{"title": "Exploiting nonlocal spatiotemporal structure for video segmentation.", "fields": ["segmentation", "random variable", "conditional random field", "unary operation", "image texture"], "abstract": "Unsupervised video segmentation is a challenging problem because it involves a large amount of data, and image segments undergo noisy variations in color, texture and motion with time. However, there are significant redundancies that can help disambiguate the effects of noise. To exploit these redundancies and obtain the most spatio-temporally consistent video segmentation, we formulate the problem as a consistent labeling problem by exploiting higher order image structure. A label stands for a specific moving segment. Each segment (or region) is treated as a random variable which is to be assigned a label. Regions assigned the same label comprise a 3D space-time segment, or a region tube. The labels can also be automatically created or terminated at any frame in the video sequence, to allow objects entering or leaving the scene. To formulate this problem, we use the CRF (conditional random field) model. Unlike conventional CRF which has only unary and binary potentials, we also use higher order potentials to favor label consistency among disconnected spatial and temporal segments. Compared to region tracking based methods, the main advantages of the proposed algorithm are two fold: (1) the label consistency constraints are imposed on multiple regions but in a soft manner, and (2) the labeling decision is postponed until the confidence in the labeling is high. We compare our results with a recent state-of-the-art video segmentation algorithm and show that our results are quantitatively and qualitatively better.", "citation": "Citations (25)", "year": "2012", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "cvpr", "authors": ["Hsien-Ting (Tim) Cheng.....http://dblp.org/pers/hd/c/Cheng:Hsien=Ting_=Tim=", "Narendra Ahuja.....http://dblp.org/pers/hd/a/Ahuja:Narendra"], "pages": 8}