{"title": "On exploiting flow allocation with rate adaptation for green networking.", "fields": ["heuristic", "approximation algorithm", "optimization problem", "integer programming", "shortest path problem"], "abstract": "Network power consumption can be reduced considerably by adapting link data rates to their offered traffic loads. In this paper, we exploit how to leverage rate adaptation for green networking by studying the following flow allocation problem in wired networks: Given a set of candidate paths for each end-to-end communication session, determine how to allocate flow (data traffic) along these paths such that power consumption is minimized, subject to the constraint that the traffic demand of each session is satisfied. According to recent measurement studies, we consider a discrete step increasing function for link power consumption. We address both the single and multiple communication session cases and formulate them as two optimization problems, namely, the Single-session Flow allocation with Rate Adaptation Problem (SF-RAP), and the Multi-session Flow Allocation with Rate Adaptation Problem (MF-RAP). We first show that both problems are NP-hard and present a Mixed Integer Linear Programming (MILP) formulation for the MF-RAP to provide optimal solutions. Then we present a 2-approximation algorithm for the SF-RAP, and a general flow allocation framework as well as an LP-based heuristic algorithm for the MF-RAP. Simulation results show that the algorithm proposed for the SF-RAP consistently outperforms a shortest path based baseline solution and the algorithms proposed for the MF-RAP provide close-to-optimal solutions.", "citation": "Citations (7)", "departments": ["Syracuse University", "Montana State University", "Syracuse University", "Montana State University"], "authors": ["Jian Tang.....http://dblp.org/pers/hd/t/Tang_0008:Jian", "Brendan Mumey.....http://dblp.org/pers/hd/m/Mumey:Brendan", "Yun Xing.....http://dblp.org/pers/hd/x/Xing:Yun", "Andy Johnson.....http://dblp.org/pers/hd/j/Johnson:Andy"], "conf": "infocom", "year": "2012", "pages": 9}