{"title": "SmartAnalyzer: A noninvasive security threat analyzer for AMI smart grid.", "fields": ["computer security model", "security service", "security controls", "security policy", "smart grid"], "abstract": "The Advanced Metering Infrastructure (AMI) is the core component in smart grid that exhibits highly complex network configurations comprising of heterogeneous cyber-physical components. These components are interconnected through different communication media, protocols, and secure tunnels, and they are operated using different data delivery modes and security policies. The inherent complexity and heterogeneity in AMI significantly increase the potential of security threats due to misconfiguration or absence of defense, which may cause devastating damage to AMI. Therefore, there is a need of creating a formal model that can represent the global behavior of AMI configuration in order to verify the potential threats. In this paper, we present SmartAnalyzer, a formal security analysis tool, which offers manifold contributions: (i) formal modeling of AMI configuration including device configurations, topology, communication properties, interactions between the devices, data flows, and security properties; (ii) formal modeling of AMI invariant and user-driven constraints based on the interdependencies between AMI device configurations, security properties, and security control guidelines; (iii) verifying the AMI configuration's compliances with security constraints using Satisfiability Modulo Theory (SMT) solver; (iv) generating a comprehensive security threat report with possible remediation plan based on the verification results. The accuracy, scalability, and usability of the tool are evaluated on real smart grid environment and synthetic test networks.", "citation": "Citations (16)", "departments": ["University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "University of North Carolina at Charlotte"], "authors": ["Mohammad Ashiqur Rahman.....http://dblp.org/pers/hd/r/Rahman:Mohammad_Ashiqur", "Padmalochan Bera.....http://dblp.org/pers/hd/b/Bera:Padmalochan", "Ehab Al-Shaer.....http://dblp.org/pers/hd/a/Al=Shaer:Ehab"], "conf": "infocom", "year": "2012", "pages": 9}