{"title": "Distributed storage codes reduce latency in vehicular networks.", "fields": [], "abstract": "We investigate the benefits of distributed storage using erasure codes for file sharing in vehicular networks through both analysis and realistic trace-based simulations. We show that the key parameter affecting the on-demand file download latency is the ratio of file size to download bandwidth. When this ratio is small so that a file can be communicated in a single encounter, we find that coding techniques offer very little benefit over simple file replication. However, we analytically show that for large ratios, for a memoryless contact model, distributed erasure coding yields a latency benefit of $N/\\alpha$ over uncoded replication, where $N$ is the number of vehicles and $\\alpha$ the redundancy factor. Effectively, in this regime, coding yields the same performance as replicating all the files at all other vehicles, but using much less storage. We also evaluate the benefits of coded storage using large real vehicle traces of taxis in Beijing and buses in Chicago. These simulations, which include a realistic radio link quality model for a IEEE 802.11p dedicated short range communication (DSRC) radio, validate the observations from the analysis, demonstrating that coded storage dramatically speeds up the download of large files in vehicular networks.", "citation": "Citations (22)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "General Motors", "University of Southern California", "University of Southern California", "University of Southern California", "General Motors"], "authors": ["Maheswaran Sathiamoorthy.....http://dblp.org/pers/hd/s/Sathiamoorthy:Maheswaran", "Alexandros G. Dimakis.....http://dblp.org/pers/hd/d/Dimakis:Alexandros_G=", "Bhaskar Krishnamachari.....http://dblp.org/pers/hd/k/Krishnamachari:Bhaskar", "Fan Bai.....http://dblp.org/pers/hd/b/Bai:Fan"], "conf": "infocom", "year": "2012", "pages": 5}