{"title": "Adaptation of the concept hierarchy model with search logs for query recommendation on intranets.", "fields": ["rdf query language", "ranking", "web query classification", "sargable", "web search query"], "abstract": "A concept hierarchy created from a document collection can be used for query recommendation on Intranets by ranking terms according to the strength of their links to the query within the hierarchy. A major limitation is that this model produces the same recommendations for identical queries and rebuilding it from scratch periodically can be extremely inefficient due to the high computational costs. We propose to adapt the model by incorporating query refinements from search logs. Our intuition is that the concept hierarchy built from the collection and the search logs provide complementary conceptual views on the same search domain, and their integration should continually improve the effectiveness of recommended terms. Two adaptation approaches using query logs with and without click information are compared. We evaluate the concept hierarchy models (static and adapted versions) built from the Intranet collections of two academic institutions and compare them with a state-of-the-art log-based query recommender, the Query Flow Graph, built from the same logs. Our adaptive model significantly outperforms its static version and the query flow graph when tested over a period of time on data (documents and search logs) from two institutions' Intranets.", "citation": "Citations (8)", "departments": ["Robert Gordon University", "Open University", "University of Essex", "University of Essex", "Open University"], "authors": ["Ibrahim Adepoju Adeyanju.....http://dblp.org/pers/hd/a/Adeyanju:Ibrahim_Adepoju", "Dawei Song.....http://dblp.org/pers/hd/s/Song_0001:Dawei", "M-Dyaa Albakour.....http://dblp.org/pers/hd/a/Albakour:M=Dyaa", "Udo Kruschwitz.....http://dblp.org/pers/hd/k/Kruschwitz:Udo", "Anne N. De Roeck.....http://dblp.org/pers/hd/r/Roeck:Anne_N=_De", "Maria Fasli.....http://dblp.org/pers/hd/f/Fasli:Maria"], "conf": "sigir", "year": "2012", "pages": 10}