{"title": "A geometrical probability approach to location-critical network performance metrics.", "fields": ["random graph", "k nearest neighbors algorithm", "network performance", "network topology", "geometric probability"], "abstract": "Node locations and distances are of profound importance for the operation of any communication networks. With the fundamental inter-node distance captured in a random network, one can build probabilistic models for characterizing network performance metrics such as k-th nearest neighbor and traveling distances, as well as transmission power and path loss in wireless networks. For the first time in the literature, a unified approach is developed to obtain the closed-form distributions of inter-node distances associated with hexagons. This approach can be degenerated to elementary geometries such as squares and rectangles. By the formulation of a quadratic product, the proposed approach can characterize general statistical distances when node coordinates are interdependent. Hence, our approach applies to both elementary and complex geometric topologies, and the corresponding probabilistic distance models go beyond the approximations and Monte Carlo simulations. Analytical models based on hexagon distributions are applied to the analysis of the nearest neighbor distribution in a sparse network for improving energy efficiency, and the farthest neighbor distribution in a dense network for minimizing routing overhead. Both the models and simulations demonstrate the high accuracy and promising potentials of this approach, whereas the current best approximations are not applicable in many scenarios. This geometrical probability approach thus provides accurate information essential to the successful network protocol and system design.", "citation": "Citations (9)", "departments": ["University of Victoria", "University of Victoria"], "authors": ["Yanyan Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yanyan", "Jianping Pan.....http://dblp.org/pers/hd/p/Pan_0001:Jianping"], "conf": "infocom", "year": "2012", "pages": 9}