{"title": "Robust multi-source network tomography using selective probes.", "fields": ["unicast", "network packet", "network tomography", "multicast", "hop"], "abstract": "Knowledge of a network's topology and internal characteristics such as delay times or losses is crucial to maintain seamless operation of network services. Network tomography is a useful approach to infer such knowledge from end-to-end measurements between nodes at the periphery of the network, as it does not require cooperation of routers and other internal nodes. Most current tomography algorithms are single-source methods, which use multicast probes or synchronized unicast packet trains to measure covariances between destinations from a single vantage point and recover a tree topology from these measurements. Multi-source tomography, on the other hand, uses pairwise hop counts or latencies and consequently overcomes the difficulties associated with obtaining measurements for single-source methods. However, topology recovery is complicated by the fact that the paths along which measurements are taken do not form a tree in the network. Motivated by recent work suggesting that these measurements can be well-approximated by tree metrics, we present two algorithms that use selective pairwise distance measurements between peripheral nodes to construct a tree whose end-to-end distances approximate those in the network. Our first algorithm accommodates measurements perturbed by additive noise, while our second considers a novel noise model that captures missing measurements and the network's deviations from a tree topology. Both algorithms provably use O (p polylog p) pairwise measurements to construct a tree approximation on p end hosts. We present extensive simulated and real-world experiments to evaluate both of our algorithms.", "citation": "Citations (18)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Akshay Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Akshay", "Aarti Singh.....http://dblp.org/pers/hd/s/Singh:Aarti"], "conf": "infocom", "year": "2012", "pages": 9}