{"title": "Runtime monitoring of software energy hotspots.", "fields": ["green computing", "profiling", "file server", "multitier architecture", "java"], "abstract": "GreenIT has emerged as a discipline concerned with the optimization of software solutions with regards to their energy consumption. In this domain, most of the state-of-the-art solutions concentrate on coarse-grained approaches to monitor the energy consumption of a device or a process. However, none of the existing solutions addresses in-process energy monitoring to provide in-depth analysis of a process energy consumption. In this paper, we therefore report on a fine-grained runtime energy monitoring framework we developed to help developers to diagnose energy hotspots with a better accuracy than the state-of-the-art.     Concretely, our approach adopts a 2-layer architecture including OS-level and process-level energy monitoring. OS-level energy monitoring estimates the energy consumption of processes according to different hardware devices (CPU, network card). Process-level energy monitoring focuses on Java-based applications and builds on OS-level energy monitoring to provide an estimation of energy consumption at the granularity of classes and methods. We argue that this per-method analysis of energy consumption provides better insights to the application in order to identify potential energy hotspots. In particular, our preliminary validation demonstrates that we can monitor energy hotspots of Jetty web servers and monitor their variations under stress scenarios.", "citation": "Citations (22)", "year": "2012", "departments": ["university of lille", "university of lille", "university of lille", "Institut Universitaire de France"], "conf": "kbse", "authors": ["Adel Noureddine.....http://dblp.org/pers/hd/n/Noureddine:Adel", "Aurelien Bourdon.....http://dblp.org/pers/hd/b/Bourdon:Aurelien", "Romain Rouvoy.....http://dblp.org/pers/hd/r/Rouvoy:Romain", "Lionel Seinturier.....http://dblp.org/pers/hd/s/Seinturier:Lionel"], "pages": 10}