{"title": "SubFlow: Towards practical flow-level traffic classification.", "fields": ["network packet", "subspace topology", "bootstrapping", "profiling", "traffic classification"], "abstract": "Many research efforts propose the use of flow-level features (e.g., packet sizes and inter-arrival times) and machine learning algorithms to solve the traffic classification problem. However, these statistical methods have not made the anticipated impact in the real world. We attribute this to two main reasons: (a) training the classifiers and bootstrapping the system is cumbersome, (b) the resulting classifiers have limited ability to adapt gracefully as the traffic behavior changes. In this paper, we propose an approach that is easy to bootstrap and deploy, as well as robust to changes in the traffic, such as the emergence of new applications. The key novelty of our classifier is that it learns to identify the traffic of each application in isolation, instead of trying to distinguish one application from another. This is a very challenging task that hides many caveats and subtleties. To make this possible, we adapt and use subspace clustering, a powerful technique that has not been used before in this context. Subspace clustering allows the profiling of applications to be more precise by automatically eliminating irrelevant features. We show that our approach exhibits very high accuracy in classifying each application on five traces from different ISPs captured between 2005 and 2011. This new way of looking at application classification could generate powerful and practical solutions in the space of traffic monitoring and network management.", "citation": "Citations (51)", "departments": ["University of California, Riverside", "Narus", "Narus", "University of California, Riverside", "Narus"], "authors": ["Guowu Xie.....http://dblp.org/pers/hd/x/Xie:Guowu", "Marios Iliofotou.....http://dblp.org/pers/hd/i/Iliofotou:Marios", "Ram Keralapura.....http://dblp.org/pers/hd/k/Keralapura:Ram", "Michalis Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Michalis", "Antonio Nucci.....http://dblp.org/pers/hd/n/Nucci:Antonio"], "conf": "infocom", "year": "2012", "pages": 5}