{"title": "Weakly supervised sparse coding with geometric consistency pooling.", "fields": ["contextual image classification", "semantic similarity", "pooling", "neural coding", "fold"], "abstract": "Most recently the Bag-of-Features (BoF) representation has been well advocated for image search and classification, with two decent phases named sparse coding and max pooling to compensate quantization loss as well as inject spatial layouts. But still, much information has been discarded by quantizing local descriptors with two-dimensional layouts into a one-dimensional BoF histogram. In this paper, we revisit this popular “sparse coding + max pooling” paradigm by “looking around” the local descriptor context towards an optimal BoF. First, we introduce a Weakly supervised Sparse Coding (WSC) to exploit the Classemes-based attribute labeling to refine the descriptor coding procedure. It is achieved by learning an attribute-to-word co-occurrence prior to impose a label inconsistency distortion over the l 1  based coding regularizer, such that the descriptor codes can maximally preserve the image semantic similarity. Second, we propose an adaptive feature pooling scheme over “superpixels” rather than over fixed spatial pyramids, named Geometric Consistency Pooling (GCP). As an effect, local descriptors enjoying good geometric consistency are pooled together to ensure a more precise spatial layouts embedding in BoF. Both of our phases are unsupervised, which differ from the existing works in supervised dictionary learning, sparse coding and feature pooling. Therefore, our approach enables potential applications like scalable visual search. We evaluate in both image classification and search benchmarks and report good improvements over the state-of-the-arts.", "citation": "Citations (22)", "year": "2012", "departments": ["Columbia University", "Columbia University", "Tsinghua University", "Carnegie Mellon University", "University of Texas at San Antonio"], "conf": "cvpr", "authors": ["Liujuan Cao.....http://dblp.org/pers/hd/c/Cao:Liujuan", "Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Yue Gao.....http://dblp.org/pers/hd/g/Gao:Yue", "Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "pages": 8}