{"title": "Spectrum management and power allocation in MIMO cognitive networks.", "fields": ["precoding", "spatial multiplexing", "cognitive radio", "mimo", "cognitive network"], "abstract": "We consider the problem of maximizing the throughput of a multi-input multi-output (MIMO) cognitive radio (CR) network. CR users are assumed to share the available spectrum without disturbing primary radio (PR) transmissions. With spatial multiplexing performed over each frequency band, a multi-antenna CR node controls its antenna radiation patterns and allocates power for each data stream by appropriately adjusting its precoding matrix. Our objective is to design a set of precoding matrices (one for each band) at each CR node so that power and spectrum are optimally allocated for that node (in terms of throughput) and its interference is steered away from other CR and PR transmissions. In other words, the problems of power, spectrum and interference management are jointly investigated. We formulate a multi-carrier MIMO network throughput optimization problem subject to frequency-dependent power constraints. The problem is non-convex, with the number of variables growing quadratically with the number of antenna elements. Such a problem is difficult to solve, even in a centralized manner. To tackle it, we translate it into a noncooperative game and derive an optimal pricing policy for each node, which adapts to the node's neighboring conditions and drives the game to a Nash-Equilibrium (NE). The network throughput under this NE is at least equal to that of a locally optimal solution of the non-convex centralized problem. To find the set of precoding matrices at each node (the best response), a low-complexity distributed algorithm is developed by exploiting the strong duality of the per-user convex optimization problem. The number of variables in the distributed algorithm is independent of the number of antenna elements. A centralized (cooperative) algorithm is also developed, serving as a performance benchmark. Simulations show that the network throughput under the distributed algorithm converges rapidly to that of the centralized one. The fast convergence of the game facilitates MAC design, which we briefly discuss in the paper. The application of our results is not limited to CR systems, but extends to multi-carrier (e.g., OFDM) MIMO systems.", "citation": "Citations (16)", "departments": ["University of Arizona", "University of Arizona"], "authors": ["Diep N. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Diep_N=", "Marwan Krunz.....http://dblp.org/pers/hd/k/Krunz:Marwan"], "conf": "infocom", "year": "2012", "pages": 9}