{"title": "Analyzing the structure of the emergent division of labor in multiparty collaboration.", "fields": ["ubiquitous computing", "human computer interaction", "division of labour", "data collection", "nonverbal communication"], "abstract": "In our daily life, the interactive roles of leaders, followers, and coordinators tend to emerge from multiparty collaboration. The primary purpose of this study is to automatically predict the leading role in multiparty interaction by ubiquitous computing techniques. Even though the leading role has been predicted for an entire task, there has been little focus on evaluating how roles are reorganized during a task. To find the verbal and nonverbal cues that might predict roles, we asked neutral third parties to select the participant playing the leading role in an assembly task. We examined the correlation between behavioral data gathered during a task and third-party evaluations of the leading role player in terms of temporal alterations. The preliminary results suggest that task-oriented utterances and verification behaviors regarding progress status contribute to the prediction of the emerging and reorganized leader. Moreover, we discuss the implications of our findings for the design of applications that can enhance multiparty collaboration.", "citation": "Citations (1)", "departments": ["National Institute of Information and Communications Technology", "Osaka University", "National Institute of Information and Communications Technology", "National Institute of Information and Communications Technology", "National Institute of Information and Communications Technology"], "authors": ["Noriko Suzuki.....http://dblp.org/pers/hd/s/Suzuki:Noriko", "Tosirou Kamiya.....http://dblp.org/pers/hd/k/Kamiya:Tosirou", "Ichiro Umata.....http://dblp.org/pers/hd/u/Umata:Ichiro", "Sadanori Ito.....http://dblp.org/pers/hd/i/Ito:Sadanori", "Shoichiro Iwasawa.....http://dblp.org/pers/hd/i/Iwasawa:Shoichiro"], "conf": "cscw", "year": "2012", "pages": 4}