{"title": "Robust visual tracking via multi-task sparse learning.", "fields": ["bittorrent tracker", "eye tracking", "special case", "linear combination", "video tracking"], "abstract": "In this paper, we formulate object tracking in a particle filter framework as a multi-task sparse learning problem, which we denote as Multi-Task Tracking (MTT). Since we model particles as linear combinations of dictionary templates that are updated dynamically, learning the representation of each particle is considered a single task in MTT. By employing popular sparsity-inducing l p, q  mixed norms (p Є {2, ∞} and q = 1), we regularize the representation problem to enforce joint sparsity and learn the particle representations together. As compared to previous methods that handle particles independently, our results demonstrate that mining the interdependencies between particles improves tracking performance and overall computational complexity. Interestingly, we show that the popular L 1  tracker [15] is a special case of our MTT formulation (denoted as the L 11  tracker) when p = q = 1. The learning problem can be efficiently solved using an Accelerated Proximal Gradient (APG) method that yields a sequence of closed form updates. As such, MTT is computationally attractive. We test our proposed approach on challenging sequences involving heavy occlusion, drastic illumination changes, and large pose variations. Experimental results show that MTT methods consistently outperform state-of-the-art trackers.", "citation": "Citations (610)", "year": "2012", "departments": ["Chinese Academy of Sciences", "Advanced Digita ... nois, Singapore", "Advanced Digita ... nois, Singapore", "Advanced Digita ... nois, Singapore"], "conf": "cvpr", "authors": ["Tianzhu Zhang.....http://dblp.org/pers/hd/z/Zhang:Tianzhu", "Bernard Ghanem.....http://dblp.org/pers/hd/g/Ghanem:Bernard", "Si Liu.....http://dblp.org/pers/hd/l/Liu_0001:Si", "Narendra Ahuja.....http://dblp.org/pers/hd/a/Ahuja:Narendra"], "pages": 8}