{"title": "Efficient state merging in symbolic execution.", "fields": ["symbolic execution", "solver", "speedup", "merge", "experimental data", "symbolic trajectory evaluation", "concolic testing", "theoretical computer science"], "abstract": "Symbolic execution has proven to be a practical technique for building automated test case generation and bug finding tools. Nevertheless, due to state explosion, these tools still struggle to achieve scalability. Given a program, one way to reduce the number of states that the tools need to explore is to merge states obtained on different paths. Alas, doing so increases the size of symbolic path conditions (thereby stressing the underlying constraint solver) and interferes with optimizations of the exploration process (also referred to as search strategies). The net effect is that state merging may actually lower performance rather than increase it.   We present a way to automatically choose when and how to merge states such that the performance of symbolic execution is significantly increased. First, we present  query count estimation , a method for statically estimating the impact that each symbolic variable has on solver queries that follow a potential merge point; states are then merged only when doing so promises to be advantageous. Second, we present  dynamic state merging , a technique for merging states that interacts favorably with search strategies in automated test case generation and bug finding tools.   Experiments on the 96 GNU Coreutils show that our approach consistently achieves several orders of magnitude speedup over previously published results. Our code and experimental data are publicly available at http://cloud9.epfl.ch.", "citation": "Not cited", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Volodymyr Kuznetsov.....http://dblp.org/pers/hd/k/Kuznetsov:Volodymyr", "Johannes Kinder.....http://dblp.org/pers/hd/k/Kinder:Johannes", "Stefan Bucur.....http://dblp.org/pers/hd/b/Bucur:Stefan", "George Candea.....http://dblp.org/pers/hd/c/Candea:George"], "conf": "pldi", "year": "2012", "pages": 12}