{"title": "Pseudorandom generators with long stretch and low locality from random local one-way functions.", "fields": ["pseudorandom generators for polynomials", "inverse", "one way function", "pseudorandomness", "pseudorandom number generator", "sublinear function", "small number", "constraint graph", "pseudorandom generator theorem"], "abstract": "We continue the study of  locally-computable  pseudorandom generators (PRG) G:{0,1} n  -> {0,1} m  that each of their outputs depend on a small number of d input bits. While it is known that such generators are likely to exist for the case of small sub-linear stretch m=n+n 1-δ , it is less clear whether achieving larger stretch such as m=n+Ω(n), or even m=n 1+δ  is possible. The existence of such PRGs, which was posed as an open question in previous works, has recently gained an additional motivation due to several interesting applications. We make progress towards resolving this question by obtaining several local constructions based on the one-wayness of \"random\" local functions -- a variant of an assumption made by Goldreich (ECCC 2000). Specifically, we construct collections of PRGs with the following parameters: 1. Linear stretch m=n+Ω(n) and constant locality d=O(1). 2. Polynomial stretch m=n 1+δ  and  any  (arbitrarily slowly growing) super-constant locality d=ω(1), e.g., log*n. 3. Polynomial stretch m=n 1+δ , constant locality d=O(1), and inverse polynomial distinguishing advantage (as opposed to the standard case of n -ω(1) ).   As an additional contribution, we show that our constructions give rise to strong inapproximability results for the densest-subgraph problem in d-uniform hypergraphs for constant d. This allows us to improve the previous bounds of Feige (STOC 2002) and Khot (FOCS 2004) from constant inapproximability factor to n e -inapproximability, at the expense of relying on stronger assumptions.", "citation": "Citations (57)", "year": "2012", "departments": ["Tel Aviv University"], "conf": "stoc", "authors": ["Benny Applebaum.....http://dblp.org/pers/hd/a/Applebaum:Benny"], "pages": 12}