{"title": "Distinguishing users with capacitive touch communication.", "fields": ["firmware", "capacitive sensing", "exploit", "swipe", "touchscreen"], "abstract": "As we are surrounded by an ever-larger variety of post-PC devices, the traditional methods for identifying and authenticating users have become cumbersome and time-consuming. In this paper, we present a capacitive communication method through which a device can recognize who is interacting with it. This method exploits the capacitive touchscreens, which are now used in laptops, phones, and tablets, as a signal receiver. The signal that identifies the user can be generated by a small transmitter embedded into a ring, watch, or other artifact carried on the human body. We explore two example system designs with a low-power continuous transmitter that communicates through the skin and a signet ring that needs to be touched to the screen. Experiments with our prototype transmitter and tablet receiver show that capacitive communication through a touchscreen is possible, even without hardware or firmware modifications on a receiver. This latter approach imposes severe limits on the data rate, but the rate is sufficient for differentiating users in multiplayer tablet games or parental control applications. Controlled experiments with a signal generator also indicate that future designs may be able to achieve datarates that are useful for providing less obtrusive authentication with similar assurance as PIN codes or swipe patterns commonly used on smartphones today.", "citation": "Citations (40)", "departments": ["Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University"], "authors": ["Tam Vu.....http://dblp.org/pers/hd/v/Vu:Tam", "Akash Baid.....http://dblp.org/pers/hd/b/Baid:Akash", "Simon Gao.....http://dblp.org/pers/hd/g/Gao:Simon", "Marco Gruteser.....http://dblp.org/pers/hd/g/Gruteser:Marco", "Richard E. Howard.....http://dblp.org/pers/hd/h/Howard:Richard_E=", "Janne Lindqvist.....http://dblp.org/pers/hd/l/Lindqvist:Janne", "Predrag Spasojevic.....http://dblp.org/pers/hd/s/Spasojevic:Predrag", "Jeffrey Walling.....http://dblp.org/pers/hd/w/Walling:Jeffrey"], "conf": "mobicom", "year": "2012", "pages": 12}