{"title": "CommunitySourcing: engaging local crowds to perform expert work via physical kiosks.", "fields": ["crowdsourcing", "crowds", "touchscreen", "interactive kiosk", "computer supported cooperative work"], "abstract": "Online labor markets, such as Amazon's Mechanical Turk, have been used to crowdsource simple, short tasks like image labeling and transcription. However, expert knowledge is often lacking in such markets, making it impossible to complete certain classes of tasks. In this work we introduce an alternative mechanism for crowdsourcing tasks that require specialized knowledge or skill: communitysourcing --- the use of physical kiosks to elicit work from specific populations. We investigate the potential of communitysourcing by designing, implementing and evaluating Umati: the communitysourcing vending machine. Umati allows users to earn credits by performing tasks using a touchscreen attached to the machine. Physical rewards (in this case, snacks) are dispensed through traditional vending mechanics. We evaluated whether communitysourcing can accomplish expert work by using Umati to grade Computer Science exams. We placed Umati in a university Computer Science building, targeting students with grading tasks for snacks. Over one week, 328 unique users (302 of whom were students) completed 7771 tasks (7240 by students). 80% of users had never participated in a crowdsourcing market before. We found that Umati was able to grade exams with 2% higher accuracy (at the same price) or at 33% lower cost (at equivalent accuracy) than traditional single-expert grading. Mechanical Turk workers had no success grading the same exams. These results indicate that communitysourcing can successfully elicit high-quality expert work from specific communities.", "citation": "Citations (93)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["Kurtis Heimerl.....http://dblp.org/pers/hd/h/Heimerl:Kurtis", "Brian Gawalt.....http://dblp.org/pers/hd/g/Gawalt:Brian", "Kuang Chen.....http://dblp.org/pers/hd/c/Chen:Kuang", "Tapan S. Parikh.....http://dblp.org/pers/hd/p/Parikh:Tapan_S=", "Björn Hartmann.....http://dblp.org/pers/hd/h/Hartmann:Bj=ouml=rn"], "conf": "chi", "year": "2012", "pages": 10}