{"title": "Are you cool enough for Texas Hold'Em Poker?", "fields": ["subliminal stimuli", "computer science", "luck", "simulation", "texas hold em"], "abstract": "Experienced poker players have the ability to suppress and hide emotions and reactions to avoid providing information about the quality of the dealt private cards and the own probability of winning to the adversaries. Besides unswayable luck and bravery, bluffing is the only skill that could massively improve the own chance of winning. This paper investigates whether a subliminal reaction in terms of changing facial surface skin temperature can be linked to the quality of the dealt private cards (i.e., the probability of winning the actual hand). Therefore, a dataset containing thermal imaging has been recorded during a No Limit Texas Hold'Em Poker tournament-session with six players in total and two players being observed with a high-resolution thermal imaging camera and manual provision of their dealt private cards as ground-truth. Preliminary results show that the facial skin temperature varies massively (±1.2°C), which constitutes the research hypothesis that a significant change in the surface face skin temperature can be linked to the quality of the dealt cards in terms of winning chance for an actually played hand.", "citation": "Citations (2)", "departments": ["University of L ... , Linz, Austria", "University of L ... , Linz, Austria", "University of L ... , Linz, Austria", "University of L ... , Linz, Austria", "University of L ... , Linz, Austria"], "authors": ["Marc Kurz.....http://dblp.org/pers/hd/k/Kurz:Marc", "Gerold Hölzl.....http://dblp.org/pers/hd/h/H=ouml=lzl:Gerold", "Andreas Riener.....http://dblp.org/pers/hd/r/Riener:Andreas", "Bernhard Anzengruber.....http://dblp.org/pers/hd/a/Anzengruber:Bernhard", "Thomas Schmittner.....http://dblp.org/pers/hd/s/Schmittner:Thomas", "Alois Ferscha.....http://dblp.org/pers/hd/f/Ferscha:Alois"], "conf": "huc", "year": "2012", "pages": 5}