{"title": "SageShift: Managing SLAs for highly consolidated cloud.", "fields": ["service level agreement", "hypervisor", "dynamic priority scheduling", "virtual machine", "response time"], "abstract": "Maximizing consolidation ratio, the number of virtual machines (VMs) in a physical machine, without violating customers' SLAs is an important goal in the cloud. We show that it is difficult to achieve this goal with existing hypervisor schedulers. The schedulers control only the amount of resource allocation, but not the sequence of VM execution. This sequence can significantly impact the response time when requests arrive concurrently for the VMs sharing the same CPU. We find that the response time can increase as much as 100% for every additional VM in the system, even if the utilization does not exceed the maximum capacity. Therefore, existing schedulers have to reduce the consolidation ratio to meet SLAs. Previous resource-provisioning works rely on existing schedulers that cannot guarantee SLAs without reducing the consolidation ratio. We propose SageShift, a system that can achieve SLAs without penalizing the consolidation ratio. SageShift consists of a VM admission control - Sage, and a hypervisor scheduler - Shift. To admit a VM, Sage assesses feasibility of its SLA based on the patterns of incoming requests. Shift maintains the admitted SLAs by adjusting both the amount of resource allocation and the sequence of VM execution. The dynamic adjustment is based on the observed response time and the SLAs. We modify the KVM scheduler in Linux kernel to implement Shift. We show that Shift can improve the consolidation ratio by 66% without compromising the SLAs. Under bursty incoming requests, Shift maintains all SLAs within 3% of the percentile target. But existing schedulers in VMware ESXi, Xen and KVM fail to meet one or more SLAs with up to 33% below the percentile target. Shift is also work-conserving. It allows best-effort VMs to run in the background in order to maximize hardware utilization without impacting SLAs.", "citation": "Citations (20)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Orathai Sukwong.....http://dblp.org/pers/hd/s/Sukwong:Orathai", "Akkarit Sangpetch.....http://dblp.org/pers/hd/s/Sangpetch:Akkarit", "Hyong S. Kim.....http://dblp.org/pers/hd/k/Kim:Hyong_S="], "conf": "infocom", "year": "2012", "pages": 9}