{"title": "Self-motion illusions (vection) in VR - Are they good for anything?", "fields": ["learning object", "spatial cognition", "virtual reality", "perception", "illusion"], "abstract": "When we locomote through real or virtual environments, self-to-object relationships constantly change. Nevertheless, in real environments we effortlessly maintain an ongoing awareness of roughly where we are with respect to our immediate surrounds, even in the absence of any direct perceptual support (e.g., in darkness or with eyes closed). In virtual environments, however, we tend to get lost far more easily. Why is that? Research suggests that physical motion cues are critical in facilitating this “automatic spatial updating” of the self-to-surround relationships during perspective changes. However, allowing for full physical motion in VR is costly and often unfeasible. Here, we demonstrated for the first time that the mere illusion of self-motion (“circular vection”) can provide a similar benefit as actual self-motion: While blindfolded, participants were asked to imagine facing new perspectives in a well-learned room, and point to previously-learned objects. As expected, this task was difficult when participants could not physically rotate to the instructed perspective. Performance was significantly improved, however, when they perceived illusory self-rotation to the novel perspective (even though they did not physically move). This circular vection was induced by a combination of rotating sound fields (“auditory vection”) and biomechanical vection from stepping along a carrousel-like rotating floor platter. In summary, illusory self-motion was shown to indeed facilitate perspective switches and thus spatial orientation. These findings have important implications for both our understanding of human spatial cognition and the design of more effective yet affordable VR simulators. In fact, it might ultimately enable us to relax the need for physical motion in VR by intelligently utilizing self-motion illusions.", "citation": "Citations (14)", "departments": ["Simon Fraser University", "Simon Fraser University", "Vanderbilt University", "Vanderbilt University"], "authors": ["Bernhard E. Riecke.....http://dblp.org/pers/hd/r/Riecke:Bernhard_E=", "Daniel Feuereissen.....http://dblp.org/pers/hd/f/Feuereissen:Daniel", "John J. Rieser.....http://dblp.org/pers/hd/r/Rieser:John_J=", "Timothy P. McNamara.....http://dblp.org/pers/hd/m/McNamara:Timothy_P="], "conf": "vr", "year": "2012", "pages": 4}