{"title": "InfoGather: entity augmentation and attribute discovery by holistic matching with web tables.", "fields": ["pagerank", "named entity", "preprocessor", "data integration", "web application"], "abstract": "The Web contains a vast corpus of HTML tables, specifically entity attribute tables. We present three core operations, namely entity augmentation by attribute name, entity augmentation by example and attribute discovery, that are useful for \"information gathering\" tasks (e.g., researching for products or stocks). We propose to use web table corpus to perform them automatically. We require the operations to have high precision and coverage, have fast (ideally interactive) response times and be applicable to any arbitrary domain of entities. The naive approach that attempts to directly match the user input with the web tables suffers from poor precision and coverage.   Our key insight is that we can achieve much higher precision and coverage by considering indirectly matching tables in addition to the directly matching ones. The challenge is to be robust to spuriously matched tables: we address it by developing a holistic matching framework based on topic sensitive pagerank and an augmentation framework that aggregates predictions from multiple matched tables. We propose a novel architecture that leverages preprocessing in MapReduce to achieve extremely fast response times at query time. Our experiments on real-life datasets and 573M web tables show that our approach has (i) significantly higher precision and coverage and (ii) four orders of magnitude faster response times compared with the state-of-the-art approach.", "citation": "Citations (120)", "year": "2012", "departments": ["Purdue University", "Microsoft", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Mohamed Yakout.....http://dblp.org/pers/hd/y/Yakout:Mohamed", "Kris Ganjam.....http://dblp.org/pers/hd/g/Ganjam:Kris", "Kaushik Chakrabarti.....http://dblp.org/pers/hd/c/Chakrabarti:Kaushik", "Surajit Chaudhuri.....http://dblp.org/pers/hd/c/Chaudhuri:Surajit"], "pages": 12}