{"title": "Characterizing Multi-Agent Team Behavior from Partial Team Tracings: Evidence from the English Premier League.", "fields": ["league", "discretization", "predictability", "strengths and weaknesses", "simulation"], "abstract": "Real-world AI systems have been recently deployed which can automatically analyze the plan and tactics of tennis players. As the game-state is updated regularly at short intervals (i.e. point-level), a library of successful and unsuccessful plans of a player can be learnt over time. Given the relative strengths and weaknesses of a player’s plans, a set of proven plans or tactics from the library that characterize a player can be identified. For low-scoring, continuous team sports like soccer, such analysis for multi-agent teams does not exist as the game is not segmented into “discretized” plays (i.e. plans), making it difficult to obtain a library that characterizes a team’s behavior. Additionally, as player tracking data is costly and difficult to obtain, we only have partial team tracings in the form of ball actions which makes this problem even more difficult. In this paper, we propose a method to overcome these issues by representing team behavior via play-segments, which are spatio-temporal descriptions of ball movement over fixed windows of time. Using these representations we can characterize team behavior from entropy maps, which give a measure of predictability of team behaviors across the field. We show the efficacy and applicability of our method on the 2010-2011 English Premier League soccer data.", "citation": "Citations (14)", "departments": ["Disney Research", "Queensland University of Technology", "Disney Research", "Disney Research", "Disney Research"], "authors": ["Patrick Lucey.....http://dblp.org/pers/hd/l/Lucey:Patrick", "Alina Bialkowski.....http://dblp.org/pers/hd/b/Bialkowski:Alina", "Peter Carr.....http://dblp.org/pers/hd/c/Carr_0001:Peter", "Eric Foote.....http://dblp.org/pers/hd/f/Foote:Eric", "Iain A. Matthews.....http://dblp.org/pers/hd/m/Matthews:Iain_A="], "conf": "aaai", "year": "2012", "pages": -1}