{"title": "Horizontal Reduction: Instance-Level Dimensionality Reduction for Similarity Search in Large Document Databases.", "fields": ["bitmap", "search algorithm", "curse of dimensionality", "dimensionality reduction", "nearest neighbor search"], "abstract": "Dimensionality reduction is essential in text mining since the dimensionality of text documents could easily reach several tens of thousands. Most recent efforts on dimensionality reduction, however, are not adequate to large document databases due to lack of scalability. We hence propose a new type of simple but effective dimensionality reduction, called horizontal (dimensionality) reduction, for large document databases. Horizontal reduction converts each text document to a few bitmap vectors and provides tight lower bounds of inter-document distances using those bitmap vectors. Bitmap representation is very simple and extremely fast, and its instance-based nature makes it suitable for large and dynamic document databases. Using the proposed horizontal reduction, we develop an efficient k-nearest neighbor (k-NN) search algorithm for text mining such as classification and clustering, and we formally prove its correctness. The proposed algorithm decreases I/O and CPU overheads simultaneously since horizontal reduction (1) reduces the number of accesses to documents significantly by exploiting the bitmap-based lower bounds in filtering dissimilar documents at an early stage, and accordingly, (2) decreases the number of CPU-intensive computations for obtaining a real distance between high-dimensional document vectors. Extensive experimental results show that horizontal reduction improves the performance of the reduction (preprocessing) process by one to two orders of magnitude compared with existing reduction techniques, and our k-NN search algorithm significantly outperforms the existing ones by one to three orders of magnitude.", "citation": "Citations (6)", "departments": ["KAIST", "KAIST", "Kangwon National University"], "authors": ["Min Soo Kim.....http://dblp.org/pers/hd/k/Kim_0001:Min_Soo", "Kyu-Young Whang.....http://dblp.org/pers/hd/w/Whang:Kyu=Young", "Yang-Sae Moon.....http://dblp.org/pers/hd/m/Moon:Yang=Sae"], "conf": "icde", "year": "2012", "pages": 12}