{"title": "Querying Uncertain Spatio-Temporal Data.", "fields": ["probabilistic logic", "timestamp", "snapshot", "temporal database", "uncertain data"], "abstract": "The problem of modeling and managing uncertain data has received a great deal of interest, due to its manifold applications in spatial, temporal, multimedia and sensor databases. There exists a wide range of work covering spatial uncertainty in the static (snapshot) case, where only one point of time is considered. In contrast, the problem of modeling and querying uncertain spatio-temporal data has only been treated as a simple extension of the spatial case, disregarding time dependencies between consecutive timestamps. In this work, we present a framework for efficiently modeling and querying uncertain spatio-temporal data. The key idea of our approach is to model possible object trajectories by stochastic processes. This approach has three major advantages over previous work. First it allows answering queries in accordance with the possible worlds model. Second, dependencies between object locations at consecutive points in time are taken into account. And third it is possible to reduce all queries on this model to simple matrix multiplications. Based on these concepts we propose efficient solutions for different probabilistic spatio-temporal queries. In an experimental evaluation we show that our approaches are several order of magnitudes faster than state-of-the-art competitors.", "citation": "Citations (64)", "departments": ["Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "University of Hong Kong", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich"], "authors": ["Tobias Emrich.....http://dblp.org/pers/hd/e/Emrich:Tobias", "Hans-Peter Kriegel.....http://dblp.org/pers/hd/k/Kriegel:Hans=Peter", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos", "Matthias Renz.....http://dblp.org/pers/hd/r/Renz:Matthias", "Andreas Züfle.....http://dblp.org/pers/hd/z/Z=uuml=fle:Andreas"], "conf": "icde", "year": "2012", "pages": 12}