{"title": "Spatiotemporal Aquatic Field Reconstruction Using Robotic Sensor Swarm.", "fields": ["signal reconstruction", "swarm behaviour", "system dynamics", "mobile robot", "rendezvous"], "abstract": "Monitoring important aquatic processes like harmful algal blooms is of increasing interest to public health, ecosystem sustainability, marine biology, and aquaculture industry. This paper presents a novel approach to spatiotemporal aquatic field reconstruction using inexpensive, low-power, mobile sensing platforms called robotic fish. Robotic fish networks are a typical example of Cyber-Physical Systems where the design of cyber components (sensing, communication, and information processing) must account for inherent physical dynamics of the robots and the aquatic environment. Our approach features a rendezvous-based mobility control scheme where robotic fish collaborate in the form of a swarm to sense the aquatic environment in a series of carefully chosen rendezvous regions. We design a novel feedback control algorithm that maintains the desirable level of wireless connectivity for a sensor swarm in the presence of significant environment and system dynamics. Information-theoretic analysis is used to guide the selection of rendezvous regions so that the spatiotemporal field reconstruction accuracy is maximized subject to the limited sensor mobility. The effectiveness of our approach is validated via implementation on sensor hardware and extensive simulations based on real data traces of water surface temperature field and on-water ZigBee wireless communication.", "citation": "Citations (11)", "year": "2012", "departments": ["Michigan State University", "Michigan State University", "Michigan State University", "Michigan State University", "Michigan State University"], "conf": "rtss", "authors": ["Yu Wang.....http://dblp.org/pers/hd/w/Wang_0020:Yu", "Rui Tan.....http://dblp.org/pers/hd/t/Tan:Rui", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Xiaobo Tan.....http://dblp.org/pers/hd/t/Tan:Xiaobo", "Jianxun Wang.....http://dblp.org/pers/hd/w/Wang:Jianxun", "Ruogu Zhou.....http://dblp.org/pers/hd/z/Zhou:Ruogu"], "pages": 10}