{"title": "Cognos: crowdsourcing search for topic experts in microblogs.", "fields": ["crowdsourcing", "crowds", "software deployment", "microblogging", "social media"], "abstract": "Finding topic experts on microblogging sites with millions of users, such as Twitter, is a hard and challenging problem. In this paper, we propose and investigate a new methodology for discovering topic experts in the popular Twitter social network. Our methodology relies on the wisdom of the Twitter crowds -- it leverages Twitter Lists, which are often carefully curated by individual users to include experts on topics that interest them and whose meta-data (List names and descriptions) provides valuable semantic cues to the experts' domain of expertise. We mined List information to build Cognos, a system for finding topic experts in Twitter. Detailed experimental evaluation based on a real-world deployment shows that: (a) Cognos infers a user's expertise more accurately and comprehensively than state-of-the-art systems that rely on the user's bio or tweet content, (b) Cognos scales well due to built-in mechanisms to efficiently update its experts' database with new users, and (c) Despite relying only on a single feature, namely crowdsourced Lists, Cognos yields results comparable to, if not better than, those given by the official Twitter experts search engine for a wide range of queries in user tests. Our study highlights Lists as a potentially valuable source of information for future content or expert search systems in Twitter.", "citation": "Citations (185)", "departments": ["Indian Institute of Technology Kharagpur", "Indian Institute of Technology Kharagpur", "Indian Institute of Technology Kharagpur", "Max Planck Society", "Federal Univers ... o Preto, Brazil"], "authors": ["Saptarshi Ghosh.....http://dblp.org/pers/hd/g/Ghosh:Saptarshi", "Naveen Kumar Sharma.....http://dblp.org/pers/hd/s/Sharma:Naveen_Kumar", "Fabrício Benevenuto.....http://dblp.org/pers/hd/b/Benevenuto:Fabr=iacute=cio", "Niloy Ganguly.....http://dblp.org/pers/hd/g/Ganguly:Niloy", "P. Krishna Gummadi.....http://dblp.org/pers/hd/g/Gummadi:P=_Krishna"], "conf": "sigir", "year": "2012", "pages": 16}