{"title": "Folded codes from function field towers and improved optimal rate list decoding.", "fields": ["list decoding", "combinatorics", "reed solomon error correction", "sequential decoding", "function field", "hermitian function", "discrete mathematics", "expander code"], "abstract": "We give a new construction of algebraic codes which are efficiently list decodable from a fraction 1-R-e of adversarial errors where R is the rate of the code, for any desired positive constant e. The worst-case list size output by the algorithm is O(1/e), matching the existential bound for random codes up to constant factors. Further, the alphabet size of the codes is a constant depending only on e --- it can be made exp(~O(1/e 2 )) which is not much worse than the non-constructive exp(1/e) bound of random codes. The code construction is Monte Carlo and has the claimed list decoding property with high probability. Once the code is (efficiently) sampled, the encoding/decoding algorithms are deterministic with a running time O e (N c ) for an absolute constant $c$, where N is the code's block length. Our construction is based on a careful combination of a linear-algebraic approach to list decoding folded codes from towers of function fields, with a special form of subspace-evasive sets. Instantiating this with the explicit \"asymptotically good\" Garcia-Stichtenoth (GS for short) tower of function fields yields the above parameters. To illustrate the method in a simpler setting, we also present a construction based on Hermitian function fields, which offers similar guarantees with a list-size and alphabet size polylogarithmic in the block length N.   In comparison, algebraic codes achieving the optimal trade-off between list decodability and rate based on folded Reed-Solomon codes have a decoding complexity of N Ω(1/e) , an alphabet size of N Ω(1/e 2 ) , and a list size of O(1/e 2 ) (even after combination with subspace-evasive sets). Thus we get an improvement over the previous best bounds in all three aspects simultaneously, and are quite close to the existential random coding bounds. Along the way, we shed light on how to use automorphisms of certain function fields to enable list decoding of the folded version of the associated algebraic-geometric codes.", "citation": "Citations (20)", "year": "2012", "departments": ["Carnegie Mellon University", "Nanyang Technological University"], "conf": "stoc", "authors": ["Venkatesan Guruswami.....http://dblp.org/pers/hd/g/Guruswami:Venkatesan", "Chaoping Xing.....http://dblp.org/pers/hd/x/Xing:Chaoping"], "pages": 12}