{"title": "A Multivariate Complexity Analysis of Lobbying in Multiple Referenda.", "fields": ["logical matrix", "greedy algorithm", "complexity class", "preprocessor", "binary number", "parameterized complexity", "row"], "abstract": "Assume that each of n voters may or may not approve each of m issues. If an agent (the lobby) may influence up to k voters, then the central question of the NP-hard LOBBYING problem is whether the lobby can choose the voters to be influenced so that as a result each issue gets a majority of approvals. This problem can be modeled as a simple matrix modification problem: Can one replace k rows of a binary n×m-matrix by k all-1 rows such that each column in the resulting matrix has a majority of 1s? Significantly extending on previous work that showed parameterized intractability (W[2]-completeness) with respect to the number k of modified rows, we study how natural parameters such as n, m, k, or the \"maximum number of 1s missing for any column to have a majority of 1s\" (referred to as \"gap value g\") govern the computational complexity of LOBBYING. Among other results, we prove that LOBBYING is fixed-parameter tractable for parameter m and provide a greedy logarithmic-factor approximation algorithm which solves LOBBYING even optimally if m ≤ 4. We also show empirically that this greedy algorithm performs well on general instances. As a further key result, we prove that LOBBYING is LOGSNP-complete for constant values g ≥ 1, thus providing a first natural complete problem from voting for this complexity class of limited nondeterminism.", "citation": "Citations (13)", "departments": ["Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Saarland University"], "authors": ["Robert Bredereck.....http://dblp.org/pers/hd/b/Bredereck:Robert", "Jiehua Chen.....http://dblp.org/pers/hd/c/Chen:Jiehua", "Sepp Hartung.....http://dblp.org/pers/hd/h/Hartung:Sepp", "Rolf Niedermeier.....http://dblp.org/pers/hd/n/Niedermeier:Rolf", "Ondrej Suchý.....http://dblp.org/pers/hd/s/Such=yacute=:Ondrej", "Stefan Kratsch.....http://dblp.org/pers/hd/k/Kratsch:Stefan"], "conf": "aaai", "year": "2012", "pages": -1}