{"title": "Sherlock is around: Detecting network failures with local evidence fusion.", "fields": ["dempster shafer theory", "key distribution in wireless sensor networks", "sensor node", "mobile wireless sensor network", "sink", "testbed", "soft sensor"], "abstract": "Traditional approaches for wireless sensor network diagnosis are mainly sink-based. They actively collect global evidences from sensor nodes to the sink so as to conduct centralized analysis at the powerful back-end. On the one hand, long distance proactive information retrieval incurs huge transmission overhead; On the other hand, due to the coupling effect between diagnosis component and the application itself, sink often fails to obtain complete and precise evidences from the network, especially for the problematic or critical parts. To avoid large overhead in evidence collection process, self-diagnosis injects fault inference modules into sensor nodes and let them make local decisions. Diagnosis results from single nodes, however, are generally inaccurate due to the narrow scope of system performances. Besides, existing self-diagnosis methods usually lead to inconsistent results from different inference processes. How to balance the workload among the sensor nodes in a diagnosis task is a critical issue. In this work, we present a new in-network diagnosis approach named Local-Diagnosis (LD2), which conducts the diagnosis process in a local area. LD2 achieves diagnosis decision through distributed evidence fusion operations. Each sensor node provides its own judgements and the evidences are fused within a local area based on the Dempster-Shafer theory, resulting in the consensus diagnosis report. We implement LD2 on TinyOS 2.1 and examine the performance on a 50 nodes indoor testbed.", "citation": "Citations (26)", "departments": ["Hong Kong University of Science and Technology", "Tsinghua University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Qiang Ma.....http://dblp.org/pers/hd/m/Ma:Qiang", "Kebin Liu.....http://dblp.org/pers/hd/l/Liu:Kebin", "Xin Miao.....http://dblp.org/pers/hd/m/Miao:Xin", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2012", "pages": 9}