{"title": "Data gathering in wireless sensor networks through intelligent compressive sensing.", "fields": ["data set", "signal reconstruction", "data modeling", "sink", "compressed sensing"], "abstract": "The recently emerged compressive sensing (CS) theory provides a whole new avenue for data gathering in wireless sensor networks with benefits of universal sampling and decentralized encoding. However, existing compressive sensing based data gathering approaches assume the sensed data has a known constant sparsity, ignoring that the sparsity of natural signals vary in temporal and spatial domain. In this paper, we present an adaptive data gathering scheme by compressive sensing for wireless sensor networks. By introducing autoregressive (AR) model into the reconstruction of the sensed data, the local correlation in sensed data is exploited and thus local adaptive sparsity is achieved. The recovered data at the sink is evaluated by utilizing successive reconstructions, the relation between error and measurements. Then the number of measurements is adjusted according to the variation of the sensed data. Furthermore, a novel abnormal readings detection and identification mechanism based on combinational sparsity reconstruction is proposed. Internal error and external event are distinguished by their specific features. We perform extensive testing of our scheme on the real data sets and experimental results validate the efficiency and efficacy of the proposed scheme. Up to about 8dB SNR gain can be achieved over conventional CS based method with moderate increase of complexity.", "citation": "Citations (171)", "departments": ["Beijing University of Technology", "Illinois Institute of Technology", "Beijing University of Technology", "Illinois Institute of Technology"], "authors": ["Jin Wang.....http://dblp.org/pers/hd/w/Wang:Jin", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Baocai Yin.....http://dblp.org/pers/hd/y/Yin:Baocai", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang"], "conf": "infocom", "year": "2012", "pages": 9}