{"title": "Transductive multi-label ensemble classification for protein function prediction.", "fields": ["transduction", "graph", "directed graph", "protein function prediction", "data integration"], "abstract": "Advances in biotechnology have made available multitudes of heterogeneous proteomic and genomic data. Integrating these heterogeneous data sources, to automatically infer the function of proteins, is a fundamental challenge in computational biology. Several approaches represent each data source with a kernel (similarity) function. The resulting kernels are then integrated to determine a composite kernel, which is used for developing a function prediction model. Proteins are also found to have multiple roles and functions. As such, several approaches cast the protein function prediction problem within a multi-label learning framework. In our work we develop an approach that takes advantage of several unlabeled proteins, along with multiple data sources and multiple functions of proteins. We develop a graph-based  transductive multi-label classifier  (TMC) that is evaluated on a composite kernel, and also propose a method for data integration using the ensemble framework, called  transductive multi-label ensemble classifier  (TMEC). The TMEC approach trains a graph-based multi-label classifier for each individual kernel, and then combines the predictions of the individual models. Our contribution is the use of a bi-relational  directed  graph that captures relationships between pairs of proteins, between pairs of functions, and between proteins and functions. We evaluate the ability of TMC and TMEC to predict the functions of proteins by using two yeast datasets. We show that our approach performs better than recently proposed protein function prediction methods on composite and multiple kernels.", "citation": "Citations (23)", "departments": ["South China University of Technology", "George Mason University", "George Mason University", "South China University of Technology", "South China University of Technology"], "authors": ["Guo-Xian Yu.....http://dblp.org/pers/hd/y/Yu:Guo=Xian", "Carlotta Domeniconi.....http://dblp.org/pers/hd/d/Domeniconi:Carlotta", "Huzefa Rangwala.....http://dblp.org/pers/hd/r/Rangwala:Huzefa", "Guoji Zhang.....http://dblp.org/pers/hd/z/Zhang:Guoji", "Zhiwen Yu.....http://dblp.org/pers/hd/y/Yu_0002:Zhiwen"], "conf": "kdd", "year": "2012", "pages": 9}