{"title": "On shape and the computability of emotions.", "fields": ["roundness", "computability", "international affective picture system", "curse of dimensionality", "computer vision"], "abstract": "We investigated how shape features in natural images influence emotions aroused in human beings. Shapes and their characteristics such as roundness, angularity, simplicity, and complexity have been postulated to affect the emotional responses of human beings in the field of visual arts and psychology. However, no prior research has modeled the dimensionality of emotions aroused by roundness and angularity. Our contributions include an in depth statistical analysis to understand the relationship between shapes and emotions. Through experimental results on the International Affective Picture System (IAPS) dataset we provide evidence for the significance of roundness-angularity and simplicity-complexity on predicting emotional content in images. We combine our shape features with other state-of-the-art features to show a gain in prediction and classification accuracy. We model emotions from a dimensional perspective in order to predict valence and arousal ratings which have advantages over modeling the traditional discrete emotional categories. Finally, we distinguish images with strong emotional content from emotionally neutral images with high accuracy.", "citation": "Citations (59)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Xin Lu.....http://dblp.org/pers/hd/l/Lu:Xin", "Poonam Suryanarayan.....http://dblp.org/pers/hd/s/Suryanarayan:Poonam", "Reginald B. Adams Jr......http://dblp.org/pers/hd/a/Adams_Jr=:Reginald_B=", "Jia Li.....http://dblp.org/pers/hd/l/Li_0001:Jia", "Michelle G. Newman.....http://dblp.org/pers/hd/n/Newman:Michelle_G=", "James Z. Wang.....http://dblp.org/pers/hd/w/Wang:James_Z="], "conf": "mm", "year": "2012", "pages": 10}