{"title": "CARPO: Correlation-aware power optimization in data center networks.", "fields": ["openflow", "data center", "bandwidth allocation", "power optimization", "networking hardware"], "abstract": "Power optimization has become a key challenge in the design of large-scale enterprise data centers. Existing research efforts focus mainly on computer servers to lower their energy consumption, while only few studies have tried to address the energy consumption of data center networks (DCNs), which can account for 20% of the total energy consumption of a data center. In this paper, we propose CARPO, a correlation-aware power optimization algorithm that dynamically consolidates traffic flows onto a small set of links and switches in a DCN and then shuts down unused network devices for energy savings. In sharp contrast to existing work, CARPO is designed based on a key observation from the analysis of real DCN traces that the bandwidth demands of different flows do not peak at exactly the same time. As a result, if the correlations among flows are considered in consolidation, more energy savings can be achieved. In addition, CARPO integrates traffic consolidation with link rate adaptation for maximized energy savings. We implement CARPO on a hardware testbed composed of 10 virtual switches configured with a production 48-port OpenFlow switch and 8 servers. Our empirical results with Wikipedia traces demonstrate that CARPO can save up to 46% of network energy for a DCN, while having only negligible delay increases. CARPO also outperforms two state-of-the-art baselines by 19.6% and 95% on energy savings, respectively. Our simulation results with 61 flows also show the superior energy efficiency of CARPO over the baselines.", "citation": "Citations (140)", "departments": ["Ohio State University", "University of Tennessee", "Ohio State University", "University of Tennessee", "University of Tennessee"], "authors": ["Xiaodong Wang.....http://dblp.org/pers/hd/w/Wang:Xiaodong", "Yanjun Yao.....http://dblp.org/pers/hd/y/Yao:Yanjun", "Xiaorui Wang.....http://dblp.org/pers/hd/w/Wang:Xiaorui", "Kefa Lu.....http://dblp.org/pers/hd/l/Lu:Kefa", "Qing Cao.....http://dblp.org/pers/hd/c/Cao:Qing"], "conf": "infocom", "year": "2012", "pages": 9}