{"title": "Exploiting web images for event recognition in consumer videos: A multiple source domain adaptation approach.", "fields": ["contextual image classification", "decision theory", "support vector machine", "scale invariant feature transform", "parametric statistics"], "abstract": "Recent work has demonstrated the effectiveness of domain adaptation methods for computer vision applications. In this work, we propose a new multiple source domain adaptation method called Domain Selection Machine (DSM) for event recognition in consumer videos by leveraging a large number of loosely labeled web images from different sources (e.g., Flickr.com and Photosig.com), in which there are no labeled consumer videos. Specifically, we first train a set of SVM classifiers (referred to as source classifiers) by using the SIFT features of web images from different source domains. We propose a new parametric target decision function to effectively integrate the static SIFT features from web images/video keyframes and the spacetime (ST) features from consumer videos. In order to select the most relevant source domains, we further introduce a new data-dependent regularizer into the objective of Support Vector Regression (SVR) using the ∊-insensitive loss, which enforces the target classifier shares similar decision values on the unlabeled consumer videos with the selected source classifiers. Moreover, we develop an alternating optimization algorithm to iteratively solve the target decision function and a domain selection vector which indicates the most relevant source domains. Extensive experiments on three real-world datasets demonstrate the effectiveness of our proposed method DSM over the state-of-the-art by a performance gain up to 46.41%.", "citation": "Citations (111)", "year": "2012", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Columbia University"], "conf": "cvpr", "authors": ["Lixin Duan.....http://dblp.org/pers/hd/d/Duan:Lixin", "Dong Xu.....http://dblp.org/pers/hd/x/Xu_0001:Dong", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "pages": 8}