{"title": "Learning Behavior Models for Hybrid Timed Systems.", "fields": ["stability", "multi task learning", "algorithmic learning theory", "leabra", "online machine learning"], "abstract": "A tailored model of a system is the prerequisite for various analysis tasks, such as anomaly detection, fault identification, or quality assurance. This paper deals with the algorithmic learning of a system's behavior model given a sample of observations. In particular, we consider real-world production plants where the learned model must capture timing behavior, dependencies between system variables, as well as mode switches--in short: hybrid system's characteristics. Usually, such model formation tasks are solved by human engineers, entailing the well-known bunch of problems including knowledge acquisition, development cost, or lack of experience.\n\nOur contributions to the outlined field are as follows. (1) We present a taxonomy of learning problems related to model formation tasks. As a result, an important open learning problem for the domain of production system is identified: The learning of hybrid timed automata. (2) For this class of models, the learning algorithm HyBUTLA is presented. This algorithm is the first of its kind to solve the underlying model formation problem at scalable precision. (3) We present two case studies that illustrate the usability of this approach in realistic settings. (4) We give a proof for the learning and runtime properties of HyBUTLA.", "citation": "Citations (70)", "departments": ["Fraunhofer Society", "Bauhaus University, Weimar", "University of Paderborn", "University of Paderborn", "Institute Indus ... Lemgo, Germany"], "authors": ["Oliver Niggemann.....http://dblp.org/pers/hd/n/Niggemann:Oliver", "Benno Stein.....http://dblp.org/pers/hd/s/Stein:Benno", "Asmir Vodencarevic.....http://dblp.org/pers/hd/v/Vodencarevic:Asmir", "Alexander Maier.....http://dblp.org/pers/hd/m/Maier:Alexander", "Hans Kleine Büning.....http://dblp.org/pers/hd/b/B=uuml=ning:Hans_Kleine"], "conf": "aaai", "year": "2012", "pages": -1}