{"title": "Applying transactional memory to concurrency bugs.", "fields": ["lock", "bebugging", "transactional memory", "optimistic concurrency control", "multiversion concurrency control"], "abstract": "Multithreaded programs often suffer from synchronization bugs such as atomicity violations and deadlocks. These bugs arise from complicated locking strategies and ad hoc synchronization methods to avoid the use of locks. A survey of the bug databases of major open-source applications shows that concurrency bugs often take multiple fix attempts, and that fixes often introduce yet more concurrency bugs. Transactional memory (TM) enables programmers to declare regions of code atomic without specifying a lock and has the potential to avoid these bugs. Where most previous studies have focused on using TM to write new programs from scratch, we consider its utility in fixing existing programs with concurrency bugs. We therefore investigate four methods of using TM on three concurrent programs. Overall, we find that 29% of the bugs are not fixable by transactional memory, showing that TM does not address many important types of concurrency bugs. In particular, TM works poorly with extremely long critical sections and with deadlocks involving both condition variables and I/O. Conversely, we find that for 56% of the bugs, transactional memory offers demonstrable value by simplifying the reasoning behind a fix or the effort to implement a fix, and using transactions in the first place would have avoided 71% of the bugs examined. We also find that ad hoc synchronization put in place to avoid the overhead of locking can be greatly simplified with TM, but requires hardware support to perform well.", "citation": "Citations (16)", "year": "2012", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "Skype Limited,  ... allinn, Estonia"], "conf": "asplos", "authors": ["Haris Volos.....http://dblp.org/pers/hd/v/Volos_0001:Haris", "Andres Jaan Tack.....http://dblp.org/pers/hd/t/Tack:Andres_Jaan", "Michael M. Swift.....http://dblp.org/pers/hd/s/Swift:Michael_M=", "Shan Lu.....http://dblp.org/pers/hd/l/Lu:Shan"], "pages": 12}