{"title": "Image collection summarization via dictionary learning for sparse representation.", "fields": ["simulated annealing", "representativeness heuristic", "k svd", "neural coding", "sparse approximation", "automatic summarization"], "abstract": "In this paper, a novel approach is developed to achieve automatic image collection summarization. The effectiveness of the summary is reflected by its ability to reconstruct the original set or each individual image in the set. We have leveraged the dictionary learning for sparse representation model to construct the summary and to represent the image. Specifically we reformulate the summarization problem into a dictionary learning problem by selecting bases which can be sparsely combined to represent the original image and achieve a minimum global reconstruction error, such as MSE (Mean Square Error). The resulting ''Sparse Least Square'' problem is NP-hard, thus a simulated annealing algorithm is adopted to learn such dictionary, or image summary, by minimizing the proposed optimization function. A quantitative measurement is defined for assessing the quality of the image summary by investigating both its reconstruction ability and its representativeness of the original image set in large size. We have also compared the performance of our image summarization approach with that of six other baseline summarization tools on multiple image sets (ImageNet, NUS-WIDE-SCENE and Event image set). Our experimental results have shown that the proposed dictionary learning approach can obtain more accurate results as compared with other six baseline summarization algorithms.", "citation": "Citations (53)", "year": "2012", "departments": ["University of North Carolina at Charlotte", "Singapore Management University", "Northwest University", "Northwest University", "University of North Carolina at Charlotte", "Northwest University", "Northwest University"], "conf": "cvpr", "authors": ["Chunlei Yang.....http://dblp.org/pers/hd/y/Yang:Chunlei", "Jinye Peng.....http://dblp.org/pers/hd/p/Peng:Jinye", "Jianping Fan.....http://dblp.org/pers/hd/f/Fan_0001:Jianping"], "pages": 8}