{"title": "Algorithm-based fault tolerance for dense matrix factorizations.", "fields": ["cray xt5", "qr decomposition", "matrix decomposition", "cholesky decomposition", "linear least squares"], "abstract": "Dense matrix factorizations, such as LU, Cholesky and QR, are widely used for scientific applications that require solving systems of linear equations, eigenvalues and linear least squares problems. Such computations are normally carried out on supercomputers, whose ever-growing scale induces a fast decline of the Mean Time To Failure (MTTF). This paper proposes a new hybrid approach, based on Algorithm-Based Fault Tolerance (ABFT), to help matrix factorizations algorithms survive fail-stop failures. We consider extreme conditions, such as the absence of any reliable component and the possibility of loosing both data and checksum from a single failure. We will present a generic solution for protecting the right factor, where the updates are applied, of all above mentioned factorizations. For the left factor, where the panel has been applied, we propose a scalable checkpointing algorithm. This algorithm features high degree of checkpointing parallelism and cooperatively utilizes the checksum storage leftover from the right factor protection. The fault-tolerant algorithms derived from this hybrid solution is applicable to a wide range of dense matrix factorizations, with minor modifications. Theoretical analysis shows that the fault tolerance overhead sharply decreases with the scaling in the number of computing units and the problem size. Experimental results of LU and QR factorization on the Kraken (Cray XT5) supercomputer validate the theoretical evaluation and confirm negligible overhead, with- and without-errors.", "citation": "Citations (132)", "year": "2012", "departments": ["University of Tennessee", "University of Tennessee", "University of Tennessee", "University of Tennessee", "University of Tennessee"], "conf": "ppopp", "authors": ["Peng Du.....http://dblp.org/pers/hd/d/Du:Peng", "Aurelien Bouteiller.....http://dblp.org/pers/hd/b/Bouteiller:Aurelien", "George Bosilca.....http://dblp.org/pers/hd/b/Bosilca:George", "Thomas Hérault.....http://dblp.org/pers/hd/h/H=eacute=rault:Thomas", "Jack J. Dongarra.....http://dblp.org/pers/hd/d/Dongarra:Jack_J="], "pages": 10}