{"title": "Knowledge adaptation for ad hoc multimedia event detection with few exemplars.", "fields": ["multimedia", "machine learning", "support vector machine", "gaussian", "annotation"], "abstract": "Multimedia event detection (MED) has a significant impact on many applications. Though video concept annotation has received much research effort, video event detection remains largely unaddressed. Current research mainly focuses on sports and news event detection or abnormality detection in surveillance videos. Our research on this topic is capable of detecting more complicated and generic events. Moreover, the curse of reality,  i.e. , precisely labeled multimedia content is scarce, necessitates the study on how to attain respectable detection performance using only limited positive examples. Research addressing these two aforementioned issues is still in its infancy. In light of this, we explore Ad Hoc MED, which aims to detect complicated and generic events by using few positive examples. To the best of our knowledge, our work makes the first attempt on this topic. As the information from these few positive examples is limited, we propose to infer knowledge from other multimedia resources to facilitate event detection. Experiments are performed on real-world multimedia archives consisting of several challenging events. The results show that our approach outperforms several other detection algorithms. Most notably, our algorithm outperforms SVM by 43% and 14% comparatively in Average Precision when using Gaussian and Χ 2  kernel respectively.", "citation": "Citations (87)", "departments": ["University of Trento", "Carnegie Mellon University", "Carnegie Mellon University", "University of Trento", "Carnegie Mellon University"], "authors": ["Zhigang Ma.....http://dblp.org/pers/hd/m/Ma:Zhigang", "Yi Yang.....http://dblp.org/pers/hd/y/Yang_0001:Yi", "Yang Cai.....http://dblp.org/pers/hd/c/Cai:Yang", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu", "Alexander G. Hauptmann.....http://dblp.org/pers/hd/h/Hauptmann:Alexander_G="], "conf": "mm", "year": "2012", "pages": 10}