{"title": "A measurement-based study of beaconing performance in IEEE 802.11p vehicular networks.", "fields": ["network packet", "packet switching", "vehicular ad hoc network", "ieee 802 11p", "active safety"], "abstract": "Active safety applications for vehicular networks aims at improving safety conditions on the road by raising the level of “situation awareness” onboard vehicles. Situation awareness is achieved through exchange of beacons reporting positional and kinematic data. Two important performance parameters influence the level of situation awareness available to the active safety application: the beacon (packet) delivery rate (PDR), and the packet inter-reception (PIR) time. While measurement-based evaluations of the former metric recently appeared in the literature, the latter metric has not been studied so far. In this paper, for the first time, we estimate the PIR time and its correlation with PDR and other environmental parameters through an extensive measurement campaign based on IEEE 802.11p technology. Our study discloses several interesting insights on PIR times that can be expected in a real-world scenarios, which should be carefully considered by the active safety application designers. A major insight is that the packet inter reception time distribution is a power-law and that long situation awareness black-outs are likely to occur in batch, implying that situation awareness can be severely impaired even when the average beacon delivery rate is relatively high. Furthermore, our analysis shows that PIR and PDR are only loosely (negatively) correlated, and that the PIR time is almost independent of speed and distance between vehicles. A third major contribution of this paper is promoting the Gilbert-Elliot model, previously proposed to model bit error bursts in packet switched networks, as a very accurate model of beacon reception behavior observed in real-world data.", "citation": "Citations (88)", "departments": ["IIT - CNR, Pisa - Italy", "IIT - CNR, Pisa - Italy", "IIT - CNR, Pisa - Italy", "IIT - CNR, Pisa - Italy"], "authors": ["Francesca Martelli.....http://dblp.org/pers/hd/m/Martelli:Francesca", "M. Elena Renda.....http://dblp.org/pers/hd/r/Renda:M=_Elena", "Giovanni Resta.....http://dblp.org/pers/hd/r/Resta:Giovanni", "Paolo Santi.....http://dblp.org/pers/hd/s/Santi:Paolo"], "conf": "infocom", "year": "2012", "pages": 9}