{"title": "Spectrum trading with insurance in cognitive radio networks.", "fields": ["spectral efficiency", "cognitive radio", "bayesian game", "market game", "pareto principle"], "abstract": "Market based spectrum trading has been extensively studied to realize efficient spectrum utilization in cognitive radio networks (CRNs). In this paper, we utilize the concept of insurance in spectrum trading so as to improve spectrum efficiency in CRNs. We show that by additionally purchasing a specifically designed insurance contract from a PU, an SU can improve its utility since it will be insured against the potential accident, i.e., transmission failure incurred by excessively low SINR. Therefore insurance provides SUs more incentive to purchase PUs' channels and spectrum utilization in CRNs can be improved. In this paper, the original spectrum market including multiple PUs and multiple SUs are modeled as a hybrid market consisting of a spectrum market and an insurance market. In this hybrid market PUs serve as spectrum sellers as well as insurers and SUs act as spectrum buyers as well as insureds. We further model the hybrid market game as a four-stage Bayesian game between PUs and SUs. We characterize the second-best Pareto optimal (SBPO) market allocations and players' perfect Bayesian equilibrium (PBE) strategies. Furthermore, through extensive simulation, we have demonstrated that at the PBE, high risk and low risk SUs will respectively experience improvement in their utilities for approximately 23.5% and 4.6%.", "citation": "Citations (15)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Science and Technology, Sana'a"], "authors": ["Haiming Jin.....http://dblp.org/pers/hd/j/Jin:Haiming", "Gaofei Sun.....http://dblp.org/pers/hd/s/Sun:Gaofei", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian"], "conf": "infocom", "year": "2012", "pages": 9}