{"title": "Efficient deadlock avoidance for streaming computation with filtering.", "fields": ["deadlock", "model of computation", "network topology", "data stream mining", "deadlock prevention algorithms"], "abstract": "Parallel streaming computations have been studied extensively, and many languages, libraries, and systems have been designed to support this model of computation. In particular, we consider acyclic streaming computations in which individual nodes can choose to  filter , or discard, some of their inputs in a data-dependent manner. In these applications, if the channels between nodes have finite buffers, the computation can  deadlock . One method of deadlock avoidance is to augment the data streams between nodes with occasional  dummy messages ; however, for general DAG topologies, no polynomial time algorithm is known to compute the intervals at which dummy messages must be sent to avoid deadlock.   In this paper, we show that deadlock avoidance for streaming computations with filtering can be performed efficiently for a large class of DAG topologies. We first present a new method where each dummy message is tagged with a destination, so as to reduce the number of dummy messages sent over the network. We then give efficient algorithms for dummy interval computation in series-parallel DAGs. We finally generalize our results to a larger graph family, which we call the  CS4 DAGs , in which every undirected Cycle is Single-Source and Single-Sink ( CS  4 ). Our results show that, for a large set of application topologies that are both intuitively useful and formalizable, the streaming model with filtering can be implemented safely with reasonable overhead.", "citation": "Citations (8)", "year": "2012", "departments": ["Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis"], "conf": "ppopp", "authors": ["Jeremy D. Buhler.....http://dblp.org/pers/hd/b/Buhler:Jeremy_D=", "Kunal Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Kunal", "Peng Li.....http://dblp.org/pers/hd/l/Li:Peng", "Roger D. Chamberlain.....http://dblp.org/pers/hd/c/Chamberlain:Roger_D="], "pages": 12}