{"title": "Taagle: efficient, personalized search in collaborative tagging networks.", "fields": ["personalized search", "social search", "cache", "chose", "materialized view"], "abstract": "We demonstrate the Taagle system for top-k retrieval in social tagging systems (also known as  folksonomies ). The general setting is the following: users form a weighted social network, which may reflect friendship, similarity, or trust; items from a public pool of items (e.g., URLs, blogs, photos, documents) are tagged by users with keywords; users search for the top-k items having certain tags. Going beyond a classic search paradigm where data is decoupled from the users querying it, users can now act both as producers and seekers of information. Hence finding the most relevant items in response to a query should be done in a network-aware manner: items tagged by users who are closer (more similar) to the seeker should be given more weight than items tagged by distant users.   We illustrate with Taagle novel algorithms and a general approach that has the potential to scale to current applications, in an online context where the social network, the tagging data and even the seekers' search ingredients can change at any moment. We also illustrate possible design choices for providing users a fully-personalized and customizable search interface. By this interface, they can calibrate how social proximity is computed (for example, with respect to similarity in tagging actions), how much weight the social score of tagging actions should have in the result build-up, or the criteria by which the user network should be explored. In order to further reduce running time, seekers are given the possibility to chose between exact or approximate answers, and can benefit from cached results of previous queries (materialized views).", "citation": "Citations (8)", "year": "2012", "departments": ["Centre national de la recherche scientifique", "Centre national de la recherche scientifique"], "conf": "sigmod", "authors": ["Silviu Maniu.....http://dblp.org/pers/hd/m/Maniu:Silviu", "Bogdan Cautis.....http://dblp.org/pers/hd/c/Cautis:Bogdan"], "pages": 4}