{"title": "Di-Sec: A distributed security framework for heterogeneous Wireless Sensor Networks.", "fields": ["software architecture", "domain specific language", "adversary", "extensibility", "critical infrastructure"], "abstract": "Wireless Sensor Networks (WSNs) are deployed for monitoring in a range of critical domains (e.g., health care, military, critical infrastructure). Accordingly, these WSNs should be resilient to attacks. The current approach to defending against malicious threats is to develop and deploy a specific defense mechanism for a specific attack. However, the problem with this traditional approach to defending sensor networks is that the solution for the Jamming attack does not defend against other attacks (e.g., Sybil and Selective Forwarding). In reality, one cannot know a priori what type of attack an adversary will launch. This work addresses the challenges with the traditional approach to securing sensor networks and presents a comprehensive framework, Di-Sec, that can defend against all known and forthcoming attacks. At the heart of Di-Sec lies the monitoring core (M-Core), which is an extensible and lightweight layer that gathers statistics relevant for the defense mechanisms. The M-Core allows for the monitoring of both internal and external threats and supports the execution of multiple detection and defense mechanisms (DDMs) against different threats in parallel. Along with Di-Sec, a new user-friendly domain-specific language was developed, the M-Core Control Language (MCL). Using the MCL, a user can implement new defense mechanisms without the overhead of learning the details of the underlying software architecture (i.e., TinyOS, Di-Sec). Hence, the MCL expedites the development of sensor defense mechanisms by significantly simplifying the coding process for developers. The Di-Sec framework has been implemented and tested on real sensors to evaluate its feasibility and performance. Our evaluation of memory, communication, and sensing components shows that Di-Sec is feasible on today's resource-limited sensors and has a nominal overhead. Furthermore, we illustrate the basic functionality of Di-Sec by implementing and simultaneously executing DDMs for attacks at various layers of the communication stack (i.e., Jamming, Selective Forwarding, Sybil, and Internal attacks).", "citation": "Citations (13)", "departments": ["Georgia State University", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia State University", "Georgia Institute of Technology"], "authors": ["Marco Valero.....http://dblp.org/pers/hd/v/Valero:Marco", "Sang Shin Jung.....http://dblp.org/pers/hd/j/Jung:Sang_Shin", "A. Selcuk Uluagac.....http://dblp.org/pers/hd/u/Uluagac:A=_Selcuk", "Yingshu Li.....http://dblp.org/pers/hd/l/Li:Yingshu", "Raheem A. Beyah.....http://dblp.org/pers/hd/b/Beyah:Raheem_A="], "conf": "infocom", "year": "2012", "pages": 9}