{"title": "On the benefits and pitfalls of extending a statically typed language JIT compiler for dynamic scripting languages.", "fields": ["compiler correctness", "type system", "jython", "functional compiler", "compiler construction"], "abstract": "Whenever the need to compile a new dynamically typed language arises, an appealing option is to repurpose an existing statically typed language Just-In-Time (JIT) compiler (repurposed JIT compiler). Existing repurposed JIT compilers (RJIT compilers), however, have not yet delivered the hoped-for performance boosts. The performance of JVM languages, for instance, often lags behind standard interpreter implementations. Even more customized solutions that extend the internals of a JIT compiler for the target language compete poorly with those designed specifically for dynamically typed languages. Our own Fiorano JIT compiler is an example of this problem. As a state-of-the-art, RJIT compiler for Python, the Fiorano JIT compiler outperforms two other RJIT compilers (Unladen Swallow and Jython), but still shows a noticeable performance gap compared to PyPy, today's best performing Python JIT compiler. In this paper, we discuss techniques that have proved effective in the Fiorano JIT compiler as well as limitations of our current implementation. More importantly, this work offers the first in-depth look at benefits and limitations of the repurposed JIT compiler approach. We believe the most common pitfall of existing RJIT compilers is not focusing sufficiently on specialization, an abundant optimization opportunity unique to dynamically typed languages. Unfortunately, the lack of specialization cannot be overcome by applying traditional optimizations.", "citation": "Citations (23)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["José G. Castaños.....http://dblp.org/pers/hd/c/Casta=ntilde=os:Jos=eacute=_G=", "David Edelsohn.....http://dblp.org/pers/hd/e/Edelsohn:David", "Kazuaki Ishizaki.....http://dblp.org/pers/hd/i/Ishizaki:Kazuaki", "Priya Nagpurkar.....http://dblp.org/pers/hd/n/Nagpurkar:Priya", "Toshio Nakatani.....http://dblp.org/pers/hd/n/Nakatani:Toshio", "Takeshi Ogasawara.....http://dblp.org/pers/hd/o/Ogasawara:Takeshi", "Peng Wu.....http://dblp.org/pers/hd/w/Wu_0001:Peng"], "conf": "oopsla", "year": "2012", "pages": 18}