{"title": "Integrating meta-path selection with user-guided object clustering in heterogeneous information networks.", "fields": ["cure data clustering algorithm", "canopy clustering algorithm", "constrained clustering", "flame clustering", "brown clustering"], "abstract": "Real-world, multiple-typed objects are often interconnected, forming heterogeneous information networks. A major challenge for link-based clustering in such networks is its potential to generate many different results, carrying rather diverse semantic meanings. In order to generate desired clustering, we propose to use  meta-path , a path that connects object types via a sequence of relations, to control clustering with distinct semantics. Nevertheless, it is easier for a user to provide a few examples (\"seeds\") than a weighted combination of sophisticated meta-paths to specify her clustering preference. Thus, we propose to integrate  meta-path selection  with  user-guided clustering  to cluster objects in networks, where a user first provides a small set of object seeds for each cluster as guidance. Then the system learns the weights for each meta-path that are consistent with the clustering result implied by the guidance, and generates clusters under the learned weights of meta-paths. A probabilistic approach is proposed to solve the problem, and an effective and efficient iterative algorithm,  PathSelClus , is proposed to learn the model, where the clustering quality and the meta-path weights are mutually enhancing each other. Our experiments with several clustering tasks in two real networks demonstrate the power of the algorithm in comparison with the baselines.", "citation": "Citations (134)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of California, Santa Barbara", "University of Illinois at Chicago"], "authors": ["Yizhou Sun.....http://dblp.org/pers/hd/s/Sun:Yizhou", "Brandon Norick.....http://dblp.org/pers/hd/n/Norick:Brandon", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S=", "Xiao Yu.....http://dblp.org/pers/hd/y/Yu:Xiao"], "conf": "kdd", "year": "2012", "pages": 9}