{"title": "High-performance complex event processing over XML streams.", "fields": ["xpath", "pushdown automaton", "data exchange", "complex event processing", "rss"], "abstract": "Much research attention has been given to delivering high-performance systems that are capable of  complex event processing  (CEP) in a wide range of applications. However, many current CEP systems focus on processing efficiently data having a simple structure, and are otherwise limited in their ability to support efficiently complex continuous queries on structured or semi-structured information. However, XML streams represent a very popular form of data exchange, comprising large portions of social network and RSS feeds, financial records, configuration files, and similar applications requiring advanced CEP queries. In this paper, we present the XSeq language and system that support CEP on XML streams, via an extension of XPath that is both powerful and amenable to an efficient implementation. Specifically, the XSeq language extends XPath with natural operators to express sequential and Kleene-* patterns over XML streams, while remaining highly amenable to efficient implementation. XSeq is designed to take full advantage of recent advances in the field of automata on Visibly Pushdown Automata (VPA), where higher expressive power can be achieved without compromising efficiency (whereas the amenability to efficient implementation was not demonstrated in XPath extensions previously proposed).   We illustrate XSeq's power for CEP applications through examples from different domains, and provide formal results on its expressiveness and complexity. Finally, we present several optimization techniques for XSeq queries. Our extensive experiments indicate that XSeq brings outstanding performance to CEP applications: two orders of magnitude improvement are obtained over the same queries executed in general-purpose XML engines.", "citation": "Citations (61)", "year": "2012", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "conf": "sigmod", "authors": ["Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan", "Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0002:Kai", "Carlo Zaniolo.....http://dblp.org/pers/hd/z/Zaniolo:Carlo"], "pages": 12}