{"title": "Reducing Uncertainty of Low-Sampling-Rate Trajectories.", "fields": ["global positioning system", "human resource management system", "location based service", "inference", "trajectory"], "abstract": "The increasing availability of GPS-embedded mobile devices has given rise to a new spectrum of location-based services, which have accumulated a huge collection of location trajectories. In practice, a large portion of these trajectories are of low-sampling-rate. For instance, the time interval between consecutive GPS points of some trajectories can be several minutes or even hours. With such a low sampling rate, most details of their movement are lost, which makes them difficult to process effectively. In this work, we investigate how to reduce the uncertainty in such kind of trajectories. Specifically, given a low-sampling-rate trajectory, we aim to infer its possible routes. The methodology adopted in our work is to take full advantage of the rich information extracted from the historical trajectories. We propose a systematic solution, History based Route Inference System (HRIS), which covers a series of novel algorithms that can derive the travel pattern from historical data and incorporate it into the route inference process. To validate the effectiveness of the system, we apply our solution to the map-matching problem which is an important application scenario of this work, and conduct extensive experiments on a real taxi trajectory dataset. The experiment results demonstrate that HRIS can achieve higher accuracy than the existing map-matching algorithms for low-sampling-rate trajectories.", "citation": "Citations (129)", "departments": ["University of Queensland", "Microsoft", "Microsoft", "University of Queensland"], "authors": ["Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Yu Zheng.....http://dblp.org/pers/hd/z/Zheng_0004:Yu", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "icde", "year": "2012", "pages": 12}