{"title": "Title of tutorial: Designing immersive VR systems: From bits to bolts.", "fields": ["immersion", "rendering", "middleware", "virtual reality", "software"], "abstract": "Immersive 3D Virtual Environments (VE) have become affordable for many research centers. However, a complete solution needs several integration steps to be fully operational. Some of these steps are difficult to accomplish and require an uncommon combination of different skills. This tutorial presents the most recent techniques developed to address this problem, from displays to software tools. The hardware in a typical VR installations combines projectors, screens, speakers, computers, tracking and I/O devices. The tutorial will discuss hardware options, explaining their advantages and disadvantages. We will cover design decisions from basic software and hardware design, through user tracking, multimodal human-computer interfaces and acoustic rendering, to how to administrate the whole solution. Additionally, we will provide an introduction to existing tracking technologies, explaining how the most common devices work, while focusing on infrared optical tracking. Finally, we briefly cover integration software and middleware developed for most VE settings.", "citation": "Not cited", "departments": ["The Catholic University of America", "Instituto Superior Técnico", "Microsoft", "The Catholic University of America", "Instituto Superior Técnico"], "authors": ["Luciano P. Soares.....http://dblp.org/pers/hd/s/Soares:Luciano_P=", "Joaquim A. Jorge.....http://dblp.org/pers/hd/j/Jorge:Joaquim_A=", "José Miguel Salles Dias.....http://dblp.org/pers/hd/d/Dias:Jos=eacute=_Miguel_Salles", "Alberto Raposo.....http://dblp.org/pers/hd/r/Raposo:Alberto", "Bruno Rodrigues De Araújo.....http://dblp.org/pers/hd/a/Ara=uacute=jo:Bruno_Rodrigues_De", "Leonel Valbom.....http://dblp.org/pers/hd/v/Valbom:Leonel", "Filipe Gaspar.....http://dblp.org/pers/hd/g/Gaspar:Filipe"], "conf": "vr", "year": "2012", "pages": 6}