{"title": "The only constant is change: incorporating time-varying network reservations in data centers.", "fields": ["data center", "time varying network", "profiling", "virtual network", "network performance"], "abstract": "In multi-tenant datacenters, jobs of different tenants compete for the shared datacenter network and can suffer poor performance and high cost from varying, unpredictable network performance. Recently, several virtual network abstractions have been proposed to provide explicit APIs for tenant jobs to specify and reserve virtual clusters (VC) with both explicit VMs and required network bandwidth between the VMs. However, all of the existing proposals reserve a fixed bandwidth throughout the entire execution of a job.   In the paper, we first profile the traffic patterns of several popular cloud applications, and find that they generate substantial traffic during only 30%-60% of the entire execution, suggesting existing simple VC models waste precious networking resources. We then propose a fine-grained virtual network abstraction, Time-Interleaved Virtual Clusters (TIVC), that models the time-varying nature of the networking requirement of cloud applications. To demonstrate the effectiveness of TIVC, we develop Proteus, a system that implements the new abstraction. Using large-scale simulations of cloud application workloads and prototype implementation running actual cloud applications, we show the new abstraction significantly increases the utilization of the entire datacenter and reduces the cost to the tenants, compared to previous fixed-bandwidth abstractions.", "citation": "Citations (261)", "departments": ["Purdue University", "Purdue University", "Purdue University", "Purdue University"], "authors": ["Di Xie.....http://dblp.org/pers/hd/x/Xie:Di", "Ning Ding.....http://dblp.org/pers/hd/d/Ding:Ning", "Y. Charlie Hu.....http://dblp.org/pers/hd/h/Hu:Y=_Charlie", "Ramana Rao Kompella.....http://dblp.org/pers/hd/k/Kompella:Ramana_Rao"], "conf": "sigcomm", "year": "2012", "pages": 12}