{"title": "Short Propositional Refutations for Dense Random 3CNF Formulas.", "fields": ["propositional formula", "horn satisfiability", "well formed formula", "propositional proof system", "propositional variable"], "abstract": "Random 3CNF formulas constitute an important distribution for measuring the average-case behavior of propositional proof systems. Lower bounds for random 3CNF refutations in many propositional proof systems are known. Most notable are the exponential-size resolution refutation lower bounds for random 3CNF formulas with Omega(n^(1.5-epsilon)) clauses (Chvatal and Szemeredi (1988), Ben-Sasson and Wigderson (1999)). On the other hand, the only known non-trivial upper bound on the size of random 3CNF refutations in a non-abstract propositional proof system is for resolution with Omega((n^2)/log n) clauses, shown by Beame et al. (2002). In this paper we show that already standard propositional proof systems, within the hierarchy of Frege proofs, admit short refutations for random 3CNF formulas, for sufficiently large clause-to-variable ratio. Specifically, we demonstrate polynomial-size propositional refutations whose lines are TC0-formulas (i.e., TC0-Frege proofs) for random 3CNF formulas with n variables and Omega(n^1.4) clauses. The idea is based on demonstrating efficient propositional correctness proofs of the random 3CNF unsatisfiability witnesses given by Feige, Kim and Ofek (2006). Since the soundness of these witnesses is verified using spectral techniques, we develop an appropriate way to reason about eigenvectors in propositional systems. To carry out the full argument we work inside weak formal systems of arithmetic and use a general translation scheme to propositional proofs.", "citation": "Citations (5)", "departments": ["Charles University in Prague", "Tsinghua University"], "authors": ["Sebastian Müller.....http://dblp.org/pers/hd/m/M=uuml=ller_0003:Sebastian", "Iddo Tzameret.....http://dblp.org/pers/hd/t/Tzameret:Iddo"], "conf": "lics", "year": "2012", "pages": 10}