{"title": "Improving the Complexity of Index Calculus Algorithms in Elliptic Curves over Binary Fields.", "fields": ["elliptic curve cryptography", "algebraic number", "index calculus algorithm", "grobner basis", "linear subspace"], "abstract": "The goal of this paper is to further study the index calculus method that was first introduced by Semaev for solving the ECDLP and later developed by Gaudry and Diem. In particular, we focus on the step which consists in decomposing points of the curve with respect to an appropriately chosen factor basis. This part can be nicely reformulated as a purely algebraic problem consisting in finding solutions to a multivariate polynomial f(x1,…,xm)=0 such that x1,…,xm all belong to some vector subspace of F2n/F2. Our main contribution is the identification of particular structures inherent to such polynomial systems and a dedicated method for tackling this problem. We solve it by means of Grobner basis techniques and analyze its complexity using the multi-homogeneous structure of the equations. A direct consequence of our results is an index calculus algorithm solving ECDLP over any binary field F2n in time O(2ωt) , with t≈n/2 (provided that a certain heuristic assumption holds). This has to be compared with Diem's [14] index calculus based approach for solving ECDLP over F1n which has complexity exp(O(n log(n)1/2)) for q=2 and n a prime (but this holds without any heuristic assumption). We emphasize that the complexity obtained here is very conservative in comparison to experimental results. We hope the new ideas provided here may lead to efficient index calculus based methods for solving ECDLP in theory and practice.", "citation": "Citations (63)", "year": "2012", "departments": ["University of Paris", "University of Paris", "Université catholique de Louvain", "University of Paris"], "conf": "eurocrypt", "authors": ["Jean-Charles Faugère.....http://dblp.org/pers/hd/f/Faug=egrave=re:Jean=Charles", "Ludovic Perret.....http://dblp.org/pers/hd/p/Perret:Ludovic", "Christophe Petit.....http://dblp.org/pers/hd/p/Petit:Christophe", "Guénaël Renault.....http://dblp.org/pers/hd/r/Renault:Gu=eacute=na=euml=l"], "pages": 18}