{"title": "Design and experimental evaluation of context-aware link-level adaptation.", "fields": ["link level", "network packet", "decision tree learning", "throughput", "context awareness"], "abstract": "Context awareness has received increasing attention with the proliferation of various types of sensors on mobile devices. However, while wireless performance is known to be highly correlated with environmental settings, mobile devices have yet to fully exploit the awareness of context to improve wireless performance. In this paper, we leverage available context information to improve link-level adaptation via decision-tree classifiers and extensively evaluate its performance over emulated channels as well as with in-field trials. We first propose a classification method based on decision trees to select the optimal transmission parameters such as modulation, coding rate and packet size. We then quantify the throughput improvement using the proposed scheme and show that in some scenarios the throughput increases by over 100% compared to traditional SNR-based rate adaptation protocols. Second, we analyze the amount of training to assess the classification scheme. Third, we validate classification-based method by implementation on two different test platforms for extensive experimentation. We reveal the importance of the various contextual attributes used and identify channel type as a key parameter that affects classification performance. Finally, we study and quantify the use of context information across multiple different frequency bands and demonstrate the significant throughput gains that can be obtained.", "citation": "Citations (3)", "departments": ["Southern Methodist University", "Southern Methodist University", "Southern Methodist University", "Southern Methodist University", "Toyota"], "authors": ["Jialin He.....http://dblp.org/pers/hd/h/He:Jialin", "Hui Liu.....http://dblp.org/pers/hd/l/Liu:Hui", "Pengfei Cui.....http://dblp.org/pers/hd/c/Cui:Pengfei", "Jonathan Landon.....http://dblp.org/pers/hd/l/Landon:Jonathan", "Onur Altintas.....http://dblp.org/pers/hd/a/Altintas:Onur", "Rama Vuyyuru.....http://dblp.org/pers/hd/v/Vuyyuru:Rama", "Dinesh Rajan.....http://dblp.org/pers/hd/r/Rajan:Dinesh", "Joseph David Camp.....http://dblp.org/pers/hd/c/Camp:Joseph_David"], "conf": "infocom", "year": "2012", "pages": 5}