{"title": "ISOBAR Preconditioner for Effective and High-throughput Lossless Data Compression.", "fields": ["data compression ratio", "group method of data handling", "lossless compression", "image compression", "lossy compression"], "abstract": "Efficient handling of large volumes of data is a necessity for exascale scientific applications and database systems. To address the growing imbalance between the amount of available storage and the amount of data being produced by high speed (FLOPS) processors on the system, data must be compressed to reduce the total amount of data placed on the file systems. General-purpose loss less compression frameworks, such as zlib and bzlib2, are commonly used on datasets requiring loss less compression. Quite often, however, many scientific data sets compress poorly, referred to as hard-to-compress datasets, due to the negative impact of highly entropic content represented within the data. An important problem in better loss less data compression is to identify the hard-to-compress information and subsequently optimize the compression techniques at the byte-level. To address this challenge, we introduce the In-Situ Orthogonal Byte Aggregate Reduction Compression (ISOBAR-compress) methodology as a preconditioner of loss less compression to identify and optimize the compression efficiency and throughput of hard-to-compress datasets.", "citation": "Citations (60)", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University", "Sandia National Laboratories", "Princeton University"], "authors": ["Eric R. Schendel.....http://dblp.org/pers/hd/s/Schendel:Eric_R=", "Ye Jin.....http://dblp.org/pers/hd/j/Jin:Ye", "Neil Shah.....http://dblp.org/pers/hd/s/Shah:Neil", "Jackie Chen.....http://dblp.org/pers/hd/c/Chen:Jackie", "Choong-Seock Chang.....http://dblp.org/pers/hd/c/Chang:Choong=Seock", "Seung-Hoe Ku.....http://dblp.org/pers/hd/k/Ku:Seung=Hoe", "Stéphane Ethier.....http://dblp.org/pers/hd/e/Ethier:St=eacute=phane", "Scott Klasky.....http://dblp.org/pers/hd/k/Klasky:Scott", "Robert Latham.....http://dblp.org/pers/hd/l/Latham:Robert", "Robert B. Ross.....http://dblp.org/pers/hd/r/Ross:Robert_B=", "Nagiza F. Samatova.....http://dblp.org/pers/hd/s/Samatova:Nagiza_F="], "conf": "icde", "year": "2012", "pages": 12}