{"title": "Application-aware MIMO Video Rate Adaptation.", "fields": ["video quality", "error concealment", "channel", "mimo", "quantization"], "abstract": "High data rates and multiple channel profiles of a MIMO system are naturally well-suited to carry video content. However, a video communication scheme to exploit these desirable properties of MIMO systems is widely unexplored. Even the most sophisticated MIMO rate adaptation methods rely on channel BER which shows a monotonic decrease as the channel quality improves. However, video quality, for which PSNR is a better measure than BER, does not show a proportional increase with improved channel quality because of error concealment. In this paper, we present a novel application-aware rate adaptation method which can detect variations in a MIMO channel at a video receiver, quantify the impact of these variations on the received video quality, and adaptively select a transmission profile (consisting of modulation, coding and MIMO mode) to provide unprecedented improvements in video quality. The proposed application-aware MIMO Video Rate Adaptation (MVRA) method relies on a comprehensive model of source- and channel-induced distortions in video quality. Using this model, a MIMO receiver can select an appropriate transmission profile on a per-GOP basis. Trace-driven evaluations over an 802.11n channel show that the proposed MVRA method's PSNR is very close to the PSNR of an optimal RA scheme. Comparison with state-of-the-art MIMO RA methods shows that the proposed MVRA method provides consistently better PSNR, with an average improvement of 19.29% (5.5486 dBs) over the best existing MIMO RA scheme.", "citation": "Citations (3)", "departments": ["National University of Sciences and Technology", "National University of Sciences and Technology", "Iqra University"], "authors": ["Sobia Jangsher.....http://dblp.org/pers/hd/j/Jangsher:Sobia", "Syed Ali Khayam.....http://dblp.org/pers/hd/k/Khayam:Syed_Ali", "Qasim M. Chaudhari.....http://dblp.org/pers/hd/c/Chaudhari:Qasim_M="], "conf": "infocom", "year": "2012", "pages": 9}