{"title": "Squeezing the most out of interference: An optimization framework for joint interference exploitation and avoidance.", "fields": ["cross layer optimization", "time division multiple access", "single antenna interference cancellation", "transmitter", "physical layer"], "abstract": "There is a growing interest in exploiting interference (rather than avoiding it) to increase network throughput. In particular, the so-called successive interference cancellation (SIC) scheme appears very promising, due to its ability to enable concurrent receptions from multiple transmitters as well as interference rejection. Although SIC has been extensively studied as a physical layer technology, its research and advances in the context of multi-hop wireless network remain limited. In this paper, we try to answer the following fundamental questions. What are the limitations of SIC? How to overcome such limitations? How to optimize the interaction between SIC and interference avoidance? How to incorporate multiple layers (physical, link, and network) in an optimization framework? We find that SIC alone is not adequate to handle interference in a multi-hop wireless network, and advocate the use of joint SIC and interference avoidance. To optimize a joint scheme, we propose a cross-layer optimization framework that incorporates variables at physical, link, and network layers. This is the first work that combines successive interference cancellation and interference avoidance in multi-hop wireless network. We use numerical results to affirm the validity of our optimization framework and give insights on how SIC and interference avoidance can complement each other in an optimal manner.", "citation": "Citations (66)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech", "United States Naval Research Laboratory"], "authors": ["Canming Jiang.....http://dblp.org/pers/hd/j/Jiang:Canming", "Yi Shi.....http://dblp.org/pers/hd/s/Shi_0001:Yi", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Sastry Kompella.....http://dblp.org/pers/hd/k/Kompella:Sastry", "Scott F. Midkiff.....http://dblp.org/pers/hd/m/Midkiff:Scott_F="], "conf": "infocom", "year": "2012", "pages": 9}