{"title": "Embedding spatial context information into inverted filefor large-scale image retrieval.", "fields": ["inverted index", "spatial contextual awareness", "scale invariant feature transform", "object based spatial database", "spatial database"], "abstract": "One most popular approach for large-scale content-based image retrieval is based on the Bag-of-Visual-Words model. Since the spatial context among local features is very important for visual content identification, many approaches index local features' geometric clues, such as location, scale and orientation for post-verification. To obtain consistent accuracy performance, the amount of top ranked images that post-verification approach needs to process is proportional to the image database size. When the database is very large, the verified images will be too many to be processed in real-time response. To address this issue, in this paper, we explore two approaches to embed spatial context information into the inverted file. The first one is to build a spatial relationship dictionary embedded with spatial context among local features, which we call one-one spatial relationship method. The second one is to generate a spatial context binary signature for each feature, which we call one-multiple spatial relationship method. Then we build an inverted file with spatial information between local features. The geometric verification is implicitly achieved while traversing the inverted file. Experimental results on benchmark Holidays dataset demonstrate the efficiency of the proposed algorithm.", "citation": "Citations (19)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Texas at San Antonio", "University of Texas at San Antonio"], "authors": ["Zhen Liu.....http://dblp.org/pers/hd/l/Liu:Zhen", "Houqiang Li.....http://dblp.org/pers/hd/l/Li:Houqiang", "Wengang Zhou.....http://dblp.org/pers/hd/z/Zhou:Wengang", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "conf": "mm", "year": "2012", "pages": 10}