{"title": "Visual knowledge transfer among multiple cameras for people counting with occlusion handling.", "fields": ["knowledge transfer", "clutter", "residual", "transfer of learning", "sensory cue"], "abstract": "We present a framework to count the number of people in an environment where multiple cameras with different angles of view are available. We consider the visual cues captured by each camera as a knowledge source, and carry out cross-camera knowledge transfer to alleviate the difficulties of people counting, such as partial occlusions, low-quality images, clutter backgrounds, and so on. Specifically, this work distinguishes itself with the following contributions. First, we overcome the variations of multiple heterogeneous cameras with different perspective settings by matching the same groups of pedestrians taken by these cameras, and present an algorithm for accomplishing cross-camera correspondence. Second, the proposed counting model is composed of a pair of collaborative regressors. While one regressor measures people counts by the features extracted from intra-camera visual evidences, the other recovers the yielded residual by taking the conflicts among inter-camera predictions into account. The two regressors are elegantly coupled, and jointly lead to an accurate counting system. Additionally, we provide a set of manually annotated pedestrian labels on the PETS 2010 videos for performance evaluation. Our approach is comprehensively tested in various settings and compared with competitive baselines. The significant improvement in performance manifests the effectiveness of the proposed approach.", "citation": "Citations (4)", "departments": ["Academia Sinica", "Academia Sinica", "Academia Sinica", "Academia Sinica"], "authors": ["Ming-Fang Weng.....http://dblp.org/pers/hd/w/Weng:Ming=Fang", "Yen-Yu Lin.....http://dblp.org/pers/hd/l/Lin:Yen=Yu", "Nick C. Tang.....http://dblp.org/pers/hd/t/Tang:Nick_C=", "Hong-Yuan Mark Liao.....http://dblp.org/pers/hd/l/Liao:Hong=Yuan_Mark"], "conf": "mm", "year": "2012", "pages": 10}