{"title": "CRUISE: cache replacement and utility-aware scheduling.", "fields": ["pipeline burst cache", "bus sniffing", "adaptive replacement cache", "smart cache", "cache pollution"], "abstract": "When several applications are co-scheduled to run on a system with multiple shared LLCs, there is opportunity to improve system performance. This opportunity can be exploited by the hardware, software, or a combination of both hardware and software. The software, i.e., an operating system or hypervisor, can improve system performance by co-scheduling jobs on LLCs to minimize shared cache contention. The hardware can improve system throughput through better replacement policies by allocating more cache resources to applications that benefit from the cache and less to those applications that do not. This study presents a detailed analysis on the interactions between intelligent scheduling and smart cache replacement policies. We find that smart cache replacement reduces the burden on software to provide intelligent scheduling decisions. However, under smart cache replacement, there is still room to improve performance from better application co-scheduling. We find that co-scheduling decisions are a function of the underlying LLC replacement policy. We propose Cache Replacement and Utility-aware Scheduling (CRUISE)-a hardware/software co-designed approach for shared cache management. For 4-core and 8-core CMPs, we find that CRUISE approaches the performance of an ideal job co-scheduling policy under different LLC replacement policies.", "citation": "Citations (79)", "year": "2012", "departments": ["Intel", "Intel", "Intel", "Intel", "Intel"], "conf": "asplos", "authors": ["Aamer Jaleel.....http://dblp.org/pers/hd/j/Jaleel:Aamer", "Hashem Hashemi Najaf-abadi.....http://dblp.org/pers/hd/n/Najaf=abadi:Hashem_Hashemi", "Samantika Subramaniam.....http://dblp.org/pers/hd/s/Subramaniam:Samantika", "Simon C. Steely Jr......http://dblp.org/pers/hd/s/Steely_Jr=:Simon_C=", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S="], "pages": 12}