{"title": "Tracking millions of flows in high speed networks for application identification.", "fields": ["network packet", "router", "cache", "locality of reference", "hit rate"], "abstract": "Today's Internet applications exhibit increased diversity, while the Internet routers are still oblivious to this trend. To improve the end-to-end application QoS, one solution is to embed the application information explicitly in packet headers, but it will bring global changes. Another local solution is router-assisted traffic differentiation. To achieve this, the functionalities including packet identification and flow tracking inside the router are required. While most existing studies focus on the former, fewer efforts are put on the later. Given a large flow table is involved, how to track millions of concurrent flows in a cost-effective manner on a router's line card raises a great space-time challenge. To address this, we design an on-chip/off-chip flow tracking system to accommodate millions of flows and achieve the throughput at tens of Gigabits. By exploiting temporal locality and heavy-tailedness of Layer-4 traffic, we design the Adaptive Least Frequently Evicted (ALFE) replacement policy to catch elephant flows, therefore maintain a high cache hit rate. To alleviate performance penalty due to the cache misses, we organize the flow table in a fixed-allocated manner to fully utilize modern DRAM's burst feature. We have implemented a research prototype using FPGA for performance evaluation. The experiment results show that our system can reach 80% hit rate with a small-sized cache of 16K entries, while achieving 70Mpps throughput. This enables backbone line rate processing. Further, more than 40% power saving can be achieved by our system, which is fast and accurate with only 3% FPGA resource usage.", "citation": "Citations (9)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Tian Pan.....http://dblp.org/pers/hd/p/Pan:Tian", "Xiaoyu Guo.....http://dblp.org/pers/hd/g/Guo:Xiaoyu", "Chenhui Zhang.....http://dblp.org/pers/hd/z/Zhang:Chenhui", "Junchen Jiang.....http://dblp.org/pers/hd/j/Jiang:Junchen", "Hao Wu.....http://dblp.org/pers/hd/w/Wu:Hao", "Bin Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bin"], "conf": "infocom", "year": "2012", "pages": 9}