{"title": "Achieving usable and privacy-assured similarity search over outsourced cloud data.", "fields": ["plaintext", "edit distance", "data domain", "data file", "nearest neighbor search"], "abstract": "As the data produced by individuals and enterprises that need to be stored and utilized are rapidly increasing, data owners are motivated to outsource their local complex data management systems into the cloud for its great flexibility and economic savings. However, as sensitive cloud data may have to be encrypted before outsourcing, which obsoletes the traditional data utilization service based on plaintext keyword search, how to enable privacy-assured utilization mechanisms for outsourced cloud data is thus of paramount importance. Considering the large number of on-demand data users and huge amount of outsourced data files in cloud, the problem is particularly challenging, as it is extremely difficult to meet also the practical requirements of performance, system usability, and high-level user searching experiences. In this paper, we investigate the problem of secure and efficient similarity search over outsourced cloud data. Similarity search is a fundamental and powerful tool widely used in plaintext information retrieval, but has not been quite explored in the encrypted data domain. Our mechanism design first exploits a suppressing technique to build storage-efficient similarity keyword set from a given document collection, with edit distance as the similarity metric. Based on that, we then build a private trie-traverse searching index, and show it correctly achieves the defined similarity search functionality with constant search time complexity. We formally prove the privacy-preserving guarantee of the proposed mechanism under rigorous security treatment. To demonstrate the generality of our mechanism and further enrich the application spectrum, we also show our new construction naturally supports fuzzy search, a previously studied notion aiming only to tolerate typos and representation inconsistencies in the user searching input. The extensive experiments on Amazon cloud platform with real data set further demonstrate the validity and practicality of the proposed mechanism.", "citation": "Citations (258)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "University of Arkansas at Little Rock", "Illinois Institute of Technology"], "authors": ["Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Shucheng Yu.....http://dblp.org/pers/hd/y/Yu:Shucheng", "Karthik Mahendra Raje Urs.....http://dblp.org/pers/hd/u/Urs:Karthik_Mahendra_Raje"], "conf": "infocom", "year": "2012", "pages": 9}