{"title": "Iterative Graph Feature Mining for Graph Indexing.", "fields": ["strength of a graph", "distance hereditary graph", "simplex graph", "factor critical graph", "induced subgraph isomorphism problem"], "abstract": "Sub graph search is a popular query scenario on graph databases. Given a query graph q, the sub graph search algorithm returns all database graphs having q as a sub graph. To efficiently implement a subgraph search, subgraph features are mined in order to index the graph database. Many subgraph feature mining approaches have been proposed. They are all \"mine-at-once\" algorithms in which the whole feature set is mined in one run before building a stable graph index. However, due to the change of environments (such as an update of the graph database and the increase of available memory), the index needs to be updated to accommodate such changes. Most of the \"mine-at-once\" algorithms involve frequent subgraph or subtree mining over the whole graph database. Also, constructing and deploying a new index involves an expensive disk operation such that it is inefficient to re-mine the features and rebuild the index from scratch. We observe that, under most cases, it is sufficient to update a small part of the graph index. Here we propose an \"iterative subgraph mining\" algorithm which iteratively finds one feature to insert into (or remove from) the index. Since the majority of indexing features and the index structure are not changed, the algorithm can be frequently invoked. We define an objective function that guides the feature mining. Next, we propose a basic branch and bound algorithm to mine the features. Finally, we design an advanced search algorithm, which quickly finds a near-optimum subgraph feature and reduces the search space. Experiments show that our feature mining algorithm is 5 times faster than the popular graph indexing algorithm gIndex, and that features mined by our iterative algorithm have a better filtering rate for the subgraph search problem.", "citation": "Citations (8)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Dayu Yuan.....http://dblp.org/pers/hd/y/Yuan:Dayu", "Prasenjit Mitra.....http://dblp.org/pers/hd/m/Mitra:Prasenjit", "Huiwen Yu.....http://dblp.org/pers/hd/y/Yu:Huiwen", "C. Lee Giles.....http://dblp.org/pers/hd/g/Giles:C=_Lee"], "conf": "icde", "year": "2012", "pages": 12}