{"title": "Strengthening user authentication through opportunistic cryptographic identity assertions.", "fields": ["challenge response authentication", "chip authentication program", "generic bootstrapping architecture", "cognitive password", "lightweight extensible authentication protocol"], "abstract": "User authentication systems are at an impasse. The most ubiquitous method -- the password -- has numerous problems, including susceptibility to unintentional exposure via phishing and cross-site password reuse. Second-factor authentication schemes have the potential to increase security but face usability and deployability challenges. For example, conventional second-factor schemes change the user authentication experience. Furthermore, while more secure than passwords, second-factor schemes still fail to provide sufficient protection against (single-use) phishing attacks.   We present PhoneAuth, a system intended to provide security assurances comparable to or greater than that of conventional two-factor authentication systems while offering the same authentication experience as traditional passwords alone. Our work leverages the following key insights. First, a user's personal device ( eg  a phone) can communicate directly with the user's computer (and hence the remote web server) without  any  interaction with the user. Second, it is possible to provide a layered approach to security, whereby a web server can enact different policies depending on whether or not the user's personal device is present. We describe and evaluate our server-side, Chromium web browser, and Android phone implementations of PhoneAuth.", "citation": "Citations (78)", "year": "2012", "departments": ["University of Washington", "Rice University", "University of Washington", "Rice University", "Google"], "conf": "ccs", "authors": ["Alexei Czeskis.....http://dblp.org/pers/hd/c/Czeskis:Alexei", "Michael Dietz.....http://dblp.org/pers/hd/d/Dietz:Michael", "Tadayoshi Kohno.....http://dblp.org/pers/hd/k/Kohno:Tadayoshi", "Dan S. Wallach.....http://dblp.org/pers/hd/w/Wallach:Dan_S=", "Dirk Balfanz.....http://dblp.org/pers/hd/b/Balfanz:Dirk"], "pages": 11}