{"title": "Diversity maximization speedup for fault localization.", "fields": ["oracle", "test case", "automatic test pattern generation", "fault coverage", "speedup"], "abstract": "Fault localization is useful for reducing debugging effort. However, many fault localization techniques require non-trivial number of test cases with oracles, which can determine whether a program behaves correctly for every test input. Test oracle creation is expensive because it can take much manual labeling effort. Given a number of test cases to be executed, it is challenging to minimize the number of test cases requiring manual labeling and in the meantime achieve good fault localization accuracy. To address this challenge, this paper presents a novel test case selection strategy based on Diversity Maximization Speedup (DMS). DMS orders a set of unlabeled test cases in a way that maximizes the effectiveness of a fault localization technique. Developers are only expected to label a much smaller number of test cases along this ordering to achieve good fault localization results. Our experiments with more than 250 bugs from the Software-artifact Infrastructure Repository show (1) that DMS can help existing fault localization techniques to achieve comparable accuracy with on average 67% fewer labeled test cases than previously best test case prioritization techniques, and (2) that given a labeling budget (i.e., a fixed number of labeled test cases), DMS can help existing fault localization techniques reduce their debugging cost (in terms of the amount of code needed to be inspected to locate faults). We conduct hypothesis test and show that the saving of the debugging cost we achieve for the real C programs are statistically significant.", "citation": "Citations (14)", "year": "2012", "departments": ["Tsinghua University", "Singapore Management University", "Singapore Management University", "Tsinghua University"], "conf": "kbse", "authors": ["Liang Gong.....http://dblp.org/pers/hd/g/Gong:Liang", "David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David", "Lingxiao Jiang.....http://dblp.org/pers/hd/j/Jiang:Lingxiao", "Hongyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Hongyu"], "pages": 10}