{"title": "Intent and its discontents: the user at the wheel of the online video search engine.", "fields": ["multimedia information retrieval", "user information", "social web", "user intent", "semantic search"], "abstract": "We embrace the position of the user in the driver's seat of the video search engine by proposing a principled framework for multimedia retrieval that moves beyond  what  users are searching for also to encompass  why  they search. This 'why' is understood as the reason, purpose or immediate goal behind a user information need, which we identify as the underlying user 'intent'. Breaking information needs down into a topical dimension representing 'what' and an intent dimension representing 'why' will allow online video search engines to provide users with more satisfying search results. Until now, research on intent has remained small scale, limited by the lack of a systematic method for arriving at possible dimensions of user intent that provide productive areas of inquiry for multimedia research. We demonstrate how mining information from user descriptions of video information needs on the social Web makes it possible to identify useful intent categories for online video search and carry out validation experiments showing that these categories display enough invariance to be successfully modeled by a video search engine. In a final experiment, we demonstrate the potential for these categories to improve video retrieval with a large user study confirming that users associate salient differences within topically homogenous video search engine results lists with these intent categories. This reveals the potential to refine video results list using user intent.", "citation": "Citations (58)", "departments": ["Delft University of Technology", "Delft University of Technology", "Delft University of Technology"], "authors": ["Alan Hanjalic.....http://dblp.org/pers/hd/h/Hanjalic:Alan", "Christoph Kofler.....http://dblp.org/pers/hd/k/Kofler:Christoph", "Martha Larson.....http://dblp.org/pers/hd/l/Larson:Martha"], "conf": "mm", "year": "2012", "pages": 10}