{"title": "Channel allocation in non-cooperative multi-radio multi-channel wireless networks.", "fields": ["nash equilibrium", "collision domain", "local algorithm", "channel", "channel allocation schemes"], "abstract": "While tremendous efforts have been made on channel allocation problems in wireless networks, most of them are on cooperative networks with few exceptions [6, 8, 31, 32]. Among those works on non-cooperative networks, none of them considers the network with multiple collision domains. Instead, they all assume the single collision domain, where all transmissions interfere with each other if they are on the same channel. In this paper, we fill this void and generalize the channel allocation problem to non-cooperative multi-radio multi-channel wireless networks with multiple collision domains. We formulate the problem as a strategic game, called ChAlloc. We show that the ChAlloc game may result in an oscillation when there are no exogenous factors to influence players' strategies. To avoid this possible oscillation, we design a charging scheme to induce players to converge to a Nash Equilibrium (NE). We bound the convergence speed and prove that the system performance in an NE is at least (1 − r̄ over h) of the system performance in an optimal solution, where r̄ is the maximum number of radios equipped on wireless devices and h is the number of available channels. In addition, we develop a localized algorithm for players to find an NE strategy. Finally, we evaluate our design through extensive experiments. The results validate our analysis of the possible oscillation in the ChAlloc game lacking the charging scheme, confirm the convergence of the ChAlloc game with the charging scheme, and verify our proof on the system performance compared to the upper bounds returned by an LP-based algorithm.", "citation": "Citations (24)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Dejun Yang.....http://dblp.org/pers/hd/y/Yang:Dejun", "Xi Fang.....http://dblp.org/pers/hd/f/Fang:Xi", "Guoliang Xue.....http://dblp.org/pers/hd/x/Xue:Guoliang"], "conf": "infocom", "year": "2012", "pages": 9}