{"title": "Counting beyond a Yottabyte, or how SPARQL 1.1 property paths will prevent adoption of the standard.", "fields": ["rdf query language", "rdf schema", "named graph", "sparql", "yottabyte"], "abstract": "SPARQL -the standard query language for querying RDF- provides only limited navigational functionalities, although these features are of fundamental importance for graph data formats such as RDF. This has led the W3C to include the property path feature in the upcoming version of the standard, SPARQL 1.1.We tested several implementations of SPARQL 1.1 handling property path queries, and we observed that their evaluation methods for this class of queries have a poor performance even in some very simple scenarios. To formally explain this fact, we conduct a theoretical study of the computational complexity of property paths evaluation. Our results imply that the poor performance of the tested implementations is not a problem of these particular systems, but of the specification itself. In fact, we show that any implementation that adheres to the SPARQL 1.1 specification (as of November 2011) is doomed to show the same behavior, the key issue being the need for counting solutions imposed by the current specification. We provide several intractability results, that together with our empirical results, provide strong evidence against the current semantics of SPARQL 1.1 property paths. Finally, we put our results in perspective, and propose a natural alternative semantics with tractable evaluation, that we think may lead to a wide adoption of the language by practitioners, developers and theoreticians.", "citation": "Citations (103)", "departments": ["University of Chile", "PUC Chile, Santiago, Chile", "PUC Chile, Santiago, Chile"], "authors": ["Marcelo Arenas.....http://dblp.org/pers/hd/a/Arenas:Marcelo", "Sebastián Conca.....http://dblp.org/pers/hd/c/Conca:Sebasti=aacute=n", "Jorge Pérez.....http://dblp.org/pers/hd/p/P=eacute=rez_0001:Jorge"], "conf": "www", "year": "2012", "pages": 10}