{"title": "Exploring server redundancy in nonblocking multicast data center networks.", "fields": ["distance vector multicast routing protocol", "pragmatic general multicast", "xcast", "clos network", "source specific multicast", "protocol independent multicast", "server farm"], "abstract": "Clos networks and their variations such as folded-Clos networks (fat-trees) have been widely adopted as network topologies in data center networks. Since multicast is an essential communication pattern in many cloud services, nonblocking multicast communication can ensure the high performance of such services. However, nonblocking multicast Clos networks are costly due to the large number of middle stage switches required. On the other hand, server redundancy is ubiquitous in today’s data centers to provide high availability of services. In this paper, we explore such server redundancy in data centers to reduce the cost of nonblocking multicast Clos data center networks (DCNs). To facilitate our analysis, we first consider an ideal fault-free data center with no server failure. We give an algorithm to assign active servers evenly among input stage switches in a multicast Clos DCN where each server has one or more redundant backups depending on the availability requirements of services they provide. We show that the sufficient nonblocking condition on the number of middle stage switches for a multicast Clos DCN can be significantly reduced by exploring server redundancy. Then, to complete our analysis, we consider a practical faulty data center, where one or more active servers may fail at any time. We give a strategy to re-balance the active servers among input stage switches after server failures so that the same nonblocking condition still holds. Finally, we provide a multicast routing algorithm with linear time complexity to configure multicast connections in Clos DCNs.", "citation": "Citations (10)", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Zhiyang Guo.....http://dblp.org/pers/hd/g/Guo:Zhiyang", "Zhemin Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhemin", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2012", "pages": 9}