{"title": "Hi, magic closet, tell me what to wear!", "fields": ["magic", "clothing", "semantic gap", "banquet", "closet"], "abstract": "In this paper, we aim at a practical system, magic closet, for automatic occasion-oriented clothing recommendation. Given a user-input occasion,  e.g.,  wedding, shopping or dating, magic closet intelligently suggests the most suitable clothing from the user's own clothing photo album, or automatically pairs the user-specified reference clothing (upper-body or lower-body) with the most suitable one from online shops.   Two key criteria are explicitly considered for the magic closet system. One criterion is to  wear properly , e.g., compared to suit pants, it is more decent to wear a cocktail dress for a banquet occasion. The other criterion is to  wear aesthetically, e.g.,  a red T-shirt matches better white pants than green pants. To narrow the semantic gap between the low-level features of clothing and the high-level occasion categories, we adopt middle-level clothing attributes ( e.g.,  clothing category, color, pattern) as a bridge. More specifically, the clothing attributes are treated as latent variables in our proposed latent Support Vector Machine (SVM) based recommendation model. The  wearing properly  criterion is described in the model through a feature-occasion potential and an attribute-occasion potential, while the  wearing aesthetically  criterion is expressed by an attribute-attribute potential. To learn a generalize-well model and comprehensively evaluate it, we collect a large clothing What-to-Wear (WoW) dataset, and thoroughly annotate the whole dataset with 7 multi-value clothing attributes and 10 occasion categories via Amazon Mechanic Turk. Extensive experiments on the WoW dataset demonstrate the effectiveness of the magic closet system for both occasion-oriented clothing recommendation and pairing.", "citation": "Citations (189)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Agency for Science, Technology and Research", "Chinese Academy of Sciences"], "authors": ["Si Liu.....http://dblp.org/pers/hd/l/Liu_0001:Si", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi", "Zheng Song.....http://dblp.org/pers/hd/s/Song:Zheng", "Tianzhu Zhang.....http://dblp.org/pers/hd/z/Zhang:Tianzhu", "Hanqing Lu.....http://dblp.org/pers/hd/l/Lu:Hanqing", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2012", "pages": 10}