{"title": "Visual stem mapping and Geometric Tense coding for Augmented Visual Vocabulary.", "fields": ["image retrieval", "verb", "affine transformation", "vocabulary", "visual word"], "abstract": "This paper addresses the problem of affine distortions caused by viewpoint changes for the application of image retrieval. We study how to expand the visual words from a query image for better retrieval recall without the sacrifice of retrieval precision and efficiency. Our main contribution is the building of visual dictionaries that retain the mapping relationships between visual words extracted from different viewpoints of the same object. Additionally, in each mapping rule we record the affine transformation in which the two visual words are related, as a compact code of viewpoints relationships. By analogizing the concepts of verb stem and verb tense in text, we use Visual Stems to denote visual words extracted from robust local patches, and record the relationships between their affine variants as visual stem mapping rules, including the geometric relationships coded as Geometric Tenses. In this way, our method augments original visual vocabulary with sufficient and accurate expansion information. In query phase, only the objects corresponding to the same visual stems and coherent geometric tense codes will be regarded as similar ones. Moreover, the mapping rules can be learned offline with only one sample for each object. Experiments show that our method can support efficient object retrieval with high recall, requiring little extra time and space cost over traditional visual vocabularies.", "citation": "Citations (10)", "year": "2012", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Hewlett-Packard", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "cvpr", "authors": ["Ke Gao.....http://dblp.org/pers/hd/g/Gao:Ke", "Yongdong Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongdong", "Ping Luo.....http://dblp.org/pers/hd/l/Luo:Ping", "Wei Zhang.....http://dblp.org/pers/hd/z/Zhang_0043:Wei", "Junhai Xia.....http://dblp.org/pers/hd/x/Xia:Junhai", "Shouxun Lin.....http://dblp.org/pers/hd/l/Lin:Shouxun"], "pages": 8}