{"title": "Branch Code: A Labeling Scheme for Efficient Query Answering on Trees.", "fields": ["integer", "binary logarithm", "tree", "splay tree", "lowest common ancestor"], "abstract": "Labeling schemes lie at the core of query processing for many tree-structured data such as XML data that is flooding the web. A labeling scheme that can simultaneously and efficiently support various relationship queries on trees (such as parent/children, descendant/ancestor, etc.), computation of lowest common ancestors (LCA) and update of trees, is desired for effective and efficient management of tree-structured data. Although a variety of labeling schemes such as prefix-based labeling, interval-based labeling and prime-based labeling as well as their variants have been available to us for encoding static and dynamic trees, these labeling schemes usually show weakness in one aspect or another. In this paper, we propose an integer-based labeling scheme \\emph{branch code} as well as its compressed version as our major solution to simultaneously support efficient query processing on both static and dynamic ordered trees with affordable storage cost. The proposed branch code can answer common queries on ordered trees in constant time, which comes at the cost of consuming $O(N\\log N)$ storage. To reduce storage cost to $O(N)$, a compressed branch code is further developed. We also give a relationship determination algorithm purely using compressed branch code, which is of quite low possibility to produce false positive results as verified by experimental results. With the support of splay trees, branch code can also support dynamic trees so that updates and queries can be implemented with $O(\\log N)$ amortized cost. All the results above are either theoretically proved or verified by experimental studies.", "citation": "Citations (3)", "departments": ["Fudan University", "Fudan University", "Fudan University", "Fudan University", "Fudan University"], "authors": ["Yanghua Xiao.....http://dblp.org/pers/hd/x/Xiao:Yanghua", "Ji Hong.....http://dblp.org/pers/hd/h/Hong:Ji", "Wanyun Cui.....http://dblp.org/pers/hd/c/Cui:Wanyun", "Zhenying He.....http://dblp.org/pers/hd/h/He:Zhenying", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0009:Wei", "Guodong Feng.....http://dblp.org/pers/hd/f/Feng:Guodong"], "conf": "icde", "year": "2012", "pages": 12}