{"title": "TurfCast: A service for controlling information dissemination in wireless networks.", "fields": ["information dissemination", "mobile device", "exploit", "broadcasting", "situated", "fountain code"], "abstract": "Recent years have witnessed mass proliferation of mobile devices with rich wireless communication capabilities as well as emerging mobile device based information dissemination applications that leverage these capabilities. This paper proposes TurfCast, a novel information dissemination service that selectively broadcasts information in particular “turfs,” abstract logical spaces in which receivers are situated. Such turfs can be temporal or spatial based on receivers' lingering time or physical areas, respectively. TurfCast has many applications such as electronic proximity advertising and mobile social networking. To enable TurfCast, we propose two supporting technologies: TurfCode and TurfBurst. TurfCode is a nested 0–1 fountain code that enables the broadcaster to transmit either all information or none at all to receivers. TurfBurst exploits the Shannon bound to differentiate among receivers: those who cannot receive information fast enough receive none at all, even if they linger near the broadcaster. We implement TurfCast on real-world devices and conduct experiments in both indoor and outdoor environments. Our experimental results illustrate TurfCast's potential for controlling information dissemination in wireless networks.", "citation": "Citations (2)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Xinfeng Li.....http://dblp.org/pers/hd/l/Li:Xinfeng", "Jin Teng.....http://dblp.org/pers/hd/t/Teng:Jin", "Boying Zhang.....http://dblp.org/pers/hd/z/Zhang:Boying", "Adam C. Champion.....http://dblp.org/pers/hd/c/Champion:Adam_C=", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong"], "conf": "infocom", "year": "2012", "pages": 9}