{"title": "Sliding Mode Congestion Control for data center Ethernet networks.", "fields": ["netfpga", "data center", "phenomenon", "queue", "network congestion", "response time", "ethernet", "bottleneck"], "abstract": "Recently, Ethernet is being enhanced as the unified switch fabric of data centers, called Data Center Ethernet. The end-to-end congestion management is one of the indispensable enhancements, and Quantized Congestion Notification (QCN) has been ratified to be the standard. Our experiments show that QCN suffers from the oscillation of the queue at the bottleneck link. With the changes of system parameters and network configurations, the oscillation may become so serious that the queue is emptied frequently. As a result, the utilization of the bottleneck link degrades. Theoretical analysis shows that QCN approaches to the equilibrium point mainly through the sliding mode motion. But whether QCN enters into the sliding mode motion also depends on both system parameters and network configurations. Hence, we present the Sliding Mode Congestion Control (SMCC) scheme, which can drive the system into the sliding mode motion under any conditions. SMCC benefits from the advantage that the sliding mode motion is insensitive to system parameters and external disturbances. Moreover, SMCC is simple, stable and has short response time. QCN can be replaced by SMCC easily since both of them follow the framework developed by the IEEE 802.1 Qau work group. Experiments on the NetFPGA platform show that SMCC is superior to QCN, especially in the condition that the traffic pattern and the network state are variable.", "citation": "Citations (10)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Central South University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Wanchun Jiang.....http://dblp.org/pers/hd/j/Jiang:Wanchun", "Fengyuan Ren.....http://dblp.org/pers/hd/r/Ren:Fengyuan", "Ran Shu.....http://dblp.org/pers/hd/s/Shu:Ran", "Chuang Lin.....http://dblp.org/pers/hd/l/Lin:Chuang"], "conf": "infocom", "year": "2012", "pages": 9}