{"title": "LT codes-based secure and reliable cloud storage service.", "fields": ["information repository", "data as a service", "data efficiency", "cloud storage", "converged storage"], "abstract": "With the increasing adoption of cloud computing for data storage, assuring data service reliability, in terms of data correctness and availability, has been outstanding. While redundancy can be added into the data for reliability, the problem becomes challenging in the “pay-as-you-use” cloud paradigm where we always want to efficiently resolve it for both corruption detection and data repair. Prior distributed storage systems based on erasure codes or network coding techniques have either high decoding computational cost for data users, or too much burden of data repair and being online for data owners. In this paper, we design a secure cloud storage service which addresses the reliability issue with near-optimal overall performance. By allowing a third party to perform the public integrity verification, data owners are significantly released from the onerous work of periodically checking data integrity. To completely free the data owner from the burden of being online after data outsourcing, this paper proposes an exact repair solution so that no metadata needs to be generated on the fly for repaired data. The performance analysis and experimental results show that our designed service has comparable storage and communication cost, but much less computational cost during data retrieval than erasure codes-based storage solutions. It introduces less storage cost, much faster data retrieval, and comparable communication cost comparing to network coding-based distributed storage systems.", "citation": "Citations (211)", "departments": ["Worcester Polytechnic Institute", "University of Arkansas at Little Rock", "Amazon Web Services", "Virginia Tech", "Virginia Tech"], "authors": ["Ning Cao.....http://dblp.org/pers/hd/c/Cao_0001:Ning", "Shucheng Yu.....http://dblp.org/pers/hd/y/Yu:Shucheng", "Zhenyu Yang.....http://dblp.org/pers/hd/y/Yang:Zhenyu", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas"], "conf": "infocom", "year": "2012", "pages": 9}