{"title": "A content search system for mobile devices based on user context recognition.", "fields": ["mobile web", "user interface design", "user modeling", "mobile database", "mobile search"], "abstract": "People carry around mobile devices all the time in their daily life and get various information from the Internet in various situations. When searching for information (content) by using mobile devices, users' activities (e.g., walking and standing) and their situations (e.g., commuting in the morning and going out downtown in the evening) often change and this change may affect their degree of concentration on the display of mobile devices and their information needs. Therefore, search systems should provide users with an amount of information suitable for their activities and with a type of information suitable for their situations. In this paper, we present the design and implementation of a content search system considering mobile users' activities and situations, which aims to reduce users' load of operations in content searching. Our system recognizes user's activities and switches between two kinds of content search systems according to the user's activity: the location-based content search system runs when the user is standing, while the menu-based content search system runs when the user is walking. Both systems present information based on the user's situation. We also introduce a user's activity recognition method for mobile devices. This method classifies user's activity into standing, walking, and running using the sensors equipped in mobile devices.", "citation": "Citations (7)", "departments": ["Osaka University", "Osaka University", "Osaka University", "Osaka University", "Osaka University"], "authors": ["Tomohiro Mashita.....http://dblp.org/pers/hd/m/Mashita:Tomohiro", "Daijiro Komaki.....http://dblp.org/pers/hd/k/Komaki:Daijiro", "Mayu Iwata.....http://dblp.org/pers/hd/i/Iwata:Mayu", "Kentaro Shimatani.....http://dblp.org/pers/hd/s/Shimatani:Kentaro", "Hiroki Miyamoto.....http://dblp.org/pers/hd/m/Miyamoto:Hiroki", "Takahiro Hara.....http://dblp.org/pers/hd/h/Hara:Takahiro", "Kiyoshi Kiyokawa.....http://dblp.org/pers/hd/k/Kiyokawa:Kiyoshi", "Haruo Takemura.....http://dblp.org/pers/hd/t/Takemura:Haruo", "Shojiro Nishio.....http://dblp.org/pers/hd/n/Nishio:Shojiro"], "conf": "vr", "year": "2012", "pages": 4}