{"title": "Toward actionable, broadly accessible contests in Software Engineering.", "fields": ["empirical process", "operating environment", "workbench", "software metric", "contest"], "abstract": "Software Engineering challenges and contests are becoming increasingly popular for focusing researchers' efforts on particular problems. Such contests tend to follow either an exploratory model, in which the contest holders provide data and ask the contestants to discover ``interesting things'' they can do with it, or task-oriented contests in which contestants must perform a specific task on a provided dataset. Only occasionally do contests provide more rigorous evaluation mechanisms that precisely specify the task to be performed and the metrics that will be used to evaluate the results. In this paper, we propose actionable and crowd-sourced contests: actionable because the contest describes a precise task, datasets, and evaluation metrics, and also provides a downloadable operating environment for the contest; and crowd-sourced because providing these features creates accessibility to Information Technology hobbyists and students who are attracted by the challenge. Our proposed approach is illustrated using research challenges from the software traceability area as well as an experimental workbench named TraceLab.", "citation": "Citations (11)", "departments": ["DePaul University", "DePaul University", "DePaul University", "DePaul University", "DePaul University"], "authors": ["Jane Cleland-Huang.....http://dblp.org/pers/hd/c/Cleland=Huang:Jane", "Yonghee Shin.....http://dblp.org/pers/hd/s/Shin:Yonghee", "Ed Keenan.....http://dblp.org/pers/hd/k/Keenan:Ed", "Adam Czauderna.....http://dblp.org/pers/hd/c/Czauderna:Adam", "Greg Leach.....http://dblp.org/pers/hd/l/Leach:Greg", "Evan Moritz.....http://dblp.org/pers/hd/m/Moritz:Evan", "Malcom Gethers.....http://dblp.org/pers/hd/g/Gethers:Malcom", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys", "Jane Huffman Hayes.....http://dblp.org/pers/hd/h/Hayes:Jane_Huffman", "Wenbin Li.....http://dblp.org/pers/hd/l/Li:Wenbin"], "conf": "icse", "year": "2012", "pages": 4}