{"title": "Approximate convex decomposition based localization in wireless sensor networks.", "fields": ["scaling", "multidimensional scaling", "approximation algorithm", "geographic routing", "local algorithm"], "abstract": "Accurate localization in wireless sensor networks is the foundation for many applications, such as geographic routing and position-aware data processing. An important research direction for localization is to develop schemes using connectivity information only. These schemes primary apply hop counts to distance estimation. Not surprisingly, they work well only when the network topology has a convex shape. In this paper, we develop a new Localization protocol based on Approximate Convex Decomposition (ACDL). It can calculate the node virtual locations for a large-scale sensor network with arbitrary shapes. The basic idea is to decompose the network into convex subregions. It is not straight-forward, however. We first examine the influential factors on the localization accuracy when the network is concave such as the sharpness of concave angle and the depth of the concave valley. We show that after decomposition, the depth of the concave valley becomes irrelevant. We thus define concavity according to the angle at a concave point, which can reflect the localization error. We then propose ACDL protocol for network localization. It consists of four main steps. First, convex and concave nodes are recognized and network boundaries are segmented. As the sensor network is discrete, we show that it is acceptable to approximately identify the concave nodes to control the localization error. Second, an approximate convex decomposition is conducted. Our convex decomposition requires only local information and we show that it has low message overhead. Third, for each convex subsection of the network, an improved Multi-Dimensional Scaling (MDS) algorithm is proposed to compute a relative location map. Fourth, a fast and low complexity merging algorithm is developed to construct the global location map. Our simulation on several representative networks demonstrated that ACDL has localization error that is 60%–90% smaller as compared with the typical MDS-MAP algorithm and 20%–30% smaller as compared to a recent state-of-the-art localization algorithm CATL.", "citation": "Citations (29)", "departments": ["Huazhong University of Science and Technology", "Hong Kong Polytechnic University", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "InterDigital, Inc."], "authors": ["Wenping Liu.....http://dblp.org/pers/hd/l/Liu_0001:Wenping", "Dan Wang.....http://dblp.org/pers/hd/w/Wang_0002:Dan", "Hongbo Jiang.....http://dblp.org/pers/hd/j/Jiang:Hongbo", "Wenyu Liu.....http://dblp.org/pers/hd/l/Liu:Wenyu", "Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang"], "conf": "infocom", "year": "2012", "pages": 9}