{"title": "MoViMash: online mobile video mashup.", "fields": ["video production", "video camera", "video editing", "video compression picture types", "mashup"], "abstract": "With the proliferation of mobile video cameras, it is becoming easier for users to capture videos of live performances and socially share them with friends and public. As an attendee of such live performances typically has limited mobility, each video camera is able to capture only from a range of restricted viewing angles and distance, producing a rather monotonous video clip. At such performances, however, multiple video clips can be captured by different users, likely from different angles and distances. These videos can be combined to produce a more interesting and representative mashup of the live performances for broadcasting and sharing. The earlier works select video shots merely based on the quality of currently available videos. In real video editing process, however, recent selection history plays an important role in choosing future shots. In this work, we present MoViMash, a framework for automatic online video mashup that makes smooth shot transitions to cover the performance from diverse perspectives. Shot transition and shot length distributions are learned from professionally edited videos. Further, we introduce view quality assessment in the framework to filter out shaky, occluded, and tilted videos. To the best of our knowledge, this is the first attempt to incorporate history-based diversity measurement, state-based video editing rules, and view quality in automated video mashup generations. Experimental results have been provided to demonstrate the effectiveness of MoViMash framework.", "citation": "Citations (61)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Mukesh Kumar Saini.....http://dblp.org/pers/hd/s/Saini:Mukesh_Kumar", "Raghudeep Gadde.....http://dblp.org/pers/hd/g/Gadde:Raghudeep", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Wei Tsang Ooi.....http://dblp.org/pers/hd/o/Ooi:Wei_Tsang"], "conf": "mm", "year": "2012", "pages": 10}