{"title": "In the eye of the beholder: employing statistical analysis and eye tracking for analyzing abstract paintings.", "fields": ["likert scale", "contemporary art", "painting", "emotional expression", "emotion recognition"], "abstract": "Most artworks are explicitly created to evoke a strong emotional response. During the centuries there were several art movements which employed different techniques to achieve emotional expressions conveyed by artworks. Yet people were always consistently able to read the emotional messages even from the most abstract paintings. Can a machine learn what makes an artwork emotional? In this work, we consider a set of 500 abstract paintings from Museum of Modern and Contemporary Art of Trento and Rovereto (MART), where each painting was scored as carrying a positive or negative response on a Likert scale of 1-7. We employ a state-of-the-art recognition system to learn which statistical patterns are associated with positive and negative emotions. Additionally, we dissect the classification machinery to determine which parts of an image evokes what emotions. This opens new opportunities to research why a specific painting is perceived as emotional. We also demonstrate how quantification of evidence for positive and negative emotions can be used to predict the way in which people observe paintings.", "citation": "Citations (56)", "departments": ["University of Trento", "University of Trento", "University of Trento", "Telecom Italia", "University of Trento"], "authors": ["Victoria Yanulevskaya.....http://dblp.org/pers/hd/y/Yanulevskaya:Victoria", "Jasper R. R. Uijlings.....http://dblp.org/pers/hd/u/Uijlings:Jasper_R=_R=", "Elia Bruni.....http://dblp.org/pers/hd/b/Bruni:Elia", "Andreza Sartori.....http://dblp.org/pers/hd/s/Sartori:Andreza", "Elisa Zamboni.....http://dblp.org/pers/hd/z/Zamboni:Elisa", "Francesca Bacci.....http://dblp.org/pers/hd/b/Bacci:Francesca", "David Melcher.....http://dblp.org/pers/hd/m/Melcher:David", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu"], "conf": "mm", "year": "2012", "pages": 10}