{"title": "Decomposing global light transport using time of flight imaging.", "fields": ["photon mapping", "edge detection", "gaussian function", "subsurface scattering", "ray"], "abstract": "Global light transport is composed of direct and indirect components. In this paper, we take the first steps toward analyzing light transport using the high temporal resolution information of time of flight (ToF) images. With pulsed scene illumination, the time profile at each pixel of these images separates different illumination components by their finite travel time and encodes complex interactions between the incident light and the scene geometry with spatially-varying material properties. We exploit the time profile to decompose light transport into its constituent direct, subsurface scattering, and interreflection components. We show that the time profile is well modelled using a Gaussian function for the direct and interreflection components, and a decaying exponential function for the subsurface scattering component. We use our direct, subsurface scattering, and interreflection separation algorithm for five computer vision applications: recovering projective depth maps, identifying subsurface scattering objects, measuring parameters of analytical subsurface scattering models, performing edge detection using ToF images and rendering novel images of the captured scene with adjusted amounts of subsurface scattering.", "citation": "Citations (78)", "year": "2012", "departments": ["Tsinghua University", "Morgridge Institute for Research", "University of Toronto", "University of Zaragoza", "Mitsubishi Electric Research Laboratories", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Mitsubishi Electric Research Laboratories", "Massachusetts Institute of Technology"], "conf": "cvpr", "authors": ["Di Wu.....http://dblp.org/pers/hd/w/Wu_0006:Di", "Matthew O'Toole.....http://dblp.org/pers/hd/o/O=Toole:Matthew", "Andreas Velten.....http://dblp.org/pers/hd/v/Velten:Andreas", "Amit K. Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Amit_K=", "Ramesh Raskar.....http://dblp.org/pers/hd/r/Raskar:Ramesh"], "pages": 8}