{"title": "Learning Image Descriptors with the Boosting-Trick.", "fields": ["kernel", "feature learning", "scale invariant feature transform", "feature", "graph kernel"], "abstract": "In this paper we apply boosting to learn complex non-linear local visual feature representations, drawing inspiration from its successful application to visual object detection. The main goal of local feature descriptors is to distinctively represent a salient image region while remaining invariant to viewpoint and illumination changes. This representation can be improved using machine learning, however, past approaches have been mostly limited to learning linear feature mappings in either the original input or a kernelized input feature space. While kernelized methods have proven somewhat effective for learning non-linear local feature descriptors, they rely heavily on the choice of an appropriate kernel function whose selection is often difficult and non-intuitive. We propose to use the boosting-trick to obtain a non-linear mapping of the input to a high-dimensional feature space. The non-linear feature mapping obtained with the boosting-trick is highly intuitive. We employ gradient-based weak learners resulting in a learned descriptor that closely resembles the well-known SIFT. As demonstrated in our experiments, the resulting descriptor can be learned directly from intensity patches achieving state-of-the-art performance.", "citation": "Citations (76)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Tomasz Trzcinski.....http://dblp.org/pers/hd/t/Trzcinski:Tomasz", "C. Mario Christoudias.....http://dblp.org/pers/hd/c/Christoudias:C=_Mario", "Vincent Lepetit.....http://dblp.org/pers/hd/l/Lepetit:Vincent", "Pascal Fua.....http://dblp.org/pers/hd/f/Fua:Pascal"], "conf": "nips", "year": "2012", "pages": 9}