{"title": "Sparse Bayesian multi-task learning for predicting cognitive outcomes from neuroimaging measures in Alzheimer's disease.", "fields": ["multivariate statistics", "alzheimer s disease", "effects of sleep deprivation on cognitive performance", "cognitive test", "multi task learning"], "abstract": "Alzheimer's disease (AD) is the most common form of dementia that causes progressive impairment of memory and other cognitive functions. Multivariate regression models have been studied in AD for revealing relationships between neuroimaging measures and cognitive scores to understand how structural changes in brain can influence cognitive status. Existing regression methods, however, do not explicitly model dependence relation among multiple scores derived from a single cognitive test. It has been found that such dependence can deteriorate the performance of these methods. To overcome this limitation, we propose an efficient sparse Bayesian multi-task learning algorithm, which adaptively learns and exploits the dependence to achieve improved prediction performance. The proposed algorithm is applied to a real world neuroimaging study in AD to predict cognitive performance using MRI scans. The effectiveness of the proposed algorithm is demonstrated by its superior prediction performance over multiple state-of-the-art competing methods and accurate identification of compact sets of cognition-relevant imaging biomarkers that are consistent with prior knowledge.", "citation": "Citations (36)", "year": "2012", "departments": ["Indiana University", "University of California, San Diego", "Indiana University", "Indiana University", "University of California, San Diego"], "conf": "cvpr", "authors": ["Jing Wan.....http://dblp.org/pers/hd/w/Wan:Jing", "Zhilin Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhilin", "Jingwen Yan.....http://dblp.org/pers/hd/y/Yan:Jingwen", "Taiyong Li.....http://dblp.org/pers/hd/l/Li:Taiyong", "Bhaskar D. Rao.....http://dblp.org/pers/hd/r/Rao:Bhaskar_D=", "Shiaofen Fang.....http://dblp.org/pers/hd/f/Fang:Shiaofen", "Sungeun Kim.....http://dblp.org/pers/hd/k/Kim:Sungeun", "Shannon L. Risacher.....http://dblp.org/pers/hd/r/Risacher:Shannon_L=", "Andrew J. Saykin.....http://dblp.org/pers/hd/s/Saykin:Andrew_J=", "Li Shen.....http://dblp.org/pers/hd/s/Shen_0001:Li"], "pages": 8}