{"title": "Organizing without formal organization: group identification, goal setting and social modeling in directing online production.", "fields": ["formal organization", "group decision making", "collective identity", "online community", "goal setting"], "abstract": "A challenge for many online production communities is to direct their members to accomplish tasks that are important to the group, even when these tasks may not match individual members' interests. Here we investigate how combining group identification and direction setting can motivate volunteers in online communities to accomplish tasks important to the success of the group as a whole. We hypothesize that group identity, the perception of belonging to a group, triggers in-group favoritism; and direction setting (including explicit direction from group goals and implicit direction from role models) focuses people's group-oriented motivation towards the group's important tasks. We tested our hypotheses in the context of Wikipedia's Collaborations of the Week (COTW), a group goal setting mechanism and a social event within Wikiprojects. Results demonstrate that 1) publicizing important group goals via COTW can have a strong motivating influence on editors who have voluntarily identified themselves as group members compared to those who have not self-identified; 2) the effects of goals spill over to non-goal related tasks; and 3) editors exposed to group role models in COTW are more likely to perform similarly to the models on group-relevant citizenship behaviors. Finally, we discuss design and managerial implications based on our findings.", "citation": "Citations (62)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Haiyi Zhu.....http://dblp.org/pers/hd/z/Zhu:Haiyi", "Robert E. Kraut.....http://dblp.org/pers/hd/k/Kraut:Robert_E=", "Aniket Kittur.....http://dblp.org/pers/hd/k/Kittur:Aniket"], "conf": "cscw", "year": "2012", "pages": 10}