{"title": "Data perturbation with state-dependent noise for participatory sensing.", "fields": ["adversary", "exploit", "information sensitivity", "private information retrieval", "participatory sensing"], "abstract": "The emerging participatory sensing applications rely on individuals' inputs which may be highly correlated with individuals' sensitive information or personal data. Hence, privacy protection is crucial to encourage individual participation for participatory sensing applications to generate trustworthy and high quality data. A widely used technique for privacy preservation is data perturbation, which adds noises to original data at the client side to protect individuals' privacy and allows the information server to reconstruct the statistics of the original data. In this paper, we find a serious vulnerability of existing data perturbation algorithms that an adversary may exploit to restore other users' private information (e.g., mean, variance and the distribution of original data) from the perturbed data, because all the participants share the same noise distribution. To overcome such vulnerability, we propose a privacy enhanced state-dependent perturbation (PESP), which assigns different noise distributions to individuals and the noises vary according to the state of real data. PESP is not only able to reconstruct community statistics, but also provides better privacy protection for individuals even when the adversaries acquire the perturbed data. We evaluate PESP through two participatory sensing applications: one analyzes the speed variations of vehicles on the road and the other computes the weight statistics for a particular diet. The results demonstrate the efficiency of the PESP in privacy preservation and reconstruction of the community statistics.", "citation": "Citations (27)", "departments": ["Chinese Academy of Sciences", "University of Nebraska–Lincoln", "McGill University", "McGill University"], "authors": ["Fan Zhang.....http://dblp.org/pers/hd/z/Zhang:Fan", "Li He.....http://dblp.org/pers/hd/h/He_0001:Li", "Wenbo He.....http://dblp.org/pers/hd/h/He:Wenbo", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue"], "conf": "infocom", "year": "2012", "pages": 9}