{"title": "People in books: using a FlashCam to become part of an interactive book for connected reading.", "fields": ["streams", "videoconferencing", "background subtraction", "performative utterance", "illusion"], "abstract": "We introduce People in Books with FlashCam technology, a system that supports children and long-distance family members to act as characters in children's storybooks while they read stories together over a distance. By segmenting the video chat streams of the child and remote family member from their background surroundings, we create the illusion that the child and adult reader are immersed among the storybook illustrations. The illusion of inhabiting a shared story environment helps remote family members feel a sense of togetherness and encourages active reading behaviors for children ages three to five. People In Books is designed to fit into families' traditional reading practices, such as reading ebooks on couches or in bed via netbook or tablet computers. To accommodate this goal we implemented FlashCam, a computationally cost effective and physically small background subtraction system for mobile devices that allows users to move locations and change lighting conditions while they engage in background-subtracted video communications. A lab evaluation compared People in Books with a conventional remote reading application. Results show that People in Books motivates parents and children to be more performative readers and encourages open-ended play beyond the story, while creating a strong sense of togetherness.", "citation": "Citations (28)", "departments": ["Massachusetts Institute of Technology", "Nokia", "Google", "Nokia", "Massachusetts Institute of Technology"], "authors": ["Sean Follmer.....http://dblp.org/pers/hd/f/Follmer:Sean", "Rafael Ballagas.....http://dblp.org/pers/hd/b/Ballagas:Rafael", "Hayes Raffle.....http://dblp.org/pers/hd/r/Raffle:Hayes", "Mirjana Spasojevic.....http://dblp.org/pers/hd/s/Spasojevic:Mirjana", "Hiroshi Ishii.....http://dblp.org/pers/hd/i/Ishii_0001:Hiroshi"], "conf": "cscw", "year": "2012", "pages": 10}