{"title": "Incremental Deterministic Public-Key Encryption.", "fields": ["probabilistic encryption", "deterministic encryption", "56 bit encryption", "public key cryptography", "multiple encryption", "plaintext aware encryption", "optimal asymmetric encryption padding", "attribute based encryption", "disk encryption theory"], "abstract": "Motivated by applications in large storage systems, we initiate the study of incremental deterministic public-key encryption. Deterministic public-key encryption, introduced by Bellare, Boldyreva, and O'Neill (CRYPTO '07), provides a realistic alternative to randomized public-key encryption in various scenarios where the latter exhibits inherent drawbacks. A deterministic encryption algorithm, however, cannot satisfy any meaningful notion of security for low-entropy plaintexts distributions, and Bellare et al. demonstrated that a strong notion of security can in fact be realized for relatively high-entropy plaintext distributions.\n\nIn order to achieve a meaningful level of security, a deterministic encryption algorithm should be typically used for encrypting rather long plaintexts for ensuring a sufficient amount of entropy. This requirement may be at odds with efficiency constraints, such as communication complexity and computation complexity in the presence of small updates. Thus, a highly desirable property of deterministic encryption algorithms is incrementality: small changes in the plaintext translate into small changes in the corresponding ciphertext.\n\nWe present a framework for modeling the incrementality of deterministic public-key encryption. Within our framework we propose two schemes, which we prove to enjoy an optimal tradeoff between their security and incrementality up to small polylogarithmic factors. Our first scheme is a generic method which can be based on any deterministic public-key encryption scheme, and in particular, can be instantiated with any semantically-secure (randomized) public-key encryption scheme in the random oracle model. Our second scheme is based on the Decisional Diffie-Hellman assumption in the standard model.\n\nThe approach underpinning our schemes is inspired by the fundamental \"sample-then-extract\" technique due to Nisan and Zuckerman (JCSS '96) and refined by Vadhan (J. Cryptology '04), and by the closely related notion of \"locally-computable extractors\" due to Vadhan. Most notably, whereas Vadhan used such extractors to construct private-key encryption schemes in the bounded-storage model, we show that techniques along these lines can also be used to construct incremental public-key encryption schemes.", "citation": "Not cited", "year": "2012", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Google", "Stony Brook University", "Stanford University", "Hebrew University of Jerusalem"], "conf": "eurocrypt", "authors": ["Ilya Mironov.....http://dblp.org/pers/hd/m/Mironov:Ilya", "Omkant Pandey.....http://dblp.org/pers/hd/p/Pandey:Omkant", "Omer Reingold.....http://dblp.org/pers/hd/r/Reingold:Omer", "Gil Segev.....http://dblp.org/pers/hd/s/Segev:Gil"], "pages": 17}