{"title": "LASTor: A Low-Latency AS-Aware Tor Client.", "fields": ["latency", "autonomous system", "ip forwarding", "low latency", "compromise", "anonymity", "selection algorithm"], "abstract": "The widely used Tor anonymity network is designed to enable low-latency anonymous communication. However, in practice, interactive communication on Tor-which accounts for over 90% of connections in the Tor network [1]-incurs latencies over 5x greater than on the direct Internet path. In addition, since path selection to establish a circuit in Tor is oblivious to Internet routing, anonymity guarantees can breakdown in cases where an autonomous system (AS) can correlate traffic across the entry and exit segments of a circuit. In this paper, we show that both of these shortcomings in Tor can be addressed with only client-side modifications, i.e., without requiring a revamp of the entire Tor architecture. To this end, we design and implement a new Tor client, LASTor. First, we show that LASTor can deliver significant latency gains over the default Tor client by simply accounting for the inferred locations of Tor relays while choosing paths. Second, since the preference for low latency paths reduces the entropy of path selection, we design LASTor's path selection algorithm to be tunable. A user can choose an appropriate tradeoff between latency and anonymity by specifying a value between 0 (lowest latency) and 1 (highest anonymity) for a single parameter. Lastly, we develop an efficient and accurate algorithm to identify paths on which an AS can correlate traffic between the entry and exit segments. This algorithm enables LASTor to avoid such paths and improve a user's anonymity, while the low runtime of the algorithm ensures that the impact on end-to-end latency of communication is low. By applying our techniques to measurements of real Internet paths and by using LASTor to visit the top 200 websites from several geographically-distributed end-hosts, we show that, in comparison to the default Tor client, LASTor reduces median latencies by 25% while also reducing the false negative rate of not detecting a potential snooping AS from 57% to 11%.", "citation": "Citations (100)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "authors": ["Masoud Akhoondi.....http://dblp.org/pers/hd/a/Akhoondi:Masoud", "Curtis Yu.....http://dblp.org/pers/hd/y/Yu:Curtis", "Harsha V. Madhyastha.....http://dblp.org/pers/hd/m/Madhyastha:Harsha_V="], "conf": "sp", "year": "2012", "pages": 15}