{"title": "Mechanism design for finding experts using locally constructed social referral web.", "fields": ["social structure", "referral", "phenomenon", "strategyproof", "mechanism design"], "abstract": "In this work, we address the problem of finding experts using chains of social referrals and profile matching with only local information in online social networks. By assuming that users are selfish, rational, and have privately known cost of participating in the referrals, we design a novel truthful efficient mechanism in which an expert-finding query will be relayed by intermediate users. When receiving a referral request, a participant will locally choose among her neighbors some user to relay the request. In our mechanism, several closely coupled methods are carefully designed to improve the search performance, including, profile matching, social acquaintance prediction, score function for locally choosing relay neighbors, and budget estimation. We conduct extensive experiments on several datasets of online social networks. The extensive study of our mechanism shows that the success rate of our mechanism is about 90% in finding closely matched experts using only local search and limited budget, which significantly improves the previously best rate 20%. The overall cost of finding an expert by our truthful mechanism is about 20% of the untruthful method and only about 2% of the method that always selects high-degree neighbors. The median length of social referral chains is 6 using our localized search decision, which surprisingly matches the well-known small-world phenomenon of global social structures.", "citation": "Citations (8)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Florida", "Illinois Institute of Technology", "Tsinghua University", "Illinois Institute of Technology", "Shanghai University", "Tsinghua University", "Tsinghua University"], "authors": ["Lan Zhang.....http://dblp.org/pers/hd/z/Zhang:Lan", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Qiuyuan Huang.....http://dblp.org/pers/hd/h/Huang:Qiuyuan", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie"], "conf": "infocom", "year": "2012", "pages": 5}