{"title": "Efficient algorithms for sensor deployment and routing in sensor networks for network-structured environment monitoring.", "fields": ["mobile wireless sensor network", "deployment diagram", "key distribution in wireless sensor networks", "sensor web", "sink"], "abstract": "When monitoring environments with wireless sensor networks, optimal sensor deployment is a fundamental issue and an effective means to achieve desired performance. Selecting best sensor deployment has a dependence on the deployment environments. Existing works address sensor deployment within three types of environments including one dimensional line, 2-D field and 3-D space. However, in many applications the deployment environments usually have network structures, which cannot be simply classified as the three types. The deployed locations and communications of sensor nodes are limited onto the network edges, which make the deployment problem distinct from that in other types of environments. In this paper, we study sensor deployment in network-structured environments and aim to achieve k-coverage while minimizing the number of sensor nodes. Furthermore, we jointly consider the optimization of sink deployment and routing strategies with the goal to minimize the network communication cost of data collection. To the best of our knowledge, this paper is the first one to tackle sensor/sink deployment under the deployment constraints imposed by the network structure. The hardness of the problems is shown. Polynomial-time algorithms are proposed to determine optimal sensor/sink deployment and routing strategies in tree-topology network structure. Efficient approximation algorithms are proposed for the general graph network structure and their performances are analyzed. Theoretical results and extensive simulations show the efficiency of the proposed algorithms.", "citation": "Citations (18)", "departments": ["IBM", "Clemson University", "Clemson University", "IBM", "IBM"], "authors": ["Shuguang Xiong.....http://dblp.org/pers/hd/x/Xiong:Shuguang", "Lei Yu.....http://dblp.org/pers/hd/y/Yu_0002:Lei", "Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Chen Wang.....http://dblp.org/pers/hd/w/Wang:Chen", "Wei Lu.....http://dblp.org/pers/hd/l/Lu:Wei"], "conf": "infocom", "year": "2012", "pages": 9}