{"title": "Multidimensional Analysis of Atypical Events in Cyber-Physical Data.", "fields": ["multidimensional analysis", "information integration", "cyber physical system", "baseline", "scalability"], "abstract": "A Cyber-Physical System (CPS) integrates physical devices (e.g., sensors, cameras) with cyber (or informational) components to form a situation-integrated analytical system that may respond intelligently to dynamic changes of the real-world situations. CPS claims many promising applications, such as traffic observation, battlefield surveillance and sensor-network based monitoring. One important research topic in CPS is about the atypical event analysis, i.e., retrieving the events from large amount of data and analyzing them with spatial, temporal and other multi-dimensional information. Many traditional approaches are not feasible for such analysis since they use numeric measures and cannot describe the complex atypical events. In this study, we propose a new model of atypical cluster to effectively represent those events and efficiently retrieve them from massive data. The micro-cluster is designed to summarize individual events, and the macro-cluster is used to integrate the information from multiple event. To facilitate scalable, flexible and online analysis, the concept of significant cluster is defined and a guided clustering algorithm is proposed to retrieve significant clusters in an efficient manner. We conduct experiments on real datasets with the size of more than 50 GB, the results show that the proposed method can provide more accurate information with only 15% to 20% time cost of the baselines.", "citation": "Citations (9)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "National Chiao Tung University"], "authors": ["Lu An Tang.....http://dblp.org/pers/hd/t/Tang:Lu_An", "Xiao Yu.....http://dblp.org/pers/hd/y/Yu:Xiao", "Sangkyum Kim.....http://dblp.org/pers/hd/k/Kim:Sangkyum", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Wen-Chih Peng.....http://dblp.org/pers/hd/p/Peng:Wen=Chih", "Yizhou Sun.....http://dblp.org/pers/hd/s/Sun:Yizhou", "Hector Gonzalez.....http://dblp.org/pers/hd/g/Gonzalez:Hector", "Sebastian Seith.....http://dblp.org/pers/hd/s/Seith:Sebastian"], "conf": "icde", "year": "2012", "pages": 12}