{"title": "The case for GPGPU spatial multitasking.", "fields": ["preemption", "graphics hardware", "speedup", "human multitasking", "instruction set"], "abstract": "The set-top and portable device market continues to grow, as does the demand for more performance under increasing cost, power, and thermal constraints. The integration of Graphics Processing Units (GPUs) into these devices and the emergence of general-purpose computations on graphics hardware enable a new set of highly parallel applications. In this paper, we propose and make the case for a GPU multitasking technique called spatial multitasking. Traditional GPU multitasking techniques, such as cooperative and preemptive multitasking, partition GPU time among applications, while spatial multitasking allows GPU resources to be partitioned among multiple applications simultaneously. We demonstrate the potential benefits of spatial multitasking with an analysis and characterization of General-Purpose GPU (GPGPU) applications. We find that many GPGPU applications fail to utilize available GPU resources fully, which suggests the potential for significant performance benefits using spatial multitasking instead of, or in combination with, preemptive or cooperative multitasking. We then implement spatial multitasking and compare it to cooperative multitasking using simulation. We evaluate several heuristics for partitioning GPU stream multiprocessors (SMs) among applications and find spatial multitasking shows an average speedup of up to 1.19 over cooperative multitasking when two applications are sharing the GPU. Speedups are even higher when more than two applications are sharing the GPU.", "citation": "Citations (134)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "Advanced Micro Devices"], "authors": ["Jacob Adriaens.....http://dblp.org/pers/hd/a/Adriaens:Jacob", "Katherine Compton.....http://dblp.org/pers/hd/c/Compton:Katherine", "Nam Sung Kim.....http://dblp.org/pers/hd/k/Kim:Nam_Sung", "Michael J. Schulte.....http://dblp.org/pers/hd/s/Schulte:Michael_J="], "conf": "hpca", "year": "2012", "pages": 12}