{"title": "Irregular lattices for complex shape grammar facade parsing.", "fields": ["facade", "contextual image classification", "parsing", "shape grammar", "rule based machine translation"], "abstract": "High-quality urban reconstruction requires more than multi-view reconstruction and local optimization. The structure of facades depends on the general layout, which has to be optimized globally. Shape grammars are an established method to express hierarchical spatial relationships, and are therefore suited as representing constraints for semantic facade interpretation. Usually inference uses numerical approximations, or hard-coded grammar schemes. Existing methods inspired by classical grammar parsing are not applicable on real-world images due to their prohibitively high complexity. This work provides feasible generic facade reconstruction by combining low-level classifiers with mid-level object detectors to infer an irregular lattice. The irregular lattice preserves the logical structure of the facade while reducing the search space to a manageable size. We introduce a novel method for handling symmetry and repetition within the generic grammar. We show competitive results on two datasets, namely the Paris 2010 and the Graz 50. The former includes only Hausmannian, while the latter includes Classicism, Biedermeier, Historicism, Art Nouveau and post-modern architectural styles.", "citation": "Citations (66)", "year": "2012", "departments": ["Graz University of Technology", "Graz University of Technology", "Graz University of Technology", "Graz University of Technology", "Graz University of Technology"], "conf": "cvpr", "authors": ["Hayko Riemenschneider.....http://dblp.org/pers/hd/r/Riemenschneider:Hayko", "Ulrich Krispel.....http://dblp.org/pers/hd/k/Krispel:Ulrich", "Wolfgang Thaller.....http://dblp.org/pers/hd/t/Thaller:Wolfgang", "Michael Donoser.....http://dblp.org/pers/hd/d/Donoser:Michael", "Sven Havemann.....http://dblp.org/pers/hd/h/Havemann:Sven", "Dieter W. Fellner.....http://dblp.org/pers/hd/f/Fellner:Dieter_W=", "Horst Bischof.....http://dblp.org/pers/hd/b/Bischof:Horst"], "pages": 8}