{"title": "Environment-aware clock skew estimation and synchronization for wireless sensor networks.", "fields": ["clock drift", "matrix clock", "timing failure", "self clocking signal", "clock gating"], "abstract": "Clock synchronization is a fundamental requirement for network systems. It is particularly crucial and challenging in wireless sensor networks (WSNs), because WSN environments are dynamic and unpredictable. To tackle this problem, how to accurately estimate clock skew, the inherent reason causing clock desynchronization, is investigated. According to the measurement results, clock skew is a non-stationary random process highly correlated to temperature, and its measurements contain severe noises. Based on the observation, an additional information aided multi-model Kalman filter (AMKF) algorithm is proposed, which uses temperature measurements to assist clock skew estimation. Using AMKF, an environment-aware clock synchronization (EACS) scheme is proposed to dynamically compensate clock skew. The scheme is simple, scalable, and of low computation and energy cost. Using EACS as an additional component of the conventional synchronization protocols, the clock is updated with local information before the clock re-synchronization process is triggered, so it can substantially prolong the re-synchronization period, which not only reduces the energy consumption but also is essential for the scenarios where frequent synchronization is infeasible. The theoretical lower bound of clock skew estimation error is derived as a benchmark. Extensive simulation and experimental verification results have demonstrated the feasibility and effectiveness of the proposed scheme which can prolong the time resynchronization period by an order of magnitude in dynamic environments.", "citation": "Citations (55)", "departments": ["University of Victoria", "University of Victoria", "University of New Orleans", "University of Victoria"], "authors": ["Zhe Yang.....http://dblp.org/pers/hd/y/Yang:Zhe", "Lin Cai.....http://dblp.org/pers/hd/c/Cai_0001:Lin", "Yu Liu.....http://dblp.org/pers/hd/l/Liu:Yu", "Jianping Pan.....http://dblp.org/pers/hd/p/Pan_0001:Jianping"], "conf": "infocom", "year": "2012", "pages": 9}