{"title": "Argos: practical many-antenna base stations.", "fields": ["scalability", "multi user mimo", "beamforming", "modular design", "many antennas"], "abstract": "Multi-user multiple-input multiple-output theory predicts manyfold capacity gains by leveraging many antennas on wireless base stations to serve multiple clients simultaneously through multi-user beamforming (MUBF). However, realizing a base station with a large number antennas is non-trivial, and has yet to be achieved in the real-world. We present the design, realization, and evaluation of Argos, the first reported base station architecture that is capable of serving many terminals simultaneously through MUBF with a large number of antennas (M >> 10). Designed for extreme flexibility and scalability, Argos exploits hierarchical and modular design principles, properly partitions baseband processing, and holistically considers real-time requirements of MUBF. Argos employs a novel, completely distributed, beamforming technique, as well as an internal calibration procedure to enable implicit beamforming with channel estimation cost independent of the number of base station antennas. We report an Argos prototype with 64 antennas and capable of serving 15 clients simultaneously. We experimentally demonstrate that by scaling from 1 to 64 antennas the prototype can achieve up to 6.7 fold capacity gains while using a mere 1/64th of the transmission power.", "citation": "Citations (495)", "departments": ["Rice University", "Rice University", "Rice University", "Alcatel-Lucent", "Alcatel-Lucent"], "authors": ["Clayton Shepard.....http://dblp.org/pers/hd/s/Shepard:Clayton", "Hang Yu.....http://dblp.org/pers/hd/y/Yu:Hang", "Narendra Anand.....http://dblp.org/pers/hd/a/Anand:Narendra", "Erran L. Li.....http://dblp.org/pers/hd/l/Li:Erran_L=", "Thomas L. Marzetta.....http://dblp.org/pers/hd/m/Marzetta:Thomas_L=", "Yang Richard Yang.....http://dblp.org/pers/hd/y/Yang:Yang_Richard", "Lin Zhong.....http://dblp.org/pers/hd/z/Zhong_0001:Lin"], "conf": "mobicom", "year": "2012", "pages": 12}