{"title": "Verifying client-side input validation functions using string analysis.", "fields": ["slicing", "validation rule", "javascript", "string", "data validation"], "abstract": "Client-side computation in web applications is becoming increasingly common due to the popularity of powerful client-side programming languages such as JavaScript. Client-side computation is commonly used to improve an applicationâ  s responsiveness by validating user inputs before they are sent to the server. In this paper, we present an analysis technique for checking if a client-side input validation function conforms to a given policy. In our approach, input validation policies are expressed using two regular expressions, one specifying the maximum policy (the upper bound for the set of inputs that should be allowed) and the other specifying the minimum policy (the lower bound for the set of inputs that should be allowed). Using our analysis we can identify two types of errors 1) the input validation function accepts an input that is not permitted by the maximum policy, or 2) the input validation function rejects an input that is permitted by the minimum policy. We implemented our analysis using dynamic slicing to automatically extract the input validation functions from web applications and using automata-based string analysis to analyze the extracted functions. Our experiments demonstrate that our approach is effective in finding errors in input validation functions that we collected from real-world applications and from tutorials and books for teaching JavaScript.", "citation": "Citations (12)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Muath Alkhalaf.....http://dblp.org/pers/hd/a/Alkhalaf:Muath", "Tevfik Bultan.....http://dblp.org/pers/hd/b/Bultan:Tevfik", "Jose L. Gallegos.....http://dblp.org/pers/hd/g/Gallegos:Jose_L="], "conf": "icse", "year": "2012", "pages": 11}