{"title": "Semi-automated magazine layout using content-based image features.", "fields": ["face detection", "comprehensive layout", "page layout", "feature", "html5"], "abstract": "We present a system for automating magazine layout process and data on its performance in a user evaluation test. The purpose of the study is to find the feasibility of the key system variables on the end-user. This semi-automatic system is based on content-based image feature algorithms to automate the layout process. The image related automation includes image cropping, overlaying text on top of images, image color palette creation, and image alignment. The algorithms rely on principles of photography and are used here together in the context of graphic design. For example the rule-of-space and leading line concepts can be extended to layout contexts for improved alignment of text and images. The computation is based on automatic analysis, such as face detection, color saliency, and textureness. We used the automation to create a functional prototype, an iPad magazine, using an open HTML5 eBook framework, which relies on CSS3 media queries for the layout adaptation. User experiments (40 participants) were conducted where the system was compared against two commercial iPad magazine systems in terms of overall usability with emphasis on visual aspects. Questionnaires and free commenting was used in a task-based usage scenario. The experiments were video recorded and the user comments were transcribed and coded into attributes. Usability results mixed with qualitative observation are reported. Results show that usability, read- ability and visuality are important to the users. Our system was considered more usable than the other two systems with some of the defining aspects being simplicity in terms of usability, subjective readability and visual clarity.", "citation": "Citations (12)", "departments": ["Aalto University", "Aalto University", "Aalto University"], "authors": ["Mikko Kuhna.....http://dblp.org/pers/hd/k/Kuhna:Mikko", "Ida-Maria Kivelä.....http://dblp.org/pers/hd/k/Kivel=auml=:Ida=Maria", "Pirkko Oittinen.....http://dblp.org/pers/hd/o/Oittinen:Pirkko"], "conf": "mm", "year": "2012", "pages": 10}