{"title": "Locating sensors in the forest: A case study in GreenOrbs.", "fields": ["wireless sensor network", "calibration", "ranging", "testbed", "propagation of uncertainty"], "abstract": "As a large scale real sensor network system, GreenOrbs reveals that locating sensor nodes in the forest still faces great challenges because of volatile and fluctuating environmental factors. In this paper, we present a novel localization scheme, EARL, which provides accurate reference nodes and good ranging quality. We exam the range quality along routing paths by taking complex environmental factors into account, such as forest density, temperature and humidity. To improve localization accuracy, we use power scanning technique to judge the accuracy reference nodes and further calibrate the bad nodes through reverse-localization. To overcome the error propagation, we assign different weights to the range measurement according to the ranging quality. We implemented our localization scheme in GreenOrbs testbed, and evaluate through extensive experiments. The results demonstrate that EARL outperforms the current localization approaches with better accuracy. The localization accuracy achieved by our method is around 20% higher than best existing methods.", "citation": "Citations (22)", "departments": ["Illinois Institute of Technology", "Beijing University of Posts and Telecommunications", "Illinois Institute of Technology", "Illinois Institute of Technology", "Beijing University of Posts and Telecommunications"], "authors": ["Cheng Bo.....http://dblp.org/pers/hd/b/Bo:Cheng", "Danping Ren.....http://dblp.org/pers/hd/r/Ren:Danping", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "XuFei Mao.....http://dblp.org/pers/hd/m/Mao:XuFei", "Qiuyuan Huang.....http://dblp.org/pers/hd/h/Huang:Qiuyuan", "Lufeng Mo.....http://dblp.org/pers/hd/m/Mo:Lufeng", "Zhiping Jiang.....http://dblp.org/pers/hd/j/Jiang:Zhiping", "Yongmei Sun.....http://dblp.org/pers/hd/s/Sun:Yongmei", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2012", "pages": 9}