{"title": "Backpressure with Adaptive Redundancy (BWAR).", "fields": ["network packet", "queue", "redundancy", "dynamic network analysis", "backpressure routing"], "abstract": "Backpressure scheduling and routing, in which packets are preferentially transmitted over links with high queue differentials, offers the promise of throughput-optimal operation for a wide range of communication networks. However, when the traffic load is low, due to the corresponding low queue occupancy, backpressure scheduling/routing experiences long delays. This is particularly of concern in intermittent encounter-based mobile networks which are already delay-limited due to the sparse and highly dynamic network connectivity. While state of the art mechanisms for such networks have proposed the use of redundant transmissions to improve delay, they do not work well when the traffic load is high. We propose in this paper a novel hybrid approach that we refer to as backpressure with adaptive redundancy (BWAR), which provides the best of both worlds. This approach is highly robust and distributed and does not require any prior knowledge of network load conditions. We evaluate BWAR through both mathematical analysis and simulations based on a cell-partitioned model. We prove theoretically that BWAR does not perform worse than traditional backpressure in terms of the maximum throughput, while yielding a better delay bound. The simulations confirm that BWAR outperforms traditional backpressure at low load, while outperforming a state of the art encounter-routing scheme (Spray and Wait) at high load.", "citation": "Citations (66)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California"], "authors": ["Majed Alresaini.....http://dblp.org/pers/hd/a/Alresaini:Majed", "Maheswaran Sathiamoorthy.....http://dblp.org/pers/hd/s/Sathiamoorthy:Maheswaran", "Bhaskar Krishnamachari.....http://dblp.org/pers/hd/k/Krishnamachari:Bhaskar", "Michael J. Neely.....http://dblp.org/pers/hd/n/Neely:Michael_J="], "conf": "infocom", "year": "2012", "pages": 9}