{"title": "Abstractions for Usable Information Flow Control in Aeolus.", "fields": ["closure", "software design pattern", "computer security model", "volatile", "information flow"], "abstract": "Despite the increasing importance of protecting confidential data, building secure software remains as challenging as ever. This paper describes Aeolus, a new platform for building secure distributed applications. Aeolus uses information flow control to provide confidentiality and data integrity. It differs from previous information flow control systems in a way that we believe makes it easier to understand and use. Aeolus uses a new, simpler security model, the first to combine a standard principal-based scheme for authority management with thread-granularity information flow tracking. The principal hierarchy matches the way developers already reason about authority and access control, and the coarse-grained information flow tracking eases the task of defining a program's security restrictions. In addition, Aeolus provides a number of new mechanisms (authority closures, compound tags, boxes, and shared volatile state) that support common design patterns in secure application design.", "citation": "Citations (77)", "departments": ["IBM", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Stanford University", "Princeton University"], "authors": ["Winnie Cheng.....http://dblp.org/pers/hd/c/Cheng:Winnie", "Dan R. K. Ports.....http://dblp.org/pers/hd/p/Ports:Dan_R=_K=", "David A. Schultz.....http://dblp.org/pers/hd/s/Schultz:David_A=", "Victoria Popic.....http://dblp.org/pers/hd/p/Popic:Victoria", "Aaron Blankstein.....http://dblp.org/pers/hd/b/Blankstein:Aaron", "James A. Cowling.....http://dblp.org/pers/hd/c/Cowling:James_A=", "Dorothy Curtis.....http://dblp.org/pers/hd/c/Curtis:Dorothy", "Liuba Shrira.....http://dblp.org/pers/hd/s/Shrira:Liuba", "Barbara Liskov.....http://dblp.org/pers/hd/l/Liskov:Barbara"], "conf": "usenix", "year": "2012", "pages": 13}