{"title": "An Empirical Study of Memory Sharing in Virtual Machines.", "fields": ["address space layout randomization", "real time computing", "distributed computing", "empirical research", "virtual machine"], "abstract": "Content-based page sharing is a technique often used in virtualized environments to reduce server memory requirements. Many systems have been proposed to capture the benefits of page sharing. However, there have been few analyses of page sharing in general, both considering its real-world utility and typical sources of sharing potential. We provide insight into this issue through an exploration and analysis of memory traces captured from real user machines and controlled virtual machines. First, we observe that absolute sharing levels (excluding zero pages) generally remain under 15%, contrasting with prior work that has often reported savings of 30% or more. Second, we find that sharing within individual machines often accounts for nearly all (>90%) of the sharing potential within a set of machines, with inter-machine sharing contributing only a small amount. Moreover, even small differences between machines significantly reduce what little inter-machine sharing might otherwise be possible. Third, we find that OS features like address space layout randomization can further diminish sharing potential. These findings both temper expectations of real-world sharing gains and suggest that sharing efforts may be equally effective if employed within the operating system of a single machine, rather than exclusively targeting groups of virtual machines.", "citation": "Citations (68)", "departments": ["University of Massachusetts Amherst", "George Washington University", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Sean Kenneth Barker.....http://dblp.org/pers/hd/b/Barker:Sean_Kenneth", "Timothy Wood.....http://dblp.org/pers/hd/w/Wood_0001:Timothy", "Prashant J. Shenoy.....http://dblp.org/pers/hd/s/Shenoy:Prashant_J=", "Ramesh K. Sitaraman.....http://dblp.org/pers/hd/s/Sitaraman:Ramesh_K="], "conf": "usenix", "year": "2012", "pages": 12}