{"title": "Multimodal feature fusion for robust event detection in web videos.", "fields": ["scale analysis", "multiple kernel learning", "trecvid", "exploit", "fusion"], "abstract": "Combining multiple low-level visual features is a proven and effective strategy for a range of computer vision tasks. However, limited attention has been paid to combining such features with information from other modalities, such as audio and videotext, for large scale analysis of web videos. In our work, we rigorously analyze and combine a large set of low-level features that capture appearance, color, motion, audio and audio-visual co-occurrence patterns in videos. We also evaluate the utility of high-level (i.e., semantic) visual information obtained from detecting scene, object, and action concepts. Further, we exploit multimodal information by analyzing available spoken and videotext content using state-of-the-art automatic speech recognition (ASR) and videotext recognition systems. We combine these diverse features using a two-step strategy employing multiple kernel learning (MKL) and late score level fusion methods. Based on the TRECVID MED 2011 evaluations for detecting 10 events in a large benchmark set of ∼45000 videos, our system showed the best performance among the 19 international teams.", "citation": "Citations (157)", "year": "2012", "departments": ["BBN Technologies", "BBN Technologies", "BBN Technologies", "BBN Technologies", "BBN Technologies"], "conf": "cvpr", "authors": ["Pradeep Natarajan.....http://dblp.org/pers/hd/n/Natarajan:Pradeep", "Shuang Wu.....http://dblp.org/pers/hd/w/Wu:Shuang", "Shiv Naga Prasad Vitaladevuni.....http://dblp.org/pers/hd/v/Vitaladevuni:Shiv_Naga_Prasad", "Xiaodan Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Xiaodan", "Stavros Tsakalidis.....http://dblp.org/pers/hd/t/Tsakalidis:Stavros", "Unsang Park.....http://dblp.org/pers/hd/p/Park:Unsang", "Rohit Prasad.....http://dblp.org/pers/hd/p/Prasad:Rohit", "Premkumar Natarajan.....http://dblp.org/pers/hd/n/Natarajan:Premkumar"], "pages": 8}