{"title": "New Limits to Classical and Quantum Instance Compression.", "fields": ["information bottleneck method", "kernelization", "quantum state", "if and only if", "quantum algorithm", "classical capacity", "fold", "polynomial hierarchy", "quantum chaos", "quantum", "bounded function", "compression"], "abstract": "Given an instance of a hard decision problem, a limited goal is to \\emph{compress} that instance into a smaller, equivalent instance of a second problem. As one example, consider the problem where, given Boolean formulas $\\psi^1, \\ldots, \\psi^t$, we must determine if at least one $\\psi^j$ is satisfiable. An \\emph{$\\mathrm{OR}$-compression scheme} for SAT is a polynomial-time reduction that maps $(\\psi^1, \\ldots, \\psi^t)$ to a string $z$, such that $z$ lies in some ``target'' language $L'$ if and only if $\\bigvee_j [\\psi^j \\in \\mathrm{SAT}]$ holds. (Here, $L'$ can be arbitrarily complex.) AND-compression schemes are defined similarly. A compression scheme is \\emph{strong} if $|z|$ is polynomially bounded in $n = \\max_j |\\psi^j|$, independent of $t$. Strong compression for SAT seems unlikely. Work of Harnik and Naor (FOCS '06/SICOMP '10) and Bodlaender, Downey, Fellows, and Hermelin (ICALP '08/JCSS '09) showed that the infeasibility of strong OR-compression for SAT would show limits to instance compression for a large number of natural problems. Bodlaender et al. also showed that the infeasibility of strong AND-compression for SAT would have consequences for a different list of problems. Motivated by this, Fort now and Santhanam (STOC '08/JCSS '11) showed that if SAT is strongly OR-compressible, then $\\mathsf{NP} \\subseteq \\mathsf{coNP/poly}$. Finding similar evidence against AND-compression was left as an open question. We provide such evidence: we show that strong AND- \\emph{or} OR-compression for SAT would imply \\emph{non-uniform, statistical zero-knowledge proofs} for SAT -- an even stronger and more unlikely consequence than $\\mathsf{NP} \\subseteq \\mathsf{coNP/poly}$. Our method applies against \\emph{probabilistic} compression schemes of sufficient ``quality'' with respect to the reliability and compression amount (allowing for tradeoff). This greatly strengthens the evidence given by Fort now and Santhanam against probabilistic OR-compression for SAT. We also give variants of these results for the analogous task of \\emph{quantum instance compression}, in which a polynomial-time quantum reduction must output a quantum state that, in an appropriate sense, ``preserves the answer'' to the input instance. The central idea in our proofs is to exploit the information bottleneck in an AND-compression scheme for a language $L$ in order to fool a cheating prover in a proof system for $\\over line{L}$. Our key technical tool is a new method to ``disguise'' information being fed into a compressive mapping, we believe this method may find other applications.", "citation": "Citations (103)", "year": "2012", "departments": ["Massachusetts Institute of Technology"], "conf": "focs", "authors": ["Andrew Drucker.....http://dblp.org/pers/hd/d/Drucker:Andrew"], "pages": 10}