{"title": "Room-sized informal telepresence system.", "fields": ["eye contact", "panorama", "display device", "casual", "graphics processing unit"], "abstract": "We present a room-sized telepresence system for informal gatherings rather than conventional meetings. Unlike conventional systems which constrain participants to sit in fixed positions, our system aims to facilitate casual conversations between people in two sites. The system consists of a wall of large flat displays at each of the two sites, showing a panorama of the remote scene, constructed from a multiplicity of color and depth cameras. The main contribution of this paper is a solution that ameliorates the eye contact problem during conversation in typical scenarios while still maintaining a consistent view of the entire room for all participants. We achieve this by using two sets of cameras — a cluster of ”Panorama Cameras” located at the center of the display wall and are used to capture a panoramic view of the entire room, and a set of ”Personal Cameras” distributed along the display wall to capture front views of nearby participants. A robust segmentation algorithm with the assistance of depth cameras and an image synthesis algorithm work together to generate a consistent view of the entire scene. In our experience this new approach generates fewer distracting artifacts than conventional 3D reconstruction methods, while effectively correcting for eye gaze.", "citation": "Citations (10)", "departments": ["University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "Cisco Systems, Inc."], "authors": ["Mingsong Dou.....http://dblp.org/pers/hd/d/Dou:Mingsong", "Ying Shi.....http://dblp.org/pers/hd/s/Shi:Ying", "Jan-Michael Frahm.....http://dblp.org/pers/hd/f/Frahm:Jan=Michael", "Henry Fuchs.....http://dblp.org/pers/hd/f/Fuchs:Henry", "Bill Mauchly.....http://dblp.org/pers/hd/m/Mauchly:Bill", "Mod Marathe.....http://dblp.org/pers/hd/m/Marathe:Mod"], "conf": "vr", "year": "2012", "pages": 4}