{"title": "TIRAMOLA: elastic nosql provisioning through a cloud management platform.", "fields": ["cloud management", "modular design", "markov decision process", "nosql", "provisioning"], "abstract": "NoSQL databases focus on analytical processing of large scale datasets, offering increased scalability over commodity hardware. One of their strongest features is elasticity, which allows for fairly portioned premiums and high-quality performance. Yet, the process of adaptive expansion and contraction of resources usually involves a lot of manual effort, often requiring the definition of the conditions for scaling up or down to be provided by the users. To date, there exists no open-source system for automatic resizing of NoSQL clusters. In this demonstration, we present TIRAMOLA, a modular, cloud-enabled framework for monitoring and adaptively resizing NoSQL clusters. Our system incorporates a decision-making module which allows for optimal cluster resize actions in order to maximize any quantifiable reward function provided together with life-long adaptation to workload or infrastructural changes. The audience will be able to initiate HBase clusters of various sizes and apply varying workloads through multiple YCSB clients. The attendees will be able to watch, in real-time, the system perform automatic VM additions and removals as well as how cluster performance metrics change relative to the optimization parameters of their choice.", "citation": "Citations (22)", "year": "2012", "departments": ["National Technical University of Athens", "National Technical University of Athens", "Ionian University", "National Technical University of Athens", "National Technical University of Athens"], "conf": "sigmod", "authors": ["Ioannis Konstantinou.....http://dblp.org/pers/hd/k/Konstantinou:Ioannis", "Evangelos Angelou.....http://dblp.org/pers/hd/a/Angelou:Evangelos", "Dimitrios Tsoumakos.....http://dblp.org/pers/hd/t/Tsoumakos:Dimitrios", "Christina Boumpouka.....http://dblp.org/pers/hd/b/Boumpouka:Christina", "Nectarios Koziris.....http://dblp.org/pers/hd/k/Koziris:Nectarios", "Spyros Sioutas.....http://dblp.org/pers/hd/s/Sioutas:Spyros"], "pages": 4}