{"title": "Optimal private halfspace counting via discrepancy.", "fields": ["bounded function", "binary logarithm", "hyperplane", "discrepancy theory", "counting problem"], "abstract": "A range counting problem is specified by a set P of size |P| = n of points in R d , an integer weight x p  associated to each point p ∈ P, and a range space R ⊆ 2 P . Given a query range R ∈ R, the output is R(x) = ∑ p ∈ R x p . The average squared error of an algorithm A is 1/|R|∑ R ∈ R ((A(R, x) - R(x))) 2 . Range counting for different range spaces is a central problem in Computational Geometry. We study (e, δ)-differentially private algorithms for range counting. Our main results are for the range space given by hyperplanes, that is, the halfspace counting problem. We present an (e, δ)-differentially private algorithm for halfspace counting in d dimensions which is O(n 1-1/d ) approximate for average squared error. This contrasts with the Ω(n) lower bound established by the classical result of Dinur and Nissim on approximation for arbitrary subset counting queries. We also show a matching lower bound of Ω(n 1-1/d ) approximation for any (e, δ)-differentially private algorithm for halfspace counting.   Both bounds are obtained using discrepancy theory. For the lower bound, we use a modified discrepancy measure and bound approximation of (e, δ)-differentially private algorithms for range counting queries in terms of this discrepancy. We also relate the modified discrepancy measure to classical combinatorial discrepancy, which allows us to exploit known discrepancy lower bounds. This approach also yields a lower bound of Ω((log n) d-1 ) for (e, δ)-differentially private orthogonal range counting in d dimensions, the first known superconstant lower bound for this problem. For the upper bound, we use an approach inspired by partial coloring methods for proving discrepancy upper bounds, and obtain (e, δ)-differentially private algorithms for range counting with polynomially bounded shatter function range spaces.", "citation": "Citations (27)", "year": "2012", "departments": ["Rutgers University", "Rutgers University"], "conf": "stoc", "authors": ["S. Muthukrishnan.....http://dblp.org/pers/hd/m/Muthukrishnan:S=", "Aleksandar Nikolov.....http://dblp.org/pers/hd/n/Nikolov:Aleksandar"], "pages": 8}