{"title": "A distributed Newton's method for joint multi-hop routing and flow control: Theory and algorithm.", "fields": ["information theory", "rate of convergence", "network planning and design", "newton s method", "subgradient method"], "abstract": "The fast growing scale and heterogeneity of current communication networks necessitate the design of distributed cross-layer optimization algorithms. So far, the standard approach of distributed cross-layer design is based on dual decomposition and the subgradient algorithm, which is a first-order method that has a slow convergence rate. In this paper, we focus on solving a joint multi-path routing and flow control (MRFC) problem by designing a new distributed Newton's method, which is a second-order method and enjoys a quadratic rate of convergence. The major challenges in developing a distributed Newton's method lie in decentralizing the computation of the Hessian matrix and its inverse for both the primal Newton direction and dual variable updates. By appropriately reformulating, rearranging, and exploiting the special problem structures, we show that it is possible to decompose such computations into source nodes and links in the network, thus eliminating the need for global information. Furthermore, we derive closed-form expressions for both the primal Newton direction and dual variable updates, thus significantly reducing the computational complexity. The most attractive feature of our proposed distributed Newton's method is that it requires almost the same scale of information exchange as in first-order methods, while achieving a quadratic rate of convergence as in centralized Newton methods. We provide extensive numerical results to demonstrate the efficacy of our proposed algorithm. Our work contributes to the advanced paradigm shift in cross-layer network design that is evolving from first-order to second-order methods.", "citation": "Citations (10)", "departments": ["Ohio State University", "Virginia Tech"], "authors": ["Jia Liu.....http://dblp.org/pers/hd/l/Liu_0002:Jia", "Hanif D. Sherali.....http://dblp.org/pers/hd/s/Sherali:Hanif_D="], "conf": "infocom", "year": "2012", "pages": 9}