{"title": "PharmaLeaks: Understanding the Business of Online Pharmaceutical Affiliate Programs.", "fields": ["email spam", "exploit", "search engine optimization", "counterfeit", "transaction log"], "abstract": "Online sales of counterfeit or unauthorized products drive a robust underground advertising industry that includes email spam, \"black hat\" search engine optimization, forum abuse and so on. Virtually everyone has encountered enticements to purchase drugs, prescription-free, from an online \"Canadian Pharmacy.\" However, even though such sites are clearly economically motivated, the shape of the underlying business enterprise is not well understood precisely because it is \"underground.\" In this paper we exploit a rare opportunity to view three such organizations--the GlavMed, SpamIt and RX-Promotion pharmaceutical affiliate programs-- from the inside. Using \"ground truth\" data sets including four years of raw transaction logs covering over $170 million in sales, we provide an in-depth empirical analysis of worldwide consumer demand, the key role of independent third-party advertisers, and a detailed cost accounting of the overall business model.", "citation": "Citations (119)", "year": "2012", "departments": ["George Mason University", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "uss", "authors": ["Damon McCoy.....http://dblp.org/pers/hd/m/McCoy:Damon", "Andreas Pitsillidis.....http://dblp.org/pers/hd/p/Pitsillidis:Andreas", "Grant Jordan.....http://dblp.org/pers/hd/j/Jordan:Grant", "Nicholas Weaver.....http://dblp.org/pers/hd/w/Weaver:Nicholas", "Christian Kreibich.....http://dblp.org/pers/hd/k/Kreibich:Christian", "Brian Krebs.....http://dblp.org/pers/hd/k/Krebs:Brian", "Geoffrey M. Voelker.....http://dblp.org/pers/hd/v/Voelker:Geoffrey_M=", "Stefan Savage.....http://dblp.org/pers/hd/s/Savage:Stefan", "Kirill Levchenko.....http://dblp.org/pers/hd/l/Levchenko:Kirill"], "pages": 16}