{"title": "Immersive multiplayer tennis with microsoft kinect and body sensor networks.", "fields": ["immersion", "wearable computer", "point cloud", "attitude and heading reference system", "virtual machine"], "abstract": "We present an immersive gaming demonstration using the minimum amount of wearable sensors. The game demonstrated is two-player tennis. We combine a virtual environment with real 3D representations of physical objects like the players and the tennis racquet (if available). The main objective of the game is to provide as real an experience of tennis as possible, while also being as less intrusive as possible. The game is played across a network, and this opens the possibility of two remote players playing a game together on a single virtual tennis pitch. The Microsoft Kinect sensors are used to obtain a 3D point cloud and a skeletal map representation of the player. This 3D point cloud is mapped on to the virtual tennis pitch. We also use a wireless wearable Attitude and Heading Reference System (AHRS) mote, which is strapped onto the wrist of the players. This mote gives us precise information about the movement (swing, rotation etc.) of the playing arm. This information along with the skeletal map is used to implement the physics of the game. Using this game we demonstrate our solutions for simultaneous data acquisition, 3D point-cloud mapping in a virtual space, use of the Kinect and AHRS sensors to calibrate real and virtual objects and for interaction of virtual objects with a 3D point cloud.", "citation": "Citations (4)", "departments": ["University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas"], "authors": ["Suraj Raghuraman.....http://dblp.org/pers/hd/r/Raghuraman:Suraj", "Karthik Venkatraman.....http://dblp.org/pers/hd/v/Venkatraman:Karthik", "Zhanyu Wang.....http://dblp.org/pers/hd/w/Wang:Zhanyu", "Jian Wu.....http://dblp.org/pers/hd/w/Wu:Jian", "Jacob Clements.....http://dblp.org/pers/hd/c/Clements:Jacob", "Reza Lotfian.....http://dblp.org/pers/hd/l/Lotfian:Reza", "Balakrishnan Prabhakaran.....http://dblp.org/pers/hd/p/Prabhakaran:Balakrishnan", "Xiaohu Guo.....http://dblp.org/pers/hd/g/Guo:Xiaohu", "Roozbeh Jafari.....http://dblp.org/pers/hd/j/Jafari:Roozbeh", "Klara Nahrstedt.....http://dblp.org/pers/hd/n/Nahrstedt:Klara"], "conf": "mm", "year": "2012", "pages": 4}