{"title": "Accurate Fine-Grained Processor Power Proxies.", "fields": ["power management", "workload", "clock rate", "firmware", "granularity"], "abstract": "There are not yet practical and accurate ways to directly measure core power in a microprocessor. This limits the granularity of measurement and control for computer power management. We overcome this limitation by presenting an accurate runtime per-core power proxy which closely estimates true core power. This enables new fine-grained microprocessor power management techniques at the core level. For example, cloud environments could manage and bill virtual machines for energy consumption associated with the core. The power model underlying our power proxy also enables energy-efficiency controllers to perform what-if analysis, instead of merely reacting to current conditions. We develop and validate a methodology for accurate power proxy training at both chip and core levels. Our implementation of power proxies uses on-chip logic in a high-performance multi-core processor and associated platform firmware. The power proxies account for full voltage and frequency ranges, as well as chip-to-chip process variations. For fixed clock frequency operation, a mean unsigned error of 1.8% for fine-grained 32ms samples across all workloads was achieved. For an interval of an entire workload, we achieve an average error of-0.2%. Similar results were achieved for voltage-scaling scenarios, too. We also present two sample applications of the power proxy: (1) per-core power billing for cloud computing services, and (2) simultaneous runtime energy saving comparisons among different power management policies without running each policy separately.", "citation": "Citations (29)", "departments": ["Advanced Micro Devices", "IBM", "IBM", "IBM", "IBM"], "authors": ["Wei Huang.....http://dblp.org/pers/hd/h/Huang_0004:Wei", "Charles Lefurgy.....http://dblp.org/pers/hd/l/Lefurgy:Charles", "William Kuk.....http://dblp.org/pers/hd/k/Kuk:William", "Alper Buyuktosunoglu.....http://dblp.org/pers/hd/b/Buyuktosunoglu:Alper", "Michael S. Floyd.....http://dblp.org/pers/hd/f/Floyd:Michael_S=", "Karthick Rajamani.....http://dblp.org/pers/hd/r/Rajamani:Karthick", "Malcolm Allen-Ware.....http://dblp.org/pers/hd/a/Allen=Ware:Malcolm", "Bishop Brock.....http://dblp.org/pers/hd/b/Brock:Bishop"], "conf": "micro", "year": "2012", "pages": 11}