{"title": "Providing safe, user space access to fast, solid state disks.", "fields": ["ssh file transfer protocol", "unix file types", "self certifying file system", "resolv conf", "file system fragmentation"], "abstract": "Emerging fast, non-volatile memories (e.g., phase change memories, spin-torque MRAMs, and the memristor) reduce storage access latencies by an order of magnitude compared to state-of-the-art flash-based SSDs. This improved performance means that software overheads that had little impact on the performance of flash-based systems can present serious bottlenecks in systems that incorporate these new technologies. We describe a novel storage hardware and software architecture that nearly eliminates two sources of this overhead: Entering the kernel and performing file system permission checks. The new architecture provides a private, virtualized interface for each process and moves file system protection checks into hardware. As a result, applications can access file data without operating system intervention, eliminating OS and file system costs entirely for most accesses. We describe the support the system provides for fast permission checks in hardware, our approach to notifying applications when requests complete, and the small, easily portable changes required in the file system to support the new access model. Existing applications require no modification to use the new interface. We evaluate the performance of the system using a suite of microbenchmarks and database workloads and show that the new interface improves latency and bandwidth for 4 KB writes by 60% and 7.2x, respectively, OLTP database transaction throughput by up to 2.0x, and Berkeley-DB throughput by up to 5.7x. A streamlined asynchronous file IO interface built to fully utilize the new interface enables an additional 5.5x increase in throughput with 1 thread and 2.8x increase in efficiency for 512 B transfers.", "citation": "Citations (156)", "year": "2012", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "asplos", "authors": ["Adrian M. Caulfield.....http://dblp.org/pers/hd/c/Caulfield:Adrian_M=", "Todor I. Mollov.....http://dblp.org/pers/hd/m/Mollov:Todor_I=", "Louis Alex Eisner.....http://dblp.org/pers/hd/e/Eisner:Louis_Alex", "Arup De.....http://dblp.org/pers/hd/d/De:Arup", "Joel Coburn.....http://dblp.org/pers/hd/c/Coburn:Joel", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "pages": 14}