{"title": "A High-Fidelity Temperature Distribution Forecasting System for Data Centers.", "fields": ["data center", "temperature measurement", "cloud computing", "high fidelity", "server"], "abstract": "Data centers have become a critical computing infrastructure in the era of cloud computing. Temperature monitoring and forecasting are essential for preventing overheating-induced server shutdowns and improving a data center's energy efficiency. This paper presents a novel cyber-physical approach for temperature forecasting in data centers, which integrates Computational Fluid Dynamics (CFD) modeling, in situ wireless sensing, and real-time data-driven prediction. To ensure the forecasting fidelity, we leverage the realistic physical thermodynamic models of CFD to generate transient temperature distribution and calibrate it using sensor feedback. Both simulated temperature distribution and sensor measurements are then used to train a real-time prediction algorithm. As a result, our approach significantly reduces the computational complexity of online temperature modeling and prediction, which enables a portable, noninvasive thermal monitoring solution that does not rely on the infrastructure of monitored data center. We extensively evaluated our system on a rack of 15 servers and a test bed of five racks and 229 servers in a production data center. Our results show that our system can predict the temperature evolution of servers with highly dynamic workloads at an average error of 0.52C, within a duration up to 10 minutes.", "citation": "Citations (21)", "year": "2012", "departments": ["Michigan State University", "Michigan State University", "Michigan State University", "Michigan State University", "Ohio State University"], "conf": "rtss", "authors": ["Jinzhu Chen.....http://dblp.org/pers/hd/c/Chen:Jinzhu", "Rui Tan.....http://dblp.org/pers/hd/t/Tan:Rui", "Yu Wang.....http://dblp.org/pers/hd/w/Wang_0020:Yu", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Xiaorui Wang.....http://dblp.org/pers/hd/w/Wang:Xiaorui", "Xiaodong Wang.....http://dblp.org/pers/hd/w/Wang:Xiaodong", "Bill Punch.....http://dblp.org/pers/hd/p/Punch:Bill", "Dirk Colbry.....http://dblp.org/pers/hd/c/Colbry:Dirk"], "pages": 10}