{"title": "The use of on-line co-training to reduce the training set size in pattern recognition methods: Application to left ventricle segmentation in ultrasound.", "fields": ["deep belief network", "data modeling", "bayesian network", "probabilistic logic", "co training"], "abstract": "The use of statistical pattern recognition models to segment the left ventricle of the heart in ultrasound images has gained substantial attention over the last few years. The main obstacle for the wider exploration of this methodology lies in the need for large annotated training sets, which are used for the estimation of the statistical model parameters. In this paper, we present a new on-line co-training methodologythat reduces the need for large training sets for such parameter estimation. Our approach learns the initial parameters of two different models using a small manually annotated training set. Then, given each frame of a test sequence, the methodology not only produces the segmentation of the current frame, but it also uses the results of both classifiers to retrain each other incrementally. This on-line aspect of our approach has the advantages of producing segmentation results and retraining the classifiers on the fly as frames of a test sequence are presented, but it introduces a harder learning setting compared to the usual off-line co-training, where the algorithm has access to the whole set of un-annotated training samples from the beginning. Moreover, we introduce the use of the following new types of classifiers in the co-training framework: deep belief network and multiple model probabilistic data association. We show that our method leads to a fully automatic left ventricle segmentation system that achieves state-of-the-art accuracy on a public database with training sets containing at least twenty annotated images.", "citation": "Citations (3)", "year": "2012", "departments": ["University of Adelaide", "Instituto de Si ... cnico, Portugal"], "conf": "cvpr", "authors": ["Gustavo Carneiro.....http://dblp.org/pers/hd/c/Carneiro:Gustavo", "Jacinto C. Nascimento.....http://dblp.org/pers/hd/n/Nascimento:Jacinto_C="], "pages": 8}