{"title": "A server's perspective of Internet streaming delivery to mobile devices.", "fields": [], "abstract": "Receiving Internet streaming services on various mobile devices is getting more and more popular. To understand and better support Internet streaming delivery to mobile devices, a number of studies have been conducted. However, existing studies have mainly focused on the client side resource consumption and streaming quality. So far, little is known about the server side, which is the key for providing successful mobile streaming services. In this work, we set to investigate the Internet mobile streaming service at the server side. For this purpose, we have collected a one-month server log (with 212 TB delivered video traffic) from a top Internet mobile streaming service provider serving worldwide mobile users. Through trace analysis, we find that (1) a major challenge for providing Internet mobile streaming services is rooted from the mobile device hardware and software heterogeneity. In this workload, we find over 2800 different hardware models with about 100 different screen resolutions running 14 different mobile OS and 3 audio codecs and 4 video codecs. (2) To deal with the device heterogeneity, transcoding is used to customize the video to the appropriate versions at runtime for different devices. A video clip could be transcoded into more than 40 different versions in order to serve requests from different devices. (3) Compared to videos in traditional Internet streaming, mobile streaming videos are typically of much smaller size (a median of 1.68 MBytes) and shorter duration (a median of 2.7 minutes). Furthermore, the daily mobile user accesses are more skewed following a Zipf-like distribution but users' interests also quickly shift. Considering the huge demand of CPU cycles for online transcoding, we further examine server-side caching in order to reduce CPU cycle demand. We show that a policy considering different versions of a video altogether outperforms other intuitive ones when the cache size is limited.", "citation": "Citations (28)", "departments": ["George Mason University", "George Mason University", "Ohio State University", "George Mason University", "Vuclip, Milpitas, CA, USA"], "authors": ["Yao Liu.....http://dblp.org/pers/hd/l/Liu_0001:Yao", "Fei Li.....http://dblp.org/pers/hd/l/Li_0001:Fei", "Lei Guo.....http://dblp.org/pers/hd/g/Guo_0004:Lei", "Bo Shen.....http://dblp.org/pers/hd/s/Shen:Bo", "Songqing Chen.....http://dblp.org/pers/hd/c/Chen:Songqing"], "conf": "infocom", "year": "2012", "pages": 9}