{"title": "iDedup: latency-aware, inline data deduplication for primary storage.", "fields": ["data deduplication", "cache", "locality of reference", "latency", "locality"], "abstract": "Deduplication technologies are increasingly being deployed to reduce cost and increase space-efficiency in corporate data centers. However, prior research has not applied deduplication techniques inline to the request path for latency sensitive, primary workloads. This is primarily due to the extra latency these techniques introduce. Inherently, deduplicating data on disk causes fragmentation that increases seeks for subsequent sequential reads of the same data, thus, increasing latency. In addition, deduplicating data requires extra disk IOs to access on-disk deduplication metadata. In this paper, we propose an inline deduplication solution, iDedup, for primary workloads, while minimizing extra IOs and seeks.\n\nOur algorithm is based on two key insights from real-world workloads: i) spatial locality exists in duplicated primary data; and ii) temporal locality exists in the access patterns of duplicated data. Using the first insight, we selectively deduplicate only sequences of disk blocks. This reduces fragmentation and amortizes the seeks caused by deduplication. The second insight allows us to replace the expensive, on-disk, deduplication metadata with a smaller, in-memory cache. These techniques enable us to tradeoff capacity savings for performance, as demonstrated in our evaluation with real-world workloads. Our evaluation shows that iDedup achieves 60-70% of the maximum deduplication with less than a 5% CPU overhead and a 2-4% latency impact.", "citation": "Citations (201)", "departments": ["NetApp", "NetApp", "NetApp", "NetApp"], "authors": ["Kiran Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Kiran", "Timothy Bisson.....http://dblp.org/pers/hd/b/Bisson:Timothy", "Garth R. Goodson.....http://dblp.org/pers/hd/g/Goodson:Garth_R=", "Kaladhar Voruganti.....http://dblp.org/pers/hd/v/Voruganti:Kaladhar"], "conf": "fast", "year": "2012", "pages": 1}