{"title": "Multi-aspect query summarization by composite query.", "fields": ["rdf query language", "ranking", "web query classification", "sargable", "web search query"], "abstract": "Conventional search engines usually return a ranked list of web pages in response to a query. Users have to visit several pages to locate the relevant parts. A promising future search scenario should involve: (1) understanding user intents; (2) providing relevant information directly to satisfy searchers' needs, as opposed to relevant pages. In this paper, we present a search paradigm to summarize a query's information from different aspects. Query aspects could be aligned to user intents. The generated summaries for query aspects are expected to be both specific and informative, so that users can easily and quickly find relevant information. Specifically, we use a Composite Query for Summarization\" method, where a set of component queries are used for providing additional information for the original query. The system leverages the search engine to proactively gather information by submitting multiple component queries according to the original query and its aspects. In this way, we could get more relevant information for each query aspect and roughly classify information. By comparative mining the search results of different component queries, it is able to identify query (dependent) aspect words, which help to generate more specific and informative summaries. The experimental results on two data sets, Wikipedia and TREC ClueWeb2009, are encouraging. Our method outperforms two baseline methods on generating informative summaries.", "citation": "Citations (9)", "departments": ["Harbin Institute of Technology", "Microsoft", "Chinese Academy of Sciences", "Harbin Institute of Technology", "Harbin Institute of Technology"], "authors": ["Wei Song.....http://dblp.org/pers/hd/s/Song:Wei", "Qing Yu.....http://dblp.org/pers/hd/y/Yu:Qing", "Zhiheng Xu.....http://dblp.org/pers/hd/x/Xu:Zhiheng", "Ting Liu.....http://dblp.org/pers/hd/l/Liu_0001:Ting", "Sheng Li.....http://dblp.org/pers/hd/l/Li_0003:Sheng", "Ji-Rong Wen.....http://dblp.org/pers/hd/w/Wen:Ji=Rong"], "conf": "sigir", "year": "2012", "pages": 10}