{"title": "Hybrid social media network.", "fields": ["information needs", "robust optimization", "exploit", "multiple edges", "intuition"], "abstract": "Analysis and recommendation of multimedia information can be greatly improved if we know the interactions between the content, user, and concept, which can be easily observed from the social media networks. However, there are many heterogeneous entities and relations in such networks, making it difficult to fully represent and exploit the diverse array of information. In this paper, we develop a  hybrid social media network , through which the heterogeneous entities and relations are seamlessly integrated and a joint inference procedure across the heterogeneous entities and relations can be developed. The network can be used to generate personalized information recommendation in response to specific targets of interests, e.g., personalized multimedia albums, target advertisement and friend/topic recommendation. In the proposed network, each node denotes an entity and the multiple edges between nodes characterize the diverse relations between the entities (e.g., friends, similar contents, related concepts, favorites, tags, etc). Given a query from a user indicating his/her information needs, a propagation over the hybrid social media network is employed to infer the utility scores of all the entities in the network while learning the edge selection function to activate only a sparse subset of relevant edges, such that the query information can be best propagated along the activated paths. Driven by the intuition that much redundancy exists among the diverse relations, we have developed a robust optimization framework based on several sparsity principles. We show significant performance gains of the proposed method over the state of the art in multimedia retrieval and recommendation using data crawled from social media sites. To the best of our knowledge, this is the first model supporting not only aggregation but also judicious selection of heterogeneous relations in the social media networks.", "citation": "Citations (22)", "departments": ["Columbia University", "Columbia University", "Columbia University", "National University of Singapore", "Columbia University"], "authors": ["Dong Liu.....http://dblp.org/pers/hd/l/Liu_0001:Dong", "Guangnan Ye.....http://dblp.org/pers/hd/y/Ye:Guangnan", "Ching-Ting Chen.....http://dblp.org/pers/hd/c/Chen:Ching=Ting", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "conf": "mm", "year": "2012", "pages": 10}