{"title": "Use, disuse, and misuse of automated refactorings.", "fields": ["systems engineering", "user interface", "code refactoring", "software maintenance", "software"], "abstract": "Though refactoring tools have been available for more than a decade, research has shown that programmers underutilize such tools. However, little is known about why programmers do not take advantage of these tools. We have conducted a field study on programmers in their natural settings working on their code. As a result, we collected a set of interaction data from about 1268 hours of programming using our minimally intrusive data collectors. Our quantitative data show that programmers prefer lightweight methods of invoking refactorings, usually perform small changes using the refactoring tool, proceed with an automated refactoring even when it may change the behavior of the program, and rarely preview the automated refactorings. We also interviewed nine of our participants to provide deeper insight about the patterns that we observed in the behavioral data. We found that programmers use predictable automated refactorings even if they have rare bugs or change the behavior of the program. This paper reports some of the factors that affect the use of automated refactorings such as invocation method, awareness, naming, trust, and predictability and the major mismatches between programmers' expectations and automated refactorings. The results of this work contribute to producing more effective tools for refactoring complex software.", "citation": "Citations (112)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Mohsen Vakilian.....http://dblp.org/pers/hd/v/Vakilian:Mohsen", "Nicholas Chen.....http://dblp.org/pers/hd/c/Chen:Nicholas", "Stas Negara.....http://dblp.org/pers/hd/n/Negara:Stas", "Balaji Ambresh Rajkumar.....http://dblp.org/pers/hd/r/Rajkumar:Balaji_Ambresh", "Brian P. Bailey.....http://dblp.org/pers/hd/b/Bailey:Brian_P=", "Ralph E. Johnson.....http://dblp.org/pers/hd/j/Johnson:Ralph_E="], "conf": "icse", "year": "2012", "pages": 11}