{"title": "Mirror mirror on the ceiling: flexible wireless links for data centers.", "fields": ["beamforming", "traffic simulation", "fixed wireless", "wireless site survey", "wi fi array"], "abstract": "Modern data centers are massive, and support a range of distributed applications across potentially hundreds of server racks. As their utilization and bandwidth needs continue to grow, traditional methods of augmenting bandwidth have proven complex and costly in time and resources. Recent measurements show that data center traffic is often limited by congestion loss caused by short traffic bursts. Thus an attractive alternative to adding physical bandwidth is to augment wired links with wireless links in the 60 GHz band.   We address two limitations with current 60 GHz wireless proposals. First, 60 GHz wireless links are limited by line-of-sight, and can be blocked by even small obstacles. Second, even beamforming links leak power, and potential interference will severely limit concurrent transmissions in dense data centers. We propose and evaluate a new wireless primitive for data centers, 3D  beamforming , where 60 GHz signals bounce off data center ceilings, thus establishing indirect line-of-sight between any two racks in a data center. We build a small 3D beamforming testbed to demonstrate its ability to address both link blockage and link interference, thus improving link range and number of concurrent transmissions in the data center. In addition, we propose a simple link scheduler and use traffic simulations to show that these 3D links significantly expand wireless capacity compared to their 2D counterparts.", "citation": "Citations (216)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "Xi'an Jiaotong University", "University of California, Santa Barbara"], "authors": ["Xia Zhou.....http://dblp.org/pers/hd/z/Zhou:Xia", "Zengbin Zhang.....http://dblp.org/pers/hd/z/Zhang:Zengbin", "Yibo Zhu.....http://dblp.org/pers/hd/z/Zhu:Yibo", "Yubo Li.....http://dblp.org/pers/hd/l/Li:Yubo", "Saipriya Kumar.....http://dblp.org/pers/hd/k/Kumar:Saipriya", "Amin Vahdat.....http://dblp.org/pers/hd/v/Vahdat:Amin", "Ben Y. Zhao.....http://dblp.org/pers/hd/z/Zhao:Ben_Y=", "Haitao Zheng.....http://dblp.org/pers/hd/z/Zheng:Haitao"], "conf": "sigcomm", "year": "2012", "pages": 12}