{"title": "A theory of multi-layer flat refractive geometry.", "fields": ["refraction", "computational geometry", "pose", "field of view", "essential matrix"], "abstract": "Flat refractive geometry corresponds to a perspective camera looking through single/multiple parallel flat refractive mediums. We show that the underlying geometry of rays corresponds to an axial camera. This realization, while missing from previous works, leads us to develop a general theory of calibrating such systems using 2D-3D correspondences. The pose of 3D points is assumed to be unknown and is also recovered. Calibration can be done even using a single image of a plane. We show that the unknown orientation of the refracting layers corresponds to the underlying axis, and can be obtained independently of the number of layers, their distances from the camera and their refractive indices. Interestingly, the axis estimation can be mapped to the classical essential matrix computation and 5-point algorithm [15] can be used. After computing the axis, the thicknesses of layers can be obtained linearly when refractive indices are known, and we derive analytical solutions when they are unknown. We also derive the analytical forward projection (AFP) equations to compute the projection of a 3D point via multiple flat refractions, which allows non-linear refinement by minimizing the reprojection error. For two refractions, AFP is either 4 th  or 12 th  degree equation depending on the refractive indices. We analyze ambiguities due to small field of view, stability under noise, and show how a two layer system can be well approximated as a single layer system. Real experiments using a water tank validate our theory.", "citation": "Citations (91)", "year": "2012", "departments": ["Mitsubishi Electric Research Laboratories", "Mitsubishi Electric Research Laboratories", "Mitsubishi Electric Research Laboratories", "French Institute for Research in Computer Science and Automation"], "conf": "cvpr", "authors": ["Amit K. Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Amit_K=", "Srikumar Ramalingam.....http://dblp.org/pers/hd/r/Ramalingam:Srikumar", "Yuichi Taguchi.....http://dblp.org/pers/hd/t/Taguchi:Yuichi", "Visesh Chari.....http://dblp.org/pers/hd/c/Chari:Visesh"], "pages": 8}