{"title": "Performance Isolation and Fairness for Multi-Tenant Cloud Storage.", "fields": ["temporal isolation among virtual machines", "skew", "robustness", "cloud storage", "resource allocation"], "abstract": "Shared storage services enjoy wide adoption in commercial clouds. But most systems today provide weak performance isolation and fairness between tenants, if at all. Misbehaving or high-demand tenants can overload the shared service and disrupt other well-behaved tenants, leading to unpredictable performance and violating SLAs.\n\nThis paper presents Pisces, a system for achieving datacenter-wide per-tenant performance isolation and fairness in shared key-value storage. Today's approaches for multi-tenant resource allocation are based either on per-VM allocations or hard rate limits that assume uniform workloads to achieve high utilization. Pisces achieves per-tenant weighted fair shares (or minimal rates) of the aggregate resources of the shared service, even when different tenants' partitions are co-located and when demand for different partitions is skewed, time-varying, or bottlenecked by different server resources. Pisces does so by decomposing the fair sharing problem into a combination of four complementary mechanisms--partition placement, weight allocation, replica selection, and weighted fair queuing--that operate on different time-scales and combine to provide system-wide max-min fairness.\n\nAn evaluation of our Pisces storage prototype achieves nearly ideal (0.99 Min-Max Ratio) weighted fair sharing, strong performance isolation, and robustness to skew and shifts in tenant demand. These properties are achieved with minimal overhead (<3%), even when running at high utilization (more than 400,000 requests/second/server for 10B requests).", "citation": "Citations (214)", "departments": ["Princeton University", "Princeton University", "IBM"], "authors": ["David Shue.....http://dblp.org/pers/hd/s/Shue:David", "Michael J. Freedman.....http://dblp.org/pers/hd/f/Freedman:Michael_J=", "Anees Shaikh.....http://dblp.org/pers/hd/s/Shaikh:Anees"], "conf": "osdi", "year": "2012", "pages": 14}