{"title": "AP association in 802.11n WLANs with heterogeneous clients.", "fields": ["frame aggregation", "proportionally fair", "wi fi", "hotspot", "raw data"], "abstract": "As the latest amendment of IEEE 802.11 standard, 802.11n allows a maximum raw data rate as high as 300Mbps, making it a desirable candidate for wireless local area network (WLAN) deployment. In typical deployment, the coverage areas of nearby access points (APs) usually overlap with one another to provide satisfactory coverage and seamless mobility support. Clients tend to associate (connect) to the AP with the strongest signal strength, which might lead to poor client throughput and overloaded APs. Although a number of AP association schemes have been proposed for IEEE 802.11 WLANs in previous studies, none of them have considered the frame aggregation feature in 802.11n. Moreover, the impact of legacy 802.11a/b/g clients in 802.11n WLANS has not been considered in AP association. To fill in this gap, in this paper we explore AP association for 802.11n with heterogeneous clients (802.11a/b/g/n). We first formulate it into an optimization problem based on a bi-dimensional Markov model, aiming at providing clients with the bandwidth proportional to their highest physical data rates, and then propose two heuristic AP association algorithms that can efficiently make online decisions on AP association. We have also conducted extensive simulations and experiments to validate the proposed algorithms. Our simulation results show that under hotspot client distribution, the proposed algorithms can boost the throughput of 802.11n clients and overall throughput by 106% and 89%, respectively, compared to other AP association schemes. Experiments also confirm the effectiveness of the algorithms in enhancing aggregated throughput, maintaining proportional fairness among clients and balancing load among APs.", "citation": "Citations (25)", "departments": ["Stony Brook University", "Stony Brook University"], "authors": ["Dawei Gong.....http://dblp.org/pers/hd/g/Gong:Dawei", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2012", "pages": 9}