{"title": "Automated annotation of coral reef survey images.", "fields": ["coral", "image texture", "annotation", "reef", "automatic image annotation"], "abstract": "With the proliferation of digital cameras and automatic acquisition systems, scientists can acquire vast numbers of images for quantitative analysis. However, much image analysis is conducted manually, which is both time consuming and prone to error. As a result, valuable scientific data from many domains sit dormant in image libraries awaiting annotation. This work addresses one such domain: coral reef coverage estimation. In this setting, the goal, as defined by coral reef ecologists, is to determine the percentage of the reef surface covered by rock, sand, algae, and corals; it is often desirable to resolve these taxa at the genus level or below. This is challenging since the data exhibit significant within class variation, the borders between classes are complex, and the viewpoints and image quality vary. We introduce Moorea Labeled Corals, a large multi-year dataset with 400,000 expert annotations, to the computer vision community, and argue that this type of ecological data provides an excellent opportunity for performance benchmarking. We also propose a novel algorithm using texture and color descriptors over multiple scales that outperforms commonly used techniques from the texture classification literature. We show that the proposed algorithm accurately estimates coral coverage across locations and years, thereby taking a significant step towards reliable automated coral reef image annotation.", "citation": "Citations (109)", "year": "2012", "departments": ["California State University, Northridge", "California State University, Northridge", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "cvpr", "authors": ["Oscar Beijbom.....http://dblp.org/pers/hd/b/Beijbom:Oscar", "Peter J. Edmunds.....http://dblp.org/pers/hd/e/Edmunds:Peter_J=", "David I. Kline.....http://dblp.org/pers/hd/k/Kline:David_I=", "B. Greg Mitchell.....http://dblp.org/pers/hd/m/Mitchell:B=_Greg", "David J. Kriegman.....http://dblp.org/pers/hd/k/Kriegman:David_J="], "pages": 8}