{"title": "Spectrum clouds: A session based spectrum trading system for multi-hop cognitive radio networks.", "fields": ["heuristic", "cognitive radio", "maximization", "bidding", "hop"], "abstract": "Spectrum trading creates more accessing opportunities for secondary users (SUs) and economically benefits the primary users (PUs). However, it is challenging to implement spectrum trading in multi-hop cognitive radio networks (CRNs) due to harsh cognitive radio (CR) requirements on SUs' devices and complex conflict and competition relationship among different CR sessions. Unlike the per-user based spectrum trading designs in previous studies, in this paper, we propose a novel session based spectrum trading system, spectrum clouds, in multi-hop CRNs. In spectrum clouds, we introduce a new service provider, called secondary service provider (SSP), to harvest the available spectrum bands and facilitate the accessing of SUs without CR capability. The SSP also conducts spectrum trading among CR sessions w.r.t. their conflicts and competitions. Leveraging a 3-dimensional (3-D) conflict graph, we mathematically describe the conflicts and competitions among the candidate sessions for spectrum trading. Given the rate requirements and bidding values of candidate trading sessions, we formulate the optimal spectrum trading into the SSP's revenue maximization problem under multiple cross-layer constraints in multi-hop CRNs. In view of the NP-hardness of the problem, we have also developed heuristic algorithms to pursue feasible solutions. Through extensive simulations, we show that the solutions found by the proposed algorithms are close to the optimal one.", "citation": "Citations (38)", "departments": ["University of Florida", "Mississippi State University", "IBM", "University of Florida", "National Taiwan University"], "authors": ["Miao Pan.....http://dblp.org/pers/hd/p/Pan:Miao", "Pan Li.....http://dblp.org/pers/hd/l/Li_0001:Pan", "Yang Song.....http://dblp.org/pers/hd/s/Song_0005:Yang", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang", "Phone Lin.....http://dblp.org/pers/hd/l/Lin:Phone"], "conf": "infocom", "year": "2012", "pages": 9}