{"title": "Collaborative secret key extraction leveraging Received Signal Strength in mobile wireless networks.", "fields": ["group key", "shadow", "key generation", "key distribution in wireless sensor networks", "rss"], "abstract": "Securing communication in mobile wireless networks is challenging because the traditional cryptographic-based methods are not always applicable in dynamic mobile wireless environments. Using physical layer information of radio channel to generate keys secretly among wireless devices has been proposed as an alternative in wireless mobile networks. And the Received Signal Strength (RSS) based secret key extraction gains much attention due to the RSS readings are readily available in wireless infrastructure. However, the problem of using RSS to generate keys among multiple devices to ensure secure group communication remains open. In this work, we propose a framework for collaborative key generation among a group of wireless devices leveraging RSS. The proposed framework consists of a secret key extraction scheme exploiting the trend exhibited in RSS resulted from shadow fading, which is robust to outsider adversary performing stalking attacks. To deal with mobile devices not within each other's communication range, we employ relay nodes to achieve reliable key extraction. To enable secure group communication, two protocols, namely star-based and chain-based, are developed in our framework by exploiting RSS from multiple devices to perform group key generation collaboratively. Our experiments in both outdoor and indoor environments confirm the feasibility of using RSS for group key generation among multiple wireless devices under various mobile scenarios. The results also demonstrate that our collaborative key extraction scheme can achieve a lower bit mismatch rate compared to existing works when maintaining the comparable bit generation rate.", "citation": "Citations (85)", "departments": ["Stevens Institute of Technology", "Stevens Institute of Technology", "Stevens Institute of Technology", "Stevens Institute of Technology"], "authors": ["Hongbo Liu.....http://dblp.org/pers/hd/l/Liu:Hongbo", "Jie Yang.....http://dblp.org/pers/hd/y/Yang_0003:Jie", "Yan Wang.....http://dblp.org/pers/hd/w/Wang_0003:Yan", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying"], "conf": "infocom", "year": "2012", "pages": 9}