{"title": "POVA: Traffic light sensing with probe vehicles.", "fields": ["heuristic", "instant", "optimization problem", "systems design", "software deployment", "spacetime", "word error rate"], "abstract": "Traffic light sensing aims to detect the status of traffic lights which is valuable for many applications such as traffic management, traffic light optimization, and real-time vehicle navigation. In this work, we develop a system called POVA for traffic light sensing in large-scale urban areas. The system employs pervasive probe vehicles that just report real-time states of position and speed from time to time. POVA has advantages of wide coverage and low deployment cost. The important observation motivating the design of POVA is that a traffic light has a considerable impact on mobility of vehicles on the road attached to the traffic light. However, the system design faces three unique challenges: 1) Probe reports are by nature discrete while the goal of traffic light sensing is to determine the state of a traffic light at any time; 2) there may be a very limited number of probe reports in a given duration for traffic light state estimation; and 3) a traffic light may change its state with a variable interval. To tackle the challenges, we develop a new technique that makes the best use of limited probe reports as well as statistical features of light states. It first estimates the state of a traffic light at the time instant of a report by applying maximum a posterior estimation. Then, we formulate the state estimation of a light at any time into a joint optimization problem that is solved by an efficient heuristic algorithm. We have implemented the system and tested it with a fleet of around 4,000 probe taxis and 2,000 buses in Shanghai, China. Trace-driven experimentation and field study show that nearly 60 percent of traffic lights have an estimation error lower than 19 percent if 20,000 probe vehicles would be employed in the urban area of Shanghai. We further demonstrate that the estimation error rate is as low as 18 percent even when the number of available reports is merely 1 per minute.", "citation": "Citations (12)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Hong Kong University of Science and Technology", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Hong Kong University of Science and Technology"], "authors": ["Xuemei Liu.....http://dblp.org/pers/hd/l/Liu:Xuemei", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian"], "conf": "infocom", "year": "2012", "pages": 5}