{"title": "Efficient multicasting for delay tolerant networks using graph indexing.", "fields": ["search engine indexing", "multicast", "data modeling", "server", "delay tolerant networking"], "abstract": "In Delay Tolerant Networks (DTNs), end-to-end connectivity between nodes does not always occur due to limited radio coverage, node mobility and other factors. Remote communication may assist in guaranteeing delivery. However, it has a considerable cost, and consequently, minimizing it is an important task. For multicast routing, the problem is NP-hard, and naive approaches are infeasible on large problem instances. In this paper we define the problem of minimizing the remote communication cost for multicast in DTNs. Our formulation handles the realistic scenario in which a data source is continuously updated and nodes need to receive recent versions of data. We analyze the problem in the case of scheduled trajectories and known traffic demands, and propose a solution based on a novel graph indexing system. We also present an adaptive extension that can work with limited knowledge of node mobility. Our method reduces the search space significantly and finds an optimal solution in reasonable time. Extensive experimental analysis on large real and synthetic datasets shows that the proposed method completes in less than 10 seconds on datasets with millions of encounters, with an improvement of up to 100 times compared to a naive approach.", "citation": "Citations (36)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of Southern California"], "authors": ["Misael Mongiovì.....http://dblp.org/pers/hd/m/Mongiov=igrave=:Misael", "Ambuj K. Singh.....http://dblp.org/pers/hd/s/Singh:Ambuj_K=", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Bo Zong.....http://dblp.org/pers/hd/z/Zong:Bo", "Konstantinos Psounis.....http://dblp.org/pers/hd/p/Psounis:Konstantinos"], "conf": "infocom", "year": "2012", "pages": 9}