{"title": "Cost-effective barrier coverage by mobile sensor networks.", "fields": ["mobile computing", "mobile radio", "patrolling", "mobile telephony", "scarcity"], "abstract": "Barrier coverage problem in emerging mobile sensor networks has been an interesting research issue. Existing solutions to this problem aim to decide one-time movement for individual sensors to construct as many barriers as possible, which may not work well when there are no sufficient sensors to form a single barrier. In this paper, we try to achieve barrier coverage in sensor scarcity case by dynamic sensor patrolling. In specific, we design a periodic monitoring scheduling (PMS) algorithm in which each point along the barrier line is monitored periodically by mobile sensors. Based on the insight from PMS, we then propose a coordinated sensor patrolling (CSP) algorithm to further improve the barrier coverage, where each sensor's current movement strategy is decided based on the past intruder arrival information. By jointly exploiting sensor mobility and intruder arrival information, CSP is able to significantly enhance barrier coverage. We prove that the total distance that the sensors move during each time slot in CSP is the minimum. Considering the decentralized nature of mobile sensor networks, we further introduce two distributed versions of CSP: S-DCSP and G-DCSP. Through extensive simulations, we demonstrate that CSP has a desired barrier coverage performance and S-DCSP and G-DCSP have similar performance as that of CSP.", "citation": "Citations (86)", "departments": ["Zhejiang University", "Zhejiang University", "university of lille", "University of Waterloo", "Zhejiang University"], "authors": ["Shibo He.....http://dblp.org/pers/hd/h/He:Shibo", "Jiming Chen.....http://dblp.org/pers/hd/c/Chen:Jiming", "Xu Li.....http://dblp.org/pers/hd/l/Li_0001:Xu", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin", "Youxian Sun.....http://dblp.org/pers/hd/s/Sun:Youxian"], "conf": "infocom", "year": "2012", "pages": 9}