{"title": "Spotting Code Optimizations in Data-Parallel Pipelines through PeriSCOPE.", "fields": ["pipeline", "procedural programming", "graphics pipeline", "program optimization", "dead code", "symbolic execution"], "abstract": "To minimize the amount of data-shuffling I/O that occurs between the pipeline stages of a distributed data-parallel program, its procedural code must be optimized with full awareness of the pipeline that it executes in. Unfortunately, neither pipeline optimizers nor traditional compilers examine both the pipeline and procedural code of a data-parallel program so programmers must either hand-optimize their program across pipeline stages or live with poor performance. To resolve this tension between performance and programmability, this paper describes PeriSCOPE, which automatically optimizes adata-parallel program’s procedural code in the context of data flow that is reconstructed from the program’s pipeline topology. Such optimizations eliminate unnecessary code and data, perform early data filtering, and calculate small derived values (e.g., predicates) earlier in the pipeline, so that less data—sometimes much less data—is transferred between pipeline stages. PeriSCOPE further leverages symbolic execution to enlarge the scope of such optimizations by eliminating dead code. We describe how PeriSCOPE is implemented and evaluate its effectiveness on real production jobs.", "citation": "Citations (21)", "year": "2012", "departments": ["Huazhong University of Science and Technology", "Microsoft", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Microsoft", "Microsoft", "Huazhong University of Science and Technology", "Microsoft", "Microsoft", "Microsoft"], "conf": "osdi", "authors": ["Zhenyu Guo.....http://dblp.org/pers/hd/g/Guo:Zhenyu", "Xuepeng Fan.....http://dblp.org/pers/hd/f/Fan:Xuepeng", "Rishan Chen.....http://dblp.org/pers/hd/c/Chen:Rishan", "Jiaxing Zhang.....http://dblp.org/pers/hd/z/Zhang:Jiaxing", "Hucheng Zhou.....http://dblp.org/pers/hd/z/Zhou:Hucheng", "Sean McDirmid.....http://dblp.org/pers/hd/m/McDirmid:Sean", "Chang Liu.....http://dblp.org/pers/hd/l/Liu:Chang", "Wei Lin.....http://dblp.org/pers/hd/l/Lin:Wei", "Jingren Zhou.....http://dblp.org/pers/hd/z/Zhou:Jingren", "Lidong Zhou.....http://dblp.org/pers/hd/z/Zhou:Lidong"], "pages": 13}