{"title": "Nearly optimal solutions for the chow parameters problem and low-weight approximation of halfspaces.", "fields": ["hamming distance", "log log plot", "combinatorics", "discrete mathematics", "mathematics", "magnitude", "integer", "bounded function", "fourier analysis", "mathematical proof"], "abstract": "The  Chow parameters  of a Boolean function  f :{−1, 1}  n   → {−1, 1} are its  n p1 degree-0 and degree-1 Fourier coefficients. It has been known since 1961 lChow 1961; Tannenbaum 1961r that the (exact values of the) Chow parameters of any linear threshold function  f  uniquely specify  f  within the space of all Boolean functions, but until recently lO'Donnell and Servedio 2011r nothing was known about efficient algorithms for  reconstructing   f  (exactly or approximately) from exact or approximate values of its Chow parameters. We refer to this reconstruction problem as the  Chow Parameters Problem.    Our main result is a new algorithm for the Chow Parameters Problem which, given (sufficiently accurate approximations to) the Chow parameters of any linear threshold function  f , runs in time O( n  2 ) ṡ (1/e)  O (log 2 (1/e))  and with high probability outputs a representation of an LTF  f ′ that is e-close to  f  in Hamming distance. The only previous algorithm lO'Donnell and Servedio 2011r had running time poly( n ) ṡ 2 2 O(1/e 2 )  .   As a byproduct of our approach, we show that for any linear threshold function  f  over {-1, 1}  n  , there is a linear threshold function  f ′ which is e-close to  f  and has all weights that are integers of magnitude at most √n ṡ (1/e)  O (log 2 (1/e)) . This significantly improves the previous best result of Diakonikolas and Servedio l2009r which gave a poly( n ) ṡ 2 O(1/e 2/3 )  weight bound, and is close to the known lower bound of max{√n, (1/e) Ω(log log (1/e)) } lGoldberg 2006; Servedio 2007r. Our techniques also yield improved algorithms for related problems in learning theory.   In addition to being significantly stronger than previous work, our results are obtained using conceptually simpler proofs. The two main ingredients underlying our results are (1) a new structural result showing that for  f  any linear threshold function and  g  any bounded function, if the Chow parameters of  f  are close to the Chow parameters of  g  then  f  is close to  g ; (2) a new boosting-like algorithm that given approximations to the Chow parameters of a linear threshold function outputs a bounded function whose Chow parameters are close to those of  f .", "citation": "Not cited", "year": "2012", "departments": ["University of California, Berkeley", "University of California, Berkeley", "IBM", "Columbia University", "University of California, Berkeley", "University of California, Berkeley", "IBM", "Columbia University", "School of Informatics"], "conf": "stoc", "authors": ["Anindya De.....http://dblp.org/pers/hd/d/De:Anindya", "Ilias Diakonikolas.....http://dblp.org/pers/hd/d/Diakonikolas:Ilias", "Vitaly Feldman.....http://dblp.org/pers/hd/f/Feldman:Vitaly", "Rocco A. Servedio.....http://dblp.org/pers/hd/s/Servedio:Rocco_A="], "pages": 18}