{"title": "The work of play: supporting a pervasive health behavior change intervention for us middle school students.", "fields": ["behavior change", "software deployment", "project manager", "psychological intervention", "health informatics"], "abstract": "Technology-based health behavior change interventions involving passive on-body sensing and feedback interfaces show promise for increasing participation in physical activity. However, the majority of prior studies are small-scale interventions that heavily rely on research teams for programmatic support. In larger-scale deployments, participants may have to take over setup and maintenance tasks. In this paper, we examine the \"hidden work\" involved with the large-scale deployment of a behavior change application in American schools. We offer insight into the coordination required to maintain such deployments, and identify unique challenges that arise when schoolchildren are the target of a behavior change intervention. Our findings highlight the behind-the-scenes coordination and management work required of adult facilitators in order to support pervasive health interventions for children in school environments. We offer advice to researchers and project managers attempting integration of technology-based health behavior change applications for children.", "citation": "Citations (12)", "departments": ["Georgia Institute of Technology", "Pennsylvania State University", "Georgia Institute of Technology", "Pennsylvania State University", "Georgia Insitit ... a, Georgia, USA"], "authors": ["Andrew D. Miller.....http://dblp.org/pers/hd/m/Miller:Andrew_D=", "Erika Shehan Poole.....http://dblp.org/pers/hd/p/Poole:Erika_Shehan", "Yan Xu.....http://dblp.org/pers/hd/x/Xu:Yan", "Elsa Eiriksdottir.....http://dblp.org/pers/hd/e/Eiriksdottir:Elsa", "Daniel Kestranek.....http://dblp.org/pers/hd/k/Kestranek:Daniel", "Richard Catrambone.....http://dblp.org/pers/hd/c/Catrambone:Richard", "Elizabeth D. Mynatt.....http://dblp.org/pers/hd/m/Mynatt:Elizabeth_D="], "conf": "cscw", "year": "2012", "pages": 4}