{"title": "Distributed data collection and its capacity in asynchronous wireless sensor networks.", "fields": ["asynchronous system", "distributed database", "scalability", "asynchronous communication", "channel"], "abstract": "Most of the existing works studying the data collection capacity issue have an ideal assumption that the network time is slotted and the entire network is strictly synchronized explicitly or implicitly. Such an assumption is mainly for centralized synchronous WSNs. However, WSNs are more likely to be distributed asynchronous systems. Thus, in this paper, we investigate the achievable data collection capacity of realistic distributed asynchronous WSNs. To the best of our knowledge, this is the first work to study the data collection capacity issue for distributed asynchronous WSNs. Our main contributions are threefold. First, to avoid data transmission collisions/interference, we derive an R 0 -Proper Carrier-sensing Range (R 0 -PCR) under the generalized physical interference model for the nodes in a data collection WSN, where R 0  is the satisfied threshold data receiving rate. Taking R 0 -PCR as its carrier-sensing range, any node can initiate a data transmission with a guaranteed data receiving rate. Second, based on the obtained R 0 -PCR, we propose a Distributed Data Collection (DDC) algorithm with fairness consideration for asynchronous WSNs. Theoretical analysis of DDC surprisingly shows that its asymptotic achievable network capacity is ℂ = Ω(1 over 26β κ+1 ·W), where β κ+1  is a constant value depends on R 0  and W is the bandwidth of a wireless communication channel, which is order optimal and independent of network size. Thus, DDC is scalable. Finally, we conduct extensive simulations to validate the performance of DDC. Simulation results demonstrate that DDC can achieve comparable data collection capacity as that of the most recently published centralized and synchronized data collection algorithm.", "citation": "Citations (22)", "departments": ["Georgia State University", "Georgia State University"], "authors": ["Shouling Ji.....http://dblp.org/pers/hd/j/Ji:Shouling", "Zhipeng Cai.....http://dblp.org/pers/hd/c/Cai:Zhipeng"], "conf": "infocom", "year": "2012", "pages": 9}