{"title": "A Direct Product Theorem for the Two-Party Bounded-Round Public-Coin Communication Complexity.", "fields": ["direct sum", "model of computation", "special case", "structural complexity theory", "gap theorem"], "abstract": "A strong direct product theorem for a problem in a given model of computation states that, in order to compute k instances of the problem, if we provide resource which is less than k times the resource required for computing one instance of the problem with constant success probability, then the probability of correctly computing all the k instances together, is exponentially small in k. In this paper, we consider the model of two-party bounded-round public-coin randomized communication complexity. We show a direct product theorem for the communication complexity of any relation in this model. In particular, our result implies a strong direct product theorem for the two-party constant-message public-coin randomized communication complexity of all relations. As an immediate application of our result, we get a strong direct product theorem for the pointer chasing problem. This problem has been well studied for understanding round v/s communication trade-offs in both classical and quantum communication protocols. Our result generalizes the result of Jain [2011] which can be regarded as the special case when t=1. Our result can be considered as an important progress towards settling the strong direct product conjecture for the two-party public-coin communication complexity, a major open question in this area. We show our result using information theoretic arguments. Our arguments and techniques build on the ones used in Jain~\\cite{Jain:2011}. %, where a strong direct product theorem for the %two-party one-way public-coin communication complexity of all %relations is shown (that is the special case of our result when $t=1$). One key tool used in our work and also in Jain~\\cite{Jain:2011} is a message compression technique due to Braver man and Rao~\\cite{Braverman2011}, who used it to show a {\\em direct sum} theorem in the same model of communication complexity as considered by us. Another important tool that we use is a correlated sampling protocol, which for example, has been used in Holenstein~\\cite{Holenstein2007} for proving a parallel repetition theorem for two-prover games.", "citation": "Citations (24)", "year": "2012", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "conf": "focs", "authors": ["Rahul Jain.....http://dblp.org/pers/hd/j/Jain_0001:Rahul", "Attila Pereszlényi.....http://dblp.org/pers/hd/p/Pereszl=eacute=nyi:Attila", "Penghui Yao.....http://dblp.org/pers/hd/y/Yao:Penghui"], "pages": 10}