{"title": "Scalar quantization for large scale image search.", "fields": ["learning vector quantization", "visual word", "linde buzo gray algorithm", "color quantization", "quantization"], "abstract": "Bag-of-Words (BoW) model based on SIFT has been widely used in large scale image retrieval applications. Feature quantization plays a crucial role in BoW model, which generates visual words from the high dimensional SIFT features, so as to adapt to the inverted file structure for indexing. Traditional feature quantization approaches suffer several problems: 1) high computational cost---visual words generation (codebook construction) is time consuming especially with large amount of features; 2) limited reliability---different collections of images may produce totally different codebooks and quantization error is hard to be controlled; 3) update inefficiency--once the codebook is constructed, it is not easy to be updated. In this paper, a novel feature quantization algorithm,  scalar quantization , is proposed. With scalar quantization, a SIFT feature is quantized to a descriptive and discriminative bit-vector, of which the first tens of bits are taken out as  code word . Our quantizer is independent of collections of images. In addition, the result of scalar quantization naturally lends itself to adapt to the classic inverted file structure for image indexing. Moreover, the quantization error can be flexibly reduced and controlled by efficiently enumerating nearest neighbors of code words.   The performance of scalar quantization has been evaluated in partial-duplicate Web image search on a database of one million images. Experiments reveal that the proposed scalar quantization achieves a relatively 42% improvement in mean average precision over the baseline (hierarchical visual vocabulary tree approach), and also outperforms the state-of-the-art Hamming Embedding approach and soft assignment method.", "citation": "Citations (91)", "departments": ["University of Texas at San Antonio", "Texas State University", "University of Science and Technology of China", "University of Texas at San Antonio"], "authors": ["Wengang Zhou.....http://dblp.org/pers/hd/z/Zhou:Wengang", "Yijuan Lu.....http://dblp.org/pers/hd/l/Lu:Yijuan", "Houqiang Li.....http://dblp.org/pers/hd/l/Li:Houqiang", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "conf": "mm", "year": "2012", "pages": 10}