{"title": "Vector Extensions for Decision Support DBMS Acceleration.", "fields": ["operator", "instruction set", "microarchitecture", "component oriented database", "simd"], "abstract": "Database management systems (DBMS) have become an essential tool for industry and research and are often a significant component of data centres. As a result of this criticality, efficient execution of DBMS engines has become an important area of investigation. This work takes a top-down approach to accelerating decision support systems (DSS) on x86-64 microprocessors using vector ISA extensions. In the first step, a leading DSS DBMS is analysed for potential data-level parallelism. We discuss why the existing multimedia SIMD extensions (SSE/AVX) are not suitable for capturing this parallelism and propose a complementary instruction set reminiscent of classical vector architectures. The instruction set is implemented using unintrusive modifications to a modern x86-64 micro architecture tailored for DSS DBMS. The ISA and micro architecture are evaluated using a cycle-accurate x86-64 micro architectural simulator coupled with a highly-detailed memory simulator. We have found a single operator is responsible for 41% of total execution time for the TPC-H DSS benchmark. Our results show performance speedups between 1.94x and 4.56x for an implementation of this operator run with our proposed hardware modifications.", "citation": "Citations (16)", "departments": ["Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Spanish National Research Council", "Polytechnic University of Catalonia"], "authors": ["Timothy Hayes.....http://dblp.org/pers/hd/h/Hayes_0001:Timothy", "Oscar Palomar.....http://dblp.org/pers/hd/p/Palomar:Oscar", "Osman S. Unsal.....http://dblp.org/pers/hd/u/Unsal:Osman_S=", "Adrián Cristal.....http://dblp.org/pers/hd/c/Cristal:Adri=aacute=n", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "conf": "micro", "year": "2012", "pages": 11}