{"title": "Design of an exergaming station for children with cerebral palsy.", "fields": ["video game design", "controller", "game design", "sports medicine", "participatory design"], "abstract": "We report on the design of a novel station supporting the play of exercise video games (exergames) by children with cerebral palsy (CP). The station combines a physical platform allowing children with CP to provide pedaling input into a game, a standard Xbox 360 controller, and algorithms for interpreting the cycling input to improve smoothness and accuracy of gameplay. The station was designed through an iterative and incremental participatory design process involving medical professionals, game designers, computer scientists, kinesiologists, physical therapists, and eight children with CP. It has been tested through observation of its use, through gathering opinions from the children, and through small experimental studies. With our initial design, only three of eight children were capable of playing a cycling-based game; with the final design, seven of eight could cycle effectively, and six reached energy expenditure levels recommended by the American College of Sports Medicine while pedaling unassisted.", "citation": "Citations (58)", "departments": ["Queen's University", "Queen's University", "Holland Bloorview Kids Rehabilitation Hospital", "Holland Bloorview Kids Rehabilitation Hospital", "Queen's University"], "authors": ["Hamilton A. Hernandez.....http://dblp.org/pers/hd/h/Hernandez:Hamilton_A=", "T. C. Nicholas Graham.....http://dblp.org/pers/hd/g/Graham:T=_C=_Nicholas", "Darcy Fehlings.....http://dblp.org/pers/hd/f/Fehlings:Darcy", "Lauren Switzer.....http://dblp.org/pers/hd/s/Switzer:Lauren", "Zi Ye.....http://dblp.org/pers/hd/y/Ye:Zi", "Quentin Bellay.....http://dblp.org/pers/hd/b/Bellay:Quentin", "Md Ameer Hamza.....http://dblp.org/pers/hd/h/Hamza:Md_Ameer", "Cheryl Savery.....http://dblp.org/pers/hd/s/Savery:Cheryl", "Tadeusz Stach.....http://dblp.org/pers/hd/s/Stach:Tadeusz"], "conf": "chi", "year": "2012", "pages": 10}