{"title": "FILA: Fine-grained indoor localization.", "fields": ["channel state information", "orthogonal frequency division multiplexing", "multipath propagation", "diversity scheme", "fading"], "abstract": "Indoor positioning systems have received increasing attention for supporting location-based services in indoor environments. WiFi-based indoor localization has been attractive due to its open access and low cost properties. However, the distance estimation based on received signal strength indicator (RSSI) is easily affected by the temporal and spatial variance due to the multipath effect, which contributes to most of the estimation errors in current systems. How to eliminate such effect so as to enhance the indoor localization performance is a big challenge. In this work, we analyze this effect across the physical layer and account for the undesirable RSSI readings being reported. We explore the frequency diversity of the subcarriers in OFDM systems and propose a novel approach called FILA, which leverages the channel state information (CSI) to alleviate multipath effect at the receiver. We implement the FILA system on commercial 802.11 NICs, and then evaluate its performance in different typical indoor scenarios. The experimental results show that the accuracy and latency of distance calculation can be significantly enhanced by using CSI. Moreover, FILA can significantly improve the localization accuracy compared with the corresponding RSSI approach.", "citation": "Citations (196)", "departments": ["Sun Yat-sen University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Jiang Xiao.....http://dblp.org/pers/hd/x/Xiao:Jiang", "Youwen Yi.....http://dblp.org/pers/hd/y/Yi:Youwen", "Min Gao.....http://dblp.org/pers/hd/g/Gao:Min", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "infocom", "year": "2012", "pages": 9}