{"title": "CSI-SF: Estimating wireless channel state using CSI sampling & fusion.", "fields": ["channel state information", "orthogonal frequency division multiplexing", "small number", "mimo", "3g mimo"], "abstract": "One of the key features of high speed WLAN such as 802.11n is the use of MIMO (Multiple Input Multiple Output) antenna technology. The MIMO channel is described with fine granularity by Channel State Information (CSI) that can be utilized in many ways to improve network performance. Many complex parameters of a MIMO system require numerous samples to obtain CSI for all possible channel configurations. As a result, measuring the complete CSI space requires excessive sampling overhead and thus degrades network performance. We propose CSI-SF (CSI Sampling & Fusion), a method for estimating CSI for every MIMO configuration by sampling a small number of frames transmitted with different settings and extrapolating data for the remaining settings. For instance, we predict CSI of multi-stream settings using CSI obtained only from single stream packets. We evaluate the effectiveness of CSI-SF in various scenarios using our 802.11n testbed and show that CSI-SF provides an accurate, complete knowledge of the MIMO channel with reduced overhead from traditional sampling. We also show that CSI-SF can be applied to network algorithms such as rate adaptation, antenna selection and association control to significantly improve their performance and efficiency.", "citation": "Citations (16)", "departments": ["University of Illinois at Urbana–Champaign", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "University of Illinois at Urbana–Champaign"], "authors": ["Riccardo Crepaldi.....http://dblp.org/pers/hd/c/Crepaldi:Riccardo", "Jeongkeun Lee.....http://dblp.org/pers/hd/l/Lee:Jeongkeun", "Raúl H. Etkin.....http://dblp.org/pers/hd/e/Etkin:Ra=uacute=l_H=", "Sung-Ju Lee.....http://dblp.org/pers/hd/l/Lee:Sung=Ju", "Robin Kravets.....http://dblp.org/pers/hd/k/Kravets:Robin"], "conf": "infocom", "year": "2012", "pages": 9}