{"title": "On Finding Optimal Polytrees.", "fields": ["matroid intersection", "polytree", "matroid", "arc", "bounded function", "parameterized complexity"], "abstract": "Inferring probabilistic networks from data is a notoriously difficult task. Under various goodness-of-fit measures, finding an optimal network is NP-hard, even if restricted to polytrees of bounded in-degree. Polynomial-time algorithms are known only for rare special cases, perhaps most notably for branchings, that is, polytrees in which the in-degree of every node is at most one. Here, we study the complexity of finding an optimal polytree that can be turned into a branching by deleting some number of arcs or nodes, treated as a parameter. We show that the problem can be solved via a matroid intersection formulation in polynomial time if the number of deleted arcs is bounded by a constant. The order of the polynomial time bound depends on this constant, hence the algorithm does not establish fixed-parameter tractability when parameterized by the number of deleted arcs. We show that a restricted version of the problem allows fixed-parameter tractability and hence scales well with the parameter. We contrast this positive result by showing that if we parameterize by the number of deleted nodes, a somewhat more powerful parameter, the problem is not fixed-parameter tractable, subject to a complexity-theoretic assumption.", "citation": "Not cited", "departments": ["University of New South Wales", "University of Helsinki", "University of Orléans", "Vienna University of Technology", "Vienna University of Technology", "University of New South Wales", "University of Helsinki", "University of Orléans", "Masaryk University", "Vienna University of Technology"], "authors": ["Serge Gaspers.....http://dblp.org/pers/hd/g/Gaspers:Serge", "Mikko Koivisto.....http://dblp.org/pers/hd/k/Koivisto:Mikko", "Mathieu Liedloff.....http://dblp.org/pers/hd/l/Liedloff:Mathieu", "Sebastian Ordyniak.....http://dblp.org/pers/hd/o/Ordyniak:Sebastian", "Stefan Szeider.....http://dblp.org/pers/hd/s/Szeider:Stefan"], "conf": "aaai", "year": "2012", "pages": -1}