{"title": "Finite Element based sequential Bayesian Non-Rigid Structure from Motion.", "fields": ["moore penrose pseudoinverse", "discretization", "extended kalman filter", "structure from motion", "stiffness matrix"], "abstract": "Navier's equations modelling linear elastic solid deformations are embedded within an Extended Kalman Filter (EKF) to compute a sequential Bayesian estimate for the Non-Rigid Structure from Motion problem. The algorithm processes every single frame of a sequence gathered with a full perspective camera. No prior data association is assumed because matches are computed within the EKF prediction-match-update cycle. Scene is coded as a Finite Element Method (FEM) elastic thin-plate solid, where the discretization nodes are the sparse set of scene points salient in the image. It is assumed a set of Gaussian forces acting on solid nodes to cause scene deformation. The EKF combines in a feedback loop an approximate FEM model and the frame rate measurements from the camera, resulting in an efficient method to embed Navier's equations without resorting to expensive non-linear FEM models. Classical FEM modelling has implied an interactive identification of boundary points to constrain the scene rigid motion, in this work this dissatisfying prior knowledge is no longer needed. The scene and camer rigid motion are combined in a unique pose vector and the estimation is coded relative to the camera. Additionally, the deforming effect of the Gaussian forces on the thin-plate is computed by means of the Moore-Penrose pseudoinverse of the FEM stiffness matrix. The proposed algorithm is validated with three real sequences gathered with hand-held camera observing isometric and non-isometric deformations. It is also shown the consistency of the EKF estimation with respect to ground truth computed from stereo.", "citation": "Citations (27)", "year": "2012", "departments": ["University of Zaragoza", "University of Zaragoza", "University of Zaragoza"], "conf": "cvpr", "authors": ["Antonio Agudo.....http://dblp.org/pers/hd/a/Agudo:Antonio", "Begoña Calvo.....http://dblp.org/pers/hd/c/Calvo:Bego=ntilde=a", "J. M. M. Montiel.....http://dblp.org/pers/hd/m/Montiel:J=_M=_M="], "pages": 8}