{"title": "Feature-domain super-resolution framework for Gabor-based face and iris recognition.", "fields": ["feature vector", "discriminant", "feature", "iris recognition", "biometrics", "three dimensional face recognition"], "abstract": "The low resolution of images has been one of the major limitations in recognising humans from a distance using their biometric traits, such as face and iris. Superresolution has been employed to improve the resolution and the recognition performance simultaneously, however the majority of techniques employed operate in the pixel domain, such that the biometric feature vectors are extracted from a super-resolved input image. Feature-domain superresolution has been proposed for face and iris, and is shown to further improve recognition performance by capitalising on direct super-resolving the features which are used for recognition. However, current feature-domain superresolution approaches are limited to simple linear features such as Principal Component Analysis (PCA) and Linear Discriminant Analysis (LDA), which are not the most discriminant features for biometrics. Gabor-based features have been shown to be one of the most discriminant features for biometrics including face and iris. This paper proposes a framework to conduct super-resolution in the non-linear Gabor feature domain to further improve the recognition performance of biometric systems. Experiments have confirmed the validity of the proposed approach, demonstrating superior performance to existing linear approaches for both face and iris biometrics.", "citation": "Citations (31)", "year": "2012", "departments": ["Queensland University of Technology", "Queensland University of Technology", "Queensland University of Technology", "Queensland University of Technology"], "conf": "cvpr", "authors": ["Kien Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Kien", "Sridha Sridharan.....http://dblp.org/pers/hd/s/Sridharan:Sridha", "Simon Denman.....http://dblp.org/pers/hd/d/Denman:Simon", "Clinton Fookes.....http://dblp.org/pers/hd/f/Fookes:Clinton"], "pages": 8}