{"title": "HJam: Attachment transmission in WLANs.", "fields": ["network packet", "bit error rate", "wi fi", "orthogonal frequency division multiplexing", "physical layer"], "abstract": "Effective coordination can dramatically reduce radio interference and avoid packet collisions for multistation wireless local area networks (WLANs). Coordination itself needs consume communication resource and thus competes with data transmission for the limited wireless radio resources. In traditional approaches, control frames and data packets are transmitted in an alternate manner, which brings a great deal of coordination overhead. In this paper, we propose a new communication model where the control frames can be \"attachedâ to the data transmission. Thus, control messages and data traffic can be transmitted simultaneously and consequently the channel utilization can be improved significantly. We implement the idea in OFDM-based WLANs called hJam, which fully explores the physical layer features of the OFDM modulation method and allows one data packet and a number of control messages to be transmitted together. hJam is implemented on the GNU Radio testbed consisting of eight USRP2 nodes. We also conduct comprehensive simulations and the experimental results show that hJam can improve the WLANs efficiency by up to 200 percent compared with the existing 802.11 family protocols.", "citation": "Citations (62)", "departments": ["Shenzhen University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Third Res. Inst ... Shanghai, China"], "authors": ["Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Haochao Li.....http://dblp.org/pers/hd/l/Li:Haochao", "Lu Wang.....http://dblp.org/pers/hd/w/Wang_0002:Lu", "Youwen Yi.....http://dblp.org/pers/hd/y/Yi:Youwen", "Yunhuai Liu.....http://dblp.org/pers/hd/l/Liu:Yunhuai", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "infocom", "year": "2012", "pages": 9}