{"title": "Malleable Proof Systems and Applications.", "fields": ["verifiable secret sharing", "proof complexity", "encryption", "correctness", "hardware architecture", "malleability", "mathematical proof"], "abstract": "Malleability for cryptography is not necessarily an opportunity for attack; in many cases it is a potentially useful feature that can be exploited. In this work, we examine notions of malleability for non-interactive zero-knowledge (NIZK) proofs. We start by defining a malleable proof system, and then consider ways to meaningfully control the malleability of the proof system, as in many settings we would like to guarantee that only certain types of transformations can be performed.\n\nAs our motivating application, we consider a shorter proof for verifiable shuffles. Our controlled-malleable proofs allow us for the first time to use one compact proof to prove the correctness of an entire multi-step shuffle. Each authority takes as input a set of encrypted votes and a controlled-malleable NIZK proof that these are a shuffle of the original encrypted votes submitted by the voters; it then permutes and re-randomizes these votes and updates the proof by exploiting its controlled malleability. As another application, we generically use controlled-malleable proofs to realize a strong notion of encryption security.\n\nFinally, we examine malleability in existing proof systems and observe that Groth-Sahai proofs are malleable. We then go beyond this observation by characterizing all the ways in which they are malleable, and use them to efficiently instantiate our generic constructions from above; this means we can instantiate our proofs and all their applications using only the Decision Linear (DLIN) assumption.", "citation": "Not cited", "year": "2012", "departments": ["Microsoft", "Microsoft", "Brown University", "University of California, San Diego"], "conf": "eurocrypt", "authors": ["Melissa Chase.....http://dblp.org/pers/hd/c/Chase:Melissa", "Markulf Kohlweiss.....http://dblp.org/pers/hd/k/Kohlweiss:Markulf", "Anna Lysyanskaya.....http://dblp.org/pers/hd/l/Lysyanskaya:Anna", "Sarah Meiklejohn.....http://dblp.org/pers/hd/m/Meiklejohn:Sarah"], "pages": 20}