{"title": "Privacy-Preserving and Content-Protecting Location Based Queries.", "fields": ["query optimization", "oblivious transfer", "computer security model", "point of interest", "information privacy", "location based service", "query expansion", "private information retrieval"], "abstract": "In this paper we present a solution to one of the location-based query problems. This problem is defined as follows: (i) a user wants to query a database of location data, known as Points Of Interest (POIs), and does not want to reveal his/her location to the server due to privacy concerns; (ii) the owner of the location data, that is, the location server, does not want to simply distribute its data to all users. The location server desires to have some control over its data, since the data is its asset. We propose a major enhancement upon previous solutions by introducing a two stage approach, where the first step is based on Oblivious Transfer and the second step is based on Private Information Retrieval, to achieve a secure solution for both parties. The solution we present is efficient and practical in many scenarios. We implement our solution on a desktop machine and a mobile device to assess the efficiency of our protocol. We also introduce a security model and analyse the security in the context of our protocol. Finally, we highlight a security weakness of our previous work and present a solution to overcome it.", "citation": "Citations (95)", "departments": ["Victoria University, Australia", "Victoria University, Australia", "Victoria University, Australia", "Purdue University", "Victoria University, Australia", "Victoria University, Australia", "Purdue University", "Purdue University"], "authors": ["Russell Paulet.....http://dblp.org/pers/hd/p/Paulet:Russell", "Md. Golam Kaosar.....http://dblp.org/pers/hd/k/Kaosar:Md=_Golam", "Xun Yi.....http://dblp.org/pers/hd/y/Yi:Xun", "Elisa Bertino.....http://dblp.org/pers/hd/b/Bertino:Elisa"], "conf": "icde", "year": "2012", "pages": 10}