{"title": "Random walks based multi-image segmentation: Quasiconvexity results and GPU-based solutions.", "fields": ["nonparametric statistics", "random walker algorithm", "random walk", "architecture", "sparse matrix"], "abstract": "We recast the Cosegmentation problem using Random Walker (RW) segmentation as the core segmentation algorithm, rather than the traditional MRF approach adopted in the literature so far. Our formulation is similar to previous approaches in the sense that it also permits Cosegmentation constraints (which impose consistency between the extracted objects from ≥ 2 images) using a nonparametric model. However, several previous nonparametric cosegmentation methods have the serious limitation that they require adding one auxiliary node (or variable) for every pair of pixels that are similar (which effectively limits such methods to describing only those objects that have high entropy appearance models). In contrast, our proposed model completely eliminates this restrictive dependence — the resulting improvements are quite significant. Our model further allows an optimization scheme exploiting quasiconvexity for model-based segmentation with no dependence on the scale of the segmented foreground. Finally, we show that the optimization can be expressed in terms of linear algebra operations on sparse matrices which are easily mapped to GPU architecture. We provide a highly specialized CUDA library for Cosegmentation exploiting this special structure, and report experimental results showing these advantages.", "citation": "Citations (81)", "year": "2012", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "Princeton University", "University of Wisconsin-Madison"], "conf": "cvpr", "authors": ["Maxwell D. Collins.....http://dblp.org/pers/hd/c/Collins:Maxwell_D=", "Jia Xu.....http://dblp.org/pers/hd/x/Xu:Jia", "Leo Grady.....http://dblp.org/pers/hd/g/Grady:Leo", "Vikas Singh.....http://dblp.org/pers/hd/s/Singh:Vikas"], "pages": 8}