{"title": "HySAD: a semi-supervised hybrid shilling attack detector for trustworthy product recommendation.", "fields": ["naive bayes classifier", "movielens", "semi supervised learning", "user profile", "collaborative filtering"], "abstract": "Shilling attackers apply biased rating profiles to recommender systems for manipulating online product recommendations. Although many studies have been devoted to shilling attack detection, few of them can handle the  hybrid  shilling attacks that usually happen in practice, and the studies for real-life applications are rarely seen. Moreover, little attention has yet been paid to modeling both labeled and unlabeled user profiles, although there are often a few labeled but numerous unlabeled users available in practice. This paper presents a Hybrid Shilling Attack Detector, or HySAD for short, to tackle these problems. In particular, HySAD introduces MC-Relief to select effective detection metrics, and Semi-supervised Naive Bayes (SNB_lambda) to precisely separate Random-Filler model attackers and Average-Filler model attackers from normal users. Thorough experiments on MovieLens and Netflix datasets demonstrate the effectiveness of HySAD in detecting hybrid shilling attacks, and its robustness for various obfuscated strategies. A real-life case study on product reviews of Amazon.cn is also provided, which further demonstrates that HySAD can effectively improve the accuracy of a collaborative-filtering based recommender system, and provide interesting opportunities for in-depth analysis of attacker behaviors. These, in turn, justify the value of HySAD for real-world applications.", "citation": "Citations (93)", "departments": ["Nanjing University of Finance and Economics", "Beihang University", "Nanjing University of Finance and Economics", "University of Technology, Sydney"], "authors": ["Zhiang Wu.....http://dblp.org/pers/hd/w/Wu_0001:Zhiang", "Junjie Wu.....http://dblp.org/pers/hd/w/Wu:Junjie", "Jie Cao.....http://dblp.org/pers/hd/c/Cao:Jie", "Dacheng Tao.....http://dblp.org/pers/hd/t/Tao:Dacheng"], "conf": "kdd", "year": "2012", "pages": 9}