{"title": "Support vector machines for anti-pattern detection.", "fields": ["program comprehension", "empirical process", "anti pattern", "software system", "software maintenance"], "abstract": "Developers may introduce anti-patterns in their software systems because of time pressure, lack of understanding, communication, and--or skills. Anti-patterns impede development and maintenance activities by making the source code more difficult to understand. Detecting anti-patterns in a whole software system may be infeasible because of the required parsing time and of the subsequent needed manual validation. Detecting anti-patterns on subsets of a system could reduce costs, effort, and resources. Researchers have proposed approaches to detect occurrences of anti-patterns but these approaches have currently some limitations: they require extensive knowledge of anti-patterns, they have limited precision and recall, and they cannot be applied on subsets of systems. To overcome these limitations, we introduce SVMDetect, a novel approach to detect anti-patterns, based on a machine learning technique---support vector machines. Indeed, through an empirical study involving three subject systems and four anti-patterns, we showed that the accuracy of SVMDetect is greater than of DETEX when detecting anti-patterns occurrences on a set of classes. Concerning, the whole system, SVMDetect is able to find more anti-patterns occurrences than DETEX.", "citation": "Citations (22)", "year": "2012", "departments": ["Université de Montréal", "École Polytechnique de Montréal", "École Polytechnique de Montréal", "École Polytechnique de Montréal", "École Polytechnique de Montréal"], "conf": "kbse", "authors": ["Abdou Maiga.....http://dblp.org/pers/hd/m/Maiga:Abdou", "Nasir Ali.....http://dblp.org/pers/hd/a/Ali:Nasir", "Neelesh Bhattacharya.....http://dblp.org/pers/hd/b/Bhattacharya:Neelesh", "Aminata Sabane.....http://dblp.org/pers/hd/s/Sabane:Aminata", "Yann-Gaël Guéhéneuc.....http://dblp.org/pers/hd/g/Gu=eacute=h=eacute=neuc:Yann=Ga=euml=l", "Giuliano Antoniol.....http://dblp.org/pers/hd/a/Antoniol:Giuliano", "Esma Aïmeur.....http://dblp.org/pers/hd/a/A=iuml=meur:Esma"], "pages": 4}