{"title": "Action recognition by exploring data distribution and feature correlation.", "fields": ["training set", "intuition", "small number", "annotation", "algorithm design"], "abstract": "Human action recognition in videos draws strong research interest in computer vision because of its promising applications for video surveillance, video annotation, interactive gaming, etc. However, the amount of video data containing human actions is increasing exponentially, which makes the management of these resources a challenging task. Given a database with huge volumes of unlabeled videos, it is prohibitive to manually assign specific action types to these videos. Considering that it is much easier to obtain a small number of labeled videos, a practical solution for organizing them is to build a mechanism which is able to conduct action annotation automatically by leveraging the limited labeled videos. Motivated by this intuition, we propose an automatic video annotation algorithm by integrating semi-supervised learning and shared structure analysis into a joint framework for human action recognition. We apply our algorithm on both synthetic and realistic video datasets, including KTH [20], CareMedia dataset [1], Youtube action [12] and its extended version, UCF50 [2]. Extensive experiments demonstrate that the proposed algorithm outperforms the compared algorithms for action recognition. Most notably, our method has a very distinct advantage over other compared algorithms when we have only a few labeled samples.", "citation": "Citations (33)", "year": "2012", "departments": ["University of Queensland", "Carnegie Mellon University", "University of Trento", "University of Queensland", "Commonwealth Scientific and Industrial Research Organisation"], "conf": "cvpr", "authors": ["Sen Wang.....http://dblp.org/pers/hd/w/Wang:Sen", "Yi Yang.....http://dblp.org/pers/hd/y/Yang_0001:Yi", "Zhigang Ma.....http://dblp.org/pers/hd/m/Ma:Zhigang", "Xue Li.....http://dblp.org/pers/hd/l/Li_0001:Xue", "Chaoyi Pang.....http://dblp.org/pers/hd/p/Pang:Chaoyi", "Alexander G. Hauptmann.....http://dblp.org/pers/hd/h/Hauptmann:Alexander_G="], "pages": 8}