{"title": "Realizing the full potential of PSM using proxying.", "fields": ["computer aided manufacturing", "android", "ieee 802 11", "testbed", "server"], "abstract": "The WiFi radio in smartphones consumes a significant portion of energy when active. To reduce the energy consumption, the Power Saving Mode was standardized in IEEE 802.11 and two major implementations, Static PSM and Dynamic PSM, have been widely used in mobile devices. Unfortunately, both PSMs have inherent drawbacks: Static PSM is energy efficient but imposes considerable extra delays on data transfers; Dynamic PSM incurs little extra delay but misses energy saving opportunities. In this paper, we first analyze a one-week trace from 10 users and show that more than 80% of all traffic are Web 2.0 flows, which are of very small sizes and short durations. Targeting these short but dominant flows, we propose a system called Percy, to achieve the best of both worlds (Static and Dynamic PSM), i.e., to maximize the energy saving while minimizing the delay of flow completion time. Percy works by deploying a web proxy at the AP and suitably configuring the PSM parameters, and is designed to work with unchanged clients running Dynamic PSM, and unchanged APs and Internet servers. We evaluate our system via trace-driven testbed experiments. Our results show that Percy saves 40–70% energy compared to Dynamic PSM configurations of Nokia, iPhone and Android, while imposing low extra delay that can hardly be perceived by users.", "citation": "Citations (28)", "departments": ["Purdue University", "Purdue University", "University at Buffalo", "Rice University", "Purdue University"], "authors": ["Ning Ding.....http://dblp.org/pers/hd/d/Ding:Ning", "Abhinav Pathak.....http://dblp.org/pers/hd/p/Pathak:Abhinav", "Dimitrios Koutsonikolas.....http://dblp.org/pers/hd/k/Koutsonikolas:Dimitrios", "Clayton Shepard.....http://dblp.org/pers/hd/s/Shepard:Clayton", "Y. Charlie Hu.....http://dblp.org/pers/hd/h/Hu:Y=_Charlie", "Lin Zhong.....http://dblp.org/pers/hd/z/Zhong_0001:Lin"], "conf": "infocom", "year": "2012", "pages": 5}