{"title": "RolX: structural role extraction & mining in large graphs.", "fields": ["scalability", "exploratory data analysis", "unsupervised learning", "transfer of learning", "nearest neighbor search"], "abstract": "Given a network, intuitively two nodes belong to the same role if they have similar structural behavior. Roles should be automatically determined from the data, and could be, for example, \"clique-members,\" \"periphery-nodes,\" etc. Roles enable numerous novel and useful network-mining tasks, such as sense-making, searching for similar nodes, and node classification. This paper addresses the question: Given a graph, how can we automatically discover  roles  for nodes? We propose  RolX (Role eXtraction) , a scalable (linear in the number of edges), unsupervised learning approach for automatically extracting structural roles from general network data. We demonstrate the effectiveness of  RolX  on several network-mining tasks: from exploratory data analysis to network transfer learning. Moreover, we compare network role discovery with network community discovery. We highlight fundamental differences between the two (e.g., roles generalize across disconnected networks, communities do not); and show that the two approaches are complimentary in nature.", "citation": "Citations (179)", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Rutgers University", "IBM", "Google"], "authors": ["Keith Henderson.....http://dblp.org/pers/hd/h/Henderson:Keith", "Brian Gallagher.....http://dblp.org/pers/hd/g/Gallagher:Brian", "Tina Eliassi-Rad.....http://dblp.org/pers/hd/e/Eliassi=Rad:Tina", "Hanghang Tong.....http://dblp.org/pers/hd/t/Tong:Hanghang", "Sugato Basu.....http://dblp.org/pers/hd/b/Basu:Sugato", "Leman Akoglu.....http://dblp.org/pers/hd/a/Akoglu:Leman", "Danai Koutra.....http://dblp.org/pers/hd/k/Koutra:Danai", "Christos Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Christos", "Lei Li.....http://dblp.org/pers/hd/l/Li_0005:Lei"], "conf": "kdd", "year": "2012", "pages": 9}