{"title": "MAQSA: a system for social analytics on news.", "fields": ["timeline", "dashboard", "social analytics", "social dynamics", "social graph"], "abstract": "We present MAQSA, a system for social analytics on news. MAQSA provides an interactive topic-centric dashboard that summarizes news articles and social activity (e.g., comments and tweets) around them. MAQSA helps editors and publishers in newsrooms understand user engagement and audience sentiment evolution on various topics of interest. It also helps news consumers explore public reaction on articles relevant to a topic and refine their exploration via related entities, topics, articles and tweets. Given a topic, e.g., \"Gulf Oil Spill,\" or \"The Arab Spring\", MAQSA combines three key dimensions: time, geographic location, and topic to generate a detailed activity dashboard around relevant articles. The dashboard contains an annotated comment timeline and a social graph of comments. It utilizes commenters' locations to build maps of comment sentiment and topics by region of the world. Finally, to facilitate exploration, MAQSA provides listings of related entities, articles, and tweets. It algorithmically processes large collections of articles and tweets, and enables the dynamic specification of topics and dates for exploration. In this demo, participants will be invited to explore the social dynamics around articles on oil spills, the Libyan revolution, and the Arab Spring. In addition, participants will be able to define and explore their own topics dynamically.", "citation": "Citations (17)", "year": "2012", "departments": ["Qatar Airways", "Qatar Airways", "Qatar Airways", "Qatar Airways", "Qatar Airways"], "conf": "sigmod", "authors": ["Sihem Amer-Yahia.....http://dblp.org/pers/hd/a/Amer=Yahia:Sihem", "Samreen Anjum.....http://dblp.org/pers/hd/a/Anjum:Samreen", "Amira Ghenai.....http://dblp.org/pers/hd/g/Ghenai:Amira", "Aysha Siddique.....http://dblp.org/pers/hd/s/Siddique:Aysha", "Sofiane Abbar.....http://dblp.org/pers/hd/a/Abbar:Sofiane", "Sam Madden.....http://dblp.org/pers/hd/m/Madden:Sam", "Adam Marcus.....http://dblp.org/pers/hd/m/Marcus_0002:Adam", "Mohammed El-Haddad.....http://dblp.org/pers/hd/e/El=Haddad:Mohammed"], "pages": 4}