{"title": "Aikido: accelerating shared data dynamic analyses.", "fields": ["hypervisor", "vector clock", "overhead", "thread", "debugging"], "abstract": "Despite a burgeoning demand for parallel programs, the tools available to developers working on shared-memory multicore processors have lagged behind. One reason for this is the lack of hardware support for inspecting the complex behavior of these parallel programs. Inter-thread communication, which must be instrumented for many types of analyses, may occur with any memory operation. To detect such thread communication in software, many existing tools require the instrumentation of all memory operations, which leads to significant performance overheads. To reduce this overhead, some existing tools resort to random sampling of memory operations, which introduces false negatives. Unfortunately, neither of these approaches provide the speed and accuracy programmers have traditionally expected from their tools. In this work, we present Aikido, a new system and framework that enables the development of efficient and transparent analyses that operate on shared data. Aikido uses a hybrid of existing hardware features and dynamic binary rewriting to detect thread communication with low overhead. Aikido runs a custom hypervisor below the operating system, which exposes per-thread hardware protection mechanisms not available in any widely used operating system. This hybrid approach allows us to benefit from the low cost of detecting memory accesses with hardware, while maintaining the word-level accuracy of a software-only approach. To evaluate our framework, we have implemented an Aikido-enabled vector clock race detector. Our results show that the Aikido enabled race-detector outperforms existing techniques that provide similar accuracy by up to 6.0x, and 76% on average, on the PARSEC benchmark suite.", "citation": "Citations (18)", "year": "2012", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "asplos", "authors": ["Marek Olszewski.....http://dblp.org/pers/hd/o/Olszewski:Marek", "Qin Zhao.....http://dblp.org/pers/hd/z/Zhao:Qin", "David Koh.....http://dblp.org/pers/hd/k/Koh:David", "Jason Ansel.....http://dblp.org/pers/hd/a/Ansel:Jason", "Saman P. Amarasinghe.....http://dblp.org/pers/hd/a/Amarasinghe:Saman_P="], "pages": 12}