{"title": "Leveraging social network concepts for efficient peer-to-peer live streaming systems.", "fields": ["live streaming", "peer to peer", "planetlab", "scalability", "overlay"], "abstract": "In current peer-to-peer (P2P) live streaming systems, nodes in a channel form a P2P overlay for video sharing. To watch a new channel, a node depends on the centralized server to join in the overlay of the channel. The increase in the number of channels in today's live streaming applications triggers users' desire of watching multiple channels successively or simultaneously. However, the support of such watching modes in current applications is no better than joining in different channel overlays successively or simultaneously, which if widely used, poses heavy burden on the centralized server. In order to achieve higher efficiency and scalability, we propose a Social network-Aided efficient liVe strEaming system (SAVE). SAVE regards users' channel switching or multi-channel watching as interactions between channels. By collecting the information of channel interactions and nodes' interests and watching times, SAVE forms nodes in multiple channels with frequent interactions into an overlay, constructs bridges between overlays of channels with less frequent interactions, and enables nodes to identify friends sharing similar interests and watching times. Thus, a node can connect to a new channel while staying in its current overlay, using bridges or relying on its friends, reducing the need to contact the centralized server. Extensive experimental results from the PeerSim simulator and PlanetLab verify that SAVE outperforms other popular protocols in system efficiency and server load reduction.", "citation": "Citations (4)", "departments": ["Clemson University", "Clemson University", "Clemson University", "Microsoft"], "authors": ["Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Ze Li.....http://dblp.org/pers/hd/l/Li:Ze", "Hailang Wang.....http://dblp.org/pers/hd/w/Wang:Hailang", "Jin Li.....http://dblp.org/pers/hd/l/Li_0001:Jin"], "conf": "mm", "year": "2012", "pages": 10}