{"title": "Weakly supervised structured output learning for semantic segmentation.", "fields": ["bayesian optimization", "active appearance model", "gaussian process", "model selection", "local optimum"], "abstract": "We address the problem of weakly supervised semantic segmentation. The training images are labeled only by the classes they contain, not by their location in the image. On test images instead, the method must predict a class label for every pixel. Our goal is to enable segmentation algorithms to use multiple visual cues in this weakly supervised setting, analogous to what is achieved by fully supervised methods. However, it is difficult to assess the relative usefulness of different visual cues from weakly supervised training data. We define a parametric family of structured models, were each model weights visual cues in a different way. We propose a Maximum Expected Agreement model selection principle that evaluates the quality of a model from the family without looking at superpixel labels. Searching for the best model is a hard optimization problem, which has no analytic gradient and multiple local optima. We cast it as a Bayesian optimization problem and propose an algorithm based on Gaussian processes to efficiently solve it. Our second contribution is an Extremely Randomized Hashing Forest that represents diverse superpixel features as a sparse binary vector. It enables using appearance models of visual classes that are fast at training and testing and yet accurate. Experiments on the SIFT-flow dataset show a significant improvement over previous weakly supervised methods and even over some fully supervised methods.", "citation": "Citations (122)", "year": "2012", "departments": ["ETH Zurich", "University of Edinburgh", "ETH Zurich"], "conf": "cvpr", "authors": ["Alexander Vezhnevets.....http://dblp.org/pers/hd/v/Vezhnevets:Alexander", "Vittorio Ferrari.....http://dblp.org/pers/hd/f/Ferrari:Vittorio", "Joachim M. Buhmann.....http://dblp.org/pers/hd/b/Buhmann:Joachim_M="], "pages": 8}