{"title": "Optimizing Statistical Information Extraction Programs over Evolving Text.", "fields": ["text corpus", "crfs", "inference", "conditional random field", "information extraction"], "abstract": "Statistical information extraction (IE) programs are increasingly used to build real-world IE systems such as Alibaba, Cite Seer, Kylin, and YAGO. Current statistical IE approaches consider the text corpora underlying the extraction program to be static. However, many real-world text corpora are dynamic (documents are inserted, modified, and removed). As the corpus evolves, and IE programs must be applied repeatedly to consecutive corpus snapshots to keep extracted information up to date. Applying IE {\\em from scratch\\/} to each snapshot may be inefficient: a pair of consecutive snapshots may change very little, but unaware of this, the program must run again from scratch. In this paper, we present \\crflex, a system that efficiently executes such repeated statistical IE, by recycling previous IE results to enable incremental update. We focus on statistical IE programs which use a leading statistical model, Conditional Random Fields (CRFs). We show how to model properties of the CRF inference algorithms for incremental update and how to exploit them to correctly recycle previous inference results. Then we show how to efficiently capture and store intermediate results of IE programs for subsequent recycling. We find that there is a tradeoff between the I/O cost spent on reading and writing intermediate results, and CPU cost we can save from recycling those intermediate results. Therefore we present a cost-based solution to determine the most efficient recycling approach for any given CRF-based IE program and an evolving corpus. We present extensive experiments with CRF-based IE programs for 3 IE tasks over a real-world data set to demonstrate the utility of our approach.", "citation": "Citations (19)", "departments": ["Hewlett-Packard", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "Hewlett-Packard"], "authors": ["Fei Chen.....http://dblp.org/pers/hd/c/Chen:Fei", "Xixuan Feng.....http://dblp.org/pers/hd/f/Feng:Xixuan", "Christopher Ré.....http://dblp.org/pers/hd/r/R=eacute=:Christopher", "Min Wang.....http://dblp.org/pers/hd/w/Wang:Min"], "conf": "icde", "year": "2012", "pages": 12}