{"title": "Disengagement in pair programming: Does it matter?", "fields": ["software prototyping", "collaborative software", "agile software development", "pair programming", "disengagement theory"], "abstract": "Pair Programming (PP) requires close collaboration and mutual engagement. Most existing empirical studies of PP do not focus on developers' behaviour during PP sessions, and focus instead on the effects of PP such as productivity. However, disengagement, where a developer is not focusing on solving the task or understanding the problem and allows their partner to work by themselves, can hinder collaboration between developers and have a negative effect on their performance. This paper reports on an empirical study that investigates disengagement. Twenty-one industrial pair programming sessions were video and audio recorded and qualitatively analysed to investigate circumstances that lead to disengagement. We identified five reasons for disengagement: interruptions during the collaboration, the way the work is divided, the simplicity of the task involved, social pressure on inexperienced pair programmers, and time pressure. Our findings suggest that disengagement is sometimes acceptable and agreed upon between the developers in order to speed up problem solving. However, we also found episodes of disengagement where developers “drop out” of their PP sessions and are not able to follow their partner's work nor contribute to the task at hand, thus losing the expected benefits of pairing. Analysis of sessions conducted under similar circumstances but where mutual engagement was sustained identified three behaviours that help to maintain engagement: encouraging the novice to drive, verbalisation and feedback, and asking for clarification.", "citation": "Citations (10)", "departments": ["Open University", "Open University", "Open University"], "authors": ["Laura Plonka.....http://dblp.org/pers/hd/p/Plonka:Laura", "Helen Sharp.....http://dblp.org/pers/hd/s/Sharp:Helen", "Janet van der Linden.....http://dblp.org/pers/hd/l/Linden:Janet_van_der"], "conf": "icse", "year": "2012", "pages": 11}