{"title": "Spectrum leasing to femto service provider with hybrid access.", "fields": ["end user", "macrocell", "femtocell", "price of anarchy", "stackelberg competition"], "abstract": "The concept of femtocell that operates in licensed spectrum to provide home coverage has attracted interest in the wireless industry due to high spatial reuse, and extensive deployments of femtocells is expected in the future. In this paper, we consider the scenario that a femtocell service provider (FSP) expects to rent spectrum from the coexisting macrocell service provider (MSP) to serve its end users. In addition to the spectrum leasing payment, the FSP may allow hybrid access of macrocell users to improve the utilities of itself and MSP, which are defined as the sum of data traffic and payment/revenue. We propose the spectrum leasing framework taking hybrid access into consideration. The whole procedure is modeled as a three-stage Stackelberg game, where MSP and FSP determine the spectrum leasing ratio, spectrum leasing price and open access ratio sequentially to maximize their utilities, and the existence of the Nash Equilibrium of the sequential game is analyzed. We characterize the equilibrium, in terms of access price, spectrum acquisition of FSP, the open access ratio, and price of anarchy via simulation. Numerical results show that both MSP and FSP can benefit from spectrum leasing, and hybrid access of femtocell can further improve their utilities, which provide sufficient incentive for their cooperation.", "citation": "Citations (66)", "departments": ["Huawei", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Youwen Yi.....http://dblp.org/pers/hd/y/Yi:Youwen", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Tao Jiang.....http://dblp.org/pers/hd/j/Jiang_0002:Tao"], "conf": "infocom", "year": "2012", "pages": 9}