{"title": "Uplink soft frequency reuse for self-coexistence of cognitive radio networks operating in white-space spectrum.", "fields": ["orthogonal frequency division multiple access", "frequency allocation", "transmitter power output", "telecommunications link", "frequency division multiple access"], "abstract": "Recent advances in cognitive radio (CR) technology have brought about a number of wireless standards that support opportunistic access to available white-space spectrum. Addressing the self-coexistence of CR networks in such an environment is very challenging, especially when coexisting networks operate in the same swath of spectrum with little or no direct coordination. In this paper, we study the problem of co-channel self-coexistence of uncoordinated CR networks that employ orthogonal frequency division multiple access (OFDMA) in the uplink. We frame the self-coexistence problem as a non-cooperative game, and propose an uplink soft frequency reuse (USFR) technique to enable globally power-efficient and locally fair sharing of white-space spectrum. In each network, uplink resource allocation is decoupled into two subproblems: subchannel allocation (SCA) and transmit power control (TPC). We provide a unique optimal solution to the TPC subproblem, and present a low-complexity heuristic for the SCA subproblem. Furthermore, we frame the TPC and SCA games, and integrate them as a heuristic algorithm that achieves the Nash equilibrium in a fully distributed manner. Our simulation results show that the proposed USFR technique significantly improves self-coexistence in several aspects, including spectrum utilization, power consumption, and intra-cell fairness.", "citation": "Citations (4)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech"], "authors": ["Bo Gao.....http://dblp.org/pers/hd/g/Gao:Bo", "Jung-Min Park.....http://dblp.org/pers/hd/p/Park_0001:Jung=Min", "Yaling Yang.....http://dblp.org/pers/hd/y/Yang:Yaling"], "conf": "infocom", "year": "2012", "pages": 9}