{"title": "SocialTransfer: cross-domain transfer learning from social streams for media applications.", "fields": ["popularity", "transfer of learning", "topic model", "latent dirichlet allocation", "use case"], "abstract": "The usage and applications of social media have become pervasive. This has enabled an innovative paradigm to solve multimedia problems (e.g., recommendation and popularity prediction), which are otherwise hard to address purely by traditional approaches. In this paper, we investigate how to build a mutual connection among the disparate social media on the Internet, using which cross-domain media recommendation can be realized. We accomplish this goal through  SocialTransfer ---a novel cross-domain real-time transfer learning framework. While existing transfer learning methods do not address how to utilize the real time social streams, our proposed  SocialTransfer  is able to effectively learn from social streams to help multimedia applications, assuming an intermediate topic space can be built across domains. It is characterized by two key components: 1) a topic space learned in real time from social streams via Online Streaming Latent Dirichlet Allocation (OSLDA), and 2) a real-time cross-domain graph spectra analysis based transfer learning method that seamlessly incorporates learned topic models from social streams into the transfer learning framework. We present as use cases of \\emph{SocialTransfer} two video recommendation applications that otherwise can hardly be achieved by conventional media analysis techniques: 1) socialized query suggestion for video search, and 2) socialized video recommendation that features socially trending topical videos. We conduct experiments on a real-world large-scale dataset, including 10.2 million tweets and 5.7 million YouTube videos and show that \\emph{SocialTransfer} outperforms traditional learners significantly, and plays a natural and interoperable connection across video and social domains, leading to a wide variety of cross-domain applications.", "citation": "Citations (73)", "departments": ["University of Missouri", "Microsoft", "University of Missouri", "Microsoft"], "authors": ["Suman Deb Roy.....http://dblp.org/pers/hd/r/Roy:Suman_Deb", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Wenjun Zeng.....http://dblp.org/pers/hd/z/Zeng:Wenjun", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2012", "pages": 10}