{"title": "Combinatorial auction with time-frequency flexibility in cognitive radio networks.", "fields": ["auction theory", "cognitive radio", "frequency allocation", "auction algorithm", "combinatorial auction"], "abstract": "In this paper, we tackle the spectrum allocation problem in cognitive radio (CR) networks with time-frequency flexibility consideration using combinatorial auction. Different from all the previous works using auction mechanisms, we model the spectrum opportunity in a time-frequency division manner. This model caters to much more flexible requirements from secondary users (SUs) and has very clear application meaning. The additional flexibility also brings theoretical and computational difficulties. We model the spectrum allocation as a combinatorial auction and show that under the time-frequency flexible model, reaching the social welfare maximal is NP hard and the upper bound of worst-case approximation ratio is √m, m is the number of time-frequency slots. Therefore, we design an auction mechanism with near-optimal winner determination algorithm, whose worst-case approximation ratio reaches the upper bound √m. Further we devise a truthful payment scheme under the approximation winner determination algorithm to guarantee that all the bids submitted by SUs reflect their true valuation of the spectrum. To further address the issue and reach optimality, we simplify the general model to that only frequency flexibility is allowed, which is still useful, and propose a truthful, optimal and computationally efficient auction mechanism under modified model. Extensive simulation results show that all the proposed algorithms generate high social welfare as well as high spectrum utilization ratio. What's more, the actual approximation ratio of near-optimal algorithm is much higher than the worst-case approximation ratio.", "citation": "Citations (96)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Science and Technology, Sana'a"], "authors": ["Mo Dong.....http://dblp.org/pers/hd/d/Dong:Mo", "Gaofei Sun.....http://dblp.org/pers/hd/s/Sun:Gaofei", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian"], "conf": "infocom", "year": "2012", "pages": 9}