{"title": "Optimal range assignment in solar powered active wireless sensor networks.", "fields": ["battery", "quasiconvex function", "dynamic programming", "scalability", "solar power"], "abstract": "Energy harvesting in a sensor network is essential in situations where it is either difficult or not cost effective to access the network's nodes to replace the batteries. In this paper, we investigate the problems involved in controlling an active wireless sensor network that is powered both by rechargeable batteries and solar energy. The objective of this control is to maximize the network's quality of coverage (QoC), defined as the minimum number of targets that must be covered over a 24-hour period. Assuming a time varying solar profile, the problem is to optimally control the sensing range of each sensor so as to maximize the QoC. Implicit in the solution is the dynamic allocation of solar energy during the day to sensing tasks and to recharging the battery so that minimum coverage is guaranteed even during the night, when only the batteries can supply energy to the sensors. The problem turns out to be a nonlinear optimal control problem of high complexity. Exploiting the specific structure of the problem, we present a method to solve it as a series of quasiconvex (unimodal) optimization problems. The runtime of the proposed solution is 60X less than a naive method that is based on dynamic programming, while its worst-case error is less than 8%. Unlike the dynamic programming method, the proposed method is scalable to large networks consisting of hundreds of sensors and targets. This paper also offers several insights in the design of energy-harvesting networks, which result in minimum network setup cost through the determination of the optimal configuration of the number of sensors and the sampling time.", "citation": "Citations (23)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "University of Arizona"], "authors": ["Benjamin Gaudette.....http://dblp.org/pers/hd/g/Gaudette:Benjamin", "Vinay Hanumaiah.....http://dblp.org/pers/hd/h/Hanumaiah:Vinay", "Sarma B. K. Vrudhula.....http://dblp.org/pers/hd/v/Vrudhula:Sarma_B=_K=", "Marwan Krunz.....http://dblp.org/pers/hd/k/Krunz:Marwan"], "conf": "infocom", "year": "2012", "pages": 9}