{"title": "Batch mode active sampling based on marginal probability distribution matching.", "fields": ["instance based learning", "unsupervised learning", "online machine learning", "active learning", "quadratic programming", "multi task learning", "stability", "semi supervised learning"], "abstract": "Active Learning is a machine learning and data mining technique that selects the most informative samples for labeling and uses them as training data; it is especially useful when there are large amount of unlabeled data and labeling them is expensive. Recently, batch-mode active learning, where a set of samples are selected concurrently for labeling, based on their collective merit, has attracted a lot of attention. The objective of batch-mode active learning is to select a set of informative samples so that a classifier learned on these samples has good generalization performance on the unlabeled data. Most of the existing batch-mode active learning methodologies try to achieve this by selecting samples based on varied criteria. In this paper we propose a novel criterion which achieves good generalization performance of a classifier by specifically selecting a set of query samples that minimizes the difference in distribution between the labeled and the unlabeled data, after annotation. We explicitly measure this difference based on all candidate subsets of the unlabeled data and select the best subset. The proposed objective is an NP-hard integer programming optimization problem. We provide two optimization techniques to solve this problem. In the first one, the problem is transformed into a convex quadratic programming problem and in the second method the problem is transformed into a linear programming problem. Our empirical studies using publicly available UCI datasets and a biomedical image dataset demonstrate the effectiveness of the proposed approach in comparison with the state-of-the-art batch-mode active learning methods. We also present two extensions of the proposed approach, which incorporate uncertainty of the predicted labels of the unlabeled data and transfer learning in the proposed formulation. Our empirical studies on UCI datasets show that incorporation of uncertainty information improves performance at later iterations while our studies on 20 Newsgroups dataset show that transfer learning improves the performance of the classifier during initial iterations.", "citation": "Citations (23)", "departments": ["Arizona State University", "Arizona State University", "IBM", "University of California, Davis", "Arizona State University", "Arizona State University", "Arizona State University", "Huawei", "University of California, Davis", "Arizona State University"], "authors": ["Rita Chattopadhyay.....http://dblp.org/pers/hd/c/Chattopadhyay:Rita", "Zheng Wang.....http://dblp.org/pers/hd/w/Wang_0011:Zheng", "Wei Fan.....http://dblp.org/pers/hd/f/Fan_0001:Wei", "Ian Davidson.....http://dblp.org/pers/hd/d/Davidson:Ian", "Sethuraman Panchanathan.....http://dblp.org/pers/hd/p/Panchanathan:Sethuraman", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping"], "conf": "kdd", "year": "2012", "pages": 9}