{"title": "Submodular video hashing: a unified framework towards video pooling and indexing.", "fields": ["feature hashing", "extendible hashing", "dynamic perfect hashing", "universal hashing", "open addressing"], "abstract": "This paper develops a novel framework for efficient large-scale video retrieval. We aim to find video according to higher level similarities, which is beyond the scope of traditional near duplicate search. Following the popular hashing technique we employ compact binary codes to facilitate nearest neighbor search. Unlike the previous methods which capitalize on only one type of hash code for retrieval, this paper combines heterogeneous hash codes to effectively describe the diverse and multi-scale visual contents in videos. Our method integrates feature pooling and hashing in a single framework. In the pooling stage, we cast video frames into a set of pre-specified components, which capture a variety of semantics of video contents. In the hashing stage, we represent each video component as a compact hash code, and combine multiple hash codes into hash tables for effective search. To speed up the retrieval while retaining most informative codes, we propose a graph-based influence maximization method to bridge the pooling and hashing stages. We show that the influence maximization problem is submodular, which allows a greedy optimization method to achieve a nearly optimal solution. Our method works very efficiently, retrieving thousands of video clips from TRECVID dataset in about 0.001 second. For a larger scale synthetic dataset with 1M samples, it uses less than 1 second in response to 100 queries. Our method is extensively evaluated in both unsupervised and supervised scenarios, and the results on TRECVID Multimedia Event Detection and Columbia Consumer Video datasets demonstrate the success of our proposed technique.", "citation": "Citations (28)", "departments": ["IBM", "Columbia University", "Columbia University", "Columbia University"], "authors": ["Liangliang Cao.....http://dblp.org/pers/hd/c/Cao:Liangliang", "Zhenguo Li.....http://dblp.org/pers/hd/l/Li:Zhenguo", "Yadong Mu.....http://dblp.org/pers/hd/m/Mu:Yadong", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "conf": "mm", "year": "2012", "pages": 10}