{"title": "Efficient Similarity Search over Encrypted Data.", "fields": ["locality sensitive hashing", "secure multi party computation", "encryption", "server", "nearest neighbor search"], "abstract": "In recent years, due to the appealing features of cloud computing, large amount of data have been stored in the cloud. Although cloud based services offer many advantages, privacy and security of the sensitive data is a big concern. To mitigate the concerns, it is desirable to outsource sensitive data in encrypted form. Encrypted storage protects the data against illegal access, but it complicates some basic, yet important functionality such as the search on the data. To achieve search over encrypted data without compromising the privacy, considerable amount of searchable encryption schemes have been proposed in the literature. However, almost all of them handle exact query matching but not similarity matching, a crucial requirement for real world applications. Although some sophisticated secure multi-party computation based cryptographic techniques are available for similarity tests, they are computationally intensive and do not scale for large data sources. In this paper, we propose an efficient scheme for similarity search over encrypted data. To do so, we utilize a state-of-the-art algorithm for fast near neighbor search in high dimensional spaces called locality sensitive hashing. To ensure the confidentiality of the sensitive data, we provide a rigorous security definition and prove the security of the proposed scheme under the provided definition. In addition, we provide a real world application of the proposed scheme and verify the theoretical results with empirical observations on a real dataset.", "citation": "Citations (221)", "departments": ["University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas"], "authors": ["Mehmet Kuzu.....http://dblp.org/pers/hd/k/Kuzu:Mehmet", "Mohammad Saiful Islam.....http://dblp.org/pers/hd/i/Islam:Mohammad_Saiful", "Murat Kantarcioglu.....http://dblp.org/pers/hd/k/Kantarcioglu:Murat"], "conf": "icde", "year": "2012", "pages": 12}