{"title": "Part-based multiple-person tracking with partial occlusion handling.", "fields": ["occlusion", "computer graphics", "object detection", "support vector machine", "feature extraction"], "abstract": "Single camera-based multiple-person tracking is often hindered by difficulties such as occlusion and changes in appearance. In this paper, we address such problems by proposing a robust part-based tracking-by-detection framework. Human detection using part models has become quite popular, yet its extension in tracking has not been fully explored. Our approach learns part-based person-specific SVM classifiers which capture the articulations of the human bodies in dynamically changing appearance and background. With the part-based model, our approach is able to handle partial occlusions in both the detection and the tracking stages. In the detection stage, we select the subset of parts which maximizes the probability of detection, which significantly improves the detection performance in crowded scenes. In the tracking stage, we dynamically handle occlusions by distributing the score of the learned person classifier among its corresponding parts, which allows us to detect and predict partial occlusions, and prevent the performance of the classifiers from being degraded. Extensive experiments using the proposed method on several challenging sequences demonstrate state-of-the-art performance in multiple-people tracking.", "citation": "Citations (302)", "year": "2012", "departments": ["University of Central Florida", "University of Central Florida", "University of Central Florida", "University of Nevada, Reno", "University of Central Florida"], "conf": "cvpr", "authors": ["Guang Shu.....http://dblp.org/pers/hd/s/Shu:Guang", "Afshin Dehghan.....http://dblp.org/pers/hd/d/Dehghan:Afshin", "Omar Oreifej.....http://dblp.org/pers/hd/o/Oreifej:Omar", "Emily Hand.....http://dblp.org/pers/hd/h/Hand:Emily", "Mubarak Shah.....http://dblp.org/pers/hd/s/Shah:Mubarak"], "pages": 7}