{"title": "Analyzing Query Optimization Process: Portraits of Join Enumeration Algorithms.", "fields": ["hash join", "recursive join", "sql", "heuristic", "sort merge join"], "abstract": "Search spaces generated by query optimizers during the optimization process encapsulate characteristics of the join enumeration algorithms, the cost models, as well as critical decisions made for pruning and choosing the best plan. We demonstrate the Join Enumeration Viewer which is a tool designed for visualizing, mining, and comparing plan search spaces generated by different join enumeration algorithms when optimizing same SQL statement. We have enhanced Sybase SQL Anywhere relational database management system to log, in a very compact format, its search space during an optimization process. Such optimization log can then be analyzed by the Join Enumeration Viewer which internally builds the logical and physical plan graphs representing complete and partial plans considered during the optimization process. The optimization logs also contain statistics of the resource consumption during the query optimization such as optimization time breakdown, for example, for logical join enumeration versus costing physical plans, and memory allocation for different optimization structures. The SQL Anywhere Optimizer implements a highly adaptable, self-managing, search space generation algorithm by having several join enumeration algorithms to choose from, each enhanced with different ordering and pruning techniques. The emphasis of the demonstration will be on comparing and contrasting these join enumeration algorithms by analyzing their optimization logs. The demonstration scenarios will include optimizing SQL statements under various conditions which will exercise different algorithms, pruning and ordering techniques. These search spaces will then be visualized and compared using the Join Enumeration Viewer.", "citation": "Citations (2)", "departments": ["Sybase", "University of Waterloo", "University of Waterloo"], "authors": ["Anisoara Nica.....http://dblp.org/pers/hd/n/Nica:Anisoara", "Ian Charlesworth.....http://dblp.org/pers/hd/c/Charlesworth:Ian", "Maysum Panju.....http://dblp.org/pers/hd/p/Panju:Maysum"], "conf": "icde", "year": "2012", "pages": 4}