{"title": "Efficient transaction processing in SAP HANA database: the end of a column store myth.", "fields": ["scalability", "external data representation", "data management", "sap hana", "transaction processing"], "abstract": "The SAP HANA database is the core of SAP's new data management platform. The overall goal of the SAP HANA database is to provide a generic but powerful system for different query scenarios, both transactional and analytical, on the same data representation within a highly scalable execution environment. Within this paper, we highlight the main features that differentiate the SAP HANA database from classical relational database engines. Therefore, we outline the general architecture and design criteria of the SAP HANA in a first step. In a second step, we challenge the common belief that column store data structures are only superior in analytical workloads and not well suited for transactional workloads. We outline the concept of record life cycle management to use different storage formats for the different stages of a record. We not only discuss the general concept but also dive into some of the details of how to efficiently propagate records through their life cycle and moving database entries from write-optimized to read-optimized storage formats. In summary, the paper aims at illustrating how the SAP HANA database is able to efficiently work in analytical as well as transactional workload environments.", "citation": "Citations (168)", "year": "2012", "departments": ["SAP, Palo Alto, CA, USA", "SAP, Walldorf, Germany", "SAP, Walldorf, Germany", "SAP, Seoul, South Korea", "SAP, Walldorf, Germany"], "conf": "sigmod", "authors": ["Vishal Sikka.....http://dblp.org/pers/hd/s/Sikka:Vishal", "Franz Färber.....http://dblp.org/pers/hd/f/F=auml=rber:Franz", "Wolfgang Lehner.....http://dblp.org/pers/hd/l/Lehner:Wolfgang", "Sang Kyun Cha.....http://dblp.org/pers/hd/c/Cha:Sang_Kyun", "Thomas Peh.....http://dblp.org/pers/hd/p/Peh:Thomas", "Christof Bornhövd.....http://dblp.org/pers/hd/b/Bornh=ouml=vd:Christof"], "pages": 12}