{"title": "Formal Verification and Validation of ERTMS Industrial Railway Train Spacing System.", "fields": ["post silicon validation", "validation rule", "functional verification", "verification", "software verification"], "abstract": "Formal verification and validation is a fundamental step for the certification of railways critical systems. Many railways safety standards (e.g. the CENELEC EN-50126, EN-50128 and EN-50129 standards implement the mandatory safety requirements of IEC-61508-7 standard for Functional and Safety) currently mandate the use of formal methods in the design to certify correctness.\n\nIn this paper we describe an industrial application of formal methods for the verification and validation of \"Logica di Sicurezza\" (LDS), the safety logic of a railways ERTMS Level 2 system developed by Ansaldo-STS. LDS is a generic control software that needs to be instantiated on a railways network configuration. We developed a methodology for the verification and validation of a critical subset of LDS deployed on typical realistic railways network configurations. To show feasibility, effectiveness and scalability, we have experimented with several state of the art symbolic software model checking techniques and tools on different network configurations. From the experiments, we have successfully identified an effective strategy for the verification and validation of our case study. Moreover, the results of experiments show that formal verification and validation is feasible and effective, and also scales reasonably well with the size of the configuration. Given the results, Ansaldo-STS is currently integrating the methodology in its internal Development and Verification & Validation Flow.", "citation": "Citations (20)", "year": "2012", "departments": ["fondazione bruno kessler", "Ansaldo STS", "Ansaldo STS", "fondazione bruno kessler", "Ansaldo STS"], "conf": "cav", "authors": ["Alessandro Cimatti.....http://dblp.org/pers/hd/c/Cimatti:Alessandro", "Raffaele Corvino.....http://dblp.org/pers/hd/c/Corvino:Raffaele", "Armando Lazzaro.....http://dblp.org/pers/hd/l/Lazzaro:Armando", "Iman Narasamdya.....http://dblp.org/pers/hd/n/Narasamdya:Iman", "Tiziana Rizzo.....http://dblp.org/pers/hd/r/Rizzo:Tiziana", "Marco Roveri.....http://dblp.org/pers/hd/r/Roveri:Marco", "Angela Sanseviero.....http://dblp.org/pers/hd/s/Sanseviero:Angela", "Andrei Tchaltsev.....http://dblp.org/pers/hd/t/Tchaltsev:Andrei"], "pages": 16}