{"title": "ObliviAd: Provably Secure and Practical Online Behavioral Advertising.", "fields": ["provable security", "user profile", "behavioral targeting", "trusted third party", "information privacy"], "abstract": "Online behavioral advertising (OBA) involves the tracking of web users' online activities in order to deliver tailored advertisements. OBA has become a rapidly increasing source of revenue for a number of web services, and it is typically conducted by third-party data analytics firms such as brokers, which track user behaviors across web-sessions using mechanisms such as persistent cookies. This practice raises significant privacy concerns among users and privacy advocates alike. Therefore, the task of designing OBA systems that do not reveal user profiles to third parties has been receiving growing interest from the research community. Nevertheless, existing solutions are not ideal for privacy preserving OBA: some of them do not provide adequate privacy to users or adequate targeting information to brokers, while others require trusted third parties that are difficult to realize. In this paper, we propose ObliviAd a provably secure architecture for privacy preserving OBA. The distinguishing features of our approach are the usage of secure hardware-based private information retrieval for distributing advertisements and high-latency mixing of electronic tokens for billing advertisers without disclosing any information about client profiles to brokers. ObliviAd does not assume any trusted party and provides brokers an economical alternative that preserves the privacy of users without hampering the precision of ads selection. We present the first formal security definitions for OBA systems (namely, profile privacy, profile unlink ability, and billing correctness) and conduct a formal security analysis of ObliviAd using ProVerif, an automated cryptographic protocol verifier, establishing the aforementioned security properties against a strong adversarial model. Finally, we demonstrated the practicality of our approach with an experimental evaluation.", "citation": "Citations (105)", "departments": ["Saarland University", "Saarland University", "MPI-SWS, Germany", "MPI-SWS, Germany"], "authors": ["Michael Backes.....http://dblp.org/pers/hd/b/Backes_0001:Michael", "Aniket Kate.....http://dblp.org/pers/hd/k/Kate:Aniket", "Matteo Maffei.....http://dblp.org/pers/hd/m/Maffei:Matteo", "Kim Pecina.....http://dblp.org/pers/hd/p/Pecina:Kim"], "conf": "sp", "year": "2012", "pages": 15}