{"title": "Architectural perspectives of future wireless base stations based on the IBM PowerEN™ processor.", "fields": ["register file", "multithreading", "throughput", "system on a chip", "simd"], "abstract": "In wireless networks, base stations are responsible for operating on large amounts of traffic at high speed rates. With the advent of new standards, as 4G, further pressure is put in the hardware requirements to satisfy speeds of up to 1 Gbps. In this work, we study the applicability and potential benefits of the IBM PowerEN processor (a multi-core, massively multithreaded platform) in the realm of base stations for the 3G and 4G standards. The approach involves exploiting the throughput computation capabilities of the PowerEN processor, replacing the bus-attached special-function accelerators with a layer of in-line universal acceleration support, incorporated within the cores. A key feature of this in-line accelerator is a bank-based very-large register file, with embedded SIMD support. This processor-in-regfile (PIR) strategy is implemented as local computation elements (LCEs) attached to each bank, overcoming the limited number of register file ports. Because each LCE is a SIMD computation element, and all of them can proceed concurrently, the PIR approach constitutes a highly-parallel super-wide-SIMD device. To target a broad spectrum of applications for base stations, we also consider a PIR-based architecture built upon reconfigurable LCEs. In this paper, we evaluate the in-line universal accelerator and the PIR strategy focusing on two specific applications for base stations: FFT and Turbo Decoding.", "citation": "Citations (2)", "departments": ["IBM", "IBM", "IBM", "Research Triangle Park", "IBM"], "authors": ["Augusto Vega.....http://dblp.org/pers/hd/v/Vega:Augusto", "Pradip Bose.....http://dblp.org/pers/hd/b/Bose:Pradip", "Alper Buyuktosunoglu.....http://dblp.org/pers/hd/b/Buyuktosunoglu:Alper", "Jeff H. Derby.....http://dblp.org/pers/hd/d/Derby:Jeff_H=", "Michele Franceschini.....http://dblp.org/pers/hd/f/Franceschini:Michele", "Charles Johnson.....http://dblp.org/pers/hd/j/Johnson:Charles", "Robert K. Montoye.....http://dblp.org/pers/hd/m/Montoye:Robert_K="], "conf": "hpca", "year": "2012", "pages": 10}