{"title": "Automatic discovery of groups of objects for scene understanding.", "fields": ["cluster analysis", "object oriented design", "categorization", "object detection", "visualization"], "abstract": "Objects in scenes interact with each other in complex ways. A key observation is that these interactions manifest themselves as predictable visual patterns in the image. Discovering and detecting these structured patterns is an important step towards deeper scene understanding. It goes beyond using either individual objects or the scene as a whole as the semantic unit. In this work, we promote \"groups of objects\". They are high-order composites of objects that demonstrate consistent spatial, scale, and viewpoint interactions with each other. These groups of objects are likely to correspond to a specific layout of the scene. They can thus provide cues for the scene category and can also prime the likely locations of other objects in the scene. It is not feasible to manually generate a list of all possible groupings of objects we find in our visual world. Hence, we propose an algorithm that automatically discovers groups of arbitrary numbers of participating objects from a collection of images labeled with object categories. Our approach builds a 4-dimensional transform space of location, scale and viewpoint, and efficiently identifies all recurring compositions of objects across images. We then model the discovered groups of objects using the deformable parts-based model. Our experiments on a variety of datasets show that using groups of objects can significantly boost the performance of object detection and scene categorization.", "citation": "Citations (70)", "year": "2012", "departments": ["Cornell University", "Toyota Technological Institute", "Cornell University"], "conf": "cvpr", "authors": ["Congcong Li.....http://dblp.org/pers/hd/l/Li:Congcong", "Devi Parikh.....http://dblp.org/pers/hd/p/Parikh:Devi", "Tsuhan Chen.....http://dblp.org/pers/hd/c/Chen:Tsuhan"], "pages": 8}