{"title": "Optimal top-k generation of attribute combinations based on ranked lists.", "fields": ["xml", "ranking", "data type", "scalability", "tuple"], "abstract": "In this work, we study a novel query type, called top- k,m  queries. Suppose we are given a set of groups and each group contains a set of attributes, each of which is associated with a ranked list of tuples, with ID and score. All lists are ranked in decreasing order of the scores of tuples. We are interested in finding the best combinations of attributes, each combination involving one attribute from each group. More specifically, we want the top- k  combinations of attributes according to the corresponding top-m tuples with matching IDs. This problem has a wide range of applications from databases to search engines on traditional and non-traditional types of data (relational data, XML, text, etc.). We show that a straightforward extension of an optimal top- k  algorithm, the Threshold Algorithm (TA), has shortcomings in solving the  km  problem, as it needs to compute a large number of intermediate results for each combination and reads moreinputs than needed. To overcome this weakness, we provide here, for the first time, a  provably instance-optimal  algorithm and further develop optimizations for efficient query evaluation to reduce computational and memory costs and the number of accesses. We demonstrate experimentally the scalability and efficiency of our algorithms over three real applications.", "citation": "Citations (12)", "year": "2012", "departments": ["Renmin University of China", "Télécom ParisTech", "Renmin University of China", "Renmin University of China", "Renmin University of China"], "conf": "sigmod", "authors": ["Jiaheng Lu.....http://dblp.org/pers/hd/l/Lu:Jiaheng", "Pierre Senellart.....http://dblp.org/pers/hd/s/Senellart:Pierre", "Chunbin Lin.....http://dblp.org/pers/hd/l/Lin:Chunbin", "Xiaoyong Du.....http://dblp.org/pers/hd/d/Du:Xiaoyong", "Shan Wang.....http://dblp.org/pers/hd/w/Wang:Shan", "Xinxing Chen.....http://dblp.org/pers/hd/c/Chen:Xinxing"], "pages": 12}