{"title": "B@bel: Leveraging Email Delivery for Spam Mitigation.", "fields": ["spambot", "spamming", "botnet", "backscatter", "email spoofing"], "abstract": "Traditional spam detection systems either rely on content analysis to detect spam emails, or attempt to detect spammers before they send a message, (i.e., they rely on the origin of the message). In this paper, we introduce a third approach: we present a system for filtering spam that takes into account how messages are sent by spammers. More precisely, we focus on the email delivery mechanism, and analyze the communication at the SMTP protocol level.\n\nWe introduce two complementary techniques as concrete instances of our new approach. First, we leverage the insight that different mail clients (and bots) implement the SMTP protocol in slightly different ways. We automatically learn these SMTP dialects and use them to detect bots during an SMTP transaction. Empirical results demonstrate that this technique is successful in identifying (and rejecting) bots that attempt to send emails. Second, we observe that spammers also take into account server feedback (for example to detect and remove non-existent recipients from email address lists). We can take advantage of this observation by returning fake information, thereby poisoning the server feedback on which the spammers rely. The results of our experiments show that by sending misleading information to a spammer, it is possible to prevent recipients from receiving subsequent spam emails from that same spammer.", "citation": "Citations (20)", "year": "2012", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "Ruhr University Bochum", "Ruhr University Bochum", "University of California, Santa Barbara"], "conf": "uss", "authors": ["Gianluca Stringhini.....http://dblp.org/pers/hd/s/Stringhini:Gianluca", "Manuel Egele.....http://dblp.org/pers/hd/e/Egele:Manuel", "Apostolis Zarras.....http://dblp.org/pers/hd/z/Zarras:Apostolis", "Thorsten Holz.....http://dblp.org/pers/hd/h/Holz:Thorsten", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "pages": 17}