{"title": "Resource allocation in load-constrained multihopwireless networks.", "fields": ["load balancing", "approximation algorithm", "lagrange multiplier", "optimization problem", "subgradient method"], "abstract": "In this paper, we study the influence of network entity load constraints on network resource allocation. We focus on the problem of allocating network resources to optimize the total utility of multiple users in a wireless network, taking into account four resource and social requirements: 1) user QoS rate constraints, 2) node max load constraints, 3) node load balance constraints, and 4) node-user load constraints. We formulate this problem as a programming system. In order to solve this programming system, we first propose an optimization framework, called α-approximation dual subgradient algorithm, which may be applicable for many networking optimization problems. Given an approximation/optimal algorithm for solving the subproblem at each iteration, the framework leads to a result that can provide the following bounds at each iteration: 1) the bounds on the Lagrangian multipliers; 2) the bound on the amount of feasibility violation of the generated primal solutions; and 3) the upper and lower bounds on the gap between the optimal solution and the generated primal solutions. Based on this framework, we then present a distributed iterative algorithm to solve the network resource allocation problem. At each iteration, we provide bounds on the amount of feasibility violation, the gap between our solution and the optimal solution, node queue lengths, user utility deficits, and node load violation ratios.", "citation": "Citations (4)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Xi Fang.....http://dblp.org/pers/hd/f/Fang:Xi", "Dejun Yang.....http://dblp.org/pers/hd/y/Yang:Dejun", "Guoliang Xue.....http://dblp.org/pers/hd/x/Xue:Guoliang"], "conf": "infocom", "year": "2012", "pages": 9}