{"title": "Kitsune: efficient, general-purpose dynamic software updating for C.", "fields": ["dynamic software updating", "downtime", "programmer", "optimizing compiler", "technical report", "semantics"], "abstract": "Dynamic software updating (DSU) systems allow programs to be updated while running, thereby permitting developers to add features and fix bugs without downtime. This paper introduces Kitsune, a new DSU system for C whose design has three notable features. First, Kitsune's updating mechanism updates the whole program, not individual functions. This mechanism is more flexible than most prior approaches and places no restrictions on data representations or allowed compiler optimizations. Second, Kitsune makes the important aspects of updating explicit in the program text, making the program's semantics easy to understand while minimizing programmer effort. Finally, the programmer can write simple specifications to direct Kitsune to generate code that traverses and transforms old-version state for use by new code; such state transformation is often necessary, and is significantly more difficult in prior DSU systems. We have used Kitsune to update five popular, open-source, single- and multi-threaded programs, and find that few program changes are required to use Kitsune, and that it incurs essentially no performance overhead.", "citation": "Citations (78)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Christopher M. Hayden.....http://dblp.org/pers/hd/h/Hayden:Christopher_M=", "Edward K. Smith.....http://dblp.org/pers/hd/s/Smith:Edward_K=", "Michail Denchev.....http://dblp.org/pers/hd/d/Denchev:Michail", "Michael Hicks.....http://dblp.org/pers/hd/h/Hicks_0001:Michael", "Jeffrey S. Foster.....http://dblp.org/pers/hd/f/Foster:Jeffrey_S="], "conf": "oopsla", "year": "2012", "pages": 16}