{"title": "Cloud Terminal: Secure Access to Sensitive Applications from Untrusted Systems.", "fields": ["rendering", "cloud computing", "client", "compromise", "shared resource"], "abstract": "Current PC- and web-based applications provide insufficient security for the information they access, because vulnerabilities anywhere in a large client software stack can compromise confidentiality and integrity. We propose a new architecture for secure applications, Cloud Terminal, in which the only software running on the end host is a lightweight secure thin terminal, and most application logic is in a remote cloud rendering engine. The secure thin terminal has a very small TCB (23 KLOC) and no dependence on the untrusted OS, so it can be easily checked and remotely attested to. The terminal is also general-purpose: it simply supplies a secure display and input path to remote software. The cloud rendering engine runs an off-the-shelf application in a restricted VM hosted by the provider, but resource sharing between VMs lets one server support hundreds of users. We implement a secure thin terminal that runs on standard PC hardware and provides a responsive interface to applications like banking, email, and document editing. We also show that our cloud rendering engine can provide secure online banking for 5-10 cents per user per month.", "citation": "Citations (28)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Carnegie Mellon University", "University of California, Berkeley"], "authors": ["Lorenzo Martignoni.....http://dblp.org/pers/hd/m/Martignoni:Lorenzo", "Pongsin Poosankam.....http://dblp.org/pers/hd/p/Poosankam:Pongsin", "Matei Zaharia.....http://dblp.org/pers/hd/z/Zaharia:Matei", "Jun Han.....http://dblp.org/pers/hd/h/Han_0001:Jun", "Stephen McCamant.....http://dblp.org/pers/hd/m/McCamant:Stephen", "Dawn Song.....http://dblp.org/pers/hd/s/Song:Dawn", "Vern Paxson.....http://dblp.org/pers/hd/p/Paxson:Vern", "Adrian Perrig.....http://dblp.org/pers/hd/p/Perrig:Adrian", "Scott Shenker.....http://dblp.org/pers/hd/s/Shenker:Scott", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "conf": "usenix", "year": "2012", "pages": 18}