{"title": "Towards compact topical descriptors.", "fields": ["gloh", "discriminative model", "image histogram", "biconvex optimization", "ranking"], "abstract": "We introduce a Compact Topical Descriptor to learn a compact yet discriminative image signature from the reference image corpus. This descriptor is deployed over the well used bag-of-words image histogram, with two merits over the traditional topical features: First, we propose to directly control the topical sparsity to achieve the descriptor compactness. Second, we ensure the descriptor discriminability by minimizing the bag-of-words reconstruction errors during the topical histogram encoding. To this end, we have a generative viewpoint of the topical feature extraction, which is estimated as a sparse MAP estimation over the original bag-of-words. We learn such estimation by a bi-convex optimization, iterating between both hierarchical sparse coding from words to topical histograms and dictionary learning of the corresponding word-to-topic transform. Especially, supervised labels such as image ranking list can be also incorporated into our descriptor learning paradigm. We quantize our performance in both Im-ageNet 10K and NUS-WIDE, with comparisons to bag-of-words, LDA, miniBoF, and Aggregated Local Descriptors. In practice, we also implement our descriptor for a low bit rate mobile visual search application, i.e. sending compact descriptors instead of the image to reduce the query delivery latency. Our descriptor has significantly outperformed the state-of-the-art compact descriptors by quantitative evaluations over 10 million reference images.", "citation": "Citations (16)", "year": "2012", "departments": ["Peking University", "Peking University", "Peking University", "Peking University"], "conf": "cvpr", "authors": ["Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Ling-Yu Duan.....http://dblp.org/pers/hd/d/Duan:Ling=Yu", "Jie Chen.....http://dblp.org/pers/hd/c/Chen_0006:Jie", "Wen Gao.....http://dblp.org/pers/hd/g/Gao_0001:Wen"], "pages": 8}