{"title": "Cooperative multicasting in network-coding enabled multi-rate wireless relay networks.", "fields": ["packet forwarding", "relay channel", "local management interface", "markov decision process", "multimedia broadcast multicast service"], "abstract": "Network coding has been broadly applied to improve the efficiency of wireless multicast. In this paper, we consider the multicast process in modern relay-assisted wireless communication systems such as the IEEE 802.16j and the LTE-advanced networks, where the relay stations can cooperatively forward network-coded packets to the subscriber stations using different transmission rates. We show that under such multi-rate environments, previous solutions which seek to minimize the packet forwarding counts may lead to longer multicast delay. To solve this problem, in this work, we aim at finding a minimal delay transmission schedule of the relay stations under multi-rate considerations. We first show that this problem is NP-hard. Then we use a Markov decision process to model the relay station re-transmission process. Via this model, we derive the formulations for optimal re-transmission strategies as well as optimal re-transmission delays. Moreover, based on the recursive structure of the re-transmission delays derived from the model, we propose a dynamic programming algorithm which can solve optimal re-transmission strategies for the system. For complexity considerations, we also propose two light-weight on-line re-transmission heuristics. Simulation results show that the Markov decision process can accurately characterize the relay re-transmission process in network-coding-enabled wireless relay networks, and that minimal multicast delay can be achieved by dynamic programming-based relay re-transmissions. Moreover, simulation results suggest that the two heuristics may be suited to different scenarios, and both can achieve near-optimal performances efficiently.", "citation": "Citations (6)", "departments": ["National Taiwan University", "National Taiwan University"], "authors": ["Hsiao-Chen Lu.....http://dblp.org/pers/hd/l/Lu:Hsiao=Chen", "Wanjiun Liao.....http://dblp.org/pers/hd/l/Liao:Wanjiun"], "conf": "infocom", "year": "2012", "pages": 9}