{"title": "Predicting quality flaws in user-generated content: the case of wikipedia.", "fields": ["multiclass classification", "one class classification", "test data", "information quality", "user generated content"], "abstract": "The detection and improvement of low-quality information is a key concern in Web applications that are based on user-generated content; a popular example is the online encyclopedia Wikipedia. Existing research on quality assessment of user-generated content deals with the classification as to whether the content is high-quality or low-quality. This paper goes one step further: it targets the prediction of quality flaws, this way providing specific indications in which respects low-quality content needs improvement. The prediction is based on user-defined cleanup tags, which are commonly used in many Web applications to tag content that has some shortcomings. We apply this approach to the English Wikipedia, which is the largest and most popular user-generated knowledge source on the Web. We present an automatic mining approach to identify the existing cleanup tags, which provides us with a training corpus of labeled Wikipedia articles. We argue that common binary or multiclass classification approaches are ineffective for the prediction of quality flaws and hence cast quality flaw prediction as a one-class classification problem. We develop a quality flaw model and employ a dedicated machine learning approach to predict Wikipedia's most important quality flaws. Since in the Wikipedia setting the acquisition of significant test data is intricate, we analyze the effects of a biased sample selection. In this regard we illustrate the classifier effectiveness as a function of the flaw distribution in order to cope with the unknown (real-world) flaw-specific class imbalances. The flaw prediction performance is evaluated with 10,000 Wikipedia articles that have been tagged with the ten most frequent quality flaws: provided test data with little noise, four flaws can be detected with a precision close to 1.", "citation": "Citations (70)", "departments": ["Bauhaus University, Weimar", "Bauhaus University, Weimar", "Bauhaus University, Weimar"], "authors": ["Maik Anderka.....http://dblp.org/pers/hd/a/Anderka:Maik", "Benno Stein.....http://dblp.org/pers/hd/s/Stein:Benno", "Nedim Lipka.....http://dblp.org/pers/hd/l/Lipka:Nedim"], "conf": "sigir", "year": "2012", "pages": 10}