{"title": "The sharing at roadside: Vehicular content distribution using parked vehicles.", "fields": ["vehicular ad hoc network", "linear network coding", "exploit", "file transfer", "upload"], "abstract": "In Vehicular Ad Hoc Networks (VANETs), content distribution directly relies on the fleeting and dynamic contacts between moving vehicles, which often leads to prolonged downloading delay and terrible user experience. Deploying Wifi-based Access Points (APs) could relieve this problem, but it often requires a large amount of investment, especially at the city scale. In this paper, we propose the idea of ParkCast, which doesn't need investment, but leverages roadside parking to distribute contents in urban VANETs. With wireless device and rechargable battery, parked vehicles can communicate with any vehicles driving through them. Owing to the extensive parking in cities, available resources and contact opportunities for sharing are largely increased. To each road, parked vehicles at roadside are grouped into a line cluster as far as possible, which is locally coordinated for node selection and data transmission. Such a collaborative design paradigm exploits the sequential contacts between moving vehicles and parked ones, implements sequential file transfer, reduces unnecessary messages and collisions, and then expedites content distribution greatly. We investigate ParkCast through theoretic analysis and realistic survey and simulation. The results prove that our scheme achieve high performance in distribution of contents with different sizes, especially in sparse traffic conditions.", "citation": "Citations (61)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "Shanghai Jiao Tong University", "Hong Kong Polytechnic University"], "authors": ["Nianbo Liu.....http://dblp.org/pers/hd/l/Liu:Nianbo", "Ming Liu.....http://dblp.org/pers/hd/l/Liu_0002:Ming", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai", "Jiannong Cao.....http://dblp.org/pers/hd/c/Cao:Jiannong"], "conf": "infocom", "year": "2012", "pages": 5}