{"title": "GENESIS: An agent-based model of interdomain network formation, traffic flow and economics.", "fields": ["policy based routing", "network formation", "peering", "agent based model", "global network"], "abstract": "We propose an agent-based network formation model for the Internet at the Autonomous System (AS) level. The proposed model, called GENESIS, is based on realistic provider and peering strategies, with ASes acting in a myopic and decentralized manner to optimize a cost-related fitness function. GENESIS captures key factors that affect the network formation dynamics: highly skewed traffic matrix, policy-based routing, geographic co-location constraints, and the costs of transit/peering agreements. As opposed to analytical game-theoretic models, which focus on proving the existence of equilibria, GENESIS is a computational model that simulates the network formation process and allows us to actually compute distinct equilibria (i.e., networks) and to also examine the behavior of sample paths that do not converge. We find that such oscillatory sample paths occur in about 10% of the runs, and they always involve tier- 1 ASes, resembling the tier-1 peering disputes often seen in practice. GENESIS results in many distinct equilibria that are highly sensitive to initial conditions and the order in which ASes (agents) act. This implies that we cannot predict the properties of an individual AS in the Internet. However, certain properties of the global network or of certain classes of ASes are predictable. We also examine whether the underlying game is zero-sum, and identify three sufficient conditions for that property. Finally, we apply GENESIS in a specific “what-if” question, asking how the openness towards peering affects the resulting network in terms of topology, traffic flow and economics. Interestingly, we find that the peering openness that maximizes the fitness of different network classes (tier-1, tier-2 and tier-3 providers) closely matches that seen in real-world peering policies.", "citation": "Citations (53)", "departments": ["Georgia Institute of Technology", "University of California, San Diego", "Georgia Institute of Technology"], "authors": ["Aemen Lodhi.....http://dblp.org/pers/hd/l/Lodhi:Aemen", "Amogh Dhamdhere.....http://dblp.org/pers/hd/d/Dhamdhere:Amogh", "Constantine Dovrolis.....http://dblp.org/pers/hd/d/Dovrolis:Constantine"], "conf": "infocom", "year": "2012", "pages": 9}