{"title": "Refactoring android Java code for on-demand computation offloading.", "fields": ["legacy system", "network delay", "computation offloading", "bytecode", "code refactoring"], "abstract": "Computation offloading is a promising way to improve the performance as well as reducing the battery power consumption of a smartphone application by executing some parts of the application on a remote server. Supporting such capability is not easy for smartphone application developers due to (1) correctness: some code, e.g., that for GPS, gravity, and other sensors, can run only on the smartphone so that developers have to identify which parts of the application cannot be offloaded; (2) effectiveness: the reduced execution time must be greater than the network delay caused by computation offloading so that developers need to calculate which parts are worth offloading; (3) adaptability: smartphone applications often face changes of user requirements and runtime environments so that developers need to implement the adaptation on offloading. More importantly, considering the large number of today's smartphone applications, solutions applicable for legacy applications will be much more valuable. In this paper, we present a tool, named DPartner, that automatically refactors Android applications to be the ones with computation offloading capability. For a given Android application, DPartner first analyzes its bytecode for discovering the parts worth offloading, then rewrites the bytecode to implement a special program structure supporting on-demand offloading, and finally generates two artifacts to be deployed onto an Android phone and the server, respectively. We evaluated DPartner on three real-world Android applications, demonstrating the reduction of execution time by 46%-97% and battery power consumption by 27%-83%.", "citation": "Citations (100)", "departments": ["Peking University", "Peking University", "Peking University", "Peking University", "Peking University"], "authors": ["Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0012:Ying", "Gang Huang.....http://dblp.org/pers/hd/h/Huang_0001:Gang", "Xuanzhe Liu.....http://dblp.org/pers/hd/l/Liu:Xuanzhe", "Wei Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Wei", "Hong Mei.....http://dblp.org/pers/hd/m/Mei:Hong", "Shunxiang Yang.....http://dblp.org/pers/hd/y/Yang:Shunxiang"], "conf": "oopsla", "year": "2012", "pages": 16}