{"title": "Predicting Approximate Protein-DNA Binding Cores Using Association Rule Mining.", "fields": ["position weight matrix", "dna binding site", "association rule learning", "dna", "transcription factor"], "abstract": "The studies of protein-DNA bindings between transcription factors (TFs) and transcription factor binding sites (TFBSs) are important bioinformatics topics. High-resolution (length 490) are shown promising in identifying accurate binding cores without using any 3D structures. While the current association rule mining method on this problem addresses exact sequences only, the most recent ad hoc method for approximation does not establish any formal model and is limited by experimentally known patterns. As biological mutations are common, it is desirable to formally extend the exact model into an approximate one. In this paper, we formalize the problem of mining approximate protein-DNA association rules from sequence data and propose a novel efficient algorithm to predict protein-DNA binding cores. Our two-phase algorithm first constructs two compact intermediate structures called frequent sequence tree (FS-Tree) and frequent sequence class tree (FSCTree). Approximate association rules are efficiently generated from the structures and bioinformatics concepts (position weight matrix and information content) are further employed to prune meaningless rules. Experimental results on real data show the performance and applicability of the proposed algorithm.", "citation": "Citations (10)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Po-Yuen Wong.....http://dblp.org/pers/hd/w/Wong:Po=Yuen", "Tak-Ming Chan.....http://dblp.org/pers/hd/c/Chan:Tak=Ming", "Man Hon Wong.....http://dblp.org/pers/hd/w/Wong_0001:Man_Hon", "Kwong-Sak Leung.....http://dblp.org/pers/hd/l/Leung:Kwong=Sak"], "conf": "icde", "year": "2012", "pages": 12}