{"title": "Secret communication in large wireless networks without eavesdropper location information.", "fields": ["network packet", "scaling", "artificial noise", "throughput", "binary logarithm"], "abstract": "We present achievable scaling results on the per-node secure throughput that can be realized in a large random wireless network of n legitimate nodes in the presence of m eavesdroppers of unknown location. We consider both one-dimensional and two-dimensional networks. In the one-dimensional case, we show that a per-node secure throughput of order 1/n is achievable if the number of eavesdroppers satisfies m = o(n/log n). We obtain similar results for the two-dimensional case, where a secure throughput of order 1/√n log n is achievable under the same condition. The number of eavesdroppers that can be tolerated is significantly higher than previous works that address the case of unknown eavesdropper locations. The key technique introduced in our construction to handle unknown eavesdropper locations forces adversaries to intercept a number of packets to be able to decode a single message. The whole network is divided into regions, where a certain subset of packets is protected from adversaries located in each region. In the one-dimensional case, our construction makes use of artificial noise generation by legitimate nodes to degrade the signal quality at the potential locations of eavesdroppers. In the two-dimensional case, the availability of many paths to reach a destination is utilized to handle collaborating eavesdroppers of unknown location.", "citation": "Citations (55)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Lowell", "University of Massachusetts Amherst"], "authors": ["Cagatay Capar.....http://dblp.org/pers/hd/c/Capar:Cagatay", "Dennis Goeckel.....http://dblp.org/pers/hd/g/Goeckel:Dennis", "Benyuan Liu.....http://dblp.org/pers/hd/l/Liu:Benyuan", "Don Towsley.....http://dblp.org/pers/hd/t/Towsley:Don"], "conf": "infocom", "year": "2012", "pages": 9}