{"title": "Propagation-based social-aware replication for social video contents.", "fields": ["download", "social influence", "cache", "locality of reference", "server"], "abstract": "Online social network has reshaped the way how video contents are generated, distributed and consumed on today's Internet. Given the massive number of videos generated and shared in online social networks, it has been popular for users to directly access video contents in their preferred social network services. It is intriguing to study the service provision of social video contents for global users with satisfactory quality-of-experience. In this paper, we conduct large-scale measurement of a real-world online social network system to study the propagation of the social video contents. We have summarized important characteristics from the video propagation patterns, including social locality, geographical locality and temporal locality. Motivated by the measurement insights, we propose a propagation-based social-aware replication framework using a hybrid edge-cloud and peer-assisted architecture, namely PSAR, to serve the social video contents. Our replication strategies in PSAR are based on the design of three propagation-based replication indices, including a geographic influence index and a content propagation index to guide how the edge-cloud servers backup the videos, and a social influence index to guide how peers cache the videos for their friends. By incorporating these replication indices into our system design, PSAR has significantly improved the replication performance and the video service quality. Our trace-driven experiments further demonstrate the effectiveness and superiority of PSAR, which improves the local download ratio in the edge-cloud replication by 30%, and the local cache hit ratio in the peer-assisted replication by 40%, against traditional approaches.", "citation": "Citations (101)", "departments": ["Tsinghua University", "Tsinghua University", "The Chinese University of Hong Kong", "Tsinghua University", "Simon Fraser University"], "authors": ["Zhi Wang.....http://dblp.org/pers/hd/w/Wang_0001:Zhi", "Lifeng Sun.....http://dblp.org/pers/hd/s/Sun:Lifeng", "Xiangwen Chen.....http://dblp.org/pers/hd/c/Chen:Xiangwen", "Wenwu Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Wenwu", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Shiqiang Yang.....http://dblp.org/pers/hd/y/Yang:Shiqiang"], "conf": "mm", "year": "2012", "pages": 10}