{"title": "Dynamic searchable symmetric encryption.", "fields": ["filesystem level encryption", "56 bit encryption", "40 bit encryption", "encryption", "symmetric key algorithm", "client side encryption", "computer science", "inverted index", "software deployment", "link encryption", "cloud storage", "theoretical computer science"], "abstract": "Searchable symmetric encryption (SSE) allows a client to encrypt its data in such a way that this data can still be searched. The most immediate application of SSE is to cloud storage, where it enables a client to securely outsource its data to an untrusted cloud provider without sacrificing the ability to search over it.   SSE has been the focus of active research and a multitude of schemes that achieve various levels of security and efficiency have been proposed. Any practical SSE scheme, however, should (at a minimum) satisfy the following properties: sublinear search time, security against adaptive chosen-keyword attacks, compact indexes and the ability to add and delete files efficiently. Unfortunately, none of the previously-known SSE constructions achieve all these properties at the same time. This severely limits the practical value of SSE and decreases its chance of deployment in real-world cloud storage systems.   To address this, we propose the first SSE scheme to satisfy all the properties outlined above. Our construction extends the inverted index approach (Curtmola et al., CCS 2006) in several non-trivial ways and introduces new techniques for the design of SSE. In addition, we implement our scheme and conduct a performance evaluation, showing that our approach is highly efficient and ready for deployment.", "citation": "Not cited", "year": "2012", "departments": ["Microsoft", "University of California, Berkeley", "Microsoft"], "conf": "ccs", "authors": ["Seny Kamara.....http://dblp.org/pers/hd/k/Kamara:Seny", "Charalampos Papamanthou.....http://dblp.org/pers/hd/p/Papamanthou:Charalampos", "Tom Roeder.....http://dblp.org/pers/hd/r/Roeder:Tom"], "pages": 12}