{"title": "Transfer Learning with Graph Co-Regularization.", "fields": ["negative transfer", "empirical likelihood", "transfer of learning", "inductive transfer", "optimization problem", "knowledge acquisition", "knowledge transfer", "semi supervised learning", "non negative matrix factorization"], "abstract": "Transfer learning is established as an effective technology to leverage rich labeled data from some source domain to build an accurate classifier for the target domain. The basic assumption is that the input domains may share certain knowledge structure, which can be encoded into common latent factors and extracted by preserving important property of original data, e.g., statistical property and geometric structure. In this paper, we show that different properties of input data can be complementary to each other and exploring them simultaneously can make the learning model robust to the domain difference. We propose a general framework, referred to as Graph Co-Regularized Transfer Learning (GTL), where various matrix factorization models can be incorporated. Specifically, GTL aims to extract common latent factors for knowledge transfer by preserving the statistical property across domains, and simultaneously, refine the latent factors to alleviate negative transfer by preserving the geometric structure in each domain. Based on the framework, we propose two novel methods using NMF and NMTF, respectively. Extensive experiments verify that GTL can significantly outperform state-of-the-art learning methods on several public text/image datasets.", "citation": "Citations (102)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Baidu", "Huawei", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Hong Kong University of Science and Technology", "CityGrid Media, Seattle, WA"], "authors": ["Mingsheng Long.....http://dblp.org/pers/hd/l/Long:Mingsheng", "Jianmin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianmin", "Guiguang Ding.....http://dblp.org/pers/hd/d/Ding:Guiguang", "Dou Shen.....http://dblp.org/pers/hd/s/Shen:Dou", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "aaai", "year": "2012", "pages": -1}