{"title": "Collaborative hierarchical caching with dynamic request routing for massive content distribution.", "fields": [], "abstract": "Massive content delivery in metropolitan networks has recently gained much attention with the successful deployment of commercial systems and an increasing user popularity. With an enormous volume of content available in the network, as well as the growing size of content owing to the popularity of high-definition video, the exploration of capacity in the caching network becomes a critical issue in providing guaranteed service. Yet, collaboration strategies among cache servers in emerging scenarios, such as IPTV services, are still not well understood so far. In this paper, we propose an efficient collaborative caching mechanism based on the topology derived from a real-world IPTV system, with a particular focus on exploring the capacity of the existing system infrastructure. We observe that collaboration among servers is largely affected by the topology characteristics and heterogeneous capacities of the network. Meanwhile, dynamic request routing within the caching network is strongly coupled with content placement decisions when designing the mechanism. Our proposed mechanism is implemented in a distributed manner, and is amenable to practical deployment. Our simulation results demonstrate the effectiveness of our proposed mechanism, as compared to conventional cache cooperation with static routing schemes.", "citation": "Citations (123)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Simon Fraser University", "University of Toronto"], "authors": ["Jie Dai.....http://dblp.org/pers/hd/d/Dai:Jie", "Zhan Hu.....http://dblp.org/pers/hd/h/Hu:Zhan", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun"], "conf": "infocom", "year": "2012", "pages": 9}