{"title": "Understanding screen contents for building a high performance, real time screen sharing system.", "fields": ["simulation", "bottleneck", "lossless compression", "central processing unit", "pixel"], "abstract": "Faithful sharing of screen contents is an important collaboration feature. Prior systems were designed to operate over constrained networks. They performed poorly even without such bottlenecks. To build a high performance screen sharing system, we empirically analyzed screen contents for a variety of scenarios. We showed that screen updates were sporadic with long periods of inactivity. When active, screens were updated at far higher rates than was supported by earlier systems. The mismatch was pronounced for interactive scenarios. Even during active screen updates, the number of updated pixels were frequently small. We showed that crucial information can be lost if individual updates were merged. When the available system resources could not support high capture rates, we showed ways in which updates can be  effectively  collapsed. We showed that Zlib lossless compression performed poorly for screen updates. By analyzing the screen pixels, we developed a practical transformation that significantly improved compression rates. Our system captured 240 updates per second while only using 4.6 Mbps for interactive scenarios. Still, while playing movies in fullscreen mode, our approach could not achieve higher capture rates than prior systems; the CPU remains the bottleneck. A system that incorporates our findings is deployed within the lab.", "citation": "Citations (6)", "departments": ["FX Palo Alto Laboratory", "FX Palo Alto Laboratory", "FX Palo Alto Laboratory", "FX Palo Alto Laboratory", "FX Palo Alto Laboratory"], "authors": ["Surendar Chandra.....http://dblp.org/pers/hd/c/Chandra:Surendar", "Jacob T. Biehl.....http://dblp.org/pers/hd/b/Biehl:Jacob_T=", "John S. Boreczky.....http://dblp.org/pers/hd/b/Boreczky:John_S=", "Scott Carter.....http://dblp.org/pers/hd/c/Carter:Scott", "Lawrence A. Rowe.....http://dblp.org/pers/hd/r/Rowe:Lawrence_A="], "conf": "mm", "year": "2012", "pages": 10}