{"title": "Negotiation in Exploration-Based Environment.", "fields": ["negotiation", "distributed computing", "expected utility hypothesis", "computational complexity theory", "rational agent"], "abstract": "This paper studies repetitive negotiation over the execution of an exploration process between two self-interested, fully rational agents in a full information environment with side payments. A key aspect of the protocol is that the exploration's execution may interleave with the negotiation itself, inflicting some degradation on the exploration's flexibility. The advantage of this form of negotiation is in enabling the agents supervising that the exploration's execution takes place in its agreed form as negotiated. We show that in many cases, much of the computational complexity of the new protocol can be eliminated by solving an alternative negotiation scheme according to which the parties first negotiate the exploration terms as a whole and then execute it. As demonstrated in the paper, the solution characteristics of the new protocol are somehow different from those of legacy negotiation protocols where the execution of the agreement reached through the negotiation is completely separated from the negotiation process. Furthermore, if the agents are given the option to control some of the negotiation protocol parameters, the resulting exploration may be suboptimal. In particular we show that the increase in an agent's expected utility in such cases is unbounded and so is the resulting decrease in the social welfare. Surprisingly, we show that further increasing one of the agents' level of control in some of the negotiation parameters enables bounding the resulting decrease in the social welfare.", "citation": "Citations (6)", "departments": ["Bar-Ilan University", "Bar-Ilan University", "Bar-Ilan University"], "authors": ["Israel Sofer.....http://dblp.org/pers/hd/s/Sofer:Israel", "David Sarne.....http://dblp.org/pers/hd/s/Sarne:David", "Avinatan Hassidim.....http://dblp.org/pers/hd/h/Hassidim:Avinatan"], "conf": "aaai", "year": "2012", "pages": -1}