{"title": "Load Balancing in MapReduce Based on Scalable Cardinality Estimates.", "fields": ["data set", "load management", "cost estimate", "scalability", "distributed database"], "abstract": "MapReduce has emerged as a popular tool for distributed and scalable processing of massive data sets and is being used increasingly in e-science applications. Unfortunately, the performance of MapReduce systems strongly depends on an even data distribution while scientific data sets are often highly skewed. The resulting load imbalance, which raises the processing time, is even amplified by high runtime complexity of the reducer tasks. An adaptive load balancing strategy is required for appropriate skew handling. In this paper, we address the problem of estimating the cost of the tasks that are distributed to the reducers based on a given cost model. An accurate cost estimation is the basis for adaptive load balancing algorithms and requires to gather statistics from the mappers. This is challenging: (a) Since the statistics from all mappers must be integrated, the mapper statistics must be small. (b) Although each mapper sees only a small fraction of the data, the integrated statistics must capture the global data distribution. (c) The mappers terminate after sending the statistics to the controller, and no second round is possible. Our solution to these challenges consists of two components. First, a monitoring component executed on every mapper captures the local data distribution and identifies its most relevant subset for cost estimation. Second, an integration component aggregates these subsets approximating the global data distribution.", "citation": "Citations (117)", "departments": ["Free University of Bozen-Bolzano", "Tech. Univ. Mun ... unchen, Germany", "Tech. Univ. Mun ... unchen, Germany", "Tech. Univ. Mun ... unchen, Germany"], "authors": ["Benjamin Gufler.....http://dblp.org/pers/hd/g/Gufler:Benjamin", "Nikolaus Augsten.....http://dblp.org/pers/hd/a/Augsten:Nikolaus", "Angelika Reiser.....http://dblp.org/pers/hd/r/Reiser:Angelika", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons"], "conf": "icde", "year": "2012", "pages": 12}