{"title": "Cost-minimizing dynamic migration of content distribution services into hybrid clouds.", "fields": ["cloud computing", "scalability", "server", "data center", "lyapunov optimization", "cloud testing", "cloud storage"], "abstract": "The recent advent of cloud computing technologies has enabled agile and scalable resource access for a variety of applications. Content distribution services are a major category of popular Internet applications. A growing number of content providers are contemplating a switch to cloud-based services, for better scalability and lower cost. Two key tasks are involved for such a move: to migrate their contents to cloud storage, and to distribute their web service load to cloud-based web services. The main challenge is to make the best use of the cloud as well as their existing on-premise server infrastructure, to serve volatile content requests with service response time guarantee at all times, while incurring the minimum operational cost. Employing Lyapunov optimization techniques, we present an optimization framework for dynamic, cost-minimizing migration of content distribution services into a hybrid cloud infrastructure that spans geographically distributed data centers. A dynamic control algorithm is designed, which optimally places contents and dispatches requests in different data centers to minimize overall operational cost over time, subject to service response time constraints. Rigorous analysis shows that the algorithm nicely bounds the response times within the preset QoS target in cases of arbitrary request arrival patterns, and guarantees that the overall cost is within a small constant gap from the optimum achieved by a T-slot lookahead mechanism with known information into the future.", "citation": "Citations (63)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Calgary", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Calgary", "University of Hong Kong"], "authors": ["Xuanjia Qiu.....http://dblp.org/pers/hd/q/Qiu:Xuanjia", "Hongxing Li.....http://dblp.org/pers/hd/l/Li:Hongxing", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2012", "pages": 5}