{"title": "An analytical approach towards cooperative relay scheduling under partial state information.", "fields": ["partially observable markov decision process", "two level scheduling", "round robin scheduling", "fair share scheduling", "dynamic priority scheduling"], "abstract": "Energy harvesting and cooperative communication are promising solutions to overcome the power limitations of Wireless Sensor Networks (WSNs) comprising of battery-powered nodes. In order to maximize the efficiency of such systems, measured in terms of packet delivery ratio achieved over time, efficient scheduling algorithms need to be designed. In particular, relay usage scheduling is critical for addressing the trade-off between energy consumption and efficiency in the network. However, the stochastic nature of the recharge and traffic generation processes at the sensor nodes, along with partial state information availability about neighboring nodes, makes the transmission and relay scheduling problem quite challenging. To address this problem, we model the system using a stochastic framework, and formulate the scheduling problem at source sensor node, when only partial state information about the relay is available at the source, as a Partially Observable Markov Decision Process (POMDP). We characterize an approximate solution to the optimality equations, which provides us with useful insights into the system dynamics. We observe that the structure of optimal policy is quite sensitive to system parameters, which makes it unsuitable for practical deployment. Therefore, we design a simple and practical threshold based relay scheduling policy, and show using simulations that it achieves close to optimal performance.", "citation": "Citations (4)", "departments": ["Rensselaer Polytechnic Institute", "Wichita State University", "Rensselaer Polytechnic Institute"], "authors": ["Huijiang Li.....http://dblp.org/pers/hd/l/Li:Huijiang", "Neeraj Jaggi.....http://dblp.org/pers/hd/j/Jaggi:Neeraj", "Biplab Sikdar.....http://dblp.org/pers/hd/s/Sikdar:Biplab"], "conf": "infocom", "year": "2012", "pages": 5}