{"title": "Self-service cloud computing.", "fields": ["administrative domain", "virtualization", "personalization", "information technology operations", "anomaly detection", "computer network", "outsourcing", "metamodeling", "provisioning", "compromise", "computer science", "graphical user interface", "washer", "software deployment", "systems engineering", "abstraction", "business", "computer security", "self service", "end user", "payment", "hypervisor", "cloud computing", "cloud computing security", "terminology"], "abstract": "Modern cloud computing infrastructures use virtual machine monitors (VMMs) that often include a large and complex administrative domain with privileges to inspect client VM state. Attacks against or misuse of the administrative domain can compromise client security and privacy. Moreover, these VMMs provide clients inflexible control over their own VMs, as a result of which clients have to rely on the cloud provider to deploy useful services, such as VM introspection-based security tools.   We introduce a new self-service cloud (SSC) computing model that addresses these two shortcomings. SSC splits administrative privileges between a system-wide domain and per-client administrative domains. Each client can manage and perform privileged system tasks on its own VMs, thereby providing flexibility. The system-wide administrative domain cannot inspect the code, data or computation of client VMs, thereby ensuring security and privacy. SSC also allows providers and clients to establish mutually trusted services that can check regulatory compliance while respecting client privacy. We have implemented SSC by modifying the Xen hypervisor. We demonstrate its utility by building user domains to perform privileged tasks such as memory introspection, storage intrusion detection, and anomaly detection.", "citation": "Citations (132)", "year": "2012", "departments": ["Rutgers University", "AT&T Labs", "Rutgers University", "University of Stuttgart", "University of Stuttgart", "University of Stuttgart", "IBM", "IBM", "IBM", "IBM", "IBM", "GridCentric Inc ... nto, ON, Canada", "MARTINEZ FRANK  ...     PULIER ERIC", "MARTINEZ FRANK  ...     PULIER ERIC", "Lübeck Universi ... Lübeck, Germany", "Lübeck Universi ... Lübeck, Germany"], "conf": "ccs", "authors": ["Shakeel Butt.....http://dblp.org/pers/hd/b/Butt:Shakeel", "H. Andrés Lagar-Cavilla.....http://dblp.org/pers/hd/l/Lagar=Cavilla:H=_Andr=eacute=s", "Abhinav Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Abhinav", "Vinod Ganapathy.....http://dblp.org/pers/hd/g/Ganapathy:Vinod"], "pages": 12}