{"title": "Self-certification: bootstrapping certified typecheckers in F* with Coq.", "fields": ["mathematical proof", "metatheory", "cayenne", "agda", "certificate"], "abstract": "Well-established dependently-typed languages like Agda and Coq provide reliable ways to build and check formal proofs. Several other dependently-typed languages such as Aura, ATS, Cayenne, Epigram, F*, F7, Fine, Guru, PCML5, and Ur also explore reliable ways to develop and verify programs. All these languages shine in their own regard, but their implementations do not themselves enjoy the degree of safety provided by machine-checked verification. We propose a general technique called self-certification that allows a typechecker for a suitably expressive language to be certified for correctness. We have implemented this technique for F*, a dependently typed language on the .NET platform. Self-certification involves implementing a typechecker for F* in F*, while using all the conveniences F* provides for the compiler-writer (e.g., partiality, effects, implicit conversions, proof automation, libraries). This typechecker is given a specification (in~F*) strong enough to ensure that it computes valid typing derivations. We obtain a typing derivation for the core typechecker by running it on itself, and we export it to Coq as a type-derivation certificate. By typechecking this derivation (in Coq) and applying the F* metatheory (also mechanized in Coq), we conclude that our type checker is correct. Once certified in this manner, the F* typechecker is emancipated from Coq.   Self-certification leads to an efficient certification scheme---we no longer depend on verifying certificates in Coq---as well as a more broadly applicable one. For instance, the self-certified F* checker is suitable for use in adversarial settings where Coq is not intended for use, such as run-time certification of mobile code.", "citation": "Citations (16)", "departments": ["French Institute for Research in Computer Science and Automation", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Pierre-Yves Strub.....http://dblp.org/pers/hd/s/Strub:Pierre=Yves", "Nikhil Swamy.....http://dblp.org/pers/hd/s/Swamy:Nikhil", "Cédric Fournet.....http://dblp.org/pers/hd/f/Fournet:C=eacute=dric", "Juan Chen.....http://dblp.org/pers/hd/c/Chen:Juan"], "conf": "popl", "year": "2012", "pages": 14}