{"title": "Private and verifiable interdomain routing decisions.", "fields": ["enhanced interior gateway routing protocol", "zone routing protocol", "hazy sighted link state routing protocol", "equal cost multi path routing", "policy based routing", "path vector protocol"], "abstract": "Existing secure interdomain routing protocols can verify validity properties about individual routes, such as whether they correspond to a real network path. It is often useful to verify more complex properties relating to the route decision procedure - for example, whether the chosen route was the best one available, or whether it was consistent with the network's peering agreements. However, this is difficult to do without knowing a network's routing policy and full routing state, which are not normally disclosed. In this paper, we show how a network can allow its peers to verify a number of nontrivial properties of its interdomain routing decisions without revealing any additional information. If all the properties hold, the peers learn nothing beyond what the interdomain routing protocol already reveals; if a property does not hold, at least one peer can detect this and prove the violation. We present SPIDeR, a practical system that applies this approach to the Border Gateway Protocol, and we report results from an experimental evaluation to demonstrate that SPIDeR has a reasonable overhead.", "citation": "Citations (25)", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "Georgetown University", "University of Pennsylvania", "Georgetown University", "University of Pennsylvania", "University of Pennsylvania", "Georgetown University"], "authors": ["Mingchen Zhao.....http://dblp.org/pers/hd/z/Zhao:Mingchen", "Wenchao Zhou.....http://dblp.org/pers/hd/z/Zhou:Wenchao", "Alexander J. T. Gurney.....http://dblp.org/pers/hd/g/Gurney:Alexander_J=_T=", "Andreas Haeberlen.....http://dblp.org/pers/hd/h/Haeberlen:Andreas", "Micah Sherr.....http://dblp.org/pers/hd/s/Sherr:Micah", "Boon Thau Loo.....http://dblp.org/pers/hd/l/Loo:Boon_Thau"], "conf": "sigcomm", "year": "2012", "pages": 12}