{"title": "FairCloud: sharing the network in cloud computing.", "fields": ["virtual machine", "network management", "proportionality", "testbed", "granularity", "payment", "shared resource", "middlebox"], "abstract": "The network, similar to CPU and memory, is a critical and shared resource in the cloud. However, unlike other resources, it is neither shared proportionally to payment, nor do cloud providers offer minimum guarantees on network bandwidth. The reason networks are more difficult to share is because the network allocation of a virtual machine (VM)  X  depends not only on the VMs running on the same machine with  X , but also on the other VMs that  X  communicates with and the cross-traffic on each link used by  X . In this paper, we start from the above requirements--payment proportionality and minimum guarantees--and show that the network-specific challenges lead to fundamental tradeoffs when sharing cloud networks. We then propose a set of properties to explicitly express these tradeoffs. Finally, we present three allocation policies that allow us to navigate the tradeoff space. We evaluate their characteristics through simulation and testbed experiments to show that they can provide minimum guarantees and achieve better proportionality than existing solutions.", "citation": "Citations (399)", "departments": ["Hewlett-Packard", "University of California, Berkeley", "University of California, Berkeley", "University of Washington", "University of California, Berkeley", "Hewlett-Packard", "University of Washington", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["Lucian Popa.....http://dblp.org/pers/hd/p/Popa_0002:Lucian", "Gautam Kumar.....http://dblp.org/pers/hd/k/Kumar:Gautam", "Mosharaf Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Mosharaf", "Arvind Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Arvind", "Sylvia Ratnasamy.....http://dblp.org/pers/hd/r/Ratnasamy:Sylvia", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "conf": "sigcomm", "year": "2012", "pages": 12}