{"title": "Density-Difference Estimation.", "fields": ["kernel", "statistics", "kullback leibler divergence", "multivariate kernel density estimation", "variable kernel density estimation", "estimator", "kernel density estimation", "nonparametric statistics", "rate of convergence", "mathematical optimization"], "abstract": "We address the problem of estimating the difference between two probability densities. A naive approach is a two-step procedure of first estimating two densities separately and then computing their difference. However, this procedure does not necessarily work well because the first step is performed without regard to the second step, and thus a small estimation error incurred in the first stage can cause a big error in the second stage. In this letter, we propose a single-shot procedure for directly estimating the density difference without separately estimating two densities. We derive a nonparametric finite-sample error bound for the proposed single-shot density-difference estimator and show that it achieves the optimal convergence rate. We then show how the proposed density-difference estimator can be used in L2-distance approximation. Finally, we experimentally demonstrate the usefulness of the proposed method in robust distribution comparison such as class-prior estimation and change-point detection.", "citation": "Citations (34)", "departments": ["Tokyo Institute of Technology", "Nagoya University", "University of Tokyo", "Tokyo Institute of Technology", "Tokyo Institute of Technology"], "authors": ["Masashi Sugiyama.....http://dblp.org/pers/hd/s/Sugiyama:Masashi", "Takafumi Kanamori.....http://dblp.org/pers/hd/k/Kanamori:Takafumi", "Taiji Suzuki.....http://dblp.org/pers/hd/s/Suzuki:Taiji", "Marthinus Christoffel du Plessis.....http://dblp.org/pers/hd/p/Plessis:Marthinus_Christoffel_du", "Song Liu.....http://dblp.org/pers/hd/l/Liu_0002:Song", "Ichiro Takeuchi.....http://dblp.org/pers/hd/t/Takeuchi:Ichiro"], "conf": "nips", "year": "2012", "pages": 9}