{"title": "On Discovery of Traveling Companions from Streaming Trajectories.", "fields": ["data stream", "overhead", "scalability", "video tracking", "spatial database"], "abstract": "The advance of object tracking technologies leads to huge volumes of spatio-temporal data collected in the form of trajectory data stream. In this study, we investigate the problem of discovering object groups that travel together (i.e., traveling companions) from trajectory stream. Such technique has broad applications in the areas of scientific study, transportation management and military surveillance. To discover traveling companions, the monitoring system should cluster the objects of each snapshot and intersect the clustering results to retrieve moving-together objects. Since both clustering and intersection steps involve high computational overhead, the key issue of companion discovery is to improve the algorithm's efficiency. We propose the models of closed companion candidates and smart intersection to accelerate data processing. A new data structure termed traveling buddy is designed to facilitate scalable and flexible companion discovery on trajectory stream. The traveling buddies are micro-groups of objects that are tightly bound together. By only storing the object relationships rather than their spatial coordinates, the buddies can be dynamically maintained along trajectory stream with low cost. Based on traveling buddies, the system can discover companions without accessing the object details. The proposed methods are evaluated with extensive experiments on both real and synthetic datasets. The buddy-based method is an order of magnitude faster than existing methods. It also outperforms other competitors with higher precision and recall in companion discovery.", "citation": "Citations (115)", "departments": ["University of Illinois at Urbana–Champaign", "Microsoft", "Microsoft", "University of Science and Technology of China", "Microsoft", "University of Illinois at Urbana–Champaign", "BBN Technologies"], "authors": ["Lu An Tang.....http://dblp.org/pers/hd/t/Tang:Lu_An", "Yu Zheng.....http://dblp.org/pers/hd/z/Zheng_0004:Yu", "Jing Yuan.....http://dblp.org/pers/hd/y/Yuan:Jing", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Alice Leung.....http://dblp.org/pers/hd/l/Leung:Alice", "Chih-Chieh Hung.....http://dblp.org/pers/hd/h/Hung:Chih=Chieh", "Wen-Chih Peng.....http://dblp.org/pers/hd/p/Peng:Wen=Chih"], "conf": "icde", "year": "2012", "pages": 12}