{"title": "Collusion-Preserving Computation.", "fields": ["bounded function", "mechanism design", "collusion", "star network", "models of communication"], "abstract": "In collusion-free protocols, subliminal communication is impossible and parties are thus unable to communicate “any information beyond what the protocol allows”. Collusion-free protocols are interesting for several reasons, but have specifically attracted attention because they can be used to reduce trust in game-theoretic mechanisms. Collusion-free protocols are impossible to achieve (in general) when all parties are connected by point-to-point channels, but exist under certain physical assumptions (Lepinksi et al., STOC 2005) or in specific network topologies (Alwen et al., Crypto 2008). \nThis work provides a “clean-slate” definition of the stronger notion of collusion preservation. The goals in revisiting the definition are: \n· To give a definition with respect to arbitrary communication resources (that includes as special cases the communication models from prior work). We can then, in particular, better understand what types of resources enable collusion-preserving protocols. \n· To construct protocols that allow no additional subliminal communication in the case when parties can communicate (a bounded amount of information) via other means. (This property is not implied by collusion-freeness.) \n· To provide a definition supporting composition, so that protocols can be designed in a modular fashion using sub-protocols run among subsets of the parties. \nIn addition to proposing the definition, we explore necessary properties of the underlying communication resource. Next we provide a general feasibility result for collusion-preserving computation of arbitrary functionalities. We show that the resulting protocols enjoy an elegant (and surprisingly strong) fallback security even in the case when the underlying communication resource acts in a Byzantine manner. Finally, we investigate the implications of these results in the context of mechanism design.", "citation": "Citations (17)", "departments": ["ETH Zurich", "University of Maryland, College Park", "ETH Zurich", "University of Maryland, College Park"], "authors": ["Joël Alwen.....http://dblp.org/pers/hd/a/Alwen:Jo=euml=l", "Jonathan Katz.....http://dblp.org/pers/hd/k/Katz:Jonathan", "Ueli Maurer.....http://dblp.org/pers/hd/m/Maurer:Ueli", "Vassilis Zikas.....http://dblp.org/pers/hd/z/Zikas:Vassilis"], "conf": "crypto", "year": "2012", "pages": 20}