{"title": "Multi-attribute spaces: Calibration for attribute fusion and similarity search.", "fields": ["image fusion", "raw score", "attribute domain", "normalization", "nearest neighbor search"], "abstract": "Recent work has shown that visual attributes are a powerful approach for applications such as recognition, image description and retrieval. However, fusing multiple attribute scores — as required during multi-attribute queries or similarity searches — presents a significant challenge. Scores from different attribute classifiers cannot be combined in a simple way; the same score for different attributes can mean different things. In this work, we show how to construct normalized “multi-attribute spaces” from raw classifier outputs, using techniques based on the statistical Extreme Value Theory. Our method calibrates each raw score to a probability that the given attribute is present in the image. We describe how these probabilities can be fused in a simple way to perform more accurate multiattribute searches, as well as enable attribute-based similarity searches. A significant advantage of our approach is that the normalization is done after-the-fact, requiring neither modification to the attribute classification system nor ground truth attribute annotations. We demonstrate results on a large data set of nearly 2 million face images and show significant improvements over prior work. We also show that perceptual similarity of search results increases by using contextual attributes.", "citation": "Citations (169)", "year": "2012", "departments": ["University of Colorado Colorado Springs", "University of Washington", "Columbia University", "University of Colorado Colorado Springs"], "conf": "cvpr", "authors": ["Walter J. Scheirer.....http://dblp.org/pers/hd/s/Scheirer:Walter_J=", "Neeraj Kumar.....http://dblp.org/pers/hd/k/Kumar_0006:Neeraj", "Peter N. Belhumeur.....http://dblp.org/pers/hd/b/Belhumeur:Peter_N=", "Terrance E. Boult.....http://dblp.org/pers/hd/b/Boult:Terrance_E="], "pages": 8}