{"title": "Twiage: a game for finding good advice on twitter.", "fields": ["subject matter expert", "crowdsourcing", "microblogging", "external validity", "ranking"], "abstract": "Millions of recommendations, opinions and experiences are shared across popular microblogging platforms and services each day. Yet much of this content becomes quickly lost in the stream shortly after being posted. This paper looks at the feasibility of identifying useful content in microblog streams so that it might be archived to facilitate wider access and reference. Towards this goal, we present an experiment with a game-with-a-purpose called  Twiage  that we designed to determine how well the deluge of content in \"raw\" microblog streams could be turned into filtered and ranked collections using ratings from players. Experiments with Twiage validate the feasibility of applying human-computation to this problem, finding strong agreement about what constitutes the \"most useful\" content in our test dataset. Second, we compare the effectiveness of various methods of eliciting such ratings, finding that a \"choose-best\" interface and Elo rating ranking scheme yield the greatest agreement in the fewest rounds. External validation of resulting top-rated twitter content with a domain expert found that while the top Twiage-ranked \"tweets\" were among the best of the set, there was a tendency for players to also select what we term \"weak spam\" - e.g., promotional content disguised as articles or reviews, indicating a need for more stringent content filtering.", "citation": "Citations (6)", "departments": ["University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton"], "authors": ["Max Van Kleek.....http://dblp.org/pers/hd/k/Kleek:Max_Van", "Daniel A. Smith.....http://dblp.org/pers/hd/s/Smith:Daniel_A=", "Ruben Stranders.....http://dblp.org/pers/hd/s/Stranders:Ruben", "m. c. schraefel.....http://dblp.org/pers/hd/s/schraefel:m=_c="], "conf": "chi", "year": "2012", "pages": 10}