{"title": "It's not easy being green.", "fields": ["carbon footprint", "subtitle", "public relations", "carbon dioxide", "rubbing", "operations management", "conductive polymer", "upgrade", "public administration", "diode", "microbiology", "light emitting diode", "chemist", "biology", "business", "environmental science", "carbon tax", "greenhouse gas", "green computing", "unintended consequences", "automotive engineering", "virology", "anisotropy", "pharmaceutical industry", "inorganic chemistry", "truck", "chemistry", "traffic engineering", "pollution"], "abstract": "Large-scale Internet applications, such as content distribution networks, are deployed across multiple datacenters and consume massive amounts of electricity. To provide uniformly low access latencies, these datacenters are geographically distributed and the deployment size at each location reflects the regional demand for the application. Consequently, an application's environmental impact can vary significantly depending on the geographical distribution of end-users, as electricity cost and carbon footprint per watt is location specific. In this paper, we describe FORTE: Flow Optimization based framework for request-Routing and Traffic Engineering. FORTE dynamically controls the fraction of user traffic directed to each datacenter in response to changes in both request workload and carbon footprint. It allows an operator to navigate the three-way tradeoff between access latency, carbon footprint, and electricity costs and to determine an optimal datacenter upgrade plan in response to increases in traffic load. We use FORTE to show that carbon taxes or credits are impractical in incentivizing carbon output reduction by providers of large-scale Internet applications. However, they can reduce carbon emissions by 10% without increasing the mean latency nor the electricity bill.", "citation": "Not cited", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Peter Xiang Gao.....http://dblp.org/pers/hd/g/Gao:Peter_Xiang", "Andrew R. Curtis.....http://dblp.org/pers/hd/c/Curtis:Andrew_R=", "Bernard Wong.....http://dblp.org/pers/hd/w/Wong:Bernard", "Srinivasan Keshav.....http://dblp.org/pers/hd/k/Keshav:Srinivasan"], "conf": "sigcomm", "year": "2012", "pages": 12}