{"title": "Secure two-party computation in sublinear (amortized) time.", "fields": ["secure two party computation", "amortized analysis", "oblivious ram", "sublinear function", "database search engine"], "abstract": "Traditional approaches to generic secure computation begin by representing the function f being computed as a circuit. If f depends on each of its input bits, this implies a protocol with complexity at least linear in the input size. In fact, linear running time is inherent for non-trivial functions since each party must \"touch\" every bit of their input lest information about the other party's input be leaked. This seems to rule out many applications of secure computation (e.g., database search) in scenarios where inputs are huge.   Adapting and extending an idea of Ostrovsky and Shoup, we present an approach to secure two-party computation that yields protocols running in sublinear time, in an amortized sense, for functions that can be computed in sublinear time on a random-access machine (RAM). Moreover, each party is required to maintain state that is only (essentially) linear in its own input size. Our approach combines generic secure two-party computation with oblivious RAM (ORAM) protocols. We present an optimized version of our approach using Yao's garbled-circuit protocol and a recent ORAM construction of Shi et al.   We describe an implementation of our resulting protocol, and evaluate its performance for obliviously searching a database with over 1 million entries. Our implementation outperforms off-the-shelf secure-computation protocols for databases containing more than 218 entries.", "citation": "Citations (127)", "year": "2012", "departments": ["Applied Communication Sciences", "University of Maryland, College Park", "Bell Labs", "Columbia University", "Columbia University"], "conf": "ccs", "authors": ["S. Dov Gordon.....http://dblp.org/pers/hd/g/Gordon:S=_Dov", "Jonathan Katz.....http://dblp.org/pers/hd/k/Katz:Jonathan", "Vladimir Kolesnikov.....http://dblp.org/pers/hd/k/Kolesnikov:Vladimir", "Fernando Krell.....http://dblp.org/pers/hd/k/Krell:Fernando", "Tal Malkin.....http://dblp.org/pers/hd/m/Malkin:Tal", "Mariana Raykova.....http://dblp.org/pers/hd/r/Raykova_0001:Mariana", "Yevgeniy Vahlis.....http://dblp.org/pers/hd/v/Vahlis:Yevgeniy"], "pages": 12}