{"title": "Efficient Runtime Policy Enforcement Using Counterexample-Guided Abstraction Refinement.", "fields": ["runtime verification", "javascript", "symbolic execution", "predicate abstraction", "stateful firewall"], "abstract": "Stateful security policies--which specify restrictions on behavior in terms of temporal safety properties--are a powerful tool for administrators to control the behavior of untrusted programs. However, the runtime overhead required to enforce them on real programs can be high. This paper describes a technique for rewriting programs to incorporate runtime checks so that all executions of the resulting program either satisfy the policy, or halt before violating it. By introducing a rewriting step before runtime enforcement, we are able to perform static analysis to optimize the code introduced to track the policy state. We developed a novel analysis, which builds on abstraction-refinement techniques, to derive a set of runtime policy checks to enforce a given policy--as well as their placement in the code. Furthermore, the abstraction refinement is tunable by the user, so that additional time spent in analysis results in fewer dynamic checks, and therefore more efficient code. We report experimental results on an implementation of the algorithm that supports policy checking for JavaScript programs.", "citation": "Citations (9)", "year": "2012", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "SRI International"], "conf": "cav", "authors": ["Matthew Fredrikson.....http://dblp.org/pers/hd/f/Fredrikson:Matthew", "Richard Joiner.....http://dblp.org/pers/hd/j/Joiner:Richard", "Somesh Jha.....http://dblp.org/pers/hd/j/Jha:Somesh", "Thomas W. Reps.....http://dblp.org/pers/hd/r/Reps:Thomas_W=", "Phillip A. Porras.....http://dblp.org/pers/hd/p/Porras:Phillip_A=", "Hassen Saïdi.....http://dblp.org/pers/hd/s/Sa=iuml=di:Hassen", "Vinod Yegneswaran.....http://dblp.org/pers/hd/y/Yegneswaran:Vinod"], "pages": 16}