{"title": "RED-BL: Energy solution for loading data centers.", "fields": ["data center", "operator", "workload", "software deployment", "relocation"], "abstract": "Cloud infrastructure providers and data center operators spend a major portion of their operations budget on the electric bills. We present RED-BL (Relocate Energy Demand to Better Locations), a framework for determining an optimal mapping of workload to an existing set of data centers while considering the cost of workload relocation. Within each workload mapping interval, RED-BL solution exploits the geo diversity in electricity price markets. The temporal diversity in those markets is simultaneously exploited by considering a planning window comprising several mapping intervals. Using workload traces from live Internet applications and electricity prices from the US markets, RED-BL can reduce the electric bill by as much as 81% from the case when the workload is equally distributed. Compared to a single data center deployment, an average reduction of 27% in electric bill can be achieved when RED-BL uses 10 or more data centers, a common case for most operators. When compared to existing workload relocation solutions, RED-BL achieves a further reduction of 13.63%, on average. While modest, this reduction can save millions of dollars for the operators. The cost of this saving is an inexpensive computation at the start of each planning window.", "citation": "Citations (16)", "departments": ["Lahore University of Management Sciences", "Cisco Systems, Inc.", "University of California, Davis", "Lahore University of Management Sciences", "University of California, Davis"], "authors": ["Muhammad Saqib Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Muhammad_Saqib", "Saqib Raza.....http://dblp.org/pers/hd/r/Raza:Saqib", "Chao-Chih Chen.....http://dblp.org/pers/hd/c/Chen:Chao=Chih", "Zartash Afzal Uzmi.....http://dblp.org/pers/hd/u/Uzmi:Zartash_Afzal", "Chen-Nee Chuah.....http://dblp.org/pers/hd/c/Chuah:Chen=Nee"], "conf": "infocom", "year": "2012", "pages": 5}