{"title": "Color attributes for object detection.", "fields": ["contextual image classification", "object detection", "color histogram", "color normalization", "histogram"], "abstract": "State-of-the-art object detectors typically use shape information as a low level feature representation to capture the local structure of an object. This paper shows that early fusion of shape and color, as is popular in image classification, leads to a significant drop in performance for object detection. Moreover, such approaches also yields suboptimal results for object categories with varying importance of color and shape. In this paper we propose the use of color attributes as an explicit color representation for object detection. Color attributes are compact, computationally efficient, and when combined with traditional shape features provide state-of-the-art results for object detection. Our method is tested on the PASCAL VOC 2007 and 2009 datasets and results clearly show that our method improves over state-of-the-art techniques despite its simplicity. We also introduce a new dataset consisting of cartoon character images in which color plays a pivotal role. On this dataset, our approach yields a significant gain of 14% in mean AP over conventional state-of-the-art methods.", "citation": "Citations (244)", "year": "2012", "departments": ["Linköping University", "Autonomous University of Barcelona", "Autonomous University of Barcelona", "Autonomous University of Barcelona", "Autonomous University of Barcelona"], "conf": "cvpr", "authors": ["Fahad Shahbaz Khan.....http://dblp.org/pers/hd/k/Khan:Fahad_Shahbaz", "Rao Muhammad Anwer.....http://dblp.org/pers/hd/a/Anwer:Rao_Muhammad", "Joost van de Weijer.....http://dblp.org/pers/hd/w/Weijer:Joost_van_de", "Andrew D. Bagdanov.....http://dblp.org/pers/hd/b/Bagdanov:Andrew_D=", "María Vanrell.....http://dblp.org/pers/hd/v/Vanrell_0001:Mar=iacute=a", "Antonio M. López.....http://dblp.org/pers/hd/l/L=oacute=pez:Antonio_M="], "pages": 8}