{"title": "Trusted collaborative spectrum sensing for mobile cognitive radio networks.", "fields": [], "abstract": "Collaborative spectrum sensing is a key technology in cognitive radio networks (CRNs). Although mobility is an inherent property of wireless networks, there has been no prior work studying the performance of collaborative spectrum sensing under attacks in mobile CRNs. Existing solutions based on user trust for secure collaborative spectrum sensing cannot be applied to mobile scenarios, since they do not consider the location diversity of the network, thus over penalize honest users who are at bad locations with severe path-loss. In this paper, we propose to use two trust parameters, location reliability and malicious intention (LRMI), to improve both malicious user detection and primary user detection in mobile CRNs under attack. Location reliability reflects path-loss characteristics of the wireless channel and malicious intention captures the true intention of secondary users, respectively. We propose a primary user detection method based on location reliability (LR) and a malicious user detection method based on LR and Dempster-Shafer (D-S) theory. Simulations show that mobility helps train location reliability and detect malicious users based on our methods. Our proposed detection mechanisms based on LRMI significantly outperforms existing solutions. In comparison to the existing solutions, we show an improvement of malicious user detection rate by 3 times and primary user detection rate by 20% at false alarm rate of 5%, respectively.", "citation": "Citations (58)", "departments": ["University of California, Davis", "University of Michigan", "Virginia Commonwealth University", "University of California, Davis", "University of California, Davis", "University of Michigan", "University of California, Davis"], "authors": ["Shraboni Jana.....http://dblp.org/pers/hd/j/Jana:Shraboni", "Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0001:Kai", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant"], "conf": "infocom", "year": "2012", "pages": 5}