{"title": "Execution migration in a heterogeneous-ISA chip multiprocessor.", "fields": ["binary translation", "homogeneous", "subroutine", "small number", "pointer"], "abstract": "Prior research has shown that single-ISA heterogeneous chip multiprocessors have the potential for greater performance and energy efficiency than homogeneous CMPs. However, restricting the cores to a single ISA removes an important opportunity for greater heterogeneity. To take full advantage of a heterogeneous-ISA CMP, however, we must be able to migrate execution among heterogeneous cores in order to adapt to program phase changes and changing external conditions (e.g., system power state).   This paper explores migration on heterogeneous-ISA CMPs. This is non-trivial because program state is kept in an architecture-specific form; therefore, state transformation is necessary for migration. To keep migration cost low, the amount of state that requires transformation must be minimized. This work identifies large portions of program state whose form is not critical for performance; the compiler is modified to produce programs that keep most of their state in an architecture-neutral form so that only a small number of data items must be repositioned and no pointers need to be changed. The result is low migration cost with minimal sacrifice of non-migration performance.   Additionally, this work leverages binary translation to enable instantaneous migration. When migration is requested, the program is immediately migrated to a different core where binary translation runs for a short time until a function call is reached, at which point program state is transformed and execution continues natively on the new core.   This system can tolerate migrations as often as every 100 ms and still retain 95% of the performance of a system that does not do, or support, migration.", "citation": "Citations (62)", "year": "2012", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "asplos", "authors": ["Matthew DeVuyst.....http://dblp.org/pers/hd/d/DeVuyst:Matthew", "Ashish Venkat.....http://dblp.org/pers/hd/v/Venkat:Ashish", "Dean M. Tullsen.....http://dblp.org/pers/hd/t/Tullsen:Dean_M="], "pages": 12}