{"title": "Scaling laws for cognitive radio network with heterogeneous mobile secondary users.", "fields": ["network packet", "cognitive radio", "ranging", "uniform distribution", "channel capacity"], "abstract": "We study the capacity and delay scaling laws for cognitive radio network (CRN) with static primary users and heterogeneous mobile secondary users coexisting in the unit planar area. The primary network consists of n randomly and uniformly distributed static primary users (PUs) with higher priority to access the spectrum. The secondary network consists of m = (h + 1)n 1+∈  heterogeneous mobile secondary users (SUs) which should access the spectrum opportunistically, here h = O(log n) and ∈ > 0. Each secondary user moves within a circular area centered at its initial position with a restricted speed. The moving area of each mobile SU is n −α , where a is a random variable which follows the discrete uniform distribution with h + 1 different values, ranging from 0 to α 0  (α 0  > 0). α 0  and h together determine the mobility heterogeneity of secondary users. By allowing the secondary users to relay the packets for primary users, we have proposed a joint routing and scheduling scheme to fully utilize the mobility heterogeneity of secondary users. We show that the primary network and secondary network can achieve optimal capacity and delay scalings if we increase the mobility heterogeneity of secondary users, i.e., the value of h and α 0 , until h = Θ(log n) and α 0  ≥ 1 + ∈. In this optimal condition, both the primary network and part of the secondary network can achieve almost constant capacity and delay scalings except for poly-logarithmic factor.", "citation": "Citations (14)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "McGill University"], "authors": ["Yingzhe Li.....http://dblp.org/pers/hd/l/Li:Yingzhe", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Xiaohua Tian.....http://dblp.org/pers/hd/t/Tian:Xiaohua", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue"], "conf": "infocom", "year": "2012", "pages": 9}