{"title": "Frame retransmissions considered harmful: improving spectrum efficiency using Micro-ACKs.", "fields": ["spectral efficiency", "lossy compression", "network packet", "retransmission", "communication source"], "abstract": "Retransmissions reduce the efficiency of data communication in wireless networks because of: (i) per-retransmission packet headers, (ii) contention overhead on every retransmission, and (iii) redundant bits in every retransmission. In fact, every retransmission nearly doubles the time to successfully deliver the packet. To improve spectrum efficiency in a lossy environment, we propose a new in-frame retransmission scheme using uACKs. Instead of waiting for the entire transmission to end before sending the ACK, the receiver sends smaller uACKs for every few symbols, on a separate narrow feedback channel. Based on these uACKs, the sender only retransmits the lost symbols after the last data symbol in the frame, thereby adaptively changing the frame size to ensure it is successfully delivered. We have implemented uACK on the Sora platform. Experiments with our prototype validate the feasibility of symbol-level uACK . By significantly reducing the retransmistion overhead, the sender is able to aggressively use higher data rate for a lossy link. Both improve the overall network efficiency. Our experimental results from a controlled environment and an 9-node software radio testbed show that uACK can have up to 140% throughput gain over 802.11g and up to 60% gain over the best known retransmission scheme.", "citation": "Citations (30)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Jiansong Zhang.....http://dblp.org/pers/hd/z/Zhang:Jiansong", "Haichen Shen.....http://dblp.org/pers/hd/s/Shen:Haichen", "Kun Tan.....http://dblp.org/pers/hd/t/Tan:Kun", "Ranveer Chandra.....http://dblp.org/pers/hd/c/Chandra:Ranveer", "Yongguang Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongguang", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "conf": "mobicom", "year": "2012", "pages": 12}