{"title": "Anatomy of a gift recommendation engine powered by social media.", "fields": ["social media", "data integrity", "e commerce", "data integration", "information extraction"], "abstract": "More and more people conduct their shopping online [1], especially during the holiday season [2]. Shopping online offers a lot of convenience, including the luxury of shopping from home, the ease of research, better prices, and in many cases access to unique products not available in stores.   One of the facets of shopping is gifting. Gifting may be the act of giving a present to somebody because of an event (e.g., birthday) or occasion (e.g., house warming party). People may also treat themselves or loved ones to a gift. Regardless of the occasion or the reason for gifting, there is often one common denominator: delight the receiver. The pursuit of delight can cause a great deal of stress and also be extremely time consuming as many people today either already have everything, or have easy access to everything.   The @WalmartLabs Gift Recommendation Engine and its first application, Shopycat, which is a gift finder application on Facebook, aim to find the right and \"wow\" gifts much easier and quicker than ever before, by taking into account social media interactions. In this paper we will begin by describing the Shopycat Social Gift Finder Facebook application. Next, we describe the components of the engine. Finally, we discuss the metrics used to evaluate the engine.   Building such a gift recommendation engine raises many challenges, in inferring user interests, computing the giftability of a product and an interest, and processing the big and fast data associated with social media. We briefly discuss our solutions to these challenges. Overall, our gift recommendation engine is an example that illustrates social commerce, a powerful emerging trend in e-commerce, and a major focus of @WalmartLabs.", "citation": "Citations (3)", "year": "2012", "departments": ["Walmart Labs", "Walmart Labs", "Walmart Labs", "Walmart Labs", "Walmart Labs"], "conf": "sigmod", "authors": ["Yannis Pavlidis.....http://dblp.org/pers/hd/p/Pavlidis:Yannis", "Madhusudan Mathihalli.....http://dblp.org/pers/hd/m/Mathihalli:Madhusudan", "Indrani Chakravarty.....http://dblp.org/pers/hd/c/Chakravarty:Indrani", "Arvind Batra.....http://dblp.org/pers/hd/b/Batra:Arvind", "Ron Benson.....http://dblp.org/pers/hd/b/Benson:Ron", "Ravi Raj.....http://dblp.org/pers/hd/r/Raj:Ravi", "Robert Yau.....http://dblp.org/pers/hd/y/Yau:Robert", "Mike McKiernan.....http://dblp.org/pers/hd/m/McKiernan:Mike", "Venky Harinarayan.....http://dblp.org/pers/hd/h/Harinarayan:Venky", "Anand Rajaraman.....http://dblp.org/pers/hd/r/Rajaraman:Anand"], "pages": 8}