{"title": "A novel network delay based side-channel attack: Modeling and defense.", "fields": ["traffic shaping", "information leakage", "adversary", "web traffic", "side channel attack"], "abstract": "Information leakage via side channels has become a primary security threat to encrypted web traffic. Existing side channel attacks and corresponding countermeasures focus primarily on packet length, packet timing, web object size and web flow size. However, we found that encrypted web traffic can also leak information via network delay between a user and the web sites that she visits. Motivated by this observation, we investigate a novel network-delay based side-channel attack to infer web sites visited by a user. The adversary can utilize pattern recognition techniques to differentiate web sites by measuring sample mean and sample variance of the round-trip time (RTT) between a victim user and web sites. We theoretically analyzed the damage caused by such an adversary and derived closed-form formulae for detection rate, the probability that the adversary correctly recognizes a web site. To defeat this side-channel attack, we proposed several countermeasures. The basic idea is to shape traffic from different web sites so that they have similar RTT statistics. We proposed the strategies based on the k-means clustering and K-Anonymity to ensure that traffic shaping will not cause excessive delay while providing a predictable degree of anonymity. We conducted extensive experiments and our empirical results match our theory very well.", "citation": "Citations (9)", "departments": ["Southeast University", "Southeast University", "Southeast University", "Southeast University", "University of Massachusetts Lowell"], "authors": ["Zhen Ling.....http://dblp.org/pers/hd/l/Ling:Zhen", "Junzhou Luo.....http://dblp.org/pers/hd/l/Luo:Junzhou", "Yang Zhang.....http://dblp.org/pers/hd/z/Zhang:Yang", "Ming Yang.....http://dblp.org/pers/hd/y/Yang_0001:Ming", "Xinwen Fu.....http://dblp.org/pers/hd/f/Fu:Xinwen", "Wei Yu.....http://dblp.org/pers/hd/y/Yu_0002:Wei"], "conf": "infocom", "year": "2012", "pages": 9}