{"title": "Robust feature selection and robust PCA for internet traffic anomaly detection.", "fields": ["robust principal component analysis", "anomaly detection", "robust statistics", "feature selection", "outlier"], "abstract": "Robust statistics is a branch of statistics which includes statistical methods capable of dealing adequately with the presence of outliers. In this paper, we propose an anomaly detection method that combines a feature selection algorithm and an outlier detection method, which makes extensive use of robust statistics. Feature selection is based on a mutual information metric for which we have developed a robust estimator; it also includes a novel and automatic procedure for determining the number of relevant features. Outlier detection is based on robust Principal Component Analysis (PCA) which, opposite to classical PCA, is not sensitive to outliers and precludes the necessity of training using a reliably labeled dataset, a strong advantage from the operational point of view. To evaluate our method we designed a network scenario capable of producing a perfect ground-truth under real (but controlled) traffic conditions. Results show the significant improvements of our method over the corresponding classical ones. Moreover, despite being a largely overlooked issue in the context of anomaly detection, feature selection is found to be an important preprocessing step, allowing adaption to different network conditions and inducing significant performance gains.", "citation": "Citations (27)", "departments": ["Vienna University of Technology", "University of Aveiro", "UTL/IST and CEM ... isbon, Portugal", "UTL/IST and CEM ... isbon, Portugal", "UTL/IST and Ins ... isbon, Portugal"], "authors": ["Cláudia Pascoal.....http://dblp.org/pers/hd/p/Pascoal:Cl=aacute=udia", "Maria Rosário de Oliveira.....http://dblp.org/pers/hd/o/Oliveira:Maria_Ros=aacute=rio_de", "Rui Valadas.....http://dblp.org/pers/hd/v/Valadas:Rui", "Peter Filzmoser.....http://dblp.org/pers/hd/f/Filzmoser:Peter", "Paulo Salvador.....http://dblp.org/pers/hd/s/Salvador:Paulo", "António Pacheco.....http://dblp.org/pers/hd/p/Pacheco:Ant=oacute=nio"], "conf": "infocom", "year": "2012", "pages": 9}