{"title": "Dynamic changes in motivation in collaborative citizen-science projects.", "fields": ["crowdsourcing", "citizen science", "human computer interaction", "attribution", "management science"], "abstract": "Online citizen science projects engage volunteers in collecting, analyzing, and curating scientific data. Existing projects have demonstrated the value of using volunteers to collect data, but few projects have reached the full collaborative potential of scientists and volunteers. Understanding the shared and unique motivations of these two groups can help designers establish the technical and social infrastructures needed to promote effective partnerships. We present findings from a study of the motivational factors affecting participation in ecological citizen science projects. We show that volunteers are motivated by a complex framework of factors that dynamically change throughout their cycle of work on scientific projects; this motivational framework is strongly affected by personal interests as well as external factors such as attribution and acknowledgment. Identifying the pivotal points of motivational shift and addressing them in the design of citizen-science systems will facilitate improved collaboration between scientists and volunteers.", "citation": "Citations (267)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "Smithsonian Institution", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Dana Rotman.....http://dblp.org/pers/hd/r/Rotman:Dana", "Jenny Preece.....http://dblp.org/pers/hd/p/Preece:Jenny", "Jennifer Hammock.....http://dblp.org/pers/hd/h/Hammock:Jennifer", "Kezee Procita.....http://dblp.org/pers/hd/p/Procita:Kezee", "Derek L. Hansen.....http://dblp.org/pers/hd/h/Hansen:Derek_L=", "Cynthia Sims Parr.....http://dblp.org/pers/hd/p/Parr:Cynthia_Sims", "Darcy Lewis.....http://dblp.org/pers/hd/l/Lewis:Darcy", "David W. Jacobs.....http://dblp.org/pers/hd/j/Jacobs:David_W="], "conf": "cscw", "year": "2012", "pages": 10}