{"title": "Don't ask me what i'm like, just watch and listen.", "fields": ["clips", "personality assessment inventory", "personality", "ask price", "emotion recognition"], "abstract": "Traditional (based on psychology) approaches for personality assessment of an individual require him/her to fill up a questionnaire. This paper presents a novel way of  utilizing multimodal cues to automatically fill up the questionnaire . The contributions of this work are three-fold. (1) Novel  psychology-based audio/visual/lexical features are proposed  and shown to be effective in predicting answers to a personality questionnaire, Big-Five Inventory-10 (BFI- 10). (2) Extracted features are used to learn linear and kernel versions of a  novel regression model , 'SLoT', to automatically predict BFI-10 answers. The model is based on Sparse and Low-rank Transformation (SLoT). (3) Predicted answers are used to compute personality scores using standard BFI-10 scoring scheme. We evaluated our approach on a dataset of 3907 clips (for 50 characters from movies of diverse genres) manually labeled with BFI-10 answers and personality scores as ground-truth. Experiments indicate that the proposed 'SLoT' model effectively automates the answering process by emulating human understanding. We also conclude that predicting personality scores through predicting answers first is better than directly predicting scores based on audio/visual features (as studied in state-of-the art methods).", "citation": "Citations (13)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "Institute for I ... pore, Singapore"], "authors": ["Ruchir Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Ruchir", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi", "Sujoy Roy.....http://dblp.org/pers/hd/r/Roy:Sujoy", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Terence Sim.....http://dblp.org/pers/hd/s/Sim:Terence"], "conf": "mm", "year": "2012", "pages": 10}