{"title": "System-level implications of disaggregated memory.", "fields": ["conventional memory", "uniform memory access", "flat memory model", "memory map", "interleaved memory"], "abstract": "Recent research on memory disaggregation introduces a new architectural building block — the memory blade — as a cost-effective approach for memory capacity expansion and sharing for an ensemble of blade servers. Memory blades augment blade servers' local memory capacity with a second-level (remote) memory that can be dynamically apportioned among blades in response to changing capacity demand, albeit at a higher access latency. In this paper, we build on the prior research to explore the software and systems implications of disaggregated memory. We develop a software-based prototype by extending the Xen hypervisor to emulate a disaggregated memory design wherein remote pages are swapped into local memory on-demand upon access. Our prototyping effort reveals that low-latency remote memory calls for a different regime of replacement policies than conventional disk paging, favoring minimal hypervisor overhead even at the cost of using less sophisticated replacement policies. Second, we demonstrate the synergy between disaggregated memory and content-based page sharing. By allowing content to be shared both within and across blades (in local and remote memory, respectively), we find that their combination provides greater workload consolidation opportunity and performance-per-dollar than either technique alone. Finally, we explore a realistic deployment scenario in which disaggregated memory is used to reduce the scaling cost of a memcached system. We show that disaggregated memory can provide a 50% improvement in performance-per-dollar relative to conventional scale-out.", "citation": "Citations (66)", "departments": ["Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Kevin T. Lim.....http://dblp.org/pers/hd/l/Lim:Kevin_T=", "Yoshio Turner.....http://dblp.org/pers/hd/t/Turner:Yoshio", "Jose Renato Santos.....http://dblp.org/pers/hd/s/Santos:Jose_Renato", "Alvin AuYoung.....http://dblp.org/pers/hd/a/AuYoung:Alvin", "Jichuan Chang.....http://dblp.org/pers/hd/c/Chang:Jichuan", "Parthasarathy Ranganathan.....http://dblp.org/pers/hd/r/Ranganathan:Parthasarathy", "Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F="], "conf": "hpca", "year": "2012", "pages": 12}