{"title": "Quality of Information Based Data Selection and Transmission in Wireless Sensor Networks.", "fields": ["visual sensor network", "information quality", "key distribution in wireless sensor networks", "data redundancy", "sensor node"], "abstract": "In this paper, we provide a quality of information (QoI) based data selection and transmission service for classification missions in sensor networks. We first identify the two aspects of QoI, data reliability and data redundancy, and then propose metrics to estimate them. In particular, reliability implies the degree to which a sensor node contributes to the classification mission, and can be estimated through exploring the agreement between this node and the majority of others. On the other hand, redundancy represents the information overlap among different sensor nodes, and can be measured via investigating the similarity of their clustering results. Based on the proposed QoI metrics, we formulate an optimization problem that aims at maximizing the reliability of sensory data while eliminating their redundancies under the constraint of network resources. We decompose this problem into a data selection sub problem and a data transmission sub problem, and develop a distributed algorithm to solve them separately. The advantages of our schemes are demonstrated through the simulations on not only synthetic data but also a set of real audio records.", "citation": "Citations (14)", "year": "2012", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University at Buffalo"], "conf": "rtss", "authors": ["Lu Su.....http://dblp.org/pers/hd/s/Su:Lu", "Shaohan Hu.....http://dblp.org/pers/hd/h/Hu:Shaohan", "Shen Li.....http://dblp.org/pers/hd/l/Li:Shen", "Feng Liang.....http://dblp.org/pers/hd/l/Liang:Feng", "Jing Gao.....http://dblp.org/pers/hd/g/Gao:Jing", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F=", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "pages": 12}