{"title": "Street-to-shop: Cross-scenario clothing retrieval via parts alignment and auxiliary set.", "fields": ["image retrieval", "feature extraction", "multimedia", "computer science", "clothing", "sparse matrix", "iterative reconstruction"], "abstract": "We address a cross-scenario clothing retrieval problem- given a daily human photo captured in general environment, e.g., on street, finding similar clothing in online shops, where the photos are captured more professionally and with clean background. There are large discrepancies between daily photo scenario and online shopping scenario. We first propose to alleviate the human pose discrepancy by locating 30 human parts detected by a well trained human detector. Then, founded on part features, we propose a two-step calculation to obtain more reliable one-to-many similarities between the query daily photo and online shopping photos: 1) the within-scenario one-to-many similarities between a query daily photo and an extra auxiliary set are derived by direct sparse reconstruction; 2) by a cross-scenario many-to-many similarity transfer matrix inferred offline from the auxiliary set and the online shopping set, the reliable cross-scenario one-to-many similarities between the query daily photo and all online shopping photos are obtained.", "citation": "Citations (238)", "year": "2012", "departments": ["National University of Singapore", "National University of Singapore", "Hefei University of Technology", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "National University of Singapore", "National University of Singapore", "National University of Singapore", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "cvpr", "authors": ["Si Liu.....http://dblp.org/pers/hd/l/Liu_0001:Si", "Zheng Song.....http://dblp.org/pers/hd/s/Song:Zheng", "Guangcan Liu.....http://dblp.org/pers/hd/l/Liu:Guangcan", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng", "Hanqing Lu.....http://dblp.org/pers/hd/l/Lu:Hanqing", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "pages": 8}