{"title": "Performance and resource modeling in highly-concurrent OLTP workloads.", "fields": ["training set", "database administrator", "resource consumption", "multitenancy", "online transaction processing"], "abstract": "Database administrators of Online Transaction Processing (OLTP) systems constantly face difficult questions. For example, \"What is the maximum throughput I can sustain with my current hardware?\", \"How much disk I/O will my system perform if the requests per second double?\", or \"What will happen if the ratio of transactions in my system changes?\". Resource prediction and performance analysis are both vital and difficult in this setting. Here the challenge is due to high degrees of concurrency, competition for resources, and complex interactions between transactions, all of which non-linearly impact performance.   Although difficult, such analysis is a key component in enabling database administrators to understand which queries are eating up the resources, and how their system would scale under load. In this paper, we introduce our framework, called DBSeer, that addresses this problem by employing statistical models that provide resource and performance analysis and prediction for highly concurrent OLTP workloads. Our models are built on a small amount of training data from standard log information collected during normal system operation. These models are capable of accurately measuring several performance metrics, including resource consumption on a per-transaction-type basis, resource bottlenecks, and throughput at different load levels. We have validated these models on MySQL/Linux with numerous experiments on standard benchmarks (TPC-C) and real workloads (Wikipedia), observing high accuracy (within a few percent error) when predicting all of the above metrics.", "citation": "Citations (68)", "year": "2013", "departments": ["Massachusetts Institute of Technology", "Microsoft", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "sigmod", "authors": ["Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan", "Carlo Curino.....http://dblp.org/pers/hd/c/Curino:Carlo", "Alekh Jindal.....http://dblp.org/pers/hd/j/Jindal:Alekh", "Samuel Madden.....http://dblp.org/pers/hd/m/Madden:Samuel"], "pages": 12}