{"title": "Semi-automatic restructuring of offloadable tasks for many-core accelerators.", "fields": ["neighbourhood", "code", "directive", "compile time", "xeon phi"], "abstract": "Work division between the processor and accelerator is a common theme in modern heterogenous computing. Recent efforts (such as LEO and OpenAcc) provide directives that allow the developer to mark code regions in the original application from which  offloadable tasks  can be generated by the compiler. Auto-tuners and runtime schedulers work with the options (i.e., offloadable tasks) generated at compile time, which is limited by the directives specified by the developer. There is no provision for offload restructuring.   We propose a new directive to add  relaxed semantics  to directive-based languages. The compiler identifies and generates one or more offloadable tasks in the neighbourhood of the code region marked by the directive. Central to our contribution is the idea of  sub-offload  and  super-offload . In sub-offload, only a part of the code region marked by the developer is offloaded to the accelerator, while the other part executes on the CPU in parallel. This is done by splitting the index range of the main parallel loop into two or more parts and declaring one of the subloops as the offloadable task. Support is added to handle reduction variables and critical sections across subloops. Sub-offload enables concurrent execution of a task on the CPU and accelerator. In super-offload, a code region larger than the one specified by the developer is declared as the offloadable task (e.g., a parent loop). Super-offload reduces data transfers between CPU and accelerator memory.   We develop  Elastic Offload Compiler (EOC) for use alongside existing directive-based languages. The current implementation supports LEO for the new Intel Xeon Phi (MIC) architecture. We evaluate EOC with respect to SpecOMP and NAS Parallel Benchmarks. Speedups range between 1.3x-4.4x with the CPU version as baseline and 1.2x-24x with the offload (CPU-MIC) version as baseline.", "citation": "Citations (2)", "departments": ["Princeton University", "Princeton University", "Purdue University", "Princeton University"], "authors": ["Nishkam Ravi.....http://dblp.org/pers/hd/r/Ravi:Nishkam", "Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi", "Tao Bao.....http://dblp.org/pers/hd/b/Bao:Tao", "Srimat T. Chakradhar.....http://dblp.org/pers/hd/c/Chakradhar:Srimat_T="], "conf": "sc", "year": "2013", "pages": 12}