{"title": "Safe-Zones for Monitoring Distributed Streams.", "fields": ["optimization problem", "cluster analysis", "streams", "monotonic function", "data stream mining"], "abstract": "In many emerging applications, the data which has to be monitored is of very high volume, dynamic, and distributed, making it infeasible to collect the distinct data streams to a central node and process them there. Often, the monitoring problem consists of determining whether the value of a global function, which depends on the union of all streams, crossed a certain threshold. A great deal of effort is directed at reducing communication overhead by transforming the monitoring of the global function to the testing of local constraints, checked independently at the nodes. Recently, geometric monitoring (GM) proved to be very useful for constructing such local constraints for general (non-linear, non-monotonic) functions. Alas, in all current variants of geometric monitoring, the constraints at all nodes share an identical structure and are, thus, unsuitable for handling heterogeneous streams, which obey different distributions at the distinct nodes. To remedy this, we propose a general approach for geometric monitoring of heterogeneous streams (HGM), which defines constraints tailored to fit the distinct data distributions at the nodes. While optimally selecting the constraints is an NP-hard problem, we provide a practical solution, which seeks to reduce running time by hierarchically clustering nodes with similar data distributions and then solving more, but simpler, optimization problems. Experiments are provided to support the validity of the proposed approach.", "citation": "Not cited", "departments": ["University of Haifa", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Daniel Keren.....http://dblp.org/pers/hd/k/Keren:Daniel", "Guy Sagy.....http://dblp.org/pers/hd/s/Sagy:Guy", "Amir Abboud.....http://dblp.org/pers/hd/a/Abboud:Amir", "David Ben-David.....http://dblp.org/pers/hd/b/Ben=David:David", "Izchak Sharfman.....http://dblp.org/pers/hd/s/Sharfman:Izchak", "Assaf Schuster.....http://dblp.org/pers/hd/s/Schuster:Assaf"], "conf": "vldb", "year": "2013", "pages": 6}