{"title": "Smart data pricing: Lessons from trial planning.", "fields": ["broadband networks", "broadband", "software deployment", "networking hardware", "revenue"], "abstract": "Rapid increases in the demand for broadband data are increasingly causing a growth in costs for communication service providers (CSPs). Yet under the current pricing plans, CSPs' revenue has not kept pace with these costs. Thus, many CSPs are considering Smart Data Pricing (SDP) as a way to reduce cost or increase revenue. Before offering such novel data plans, however, CSPs must conduct trials of the specific data plans proposed. Due to the complexity of necessary changes in network equipment and a need to carefully design the trial in order to understand customer behavior, planning such trials is not only a critical precursor to SDP deployment, but also a nontrivial undertaking in itself. This paper discusses general principles of trial design and proposes two methods for estimating their effectiveness. We first give an introduction to the goals of SDP research and review three possible SDP approaches. We then discuss the importance of pre-trial participant surveys and some technical considerations of implementing the trial infrastructure for a particular SDP algorithm. Finally, we show how the CSP may extrapolate from the trial results to estimate the SDP trial's benefits, in terms of changes in traffic patterns and a reduction in spectrum requirements. We conclude with some remarks about future work.", "citation": "Citations (8)", "departments": ["Princeton University", "Princeton University", "Princeton University", "Princeton University", "Princeton University"], "authors": ["Ming-Jye Sheng.....http://dblp.org/pers/hd/s/Sheng:Ming=Jye", "Carlee Joe-Wong.....http://dblp.org/pers/hd/j/Joe=Wong:Carlee", "Sangtae Ha.....http://dblp.org/pers/hd/h/Ha:Sangtae", "Felix Ming Fai Wong.....http://dblp.org/pers/hd/w/Wong:Felix_Ming_Fai", "Soumya Sen.....http://dblp.org/pers/hd/s/Sen:Soumya"], "conf": "infocom", "year": "2013", "pages": 6}