{"title": "A privacy-preserving social-assisted mobile content dissemination scheme in DTNs.", "fields": ["verifiable secret sharing", "file sharing", "friendship", "exploit", "social behavior"], "abstract": "Mobile content dissemination is very useful for many mobile applications in delay tolerant networks (DTNs), like instant messaging, file sharing, and advertisement dissemination, etc. Recently, social-based approaches, which attempt to exploit social behaviors of DTN users to forward time-insensitive data, such as family photos and friends' sightseeing video clips, have attracted intensive attentions in designing routing schemes in DTNs. Most social-based schemes leverage users' contact history and social information (e.g., community and friendship) as metrics to improve the dissemination performance. In these schemes, users need to obtain others' social information to determine their dissemination strategy, which apparently compromises others users' privacy. Moreover, the owner of mobile contents may only want to disclose his/her data to a particular group of users rather than revealing it to the public. In this paper, we propose a privacy-preserving social-assisted mobile content dissemination scheme in DTNs. We apply users' verifiable attributes to establish their potential social relationships in terms of identical attributes in a privacy-preserving way. Besides, to provide the confidentiality of mobile contents, our approach enables users to encrypt contents before the dissemination process, and only allows users who have particular attributes to decrypt them. By trace-driven simulations and experiments, we show the security and efficiency of our proposed scheme.", "citation": "Citations (18)", "departments": ["University of Florida", "University of Science and Technology of China", "University of Florida", "University of Florida"], "authors": ["Linke Guo.....http://dblp.org/pers/hd/g/Guo:Linke", "Chi Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Chi", "Hao Yue.....http://dblp.org/pers/hd/y/Yue:Hao", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang"], "conf": "infocom", "year": "2013", "pages": 9}