{"title": "Tajo: A distributed data warehouse system on large clusters.", "fields": ["query by example", "distributed data flow", "web query classification", "sargable", "web search query"], "abstract": "The increasing volumes of relational data let us find an alternative to cope with them. Recently, several hybrid approaches (e.g., HadoopDB and Hive) between parallel databases and Hadoop have been introduced to the database community. Although these hybrid approaches have gained wide popularity, they cannot avoid the choice of suboptimal execution strategies. We believe that this problem is caused by the inherent limits of their architectures. In this demo, we present Tajo, a relational, distributed data warehouse system on shared-nothing clusters. It uses Hadoop Distributed File System (HDFS) as the storage layer and has its own query execution engine that we have developed instead of the MapReduce framework. A Tajo cluster consists of one master node and a number of workers across cluster nodes. The master is mainly responsible for query planning and the coordinator for workers. The master divides a query into small tasks and disseminates them to workers. Each worker has a local query engine that executes a directed acyclic graph of physical operators. A DAG of operators can take two or more input sources and be pipelined within the local query engine. In addition, Tajo can control distributed data flow more flexible than that of MapReduce and supports indexing techniques. By combining these features, Tajo can employ more optimized and efficient query processing, including the existing methods that have been studied in the traditional database research areas. To give a deep understanding of the Tajo architecture and behavior during query processing, the demonstration will allow users to submit TPC-H queries to 32 Tajo cluster nodes. The web-based user interface will show (1) how the submitted queries are planned, (2) how the query are distributed across nodes, (3) the cluster and node status, and (4) the detail of relations and their physical information. Also, we provide the performance evaluation of Tajo compared with Hive.", "citation": "Citations (18)", "departments": ["Korea University", "Korea University", "Korea University", "Korea University", "Korea University"], "authors": ["Hyunsik Choi.....http://dblp.org/pers/hd/c/Choi:Hyunsik", "Jihoon Son.....http://dblp.org/pers/hd/s/Son:Jihoon", "Haemi Yang.....http://dblp.org/pers/hd/y/Yang:Haemi", "Hyoseok Ryu.....http://dblp.org/pers/hd/r/Ryu:Hyoseok", "Byungnam Lim.....http://dblp.org/pers/hd/l/Lim:Byungnam", "Soohyung Kim.....http://dblp.org/pers/hd/k/Kim:Soohyung", "Yon Dohn Chung.....http://dblp.org/pers/hd/c/Chung:Yon_Dohn"], "conf": "icde", "year": "2013", "pages": 4}