{"title": "ZiFind: Exploiting cross-technology interference signatures for energy-efficient indoor localization.", "fields": ["ubiquitous computing", "interference", "exploit", "digital signal processing", "frequency spectrum"], "abstract": "Indoor localization becomes increasingly important as context-aware applications gain popularity in mobile users. A promising approach for indoor localization is to leverage the pervasive WiFi infrastructure via fingerprinting-based inference. However, a WiFi device must frequently scan for WiFi signals during localization, leading to high power consumption. Moreover, switching to the scanning mode introduces inevitable disruptions to data communication of WiFi interface. This paper presents a new indoor localization system called ZiFind that exploits the cross-technology interference in the unlicensed 2.4 GHz frequency spectrum. ZiFind utilizes low-power ZigBee interface to collect WiFi interference signals and adopts digital signal processing techniques to extract unique signatures as fingerprints for localization. To deal with the noise in the fingerprints, we design a new learning algorithm called R-KNN that can improve the accuracy of localization by assigning different weights to fingerprint features according to their importance. We implement ZiFind on TelosB motes and evaluate its performance through extensive experiments in a 16,000 ft 2  office building floor consisting of 28 rooms. Our results show that ZiFind leads to significant power saving compared with existing approaches based on WiFi interface, and yields satisfactory localization accuracy in a range of realistic settings.", "citation": "Citations (59)", "departments": ["Beihang University", "Beihang University", "Michigan State University", "Michigan State University"], "authors": ["Yuhang Gao.....http://dblp.org/pers/hd/g/Gao:Yuhang", "Jianwei Niu.....http://dblp.org/pers/hd/n/Niu_0002:Jianwei", "Ruogu Zhou.....http://dblp.org/pers/hd/z/Zhou:Ruogu", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang"], "conf": "infocom", "year": "2013", "pages": 9}