{"title": "Capacity of P2P on-demand streaming with simple, robust and decentralized control.", "fields": ["server", "small number", "upload", "capacity planning", "simple random sample"], "abstract": "The performance of large-scale peer-to-peer (P2P) video-on-demand (VoD) streaming systems can be very challenging to analyze due to sparse connectivity and complex, random dynamics. Specifically, in practical P2P VoD systems, each peer only interacts with a small number of other peers/neighbors. Furthermore, its upload capacity, downloading position, and content availability change dynamically and randomly. In this paper, we rigorously study large-scale P2P VoD systems with sparse connectivity among peers and investigate simple and decentralized P2P control strategies that can provably achieve close-to-optimal streaming capacity. We first focus on a single streaming channel. Using a simple algorithm that assigns each peer a random set of   $\\Theta (\\log N)$    neighbors and allocates upload capacity uniformly, we show that a close-to-optimal streaming rate can be asymptotically achieved for all peers with high probability as the number of peers   $N$   increases. Furthermore, the tracker does not need to obtain detailed knowledge of which chunks each peer caches, and hence incurs low overhead. We then study multiple streaming channels where peers watching one channel may help peers in another channel with insufficient upload bandwidth. We propose a simple random cache-placement strategy and show that a close-to-optimal streaming capacity region for all channels can be attained with high probability, again with only   $\\Theta (\\log N)$    per-peer neighbors. These results provide important insights into the dynamics of large-scale P2P VoD systems, which will be useful for guiding the design of improved P2P control protocols.", "citation": "Citations (11)", "departments": ["Qualcomm", "University of Hong Kong", "Purdue University", "University of Hong Kong"], "authors": ["Can Zhao.....http://dblp.org/pers/hd/z/Zhao:Can", "Jian Zhao.....http://dblp.org/pers/hd/z/Zhao:Jian", "Xiaojun Lin.....http://dblp.org/pers/hd/l/Lin:Xiaojun", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan"], "conf": "infocom", "year": "2013", "pages": 9}