{"title": "Self-learning classifier for Internet traffic.", "fields": ["network management", "adaptive learning", "internet traffic", "traffic engineering", "traffic classification"], "abstract": "Network visibility is a critical part of traffic engineering, network management, and security. Recently, unsupervised algorithms have been envisioned as a viable alternative to automatically identify classes of traffic. However, the accuracy achieved so far does not allow to use them for traffic classification in practical scenario. In this paper, we propose SeLeCT, a Self-Learning Classifier for Internet traffic. It uses unsupervised algorithms along with an adaptive learning approach to automatically let classes of traffic emerge, being identified and (easily) labeled. SeLeCT automatically groups flows into pure (or homogeneous) clusters using alternating simple clustering and filtering phases to remove outliers. SeLeCT uses an adaptive learning approach to boost its ability to spot new protocols and applications. Finally, SeLeCT also simplifies label assignment (which is still based on some manual intervention) so that proper class labels can be easily discovered. We evaluate the performance of SeLeCT using traffic traces collected in different years from various ISPs located in 3 different continents. Our experiments show that SeLeCT achieves overall accuracy close to 98%. Unlike state-of-art classifiers, the biggest advantage of SeLeCT is its ability to help discovering new protocols and applications in an almost automated fashion.", "citation": "Citations (5)", "departments": ["Narus", "Politec. di Tor ... o, Turin, Italy", "Politec. di Tor ... o, Turin, Italy", "Politec. di Tor ... o, Turin, Italy"], "authors": ["Luigi Grimaudo.....http://dblp.org/pers/hd/g/Grimaudo:Luigi", "Marco Mellia.....http://dblp.org/pers/hd/m/Mellia:Marco", "Elena Baralis.....http://dblp.org/pers/hd/b/Baralis:Elena", "Ram Keralapura.....http://dblp.org/pers/hd/k/Keralapura:Ram"], "conf": "infocom", "year": "2013", "pages": 6}