{"title": "Measuring Crowd Collectiveness.", "fields": ["crowd psychology", "merge", "crowd simulation", "collective motion", "crowd analysis", "crowds"], "abstract": "Collective motions of crowds are common in nature and have attracted a great deal of attention in a variety of multidisciplinary fields. Collectiveness, which indicates the degree of individuals acting as a union, is a fundamental and universal measurement for various crowd systems. By quantifying the topological structures of collective manifolds of crowd, this paper proposes a descriptor of collectiveness and its efficient computation for the crowd and its constituent individuals. The Collective Merging algorithm is then proposed to detect collective motions from random motions. We validate the effectiveness and robustness of the proposed collectiveness on the system of self-driven particles as well as other real crowd systems such as pedestrian crowds and bacteria colony. We compare the collectiveness descriptor with human perception for collective motion and show their high consistency. As a universal descriptor, the proposed crowd collectiveness can be used to compare different crowd systems. It has a wide range of applications, such as detecting collective motions from crowd clutters, monitoring crowd dynamics, and generating maps of collectiveness for crowded scenes. A new Collective Motion Database, which consists of 413 video clips from 62 crowded scenes, is released to the public.", "citation": "Citations (145)", "year": "2013", "departments": ["Massachusetts Institute of Technology", "The Chinese University of Hong Kong", "Shanghai Jiao Tong University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "conf": "cvpr", "authors": ["Bolei Zhou.....http://dblp.org/pers/hd/z/Zhou:Bolei", "Xiaoou Tang.....http://dblp.org/pers/hd/t/Tang:Xiaoou", "Xiaogang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaogang"], "pages": 8}