{"title": "Enabling datacenter servers to scale out economically and sustainably.", "fields": ["power management", "bottleneck", "server", "modular design", "provisioning"], "abstract": "As cloud applications proliferate and data-processing demands increase, server resources must grow to unleash the performance of emerging workloads that scale well with large number of compute nodes. Nevertheless, power has become a crucial bottleneck that restricts horizontal scaling (scale out) of server systems, especially in datacenters that employ power over-subscription. When a datacenter hits the maximum capacity of its power provisioning equipment, the owner has to either build another facility or upgrade existing utility power infrastructure -- both approaches add huge capital expenditure, require significant construction lead time, and can further increase the owner's carbon footprint.   This paper proposes  Oasis , a power provisioning scheme for enabling power-/carbon- constrained datacenter servers to scale out economically and sustainably.  Oasis  naturally supports incremental power capacity expansion with near-zero environmental impact as it takes advantages of modular renewable energy system and emerging distributed battery architecture. It allows scale-out datacenter to double its capacity using 100% green energy with up to 25% less overhead cost. This paper also describes our implementation of  Oasis  prototype and introduces our multi-source driven power management scheme  Ozone. Ozone  allows  Oasis  to identify the most suitable power supply control strategies and adjust server load cooperatively to maximize overall system efficiency and reliability. Our results show that  Ozone  could reduce the performance degradation of  Oasis  to 1%, extend  Oasis  battery lifetime by over 50%, and almost triple the average battery backup capacity which is crucial for mission-critical systems.", "citation": "Citations (22)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "Xi'an Jiaotong University"], "authors": ["Chao Li.....http://dblp.org/pers/hd/l/Li_0009:Chao", "Yang Hu.....http://dblp.org/pers/hd/h/Hu_0001:Yang", "Ruijin Zhou.....http://dblp.org/pers/hd/z/Zhou:Ruijin", "Ming Liu.....http://dblp.org/pers/hd/l/Liu_0006:Ming", "Longjun Liu.....http://dblp.org/pers/hd/l/Liu:Longjun", "Jingling Yuan.....http://dblp.org/pers/hd/y/Yuan:Jingling", "Tao Li.....http://dblp.org/pers/hd/l/Li_0006:Tao"], "conf": "micro", "year": "2013", "pages": 12}