{"title": "Using cross-layer adaptations for dynamic data management in large scale coupled scientific workflows.", "fields": ["approaches of management", "exploit", "resource efficiency", "dynamic data", "workflow"], "abstract": "As system scales and application complexity grow, managing and processing simulation data has become a significant challenge. While recent approaches based on data staging and in-situ/in-transit data processing are promising, dynamic data volumes and distributions, such as those occurring in AMR-based simulations, make the efficient use of these techniques challenging. In this paper we propose cross-layer adaptations that address these challenges and respond at runtime to dynamic data management requirements. Specifically we explore (1) adaptations of the spatial resolution at which the data is processed, (2) dynamic placement and scheduling of data processing kernels, and (3) dynamic allocation of in-transit resources. We also exploit coordinated approaches that dynamically combine these adaptations at the different layers. We evaluate the performance of our adaptive cross-layer management approach on the Intrepid IBM-BlueGene/P and Titan Cray-XK7 systems using Chombo-based AMR applications, and demonstrate its effectiveness in improving overall time-to-solution and increasing resource efficiency.", "citation": "Citations (16)", "departments": ["Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University"], "authors": ["Tong Jin.....http://dblp.org/pers/hd/j/Jin:Tong", "Fan Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Fan", "Qian Sun.....http://dblp.org/pers/hd/s/Sun:Qian", "Hoang Bui.....http://dblp.org/pers/hd/b/Bui:Hoang", "Manish Parashar.....http://dblp.org/pers/hd/p/Parashar:Manish", "Hongfeng Yu.....http://dblp.org/pers/hd/y/Yu:Hongfeng", "Scott Klasky.....http://dblp.org/pers/hd/k/Klasky:Scott", "Norbert Podhorszki.....http://dblp.org/pers/hd/p/Podhorszki:Norbert", "Hasan Abbasi.....http://dblp.org/pers/hd/a/Abbasi:Hasan"], "conf": "sc", "year": "2013", "pages": 12}