{"title": "Exploring discriminative pose sub-patterns for effective action classification.", "fields": ["discriminative model", "motion capture", "feature learning", "curse of dimensionality", "normalization"], "abstract": "Articulated configuration of human body parts is an essential representation of human motion, therefore is well suited for classifying human actions. In this work, we propose a novel approach to exploring the discriminative pose sub-patterns for effective action classification. These pose sub-patterns are extracted from a predefined set of 3D poses represented by hierarchical motion angles. The basic idea is motivated by the two observations: (1) There exist representative sub-patterns in each action class, from which the action class can be easily differentiated. (2) These sub-patterns frequently appear in the action class. By constructing a connection between frequent sub-patterns and the discriminative measure, we develop the SSPI, namely, the Support Sub-Pattern Induced learning algorithm for simultaneous feature selection and feature learning. Based on the algorithm, discriminative pose sub-patterns can be identified and used as a series of \"magnetic centers\" on the surface of normalized super-sphere for feature transform. The \"attractive forces\" from the sub-patterns determine the direction and step-length of the transform. This transformation makes a feature more discriminative while maintaining dimensionality invariance. Comprehensive experimental studies conducted on a large scale motion capture dataset demonstrate the effectiveness of the proposed approach for action classification and the superior performance over the state-of-the-art techniques.", "citation": "Citations (8)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Northeastern University"], "authors": ["Xu Zhao.....http://dblp.org/pers/hd/z/Zhao:Xu", "Yuncai Liu.....http://dblp.org/pers/hd/l/Liu:Yuncai", "Yun Fu.....http://dblp.org/pers/hd/f/Fu_0001:Yun"], "conf": "mm", "year": "2013", "pages": 10}