{"title": "Recent developments in openSMILE, the munich open-source multimedia feature extractor.", "fields": ["voice activity detection", "face detection", "component based software engineering", "local binary patterns", "batch processing"], "abstract": "We present recent developments in the openSMILE feature extraction toolkit. Version 2.0 now unites feature extraction paradigms from speech, music, and general sound events with basic video features for multi-modal processing. Descriptors from audio and video can be processed jointly in a single framework allowing for time synchronization of parameters, on-line incremental processing as well as off-line and batch processing, and the extraction of statistical functionals (feature summaries), such as moments, peaks, regression parameters, etc. Postprocessing of the features includes statistical classifiers such as support vector machine models or file export for popular toolkits such as Weka or HTK. Available low-level descriptors include popular speech, music and video features including Mel-frequency and similar cepstral and spectral coefficients, Chroma, CENS, auditory model based loudness, voice quality, local binary pattern, color, and optical flow histograms. Besides, voice activity detection, pitch tracking and face detection are supported. openSMILE is implemented in C++, using standard open source libraries for on-line audio and video input. It is fast, runs on Unix and Windows platforms, and has a modular, component based architecture which makes extensions via plug-ins easy. openSMILE 2.0 is distributed under a research license and can be downloaded from http://opensmile.sourceforge.net/.", "citation": "Citations (490)", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "Technische Universität München"], "authors": ["Florian Eyben.....http://dblp.org/pers/hd/e/Eyben:Florian", "Felix Weninger.....http://dblp.org/pers/hd/w/Weninger:Felix", "Florian Groß.....http://dblp.org/pers/hd/g/Gro=szlig=:Florian", "Björn W. Schuller.....http://dblp.org/pers/hd/s/Schuller:Bj=ouml=rn_W="], "conf": "mm", "year": "2013", "pages": 4}