{"title": "Destination prediction by sub-trajectory synthesis and privacy protection against such prediction.", "fields": ["trajectory", "targeted advertising", "machine learning", "adversary", "order of magnitude"], "abstract": "Destination prediction is an essential task for many emerging location based applications such as recommending sightseeing places and targeted advertising based on destination. A common approach to destination prediction is to derive the probability of a location being the destination based on historical trajectories. However, existing techniques using this approach suffer from the “data sparsity problem”, i.e., the available historical trajectories is far from being able to cover all possible trajectories. This problem considerably limits the number of query trajectories that can obtain predicted destinations. We propose a novel method named Sub-Trajectory Synthesis (SubSyn) algorithm to address the data sparsity problem. SubSyn algorithm first decomposes historical trajectories into sub-trajectories comprising two neighbouring locations, and then connects the sub-trajectories into “synthesised” trajectories. The number of query trajectories that can have predicted destinations is exponentially increased by this means. Experiments based on real datasets show that SubSyn algorithm can predict destinations for up to ten times more query trajectories than a baseline algorithm while the SubSyn prediction algorithm runs over two orders of magnitude faster than the baseline algorithm. In this paper, we also consider the privacy protection issue in case an adversary uses SubSyn algorithm to derive sensitive location information of users. We propose an efficient algorithm to select a minimum number of locations a user has to hide on her trajectory in order to avoid privacy leak. Experiments also validate the high efficiency of the privacy protection algorithm.", "citation": "Citations (194)", "departments": ["University of Melbourne", "University of Melbourne", "Microsoft", "Microsoft", "University of Melbourne"], "authors": ["Andy Yuan Xue.....http://dblp.org/pers/hd/x/Xue:Andy_Yuan", "Rui Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Rui", "Yu Zheng.....http://dblp.org/pers/hd/z/Zheng_0004:Yu", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Jin Huang.....http://dblp.org/pers/hd/h/Huang_0003:Jin", "Zhenghua Xu.....http://dblp.org/pers/hd/x/Xu:Zhenghua"], "conf": "icde", "year": "2013", "pages": 12}