{"title": "On arbitrating the power-performance tradeoff in SaaS clouds.", "fields": ["virtual machine", "lyapunov optimization", "software as a service", "admission control", "power budget"], "abstract": "In this paper, we present an analytical framework for characterizing and optimizing the power-performance tradeoff in Software-as-a-Service (SaaS) cloud platforms. Our objectives are two-fold: (1) We maximize the operating profit when serving heterogeneous SaaS applications with unpredictable user requests, and (2) we minimize the power consumption when processing user requests. To achieve these objectives, we take advantage of Lyapunov Optimization techniques to design and analyze an optimal control framework to make online decisions on request admission control, routing, and virtual machine (VMs) scheduling. In particular, our control framework can be flexibly extended to incorporate various design choices and practical requirements of a data-center in the cloud, such as enforcing a certain power budget for improving the performance (dollar) per watt. Our mathematical analyses and simulations have demonstrated both the optimality (in terms of a cost-effective power-performance tradeoff) and system stability (in terms of robustness and adaptivity to time-varying and bursty user requests) achieved by our proposed control framework.", "citation": "Citations (84)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Toronto", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Toronto"], "authors": ["Zhi Zhou.....http://dblp.org/pers/hd/z/Zhou:Zhi", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Hongbo Jiang.....http://dblp.org/pers/hd/j/Jiang:Hongbo"], "conf": "infocom", "year": "2013", "pages": 9}