{"title": "Big data integration.", "fields": ["semantic data model", "linked data", "nosql", "record linkage", "raw data", "low latency", "wearable computer", "virtualization", "enterprise data management", "ontology based data integration", "data system", "query by example", "artifact centric business process model", "internet of things", "web analytics", "big data", "cognitive computing", "open research", "enterprise integration", "semantic interoperability", "software deployment", "schema", "stateful firewall", "business analytics", "sql", "stack", "sensor fusion", "analytics", "middleware", "idef1x", "data access", "cloud computing security", "data integration"], "abstract": "The Big Data era is upon us: data is being generated, collected and analyzed at an unprecedented scale, and data-driven decision making is sweeping through all aspects of society. Since the value of data explodes when it can be linked and fused with other data, addressing the big data integration (BDI) challenge is critical to realizing the promise of Big Data. BDI differs from traditional data integration in many dimensions: (i) the number of data sources, even for a single domain, has grown to be in the tens of thousands, (ii) many of the data sources are very dynamic, as a huge amount of newly collected data are continuously made available, (iii) the data sources are extremely heterogeneous in their structure, with considerable variety even for substantially similar entities, and (iv) the data sources are of widely differing qualities, with significant differences in the coverage, accuracy and timeliness of data provided. This seminar explores the progress that has been made by the data integration community on the topics of schema mapping, record linkage and data fusion in addressing these novel challenges faced by big data integration, and identifies a range of open problems for the community.", "citation": "Citations (304)", "departments": ["AT&T Labs", "AT&T Labs", "University of Málaga", "University of Málaga", "University of Málaga", "University of British Columbia", "IBM", "Imperial College London", "LinkedIn", "University of Birmingham"], "authors": ["Xin Luna Dong.....http://dblp.org/pers/hd/d/Dong:Xin_Luna", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh"], "conf": "icde", "year": "2013", "pages": 4}