{"title": "Maintaining Alternative Values in Constraint-Based Configuration.", "fields": ["worst case complexity", "constraint satisfaction problem", "decision problem", "constraint programming", "local consistency", "mathematical optimization", "constraint logic programming"], "abstract": "Constraint programming techniques are widely used to model and solve interactive decision problems, an especially configuration problems. In this type of application, the configurable product is described by means of a set of constraint bearing on the configuration variables. The user then interactively solves the CSP by assigning (and possibly, relaxing) the configuration variables according to her preferences. The aim of the system is then to keep the domains of the other variables consistent with these choices. Since maintaining of the global inverse consistency is generally not tractable, the domains are instead filtered according to some level of local consistency, e.g. arc-consistency.\n\nIn the present work, we aim at offering a more convenient interaction by providing the user with possible alternative values for each of the already assigned variables - i.e. the values that could replace the current one without leading to the violation of some constraint. We thus present the new concept of alternative domains in a (possibly) partially assigned CSP. We propose a propagation algorithm that computes all the alternative domains in a single step. Its worst case complexity is comparable with the one of the naive algorithm that would run a full propagation for each variable, but its experimental efficiency is much better.", "citation": "Not cited", "year": "2013", "departments": ["University of Toulouse", "University of Toulouse", "IRIT, Universit ... se III, France", "IRIT, Universit ... se III, France"], "conf": "ijcai", "authors": ["Caroline Becker.....http://dblp.org/pers/hd/b/Becker:Caroline", "Hélène Fargier.....http://dblp.org/pers/hd/f/Fargier:H=eacute=l=egrave=ne"], "pages": 7}