{"title": "Road network mix-zones for anonymous location based services.", "fields": ["cloaking", "location based service", "mobile computing", "information privacy", "data visualization"], "abstract": "We present MobiMix, a road network based mix-zone framework to protect location privacy of mobile users traveling on road networks. An alternative and complementary approach to spatial cloaking based location privacy protection is to break the continuity of location exposure by introducing techniques, such as mix-zones, where no applications can trace user movements. However, existing mixzone proposals fail to provide effective mix-zone construction and placement algorithms that are resilient to timing and transition attacks. In MobiMix, mix-zones are constructed and placed by carefully taking into consideration of multiple factors, such as the geometry of the zones, the statistical behavior of the user population, the spatial constraints on movement patterns of the users, and the temporal and spatial resolution of the location exposure. In this demonstration, we first introduce a visualization of the location privacy risks of mobile users traveling on road networks and show how mixzone based anonymization breaks the continuity of location exposure to protect user location privacy. We demonstrate a suite of road network mix-zone construction and placement methods that provide higher level of resilience to timing and transition attacks on road networks. We show the effectiveness of the MobiMix approach through detailed visualization using traces produced by GTMobiSim on different scales of geographic maps.", "citation": "Citations (7)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Balaji Palanisamy.....http://dblp.org/pers/hd/p/Palanisamy:Balaji", "Sindhuja Ravichandran.....http://dblp.org/pers/hd/r/Ravichandran:Sindhuja", "Ling Liu.....http://dblp.org/pers/hd/l/Liu_0001:Ling", "Binh Han.....http://dblp.org/pers/hd/h/Han:Binh", "Kisung Lee.....http://dblp.org/pers/hd/l/Lee:Kisung", "Calton Pu.....http://dblp.org/pers/hd/p/Pu:Calton"], "conf": "icde", "year": "2013", "pages": 4}