{"title": "Optimal budget deployment strategy against power grid interdiction.", "fields": ["power system protection", "correctness", "software deployment", "interdiction", "grid"], "abstract": "Power network is one of the most critical infrastructures in a nation and is always a target of attackers. Recently, many schemes are proposed to protect the security of power systems. However, most of existing works did not consider the component attacking cost and ignored the relationship between the budget deployed on the component and its attacking cost. To address this problem, in this paper we introduce the concept of budget-cost function, which describes the dynamic characteristics of component attacking cost, and propose a new model to protect power grid against intentional attacks. In our model, the attackers have limited attacking capacity and aim to maximize the damage of attacks. On the other hand, the defenders aim to find the optimal strategy of the budget deployment to limit the damage to an expected level. We formulate the above problem as a nonlinear optimization problem and solve it by employing the primal-dual interior-point method. To the author's best knowledge, this is the first work which analyzes the optimal budget deployment strategy based on budget-cost function. Simulations on the IEEE 5-bus system demonstrate the correctness and effectiveness of the proposed model and algorithms. The results provide a basis of budget investment for power systems.", "citation": "Citations (11)", "departments": ["Illinois Institute of Technology", "University at Buffalo", "Illinois Institute of Technology", "Illinois Institute of Technology", "Wuhan University"], "authors": ["Xuan Liu.....http://dblp.org/pers/hd/l/Liu_0003:Xuan", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Yanling Yuan.....http://dblp.org/pers/hd/y/Yuan:Yanling", "Zuyi Li.....http://dblp.org/pers/hd/l/Li:Zuyi", "Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian"], "conf": "infocom", "year": "2013", "pages": 9}