{"title": "PASSAGES: Preserving Anonymity of Sources and Sinks against Global Eavesdroppers.", "fields": ["computer network", "overhead", "small number", "sink", "anonymity"], "abstract": "While many security schemes protect the content of messages in the Distributed Sensing Systems (DSS), the contextual information, such as communication patterns, is left vulnerable and can be utilized by attackers to identify critical information such as the locations of event sources and message sinks. Existing solutions for location anonymity are mostly designed to protect source or sink location anonymity individually against limited eavesdroppers on a small region at a time. However, they can be easily defeated by highly motivated global eavesdroppers that can monitor entire communication events on the DSS. To grapple with these challenges, we propose a mechanism for Preserving Anonymity of Sources and Sinks against Global Eavesdroppers (PASSAGES). PASSAGES uses a small number of stealthy permeability tunnels such as wormholes and message ferries to scatter and hide the communication patterns. Unlike prior schemes, PASSAGES effectively achieves a high anonymity level for both source and sink locations, without incurring extra communication overheads. We quantify the location anonymity level and evaluate the effectiveness of PASSAGES via analysis as well as extensive simulations. We also perform evaluations on the synergistic effect when PASSAGES is combined with other traditional solutions.", "citation": "Citations (7)", "departments": ["University of Missouri–Kansas City", "Texas A&M University", "University of Missouri–Kansas City", "University of South Carolina"], "authors": ["Hyungbae Park.....http://dblp.org/pers/hd/p/Park:Hyungbae", "Sejun Song.....http://dblp.org/pers/hd/s/Song:Sejun", "Baek-Young Choi.....http://dblp.org/pers/hd/c/Choi:Baek=Young", "Chin-Tser Huang.....http://dblp.org/pers/hd/h/Huang:Chin=Tser"], "conf": "infocom", "year": "2013", "pages": 5}