{"title": "An efficient image homomorphic encryption scheme with small ciphertext expansion.", "fields": ["ciphertext indistinguishability", "ciphertext expansion", "plaintext aware encryption", "filesystem level encryption", "deterministic encryption"], "abstract": "The field of image processing in the encrypted domain has been given increasing attention for the extensive potential applications, for example, providing efficient and secure solutions for privacy-preserving applications in untrusted environment. One obstacle to the widespread use of these techniques is the ciphertext expansion of high orders of magnitude caused by the existing homomorphic encryptions. In this paper, we provide a way to tackle this issue for image processing in the encrypted domain. By using characteristics of image format, we develop an image encryption scheme to limit ciphertext expansion while preserving the homomorphic property. The proposed encryption scheme first encrypts image pixels with an existing probabilistic homomorphic cryptosystem, and then compresses the whole encrypted image in order to save storage space. Our scheme has a much smaller ciphertext expansion factor compared with the element-wise encryption scheme, while preserving the homomorphic property. It is not necessary to require additional interactive protocols when applying secure signal processing tools to the compressed encrypted image. We present a fast algorithm for the encryption and the compression of the proposed image encryption scheme, which speeds up the computation and makes our scheme much more efficient. The analysis on the security, ciphertext expansion ratio, and computational complexity are also conducted. Our experiments demonstrate the validity of the proposed algorithms. The proposed scheme is suitable to be employed as an image encryption method for the applications in secure image processing.", "citation": "Citations (12)", "departments": ["Sun Yat-sen University", "Sun Yat-sen University"], "authors": ["Peijia Zheng.....http://dblp.org/pers/hd/z/Zheng:Peijia", "Jiwu Huang.....http://dblp.org/pers/hd/h/Huang:Jiwu"], "conf": "mm", "year": "2013", "pages": 10}