{"title": "Reducing information gathering latency through Mobile Aerial Sensor Network.", "fields": ["mobile wireless sensor network", "latency", "traverse", "key distribution in wireless sensor networks", "sink"], "abstract": "Gathering information in a sensing field of interest is a fundamental task in wireless sensor networks. Current methods either use multihop forwarding to the sink via stationary nodes or use mobile sinks to traverse the sensing field. The multihop forwarding method intrinsically has the energy hole problem and the mobile sinks method has a large gathering latency due to its low mobility velocity. In addition, all the mobile sinks methods assume unlimited power supply and memory which is unrealistic in practice. In this paper, we propose a new approach for information gathering through a Mobile Aerial Sensor Network (MASN). We adopt the Hive-Drone model [5] where a centralized station (Hive) responsible for serving and recharging Micro-Aerial Vehicle (MAV) sensor nodes (Drones) is strategically placed in the sensing field. We then face the challenges of how to control the mobility of each MAV and devising interference-free scheduling for wireless transmissions that can substantially reduce the latency. We present a family of algorithms with constant memory to reduce both gathering latency, which is the duration from dispatching the MAVs to the moment when all the sensed information are gathered at the central station, and information latency, which is the duration from when some information is sensed to when it is received by the station. We also consider how to extend the single Hive to multiple Hives for monitoring an arbitrarily large area. Extensive simulation results corroborate our theoretical analysis.", "citation": "Citations (9)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Hong Kong"], "authors": ["Zhaoquan Gu.....http://dblp.org/pers/hd/g/Gu:Zhaoquan", "Qiang-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Qiang=Sheng", "Yuexuan Wang.....http://dblp.org/pers/hd/w/Wang:Yuexuan", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2013", "pages": 9}