{"title": "An Agent Model for the Appraisal of Normative Events Based in In-Group and Out-Group Relations.", "fields": ["valuation", "normative", "ingroups and outgroups", "norm", "shame"], "abstract": "Emotional synthetic characters are able to evaluate (appraise) events as positive or negative with their emotional states being triggered by several factors. Currently, the vast majority of models for appraisal in synthetic characters consider factors related to the goals and preferences of the characters. We argue that appraisals that only take into consideration these \"personal\" factors are incomplete as other more social factors, such as the normative and the social context, including in-group and out-group relations, should be considered as well. Without them, moral emotions such as shame cannot be appraised, limiting the believability of the characters in certain situations. We present a model for the appraisal of characters' actions that evaluates whether actions by in-group and out-group members which conform, or not, to social norms generate different emotions depending on the social relations between the characters. The model was then implemented in an architecture for virtual agents and evaluated with humans. Results suggest that the emotions generated by our model are perceived by the participants, taking into account the social context and that participants experienced very similar emotions, both in type and intensity, to the emotions appraised and generated by the characters.", "citation": "Citations (7)", "departments": ["INESC-ID", "INESC-ID", "INESC-ID", "Utrecht University", "Utrecht University"], "authors": ["Nuno Ferreira.....http://dblp.org/pers/hd/f/Ferreira:Nuno", "Samuel Mascarenhas.....http://dblp.org/pers/hd/m/Mascarenhas:Samuel", "Ana Paiva.....http://dblp.org/pers/hd/p/Paiva:Ana", "Gennaro di Tosto.....http://dblp.org/pers/hd/t/Tosto:Gennaro_di", "Frank Dignum.....http://dblp.org/pers/hd/d/Dignum:Frank", "John McBreen.....http://dblp.org/pers/hd/m/McBreen:John", "Nick Degens.....http://dblp.org/pers/hd/d/Degens:Nick", "Gert Jan Hofstede.....http://dblp.org/pers/hd/h/Hofstede:Gert_Jan", "Giulia Andrighetto.....http://dblp.org/pers/hd/a/Andrighetto:Giulia", "Rosaria Conte.....http://dblp.org/pers/hd/c/Conte:Rosaria"], "conf": "aaai", "year": "2013", "pages": -1}