{"title": "The complexity of finite-valued CSPs.", "fields": ["complexity of constraint satisfaction", "discrete optimization", "linear programming relaxation", "core language", "idempotence", "hyperplane", "binary number", "constraint satisfaction problem", "unary operation"], "abstract": "Let Γ be a set of rational-valued functions on a fixed finite domain; such a set is called a  finite-valued constraint language . The valued constraint satisfaction problem, VCSP(Γ), is the problem of minimising a function given as a sum of functions from Γ. We establish a dichotomy theorem with respect to exact solvability for  all  finite-valued languages defined on domains of  arbitrary  finite size.   We show that every  core  language Γ either admits a binary idempotent and symmetric fractional polymorphism in which case the basic linear programming relaxation solves any instance of VCSP(Γ) exactly, or Γ satisfies a simple hardness condition that allows for a polynomial-time reduction from Max-Cut to VCSP(Γ). In other words, there is a single algorithm for all tractable cases and a single reason for intractability. Our results show that for exact solvability of VCSPs the basic linear programming relaxation suffices and semidefinite relaxations do not add any power.   Our results generalise  all previous partial classifications  of finite-valued languages: the classification of {0,1}-valued languages containing all unary functions obtained by Deineko et al. [JACM'06]; the classifications of {0,1}-valued languages on two-element, three-element, and four-element domains obtained by Creignou [JCSS'95], Jonsson et al. [SICOMP'06], and Jonsson et al.[CP'11], respectively; the classifications of finite-valued languages on two-element and three-element domains obtained by Cohen et al. [AIJ'06] and Huber et al. [SODA'13], respectively; the classification of finite-valued languages containing all {0,1}-valued unary functions obtained by Kolmogorov and Zivny [JACM'13]; and the classification of Min-0-Ext problems obtained by Hirai [SODA'13].", "citation": "Not cited", "year": "2013", "departments": ["University of Paris-Sud", "University of Warwick", "University of Paris", "University of Oxford"], "conf": "stoc", "authors": ["Johan Thapper.....http://dblp.org/pers/hd/t/Thapper:Johan", "Stanislav Zivny.....http://dblp.org/pers/hd/z/Zivny:Stanislav"], "pages": 10}