{"title": "CorLayer: a transparent link correlation layer for energy efficient broadcast.", "fields": ["phenomenon", "broadcast radiation", "broadcast domain", "multimedia broadcast multicast service", "linear network coding", "atomic broadcast"], "abstract": "Wireless communication essentially occurs in a broadcast medium with concurrent receptions. Recent works [34, 41] have shown clear evidence that wireless links are not independent and that transmissions from a transmitter to multiple receivers are correlated, a phenomenon that has profound implications for the performance of network protocols such as broadcast, multi-cast, opportunistic forwarding and network coding. In this paper, we show how link correlation can significantly impact broadcast. We present the design and implementation of CorLayer, a general supporting layer for energy efficient reliable broadcast that carefully blacklists certain poorly correlated wireless links. This method uses only one-hop information, which makes it work in a fully distributed manner and introduces minimal communication overhead. The highlight of our work is CorLayer's broad applicability and effectiveness. Our system effort is indeed significant. We integrate CorLayer transparently with sixteen state-of-the-art broadcast protocols specified in thirteen publications [1, 3, 18, 19, 23, 25--27, 32, 36, 38--40] on three physical testbeds running TelosB, MICAz, and GreenOrbs nodes, respectively. The experimental results show that CorLayer remarkably improves energy efficiency across a wide spectrum of broadcast protocols and that the total number of packet transmissions can be reduced consistently by 47% on average.", "citation": "Citations (29)", "departments": ["University of Minnesota", "University of Minnesota", "Chinese Ministry of Public Security", "Chinese Academy of Sciences", "University of Minnesota", "University of Minnesota", "University of Minnesota", "Chinese Ministry of Public Security", "Chinese Academy of Sciences", "University of Minnesota"], "authors": ["Shuai Wang.....http://dblp.org/pers/hd/w/Wang_0008:Shuai", "Song Min Kim.....http://dblp.org/pers/hd/k/Kim:Song_Min", "Yunhuai Liu.....http://dblp.org/pers/hd/l/Liu:Yunhuai", "Guang Tan.....http://dblp.org/pers/hd/t/Tan:Guang", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "mobicom", "year": "2013", "pages": 12}