{"title": "A peta-scalable CPU-GPU algorithm for global atmospheric simulations.", "fields": ["hybrid system", "multithreading", "multi core processor", "hybrid algorithm", "scalability"], "abstract": "Developing highly scalable algorithms for global atmospheric modeling is becoming increasingly important as scientists inquire to understand behaviors of the global atmosphere at extreme scales. Nowadays, heterogeneous architecture based on both processors and accelerators is becoming an important solution for large-scale computing. However, large-scale simulation of the global atmosphere brings a severe challenge to the development of highly scalable algorithms that fit well into state-of-the-art heterogeneous systems. Although successes have been made on GPU-accelerated computing in some top-level applications, studies on fully exploiting heterogeneous architectures in global atmospheric modeling are still very less to be seen, due in large part to both the computational difficulties of the mathematical models and the requirement of high accuracy for long term simulations.   In this paper, we propose a peta-scalable hybrid algorithm that is successfully applied in a cubed-sphere shallow-water model in global atmospheric simulations. We employ an adjustable partition between CPUs and GPUs to achieve a balanced utilization of the entire hybrid system, and present a pipe-flow scheme to conduct conflict-free inter-node communication on the cubed-sphere geometry and to maximize communication-computation overlap. Systematic optimizations for multithreading on both GPU and CPU sides are performed to enhance computing throughput and improve memory efficiency. Our experiments demonstrate nearly ideal strong and weak scalabilities on up to 3,750 nodes of the Tianhe-1A. The largest run sustains a performance of 0.8 Pflops in double precision (32% of the peak performance), using 45,000 CPU cores and 3,750 GPUs.", "citation": "Citations (36)", "year": "2013", "departments": ["Chinese Academy of Sciences", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "conf": "ppopp", "authors": ["Chao Yang.....http://dblp.org/pers/hd/y/Yang_0002:Chao", "Wei Xue.....http://dblp.org/pers/hd/x/Xue:Wei", "Haohuan Fu.....http://dblp.org/pers/hd/f/Fu:Haohuan", "Lin Gan.....http://dblp.org/pers/hd/g/Gan:Lin", "Linfeng Li.....http://dblp.org/pers/hd/l/Li:Linfeng", "Yangtong Xu.....http://dblp.org/pers/hd/x/Xu:Yangtong", "Yutong Lu.....http://dblp.org/pers/hd/l/Lu:Yutong", "Jiachang Sun.....http://dblp.org/pers/hd/s/Sun:Jiachang", "Guangwen Yang.....http://dblp.org/pers/hd/y/Yang:Guangwen", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin"], "pages": 12}