{"title": "Creating secrets out of erasures.", "fields": ["shared secret", "adversary model", "adversary", "linear network coding", "secrecy"], "abstract": "Current security systems often rely on the adversary's computational limitations. Wireless networks offer the opportunity for a different, complementary kind of security, which relies on the adversary's limited network presence (i.e., that the adversary cannot be located at many different points in the network at the same time). We present a system that leverages this opportunity to enable n wireless nodes to create a shared secret S, in a way that an eavesdropper, Eve, obtains very little information on S. Our system consists of two steps: (1) The nodes transmit packets following a special pattern, such that Eve learns very little about a given fraction of the transmitted packets. This is achieved through a combination of beam forming (from many different sources) and wiretap codes. (2) The nodes participate in a protocol that reshuffles the information known to each node, such that the nodes end up sharing a secret that Eve knows very little about. Our protocol is easily implementable in existing wireless devices and scales well with the number of nodes; these properties are achieved through a combination of public feedback, broadcasting, and network coding. We evaluate our system through a 5-node testbed. We demonstrate that a group of wireless nodes can generate thousands of new shared secret bits per second, with their secrecy being independent of the adversary's computational capabilities.", "citation": "Citations (13)", "departments": ["École Polytechnique Fédérale de Lausanne", "University of California, Los Angeles", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Katerina J. Argyraki.....http://dblp.org/pers/hd/a/Argyraki:Katerina_J=", "Suhas N. Diggavi.....http://dblp.org/pers/hd/d/Diggavi:Suhas_N=", "Melissa Duarte.....http://dblp.org/pers/hd/d/Duarte:Melissa", "Christina Fragouli.....http://dblp.org/pers/hd/f/Fragouli:Christina", "Marios Gatzianas.....http://dblp.org/pers/hd/g/Gatzianas:Marios", "Panagiotis Kostopoulos.....http://dblp.org/pers/hd/k/Kostopoulos:Panagiotis"], "conf": "mobicom", "year": "2013", "pages": 12}