{"title": "Voronoi-based nearest neighbor search for multi-dimensional uncertain databases.", "fields": ["r tree", "nearest neighbor chain algorithm", "best bin first", "nearest neighbor graph", "nearest neighbor search"], "abstract": "In Voronoi-based nearest neighbor search, the Voronoi cell of every point p in a database can be used to check whether p is the closest to some query point q. We extend the notion of Voronoi cells to support uncertain objects, whose attribute values are inexact. Particularly, we propose the Possible Voronoi cell (or PV-cell). A PV-cell of a multi-dimensional uncertain object o is a region R, such that for any point pϵR, o may be the nearest neighbor of p. If the PV-cells of all objects in a database S are known, they can be used to identify objects that have a chance to be the nearest neighbor of q. However, there is no efficient algorithm for computing an exact PV-cell. We hence study how to derive an axis-parallel hyper-rectangle (called the Uncertain Bounding Rectangle, or UBR) that tightly contains a PV-cell. We further develop the PV-index, a structure that stores UBRs, to evaluate probabilistic nearest neighbor queries over uncertain data. An advantage of the PV-index is that upon updates on S, it can be incrementally updated. Extensive experiments on both synthetic and real datasets are carried out to validate the performance of the PV-index.", "citation": "Citations (23)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich"], "authors": ["Peiwu Zhang.....http://dblp.org/pers/hd/z/Zhang:Peiwu", "Reynold Cheng.....http://dblp.org/pers/hd/c/Cheng:Reynold", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos", "Matthias Renz.....http://dblp.org/pers/hd/r/Renz:Matthias", "Andreas Züfle.....http://dblp.org/pers/hd/z/Z=uuml=fle:Andreas", "Yu Tang.....http://dblp.org/pers/hd/t/Tang:Yu", "Tobias Emrich.....http://dblp.org/pers/hd/e/Emrich:Tobias"], "conf": "icde", "year": "2013", "pages": 12}