{"title": "To offload or not to offload? The bandwidth and energy costs of mobile cloud computing.", "fields": ["mobile web", "computation offloading", "mobile cloud computing", "cloud testing", "mobile search"], "abstract": "The cloud seems to be an excellent companion of mobile systems, to alleviate battery consumption on smartphones and to backup user's data on-the-fly. Indeed, many recent works focus on frameworks that enable mobile computation offloading to software clones of smartphones on the cloud and on designing cloud-based backup systems for the data stored in our devices. Both mobile computation offloading and data backup involve communication between the real devices and the cloud. This communication does certainly not come for free. It costs in terms of bandwidth (the traffic overhead to communicate with the cloud) and in terms of energy (computation and use of network interfaces on the device). In this work we study the fmobile software/data backupseasibility of both mobile computation offloading and mobile software/data backups in real-life scenarios. In our study we assume an architecture where each real device is associated to a software clone on the cloud. We consider two types of clones: The off-clone, whose purpose is to support computation offloading, and the back-clone, which comes to use when a restore of user's data and apps is needed. We give a precise evaluation of the feasibility and costs of both off-clones and back-clones in terms of bandwidth and energy consumption on the real device. We achieve this through measurements done on a real testbed of 11 Android smartphones and an equal number of software clones running on the Amazon EC2 public cloud. The smartphones have been used as the primary mobile by the participants for the whole experiment duration.", "citation": "Citations (257)", "departments": ["Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome"], "authors": ["Marco Valerio Barbera.....http://dblp.org/pers/hd/b/Barbera:Marco_Valerio", "Sokol Kosta.....http://dblp.org/pers/hd/k/Kosta:Sokol", "Alessandro Mei.....http://dblp.org/pers/hd/m/Mei:Alessandro", "Julinda Stefa.....http://dblp.org/pers/hd/s/Stefa:Julinda"], "conf": "infocom", "year": "2013", "pages": 9}