{"title": "Optimizing the collection of local decisions for time-constrained distributed detection in WSNs.", "fields": ["throughput", "sensor fusion", "random access", "random access channel", "key distribution in wireless sensor networks"], "abstract": "We consider a distributed detection application for a fusion center that has a limited time to make a global decision by collecting, weighting, and fusing local decisions made by nodes in a wireless sensor network that uses a random access channel. When this time is not long enough to collect decisions from all nodes in the network, a strategy is needed for collecting those with the highest reliability. This is accomplished with an easily implemented modification of the random access protocol: the collection time is divided into frames and only nodes with a particular range of reliabilities compete for the channel within each frame. Nodes with the most reliable decisions attempt transmission in the first frame; nodes with the next most reliable set of decisions attempt in the next frame; etc. We formulate an optimization problem that determines the reliability interval that defines who attempts in each frame in order to minimize the Detection Error Probability (DEP) at the fusion center. When the noise distribution affecting nodes' local decisions is continuous, symmetric, unimodal, and has a monotone likelihood ratio, reliability thresholds that maximize the channel throughput in each frame are optimal when the ratio of the collection time to the number of nodes is small. The number of frames that should be used depends on whether the average reliability or the worst-case reliability of local decisions in each frame is used to determine the DEP.", "citation": "Citations (10)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Seksan Laitrakun.....http://dblp.org/pers/hd/l/Laitrakun:Seksan", "Edward J. Coyle.....http://dblp.org/pers/hd/c/Coyle:Edward_J="], "conf": "infocom", "year": "2013", "pages": 9}