{"title": "Resolution and Parallelizability: Barriers to the Efficient Parallelization of SAT Solvers.", "fields": ["job shop scheduling", "mathematical proof", "combinatorial search", "proof complexity", "bounded function"], "abstract": "Recent attempts to create versions of Satisfiability (SAT) solvers that exploit parallel hardware and information sharing have met with limited success. In fact, the most successful parallel solvers in recent competitions were based on portfolio approaches with little to no exchange of information between processors. This experience contradicts the apparent parallelizability of exploring a combinatorial search space. We present evidence that this discrepancy can be explained by studying SAT solvers through a proof complexity lens, as resolution refutation engines. Starting with the observation that a recently studied measure of resolution proofs, namely depth, provides a (weak) upper bound to the best possible speedup achievable by such solvers, we empirically show the existence of bottlenecks to parallelizability that resolution proofs typically generated by SAT solvers exhibit. Further, we propose a new measure of parallelizability based on the best-case makespan of an offline resource constrained scheduling problem. This measure explicitly accounts for a bounded number of parallel processors and appears to empirically correlate with parallel speedups observed in practice. Our findings suggest that efficient parallelization of SAT solvers is not simply a matter of designing the right clause sharing heuristics; even in the best case, it can be -- and indeed is -- hindered by the structure of the resolution proofs current SAT solvers typically produce.", "citation": "Citations (15)", "departments": ["Institut national de la recherche agronomique", "IBM", "IBM", "Centre national de la recherche scientifique"], "authors": ["George Katsirelos.....http://dblp.org/pers/hd/k/Katsirelos:George", "Ashish Sabharwal.....http://dblp.org/pers/hd/s/Sabharwal:Ashish", "Horst Samulowitz.....http://dblp.org/pers/hd/s/Samulowitz:Horst", "Laurent Simon.....http://dblp.org/pers/hd/s/Simon:Laurent"], "conf": "aaai", "year": "2013", "pages": -1}