{"title": "Decentralizing network inference problems with Multiple-Description Fusion Estimation (MDFE).", "fields": ["inference", "matrix completion", "adaptive neuro fuzzy inference system", "speedup", "computation", "underdetermined system", "network topology"], "abstract": "Network inference (or tomography) problems, such as traffic matrix estimation or completion and link loss inference, have been studied rigorously in different networking applications. These problems are often posed as under-determined linear inverse (UDLI) problems and solved in a centralized manner, where all the measurements are collected at a central node, which then applies a variety of inference techniques to estimate the attributes of interest. This paper proposes a novel framework for decentralizing these large-scale under-determined network inference problems by intelligently partitioning it into smaller subproblems and solving them independently and in parallel. The resulting estimates, referred to as multiple descriptions, can then be fused together to compute the global estimate. We apply this Multiple Description and Fusion Estimation (MDFE) framework to three classical problems: traffic matrix estimation, traffic matrix completion, and loss inference. Using real topologies and traces, we demonstrate how MDFE can speed up computation while maintaining (even improving) the estimation accuracy and how it enhances robustness against noise and failures. We also show that our MDFE framework is compatible with a variety of existing inference techniques used to solve the UDLI problems.", "citation": "Citations (6)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "Hewlett-Packard", "University of California, Davis", "University of California, Davis", "University of California, Davis", "Hewlett-Packard"], "authors": ["Mehdi Malboubi.....http://dblp.org/pers/hd/m/Malboubi:Mehdi", "Cuong Vu.....http://dblp.org/pers/hd/v/Vu:Cuong", "Chen-Nee Chuah.....http://dblp.org/pers/hd/c/Chuah:Chen=Nee", "Puneet Sharma.....http://dblp.org/pers/hd/s/Sharma:Puneet"], "conf": "infocom", "year": "2013", "pages": 9}