{"title": "CEDAR: An optimal and distributed strategy for packet recovery in wireless networks.", "fields": ["network packet", "latency", "store and forward", "fast packet switching", "transmission delay"], "abstract": "Underlying link-layer protocols of wireless networks use the conventional “store and forward” design paradigm cannot provide highly sustainable reliability and stability in wireless communication, which introduce significant barriers and setbacks in scalability and deployments of wireless networks. In this paper, we propose a Code Embedded Distributed Adaptive and Reliable (CEDAR) link-layer framework that targets low latency and high throughput. CEDAR is the first comprehensive theoretical framework for analyzing and designing distributed and adaptive error recovery for wireless networks. It employs a theoretically-sound framework for embedding channel codes in each packet and performs the error correcting process in selected intermediate nodes in packet's route. To identify the intermediate nodes for the en/decoding for minimizing average packet latency, we mathematically analyze the average packet delay, using Finite State Markovian Channel model and priority queuing model, and then formalize the problem as a non-linear integer programming problem. Also, we propose a scalable and distributed scheme to solve this problem. The results from real-world testbed “NESTbed” and simulation with Matlab prove that CEDAR is superior to the schemes using hop-by-hop decoding and destination-decoding not only in packet delay but also in throughput. In addition, the simulation results show that CEDAR can achieve the optimal performance in most cases.", "citation": "Citations (1)", "departments": ["Clemson University", "Clemson University", "Clemson University", "Clemson University", "Intell. Autom.  ... kville, MD, USA"], "authors": ["Chenxi Qiu.....http://dblp.org/pers/hd/q/Qiu:Chenxi", "Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Sohraab Soltani.....http://dblp.org/pers/hd/s/Soltani:Sohraab", "Karan Sapra.....http://dblp.org/pers/hd/s/Sapra:Karan", "Hao Jiang.....http://dblp.org/pers/hd/j/Jiang_0016:Hao", "Jason O. Hallstrom.....http://dblp.org/pers/hd/h/Hallstrom:Jason_O="], "conf": "infocom", "year": "2013", "pages": 9}