{"title": "i, Poet: Automatic Chinese Poetry Composition through a Generative Summarization Framework under Constrained Optimization.", "fields": ["chinese poetry", "generative grammar", "automatic summarization", "computational linguistics", "rouge"], "abstract": "Part of the long lasting cultural heritage of China is the classical ancient Chinese poems which follow strict formats and complicated linguistic rules. Automatic Chinese poetry composition by programs is considered as a challenging problem in computational linguistics and requires high Artificial Intelligence assistance, and has not been well addressed. In this paper, we formulate the poetry composition task as an optimization problem based on a generative summarization framework under several constraints. Given the user specified writing intents, the system retrieves candidate terms out of a large poem corpus, and then orders these terms to fit into poetry formats, satisfying tonal and rhythm requirements. The optimization process under constraints is conducted via iterative term substitutions till convergence, and outputs the subset with the highest utility as the generated poem. For experiments, we perform generation on large datasets of 61,960 classic poems from Tang and Song Dynasty of China. A comprehensive evaluation, using both human judgments and ROUGE scores, has demonstrated the effectiveness of our proposed approach.", "citation": "Citations (26)", "year": "2013", "departments": ["National Taiwan University", "Peking University", "University of Edinburgh", "National Taiwan University", "Beijing Key Lab ... , BISTU, China"], "conf": "ijcai", "authors": ["Rui Yan.....http://dblp.org/pers/hd/y/Yan:Rui", "Han Jiang.....http://dblp.org/pers/hd/j/Jiang:Han", "Mirella Lapata.....http://dblp.org/pers/hd/l/Lapata:Mirella", "Shou-De Lin.....http://dblp.org/pers/hd/l/Lin:Shou=De", "Xueqiang Lv.....http://dblp.org/pers/hd/l/Lv:Xueqiang", "Xiaoming Li.....http://dblp.org/pers/hd/l/Li:Xiaoming"], "pages": 7}