{"title": "DISCERN: Cooperative whitespace scanning in practical environments.", "fields": ["transmitter", "cognitive radio", "multipath propagation", "channel", "whitespace"], "abstract": "Cognitive radio devices opportunistically operate on whitespace channels, provided those channels are not in use by the primary users. This opportunistic reusing of channels requires secondary users to perform fast and efficient sensing to determine the unused channels. Although individual secondary clients may be unwilling to frequently sense all the channels, their density could be exploited for tasking the individual devices to collaboratively extract useful information on spectrum usage. It is critical to determine how the sensing tasks should be assigned to different secondary users. This is particularly challenging in practical networks due to the variability in the sensing accuracy of different users that may arise because of multipath effects on the signal and varying distances from the primary transmitters. Further, presence of multiple Primary Users on the same channel makes it challenging to select the best users for sensing. Finally, to reduce the sensing overhead, it is beneficial to limit the number of channel sensing tasks that can be performed within a given time period. We propose a novel metric that captures the sensing accuracy of a given sensing assignment. Using our metric, we design an algorithm DISCERN for computing the sensing assignment that maximizes the sensing accuracy. Our algorithm is the first to take into account the limitations in practical networks. Our work is motivated by experimental measurements. Tracedriven simulations show that DISCERN increases the sensing accuracy by at least 30%. Theoretical analysis shows that the sensing assignment computed by DISCERN performs within 63% of the exponential-time optimal solution.", "citation": "Citations (3)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Tarun Bansal.....http://dblp.org/pers/hd/b/Bansal:Tarun", "Bo Chen.....http://dblp.org/pers/hd/c/Chen:Bo", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun"], "conf": "infocom", "year": "2013", "pages": 9}