{"title": "M-FAMA: A multi-session MAC protocol for reliable underwater acoustic streams.", "fields": ["multiplexing", "network packet", "sonar", "underwater acoustic communication", "propagation delay"], "abstract": "Mobile underwater networking is a developing technology for monitoring and exploring the Earth's oceans. For effective underwater exploration, multimedia communications such as sonar images and low resolution videos are becoming increasingly important. Unlike terrestrial RF communication, underwater networks rely on acoustic waves as a means of communication. Unfortunately, acoustic waves incur long propagation delays that typically lead to low throughput especially in protocols that require receiver feedback such as multimedia stream delivery. On the positive side, the long propagation delay permits multiple packets to be “pipelined” concurrently in the underwater channel, improving the overall throughput and enabling applications that require sustained bandwidth. To enable session multiplexing and pipelining, we propose the Multi-session FAMA (M-FAMA) algorithm. M-FAMA leverages passively-acquired local information (i.e., neighboring nodes' propagation delay maps and expected transmission schedules) to launch multiple simultaneous sessions. M-FAMA's greedy behavior is controlled by a Bandwidth Balancing algorithm that guarantees max-min fairness across multiple contending sources. Extensive simulation results show that M-FAMA significantly outperforms existing MAC protocols in representative streaming applications.", "citation": "Citations (23)", "departments": ["University of California, Los Angeles", "Cisco Systems, Inc.", "KAIST", "University of California, Los Angeles"], "authors": ["Seongwon Han.....http://dblp.org/pers/hd/h/Han:Seongwon", "Youngtae Noh.....http://dblp.org/pers/hd/n/Noh:Youngtae", "Uichin Lee.....http://dblp.org/pers/hd/l/Lee:Uichin", "Mario Gerla.....http://dblp.org/pers/hd/g/Gerla:Mario"], "conf": "infocom", "year": "2013", "pages": 9}