{"title": "Computational Disaster Management.", "fields": ["emergency management", "homeland security", "situation awareness", "humanitarian aid", "welfare"], "abstract": "The frequency and intensity of natural disasters have been increasing significantly over the past decades and this trend is predicted to continue. Natural disasters have a dramatic impact on human lives and on the socio-economic welfare of entire regions. They were identified in 2011 by the World Bank [The World Bank, 2011] as one of the major risks of the East Asia and Pacific region, which represents 85 percents of all people affected since 2007. Moreover, this exposure will likely double by 2050 due to rapid urbanization and climate change. To understand the magnitude of such disasters, consider Irene, a category 3 hurricane that hit the East Coast of the United States in August 2011. It killed 56 people, inflicted damages now estimated in the range of 15 billion dollars, and created blackouts that lasted for several days. Hurricane Sandy and the Tohoku tsunami in Japan were even more dramatic, affecting human welfare in entire regions and damaging entire segments of the economy. For instance, Japanese manufacturers lost a significant market shares after the tsunami. It is possible however to mitigate the impact of these disasters through appropriate public and corporate policies, investment in infrastructure resilience, real-time decisionsupport systems, and education. In general, the focus of decision-support systems for disaster management is on situational awareness, i.e., communicating to decision makers the siuation in the field as accurately as possible. Situational awareness is obviously a critical component of any decisionsupport system for disaster management. However, Hurricane Katrina, a traumatic event for the United States, indicated the need to go beyond the communication of timely information; it is critical to enhance the cognitive abilities of decision makers through advanced use of optimization and simulation technology. The Katrina report [United-States Government, 2006], which should be required reading for policymakers and emergency officials around the world, pointed out that “the existing planning and operational structure for delivering critical resources and humanitarian aid clearly proved to be inequate to he task.” In addition, the report recommended that “the Federal government must develop the capacity to conduct large-scale logistical operations”. Similar observations have been made elsewhere: A European ambassador at a donor conference for Tsunami relief even said that “we do not need another donors’ conference; we need a logistics conference”. It seems clear that a novel, holistic approach is necessary for disaster management. The United States responded strongly to the Katrina report, starting major initiatives in various departments, including the Department of Homeland Security (DHS). Substantial progress has been achieved since 2006 and this paper reviews some efforts that are now deployed to mitigate the impact of disasters. However, much more is needed and this paper sketches some of the challenges and a long-term vision for computational disaster management. This paper articulates the role of optimization for disaster management and its inherent complexity . It reviews a number of case studies in this space, some of which in deployment, to highlight the benefits of optimization . It concludes by articulating a potential long-term vision for computational disaster management, articulating some of the broader computational challenges. Obviously, space limits make it difficult to enter into deep technical issues but the hope is that this paper will provide the incentives to learn more about this important and fascinating field and, hopefully, to join this effort.", "citation": "Citations (8)", "year": "2013", "departments": ["University of Melbourne"], "conf": "ijcai", "authors": ["Pascal Van Hentenryck.....http://dblp.org/pers/hd/h/Hentenryck:Pascal_Van"], "pages": 8}