{"title": "Toward practical MAC design for underwater acoustic networks.", "fields": ["access control", "time sharing", "underwater acoustic communication", "propagation delay", "collision", "random access", "underwater acoustics"], "abstract": "Recently, various Medium Access Control (MAC) protocols have been proposed for underwater acoustic networks. These protocols have significantly improved the performance of MAC layer in theory. However, two critical characteristics, low transmission rates and long preambles, found in the commercial modem-based real systems, drastically degrade the performance of existing MAC protocols in the real world. A new practical MAC design is demanded. Toward a proper approach, this paper analyzes the impact of the two newly found modem characteristics on the random access-based MAC and handshakebased MAC, which are two major types of MAC protocols for underwater acoustic networks. We further develop the nodal throughput and collision probability models for representative solutions of these two MAC protocol types. Based on the analysis, we believe time sharing-based MAC is very promising. Along this line, we propose a time sharing-based MAC and analyze its nodal throughput. Both analytical and simulation results show that the time sharing-based solution can achieve significantly better performance.", "citation": "Citations (54)", "departments": ["University of Connecticut", "United States Naval Research Laboratory", "University of Connecticut", "University of Connecticut", "University of Connecticut", "University of Connecticut", "University of Connecticut", "University of Connecticut", "Zhejiang University"], "authors": ["Yibo Zhu.....http://dblp.org/pers/hd/z/Zhu:Yibo", "Zaihan Jiang.....http://dblp.org/pers/hd/j/Jiang:Zaihan", "Zheng Peng.....http://dblp.org/pers/hd/p/Peng_0001:Zheng", "Michael Zuba.....http://dblp.org/pers/hd/z/Zuba:Michael", "Jun-Hong Cui.....http://dblp.org/pers/hd/c/Cui:Jun=Hong", "Huifang Chen.....http://dblp.org/pers/hd/c/Chen:Huifang"], "conf": "infocom", "year": "2013", "pages": 9}