{"title": "Certified computer-aided cryptography: efficient provably secure machine code from high-level implementations.", "fields": ["computer aided", "pkcs", "executable", "cryptography", "machine code", "certification", "implementation", "concrete security", "pkcs 1"], "abstract": "We present a computer-aided framework for proving concrete security bounds for cryptographic machine code implementations. The front-end of the framework is an interactive verification tool that extends the EasyCrypt framework to reason about relational properties of C-like programs extended with idealised probabilistic operations in the style of code-based security proofs. The framework also incorporates an extension of the CompCert certified compiler to support trusted libraries providing complex arithmetic calculations or instantiating idealized components such as sampling operations. This certified compiler allows us to carry to executable code the security guarantees established at the high-level, and is also instrumented to detect when compilation may interfere with side-channel countermeasures deployed in source code.   We demonstrate the applicability of the framework by applying it to the RSA-OAEP encryption scheme, as standardized in PKCS#1 v2.1. The outcome is a rigorous analysis of the advantage of an adversary to break the security of assembly implementations of the algorithms specified by the standard. The example also provides two contributions of independent interest: it bridges the gap between computer-assisted security proofs and real-world cryptographic implementations as described by standards such as PKCS,and demonstrates the use of the CompCert certified compiler in the context of cryptographic software development.", "citation": "Not cited", "year": "2013", "departments": ["University of Minho", "University of Minho", "IMDEA", "IMDEA"], "conf": "ccs", "authors": ["José Bacelar Almeida.....http://dblp.org/pers/hd/a/Almeida:Jos=eacute=_Bacelar", "Manuel Barbosa.....http://dblp.org/pers/hd/b/Barbosa:Manuel", "Gilles Barthe.....http://dblp.org/pers/hd/b/Barthe:Gilles", "François Dupressoir.....http://dblp.org/pers/hd/d/Dupressoir:Fran=ccedil=ois"], "pages": 14}