{"title": "PACE: Policy-Aware Application Cloud Embedding.", "fields": ["cloud computing security", "software deployment", "virtualization", "cloud testing", "campus network"], "abstract": "The emergence of new capabilities such as virtualization and elastic (private or public) cloud computing infrastructures has made it possible to deploy multiple applications, on demand, on the same cloud infrastructure. A major challenge to achieve this possibility, however, is that modern applications are typically distributed, structured systems that include not only computational and storage entities, but also policy entities (e.g., load balancers, firewalls, intrusion prevention boxes). Deploying applications on a cloud infrastructure without the policy entities may introduce substantial policy violations and/or security holes. In this paper, we present PACE: the first systematic framework for Policy-Aware Application Cloud Embedding. We precisely define the policy-aware, cloud application embedding problem, study its complexity and introduce simple, efficient, online primal-dual algorithms to embed applications in cloud data centers. We conduct evaluations using data from a real, large campus network and a realistic data center topology to evaluate the feasibility and performance of PACE. We show that deployment in a cloud without considering in-network policies may lead to a large number of policy violations (e.g., using tree routing as a way to enforce in-network policies may observe up to 91% policy violations). We also show that our embedding algorithms are very efficient by comparing with a good online fractional embedding algorithm.", "citation": "Citations (24)", "departments": ["Bell Labs", "University of Maryland, College Park", "Tsinghua University", "University of Maryland, College Park", "Tsinghua University"], "authors": ["Li Erran Li.....http://dblp.org/pers/hd/l/Li:Li_Erran", "Vahid Liaghat.....http://dblp.org/pers/hd/l/Liaghat:Vahid", "Hongze Zhao.....http://dblp.org/pers/hd/z/Zhao:Hongze", "MohammadTaghi Hajiaghayi.....http://dblp.org/pers/hd/h/Hajiaghayi:MohammadTaghi", "Dan Li.....http://dblp.org/pers/hd/l/Li_0001:Dan", "Gordon T. Wilfong.....http://dblp.org/pers/hd/w/Wilfong:Gordon_T=", "Yang Richard Yang.....http://dblp.org/pers/hd/y/Yang:Yang_Richard", "Chuanxiong Guo.....http://dblp.org/pers/hd/g/Guo:Chuanxiong"], "conf": "infocom", "year": "2013", "pages": 9}