{"title": "Localized matrix factorization for recommendation based on matrix block diagonal forms.", "fields": ["non negative matrix factorization", "pentadiagonal matrix", "hollow matrix", "block matrix", "band matrix"], "abstract": "Matrix factorization on user-item rating matrices has achieved significant success in collaborative filtering based recommendation tasks. However, it also encounters the problems of data sparsity and scalability when applied in real-world recommender systems. In this paper, we present the Localized Matrix Factorization (LMF) framework, which attempts to meet the challenges of sparsity and scalability by factorizing Block Diagonal Form (BDF) matrices. In the LMF framework, a large sparse matrix is first transformed into Recursive Bordered Block Diagonal Form (RBBDF), which is an intuitionally interpretable structure for user-item rating matrices. Smaller and denser submatrices are then extracted from this RBBDF matrix to construct a BDF matrix for more effective collaborative prediction. We show formally that the LMF framework is suitable for matrix factorization and that any decomposable matrix factorization algorithm can be integrated into this framework. It has the potential to improve prediction accuracy by factorizing smaller and denser submatrices independently, which is also suitable for parallelization and contributes to system scalability at the same time. Experimental results based on a number of real-world public-access benchmarks show the effectiveness and efficiency of the proposed LMF framework.", "citation": "Citations (33)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Yongfeng Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongfeng", "Min Zhang.....http://dblp.org/pers/hd/z/Zhang_0006:Min", "Yiqun Liu.....http://dblp.org/pers/hd/l/Liu:Yiqun", "Shaoping Ma.....http://dblp.org/pers/hd/m/Ma:Shaoping", "Shi Feng.....http://dblp.org/pers/hd/f/Feng:Shi"], "conf": "www", "year": "2013", "pages": 10}