{"title": "KuaFu: Closing the parallelism gap in database replication.", "fields": ["log shipping", "database engine", "degree of parallelism", "backup", "replication"], "abstract": "Database systems are nowadays increasingly deployed on multi-core commodity servers, with replication to guard against failures. Database engine is best designed to scale with the number of cores to offer a high degree of parallelism on a modern multi-core architecture. On the other hand, replication traditionally resorts to a certain form of serialization for data consistency among replicas. In the widely used primary/backup replication with log shipping, concurrent executions on the primary and the serialized log replay on a backup creates a serious parallelism gap. Our experiment on MySQL with a 16-core configuration shows that the serial replay of a backup can sustain only less than one third of the throughput achievable on the primary under an OLTP workload. This paper proposes KuaFu to close the parallelism gap on replicated database systems by enabling concurrent replay of transactions on a backup. KuaFu maintains write consistency on backups by tracking transaction dependencies. Concurrent replay on a backup does introduce read inconsistency between the primary and backups. KuaFu further leverages multi-version concurrency control to produce snapshots in order to restore the consistency semantics. We have implemented KuaFu on MySQL; our evaluations show that KuaFu allows a backup to keep up with the primary while preserving replication consistency.", "citation": "Citations (7)", "departments": ["Microsoft", "Tsinghua University", "Microsoft", "Tsinghua University", "Microsoft"], "authors": ["Chuntao Hong.....http://dblp.org/pers/hd/h/Hong:Chuntao", "Dong Zhou.....http://dblp.org/pers/hd/z/Zhou:Dong", "Mao Yang.....http://dblp.org/pers/hd/y/Yang:Mao", "Carbo Kuo.....http://dblp.org/pers/hd/k/Kuo:Carbo", "Lintao Zhang.....http://dblp.org/pers/hd/z/Zhang:Lintao", "Lidong Zhou.....http://dblp.org/pers/hd/z/Zhou:Lidong"], "conf": "icde", "year": "2013", "pages": 10}