{"title": "Towards omnidirectional passive human detection.", "fields": ["wireless", "omnidirectional antenna", "architecture", "physical layer", "antenna"], "abstract": "Passive human detection and localization serve as key enablers for various pervasive applications such as smart space, human-computer interaction and asset security. The primary concern in devising scenario-tailored detecting systems is the coverage of their monitoring units. In conventional radio-based schemes, the basic unit tends to demonstrate a directional coverage, even if the underlying devices are all equipped with omnidirectional antennas. Such an inconsistency stems from the link-centric architecture, creating an anisotropic wireless propagating environment. To achieve an omnidirectional coverage while retaining the link-centric architecture, we propose the concept of Omnidirectional Passive Human Detection, and investigate to harness the PHY layer features to virtually tune the shape of the unit coverage by fingerprinting approaches, which is previously prohibited with mere MAC layer RSSI. We design the scheme with ubiquitously deployed WiFi infrastructure and evaluate it in typical multipath-rich indoor scenarios. Experimental results show that our scheme achieves an average false positive of 8% and an average false negative of 7% in detecting human presence in 4 directions.", "citation": "Citations (75)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Zimu Zhou.....http://dblp.org/pers/hd/z/Zhou:Zimu", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng", "Chenshu Wu.....http://dblp.org/pers/hd/w/Wu:Chenshu", "Longfei Shangguan.....http://dblp.org/pers/hd/s/Shangguan:Longfei", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2013", "pages": 9}