{"title": "LDPC-in-SSD: making advanced error correction codes work effectively in solid state drives.", "fields": ["low density parity check code", "bch code", "nand gate", "response time", "flash memory"], "abstract": "Conventional error correction codes (ECCs), such as the commonly used BCH code, have become increasingly inadequate for solid state drives (SSDs) as the capacity of NAND flash memory continues to increase and its reliability continues to degrade. It is highly desirable to deploy a much more powerful ECC, such as low-density parity-check (LDPC) code, to significantly improve the reliability of SSDs. Although LDPC code has had its success in commercial hard disk drives, to fully exploit its error correction capability in SSDs demands unconventional fine-grained flash memory sensing, leading to an increased memory read latency. To address this important but largely unexplored issue, this paper presents three techniques to mitigate the LDPC-induced response time delay so that SSDs can benefit its strong error correction capability to the full extent. We quantitatively evaluate these techniques by carrying out trace-based SSD simulations with runtime characterization of NAND flash memory reliability and LDPC code decoding. Our study based on intensive experiments shows that these techniques used in an integrated way in SSDs can reduce the worst-case system read response time delay from over 100% down to below 20%. With our proposed techniques, a strong ECC alternative can be used in NAND flash memory to retain its reliability to respond the continuous cost reduction, and its relatively small increase of response time delay is acceptable to mainstream application users, considering a huge gain in SSD capacity, its reliability, and the price reduction.", "citation": "Citations (150)", "departments": ["Rensselaer Polytechnic Institute", "Xi'an Jiaotong University", "Xi'an Jiaotong University", "Rensselaer Polytechnic Institute", "Ohio State University"], "authors": ["Kai Zhao.....http://dblp.org/pers/hd/z/Zhao_0005:Kai", "Wenzhe Zhao.....http://dblp.org/pers/hd/z/Zhao:Wenzhe", "Hongbin Sun.....http://dblp.org/pers/hd/s/Sun_0001:Hongbin", "Tong Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Tong", "Xiaodong Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiaodong", "Nanning Zheng.....http://dblp.org/pers/hd/z/Zheng:Nanning"], "conf": "fast", "year": "2013", "pages": 14}