{"title": "SPRWeb: preserving subjective responses to website colour schemes through automatic recolouring.", "fields": ["naturalness", "perception", "user experience design", "first impression", "colour vision"], "abstract": "Colours are an important part of user experiences on the Web. Colour schemes influence not only the aesthetics, but also our first impressions and long-term engagement with websites (e.g., Figure 1 shows a 'warm' website colour scheme). However, five percent of people perceive a subset of all colours because they have colour vision deficiency (CVD), resulting in an unequal and presumably less-rich user experience on the Web (Figure 2). Traditionally, people with CVD have been supported by recolouring tools that improve colour differentiability, but do not consider the subjective properties of colour schemes while recolouring (Figure 3 shows Figure 1 after standard recolouring; it is now 'cool' instead of 'warm'). To address this, we developed SPRWeb, a tool that recolours websites to preserve subjective responses and improve colour differentiability - thus enabling users with CVD to have similar online experiences (Figure 4 shows Figure 1 recoloured using SPRWeb; it is once again 'warm'). To develop SPRWeb, we extended existing models of non-CVD subjective responses to people with CVD, then used this extended model to steer the recolouring process. In a lab study, we found that SPRWeb did significantly better than a standard recolouring tool at preserving the temperature and naturalness of websites, while achieving similar weight and differentiability preservation. We also found that recolouring did not preserve activity, and hypothesize that visual complexity influences activity more than colour. SPRWeb is the first tool to automatically preserve the subjective and perceptual properties of website colour schemes thereby equalizing the colour-based web experience for people with CVD.", "citation": "Citations (15)", "departments": ["University of Saskatchewan", "Harvard University", "University of Saskatchewan", "Harvard University"], "authors": ["David R. Flatla.....http://dblp.org/pers/hd/f/Flatla:David_R=", "Katharina Reinecke.....http://dblp.org/pers/hd/r/Reinecke:Katharina", "Carl Gutwin.....http://dblp.org/pers/hd/g/Gutwin:Carl", "Krzysztof Z. Gajos.....http://dblp.org/pers/hd/g/Gajos:Krzysztof_Z="], "conf": "chi", "year": "2013", "pages": 10}