{"title": "Compressive sensing based monitoring with vehicular networks.", "fields": ["global positioning system", "vehicular ad hoc network", "compressed sensing", "dynamic network analysis", "hop"], "abstract": "Vehicles are becoming powerful mobile sensors, and vehicular networks provide a promising platform to support a wide range of existing large-scale monitoring applications such as road surface monitoring, and etc. In vehicular networks, inter-vehicle contacts are scarce resources for data delivery. This presents a major challenge for monitoring applications with vehicular networks. By analyzing a large dataset of taxi traces collected from around 2,600 taxis in Shanghai, China, we reveal that there is strong correlation with data readings on vehicles. Motivated by this important observation, we propose a compressive sensing based approach called CSM to monitor with vehicular networks. Two key issues must be addressed. First, there is an intrinsic tradeoff between communication cost and estimation accuracy. Second, guaranteed estimation accuracy should be provided over the highly dynamic network. To address the above issues, we first characterize the relationship between estimation error (12 error) and sparsity property of a dataset. Then, we determine two critical parameters: the minimum number of seeds and the minimum transmission hop length for compressive measurements in the network. The selection of the two parameters can reduce the communication cost while guaranteeing the required estimation accuracy. Extensive simulations based on real vehicular GPS traces collected in Shanghai, China have been performed and results demonstrate that CSM achieves much higher estimation accuracy at the same communication cost compared with other alternative schemes.", "citation": "Citations (34)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Hong Kong University of Science and Technology"], "authors": ["Hongjian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Hongjian", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian"], "conf": "infocom", "year": "2013", "pages": 9}