{"title": "Universally Composable Secure Computation with (Malicious) Physically Uncloneable Functions.", "fields": ["oblivious transfer", "distributed computing", "commitment scheme", "secure multi party computation", "adversarial system", "computer science", "physical unclonable function", "adversary"], "abstract": "Physically Uncloneable Functions (PUFs) (28) are noisy phys- ical sources of randomness. As such, they are naturally appealing for cryptographic applications, and have caught the interest of both the- oreticians and practitioners. A major step towards understanding and securely using PUFs was recently taken in (Crypto 2011) where Brzuska, Fischlin, Schroder and Katzenbeisser model PUFs in the Universal Com- position (UC) framework of Canetti (FOCS 2001). A salient feature of their model is that it considers trusted PUFs only; that is, PUFs which have been produced via the prescribed manufacturing process and are guaranteed to be free of any adversarial influence. However, this does not accurately reflect real-life scenarios, where an adversary could be able to create and use malicious PUFs. The goal of this work is to extend the model proposed in (Crypto 2011) in order to capture such a real-world attack. The main contribution of this work is the study of the Malicious PUFs model. To this end, we first formalize the notion of \"malicious\" PUFs, and extend the UC formulation of Brzuska et al. to allow the adversary to create PUFs with arbitrary adversarial behaviour. Then, we provide positive results in this, more realistic, model. We show that, under computational assumptions, it is possible to UC-securely realize any functionality.", "citation": "Citations (53)", "year": "2013", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of Salerno", "University of California, Los Angeles"], "conf": "eurocrypt", "authors": ["Rafail Ostrovsky.....http://dblp.org/pers/hd/o/Ostrovsky:Rafail", "Alessandra Scafuro.....http://dblp.org/pers/hd/s/Scafuro:Alessandra", "Ivan Visconti.....http://dblp.org/pers/hd/v/Visconti:Ivan", "Akshay Wadia.....http://dblp.org/pers/hd/w/Wadia:Akshay"], "pages": 17}