{"title": "Similarity query processing for probabilistic sets.", "fields": ["query optimization", "probabilistic analysis of algorithms", "probabilistic ctl", "probabilistic logic", "data integration"], "abstract": "Evaluating similarity between sets is a fundamental task in computer science. However, there are many applications in which elements in a set may be uncertain due to various reasons. Existing work on modeling such probabilistic sets and computing their similarities suffers from huge model sizes or significant similarity evaluation cost, and hence is only applicable to small probabilistic sets. In this paper, we propose a simple yet expressive model that supports many applications where one probabilistic set may have thousands of elements. We define two types of similarities between two probabilistic sets using the possible world semantics; they complement each other in capturing the similarity distributions in the cross product of possible worlds. We design efficient dynamic programming-based algorithms to calculate both types of similarities. Novel individual and batch pruning techniques based on upper bounding the similarity values are also proposed. To accommodate extremely large probabilistic sets, we also design sampling-based approximate query processing methods with strong probabilistic guarantees. We have conducted extensive experiments using both synthetic and real datasets, and demonstrated the effectiveness and efficiency of our proposed methods.", "citation": "Citations (5)", "departments": ["East China Normal University", "East China Normal University", "University of New South Wales", "East China Normal University", "East China Normal University"], "authors": ["Ming Gao.....http://dblp.org/pers/hd/g/Gao_0001:Ming", "Cheqing Jin.....http://dblp.org/pers/hd/j/Jin:Cheqing", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0011:Wei", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Aoying Zhou.....http://dblp.org/pers/hd/z/Zhou:Aoying"], "conf": "icde", "year": "2013", "pages": 12}