{"title": "Cross-media semantic representation via bi-directional learning to rank.", "fields": ["ranking", "multimedia information retrieval", "ranking svm", "learning to rank"], "abstract": "In multimedia information retrieval, most classic approaches tend to represent different modalities of media in the same feature space. Existing approaches take either one-to-one paired data or uni-directional ranking examples (i.e., utilizing only text-query-image ranking examples or image-query-text ranking examples) as training examples, which do not make full use of bi-directional ranking examples (bi-directional ranking means that both text-query-image and image-query-text ranking examples are utilized in the training period) to achieve a better performance. In this paper, we consider learning a cross-media representation model from the perspective of optimizing a listwise ranking problem while taking advantage of bi-directional ranking examples. We propose a general cross-media ranking algorithm to optimize the bi-directional listwise ranking loss with a latent space embedding, which we call Bi-directional Cross-Media Semantic Representation Model (Bi-CMSRM). The latent space embedding is discriminatively learned by the structural large margin learning for optimization with certain ranking criteria (mean average precision in this paper) directly. We evaluate Bi-CMSRM on the Wikipedia and NUS-WIDE datasets and show that the utilization of the bi-directional ranking examples achieves a much better performance than only using the uni-directional ranking examples.", "citation": "Citations (75)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "National University of Singapore", "Microsoft"], "authors": ["Fei Wu.....http://dblp.org/pers/hd/w/Wu_0001:Fei", "Xinyan Lu.....http://dblp.org/pers/hd/l/Lu:Xinyan", "Zhongfei Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhongfei", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Yong Rui.....http://dblp.org/pers/hd/r/Rui:Yong", "Yueting Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yueting"], "conf": "mm", "year": "2013", "pages": 10}