{"title": "Horus: fine-grained encryption-based security for large-scale storage.", "fields": ["attribute based encryption", "client side encryption", "40 bit encryption", "56 bit encryption", "on the fly encryption"], "abstract": "With the growing use of large-scale distributed systems, the likelihood that at least one node is compromised is increasing. Large-scale systems that process sensitive data such as geographic data with defense implications, drug modeling, nuclear explosion modeling, and private genomic data would benefit greatly from strong security for their storage. Nevertheless, many high performance computing (HPC), cloud, or secure content delivery network (SCDN) systems that handle such data still store them unencrypted or use simple encryption schemes, relying heavily on physical isolation to ensure confidentiality, providing little protection against compromised computers or malicious insiders. Moreover, current encryption solutions cannot efficiently provide fine-grained encryption for large datasets.\n\nOur approach, Horus, encrypts large datasets using keyed hash trees (KHTs) to generate different keys for each region of the dataset, providing fine-grained security: the key for one region cannot be used to access another region. Horus also reduces key management and distribution overhead while providing end-to-end data encryption and reducing the need to trust system operators or cloud service providers. Horus requires little modification to existing systems and user applications. Performance evaluation shows that our prototype's key distribution is highly scalable and robust: a single key server can provide 140,000 keys per second, theoretically enough to sustain more than 100 GB/s I/O throughput, and multiple key servers can efficiently operate in parallel to support load balancing and reliability.", "citation": "Citations (9)", "departments": ["University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz", "Sandia National Laboratories", "University of California, Santa Cruz"], "authors": ["Yan Li.....http://dblp.org/pers/hd/l/Li_0006:Yan", "Nakul Sanjay Dhotre.....http://dblp.org/pers/hd/d/Dhotre:Nakul_Sanjay", "Yasuhiro Ohara.....http://dblp.org/pers/hd/o/Ohara:Yasuhiro", "Thomas M. Kroeger.....http://dblp.org/pers/hd/k/Kroeger:Thomas_M=", "Ethan L. Miller.....http://dblp.org/pers/hd/m/Miller:Ethan_L=", "Darrell D. E. Long.....http://dblp.org/pers/hd/l/Long:Darrell_D=_E="], "conf": "fast", "year": "2013", "pages": 14}