{"title": "Horizon on the move: Geocast in intermittently connected vehicular ad hoc networks.", "fields": ["mobile ad hoc network", "latency", "vehicular ad hoc network", "geocast", "hitting time"], "abstract": "Vehicular ad hoc network (VANET) is one of the most promising large-scale applications of mobile ad hoc networks. VANET applications are rooted in advanced understanding of communication networks because both control messages and data information need to be disseminated in geographic regions (i.e., Geocast). The challenges come from highly dynamic environments in VANET. Destination nodes in geocast are dynamic over time due to vehicle mobility, which undermines existing results on dissemination latency and information propagation speed with pre-determined destinations. Moreover, the affected area by the dissemination, which is referred to as horizon of message (HOM), is critical in geocast as it determines the latency for the message reaching nodes inside the area of interest (AOI), in which the message is relevant to drivers. Therefore, we characterize the HOM in geocast by how far the message can reach within time t (referred as dissemination distance) and how long the message takes to inform nodes at certain locations (referred as hitting time). Analytic bounds of dissemination distance and hitting time are derived under four types of dissemination mechanisms, which provide insights into the spatial and temporal limits of HOM as well as how the numbers of disseminators and geographic information exchanges affect them. Applying analytic and simulation results to two real applications, we observe that geocast with AOI near the source or high reliability requirement should recruit multiple disseminators while geocast with AOI far from the source need to utilize geographic information for fast message propagation.", "citation": "Citations (12)", "departments": ["North Carolina State University", "North Carolina State University"], "authors": ["Yujin Li.....http://dblp.org/pers/hd/l/Li:Yujin", "Wenye Wang.....http://dblp.org/pers/hd/w/Wang:Wenye"], "conf": "infocom", "year": "2013", "pages": 9}