{"title": "Cooperative cell outage detection in Self-Organizing femtocell networks.", "fields": ["femtocell", "semi major axis", "network architecture", "sequential analysis", "collaborative filtering"], "abstract": "The vision of Self-Organizing Networks (SON) has been drawing considerable attention as a major axis for the development of future networks. As an essential functionality in SON, cell outage detection is developed to autonomously detect macrocells or femtocells that are inoperative and unable to provide service. Previous cell outage detection approaches have mainly focused on macrocells while the outage issue in the emerging femtocell networks is less discussed. However, due to the two-tier macro-femto network architecture and the small coverage nature of femtocells, it is challenging to enable outage detection functionality in femtocell networks. Based on the observation that spatial correlations among users can be extracted to cope with these challenges, this paper proposes a Cooperative femtocell Outage Detection (COD) architecture which consists of a trigger stage and a detection stage. In the trigger stage, we design a trigger mechanism that leverages correlation information extracted through collaborative filtering to efficiently trigger the detection procedure without inter-cell communications. In the detection stage, to improve the detection accuracy, we introduce a sequential cooperative detection rule to process the spatially and temporally correlated user statistics. In particular, the detection problem is formulated as a sequential hypothesis testing problem, and the analytical results on the detection performance are derived. Numerical studies for a variety of femtocell deployments and configurations demonstrate that COD outperforms the existing scheme in both communication overhead and detection accuracy.", "citation": "Citations (17)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Wei Wang.....http://dblp.org/pers/hd/w/Wang_0050:Wei", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "conf": "infocom", "year": "2013", "pages": 9}