{"title": "RaSMaLai: A Randomized Switching algorithm for Maximizing Lifetime in tree-based wireless sensor networks.", "fields": ["mobile wireless sensor network", "tree structure", "randomized algorithm", "key distribution in wireless sensor networks", "sink"], "abstract": "In most wireless sensor network (WSN) applications, data are typically gathered by the sensor nodes and reported to a data collection point, called the sink. In order to support such data collection, a tree structure rooted at the sink is usually defined. Based on different aspects, including the actual WSN topology and the available energy budget, the energy consumption of nodes belonging to different paths in the data collection tree may vary significantly. This affects the overall network lifetime, defined in terms of when the first node in the network runs out of energy. In this paper, we address the problem of lifetime maximization of WSNs in the context of data collection trees. In particular, we propose a novel and efficient algorithm, called Randomized Switching for Maximizing Lifetime (RaSMaLai) that aims at maximizing the lifetime of WSNs through load balancing with a low time complexity. We further design a distributed version of our algorithm, called D-RaSMaLai. Simulation results show that both the proposed algorithms outperform several existing approaches in terms of network lifetime. Moreover, RaSMaLai offers lower time complexity while the distributed version, D-RaSMaLai, is very efficient in terms of energy expenditure.", "citation": "Citations (20)", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "Aalto University", "University of Texas at Arlington"], "authors": ["Sk. Kajal Arefin Imon.....http://dblp.org/pers/hd/i/Imon:Sk=_Kajal_Arefin", "Adnan Khan.....http://dblp.org/pers/hd/k/Khan:Adnan", "Mario Di Francesco.....http://dblp.org/pers/hd/f/Francesco:Mario_Di", "Sajal K. Das.....http://dblp.org/pers/hd/d/Das:Sajal_K="], "conf": "infocom", "year": "2013", "pages": 9}