{"title": "Speeding up Permutation Testing in Neuroimaging.", "fields": ["permutation", "bonferroni correction", "speedup", "matrix completion", "residual"], "abstract": "Multiple hypothesis testing is a significant problem in nearly all neuroimaging studies. In order to correct for this phenomena, we require a reliable estimate of the Family-Wise Error Rate (FWER). The well known Bonferroni correction method, while simple to implement, is quite conservative, and can substantially under-power a study because it ignores dependencies between test statistics. Permutation testing, on the other hand, is an exact, non-parametric method of estimating the FWER for a given a-threshold, but for acceptably low thresholds the computational burden can be prohibitive. In this paper, we show that permutation testing in fact amounts to populating the columns of a very large matrix P. By analyzing the spectrum of this matrix, under certain conditions, we see that P has a low-rank plus a low-variance residual decomposition which makes it suitable for highly sub-sampled — on the order of 0.5% — matrix completion methods. Based on this observation, we propose a novel permutation testing methodology which offers a large speedup, without sacrificing the fidelity of the estimated FWER. Our evaluations on four different neuroimaging datasets show that a computational speedup factor of roughly 50 x can be achieved while recovering the FWER distribution up to very high accuracy. Further, we show that the estimated a-threshold is also recovered faithfully, and is stable.", "citation": "Citations (4)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Chris Hinrichs.....http://dblp.org/pers/hd/h/Hinrichs:Chris", "Vamsi K. Ithapu.....http://dblp.org/pers/hd/i/Ithapu:Vamsi_K=", "Qinyuan Sun.....http://dblp.org/pers/hd/s/Sun:Qinyuan", "Sterling C. Johnson.....http://dblp.org/pers/hd/j/Johnson:Sterling_C=", "Vikas Singh.....http://dblp.org/pers/hd/s/Singh:Vikas"], "conf": "nips", "year": "2013", "pages": 9}