{"title": "Extending the lifetime of flash-based storage through reducing write amplification from file systems.", "fields": ["wear leveling", "write amplification", "flash file system", "journaling file system", "flash memory"], "abstract": "Flash memory has gained in popularity as storage devices for both enterprise and embedded systems because of its high performance, low energy and reduced cost. The endurance problem of flash memory, however, is still a challenge and is getting worse as storage density increases with the adoption of multi-level cells (MLC). Prior work has addressed wear leveling and data reduction, but there is significantly less work on using the file system to improve flash lifetimes. Some common mechanisms in traditional file systems, such as journaling, metadata synchronization, and page-aligned update, can induce extra write operations and aggravate the wear of flash memory. This problem is called write amplification from file systems.\n\nIn order to mitigate write amplification, we propose an object-based flash translation layer design (OFTL), in which mechanisms are co-designed with flash memory. By leveraging page metadata, OFTL enables lazy persistence of index metadata and eliminates journals while keeping consistency. Coarse-grained block state maintenance reduces persistent free space management overhead. With byte-unit access interfaces, OFTL is able to compact and co-locate the small updates with metadata to further reduce updates. Experiments show that an OFTL-based system, OFSS, offers a write amplification reduction of 47.4%-89.4% in SYNC mode and 19.8%-64.0% in ASYNC mode compared with ext3, ext2, and btrfs on an up-to-date page-level FTL.", "citation": "Citations (116)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Youyou Lu.....http://dblp.org/pers/hd/l/Lu:Youyou", "Jiwu Shu.....http://dblp.org/pers/hd/s/Shu:Jiwu", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin"], "conf": "fast", "year": "2013", "pages": 14}