{"title": "Element Distinctness, Frequency Moments, and Sliding Windows.", "fields": ["decision problem", "randomized algorithm", "combinatorics", "finite set", "quantum algorithm", "element distinctness problem", "discrete mathematics", "mathematics"], "abstract": "We derive new time-space tradeoff lower bounds and algorithms for exactly computing statistics of input data, including frequency moments, element distinctness, and order statistics, that are simple to calculate for sorted data. We develop a randomized algorithm for the element distinctness problem whose time T and space S satisfy T ∈ Õ (n 3/2 /S 1/2 ), smaller than previous lower bounds for comparison-based algorithms, showing that element distinctness is strictly easier than sorting for randomized branching programs. This algorithm is based on a new time and space efficient algorithm for finding all collisions of a function f from a finite set to itself that are reachable by iterating f from a given set of starting points. We further show that our element distinctness algorithm can be extended at only a polylogarithmic factor cost to solve the element distinctness problem over sliding windows, where the task is to take an input of length 2n-1 and produce an output for each window of length n, giving n outputs in total. In contrast, we show a time-space tradeoff lower bound of T ∈ Ω(n 2 /S) for randomized branching programs to compute the number of distinct elements over sliding windows. The same lower bound holds for computing the low-order bit of F 0  and computing any frequency moment F k ,  ≠  1. This shows that those frequency moments and the decision problem F 0  mod 2 are strictly harder than element distinctness. We complement this lower bound with a T ∈ Õ(n 2 /S) comparison-based deterministic RAM algorithm for exactly computing F k  over sliding windows, nearly matching both our lower bound for the sliding-window version and the comparison-based lower bounds for the single-window version. We further exhibit a quantum algorithm for F 0  over sliding windows with T ∈ O(n 3/2 /S 1/2 ). Finally, we consider the computations of order statistics over sliding windows.", "citation": "Not cited", "year": "2013", "departments": ["University of Washington", "University of Bristol", "University of Washington"], "conf": "focs", "authors": ["Paul Beame.....http://dblp.org/pers/hd/b/Beame:Paul", "Raphaël Clifford.....http://dblp.org/pers/hd/c/Clifford:Rapha=euml=l", "Widad Machmouchi.....http://dblp.org/pers/hd/m/Machmouchi:Widad"], "pages": 10}