{"title": "On routing and spectrum allocation in spectrum-sliced optical networks.", "fields": ["optical transport network", "approximation algorithm", "orthogonal frequency division multiplexing", "frequency allocation", "scalability"], "abstract": "The orthogonal frequency division multiplexing (OFDM) technology provides an opportunity for efficient resource utilization in optical networks. It allows allocation of multiple sub-carriers to meet traffic demands of varying size. Utilizing OFDM technology, a spectrum efficient and scalable optical transport network called SLICE was proposed recently. The SLICE architecture enables sub-wavelength, super-wavelength resource allocation and multiple rate data traffic that results in efficient use of spectrum. However, the benefit is accompanied by additional complexities in resource allocation. In SLICE architecture, in order to minimize the utilized spectrum, one has to solve the routing and spectrum allocation problem (RSA). In this paper, we focus our attention to RSA and (i) prove that RSA is NP-complete even when the optical network topology is as simple as a chain or a ring, (ii) provide approximation algorithms for RSA when the network topology is a binary tree or a ring, (iii) provide a heuristic for the network with arbitrary topology and measure the effectiveness of the heuristic with extensive simulation. Simulation results demonstrate that our heuristic significantly outperforms several other heuristics proposed recently for RSA.", "citation": "Citations (28)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Shahrzad Shirazipourazad.....http://dblp.org/pers/hd/s/Shirazipourazad:Shahrzad", "Chenyang Zhou.....http://dblp.org/pers/hd/z/Zhou:Chenyang", "Zahra Derakhshandeh.....http://dblp.org/pers/hd/d/Derakhshandeh:Zahra", "Arunabha Sen.....http://dblp.org/pers/hd/s/Sen:Arunabha"], "conf": "infocom", "year": "2013", "pages": 5}