{"title": "Maximum visibility queries in spatial databases.", "fields": ["visibility graph", "3d modeling", "angular diameter", "obstacle", "visibility"], "abstract": "Many real-world problems, such as placement of surveillance cameras and pricing of hotel rooms with a view, require the ability to determine the visibility of a given target object from different locations. Advances in large-scale 3D modeling (e.g., 3D virtual cities) provide us with data that can be used to solve these problems with high accuracy. In this paper, we investigate the problem of finding the location which provides the best view of a target object with visual obstacles in 2D or 3D space, for example, finding the location that provides the best view of fireworks in a city with tall buildings. To solve this problem, we first define the quality measure of a view (i.e., visibility measure) as the visible angular size of the target object. Then, we propose a new query type called the k-Maximum Visibility (kMV) query, which finds k locations from a set of locations that maximize the visibility of the target object. Our objective in this paper is to design a query solution which is capable of handling large-scale city models. This objective precludes the use of approaches that rely on constructing a visibility graph of the entire data space. As a result, we propose three approaches that incrementally consider relevant obstacles in order to determine the visibility of a target object from a given set of locations. These approaches differ in the order of obstacle retrieval, namely: query centric distance based, query centric visible region based, and target centric distance based approaches. We have conducted an extensive experimental study on real 2D and 3D datasets to demonstrate the efficiency and effectiveness of our solutions.", "citation": "Citations (8)", "departments": ["Bangladesh University of Engineering and Technology", "Bangladesh University of Engineering and Technology", "Bangladesh University of Engineering and Technology", "University of Maryland, College Park"], "authors": ["Sarah Masud.....http://dblp.org/pers/hd/m/Masud:Sarah", "Farhana Murtaza Choudhury.....http://dblp.org/pers/hd/c/Choudhury:Farhana_Murtaza", "Mohammed Eunus Ali.....http://dblp.org/pers/hd/a/Ali:Mohammed_Eunus", "Sarana Nutanong.....http://dblp.org/pers/hd/n/Nutanong:Sarana"], "conf": "icde", "year": "2013", "pages": 12}