{"title": "Non-reference audio quality assessment for online live music recordings.", "fields": ["music information retrieval", "learning to rank", "sound recording and reproduction", "ranking", "sound quality"], "abstract": "Immensely popular video sharing websites such as YouTube have become the most important sources of music information for Internet users and the most prominent platform for sharing live music. The audio quality of this huge amount of live music recordings, however, varies significantly due to factors such as environmental noise, location, and recording device. However, most video search engines do not take audio quality into consideration when retrieving and ranking results. Given the fact that most users prefer live music videos with better audio quality, we propose the first automatic, non-reference audio quality assessment framework for live music video search online. We first construct two annotated datasets of live music recordings. The first dataset contains 500 human-annotated pieces, and the second contains 2,400 synthetic pieces systematically generated by adding noise effects to clean recordings. Then, we formulate the assessment task as a ranking problem and try to solve it using a learning-based scheme. To validate the effectiveness of our framework, we perform both objective and subjective evaluations. Results show that our framework significantly improves the ranking performance of live music recording retrieval and can prove useful for various real-world music applications.", "citation": "Citations (8)", "departments": ["National University of Singapore", "Academia Sinica", "National University of Singapore", "National University of Singapore", "Academia Sinica"], "authors": ["Zhonghua Li.....http://dblp.org/pers/hd/l/Li:Zhonghua", "Ju-Chiang Wang.....http://dblp.org/pers/hd/w/Wang:Ju=Chiang", "Jingli Cai.....http://dblp.org/pers/hd/c/Cai:Jingli", "Zhiyan Duan.....http://dblp.org/pers/hd/d/Duan:Zhiyan", "Hsin-Min Wang.....http://dblp.org/pers/hd/w/Wang:Hsin=Min", "Ye Wang.....http://dblp.org/pers/hd/w/Wang:Ye"], "conf": "mm", "year": "2013", "pages": 10}