{"title": "Balance of revenue and social welfare in FCC's spectrum allocation.", "fields": ["spectral efficiency", "spectrum management", "bandwidth allocation", "frequency allocation", "commission"], "abstract": "To accommodate users' ever-increasing traffic in wireless broadband services, the Federal Communications Commission (FCC) in the U.S. is considering allocating additional spectrum to the wireless market. There are two major directions: licensed (e.g. 3G) and unlicensed services (e.g. Wi-Fi). On the one hand, 3G service can realize a high spectrum efficiency and provide ubiquitous connection. On the other hand, the Wi-Fi service (often with limited coverage) can provide users with high-speed local connections, but is subject to uncontrollable interferences. Regarding spectrum allocation, prior studies only focused on revenue maximization. However, one of FCC's missions is to better improve all wireless users' utilities. This motivates us to design a spectrum allocation scheme that jointly considers social welfare and revenue. In this paper, we formulate the interactions among the FCC, typical 3G and Wi-Fi operators, and the endusers as a three-stage dynamic game and derive the equilibrium of the entire game. Compared to the benchmark case where the FCC only maximizes its revenue, the consideration of social welfare will encourage the FCC to allocate more spectrum to the service which lacks spectrum to better serve its users. Such consideration for the social welfare, to our delight, brings limited revenue loss for the FCC.", "citation": "Citations (5)", "departments": ["Hong Kong University of Science and Technology", "Singapore University of Technology and Design", "The Chinese University of Hong Kong", "Hong Kong University of Science and Technology"], "authors": ["Yanjiao Chen.....http://dblp.org/pers/hd/c/Chen:Yanjiao", "Lingjie Duan.....http://dblp.org/pers/hd/d/Duan:Lingjie", "Jianwei Huang.....http://dblp.org/pers/hd/h/Huang:Jianwei", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "conf": "infocom", "year": "2013", "pages": 9}