{"title": "Towards precise metrics for predicting graph query performance.", "fields": ["rdf query language", "spatial query", "web query classification", "query expansion", "sargable"], "abstract": "Queries are the foundations of data intensive applications. In model-driven software engineering (MDSE), model queries are core technologies of tools and transformations. As software models are rapidly increasing in size and complexity, most MDSE tools frequently exhibit scalability issues that decrease developer productivity and increase costs. As a result, choosing the right model representation and query evaluation approach is a significant challenge for tool engineers. In the current paper, we aim to provide a benchmarking framework for the systematic investigation of query evaluation performance. More specifically, we experimentally evaluate (existing and novel) query and instance model metrics to highlight which provide sufficient performance estimates for different MDSE scenarios in various model query tools. For that purpose, we also present a comparative benchmark, which is designed to differentiate model representation and graph query evaluation approaches according to their performance when using large models and complex queries.", "citation": "Citations (15)", "year": "2013", "departments": ["Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics"], "conf": "kbse", "authors": ["Benedek Izsó.....http://dblp.org/pers/hd/i/Izs=oacute=:Benedek", "Zoltán Szatmári.....http://dblp.org/pers/hd/s/Szatm=aacute=ri:Zolt=aacute=n", "Gábor Bergmann.....http://dblp.org/pers/hd/b/Bergmann:G=aacute=bor", "Ákos Horváth.....http://dblp.org/pers/hd/h/Horv=aacute=th:=Aacute=kos", "István Ráth.....http://dblp.org/pers/hd/r/R=aacute=th:Istv=aacute=n"], "pages": 11}