{"title": "GeoF: Geodesic Forests for Learning Coupled Predictors.", "fields": ["random forest", "geodesic", "structured prediction", "scale space segmentation", "conditional random field"], "abstract": "Conventional decision forest based methods for image labelling tasks like object segmentation make predictions for each variable (pixel) independently [3, 5, 8]. This prevents them from enforcing dependencies between variables and translates into locally inconsistent pixel labellings. Random field models, instead, encourage spatial consistency of labels at increased computational expense. This paper presents a new and efficient forest based model that achieves spatially consistent semantic image segmentation by encoding variable dependencies directly in the feature space the forests operate on. Such correlations are captured via new long-range, soft connectivity features, computed via generalized geodesic distance transforms. Our model can be thought of as a generalization of the successful Semantic Texton Forest, Auto-Context, and Entangled Forest models. A second contribution is to show the connection between the typical Conditional Random Field (CRF) energy and the forest training objective. This analysis yields a new objective for training decision forests that encourages more accurate structured prediction. Our GeoF model is validated quantitatively on the task of semantic image segmentation, on four challenging and very diverse image datasets. GeoF outperforms both state of-the-art forest models and the conventional pair wise CRF.", "citation": "Citations (71)", "year": "2013", "departments": ["Graz University of Technology", "Microsoft", "Microsoft", "Microsoft"], "conf": "cvpr", "authors": ["Peter Kontschieder.....http://dblp.org/pers/hd/k/Kontschieder:Peter", "Pushmeet Kohli.....http://dblp.org/pers/hd/k/Kohli:Pushmeet", "Jamie Shotton.....http://dblp.org/pers/hd/s/Shotton:Jamie", "Antonio Criminisi.....http://dblp.org/pers/hd/c/Criminisi:Antonio"], "pages": 8}