{"title": "A performance analysis of CSMA based broadcast protocol in VANETs.", "fields": ["network packet", "stochastic geometry models of wireless networks", "asynchronous communication", "vehicular ad hoc network", "multiple access with collision avoidance for wireless"], "abstract": "The broadcast of periodic messages is a key functionality in vehicular ad hoc networks. In the emerging vehicular networks, IEEE 802.11p is the standard of choice to support the PHY and MAC layer functionalities. The broadcast process in IEEE 802.11p is based on the CSMA mechanism where a device transmitting a packet senses the channel for ongoing transmissions and performs a random back-off before accessing the channel. Without RTS/CTS mechanisms, carrier sensing is expected to provide a protection region around the transmitter where no other transmitters are allowed. The point process characterizing the concurrent transmitters is expected to enforce a minimum separation between concurrent transmitters. However, at increasing densities, the CSMA behavior breaks down to an ALOHA-like transmission pattern where concurrent transmitters are distributed as a Poisson point process, indicating the lack of protection around transmitters. In this paper, we model the CSMA mechanism as a slotted system and analytically characterize the critical node/packet arrival density where the CSMA mechanism approaches an ALOHAlike behavior. Further, we use tools from stochastic geometry to establish closed-form expressions for the performance metrics of the broadcast mechanism in the ALOHA regime. Finally, using ns2 (an unslotted asynchronous simulator), we compare the theoretical results with simulations.", "citation": "Citations (25)", "departments": ["École Normale Supérieure", "University of Texas at Austin", "Arizona State University", "Qualcomm", "Qualcomm"], "authors": ["Nguyen Tien Viet.....http://dblp.org/pers/hd/v/Viet:Nguyen_Tien", "François Baccelli.....http://dblp.org/pers/hd/b/Baccelli:Fran=ccedil=ois", "Kai Zhu.....http://dblp.org/pers/hd/z/Zhu:Kai", "Sundar Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Sundar", "Xinzhou Wu.....http://dblp.org/pers/hd/w/Wu:Xinzhou"], "conf": "infocom", "year": "2013", "pages": 9}