{"title": "Hybrid latency tolerance for robust energy-efficiency on 1000-core data parallel processors.", "fields": ["temporal multithreading", "performance per watt", "design space exploration", "multithreading", "physical design"], "abstract": "Currently, GPUs and data parallel processors leverage latency tolerance techniques such as multithreading and prefetching to maximize performance per Watt. However, choosing a technique that provides energy-efficiency on a wide variety of workloads is difficult, as the type of latency to tolerate, required hardware complexity, and energy consumption is directly related to application behavior. After qualitatively evaluating five commonly used latency tolerance techniques, we develop a hybrid technique utilizing multithreading and decoupled execution to maximize performance while minimizing hardware complexity and energy consumption across a wide variety of workloads. We compare our hybrid technique with the five commonly used techniques on a 1024-core data parallel processor by performing a comprehensive design space exploration, leveraging detailed performance and physical design models. By intelligently leveraging both decoupled execution and multithreading, our hybrid latency tolerance technique is able to improve energy-efficiency by 28% to 89% over any single technique on data parallel benchmarks. Compared to other combinations of latency tolerance techniques, we find that our hybrid latency tolerance technique provides the highest energy-efficiency by over 26%.", "citation": "Not cited", "departments": ["Intel", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "HiCAMP Systems, Inc, USA"], "authors": ["Neal Clayton Crago.....http://dblp.org/pers/hd/c/Crago:Neal_Clayton", "Omid Azizi.....http://dblp.org/pers/hd/a/Azizi:Omid", "Steven S. Lumetta.....http://dblp.org/pers/hd/l/Lumetta:Steven_S=", "Sanjay J. Patel.....http://dblp.org/pers/hd/p/Patel:Sanjay_J="], "conf": "hpca", "year": "2013", "pages": 12}