{"title": "Towards efficient search for activity trajectories.", "fields": ["query optimization", "web query classification", "query expansion", "sargable", "nearest neighbor search"], "abstract": "The advances in location positioning and wireless communication technologies have led to a myriad of spatial trajectories representing the mobility of a variety of moving objects. While processing trajectory data with the focus of spatio-temporal features has been widely studied in the last decade, recent proliferation in location-based web applications (e.g., Foursquare, Facebook) has given rise to large amounts of trajectories associated with activity information, called activity trajectory. In this paper, we study the problem of efficient similarity search on activity trajectory database. Given a sequence of query locations, each associated with a set of desired activities, an activity trajectory similarity query (ATSQ) returns k trajectories that cover the query activities and yield the shortest minimum match distance. An order-sensitive activity trajectory similarity query (OATSQ) is also proposed to take into account the order of the query locations. To process the queries efficiently, we firstly develop a novel hybrid grid index, GAT, to organize the trajectory segments and activities hierarchically, which enables us to prune the search space by location proximity and activity containment simultaneously. In addition, we propose algorithms for efficient computation of the minimum match distance and minimum order-sensitive match distance, respectively. The results of our extensive empirical studies based on real online check-in datasets demonstrate that our proposed index and methods are capable of achieving superior performance and good scalability.", "citation": "Citations (100)", "departments": ["University of Queensland", "Aalborg University", "Microsoft", "Carnegie Mellon University"], "authors": ["Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Shuo Shang.....http://dblp.org/pers/hd/s/Shang:Shuo", "Nicholas Jing Yuan.....http://dblp.org/pers/hd/y/Yuan:Nicholas_Jing", "Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi"], "conf": "icde", "year": "2013", "pages": 12}