{"title": "Candidate Indistinguishability Obfuscation and Functional Encryption for all Circuits.", "fields": ["deterministic encryption", "ciphertext", "functional encryption", "56 bit encryption", "ciphertext indistinguishability", "obfuscation", "electronic circuit", "computational indistinguishability", "disk encryption theory", "theoretical computer science"], "abstract": "In this work, we study indistinguishability obfuscation and functional encryption for general circuits: Indistinguishability obfuscation requires that given any two equivalent circuits C 0  and C 1  of similar size, the obfuscations of C 0  and C 1  should be computationally indistinguishable. In functional encryption, cipher texts encrypt inputs x and keys are issued for circuits C. Using the key SK C  to decrypt a cipher text CT x  = Enc(x), yields the value C(x) but does not reveal anything else about x. Furthermore, no collusion of secret key holders should be able to learn anything more than the union of what they can each learn individually. We give constructions for indistinguishability obfuscation and functional encryption that supports all polynomial-size circuits. We accomplish this goal in three steps: - (1) We describe a candidate construction for indistinguishability obfuscation for NC 1  circuits. The security of this construction is based on a new algebraic hardness assumption. The candidate and assumption use a simplified variant of multilinear maps, which we call Multilinear Jigsaw Puzzles. (2) We show how to use indistinguishability obfuscation for NC 1  together with Fully Homomorphic Encryption (with decryption in NC 1 ) to achieve indistinguishability obfuscation for all circuits. (3) Finally, we show how to use indistinguishability obfuscation for circuits, public-key encryption, and non-interactive zero knowledge to achieve functional encryption for all circuits. The functional encryption scheme we construct also enjoys succinct cipher texts, which enables several other applications.", "citation": "Citations (816)", "year": "2013", "departments": ["University of California, Los Angeles", "IBM", "IBM", "IBM", "University of California, Los Angeles"], "conf": "focs", "authors": ["Sanjam Garg.....http://dblp.org/pers/hd/g/Garg:Sanjam", "Craig Gentry.....http://dblp.org/pers/hd/g/Gentry:Craig", "Shai Halevi.....http://dblp.org/pers/hd/h/Halevi:Shai", "Mariana Raykova.....http://dblp.org/pers/hd/r/Raykova_0001:Mariana", "Amit Sahai.....http://dblp.org/pers/hd/s/Sahai:Amit", "Brent Waters.....http://dblp.org/pers/hd/w/Waters:Brent"], "pages": 10}