{"title": "Finding incorrect compositions of atomicity.", "fields": ["heuristics", "false positive paradox", "atomicity", "inference", "concurrent computing"], "abstract": "In object-oriented code, atomicity is ideally isolated in a library which encapsulates shared program state and provides atomic APIs for access. The library provides a convenient way for programmers to reason about the needed synchronization. However, as the library exports a limited set of APIs, it cannot satisfy every unplanned atomicity demand; therefore, clients may have to compose invocations of the library APIs to obtain new atomic functionality. This process is error-prone due to the complexity of reasoning required, hence tool support for uncovering incorrect compositions (i.e., atomic compositions that are implemented incorrectly) would be very helpful. A key difficulty is how to determine the intended atomic compositions, which are rarely documented. Existing inference techniques cannot be used to infer the atomic compositions because they cannot recognize the library and the client, which requires understanding the related program state. Even if extended to support the library/client, they lead to many false positives or false negatives because they miss the key program logic which reflects programmers’ coding paradigms for atomic compositions.     We define a new inference technique which identifies intended atomic compositions using two key symptoms based on program dependence. We then check dynamically whether these atomic compositions are implemented incorrectly as non-atomic. Evaluation on thirteen large applications shows that our approach finds around 50 previously unknown incorrect compositions. Further study on Tomcat shows that almost half (5 out of 12) of discovered incorrect compositions are confirmed as bugs by the developers. Given that Tomcat is heavily used in 250,000 sites including Linkedin.com and Ebay.com, we believe finding multiple new bugs in it automatically with relatively few false positives supports our heuristics for determining intended atomicity.", "citation": "Citations (14)", "departments": ["Hong Kong University of Science and Technology", "IBM", "Hong Kong University of Science and Technology"], "authors": ["Peng Liu.....http://dblp.org/pers/hd/l/Liu_0010:Peng", "Julian Dolby.....http://dblp.org/pers/hd/d/Dolby:Julian", "Charles Zhang.....http://dblp.org/pers/hd/z/Zhang:Charles"], "conf": "sigsoft", "year": "2013", "pages": 11}