{"title": "New bounds for matching vector families.", "fields": ["prime", "conjecture", "modulo", "combinatorics", "composite number", "quadratic equation", "exponential function", "modulus"], "abstract": "A Matching Vector (MV) family modulo m is a pair of ordered lists U=(u 1 ,...,u t ) and V=(v 1 ,...,v t ) where u i ,v j  ∈ Z m  n  with the following inner product pattern: for any i, {u i ,v i }=0, and for any i ≠ j, {u i ,v j } ≠ 0. A MV family is called q-restricted if inner products {u i ,v j } take at most q different values.   Our interest in MV families stems from their recent application in the construction of sub-exponential locally decodable codes (LDCs). There, q-restricted MV families are used to construct LDCs with q queries, and there is special interest in the regime where q is constant. When m is a prime it is known that such constructions yield codes with exponential block length. However, for composite m the behaviour is dramatically different. A recent work by Efremenko [8] (based on an approach initiated by Yekhanin [24]) gives the first sub-exponential LDC with constant queries. It is based on a construction of a MV family of super-polynomial size by Grolmusz [10] modulo composite m.   In this work, we prove two lower bounds on the block length of LDCs which are based on black box construction using MV families. When q is constant (or sufficiently small), we prove that such LDCs must have a quadratic block length. When the modulus m is constant (as it is in the construction of Efremenko [8]) we prove a super-polynomial lower bound on the block-length of the LDCs, assuming a well-known conjecture in additive combinatorics, the polynomial Freiman-Ruzsa conjecture over Z m .", "citation": "Citations (10)", "year": "2013", "departments": ["University of Texas at Austin", "Princeton University", "Institute for Advanced Study"], "conf": "stoc", "authors": ["Abhishek Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick_0001:Abhishek", "Zeev Dvir.....http://dblp.org/pers/hd/d/Dvir:Zeev", "Shachar Lovett.....http://dblp.org/pers/hd/l/Lovett:Shachar"], "pages": 10}