{"title": "A framework for truthful online auctions in cloud computing with heterogeneous user demands.", "fields": ["cheating", "trusted computing", "cost accounting", "common value auction", "bidding", "on the fly", "payment"], "abstract": "The paradigm of cloud computing has spontaneously prompted a wide interest in market-based resource allocation mechanisms by which a cloud provider aims at efficiently allocating cloud resources among potential users. Among these mechanisms, auction-style pricing policies, as they can effectively reflect the underlying trends in demand and supply for the computing resources, have attracted a research interest recently. This paper conducts the first work on a framework for truthful online cloud auctions where users with heterogeneous demands could come and leave on the fly. Our framework desirably supports a variety of design requirements, including (1) dynamic design for timely reflecting fluctuation of supply-demand relations, (2) joint design for supporting the heterogeneous user demands, and (3) truthful design for discouraging bidders from cheating behaviors. Concretely speaking, we first design a novel bidding language, wherein users' heterogeneous demands are generalized to regulated and consistent forms. Besides, building on top of our bidding language we propose COCA, an incentive-Compatible (truthful) Online Cloud Auction mechanism based on two proposed guidelines. Our theoretical analysis shows that the worst-case performance of COCA can be well-bounded. Further, in simulations the performance of COCA is seen to be comparable to the well-known off-line Vickrey-Clarke-Groves (VCG) mechanism [11].", "citation": "Citations (167)", "departments": ["Huazhong University of Science and Technology", "Hong Kong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Kuwait University", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Hong Kong University of Science and Technology", "Huazhong University of Science and Technology", "Kuwait University"], "authors": ["Hong Zhang.....http://dblp.org/pers/hd/z/Zhang:Hong", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Hongbo Jiang.....http://dblp.org/pers/hd/j/Jiang:Hongbo", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Athanasios V. Vasilakos.....http://dblp.org/pers/hd/v/Vasilakos:Athanasios_V=", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan"], "conf": "infocom", "year": "2013", "pages": 9}