{"title": "Concurrent deletion in a distributed content-addressable storage system with global deduplication.", "fields": ["data deduplication", "high availability", "reference counting", "backup", "content addressable storage"], "abstract": "Scalable, highly reliable distributed systems supporting data deduplication have recently become popular for storing backup and archival data. One of the important requirements for backup storage is the ability to delete data selectively. Unlike in traditional storage systems, data deletion in distributed systems with deduplication is a major challenge because deduplication leads to multiple owners of data chunks. Moreover, system configuration changes often due to node additions, deletions and failures. Expected high performance, high availability and low impact of deletion on regular user operations additionally complicate identification and reclamation of unnecessary blocks.\n\nThis paper describes a deletion algorithm for a scalable, content-addressable storage with global deduplication. The deletion is concurrent: user reads and writes can proceed in parallel with deletion with only minor restrictions established to make reclamation feasible. Moreover, our approach allows for deduplication of user writes during deletion. We extend traditional distributed reference counting to deliver a failure-tolerant deletion that accommodates not only deduplication, but also the dynamic nature of a scalable system and its physical resource constraints. The proposed algorithm has been verified with an implementation in a commercial deduplicating storage system. The impact of deletion on user operations is configurable. Using a default setting that grants deletion maximum 30% of system resources running the deletion reduces end performance by not more that 30%. This impact can be reduced to less than 5% when deletion is given only minimal resources.", "citation": "Citations (16)", "departments": ["9LivesData, LLC", "9LivesData, LLC", "9LivesData, LLC", "9LivesData, LLC", "9LivesData, LLC"], "authors": ["Przemyslaw Strzelczak.....http://dblp.org/pers/hd/s/Strzelczak:Przemyslaw", "Elzbieta Adamczyk.....http://dblp.org/pers/hd/a/Adamczyk:Elzbieta", "Urszula Herman-Izycka.....http://dblp.org/pers/hd/h/Herman=Izycka:Urszula", "Jakub Sakowicz.....http://dblp.org/pers/hd/s/Sakowicz:Jakub", "Lukasz Slusarczyk.....http://dblp.org/pers/hd/s/Slusarczyk:Lukasz", "Jaroslaw Wrona.....http://dblp.org/pers/hd/w/Wrona:Jaroslaw", "Cezary Dubnicki.....http://dblp.org/pers/hd/d/Dubnicki:Cezary"], "conf": "fast", "year": "2013", "pages": 14}