{"title": "PCPs via Low-Degree Long Code and Hardness for Constrained Hypergraph Coloring.", "fields": ["hypergraph", "constraint satisfaction problem", "combinatorics", "hardness of approximation", "constraint graph", "long code", "discrete mathematics", "mathematics", "covering number"], "abstract": "We develop new techniques to incorporate the recently proposed “short code” (a low-degree version of the long code) into the construction and analysis of PCPs in the classical “Label Cover + Fourier Analysis” framework. As a result, we obtain more size-efficient PCPs that yield improved hardness results for approximating CSPs and certain coloringtype problems. In particular, we show a hardness for a variant of hypergraph coloring (with hyperedges of size 6), with a gap between 2 and exp(2 Ω (√log log N)) number of colors where N is the number of vertices. This is the first hardness result to go beyond the O(log N) barrier for a coloring-type problem. Our hardness bound is a doubly exponential improvement over the previously known O(log log N)-coloring hardness for 2-colorable hypergraphs, and an exponential improvement over the (logN) Ω(1) -coloring hardness for O(1)-colorable hypergraphs. Stated in terms of “covering complexity,” we show that for 6-ary Boolean CSPs, it is hard to decide if a given instance is perfectly satisfiable or if it requires more than 2Ω(√log log N) assignments for covering all of the constraints. While our methods do not yield a result for conventional hypergraph coloring due to some technical reasons, we also prove hardness of (log N) Ω(1) -coloring 2-colorable 6-uniform hypergraphs (this result relies just on the long code). A key algebraic result driving our analysis concerns a very low-soundness error testing method for Reed-Muller codes. We prove that if a function β : F 2  m  → F 2  is 2 Ω(d)  far in absolute distance from polynomials of degree m-d, then the probability that deg(βg) ≤ m-3d/4 for a random degree d/4 polynomial g is doubly exponentially small in d.", "citation": "Not cited", "year": "2013", "departments": ["Weizmann Institute of Science", "Carnegie Mellon University"], "conf": "focs", "authors": ["Irit Dinur.....http://dblp.org/pers/hd/d/Dinur:Irit", "Venkatesan Guruswami.....http://dblp.org/pers/hd/g/Guruswami:Venkatesan"], "pages": 10}