{"title": "Maximizing social welfare in operator-based Cognitive Radio Networks under spectrum uncertainty and sensing inaccuracy.", "fields": ["incentive compatibility", "cognitive radio", "online algorithm", "markov decision process", "spectrum auction"], "abstract": "In Cognitive Radio Networks (CRNs), secondary users (SUs) are allowed to opportunistically access the unused/under-utilized channels of primary users (PUs). To utilize spectrum resources efficiently, an auction scheme is often applied where an operator serves as an auctioneer and accepts spectrum requests from SUs. Most existing works on spectrum auctions assume that the operator has perfect knowledge of PU activities. In practice, however, it is more likely that the operator only has statistical information of the PU traffic when it is trading a spectrum hole, and it is acquiring more accurate information in real time. In this paper, we distinguish PU channels that are under the control of the operator, where accurate channel states are revealed in real-time, and channels that the operator acquires from PUs out of its control, where a sense-before-use paradigm has to be followed. Considering both spectrum uncertainty and sensing inaccuracy, we study the social welfare maximization problem for serving SUs with various levels of delay tolerance. We first model the problem as a finite horizon Markov decision process when the operator knows all spectrum requests in advance, and propose an optimal dynamic programming based algorithm. We then investigate the case when spectrum requests are submitted online, and propose a greedy algorithm that is 1/2-competitive for homogeneous channels and is comparable to the offline algorithm for more general settings. We further extend the online algorithm to an online auction scheme, which ensures incentive compatibility for the SUs and also provides a way for trading off social welfare and revenue.", "citation": "Citations (8)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Shuang Li.....http://dblp.org/pers/hd/l/Li_0007:Shuang", "Zizhan Zheng.....http://dblp.org/pers/hd/z/Zheng:Zizhan", "Eylem Ekici.....http://dblp.org/pers/hd/e/Ekici:Eylem", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2013", "pages": 9}