{"title": "Mantis: Automatic Performance Prediction for Smartphone Applications.", "fields": ["nexus", "executable", "program slicing", "android", "mantis"], "abstract": "We present Mantis, a framework for predicting the performance of Android applications on given inputs automatically, accurately, and efficiently. A key insight underlying Mantis is that program execution runs often contain features that correlate with performance and are automatically computable efficiently. Mantis synergistically combines techniques from program analysis and machine learning. It constructs concise performance models by choosing from many program execution features only a handful that are most correlated with the program's execution time yet can be evaluated efficiently from the program's input. We apply program slicing to accurately estimate the evaluation cost of a feature and automatically generate executable code snippets for efficiently evaluating features. Our evaluation shows that Mantis predicts the execution time of six Android apps with estimation error in the range of 2.2-11.9% by executing predictor code costing at most 1.3% of their execution time on Galaxy Nexus.", "citation": "Citations (33)", "departments": ["Seoul National University", "University of Texas at Austin", "Seoul National University", "Seoul National University", "Seoul National University"], "authors": ["Yongin Kwon.....http://dblp.org/pers/hd/k/Kwon:Yongin", "Sangmin Lee.....http://dblp.org/pers/hd/l/Lee:Sangmin", "Hayoon Yi.....http://dblp.org/pers/hd/y/Yi:Hayoon", "Donghyun Kwon.....http://dblp.org/pers/hd/k/Kwon:Donghyun", "Seungjun Yang.....http://dblp.org/pers/hd/y/Yang:Seungjun", "Byung-Gon Chun.....http://dblp.org/pers/hd/c/Chun:Byung=Gon", "Ling Huang.....http://dblp.org/pers/hd/h/Huang:Ling", "Petros Maniatis.....http://dblp.org/pers/hd/m/Maniatis:Petros", "Mayur Naik.....http://dblp.org/pers/hd/n/Naik:Mayur", "Yunheung Paek.....http://dblp.org/pers/hd/p/Paek:Yunheung"], "conf": "usenix", "year": "2013", "pages": 12}