{"title": "Handling Noise in Single Image Deblurring Using Directional Filters.", "fields": ["non local means", "image restoration", "gaussian blur", "deblurring", "kernel density estimation"], "abstract": "State-of-the-art single image deblurring techniques are sensitive to image noise. Even a small amount of noise, which is inevitable in low-light conditions, can degrade the quality of blur kernel estimation dramatically. The recent approach of Tai and Lin [17] tries to iteratively denoise and deblur a blurry and noisy image. However, as we show in this work, directly applying image denoising methods often partially damages the blur information that is extracted from the input image, leading to biased kernel estimation. We propose a new method for handling noise in blind image deconvolution based on new theoretical and practical insights. Our key observation is that applying a directional low-pass filter to the input image greatly reduces the noise level, while preserving the blur information in the orthogonal direction to the filter. Based on this observation, our method applies a series of directional filters at different orientations to the input image, and estimates an accurate Radon transform of the blur kernel from each filtered image. Finally, we reconstruct the blur kernel using inverse Radon transform. Experimental results on synthetic and real data show that our algorithm achieves higher quality results than previous approaches on blurry and noisy images.", "citation": "Citations (140)", "year": "2013", "departments": ["Rutgers University", "Adobe Systems", "Rutgers University", "Adobe Systems", "Adobe Systems"], "conf": "cvpr", "authors": ["Lin Zhong.....http://dblp.org/pers/hd/z/Zhong_0002:Lin", "Sunghyun Cho.....http://dblp.org/pers/hd/c/Cho:Sunghyun", "Dimitris N. Metaxas.....http://dblp.org/pers/hd/m/Metaxas:Dimitris_N=", "Sylvain Paris.....http://dblp.org/pers/hd/p/Paris:Sylvain", "Jue Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jue"], "pages": 8}