{"title": "A trie merging approach with incremental updates for virtual routers.", "fields": ["trie", "forwarding information base", "network virtualization", "static random access memory", "virtualization"], "abstract": "Virtual routers are increasingly being studied, as an important building block to enable network virtualization. In a virtual router platform, multiple virtual router instances coexist, each having its own FIB (Forwarding Information Base). In this context, memory scalability and route updates are two major challenges. Existing approaches addressed one of these challenges but not both. In this paper, we present a trie merging approach, which compactly represents multiple FIBs by a merged trie and a table of next-hop-pointer arrays to achieve good memory scalability, while supporting fast incremental updates by avoiding the use of leaf pushing during merging. Experimental results show that storing the merged trie requires limited memory space, e.g., we only need 10MB memory space to store the merged trie for 14 full FIBs from IPv4 core routers, achieving a memory reduction by 87% when compared to the total size of the individual tries. We implement our approach in an SRAM (Static Random Access Memory)-based lookup pipeline. Using our approach, an on-chip SRAM-based lookup pipeline with 5 external stages is sufficient to store the 14 full IPv4 FIBs. Furthermore, our approach can guarantee a minimum update overhead of one write bubble per update, as well as a high lookup throughput of one lookup per clock cycle, which corresponds to a throughput of 251 million lookups per second in the implementation.", "citation": "Citations (11)", "departments": ["Queen Mary University of London", "University of Liège", "Inst. of Comput ...  Beijing, China", "Inst. of Comput ...  Beijing, China", "Univ. of Savoie, France"], "authors": ["Layong Luo.....http://dblp.org/pers/hd/l/Luo:Layong", "Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang", "Kavé Salamatian.....http://dblp.org/pers/hd/s/Salamatian:Kav=eacute=", "Steve Uhlig.....http://dblp.org/pers/hd/u/Uhlig:Steve", "Laurent Mathy.....http://dblp.org/pers/hd/m/Mathy:Laurent", "Yingke Xie.....http://dblp.org/pers/hd/x/Xie:Yingke"], "conf": "infocom", "year": "2013", "pages": 9}