{"title": "Map task scheduling in MapReduce with data locality: Throughput and heavy-traffic optimality.", "fields": ["queue", "throughput", "parallel algorithm", "queueing theory", "locality"], "abstract": "Scheduling map tasks to improve data locality is crucial to the performance of MapReduce. Many works have been devoted to increasing data locality for better efficiency. However, to the best of our knowledge, fundamental limits of MapReduce computing clusters with data locality, including the capacity region and theoretical bounds on the delay performance, have not been studied. In this paper, we address these problems from a stochastic network perspective. Our focus is to strike the right balance between data-locality and load-balancing to simultaneously maximize throughput and minimize delay. We present a new queueing architecture and propose a map task scheduling algorithm constituted by the Join the Shortest Queue policy together with the MaxWeight policy. We identify an outer bound on the capacity region, and then prove that the proposed algorithm stabilizes any arrival rate vector strictly within this outer bound. It shows that the algorithm is throughput optimal and the outer bound coincides with the actual capacity region. Further, we study the number of backlogged tasks under the proposed algorithm, which is directly related to the delay performance based on Little's law. We prove that the proposed algorithm is heavy-traffic optimal, i.e., it asymptotically minimizes the number of backlogged tasks as the arrival rate vector approaches the boundary of the capacity region. Therefore, the proposed algorithm is also delay optimal in the heavy-traffic regime.", "citation": "Citations (150)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "IBM", "IBM"], "authors": ["Weina Wang.....http://dblp.org/pers/hd/w/Wang:Weina", "Kai Zhu.....http://dblp.org/pers/hd/z/Zhu:Kai", "Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei", "Jian Tan.....http://dblp.org/pers/hd/t/Tan:Jian", "Li Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Li"], "conf": "infocom", "year": "2013", "pages": 9}