{"title": "Inherent PUFs and secure PRNGs on commercial off-the-shelf microcontrollers.", "fields": ["pseudorandom number generator", "arm architecture", "commercial off the shelf", "physical unclonable function", "strong cryptography"], "abstract": "Research on Physically Unclonable Functions (PUFs) has become very popular in recent years. However, all PUFs researched so far require either ASICs, FPGAs or a microcontroller with external components. Our research focuses on identifying PUFs in commercial off-the-shelf devices, e.g. microcontrollers. We show that PUFs exist in several off-theshelf products, which can be used for security applications. We present measurement results on the PUF behavior of five of the most popular microcontrollers today: ARM Cortex A,ARM Cortex-M,Atmel AVR, Microchip PIC16 and Texas Instruments MSP430. Based on these measurements, we can calculate whether these chips can be considered for applications requiring strong cryptography. As a result of these findings, we present a secure bootloader for the ARM Cortex-A9 platform based on a PUF inherent to the device, requiring no external components. Furthermore, instead of discarding the randomness in PUF responses, we utilize this to create strong seeds for pseudo-random number generators (PRNGs). The existence of a secure RNG is at the heart of virtually every cryptographic protocol, yet very often overlooked. We present the implementation of a strongly seeded PRNG for the ARM Cortex-M family, again requiring no external components.", "citation": "Citations (4)", "year": "2013", "departments": ["Katholieke Universiteit Leuven", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "Katholieke Universiteit Leuven"], "conf": "ccs", "authors": ["Anthony Van Herrewege.....http://dblp.org/pers/hd/h/Herrewege:Anthony_Van", "André Schaller.....http://dblp.org/pers/hd/s/Schaller:Andr=eacute=", "Stefan Katzenbeisser.....http://dblp.org/pers/hd/k/Katzenbeisser_0001:Stefan", "Ingrid Verbauwhede.....http://dblp.org/pers/hd/v/Verbauwhede:Ingrid"], "pages": 4}