{"title": "An energy-efficient and scalable eDRAM-based register file architecture for GPGPU.", "fields": ["edram", "register file", "static random access memory", "general purpose computing on graphics processing units", "data integrity"], "abstract": "The heavily-threaded data processing demands of streaming multiprocessors (SM) in a GPGPU require a large register file (RF). The fast increasing size of the RF makes the area cost and power consumption unaffordable for traditional SRAM designs in the future technologies. In this paper, we propose to use embedded-DRAM (eDRAM) as an alternative in future GPGPUs. Compared with SRAM, eDRAM provides higher density and lower leakage power. However, the limited data retention time in eDRAM poses new challenges. Periodic refresh operations are needed to maintain data integrity. This is exacerbated with the scaling of eDRAM density, process variations and temperature. Unlike conventional CPUs which make use of multi-ported RF, most of the RFs in modern GPGPU are heavily banked but not multi-ported to reduce the hardware cost. This provides a unique opportunity to hide the refresh overhead. We propose two different eDRAM implementations based on 3T1D and 1T1C memory cells. To mitigate the impact of periodic refresh, we propose two novel refresh solutions using bank bubble and bank walk-through. Plus, for the 1T1C RF, we design an interleaved bank organization together with an intelligent warp scheduling strategy to reduce the impact of the destructive reads. The analysis shows that our schemes present better energy efficiency, scalability and variation tolerance than traditional SRAM-based designs.", "citation": "Citations (56)", "year": "2013", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Polytechnic University of Catalonia", "Shanghai Jiao Tong University"], "conf": "isca", "authors": ["Naifeng Jing.....http://dblp.org/pers/hd/j/Jing:Naifeng", "Yao Shen.....http://dblp.org/pers/hd/s/Shen:Yao", "Yao Lu.....http://dblp.org/pers/hd/l/Lu:Yao", "Shrikanth Ganapathy.....http://dblp.org/pers/hd/g/Ganapathy:Shrikanth", "Zhigang Mao.....http://dblp.org/pers/hd/m/Mao:Zhigang", "Minyi Guo.....http://dblp.org/pers/hd/g/Guo:Minyi", "Ramon Canal.....http://dblp.org/pers/hd/c/Canal:Ramon", "Xiaoyao Liang.....http://dblp.org/pers/hd/l/Liang:Xiaoyao"], "pages": 12}