{"title": "Optimal dynamic power control for full-duplex bidirectional-channel based wireless networks.", "fields": ["radio resource management", "convex optimization", "single antenna interference cancellation", "karush kuhn tucker conditions", "signal to interference plus noise ratio"], "abstract": "We consider the full-duplex transmission over bidirectional channels with imperfect self-interference cancelation in wireless networks. In particular, together using propagation-domain interference suppression, analog-domain interference cancellation, and digital-domain interference cancellation, we develop the optimal dynamic power allocation schemes for the wireless full-duplex sum-rate optimization problem which aims at maximizing the sum-rate of wireless full-duplex bidirectional transmissions. In the high signal-to-interference-plus-noise ratio (SINR) region, the full-duplex sum-rate maximization problem is a convex optimization problem. For interference-dominated wireless full-duplex transmission in the high SINR region, we derive the closed-form expression for the optimal dynamic power allocation scheme. For non-interference-dominated wireless full-duplex transmission in the high SINR region, we obtain the optimal dynamic power allocation scheme by numerically solving the corresponding Karush-Kuhn-Tucker (KKT) conditions. While the full-duplex sum-rate maximization problem is usually not a convex optimization problem, by developing the tightest lower-bound function and using the logarithmic change of variables technique, we convert the full-duplex sum-rate maximization problem to a convex optimization problem. Then, using our proposed iteration algorithm, we can numerically derive the optimal dynamic power allocation scheme for the more generic scenario. Also presented are the numerical results which validate our developed optimal dynamic power allocation schemes.", "citation": "Citations (40)", "departments": ["Xidian University", "Texas A&M University", "Xidian University"], "authors": ["Wenchi Cheng.....http://dblp.org/pers/hd/c/Cheng:Wenchi", "Xi Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Xi", "Hailin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Hailin"], "conf": "infocom", "year": "2013", "pages": 9}