{"title": "Economic-robust transmission opportunity auction in multi-hop wireless networks.", "fields": ["incentive compatibility", "spectrum management", "cognitive radio", "bandwidth allocation", "spectrum auction"], "abstract": "The rapid growth of wireless devices and services exacerbates the problem of spectrum scarcity in wireless networks. Recently, spectrum auction has emerged as one of the most promising techniques to enhance spectrum utilization and mitigate this problem. Although there exist some works studying spectrum auction, most of them are designed for single-hop communications, and it is usually not clear whom a winning user communicates with. Moreover, most previous auction schemes only focus on satisfying the incentive compatibility property, also called truthfulness, but ignore another two critical properties: individual rationality, and budget balance. Thus, they may not be economic-robust. In this paper, we propose a transmission opportunity auction scheme, called TOA, which can support multi-hop data traffic, ensure economic-robustness, and generate high revenue for the auctioneer. Specifically, in TOA, instead of spectrum bands as in traditional spectrum auction schemes, users bid for transmission opportunities (TOs). A TO is defined as the permit of data transmission on a specific link using a certain band, i.e., a link-band pair. The TOA scheme is composed of three procedures: TO allocation, TO scheduling, and pricing, which are performed sequentially and iteratively until the aforementioned goals are reached. We prove that TOA is economic-robust, and conduct extensive simulations to show its effectiveness and efficiency.", "citation": "Citations (16)", "departments": ["Mississippi State University", "Mississippi State University", "Texas Southern University", "University of Tennessee"], "authors": ["Ming Li.....http://dblp.org/pers/hd/l/Li_0006:Ming", "Pan Li.....http://dblp.org/pers/hd/l/Li_0001:Pan", "Miao Pan.....http://dblp.org/pers/hd/p/Pan:Miao", "Jinyuan Sun.....http://dblp.org/pers/hd/s/Sun:Jinyuan"], "conf": "infocom", "year": "2013", "pages": 9}