{"title": "DAC-MACS: Effective data access control for multi-authority cloud storage systems.", "fields": [], "abstract": "Data access control is an effective way to ensure the data security in the cloud. However, due to data outsourcing and untrusted cloud servers, the data access control becomes a challenging issue in cloud storage systems. Existing access control schemes are no longer applicable to cloud storage systems, because they either produce multiple encrypted copies of the same data or require a fully trusted cloud server. Ciphertext-Policy Attribute-based Encryption (CP-ABE) is a promising technique for access control of encrypted data. It requires a trusted authority manages all the attributes and distributes keys in the system. In cloud storage systems, there are multiple authorities co-exist and each authority is able to issue attributes independently. However, existing CP-ABE schemes cannot be directly applied to data access control for multi-authority cloud storage systems, due to the inefficiency of decryption and revocation. In this paper, we propose DAC-MACS (Data Access Control for Multi-Authority Cloud Storage), an effective and secure data access control scheme with efficient decryption and revocation. Specifically, we construct a new multi-authority CP-ABE scheme with efficient decryption and also design an efficient attribute revocation method that can achieve both forward security and backward security. The analysis and the simulation results show that our DAC-MACS is highly efficient and provably secure under the security model.", "citation": "Citations (357)", "departments": ["City University of Hong Kong", "City University of Hong Kong", "University at Buffalo", "City University of Hong Kong"], "authors": ["Kan Yang.....http://dblp.org/pers/hd/y/Yang_0001:Kan", "Xiaohua Jia.....http://dblp.org/pers/hd/j/Jia:Xiaohua", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Bo Zhang.....http://dblp.org/pers/hd/z/Zhang:Bo"], "conf": "infocom", "year": "2013", "pages": 9}