{"title": "Graph stream classification using labeled and unlabeled graphs.", "fields": ["strength of a graph", "simplex graph", "universal graph", "factor critical graph", "butterfly graph"], "abstract": "Graph classification is becoming increasingly popular due to the rapidly rising applications involving data with structural dependency. The wide spread of the graph applications and the inherent complex relationships between graph objects have made the labels of the graph data expensive and/or difficult to obtain, especially for applications involving dynamic changing graph records. While labeled graphs are limited, the copious amounts of unlabeled graphs are often easy to obtain with trivial efforts. In this paper, we propose a framework to build a stream based graph classification model by combining both labeled and unlabeled graphs. Our method, called gSLU, employs an ensemble based framework to partition graph streams into a number of graph chunks each containing some labeled and unlabeled graphs. For each individual chunk, we propose a minimum-redundancy subgraph feature selection module to select a set of informative subgraph features to build a classifier. To tackle the concept drifting in graph streams, an instance level weighting mechanism is used to dynamically adjust the instance weight, through which the subgraph feature selection can emphasize on difficult graph samples. The classifiers built from different graph chunks form an ensemble for graph stream classification. Experiments on real-world graph streams demonstrate clear benefits of using minimum-redundancy subgraph features to build accurate classifiers. By employing instance level weighting, our graph ensemble model can effectively adapt to the concept drifting in the graph stream for classification.", "citation": "Citations (21)", "departments": ["University of Technology, Sydney", "University of Technology, Sydney", "University of Technology, Sydney", "University of Illinois at Chicago"], "authors": ["Shirui Pan.....http://dblp.org/pers/hd/p/Pan:Shirui", "Xingquan Zhu.....http://dblp.org/pers/hd/z/Zhu:Xingquan", "Chengqi Zhang.....http://dblp.org/pers/hd/z/Zhang:Chengqi", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "conf": "icde", "year": "2013", "pages": 12}