{"title": "EAGRE: Towards scalable I/O efficient SPARQL query evaluation on the cloud.", "fields": ["rdf query language", "rdf schema", "query expansion", "sparql", "web search query"], "abstract": "To benefit from the Cloud platform's unlimited resources, managing and evaluating huge volume of RDF data in a scalable manner has attracted intensive research efforts recently. Progresses have been made on evaluating SPARQL queries with either high-level declarative programming languages, like Pig [1], or a sequence of sophisticated designed MapReduce jobs, both of which tend to answer the query with multiple join operations. However, due to the simplicity of Cloud storage and the coarse organization of RDF data in existing solutions, multiple join operations easily bring significant I/O and network traffic which can severely degrade the system performance. In this work, we first propose EAGRE, an Entity-Aware Graph compREssion technique to form a new representation of RDF data on Cloud platforms, based on which we propose an I/O efficient strategy to evaluate SPARQL queries as quickly as possible, especially queries with specified solution sequence modifiers, e.g., PROJECTION, ORDER BY, etc. We implement a prototype system and conduct extensive experiments over both real and synthetic datasets on an in-house cluster. The experimental results show that our solution can achieve over an order of magnitude of time saving for the SPARQL query evaluation compared to the state-of-art MapReduce-based solutions.", "citation": "Citations (28)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hewlett-Packard"], "authors": ["Xiaofei Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Xiaofei", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Yongxin Tong.....http://dblp.org/pers/hd/t/Tong:Yongxin", "Min Wang.....http://dblp.org/pers/hd/w/Wang:Min"], "conf": "icde", "year": "2013", "pages": 12}