{"title": "Sparsity lower bounds for dimensionality reducing maps.", "fields": ["lemma", "binary logarithm", "restricted isometry property", "subspace topology", "embedding"], "abstract": "We give near-tight lower bounds for the sparsity required in several dimensionality reducing linear maps. First, consider the Johnson-Lindenstrauss (JL) lemma which states that for any set of  n  vectors in R d  there is an A∈R m x d  with m = O(e -2 log n) such that mapping by  A  preserves the pairwise Euclidean distances up to a 1 pm e factor. We show there exists a set of n vectors such that any such A with at most s non-zero entries per column must have s = Ω(e -1 log n/log(1/e)) if m  -2 , e -1 √(log m  d)) by [Dasgupta-Kumar-Sarlos, STOC 2010], which only held against the stronger property of distributional JL, and only against a certain restricted class of distributions. Meanwhile our lower bound is against the JL lemma itself, with no restrictions. Our lower bound matches the sparse JL upper bound of [Kane-Nelson, SODA 2012] up to an O(log(1/e)) factor. Next, we show that any m x n matrix with the  k -restricted isometry property (RIP) with constant distortion must have Ω(k log(n/k)) non-zeroes per column if m=O(k log (n/k)), the optimal number of rows for RIP, and k  n . This improves the previous lower bound of Ω(min{k, n/m}) by [Chandar, 2010] and shows that for most  k  it is impossible to have a sparse RIP matrix with an optimal number of rows.   Both lower bounds above also offer a tradeoff between sparsity and the number of rows.   Lastly, we show that any oblivious distribution over subspace embedding matrices with 1 non-zero per column and preserving distances in a d dimensional-subspace up to a constant factor must have at least Ω(d 2 ) rows. This matches an upper bound in [Nelson-Nguyen, arXiv abs/1211.1002] and shows the impossibility of obtaining the best of both of constructions in that work, namely 1 non-zero per column and d ⋅ polylog  d  rows.", "citation": "Citations (18)", "year": "2013", "departments": ["Institute for Advanced Study", "Princeton University"], "conf": "stoc", "authors": ["Jelani Nelson.....http://dblp.org/pers/hd/n/Nelson:Jelani", "Huy L. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Huy_L="], "pages": 10}