{"title": "A game-theoretic approach for achieving k-anonymity in Location Based Services.", "fields": ["k anonymity", "location based service", "adversary", "information privacy", "privacy software"], "abstract": "Location Based Service (LBS), although it greatly benefits the daily life of mobile device users, has introduced significant threats to privacy. In an LBS system, even under the protection of pseudonyms, users may become victims of inference attacks, where an adversary reveals a user's real identity and complete moving trajectory with the aid of side information, e.g., accidental identity disclosure through personal encounters. To enhance privacy protection for LBS users, a common approach is to include extra fake location information associated with different pseudonyms, known as dummy users, in normal location reports. Due to the high cost of dummy generation using resource constrained mobile devices, self-interested users may free-ride on others' efforts. The presence of such selfish behaviors may have an adverse effect on privacy protection. In this paper, we study the behaviors of self-interested users in the LBS system from a game-theoretic perspective. We model the distributed dummy user generation as Bayesian games in both static and timing-aware contexts, and analyze the existence and properties of the Bayesian Nash Equilibria for both models. Based on the analysis, we propose a strategy selection algorithm to help users achieve optimized payoffs. Leveraging a beta distribution generalized from real-world location privacy data traces, we perform simulations to assess the privacy protection effectiveness of our approach. The simulation results validate our theoretical analysis for the dummy user generation game models.", "citation": "Citations (72)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "University of Florida"], "authors": ["Xinxin Liu.....http://dblp.org/pers/hd/l/Liu:Xinxin", "Kaikai Liu.....http://dblp.org/pers/hd/l/Liu:Kaikai", "Linke Guo.....http://dblp.org/pers/hd/g/Guo:Linke", "Xiaolin Li.....http://dblp.org/pers/hd/l/Li_0001:Xiaolin", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang"], "conf": "infocom", "year": "2013", "pages": 9}