{"title": "On the Social Welfare of Mechanisms for Repeated Batch Matching.", "fields": ["social welfare", "distributed computing", "graph", "thresholding", "computer science", "pairwise comparison", "periodic graph"], "abstract": "We study hybrid online-batch matching problems, where agents arrive continuously, but are only matched in periodic rounds, when many of them can be considered simultaneously. Agents not getting matched in a given round remain in the market for the next round. This setting models several scenarios of interest, including many job markets as well as kidney exchange mechanisms. We consider the social utility of two commonly used mechanisms for such markets: one that aims for stability in each round (greedy), and one that attempts to maximize social utility in each round (max-weight). Surprisingly, we find that in the long term, the social utility of the greedy mechanism can be higher than that of the max-weight mechanism. We hypothesize that this is because the greedy mechanism behaves similarly to a soft threshold mechanism, where all connections below a certain threshold are rejected by the participants in favor of waiting until the next round. Motivated by this observation, we propose a method to approximately calculate the optimal threshold for an individual agent, based on characteristics of the other agents, and demonstrate empirically that social utility is high when all agents use this strategy.", "citation": "Citations (10)", "departments": ["Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "Virginia Tech", "Virginia Tech", "GreaneTree Technology"], "authors": ["Elliot Anshelevich.....http://dblp.org/pers/hd/a/Anshelevich:Elliot", "Meenal Chhabra.....http://dblp.org/pers/hd/c/Chhabra:Meenal", "Sanmay Das.....http://dblp.org/pers/hd/d/Das:Sanmay", "Matthew Gerrior.....http://dblp.org/pers/hd/g/Gerrior:Matthew"], "conf": "aaai", "year": "2013", "pages": -1}