{"title": "When target motion matters: Doppler coverage in radar sensor networks.", "fields": ["radar horizon", "radar lock on", "low frequency radar", "fire control radar", "man portable radar"], "abstract": "Radar sensors, which actively transmit radio waves and collect RF energy scattered by objects in the environment, offer a number of advantages over purely passive sensors. An important issue in radar is that the transmitted energy may be scattered by objects that are not of interest as well as objects of interest (e.g., targets). The detection performance of radar systems is affected by such clutter as well as noise. Further, in many applications, clutter can be substantially stronger than the signals of interest. To combat the effect of clutter, a popular method is to take advantage of the Doppler frequency shift (DFS) extracted from the echo signal due to the relative motion of a target with respect to the radar. Unfortunately, a sensor coverage model that only depends on the distance to a target would fail to capture the DFS. In this paper, we set forth the concept of Doppler coverage for a network of spatially distributed radars. Specifically, a target is said to be Doppler-covered if, regardless of its direction of motion, there exists some radar in the network whose signalto-noise ratio (SNR) is sufficiently high and the DFS at that radar is sufficiently large. Based on the Doppler coverage model, we first propose an efficient method to characterize Dopplercovered regions for arbitrarily deployed radars. Then we design an algorithm for deriving the minimum radar density required to achieve Doppler coverage in a region under any polygonal deployment pattern, and further apply it to investigate the regular triangle based deployment.", "citation": "Citations (10)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Xiaowen Gong.....http://dblp.org/pers/hd/g/Gong:Xiaowen", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan", "Douglas Cochran.....http://dblp.org/pers/hd/c/Cochran:Douglas"], "conf": "infocom", "year": "2013", "pages": 9}