{"title": "Ownership passing: efficient distributed memory programming on multi-core systems.", "fields": ["message passing interface", "spmd", "multi core processor", "distributed memory", "thread"], "abstract": "The number of cores in multi- and many-core high-performance processors is steadily increasing. MPI, the de-facto standard for programming high-performance computing systems offers a distributed memory programming model. MPI's semantics force a copy from one process' send buffer to another process' receive buffer. This makes it difficult to achieve the same performance on modern hardware than shared memory programs which are arguably harder to maintain and debug. We propose generalizing MPI's communication model to include ownership passing, which make it possible to fully leverage the shared memory hardware of multi- and many-core CPUs to stream communicated data concurrently with the receiver's computations on it. The benefits and simplicity of message passing are retained by extending MPI with calls to send (pass) ownership of memory regions, instead of their contents, between processes. Ownership passing is achieved with a hybrid MPI implementation that runs MPI processes as threads and is mostly transparent to the user. We propose an API and a static analysis technique to transform legacy MPI codes automatically and transparently to the programmer, demonstrating that this scheme is easy to use in practice. Using the ownership passing technique, we see up to 51% communication speedups over a standard message passing implementation on state-of-the art multicore systems. Our analysis and interface will lay the groundwork for future development of MPI-aware optimizing compilers and multi-core specific optimizations, which will be key for success in current and next-generation computing platforms.", "citation": "Citations (16)", "year": "2013", "departments": ["Indiana University Bloomington", "ETH Zurich", "Lawrence Livermore National Laboratory", "Indiana University Bloomington", "Rose-Hulman Institute of Technology"], "conf": "ppopp", "authors": ["Andrew Friedley.....http://dblp.org/pers/hd/f/Friedley:Andrew", "Torsten Hoefler.....http://dblp.org/pers/hd/h/Hoefler:Torsten", "Greg Bronevetsky.....http://dblp.org/pers/hd/b/Bronevetsky:Greg", "Andrew Lumsdaine.....http://dblp.org/pers/hd/l/Lumsdaine:Andrew", "Ching-Chen Ma.....http://dblp.org/pers/hd/m/Ma:Ching=Chen"], "pages": 10}