{"title": "Enabling comprehensive data-driven system management for large computational facilities.", "fields": ["analytics", "human resource management system", "systems management", "cuda", "software system"], "abstract": "This paper presents a tool chain, based on the open source tool TACC_Stats, for systematic and comprehensive job level resource use measurement for large cluster computers, and its incorporation into XDMoD, a reporting and analytics framework for resource management that targets meeting the information needs of users, application developers, systems administrators, systems management and funding managers. Accounting, scheduler and event logs are integrated with system performance data from TACC_Stats. TACC_Stats periodically records resource use including many hardware counters for each job running on each node. Furthermore, system level metrics are obtained through aggregation of the node (job) level data. Analysis of this data generates many types of standard and custom reports and even a limited predictive capability that has not previously been available for open-source, Linux-based software systems. This paper presents case studies of information that can be applied for effective resource management. We believe this system to be the first fully comprehensive system for supporting the information needs of all stakeholders in open-source software based HPC systems.", "citation": "Citations (10)", "departments": ["University of Texas at Austin", "University at Buffalo", "University at Buffalo", "University at Buffalo", "University at Buffalo"], "authors": ["James C. Browne.....http://dblp.org/pers/hd/b/Browne:James_C=", "Robert L. DeLeon.....http://dblp.org/pers/hd/d/DeLeon:Robert_L=", "Charng-Da Lu.....http://dblp.org/pers/hd/l/Lu:Charng=Da", "Matthew D. Jones.....http://dblp.org/pers/hd/j/Jones:Matthew_D=", "Steven M. Gallo.....http://dblp.org/pers/hd/g/Gallo:Steven_M=", "Amin Ghadersohi.....http://dblp.org/pers/hd/g/Ghadersohi:Amin", "Abani K. Patra.....http://dblp.org/pers/hd/p/Patra:Abani_K=", "William L. Barth.....http://dblp.org/pers/hd/b/Barth:William_L=", "John Hammond.....http://dblp.org/pers/hd/h/Hammond:John", "Thomas R. Furlani.....http://dblp.org/pers/hd/f/Furlani:Thomas_R=", "Robert T. McLay.....http://dblp.org/pers/hd/m/McLay:Robert_T="], "conf": "sc", "year": "2013", "pages": 11}