{"title": "Low rank approximation and regression in input sparsity time.", "fields": ["singular value decomposition", "low rank approximation", "subspace topology", "diagonal matrix", "integer", "bounded function", "column vector", "binary logarithm"], "abstract": "We design a new distribution over poly(r e -1 ) x n matrices S so that for any fixed n x d matrix A of rank r, with probability at least 9/10, SAx 2  = (1 pm e)Ax 2  simultaneously for all x ∈ R d . Such a matrix S is called a  subspace embedding . Furthermore, SA can be computed in O(nnz(A)) + ~O(r 2 e -2 ) time, where nnz(A) is the number of non-zero entries of A. This improves over all previous subspace embeddings, which required at least Ω(nd log d) time to achieve this property. We call our matrices S  sparse embedding matrices .   Using our sparse embedding matrices, we obtain the fastest known algorithms for overconstrained least-squares regression, low-rank approximation, approximating all leverage scores, and l p -regression: to output an x' for which Ax'-b 2  ≤ (1+e)min x  Ax-b 2  for an n x d matrix A and an n x 1 column vector b, we obtain an algorithm running in O(nnz(A)) + ~O(d 3 e -2 ) time, and another in O(nnz(A)log(1/e)) + ~O(d 3 log(1/e)) time. (Here ~O(f) = f ⋅ log O(1) (f).) to obtain a decomposition of an n x n matrix A into a product of an n x k matrix L, a k x k diagonal matrix D, and a n x k matrix W, for which F{A - L D W} ≤ (1+e)F{A-A k }, where A k  is the best rank-k approximation, our algorithm runs in O(nnz(A)) + ~O(nk 2  e -4 log n + k 3 e -5 log 2 n) time. to output an approximation to all leverage scores of an n x d input matrix A simultaneously, with constant relative error, our algorithms run in O(nnz(A) log n) + ~O(r 3 ) time. to output an x' for which Ax'-b p  ≤ (1+e)min x  Ax-b p  for an n x d matrix A and an n x 1 column vector b, we obtain an algorithm running in O(nnz(A) log n) + poly(r e -1 ) time, for any constant 1 ≤ p", "citation": "Citations (324)", "year": "2013", "departments": ["IBM", "IBM", "IBM", "IBM"], "conf": "stoc", "authors": ["Kenneth L. Clarkson.....http://dblp.org/pers/hd/c/Clarkson:Kenneth_L=", "David P. Woodruff.....http://dblp.org/pers/hd/w/Woodruff:David_P="], "pages": 10}