{"title": "VoteTrust: Leveraging friend invitation graph to defend against social network Sybils.", "fields": ["graph theory", "collusion", "signed graph", "graph", "trusted computing", "trustrank", "social network", "social graph", "sybil attack", "voting"], "abstract": "Online social networks (OSNs) currently face a significant challenge by the existence and continuous creation of fake user accounts (Sybils), which can undermine the quality of social network service by introducing spam and manipulating online rating. Recently, there has been much excitement in the research community over exploiting social network structure to detect Sybils. However, they rely on the assumption that Sybils form a tight-knit community, which may not hold in real OSNs. In this paper, we present VoteTrust, a Sybil detection system that further leverages user interactions of initiating and accepting links. VoteTrust uses the techniques of trust-based vote assignment and global vote aggregation to evaluate the probability that the user is a Sybil. Using detailed evaluation on real social network (Renren), we show VoteTrust's ability to prevent Sybils gathering victims (e.g., spam audience) by sending a large amount of unsolicited friend requests and befriending many normal users, and demonstrate it can significantly outperform traditional ranking systems (such as TrustRank or BadRank) in Sybil detection.", "citation": "Citations (31)", "departments": ["Peking University", "Peking University", "Peking University", "Hewlett-Packard", "Peking University", "Peking University", "Peking University", "Renren Inc", "Renren Inc., Beijing, China", "Renren Inc., Beijing, China"], "authors": ["Jilong Xue.....http://dblp.org/pers/hd/x/Xue:Jilong", "Zhi Yang.....http://dblp.org/pers/hd/y/Yang:Zhi", "Xiaoyong Yang.....http://dblp.org/pers/hd/y/Yang:Xiaoyong", "Xiao Wang.....http://dblp.org/pers/hd/w/Wang:Xiao", "Lijiang Chen.....http://dblp.org/pers/hd/c/Chen:Lijiang", "Yafei Dai.....http://dblp.org/pers/hd/d/Dai:Yafei"], "conf": "infocom", "year": "2013", "pages": 9}