{"title": "AVANT-GUARD: scalable and vigilant switch flow management in software-defined networks.", "fields": ["openflow", "guard", "forwarding plane", "adversary", "exploit"], "abstract": "Among the leading reference implementations of the Software Defined Networking (SDN) paradigm is the OpenFlow framework, which decouples the control plane into a centralized application. In this paper, we consider two aspects of OpenFlow that pose security challenges, and we propose two solutions that could address these concerns. The first challenge is the inherent communication bottleneck that arises between the data plane and the control plane, which an adversary could exploit by mounting a \"control plane saturation attack\" that disrupts network operations. Indeed, even well-mined adversarial models, such as scanning or denial-of-service (DoS) activity, can produce more potent impacts on OpenFlow networks than traditional networks. To address this challenge, we introduce an extension to the OpenFlow data plane called \"connection migration\", which dramatically reduces the amount of data-to-control-plane interactions that arise during such attacks. The second challenge is that of enabling the control plane to expedite both detection of, and responses to, the changing flow dynamics within the data plane. For this, we introduce \"actuating triggers\" over the data plane's existing statistics collection services. These triggers are inserted by control layer applications to both register for asynchronous call backs, and insert conditional flow rules that are only activated when a trigger condition is detected within the data plane's statistics module. We present Avant-Guard, an implementation of our two data plane extensions, evaluate the performance impact, and examine its use for developing more scalable and resilient SDN security services.", "citation": "Citations (325)", "year": "2013", "departments": ["Texas A&M University", "SRI International", "SRI International", "SRI International"], "conf": "ccs", "authors": ["Seungwon Shin.....http://dblp.org/pers/hd/s/Shin:Seungwon", "Vinod Yegneswaran.....http://dblp.org/pers/hd/y/Yegneswaran:Vinod", "Phillip A. Porras.....http://dblp.org/pers/hd/p/Porras:Phillip_A=", "Guofei Gu.....http://dblp.org/pers/hd/g/Gu:Guofei"], "pages": 12}