{"title": "Complexity analysis and algorithm design for reorganizing data to minimize non-coalesced memory accesses on GPU.", "fields": ["heuristic", "general purpose computing on graphics processing units", "cuda", "computational complexity theory", "algorithm design"], "abstract": "The performance of Graphic Processing Units (GPU) is sensitive to irregular memory references. Some recent work shows the promise of data reorganization for eliminating non-coalesced memory accesses that are caused by irregular references. However, all previous studies have employed simple, heuristic methods to determine the new data layouts to create. As a result, they either do not provide any performance guarantee or are effective to only some limited scenarios. This paper contributes a fundamental study to the problem. It systematically analyzes the inherent complexity of the problem in various settings, and for the first time, proves that the problem is NP-complete. It then points out the limitations of existing techniques and reveals that in practice, the essence for designing an appropriate data reorganization algorithm can be reduced to a tradeoff among space, time, and complexity. Based on that insight, it develops two new data reorganization algorithms to overcome the limitations of previous methods. Experiments show that an assembly composed of the new algorithms and a previous algorithm can circumvent the inherent complexity in finding optimal data layouts, making it feasible to minimize non-coalesced memory accesses for a variety of irregular applications and settings that are beyond the reach of existing techniques.", "citation": "Citations (80)", "year": "2013", "departments": ["College of William & Mary", "College of William & Mary", "Rutgers University", "Google", "College of William & Mary"], "conf": "ppopp", "authors": ["Bo Wu.....http://dblp.org/pers/hd/w/Wu_0002:Bo", "Zhijia Zhao.....http://dblp.org/pers/hd/z/Zhao_0001:Zhijia", "Eddy Zheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Eddy_Zheng", "Yunlian Jiang.....http://dblp.org/pers/hd/j/Jiang:Yunlian", "Xipeng Shen.....http://dblp.org/pers/hd/s/Shen:Xipeng"], "pages": 12}