{"title": "Bootstrap Learning via Modular Concept Discovery.", "fields": ["symbolic regression", "language identification in the limit", "boolean circuit", "intuition", "stochastic grammar"], "abstract": "Suppose a learner is faced with a domain of problems about which it knows nearly nothing. It does not know the distribution of problems, the space of solutions is not smooth, and the reward signal is uninformative, providing perhaps a few bits of information but not enough to steer the learner effectively. How can such a learner ever get off the ground? A common intuition is that if the solutions to these problems share a common structure, and the learner can solve some simple problems by brute force, it should be able to extract useful components from these solutions and, by composing them, explore the solution space more efficiently. Here, we formalize this intuition, where the solution space is that of typed functional programs and the gained information is stored as a stochastic grammar over programs. We propose an iterative procedure for exploring such spaces: in the first step of each iteration, the learner explores a finite subset of the domain, guided by a stochastic grammar; in the second step, the learner compresses the successful solutions from the first step to estimate a new stochastic grammar. We test this procedure on symbolic regression and Boolean circuit learning and show that the learner discovers modular concepts for these domains. Whereas the learner is able to solve almost none of the posed problems in the procedure's first iteration, it rapidly becomes able to solve a large number by gaining abstract knowledge of the structure of the solution space.", "citation": "Citations (7)", "year": "2013", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Harvard University", "Massachusetts Institute of Technology"], "conf": "ijcai", "authors": ["Eyal Dechter.....http://dblp.org/pers/hd/d/Dechter:Eyal", "Jonathan Malmaud.....http://dblp.org/pers/hd/m/Malmaud:Jonathan", "Ryan P. Adams.....http://dblp.org/pers/hd/a/Adams:Ryan_P=", "Joshua B. Tenenbaum.....http://dblp.org/pers/hd/t/Tenenbaum:Joshua_B="], "pages": 8}