{"title": "All-or-Nothing Multicommodity Flow Problem with Bounded Fractionality in Planar Graphs.", "fields": ["planar graph", "vertex", "multi commodity flow problem", "approximation algorithm", "nothing", "bounded function", "time complexity"], "abstract": "We study the following all-or-nothing multicommodity flow problem in planar graphs. Input: A graph G with n vertices and k pairs of vertices (s 1 , t 1 ), (s 2 , t 2 ),..., (s k , t k ) in G. Find: A largest subset W of {1, ...., k such that for every i in W, we can send one unit of flow between s i  and t i . This problem is different from the well-known maximum edge-disjoint paths problem in that we do not require integral flows for the pairs. This problem is APX-hard even for trees, and a 2-approximation algorithm is known for trees. For general graphs, Chekuri et al. (STOC'04) give a poly-logarithmic factor approximation algorithm and show that a natural LP-relaxation has a poly-logarithmic integrality gap. This result is in contrast with the integrality gap Ω(√n) for the maximum edge-disjoint paths problem. Our main result considerably strengthens this result when an input graph is planar. Namely, for the all-or-nothing multicommodity flow problem in planar graphs, we give an O(1)-approximation algorithm and show that the integrality gap is O(1). In particular, in polynomial time, we can find an index set W with |W| = Ω(OPT) and eight s i -t i  paths for each i in W such that each edge is used at most eight times in these paths (with multiplicity), where OPT is the optimal value of the LP-relaxation of the all-or-nothing multicommodity flow problem. Our result can be compared to the recent result by S'eguin-Charbonneau and Shepherd (FOCS'11) who give an O(1)-approximation algorithm for the maximum edge-disjoint paths problem in planar graphs with congestion 2 (but not implied by this result).", "citation": "Not cited", "year": "2013", "departments": ["University of Tokyo", "Nat. Inst. of I ... ., Tokyo, Japan"], "conf": "focs", "authors": ["Ken-ichi Kawarabayashi.....http://dblp.org/pers/hd/k/Kawarabayashi:Ken=ichi", "Yusuke Kobayashi.....http://dblp.org/pers/hd/k/Kobayashi_0001:Yusuke"], "pages": 10}