{"title": "Bubble-flux: precise online QoS management for increased utilization in warehouse scale computers.", "fields": ["power management", "batch processing", "warehouse", "profiling", "bubble"], "abstract": "Ensuring the  quality of service  (QoS) for latency-sensitive applications while allowing co-locations of multiple applications on servers is critical for improving server utilization and reducing cost in modern warehouse-scale computers (WSCs). Recent work relies on static profiling to precisely predict the QoS degradation that results from performance interference among co-running applications to increase the number of \"safe\" co-locations. However, these static profiling techniques have several critical limitations: 1) a priori knowledge of all workloads is required for profiling, 2) it is difficult for the prediction to capture or adapt to phase or load changes of applications, and 3) the prediction technique is limited to only two co-running applications.   To address all of these limitations, we present  Bubble-Flux , an integrated dynamic interference measurement and online QoS management mechanism to provide accurate QoS control and maximize server utilization. Bubble-Flux uses a  Dynamic Bubble  to probe servers in real time to measure the instantaneous pressure on the shared hardware resources and precisely predict how the QoS of a latency-sensitive job will be affected by potential co-runners. Once \"safe\" batch jobs are selected and mapped to a server, Bubble-Flux uses an  Online Flux Engine  to continuously monitor the QoS of the latency-sensitive application and control the execution of batch jobs to adapt to dynamic input, phase, and load changes to deliver satisfactory QoS. Batch applications remain in a state of flux throughout execution. Our results show that the utilization improvement achieved by Bubble-Flux is up to 2.2x better than the prior static approach.", "citation": "Citations (187)", "year": "2013", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "isca", "authors": ["Hailong Yang.....http://dblp.org/pers/hd/y/Yang:Hailong", "Alex D. Breslow.....http://dblp.org/pers/hd/b/Breslow:Alex_D=", "Jason Mars.....http://dblp.org/pers/hd/m/Mars:Jason", "Lingjia Tang.....http://dblp.org/pers/hd/t/Tang:Lingjia"], "pages": 12}