{"title": "Combining Relational Learning with SMT Solvers Using CEGAR.", "fields": ["markov logic network", "relational calculus", "statistical relational learning", "name resolution", "solver"], "abstract": "In statistical relational learning, one is concerned with inferring the most likely explanation (or world) that satisfies a given set of weighted constraints. The weight of a constraint signifies our confidence in the constraint, and the most likely world that explains a set of constraints is simply a satisfying assignment that maximizes the weights of satisfied constraints. The relational learning community has developed specialized solvers (e.g., Alchemy and Tuffy) for such weighted constraints independently of the work on SMT solvers in the verification community. In this paper, we show how to leverage SMT solvers to significantly improve the performance of relational solvers.\n\nConstraints associated with a weight of 1 (or 0) are called axioms because they must be satisfied (or violated) by the final assignment. Axioms can create difficulties for relational solvers. We isolate the burden of axioms to SMT solvers and only lazily pass information back to the relational solver. This information can either be a subset of the axioms, or even generalized axioms (similar to predicate generalization in verification).\n\nWe implemented our algorithm in a tool called Soft-Cegar that out-performs state-of-the-art relational solvers Tuffy and Alchemy over four real-world applications. We hope this work opens the door for further collaboration between relational learning and SMT solvers.", "citation": "Citations (9)", "year": "2013", "departments": ["Stanford University", "Microsoft", "Microsoft", "Microsoft"], "conf": "cav", "authors": ["Arun Tejasvi Chaganty.....http://dblp.org/pers/hd/c/Chaganty:Arun_Tejasvi", "Akash Lal.....http://dblp.org/pers/hd/l/Lal:Akash", "Aditya V. Nori.....http://dblp.org/pers/hd/n/Nori:Aditya_V=", "Sriram K. Rajamani.....http://dblp.org/pers/hd/r/Rajamani:Sriram_K="], "pages": 16}