{"title": "Prometheus: Privacy-aware data retrieval on hybrid cloud.", "fields": ["cloud computing security", "trusted computing", "data retrieval", "cloud testing", "information privacy"], "abstract": "With the advent of cloud computing, data owner is motivated to outsource their data to the cloud platform for great flexibility and economic savings. However, the development is hampered by data privacy concerns: Data owner may have privacy data and the data cannot be outsourced to cloud directly. Previous solutions mainly use encryption. However, encryption causes a lot of inconveniences and large overheads for other data operations, such as search and query. To address the challenge, we adopt hybrid cloud. In this paper, we present a suit of novel techniques for efficient privacy-aware data retrieval. The basic idea is to split data, keeping sensitive data in trusted private cloud while moving insensitive data to public cloud. However, privacy-aware data retrieval on hybrid cloud is not supported by current frameworks. Data owners have to split data manually. Our system, called Prometheus, adopts the popular MapReduce framework, and uses data partition strategy independent to specific applications. Prometheus can automatically separate sensitive information from public data. We formally prove the privacy-preserving feature of Prometheus. We also show that our scheme can defend against the malicious cloud model, in addition to the semi-honest cloud model. We implement Prometheus on Hadoop and evaluate its performance using real data set on a large-scale cloud test-bed. Our extensive experiments demonstrate the validity and practicality of the proposed scheme.", "citation": "Citations (15)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Temple University", "Harbin Institute of Technology", "Harbin Institute of Technology"], "authors": ["Zhigang Zhou.....http://dblp.org/pers/hd/z/Zhou:Zhigang", "Hongli Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Hongli", "Xiaojiang Du.....http://dblp.org/pers/hd/d/Du:Xiaojiang", "Panpan Li.....http://dblp.org/pers/hd/l/Li:Panpan", "Xiang-Zhan Yu.....http://dblp.org/pers/hd/y/Yu:Xiang=Zhan"], "conf": "infocom", "year": "2013", "pages": 9}