{"title": "Evaluation of navigation skill of elderly people using the cycling wheel chair in a virtual environment.", "fields": ["virtual machine", "wheelchair", "cycling", "virtual reality", "simulation"], "abstract": "A cycling wheel chair (CWC) is a pedal-driven wheelchair developed as a personal transportation device for patients with hemiplegia after cerebral stroke. The CWC enables the patient to travel much faster than an ordinary wheel chair and is effective for prevention of disuse syndrome in lower limbs. However, the patients often have impairment of cognitive function as well as motor function. It is dangerous for such patients to ride on the CWC on outdoor roads. To cope with this problem, a virtual reality system for the CWC named “Virtual CWC” was developed. The Virtual CWC can provide safe and space-saving training and test environment for the patients. In the present study, a new scenario of the Virtual CWC has been developed to test the patient's cognitive function with respect to navigation as well as driving skills. The normal subjects' “homing vectors” obtained after riding on the Virtual CWC in three kinds of routes were analyzed, and compared between a young group (26 normal subjects; age 23.9 ± 2.5) and an elderly group (14 normal subjects; age 69.9 ± 4.1). As a result, the effect of cooperation between pedaling and steering could be found in the angular error of homing vectors in the case of the elderly group.", "citation": "Citations (1)", "departments": ["Tohoku University", "Tohoku University", "Tohoku University", "Fukushima University", "Tohoku University"], "authors": ["Norihiro Sugita.....http://dblp.org/pers/hd/s/Sugita:Norihiro", "Makoto Yoshizawa.....http://dblp.org/pers/hd/y/Yoshizawa:Makoto", "Yoshihisa Kojima.....http://dblp.org/pers/hd/k/Kojima:Yoshihisa", "Akira Tanaka.....http://dblp.org/pers/hd/t/Tanaka:Akira", "Makoto Abe.....http://dblp.org/pers/hd/a/Abe:Makoto", "Noriyasu Homma.....http://dblp.org/pers/hd/h/Homma:Noriyasu", "Toshitsugu Kikuchi.....http://dblp.org/pers/hd/k/Kikuchi:Toshitsugu", "Kazunori Seki.....http://dblp.org/pers/hd/s/Seki:Kazunori", "Yasunobu Handa.....http://dblp.org/pers/hd/h/Handa:Yasunobu"], "conf": "vr", "year": "2013", "pages": 2}