{"title": "Exchanging pairwise secrets efficiently.", "fields": ["information theoretic security", "pairwise comparison", "adversary", "testbed", "broadcast domain"], "abstract": "We consider the problem where a group of wireless nodes, connected to the same broadcast domain, want to create pairwise secrets, in the presence of an adversary Eve, who tries to listen in and steal these secrets. Existing solutions assume that Eve cannot perform certain computations (e.g., large-integer factorization) in useful time. We ask the question: can we solve this problem without assuming anything about Eve's computational capabilities? We propose a simple secret-agreement protocol, where the wireless nodes keep exchanging bits until they have agreed on pairwise secrets that Eve cannot reconstruct with very high probability. Our protocol relies on Eve's limited network presence (the fact that she cannot be located at an arbitrary number of points in the network at the same time), but assumes nothing about her computational capabilities. We formally show that, under standard theoretical assumptions, our protocol is information-theoretically secure (it leaks zero information to Eve about the secrets). Using a small wireless testbed of smart-phones, we provide experimental evidence that it is feasible for 5 nodes to create thousands of secret bits per second, with their secrecy being independent from the adversary's capabilities.", "citation": "Citations (10)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of California, Los Angeles"], "authors": ["Iris Safaka.....http://dblp.org/pers/hd/s/Safaka:Iris", "Christina Fragouli.....http://dblp.org/pers/hd/f/Fragouli:Christina", "Katerina J. Argyraki.....http://dblp.org/pers/hd/a/Argyraki:Katerina_J=", "Suhas N. Diggavi.....http://dblp.org/pers/hd/d/Diggavi:Suhas_N="], "conf": "infocom", "year": "2013", "pages": 9}