{"title": "Exploring Knowledge Engineering Strategies in Designing and Modelling a Road Traffic Accident Management Domain.", "fields": ["automated planning and scheduling", "accident management", "planning domain definition language", "strengths and weaknesses", "domain model"], "abstract": "Formulating knowledge for use in AI Planning engines is currently something of an ad-hoc process, where the skills of knowledge engineers and the tools they use may significantly influence the quality of the resulting planning application. There is little in the way of guidelines or standard procedures, however, for knowledge engineers to use when formulating knowledge into planning domain languages such as PDDL. This paper seeks to investigate this process using as a case study a road traffic accident management domain.\n\nManaging road accidents requires systematic, sound planning and coordination of resources to improve outcomes for accident victims. We have derived a set of requirements in consultation with stakeholders for the resource coordination part of managing accidents. We evaluate two separate knowledge engineering strategies for encoding the resulting planning domain from the set of requirements: (a) the traditional method of PDDL experts and text editor, and (b) a leading planning GUI with built in UML modelling tools.\n\nThese strategies are evaluated using process and product metrics, where the domain model (the product) was tested extensively with a range of planning engines. The results give insights into the strengths and weaknesses of the approaches, highlight lessons learned regarding knowledge encoding, and point to important lines of research for knowledge engineering for planning.", "citation": "Citations (8)", "year": "2013", "departments": ["University of Huddersfield", "University of Huddersfield", "University of Huddersfield", "University of Huddersfield", "University of Huddersfield"], "conf": "ijcai", "authors": ["Mohammad Munshi Shahin Shah.....http://dblp.org/pers/hd/s/Shah:Mohammad_Munshi_Shahin", "Lukás Chrpa.....http://dblp.org/pers/hd/c/Chrpa:Luk=aacute=s", "Diane E. Kitchin.....http://dblp.org/pers/hd/k/Kitchin:Diane_E=", "Thomas Leo McCluskey.....http://dblp.org/pers/hd/m/McCluskey:Thomas_Leo", "Mauro Vallati.....http://dblp.org/pers/hd/v/Vallati:Mauro"], "pages": 7}