{"title": "The Complexity of Model Checking Multi-stack Systems.", "fields": ["nested word", "computability", "recursion", "undecidable problem", "pushdown automaton", "decidability", "boolean satisfiability problem"], "abstract": "We study the linear-time model checking problem for boolean concurrent programs with recursive procedure calls. While sequential recursive programs are usually modeled as pushdown automata, concurrent recursive programs involve several processes and can be naturally abstracted as pushdown automata with multiple stacks. Their behavior can be understood as words with multiple nesting relations, each relation connecting a procedure call with its corresponding return. To reason about multiply nested words, we consider the class of all temporal logics as defined in the book by Gabbay, Hodkinson, and Reynolds (18). The unifying feature of these temporal logics is that their modalities are defined in monadic second-order (MSO) logic. In particular, this captures numerous temporal logics over concurrent and/or recursive programs that have been defined so far. Since the general model checking problem is undecidable, we restrict attention to phase bounded executions as proposed by La Torre, Madhusudan, and Parlato (LICS 24). While the MSO model checking problem in this case is non-elementary, our main result states that the model checking (and satisfiability) problem for all MSO-definable temporal logics is decidable in elementary time. More precisely, it is solvable in time exponential in the formula and (n+2)-fold exponential in the number of phases where n is the maximal level of the MSO modalities in the monadic quantifier alternation hierarchy (which is a vast improvement over the conference version of this paper from LICS 2013 where the space was also (n+2)-fold exponential in the size of the temporal formula). We complement this result and provide, for each level n, a temporal logic whose model checking problem is n-EXPSPACE-hard.", "citation": "Citations (3)", "departments": ["Centre national de la recherche scientifique", "Technische Universität Ilmenau", "École Normale Supérieure", ", Leipzig, Germany", "Ilmenau Univ. o ... lmenau, Germany", "Ilmenau Univ. o ... lmenau, Germany"], "authors": ["Benedikt Bollig.....http://dblp.org/pers/hd/b/Bollig:Benedikt", "Dietrich Kuske.....http://dblp.org/pers/hd/k/Kuske:Dietrich", "Roy Mennicke.....http://dblp.org/pers/hd/m/Mennicke:Roy"], "conf": "lics", "year": "2013", "pages": 10}