{"title": "Optimizing stored video delivery for mobile networks: The value of knowing the future.", "fields": ["schedule", "piecewise", "competitive analysis", "computer vision", "exploit", "computer science", "mobile radio", "artificial intelligence"], "abstract": "This paper considers the design of cross-layer opportunistic transport for stored video over wireless networks with a slow varying (average) capacity. We focus on two key ideas: (1) scheduling data transmissions when capacity is high; and (2), exploiting knowledge of future capacity variations. The latter is possible when users' mobility is known or predictable, e.g., users riding on public transportation or using navigation systems. We consider the design of cross-layer transmission schedules which minimize system utilization (and thus possibly transmit/receive energy) while avoiding, if at all possible, rebuffering/delays, in several scenarios. For the single-user anticipative case where all future capacity variations are known beforehand; we establish the optimal transmission schedule is a Generalized Piecewise Constant Thresholding (GPCT) scheme. For the single-user partially anticipative case where only a finite window of future capacity variations is known, we propose an online Greedy Fixed Horizon Control (GFHC). An upper bound on the competitive ratio of GFHC and GPCT is established showing how performance loss depends on the window size, receiver playback buffer, and capacity variability. Finally we consider the multiuser case where we can exploit both future temporal and multiuser diversity. Our simulations and evaluation based on a measured wireless capacity trace exhibit robust potential gains for our proposed transmission schemes.", "citation": "Not cited", "departments": ["University of Texas at Austin", "University of Texas at Austin"], "authors": ["Zheng Lu.....http://dblp.org/pers/hd/l/Lu_0004:Zheng", "Gustavo de Veciana.....http://dblp.org/pers/hd/v/Veciana:Gustavo_de"], "conf": "infocom", "year": "2013", "pages": 9}