{"title": "Practical Timing Side Channel Attacks against Kernel Space ASLR.", "fields": ["kernel", "timing attack", "user space", "side channel attack", "computer science", "computer security", "address space layout randomization", "attack surface"], "abstract": "Due to the prevalence of control-flow hijacking attacks, a wide variety of defense methods to protect both user space and kernel space code have been developed in the past years. A few examples that have received widespread adoption include stack canaries, non-executable memory, and Address Space Layout Randomization (ASLR). When implemented correctly (i.e., a given system fully supports these protection methods and no information leak exists), the attack surface is significantly reduced and typical exploitation strategies are severely thwarted. All modern desktop and server operating systems support these techniques and ASLR has also been added to different mobile operating systems recently. In this paper, we study the limitations of kernel space ASLR against a local attacker with restricted privileges. We show that an adversary can implement a generic side channel attack against the memory management system to deduce information about the privileged address space layout. Our approach is based on the intrinsic property that the different caches are shared resources on computer systems. We introduce three implementations of our methodology and show that our attacks are feasible on four different x86-based CPUs (both 32- and 64-bit architectures) and also applicable to virtual machines. As a result, we can successfully circumvent kernel space ASLR on current operating systems. Furthermore, we also discuss mitigation strategies against our attacks, and propose and implement a defense solution with negligible performance overhead.", "citation": "Not cited", "departments": ["Ruhr University Bochum", "Ruhr University Bochum", "Ruhr University Bochum", "Ruhr University Bochum", "Ruhr University Bochum", "Ruhr University Bochum"], "authors": ["Ralf Hund.....http://dblp.org/pers/hd/h/Hund:Ralf", "Carsten Willems.....http://dblp.org/pers/hd/w/Willems:Carsten", "Thorsten Holz.....http://dblp.org/pers/hd/h/Holz:Thorsten"], "conf": "sp", "year": "2013", "pages": 15}