{"title": "Proactive call drop avoidance in UMTS networks.", "fields": ["simultaneous voice and data", "call control", "umts frequency bands", "block", "call management"], "abstract": "The rapid advancement of smartphones has instigated tremendous data applications for cell phones. Supporting simultaneous voice and data services in a cellular network is not only desirable but also becoming indispensable. However, if the voice and data are serviced through the same antenna (like the 3G UMTS network), a voice call with data sessions requires better radio connection than a voice-only call. In this paper, we systematically study the coordination between the voice and data transmissions in UMTS networks. From analyzing a large carrier's UMTS network recording data, we first identify the most relevant network measurements/features indicating a potential call drop, then propose a drop-call predictor based on AdaBoost. Moreover, we develop an intelligent call management strategy to voluntarily block data sessions when the voice is predicted to be dropped. Our analysis utilizing real service provider's data sets shows that our proposed scheme can not only predict drop calls with a very high accuracy but also achieve the highest user satisfaction compared to the other existing call management strategies.", "citation": "Citations (5)", "departments": ["Arizona State University", "University of Rochester", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "authors": ["Shan Zhou.....http://dblp.org/pers/hd/z/Zhou:Shan", "Jie Yang.....http://dblp.org/pers/hd/y/Yang_0003:Jie", "Dahai Xu.....http://dblp.org/pers/hd/x/Xu:Dahai", "Guangzhi Li.....http://dblp.org/pers/hd/l/Li:Guangzhi", "Yu Jin.....http://dblp.org/pers/hd/j/Jin_0001:Yu", "Zihui Ge.....http://dblp.org/pers/hd/g/Ge:Zihui", "Mario Kosseifi.....http://dblp.org/pers/hd/k/Kosseifi:Mario", "Robert D. Doverspike.....http://dblp.org/pers/hd/d/Doverspike:Robert_D=", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying", "Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei"], "conf": "infocom", "year": "2013", "pages": 5}