{"title": "Temporal encoded F-formation system for social interaction detection.", "fields": ["social relation", "ranking", "social computing", "multimedia", "synthetic data"], "abstract": "In the context of a social gathering, such as a cocktail party, the memorable moments are generally captured by professional photographers or by the participants. The latter case is often undesirable because many participants would rather enjoy the event instead of being occupied by the photo-taking task. Motivated by this scenario, we propose the use of a set of cameras to automatically take photos. Instead of performing dense analysis on all cameras for photo capturing, we first detect the occurrence and location of social interactions via F-formation detection. In the sociology literature, F-formation is a concept used to define social interactions, where each detection only requires the spatial location and orientation of each participant. This information can be robustly obtained with additional Kinect depth sensors. In this paper, we propose an extended F-formation system for robust detection of interactions and interactants. The extended F-formation system employs a heat-map based feature representation for each individual, namely Interaction Space (IS), to model their location, orientation, and temporal information. Using the temporally encoded IS for each detected interactant, we propose a best-view camera selection framework to detect the corresponding best view camera for each detected social interaction. The extended F-formation system is evaluated with synthetic data on multiple scenarios. To demonstrate the effectiveness of the proposed system, we conducted a user study to compare our best view camera ranking with human's ranking using real-world data.", "citation": "Citations (27)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "T'el'ecom SudPa ... , Paris, France"], "authors": ["Tian Gan.....http://dblp.org/pers/hd/g/Gan:Tian", "Yongkang Wong.....http://dblp.org/pers/hd/w/Wong:Yongkang", "Daqing Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Daqing", "Mohan S. Kankanhalli.....http://dblp.org/pers/hd/k/Kankanhalli:Mohan_S="], "conf": "mm", "year": "2013", "pages": 10}