{"title": "Adaptive approximation algorithms for hole healing in hybrid wireless sensor networks.", "fields": ["latency", "approximation algorithm", "adaptive algorithm", "mobile telephony", "schedule"], "abstract": "Region coverage and network connectivity are among the most important problems for the quality of service in wireless sensor networks. Unfortunately, due to the sensor failures and hostile environments, such as active volcanic regions or battle fields, the emergence of coverage holes and disconnections among sensors is unavoidable. One way to handle this problem is to deploy mobile sensors in the network, which is called hybrid sensor networks, so that these mobile sensors can be relocated to heal the holes or maintain the network connectivity. However, because of the low-power of mobile sensors, it is extremely challenging to design a fast and effective movement schedule for mobile sensors to (1) maintain both the region coverage and network connectivity at any time, and (2) minimize the moving energy consumption. In this paper, we develop an adaptive algorithm, AHCH algorithm, to adaptively heal the holes with the guarantee of network connectivity without recomputing from scratch. By comparing AHCH algorithm with the optimal solution at each time-slot, we show its expected adaptive approximation ratio as O(log |M|) with |M| mobile sensors in some special cases. In more general cases, we extend our AHCH algorithm to InAHCH and GenAHCH algorithms, handling insufficient mobile sensors as well as disconnected regions, along with the proof of their corresponding theoretical adaptive approximation ratios. The experimental evaluation shows the effectiveness of our proposed algorithms with respect to both low energy consumption and hole healing latency.", "citation": "Citations (7)", "departments": ["University of Florida", "University of Florida", "University of Florida"], "authors": ["Yilin Shen.....http://dblp.org/pers/hd/s/Shen:Yilin", "Dung T. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Dung_T=", "My T. Thai.....http://dblp.org/pers/hd/t/Thai:My_T="], "conf": "infocom", "year": "2013", "pages": 9}