{"title": "Theory underlying measurement of AOA with a rotating directional antenna.", "fields": ["smart antenna", "antenna rotator", "antenna blind cone", "sector antenna", "wokfi"], "abstract": "In many wireless localization applications, we rotate a directional antenna to derive the angle of arrival (AOA) of wireless signals transmitted from a target mobile device. The AOA corresponds to the direction in which the maximum received signal strength (RSS) is sensed. However, an unanswered question is how to make sure the directional antenna picks up packets producing the maximum RSS while rotating. We propose a set of novel RSS sampling theory to answer this question. We recognize the process that a directional antenna measures RSS of wireless packets while rotating as the process that the radiation pattern of the directional antenna is sampled. Therefore, if RSS samples can reconstruct the antenna's radiation pattern, the direction corresponding to the peak of the radiation pattern is the AOA of the target. We derive mathematical models to determine the RSS sampling rate given the target's packet transmission rate. Our RSS sampling theory is applicable to various types of directional antennas. To validate our RSS sampling theory, we developed BotLoc, which is a programmable and self-coordinated robot armed with a wireless sniffer. We conducted extensive real-world experiments and the experimental results match the theory very well. A video of BotLoc is at www.youtube.com/watch?v=WtUt0IqhXRU&feature=youtu.be.", "citation": "Citations (4)", "departments": ["University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Macau"], "authors": ["Yinjie Chen.....http://dblp.org/pers/hd/c/Chen:Yinjie", "Zhongli Liu.....http://dblp.org/pers/hd/l/Liu:Zhongli", "Xinwen Fu.....http://dblp.org/pers/hd/f/Fu:Xinwen", "Benyuan Liu.....http://dblp.org/pers/hd/l/Liu:Benyuan", "Wei Zhao.....http://dblp.org/pers/hd/z/Zhao_0001:Wei"], "conf": "infocom", "year": "2013", "pages": 9}