{"title": "A demonstration of SQLVM: performance isolation in multi-tenant relational database-as-a-service.", "fields": ["temporal isolation among virtual machines", "database server", "multitenancy", "shared resource", "sql"], "abstract": "Sharing resources of a single database server among multiple tenants is common in multi-tenant Database-as-a-Service providers, such as Microsoft SQL Azure. Multi-tenancy enables cost reduction for the cloud service provider which it can pass on as savings to the tenants. However, resource sharing can adversely affect a tenant's performance due to other tenants' workloads contending for shared resources. Service providers today do not provide any assurances to a tenant in terms of isolating its performance from other co-located tenants. SQLVM, a project at Microsoft Research, is an abstraction for performance isolation which is built on a promise of reserving key database server resources, such as CPU, I/O and memory, for each tenant. The key challenge is in supporting this abstraction within a RDBMS without statically allocating resources to tenants, while ensuring low overheads and scaling to large numbers of tenants. This demonstration will show how SQLVM can effectively isolate a tenant's performance from other tenant workloads co-located at the same database server. Our demonstration will use various scripted scenarios and a data collection and visualization framework to illustrate performance isolation using SQLVM.", "citation": "Citations (11)", "year": "2013", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "National University of Singapore"], "conf": "sigmod", "authors": ["Vivek R. Narasayya.....http://dblp.org/pers/hd/n/Narasayya:Vivek_R=", "Sudipto Das.....http://dblp.org/pers/hd/d/Das:Sudipto", "Manoj Syamala.....http://dblp.org/pers/hd/s/Syamala:Manoj", "Surajit Chaudhuri.....http://dblp.org/pers/hd/c/Chaudhuri:Surajit", "Feng Li.....http://dblp.org/pers/hd/l/Li:Feng", "Hyunjung Park.....http://dblp.org/pers/hd/p/Park_0001:Hyunjung"], "pages": 4}