{"title": "Temporal variance of intents in multi-faceted event-driven information needs.", "fields": ["information needs", "ranking", "hierarchy", "popularity", "user intent"], "abstract": "Time is often important for understanding user intent during search activity, especially for information needs related to event-driven topics. Diversity for multi-faceted information needs ensures that ranked documents optimally cover multiple facets when a user's intent is uncertain. Effective diversity is reliant on methods to (i) discover and represent facets, and (ii) determine how likely each facet is the user's intent (i.e., its popularity). Past work has developed several techniques addressing these issues, however, they have concentrated on static approaches which do not consider the temporal nature of new and evolving intents and their popularity. In many cases, what a user expects may change dramatically over time as events develop. In this work we study the temporal variance of search intents for event-driven information needs using Wikipedia. First, we model intents based upon the structure represented by the section hierarchy of Wikipedia articles closely related to the information need. Using this technique, we investigate whether temporal changes in the content structure, i.e. in a section's text, reflect the temporal popularity of the intent. We map intents taken from a query-log (as ground-truth) to Wikipedia article sections and found that a large proportion are indeed reflected in topic-related article structure. By correlating the change activity of each section with the use of the intent query over time, we found that section change activity does reflect temporal popularity of many intents. Furthermore, we show that popularity between intents changes over time for event-driven topics.", "citation": "Citations (4)", "departments": ["University of Glasgow", "University of Glasgow", "University of Glasgow", "Yahoo!"], "authors": ["Stewart Whiting.....http://dblp.org/pers/hd/w/Whiting:Stewart", "Ke Zhou.....http://dblp.org/pers/hd/z/Zhou:Ke", "Joemon M. Jose.....http://dblp.org/pers/hd/j/Jose:Joemon_M=", "Mounia Lalmas.....http://dblp.org/pers/hd/l/Lalmas:Mounia"], "conf": "sigir", "year": "2013", "pages": 4}