{"title": "A real-time abnormality detection system for intensive care management.", "fields": ["remote patient monitoring", "abnormality", "medical surveillance", "data stream mining", "data visualization"], "abstract": "Detecting abnormalities from multiple correlated time series is valuable to those applications where a credible realtime event prediction system will minimize economic losses (e.g. stock market crash) and save lives (e.g. medical surveillance in the operating theatre). For example, in an intensive care scenario, anesthetists perform a vital role in monitoring the patient and adjusting the flow and type of anesthetics to the patient during an operation. An early awareness of possible complications is vital for an anesthetist to correctly react to a given situation. In this demonstration, we provide a comprehensive medical surveillance system to effectively detect abnormalities from multiple physiological data streams for assisting online intensive care management. Particularly, a novel online support vector regression (OSVR) algorithm is developed to approach the problem of discovering the abnormalities from multiple correlated time series for accuracy and real-time efficiency. We also utilize historical data streams to optimize the precision of the OSVR algorithm. Moreover, this system comprises a friendly user interface by integrating multiple physiological data streams and visualizing alarms of abnormalities.", "citation": "Citations (2)", "departments": ["Victoria University, Australia", "Victoria University, Australia", "Nanjing University of Finance and Economics", "Inst. of Comput ...  Beijing, China", "R. Brisbane & W ...  QLD, Australia"], "authors": ["Guangyan Huang.....http://dblp.org/pers/hd/h/Huang:Guangyan", "Jing He.....http://dblp.org/pers/hd/h/He_0004:Jing", "Jie Cao.....http://dblp.org/pers/hd/c/Cao:Jie", "Zhi Qiao.....http://dblp.org/pers/hd/q/Qiao:Zhi", "Michael Steyn.....http://dblp.org/pers/hd/s/Steyn:Michael", "Kersi Taraporewalla.....http://dblp.org/pers/hd/t/Taraporewalla:Kersi"], "conf": "icde", "year": "2013", "pages": 4}