{"title": "Constant Rate PCPs for Circuit-SAT with Sublinear Query Complexity.", "fields": ["algebraic number", "combinatorics", "ntime", "discrete mathematics", "probabilistically checkable proof", "max 3sat", "mathematics", "mathematical proof", "sublinear function", "pcp theorem", "transitive relation"], "abstract": "The PCP theorem [Arora et al. 1998; Arora and Safra 1998] says that every NP-proof can be encoded to another proof, namely, a probabilistically checkable proof (PCP), which can be tested by a verifier that queries only a small part of the PCP. A natural question is how large is the blow-up incurred by this encoding, that is, how long is the PCP compared to the original NP-proof? The state-of-the-art work of Ben-Sasson and Sudan [2008] and Dinur [2007] shows that one can encode proofs of length  n  by PCPs of length  n  · poly log  n  that can be verified using a constant number of queries. In this work, we show that if the query complexity is relaxed to  n  e , then one can construct PCPs of length  O ( n ) for circuit-SAT, and PCPs of length  O ( t log  t ) for any language in NTIME( t ).   More specifically, for any e > 0, we present (nonuniform) probabilistically checkable proofs (PCPs) of length 2  O (1/e)  ·  n  that can be checked using  n  e  queries for circuit-SAT instances of size  n . Our PCPs have perfect completeness and constant soundness. This is the first constant-rate PCP construction that achieves constant soundness with nontrivial query complexity ( o ( n )).   Our proof replaces the low-degree polynomials in algebraic PCP constructions with tensors of transitive algebraic geometry (AG) codes. We show that the automorphisms of an AG code can be used to simulate the role of affine transformations that are crucial in earlier high-rate algebraic PCP constructions. Using this observation, we conclude that any asymptotically good family of transitive AG codes over a constant-sized alphabet leads to a family of constant-rate PCPs with polynomially small query complexity. Such codes are constructed in the appendix to this article for the first time for every message length, building on an earlier construction for infinitely many message lengths by Stichtenoth [2006].", "citation": "Not cited", "year": "2013", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Rutgers University", "University of Haifa", "Sabancı University", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Rutgers University", "Institute for Advanced Study", "Sabancı University"], "conf": "focs", "authors": ["Eli Ben-Sasson.....http://dblp.org/pers/hd/b/Ben=Sasson:Eli", "Yohay Kaplan.....http://dblp.org/pers/hd/k/Kaplan:Yohay", "Swastik Kopparty.....http://dblp.org/pers/hd/k/Kopparty:Swastik", "Or Meir.....http://dblp.org/pers/hd/m/Meir:Or", "Henning Stichtenoth.....http://dblp.org/pers/hd/s/Stichtenoth:Henning"], "pages": 10}