{"title": "YouSense: Mitigating entropy selfishness in distributed collaborative spectrum sensing.", "fields": ["selfishness", "encryption", "cognitive radio", "antenna diversity", "incentive"], "abstract": "Collaborative spectrum sensing has been recognized as a promising approach to improve the sensing performance via exploiting the spatial diversity of the secondary users. In this study, a new selfishness issue is identified, that selfish users sense no spectrum in collaborative sensing. For easier presentation, it's denoted as entropy selfishness. This selfish behavior is difficult to distinguish, making existing detection based incentive schemes fail to work. To thwart entropy selfishness in distributed collaborative sensing, we propose YouSense, a One-Time Pad (OTP) based incentive design that could naturally isolate entropy selfish users from the honest users without selfish node detection. The basic idea of YouSense is to construct a trapdoor onetime pad for each sensing report by combining the original report and a random key. Such a one-time pad based encryption could prevent entropy selfish users from accessing the original sensing report while enabling the honest users to recover the report. Different from traditional cryptography based OTP which requires the key delivery, YouSense allows an honest user to recover the pad (or key) by exploiting a unique characteristic of collaborative sensing that different secondary users share some common observations on the same radio spectrum. We further extend YouSense to improve the recovery successful rate by reducing the cardinality of set of the possible pads. By extensive USRP based experiments, we show that YouSense can successfully thwart entropy selfishness with low system overhead.", "citation": "Citations (13)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Science and Technology of China"], "authors": ["Shuai Li.....http://dblp.org/pers/hd/l/Li:Shuai", "Haojin Zhu.....http://dblp.org/pers/hd/z/Zhu:Haojin", "Zhaoyu Gao.....http://dblp.org/pers/hd/g/Gao:Zhaoyu", "Xinping Guan.....http://dblp.org/pers/hd/g/Guan:Xinping", "Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai"], "conf": "infocom", "year": "2013", "pages": 9}