{"title": "SINUS: A scalable and distributed routing algorithm with guaranteed delivery for WSNs on high genus 3D surfaces.", "fields": ["destination sequenced distance vector routing", "maximum cut", "wireless routing protocol", "multipath routing", "morse theory", "reeb graph", "static routing", "geographic routing", "equal cost multi path routing"], "abstract": "In this paper, we put forward a novel scalable and distributed routing algorithm, called SINUS, for sensor networks deployed on the surface of complex-connected 3D settings such as tunnels, whose topologies are often theoretically modeled as high genus 3D surfaces. SINUS is carried out by first slicing the genus-n surface along a maximum cut set based on Morse theory and Reeb graph, in order to form a genus-0 surface with 2n boundaries. Then, it groups these 2n boundaries into two groups each of which is next connected together. By doing so, a genus-0 surface with exactly two boundaries emerges, which can be flattened into a strip, using the Ricci flow algorithm and next mapped to a planar annulus by Möbius Transform. By assigning nodes virtual coordinates on the planar annulus, SINUS finally realizes a variation of greedy routing to enable individual nodes to make local muting decisions. Our simulation results show that SINUS can achieve low-stretch routing with guaranteed delivery, as well as balanced traffic load.", "citation": "Not cited", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "InterDigital, Inc.", "Huazhong University of Science and Technology", "SlAT, China"], "authors": ["Tianlong Yu.....http://dblp.org/pers/hd/y/Yu:Tianlong", "Hongbo Jiang.....http://dblp.org/pers/hd/j/Jiang:Hongbo", "Guang Tan.....http://dblp.org/pers/hd/t/Tan:Guang", "Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang", "Chen Tian.....http://dblp.org/pers/hd/t/Tian:Chen", "Yu Wu.....http://dblp.org/pers/hd/w/Wu:Yu"], "conf": "infocom", "year": "2013", "pages": 9}