{"title": "Estimating Reference Evapotranspiration for Irrigation Management in the Texas High Plains.", "fields": ["evapotranspiration", "irrigation management", "crop coefficient", "gaussian process", "weather station"], "abstract": "Accurate estimates of daily crop evapotranspiration (ET) are needed for efficient irrigation management in regions where crop water demand exceeds rainfall. Daily grass or alfalfa reference ET values and crop coefficients are widely used to estimate crop water demand. Inaccurate reference ET estimates can hence have a tremendous impact on irrigation costs and the demands on freshwater resources. ET networks calculate reference ET using precise measurements of meteorological data. These networks are typically characterized by gaps in spatial coverage and lack of sufficient funding, creating an immediate need for alternative sources that can fill data gaps without high costs. Although non-agricultural weather stations provide publicly accessible meteorological data, there are concerns that the data may be unsuitable for estimating reference ET due to factors such as weather station siting, data formats and quality control issues. The objective of our research is to enable the use of alternative data sources, adapting sophisticated machine learning algorithms such as Gaussian process models and neural networks to discover and model the nonlinear relationships between non-ET weather station data and the reference ET computed by ET networks. Using data from the Texas High Plains region in the U.S., we demonstrate significant improvement in estimation accuracy in comparison with baseline regression models typically used for irrigation management applications.", "citation": "Citations (3)", "year": "2013", "departments": ["Texas Tech University", "Texas Tech University", "Agricultural Research Service", "Texas A&M AgriLife Extension Service", "Texas A&M University"], "conf": "ijcai", "authors": ["Daniel Ellis Holman.....http://dblp.org/pers/hd/h/Holman:Daniel_Ellis", "Mohan Sridharan.....http://dblp.org/pers/hd/s/Sridharan:Mohan", "Prasanna Gowda.....http://dblp.org/pers/hd/g/Gowda:Prasanna", "Dana Porter.....http://dblp.org/pers/hd/p/Porter:Dana", "Thomas Marek.....http://dblp.org/pers/hd/m/Marek:Thomas", "Terry Howell.....http://dblp.org/pers/hd/h/Howell:Terry", "Jerry Moorhead.....http://dblp.org/pers/hd/m/Moorhead:Jerry"], "pages": 7}