{"title": "Modeling and characterization of vehicular density at scale.", "fields": ["weibull distribution", "vehicular ad hoc network", "hurst exponent", "background subtraction", "estimator"], "abstract": "Future vehicular networks shall enable new classes of services and applications for car-to-car and car-to-roadside communication. The underlying vehicular mobility patterns significantly impact the operation and effectiveness of these services, and hence it is essential to model and characterize such patterns. In this paper, we examine the mobility of vehicles as a function of traffic density of more than 800 locations from six major metropolitan regions around the world. The traffic densities are generated from more than 25 million images and processed using background subtraction algorithm. The resulting vehicular density time series and distributions are then analyzed. It is found using the goodness-of-fit test that the vehicular density distribution follows heavy-tail distributions such as Log-gamma, Log-logistic, and Weibull in over 90% of these locations. Moreover, a heavy-tail gives rise to long-range dependence and self-similarity, which we studied by estimating the Hurst exponent (H). Our analysis based on seven different Hurst estimators signifies that the traffic patterns are stochastically self-similar (0.5 ≤ H ≤ 1.0). We believe this is an important finding, which will influence the design and deployment of the next generation vehicular network and also aid in the development of opportunistic communication services and applications for the vehicles. In addition, it shall provide a much needed input for the development of smart cities.", "citation": "Citations (6)", "departments": ["University of Florida", "Telekom Innovation Laboratories", "University of Florida"], "authors": ["Gautam S. Thakur.....http://dblp.org/pers/hd/t/Thakur:Gautam_S=", "Pan Hui.....http://dblp.org/pers/hd/h/Hui:Pan", "Ahmed Helmy.....http://dblp.org/pers/hd/h/Helmy:Ahmed"], "conf": "infocom", "year": "2013", "pages": 6}