{"title": "Fighting the bufferbloat: On the coexistence of AQM and low priority congestion control.", "fields": ["active queue management", "round trip delay time", "trips architecture", "linux kernel", "bufferbloat", "codel"], "abstract": "Abstract   Nowadays, due to excessive queuing, delays on the Internet can grow longer than the round trip time between the Moon and the Earth – for which the “bufferbloat” term was recently coined. Some point to active queue management (AQM) as the solution. Others propose end-to-end low-priority congestion control techniques (LPCC). Under both approaches, promising advances have been made in recent times: notable examples are CoDel for AQM, and LEDBAT for LPCC.  In this paper, we warn of a potentially fateful interaction when AQM and LPCC techniques are combined: namely, AQM resets the relative level of priority between best-effort and low-priority congestion control protocols. We validate the generality of our findings by an extended set of experiments with packet-level ns2 simulation, considering 5 AQM techniques and 3 LPCC protocols, and carry on a thorough sensitivity analysis varying several parameters of the networking scenario. We complete the simulation via an experimental campaign conducted on both controlled testbeds and on the Internet, confirming the reprioritization issue to hold in the real world at least under all combination of AQM policies and LPCC protocols available in the Linux kernel. To promote cross-comparison, we make our scripts and dataset available to the research community.", "citation": "Citations (27)", "departments": ["Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "23 Avenue d’Ita ... 3 Paris, France"], "authors": ["YiXi Gong.....http://dblp.org/pers/hd/g/Gong:YiXi", "Dario Rossi.....http://dblp.org/pers/hd/r/Rossi:Dario", "Claudio Testa.....http://dblp.org/pers/hd/t/Testa:Claudio", "Silvio Valenti.....http://dblp.org/pers/hd/v/Valenti:Silvio", "M. Dave Taht.....http://dblp.org/pers/hd/t/Taht:M=_Dave"], "conf": "infocom", "year": "2013", "pages": 6}