{"title": "Data loss and reconstruction in sensor networks.", "fields": ["signal reconstruction", "data loss", "key distribution in wireless sensor networks", "compressed sensing", "spatial correlation"], "abstract": "Reconstructing the environment in cyber space by sensory data is a fundamental operation for understanding the physical world in depth. A lot of basic scientific work (e.g., nature discovery, organic evolution) heavily relies on the accuracy of environment reconstruction. However, data loss in wireless sensor networks is common and has its special patterns due to noise, collision, unreliable link, and unexpected damage, which greatly reduces the accuracy of reconstruction. Existing interpolation methods do not consider these patterns and thus fail to provide a satisfactory accuracy when missing data become large. To address this problem, this paper proposes a novel approach based on compressive sensing to reconstruct the massive missing data. Firstly, we analyze the real sensory data from Intel Indoor, GreenOrbs, and Ocean Sense projects. They all exhibit the features of spatial correlation, temporal stability and low-rank structure. Motivated by these observations, we then develop an environmental space time improved compressive sensing (ESTICS) algorithm to optimize the missing data estimation. Finally, the extensive experiments with real-world sensory data shows that the proposed approach significantly outperforms existing solutions in terms of reconstruction accuracy. Typically, ESTICS can successfully reconstruct the environment with less than 20% error in face of 90% missing data.", "citation": "Citations (109)", "departments": ["Shanghai Jiao Tong University", "McGill University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Linghe Kong.....http://dblp.org/pers/hd/k/Kong:Linghe", "Mingyuan Xia.....http://dblp.org/pers/hd/x/Xia:Mingyuan", "Xiao-Yang Liu.....http://dblp.org/pers/hd/l/Liu:Xiao=Yang", "Min-You Wu.....http://dblp.org/pers/hd/w/Wu:Min=You", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue"], "conf": "infocom", "year": "2013", "pages": 9}