{"title": "Lasso Screening Rules via Dual Polytope Projection.", "fields": ["polytope", "combinatorics", "data set", "feasible region", "mathematics", "mathematical optimization", "dual space", "lasso"], "abstract": "Lasso is a widely used regression technique to find sparse representations. When the dimension of the feature space and the number of samples are extremely large, solving the Lasso problem remains challenging. To improve the efficiency of solving large-scale Lasso problems, El Ghaoui and his colleagues have proposed the SAFE rules which are able to quickly identify the inactive predictors, i.e., predictors that have 0 components in the solution vector. Then, the inactive predictors or features can be removed from the optimization problem to reduce its scale. By transforming the standard Lasso to its dual form, it can be shown that the inactive predictors include the set of inactive constraints on the optimal dual solution. In this paper, we propose an efficient and effective screening rule via Dual Polytope Projections (DPP), which is mainly based on the uniqueness and nonexpansiveness of the optimal dual solution due to the fact that the feasible set in the dual space is a convex and closed polytope. Moreover, we show that our screening rule can be extended to identify inactive groups in group Lasso. To the best of our knowledge, there is currently no \"exact\" screening rule for group Lasso. We have evaluated our screening rule using many real data sets. Results show that our rule is more effective in identifying inactive predictors than existing state-of-the-art screening rules for Lasso.", "citation": "Citations (80)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "University of Michigan", "Arizona State University", "University of Michigan"], "authors": ["Jie Wang.....http://dblp.org/pers/hd/w/Wang:Jie", "Jiayu Zhou.....http://dblp.org/pers/hd/z/Zhou:Jiayu", "Peter Wonka.....http://dblp.org/pers/hd/w/Wonka:Peter", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping"], "conf": "nips", "year": "2013", "pages": 9}