{"title": "Efficient Synthesis for Concurrency by Semantics-Preserving Transformations.", "fields": ["counterexample", "horn clause", "program synthesis", "speedup", "concurrency"], "abstract": "We develop program synthesis techniques that can help programmers fix concurrency-related bugs. We make two new contributions to synthesis for concurrency, the first improving the efficiency of the synthesized code, and the second improving the efficiency of the synthesis procedure itself. The first contribution is to have the synthesis procedure explore a variety of (sequential) semantics-preserving program transformations. Classically, only one such transformation has been considered, namely, the insertion of synchronization primitives (such as locks). Based on common manual bug-fixing techniques used by Linux device-driver developers, we explore additional, more efficient transformations, such as the reordering of independent instructions. The second contribution is to speed up the counterexample-guided removal of concurrency bugs within the synthesis procedure by considering partial-order traces (instead of linear traces) as counterexamples. A partial-order error trace represents a set of linear (interleaved) traces of a concurrent program all of which lead to the same error. By eliminating a partial-order error trace, we eliminate in a single iteration of the synthesis procedure all linearizations of the partial-order trace. We evaluated our techniques on several simplified examples of real concurrency bugs that occurred in Linux device drivers.", "citation": "Citations (22)", "year": "2013", "departments": ["University of Colorado Boulder", "Institute of Science and Technology Austria", "Institute of Science and Technology Austria", "NICTA", "Institute of Science and Technology Austria"], "conf": "cav", "authors": ["Pavol Cerný.....http://dblp.org/pers/hd/c/Cern=yacute=:Pavol", "Thomas A. Henzinger.....http://dblp.org/pers/hd/h/Henzinger:Thomas_A=", "Arjun Radhakrishna.....http://dblp.org/pers/hd/r/Radhakrishna:Arjun", "Leonid Ryzhyk.....http://dblp.org/pers/hd/r/Ryzhyk:Leonid", "Thorsten Tarrach.....http://dblp.org/pers/hd/t/Tarrach:Thorsten"], "pages": 17}