{"title": "Mobile data gathering with Wireless Energy Replenishment in rechargeable sensor networks.", "fields": ["mobile wireless sensor network", "sensor node", "key distribution in wireless sensor networks", "wireless wan", "wi fi array"], "abstract": "The emerging wireless energy transfer technology enables charging sensor batteries in a wireless sensor network (WSN) and maintaining perpetual operation of the network. Recent breakthrough in this area has opened up a new dimension to the design of sensor network protocols. In the meanwhile, mobile data gathering has been considered as an efficient alternative to data relaying in WSNs. However, time variation of recharging rates in wireless rechargeable sensor networks imposes a great challenge in obtaining an optimal data gathering strategy. In this paper, we propose a framework of joint Wireless Energy Replenishment and anchor-point based Mobile Data Gathering (WerMDG) in WSNs by considering various sources of energy consumption and time-varying nature of energy replenishment. To that end, we first determine the anchor point selection and the sequence to visit the anchor points. We then formulate the WerMDG problem into a network utility maximization problem which is constrained by flow conversation, energy balance, link and battery capacity and the bounded sojourn time of the mobile collector. Furthermore, we present a distributed algorithm composed of cross-layer data control, scheduling and routing subalgorithms for each sensor node, and sojourn time allocation subalgorithm for the mobile collector at different anchor points. Finally, we give extensive numerical results to verify the convergence of the proposed algorithm and the impact of utility weight on network performance.", "citation": "Citations (97)", "departments": ["Chongqing University", "Chongqing University", "Chongqing University"], "authors": ["Songtao Guo.....http://dblp.org/pers/hd/g/Guo:Songtao", "Cong Wang.....http://dblp.org/pers/hd/w/Wang_0006:Cong", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2013", "pages": 9}