{"title": "Towards Effective Prioritizing Water Pipe Replacement and Rehabilitation.", "fields": ["water pipe", "risk matrix", "cluster analysis", "rehabilitation", "heuristics"], "abstract": "Water pipe failures can not only have a great impact on people's daily life but also cause significant waste of water which is an essential and precious resource to human beings. As a result, preventative maintenance for water pipes, particularly in urban-scale networks, is of great importance for a sustainable society. To achieve effective replacement and rehabilitation, failure prediction aims to proactively find those 'most-likely-to-fail' pipes becomes vital and has been attracting more attention from both academia and industry, especially from the civil engineering field. This paper presents an already-deployed industrial computational system for pipe failure prediction. As an alternative to risk matrix methods often depending on ad-hoc domain heuristics, learning based methods are adopted using the attributes with respect to physical, environmental, operational conditions and etc. Further challenge arises in practice when lacking of profile attributes. A dive into the failure records shows that the failure event sequences typically exhibit temporal clustering patterns, which motivates us to use the stochastic process to tackle the failure prediction task. Specifically, the failure sequence is formulated as a self-exciting stochastic process which is, to our best knowledge, a novel formulation for pipe failure prediction. And we show that it outperforms a baseline assuming the failure risk grows linearly with aging. Broad new problems and research points for the machine learning community are also introduced for future work.", "citation": "Citations (13)", "year": "2013", "departments": ["Shanghai Jiao Tong University", "IBM", "Georgia Institute of Technology", "IBM", "IBM"], "conf": "ijcai", "authors": ["Junchi Yan.....http://dblp.org/pers/hd/y/Yan:Junchi", "Yu Wang.....http://dblp.org/pers/hd/w/Wang_0021:Yu", "Ke Zhou.....http://dblp.org/pers/hd/z/Zhou_0002:Ke", "Jin Huang.....http://dblp.org/pers/hd/h/Huang:Jin", "Chunhua Tian.....http://dblp.org/pers/hd/t/Tian:Chunhua", "Hongyuan Zha.....http://dblp.org/pers/hd/z/Zha:Hongyuan", "Weishan Dong.....http://dblp.org/pers/hd/d/Dong:Weishan"], "pages": 7}