{"title": "Image search by graph-based label propagation with image representation from DNN.", "fields": ["beam search", "image map", "web search query", "feature detection", "automatic image annotation"], "abstract": "Our objective is to estimate the relevance of an image to a query for image search purposes. We address two limitations of the existing image search engines in this paper. First, there is no straightforward way of bridging the gap between semantic textual queries as well as users' search intents and image visual content. Image search engines therefore primarily rely on static and textual features. Visual features are mainly used to identify potentially useful recurrent patterns or relevant training examples for complementing search by image reranking. Second, image rankers are trained on query-image pairs labeled by human experts, making the annotation intellectually expensive and time-consuming. Furthermore, the labels may be subjective when the queries are ambiguous, resulting in difficulty in predicting the search intention. We demonstrate that the aforementioned two problems can be mitigated by exploring the use of click-through data, which can be viewed as the footprints of user searching behavior, as an effective means of understanding query. The correspondences between an image and a query are determined by whether the image was searched and clicked by users under the query in a commercial image search engine. We therefore hypothesize that the image click counts in response to a query are as their relevance indications. For each new image, our proposed graph-based label propagation algorithm employs neighborhood graph search to find the nearest neighbors on an image similarity graph built up with visual representations from deep neural networks and further aggregates their clicked queries/click counts to get the labels of the new image. We conduct experiments on MSR-Bing Grand Challenge and the results show consistent performance gain over various baselines. In addition, the proposed approach is very efficient, completing annotation of each query-image pair within just 15 milliseconds on a regular PC.", "citation": "Citations (15)", "departments": ["University of Science and Technology of China", "City University of Hong Kong", "Microsoft", "University of Science and Technology of China", "City University of Hong Kong"], "authors": ["Yingwei Pan.....http://dblp.org/pers/hd/p/Pan:Yingwei", "Ting Yao.....http://dblp.org/pers/hd/y/Yao:Ting", "Kuiyuan Yang.....http://dblp.org/pers/hd/y/Yang:Kuiyuan", "Houqiang Li.....http://dblp.org/pers/hd/l/Li:Houqiang", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah", "Jingdong Wang.....http://dblp.org/pers/hd/w/Wang:Jingdong", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao"], "conf": "mm", "year": "2013", "pages": 4}