{"title": "Static saliency vs. dynamic saliency: a comparative study.", "fields": ["panning", "cinematography", "closed captioning", "salience", "zoom"], "abstract": "Recently visual saliency has attracted wide attention of researchers in the computer vision and multimedia field. However, most of the visual saliency-related research was conducted on still images for studying static saliency. In this paper, we give a comprehensive comparative study for the first time of dynamic saliency (video shots) and static saliency (key frames of the corresponding video shots), and two key observations are obtained: 1) video saliency is often different from, yet quite related with, image saliency, and 2) camera motions, such as tilting, panning or zooming, affect dynamic saliency significantly. Motivated by these observations, we propose a novel camera motion and image saliency aware model for dynamic saliency prediction. The extensive experiments on two static-vs-dynamic saliency datasets collected by us show that our proposed method outperforms the state-of-the-art methods for dynamic saliency prediction. Finally, we also introduce the application of dynamic saliency prediction for dynamic video captioning, assisting people with hearing impairments to better entertain videos with only off-screen voices, e.g., documentary films, news videos and sports videos.", "citation": "Citations (24)", "departments": ["National University of Singapore", "National University of Singapore", "Beijing Institute of Technology", "National University of Singapore", "University of Texas at San Antonio"], "authors": ["Tam V. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tam_V=", "Mengdi Xu.....http://dblp.org/pers/hd/x/Xu:Mengdi", "Guangyu Gao.....http://dblp.org/pers/hd/g/Gao:Guangyu", "Mohan S. Kankanhalli.....http://dblp.org/pers/hd/k/Kankanhalli:Mohan_S=", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2013", "pages": 10}