{"title": "A genealogy of information spreading on microblogs: A Galton-Watson-based explicative model.", "fields": ["galton s problem", "watson", "popularity", "microblogging", "social graph"], "abstract": "In this paper, we study the process of information diffusion in a microblog service developing Galton-Watson with Killing (GWK) model. Microblog services offer a unique approach to online information sharing allowing microblog users to forward messages to others. We describe an information propagation as a discrete GWK process based on Galton-Watson model which models the evolution of family names. Our model explains the interaction between the topology of the social graph and the intrinsic interest of the message. We validate our model on dataset collected from Sina Weibo and Twitter microblog. Sina Weibo is a Chinese microblog web service which reached over 100 million users as for January 2011. Our Sina Weibo dataset contains over 261 thousand tweets which have retweets and 2 million retweets from 500 thousand users. Twitter dataset contains over 1.1 million tweets which have retweets and 3.3 million retweets from 4.3 million users. The results of the validation show that our proposed GWK model fits the information diffusion of microblog service very well in terms of the number of message receivers. We show that our model can be used in generating tweets load and also analyze the relationships between parameters of our model and popularity of the diffused information. To the best of our knowledge, this paper is the first to give a systemic and comprehensive analysis for the information diffusion on microblog services, to be used in tweets-like load generators while still guaranteeing popularity distribution characteristics.", "citation": "Citations (16)", "departments": ["KAIST", "KAIST", "French Institute for Research in Computer Science and Automation", "Inst. of Comput ...  Beijing, China", "Inst. of Comput ...  Beijing, China"], "authors": ["Dong Wang.....http://dblp.org/pers/hd/w/Wang:Dong", "Hosung Park.....http://dblp.org/pers/hd/p/Park:Hosung", "Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang", "Sue B. Moon.....http://dblp.org/pers/hd/m/Moon:Sue_B=", "Mohamed Ali Kâafar.....http://dblp.org/pers/hd/k/K=acirc=afar:Mohamed_Ali", "Kavé Salamatian.....http://dblp.org/pers/hd/s/Salamatian:Kav=eacute="], "conf": "infocom", "year": "2013", "pages": 9}