{"title": "Making offline analyses continuous.", "fields": ["codebase", "interrupt", "sync", "unit testing", "software system"], "abstract": "Developers use analysis tools to help write, debug, and understand software systems under development. A developer's change to the system source code may affect analysis results. Typically, to learn those effects, the developer must explicitly initiate the analysis. This may interrupt the developer's workflow and/or the delay until the developer learns the implications of the change. The situation is even worse for impure analyses — ones that modify the code on which it runs — because such analyses block the developer from working on the code.     This paper presents Codebase Replication, a novel approach to easily convert an offline analysis — even an impure one — into a continuous analysis that informs the developer of the implications of recent changes as quickly as possible after the change is made. Codebase Replication copies the developer's codebase, incrementally keeps this copy codebase in sync with the developer's codebase, makes that copy codebase available for offline analyses to run without disturbing the developer and without the developer's changes disturbing the analyses, and makes analysis results available to be presented to the developer.     We have implemented Codebase Replication in Solstice, an open-source, publicly-available Eclipse plug-in. We have used Solstice to convert three offline analyses — FindBugs, PMD, and unit testing — into continuous ones. Each conversion required on average 436 NCSL and took, on average, 18 hours. Solstice-based analyses experience no more than 2.5 milliseconds of runtime overhead per developer action.", "citation": "Citations (12)", "departments": ["University of Washington", "University of Massachusetts Amherst", "University of Washington", "University of Washington"], "authors": ["Kivanç Muslu.....http://dblp.org/pers/hd/m/Muslu:Kivan=ccedil=", "Yuriy Brun.....http://dblp.org/pers/hd/b/Brun:Yuriy", "Michael D. Ernst.....http://dblp.org/pers/hd/e/Ernst:Michael_D=", "David Notkin.....http://dblp.org/pers/hd/n/Notkin:David"], "conf": "sigsoft", "year": "2013", "pages": 11}