{"title": "Exploring Compositional High Order Pattern Potentials for Structured Output Learning.", "fields": ["boltzmann machine", "equivalence", "feature", "level structure", "image segmentation"], "abstract": "When modeling structured outputs such as image segmentations, prediction can be improved by accurately modeling structure present in the labels. A key challenge is developing tractable models that are able to capture complex high level structure like shape. In this work, we study the learning of a general class of pattern-like high order potential, which we call Compositional High Order Pattern Potentials (CHOPPs). We show that CHOPPs include the linear deviation pattern potentials of Rother et al. [26] and also Restricted Boltzmann Machines (RBMs), we also establish the near equivalence of these two models. Experimentally, we show that performance is affected significantly by the degree of variability present in the datasets, and we define a quantitative variability measure to aid in studying this. We then improve CHOPPs performance in high variability datasets with two primary contributions: (a) developing a loss-sensitive joint learning procedure, so that internal pattern parameters can be learned in conjunction with other model potentials to minimize expected loss, and (b) learning an image-dependent mapping that encourages or inhibits patterns depending on image features. We also explore varying how multiple patterns are composed, and learning convolutional patterns. Quantitative results on challenging highly variable datasets show that the joint learning and image-dependent high order potentials can improve performance.", "citation": "Citations (30)", "year": "2013", "departments": ["University of Toronto", "University of Toronto", "University of Toronto"], "conf": "cvpr", "authors": ["Yujia Li.....http://dblp.org/pers/hd/l/Li:Yujia", "Daniel Tarlow.....http://dblp.org/pers/hd/t/Tarlow:Daniel", "Richard S. Zemel.....http://dblp.org/pers/hd/z/Zemel:Richard_S="], "pages": 8}