{"title": "Inferring cellular user demographic information using homophily on call graphs.", "fields": ["homophily", "mobile computing", "novelty", "phenomenon", "call graph"], "abstract": "Homophily refers to the phenomenon where people who are socially-connected share many characteristics including demographic and behavioral properties. The goal of this paper is to see whether homophily exists in call networks and if so, to what degree we can infer a cellphone user's demographic properties by knowing the demographic information of the people that s/he talks to. We focus on three types of demographic information: a) home location, b) age group, and c) income level. The novelty is two-folds. First, we use both communication metrics and structural properties of call graphs to identify those “important” friends for each user with whom (s)he is most likely to be in homophily. Second, we assess the importance of different time slices such as weekdays, or nights and weekends for capturing different user relationships. We conduct our study on a real data trace with 20M subscribers during one month from a nationwide cellular carrier. Our first contribution is that we quantify the extent of homophily on the call graph and identify the correlations between homophily and communication and structural features. As a second contribution, we develop effective methods to infer demographic information for a cellular user using linear regression to select the most homophily-like friend of her/him. We find that we can predict home location within 20km radius with 80% accuracy, and age group and income level with 78% and 72% accuracy, respectively.", "citation": "Citations (8)", "departments": ["University of California, Riverside", "Sprint Corporation", "University of California, Riverside"], "authors": ["Yi Wang.....http://dblp.org/pers/hd/w/Wang_0010:Yi", "Hui Zang.....http://dblp.org/pers/hd/z/Zang:Hui", "Michalis Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Michalis"], "conf": "infocom", "year": "2013", "pages": 6}