{"title": "Cumulative Attribute Space for Age and Crowd Density Estimation.", "fields": ["contextual image classification", "scalar", "pose", "density estimation", "observable"], "abstract": "A number of computer vision problems such as human age estimation, crowd density estimation and body/face pose (view angle) estimation can be formulated as a regression problem by learning a mapping function between a high dimensional vector-formed feature input and a scalar-valued output. Such a learning problem is made difficult due to sparse and imbalanced training data and large feature variations caused by both uncertain viewing conditions and intrinsic ambiguities between observable visual features and the scalar values to be estimated. Encouraged by the recent success in using attributes for solving classification problems with sparse training data, this paper introduces a novel cumulative attribute concept for learning a regression model when only sparse and imbalanced data are available. More precisely, low-level visual features extracted from sparse and imbalanced image samples are mapped onto a cumulative attribute space where each dimension has clearly defined semantic interpretation (a label) that captures how the scalar output value (e.g. age, people count) changes continuously and cumulatively. Extensive experiments show that our cumulative attribute framework gains notable advantage on accuracy for both age estimation and crowd counting when compared against conventional regression models, especially when the labelled training data is sparse with imbalanced sampling.", "citation": "Citations (216)", "year": "2013", "departments": ["Queen Mary University of London", "Queen Mary University of London", "Queen Mary University of London", "The Chinese University of Hong Kong"], "conf": "cvpr", "authors": ["Ke Chen.....http://dblp.org/pers/hd/c/Chen_0004:Ke", "Shaogang Gong.....http://dblp.org/pers/hd/g/Gong:Shaogang", "Tao Xiang.....http://dblp.org/pers/hd/x/Xiang:Tao", "Chen Change Loy.....http://dblp.org/pers/hd/l/Loy:Chen_Change"], "pages": 8}