{"title": "Forecasting the data cube: A model configuration advisor for multi-dimensional data sets.", "fields": ["data set", "group method of data handling", "logical data model", "data cube", "sql"], "abstract": "Forecasting time series data is crucial in a number of domains such as supply chain management and display advertisement. In these areas, the time series data to forecast is typically organized along multiple dimensions leading to a high number of time series that need to be forecasted. Most current approaches focus only on selection and optimizing a forecast model for a single time series. In this paper, we explore how we can utilize time series at different dimensions to increase forecast accuracy and, optionally, reduce model maintenance overhead. Solving this problem is challenging due to the large space of possibilities and possible high model creation costs. We propose a model configuration advisor that automatically determines the best set of models, a model configuration, for a given multi-dimensional data set. Our approach is based on a general process that iteratively examines more and more models and simultaneously controls the search space depending on the data set, model type and available hardware. The final model configuration is integrated into F2DB, an extension of PostgreSQL, that processes forecast queries and maintains the configuration as new data arrives. We comprehensively evaluated our approach on real and synthetic data sets. The evaluation shows that our approach significantly increases forecast query accuracy while ensuring low model costs.", "citation": "Citations (11)", "departments": ["Dresden University of Technology", "Dresden University of Technology", "Dresden University of Technology", "Dresden University of Technology"], "authors": ["Ulrike Fischer.....http://dblp.org/pers/hd/f/Fischer:Ulrike", "Christopher Schildt.....http://dblp.org/pers/hd/s/Schildt:Christopher", "Claudio Hartmann.....http://dblp.org/pers/hd/h/Hartmann:Claudio", "Wolfgang Lehner.....http://dblp.org/pers/hd/l/Lehner:Wolfgang"], "conf": "icde", "year": "2013", "pages": 12}