{"title": "Analysis and applications of smartphone user mobility.", "fields": ["mobility model", "individual mobility", "mobile computing", "mobile device", "location based service"], "abstract": "Users around the world have embraced new generation of mobile devices such as the smartphones at a remarkable rate. These devices are equipped with powerful communication and computation capabilities and they enable a wide range of exciting location-based services, e.g., location based ads, content prefetching etc. Many of these services can benefit from a better understanding of the smartphone user mobility, which may differ significantly from the general user mobility. Hence, previous works on understanding user mobility models and predicting user mobility may not directly apply to smartphone users. To overcome this, in this paper we analyze data from two popular location based social networks, where the users are real smartphone users and the places they check-in represent the typical locations where they use their smartphone applications. Specifically, we analyze how individual users move across different locations. We identify several factors that affect user mobility and their relative significance. We then leverage these factors to perform individual mobility prediction. We further show that our mobility prediction yields significant benefit to two important location based applications: content prefetching and shared ride recommendation.", "citation": "Citations (3)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Swati Rallapalli.....http://dblp.org/pers/hd/r/Rallapalli:Swati", "Wei Dong.....http://dblp.org/pers/hd/d/Dong:Wei", "Gene Moo Lee.....http://dblp.org/pers/hd/l/Lee:Gene_Moo", "Yi-Chao Chen.....http://dblp.org/pers/hd/c/Chen:Yi=Chao", "Lili Qiu.....http://dblp.org/pers/hd/q/Qiu:Lili"], "conf": "infocom", "year": "2013", "pages": 6}