{"title": "Weighted graph comparison techniques for brain connectivity analysis.", "fields": ["graph", "information visualization", "social network", "adjacency matrix", "matrix"], "abstract": "The analysis of brain connectivity is a vast field in neuroscience with a frequent use of visual representations and an increasing need for visual analysis tools. Based on an in-depth literature review and interviews with neuroscientists, we explore high-level brain connectivity analysis tasks that need to be supported by dedicated visual analysis tools. A significant example of such a task is the comparison of different connectivity data in the form of weighted graphs. Several approaches have been suggested for graph comparison within information visualization, but the comparison of  weighted  graphs has not been addressed. We explored the design space of applicable visual representations and present augmented adjacency matrix and node-link visualizations. To assess which representation best support weighted graph comparison tasks, we performed a controlled experiment. Our findings suggest that matrices support these tasks well, outperforming node-link diagrams. These results have significant implications for the design of brain connectivity analysis tools that require weighted graph comparisons. They can also inform the design of visual analysis tools in other domains, e.g. comparison of weighted social networks or biological pathways.", "citation": "Citations (111)", "year": "2013", "departments": ["University of California, Santa Barbara", "French Institute for Research in Computer Science and Automation", "Microsoft", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "conf": "chi", "authors": ["Basak Alper.....http://dblp.org/pers/hd/a/Alper:Basak", "Benjamin Bach.....http://dblp.org/pers/hd/b/Bach:Benjamin", "Nathalie Henry Riche.....http://dblp.org/pers/hd/r/Riche:Nathalie_Henry", "Tobias Isenberg.....http://dblp.org/pers/hd/i/Isenberg_0001:Tobias", "Jean-Daniel Fekete.....http://dblp.org/pers/hd/f/Fekete:Jean=Daniel"], "pages": 10}