{"title": "Video requests from Online Social Networks: Characterization, analysis and generation.", "fields": ["internet privacy", "popularity", "the internet", "social network", "content management"], "abstract": "The deep penetration of Online Social Networks (OSNs) have made them major portals for video content sharing. It is known that a significant portion of the accesses to video sharing sites are now coming from OSN users. Yet the unique features of video sharing over OSNs and their impact remain largely unknown. In this paper, we present a measurement study towards understanding the video requests from OSNs. We closely collaborated with a large-scale Facebook-like OSN to analyze its user access logs spanning over four months. Our measurement reveals a number of distinctive features on the popularity distribution of videos shared over the OSN. In particular, we observe that the OSN amplifies the skewness of video popularity so largely that about 2% most popular videos account for 90% of total views; the video requests distribution also exhibits perfect powerlaw feature; video popularity evolution shows more dynamics. All these noticeably differ from that of conventional videos, such as YouTube videos. To further understand the characteristics, we model the video viewing and sharing behaviors in OSNs, leading to the development of a practical emulator. It reveals the gap between the sharing rate and the viewing rate, and generates user requests that well capture the video popularity distribution and dynamics as observed in our empirical data.", "citation": "Citations (14)", "departments": ["Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Tsinghua University"], "authors": ["Haitao Li.....http://dblp.org/pers/hd/l/Li:Haitao", "Haiyang Wang.....http://dblp.org/pers/hd/w/Wang:Haiyang", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Ke Xu.....http://dblp.org/pers/hd/x/Xu_0002:Ke"], "conf": "infocom", "year": "2013", "pages": 5}