{"title": "Megastereo: Constructing High-Resolution Stereo Panoramas.", "fields": ["image stitching", "classification of discontinuities", "aliasing", "parallax", "stereoscopy"], "abstract": "We present a solution for generating high-quality stereo panoramas at mega pixel resolutions. While previous approaches introduced the basic principles, we show that those techniques do not generalise well to today's high image resolutions and lead to disturbing visual artefacts. As our first contribution, we describe the necessary correction steps and a compact representation for the input images in order to achieve a highly accurate approximation to the required ray space. Our second contribution is a flow-based up sampling of the available input rays which effectively resolves known aliasing issues like stitching artefacts. The required rays are generated on the fly to perfectly match the desired output resolution, even for small numbers of input images. In addition, the up sampling is real-time and enables direct interactive control over the desired stereoscopic depth effect. In combination, our contributions allow the generation of stereoscopic panoramas at high output resolutions that are virtually free of artefacts such as seams, stereo discontinuities, vertical parallax and other mono-/stereoscopic shape distortions. Our process is robust, and other types of multiperspective panoramas, such as linear panoramas, can also benefit from our contributions. We show various comparisons and high-resolution results.", "citation": "Citations (27)", "year": "2013", "departments": ["Disney Research", "Disney Research", "ETH Zurich", "Disney Research", "Disney Research"], "conf": "cvpr", "authors": ["Christian Richardt.....http://dblp.org/pers/hd/r/Richardt:Christian", "Yael Pritch.....http://dblp.org/pers/hd/p/Pritch:Yael", "Henning Zimmer.....http://dblp.org/pers/hd/z/Zimmer:Henning", "Alexander Sorkine-Hornung.....http://dblp.org/pers/hd/s/Sorkine=Hornung:Alexander"], "pages": 8}