{"title": "Mutual privacy-preserving regression modeling in participatory sensing.", "fields": ["phenomenon", "privacy software", "regression analysis", "participatory sensing", "information privacy", "data mining", "model selection", "computer science"], "abstract": "As the advancement of sensing and networking technologies, participatory sensing has raised more and more attention as it provides a promising way enabling public and professional users to gather and analyze private data to understand the world. However, in these participatory sensing applications both data at the individuals and analysis results obtained at the users are usually private and sensitive to be disclosed, e.g., locations, salaries, utility usage, consumptions, behaviors, etc. A natural question, also an important but challenging problem is how to keep both participants and users data privacy while still producing the best analysis to explain a phenomenon. In this paper, we have addressed this issue and proposed M-PERM, a mutual privacy preserving regression modeling approach. Particularly, we launch a series of data transformation and aggregation operations at the participatory nodes, the clusters, and the user. During regression model fitting, we provide a new way for model fitting without any need of the original private data or the exact knowledge of the model expression. To evaluate our approach, we conduct both theoretical analysis and simulation study. The evaluation results show that the proposed approach produces exactly the same best model as if the original private data were used without leakage of the fitted model to any participatory nodes, which is a significant advance compared with the existing approaches [1-5]. It is also shown that the data gathering design is able to reach maximum privacy protection under certain conditions and be robust against collusion attack. Furthermore, compared with existing works under the same context (e.g., [1-5]), to our best knowledge it is the first work showing that not only the model coefficients estimation but also a series of regression analysis and model selection methods are reachable in mutual privacy preserving data analysis scenarios such as participatory sensing.", "citation": "Not cited", "departments": ["University of Science and Technology of China", "Tsinghua University", "University of Science and Technology of China", "Shanghai Jiao Tong University", "University of Science and Technology of China"], "authors": ["Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai", "Zhiguo Wan.....http://dblp.org/pers/hd/w/Wan:Zhiguo", "Pengfei Hu.....http://dblp.org/pers/hd/h/Hu:Pengfei", "Haojin Zhu.....http://dblp.org/pers/hd/z/Zhu:Haojin", "Yuepeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Yuepeng", "Xi Chen.....http://dblp.org/pers/hd/c/Chen:Xi", "Yang Wang.....http://dblp.org/pers/hd/w/Wang_0015:Yang", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng"], "conf": "infocom", "year": "2013", "pages": 9}