{"title": "A Hidden Markov Model-Based Acoustic Cicada Detector for Crowdsourced Smartphone Biodiversity Monitoring.", "fields": ["feature vector", "environmental noise", "goertzel algorithm", "crowdsourcing", "hidden markov model", "sound recording and reproduction", "batch processing", "software deployment", "computational sustainability"], "abstract": "In recent years, the field of computational sustainability has striven to apply artificial intelligence techniques to solve ecological and environmental problems. In ecology, a key issue for the safeguarding of our planet is the monitoring of biodiversity. Automated acoustic recognition of species aims to provide a cost-effective method for biodiversity monitoring. This is particularly appealing for detecting endangered animals with a distinctive call, such as the New Forest cicada. To this end, we pursue a crowdsourcing approach, whereby the millions of visitors to the New Forest, where this insect was historically found, will help to monitor its presence by means of a smartphone app that can detect its mating call. Existing research in the field of acoustic insect detection has typically focused upon the classification of recordings collected from fixed field microphones. Such approaches segment a lengthy audio recording into individual segments of insect activity, which are independently classified using cepstral coefficients extracted from the recording as features. This paper reports on a contrasting approach, whereby we use crowdsourcing to collect recordings via a smartphone app, and present an immediate feedback to the users as to whether an insect has been found. Our classification approach does not remove silent parts of the recording via segmentation, but instead uses the temporal patterns throughout each recording to classify the insects present. We show that our approach can successfully discriminate between the call of the New Forest cicada and similar insects found in the New Forest, and is robust to common types of environment noise. A large scale trial deployment of our smartphone app collected over 6000 reports of insect activity from over 1000 users. Despite the cicada not having been rediscovered in the New Forest, the effectiveness of this approach was confirmed for both the detection algorithm, which successfully identified the same cicada through the app in countries where the same species is still present, and of the crowdsourcing methodology, which collected a vast number of recordings and involved thousands of contributors.", "citation": "Citations (13)", "year": "2013", "departments": ["University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton"], "conf": "ijcai", "authors": ["Davide Zilli.....http://dblp.org/pers/hd/z/Zilli:Davide", "Oliver Parson.....http://dblp.org/pers/hd/p/Parson:Oliver", "Geoff V. Merrett.....http://dblp.org/pers/hd/m/Merrett:Geoff_V=", "Alex Rogers.....http://dblp.org/pers/hd/r/Rogers:Alex"], "pages": 7}