{"title": "One-man-band: a touch screen interface for producing live multi-camera sports broadcasts.", "fields": ["operator", "exploit", "crew", "broadcasting", "broadcast quality"], "abstract": "Generating live broadcasts of sporting events requires a coordinated crew of camera operators, directors, and technical personnel to control and switch between multiple cameras to tell the evolving story of a game. In this paper, we present an unimodal interface concept that allows one person to cover live sporting action by controlling multiple cameras and and determining which view to broadcast. The interface exploits the structure of sports broadcasts which typically switch between a zoomed out game-camera view (which records the strategic team-level play), and a zoomed in iso-camera view (which captures the animated adversarial relations between opposing players). The operator simultaneously controls multiple pan-tilt-zoom cameras by pointing at a location on the touch screen, and selects which camera to broadcast using one or two points of contact. The image from the selected camera is superimposed on top of a wide-angle view captured from a context-camera which provides the operator with periphery information (which is useful for ensuring good framing while controlling the camera). We show that by unifying directorial and camera operation functions, we can achieve comparable broadcast quality to a multi-person crew, while reducing cost, logistical, and communication complexities.", "citation": "Citations (7)", "departments": ["Disney Research", "Disney Research", "Disney Research", "Carnegie Mellon University", "Disney Research"], "authors": ["Eric Foote.....http://dblp.org/pers/hd/f/Foote:Eric", "Peter Carr.....http://dblp.org/pers/hd/c/Carr_0001:Peter", "Patrick Lucey.....http://dblp.org/pers/hd/l/Lucey:Patrick", "Yaser Sheikh.....http://dblp.org/pers/hd/s/Sheikh:Yaser", "Iain A. Matthews.....http://dblp.org/pers/hd/m/Matthews:Iain_A="], "conf": "mm", "year": "2013", "pages": 10}