{"title": "From ARIES to MARS: transaction support for next-generation, solid-state drives.", "fields": ["hypervisor", "memristor", "virtualization", "hash table", "programming complexity"], "abstract": "Transaction-based systems often rely on write-ahead logging (WAL) algorithms designed to maximize performance on disk-based storage. However, emerging fast, byte-addressable, non-volatile memory (NVM) technologies (e.g., phase-change memories, spin-transfer torque MRAMs, and the memristor) present very different performance characteristics, so blithely applying existing algorithms can lead to disappointing performance.   This paper presents a novel storage primitive, called editable atomic writes (EAW), that enables sophisticated, highly-optimized WAL schemes in fast NVM-based storage systems. EAWs allow applications to safely access and modify log contents rather than treating the log as an append-only, write-only data structure, and we demonstrate that this can make implementating complex transactions simpler and more efficient. We use EAWs to build MARS, a WAL scheme that provides the same as features ARIES [26] (a widely-used WAL system for databases) but avoids making disk-centric implementation decisions.   We have implemented EAWs and MARS in a next-generation SSD to demonstrate that the overhead of EAWs is minimal compared to normal writes, and that they provide large speedups for transactional updates to hash tables, B+trees, and large graphs. In addition, MARS outperforms ARIES by up to 3.7 x while reducing software complexity.", "citation": "Citations (81)", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Joel Coburn.....http://dblp.org/pers/hd/c/Coburn:Joel", "Trevor Bunker.....http://dblp.org/pers/hd/b/Bunker:Trevor", "Meir Schwarz.....http://dblp.org/pers/hd/s/Schwarz:Meir", "Rajesh Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Rajesh", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "conf": "sosp", "year": "2013", "pages": 16}