{"title": "Optimal bounds for monotonicity and lipschitz testing over hypercubes and hypergrids.", "fields": ["property testing", "open problem", "special case", "hypercube", "monotone polygon"], "abstract": "The problem of monotonicity testing over the hypergrid and its special case, the hypercube, is a classic question in property testing. We are given query access to f:[k] n  -> R (for some ordered range R). The hypergrid/cube has a natural partial order given by coordinate-wise ordering, denoted by prec. A function is  monotone  if for all pairs x prec y, f(x) ≤ f(y). The distance to monotonicity, e f , is the minimum fraction of values of f that need to be changed to make f monotone. For k=2 (the boolean hypercube), the usual tester is the  edge tester , which checks monotonicity on adjacent pairs of domain points. It is known that the edge tester using O(e -1 n log|R|) samples can distinguish a monotone function from one where e f  > e. On the other hand, the best lower bound for monotonicity testing over general R is Ω(n). We resolve this long standing open problem and prove that O(n/e) samples suffice for the edge tester. For hypergrids, known testers require O(e -1 n log k log |R|) samples, while the best known (non-adaptive) lower bound is Ω(e -1  n log k). We give a (non-adaptive) monotonicity tester for hypergrids running in O(e {-1} n log k)  time.   Our techniques lead to optimal property testers (with the same running time) for the natural  Lipschitz property  on hypercubes and hypergrids. (A  c -Lipschitz function is one where |f( x ) - f( y )| ≤  c || x-y || 1 .) In fact, we give a general unified proof for  O (e -1  n log  k )-query testers for a class of \"bounded-derivative\" properties, a class containing both monotonicity and Lipschitz.", "citation": "Citations (24)", "year": "2013", "departments": ["Microsoft", "Sandia National Laboratories"], "conf": "stoc", "authors": ["Deeparnab Chakrabarty.....http://dblp.org/pers/hd/c/Chakrabarty:Deeparnab", "C. Seshadhri.....http://dblp.org/pers/hd/s/Seshadhri:C="], "pages": 10}