{"title": "The break-time barometer: an exploratory system forworkplace break-time social awareness.", "fields": ["social connectedness", "social consciousness", "barometer", "situated", "iterative design"], "abstract": "The Break-Time Barometer is a social awareness system, which was developed as part of an exploratory study of the use of situated sensing and displays to promote cohesion in a newly-dispersed workplace. The Break-Time Barometer specifically aims to use an ambient persuasion approach in order to encourage people to join existing breaks, which take place within this community. Drawing upon a privacy-sensitive ubiquitous sensing infrastructure, the system of-fers information about potentially break-related activity in social spaces within this workplace, including alerts when specific events are detected. The system was developed using a user-centered iterative design approach. A qualitative mixed methods evaluation of a full deployment identified a diverse set of reactions to both the system and the design goal, and further elaborated the challenges of designing for social connectedness in this complex workplace context.", "citation": "Citations (20)", "departments": ["Newcastle University", "Newcastle University", "Newcastle University", "Newcastle University", "Newcastle University"], "authors": ["Reuben Kirkham.....http://dblp.org/pers/hd/k/Kirkham:Reuben", "Sebastian Mellor.....http://dblp.org/pers/hd/m/Mellor:Sebastian", "David Philip Green.....http://dblp.org/pers/hd/g/Green:David_Philip", "Jiun-Shian Lin.....http://dblp.org/pers/hd/l/Lin:Jiun=Shian", "Karim Ladha.....http://dblp.org/pers/hd/l/Ladha:Karim", "Cassim Ladha.....http://dblp.org/pers/hd/l/Ladha:Cassim", "Daniel Jackson.....http://dblp.org/pers/hd/j/Jackson_0002:Daniel", "Patrick Olivier.....http://dblp.org/pers/hd/o/Olivier:Patrick", "Peter C. Wright.....http://dblp.org/pers/hd/w/Wright:Peter_C=", "Thomas Plötz.....http://dblp.org/pers/hd/p/Pl=ouml=tz:Thomas"], "conf": "huc", "year": "2013", "pages": 10}