{"title": "Beyond convex relaxation: A polynomial-time non-convex optimization approach to network localization.", "fields": ["subderivative", "conic optimization", "convex analysis", "linear matrix inequality", "proper convex function"], "abstract": "The successful deployment and operation of location-aware networks, which have recently found many applications, depends crucially on the accurate localization of the nodes. Currently, a powerful approach to localization is that of convex relaxation. In a typical application of this approach, the localization problem is first formulated as a rank-constrained semidefinite program (SDP), where the rank corresponds to the target dimension in which the nodes should be localized. Then, the non-convex rank constraint is either dropped or replaced by a convex surrogate, thus resulting in a convex optimization problem. In this paper, we explore the use of a non-convex surrogate of the rank function, namely the so-called Schatten quasi- norm, in network localization. Although the resulting optimization problem is non-convex, we show, for the first time, that a first- order critical point can be approximated to arbitrary accuracy in polynomial time by an interior-point algorithm. Moreover, we show that such a first-order point is already sufficient for recovering the node locations in the target dimension if the input instance satisfies certain established uniqueness properties in the literature. Finally, our simulation results show that in many cases, the proposed algorithm can achieve more accurate localization results than standard SDP relaxations of the problem.", "citation": "Citations (60)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Stanford University"], "authors": ["Senshan Ji.....http://dblp.org/pers/hd/j/Ji:Senshan", "Kam-Fung Sze.....http://dblp.org/pers/hd/s/Sze:Kam=Fung", "Zirui Zhou.....http://dblp.org/pers/hd/z/Zhou:Zirui", "Anthony Man-Cho So.....http://dblp.org/pers/hd/s/So:Anthony_Man=Cho", "Yinyu Ye.....http://dblp.org/pers/hd/y/Ye:Yinyu"], "conf": "infocom", "year": "2013", "pages": 9}