{"title": "A cooperative game based allocation for sharing data center networks.", "fields": ["bandwidth throttling", "bandwidth allocation", "network traffic control", "dynamic bandwidth allocation", "bargaining problem"], "abstract": "In current IaaS datacenters, tenants are suffering unfairness since the network bandwidth is shared in a besteffort manner. To achieve predictable network performance for rented virtual machines (VMs), cloud providers should guarantee minimum bandwidth for VMs or allocate the network bandwidth in a fairness fashion at VM-level. At the same time, the network should be efficiently utilized in order to maximize cloud providers' revenue. In this paper, we model the bandwidth sharing problem as a Nash bargaining game, and propose the allocation principles by defining a tunable base bandwidth for each VM. Specifically, we guarantee bandwidth for those VMs with lower network rates than their base bandwidth, while maintaining fairness among other VMs with higher network rates than their base bandwidth. Based on rigorous cooperative game-theoretic approaches, we design a distributed algorithm to achieve efficient and fair bandwidth allocation corresponding to the Nash bargaining solution (NBS). With simulations under typical scenarios, we show that our strategy can meet the two desirable requirements towards predictable performance for tenants as well as high utilization for providers. And by tuning the base bandwidth, our solution can enable cloud providers to flexibly balance the tradeoff between minimum guarantees and fair sharing of datacenter networks.", "citation": "Citations (69)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "The Chinese University of Hong Kong", "Huazhong University of Science and Technology"], "authors": ["Jian Guo.....http://dblp.org/pers/hd/g/Guo:Jian", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Dan Zeng.....http://dblp.org/pers/hd/z/Zeng:Dan", "John C. S. Lui.....http://dblp.org/pers/hd/l/Lui:John_C=_S=", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai"], "conf": "infocom", "year": "2013", "pages": 9}