{"title": "Split query processing in polybase.", "fields": ["spatial query", "web query classification", "view", "sargable", "query by example"], "abstract": "This paper presents Polybase, a feature of SQL Server PDW V2 that allows users to manage and query data stored in a Hadoop cluster using the standard SQL query language. Unlike other database systems that provide only a relational view over HDFS-resident data through the use of an external table mechanism, Polybase employs a split query processing paradigm in which SQL operators on HDFS-resident data are translated into MapReduce jobs by the PDW query optimizer and then executed on the Hadoop cluster. The paper describes the design and implementation of Polybase along with a thorough performance evaluation that explores the benefits of employing a split query processing paradigm for executing queries that involve both structured data in a relational DBMS and unstructured data in Hadoop. Our results demonstrate that while the use of a split-based query execution paradigm can improve the performance of some queries by as much as 10X, one must employ a cost-based query optimizer that considers a broad set of factors when deciding whether or not it is advantageous to push a SQL operator to Hadoop. These factors include the selectivity factor of the predicate, the relative sizes of the two clusters, and whether or not their nodes are co-located. In addition, differences in the semantics of the Java and SQL languages must be carefully considered in order to avoid altering the expected results of a query.", "citation": "Citations (79)", "year": "2013", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["David J. DeWitt.....http://dblp.org/pers/hd/d/DeWitt:David_J=", "Alan Halverson.....http://dblp.org/pers/hd/h/Halverson:Alan", "Rimma V. Nehme.....http://dblp.org/pers/hd/n/Nehme:Rimma_V=", "Srinath Shankar.....http://dblp.org/pers/hd/s/Shankar:Srinath", "Josep Aguilar-Saborit.....http://dblp.org/pers/hd/a/Aguilar=Saborit:Josep", "Artin Avanes.....http://dblp.org/pers/hd/a/Avanes:Artin", "Miro Flasza.....http://dblp.org/pers/hd/f/Flasza:Miro", "Jim Gramling.....http://dblp.org/pers/hd/g/Gramling:Jim"], "pages": 12}