{"title": "Inverse Density as an Inverse Problem: the Fredholm Equation Approach.", "fields": ["statistical inference", "gaussian function", "estimator", "fredholm integral equation", "importance sampling"], "abstract": "We address the problem of estimating the ratio q/p where p is a density function and q is another density, or, more generally an arbitrary function. Knowing or approximating this ratio is needed in various problems of inference and integration often referred to as importance sampling in statistical inference. It is also closely related to the problem of covariate shift in transfer learning. Our approach is based on reformulating the problem of estimating the ratio as an inverse problem in terms of an integral operator corresponding to a kernel, known as the Fredholm problem of the first kind. This formulation, combined with the techniques of regularization leads to a principled framework for constructing algorithms and for analyzing them theoretically. The resulting family of algorithms (FIRE, for Fredholm Inverse Regularized Estimator) is flexible, simple and easy to implement. We provide detailed theoretical analysis including concentration bounds and convergence rates for the Gaussian kernel for densities defined on ℝd and smooth d-dimensional sub-manifolds of the Euclidean space.\n\nModel selection for unsupervised or semi-supervised inference is generally a difficult problem. It turns out that in the density ratio estimation setting, when samples from both distributions are available, simple completely unsupervised model selection methods are available. We call this mechanism CD-CV for Cross-Density Cross-Validation. We show encouraging experimental results including applications to classification within the covariate shift framework.", "citation": "Citations (7)", "departments": ["Ohio State University", "Ohio State University"], "authors": ["Qichao Que.....http://dblp.org/pers/hd/q/Que:Qichao", "Mikhail Belkin.....http://dblp.org/pers/hd/b/Belkin:Mikhail"], "conf": "nips", "year": "2013", "pages": 9}