{"title": "Kinetic turbulence simulations at extreme scale on leadership-class systems.", "fields": ["kinetic energy", "multithreading", "grid", "scalability", "domain decomposition methods"], "abstract": "Reliable predictive simulation capability addressing confinement properties in magnetically confined fusion plasmas is critically-important for ITER, a 20 billion dollar international burning plasma device under construction in France. The complex study of kinetic turbulence, which can severely limit the energy confinement and impact the economic viability of fusion systems, requires simulations at extreme scale for such an unprecedented device size. Our newly optimized, global,  ab initio  particle-in-cell code solving the nonlinear equations underlying gyrokinetic theory achieves excellent performance with respect to \"time to solution\" at the full capacity of the IBM Blue Gene/Q on 786,432 cores of  Mira  at ALCF and recently of the 1,572,864 cores of  Sequoia  at LLNL. Recent multithreading and domain decomposition optimizations in the new GTC-P code represent critically important software advances for modern, low memory per core systems by enabling routine simulations at unprecedented size (130 million grid points ITER-scale) and resolution (65 billion particles).", "citation": "Citations (11)", "departments": ["Princeton University", "Princeton Plasma Physics Laboratory", "Princeton Plasma Physics Laboratory", "Argonne National Laboratory", "Lawrence Berkeley National Laboratory"], "authors": ["Bei Wang.....http://dblp.org/pers/hd/w/Wang:Bei", "Stéphane Ethier.....http://dblp.org/pers/hd/e/Ethier:St=eacute=phane", "William M. Tang.....http://dblp.org/pers/hd/t/Tang:William_M=", "Timothy J. Williams.....http://dblp.org/pers/hd/w/Williams:Timothy_J=", "Khaled Z. Ibrahim.....http://dblp.org/pers/hd/i/Ibrahim:Khaled_Z=", "Kamesh Madduri.....http://dblp.org/pers/hd/m/Madduri:Kamesh", "Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid"], "conf": "sc", "year": "2013", "pages": 12}