{"title": "Dynamic in-network caching for energy efficient content delivery.", "fields": ["network element", "dynamic priority scheduling", "cache", "content centric networking", "content delivery network"], "abstract": "Consider a network of prosumers of media content in which users dynamically create and request content objects. The request process is governed by the objects' popularity and varies across network regions and over time. In order to meet user requests, content objects can be stored and transported over the network, characterized by the capacity and energy efficiency of the storage and transport resources. The energy efficient dynamic in-network caching problem aims at finding the evolution of the network configuration, in terms of the content objects being cached and transported over each network element at any given time, that meets user requests, satisfies network resource capacities and minimizes overall energy use. We provide 1) an information-centric optimization framework for the energy efficient dynamic in-network caching problem, 2) an offline solution, EE-OFD, based on an integer linear program (ILP) that obtains the maximum efficiency gains that can be achieved with global knowledge of user requests and network resources, and 3) an efficient fully distributed online solution, EEOND, that allows network nodes to make local caching decisions based on their current estimate of the global energy benefit. Our solutions take into account the network heterogeneity, in terms of capacity, energy efficiency and content popularity, and adapt to changing network conditions minimizing overall energy use.", "citation": "Citations (75)", "departments": ["Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs"], "authors": ["Jaime Llorca.....http://dblp.org/pers/hd/l/Llorca:Jaime", "Antonia Maria Tulino.....http://dblp.org/pers/hd/t/Tulino:Antonia_Maria", "Kyle Guan.....http://dblp.org/pers/hd/g/Guan:Kyle", "Jairo O. Esteban.....http://dblp.org/pers/hd/e/Esteban:Jairo_O=", "Matteo Varvello.....http://dblp.org/pers/hd/v/Varvello:Matteo", "Nakjung Choi.....http://dblp.org/pers/hd/c/Choi:Nakjung", "Daniel C. Kilper.....http://dblp.org/pers/hd/k/Kilper:Daniel_C="], "conf": "infocom", "year": "2013", "pages": 5}