{"title": "Rapid generation of personalized avatars.", "fields": ["mesh generation", "rgb color model", "computer animation", "mixed reality", "simultaneous localization and mapping"], "abstract": "Summary form only given. The ICT Mixed Reality Lab will demonstrate a pipeline for rapidly generating personalized avatars from multiple depth and RGB scans of a user with a consumer level sensor such as a Microsoft Kinect. Based on a fusion of state-of-the-art techniques in graphics, surface reconstruction, and animation, our semi-automatic method can produce a fully rigged, skinned, and textured character model suitable for real-time virtual environments in less than 15 minutes. First, a 3D point cloud is collected from the sensor using a simultaneous localization and mapping (SLAM) approach to track the device's movements over time (see Figure 1.a). Next, surface reconstruction techniques are employed to generate a watertight 3D mesh from the raw 3D points (see Figure 1.b). The resulting model is then analyzed to determine the human joint locations, and if a skeleton can be successfully generated for the model, the mesh is then rigged and skinned using weights that are calculated automatically [2]. Finally, photos captured periodically during the scanning process using the sensor's RGB camera are used to texture the final model. The resulting avatar is suitable for real-time animation using a virtual environment or video game engine (see Figure 1.c). We will demonstrate our avatar generation pipeline at IEEE Virtual Reality 2013. Conference attendees may opt to be scanned, and their generated avatar will be provided to them either on a USB stick or through email. A video of this demo can be found at the MxR Lab website [1].", "citation": "Not cited", "departments": ["University of Southern California", "USC Institute f ... ve Technologies", "USC Institute f ... ve Technologies", "USC Institute f ... ve Technologies"], "authors": ["Evan A. Suma.....http://dblp.org/pers/hd/s/Suma:Evan_A=", "David M. Krum.....http://dblp.org/pers/hd/k/Krum:David_M=", "Thai Phan.....http://dblp.org/pers/hd/p/Phan:Thai", "Mark T. Bolas.....http://dblp.org/pers/hd/b/Bolas:Mark_T="], "conf": "vr", "year": "2013", "pages": 1}