{"title": "Application-aware data collection in Wireless Sensor Networks.", "fields": ["approximation algorithm", "time complexity", "dynamic programming", "key distribution in wireless sensor networks", "optimization problem"], "abstract": "Data sharing for data collection among multiple applications is an efficient way to reduce the communication cost of Wireless Sensor Networks (WSNs). This paper is the first work to introduce the interval data sharing problem which is to investigate how to transmit as less data as possible over the network, and meanwhile the transmitted data satisfies the requirements of all the applications. Different from current studies where each application requires a single data sampling during each task, we study the problem where each application requires a continuous interval of data sampling in each task instead. The proposed problem is a nonlinear nonconvex optimization problem. In order to lower the high complexity for solving a nonlinear nonconvex optimization problem in resource restricted sensor nodes, a 2-factor approximation algorithm whose time complexity is O(n 2 ) and memory complexity is O(n) is provided. A special instance of this problem is also analyzed. This special instance can be solved with a dynamic programming algorithm in polynomial time, which gives an optimal result in O(n 2 ) time complexity and O(n) memory complexity. We evaluate the proposed algorithms with TOSSIM, a widely used simulation tool in WSNs. Theoretical analysis and simulation results both demonstrate the effectiveness of the proposed algorithms.", "citation": "Citations (9)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Georgia State University"], "authors": ["Xiaolin Fang.....http://dblp.org/pers/hd/f/Fang:Xiaolin", "Hong Gao.....http://dblp.org/pers/hd/g/Gao:Hong", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Yingshu Li.....http://dblp.org/pers/hd/l/Li:Yingshu"], "conf": "infocom", "year": "2013", "pages": 9}