{"title": "ESSENTIA: an open-source library for sound and music analysis.", "fields": ["music theory", "music information retrieval", "audio analyzer", "executable", "plug in"], "abstract": "We present Essentia 2.0, an open-source C++ library for audio analysis and audio-based music information retrieval released under the Affero GPL license. It contains an extensive collection of reusable algorithms which implement audio input/output functionality, standard digital signal processing blocks, statistical characterization of data, and a large set of spectral, temporal, tonal and high-level music descriptors. The library is also wrapped in Python and includes a number of predefined executable extractors for the available music descriptors, which facilitates its use for fast prototyping and allows setting up research experiments very rapidly. Furthermore, it includes a Vamp plugin to be used with Sonic Visualiser for visualization purposes. The library is cross-platform and currently supports Linux, Mac OS X, and Windows systems. Essentia is designed with a focus on the robustness of the provided music descriptors and is optimized in terms of the computational cost of the algorithms. The provided functionality, specifically the music descriptors included in-the-box and signal processing algorithms, is easily expandable and allows for both research experiments and development of large-scale industrial applications.", "citation": "Citations (44)", "departments": ["Pompeu Fabra University", "Pompeu Fabra University", "Pompeu Fabra University", "Pompeu Fabra University", "Pompeu Fabra University"], "authors": ["Dmitry Bogdanov.....http://dblp.org/pers/hd/b/Bogdanov:Dmitry", "Nicolas Wack.....http://dblp.org/pers/hd/w/Wack:Nicolas", "Emilia Gómez.....http://dblp.org/pers/hd/g/G=oacute=mez:Emilia", "Sankalp Gulati.....http://dblp.org/pers/hd/g/Gulati:Sankalp", "Perfecto Herrera.....http://dblp.org/pers/hd/h/Herrera:Perfecto", "Oscar Mayor.....http://dblp.org/pers/hd/m/Mayor:Oscar", "Gerard Roma.....http://dblp.org/pers/hd/r/Roma:Gerard", "Justin Salamon.....http://dblp.org/pers/hd/s/Salamon:Justin", "José R. Zapata.....http://dblp.org/pers/hd/z/Zapata:Jos=eacute=_R=", "Xavier Serra.....http://dblp.org/pers/hd/s/Serra:Xavier"], "conf": "mm", "year": "2013", "pages": 4}