{"title": "'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution.", "fields": ["legitimacy", "social media", "politics", "social science", "new media"], "abstract": "We present a study conducted in Sidi Bouzid, the Tunisian town where the Arab Revolution, also known as 'Arab Spring', started, and where the role of Web 2.0 and social media applications in the people's uprising have been much discussed. We identify four relevant phenomena: (1) the publication of classified materials via WikiLeaks challenged the regime's legitimacy, (2) Web 2.0 connected local activists with Arab satellite TV, (3) social media linked the young activists with actors in other cities in Tunisia, (4) social media allowed organizing resistance inside Sidi Bouzid. Methodologically, we question a too deterministic view of the role of the new media and the representativeness of investigative techniques that uniquely use the new media in order to assess their impact. At the same time, rigorous investigations 'on the ground' are extremely difficult. We present a modest and initial attempt to provide such an 'on the ground' approach, cognizant of necessary limitations. We compare our findings with studies which analyze data downloaded out of social media applications and suggest that studies of the kind we describe offer additional insight and play an essential role in better understanding political uses of social media.", "citation": "Citations (85)", "departments": ["University of Siegen", "International Institute of Minnesota", "International Institute of Minnesota", "University of Siegen", "University of Siegen"], "authors": ["Volker Wulf.....http://dblp.org/pers/hd/w/Wulf:Volker", "Kaoru Misaki.....http://dblp.org/pers/hd/m/Misaki:Kaoru", "Meryem Atam.....http://dblp.org/pers/hd/a/Atam:Meryem", "David Randall.....http://dblp.org/pers/hd/r/Randall:David", "Markus Rohde.....http://dblp.org/pers/hd/r/Rohde:Markus"], "conf": "cscw", "year": "2013", "pages": 10}