{"title": "Design, Implementation and Verification of an eXtensible and Modular Hypervisor Framework.", "fields": ["storage hypervisor", "hypervisor", "source lines of code", "assembly language", "extensibility"], "abstract": "We present the design, implementation, and verification of XMHF- an eXtensible and Modular Hypervisor Framework. XMHF is designed to achieve three goals -- modular extensibility, automated verification, and high performance. XMHF includes a core that provides functionality common to many hypervisor-based security architectures and supports extensions that augment the core with additional security or functional properties while preserving the fundamental hypervisor security property of memory integrity (i.e., ensuring that the hypervisor's memory is not modified by software running at a lower privilege level). We verify the memory integrity of the XMHF core -- 6018 lines of code -- using a combination of automated and manual techniques. The model checker CBMC automatically verifies 5208 lines of C code in about 80 seconds using less than 2GB of RAM. We manually audit the remaining 422 lines of C code and 388 lines of assembly language code that are stable and unlikely to change as development proceeds. Our experiments indicate that XMHF's performance is comparable to popular high-performance general-purpose hypervisors for the single guest that it supports.", "citation": "Citations (89)", "departments": ["Association for Computing Machinery", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Google"], "authors": ["Amit Vasudevan.....http://dblp.org/pers/hd/v/Vasudevan:Amit", "Sagar Chaki.....http://dblp.org/pers/hd/c/Chaki:Sagar", "Limin Jia.....http://dblp.org/pers/hd/j/Jia:Limin", "Jonathan M. McCune.....http://dblp.org/pers/hd/m/McCune:Jonathan_M=", "James Newsome.....http://dblp.org/pers/hd/n/Newsome:James", "Anupam Datta.....http://dblp.org/pers/hd/d/Datta:Anupam"], "conf": "sp", "year": "2013", "pages": 15}