{"title": "Socially-optimal multi-hop secondary communication under arbitrary primary user mechanisms.", "fields": ["optimal decision", "lyapunov optimization", "frequency allocation", "cognitive radio", "hop"], "abstract": "In a cognitive radio system, licensed primary users can lease idle spectrum to secondary users for monetary remuneration. Secondary users acquire available spectrum for their data delivery needs, with the goal of achieving high throughput and low spectrum charges. Maximizing such a net utility (throughput utility minus spectrum cost) is a central problem faced by a multihop secondary network. Optimal decision making is challenging, since it involves multiple data flows, cross-layer coordination, and economic constraints (budgets of sources). The picture is further complicated by the inter-play between secondary data communication and primary spectrum leasing mechanisms. This work is the first to investigate the full spectrum of socially optimal secondary user communication. We design a social welfare maximization framework for multi-session multi-hop secondary data dissemination based on Lyapunov optimization techniques. A salient feature of the framework is that it takes any given primary user mechanism as input, and produces correspondingly a dynamic, distributed rate control, routing, and spectrum allocation and pricing protocol that can achieve longterm maximization of the overall system utility. Through rigorous theoretical analysis, we prove that our online protocol can achieve a social welfare that is arbitrarily close to the offline optimum, with only finite buffer space requirement at each secondary user, and guarantee of no buffer overflow. Empirical studies are conducted to examine the performance of the protocol.", "citation": "Citations (5)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Calgary", "University of Hong Kong"], "authors": ["Hongxing Li.....http://dblp.org/pers/hd/l/Li:Hongxing", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2013", "pages": 9}