{"title": "SurfNoC: a low latency and provably non-interfering approach to secure networks-on-chip.", "fields": ["multiplexing", "overhead", "temporal isolation among virtual machines", "microarchitecture", "low latency"], "abstract": "As multicore processors find increasing adoption in domains such as aerospace and medical devices where failures have the potential to be catastrophic, strong performance isolation and security become first-class design constraints. When cores are used to run separate pieces of the system, strong time and space partitioning can help provide such guarantees. However, as the number of partitions or the asymmetry in partition bandwidth allocations grows, the additional latency incurred by time multiplexing the network can significantly impact performance.   In this paper, we introduce SurfNoC, an on-chip network that significantly reduces the latency incurred by temporal partitioning. By carefully scheduling the network into waves that flow across the interconnect, data from different domains carried by these waves are strictly non-interfering while avoiding the significant overheads associated with cycle-by-cycle time multiplexing. We describe the scheduling policy and router microarchitecture changes required, and evaluate the information-flow security of a synthesizable implementation through gate-level information flow analysis. When comparing our approach for varying numbers of domains and network sizes, we find that in many cases SurfNoC can reduce the latency overhead of implementing cycle-level non-interference by up to 85%.", "citation": "Citations (71)", "year": "2013", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, San Diego", "Naval Postgraduate School", "University of California, San Diego"], "conf": "isca", "authors": ["Hassan M. G. Wassel.....http://dblp.org/pers/hd/w/Wassel:Hassan_M=_G=", "Ying Gao.....http://dblp.org/pers/hd/g/Gao:Ying", "Jason Oberg.....http://dblp.org/pers/hd/o/Oberg:Jason", "Ted Huffmire.....http://dblp.org/pers/hd/h/Huffmire:Ted", "Ryan Kastner.....http://dblp.org/pers/hd/k/Kastner:Ryan", "Frederic T. Chong.....http://dblp.org/pers/hd/c/Chong:Frederic_T=", "Timothy Sherwood.....http://dblp.org/pers/hd/s/Sherwood:Timothy"], "pages": 12}