{"title": "Analysis and forecasting of trending topics in online media streams.", "fields": ["digital media", "streams", "page view", "mean absolute percentage error", "social media"], "abstract": "Among the vast information available on the web, social media streams capture what people currently pay attention to and how they feel about certain topics. Awareness of such trending topics plays a crucial role in multimedia systems such as trend aware recommendation and automatic vocabulary selection for video concept detection systems. Correctly utilizing trending topics requires a better understanding of their various characteristics in different social media streams. To this end, we present the first comprehensive study across three major online and social media streams, Twitter, Google, and Wikipedia, covering thousands of trending topics during an observation period of an entire year. Our results indicate that depending on one's requirements one does not necessarily have to turn to Twitter for information about current events and that some media streams strongly emphasize content of specific categories. As our second key contribution, we further present a novel approach for the challenging task of forecasting the life cycle of trending topics in the very moment they emerge. Our fully automated approach is based on a nearest neighbor forecasting technique exploiting our assumption that semantically similar topics exhibit similar behavior.   We demonstrate on a large-scale dataset of Wikipedia page view statistics that forecasts by the proposed approach are about 9-48k views closer to the actual viewing statistics compared to baseline methods and achieve a mean average percentage error of 45-19% for time periods of up to 14 days.", "citation": "Citations (22)", "departments": ["German Research Centre for Artificial Intelligence", "German Research Centre for Artificial Intelligence", "German Research Centre for Artificial Intelligence", "German Research Centre for Artificial Intelligence"], "authors": ["Tim Althoff.....http://dblp.org/pers/hd/a/Althoff:Tim", "Damian Borth.....http://dblp.org/pers/hd/b/Borth:Damian", "Jörn Hees.....http://dblp.org/pers/hd/h/Hees:J=ouml=rn", "Andreas Dengel.....http://dblp.org/pers/hd/d/Dengel:Andreas"], "conf": "mm", "year": "2013", "pages": 10}