{"title": "What can pictures tell us about web pages?: improving document search using images.", "fields": ["phrase search", "ranking", "concept search", "multimedia search", "full text search", "search analytics", "web search query", "web query classification", "query expansion"], "abstract": "Traditional Web search engines do not use the images in the HTML pages to find relevant documents for a given query. Instead, they typically operate by computing a measure of agreement between the keywords provided by the user and only the text portion of each page. In this paper we study whether the  content  of the pictures appearing in a Web page can be used to enrich the semantic description of an HTML document and consequently boost the performance of a keyword-based search engine. We present a Web-scalable system that exploits a pure text-based search engine to find an initial set of candidate documents for a given query. Then, the candidate set is reranked using visual information extracted from the images contained in the pages. The resulting system retains the computational efficiency of traditional text-based search engines with only a small additional storage cost needed to encode the visual information. We test our approach on one of the TREC Million Query Track benchmarks where we show that the exploitation of visual content yields improvement in accuracies for two distinct text-based search engines, including the system with the best reported performance on this benchmark. We further validate our approach by collecting document relevance judgements on our search results using Amazon Mechanical Turk. The results of this experiment confirm the improvement in accuracy produced by our image-based reranker over a pure text-based system.", "citation": "Citations (2)", "departments": ["Dartmouth College", "Microsoft", "Dartmouth College", "Microsoft", ", Tecnalia, Zam ...  Bizkaia, Spain", "Tecnalia, Zamudio, Spain"], "authors": ["Sergio Rodríguez-Vaamonde.....http://dblp.org/pers/hd/r/Rodr=iacute=guez=Vaamonde:Sergio", "Lorenzo Torresani.....http://dblp.org/pers/hd/t/Torresani:Lorenzo", "Andrew W. Fitzgibbon.....http://dblp.org/pers/hd/f/Fitzgibbon:Andrew_W="], "conf": "sigir", "year": "2013", "pages": 4}