{"title": "Carpé data: supporting serendipitous data integration in personal information management.", "fields": ["personal information management", "information integration", "group information management", "data integration", "enterprise information integration"], "abstract": "The information processing capabilities of humans enable them to opportunistically draw and integrate knowledge from nearly any information source. However, the integration of digital, structured data from diverse sources remains difficult, due to problems of heterogeneity that arise when data modelled separately are brought together. In this paper, we present an investigation of the feasibility of extending Personal Information Management (PIM) tools to support lightweight, user-driven mixing of previously un-integrated data, with the objective of allowing users to take advantage of the emerging ecosystems of structured data currently becoming available. In this study, we conducted an exploratory, sequential, mixed-method investigation, starting with two pre-studies of the data integration needs and challenges, respectively, of Web-based data sources. Observations from these pre-studies led to  DataPalette , an interface that introduced simple co-reference and group multi-path-selection mechanisms for working with terminologically and structurally heterogeneous data. Our lab study showed that participants readily understood the new interaction mechanisms which were introduced. Participants made more carefully justified decisions, even while weighing a greater number of factors, moreover expending less effort, during subjective-choice tasks when using DataPalette, than with a control set-up.", "citation": "Citations (12)", "departments": ["University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton"], "authors": ["Max Van Kleek.....http://dblp.org/pers/hd/k/Kleek:Max_Van", "Daniel A. Smith.....http://dblp.org/pers/hd/s/Smith:Daniel_A=", "Heather S. Packer.....http://dblp.org/pers/hd/p/Packer:Heather_S=", "Jim Skinner.....http://dblp.org/pers/hd/s/Skinner:Jim", "Nigel R. Shadbolt.....http://dblp.org/pers/hd/s/Shadbolt:Nigel_R="], "conf": "chi", "year": "2013", "pages": 10}