{"title": "MVAPICH-PRISM: a proxy-based communication framework using InfiniBand and SCIF for intel MIC clusters.", "fields": ["chipset", "pci express", "x86", "remote direct memory access", "xeon phi"], "abstract": "Xeon Phi, based on the Intel Many Integrated Core (MIC) architecture, packs up to 1TFLOPs of performance on a single chip while providing x86__64 compatibility. On the other hand, InfiniBand is one of the most popular choices of interconnect for supercomputing systems. The software stack on Xeon Phi allows processes to directly access an InfiniBand HCA on the node and thus, provides a low latency path for internode communication. However, drawbacks in the state-of-the-art chipsets like Sandy Bridge limit the bandwidth available for these transfers. In this paper, we propose  MVAPICH-PRISM , a novel proxy-based framework to optimize the communication performance on such systems. We present several designs and evaluate them using micro-benchmarks and application kernels. Our designs improve internode latency between Xeon Phi processes by up to 65% and internode bandwidth by up to five times. Our designs improve the performance of MPI_Alltoall operation by up to 65%, with 256 processes. They improve the performance of a 3D Stencil communication kernel and the P3DFFT library by 56% and 22% with 1,024 and 512 processes, respectively.", "citation": "Citations (30)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Sreeram Potluri.....http://dblp.org/pers/hd/p/Potluri:Sreeram", "Devendar Bureddy.....http://dblp.org/pers/hd/b/Bureddy:Devendar", "Khaled Hamidouche.....http://dblp.org/pers/hd/h/Hamidouche:Khaled", "Akshay Venkatesh.....http://dblp.org/pers/hd/v/Venkatesh:Akshay", "Krishna Chaitanya Kandalla.....http://dblp.org/pers/hd/k/Kandalla:Krishna_Chaitanya", "Hari Subramoni.....http://dblp.org/pers/hd/s/Subramoni:Hari", "Dhabaleswar K. Panda.....http://dblp.org/pers/hd/p/Panda:Dhabaleswar_K="], "conf": "sc", "year": "2013", "pages": 11}