{"title": "WiFi-BA: Choosing arbitration over backoff in high speed multicarrier wireless networks.", "fields": ["collision", "phy", "physical layer", "collision detection", "exponential backoff"], "abstract": "Advancements in wireless communication techniques have increased the wireless physical layer (PHY) data rates by hundreds of times in a dozen years. The high PHY data rates, however, have not been translated to commensurate throughput gains due to overheads incurred by medium access control (MAC) and PHY convergence procedure. At high PHY data rates, the time used for collision avoidance (CA) at MAC layer and the time used for PHY convergence procedure can easily exceed the time used for transmission of an actual data frame. Recent work intends to reduce the CA overhead by reducing the backoff time slot size. However, the method introduces more collisions in presence of hidden terminals because the tiny backoff slots can no longer de-synchronize hidden terminals, leading to persistent collisions among hidden terminals. As collision detection (CD) in wireless communication became feasible recently, some protocols migrate random backoff from the time domain to the frequency domain, but they fail to address the introduced high collision probability. We investigate the practical issues of CD in the frequency domain and introduce a binary mapping scheme to reduce the collision probability. Based on the binary mapping, a bitwise arbitration (BA) mechanism is devised to grant only one transmitter the permission to initiate data transmission in a contention. With the low collision probability achieved in a short bounded arbitration phase, the throughput is significantly improved by our proposed WiFi-BA. Because collisions are unlikely to happen, unfairness caused by capture effect of radios is also reduced. The bitwise arbitration mechanism can further be set to let high priority messages get through unimpeded, making WiFi-BA suitable for real time prioritized communication. We validate the effectiveness of WiFi-BA through implementation on FPGA of USRP E110. Performance evaluation demonstrates that WiFi-BA is more efficient than current Wi-Fi solutions.", "citation": "Citations (14)", "departments": ["Michigan State University", "Michigan State University", "Michigan State University"], "authors": ["Pei Huang.....http://dblp.org/pers/hd/h/Huang:Pei", "Xi Yang.....http://dblp.org/pers/hd/y/Yang:Xi", "Li Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Li"], "conf": "infocom", "year": "2013", "pages": 9}