{"title": "Enabling low bitrate mobile visual recognition: a performance versus bandwidth evaluation.", "fields": ["hash function", "exploit", "image scaling", "visual search", "thumbnail"], "abstract": "The rapid development of technologies in both hardware and software have made content-based multimedia services feasible on mobile devices such as smartphones and tablets; and the strong needs for mobile visual search and recognition have been emerging. While many real applications of visual recognition require a large scale recognition systems, the same technologies that support server-based scalable visual recognition may not be feasible on mobile devices due to the resource constraints. Although the client-server framework ensures the scalability, the real-time response subjects to the limitation on network bandwidth. Therefore, the main challenge for mobile visual recognition system should be the recognition bitrate, which is the amount of data transmission under the same recognition performance. For this work, we exploit and compare various strategies such as compact features, feature compression, feature signatures by hashing, image scaling, etc., to enable low bitrate mobile visual recognition. We argue that thumbnail image is a competitive candidate for low bitrate visual recognition because it carries multiple features at once and multi-feature fusion is important as the size of semantic space increases. Our evaluations on two subsets of ImageNet, both contain more than 10,000 images with 19 and 137 categories, verify the efficacy of thumbnail images. We further suggest a new strategy that combines single (local) feature signature and the thumbnail image, which achieves significant bitrate reduction from (average) 102,570 to 4,661 bytes with merely (overall) 10% performance degradation.", "citation": "Citations (8)", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University"], "authors": ["Yu-Chuan Su.....http://dblp.org/pers/hd/s/Su:Yu=Chuan", "Tzu-Hsuan Chiu.....http://dblp.org/pers/hd/c/Chiu:Tzu=Hsuan", "Yan-Ying Chen.....http://dblp.org/pers/hd/c/Chen:Yan=Ying", "Chun-Yen Yeh.....http://dblp.org/pers/hd/y/Yeh:Chun=Yen", "Winston H. Hsu.....http://dblp.org/pers/hd/h/Hsu:Winston_H="], "conf": "mm", "year": "2013", "pages": 10}