{"title": "Effective epidemic control and source tracing through mobile social sensing over WBANs.", "fields": ["tracing", "distributed computing", "social network", "mobile phone", "computer network"], "abstract": "Accurate and real-time tracing of epidemic sources is critical for epidemic origin analyses and control when outbreaks of epidemic diseases occur. Such tracing requires the simultaneous availability of information about social interactions among people as well as their body vital signs. Existing epidemic control methods are limited due to their inability to collect the above two types of information at the same time. In this paper, for the first time, we propose integrating wireless body area networks (WBANs) for body vital signs collection with mobile phones for social interaction sensing to achieve the desired epidemic source tracing. In particular, we design a mobile phone capability driven hierarchical social interaction detection framework integrated with WBANs. With this framework, we further propose a set of epidemic source tracing and control algorithms including genetic algorithm based search and dominating set identification algorithms to effectively identify epidemic sources and inhibit epidemic spread. We have also conducted extensive simulations, analyses, and case studies based on real data sets, which demonstrate the accuracy and effectiveness of our proposed solutions.", "citation": "Citations (9)", "departments": ["University of Massachusetts Dartmouth", "University of Massachusetts Dartmouth", "University of Ontario Institute of Technology", "University of Massachusetts Medical School", "Ohio State University"], "authors": ["Zhaoyang Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Zhaoyang", "Honggang Wang.....http://dblp.org/pers/hd/w/Wang:Honggang", "Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong", "Hua Fang.....http://dblp.org/pers/hd/f/Fang:Hua", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong"], "conf": "infocom", "year": "2013", "pages": 5}