{"title": "Parallel suffix array and least common prefix for the GPU.", "fields": ["compressed suffix array", "lcp array", "suffix array", "suffix tree", "prefix sum"], "abstract": "Suffix Array (SA) is a data structure formed by sorting the suffixes of a string into lexicographic order. SAs have been used in a variety of applications, most notably in pattern matching and Burrows-Wheeler Transform (BWT) based lossless data compression. SAs have also become the data structure of choice for many, if not all, string processing problems to which suffix tree methodology is applicable. Over the last two decades researchers have proposed many suffix array construction algorithm (SACAs). We do a systematic study of the main classes of SACAs with the intent of mapping them onto a data parallel architecture like the GPU. We conclude that  skew algorithm  [12], a linear time recursive algorithm, is the best candidate for GPUs as all its phases can be efficiently mapped to a data parallel hardware. Our OpenCL implementation of  skew algorithm  achieves a throughput of up to 25 MStrings/sec and a speedup of up to 34x and 5.8x over a single threaded CPU implementation using a discrete GPU and APU respectively. We also compare our OpenCL implementation against the fastest known CPU implementation based on  induced copying  and achieve a speedup of up to 3.7x. Using SA we construct BWT on GPU and achieve a speedup of 11x over the fastest known BWT on GPU.   Suffix arrays are often augmented with the longest common prefix (LCP) information. We design a novel high-performance parallel algorithm for computing LCP on the GPU. Our GPU implementation of LCP achieves a speedup of up to 25x and 4.3x on discrete GPU and APU respectively.", "citation": "Citations (24)", "year": "2013", "departments": ["Advanced Micro Devices", "Advanced Micro Devices"], "conf": "ppopp", "authors": ["Mrinal Deo.....http://dblp.org/pers/hd/d/Deo:Mrinal", "Sean Keely.....http://dblp.org/pers/hd/k/Keely:Sean"], "pages": 10}