{"title": "When private set intersection meets big data: an efficient and scalable protocol.", "fields": ["distributed computing", "big data", "bloom filter", "scalability", "symmetric key algorithm", "theoretical computer science", "intersection", "bloom", "universal composability"], "abstract": "Large scale data processing brings new challenges to the design of privacy-preserving protocols: how to meet the increasing requirements of speed and throughput of modern applications, and how to scale up smoothly when data being protected is big. Efficiency and scalability become critical criteria for privacy preserving protocols in the age of Big Data. In this paper, we present a new Private Set Intersection (PSI) protocol that is extremely efficient and highly scalable compared with existing protocols. The protocol is based on a novel approach that we call oblivious Bloom intersection. It has linear complexity and relies mostly on efficient symmetric key operations. It has high scalability due to the fact that most operations can be parallelized easily. The protocol has two versions: a basic protocol and an enhanced protocol, the security of the two variants is analyzed and proved in the semi-honest model and the malicious model respectively. A prototype of the basic protocol has been built. We report the result of performance evaluation and compare it against the two previously fastest PSI protocols. Our protocol is orders of magnitude faster than these two protocols. To compute the intersection of two million-element sets, our protocol needs only 41 seconds (80-bit security) and 339 seconds (256-bit security) on moderate hardware in parallel mode.", "citation": "Not cited", "year": "2013", "departments": ["University of Strathclyde", "Hewlett-Packard", "University of Strathclyde"], "conf": "ccs", "authors": ["Changyu Dong.....http://dblp.org/pers/hd/d/Dong:Changyu", "Liqun Chen.....http://dblp.org/pers/hd/c/Chen:Liqun", "Zikai Wen.....http://dblp.org/pers/hd/w/Wen:Zikai"], "pages": 12}