{"title": "C-Cube: Elastic continuous clustering in the cloud.", "fields": ["workload", "news aggregator", "data stream clustering", "hash function", "server"], "abstract": "Continuous clustering analysis over a data stream reports clustering results incrementally as updates arrive. Such analysis has a wide spectrum of applications, including traffic monitoring and topic discovery on microblogs. A common characteristic of streaming applications is that the amount of workload fluctuates, often in an unpredictable manner. On the other hand, most existing solutions for continuous clustering assume either a central server, or a distributed setting with a fixed number of dedicated servers. In other words, they are not ELASTIC, meaning that they cannot dynamically adapt to the amount of computational resources to the fluctuating workload. Consequently, they incur considerable waste of resources, as the servers are under-utilized when the amount of workload is low. This paper proposes C-Cube, the first elastic approach to continuous streaming clustering. Similar to popular cloud-based paradigms such as MapReduce, C-Cube routes each new record to a processing unit, e.g., a virtual machine, based on its hash value. Each processing unit performs the required computations, and sends its results to a lightweight aggregator. This design enables dynamic adding/removing processing units, as well as replacing faulty ones and re-running their tasks. In addition to elasticity, C-Cube is also effective (in that it provides quality guarantees on the clustering results), efficient (it minimizes the computational workload at all times), and generally applicable to a large class of clustering criteria. We implemented C-Cube in a real system based on Twitter Storm, and evaluated it using real and synthetic datasets. Extensive experimental results confirm our performance claims.", "citation": "Citations (8)", "departments": ["Southeast University", "Southeast University", "Aalborg University", "Adv. Digital Sc ... pore, Singapore", "Adv. Digital Sc ... pore, Singapore"], "authors": ["Zhenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenjie", "Hu Shu.....http://dblp.org/pers/hd/s/Shu:Hu", "Zhihong Chong.....http://dblp.org/pers/hd/c/Chong:Zhihong", "Hua Lu.....http://dblp.org/pers/hd/l/Lu_0001:Hua", "Yin Yang.....http://dblp.org/pers/hd/y/Yang:Yin"], "conf": "icde", "year": "2013", "pages": 12}