{"title": "Unikernels: library operating systems for the cloud.", "fields": ["storage hypervisor", "hypervisor", "microkernel", "unikernel", "functional programming"], "abstract": "We present  unikernels , a new approach to deploying cloud services via applications written in high-level source code. Unikernels are single-purpose appliances that are compile-time specialised into standalone kernels, and sealed against modification when deployed to a cloud platform. In return they offer significant reduction in image sizes, improved efficiency and security, and should reduce operational costs. Our Mirage prototype compiles OCaml code into unikernels that run on commodity clouds and offer an order of magnitude reduction in code size without significant performance penalty. The architecture combines static type-safety with a single address-space layout that can be made immutable via a hypervisor extension. Mirage contributes a suite of type-safe protocol libraries, and our results demonstrate that the hypervisor is a platform that overcomes the hardware compatibility issues that have made past library operating systems impractical to deploy in the real-world.", "citation": "Citations (257)", "year": "2013", "departments": ["University of Cambridge", "University of Nottingham", "University of Cambridge", "University of Cambridge", "Citrix Systems  ...  United Kingdom"], "conf": "asplos", "authors": ["Anil Madhavapeddy.....http://dblp.org/pers/hd/m/Madhavapeddy:Anil", "Richard Mortier.....http://dblp.org/pers/hd/m/Mortier:Richard", "Charalampos Rotsos.....http://dblp.org/pers/hd/r/Rotsos:Charalampos", "David J. Scott.....http://dblp.org/pers/hd/s/Scott:David_J=", "Balraj Singh.....http://dblp.org/pers/hd/s/Singh:Balraj", "Thomas Gazagnaire.....http://dblp.org/pers/hd/g/Gazagnaire:Thomas", "Steven Smith.....http://dblp.org/pers/hd/s/Smith:Steven", "Steven Hand.....http://dblp.org/pers/hd/h/Hand:Steven", "Jon Crowcroft.....http://dblp.org/pers/hd/c/Crowcroft:Jon"], "pages": 12}