{"title": "Accelerating sparse matrix-vector multiplication on GPUs using bit-representation-optimized schemes.", "fields": ["memory bandwidth", "matrix multiplication", "sparse matrix vector multiplication", "sparse matrix", "speedup"], "abstract": "The sparse matrix-vector (SpMV) multiplication routine is an important building block used in many iterative algorithms for solving scientific and engineering problems. One of the main challenges of SpMV is its memory-boundedness. Although compression has been proposed previously to improve SpMV performance on CPUs, its use has not been demonstrated on the GPU because of the serial nature of many compression and decompression schemes. In this paper, we introduce a family of bit-representation-optimized (BRO) compression schemes for representing sparse matrices on GPUs. The proposed schemes, BRO-ELL, BRO-COO, and BRO-HYB, perform compression on index data and help to speed up SpMV on GPUs through reduction of memory traffic. Furthermore, we formulate a BRO-aware matrix reordering scheme as a data clustering problem and use it to increase compression ratios. With the proposed schemes, experiments show that average speedups of 1.5x compared to ELLPACK and HYB can be achieved for SpMV on GPUs.", "citation": "Citations (24)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Wai Teng Tang.....http://dblp.org/pers/hd/t/Tang:Wai_Teng", "Wen Jun Tan.....http://dblp.org/pers/hd/t/Tan:Wen_Jun", "Rajarshi Ray.....http://dblp.org/pers/hd/r/Ray_0001:Rajarshi", "Yi Wen Wong.....http://dblp.org/pers/hd/w/Wong:Yi_Wen", "Weiguang Chen.....http://dblp.org/pers/hd/c/Chen:Weiguang", "Shyh-Hao Kuo.....http://dblp.org/pers/hd/k/Kuo:Shyh=Hao", "Rick Siow Mong Goh.....http://dblp.org/pers/hd/g/Goh:Rick_Siow_Mong", "Stephen John Turner.....http://dblp.org/pers/hd/t/Turner:Stephen_John", "Weng-Fai Wong.....http://dblp.org/pers/hd/w/Wong:Weng=Fai"], "conf": "sc", "year": "2013", "pages": 12}