{"title": "A contract-based approach for ancillary services in V2G networks: Optimality and learning.", "fields": ["unit price", "profit", "news aggregator", "grid", "software deployment"], "abstract": "With the foreseeable large scale deployment of electric vehicles (EVs) and the development of vehicle-to-grid (V2G) technologies, it is possible to provide ancillary services to the power grid in a cost efficient way, i.e., through the bidirectional power flow of EVs. A key issue in such kind of schemes is how to stimulate a large number of EVs to act coordinately to achieve the service request. This is challenging since EVs are self-interested and generally have different preferences toward charging and discharging based on their own constraints. In this paper, we propose a contract-based mechanism to tackle this challenge. Through the design of an optimal contract, the aggregator can provide incentives for EVs to participate in ancillary services to power grid, match the aggregated energy rate with the service request and maximize its own profits. We prove that under mild conditions, the optimal contract-based mechanism takes a very simple form, i.e., the aggregator only needs to publish an optimal unit price to EVs, which is determined based on the statistical distribution of EVs' preferences. We then consider a more practical scenario where the aggregator has no prior knowledge regarding the statistical distribution and study how should the aggregator learn the optimal unit price from its interactions with EVs. Simulation results are shown to verify the effectiveness of the proposed contract-based mechanism.", "citation": "Citations (16)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "National Taiwan University", "University of Maryland, College Park"], "authors": ["Yang Gao.....http://dblp.org/pers/hd/g/Gao_0006:Yang", "Yan Chen.....http://dblp.org/pers/hd/c/Chen_0007:Yan", "Chih-Yu Wang.....http://dblp.org/pers/hd/w/Wang_0001:Chih=Yu", "K. J. Ray Liu.....http://dblp.org/pers/hd/l/Liu:K=_J=_Ray"], "conf": "infocom", "year": "2013", "pages": 9}