{"title": "Multi-level Unified Caches for Probabilistically Time Analysable Real-Time Systems.", "fields": ["cache invalidation", "bus sniffing", "cache pollution", "smart cache", "mesi protocol"], "abstract": "Caches are key resources in high-end processor architectures to increase performance. In fact, most high-performance processors come equipped with a multi-level cache hierarchy. In terms of guaranteed performance, however, cache hierarchies severely challenge the computation of tight worst-case execution time (WCET) estimates. On the one hand, the analysis of the timing behaviour of a single level of cache is already challenging, particularly for data accesses. On the other hand, unifying data and instructions in each level, makes the problem of cache analysis significantly more complex requiring tracking simultaneously data and instruction accesses to cache. In this paper we prove that multi-level cache hierarchies can be used in the context of Probabilistic Timing Analysis and tight WCET estimates can be obtained. Our detailed analysis (1) covers unified data and instruction caches, (2) covers different cache-write policies (write-through and write back), write allocation policies (write-allocate and non-write-allocate) and several inclusion mechanisms (inclusive, non-inclusive and exclusive caches), and (3) scales to an arbitrary number of cache levels. Our results show that the probabilistic WCET (pWCET) estimates provided by our analysis technique effectively benefit from having multi-level caches. For a two-level cache configuration and for EEMBC benchmarks, pWCET reductions are 55% on average (and up to 90%) with respect to a processor with a single level of cache.", "citation": "Citations (24)", "year": "2013", "departments": ["Polytechnic University of Catalonia", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Spanish National Research Council"], "conf": "rtss", "authors": ["Leonidas Kosmidis.....http://dblp.org/pers/hd/k/Kosmidis:Leonidas", "Jaume Abella.....http://dblp.org/pers/hd/a/Abella:Jaume", "Eduardo Quiñones.....http://dblp.org/pers/hd/q/Qui=ntilde=ones:Eduardo", "Francisco J. Cazorla.....http://dblp.org/pers/hd/c/Cazorla:Francisco_J="], "pages": 12}