{"title": "Groupon in the Air: A three-stage auction framework for Spectrum Group-buying.", "fields": ["spectrum auction", "generalized second price auction", "auction theory", "auction algorithm", "dynamic spectrum management"], "abstract": "Spectrum auction is widely applied in spectrum redistributions, especially under the dynamic spectrum management context. However, due to the high price asked by the spectrum holders, secondary users (SUs) with limited budget cannot benefit from such auction directly. Motivated by the recent group-buying behaviors in the Internet based service, we advocate that SUs can be grouped together to take part in the spectrum auction as a whole to increase their chances to win the channel. The cost and benefit of the won spectrum are then shared evenly among the SUs within the group. None of the existing auction models can be applied in this scenario due to three unique challenges: how can a group leader select the winning SUs and charge them fairly and efficiently; how to guarantee truthfulness of users' bids; how to match the heterogeneous channels to groups when one group would like to buy at most one channel. In this paper, we propose TASG, a Three-stage Auction framework for Spectrum Group-buying to address the above challenges and enable group-buying behaviors among SUs. In the first stage, we propose an algorithm to decide the group members and bids for the channels. In the second stage, we conduct auction between the group leaders and the spectrum holder, with a novel winner determination algorithm. In the third stage, the group leaders further distribute spectrum and bills to the SUs in the group. TASG possesses good properties such as truthfulness, individual rationality, improved system efficiency, and computational tractability.", "citation": "Citations (42)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Peng Lin.....http://dblp.org/pers/hd/l/Lin_0003:Peng", "Xiaojun Feng.....http://dblp.org/pers/hd/f/Feng:Xiaojun", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Mounir Hamdi.....http://dblp.org/pers/hd/h/Hamdi:Mounir"], "conf": "infocom", "year": "2013", "pages": 9}