{"title": "Approaching reliable realtime communications? A novel system design and implementation for roadway safety oriented vehicular communications.", "fields": ["phenomenon", "vehicular ad hoc network", "computer engineering", "software design", "systems design", "packet loss", "embedded system", "dedicated short range communications", "engineering"], "abstract": "Though there exist ready-made DSRC/WiFi/3G/4G cellular systems for roadway communications, there are common defects in these systems for roadway safety oriented applications and the corresponding challenges remain unsolved for years, i.e., WiFi cannot work well in vehicular networks due to the high probability of packet loss caused by burst communications, which is a common phenomenon in roadway networks; 3G/4G cannot well support real-time communications due to the nature of their designs; DSRC lacks the support to roadway safety oriented applications with hard realtime and reliability requirements [1]. To solve the conflict between the capability limitations of existing systems and the ever-growing demands of roadway safety oriented communication applications, we propose a novel system design and implementation for realtime reliable roadway communications, aiming at providing safety messages to users in a realtime and reliable manner. In our extensive experimental study, the latency is well controlled within the hard realtime requirement (100ms) for roadway safety applications given by NHTSA [2], and the reliability is proved to be improved by two orders of magnitude compared with existing experimental results [1]. Our experiments show that the proposed system for roadway safety communications can provide guaranteed highly reliable packet delivery ratio (PDR) of 99% within the hard realtime requirement 100ms under various scenarios, e.g., highways, city areas, rural areas, tunnels, bridges. Our design can be widely applied for roadway communications and facilitate the current research in both hardware and software design and further provide an opportunity to consolidate the existing work on a practical and easy-configurable low-cost roadway communication platform.", "citation": "Not cited", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "Hefei University of Technology", "Tsinghua University"], "authors": ["Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai", "Tianbo Gu.....http://dblp.org/pers/hd/g/Gu:Tianbo", "Zhengang Zhao.....http://dblp.org/pers/hd/z/Zhao:Zhengang", "Lei Shi.....http://dblp.org/pers/hd/s/Shi:Lei", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Pengfei Hu.....http://dblp.org/pers/hd/h/Hu:Pengfei", "Yuepeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Yuepeng", "Yi Liang.....http://dblp.org/pers/hd/l/Liang:Yi", "Shuo Zhang.....http://dblp.org/pers/hd/z/Zhang:Shuo", "Yang Wang.....http://dblp.org/pers/hd/w/Wang_0015:Yang", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng"], "conf": "infocom", "year": "2013", "pages": 5}