{"title": "Robust distributed stream processing.", "fields": ["query optimization", "logical conjunction", "probabilistic logic", "parametric statistics", "data stream mining"], "abstract": "Distributed stream processing systems must function efficiently for data streams that fluctuate in their arrival rates and data distributions. Yet repeated and prohibitively expensive load re-allocation across machines may make these systems ineffective, potentially resulting in data loss or even system failure. To overcome this problem, we instead propose a load distribution (RLD) strategy that is robust to data fluctuations. RLD provides ϵ-optimal query performance under load fluctuations without suffering from the performance penalty caused by load migration. RLD is based on three key strategies. First, we model robust distributed stream processing as a parametric query optimization problem. The notions of robust logical and robust physical plans then are overlays of this parameter space. Second, our Early-terminated Robust Partitioning (ERP) finds a set of robust logical plans, covering the parameter space, while minimizing the number of prohibitively expensive optimizer calls with a probabilistic bound on the space coverage. Third, our OptPrune algorithm maps the space-covering logical solution to a single robust physical plan tolerant to deviations in data statistics that maximizes the parameter space coverage at runtime. Our experimental study using stock market and sensor networks streams demonstrates that our RLD methodology consistently outperforms state-of-the-art solutions in terms of efficiency and effectiveness in highly fluctuating data stream environments.", "citation": "Citations (15)", "departments": ["Comput. Sci. De ... cester, MA, USA", "Comput. Sci. De ... cester, MA, USA", "Comput. Sci. De ... cester, MA, USA"], "authors": ["Chuan Lei.....http://dblp.org/pers/hd/l/Lei:Chuan", "Elke A. Rundensteiner.....http://dblp.org/pers/hd/r/Rundensteiner:Elke_A=", "Joshua D. Guttman.....http://dblp.org/pers/hd/g/Guttman:Joshua_D="], "conf": "icde", "year": "2013", "pages": 12}