{"title": "Where You Like to Go Next: Successive Point-of-Interest Recommendation.", "fields": ["user experience design", "matrix decomposition", "point of interest", "exploit", "computation"], "abstract": "Personalized point-of-interest (POI) recommendation is a significant task in location-based social networks (LBSNs) as it can help provide better user experience as well as enable third-party services, e.g., launching advertisements. To provide a good recommendation, various research has been conducted in the literature. However, pervious efforts mainly consider the \"check-ins\" in a whole and omit their temporal relation. They can only recommend POI globally and cannot know where a user would like to go tomorrow or in the next few days. In this paper, we consider the task of successive personalized POI recommendation in LBSNs, which is a much harder task than standard personalized POI recommendation or prediction. To solve this task, we observe two prominent properties in the check-in sequence: personalized Markov chain and region localization. Hence, we propose a novel matrix factorization method, namely FPMC-LR, to embed the personalized Markov chains and the localized regions. Our proposed FPMC-LR not only exploits the personalized Markov chain in the check-in sequence, but also takes into account users' movement constraint, i.e., moving around a localized region. More importantly, utilizing the information of localized regions, we not only reduce the computation cost largely, but also discard the noisy information to boost recommendation. Results on two real-world LBSNs datasets demonstrate the merits of our proposed FPMC-LR.", "citation": "Citations (243)", "year": "2013", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "conf": "ijcai", "authors": ["Chen Cheng.....http://dblp.org/pers/hd/c/Cheng:Chen", "Haiqin Yang.....http://dblp.org/pers/hd/y/Yang:Haiqin", "Michael R. Lyu.....http://dblp.org/pers/hd/l/Lyu:Michael_R=", "Irwin King.....http://dblp.org/pers/hd/k/King:Irwin"], "pages": 7}