{"title": "Write policies for host-side flash caches.", "fields": ["transactional leadership", "consistency model", "cache", "data consistency", "durability"], "abstract": "Host-side flash-based caching offers a promising new direction for optimizing access to networked storage. Current work has argued for using host-side flash primarily as a read cache and employing a write-through policy which provides the strictest consistency and durability guarantees. However, write-through requires synchronous updates over the network for every write. For write-mostly or write-intensive workloads, it significantly under-utilizes the high-performance flash cache layer. The write-back policy, on the other hand, better utilizes the cache for workloadswith significantwrite I/O requirements. However, conventional write-back performs out-of-order eviction of data and unacceptably sacrifices data consistency at the network storage.\n\nWe develop and evaluate two consistent write-back caching policies, ordered and journaled, that are designed to perform increasingly better than write-through. These policies enable new trade-off points across performance, data consistency, and data staleness dimensions. Using benchmark workloads such as PostMark, TPC-C, Filebench, and YCSB we evaluate the new write policies we propose alongside conventional write-through and write-back. We find that ordered write-back performs better than write-through. Additionally, we find that journaled write-back can trade-off staleness for performance, approaching, and in some cases, exceeding conventional write-back performance. Finally, a variant of journaled write-back that utilizes consistency hints from the application can provide straightforward application-level storage consistency, a stricter form of consistency than the transactional consistency provided by write-through.", "citation": "Citations (101)", "departments": ["Florida International University", "Florida International University", "Florida International University", "Fusion-io", "Fusion-io"], "authors": ["Ricardo Koller.....http://dblp.org/pers/hd/k/Koller:Ricardo", "Leonardo Mármol.....http://dblp.org/pers/hd/m/M=aacute=rmol:Leonardo", "Raju Rangaswami.....http://dblp.org/pers/hd/r/Rangaswami:Raju", "Swaminathan Sundararaman.....http://dblp.org/pers/hd/s/Sundararaman:Swaminathan", "Nisha Talagala.....http://dblp.org/pers/hd/t/Talagala:Nisha", "Ming Zhao.....http://dblp.org/pers/hd/z/Zhao_0002:Ming"], "conf": "fast", "year": "2013", "pages": 14}