{"title": "Gossip-based distributed stochastic bandit algorithms.", "fields": ["convergence", "gossip", "binary logarithm", "multi core processor", "speedup"], "abstract": "The multi-armed bandit problem has attracted remarkable attention in the machine learning community and many efficient algorithms have been proposed to handle the so-called exploitation-exploration dilemma in various bandit setups. At the same time, significantly less effort has been devoted to adapting bandit algorithms to particular architectures, such as sensor networks, multicore machines, or peer-to-peer (P2P) environments, which could potentially speed up their convergence. Our goal is to adapt stochastic bandit algorithms to P2P networks. In our setup, the same set of arms is available in each peer. In every iteration each peer can pull one arm independently of the other peers, and then some limited communication is possible with a few random other peers. As our main result, we show that our adaptation achieves a linear speedup in terms of the number of peers participating in the network. More precisely, we show that the probability of playing a suboptimal arm at a peer in iteration t = Ω(log N) is proportional to 1/(Nt) where N denotes the number of peers. The theoretical results are supported by simulation experiments showing that our algorithm scales gracefully with the size of network.", "citation": "Citations (14)", "departments": ["University of Szeged", "French Institute for Research in Computer Science and Automation", "University of Marburg", "University of Szeged", "University of Szeged", "University of Szeged", "University of Szeged"], "authors": ["Balázs Szörényi.....http://dblp.org/pers/hd/s/Sz=ouml=r=eacute=nyi:Bal=aacute=zs", "Róbert Busa-Fekete.....http://dblp.org/pers/hd/b/Busa=Fekete:R=oacute=bert", "István Hegedüs.....http://dblp.org/pers/hd/h/Heged=uuml=s:Istv=aacute=n", "Róbert Ormándi.....http://dblp.org/pers/hd/o/Orm=aacute=ndi:R=oacute=bert", "Márk Jelasity.....http://dblp.org/pers/hd/j/Jelasity:M=aacute=rk", "Balázs Kégl.....http://dblp.org/pers/hd/k/K=eacute=gl:Bal=aacute=zs"], "conf": "icml", "year": "2013", "pages": 9}