{"title": "Automatic Identification of Conceptual Metaphors With Limited Knowledge.", "fields": ["conceptual metaphor", "heuristics", "knowledge base", "wordnet", "natural language understanding"], "abstract": "Full natural language understanding requires identifying and analyzing the meanings of metaphors, which are ubiquitous in both text and speech. Over the last thirty years, linguistic metaphors have been shown to be based on more general conceptual metaphors, partial semantic mappings between disparate conceptual domains. Though some achievements have been made in identifying linguistic metaphors over the last decade or so, little work has been done to date on automatically identifying conceptual metaphors. This paper describes research on identifying conceptual metaphors based on corpus data. Our method uses as little background knowledge as possible, to ease transfer to new languages and to minimize any bias introduced by the knowledge base construction process. The method relies on general heuristics for identifying linguistic metaphors and statistical clustering (guided by Wordnet) to form conceptual metaphor candidates. Human experiments show the system effectively finds meaningful conceptual metaphors.", "citation": "Citations (15)", "departments": ["Illinois Institute of Technology", "Center for Advanced Defense Studies", "Center for Advanced Defense Studies", "Georgetown University", "Massachusetts Institute of Technology"], "authors": ["Lisa Gandy.....http://dblp.org/pers/hd/g/Gandy:Lisa", "Nadji Allan.....http://dblp.org/pers/hd/a/Allan:Nadji", "Mark Atallah.....http://dblp.org/pers/hd/a/Atallah:Mark", "Ophir Frieder.....http://dblp.org/pers/hd/f/Frieder:Ophir", "Newton Howard.....http://dblp.org/pers/hd/h/Howard:Newton", "Sergey Kanareykin.....http://dblp.org/pers/hd/k/Kanareykin:Sergey", "Moshe Koppel.....http://dblp.org/pers/hd/k/Koppel:Moshe", "Mark Last.....http://dblp.org/pers/hd/l/Last:Mark", "Yair Neuman.....http://dblp.org/pers/hd/n/Neuman:Yair", "Shlomo Argamon.....http://dblp.org/pers/hd/a/Argamon:Shlomo"], "conf": "aaai", "year": "2013", "pages": -1}