{"title": "Gauging Association Patterns of Chromosome Territories via Chromatic Median.", "fields": ["chromosomal rearrangement", "x inactivation", "biological data", "regulation of gene expression", "chromatic scale"], "abstract": "Computing accurate and robust organizational patterns of chromosome territories inside the cell nucleus is critical for understanding several fundamental genomic processes, such as co-regulation of gene activation, gene silencing, X chromosome inactivation, and abnormal chromosome rearrangement in cancer cells. The usage of advanced fluorescence labeling and image processing techniques has enabled researchers to investigate interactions of chromosome territories at large spatial resolution. The resulting high volume of generated data demands for high-throughput and automated image analysis methods. In this paper, we introduce a novel algorithmic tool for investigating association patterns of chromosome territories in a population of cells. Our method takes as input a set of graphs, one for each cell, containing information about spatial interaction of chromosome territories, and yields a single graph that contains essential information for the whole population and stands as its structural representative. We formulate this combinatorial problem as a semi-definite programming and present novel techniques to efficiently solve it. We validate our approach on both artificial and real biological data, the experimental results suggest that our approach yields a near-optimal solution, and can handle large-size datasets, which are significant improvements over existing techniques.", "citation": "Citations (8)", "year": "2013", "departments": ["University at Buffalo", "University at Buffalo", "State University of New York System", "University at Buffalo"], "conf": "cvpr", "authors": ["Hu Ding.....http://dblp.org/pers/hd/d/Ding:Hu", "Branislav Stojkovic.....http://dblp.org/pers/hd/s/Stojkovic:Branislav", "Ronald Berezney.....http://dblp.org/pers/hd/b/Berezney:Ronald", "Jinhui Xu.....http://dblp.org/pers/hd/x/Xu_0001:Jinhui"], "pages": 8}