{"title": "Trustworthy data from untrusted databases.", "fields": ["database testing", "database schema", "data administration", "database server", "correctness", "file server", "view"], "abstract": "Ensuring the trustworthiness of data retrieved from a database is of utmost importance to users. The correctness of data stored in a database is defined by the faithful execution of only valid (authorized) transactions. In this paper we address the question of whether it is necessary to trust a database server in order to trust the data retrieved from it. The lack of trust arises naturally if the database server is owned by a third party, as in the case of cloud computing. It also arises if the server may have been compromised, or there is a malicious insider. In particular, we reduce the level of trust necessary in order to establish the authenticity and integrity of data at an untrusted server. Earlier work on this problem is limited to situations where there are no updates to the database, or all updates are authorized and vetted by a central trusted entity. This is an unreasonable assumption for a truly dynamic database, as would be expected in many business applications, where multiple clients can update data without having to check with a central server that approves of their changes. We identify the problem of ensuring trustworthiness of data at an untrusted server in the presence of transactional updates that run directly on the database, and develop the first solutions to this problem. Our solutions also provide indemnity for an honest server and assured provenance for all updates to the data. We implement our solution in a prototype system built on top of Oracle with no modifications to the database internals. We also provide an empirical evaluation of the proposed solutions and establish their feasibility.", "citation": "Not cited", "departments": ["Purdue University", "Purdue University", "Purdue University", "Purdue University"], "authors": ["Rohit Jain.....http://dblp.org/pers/hd/j/Jain:Rohit", "Sunil Prabhakar.....http://dblp.org/pers/hd/p/Prabhakar:Sunil"], "conf": "icde", "year": "2013", "pages": 12}