{"title": "Low-latency SINR-based data gathering in wireless sensor networks.", "fields": ["latency", "data modeling", "sink", "network topology", "signal to interference plus noise ratio"], "abstract": "Data gathering is a fundamental operation in various applications of wireless sensor networks (WSNs), where sensor nodes sense information and forward data to a sink node via multi-hop wireless communications. Typically, data in a WSN is relayed over a tree topology to the sink for effective data gathering. A number of tree-based data gathering schemes have been proposed in the literature, most of which aim at maximizing network lifetime. However, the timeliness and reliability of gathered data are also of great importance to many applications in WSNs. To achieve low-latency, high-reliability data gathering in WSNs, in this paper, we construct a data gathering tree based on a reliability model, schedule data transmissions for the links on the tree and assign transmitting power to each link accordingly. Since the reliability of a link is highly related to its signal to interference plus noise ratio (SINR), the SINR of all the currently used links on the data gathering tree should be greater than a threshold to guarantee high reliability. We formulate the joint problem of tree construction, link scheduling and power assignment for data gathering into an optimization problem, with the objective of minimizing data gathering latency. We show the problem is NP-hard and divide the problem into two subproblems: Constructing a low-latency data gathering tree; Jointly link scheduling and power assignment for the data gathering tree. We then propose a polynomial heuristic algorithm for each subproblem and conduct extensive simulations to verify the effectiveness of the proposed algorithms. Our simulation results show that the proposed algorithms achieve much lower data gathering latency than existing data gathering strategies while guaranteeing high reliability. Moreover, the algorithms also have a comparable energy efficiency and network lifetime to other algorithms.", "citation": "Citations (19)", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Dawei Gong.....http://dblp.org/pers/hd/g/Gong:Dawei", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2013", "pages": 9}