{"title": "Social Rankings in Human-Computer Committees.", "fields": ["bullet voting", "disapproval voting", "voting behavior", "cardinal voting systems", "best response"], "abstract": "Despite committees and elections being widespread in the real-world, the design of agents for operating in human-computer committees has received far less attention than the theoretical analysis of voting strategies. We address this gap by providing an agent design that outperforms other voters in groups comprising both people and computer agents. In our setting participants vote by simultaneously submitting a ranking over a set of candidates and the election system uses a social welfare rule to select a ranking that minimizes disagreements with participants' votes. We ran an extensive study in which hundreds of people participated in repeated voting rounds with other people as well as computer agents that differed in how they employ strategic reasoning in their voting behavior. Our results show that over time, people learn to deviate from truthful voting strategies, and use heuristics to guide their play, such as repeating their vote from the previous round. We show that a computer agent using a best response voting strategy was able to outperform people in the game. Our study has implication for agent designers, highlighting the types of strategies that enable agents to succeed in committees comprising both human and computer participants. This is the first work to study the role of computer agents in voting settings involving both human and agent participants.", "citation": "Citations (1)", "departments": ["Bar-Ilan University", "Ben-Gurion University of the Negev", "University of Maryland, College Park", "Bar-Ilan University", "Bar-Ilan University"], "authors": ["Moshe Bitan.....http://dblp.org/pers/hd/b/Bitan:Moshe", "Ya'akov Gal.....http://dblp.org/pers/hd/g/Gal:Ya=akov", "Sarit Kraus.....http://dblp.org/pers/hd/k/Kraus:Sarit", "Elad Dokow.....http://dblp.org/pers/hd/d/Dokow:Elad", "Amos Azaria.....http://dblp.org/pers/hd/a/Azaria:Amos"], "conf": "aaai", "year": "2013", "pages": -1}