{"title": "Profit-maximizing virtual machine trading in a federation of selfish clouds.", "fields": ["double auction", "net profit", "provisioning", "schedule", "job scheduler"], "abstract": "The emerging federated cloud paradigm advocates sharing of resources among cloud providers, to exploit temporal availability of resources and diversity of operational costs for job serving. While extensive studies exist on enabling interoperability across different cloud platforms, a fundamental question on cloud economics remains unanswered: When and how should a cloud trade VMs with others, such that its net profit is maximized over the long run? In order to answer this question by the federation, a number of important, correlated decisions, including job scheduling, server provisioning and resource pricing, need to be dynamically made, with long-term profit optimality being a goal. In this work, we design efficient algorithms for inter-cloud resource trading and scheduling in a federation of geo-distributed clouds. For VM trading among clouds, we apply a double auction-based mechanism that is strategy proof, individual rational, and ex-post budget balanced. Coupling with the auction mechanism is an efficient, dynamic resource trading and scheduling algorithm, which carefully decides the true valuations of VMs in the auction, optimally schedules stochastic job arrivals with different SLAs onto the VMs, and judiciously turns on and off servers based on the current electricity prices. Through rigorous analysis, we show that each individual cloud, by carrying out our dynamic algorithm, can achieve a time-averaged profit arbitrarily close to the offline optimum.", "citation": "Citations (55)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Calgary", "University of Hong Kong"], "authors": ["Hongxing Li.....http://dblp.org/pers/hd/l/Li:Hongxing", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2013", "pages": 5}