{"title": "Sancus: Low-cost Trustworthy Extensible Networked Devices with a Zero-software Trusted Computing Base.", "fields": ["software framework", "resource oriented architecture", "software security assurance", "software distribution", "backporting"], "abstract": "In this paper we propose Sancus, a security architecture for networked embedded devices. Sancus supports extensibility in the form of remote (even third-party) software installation on devices while maintaining strong security guarantees. More specifically, Sancus can remotely attest to a software provider that a specific software module is running uncompromised, and can authenticate messages from software modules to software providers. Software modules can securely maintain local state, and can securely interact with other software modules that they choose to trust. The most distinguishing feature of Sancus is that it achieves these security guarantees without trusting any infrastructural software on the device. The Trusted Computing Base (TCB) on the device is only the hardware. Moreover, the hardware cost of Sancus is low.\n\nWe describe the design of Sancus, and develop and evaluate a prototype FPGA implementation of a Sancus-enabled device. The prototype extends an MSP430 processor with hardware support for the memory access control and cryptographic functionality required to run Sancus. We also develop a C compiler that targets our device and that can compile standard C modules to Sancus protected software modules.", "citation": "Citations (137)", "year": "2013", "departments": ["Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven"], "conf": "uss", "authors": ["Job Noorman.....http://dblp.org/pers/hd/n/Noorman:Job", "Pieter Agten.....http://dblp.org/pers/hd/a/Agten:Pieter", "Wilfried Daniels.....http://dblp.org/pers/hd/d/Daniels:Wilfried", "Raoul Strackx.....http://dblp.org/pers/hd/s/Strackx:Raoul", "Anthony Van Herrewege.....http://dblp.org/pers/hd/h/Herrewege:Anthony_Van", "Christophe Huygens.....http://dblp.org/pers/hd/h/Huygens:Christophe", "Bart Preneel.....http://dblp.org/pers/hd/p/Preneel:Bart", "Ingrid Verbauwhede.....http://dblp.org/pers/hd/v/Verbauwhede:Ingrid", "Frank Piessens.....http://dblp.org/pers/hd/p/Piessens:Frank"], "pages": 16}