{"title": "What is a file?", "fields": ["possession", "abstraction", "boundary object", "data file", "delimiter", "fuzz testing", "slippage", "test case", "data", "metadata"], "abstract": "For over 40 years the notion of the  file , as devised by pioneers in the field of computing, has been the subject of much contention. Some have wanted to abandon the term altogether on the grounds that metaphors about files can confuse users and designers alike. More recently, the emergence of the 'cloud' has led some to suggest that the term is simply obsolescent. In this paper we want to suggest that, despite all these conceptual debates and changes in technology, the term file still remains central to systems architectures and to the concerns of users. Notwithstanding profound changes in what users do and technologies afford, we suggest that files continue to act as a cohering concept, something like a 'boundary object' between computer engineers and users. However, the effectiveness of this boundary object is now waning. There are increasing signs of slippage and muddle. Instead of throwing away the notion altogether, we propose that the definition of and use of files as a boundary object be reconstituted. New abstractions are needed, ones which reflect what users seek to do with their digital data, and which allow engineers to solve the networking, storage and data management problems that ensue when files move from the PC on to the networked world of today.", "citation": "Not cited", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Former Internet ... y Response Team"], "authors": ["Richard H. R. Harper.....http://dblp.org/pers/hd/h/Harper:Richard_H=_R=", "Siân E. Lindley.....http://dblp.org/pers/hd/l/Lindley:Si=acirc=n_E=", "Eno Thereska.....http://dblp.org/pers/hd/t/Thereska:Eno", "Richard Banks.....http://dblp.org/pers/hd/b/Banks:Richard", "Philip Gosset.....http://dblp.org/pers/hd/g/Gosset:Philip", "Gavin Smyth.....http://dblp.org/pers/hd/s/Smyth:Gavin", "William Odom.....http://dblp.org/pers/hd/o/Odom:William", "Eryn Whitworth.....http://dblp.org/pers/hd/w/Whitworth:Eryn"], "conf": "cscw", "year": "2013", "pages": 12}