{"title": "Untraceability of mobile devices in wireless mesh networks using linear network coding.", "fields": ["wireless mesh network", "padding", "network packet", "linear network coding", "traffic analysis"], "abstract": "To protect user privacy in wireless mesh networks (WMNs), it is important to address two major challenges, namely: flow untraceability and movement untraceability, which prevent malicious attackers from deducing the flow paths and the movement tracks of mobile devices. For these two privacy requirements, most existing approaches rely on encrypting the whole packet, appending random padding, and applying random delay for each message at every intermediate node, resulting in significant computational and communication overheads. Recently, linear network coding (LNC) has been introduced as an alternative but the global encoding vectors (GEVs) of coded messages have to be encrypted so as to conceal the relationships between the incoming and outgoing messages. In this paper, we aim to explore the potential of LNC to ensure the flow untraceability and movement untraceability. Specifically, we first determine the necessary and sufficient condition, with which the two privacy requirements can be achieved without encrypting either GEVs or message contents. We then design a deterministic untraceable LNC (ULNC) scheme to provide flow untraceability and movement untraceability when the sufficient and necessary condition is satisfied. Finally, we discuss the effectiveness of the proposed ULNC scheme against traffic analysis attacks in WMNs.", "citation": "Citations (7)", "departments": ["Soochow University", "University of Puerto Rico at Mayagüez", "City University of Hong Kong", "University at Buffalo"], "authors": ["Jin Wang.....http://dblp.org/pers/hd/w/Wang_0009:Jin", "Kejie Lu.....http://dblp.org/pers/hd/l/Lu:Kejie", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming"], "conf": "infocom", "year": "2013", "pages": 5}