{"title": "On-road ads delivery scheduling and bandwidth allocation in vehicular CPS.", "fields": [], "abstract": "We consider a promising application in Vehicular Cyber-Physical Systems (VCPS) called On-road Ad Delivery (OAD), where targeted advertisements are delivered via roadside APs to attract commuters to nearby shops. Different from most existing works on VANETs which only focused on a single technical area, this work on OAD involves technical elements from human factors, cyber systems and transportation systems since a commuter's shopping decision depends on e.g. the attractiveness of the ads, the induced detour, and traffic conditions on different routes. In this paper, we address a new optimization problem in OAD whose goal is to schedule ad messages and allocate a limited amount of AP bandwidth so as to maximize the system-wide performance in terms of total realized utilities (TRU) of the delivered ads. A number of efficient heuristics are proposed to deal with ad message scheduling and AP bandwidth allocation. Besides largescale simulations, we also present a case study in a more realistic scenario utilizing real traces collected from taxis in the city of Shanghai. In addition, we use a commercial traffic simulator (PARAMICS) to show that our proposed solutions are also useful for traffic management in terms of balancing vehicular traffic and alleviating congestion.", "citation": "Citations (8)", "departments": ["University at Buffalo", "University at Buffalo", "University at Buffalo", "University at Buffalo"], "authors": ["Xu Li.....http://dblp.org/pers/hd/l/Li:Xu", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming", "Yunfei Hou.....http://dblp.org/pers/hd/h/Hou:Yunfei", "Yunjie Zhao.....http://dblp.org/pers/hd/z/Zhao:Yunjie", "Aditya Wagh.....http://dblp.org/pers/hd/w/Wagh:Aditya", "Adel W. Sadek.....http://dblp.org/pers/hd/s/Sadek:Adel_W=", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng", "Hongli Xu.....http://dblp.org/pers/hd/x/Xu:Hongli"], "conf": "infocom", "year": "2013", "pages": 9}