{"title": "To send or not to send: Reducing the cost of data transmission.", "fields": ["heuristic", "online algorithm", "percentile", "competitive analysis", "cost accounting"], "abstract": "Frequently, ISPs charge for Internet use not based on peak bandwidth usage, but according to a percentile (often the 95th percentile) cost model. In other words, the time slots with the top 5 percent (in the case of 95th percentile) of data transmission volume do not affect the cost of transmission. Instead, we are charged based on the volume of traffic sent in the 95th percentile slot. In such an environment, by allowing a short delay in transmission of some data, we may be able to reduce our cost considerably. We provide an optimal solution to the offline version of this problem (in which the job arrivals are known), for any delay D > 0. The algorithm works for any choice of percentile. We also show that there is no efficient deterministic online algorithm for this problem. However, for a slightly different problem, where the maximum amount of data transmitted is used for cost accounting, we provide an online algorithm with a competitive ratio of 2D+1/D+1. Furthermore, we prove that no online algorithm can achieve a competitive ratio better than 2D+1/D+F(D) where F(D) = Σ i=1  D+1  i/D+i for any D > 0 in an adversarial setting. We also provide a heuristic that can be used in an online setting where the network traffic has a strong correlation over consecutive accounting cycles, based on the solution to the offline percentile problem. Experimental results are used to illustrate the performance of the algorithms proposed in this work.", "citation": "Citations (7)", "departments": ["University of Southern California", "University of Maryland, College Park", "University of Maryland, College Park", "University of Southern California"], "authors": ["Leana Golubchik.....http://dblp.org/pers/hd/g/Golubchik:Leana", "Samir Khuller.....http://dblp.org/pers/hd/k/Khuller:Samir", "Koyel Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Koyel", "Yuan Yao.....http://dblp.org/pers/hd/y/Yao:Yuan"], "conf": "infocom", "year": "2013", "pages": 7}