{"title": "Presenting diverse location views with real-time near-duplicate photo elimination.", "fields": ["grid", "novelty", "scalability", "data visualization", "mobile device"], "abstract": "Supported by the technical advances and the commercial success of GPS-enabled mobile devices, geo-tagged photos have drawn plenteous attention in research community. The explosive growth of geo-tagged photos enables many large-scale applications, such as location-based photo browsing, landmark recognition, etc. Meanwhile, as the number of geo-tagged photos continues to climb, new challenges are brought to various applications. The existence of massive near-duplicate geo-tagged photos jeopardizes the effective presentation for the above applications. A new dimension in the search and presentation of geo-tagged photos is urgently demanded. In this paper, we devise a location visualization framework to efficiently retrieve and present diverse views captured within a local proximity. Novel photos, in terms of capture locations and visual content, are identified and returned in response to a query location for diverse visualization. For real-time response and good scalability, a new Hybrid Index structure which integrates R-tree and Geographic Grid is proposed to quickly identify the Maximal Near-duplicate Photo Groups (MNPG) in the query proximity. The most novel photos from different groups are then returned to generate diverse views on the location. Extensive experiments on synthetic and real-life photo datasets prove the novelty and efficiency of our methods.", "citation": "Citations (11)", "departments": ["University of Queensland", "University of Queensland", "The Chinese University of Hong Kong", "Renmin University of China", "University of Queensland"], "authors": ["Jiajun Liu.....http://dblp.org/pers/hd/l/Liu:Jiajun", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Hong Cheng.....http://dblp.org/pers/hd/c/Cheng:Hong", "Yueguo Chen.....http://dblp.org/pers/hd/c/Chen:Yueguo", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Yanchun Zhang.....http://dblp.org/pers/hd/z/Zhang:Yanchun"], "conf": "icde", "year": "2013", "pages": 12}