{"title": "On finding an optimal TCAM encoding scheme for packet classification.", "fields": ["header", "content addressable memory", "ternary operation", "networking hardware", "content addressable storage"], "abstract": "Hardware-based packet classification has become an essential component in many networking devices. It often relies on TCAMs (ternary content-addressable memories), which need to compare the packet header against a set of rules. But efficiently encoding these rules is not an easy task. In particular, the most complicated rules are range rules, which usually require multiple TCAM entries to encode them. However, little is known on the optimal encoding of such non-trivial rules. In this work, we take steps towards finding an optimal encoding scheme for every possible range rule. We first present an optimal encoding for all possible generalized extremal rules. Such rules represent 89% of all non-trivial rules in a typical real-life classification database. We also suggest a new method of simply calculating the optimal expansion of an extremal range, and present a closed-form formula of the average optimal expansion over all extremal ranges. Next, we present new bounds on the worst-case expansion of general classification rules, both in one-dimensional and two-dimensional ranges. Last, we introduce a new TCAM architecture that can leverage these results by providing a guaranteed expansion on the tough rules, while dealing with simpler rules using a regular TCAM. We conclude by verifying our theoretical results in experiments with synthetic and real-life classification databases.", "citation": "Citations (21)", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Google", "Tel Aviv University", "Bar-Ilan University"], "authors": ["Ori Rottenstreich.....http://dblp.org/pers/hd/r/Rottenstreich:Ori", "Isaac Keslassy.....http://dblp.org/pers/hd/k/Keslassy:Isaac", "Avinatan Hassidim.....http://dblp.org/pers/hd/h/Hassidim:Avinatan", "Haim Kaplan.....http://dblp.org/pers/hd/k/Kaplan:Haim", "Ely Porat.....http://dblp.org/pers/hd/p/Porat:Ely"], "conf": "infocom", "year": "2013", "pages": 9}