{"title": "A spectrum-sharing rewarding framework for co-channel hybrid access femtocell networks.", "fields": ["mobile service", "femtocell", "mobile broadband", "profit sharing", "telecommunications service"], "abstract": "With the explosive growth of mobile data traffic, the femtocell technology is one of the proper solutions to enhance mobile service quality and system capacity for cellular networks. However, one of the key problems for femtocell deployment is to find appropriate access control in which mobile operators and users are willing to be involved. Among all kinds of access control modes, the hybrid access mode is considered as the most promising one, which allows femtocells to provide preferential access to femtocell owners and subscribers while other public users can access femtocells with certain restriction. Since all femtocell owners are selfish, how to provide enough incentives to the owners for sharing their femtocell resources is challenging. In this paper, we construct an economic framework for mobile operator and femtocell users by a game theoretical analysis and introduce the concept of profit sharing to provide a positive cycle to sustain the femtocell service. In this framework, a femtocell game is formulated, where the femtocell owners determine the proportion of femtocell resources shared with public users while the operator can maximize its own benefit by determining the ratio of revenue distribution to femtocell owners. The existence of the Nash equilibrium of the game is analyzed. Extensive simulations are conducted to show that the profit of the operator can be maximized while the service requirements of users can be maintained by the proposed framework.", "citation": "Citations (12)", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University"], "authors": ["Chien-Han Chai.....http://dblp.org/pers/hd/c/Chai:Chien=Han", "Yuan-Yao Shih.....http://dblp.org/pers/hd/s/Shih:Yuan=Yao", "Ai-Chun Pang.....http://dblp.org/pers/hd/p/Pang:Ai=Chun"], "conf": "infocom", "year": "2013", "pages": 5}