{"title": "CPU and cache efficient management of memory-resident databases.", "fields": ["just in time compilation", "cpu shielding", "instruction cycle", "online analytical processing", "online transaction processing"], "abstract": "Memory-Resident Database Management Systems (MRDBMS) have to be optimized for two resources: CPU cycles and memory bandwidth. To optimize for bandwidth in mixed OLTP/OLAP scenarios, the hybrid or Partially Decomposed Storage Model (PDSM) has been proposed. However, in current implementations, bandwidth savings achieved by partial decomposition come at increased CPU costs. To achieve the aspired bandwidth savings without sacrificing CPU efficiency, we combine partially decomposed storage with Just-in-Time (JiT) compilation of queries, thus eliminating CPU inefficient function calls. Since existing cost based optimization components are not designed for JiT-compiled query execution, we also develop a novel approach to cost modeling and subsequent storage layout optimization. Our evaluation shows that the JiT-based processor maintains the bandwidth savings of previously presented hybrid query processors but outperforms them by two orders of magnitude due to increased CPU efficiency.", "citation": "Citations (20)", "departments": ["Humboldt State University", "CWI, Amsterdam, Netherlands", "Tech. Univ. Mun ... ̈nchen, Germany", "HPI, Potsdam, Germany", "Tech. Univ. Mun ... ̈nchen, Germany"], "authors": ["Holger Pirk.....http://dblp.org/pers/hd/p/Pirk:Holger", "Florian Funke.....http://dblp.org/pers/hd/f/Funke:Florian", "Martin Grund.....http://dblp.org/pers/hd/g/Grund:Martin", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas", "Ulf Leser.....http://dblp.org/pers/hd/l/Leser:Ulf", "Stefan Manegold.....http://dblp.org/pers/hd/m/Manegold:Stefan", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons", "Martin L. Kersten.....http://dblp.org/pers/hd/k/Kersten:Martin_L="], "conf": "icde", "year": "2013", "pages": 12}