{"title": "Social Trust Prediction Using Rank-k Matrix Recovery.", "fields": ["social network analysis", "data set", "low rank approximation", "augmented lagrangian method", "matrix completion"], "abstract": "Trust prediction, which explores the unobserved relationships between online community users, is an emerging and important research topic in social network analysis and many web applications. Similar to other social-based recommender systems, trust relationships between users can be also modeled in the form of matrices. Recent study shows users generally establish friendship due to a few latent factors, it is therefore reasonable to assume the trust matrices are of low-rank. As a result, many recommendation system strategies can be applied here. In particular, trace norm minimization, which uses matrix's trace norm to approximate its rank, is especially appealing. However, recent articles cast doubts on the validity of trace norm approximation. In this paper, instead of using trace norm minimization, we propose a new robust rank-k matrix completion method, which explicitly seeks a matrix with exact rank. Moreover, our method is robust to noise or corrupted observations. We optimize the new objective function in an alternative manner, based on a combination of ancillary variables and Augmented Lagrangian Multiplier (ALM) Method. We perform the experiments on three real-world data sets and all empirical results demonstrate the effectiveness of our method.", "citation": "Citations (28)", "year": "2013", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington"], "conf": "ijcai", "authors": ["Jin Huang.....http://dblp.org/pers/hd/h/Huang:Jin", "Feiping Nie.....http://dblp.org/pers/hd/n/Nie:Feiping", "Heng Huang.....http://dblp.org/pers/hd/h/Huang:Heng", "Yu Lei.....http://dblp.org/pers/hd/l/Lei:Yu", "Chris H. Q. Ding.....http://dblp.org/pers/hd/d/Ding:Chris_H=_Q="], "pages": 7}