{"title": "OPFKA: Secure and efficient Ordered-Physiological-Feature-based key agreement for wireless Body Area Networks.", "fields": ["brute force attack", "initialization", "overhead", "keying", "key"], "abstract": "Body Area Networks (BANs) are expected to play a major role in patient health monitoring in the near future. Providing an efficient key agreement with the prosperities of plug-n-play and transparency to support secure inter-sensor communications is critical especially during the stages of network initialization and reconfiguration. In this paper, we present a novel key agreement scheme termed Ordered-Physiological-Feature-based Key Agreement (OPFKA), which allows two sensors belonging to the same BAN to agree on a symmetric cryptographic key generated from the overlapping physiological signal features, thus avoiding the pre-distribution of keying materials among the sensors embedded in the same human body. The secret features computed from the same physiological signal at different parts of the body by different sensors exhibit some overlap but they are not completely identical. To overcome this challenge, we detail a computationally efficient protocol to securely transfer the secret features of one sensor to another such that two sensors can easily identify the overlapping ones. This protocol possesses many nice features such as the resistance against brute force attacks. Experimental results indicate that OPFKA is secure, efficient, and feasible. Compared with the state-of-the-art PSKA protocol, OPFKA achieves a higher level of security at a lower computational overhead.", "citation": "Citations (86)", "departments": ["George Washington University", "George Washington University", "George Washington University", "George Washington University", "Chongqing University"], "authors": ["Chunqiang Hu.....http://dblp.org/pers/hd/h/Hu:Chunqiang", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen", "Fan Zhang.....http://dblp.org/pers/hd/z/Zhang:Fan", "Dengyuan Wu.....http://dblp.org/pers/hd/w/Wu:Dengyuan", "Xiaofeng Liao.....http://dblp.org/pers/hd/l/Liao:Xiaofeng", "Dechang Chen.....http://dblp.org/pers/hd/c/Chen:Dechang"], "conf": "infocom", "year": "2013", "pages": 9}