{"title": "Efficient privacy-preserving biometric identification in cloud computing.", "fields": ["encryption", "trait", "oblivious transfer", "cryptographic primitive", "information privacy"], "abstract": "Biometric identification is a reliable and convenient way of identifying individuals. The widespread adoption of biometric identification requires solid privacy protection against possible misuse, loss, or theft of biometric data. Existing techniques for privacy-preserving biometric identification primarily rely on conventional cryptographic primitives such as homomorphic encryption and oblivious transfer, which inevitably introduce tremendous cost to the system and are not applicable to practical large-scale applications. In this paper, we propose a novel privacy-preserving biometric identification scheme which achieves efficiency by exploiting the power of cloud computing. In our proposed scheme, the biometric database is encrypted and outsourced to the cloud servers. To perform a biometric identification, the database owner generates a credential for the candidate biometric trait and submits it to the cloud. The cloud servers perform identification over the encrypted database using the credential and return the result to the owner. During the identification, cloud learns nothing about the original private biometric data. Because the identification operations are securely outsourced to the cloud, the realtime computational/communication costs at the owner side are minimal. Thorough analysis shows that our proposed scheme is secure and offers a higher level of privacy protection than related solutions such as kNN search in encrypted databases. Real experiments on Amazon cloud, over databases of different sizes, show that our computational/communication costs at the owner side are several magnitudes lower than the existing biometric identification schemes.", "citation": "Citations (59)", "departments": ["University of Arkansas at Little Rock", "University of Arkansas at Little Rock"], "authors": ["Jiawei Yuan.....http://dblp.org/pers/hd/y/Yuan:Jiawei", "Shucheng Yu.....http://dblp.org/pers/hd/y/Yu:Shucheng"], "conf": "infocom", "year": "2013", "pages": 9}