{"title": "Fast peak-to-peak behavior with SSD buffer pool.", "fields": ["transaction processing", "speedup", "write buffer", "memory buffer register", "online transaction processing"], "abstract": "A promising use of flash SSDs in a DBMS is to extend the main memory buffer pool by caching selected pages that have been evicted from the buffer pool. Such a use has been shown to produce significant gains in the steady state performance of the DBMS. One strategy for using the SSD buffer pool is to throw away the data in the SSD when the system is restarted (either when recovering from a crash or restarting after a shutdown), and consequently a long “ramp-up” period to regain peak performance is needed. One approach to eliminate this limitation is to use a memory-mapped file to store the SSD buffer table in order to be able to restore its contents on restart. However, this design can result in lower sustained performance, because every update to the SSD buffer table may incur an I/O operation to the memory-mapped file. In this paper we propose two new alternative designs. One design reconstructs the SSD buffer table using transactional logs. The other design asynchronously flushes the SSD buffer table, and upon restart, lazily verifies the integrity of the data cached in the SSD buffer pool. We have implemented these three designs in SQL Server 2012. For each design, both the write-through and write-back SSD caching policies were implemented. Using two OLTP benchmarks (TPC-C and TPC-E), our experimental results show that our designs produce up to 3.8X speedup on the interval between peak-to-peak performance, with negligible performance loss; in contrast, the previous approach has a similar speedup but up to 54% performance loss.", "citation": "Citations (10)", "departments": ["University of Wisconsin-Madison", "Paradigm", "University of Wisconsin-Madison", "Microsoft"], "authors": ["Jaeyoung Do.....http://dblp.org/pers/hd/d/Do:Jaeyoung", "Donghui Zhang.....http://dblp.org/pers/hd/z/Zhang:Donghui", "Jignesh M. Patel.....http://dblp.org/pers/hd/p/Patel:Jignesh_M=", "David J. DeWitt.....http://dblp.org/pers/hd/d/DeWitt:David_J="], "conf": "icde", "year": "2013", "pages": 12}