{"title": "Compact conformal map for greedy routing in wireless mobile sensor networks.", "fields": ["destination sequenced distance vector routing", "routing domain", "triangular routing", "mobile wireless sensor network", "hazy sighted link state routing protocol", "routing table", "geographic routing"], "abstract": "Motivated by mobile sensor networks as in participatory sensing applications, we are interested in developing a practical, lightweight solution for routing in a mobile network. While greedy routing is robust to mobility, location errors and link dynamics, it may get stuck in a local minimum, which then requires non-trivial recovery methods. We follow the approach taken by Sarkar et. al. [24] to find an embedding of the network such that greedy routing using the virtual coordinates guarantees delivery, thus eliminating the necessity of any recovery methods. Our new contribution is to replace the in-network computation of the embedding by a preprocessing of the domain before network deployment and encode the map of network domain to virtual coordinate space by using a small number of parameters which can be pre-loaded to all sensor nodes. As a result, the map is only dependent on the network domain and is independent of the network connectivity. Each node can directly compute or update its virtual coordinates by applying the locally stored map on its geographical coordinates. This represents the first practical solution for using virtual coordinates for greedy routing in a sensor network and could be easily extended to the case of a mobile network. Being extremely light-weight, greedy routing on the virtual coordinates is shown to be very robust to mobility, link dynamics and non-unit disk graph connectivity models.", "citation": "Citations (5)", "departments": ["Stony Brook University", "Florida International University", "Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University", "Florida International University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Siming Li.....http://dblp.org/pers/hd/l/Li:Siming", "Wei Zeng.....http://dblp.org/pers/hd/z/Zeng:Wei", "Dengpan Zhou.....http://dblp.org/pers/hd/z/Zhou:Dengpan", "Xianfeng David Gu.....http://dblp.org/pers/hd/g/Gu:Xianfeng_David", "Jie Gao.....http://dblp.org/pers/hd/g/Gao:Jie"], "conf": "infocom", "year": "2013", "pages": 9}