{"title": "Network utilization: The flow view.", "fields": ["multi frequency network", "network management station", "intelligent computer network", "network information system", "network traffic simulation"], "abstract": "Building and operating a large backbone network can take months or even years, and it requires a substantial investment. Therefore, there is an economical drive to increase the utilization of network resources (links, switches, etc.) in order to improve the cost efficiency of the network. At the same time, the utilization of network components has a direct impact on the performance of the network and its resilience to failure, and thus operational considerations are a critical aspect of the decision regarding the desired network load and utilization. However, the actual utilization of the network resources is not easy to predict or control. It depends on many parameters like the traffic demand and the routing scheme (or Traffic Engineering if deployed), and it varies over time and space. As a result it is very difficult to actually define real network utilization and to understand the reasons for this utilization. In this paper we introduce a novel way to look at the network utilization. Unlike traditional approaches that consider the average link utilization, we take the flow perspective and consider the network utilization in terms of the growth potential of the flows in the network. After defining this new Flow Utilization, and discussing how it differs from common definitions of network utilization, we study ways to efficiently compute it over large networks. We then show, using real backbone data, that Flow Utilization is very useful in identifying network state and evaluating performance of TE algorithms.", "citation": "Citations (11)", "departments": ["Google", "Google", "Google", "Google"], "authors": ["Avinatan Hassidim.....http://dblp.org/pers/hd/h/Hassidim:Avinatan", "Danny Raz.....http://dblp.org/pers/hd/r/Raz:Danny", "Michal Segalov.....http://dblp.org/pers/hd/s/Segalov:Michal", "Ariel Shaqed.....http://dblp.org/pers/hd/s/Shaqed:Ariel"], "conf": "infocom", "year": "2013", "pages": 9}