{"title": "An interactive virtual reality system for on-orbit servicing.", "fields": ["immersion", "physics engine", "operator", "workspace", "rendering"], "abstract": "The growth of space debris is becoming a serious problem. There is an urgent need for mitigation measures based on maintenance, repair and de-orbiting technologies. Our video presents a virtual reality framework in which robotic maintenance tasks of satellites can be simulated interactively. The two key components of this framework are a realistic virtual reality simulation and an immersive interaction device. The peculiarity of the virtual reality simulation is the combination of a physics engine based on Bullet with an extremely efficient haptic rendering algorithm inspired by an enhanced version of the Voxmap-Pointshell Algorithm. A central logic module controls all states and objects in the virtual world. To enable the human operator an optimal immersion into the virtual environment, the DLR bimanual haptic device is used as interaction device. Equipped with two light-weight robot arms, this device is able to provide realistic haptic feedback at both human hands, while covering the major part of human operator's workspace. The applicability of this system is enhanced by additional force sensors, active hand interfaces with an additional degree of freedom, smart safety technologies and intuitive robot data augmentation. Our platform can be used for verification or training purposes of robotic systems interacting in space environments.", "citation": "Citations (3)", "departments": ["German Aerospace Center", "German Aerospace Center", "German Aerospace Center", "German Aerospace Center", "German Aerospace Center"], "authors": ["Mikel Sagardia.....http://dblp.org/pers/hd/s/Sagardia:Mikel", "Katharina Hertkorn.....http://dblp.org/pers/hd/h/Hertkorn:Katharina", "Thomas Hulin.....http://dblp.org/pers/hd/h/Hulin:Thomas", "Robin Wolff.....http://dblp.org/pers/hd/w/Wolff:Robin", "Johannes Hummel.....http://dblp.org/pers/hd/h/Hummel:Johannes", "Janki Dodiya.....http://dblp.org/pers/hd/d/Dodiya:Janki", "Andreas Gerndt.....http://dblp.org/pers/hd/g/Gerndt:Andreas"], "conf": "vr", "year": "2013", "pages": 1}