{"title": "NIFTY: a system for large scale information flow tracking and clustering.", "fields": ["news media", "orders of magnitude", "terabyte", "software deployment", "information cascade"], "abstract": "The real-time information on news sites, blogs and social networking sites changes dynamically and spreads rapidly through the Web. Developing methods for handling such information at a massive scale requires that we think about how information content varies over time, how it is transmitted, and how it mutates as it spreads.   We describe the News Information Flow Tracking, Yay! (NIFTY) system for large scale real-time tracking of \"memes\" - short textual phrases that travel and mutate through the Web. NIFTY is based on a novel highly-scalable incremental meme-clustering algorithm that efficiently extracts and identifies mutational variants of a single meme. NIFTY runs orders of magnitude faster than our previous Memetracker system, while also maintaining better consistency and quality of extracted memes.   We demonstrate the effectiveness of our approach by processing a 20 terabyte dataset of 6.1 billion blog posts and news articles that we have been continuously collecting for the last four years. NIFTY extracted 2.9 billion unique textual phrases and identified more than 9 million memes. Our meme-tracking algorithm was able to process the entire dataset in less than five days using a single machine. Furthermore, we also provide a live deployment of the NIFTY system that allows users to explore the dynamics of online news in near real-time.", "citation": "Citations (25)", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "authors": ["Caroline Suen.....http://dblp.org/pers/hd/s/Suen:Caroline", "Sandy Huang.....http://dblp.org/pers/hd/h/Huang:Sandy", "Chantat Eksombatchai.....http://dblp.org/pers/hd/e/Eksombatchai:Chantat", "Rok Sosic.....http://dblp.org/pers/hd/s/Sosic:Rok", "Jure Leskovec.....http://dblp.org/pers/hd/l/Leskovec:Jure"], "conf": "www", "year": "2013", "pages": 12}