{"title": "On optimal communication strategies for cooperative cognitive radio networking.", "fields": ["power control", "cognitive radio", "nash equilibrium", "relay", "stackelberg competition"], "abstract": "This work is concerned with enhancement of spectrum-energy efficiency whereby a primary user (PU) engages secondary users (SUs) to relay its transmission in an energy-aware cognitive radio network, i.e., forming a cooperative cognitive radio network (CCRN). The cooperation framework in CCRN can be multiple two-hop relaying with or without PU's direct link transmission using an amplify-and-forward or decode- and-forward mode. In the energy-aware CCRN, an individual cooperating partner attempts to maximize its own utility. The partner selection and parameter optimization, led by the PU, are formulated as two Stackelberg games, namely a sum-constrained power allocation game for two-phase cooperation and a power control game for three-phase cooperation, respectively. Unique Nash Equilibrium is proved and achieved in analytical format for each game. The optimal communication strategy is chosen which achieves the maximum PU utility among different optimal communication strategies. Moreover, an implementation scheme is presented to perform the partner selection and parameter optimization based on the analytical results. Theoretical analysis and performance evaluation show that the proposed CCRN model is a promising framework under which the PU's utility is maximized, while the relaying SUs can attain acceptable utilities.", "citation": "Citations (18)", "departments": ["Harbin Institute of Technology", "University of Waterloo", "Harbin Institute of Technology", "University of Waterloo", "University of Ontario Institute of Technology"], "authors": ["Bin Cao.....http://dblp.org/pers/hd/c/Cao_0003:Bin", "Jon W. Mark.....http://dblp.org/pers/hd/m/Mark:Jon_W=", "Qinyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Qinyu", "Rongxing Lu.....http://dblp.org/pers/hd/l/Lu:Rongxing", "Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong", "Xuemin (Sherman) Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin_=Sherman="], "conf": "infocom", "year": "2013", "pages": 9}