{"title": "The reuse cache: downsizing the shared last-level cache.", "fields": ["cache invalidation", "snoopy cache", "cache pollution", "smart cache", "mesi protocol"], "abstract": "Over recent years, a growing body of research has shown that a considerable portion of the shared last-level cache (SLLC) is dead, meaning that the corresponding cache lines are stored but they will not receive any further hits before being replaced. Conversely, most hits observed by the SLLC come from a small subset of already reused lines.   In this paper, we propose the reuse cache, a decoupled tag/data SLLC which is designed to only store the data of lines that have been reused. Thus, the size of the data array can be dramatically reduced. Specifically, we (i) introduce a selective data allocation policy to exploit reuse locality and maintain reused data in the SLLC, (ii) tune the data allocation with a suitable replacement policy and coherence protocol, and finally, (iii) explore different ways of organizing the data/tag arrays and study the performance sensitivity to the size of the resulting structures.   The role of a reuse cache to maintain performance with decreasing sizes is investigated in the experimental part of this work, by simulating multiprogrammed and multithreaded workloads in an eight-core chip multiprocessor. As an example, we show that a reuse cache with a tag array equivalent to a conventional 4 MB cache and only a 1 MB data array would perform as well as a conventional cache of 8 MB, requiring only 16.7% of the storage capacity.", "citation": "Citations (25)", "departments": ["University of Toronto", "University of Zaragoza", "University of Zaragoza", "Polytechnic University of Catalonia"], "authors": ["Jorge Albericio.....http://dblp.org/pers/hd/a/Albericio:Jorge", "Pablo Ibáñez.....http://dblp.org/pers/hd/i/Ib=aacute==ntilde=ez:Pablo", "Víctor Viñals.....http://dblp.org/pers/hd/v/Vi=ntilde=als:V=iacute=ctor", "José M. Llabería.....http://dblp.org/pers/hd/l/Llaber=iacute=a:Jos=eacute=_M="], "conf": "micro", "year": "2013", "pages": 12}