{"title": "SCReen adjusted panoramic effect: SCRAPE.", "fields": ["cave automatic virtual environment", "cave", "amateur", "graphics", "metaverse"], "abstract": "A Cave Automatic Virtual Environment (CAVE) is an enclosed virtual reality room that uses multiple projectors to display images across its surfaces. It uses one or more computers to synchronise and combine the images and allows users to control virtual worlds using a host of interaction devices. Traditionally, a CAVE is used by a single user at any one time and by utilising some form of motion sensing, the user's head position can be tracked to allow for first virtual perception. The images are then displayed in stereographic 3D in order to complete the virtual reality effect. Professional CAVE installations are expensive and can cost upwards of several hundred thousand euros. This tends to act as a significant barrier to their propagation, however, as the reduction in cost of high specification computers, projectors and graphics cards continues apace, it has sparked a renewed interest in CAVE environments and given rise to the realistic possibility of setting up low cost, amateur CAVEs. Unfortunately, one of the greatest disadvantages of CAVE systems is the lack of inexpensive, easy to use, specialised software. In this paper we present an open source and easy to use CAVE software toolkit called SCReen Adjusted Panoramic Effect or SCRAPE for short. We believe that SCRAPE is the first major piece in a longer-term vision that aims to bring easy to setup, easy to use, portable CAVE systems to all types of non-expert users.", "citation": "Not cited", "departments": ["CASALA Research ... undalk, Ireland", "CLARITY: Centre ... Dublin, Ireland", "CLARITY: Centre ... Dublin, Ireland"], "authors": ["Carl Flynn.....http://dblp.org/pers/hd/f/Flynn:Carl", "David S. Monaghan.....http://dblp.org/pers/hd/m/Monaghan:David_S=", "Noel E. O'Connor.....http://dblp.org/pers/hd/o/O=Connor:Noel_E="], "conf": "mm", "year": "2013", "pages": 4}