{"title": "FluidNet: a flexible cloud-based radio access network for small cells.", "fields": ["multiplexing", "remote radio head", "wimax", "radio access network", "testbed", "software deployment"], "abstract": "Cloud-based radio access networks (C-RAN) have been proposed as a cost-efficient way of deploying small cells. Unlike conventional RANs, a C-RAN decouples the baseband processing unit (BBU) from the remote radio head (RRH), allowing for centralized operation of BBUs and scalable deployment of light-weight RRHs as small cells. In this work, we argue that the intelligent configuration of the front-haul network between the BBUs and RRHs, is essential in delivering the performance and energy benefits to the RAN and the BBU pool, respectively. We then propose FluidNet - a scalable, light-weight framework for realizing the full potential of C-RAN. FluidNet deploys a logically re-configurable front-haul to apply appropriate transmission strategies in different parts of the network and hence cater effectively to both heterogeneous user profiles and dynamic traffic load patterns. FluidNet's algorithms determine configurations that maximize the traffic demand satisfied on the RAN, while simultaneously optimizing the compute resource usage in the BBU pool. We prototype FluidNet on a 6 BBU, 6 RRH WiMAX C-RAN testbed. Prototype evaluations and large-scale simulations reveal that FluidNet's ability to re-configure its front-haul and tailor transmission strategies provides a 50% improvement in satisfying traffic demands, while reducing the compute resource usage in the BBU pool by 50% compared to baseline transmission schemes.", "citation": "Citations (122)", "departments": ["Princeton University", "Princeton University", "University of California, Riverside", "Princeton University", "University of California, Riverside", "Princeton University", "Princeton University", "University of California, Riverside", "Princeton University", "University of California, Riverside"], "authors": ["Karthikeyan Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Karthikeyan", "Mustafa Y. Arslan.....http://dblp.org/pers/hd/a/Arslan:Mustafa_Y=", "Shailendra Singh.....http://dblp.org/pers/hd/s/Singh_0004:Shailendra", "Sampath Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan:Sampath", "Srikanth V. Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Srikanth_V="], "conf": "mobicom", "year": "2013", "pages": 12}