{"title": "A graph minor perspective to network coding: Connecting algebraic coding with network topologies.", "fields": ["butterfly graph", "simplex graph", "graph factorization", "coxeter graph", "hadwiger conjecture"], "abstract": "Network Coding encourages information coding across a communication network. While the necessity, benefit and complexity of network coding are sensitive to the underlying graph structure of a network, existing theory on network coding often treats the network topology as a black box, focusing on algebraic or information theoretic aspects of the problem. This work aims at an in-depth examination of the relation between algebraic coding and network topologies. We mathematically establish a series of results along the direction of: if network coding is necessary/beneficial, or if a particular finite field is required for coding, then the network must have a corresponding hidden structure embedded in its underlying topology, and such embedding is computationally efficient to verify. Specifically, we first formulate a meta-conjecture, the NC-Minor Conjecture, that articulates such a connection between graph theory and network coding, in the language of graph minors. We next prove that the NC-Minor Conjecture is almost equivalent to the Hadwiger Conjecture, which connects graph minors with graph coloring. Such equivalence implies the existence of K 4 , K 5 , K 6 , and K O(q/ log q)  minors, for networks requiring F 3 , F 4 , F 5  and F q , respectively. We finally prove that network coding can make a difference from routing only if the network contains a K 4  minor, and this minor containment result is tight. Practical implications of the above results are discussed.", "citation": "Citations (4)", "departments": ["Fudan University", "Fudan University", "Fudan University", "Fudan University", "University of Calgary"], "authors": ["Xunrui Yin.....http://dblp.org/pers/hd/y/Yin:Xunrui", "Yan Wang.....http://dblp.org/pers/hd/w/Wang:Yan", "Xin Wang.....http://dblp.org/pers/hd/w/Wang_0002:Xin", "Xiangyang Xue.....http://dblp.org/pers/hd/x/Xue:Xiangyang", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng"], "conf": "infocom", "year": "2013", "pages": 9}