{"title": "Tunable QoS-aware network survivability.", "fields": ["quality of service", "bottleneck", "network delay", "survivability", "exploit", "network planning and design"], "abstract": "Coping with network failures has been recognized as an issue of major importance in terms of social security, stability, and prosperity. It has become clear that current networking standards fall short of coping with the complex challenge of surviving failures. The need to address this challenge has become a focal point of networking research. In particular, the concept of  tunable survivability  offers major performance improvements over traditional approaches. Indeed, while the traditional approach aims at providing full (100%) protection against network failures through disjoint paths, it was realized that this requirement is too restrictive in practice. Tunable survivability provides a quantitative measure for specifying the desired level (0%–100%) of survivability and offers flexibility in the choice of the routing paths. Previous work focused on the simpler class of “bottleneck” criteria, such as bandwidth. In this paper, we focus on the important and much more complex class of  additive  criteria, such as delay and cost. First, we establish some (in part, counter-intuitive) properties of the optimal solution. Then, we establish efficient algorithmic schemes for optimizing the level of survivability under additive end-to-end quality of service (QoS) bounds. Subsequently, through extensive simulations, we show that, at the price of  negligible  reduction in the level of survivability, a major improvement (up to a factor of 2) is obtained in terms of end-to-end QoS performance. Finally, we exploit the above findings in the context of a network design problem, in which, for a given investment budget, we aim to improve the survivability of the network links.", "citation": "Citations (10)", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Jose Yallouz.....http://dblp.org/pers/hd/y/Yallouz:Jose", "Ariel Orda.....http://dblp.org/pers/hd/o/Orda:Ariel"], "conf": "infocom", "year": "2013", "pages": 9}