{"title": "Online packet scheduling with hard deadlines in multihop communication networks.", "fields": ["network packet", "dynamic priority scheduling", "earliest deadline first scheduling", "hop", "competitive analysis"], "abstract": "The problem of online job or packet scheduling with hard deadlines has been studied extensively in the single hop setting, whereas it is notoriously difficult in the multihop setting. This difficulty stems from the fact that packet scheduling decisions at each hop influences and are influenced by decisions on other hops and only a few provably efficient online scheduling algorithms exist in the multihop setting. We consider a general multihop network topology in which packets with various deadlines and weights arrive at and are destined to different nodes through given routes. We study the problem of joint admission control and packet scheduling in order to maximize the cumulative weights of the packets that reach their destinations within their deadlines. We first focus on uplink transmissions in the tree topology and show that the well known earliest deadline first algorithm achieves the same performance as the optimal off-line algorithm for any feasible arrival pattern. We then address the general topology with multiple source-destination pairs, develop a simple online algorithm and show that it is O(PM log PM)-competitive where PM is the maximum route length among all packets. Our algorithm only requires information along the route of each packet and our result is valid for general arrival samples. Via numerical results, we show that our algorithm achieves performance that is comparable to the non-causal optimal off-line algorithm. To the best of our knowledge, this is the first algorithm with a provable (based on a sample-path construction) competitive ratio, subject to hard deadline constraints for general network topologies.", "citation": "Citations (10)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Zhoujia Mao.....http://dblp.org/pers/hd/m/Mao:Zhoujia", "Can Emre Koksal.....http://dblp.org/pers/hd/k/Koksal:Can_Emre", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2013", "pages": 9}