{"title": "ERCD: An energy-efficient clone detection protocol in WSNs.", "fields": ["ranging", "software deployment", "key distribution in wireless sensor networks", "information privacy", "sink"], "abstract": "Wireless sensor networks (WSNs) play an increasing role in a wide variety of applications ranging from hostile environment monitoring to telemedicine services. The hardware and cost constraints of sensor nodes, however, make sensors prone to clone attacks and pose great challenges in the design and deployment of an energy-efficient WSN. In this paper, we propose a location-aware clone detection protocol, which guarantees successful clone attack detection and has little negative impact on the network lifetime. Specifically, we utilize the location information of sensors and randomly select witness nodes located in a ring area to verify the privacy of sensors and to detect clone attacks. The ring structure facilitates energy efficient data forwarding along the path towards the witnesses and the sink, and the traffic load is distributed across the network, which improves the network lifetime significantly. Theoretical analysis and simulation results demonstrate that the proposed protocol can approach 100% clone detection probability with trustful witnesses. We further extend the work by studying the clone detection performance with untrustful witnesses and show that the clone detection probability still approaches 98% when 10% of witnesses are compromised. Moreover, our proposed protocol can significantly improve the network lifetime, compared with the existing approach.", "citation": "Citations (11)", "departments": ["University of Waterloo", "Central South University", "Huawei", "Central South University", "University of Waterloo"], "authors": ["Zhongming Zheng.....http://dblp.org/pers/hd/z/Zheng:Zhongming", "Anfeng Liu.....http://dblp.org/pers/hd/l/Liu:Anfeng", "Lin X. Cai.....http://dblp.org/pers/hd/c/Cai:Lin_X=", "Zhigang Chen.....http://dblp.org/pers/hd/c/Chen:Zhigang", "Xuemin (Sherman) Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin_=Sherman="], "conf": "infocom", "year": "2013", "pages": 9}