{"title": "PIPAC: Patient infusion pattern based access control scheme for wireless insulin pump system.", "fields": ["insulin pump", "wireless", "supervised learning", "insulin", "access control"], "abstract": "Wireless insulin pumps have been widely deployed in hospitals and home healthcare systems. Most of these insulin pump systems have limited security mechanisms embedded to protect them from malicious attacks. In this paper, two attacks against insulin pump systems via wireless links are investigated: a single acute overdose with a significant amount of medication, and chronic overdose with an insignificant amount of extra medication over a long time period, e.g., several months. These attacks can be launched unobtrusively and may jeopardize patients' lives. It is very important and urgent to protect patients from these attacks. To address this issue, we propose a novel patient infusion pattern based access control scheme (PIPAC) for wireless insulin pumps. This scheme employs a supervised learning approach to learn normal patient infusions pattern with the dosage amount, rate, and time of infusion, which are automatically recorded in insulin pump logs. The generated regression models are used to dynamically configure a safety infusion range for abnormal infusion identification. The proposed algorithm is evaluated with real insulin pump logs used by several patients for up to 6 months. The evaluation results demonstrate that our scheme can reliably detect the single overdose attack with a success rate up to 98% and defend against the chronic overdose attack with a very high success rate.", "citation": "Citations (17)", "departments": ["Temple University", "Temple University", "Temple University", "University of Pennsylvania"], "authors": ["Xiali Hei.....http://dblp.org/pers/hd/h/Hei:Xiali", "Xiaojiang Du.....http://dblp.org/pers/hd/d/Du:Xiaojiang", "Shan Lin.....http://dblp.org/pers/hd/l/Lin:Shan", "Insup Lee.....http://dblp.org/pers/hd/l/Lee:Insup"], "conf": "infocom", "year": "2013", "pages": 9}