{"title": "A traceback attack on Freenet.", "fields": ["network security", "testbed", "digital watermarking", "peer to peer", "anonymity", "software deployment"], "abstract": "Freenet is a popular peer to peer anonymous network, with the objective to provide the anonymity of both content publishers and retrievers. Despite more than a decade of active development and deployment and the adoption of well-established cryptographic algorithms in Freenet, it remains unanswered how well the anonymity objective of the initial Freenet design has been met. In this paper we develop a traceback attack on Freenet, and show that the originating machine of a content request message in Freenet can be identified; that is, the anonymity of a content retriever can be broken, even if a single request message has been issued by the retriever. We present the design of the traceback attack, and perform Emulab-based experiments to confirm the feasibility and effectiveness of the attack. With randomly chosen content requesters (and random contents stored in the Freenet testbed), the experiments show that, for 24% to 43% of the content request messages, we can identify their originating machines. We also briefly discuss potential solutions to address the developed traceback attack. Despite being developed specifically on Freenet, the basic principles of the traceback attack and solutions have important security implications for similar anonymous content sharing systems.", "citation": "Citations (10)", "departments": ["Florida State University", "Florida State University", "University of Hawaii", "University of Hawaii", "Fontbonne University", "Florida State University", "University of Hawaii", "University of Hawaii"], "authors": ["Guanyu Tian.....http://dblp.org/pers/hd/t/Tian:Guanyu", "Zhenhai Duan.....http://dblp.org/pers/hd/d/Duan:Zhenhai", "Todd Baumeister.....http://dblp.org/pers/hd/b/Baumeister:Todd", "Yingfei Dong.....http://dblp.org/pers/hd/d/Dong:Yingfei"], "conf": "infocom", "year": "2013", "pages": 9}