{"title": "NetworkProfiler: Towards automatic fingerprinting of Android apps.", "fields": ["fuzz testing", "intelligent computer network", "floating car data", "radio access network", "traffic classification"], "abstract": "Network operators need to have a clear visibility into the applications running in their network. This is critical for both security and network management. Recent years have seen an exponential growth in the number of smart phone apps which has complicated this task. Traditional methods of traffic classification are no longer sufficient as the majority of this smart phone app traffic is carried over HTTP/HTTPS. Keeping up with the new applications that come up everyday is very challenging and time-consuming. We present a novel technique for automatically generating network profiles for identifying Android apps in the HTTP traffic. A network profile consists of fingerprints, i.e., unique characteristics of network behavior, that can be used to identify an app. To profile an Android app, we run the app automatically in an emulator and collect the network traces. We have developed a novel UI fuzzing technique for running the app such that different execution paths are exercised, which is necessary to build a comprehensive network profile. We have also developed a light-weight technique, for extracting fingerprints, that is based on identifying invariants in the generated traces. We used our technique to generate network profiles for thousands of apps. Using our network profiles we were able to detect the presence of these apps in real-world network traffic logs from a cellular provider.", "citation": "Citations (134)", "departments": ["Peking University", "Narus", "University of California, Berkeley", "Narus", "University of California, Berkeley"], "authors": ["Shuaifu Dai.....http://dblp.org/pers/hd/d/Dai:Shuaifu", "Alok Tongaonkar.....http://dblp.org/pers/hd/t/Tongaonkar:Alok", "Xiaoyin Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoyin", "Antonio Nucci.....http://dblp.org/pers/hd/n/Nucci:Antonio", "Dawn Song.....http://dblp.org/pers/hd/s/Song:Dawn"], "conf": "infocom", "year": "2013", "pages": 9}