{"title": "Strategyproof mechanisms for competitive influence in networks.", "fields": ["diffusion", "dynamic programming", "rational agent", "ask price", "greedy algorithm", "mechanism design"], "abstract": "Motivated by applications to word-of-mouth advertising, we consider a game-theoretic scenario in which competing advertisers want to target initial adopters in a social network. Each advertiser wishes to maximize the resulting cascade of influence, modeled by a general network diffusion process. However, competition between products may adversely impact the rate of adoption for any given firm. The resulting framework gives rise to complex preferences that depend on the specifics of the stochastic diffusion model and the network topology. We study this model from the perspective of a central mechanism, such as a social networking platform, that can optimize seed placement as a service for the advertisers. We ask: given the reported budgets of the competing firms, how should a mechanism choose seeds to maximize overall efficiency? Beyond the algorithmic problem, competition raises issues of strategic behaviour: rational agents should be incentivized to truthfully report their advertising budget. For a general class of influence spread models, we show that when there are two players, the social welfare can be $$\\frac{e}{e-1}$$ee-1-approximated by a polynomial-time strategyproof mechanism. Our mechanism uses a dynamic programming procedure to randomize the order in which advertisers are allocated seeds according to a greedy method. For three or more players, we demonstrate that under an additional assumption (satisfied by many existing models of influence spread) there exists a simpler strategyproof $$\\frac{e}{e-1}$$ee-1-approximation mechanism; notably, this natural greedy mechanism is not necessarily strategyproof when there are only two players.", "citation": "Citations (1)", "departments": ["University of Toronto", "Princeton University", "Microsoft", "University of Toronto", "University of Toronto", "Princeton University", "Microsoft", "University of Toronto"], "authors": ["Allan Borodin.....http://dblp.org/pers/hd/b/Borodin:Allan", "Mark Braverman.....http://dblp.org/pers/hd/b/Braverman:Mark", "Brendan Lucier.....http://dblp.org/pers/hd/l/Lucier:Brendan", "Joel Oren.....http://dblp.org/pers/hd/o/Oren:Joel"], "conf": "www", "year": "2013", "pages": 10}