{"title": "On the feasibility of online malware detection with performance counters.", "fields": ["cryptovirology", "cyber collection", "rootkit", "application security", "adware"], "abstract": "The proliferation of computers in any domain is followed by the proliferation of malware in that domain. Systems, including the latest mobile platforms, are laden with viruses, rootkits, spyware, adware and other classes of malware. Despite the existence of anti-virus software, malware threats persist and are growing as there exist a myriad of ways to subvert anti-virus (AV) software. In fact, attackers today exploit bugs in the AV software to break into systems.   In this paper, we examine the feasibility of building a malware detector in hardware using existing performance counters. We find that data from performance counters can be used to identify malware and that our detection techniques are robust to minor variations in malware programs. As a result, after examining a small set of variations within a family of malware on Android ARM and Intel Linux platforms, we can detect many variations within that family. Further, our proposed hardware modifications allow the malware detector to run securely beneath the system software, thus setting the stage for AV implementations that are simpler and less buggy than software AV. Combined, the robustness and security of hardware AV techniques have the potential to advance state-of-the-art online malware detection.", "citation": "Citations (158)", "year": "2013", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "conf": "isca", "authors": ["John Demme.....http://dblp.org/pers/hd/d/Demme:John", "Matthew Maycock.....http://dblp.org/pers/hd/m/Maycock:Matthew", "Jared Schmitz.....http://dblp.org/pers/hd/s/Schmitz:Jared", "Adrian Tang.....http://dblp.org/pers/hd/t/Tang:Adrian", "Adam Waksman.....http://dblp.org/pers/hd/w/Waksman:Adam", "Simha Sethumadhavan.....http://dblp.org/pers/hd/s/Sethumadhavan:Simha", "Salvatore J. Stolfo.....http://dblp.org/pers/hd/s/Stolfo:Salvatore_J="], "pages": 12}