{"title": "A 'cool' way of improving the reliability of HPC machines.", "fields": ["energy consumption", "loom", "leverage", "fault tolerance", "load balancing"], "abstract": "Soaring energy consumption, accompanied by declining reliability, together loom as the biggest hurdles for the next generation of supercomputers. Recent reports have expressed concern that reliability at exascale level could degrade to the point where failures become a norm rather than an exception. HPC researchers are focusing on improving existing fault tolerance protocols to address these concerns. Research on improving hardware reliability, i.e., machine component reliability, has also been making progress independently. In this paper, we try to bridge this gap and explore the potential of combining both software and hardware aspects towards improving reliability of HPC machines. Fault rates are known to double for every 10°C rise in core temperature. We leverage this notion to experimentally demonstrate the potential of restraining core temperatures and load balancing to achieve two-fold benefits: improving reliability of parallel machines and reducing total execution time required by applications. Our experimental results show that we can improve the reliability of a machine by a factor of 2.3 and reduce the execution time by 12%. In addition, our scheme can also reduce machine energy consumption by as much as 25%. For a 350K socket machine, regular checkpoint/restart fails to make progress (less than 1% efficiency), whereas our validated model predicts an efficiency of 20% by improving the machine reliability by a factor of up to 2.29.", "citation": "Citations (19)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Osman Sarood.....http://dblp.org/pers/hd/s/Sarood:Osman", "Esteban Meneses.....http://dblp.org/pers/hd/m/Meneses:Esteban", "Laxmikant V. Kalé.....http://dblp.org/pers/hd/k/Kal=eacute=:Laxmikant_V="], "conf": "sc", "year": "2013", "pages": 12}