{"title": "RAT selection games in HetNets.", "fields": ["random access", "radio access technology", "throughput", "small number", "nash equilibrium"], "abstract": "We study the dynamics of network selection in heterogeneous wireless networks (HetNets). Users in such networks selfishly select the best radio access technology (RAT) with the objective of maximizing their own throughputs. We propose two general classes of throughput models that capture the basic properties of random access (e.g., Wi-Fi) and scheduled access (e.g., WiMAX, LTE, 3G) networks. Next, we formulate the problem as a non-cooperative game, and study its convergence, efficiency, and practicality. Our results reveal that: (i) Singleclass RAT selection games converge to Nash equilibria, while an improvement path can be repeated infinitely with a mixture of classes. We next introduce a hysteresis mechanism in RAT selection games, and prove that with appropriate hysteresis policies, convergence can still be guaranteed; (ii) We analyze the Pareto-efficiency of the Nash equilibria of these games. We derive the conditions under which Nash equilibria are Paretooptimal, and we quantify the distance of Nash equilibria with respect to the set of Pareto-dominant points when the conditions are not satisfied; (iii) Finally, with extensive measurement-driven simulations we show that RAT selection games converge to Nash equilibria in a small number of steps, and hence are amenable to practical implementation. We also investigate the impact of noisy throughput measurements, and propose solutions to handle them.", "citation": "Citations (165)", "departments": ["Princeton University", "Shiraz University", "Princeton University", "Princeton University"], "authors": ["Ehsan Aryafar.....http://dblp.org/pers/hd/a/Aryafar:Ehsan", "Alireza Keshavarz-Haddad.....http://dblp.org/pers/hd/k/Keshavarz=Haddad:Alireza", "Michael Wang.....http://dblp.org/pers/hd/w/Wang_0002:Michael", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung"], "conf": "infocom", "year": "2013", "pages": 9}