{"title": "Characterizing privacy leakage of public WiFi networks for users on travel.", "fields": ["network service", "personally identifiable information", "financial privacy", "web navigation", "privacy software"], "abstract": "Deployment of public wireless access points (also known as public hotspots) and the prevalence of portable computing devices has made it more convenient for people on travel to access the Internet. On the other hand, it also generates large privacy concerns due to the open environment. However, most users are neglecting the privacy threats because currently there is no way for them to know to what extent their privacy is revealed. In this paper, we examine the privacy leakage in public hotspots from activities such as domain name querying, web browsing, search engine querying and online advertising. We discover that, from these activities multiple categories of user privacy can be leaked, such as identity privacy, location privacy, financial privacy, social privacy and personal privacy. We have collected real data from 20 airport datasets in four countries and discover that the privacy leakage can be up to 68%, which means two thirds of users on travel leak their private information while accessing the Internet at airports. Our results indicate that users are not fully aware of the privacy leakage they can encounter in the wireless environment, especially in public WiFi networks. This fact can urge network service providers and website designers to improve their service by developing better privacy preserving mechanisms.", "citation": "Citations (20)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "Nat. ICT of Aus ...  NSW, Australia"], "authors": ["Ningning Cheng.....http://dblp.org/pers/hd/c/Cheng:Ningning", "Xinlei (Oscar) Wang.....http://dblp.org/pers/hd/w/Wang:Xinlei_=Oscar=", "Wei Cheng.....http://dblp.org/pers/hd/c/Cheng:Wei", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant", "Aruna Seneviratne.....http://dblp.org/pers/hd/s/Seneviratne:Aruna"], "conf": "infocom", "year": "2013", "pages": 9}