{"title": "Dense Reconstruction Using 3D Object Shape Priors.", "fields": ["ambiguous image", "prior probability", "video tracking", "3d reconstruction", "monocular"], "abstract": "We propose a formulation of monocular SLAM which combines live dense reconstruction with shape priors-based 3D tracking and reconstruction. Current live dense SLAM approaches are limited to the reconstruction of visible surfaces. Moreover, most of them are based on the minimisation of a photo-consistency error, which usually makes them sensitive to specularities. In the 3D pose recovery literature, problems caused by imperfect and ambiguous image information have been dealt with by using prior shape knowledge. At the same time, the success of depth sensors has shown that combining joint image and depth information drastically increases the robustness of the classical monocular 3D tracking and 3D reconstruction approaches. In this work we link dense SLAM to 3D object pose and shape recovery. More specifically, we automatically augment our SLAM system with object specific identity, together with 6D pose and additional shape degrees of freedom for the object(s) of known class in the scene, combining image data and depth information for the pose and shape recovery. This leads to a system that allows for full scaled 3D reconstruction with the known object(s) segmented from the scene. The segmentation enhances the clarity, accuracy and completeness of the maps built by the dense SLAM system, while the dense 3D data aids the segmentation process, yielding faster and more reliable convergence than when using 2D image data alone.", "citation": "Citations (90)", "year": "2013", "departments": ["University of Oxford", "University of Oxford", "University of Oxford", "University of Adelaide"], "conf": "cvpr", "authors": ["Amaury Dame.....http://dblp.org/pers/hd/d/Dame:Amaury", "Victor Adrian Prisacariu.....http://dblp.org/pers/hd/p/Prisacariu:Victor_Adrian", "Carl Yuheng Ren.....http://dblp.org/pers/hd/r/Ren:Carl_Yuheng", "Ian D. Reid.....http://dblp.org/pers/hd/r/Reid_0001:Ian_D="], "pages": 8}