{"title": "SPLat: lightweight dynamic analysis for reducing combinatorics in testing configurable systems.", "fields": ["real time computing", "java", "software product line", "scalability", "static analysis"], "abstract": "Many programs can be configured through dynamic and/or static selection of configuration variables. A software product line (SPL), for example, specifies a family of programs where each program is defined by a unique combination of features. Systematically testing SPL programs is expensive as it can require running each test against a combinatorial number of configurations. Fortunately, a test is often independent of many configuration variables and need not be run against every combination. Configurations that are not required for a test can be pruned from execution. This paper presents SPLat, a new way to dynamically prune irrelevant configurations: the configurations to run for a test can be determined during test execution by monitoring accesses to configuration variables. SPLat achieves an optimal reduction in the number of configurations and is lightweight compared to prior work that used static analysis and heavyweight dynamic execution. Experimental results on 10 SPLs written in Java show that SPLat substantially reduces the total test execution time in many cases. Moreover, we demonstrate the scalability of SPLat by applying it to a large industrial code base written in Ruby on Rails.", "citation": "Citations (30)", "year": "2013", "departments": ["University of Texas at Austin", "University of Illinois at Urbana–Champaign", "University of Texas at Austin", "University of Texas at Austin", "Federal University of Pernambuco"], "conf": "sigsoft", "authors": ["Chang Hwan Peter Kim.....http://dblp.org/pers/hd/k/Kim:Chang_Hwan_Peter", "Darko Marinov.....http://dblp.org/pers/hd/m/Marinov:Darko", "Sarfraz Khurshid.....http://dblp.org/pers/hd/k/Khurshid:Sarfraz", "Don S. Batory.....http://dblp.org/pers/hd/b/Batory:Don_S=", "Sabrina Souto.....http://dblp.org/pers/hd/s/Souto:Sabrina", "Paulo Barros.....http://dblp.org/pers/hd/b/Barros:Paulo", "Marcelo d'Amorim.....http://dblp.org/pers/hd/d/d=Amorim:Marcelo"], "pages": 11}