{"title": "TriggerCas: Enabling wireless consrucive collisions.", "fields": ["network packet", "wireless", "synchronization", "received signal strength indication", "architecture"], "abstract": "Constructive Interference (CI) proposed in the existing work (e.g., A-MAC [1], Glossy [2]) may degrade the packet reception performance in terms of Packet Reception Ratio (PRR) and Received Signal Strength Indication (RSSI). The packet reception performance of a set of nodes transmitting simultaneously might be no better than that of any single node transmitting individually. In this paper, we redefine CI and propose TriggerCast, a practical wireless architecture which ensures concurrent transmissions of an identical packet to interfere constructively rather than to interfere non-destructively. CI potentially allows orders of magnitude reductions in energy consumption and improvements in link quality. Moreover, we for the first time present a theoretical sufficient condition for generating CI with IEEE 802.15.4 radio: concurrent transmissions with an identical packet should be synchronized at chip level. Meanwhile, co-senders participating in concurrent transmissions should be carefully selected, and the starting instants for the concurrent transmissions should be aligned. Based on the sufficient condition, we propose practical techniques to effectively compensate propagation and radio processing delays. TriggerCast has 95 th  percentile synchronization errors of at most 250ns. Extensive experiments in practical testbeds reveal that TriggerCast significantly improves PRR (from 5% to 70% with 7 concurrent senders, from 50% to 98.3% with 6 senders) and RSSI (about 6dB with 5 senders).", "citation": "Citations (3)", "departments": ["Tsinghua University", "Tsinghua University", "Shandong Institute of Business and Technology", "Tsinghua University", "Illinois Institute of Technology"], "authors": ["Yin Wang.....http://dblp.org/pers/hd/w/Wang:Yin", "Yuan He.....http://dblp.org/pers/hd/h/He_0004:Yuan", "Dapeng Cheng.....http://dblp.org/pers/hd/c/Cheng:Dapeng", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang"], "conf": "infocom", "year": "2013", "pages": 5}