{"title": "ZOOM: Scaling the mobility for fast opportunistic forwarding in vehicular networks.", "fields": ["scaling", "heuristic", "vehicular communication systems", "vehicular ad hoc network", "zoom"], "abstract": "Vehicular networks consist of highly mobile vehicles communications, where connectivity is intermittent. Due to the distributed and highly dynamic nature of vehicular network, to minimize the end-to-end delay and the network traffic at the same time in data forwarding is very hard. Heuristic algorithms utilizing either contact-level or social-level scale of vehicular mobility have only one-sided view of the network and therefore are not optimal. In this paper, by analyzing three large sets of Global Positioning System (GPS) trace of more than ten thousand public vehicles, we find that pairwise contacts have strong temporal correlation. Furthermore, the contact graph of vehicles presents complex structure when aggregating the underlying contacts. In understanding the impact of both levels of mobility to the data forwarding, we propose an innovative scheme, named ZOOM, for fast opportunistic forwarding in vehicular networks, which automatically choose the most appropriate mobility information when deciding next data-relays in order to minimize the end-to-end delay while reducing the network traffic. Extensive trace-driven simulations demonstrate the efficacy of ZOOM design. On average, ZOOM can improve 30% performance gain comparing to the state-of-art algorithms.", "citation": "Citations (65)", "departments": ["Shanghai Jiao Tong University", "University of Aizu", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Dong Hua Univ., ... Shanghai, China"], "authors": ["Hongzi Zhu.....http://dblp.org/pers/hd/z/Zhu:Hongzi", "Mianxiong Dong.....http://dblp.org/pers/hd/d/Dong:Mianxiong", "Shan Chang.....http://dblp.org/pers/hd/c/Chang:Shan", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu", "Xuemin (Sherman) Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin_=Sherman="], "conf": "infocom", "year": "2013", "pages": 9}