{"title": "Active Learning for Probabilistic Hypotheses Using the Maximum Gibbs Error Criterion.", "fields": ["transduction", "bayes error rate", "conditional random field", "naive bayes classifier", "probabilistic logic", "named entity recognition"], "abstract": "We introduce a new objective function for pool-based Bayesian active learning with probabilistic hypotheses. This objective function, called the policy Gibbs error, is the expected error rate of a random classifier drawn from the prior distribution on the examples adaptively selected by the active learning policy. Exact maximization of the policy Gibbs error is hard, so we propose a greedy strategy that maximizes the Gibbs error at each iteration, where the Gibbs error on an instance is the expected error of a random classifier selected from the posterior label distribution on that instance. We apply this maximum Gibbs error criterion to three active learning scenarios: non-adaptive, adaptive, and batch active learning. In each scenario, we prove that the criterion achieves near-maximal policy Gibbs error when constrained to a fixed budget. For practical implementations, we provide approximations to the maximum Gibbs error criterion for Bayesian conditional random fields and transductive Naive Bayes. Our experimental results on a named entity recognition task and a text classification task show that the maximum Gibbs error criterion is an effective active learning criterion for noisy models.", "citation": "Not cited", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "DSO National Laboratories", "DSO National Laboratories"], "authors": ["Viet Cuong Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Viet_Cuong", "Wee Sun Lee.....http://dblp.org/pers/hd/l/Lee:Wee_Sun", "Nan Ye.....http://dblp.org/pers/hd/y/Ye:Nan", "Kian Ming Adam Chai.....http://dblp.org/pers/hd/c/Chai:Kian_Ming_Adam", "Hai Leong Chieu.....http://dblp.org/pers/hd/c/Chieu:Hai_Leong"], "conf": "nips", "year": "2013", "pages": 9}