{"title": "Secure Outsourced Garbled Circuit Evaluation for Mobile Devices.", "fields": ["oblivious transfer", "computer security", "data validation", "evaluation function", "computer science", "mobile phone", "provisioning", "mobile device"], "abstract": "Garbled circuits provide a powerful tool for jointly evaluating functions while preserving the privacy of each user's inputs. While recent research has made the use of this primitive more practical, such solutions generally assume that participants are symmetrically provisioned with massive computing resources. In reality, most people on the planet only have access to the comparatively sparse computational resources associated with their mobile phones, and those willing and able to pay for access to public cloud computing infrastructure cannot be assured that their data will remain unexposed. We address this problem by creating a new SFE protocol that allows mobile devices to securely outsource the majority of computation required to evaluate a garbled circuit. Our protocol, which builds on the most efficient garbled circuit evaluation techniques, includes a new out-sourced oblivious transfer primitive that requires significantly less bandwidth and computation than standard OT primitives and outsourced input validation techniques that force the cloud to prove that it is executing all protocols correctly. After showing that our extensions are secure in the malicious model, we conduct an extensive performance evaluation for a number of standard SFE test applications as well as a privacy-preserving navigation application designed specifically for the mobile usecase. Our system reduces execution time by 98.92% and bandwidth by 99.95% for the edit distance problem of size 128 compared to non-outsourced evaluation. These results show that even the least capable devices are capable of evaluating some of the largest garbled circuits generated for any platform.", "citation": "Citations (70)", "year": "2013", "departments": ["Georgia Institute of Technology", "University of Oregon", "Georgia Institute of Technology", "University of Oregon"], "conf": "uss", "authors": ["Henry Carter.....http://dblp.org/pers/hd/c/Carter:Henry", "Benjamin Mood.....http://dblp.org/pers/hd/m/Mood:Benjamin", "Patrick Traynor.....http://dblp.org/pers/hd/t/Traynor:Patrick", "Kevin R. B. Butler.....http://dblp.org/pers/hd/b/Butler:Kevin_R=_B="], "pages": 16}