{"title": "Heterogeneous system coherence for integrated CPU-GPU systems.", "fields": ["bus sniffing", "memory coherence", "cache coherence", "coherence bandwidth", "mesi protocol"], "abstract": "Many future heterogeneous systems will integrate CPUs and GPUs physically on a single chip and logically connect them via shared memory to avoid explicit data copying. Making this shared memory coherent facilitates programming and fine-grained sharing, but throughput-oriented GPUs can overwhelm CPUs with coherence requests not well-filtered by caches. Meanwhile, region coherence has been proposed for CPU-only systems to reduce snoop bandwidth by obtaining coherence permissions for large regions.   This paper develops  Heterogeneous System Coherence  (HSC) for CPU-GPU systems to mitigate the coherence bandwidth effects of GPU memory requests. HSC replaces a standard directory with a region directory and adds a region buffer to the L2 cache. These structures allow the system to move bandwidth from the coherence network to the high-bandwidth direct-access bus without sacrificing coherence.   Evaluation results with a subset of Rodinia benchmarks and the AMD APP SDK show that HSC can improve performance compared to a conventional directory protocol by an average of more than 2x and a maximum of more than 4.5x. Additionally, HSC reduces the bandwidth to the directory by an average of 94% and by more than 99% for four of the analyzed benchmarks.", "citation": "Citations (94)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices"], "authors": ["Jason Power.....http://dblp.org/pers/hd/p/Power:Jason", "Arkaprava Basu.....http://dblp.org/pers/hd/b/Basu:Arkaprava", "Junli Gu.....http://dblp.org/pers/hd/g/Gu:Junli", "Sooraj Puthoor.....http://dblp.org/pers/hd/p/Puthoor:Sooraj", "Bradford M. Beckmann.....http://dblp.org/pers/hd/b/Beckmann:Bradford_M=", "Mark D. Hill.....http://dblp.org/pers/hd/h/Hill:Mark_D=", "Steven K. Reinhardt.....http://dblp.org/pers/hd/r/Reinhardt:Steven_K=", "David A. Wood.....http://dblp.org/pers/hd/w/Wood:David_A="], "conf": "micro", "year": "2013", "pages": 11}