{"title": "RoadAlarm: A spatial alarm system on road networks.", "fields": ["alarm", "systems architecture", "end user", "software system", "personalization"], "abstract": "Spatial alarms are one of the fundamental functionalities for many LBSs. We argue that spatial alarms should be road network aware as mobile objects travel on spatially constrained road networks or walk paths. In this software system demonstration, we will present the first prototype system of ROADALARM - a spatial alarm processing system for moving objects on road networks. The demonstration system of ROAD-ALARM focuses on the three unique features of ROADALARM system design. First, we will show that the road network distance-based spatial alarm is best modeled using road network distance such as segment length-based and travel time-based distance. Thus, a road network spatial alarm is a star-like subgraph centered at the alarm target. Second, we will show the suite of ROADALARM optimization techniques to scale spatial alarm processing by taking into account spatial constraints on road networks and mobility patterns of mobile subscribers. Third, we will show that, by equipping the ROADALARM system with an activity monitoring-based control panel, we are able to enable the system administrator and the end users to visualize road network-based spatial alarms, mobility traces of moving objects and dynamically make selection or customization of the ROADALARM techniques for spatial alarm processing through graphical user interface. We show that the ROADALARM system provides both the general system architecture and the essential building blocks for location-based advertisements and location-based reminders.", "citation": "Citations (1)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Kisung Lee.....http://dblp.org/pers/hd/l/Lee:Kisung", "Emre Yigitoglu.....http://dblp.org/pers/hd/y/Yigitoglu:Emre", "Ling Liu.....http://dblp.org/pers/hd/l/Liu_0001:Ling", "Binh Han.....http://dblp.org/pers/hd/h/Han:Binh", "Balaji Palanisamy.....http://dblp.org/pers/hd/p/Palanisamy:Balaji", "Calton Pu.....http://dblp.org/pers/hd/p/Pu:Calton"], "conf": "icde", "year": "2013", "pages": 4}