{"title": "O(ε)-Approximation to physical world by sensor networks.", "fields": ["data acquisition", "interpolation", "approximation theory", "spline interpolation", "economic shortage"], "abstract": "To observe the complicate physical world by a WSN, the sensors in the WSN senses and samples the data from the physical world. Currently, most of the existing work use equi-frequency sampling methods (EFS) or EFS based sampling methods for data acquisition in sensor networks. However, the accuracies of EFS and EFS based sampling methods cannot be guaranteed in practice since the physical world usually varies continuously, and these methods does not support reconstructing of the monitored physical world. To overcome the shortages of EFS and EFS based sampling methods, this paper focuses on designing physical-world-aware data acquisition algorithms to support O(ϵ)-approximation to the physical world for any ϵ ≥ 0. Two physical-world-aware data acquisition algorithms based on Hermit and Spline interpolation are proposed in the paper. Both algorithms can adjust the sensing frequency automatically based on the changing trend of the physical world and given c. The thorough analysis on the performance of the algorithms are also provided, including the accuracies, the smooth of the outputted curves, the error bounds for computing first and second derivatives, the number of the sampling times and complexities of the algorithms. It is proven that the error bounds of the algorithms are O(ϵ) and the complexities of the algorithms are O(1/ϵ 1/4 ). Based on the new data acquisition algorithms, an algorithm for reconstructing physical world is also proposed and analyzed. The theoretical analysis and experimental results show that all the proposed algorithms have high performance in items of accuracy and energy consumption.", "citation": "Citations (55)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Georgia State University"], "authors": ["Siyao Cheng.....http://dblp.org/pers/hd/c/Cheng:Siyao", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Zhipeng Cai.....http://dblp.org/pers/hd/c/Cai:Zhipeng"], "conf": "infocom", "year": "2013", "pages": 9}