{"title": "A Comparative Study of Modern Inference Techniques for Discrete Energy Minimization Problems.", "fields": ["random field", "inference", "discrete optimization", "energy minimization", "graphical model"], "abstract": "Even years ago, Szeliski et al. published an influential study on energy minimization methods for Markov random fields (MRF). This study provided valuable insights in choosing the best optimization technique for certain classes of problems. While these insights remain generally useful today, the phenominal success of random field models means that the kinds of inference problems we solve have changed significantly. Specifically, the models today often include higher order interactions, flexible connectivity structures, large label-spaces of different cardinalities, or learned energy tables. To reflect these changes, we provide a modernized and enlarged study. We present an empirical comparison of 24 state-of-art techniques on a corpus of 2,300 energy minimization instances from 20 diverse computer vision applications. To ensure reproducibility, we evaluate all methods in the OpenGM2 framework and report extensive results regarding runtime and solution quality. Key insights from our study agree with the results of Szeliski et al. for the types of models they studied. However, on new and challenging types of models our findings disagree and suggest that polyhedral methods and integer programming solvers are competitive in terms of runtime and solution quality over a large range of model types.", "citation": "Citations (263)", "year": "2013", "departments": ["Max Planck Society", "External Organizations", "External Organizations", "External Organizations", "External Organizations"], "conf": "cvpr", "authors": ["Jörg H. Kappes.....http://dblp.org/pers/hd/k/Kappes:J=ouml=rg_H=", "Björn Andres.....http://dblp.org/pers/hd/a/Andres:Bj=ouml=rn", "Fred A. Hamprecht.....http://dblp.org/pers/hd/h/Hamprecht:Fred_A=", "Christoph Schnörr.....http://dblp.org/pers/hd/s/Schn=ouml=rr:Christoph", "Sebastian Nowozin.....http://dblp.org/pers/hd/n/Nowozin:Sebastian", "Dhruv Batra.....http://dblp.org/pers/hd/b/Batra:Dhruv", "Sungwoong Kim.....http://dblp.org/pers/hd/k/Kim:Sungwoong", "Bernhard X. Kausler.....http://dblp.org/pers/hd/k/Kausler:Bernhard_X=", "Jan Lellmann.....http://dblp.org/pers/hd/l/Lellmann:Jan", "Nikos Komodakis.....http://dblp.org/pers/hd/k/Komodakis:Nikos", "Carsten Rother.....http://dblp.org/pers/hd/r/Rother:Carsten"], "pages": 8}