{"title": "Robust privacy-preserving authentication scheme for communication between electric vehicle as power energy storage and power stations.", "fields": ["adversary", "pseudonymity", "identity management", "electric vehicle", "smart grid"], "abstract": "The concept of Electric Vehicle as Power Energy Storage has gained much attention from the research community and market recently. The increasing capacity of the power storages in the electric vehicles (EV) motivates this concept and makes it more feasible. However, the privacy of the customers can be compromised by tracing the stations that an EV has been connected to during a period of the time. The stations that are providing power charging as well as purchasing the power back from EVs can be owned by third party businesses. EVs should be authenticated through these stations in order to give or receive appropriate credit for the power. In this paper, we identify potential privacy issues and propose a robust privacy-preserving authentication scheme for communication of the EV and the station to prevent customer information leakage. In our approach, the EV and the station communication utilizes pseudonym of the EV, in which only the smart grid server (a trusted entity) can map the pseudonym to the real vehicle identity and provide the identity management. The pseudonym of an EV changes when the EV moves from one station to another, which prevents the adversary from tracing foot prints of the EV. Our analysis shows that our model is robust enough to make sure the privacy of the customers is fully preserved, and at the same time, it is efficient by consuming very limited resources.", "citation": "Citations (12)", "departments": ["University of British Columbia", "University of British Columbia", "University of British Columbia", "University of British Columbia"], "authors": ["Hasen Nicanfar.....http://dblp.org/pers/hd/n/Nicanfar:Hasen", "Seyedali Hosseininezhad.....http://dblp.org/pers/hd/h/Hosseininezhad:Seyedali", "Peyman TalebiFard.....http://dblp.org/pers/hd/t/TalebiFard:Peyman", "Victor C. M. Leung.....http://dblp.org/pers/hd/l/Leung:Victor_C=_M="], "conf": "infocom", "year": "2013", "pages": 6}