{"title": "Minimizing flow completion times in data centers.", "fields": ["data center", "protocol stack", "data consistency", "explicit congestion notification", "low latency"], "abstract": "For provisioning large-scale online applications such as web search, social networks and advertisement systems, data centers face extreme challenges in providing low latency for short flows (that result from end-user actions) and high throughput for background flows (that are needed to maintain data consistency and structure across massively distributed systems). We propose L 2 DCT, a practical data center transport protocol that targets a reduction in flow completion times for short flows by approximating the Least Attained Service (LAS) scheduling discipline, without requiring any changes in application software or router hardware, and without adversely affecting the long flows. L 2 DCT can co-exist with TCP and works by adapting flow rates to the extent of network congestion inferred via Explicit Congestion Notification (ECN) marking, a feature widely supported by the installed router base. Though L 2 DCT is deadline unaware, our results indicate that, for typical data center traffic patterns and deadlines and over a wide range of traffic load, its deadline miss rate is consistently smaller compared to existing deadline-driven data center transport protocols. L 2 DCT reduces the mean flow completion time by up to 50% over DCTCP and by up to 95% over TCP. In addition, it reduces the completion for 99th percentile flows by 37% over DCTCP. We present the design and analysis of L 2 DCT, evaluate its performance, and discuss an implementation built upon standard Linux protocol stack.", "citation": "Citations (110)", "departments": ["Lahore University of Management Sciences", "Lahore University of Management Sciences", "Lahore University of Management Sciences", "Lahore University of Management Sciences", "Lahore University of Management Sciences"], "authors": ["Ali Munir.....http://dblp.org/pers/hd/m/Munir:Ali", "Ihsan Ayyub Qazi.....http://dblp.org/pers/hd/q/Qazi:Ihsan_Ayyub", "Zartash Afzal Uzmi.....http://dblp.org/pers/hd/u/Uzmi:Zartash_Afzal", "Aisha Mushtaq.....http://dblp.org/pers/hd/m/Mushtaq:Aisha", "Saad N. Ismail.....http://dblp.org/pers/hd/i/Ismail:Saad_N=", "M. Safdar Iqbal.....http://dblp.org/pers/hd/i/Iqbal:M=_Safdar", "Basma Khan.....http://dblp.org/pers/hd/k/Khan:Basma"], "conf": "infocom", "year": "2013", "pages": 9}