{"title": "Ego networks in Twitter: An experimental analysis.", "fields": ["data exchange", "social computing", "social media optimization", "social competence", "social web"], "abstract": "Online Social Networks are amongst the most important platforms for maintaining social relationships online, supporting content generation and exchange between users. They are therefore natural candidate to be the basis of future humancentric networks and data exchange systems, in addition to novel forms of Internet services exploiting the properties of human social relationships. Understanding the structural properties of OSN and how they are influenced by human behaviour is thus fundamental to design such human-centred systems. In this paper we analyse a real Twitter data set to investigate whether well known structures of human social networks identified in \"offline\" environments can also be identified in the social networks maintained by users on Twitter. According to the well known model proposed by Dunbar, offline social networks are formed of circles of relationships having different social characteristics (e.g., intimacy, contact frequency and size). These circles can be directly ascribed to cognitive constraints of human brain, that impose limits on the number of social relationships maintainable at different levels of emotional closeness. Our results indicate that a similar structure can also be found in the Twitter users' social networks. This suggests that the structure of social networks also in online environments are controlled by the same cognitive properties of human brain that operate offline.", "citation": "Citations (24)", "departments": ["Inst. of Inf. & ... cs, Pisa, Italy", "Inst. of Inf. & ... cs, Pisa, Italy", "Inst. of Inf. & ... cs, Pisa, Italy", "Inst. of Inf. & ... cs, Pisa, Italy"], "authors": ["Valerio Arnaboldi.....http://dblp.org/pers/hd/a/Arnaboldi:Valerio", "Marco Conti.....http://dblp.org/pers/hd/c/Conti:Marco", "Andrea Passarella.....http://dblp.org/pers/hd/p/Passarella:Andrea", "Fabio Pezzoni.....http://dblp.org/pers/hd/p/Pezzoni:Fabio"], "conf": "infocom", "year": "2013", "pages": 6}