{"title": "LSII: An indexing structure for exact real-time search on microblogs.", "fields": ["personalized search", "exploit", "microblogging", "real time search", "timestamp"], "abstract": "Indexing microblogs for real-time search is challenging given the efficiency issue caused by the tremendous speed at which new microblogs are created by users. Existing approaches address this efficiency issue at the cost of query accuracy, as they either (i) exclude a significant portion of microblogs from the index to reduce update cost or (ii) rank microblogs mostly by their timestamps (without sufficient consideration of their relevance to the queries) to enable append-only index insertion. As a consequence, the search results returned by the existing approaches do not satisfy the users who demand timely and high-quality search results. To remedy this deficiency, we propose the Log-Structured Inverted Indices (LSII), a structure for exact real-time search on microblogs. The core of LSII is a sequence of inverted indices with exponentially increasing sizes, such that new microblogs are (i) first inserted into the smallest index and (ii) later moved into the larger indices in a batch manner. The batch insertion mechanism leads to a small amortize update cost for each new microblog, without significantly degrading query performance. We present a comprehensive study on LSII, exploring various design options to strike a good balance between query and update performance. In addition, we propose extensions of LSII to support personalized search and to exploit multi-threading for performance improvement. Extensive experiments demonstrate the efficiency of LSII with experiments on real data.", "citation": "Citations (30)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Sun Yet-Sen Uni ... uangzhou, China"], "authors": ["Lingkun Wu.....http://dblp.org/pers/hd/w/Wu:Lingkun", "Wenqing Lin.....http://dblp.org/pers/hd/l/Lin:Wenqing", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Yabo Xu.....http://dblp.org/pers/hd/x/Xu:Yabo"], "conf": "icde", "year": "2013", "pages": 12}