{"title": "Getting real: lessons in transitioning research simulations into hardware systems.", "fields": ["computer hardware", "solid state", "cache", "emulation", "performance improvement"], "abstract": "Flash-based solid-state drives have revolutionized storage with their high performance. Their sophisticated internal mechanisms have led to a plethora of research on how to optimize applications, file systems, and internal SSD designs. Due to the closed nature of commercial devices though, most research on the internals of an SSD, such as enhanced flash-translation layers, is performed using simulation or emulation. Without implementation in real devices, it can be difficult to judge the true benefit of the proposed designs.\n\nIn this paper, we describe our efforts to implement two new SSD designs that change both the internal workings of the device and its interface to the host operating system. Using the OpenSSD Jasmine board, we develop a prototype of FlashTier's Solid State Cache (SSC) and of the Nameless Write SSD. While the flash-translation layer changes were straightforward, we discovered unexpected complexities in implementing extensions to the storage interface.\n\nWe describe our implementation process and extract a set of lessons applicable to other SSD prototypes. With our prototype we validate the performance claims of FlashTier and show a 45-52% performance improvement over caching with an SSD and a 90% reduction in erases.", "citation": "Citations (18)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Mohit Saxena.....http://dblp.org/pers/hd/s/Saxena:Mohit", "Yiying Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Yiying", "Michael M. Swift.....http://dblp.org/pers/hd/s/Swift:Michael_M=", "Andrea C. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Andrea_C=", "Remzi H. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Remzi_H="], "conf": "fast", "year": "2013", "pages": 14}