{"title": "LinkProbe: Probabilistic inference on large-scale social networks.", "fields": ["rule of inference", "semantic reasoner", "adaptive neuro fuzzy inference system", "probabilistic logic network", "variable elimination"], "abstract": "As one of the most important Semantic Web applications, social network analysis has attracted more and more interest from researchers due to the rapidly increasing availability of massive social network data. A desired solution for social network analysis should address the following issues. First, in many real world applications, inference rules are partially correct. An ideal solution should be able to handle partially correct rules. Second, applications in practice often involve large amounts of data. The inference mechanism should scale up towards large-scale data. Third, inference methods should take into account probabilistic evidence data because these are domains abounding with uncertainty. Various solutions for social network analysis have existed for quite a few years; however, none of them support all the aforementioned features. In this paper, we design and implement LinkProbe, a prototype to quantitatively predict the existence of links among nodes in large-scale social networks, which are empowered by Markov Logic Networks (MLNs). MLN has been proved to be an effective inference model which can handle complex dependencies and partially correct rules. More importantly, although MLN has shown acceptable performance in prior works, it is also reported as impractical in handling large-scale data due to its highly demanding nature in terms of inference time and memory consumption. In order to overcome these limitations, LinkProbe retrieves the k-backbone graphs and conducts the MLN inference on both the most globally influencing nodes and most locally related nodes. Our extensive experiments show that LinkProbe manages to provide a tunable balance between MLN inference accuracy and inference efficiency.", "citation": "Citations (9)", "departments": ["Valdosta State University", "Auburn University", "Microsoft", "Auburn University", "Microsoft"], "authors": ["Haiquan Chen.....http://dblp.org/pers/hd/c/Chen:Haiquan", "Wei-Shinn Ku.....http://dblp.org/pers/hd/k/Ku:Wei=Shinn", "Haixun Wang.....http://dblp.org/pers/hd/w/Wang:Haixun", "Liang Tang.....http://dblp.org/pers/hd/t/Tang:Liang", "Min-Te Sun.....http://dblp.org/pers/hd/s/Sun:Min=Te"], "conf": "icde", "year": "2013", "pages": 12}