{"title": "Meta-Interpretive Learning of Higher-Order Dyadic Datalog: Predicate Invention revisited.", "fields": ["datalog", "predicate", "inductive logic programming", "predicate variable"], "abstract": "Since the late 1990s predicate invention has been under-explored within inductive logic programming due to difficulties in formulating efficient search mechanisms. However, a recent paper demonstrated that both predicate invention and the learning of recursion can be efficiently implemented for regular and context-free grammars, by way of metalogical substitutions with respect to a modified Prolog meta-interpreter which acts as the learning engine. New predicate symbols are introduced as constants representing existentially quantified higher-order variables. The approach demonstrates that predicate invention can be treated as a form of higher-order logical reasoning. In this paper we generalise the approach of meta-interpretive learning (MIL) to that of learning higher-order dyadic datalog programs. We show that with an infinite signature the higher-order dyadic datalog class $$H^2_2$$H22 has universal Turing expressivity though $$H^2_2$$H22 is decidable given a finite signature. Additionally we show that Knuth---Bendix ordering of the hypothesis space together with logarithmic clause bounding allows our MIL implementation Metagol$$_{D}$$D to PAC-learn minimal cardinality $$H^2_2$$H22 definitions. This result is consistent with our experiments which indicate that Metagol$$_{D}$$D efficiently learns compact $$H^2_2$$H22 definitions involving predicate invention for learning robotic strategies, the East---West train challenge and NELL. Additionally higher-order concepts were learned in the NELL language learning domain. The Metagol code and datasets described in this paper have been made publicly available on a website to allow reproduction of results in this paper.", "citation": "Citations (85)", "year": "2013", "departments": ["Imperial College London", "Imperial College London", "Imperial College London"], "conf": "ijcai", "authors": ["Stephen H. Muggleton.....http://dblp.org/pers/hd/m/Muggleton:Stephen_H=", "Dianhuan Lin.....http://dblp.org/pers/hd/l/Lin:Dianhuan"], "pages": 7}