{"title": "Link Scanner: Faulty link detection for wireless sensor networks.", "fields": ["network partition", "key distribution in wireless sensor networks", "wireless wan", "mobile wireless sensor network", "hop", "heterogeneous network", "wi fi array"], "abstract": "In large-scale wireless sensor networks, it proves very difficult to dynamically monitor system degradation and detect bad links. Faulty link detection plays a critical role in network diagnosis. Indeed, a destructive node impacts its links' performances including transmitting and receiving. Similarly, other potential network bottlenecks such as network partition and routing errors can be detected by link scan. Since sequentially checking all potential links incurs high transmission and storage cost, existing approaches often focus on links currently in use, while overlook those unused yet ones, thus fail to offer more insights to guide following operations. We propose a novel scheme Link Scanner (LS) for monitoring wireless links at real time. LS issues one probe message in the network and collects hop counts of the received probe messages at sensor nodes. Based on the observation that faulty links can result in mismatch between the received hop counts and the network topology, we are able to deduce all links' status with a probabilistic model. We evaluate our scheme by carrying out experiments on a testbed with 60 TelosB motes and conducting extensive simulation tests. A real outdoor system is also deployed to verify that LS can be reliably applied to surveillance networks.", "citation": "Citations (11)", "departments": ["Hong Kong University of Science and Technology", "Tsinghua University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Sch. of Inf. En ... st Univ., China"], "authors": ["Qiang Ma.....http://dblp.org/pers/hd/m/Ma:Qiang", "Kebin Liu.....http://dblp.org/pers/hd/l/Liu:Kebin", "Xiangrong Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiangrong", "Zhichao Cao.....http://dblp.org/pers/hd/c/Cao:Zhichao", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2013", "pages": 9}