{"title": "Kernelized Bayesian Matrix Factorization.", "fields": ["kernel", "data set", "probabilistic logic", "bipartite graph", "matrix decomposition", "multiple kernel learning", "hamming code"], "abstract": "We extend kernelized matrix factorization with a full-Bayesian treatment and with an ability to work with multiple side information sources expressed as different kernels. Kernels have been introduced to integrate side information about the rows and columns, which is necessary for making out-of-matrix predictions. We discuss specifically binary output matrices but extensions to real-valued matrices are straightforward. We extend the state of the art in two key aspects: (i) A full-conjugate probabilistic formulation of the kernelized matrix factorization enables an efficient variational approximation, whereas full-Bayesian treatments are not computationally feasible in the earlier approaches. (ii) Multiple side information sources are included, treated as different kernels in multiple kernel learning which additionally reveals which side sources are informative. We then show that the framework can also be used for supervised and semi-supervised multilabel classification and multi-output regression, by considering samples and outputs as the domains where matrix factorization operates. Our method outperforms alternatives in predicting drug-protein interactions on two data sets. On multilabel classification, our algorithm obtains the lowest Hamming losses on 10 out of 14 data sets compared to five state-of-the-art multilabel classification algorithms. We finally show that the proposed approach outperforms alternatives in multi-output regression experiments on a yeast cell cycle data set.", "citation": "Citations (30)", "departments": ["Sage Bionetworks", "Helsinki Institute for Information Technology", "Aalto University", "Helsinki Institute for Information Technology", "Aalto University", "Helsinki Institute for Information Technology", "Aalto University", "Helsinki Institute for Information Technology", "University of Helsinki"], "authors": ["Mehmet Gönen.....http://dblp.org/pers/hd/g/G=ouml=nen:Mehmet", "Suleiman A. Khan.....http://dblp.org/pers/hd/k/Khan:Suleiman_A=", "Samuel Kaski.....http://dblp.org/pers/hd/k/Kaski:Samuel"], "conf": "icml", "year": "2013", "pages": 9}