{"title": "GeoMob: A mobility-aware geocast scheme in metropolitans via taxicabs and buses.", "fields": ["computer network", "mobility model", "distributed computing", "geocast", "scalability"], "abstract": "Geocast, delivering messages to a specific location, has become an important issue with the accelerated development of the location-based services in mobile networks. Geocast in the automotive domain is of particular interest, enabling many promising applications, such as geographic advertising, location- based traffic alerts, etc. Different from the conventional geocast algorithms focusing on the distance-based approaches, in this paper, we propose a mobility-aware geocast algorithm (GeoMob) for urban VANETs from the Delay-Tolerant Network (DTN) perspective to better deal with the high mobility and transient connectivity issues. Different levels and aspects of vehicle mobility information are employed, making GeoMob very simple, scalable and communication and compunction-effective. Practical issues are well considered by introducing real-world trace analysis, trace-driven simulation and efficient buffer management. Exten- sive performance comparisons with other protocols have been conducted to show the advantages of GeoMob. Index Terms—Geocast, VANETs, mobility, DTNs Instead of the traditional geometry-based approaches, we propose a mobility-aware geocast scheme (GeoMob) for large- scale urban VANETs from the DTN perspective, through Vehicle-to-Vehicle (V2V) communication. Different from some of the most efficient DTN routing schemes (6), (7), which are based on the expensive pair-wise contact probability calculation and sharing, our scheme employs the node mobility information at different levels, i.e., macroscopic and micro- scopic mobility. Macroscopic mobility describes the traffic trend of all vehicles in a city, while microscopic mobility captures the mobility patterns of individuals. Because the macroscopic mobility for a city is quite stable and the micro- scopic mobility is completely self-maintained by each vehicle. This mobility hierarchy makes our scheme extremely simple, scalable and communication and computation-efficient when compared with existing solutions. The two levels of mobility are extracted from the real- world GPS traces of taxicabs and buses in Shanghai, China. To facilitate the mobility modeling, we divide the city into regions, each of which contains considerable traffic volumes. Traffic flows among regions are extracted and utilized as the macroscopic mobility pattern. The volume of the traffic flows can indicate how well the regions are connected through vehicles and how reliable the message dissemination between regions can be via vehicular communication. The massive data trace also allows us to investigate each individual's mobility pattern, which serves as the routing criterion. The proposed scheme also employs the different mobility features of different vehicle types, i.e., taxicabs and buses. Considering practical restrictions, i.e., the limited buffer size and transmis- sion bandwidth, an efficient buffer management is introduced which further improves the performance of our scheme. The rest of the paper is organized as follows. In Section II, conventional geocast and related DTN routing schemes are discussed as related work. The trace analysis is presented in Section III. Section IV reveals the details about the proposed geocast scheme. With a trace-driven simulation, the perfor- mance is evaluated in Section V. Finally, we conclude our paper in Section VI.", "citation": "Citations (58)", "departments": ["University of Victoria", "University of Victoria", "University of Victoria"], "authors": ["Lei Zhang.....http://dblp.org/pers/hd/z/Zhang:Lei", "Boyang Yu.....http://dblp.org/pers/hd/y/Yu:Boyang", "Jianping Pan.....http://dblp.org/pers/hd/p/Pan_0001:Jianping"], "conf": "infocom", "year": "2014", "pages": 9}