{"title": "Architecture challenges for internal software ecosystems: a large-scale industry case study.", "fields": ["systems engineering", "software design description", "software peer review", "ecosystem", "engineering", "architecture", "resource oriented architecture", "team software process", "software engineering process group", "software"], "abstract": "The idea of software ecosystems encourages organizations to open software projects for external businesses, governing the cross-organizational development by architectural and other measures. Even within a single organization, this paradigm can be of high value for large-scale decentralized software projects that involve various internal, yet self-contained organizational units. However, this intra-organizational decentralization causes architecture challenges that must be understood to reason about suitable architectural measures. We present an in-depth case study on collaboration and architecture challenges in two of these large-scale software projects at Siemens. We performed a total of 46 hours of semi-structured interviews with 17 leading software architects from all involved organizational units. Our major findings are: (1) three collaboration models on a continuum that ranges from high to low coupling, (2) a classification of architecture challenges, together with (3) a qualitative and quantitative exposure of the identified recurring issues along each collaboration model. Our study results provide valuable insights for both industry and academia: Practitioners that find themselves in one of the collaboration models can use empirical evidence on challenges to make informed decisions about counteractive measures. Researchers can focus their attention on challenges faced by practitioners to make software engineering more effective.", "citation": "Not cited", "departments": ["Siemens", "Siemens", "University of Erlangen-Nuremberg"], "authors": ["Klaus-Benedikt Schultis.....http://dblp.org/pers/hd/s/Schultis:Klaus=Benedikt", "Christoph Elsner.....http://dblp.org/pers/hd/e/Elsner:Christoph", "Daniel Lohmann.....http://dblp.org/pers/hd/l/Lohmann:Daniel"], "conf": "sigsoft", "year": "2014", "pages": 11}