{"title": "Efficient I/O and Storage of Adaptive-Resolution Data.", "fields": ["adaptive mesh refinement", "graph", "grid", "scalability", "input output"], "abstract": "We present an efficient, flexible, adaptive-resolution I/O framework that is suitable for both uniform and Adaptive Mesh Refinement (AMR) simulations. In an AMR setting, current solutions typically represent each resolution level as an independent grid which often results in inefficient storage and performance. Our technique coalesces domain data into a unified, multiresolution representation with fast, spatially aggregated I/O. Furthermore, our framework easily extends to importance-driven storage of uniform grids, for example, by storing regions of interest at full resolution and nonessential regions at lower resolution for visualization or analysis. Our framework, which is an extension of the PIDX framework, achieves state of the art disk usage and I/O performance regardless of resolution of the data, regions of interest, and the number of processes that generated the data. We demonstrate the scalability and efficiency of our framework using the Uintah and S3D large-scale combustion codes on the Mira and Edison supercomputers.", "citation": "Citations (4)", "year": "2014", "departments": ["University of Utah", "University of Utah", "Lawrence Livermore National Laboratory", "University of Utah", "University of Utah"], "conf": "sc", "authors": ["Sidharth Kumar.....http://dblp.org/pers/hd/k/Kumar:Sidharth", "John Edwards.....http://dblp.org/pers/hd/e/Edwards:John", "Peer-Timo Bremer.....http://dblp.org/pers/hd/b/Bremer:Peer=Timo", "Aaron Knoll.....http://dblp.org/pers/hd/k/Knoll:Aaron", "Cameron Christensen.....http://dblp.org/pers/hd/c/Christensen:Cameron", "Venkatram Vishwanath.....http://dblp.org/pers/hd/v/Vishwanath:Venkatram", "Philip H. Carns.....http://dblp.org/pers/hd/c/Carns:Philip_H=", "John A. Schmidt.....http://dblp.org/pers/hd/s/Schmidt:John_A=", "Valerio Pascucci.....http://dblp.org/pers/hd/p/Pascucci:Valerio"], "pages": 11}