{"title": "Complete yet practical search for minimal query reformulations under constraints.", "fields": ["rewriting", "chase", "joins", "semantic query", "view"], "abstract": "We revisit the Chase&Backchase (C&B) algorithm for query reformulation under constraints, which provides a uniform solution to such particular-case problems as view-based rewriting under constraints, semantic query optimization, and physical access path selection in query optimization. For an important class of queries and constraints, C&B has been shown to be complete, i.e. guaranteed to find all (join-)minimal reformulations under constraints. C&B is based on constructing a canonical rewriting candidate called a universal plan, then inspecting its exponentially many sub-queries in search for minimal reformulations, essentially removing redundant joins in all possible ways. This inspection involves chasing the subquery. Because of the resulting exponentially many chases, the conventional wisdom has held that completeness is a concept of mainly theoretical interest. We show that completeness can be preserved at practically relevant cost by introducing Prov-C&B, a novel reformulation algorithm that instruments the chase to maintain provenance information connecting the joins added during the chase to the universal plan subqueries responsible for adding these joins. This allows it to directly \"read off\" the minimal reformulations from the result of a single chase of the universal plan, saving exponentially many chases of its subqueries. We exhibit natural scenarios yielding speedups of over two orders of magnitude between the execution of the best view-based rewriting found by a commercial query optimizer and that of the best rewriting found by Prov-C&B (which the optimizer misses because of limited reasoning about constraints).", "citation": "Citations (14)", "year": "2014", "departments": ["Télécom ParisTech", "University of Paris-Sud", "University of California, San Diego", "University of California, San Diego"], "conf": "sigmod", "authors": ["Ioana Ileana.....http://dblp.org/pers/hd/i/Ileana:Ioana", "Bogdan Cautis.....http://dblp.org/pers/hd/c/Cautis:Bogdan", "Alin Deutsch.....http://dblp.org/pers/hd/d/Deutsch:Alin", "Yannis Katsis.....http://dblp.org/pers/hd/k/Katsis:Yannis"], "pages": 12}