{"title": "Stochastic information management for voltage regulation in smart distribution systems.", "fields": ["voltage regulation", "voltage optimisation", "partially observable markov decision process", "power flow study", "voltage regulator"], "abstract": "In this paper, we study distributed generation (DG) integration in smart grid, with a focus on the voltage regulation in smart distribution systems. To ensure the operation of a smart distribution system at an acceptable voltage level, voltage regulators are deployed at some strategic locations for voltage control. The two-way communication functionality of the smart distribution system is leveraged such that the voltage regulators are coordinated by a distribution substation. Based on the mea- surement reports from remote terminal units (RTUs) deployed at DG unit and load connection points, stochastic information management is performed by the distribution substation to address the randomness in renewable power generation and load demand. In this paper, we formulate a voltage regulation problem in the smart distribution system based on power flow analysis, while taking into account communication delays. We show that the problem can be represented as a partially observed Markov decision process (POMDP). Since voltage regulation is performed at a relatively low frequency to avoid excessive wear and tear on the voltage regulators, a large amount of measurements should be reported by the RTUs and processed by the distribution substation for optimal voltage regulation. In order to reduce the communication and computational overhead, we further investigate the voltage regulation problem and mathematically prove that a relatively small amount of information is sufficient for the distribution substation to make an optimal decision. The theoretical results are evaluated based on a case study of IEEE 13-bus test system with real DG power generation and demand data. I. INTRODUCTION", "citation": "Citations (8)", "departments": ["University of Waterloo", "United Arab Emirates University", "University of Waterloo"], "authors": ["Hao Liang.....http://dblp.org/pers/hd/l/Liang:Hao", "Atef Abdrabou.....http://dblp.org/pers/hd/a/Abdrabou:Atef", "Weihua Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Weihua"], "conf": "infocom", "year": "2014", "pages": 9}