{"title": "Secure cloud storage meets with secure network coding.", "fields": ["verifiable secret sharing", "secure two party computation", "computer network", "cloud computing", "cloud computing security", "linear network coding", "cloud storage", "universal composability"], "abstract": "This paper reveals an intrinsic relationship between secure cloud storage and secure network coding for the first time. Secure cloud storage was proposed only recently while secure network coding has been studied for more than ten years. Although the two areas are quite different in their nature and are studied independently, we show how to construct a secure cloud storage protocol given any secure network coding protocol. This gives rise to a systematic way to construct secure cloud storage protocols. Our construction is secure under a definition which captures the real world usage of the cloud storage. Furthermore, we propose two specific secure cloud storage protocols based on two recent secure network coding protocols. In particular, we obtain the first publicly verifiable secure cloud storage protocol in the standard model. We also enhance the proposed generic construction to support user anonymity and third-party public auditing, which both have received considerable attention recently. Finally, we prototype the newly proposed protocol and evaluate its performance. Experimental results validate the effectiveness of the protocol.", "citation": "Citations (18)", "departments": ["Shenzhen University", "Chongqing University", "Stony Brook University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Chongqing University", "Stony Brook University", "The Chinese University of Hong Kong"], "authors": ["Fei Chen.....http://dblp.org/pers/hd/c/Chen_0003:Fei", "Tao Xiang.....http://dblp.org/pers/hd/x/Xiang:Tao", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan", "Sherman S. M. Chow.....http://dblp.org/pers/hd/c/Chow:Sherman_S=_M="], "conf": "infocom", "year": "2014", "pages": 9}