{"title": "DAWN: Defending against wormhole attacks in wireless network coding systems.", "fields": ["network packet", "countermeasure", "linear network coding", "wireless wan", "wi fi protected setup"], "abstract": "Network coding has been shown to be an effective approach to improve the wireless system performance. However, many security issues impede its wide deployment in practice. Besides the well-studied pollution attacks, there is another severe threat, that of wormhole attacks, which undermines the performance gain of network coding. Since the underlying characteristics of network coding systems are distinctly different from traditional wireless networks, the impact of wormhole attacks and countermeasures are generally unknown. In this paper, we quantify wormholes’ devastating harmful impact on network coding system performance through experiments. Then we propose DAWN, a Distributed detection Algorithm against Wormhole in wireless Network coding systems, by exploring the change of the flow directions of the innovative packets caused by wormholes. We rigorously prove that DAWN guarantees a good lower bound of successful detection rate. We perform analysis on the resistance of DAWN against collusion attacks. We find that the robustness depends on the node density in the network, and prove a necessary condition to achieve collusion-resistance. DAWN does not rely on any location information, global synchronization assumptions or special hardware/middleware. It is only based on the local information that can be obtained from regular network coding protocols, and thus does not introduce any overhead by extra test messages. Extensive experimental results have verified the effectiveness and the efficiency of DAWN.", "citation": "Citations (5)", "departments": ["Oklahoma State University–Stillwater", "Oklahoma State University–Stillwater", "Nanjing University", "Oklahoma State University–Stillwater"], "authors": ["Shiyu Ji.....http://dblp.org/pers/hd/j/Ji:Shiyu", "Tingting Chen.....http://dblp.org/pers/hd/c/Chen:Tingting", "Sheng Zhong.....http://dblp.org/pers/hd/z/Zhong:Sheng", "Subhash C. Kak.....http://dblp.org/pers/hd/k/Kak:Subhash_C="], "conf": "infocom", "year": "2014", "pages": 9}