{"title": "Mining novelty-seeking trait across heterogeneous domains.", "fields": ["crowds", "targeted advertising", "embodied cognition", "novelty seeking", "trait"], "abstract": "An incisive understanding of personal psychological traits is not only essential to many scientific disciplines, but also has a profound business impact on online recommendation. Recent studies in psychology suggest that novelty-seeking trait is highly related to consumer behavior. In this paper, we focus on understanding individual novelty-seeking trait embodied at different levels and across heterogeneous domains. Unlike the questionnaire-based methods widely adopted in the past, we first present a computational framework, Novel Seeking Model (NSM), for exploring the novelty-seeking trait implied by observable activities. Then, we explore the novelty-seeking trait in two heterogeneous domains: check-in behavior in location based social networks, which reflects mobility patterns in the physical world, and online shopping behavior on e-commerce sites, which reflects consumption concepts in economic activities. To demonstrate the effectiveness of NSM, we conducted extensive experiments, with a large dataset covering the two-domain activities for hundreds of thousands of individuals. Our results suggest that NSM offers a powerful paradigm for 1) presenting an effective measurement of a personality trait that can explicitly explain the deviation of individuals from the habits of individuals and crowds; 2) uncovering the correlation of novelty-seeking trait at different levels and across heterogeneous domains. The proposed method provides emerging implications for personalized cross-domain recommendation and targeted advertising.", "citation": "Citations (21)", "departments": ["University of Science and Technology of China", "Microsoft", "University of Science and Technology of China", "Microsoft"], "authors": ["Fuzheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Fuzheng", "Nicholas Jing Yuan.....http://dblp.org/pers/hd/y/Yuan:Nicholas_Jing", "Defu Lian.....http://dblp.org/pers/hd/l/Lian:Defu", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing"], "conf": "www", "year": "2014", "pages": 12}