{"title": "Active hashing with joint data example and tag selection.", "fields": ["feature hashing", "dynamic perfect hashing", "locality sensitive hashing", "universal hashing", "open addressing"], "abstract": "Similarity search is an important problem in many large scale applications such as image and text retrieval. Hashing method has become popular for similarity search due to its fast search speed and low storage cost. Recent research has shown that hashing quality can be dramatically improved by incorporating supervised information, e.g. semantic tags/labels, into hashing function learning. However, most existing supervised hashing methods can be regarded as passive methods, which assume that the labeled data are provided in advance. But in many real world applications, such supervised information may not be available.   This paper proposes a novel active hashing approach, Active Hashing with Joint Data Example and Tag Selection (AH-JDETS), which actively selects the most informative data examples and tags in a joint manner for hashing function learning. In particular, it first identifies a set of informative data examples and tags for users to label based on the selection criteria that both the data examples and tags should be most uncertain and dissimilar with each other. Then this labeled information is combined with the unlabeled data to generate an effective hashing function.   An iterative procedure is proposed for learning the optimal hashing function and selecting the most informative data examples and tags. Extensive experiments on four different datasets demonstrate that AH-JDETS achieves good performance compared with state-of-the-art supervised hashing methods but requires much less labeling cost, which overcomes the limitation of passive hashing methods. Furthermore, experimental results also indicate that the joint active selection approach outperforms a random (non-active) selection method and active selection methods only focusing on either data examples or tags.", "citation": "Citations (10)", "departments": ["Purdue University", "Purdue University", "Purdue University", "Purdue University"], "authors": ["Qifan Wang.....http://dblp.org/pers/hd/w/Wang:Qifan", "Luo Si.....http://dblp.org/pers/hd/s/Si:Luo", "Zhiwei Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhiwei", "Ning Zhang.....http://dblp.org/pers/hd/z/Zhang:Ning"], "conf": "sigir", "year": "2014", "pages": 10}