{"title": "RetroDepth: 3D silhouette sensing for high-precision input on and above physical surfaces.", "fields": ["stylus", "computer graphics", "silhouette", "video tracking", "gesture recognition"], "abstract": "We present RetroDepth, a new vision-based system for accurately sensing the 3D silhouettes of hands, styluses, and other objects, as they interact on and above physical surfaces. Our setup is simple, cheap, and easily reproducible, comprising of two infrared cameras, diffuse infrared LEDs, and any off-the-shelf retro-reflective material. The retro-reflector aids image segmentation, creating a strong contrast between the surface and any object in proximity. A new highly efficient stereo matching algorithm precisely estimates the 3D contours of interacting objects and the retro-reflective surfaces. A novel pipeline enables 3D finger, hand and object tracking, as well as gesture recognition, purely using these 3D contours. We demonstrate high-precision sensing, allowing robust disambiguation between a finger or stylus touching, pressing or interacting above the surface. This allows many interactive scenarios that seamlessly mix together freehand 3D interactions with touch, pressure and stylus input. As shown, these rich modalities of input are enabled on and above any retro-reflective surface, including custom \"physical widgets\" fabricated by users. We compare our system with Kinect and Leap Motion, and conclude with limitations and future work.", "citation": "Citations (19)", "year": "2014", "departments": ["Newcastle University", "Microsoft", "University of St Andrews", "Microsoft", "Microsoft"], "conf": "chi", "authors": ["David Kim.....http://dblp.org/pers/hd/k/Kim:David", "Shahram Izadi.....http://dblp.org/pers/hd/i/Izadi:Shahram", "Jakub Dostal.....http://dblp.org/pers/hd/d/Dostal:Jakub", "Christoph Rhemann.....http://dblp.org/pers/hd/r/Rhemann:Christoph", "Cem Keskin.....http://dblp.org/pers/hd/k/Keskin:Cem", "Christopher Zach.....http://dblp.org/pers/hd/z/Zach:Christopher", "Jamie Shotton.....http://dblp.org/pers/hd/s/Shotton:Jamie", "Timothy A. Large.....http://dblp.org/pers/hd/l/Large:Timothy_A=", "Steven Bathiche.....http://dblp.org/pers/hd/b/Bathiche:Steven", "Matthias Nießner.....http://dblp.org/pers/hd/n/Nie=szlig=ner:Matthias", "D. Alex Butler.....http://dblp.org/pers/hd/b/Butler:D=_Alex", "Sean Ryan Fanello.....http://dblp.org/pers/hd/f/Fanello:Sean_Ryan", "Vivek Pradeep.....http://dblp.org/pers/hd/p/Pradeep:Vivek"], "pages": 10}