{"title": "Keyword-based correlated network computation over large social media.", "fields": ["clustering coefficient", "two graph", "tree", "social media", "shortest path problem"], "abstract": "Recent years have witnessed an unprecedented proliferation of social media, e.g., millions of blog posts, micro-blog posts, and social networks on the Internet. This kind of social media data can be modeled in a large graph where nodes represent the entities and edges represent relationships between entities of the social media. Discovering keyword-based correlated networks of these large graphs is an important primitive in data analysis, from which users can pay more attention about their concerned information in the large graph. In this paper, we propose and define the problem of keyword-based correlated network computation over a massive graph. To do this, we first present a novel tree data structure that only maintains the shortest path of any two graph nodes, by which the massive graph can be equivalently transformed into a tree data structure for addressing our proposed problem. After that, we design efficient algorithms to build the transformed tree data structure from a graph offline and compute the γ-bounded keyword matched subgraphs based on the pre-built tree data structure on the fly. To further improve the efficiency, we propose weighted shingle-based approximation approaches to measure the correlation among a large number of γ-bounded keyword matched subgraphs. At last, we develop a merge-sort based approach to efficiently generate the correlated networks. Our extensive experiments demonstrate the efficiency of our algorithms on reducing time and space cost. The experimental results also justify the effectiveness of our method in discovering correlated networks from three real datasets.", "citation": "Citations (5)", "departments": ["Swinburne University of Technology", "Swinburne University of Technology", "Swinburne University of Technology"], "authors": ["Jianxin Li.....http://dblp.org/pers/hd/l/Li:Jianxin", "Chengfei Liu.....http://dblp.org/pers/hd/l/Liu:Chengfei", "Md. Saiful Islam.....http://dblp.org/pers/hd/i/Islam_0003:Md=_Saiful"], "conf": "icde", "year": "2014", "pages": 12}