{"title": "How social Q&A sites are changing knowledge sharing in open source software communities.", "fields": ["knowledge sharing", "popularity", "reputation", "mailing list", "chart"], "abstract": "Historically, mailing lists have been the preferred means for coordinating development and user support activities. With the emergence and popularity growth of social Q&A sites such as the StackExchange network (e.g., StackOverflow), this is beginning to change. Such sites offer different socio-technical incentives to their participants than mailing lists do, e.g., rich web environments to store and manage content collaboratively, or a place to showcase their knowledge and expertise more vividly to peers or potential recruiters. A key difference between StackExchange and mailing lists is gamification, i.e., StackExchange participants compete to obtain reputation points and badges. In this paper, we use a case study of R (a widely-used tool for data analysis) to investigate how mailing list participation has evolved since the launch of StackExchange. Our main contribution is the assembly of a joint data set from the two sources, in which participants in both the texttt{r-help} mailing list and StackExchange are identifiable. This permits their activities to be linked across the two resources and also over time. With this data set we found that user support activities show a strong shift away from texttt{r-help}. In particular, mailing list experts are migrating to StackExchange, where their behaviour is different. First, participants active both on texttt{r-help} and on StackExchange are more active than those who focus exclusively on only one of the two. Second, they provide faster answers on StackExchange than on texttt{r-help}, suggesting they are motivated by the emph{gamified} environment. To our knowledge, our study is the first to directly chart the changes in behaviour of specific contributors as they migrate into gamified environments, and has important implications for knowledge management in software engineering.", "citation": "Citations (121)", "departments": ["Eindhoven University of Technology", "Eindhoven University of Technology", "University of California, Davis", "University of California, Davis"], "authors": ["Bogdan Vasilescu.....http://dblp.org/pers/hd/v/Vasilescu:Bogdan", "Alexander Serebrenik.....http://dblp.org/pers/hd/s/Serebrenik:Alexander", "Premkumar T. Devanbu.....http://dblp.org/pers/hd/d/Devanbu:Premkumar_T=", "Vladimir Filkov.....http://dblp.org/pers/hd/f/Filkov:Vladimir"], "conf": "cscw", "year": "2014", "pages": 13}