{"title": "Let's talk about it: evaluating contributions through discussion in GitHub.", "fields": ["social media", "social computing", "correctness", "project management", "software"], "abstract": "Open source software projects often rely on code contributions from a wide variety of developers to extend the capabilities of their software. Project members evaluate these contributions and often engage in extended discussions to decide whether to integrate changes. These discussions have important implications for project management regarding new contributors and evolution of project requirements and direction. We present a study of how developers in open work environments evaluate and discuss pull requests, a primary method of contribution in GitHub, analyzing a sample of extended discussions around pull requests and interviews with GitHub developers. We found that developers raised issues around contributions over both the appropriateness of the problem that the submitter attempted to solve and the correctness of the implemented solution. Both core project members and third-party stakeholders discussed and sometimes implemented alternative solutions to address these issues. Different stakeholders also influenced the outcome of the evaluation by eliciting support from different communities such as dependent projects or even companies. We also found that evaluation outcomes may be more complex than simply acceptance or rejection. In some cases, although a submitter's contribution was rejected, the core team fulfilled the submitter's technical goals by implementing an alternative solution. We found that the level of a submitter's prior interaction on a project changed how politely developers discussed the contribution and the nature of proposed alternative solutions.", "citation": "Citations (78)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Jason Tsay.....http://dblp.org/pers/hd/t/Tsay:Jason", "Laura Dabbish.....http://dblp.org/pers/hd/d/Dabbish:Laura", "James D. Herbsleb.....http://dblp.org/pers/hd/h/Herbsleb:James_D="], "conf": "sigsoft", "year": "2014", "pages": 11}