{"title": "A comprehensive study of main-memory partitioning and its application to large-scale comparison- and radix-sort.", "fields": ["radix sort", "multi core processor", "sorting algorithm", "radix", "memory hierarchy"], "abstract": "Analytical database systems can achieve high throughput main-memory query execution by being aware of the dynamics of highly-parallel modern hardware. Such systems rely on partitioning to cluster or divide data into smaller pieces and thus achieve better parallelism and memory locality. This paper considers a comprehensive collection of variants of main-memory partitioning tuned for various layers of the memory hierarchy. We revisit the pitfalls of in-cache partitioning, and utilizing the crucial performance factors, we introduce new variants for partitioning out-of-cache. Besides non-in-place variants where linear extra space is used, we introduce large-scale in-place variants, and propose NUMA-aware partitioning that guarantees locality on multiple processors. Also, we make range partitioning comparably fast with hash or radix, by designing a novel cache-resident index to compute ranges. All variants are combined to build three NUMA-aware sorting algorithms: a stable LSB radix-sort; an in-place MSB radix-sort using different variants across memory layers; and a comparison-sort utilizing wide-fanout range partitioning and SIMD-optimal in-cache sorting. To the best of our knowledge, all three are the fastest to date on billion-scale inputs for both dense and sparse key domains. As shown for sorting, our work can serve as a tool for building other operations (e.g., join, aggregation) by combining the most suitable variants that best meet the design goals.", "citation": "Citations (37)", "year": "2014", "departments": ["Columbia University", "Columbia University"], "conf": "sigmod", "authors": ["Orestis Polychroniou.....http://dblp.org/pers/hd/p/Polychroniou:Orestis", "Kenneth A. Ross.....http://dblp.org/pers/hd/r/Ross:Kenneth_A="], "pages": 12}