{"title": "3D stacking of high-performance processors.", "fields": ["stacking", "electronic circuit", "exploit", "throughput", "power density"], "abstract": "In most 3D work to date, people have looked at two situations: 1) a case in which power density is not a problem, and the parts of a processor and/or entire processors can be stacked atop each other, and 2) a case in which power density is limited, and storage is stacked atop processors. In this paper, we consider the case in which power density is a limitation, yet we stack processors atop processors. We also will discuss some of the physical limitations today that render many of the good ideas presented in other work impractical, and what would be required in the technology to make them feasible. In the high-performance regime, circuits are not designed to be “power efficient;” they're designed to be fast. In power-efficient design, the speed and power of a processor should be nearly proportional. In the high-performance regime, the frequency is (ever progressingly) sublinear in power. Thus, when the power density is constrained - as it is in high-performance machines, there may be opportunities to selectively exploit parallelism in workloads by running processor-on-processor systems at the same power, yet at much greater than half speed.", "citation": "Citations (13)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Philip G. Emma.....http://dblp.org/pers/hd/e/Emma:Philip_G=", "Alper Buyuktosunoglu.....http://dblp.org/pers/hd/b/Buyuktosunoglu:Alper", "Michael B. Healy.....http://dblp.org/pers/hd/h/Healy:Michael_B=", "Krishnan Kailas.....http://dblp.org/pers/hd/k/Kailas:Krishnan", "Valentin Puente.....http://dblp.org/pers/hd/p/Puente:Valentin", "Roy Yu.....http://dblp.org/pers/hd/y/Yu:Roy", "Allan Hartstein.....http://dblp.org/pers/hd/h/Hartstein:Allan", "Pradip Bose.....http://dblp.org/pers/hd/b/Bose:Pradip", "Jaime H. Moreno.....http://dblp.org/pers/hd/m/Moreno:Jaime_H="], "conf": "hpca", "year": "2014", "pages": 12}