{"title": "Semantic Data Representation for Improving Tensor Factorization.", "fields": ["semantic data model", "fold", "recommender system", "ambiguity", "merge"], "abstract": "Predicting human activities is important for improving recommender systems or analyzing social relationships among users. Those human activities are usually represented as multi-object relationships (e.g. user's tagging activities for items or user's tweeting activities at some locations). Since multi-object relationships are naturally represented as a tensor, tensor factorization is becoming more important for predicting users' possible activities. However, its prediction accuracy is weak for ambiguous and/or sparsely observed objects. Our solution, Semantic data Representation for Tensor Factorization (SRTF), tackles these problems by incorporating semantics into tensor factorization based on the following ideas: (1) It first links objects to vocabularies/taxonomies and resolves the ambiguity caused by objects that can be used for multiple purposes. (2) It next links objects to composite classes that merge classes in different kinds of vocabularies/taxonomies (e.g. classes in vocabularies for movie genres and those for directors) to avoid low prediction accuracy caused by rough-grained semantics. (3) It then lifts sparsely observed objects into their classes to solve the sparsity problem for rarely observed objects. To the best of our knowledge, this is the first study that leverages semantics to inject expert knowledge into tensor factorization. Experiments show that SRTF achieves up to 10% higher accuracy than state-of-the-art methods.", "citation": "Citations (9)", "departments": ["Nippon Telegraph and Telephone", "Nippon Telegraph and Telephone", "Nippon Telegraph and Telephone", "Rensselaer Polytechnic Institute", "NTT Software In ... , Tokyo, Japan"], "authors": ["Makoto Nakatsuji.....http://dblp.org/pers/hd/n/Nakatsuji:Makoto", "Yasuhiro Fujiwara.....http://dblp.org/pers/hd/f/Fujiwara:Yasuhiro", "Hiroyuki Toda.....http://dblp.org/pers/hd/t/Toda:Hiroyuki", "Hiroshi Sawada.....http://dblp.org/pers/hd/s/Sawada:Hiroshi", "Jinguang Zheng.....http://dblp.org/pers/hd/z/Zheng:Jinguang", "James Alexander Hendler.....http://dblp.org/pers/hd/h/Hendler:James_Alexander"], "conf": "aaai", "year": "2014", "pages": 9}