{"title": "Exploiting mobility in proportional fair cellular scheduling: Measurements and algorithms.", "fields": ["channel state information", "round robin scheduling", "channel allocation schemes", "proportionally fair", "exploit", "cellular network", "scheduling", "throughput", "maximum throughput scheduling"], "abstract": "Proportional Fair (PF) scheduling algorithms are the  de facto  standard in cellular networks. They exploit the users' channel state diversity (induced by fast-fading) and are optimal for stationary channel state distributions and an infinite time-horizon. However,  mobile users  experience a nonstationary channel, due to  slow-fading  (on the order of seconds), and are associated with base stations for short periods. Hence,  we develop the Predictive Finite-horizon PF Scheduling  ((PF) 2 S)  Framework that exploits mobility . We present  extensive channel measurement results  from a 3G network and characterize mobility-induced channel state trends. We show that a user's channel state is highly reproducible and leverage that to develop a  data rate prediction  mechanism. We then present a few  channel allocation estimation algorithms  that exploit the prediction mechanism. Our  trace-based simulations  consider instances of the ((PF) 2 S) Framework composed of combinations of prediction and channel allocation estimation algorithms. They indicate that the framework can increase the throughput by 15%-55% compared to traditional PF schedulers, while improving fairness.", "citation": "Citations (59)", "departments": ["Columbia University", "AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs", "Columbia University", "AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "authors": ["Robert Margolies.....http://dblp.org/pers/hd/m/Margolies:Robert", "Ashwin Sridharan.....http://dblp.org/pers/hd/s/Sridharan:Ashwin", "Vaneet Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Vaneet", "Rittwik Jana.....http://dblp.org/pers/hd/j/Jana:Rittwik", "N. K. Shankaranarayanan.....http://dblp.org/pers/hd/s/Shankaranarayanan:N=_K=", "Vinay A. Vaishampayan.....http://dblp.org/pers/hd/v/Vaishampayan:Vinay_A=", "Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil"], "conf": "infocom", "year": "2014", "pages": 9}