{"title": "AI-MIX: Using Automated Planning to Steer Human Workers Towards Better Crowdsourced Plans.", "fields": ["crowdsourcing", "scheduling", "computation", "subclass", "management science"], "abstract": "One subclass of human computation applications are those directed at tasks that involve planning (e.g. tour planning) and scheduling (e.g. conference scheduling). Interestingly, work on these systems shows that even primitive forms of automated oversight on the human contributors helps in significantly improving the effectiveness of the humans/crowd. In this paper, we argue that the automated oversight used in these systems can be viewed as a primitive automated planner, and that there are several opportunities for more sophisticated automated planning in effectively steering the crowd. Straightforward adaptation of current planning technology is however hampered by the mismatch between the capabilities of human workers and automated planners. We identify and partially address two important challenges that need to be overcome before such adaptation of planning technology can occur: (i) interpreting inputs of the human workers (and the requester) and (ii) steering or critiquing plans produced by the human workers, armed only with incomplete domain and preference models. To these ends, we describe the implementation of AI-MIX, a tour plan generation system that uses automated checks and alerts to improve the quality of plans created by human workers; and present a preliminary evaluation of the effectiveness of steering provided by automated planning.", "citation": "Citations (10)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Lydia Manikonda.....http://dblp.org/pers/hd/m/Manikonda:Lydia", "Tathagata Chakraborti.....http://dblp.org/pers/hd/c/Chakraborti:Tathagata", "Sushovan De.....http://dblp.org/pers/hd/d/De:Sushovan", "Kartik Talamadupula.....http://dblp.org/pers/hd/t/Talamadupula:Kartik", "Subbarao Kambhampati.....http://dblp.org/pers/hd/k/Kambhampati:Subbarao"], "conf": "aaai", "year": "2014", "pages": 6}