{"title": "Throughput-delay tradeoff in mobile ad hoc networks with correlated mobility.", "fields": ["mobile ad hoc network", "scaling", "mobility model", "throughput", "optimized link state routing protocol"], "abstract": "Reference Point Group Mobility (RPGM) has been a practical mobility model used to efficiently capture the potential correlation among mobile nodes in many important applications. In this paper, we explore the throughput-delay tradeoff in a mobile ad hoc network (MANET) operating under the RPGM model and also a general setting of node moving speed. In par- ticular, we consider a MANET with unit area and n nodes being divided evenly into Θ(n α ) groups, α ∈ (0, 1), where the center of each group moves according to a random direction model with speed no more than υ ∈ (0, 1). We determine the regions of per node throughput, average delay and their tradeoffs that can be achieved (in order sense) in such a network. For the regime of υ =0 , we first prove that the per node throughput capacity is Θ(n −α/2 ), and then develop a routing scheme to achieve this capacity, resulting an average delay of Θ(max{n 1/2 ,n 1−α }) for any α ∈ (0, 1). Regarding the regime of υ> 0, we prove that the per node throughput capacity there can be improved to Θ(1), which is achievable by adopting a new routing scheme with an average delay of Θ(max{n 1−α ,n α/2 /υ}) for υ = o(1) and Θ(n) for υ =Θ (1). The results in this paper help us to have a deep understanding on the fundamental performance scaling laws and also enable an efficient throughput-delay tradeoff to be achieved in MANETs with correlated mobility.", "citation": "Citations (4)", "departments": ["Tohoku University", "Tohoku University", "Tohoku University", "Xidian University", "Future University Hakodate"], "authors": ["Jiajia Liu.....http://dblp.org/pers/hd/l/Liu:Jiajia", "Hiroki Nishiyama.....http://dblp.org/pers/hd/n/Nishiyama:Hiroki", "Nei Kato.....http://dblp.org/pers/hd/k/Kato:Nei", "Jianfeng Ma.....http://dblp.org/pers/hd/m/Ma:Jianfeng", "Xiaohong Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaohong"], "conf": "infocom", "year": "2014", "pages": 9}