{"title": "Links between Truncated Differential and Multidimensional Linear Properties of Block Ciphers and Underlying Attack Complexities.", "fields": ["combinatorics", "differential cryptanalysis", "linear cryptanalysis", "known plaintext attack", "block cipher", "discrete mathematics", "mathematics", "truncated differential cryptanalysis"], "abstract": "The mere number of various apparently different statistical attacks on block ciphers has raised the question about their relationships which would allow to classify them and determine those that give essentially complementary information about the security of block ciphers. While mathematical links between some statistical attacks have been derived in the last couple of years, the important link between general truncated differential and multidimensional linear attacks has been missing. In this work we close this gap. The new link is then exploited to relate the complexities of chosen-plaintext and known-plaintext distinguishing attacks of differential and linear types, and further, to explore the relations between the key-recovery attacks. Our analysis shows that a statistical saturation attack is the same as a truncated differential attack, which allows us, for the first time, to provide a justifiable analysis of the complexity of the statistical saturation attack and discuss its validity on 24 rounds of the PRESENT block cipher. By studying the data, time and memory complexities of a multidimensional linear key-recovery attack and its relation with a truncated differential one, we also show that in most cases a known-plaintext attack can be transformed into a less costly chosen-plaintext attack. In particular, we show that there is a differential attack in the chosen-plaintext model on 26 rounds of PRESENT with less memory complexity than the best previous attack, which assumes known plaintext. The links between the statistical attacks discussed in this paper give further examples of attacks where the method used to sample the data required by the statistical test is more differentiating than the method used for finding the distinguishing property.", "citation": "Citations (29)", "year": "2014", "departments": ["Aalto University", "Aalto University"], "conf": "eurocrypt", "authors": ["Céline Blondeau.....http://dblp.org/pers/hd/b/Blondeau:C=eacute=line", "Kaisa Nyberg.....http://dblp.org/pers/hd/n/Nyberg:Kaisa"], "pages": 18}