{"title": "Trendspedia: An Internet observatory for analyzing and visualizing the evolving web.", "fields": ["conformity", "popularity", "electronic publishing", "encyclopedia", "data analysis"], "abstract": "The popularity of social media services has been innovating the way of information acquisition in modern society. Meanwhile, mass information is generated in every single day. To extract useful knowledge, much effort has been invested in analyzing social media contents, e.g., (emerging) topic discovery. With these findings, however, users may still find it hard to obtain knowledge of great interest in conformity with their preference. In this paper, we present a novel system which brings proper context to continuously incoming social media contents, such that mass information can be indexed, organized and analyzed around Wikipedia entities. Four data analytics tools are employed in the system. Three of them aim to enrich each Wikipedia entity by analyzing the relevant contents while the other one builds an information network among the most relevant Wikipedia entities. With our system, users can easily pinpoint valuable information and knowledge they are interested in, as well as navigate to other closely related entities through the information network for further exploration.", "citation": "Citations (10)", "departments": ["National University of Singapore", "National University of Singapore", "Zhejiang University", "National University of Singapore", "National University of Singapore"], "authors": ["Wei Kang.....http://dblp.org/pers/hd/k/Kang:Wei", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H=", "Wei Chen.....http://dblp.org/pers/hd/c/Chen:Wei", "Xinyu Li.....http://dblp.org/pers/hd/l/Li:Xinyu", "Qiyue Song.....http://dblp.org/pers/hd/s/Song:Qiyue", "Chao Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao", "Feng Zhao.....http://dblp.org/pers/hd/z/Zhao:Feng", "Xiajuan Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiajuan"], "conf": "icde", "year": "2014", "pages": 4}