{"title": "Declarative cartography: In-database map generalization of geospatial datasets.", "fields": ["rendering", "geospatial analysis", "cartographic generalization", "information quality", "zoom"], "abstract": "Creating good maps is the challenge of map generalization. An important generalization method is selecting subsets of the data to be shown at different zoom-levels of a zoomable map, subject to a set of spatial constraints. Applying these constraints serves the dual purpose of increasing the information quality of the map and improving the performance of data transfer and rendering. Unfortunately, with current tools, users must explicitly specify which objects to show at each zoom level of their map, while keeping their application constraints implicit. This paper introduces a novel declarative approach to map generalization based on a language called CVL, the Cartographic Visualization Language. In contrast to current tools, users declare application constraints and object importance in CVL, while leaving the selection of objects implicit. In order to compute an explicit selection of objects, CVL scripts are translated into an algorithmic search task. We show how this translation allows for reuse of existing algorithms from the optimization literature, while at the same time supporting fully pluggable, user-defined constraints and object weight functions. In addition, we show how to evaluate CVL entirely inside a relational database. The latter allows users to seamlessly integrate storage of geospatial data with its transformation into map visualizations. In a set of experiments with a variety of real-world data sets, we find that CVL produces generalizations in reasonable time for off-line processing; furthermore, the quality of the generalizations is high with respect to the chosen objective function.", "citation": "Citations (3)", "departments": ["University of Copenhagen", "University of Copenhagen", "University of Copenhagen"], "authors": ["Pimin Konstantin Kefaloukos.....http://dblp.org/pers/hd/k/Kefaloukos:Pimin_Konstantin", "Marcos Antonio Vaz Salles.....http://dblp.org/pers/hd/s/Salles:Marcos_Antonio_Vaz", "Martin Zachariasen.....http://dblp.org/pers/hd/z/Zachariasen:Martin"], "conf": "icde", "year": "2014", "pages": 12}