{"title": "PS-TRUST: Provably secure solution for truthful double spectrum auctions.", "fields": ["provable security", "redistribution", "frequency allocation", "scarcity", "spectrum auction"], "abstract": "Truthful spectrum auctions have been extensively studied in recent years. Truthfulness makes bidders bid their true valuations, simplifying greatly the analysis of auctions. However, revealing one's true valuation causes severe privacy disclosure to the auctioneer and other bidders. To make things worse, previous work on secure spectrum auctions does not provide adequate security. In this paper, based on TRUST, we propose PS-TRUST, a provably secure solution for truthful double spectrum auctions. Besides maintaining the properties of truthfulness and special spectrum reuse of TRUST, PS-TRUST achieves provable security against semi-honest adversaries in the sense of cryptography. Specifically, PS-TRUST reveals nothing about the bids to anyone in the auction, except the auction result. To the best of our knowledge, PS-TRUST is the first provably secure solution for spectrum auctions. Furthermore, experimental results show that the computation and communication overhead of PS-TRUST is modest, and its practical applications are feasible. I. INTRODUCTION As the rapid development of wireless technologies, the scarcity of radio spectrum attracts more and more attention. Under the traditional static spectrum allocation scheme by government, the utilization of the radio spectrum is severely inefficient. Many spectrum channels are idle most of the time under their current owners, whereas ever-increasing new wireless users are starving for spectrum. Therefore, spectrum redistribution is highly significant for improving the overall spectrum utilization and thus alleviating the problem of spec- trum scarcity. Open markets for spectrum redistribution, such as Spectrum Bridge (13), have already appeared to provide services for buying, selling, and leasing idle spectrum. As a well-known approach to spectrum redistribution, spec- trum auctions are preferred by people for its fairness and allocation efficiency. In recent years, there have been exten- sive studies on spectrum auctions, most of which achieve truthfulness to make bidders reveal their true valuations of spectrum channels. However, revealing one's true valuation causes severe privacy disclosure. Literature (20) illustrated two vulnerabilities of truthful auctions, i.e. frauds of the insincere auctioneer, and bid-rigging between the auctioneer and the bidders, in which the auctioneer takes advantage of the knowledge of bidders' bids. Furthermore, when one bidder knows other bidders' bids after an auction, he will probably not bid his true valuation in repeated auctions. That is, an original truthful auction will probably become untruthful when repeated, due to the revelation of all bidders' bids in the", "citation": "Citations (12)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China"], "authors": ["Zhili Chen.....http://dblp.org/pers/hd/c/Chen:Zhili", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng", "Lu Li.....http://dblp.org/pers/hd/l/Li:Lu", "Wei Yang.....http://dblp.org/pers/hd/y/Yang_0011:Wei", "Haibo Miao.....http://dblp.org/pers/hd/m/Miao:Haibo", "Miaomiao Tian.....http://dblp.org/pers/hd/t/Tian:Miaomiao", "Fei Wang.....http://dblp.org/pers/hd/w/Wang:Fei"], "conf": "infocom", "year": "2014", "pages": 9}