{"title": "The limits of depth reduction for arithmetic formulas: it's all about the top fan-in.", "fields": ["homogeneous", "partial derivative", "electronic colloquium on computational complexity", "algebra", "combinatorics", "polynomial identity testing", "arithmetic circuit complexity", "discrete mathematics", "mathematics", "binary logarithm", "fan in", "arithmetic"], "abstract": "In recent years, a very exciting and promising method for proving lower bounds for arithmetic circuits has been proposed. This method combines the method of  depth reduction  developed in the works of Agrawal and Vinay[1], Koiran [11] and Tavenas [16], and the use of the shifted partial derivative complexity measure developed in the works of Kayal [9] and Gupta et al [5]. These results inspired a flurry of other beautiful results and strong lower bounds for various classes of arithmetic circuits, in particular a recent work of Kayal et al [10] showing superpolynomial lower bounds for  regular  arithmetic formulas via an  improved depth reduction  for these formulas. It was left as an intriguing question if these methods could prove superpolynomial lower bounds for general (homogeneous) arithmetic formulas, and if so this would indeed be a breakthrough in arithmetic circuit complexity. In this paper we study the power and limitations of depth reduction and shifted partial derivatives for arithmetic formulas. We do it via studying the class of depth 4 homogeneous arithmetic circuits. We show: (1) the first  superpolynomial lower bounds  for the class of homogeneous depth 4 circuits with top fan-in  o (log  n ). The core of our result is to show  improved depth reduction  for these circuits. This class of circuits has received much attention for the problem of polynomial identity testing. We give the first nontrivial lower bounds for these circuits for any top fan-in ≥ 2. (2) We show that improved depth reduction  is not possible  when the top fan-in is Ω(log  n ). In particular this shows that the depth reduction procedure of Koiran and Tavenas [11, 16] cannot be improved even for homogeneous formulas, thus strengthening the results of Fournier et al [3] who showed that depth reduction is tight for circuits, and answering some of the main open questions of [10, 3]. Our results in particular suggest that the method of improved depth reduction and shifted partial derivatives may not be powerful enough to prove superpolynomial lower bounds for (even homogeneous) arithmetic formulas.", "citation": "Citations (21)", "year": "2014", "departments": ["Rutgers University", "Rutgers University"], "conf": "stoc", "authors": ["Mrinal Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Mrinal", "Shubhangi Saraf.....http://dblp.org/pers/hd/s/Saraf:Shubhangi"], "pages": 10}