{"title": "AR-miner: mining informative reviews for developers from mobile app marketplace.", "fields": ["analytics", "android", "popularity", "topic model", "mobile device"], "abstract": "With the popularity of smartphones and mobile devices, mobile application (a.k.a. “app”) markets have been growing exponentially in terms of number of users and downloads. App developers spend considerable effort on collecting and exploiting user feedback to improve user satisfaction, but suffer from the absence of effective user review analytics tools. To facilitate mobile app developers discover the most “informative” user reviews from a large and rapidly increasing pool of user reviews, we present “AR-Miner” — a novel computational framework for App Review Mining, which performs comprehensive analytics from raw user reviews by (i) first extracting informative user reviews by filtering noisy and irrelevant ones, (ii) then grouping the informative reviews automatically using topic modeling, (iii) further prioritizing the informative reviews by an effective review ranking scheme, (iv) and finally presenting the groups of most “informative” reviews via an intuitive visualization approach. We conduct extensive experiments and case studies on four popular Android apps to evaluate AR-Miner, from which the encouraging results indicate that AR-Miner is effective, efficient and promising for app developers.", "citation": "Citations (220)", "departments": ["Nanyang Technological University", "Carnegie Mellon University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Ning Chen.....http://dblp.org/pers/hd/c/Chen:Ning", "Jialiu Lin.....http://dblp.org/pers/hd/l/Lin:Jialiu", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Boshen Zhang.....http://dblp.org/pers/hd/z/Zhang:Boshen"], "conf": "icse", "year": "2014", "pages": 12}