{"title": "Race detection for event-driven mobile applications.", "fields": ["queue", "concurrent computing", "android", "concurrency", "thread"], "abstract": "Mobile systems commonly support an event-based model of concurrent programming. This model, used in popular platforms such as Android, naturally supports mobile devices that have a rich array of sensors and user input modalities. Unfortunately, most existing tools for detecting concurrency errors of parallel programs focus on a thread-based model of concurrency. If one applies such tools directly to an event-based program, they work poorly because they infer false dependencies between unrelated events handled sequentially by the same thread.   In this paper we present a race detection tool named CAFA for event-driven mobile systems. CAFA uses the causality model that we have developed for the Android event-driven system. A novel contribution of our model is that it accounts for the causal order due to the event queues, which are not accounted for in past data race detectors. Detecting races based on low-level races between memory accesses leads to a large number of false positives. CAFA overcomes this problem by checking for races between high-level operations. We discuss our experience in using CAFA for finding and understanding a number of known and unknown harmful races in open-source Android applications.", "citation": "Citations (83)", "departments": ["University of Michigan", "Twitter", "University of Michigan", "University of Michigan", "Intel"], "authors": ["Chun-Hung Hsiao.....http://dblp.org/pers/hd/h/Hsiao:Chun=Hung", "Cristiano Pereira.....http://dblp.org/pers/hd/p/Pereira:Cristiano", "Jie Yu.....http://dblp.org/pers/hd/y/Yu:Jie", "Gilles Pokam.....http://dblp.org/pers/hd/p/Pokam:Gilles", "Satish Narayanasamy.....http://dblp.org/pers/hd/n/Narayanasamy:Satish", "Peter M. Chen.....http://dblp.org/pers/hd/c/Chen:Peter_M=", "Ziyun Kong.....http://dblp.org/pers/hd/k/Kong:Ziyun", "Jason Flinn.....http://dblp.org/pers/hd/f/Flinn:Jason"], "conf": "pldi", "year": "2014", "pages": 11}