{"title": "Trading robustness for maintainability: an empirical study of evolving c# programs.", "fields": ["restrict", "test case", "program analysis", "conditional entropy", "spearman s rank correlation coefficient"], "abstract": "Failed error propagation (FEP) is known to hamper software testing, yet it remains poorly understood. We introduce an information theoretic formulation of FEP that is based on measures of conditional entropy. This formulation considers the situation in which we are interested in the potential for an incorrect program state at statement s to fail to propagate to incorrect output. We define five metrics that differ in two ways: whether we only consider parts of the program that can be reached after executing s and whether we restrict attention to a single program path of interest .We give the results of experiments in which it was found that on average one in 10 tests suffered from FEP, earlier studies having shown that this figure can vary significantly between programs. The experiments also showed that our metrics are well-correlated with FEP. Our empirical study involved 30 programs, for which we executed a total of 7,140,000 test cases. The results reveal that the metrics differ in their performance but the Spearman rank correlation with failed error propagation is close to 0.95 for two of the metrics. These strong correlations in an experimental setting, in which all information about both FEP and conditional entropy is known, open up the possibility in the longer term of devising inexpensive information theory based metrics that allow us to minimise the effect of FEP.", "citation": "Citations (18)", "departments": ["Middlesex University", "University College London", "University College London", "Brunel University London", "University College London"], "authors": ["Nélio Cacho.....http://dblp.org/pers/hd/c/Cacho:N=eacute=lio", "Thiago César.....http://dblp.org/pers/hd/c/C=eacute=sar:Thiago", "Thomas Filipe.....http://dblp.org/pers/hd/f/Filipe:Thomas", "Eliezio Soares.....http://dblp.org/pers/hd/s/Soares:Eliezio", "Arthur Cassio.....http://dblp.org/pers/hd/c/Cassio:Arthur", "Rafael Souza.....http://dblp.org/pers/hd/s/Souza:Rafael", "Israel García.....http://dblp.org/pers/hd/g/Garc=iacute=a:Israel", "Eiji Adachi Barbosa.....http://dblp.org/pers/hd/b/Barbosa:Eiji_Adachi", "Alessandro Garcia.....http://dblp.org/pers/hd/g/Garcia:Alessandro"], "conf": "icse", "year": "2014", "pages": 12}