{"title": "Mining preconditions of APIs in large-scale code corpus.", "fields": ["source lines of code", "call site", "guard", "application programming interface", "formal specification"], "abstract": "Modern software relies on existing application programming interfaces (APIs) from libraries. Formal specifications for the APIs enable many software engineering tasks as well as help developers correctly use them. In this work, we mine large-scale repositories of existing open-source software to derive potential preconditions for API methods. Our key idea is that APIs’ preconditions would appear frequently in an ultra-large code corpus with a large number of API usages, while project-specific conditions will occur less frequently. First, we find all client methods invoking APIs. We then compute a control dependence relation from each call site and mine the potential conditions used to reach those call sites. We use these guard conditions as a starting point to automatically infer the preconditions for each API. We analyzed almost 120 million lines of code from SourceForge and Apache projects to infer preconditions for the standard Java Development Kit (JDK) library. The results show that our technique can achieve high accuracy with recall from 75–80% and precision from 82–84%. We also found 5 preconditions missing from human written specifications. They were all confirmed by a specification expert. In a user study, participants found 82% of the mined preconditions as a good starting point for writing specifications. Using our mining result, we also built a benchmark of more than 4,000 precondition-related bugs.", "citation": "Citations (21)", "departments": ["Iowa State University", "Iowa State University", "Iowa State University", "Iowa State University"], "authors": ["Hoan Anh Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Hoan_Anh", "Robert Dyer.....http://dblp.org/pers/hd/d/Dyer_0001:Robert", "Tien N. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tien_N=", "Hridesh Rajan.....http://dblp.org/pers/hd/r/Rajan:Hridesh"], "conf": "sigsoft", "year": "2014", "pages": 12}