{"title": "Menpo: A Comprehensive Platform for Parametric Image Alignment and Visual Deformable Models.", "fields": ["python", "os x", "active appearance model", "annotation", "parametric statistics"], "abstract": "The Menpo Project, hosted at http://www.menpo.io, is a BSD-licensed software platform providing a complete and comprehensive solution for annotating, building, fitting and evaluating deformable visual models from image data. Menpo is a powerful and flexible cross-platform framework written in Python that works on Linux, OS X and Windows. Menpo has been designed to allow for easy adaptation of Lucas-Kanade (LK) parametric image alignment techniques, and goes a step further in providing all the necessary tools for building and fitting state-of-the-art deformable models such as Active Appearance Models (AAMs), Constrained Local Models (CLMs) and regression-based methods (such as the Supervised Descent Method (SDM)). These methods are extensively used for facial point localisation although they can be applied to many other deformable objects. Menpo makes it easy to understand and evaluate these complex algorithms, providing tools for visualisation, analysis, and performance assessment. A key challenge in building deformable models is data annotation; Menpo expedites this process by providing a simple web-based annotation tool hosted at http://www.landmarker.io. The Menpo Project is thoroughly documented and provides extensive examples for all of its features. We believe the project is ideal for researchers, practitioners and students alike.", "citation": "Citations (68)", "departments": ["Imperial College London", "Imperial College London", "Imperial College London", "Imperial College London", "Imperial College London"], "authors": ["Joan Alabort-i-Medina.....http://dblp.org/pers/hd/a/Alabort=i=Medina:Joan", "Epameinondas Antonakos.....http://dblp.org/pers/hd/a/Antonakos:Epameinondas", "James Booth.....http://dblp.org/pers/hd/b/Booth:James", "Patrick Snape.....http://dblp.org/pers/hd/s/Snape:Patrick", "Stefanos Zafeiriou.....http://dblp.org/pers/hd/z/Zafeiriou:Stefanos"], "conf": "mm", "year": "2014", "pages": 4}