{"title": "Item Bidding for Combinatorial Public Projects.", "fields": ["complete information", "autonomous agent", "price of anarchy", "bidding", "welfare", "valuation", "payment"], "abstract": "Abstract   We analyze a simple mechanism for the Combinatorial Public Project Problem ( Cppp ). The problem asks to select  k  out of  m  available items, so as to maximize the social welfare for autonomous agents with combinatorial preferences (valuation functions) over subsets of items. The  Cppp  constitutes an abstract model for decision making by autonomous agents and has been shown to present severe computational hardness, in the design of tractable truthful approximation mechanisms. We study a non-truthful mechanism that is, however, practically relevant to multi-agent environments, by virtue of its natural simplicity. The mechanism employs an item bidding interface, where every agent issues a separate bid for the inclusion of each distinct item in the outcome; the  k  items with the highest sums of bids are then chosen. As for the payment scheme, the agents are charged according to a direct adaptation of the VCG payment rule. For fairly expressive classes of the agents' valuation functions, we establish existence of socially optimal pure Nash equilibria, as well as strong equilibria, that are resilient to coordinated deviations of subsets of agents. Particularly with respect to pure Nash equilibria, we prove convergence of an iterative procedure. Subsequently, we derive worst-case bounds on the approximation of the optimum social welfare achieved in (strong) equilibrium by the mechanism. We show that the mechanism's performance improves with the number of agents that can coordinate their bids, and reaches half of the optimum welfare at strong equilibrium. Finally, we derive bounds on the mechanism's performance in Bayes–Nash equilibrium, under an incomplete information setting.", "citation": "Citations (1)", "departments": ["Athens University of Economics and Business", "University of Piraeus", "Athens University of Economics and Business", "Athens University of Economics and Business"], "authors": ["Evangelos Markakis.....http://dblp.org/pers/hd/m/Markakis:Evangelos", "Orestis Telelis.....http://dblp.org/pers/hd/t/Telelis:Orestis"], "conf": "aaai", "year": "2014", "pages": 7}