{"title": "Modeling web quality-of-experience on cellular networks.", "fields": ["signal strength", "data link", "quality of experience", "web navigation", "user experience design"], "abstract": "Recent studies have shown that web browsing is one of the most prominent cellular applications. It is therefore important for cellular network operators to understand how radio network characteristics (such as signal strength, handovers, load, etc.) influence users' web browsing Quality-of-Experience (web QoE). Understanding the relationship between web QoE and network characteristics is a pre-requisite for cellular network operators to detect when and where degraded network conditions actually impact web QoE. Unfortunately, cellular network operators do not have access to detailed server-side or client-side logs to directly measure web QoE metrics, such as abandonment rate and session length. In this paper, we first devise a machine-learning-based mechanism to infer web QoE metrics from network traces accurately. We then present a large-scale study characterizing the impact of network characteristics on web QoE using a month-long anonymized dataset collected from a major cellular network provider. Our results show that improving signal-to-noise ratio, decreasing load and reducing handovers can improve user experience. We find that web QoE is very sensitive to inter-radio-access-technology (IRAT) handovers. We further find that higher radio data link rate does not necessarily lead to better web QoE. Since many network characteristics are interrelated, we also use machine learning to accurately model the influence of radio network characteristics on user experience metrics. This model can be used by cellular network operators to prioritize the improvement of network factors that most influence web QoE.", "citation": "Citations (74)", "departments": ["Carnegie Mellon University", "AT&T Labs", "AT&T Labs", "AT&T Labs", "Carnegie Mellon University"], "authors": ["Athula Balachandran.....http://dblp.org/pers/hd/b/Balachandran:Athula", "Vaneet Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Vaneet", "Emir Halepovic.....http://dblp.org/pers/hd/h/Halepovic:Emir", "Jeffrey Pang.....http://dblp.org/pers/hd/p/Pang:Jeffrey", "Srinivasan Seshan.....http://dblp.org/pers/hd/s/Seshan:Srinivasan", "Shobha Venkataraman.....http://dblp.org/pers/hd/v/Venkataraman:Shobha", "He Yan.....http://dblp.org/pers/hd/y/Yan:He"], "conf": "mobicom", "year": "2014", "pages": 12}