{"title": "Joint power optimization of data center network and servers with correlation analysis.", "fields": ["traffic generation model", "openflow", "data center", "power optimization", "network traffic control"], "abstract": "Data center power optimization has recently received a great deal of research attention. For example, server consolidation has been demonstrated as one of the most effective energy saving methodologies. Likewise, traffic consolidation has also been recently proposed to save energy for data center networks (DCNs). However, current research on data center power optimization focuses on servers and DCN separately. As a result, the optimization results are often inferior, because server consolidation without considering the DCN may cause traffic congestion and thus degraded network performance. On the other hand, server consolidation may change the DCN topology, allowing new opportunities for energy savings. In this paper, we propose PowerNetS, a power optimization strategy that leverages workload correlation analysis to jointly minimize the total power consumption of servers and the DCN. The design of PowerNetS is based on the key observations that the workloads of different servers and DCN traffic flows do not peak at exactly the same time. Thus, more energy savings can be achieved if the workload correlations are considered in server and traffic consolidations. In addition, PowerNetS considers the DCN topology during server consolidation, which leads to less inter-server traffic and thus more energy savings and shorter network delays. We implement PowerNetS on a hardware testbed composed of 10 virtual switches configured with a production 48port OpenFlow switch and 6 servers. Our empirical results with Wikipedia, Yahoo!, and IBM traces demonstrate that PowerNetS can save up to 51.6% of energy for a data center. PowerNetS also outperforms two state-of-the-art baselines by 44.3% and 15.8% on energy savings, respectively. Our simulation results with 72 switches and 122 servers also show the superior energy efficiency of PowerNetS over the baselines.", "citation": "Citations (78)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Kuangyu Zheng.....http://dblp.org/pers/hd/z/Zheng:Kuangyu", "Xiaodong Wang.....http://dblp.org/pers/hd/w/Wang:Xiaodong", "Li Li.....http://dblp.org/pers/hd/l/Li:Li", "Xiaorui Wang.....http://dblp.org/pers/hd/w/Wang:Xiaorui"], "conf": "infocom", "year": "2014", "pages": 9}