{"title": "CONGA: distributed congestion-aware load balancing for datacenters.", "fields": ["exploit", "network virtualization", "price of anarchy", "clos network", "overlay"], "abstract": "We present the design, implementation, and evaluation of CONGA, a network-based distributed congestion-aware load balancing mechanism for datacenters. CONGA exploits recent trends including the use of regular Clos topologies and overlays for network virtualization. It splits TCP flows into flowlets, estimates real-time congestion on fabric paths, and allocates flowlets to paths based on feedback from remote switches. This enables CONGA to efficiently balance load and seamlessly handle asymmetry, without requiring any TCP modifications. CONGA has been implemented in custom ASICs as part of a new datacenter fabric. In testbed experiments, CONGA has 5x better flow completion times than ECMP even with a single link failure and achieves 2-8x better throughput than MPTCP in Incast scenarios. Further, the Price of Anarchy for CONGA is provably small in Leaf-Spine topologies; hence CONGA is nearly as effective as a centralized scheduler while being able to react to congestion in microseconds. Our main thesis is that datacenter fabric load balancing is best done in the network, and requires global schemes such as CONGA to handle asymmetry.", "citation": "Citations (235)", "departments": ["Cisco Systems, Inc.", "Cisco Systems, Inc.", "Cisco Systems, Inc.", "Cisco Systems, Inc.", "Cisco Systems, Inc."], "authors": ["Mohammad Alizadeh.....http://dblp.org/pers/hd/a/Alizadeh:Mohammad", "Tom Edsall.....http://dblp.org/pers/hd/e/Edsall:Tom", "Sarang Dharmapurikar.....http://dblp.org/pers/hd/d/Dharmapurikar:Sarang", "Ramanan Vaidyanathan.....http://dblp.org/pers/hd/v/Vaidyanathan:Ramanan", "Kevin Chu.....http://dblp.org/pers/hd/c/Chu:Kevin", "Andy Fingerhut.....http://dblp.org/pers/hd/f/Fingerhut:Andy", "Vinh The Lam.....http://dblp.org/pers/hd/l/Lam:Vinh_The", "Francis Matus.....http://dblp.org/pers/hd/m/Matus:Francis", "Rong Pan.....http://dblp.org/pers/hd/p/Pan:Rong", "Navindra Yadav.....http://dblp.org/pers/hd/y/Yadav:Navindra", "George Varghese.....http://dblp.org/pers/hd/v/Varghese:George"], "conf": "sigcomm", "year": "2014", "pages": 12}