{"title": "Fast incremental SimRank on link-evolving graphs.", "fields": ["simrank", "singular value decomposition", "sylvester matrix", "matrix decomposition", "factorization"], "abstract": "SimRank is an arresting measure of node-pair similarity based on hyperlinks. It iteratively follows the concept that 2 nodes are similar if they are referenced by similar nodes. Real graphs are often large, and links constantly evolve with small changes over time. This paper considers fast incremental computations of SimRank on link-evolving graphs. The prior approach [12] to this issue factorizes the graph via a singular value decomposition (SVD) first, and then incrementally maintains this factorization for link updates at the expense of exactness. Consequently, all node-pair similarities are estimated in O(r 4 n 2 ) time on a graph of n nodes, where r is the target rank of the low-rank approximation, which is not negligibly small in practice. In this paper, we propose a novel fast incremental paradigm. (1) We characterize the SimRank update matrix ΔS, in response to every link update, via a rank-one Sylvester matrix equation. By virtue of this, we devise a fast incremental algorithm computing similarities of n 2  node-pairs in O(Kn 2 ) time for K iterations. (2) We also propose an effective pruning technique capturing the “affected areas” of ΔS to skip unnecessary computations, without loss of exactness. This can further accelerate the incremental SimRank computation to O(K(nd+|AFF|)) time, where d is the average in-degree of the old graph, and |AFF| (≤ n 2 ) is the size of “affected areas” in ΔS, and in practice, |AFF| ≪ n 2 . Our empirical evaluations verify that our algorithm (a) outperforms the best known link-update algorithm [12], and (b) runs much faster than its batch counterpart when link updates are small.", "citation": "Citations (20)", "departments": ["University of New South Wales", "East China Normal University", "University of New South Wales"], "authors": ["Weiren Yu.....http://dblp.org/pers/hd/y/Yu:Weiren", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie"], "conf": "icde", "year": "2014", "pages": 12}