{"title": "A Statistical Perspective on Algorithmic Leveraging.", "fields": ["importance sampling", "matrix", "least absolute deviations", "data set", "computation", "leverage"], "abstract": "One popular method for dealing with large-scale data sets is sampling. For example, by using the empirical statistical leverage scores as an importance sampling distribution, the method of algorithmic leveraging samples and rescales rows/columns of data matrices to reduce the data size before performing computations on the subproblem. This method has been successful in improving computational efficiency of algorithms for matrix problems such as least-squares approximation, least absolute deviations approximation, and low-rank matrix approximation. Existing work has focused on algorithmic issues such as worst-case running times and numerical issues associated with providing high-quality implementations, but none of it addresses statistical aspects of this method.\n\nIn this paper, we provide a simple yet effective framework to evaluate the statistical properties of algorithmic leveraging in the context of estimating parameters in a linear regression model with a fixed number of predictors. In particular, for several versions of leverage-based sampling, we derive results for the bias and variance, both conditional and unconditional on the observed data. We show that from the statistical perspective of bias and variance, neither leverage-based sampling nor uniform sampling dominates the other. This result is particularly striking, given the well-known result that, from the algorithmic perspective of worst-case analysis, leverage-based sampling provides uniformly superior worst-case algorithmic results, when compared with uniform sampling.\n\nBased on these theoretical results, we propose and analyze two new leveraging algorithms: one constructs a smaller least-squares problem with \"shrinkage\" leverage scores (SLEV), and the other solves a smaller and unweighted (or biased) least-squares problem (LEVUNW). A detailed empirical evaluation of existing leverage-based methods as well as these two new methods is carried out on both synthetic and real data sets. The empirical results indicate that our theory is a good predictor of practical performance of existing and new leverage-based algorithms and that the new algorithms achieve improved performance. For example, with the same computation reduction as in the original algorithmic leveraging approach, our proposed SLEV typically leads to improved biases and variances both unconditionally and conditionally (on the observed data), and our proposed LEVUNW typically yields improved unconditional biases and variances.", "citation": "Citations (90)", "year": "2014", "departments": ["University of Georgia", "University of California, Berkeley", "University of California, Berkeley", "University of Georgia", "University of California, Berkeley", "University of California, Berkeley"], "conf": "icml", "authors": ["Ping Ma.....http://dblp.org/pers/hd/m/Ma:Ping", "Michael W. Mahoney.....http://dblp.org/pers/hd/m/Mahoney:Michael_W=", "Bin Yu.....http://dblp.org/pers/hd/y/Yu_0001:Bin"], "pages": 9}