{"title": "A characterization of strong approximation resistance.", "fields": ["predicate", "unique games conjecture", "constraint satisfaction problem", "convex polytope", "hard core predicate", "combinatorics", "mathematics"], "abstract": "For a predicate  f : {-1, 1}  k   ↦ {0, 1} with  ρ ( f ) = | f  -1 (1)|/2  k  , we call the predicate  strongly approximation resistant  if given a near-satisfiable instance of CSP( f ), it is computationally  hard  to find an assignment such that the fraction of constraints satisfied is outside the range [ ρ ( f ) - Ω(1),  ρ ( f ) + Ω(1)].   We present a characterization of strongly approximation resistant predicates under the Unique Games Conjecture. We also present characterizations in the  mixed  linear and semi-definite programming hierarchy and the Sherali-Adams linear programming hierarchy. In the former case, the characterization coincides with the one based on UGC. Each of the two characterizations is in terms of existence of a probability measure on a natural convex polytope associated with the predicate.   The predicate is called  approximation resistant  if given a near-satisfiable instance of CSP( f ), it is computationally  hard  to find an assignment such that the fraction of constraints satisfied is at least  ρ ( f ) + Ω(1). When the predicate is odd, i.e.  f (- z ) = 1 -  f ( z ), ∀ z  ∈ {-1, 1}  k  , it is easily observed that the notion of approximation resistance coincides with that of strong approximation resistance. Hence for odd predicates our characterization of strong approximation resistance is also a characterization of approximation resistance.", "citation": "Citations (10)", "year": "2014", "departments": ["New York University", "Toyota Technological Institute at Chicago", "New York University"], "conf": "stoc", "authors": ["Subhash Khot.....http://dblp.org/pers/hd/k/Khot:Subhash", "Madhur Tulsiani.....http://dblp.org/pers/hd/t/Tulsiani:Madhur", "Pratik Worah.....http://dblp.org/pers/hd/w/Worah:Pratik"], "pages": 10}