{"title": "TOC: Localizing wireless rechargeable sensors with time of charge.", "fields": ["key distribution in wireless sensor networks", "wireless wan", "sensor node", "mobile wireless sensor network", "exploit", "fixed wireless", "testbed", "wi fi array"], "abstract": "The wireless rechargeable sensor network is a promising platform for long-term applications such as inventory management, supply chain monitoring, and so on. For these applications, sensor localization is one of the most fundamental challenges. Different from a traditional sensor node, a wireless rechargeable sensor has to be charged above a voltage level by the wireless charger in order to support its sensing, computation, and communication operations. In this work, we consider the scenario where a mobile charger stops at different positions to charge sensors and propose a novel localization design that utilizes the unique  Time of Charge  (TOC) sequences among wireless rechargeable sensors. Specifically, we introduce two efficient region dividing methods,  Internode Division  and  Interarea Division , to exploit TOC differences from both temporal and spatial dimensions to localize individual sensor nodes. To further optimize the system performance, we introduce both an optimal charger stop planning algorithm for the single-sensor case and a suboptimal charger stop planning algorithm for the generic multisensor scenario with a provable performance bound. We have extensively evaluated our design by both testbed experiments and large-scale simulations. The experiment and simulation results show that by as less as five stops, our design can achieve sub-meter accuracy and the performance is robust under various system conditions.", "citation": "Citations (38)", "departments": ["Zhejiang University", "Zhejiang University", "Singapore University of Technology and Design", "Zhejiang University", "University of Minnesota", "Zhejiang University", "Zhejiang University", "Singapore University of Technology and Design", "Zhejiang University", "University of Minnesota"], "authors": ["Yuanchao Shu.....http://dblp.org/pers/hd/s/Shu:Yuanchao", "Peng Cheng.....http://dblp.org/pers/hd/c/Cheng_0001:Peng", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0001:Yu", "Jiming Chen.....http://dblp.org/pers/hd/c/Chen:Jiming", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "infocom", "year": "2014", "pages": 9}