{"title": "Packet classification using binary Content Addressable Memory.", "fields": ["network packet", "skip list", "bcam", "distributed computing", "speedup", "ternary operation", "binary number", "content addressable memory", "theoretical computer science"], "abstract": "Packet classification is the core mechanism that enables many networking devices. Although using ternary content addressable memory (TCAM) to perform high-speed packet classification has become the widely adopted solution, TCAM is very expensive, has limited capacity, consumes large amounts of power, and generates tremendous amounts of heat because of their extremely dense and parallel circuitry. In this paper, we propose the first packet classification scheme that uses binary CAM (BCAM). BCAM is similar to TCAM except that in BCAM, every bit has only two possible states: 0 or 1; in contrast, in TCAM, every bit has three possible states: 0, 1, or * (don’t care). Because of the high complexity in implementing the extra “don’t care” state, TCAM has much higher circuit density than BCAM. As the power consumption, heat generation, and price grow non-linearly with circuit density, BCAM consumes much less power, generates much less heat, and costs much less money than TCAM. Our BCAM-based packet classification scheme is built on two key ideas. First, we break a multi-dimensional lookup into a series of 1-D lookups. Second, for each 1-D lookup, we convert the ternary matching problem into a binary string exact matching problem. To speed up the lookup process, we propose a number of optimization techniques, including skip lists, free expansion, minimizing maximum lookup time, minimizing average lookup time, and lookup short circuiting. We evaluated our BCAM scheme on 17 real-life packet classifiers. On these classifiers, our BCAM scheme requires roughly five times fewer CAM bits than the traditional TCAM-based scheme. The penalty is a throughput that is roughly four times less.", "citation": "Citations (3)", "departments": ["Michigan State University", "Massachusetts Institute of Technology", "Michigan State University", "Michigan State University", "Michigan State University", "Michigan State University"], "authors": ["Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Chad R. Meiners.....http://dblp.org/pers/hd/m/Meiners:Chad_R=", "Eric Torng.....http://dblp.org/pers/hd/t/Torng:Eric"], "conf": "infocom", "year": "2014", "pages": 9}