{"title": "kBF: A Bloom Filter for key-value storage with an application on approximate state machines.", "fields": ["bloom filter", "intrusion detection system", "probabilistic logic", "cpu time", "speedup"], "abstract": "Key-value (k-v) storage has been used as a cru- cial component for many network applications, such as social networks, online retailing, and cloud computing. Such storage usually provides support for operations on key-value pairs, and can be stored in memory to speed up responses to queries. So far, existing methods have been deterministic: they will faithfully return previously inserted key-value pairs. Providing such accuracy, however, comes at the cost of memory and CPU time. In contrast, in this paper, we present an approximate k-v storage that is more compact than existing methods. The tradeoff is that it may, theoretically, return a null value for a valid key with a low probability, or return a valid value for a key that was never inserted. Its design is based on the probabilistic data structure called the \"Bloom Filter\", which was originally developed to test element membership in sets. In this paper, we extend the bloom filter concept to support key-value operations, and demonstrate that it still retains the compact nature of the original bloom filter. We call the resulting design as the kBF (key-value bloom filter), and systematically analyze its performance advantages and design tradeoffs. Finally, we apply the kBF to a practical problem of implementing a state machine in network intrusion detection to demonstrate how the kBF can be used as a building block for more complicated software infrastructures.", "citation": "Citations (5)", "departments": ["University of Tennessee", "University of Tennessee", "University of Tennessee", "University of Minnesota"], "authors": ["Sisi Xiong.....http://dblp.org/pers/hd/x/Xiong:Sisi", "Yanjun Yao.....http://dblp.org/pers/hd/y/Yao:Yanjun", "Qing Cao.....http://dblp.org/pers/hd/c/Cao:Qing", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "infocom", "year": "2014", "pages": 9}