{"title": "Identifying the characteristics of vulnerable code changes: an empirical study.", "fields": ["empirical research", "secure coding", "vulnerability", "computer security", "code review"], "abstract": "To focus the efforts of security experts, the goals of this empirical study are to analyze which security vulnerabilities can be discovered by code review, identify characteristics of vulnerable code changes, and identify characteristics of developers likely to introduce vulnerabilities. Using a three-stage manual and automated process, we analyzed 267,046 code review requests from 10 open source projects and identified 413 Vulnerable Code Changes (VCC). Some key results include: (1) code review can identify common types of vulnerabilities; (2) while more experienced contributors authored the majority of the VCCs, the less experienced contributors' changes were 1.8 to 24 times more likely to be vulnerable; (3) the likelihood of a vulnerability increases with the number of lines changed, and (4) modified files are more likely to contain vulnerabilities than new files. Knowing which code changes are more prone to contain vulnerabilities may allow a security expert to concentrate on a smaller subset of submitted code changes. Moreover, we recommend that projects should: (a) create or adapt secure coding guidelines, (b) create a dedicated security review team, (c) ensure detailed comments during review to help knowledge dissemination, and (d) encourage developers to make small, incremental changes rather than large changes.", "citation": "Citations (19)", "departments": ["University of Alabama", "University of Alabama", "Auburn University", "Providence College", "Lewis & Clark College"], "authors": ["Amiangshu Bosu.....http://dblp.org/pers/hd/b/Bosu:Amiangshu", "Jeffrey C. Carver.....http://dblp.org/pers/hd/c/Carver:Jeffrey_C=", "Munawar Hafiz.....http://dblp.org/pers/hd/h/Hafiz:Munawar", "Patrick Hilley.....http://dblp.org/pers/hd/h/Hilley:Patrick", "Derek Janni.....http://dblp.org/pers/hd/j/Janni:Derek"], "conf": "sigsoft", "year": "2014", "pages": 12}