{"title": "Efficient and accurate query evaluation on uncertain graphs via recursive stratified sampling.", "fields": ["stratified sampling", "estimator", "partition", "scalability", "recursion"], "abstract": "In this paper, we introduce two types of query evaluation problems on uncertain graphs: expectation query evaluation and threshold query evaluation. Since these two problems are #P-complete, most previous solutions for these problems are based on naive Monte-Carlo (NMC) sampling. However, NMC typically leads to a large variance, which significantly reduces its effectiveness. To overcome this problem, we propose two classes of estimators, called class-I and class-II estimators, based on the idea of stratified sampling. More specifically, we first propose two classes of basic stratified sampling estimators, named BSS-I and BSS-II, which partition the entire population into 2 r  and r+1 strata by picking r edges respectively. Second, to reduce the variance, we find that both BSS-I and BSS-II can be recursively performed in each stratum. Therefore, we propose two classes of recursive stratified sampling estimators called RSS-I and RSS-II respectively. Third, for a particular kind of problem, we propose two cut-set based stratified sampling estimators, named BCSS and RCSS, to further improve the accuracy of the class-I and class-II estimators. For all the proposed estimators, we prove that they are unbiased and their variances are significantly smaller than that of NMC. Moreover, the time complexity of all the proposed estimators are the same as the time complexity of NMC under a mild assumption. In addition, we also apply the proposed estimators to influence function evaluation and expected-reliable distance query problem, which are two instances of the query evaluation problems on uncertain graphs. Finally, we conduct extensive experiments to evaluate our estimators, and the results demonstrate the efficiency, accuracy, and scalability of the proposed estimators.", "citation": "Citations (8)", "departments": ["Shenzhen University", "The Chinese University of Hong Kong", "Shenzhen University", "Northeastern University"], "authors": ["Rong-Hua Li.....http://dblp.org/pers/hd/l/Li:Rong=Hua", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Rui Mao.....http://dblp.org/pers/hd/m/Mao:Rui", "Tan Jin.....http://dblp.org/pers/hd/j/Jin:Tan"], "conf": "icde", "year": "2014", "pages": 12}