{"title": "Threesomes, Degenerates, and Love Triangles.", "fields": ["conjecture", "3sum", "real ram", "string searching algorithm", "element distinctness problem", "binary logarithm", "decision tree model", "degeneracy"], "abstract": "The 3SUM problem is to decide, given a set of n real numbers, whether any three sum to zero. It is widely conjectured that a trivial O(n2)-time algorithm is optimal on the Real RAM, and optimal even in the nonuniform linear decision tree model. Over the years the consequences of this conjecture have been revealed. This 3SUM conjecture implies Ω (n2) lower bounds on numerous problems in computational geometry, and a variant of the conjecture for integer inputs implies strong lower bounds on triangle enumeration, dynamic graph algorithms, and string matching data structures. \n\nIn this article, we refute the conjecture that 3SUM requires Ω (n2) in the Real RAM and refute more forcefully the conjecture that its complexity is Ω (n2) in the linear decision tree model. In particular, we prove that the decision tree complexity of 3SUM is O(n3/2S log n) and give two subquadratic 3SUM algorithms, a deterministic one running in O(n2 / (log n/ log log n)2/3) time and a randomized one running in O(n2(log log n)2 / log n) time with high probability. Our results lead directly to improved bounds on the decision tree complexity of k-variate linear degeneracy testing for all odd k≥ 3.\n\nFinally, we give a subcubic algorithm for a generalization of the (min ,+)-product over real-valued matrices and apply it to the problem of finding zero-weight triangles in edge-weighted graphs. We give a depth-O(n5/2S log n) decision tree for this problem, as well as a deterministic algorithm running in time O(n3 (log log n)2/log n).", "citation": "Citations (57)", "departments": ["Aarhus University", "University of Michigan", "Aarhus University", "University of Michigan"], "authors": ["Allan Grønlund Jørgensen.....http://dblp.org/pers/hd/j/J=oslash=rgensen:Allan_Gr=oslash=nlund", "Seth Pettie.....http://dblp.org/pers/hd/p/Pettie:Seth"], "conf": "focs", "year": "2014", "pages": 10}