{"title": "Locality-sensitive operators for parallel main-memory database clusters.", "fields": ["operator", "parallel database", "skew", "distributed database", "locality"], "abstract": "The growth in compute speed has outpaced the growth in network bandwidth over the last decades. This has led to an increasing performance gap between local and distributed processing. A parallel database cluster thus has to maximize the locality of query processing. A common technique to this end is to co-partition relations to avoid expensive data shuffling across the network. However, this is limited to one attribute per relation and is expensive to maintain in the face of updates. Other attributes often exhibit a fuzzy co-location due to correlations with the distribution key but current approaches do not leverage this. In this paper, we introduce locality-sensitive data shuffling, which can dramatically reduce the amount of network communication for distributed operators such as join and aggregation. We present four novel techniques: (i) optimal partition assignment exploits locality to reduce the network phase duration; (ii) communication scheduling avoids bandwidth underutilization due to cross traffic; (iii) adaptive radix partitioning retains locality during data repartitioning and handles value skew gracefully; and (iv) selective broadcast reduces network communication in the presence of extreme value skew or large numbers of duplicates. We present comprehensive experimental results, which show that our techniques can improve performance by up to factor of 5 for fuzzy co-location and a factor of 3 for inputs with value skew.", "citation": "Citations (30)", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "Technische Universität München", "Snowflake Compu ...  Mateo, CA, USA"], "authors": ["Wolf Rödiger.....http://dblp.org/pers/hd/r/R=ouml=diger:Wolf", "Tobias Mühlbauer.....http://dblp.org/pers/hd/m/M=uuml=hlbauer:Tobias", "Philipp Unterbrunner.....http://dblp.org/pers/hd/u/Unterbrunner:Philipp", "Angelika Reiser.....http://dblp.org/pers/hd/r/Reiser:Angelika", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas"], "conf": "icde", "year": "2014", "pages": 12}