{"title": "On Learning and Testing Dynamic Environments.", "fields": ["computational problem", "property testing", "encoding", "combinatorics", "applied mathematics", "emulation", "discrete mathematics", "mathematics", "sublinear function", "computer science"], "abstract": "We initiate a study of learning and testing dynamic environments, focusing on environments that evolve according to a fixed local rule. The (proper) learning task consists of obtaining the initial configuration of the environment, whereas for nonproper learning it suffices to predict its future values. The testing task consists of checking whether the environment has indeed evolved from some initial configuration according to the known evolution rule. We focus on the temporal aspect of these computational problems, which is reflected in two requirements: (1) it is not possible to “go back to the past” and make a query concerning the environment at time  t  after having made a query concerning time  t ′ >  t , and (2) only a small portion of the environment is inspected in each time unit.   We present several general results, extensive studies of two special cases, and a host of open problems. The general results illustrate the significance of the temporal aspect of the current model (i.e., the difference between the current model and the standard model) as well as the preservation of some relations that hold in the standard model. The two special cases that we study are linear rules of evolution and rules of evolution that represent simple movement of objects. Specifically, we show that evolution according to any linear rule can be tested within a total number of queries that is sublinear in the size of the environment, and that evolution according to a simple one-dimensional movement rule can be tested within a total number of queries that is independent of the size of the environment.", "citation": "Not cited", "departments": ["Weizmann Institute of Science", "Tel Aviv University", "Weizmann Institute of Science", "Tel Aviv University"], "authors": ["Oded Goldreich.....http://dblp.org/pers/hd/g/Goldreich_0001:Oded", "Dana Ron.....http://dblp.org/pers/hd/r/Ron:Dana"], "conf": "focs", "year": "2014", "pages": 8}