{"title": "SenSpeed: Sensing driving conditions to estimate vehicle speed in urban environments.", "fields": ["global positioning system", "large deviations theory", "acceleration", "instant", "accelerometer", "environmental science", "automotive engineering", "computer science", "embedded system"], "abstract": "Acquiring instant vehicle speed is desirable and a corner stone to many important vehicular applications. This paper utilizes smartphone sensors to estimate the vehicle speed, especially when GPS is unavailable or inaccurate in urban environments. In particular, we estimate the vehicle speed by integrating the accelerometer’s readings over time and find the acceleration errors can lead to large deviations between the estimated speed and the real one. Further analysis shows that the changes of acceleration errors are very small over time which can be corrected at some points, called  reference points , where the true vehicle speed can be estimated. Recognizing this observation, we propose an accurate vehicle speed estimation system, SenSpeed, which senses natural driving conditions in urban environments including  making turns ,  stopping , and  passing through uneven road surfaces , to derive reference points and further eliminates the speed estimation deviations caused by acceleration errors. Extensive experiments demonstrate that SenSpeed is accurate and robust in real driving environments. On average, the real-time speed estimation error on local road is    $2.1\\,\\mathrm {km/h}$      , and the offline speed estimation error is as low as    $1.21$        km/h. Whereas the average error of GPS is   $5.0$        and    $4.5$        km/h, respectively.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Stevens Institute of Technology", "University of Rochester", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Stevens Institute of Technology", "Florida State University"], "authors": ["Haofu Han.....http://dblp.org/pers/hd/h/Han:Haofu", "Jiadi Yu.....http://dblp.org/pers/hd/y/Yu:Jiadi", "Hongzi Zhu.....http://dblp.org/pers/hd/z/Zhu:Hongzi", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying", "Jie Yang.....http://dblp.org/pers/hd/y/Yang_0003:Jie", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Guangtao Xue.....http://dblp.org/pers/hd/x/Xue:Guangtao", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu"], "conf": "infocom", "year": "2014", "pages": 9}