{"title": "SILVERBACK: Scalable association mining for temporal data in columnar probabilistic databases.", "fields": ["reservoir sampling", "temporal database", "storage efficiency", "bloom filter", "probabilistic logic"], "abstract": "We 1  address the problem of large scale probabilistic association rule mining and consider the trade-offs between accuracy of the mining results and quest of scalability on modest hardware infrastructure. We demonstrate how extensions and adaptations of research findings can be integrated in an industrial application, and we present the commercially deployed Silverback framework, developed at Voxsup Inc. Silverback tackles the storage efficiency problem by proposing a probabilistic columnar infrastructure and using Bloom filters and reservoir sampling techniques. In addition, a probabilistic pruning technique has been introduced based on Apriori for mining frequent item-sets. The proposed target-driven technique yields a significant reduction on the size of the frequent item-set candidates. We present extensive experimental evaluations which demonstrate the benefits of a context-aware incorporation of infrastructure limitations into corresponding research techniques. The experiments indicate that, when compared to the traditional Hadoop-based approach for improving scalability by adding more hosts, Silverback - which has been commercially deployed and developed at Voxsup Inc. since May 2011 - has much better run-time performance with negligible accuracy sacrifices.", "citation": "Citations (8)", "departments": ["Northwestern University", "Northwestern University", "Northwestern University", "Voxsup Inc., 79 ... Chicago, IL USA", "Voxsup Inc., 79 ... Chicago, IL USA"], "authors": ["Yusheng Xie.....http://dblp.org/pers/hd/x/Xie:Yusheng", "Diana Palsetia.....http://dblp.org/pers/hd/p/Palsetia:Diana", "Goce Trajcevski.....http://dblp.org/pers/hd/t/Trajcevski:Goce", "Ankit Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Ankit", "Alok N. Choudhary.....http://dblp.org/pers/hd/c/Choudhary:Alok_N="], "conf": "icde", "year": "2014", "pages": 12}