{"title": "Achieving privacy preservation in WiFi fingerprint-based localization.", "fields": ["client side", "android", "fingerprint", "overhead", "privacy software"], "abstract": "WiFi fingerprint-based localization is regarded as one of the most promising techniques for indoor localization. The location of a to-be-localized client is estimated by mapping the measured fingerprint (WiFi signal strengths) against a database owned by the localization service provider. A common concern of this approach that has never been addressed in literature is that it may leak the client's location information or disclose the service provider's data privacy. In this paper, we first analyze the privacy issues of WiFi fingerprint-based localization and then propose a Privacy-Preserving WiFi Fingerprint Localization scheme (PriWFL) that can protect both the client's location privacy and the service provider's data privacy. To reduce the computational overhead at the client side, we also present a performance enhancement algorithm by exploiting the indoor mobility prediction. Theoretical performance analysis and ex- perimental study are carried out to validate the effectiveness of PriWFL. Our implementation of PriWFL in a typical Android s- martphone and experimental results demonstrate the practicality and efficiency of PriWFL in real-world environments. Index Terms—WiFi fingerprint-based localization; location privacy; data privacy; homomorphic encryption.", "citation": "Citations (29)", "departments": ["Shanghai Jiao Tong University", "George Washington University", "State Key Lab.  ...  Beijing, China", "State Key Lab.  ...  Beijing, China", "State Key Lab.  ...  Beijing, China"], "authors": ["Hong Li.....http://dblp.org/pers/hd/l/Li_0004:Hong", "Limin Sun.....http://dblp.org/pers/hd/s/Sun:Limin", "Haojin Zhu.....http://dblp.org/pers/hd/z/Zhu:Haojin", "Xiang Lu.....http://dblp.org/pers/hd/l/Lu:Xiang", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen"], "conf": "infocom", "year": "2014", "pages": 9}