{"title": "On the geographic patterns of a large-scale mobile video-on-demand system.", "fields": ["internet video", "mobile web", "popularity", "mobile computing", "mobile search"], "abstract": "The widespread availability of smart mobile termi- nals along with the ever increasing bandwidth capabilities has promoted the popularity of mobile Internet video systems. Under- standing the geographic features of mobile content consumption is of an extreme importance for the design and the performance optimization of a mobile video delivery system. This paper is a first step towards characterization of the geographic patterns of a large-scale commercial mobile video-on-demand (VoD) system, by measuring both uniformity and intensity of geographic interests on videos. In particular, we identify a geographical concentration effect of views for individual videos, which is however dependent on video popularity. We also analyze the temporal evolution trends of the geographic popularity which reveal distinct behavior of popular and non-popular videos. While the set of locations that contribute to most of the views of non-popular videos largely varies, the daily geographic popularity distribution of popular videos closely follows the distribution of global traffic and remains stable. We also examine the impact of content type and viewing sources on the geographic features of mobile videos consumption, and the correlation between content similarity and geographic locality. Finally, we provide insights into the implications of our findings.", "citation": "Citations (13)", "departments": ["French Institute for Research in Computer Science and Automation", "ICT, China", "ICT, China", "ICT, China", "PPTV, China"], "authors": ["Zhenyu Li.....http://dblp.org/pers/hd/l/Li_0001:Zhenyu", "Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang", "Jiali Lin.....http://dblp.org/pers/hd/l/Lin:Jiali", "Yun Jin.....http://dblp.org/pers/hd/j/Jin:Yun", "Mohamed Ali Kâafar.....http://dblp.org/pers/hd/k/K=acirc=afar:Mohamed_Ali", "Kavé Salamatian.....http://dblp.org/pers/hd/s/Salamatian:Kav=eacute="], "conf": "infocom", "year": "2014", "pages": 9}