{"title": "New bandwidth sharing and pricing policies to achieve a win-win situation for cloud provider and tenants.", "fields": ["dynamic bandwidth allocation", "channel allocation schemes", "computer network", "cloud computing", "bandwidth management", "bandwidth", "bandwidth allocation", "network traffic control", "win win game"], "abstract": "For predictable application performance or fairness in network sharing in clouds, many bandwidth allocation policies have been proposed. However, with these policies, tenants are not incentivized to use idle bandwidth or prevent link congestion, and may even take advantage of the policies to gain unfair bandwidth allocation. Increasing network utilization while avoiding congestion not only benefits cloud provider but also the tenants by improving application performance. In this paper, we propose a new pricing model that sets different unit prices for reserved bandwidth, the bandwidth on congested links and on uncongested links, and makes the unit price for congested links proportional to their congestion degrees. We use game theory model to analyze tenants’ behaviors in our model and the current pricing models, which shows the effectiveness of our model in providing the incentives. With the pricing model, we propose a network sharing policy to achieve both min-guarantee and proportionality, while prevent tenants from earning unfair bandwidth. We further propose methods for each virtual machine to arrange its traffic to reduce its unsatisfied demand and maximize its utility, while increase network utilization. As a result, our solution creates a win-win situation, where tenants strive to increase their benefits in bandwidth sharing, which also concurrently increases the utilities of cloud provider and other tenants. Our simulation and trace-driven experimental results show the effectiveness of our solutions in creating the win-win situation.", "citation": "Citations (15)", "departments": ["Clemson University", "Clemson University", "Clemson University", "Clemson University"], "authors": ["Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Zhuozhao Li.....http://dblp.org/pers/hd/l/Li:Zhuozhao"], "conf": "infocom", "year": "2014", "pages": 9}