{"title": "Optimal Combined Heat and Power system scheduling in smart grid.", "fields": ["stand alone power system", "lyapunov optimization", "economic dispatch", "battery pack", "thermal energy"], "abstract": "Combined Heat and Power (CHP) systems are well known for their high efficiency and relatively low emissions. Existing CHP economic dispatch schemes do not use the energy buffer to minimize the average cost in the long term. Motivated by the queueing analysis and buffer management solutions in data communication systems, in this paper, we investigate how to use a battery pack and a water tank to optimize the average cost for the CHP systems by jointly considering the real-time electricity price, renewable energy generation, energy buffer states, etc. We first formulate the queueing models for the CHP systems, and then propose an algorithm based on the Lyapunov optimization technique which does not need any statistical information about the system dynamics. The optimal control actions are obtained by solving a non-convex optimization problem. We then discuss when it can be converted into a convex optimization problem. Since the battery pack queue and water tank queue are correlated by the CHP, the capacity relationship between them is further explored. Through the theoretical performance analysis, we also show the tradeoff between the cost saving and the energy buffer capacity. Finally, the effectiveness of the proposed algorithms is evaluated with practical data. Index Terms—Combined Heat and Power, Lyapunov Optimiza- tion, Smart Grid water demands from users are met in each time slot. Since the CHP systems generate electricity and heat simultaneously, the energy queues of the battery pack and the water tank are related. Therefore we cannot use the stochastic network optimization framework to solve the problem directly. We consider two different types of CHP systems. The first one is a conventional CHP which uses natural gas as the fuel and has a fixed electricity-heat generation ratio, while the second one uses renewable energy and has an adjustable electricity- heat generation ratio. The contributions of this paper are three-fold. First, we propose a comprehensive model from the perspective of a commercial customer, which incorporates both the electricity and thermal energy queues. We investigate the relationship of these two queues to minimize the average cost. Second, we propose an algorithm to approximately achieve the optimal average cost, considering the limited capacities of the battery pack and the water tank. The algorithm does not require any statistical information of the system dynamics such as", "citation": "Citations (10)", "departments": ["University of Victoria", "University of Victoria", "University of Victoria"], "authors": ["Kan Zhou.....http://dblp.org/pers/hd/z/Zhou:Kan", "Jianping Pan.....http://dblp.org/pers/hd/p/Pan_0001:Jianping", "Lin Cai.....http://dblp.org/pers/hd/c/Cai_0001:Lin"], "conf": "infocom", "year": "2014", "pages": 9}