{"title": "Exploiting Bounded Staleness to Speed Up Big Data Analytics.", "fields": ["bounded function", "cache", "bulk synchronous parallel", "collaborative filtering", "speedup"], "abstract": "Many modern machine learning (ML) algorithms are iterative, converging on a final solution via many iterations over the input data. This paper explores approaches to exploiting these algorithms' convergent nature to improve performance, by allowing parallel and distributed threads to use loose consistency models for shared algorithm state. Specifically, we focus on bounded staleness, in which each thread can see a view of the current intermediate solution that may be a limited number of iterations out-of-date. Allowing staleness reduces communication costs (batched updates and cached reads) and synchronization (less waiting for locks or straggling threads). One approach is to increase the number of iterations between barriers in the oft-used Bulk Synchronous Parallel (BSP) model of parallelizing, which mitigates these costs when all threads proceed at the same speed. A more flexible approach, called Stale Synchronous Parallel (SSP), avoids barriers and allows threads to be a bounded number of iterations ahead of the current slowest thread. Extensive experiments with ML algorithms for topic modeling, collaborative filtering, and PageRank show that both approaches significantly increase convergence speeds, behaving similarly when there are no stragglers, but SSP outperforms BSP in the presence of stragglers.", "citation": "Citations (64)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Henggang Cui.....http://dblp.org/pers/hd/c/Cui:Henggang", "James Cipar.....http://dblp.org/pers/hd/c/Cipar:James", "Qirong Ho.....http://dblp.org/pers/hd/h/Ho:Qirong", "Jin Kyu Kim.....http://dblp.org/pers/hd/k/Kim:Jin_Kyu", "Seunghak Lee.....http://dblp.org/pers/hd/l/Lee:Seunghak", "Abhimanu Kumar.....http://dblp.org/pers/hd/k/Kumar:Abhimanu", "Jinliang Wei.....http://dblp.org/pers/hd/w/Wei:Jinliang", "Wei Dai.....http://dblp.org/pers/hd/d/Dai_0003:Wei", "Gregory R. Ganger.....http://dblp.org/pers/hd/g/Ganger:Gregory_R=", "Phillip B. Gibbons.....http://dblp.org/pers/hd/g/Gibbons:Phillip_B=", "Garth A. Gibson.....http://dblp.org/pers/hd/g/Gibson:Garth_A=", "Eric P. Xing.....http://dblp.org/pers/hd/x/Xing:Eric_P="], "conf": "usenix", "year": "2014", "pages": 12}