{"title": "A software-defined networking based approach for performance management of analytical queries on distributed data stores.", "fields": ["data intensive computing", "distributed data store", "software defined networking", "leverage", "distributed design patterns"], "abstract": "Nowadays data analytics applications are accessing more and more data from distributed data stores, creating a large amount of data traffic on the network. Therefore, distributed analytic queries are prone to suffer from poor performance when they encounter network contention, which can be quite common in a shared network. Typical distributed query optimizers do not have a way to solve this problem because they treat the network as a black-box: they are unable to monitor it, let alone control it. With the new era of software-defined networking (SDN), we show how SDN can be effectively exploited for performance management for analytical queries in distributed data store environments. More specifically, we present a group of methods to leverage SDN's visibility into and control of the network's state that enable distributed query processors to achieve performance improvements and differentiation for analytical queries. We demonstrate the effectiveness of the methods through detailed experimental studies on a system running on a software-defined network with commercial switches. To the best of our knowledge, this is the first work to analyze and show the opportunities of SDN for distributed query optimization. It is our hope that this will open up a rich area of research and technology development in distributed data intensive computing.", "citation": "Citations (19)", "year": "2014", "departments": ["University of Wisconsin-Madison", "NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA"], "conf": "sigmod", "authors": ["PengCheng Xiong.....http://dblp.org/pers/hd/x/Xiong:PengCheng", "Hakan Hacigümüs.....http://dblp.org/pers/hd/h/Hacig=uuml=m=uuml=s:Hakan", "Jeffrey F. Naughton.....http://dblp.org/pers/hd/n/Naughton:Jeffrey_F="], "pages": 12}