{"title": "Online optimization and fair costing for dynamic data sharing in a cloud data market.", "fields": ["data set", "online algorithm", "online optimization", "dynamic data", "activity based costing"], "abstract": "The data markets are emerging to address many organizations' need to find more useful external data sets for deeper insights. Existing data markets have two main limitations. First, they either sell a whole data set or some fixed views, but do not allow arbitrary ad-hoc queries. Second, they only sell static data, but not data that are frequently updated. While there exist proposed solutions for selling ad-hoc queries, it is an open question what mechanism should be used to sell ad-hoc queries on dynamic data. In this paper, we study a data market framework that enables the sale or sharing of dynamic data, where each sharing is specified by an ad-hoc query. To keep the shared data up-to-date, the service provider should create a view of the shared data and maintain the view for the data buyer. We provide solutions to two important problems in this framework: how to efficiently maintain the views, and how to fairly determine the cost each sharing incurs for its view to be created and maintained by the service provider. Both problems are challenging since in the first problem, different sharings with the same operations in their plans may reuse these operations, and each sharing plan must be generated online. In the second problem, there are several factors that impact the fairness of a costing function and a straightforward mechanism won't work. We propose an intuitive online algorithm for sharing plan selection, as well as a set of fair costing criteria and an algorithm that maximizes the fairness.", "citation": "Citations (5)", "year": "2014", "departments": ["NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA"], "conf": "sigmod", "authors": ["Ziyang Liu.....http://dblp.org/pers/hd/l/Liu:Ziyang", "Hakan Hacigümüs.....http://dblp.org/pers/hd/h/Hacig=uuml=m=uuml=s:Hakan"], "pages": 12}