{"title": "Continuous test generation: enhancing continuous integration with automated test generation.", "fields": ["software development", "test suite", "test management approach", "test harness", "continuous testing"], "abstract": "In object oriented software development, automated unit test generation tools typically target one class at a time. A class, however, is usually part of a software project consisting of more than one class, and these are subject to changes over time. This context of a class offers significant potential to improve test generation for individual classes. In this paper, we introduce  Continuous Test Generation  (CTG), which includes automated unit test generation during continuous integration (i.e., infrastructure that regularly builds and tests software projects). CTG offers several benefits: First, it answers the question of how much time to spend on each class in a project. Second, it helps to decide in which order to test them. Finally, it answers the question of which classes should be subjected to test generation in the first place. We have implemented CTG using the EvoSuite unit test generation tool, and performed experiments using eight of the most popular open source projects available on GitHub, ten randomly selected projects from the SF100 corpus, and five industrial projects. Our experiments demonstrate improvements of up to +58% for branch coverage and up to +69% for thrown undeclared exceptions, while reducing the time spent on test generation by up to +83%.", "citation": "Citations (15)", "departments": ["University of Sheffield", "Simula Research Laboratory", "University of Sheffield", "University of Porto"], "authors": ["José Carlos Medeiros de Campos.....http://dblp.org/pers/hd/c/Campos:Jos=eacute=_Carlos_Medeiros_de", "Andrea Arcuri.....http://dblp.org/pers/hd/a/Arcuri:Andrea", "Gordon Fraser.....http://dblp.org/pers/hd/f/Fraser:Gordon", "Rui Filipe Lima Maranhão de Abreu.....http://dblp.org/pers/hd/a/Abreu:Rui_Filipe_Lima_Maranh=atilde=o_de"], "conf": "kbse", "year": "2014", "pages": 12}