{"title": "Traffic engineering with Equal-Cost-Multipath: An algorithmic perspective.", "fields": ["multipath propagation", "virtual routing and forwarding", "internet traffic engineering", "multipath routing", "clos network", "exploit", "multi commodity flow problem", "approximation algorithm", "loose source routing", "traffic engineering"], "abstract": "To efficiently exploit the network resources operators, do traffic engineering (TE), i.e., adapt the routing of traffic to the prevailing demands. TE in large IP networks typically relies on configuring static link weights and splitting traffic between the resulting shortest paths via the Equal-Cost-MultiPath (ECMP) mechanism. Yet, despite its vast popularity, crucial operational aspects of TE via ECMP are still little-understood from an algorithmic viewpoint. We embark upon a systematic algorithmic study of TE with ECMP. We consider the standard model of TE with ECMP and prove that, in general, even  approximating  the optimal link-weight configuration for ECMP within  any  constant ratio is an intractable feat, settling a long-standing open question. We establish, in contrast, that ECMP can provably achieve optimal traffic flow for the important category of Clos datacenter networks. We last consider a well-documented shortcoming of ECMP: suboptimal routing of large (“elephant”) flows. We present algorithms for scheduling “elephant” flows on top of ECMP (as in, e.g., Hedera) with  provable  approximation guarantees. Our results complement and shed new light on past experimental and empirical studies of the performance of TE with ECMP.", "citation": "Citations (20)", "departments": ["Roma Tre University", "Hebrew University of Jerusalem", "Hebrew University of Jerusalem", "Université catholique de Louvain", "Hebrew University of Jerusalem", "Hebrew University of Jerusalem"], "authors": ["Marco Chiesa.....http://dblp.org/pers/hd/c/Chiesa:Marco", "Guy Kindler.....http://dblp.org/pers/hd/k/Kindler:Guy", "Michael Schapira.....http://dblp.org/pers/hd/s/Schapira:Michael"], "conf": "infocom", "year": "2014", "pages": 9}