{"title": "Temporal skeletonization on sequential data: patterns, categorization, and visualization.", "fields": ["categorization", "data visualization", "embedding", "granularity", "metric space", "cardinality"], "abstract": "Sequential pattern analysis targets on finding statistically relevant temporal structures where the values are delivered in a sequence. With the growing complexity of real-world dynamic scenarios, more and more symbols are often needed to encode a meaningful sequence. This is so-called 'curse of cardinality', which can impose significant challenges to the design of sequential analysis methods in terms of computational efficiency and practical use. Indeed, given the overwhelming scale and the heterogeneous nature of the sequential data, new visions and strategies are needed to face the challenges. To this end, in this paper, we propose a 'temporal skeletonization' approach to proactively reduce the representation of sequences to uncover significant, hidden temporal structures. The key idea is to summarize the temporal correlations in an undirected graph. Then, the 'skeleton' of the graph serves as a higher granularity on which hidden temporal patterns are more likely to be identified. In the meantime, the embedding topology of the graph allows us to translate the rich temporal content into a metric space. This opens up new possibilities to explore, quantify, and visualize sequential data. Our approach has shown to greatly alleviate the curse of cardinality in challenging tasks of sequential pattern mining and clustering. Evaluation on a Business-to-Business (B2B) marketing application demonstrates that our approach can effectively discover critical buying paths from noisy customer event data.", "citation": "Citations (16)", "departments": ["Rutgers University", "Princeton University", "Rutgers University", "Princeton University", "Hong Kong University of Science and Technology", "Drexel University", "Princeton University", "Rutgers University", "Princeton University", "Hong Kong University of Science and Technology"], "authors": ["Chuanren Liu.....http://dblp.org/pers/hd/l/Liu:Chuanren", "Kai Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Kai", "Hui Xiong.....http://dblp.org/pers/hd/x/Xiong:Hui", "Geoff Jiang.....http://dblp.org/pers/hd/j/Jiang:Geoff", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "kdd", "year": "2014", "pages": 10}