{"title": "Toward Future Scenario Generation: Extracting Event Causality Exploiting Semantic Relation, Context, and Association Features.", "fields": ["data mining", "causality", "artificial intelligence", "global warming", "machine learning"], "abstract": "We propose a supervised method of extracting event causalities like conduct slash-and-burn agriculture! exacerbate desertification from the web using semantic relation (between nouns), context, and association features. Experiments show that our method outperforms baselines that are based on state-of-the-art methods. We also propose methods of generating future scenarios like conduct slash-and-burn agriculture! exacerbate desertification! increase Asian dust (from China)! asthma gets worse. Experiments show that we can generate 50,000 scenarios with 68% precision. We also generated a scenario deforestation continues! global warming worsens! sea temperatures rise! vibrio parahaemolyticus fouls (water), which is written in no document in our input web corpus crawled in 2007. But the vibrio risk due to global warming was observed in Baker-Austin et al. (2013). Thus, we “predicted” the future event sequence in a sense.", "citation": "Citations (19)", "year": "2014", "departments": ["National Institute of Information and Communications Technology", "Japan Advanced Institute of Science and Technology", "National Institute of Information and Communications Technology", "National Institute of Information and Communications Technology", "Yamagata University"], "conf": "acl", "authors": ["Chikara Hashimoto.....http://dblp.org/pers/hd/h/Hashimoto:Chikara", "Kentaro Torisawa.....http://dblp.org/pers/hd/t/Torisawa:Kentaro", "Julien Kloetzer.....http://dblp.org/pers/hd/k/Kloetzer:Julien", "Motoki Sano.....http://dblp.org/pers/hd/s/Sano:Motoki", "István Varga.....http://dblp.org/pers/hd/v/Varga:Istv=aacute=n", "Jong-Hoon Oh.....http://dblp.org/pers/hd/o/Oh:Jong=Hoon", "Yutaka Kidawara.....http://dblp.org/pers/hd/k/Kidawara:Yutaka"], "pages": 11}