{"title": "NUMARCK: Machine Learning Algorithm for Resiliency and Checkpointing.", "fields": ["search engine indexing", "exploit", "order of magnitude", "lossless compression", "work stealing"], "abstract": "Data checkpointing is an important fault tolerance technique in High Performance Computing (HPC) systems. As the HPC systems move towards exascale, the storage space and time costs of checkpointing threaten to overwhelm not only the simulation but also the post-simulation data analysis. One common practice to address this problem is to apply compression algorithms to reduce the data size. However, traditional lossless compression techniques that look for repeated patterns are ineffective for scientific data in which high-precision data is used and hence common patterns are rare to find. This paper exploits the fact that in many scientific applications, the relative changes in data values from one simulation iteration to the next are not very significantly different from each other. Thus, capturing the distribution of relative changes in data instead of storing the data itself allows us to incorporate the temporal dimension of the data and learn the evolving distribution of the changes. We show that an order of magnitude data reduction becomes achievable within guaranteed user-defined error bounds for each data point.   We propose NUMARCK,  N orthwestern  U niversity  M achine learning  A lgorithm for  R esiliency and  C hec K pointing, that makes use of the emerging distributions of data changes between consecutive simulation iterations and encodes them into an indexing space that can be concisely represented. We evaluate NUMARCK using two production scientific simulations, FLASH and CMIP5, and demonstrate a superior performance in terms of compression ratio and compression accuracy. More importantly, our algorithm allows users to specify the maximum tolerable error on a per point basis, while compressing the data by an order of magnitude.", "citation": "Citations (15)", "departments": ["Northwestern University", "Northwestern University", "Northwestern University", "Northwestern University", "Northwestern University"], "authors": ["Zhengzhang Chen.....http://dblp.org/pers/hd/c/Chen:Zhengzhang", "Seung Woo Son.....http://dblp.org/pers/hd/s/Son:Seung_Woo", "William Hendrix.....http://dblp.org/pers/hd/h/Hendrix:William", "Ankit Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Ankit", "Wei-keng Liao.....http://dblp.org/pers/hd/l/Liao:Wei=keng", "Alok N. Choudhary.....http://dblp.org/pers/hd/c/Choudhary:Alok_N="], "conf": "sc", "year": "2014", "pages": 12}