{"title": "Maximizing Throughput of Overprovisioned HPC Data Centers Under a Strict Power Budget.", "fields": ["runtime system", "supercomputer", "throughput", "power budget", "resource management system"], "abstract": "Building future generation supercomputers while constraining their power consumption is one of the biggest challenges faced by the HPC community. For example, US Department of Energy has set a goal of 20 MW for an exascale (10 18  flops) supercomputer. To realize this goal, a lot of research is being done to revolutionize hardware design to build power efficient computers and network interconnects. In this work, we propose a software-based online resource management system that leverages hardware facilitated capability to constrain the power consumption of each node in order to optimally allocate power and nodes to a job. Our scheme uses this hardware capability in conjunction with an adaptive runtime system that can dynamically change the resource configuration of a running job allowing our resource manager to re-optimize allocation decisions to running jobs as new jobs arrive, or a running job terminates.   We also propose a performance modeling scheme that estimates the essential power characteristics of a job at any scale. The proposed online resource manager uses these performance characteristics for making scheduling and resource allocation decisions that maximize the job throughput of the supercomputer under a given power budget. We demonstrate the benefits of our approach by using a mix of jobs with different power-response characteristics. We show that with a power budget of 4.75 MW, we can obtain up to 5.2X improvement in job throughput when compared with the SLURM scheduling policy that is power-unaware. We corroborate our results with real experiments on a relatively small scale cluster, in which we obtain a 1.7X improvement.", "citation": "Citations (96)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Osman Sarood.....http://dblp.org/pers/hd/s/Sarood:Osman", "Akhil Langer.....http://dblp.org/pers/hd/l/Langer:Akhil", "Abhishek Gupta.....http://dblp.org/pers/hd/g/Gupta:Abhishek", "Laxmikant V. Kalé.....http://dblp.org/pers/hd/k/Kal=eacute=:Laxmikant_V="], "conf": "sc", "year": "2014", "pages": 12}