{"title": "Delay guaranteed live migration of Virtual Machines.", "fields": ["load balancing", "workload", "live migration", "virtualization", "downtime"], "abstract": "The proliferation of cloud services makes virtualization technology more important. One important feature of virtualization is live Virtual Machine (VM) migration, which can be employed to facilitate load balancing, fault management and server maintenance etc.. Two main metrics of evaluating a live VM migration mechanism are total migration time and downtime. The existing literature on live VM migration mainly focus on designing migration mechanisms to shorten these two metrics or making a tradeoff between them. Few of them can be applied to the applications with delay requirements, such as, delay-sensitive web services or a VM backup process that needs to be done in a specific time. This will not only negatively impact the user experiences, but also reduce the profit of cloud service providers. Besides, the frequently varied bandwidth required by the widely used pre-copy mechanism is difficult to be provided by current network technologies. In this work, we theoretically analyze how much bandwidth is required to guarantee the total migration time and downtime of a live VM migration. We first propose a deterministic-based model as a simple example, then assume that the dirtying frequency of each page obeys the bernoulli distribution. At last, we analyze the statistic features of the typical workload running in a VM and build a reciprocal-based workload model, and theoretically give the required bandwidth value to satisfy the performance metrics of a live VM migration. The experimental results demonstrate that the bandwidth obtained from the reciprocal-based model can guarantee the expected total migration time and downtime.", "citation": "Citations (26)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Jiao Zhang.....http://dblp.org/pers/hd/z/Zhang:Jiao", "Fengyuan Ren.....http://dblp.org/pers/hd/r/Ren:Fengyuan", "Chuang Lin.....http://dblp.org/pers/hd/l/Lin:Chuang"], "conf": "infocom", "year": "2014", "pages": 9}