{"title": "Statistical symbolic execution with informed sampling.", "fields": ["probabilistic analysis of algorithms", "symbolic execution", "sampling", "model checking", "symbolic data analysis", "computer science", "concolic testing", "theoretical computer science"], "abstract": "Symbolic execution techniques have been proposed recently for the probabilistic analysis of programs. These techniques seek to quantify the likelihood of reaching program events of interest, e.g., assert violations. They have many promising applications but have scalability issues due to high computational demand. To address this challenge, we propose a statistical symbolic execution technique that performs Monte Carlo sampling of the symbolic program paths and uses the obtained information for Bayesian estimation and hypothesis testing with respect to the probability of reaching the target events. To speed up the convergence of the statistical analysis, we propose Informed Sampling, an iterative symbolic execution that first explores the paths that have high statistical significance, prunes them from the state space and guides the execution towards less likely paths. The technique combines Bayesian estimation with a partial exact analysis for the pruned paths leading to provably improved convergence of the statistical analysis. We have implemented statistical symbolic execution with informed sampling in the Symbolic PathFinder tool. We show experimentally that the informed sampling obtains more precise results and converges faster than a purely statistical analysis and may also be more efficient than an exact symbolic analysis. When the latter does not terminate symbolic execution with informed sampling can give meaningful results under the same time and memory limits.", "citation": "Citations (11)", "departments": ["University of Stuttgart", "Ames Research Center", "Stellenbosch University", "Stellenbosch University"], "authors": ["Antonio Filieri.....http://dblp.org/pers/hd/f/Filieri:Antonio", "Corina S. Pasareanu.....http://dblp.org/pers/hd/p/Pasareanu:Corina_S=", "Willem Visser.....http://dblp.org/pers/hd/v/Visser:Willem", "Jaco Geldenhuys.....http://dblp.org/pers/hd/g/Geldenhuys:Jaco"], "conf": "sigsoft", "year": "2014", "pages": 12}