{"title": "Assurable, transparent, and mutual restraining e-voting involving multiple conflicting parties.", "fields": ["bullet voting", "disapproval voting", "voting trust", "cardinal voting systems", "voting"], "abstract": "E-voting techniques and systems have not been widely accepted and deployed by society due to various concerns and problems. One particular issue associated with many existing e-voting techniques is the lack of transparency, leading to the failure to deliver voter assurance. In this work, we propose an assurable, transparent, and mutual restraining e-voting protocol that exploits the existing two-party political dynamics in the US. The proposed e-voting protocol consists of three original technical contributions - universal verifiable voting vector, for- ward and backward mutual lock voting, and in-process check and enforcement - that, in combination, resolves the apparent conflicts in voting such as anonymity vs. accountability and privacy vs. verifiability. Especially, the trust is split equally among tallying authorities who have conflicting interests and will technically restrain each other. The voting and tallying processes are transparent to voters and any third party, which allow any voter to verify that his vote is indeed counted and also allow any third party to audit the tally. Index Terms—E-voting, Verifiability, Anonymity, Privacy, As- surance, Transparency, Mutual restraining voting", "citation": "Citations (4)", "departments": ["Indiana University – Purdue University Indianapolis", "Indiana University – Purdue University Indianapolis", "Indiana University – Purdue University Indianapolis", "Indiana University – Purdue University Indianapolis", "Indiana University – Purdue University Indianapolis"], "authors": ["Xukai Zou.....http://dblp.org/pers/hd/z/Zou:Xukai", "Huian Li.....http://dblp.org/pers/hd/l/Li:Huian", "Yan Sui.....http://dblp.org/pers/hd/s/Sui:Yan", "Wei Peng.....http://dblp.org/pers/hd/p/Peng:Wei", "Feng Li.....http://dblp.org/pers/hd/l/Li_0001:Feng"], "conf": "infocom", "year": "2014", "pages": 9}