{"title": "Achieving differential privacy of data disclosure in the smart grid.", "fields": ["differential privacy", "smart meter", "grid", "usage data", "privacy software"], "abstract": "The smart grid introduces new privacy implications to individuals and their family due to the fine-grained usage data collection. For example, smart metering data could reveal highly accurate real-time home appliance energy load, which may be used to infer the human activities inside the houses. One effective way to hide actual appliance loads from the outsiders is Battery-based Load Hiding (BLH), in which a battery is installed for each household and smartly controlled to store and supply power to the appliances. Even though such technique has been demonstrated useful and can prevent certain types of attacks, none of existing BLH works can provide probably privacy-preserving mechanisms. In this paper, we investigate the privacy of smart meters via differential privacy. We first analyze the current existing BLH methods and show that they cannot guarantee differential privacy in the BLH problem. We then propose a novel randomized BLH algorithm which successfully assures differential privacy, and further propose the Multitasking-BLH-Exp3 algorithm which adaptively updates the BLH algorithm based on the context and the constraints. Results from extensive simulations show the efficiency and effectiveness of the proposed method over existing BLH methods. Index Terms—Smart Grid, Smart Meter, Privacy, Differential Privacy, Data Disclosure", "citation": "Citations (67)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "University of North Carolina at Charlotte", "Illinois Institute of Technology"], "authors": ["Jing Zhao.....http://dblp.org/pers/hd/z/Zhao:Jing", "Taeho Jung.....http://dblp.org/pers/hd/j/Jung:Taeho", "Yu Wang.....http://dblp.org/pers/hd/w/Wang_0003:Yu", "Xiangyang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiangyang"], "conf": "infocom", "year": "2014", "pages": 9}