{"title": "Music Emotion Recognition by Multi-label Multi-layer Multi-instance Multi-view Learning.", "fields": ["affect", "bayesian inference", "pop music automation", "lyrics", "emotion recognition"], "abstract": "Music emotion recognition, which aims to automatically recognize the affective content of a piece of music, has become one of the key components of music searching, exploring, and social networking applications. Although researchers have given more and more attention to music emotion recognition studies, the recognition performance has come to a bottleneck in recent years. One major reason is that experts' labels for music emotion are mostly song-level, while music emotion usually varies within a song. Traditional methods have considered each song as a single instance and have built models based on song-level features. However, they ignored the dynamics of music emotion and failed to capture accurate emotion-feature correlations. In this paper, we model music emotion recognition as a novel multi-label multi-layer multi-instance multi-view learning problem: music is formulated as a hierarchical multi-instance structure (e.g., song-segment-sentence) where multiple emotion labels correspond to at least one of the instances with multiple views of each layer. We propose a Hierarchical Music Emotion Recognition model (HMER) -- a novel hierarchical Bayesian model using sentence-level music and lyrics features. It captures music emotion dynamics with a song-segment-sentence hierarchical structure. HMER also considers emotion correlations between both music segments and sentences. Experimental results show that HMER outperforms several state-of-the-art methods in terms of $F_1$ score and mean average precision.", "citation": "Citations (23)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Bin Wu.....http://dblp.org/pers/hd/w/Wu:Bin", "Erheng Zhong.....http://dblp.org/pers/hd/z/Zhong:Erheng", "Andrew Horner.....http://dblp.org/pers/hd/h/Horner:Andrew", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "mm", "year": "2014", "pages": 10}