{"title": "CrowdCleaner: Data cleaning for multi-version data on the web via crowdsourcing.", "fields": ["crowdsourcing", "crowdsourcing software development", "information integration", "crowds", "data integration"], "abstract": "Multi-version data is often one of the most concerned information on the Web since this type of data is usually updated frequently. Even though there exist some Web information integration systems that try to maintain the latest update version, the maintained multi-version data usually includes inaccurate and invalid information due to the data integration or update delay errors. In this demo, we present CrowdCleaner, a smart data cleaning system for cleaning multi-version data on the Web, which utilizes crowdsourcing-based approaches for detecting and repairing errors that usually cannot be solved by traditional data integration and cleaning techniques. In particular, CrowdCleaner blends active and passive crowdsourcing methods together for rectifying errors for multi-version data. We demonstrate the following four facilities provided by CrowdCleaner: (1) an error-monitor to find out which items (e.g., submission date, price of real estate, etc.) are wrong versions according to the reports from the crowds, which belongs to a passive crowdsourcing strategy; (2) a task-manager to allocate the tasks to human workers intelligently; (3) a smart-decision-maker to identify which answer from the crowds is correct with active crowdsourcing methods; and (4) a whom-to-ask-finder to discover which users (or human workers) should be the most credible according to their answer records.", "citation": "Citations (53)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Yongxin Tong.....http://dblp.org/pers/hd/t/Tong:Yongxin", "Caleb Chen Cao.....http://dblp.org/pers/hd/c/Cao:Caleb_Chen", "Chen Jason Zhang.....http://dblp.org/pers/hd/z/Zhang:Chen_Jason", "Yatao Li.....http://dblp.org/pers/hd/l/Li:Yatao", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei"], "conf": "icde", "year": "2014", "pages": 4}