{"title": "Pipelining Computational Stages of the Tomographic Reconstructor for Multi-Object Adaptive Optics on a Multi-GPU System.", "fields": ["deformable mirror", "pipeline", "general purpose computing on graphics processing units", "speedup", "runtime system"], "abstract": "The European Extremely Large Telescope project (E-ELT) is one of Europe's highest priorities in ground-based astronomy. ELTs are built on top of a variety of highly sensitive and critical astronomical instruments. In particular, a new instrument called MOSAIC has been proposed to perform multi-object spectroscopy using the Multi-Object Adaptive Optics (MOAO) technique. The core implementation of the simulation lies in the intensive computation of a tomographic reconstruct or (TR), which is used to drive the deformable mirror in real time from the measurements. A new numerical algorithm is proposed (1) to capture the actual experimental noise and (2) to substantially speed up previous implementations by exposing more concurrency, while reducing the number of floating-point operations. Based on the Matrices Over Runtime System at Exascale numerical library (MORSE), a dynamic scheduler drives all computational stages of the tomographic reconstruct or simulation and allows to pipeline and to run tasks out-of order across different stages on heterogeneous systems, while ensuring data coherency and dependencies. The proposed TR simulation outperforms asymptotically previous state-of-the-art implementations up to 13-fold speedup. At more than 50000 unknowns, this appears to be the largest-scale AO problem submitted to computation, to date, and opens new research directions for extreme scale AO simulations.", "citation": "Citations (8)", "year": "2014", "departments": ["King Abdullah University of Science and Technology", "King Abdullah University of Science and Technology", "Centre national de la recherche scientifique", "King Abdullah University of Science and Technology", "Centre national de la recherche scientifique"], "conf": "sc", "authors": ["Ali Charara.....http://dblp.org/pers/hd/c/Charara:Ali", "Hatem Ltaief.....http://dblp.org/pers/hd/l/Ltaief:Hatem", "Damien Gratadour.....http://dblp.org/pers/hd/g/Gratadour:Damien", "David E. Keyes.....http://dblp.org/pers/hd/k/Keyes:David_E=", "Arnaud Sevin.....http://dblp.org/pers/hd/s/Sevin:Arnaud", "Ahmad Abdelfattah.....http://dblp.org/pers/hd/a/Abdelfattah:Ahmad", "Eric Gendron.....http://dblp.org/pers/hd/g/Gendron:Eric", "Carine Morel.....http://dblp.org/pers/hd/m/Morel:Carine", "Fabrice Vidal.....http://dblp.org/pers/hd/v/Vidal:Fabrice"], "pages": 12}