{"title": "Anchor-free backscatter positioning for RFID tags with high accuracy.", "fields": ["access control", "feasible region", "software deployment", "directional antenna", "rss"], "abstract": "RFID technology has been widely adopted in a variety of applications from logistics to access control. Many applications gain benefits from knowing the exact position of an RFID-tagged object. Existing localization algorithms in wireless network, however, can hardly be directly employed due to tag's limited capabilities in terms of energy and memory. For example, the RSS based methods are vulnerable to both distance and tag orientation, while AOA based methods put a strict constraint on the antennas' spacing that reader's directional antennas are too large to meet. In this paper, we propose BackPos, a fine-grained backscatter positioning technique using the COTS RFID products with detected phase. Our study shows that the phase is indeed a stable indicator highly related to tag's position and preserved over frequency or tag orientation, but challenged by its periodicity and tag's diversity. We attempt to infer the distance differences from phases detected by antennas under triangle constraint. Further, hyperbolic positioning using the distance differences is employed to shrink the tag's candidate positions until filtering out the real one. In combination with interrogation zone, we finally relax the triangle constraint and allow arbitrary deployment of antennas by sacrificing the feasible region. We implement a prototype of BackPos with COTS RFID products and evaluate this design in various scenarios. The results show that BackPos achieves the mean accuracy of 12 .8cm with variance of 3.8cm .", "citation": "Citations (89)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Hong Kong University of Science and Technology", "Tsinghua University"], "authors": ["Tianci Liu.....http://dblp.org/pers/hd/l/Liu:Tianci", "Lei Yang.....http://dblp.org/pers/hd/y/Yang_0025:Lei", "Qiongzheng Lin.....http://dblp.org/pers/hd/l/Lin:Qiongzheng", "Yi Guo.....http://dblp.org/pers/hd/g/Guo:Yi", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2014", "pages": 9}