{"title": "WebCore: Architectural support for mobile Web browsing.", "fields": ["client side scripting", "mobile web", "web based simulation", "web api", "mobile search"], "abstract": "The Web browser is undoubtedly the single most impor- tant application in the mobile ecosystem. An average user spends 72 minutes each day using the mobile Web browser. nWeb browser internal engines (e.g., WebKit) are also growing in importance because they provide a common substrate for developing various mobile Web applications. In a user-driven, interactive, and latency-sensitive environment, the browser's performance is crucial. However, the battery-constrained nature of mobile devices limits the performance that we can de- liver for mobile Web browsing. As traditional general-purpose techniques to improve performance and energy efficiency fall short, we must employ domain-specific knowledge while still maintaining general-purpose flexibility   In this paper, we first perform design-space exploration to identify appropriate general-purpose architectures that uniquely fit the characteristics of a popular Web browsing engine. Despite our best effort, we discover sources of energy inefficiency in these customized general-purpose architectures. To mitigate these inefficiencies, we propose, synthesize, and evaluate two new domain-specific specializations, called the Style Resolution Unit and the Browser Engine Cache. Our opti- mizations boost energy efficiency and at the same time improve mobile Web browsing performance. As emerging mobile work- loads increasingly rely more on Web browser technologies, the type of optimizations we propose will become important in the future and are likely to have lasting widespread impact", "citation": "Citations (30)", "departments": ["University of Texas at Austin", "University of Texas at Austin"], "authors": ["Yuhao Zhu.....http://dblp.org/pers/hd/z/Zhu:Yuhao", "Vijay Janapa Reddi.....http://dblp.org/pers/hd/r/Reddi:Vijay_Janapa"], "conf": "isca", "year": "2014", "pages": 12}