{"title": "Focus-shifting patterns of OSS developers and their congruence with call graphs.", "fields": ["directory", "commit", "congruence", "software quality", "call graph"], "abstract": "Developers in complex, self-organized open-source projects often work on many different files, and over time switch focus between them. Shifting focus can have impact on the software quality and productivity, and is thus an important topic of investigation. In this paper, we study focus shifting patterns (FSPs) of developers by comparing trace data from a dozen open source software (OSS) projects of their longitudinal commit activities and file dependencies from the projects call graphs. Using information theoretic measures of network structure, we find that fairly complex focus-shifting patterns emerge, and FSPs in the same project are more similar to each other. We show that developers tend to shift focus along with, rather than away from, software dependency links described by the call graphs. This tendency becomes weaker as either the interval between successive commits, or the organizational distance between committed files (i.e. directory distance), gets larger. Interestingly, this tendency appears stronger with more productive developers. We hope our study will initiate interest in further understanding of FSPs, which can ultimately help to (1) improve current recommender systems to predict the next focus of developers, and (2) provide insight into better call graph design, so as to facilitate developers' work.", "citation": "Citations (11)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["Qi Xuan.....http://dblp.org/pers/hd/x/Xuan:Qi", "Aaron Okano.....http://dblp.org/pers/hd/o/Okano:Aaron", "Premkumar T. Devanbu.....http://dblp.org/pers/hd/d/Devanbu:Premkumar_T=", "Vladimir Filkov.....http://dblp.org/pers/hd/f/Filkov:Vladimir"], "conf": "sigsoft", "year": "2014", "pages": 12}