{"title": "Search-based synthesis of equivalent method sequences.", "fields": ["search based software engineering", "component based software engineering", "finite set", "metamorphic testing", "exploit"], "abstract": "Software components are usually redundant, since their interface offers different operations that are equivalent in their functional behavior. Several reliability techniques exploit this redundancy to either detect or tolerate faults in software. Metamorphic testing, for instance, executes pairs of sequences of operations that are expected to produce equivalent results, and identifies faults in case of mismatching outcomes. Some popular fault tolerance and self-healing techniques execute redundant operations in an attempt to avoid failures at runtime. The common assumption of these techniques, though, is that such redundancy is known a priori. This means that the set of operations that are supposed to be equivalent in a given component should be available in the specifications. Unfortunately, inferring this information manually can be expensive and error prone. This paper proposes a search-based technique to synthesize sequences of method invocations that are equivalent to a target method within a finite set of execution scenarios. The experimental results obtained on 47 methods from 7 classes show that the proposed approach correctly identifies equivalent method sequences in the majority of the cases where redundancy was known to exist, with very few false positives.", "citation": "Citations (16)", "departments": ["University of Lugano", "Saarland University", "University of Lugano", "University of Lugano", "fondazione bruno kessler"], "authors": ["Alberto Goffi.....http://dblp.org/pers/hd/g/Goffi:Alberto", "Alessandra Gorla.....http://dblp.org/pers/hd/g/Gorla:Alessandra", "Andrea Mattavelli.....http://dblp.org/pers/hd/m/Mattavelli:Andrea", "Mauro Pezzè.....http://dblp.org/pers/hd/p/Pezz=egrave=:Mauro", "Paolo Tonella.....http://dblp.org/pers/hd/t/Tonella:Paolo"], "conf": "sigsoft", "year": "2014", "pages": 11}