{"title": "Prices Matter for the Parameterized Complexity of Shift Bribery.", "fields": ["minimax", "computational social choice", "mathematical economics", "computational complexity theory", "mathematical optimization", "voting", "parameterized complexity"], "abstract": "In the SHIFT BRIBERY problem, we are given an election (based on preference orders), a preferred candidate p, and a budget. The goal is to ensure that p wins by shifting p higher in some voters' preference orders. However, each such shift request comes at a price (depending on the voter and on the extent of the shift) and we must not exceed the given budget. We study the parameterized computational complexity of SHIFT BRIBERY with respect to a number of parameters (pertaining to the nature of the solution sought and the size of the election) and several classes of price functions. When we parameterize SHIFT BRIBERY by the number of affected voters, then for each of our voting rules (Borda, Maximin, Copeland) the problem is W[2]-hard. If, instead, we parameterize by the number of positions by which p is shifted in total, then the problem is fixed-parameter tractable for Borda and Maximin, and is W[1]-hard for Copeland. If we parameterize by the budget for the cost of shifting, then the results depend on the price function class. We also show that SHIFT BRIBERY tends to be tractable when parameterized by the number of voters, but that the results for the number of candidates are more enigmatic.", "citation": "Citations (22)", "departments": ["Technical University of Berlin", "Technical University of Berlin", "AGH University of Science and Technology", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "AGH University of Science and Technology", "Technical University of Berlin", "Technical University of Berlin"], "authors": ["Robert Bredereck.....http://dblp.org/pers/hd/b/Bredereck:Robert", "Jiehua Chen.....http://dblp.org/pers/hd/c/Chen:Jiehua", "Piotr Faliszewski.....http://dblp.org/pers/hd/f/Faliszewski:Piotr", "André Nichterlein.....http://dblp.org/pers/hd/n/Nichterlein:Andr=eacute=", "Rolf Niedermeier.....http://dblp.org/pers/hd/n/Niedermeier:Rolf"], "conf": "aaai", "year": "2014", "pages": 7}