{"title": "General-purpose code acceleration with limited-precision analog computation.", "fields": ["compiler", "von neumann architecture", "speedup", "computation", "analogue electronics"], "abstract": "As improvements in per-transistor speed and energy efficiency diminish, radical departures from conventional approaches are becoming critical to improving the performance and energy efficiency of general-purpose processors. We propose a solution--from circuit to compiler-that enables general-purpose use of limited-precision, analog hardwareto accelerate \"approximable\" code---code that can tolerate imprecise execution. We utilize an algorithmic transformation that automatically converts approximable regions of code from a von Neumann model to an \"analog\" neural model. We outline the challenges of taking an analog approach, including restricted-range value encoding, limited precision in computation, circuit inaccuracies, noise, and constraints on supported topologies. We address these limitations with a combination of circuit techniques, a hardware/software interface, neuralnetwork training techniques, and compiler support. Analog neural acceleration provides whole application speedup of 3.7x and energy savings of 6.3x with quality loss less than 10% for all except one benchmark. These results show that using limited-precision analog circuits for code acceleration, through a neural approach, is both feasible and beneficial over a range of approximation-tolerant, emerging applications including financial analysis, signal processing, robotics, 3D gaming, compression, and image processing", "citation": "Citations (140)", "departments": ["University of Texas at Austin", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Renée St. Amant.....http://dblp.org/pers/hd/a/Amant:Ren=eacute=e_St=", "Amir Yazdanbakhsh.....http://dblp.org/pers/hd/y/Yazdanbakhsh:Amir", "Jongse Park.....http://dblp.org/pers/hd/p/Park:Jongse", "Bradley Thwaites.....http://dblp.org/pers/hd/t/Thwaites:Bradley", "Hadi Esmaeilzadeh.....http://dblp.org/pers/hd/e/Esmaeilzadeh:Hadi", "Arjang Hassibi.....http://dblp.org/pers/hd/h/Hassibi:Arjang", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Doug Burger.....http://dblp.org/pers/hd/b/Burger:Doug"], "conf": "isca", "year": "2014", "pages": 12}