{"title": "Software developers' perceptions of productivity.", "fields": ["crowdsourcing software development", "team software process", "software walkthrough", "software engineering process group", "software peer review"], "abstract": "The better the software development community becomes at creating software, the more software the world seems to demand. Although there is a large body of research about measuring and investigating productivity from an organizational point of view, there is a paucity of research about how software developers, those at the front-line of software construction, think about, assess and try to improve their productivity. To investigate software developers' perceptions of software development productivity, we conducted two studies: a survey with 379 professional software developers to help elicit themes and an observational study with 11 professional software developers to investigate emergent themes in more detail. In both studies, we found that developers perceive their days as productive when they complete many or big tasks without significant interruptions or context switches. Yet, the observational data we collected shows our participants performed significant task and activity switching while still feeling productive. We analyze such apparent contradictions in our findings and use the analysis to propose ways to better support software developers in a retrospection and improvement of their productivity through the development of new tools and the sharing of best practices.", "citation": "Citations (74)", "departments": ["University of Zurich", "University of Zurich", "University of British Columbia", "Microsoft"], "authors": ["André N. Meyer.....http://dblp.org/pers/hd/m/Meyer:Andr=eacute=_N=", "Thomas Fritz.....http://dblp.org/pers/hd/f/Fritz:Thomas", "Gail C. Murphy.....http://dblp.org/pers/hd/m/Murphy:Gail_C=", "Thomas Zimmermann.....http://dblp.org/pers/hd/z/Zimmermann_0001:Thomas"], "conf": "sigsoft", "year": "2014", "pages": 11}