{"title": "Optimizing queries over partitioned tables in MPP systems.", "fields": ["query by example", "spatial query", "view", "sargable", "query plan"], "abstract": "Partitioning of tables based on value ranges provides a powerful mechanism to organize tables in database systems. In the context of data warehousing and large-scale data analysis partitioned tables are of particular interest as the nature of queries favors scanning large swaths of data. In this scenario, eliminating partitions from a query plan that contain data not relevant to answering a given query can represent substantial performance improvements. Dealing with partitioned tables in query optimization has attracted significant attention recently, yet, a number of challenges unique to Massively Parallel Processing (MPP) databases and their distributed nature remain unresolved. In this paper, we present optimization techniques for queries over partitioned tables as implemented in Pivotal Greenplum Database. We present a concise and unified representation for partitioned tables and devise optimization techniques to generate query plans that can defer decisions on accessing certain partitions to query run-time. We demonstrate, the resulting query plans distinctly outperform conventional query plans in a variety of scenarios.", "citation": "Citations (11)", "year": "2014", "departments": ["Pivotal Inc., P ... o Alto, CA, USA", "Pivotal Inc., P ... o Alto, CA, USA", "Pivotal Inc., P ... o Alto, CA, USA", "Pivotal Inc., P ... o Alto, CA, USA", "Pivotal Inc., P ... o Alto, CA, USA"], "conf": "sigmod", "authors": ["Lyublena Antova.....http://dblp.org/pers/hd/a/Antova:Lyublena", "Amr El-Helw.....http://dblp.org/pers/hd/e/El=Helw:Amr", "Mohamed A. Soliman.....http://dblp.org/pers/hd/s/Soliman:Mohamed_A=", "Zhongxian Gu.....http://dblp.org/pers/hd/g/Gu:Zhongxian", "Michalis Petropoulos.....http://dblp.org/pers/hd/p/Petropoulos:Michalis", "Florian Waas.....http://dblp.org/pers/hd/w/Waas:Florian"], "pages": 12}