{"title": "LiveRender: A Cloud Gaming System Based on Compressed Graphics Streaming.", "fields": ["real time streaming protocol", "video game graphics", "rendering", "video quality", "concurrency", "graphics", "cloud gaming", "alternate frame rendering", "real time computer graphics"], "abstract": "In cloud gaming systems, the game program runs at servers in the cloud, while clients access game services by sending input events to the servers and receiving game scenes via video streaming. In this paradigm, servers are responsible for all performance-intensive operations, and thus suffer from poor scalability. An alternative paradigm is called  graphics streaming , in which graphics commands and data are offloaded to the clients for local rendering, thereby mitigating the server's burden and allowing more concurrent game sessions. Unfortunately, this approach is bandwidth consuming, due to large amounts of graphic commands and geometry data. In this paper, we present LiveRender, an open source gaming system that remedies the problem by implementing a suite of bandwidth optimization techniques including intra-frame compression, inter-frame compression, and caching, establishing what we call  compressed graphics streaming . Experiments results show that the new approach is able to reduce bandwidth consumption by 52-73% compared to raw graphics streaming, with no perceptible difference in video quality and reduced response delay. Compared with the video streaming approach, LiveRender achieves a traffic reduction of 40-90% with even improved video quality and substantially smaller response delay, while enabling higher concurrency at the server.", "citation": "Citations (11)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Chinese Academy of Sciences", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Chinese Academy of Sciences", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Li Lin.....http://dblp.org/pers/hd/l/Lin:Li", "Xiaofei Liao.....http://dblp.org/pers/hd/l/Liao:Xiaofei", "Guang Tan.....http://dblp.org/pers/hd/t/Tan:Guang", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai", "Xiaobin Yang.....http://dblp.org/pers/hd/y/Yang:Xiaobin", "Wei Zhang.....http://dblp.org/pers/hd/z/Zhang_0086:Wei", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "mm", "year": "2014", "pages": 10}