{"title": "Object-Based Visual Sentiment Concept Analysis and Application.", "fields": ["hierarchical control system", "formal concept analysis", "discriminative model", "baseline", "affective computing"], "abstract": "This paper studies the problem of modeling object-based visual concepts such as \"crazy car\" and \"shy dog\" with a goal to extract emotion related information from social multimedia content. We focus on detecting such adjective-noun pairs because of their strong co-occurrence relation with image tags about emotions. This problem is very challenging due to the highly subjective nature of the adjectives like \"crazy\" and \"shy\" and the ambiguity associated with the annotations. However, associating adjectives with concrete physical nouns makes the combined visual concepts more detectable and tractable. We propose a hierarchical system to handle the concept classification in an object specific manner and decompose the hard problem into object localization and sentiment related concept modeling. In order to resolve the ambiguity of concepts we propose a novel classification approach by modeling the concept similarity, leveraging on online commonsense knowledgebase. The proposed framework also allows us to interpret the classifiers by discovering discriminative features. The comparisons between our method and several baselines show great improvement in classification performance. We further demonstrate the power of the proposed system with a few novel applications such as sentiment-aware music slide shows of personal albums.", "citation": "Citations (68)", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "authors": ["Tao Chen.....http://dblp.org/pers/hd/c/Chen:Tao", "Felix X. Yu.....http://dblp.org/pers/hd/y/Yu:Felix_X=", "Jiawei Chen.....http://dblp.org/pers/hd/c/Chen:Jiawei", "Yin Cui.....http://dblp.org/pers/hd/c/Cui:Yin", "Yan-Ying Chen.....http://dblp.org/pers/hd/c/Chen:Yan=Ying", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "conf": "mm", "year": "2014", "pages": 10}