{"title": "CrowdPlanner: A crowd-based route recommendation system.", "fields": ["recommender system", "crowds", "service provider", "big business", "web service"], "abstract": "As travel is taking more significant part in our life, route recommendation service becomes a big business and attracts many major players in IT industry. Given a pair of user-specified origin and destination, a route recommendation service aims to provide users with the routes of best travelling experience according to criteria, such as travelling distance, travelling time, traffic condition, etc. However, previous research shows that even the routes recommended by the big-thumb service providers can deviate significantly from the routes travelled by experienced drivers. It means travellers' preferences on route selection are influenced by many latent and dynamic factors that are hard to model exactly with pre-defined formulas. In this work we approach this challenging problem with a very different perspective- leveraging crowds' knowledge to improve the recommendation quality. In this light, CrowdPlanner - a novel crowd-based route recommendation system has been developed, which requests human workers to evaluate candidate routes recommended by different sources and methods, and determine the best route based on their feedbacks. In this paper, we particularly focus on two important issues that affect system performance significantly: (1) how to efficiently generate tasks which are simple to answer but possess sufficient information to derive user-preferred routes; and (2) how to quickly identify a set of appropriate domain experts to answer the questions timely and accurately. Specifically, the task generation component in our system generates a series of informative and concise questions with optimized ordering for a given candidate route set so that workers feel comfortable and easy to answer. In addition, the worker selection component utilizes a set of selection criteria and an efficient algorithm to find the most eligible workers to answer the questions with high accuracy. A prototype system has been deployed to many voluntary mobile clients and extensive tests on real-scenario queries have shown the superiority of CrowdPlanner in comparison with the results given by map services and popular route mining algorithms.", "citation": "Citations (31)", "departments": ["University of Queensland", "University of Queensland", "Nanjing University", "Hong Kong University of Science and Technology", "SAP Australia"], "authors": ["Han Su.....http://dblp.org/pers/hd/s/Su:Han", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Jiamin Huang.....http://dblp.org/pers/hd/h/Huang:Jiamin", "Hoyoung Jeung.....http://dblp.org/pers/hd/j/Jeung:Hoyoung", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "icde", "year": "2014", "pages": 12}