{"title": "Pseudorandom generators with optimal seed length for non-boolean poly-size circuits.", "fields": ["statistical distance", "nondeterministic algorithm", "dtime", "pseudorandom number generator", "existential quantification", "entropy", "pseudorandomness"], "abstract": "A sampling procedure for a distribution  P  over {0, 1}  e  , is a function  C : {0, 1}  n   → {0, 1}  e   such that the distribution  C ( U   n  ) (obtained by applying  C  on the uniform distribution  U   n  ) is the \"desired distribution\"  P . Let  n  >  r  ≥  e  =  n  Ω(1) . An  nb-PRG  (defined by Dubrov and Ishai (STOC 2006)) is a function  G : {0, 1}  r   → {0, 1}  n   such that for every  C : {0, 1}  n   → {0, 1}  e   in some class of \"interesting sampling procedures\",  C ' ( U   r  ) =  C ( G ( U   r  )) is close to  C ( U   n  ) in  statistical distance .   We construct poly-time computable nb-PRGs with  r  =  O ( e ) (which is best possible) for poly-size circuits. Previous nb-PRGs of Dubrov and Ishai have  r  = Ω( e  2 ). We rely on the assumption that: there exists  β  > 0, and a problem  L  in E = DTIME(2  O ( n ) ) such that for every large enough  n , nondeterministic circuits of size 2  βn   that have NP-gates cannot solve  L  on inputs of length  n . This assumption is a scaled nonuniform analogue of (the widely believed) EXP ≠ Σ P  2 , and similar assumptions appear in various contexts in derandomization. The nb-PRGs of Dubrov and Ishai are based on very strong cryptographic assumptions, or alternatively, on non-standard assumptions regarding incompressibility of functions on random inputs.   When restricting to poly-size circuits  C : {0, 1}  n   → {0, 1}  e   with Shannon entropy  H ( C ( U   n  )) ≤  k , for e >  k  =  n  Ω(1) , our nb-PRGs have  r  =  O ( k ) which is best possible. The nb-PRGs of Dubrov and Ishai use seed length  r  = Ω( k  2 ) and require that the probability distribution of  C ( U   n  ) is efficiently computable.   Our nb-PRGs follow from a notion of \"conditional PRGs\" which may be of independent interest. These are PRGs where  G ( U   r  ) remains pseudorandom even when conditioned on a \"large\" event { A ( G ( U   r  )) = 1}, for an arbitrary polysize circuit  A . A related notion was considered by Shaltiel and Umans (CCC 2005) in a different setup, and our proofs use ideas from that paper, as well as ideas of Dubrov and Ishai.   We also give an unconditional construction of a poly-time computable nb-PRGs for poly( n )-size, depth  d  circuits  C : {0, 1}  n   → {0, 1}  e   with  r  =  O ( e  · log  d + O (1)  n ). This improves upon the previous work of Dubrov and Ishai that has  r  ≥  e  2 . Our nb-PRGs can be implemented by a uniform family of poly-size constant depth circuits (with slightly larger, but still almost linear seed length). The nb-PRG of Dubrov and Ishai computes large parities and cannot be computed in poly-size and constant depth.   This result follows by adapting a recent PRG construction of Trevisan and Xue (CCC 2013) to the case of nb-PRGs, and implementing it by constant-depth circuits.", "citation": "Not cited", "year": "2014", "departments": ["University of Haifa", "University of Haifa", "University of Haifa", "University of Haifa"], "conf": "stoc", "authors": ["Sergei Artemenko.....http://dblp.org/pers/hd/a/Artemenko:Sergei", "Ronen Shaltiel.....http://dblp.org/pers/hd/s/Shaltiel:Ronen"], "pages": 10}