{"title": "Discriminative coupled dictionary hashing for fast cross-media retrieval.", "fields": ["feature hashing", "k svd", "universal hashing", "hamming space", "locality sensitive hashing"], "abstract": "Cross-media hashing, which conducts cross-media retrieval by embedding data from different modalities into a common low-dimensional Hamming space, has attracted intensive attention in recent years. The existing cross-media hashing approaches only aim at learning hash functions to preserve the intra-modality and inter-modality correlations, but do not directly capture the underlying semantic information of the multi-modal data. We propose a discriminative coupled dictionary hashing (DCDH) method in this paper. In DCDH, the coupled dictionary for each modality is learned with side information (e.g., categories). As a result, the coupled dictionaries not only preserve the intra-similarity and inter-correlation among multi-modal data, but also contain dictionary atoms that are semantically discriminative (i.e., the data from the same category is reconstructed by the similar dictionary atoms). To perform fast cross-media retrieval, we learn hash functions which map data from the dictionary space to a low-dimensional Hamming space. Besides, we conjecture that a balanced representation is crucial in cross-media retrieval. We introduce multi-view features on the relatively ``weak'' modalities into DCDH and extend it to multi-view DCDH (MV-DCDH) in order to enhance their representation capability. The experiments on two real-world data sets show that our DCDH and MV-DCDH outperform the state-of-the-art methods significantly on cross-media retrieval.", "citation": "Citations (67)", "departments": ["Zhejiang University", "Zhejiang University", "University of Queensland", "University of Texas at San Antonio", "University of Rochester"], "authors": ["Zhou Yu.....http://dblp.org/pers/hd/y/Yu:Zhou", "Fei Wu.....http://dblp.org/pers/hd/w/Wu_0001:Fei", "Yi Yang.....http://dblp.org/pers/hd/y/Yang_0001:Yi", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo", "Yueting Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yueting"], "conf": "sigir", "year": "2014", "pages": 10}