{"title": "Geometry approach for k-regret query.", "fields": ["ranking", "web query classification", "range query", "sargable", "spatial query"], "abstract": "Returning tuples that users may be interested in is one of the most important goals for multi-criteria decision making. Top-k queries and skyline queries are two representative queries. A top-k query has its merit of returning a limited number of tuples to users but requires users to give their exact utility functions. A skyline query has its merit that users do not need to give their exact utility functions but has no control over the number of tuples to be returned. In this paper, we study a k-regret query, a recently proposed query, which integrates the merits of the two representative queries. We first identify some interesting geometry properties for the k-regret query. Based on these properties, we define a set of candidate points called happy points for the k-regret query, which has not been studied in the literature. This result is very fundamental and beneficial to not only all existing algorithms but also all new algorithms to be developed for the k-regret query. Since it is found that the number of happy points is very small, the efficiency of all existing algorithms can be improved significantly. Furthermore, based on other geometry properties, we propose two efficient algorithms each of which performs more efficiently than the best-known fastest algorithm. Our experimental results show that our proposed algorithms run faster than the best-known method on both synthetic and real datasets. In particular, in our experiments on real datasets, the best-known method took more than 3 hours to answer a k-regret query but one of our proposed methods took about a few minutes and the other took within a second.", "citation": "Citations (7)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Peng Peng.....http://dblp.org/pers/hd/p/Peng_0002:Peng", "Raymond Chi-Wing Wong.....http://dblp.org/pers/hd/w/Wong:Raymond_Chi=Wing"], "conf": "icde", "year": "2014", "pages": 12}