{"title": "Primal beats dual on online packing LPs in the random-order model.", "fields": ["bounded function", "online algorithm", "online model", "competitive analysis", "generalized assignment problem"], "abstract": "We study packing LPs in an online model where the columns are presented to the algorithm in random order. This natural problem was investigated in various recent studies motivated, e.g., by online ad allocations and yield management where rows correspond to resources and columns to requests specifying demands for resources. Our main contribution is a 1 --  O (√(log d/B))-competitive online algorithm. Here  d  denotes the  column sparsity , i.e., the maximum number of resources that occur in a single column, and  B  denotes the  capacity ratio B , i.e., the ratio between the capacity of a resource and the maximum demand for this resource. In other words, we achieve a (1--e)-approximation if the capacity ratio satisfies B=Ω(logd/e 2 ), which is known to be best-possible for any (randomized) online algorithms.   Our result improves exponentially on previous work with respect to the capacity ratio. In contrast to existing results on packing LP problems, our algorithm does not use dual prices to guide the allocation of resources over time. Instead, the algorithm simply solves, for each request, a scaled version of the partially known primal program and randomly rounds the obtained fractional solution to obtain an integral allocation for this request. We show that this simple algorithmic technique is not restricted to packing LPs with large capacity ratio of order Ω(log d ), but it also yields close-to-optimal competitive ratios if the capacity ratio is bounded by a constant. In particular, we prove an upper bound on the competitive ratio of Ω( d  --1/( B --1) ), for any  B  ≥ 2. In addition, we show that our approach can be combined with VCG payments and obtain an incentive compatible (1 -- e)-competitive mechanism for packing LPs with  B  = Ω(log m /e; 2 ), where  m  is the number of constraints. Finally, we apply our technique to the generalized assignment problem for which we obtain the first online algorithm with competitive ratio  O (1).", "citation": "Citations (36)", "year": "2014", "departments": ["Cornell University", "RWTH Aachen University", "RWTH Aachen University", "RWTH Aachen University"], "conf": "stoc", "authors": ["Thomas Kesselheim.....http://dblp.org/pers/hd/k/Kesselheim:Thomas", "Klaus Radke.....http://dblp.org/pers/hd/r/Radke:Klaus", "Andreas Tönnis.....http://dblp.org/pers/hd/t/T=ouml=nnis:Andreas", "Berthold Vöcking.....http://dblp.org/pers/hd/v/V=ouml=cking:Berthold"], "pages": 10}