{"title": "Learning and Transferring Mid-level Image Representations Using Convolutional Neural Networks.", "fields": ["contextual image classification", "effi", "convolutional neural network", "training set", "machine learning"], "abstract": "Convolutional neural networks (CNN) have recently shown outstanding image classification performance in the large- scale visual recognition challenge (ILSVRC2012). The suc- cess of CNNs is attributed to their ability to learn rich mid- level image representations as opposed to hand-designed low-level features used in other image classification meth- ods. Learning CNNs, however, amounts to estimating mil- lions of parameters and requires a very large number of annotated image samples. This property currently prevents application of CNNs to problems with limited training data. In this work we show how image representations learned with CNNs on large-scale annotated datasets can be effi- ciently transferred to other visual recognition tasks with limited amount of training data. We design a method to reuse layers trained on the ImageNet dataset to compute mid-level image representation for images in the PASCAL VOC dataset. We show that despite differences in image statistics and tasks in the two datasets, the transferred rep- resentation leads to significantly improved results for object and action classification, outperforming the current state of the art on Pascal VOC 2007 and 2012 datasets. We also show promising results for object and action localization.", "citation": "Citations (1,306)", "year": "2014", "departments": ["French Institute for Research in Computer Science and Automation", "Microsoft", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "conf": "cvpr", "authors": ["Maxime Oquab.....http://dblp.org/pers/hd/o/Oquab:Maxime", "Léon Bottou.....http://dblp.org/pers/hd/b/Bottou:L=eacute=on", "Ivan Laptev.....http://dblp.org/pers/hd/l/Laptev:Ivan", "Josef Sivic.....http://dblp.org/pers/hd/s/Sivic:Josef"], "pages": 8}