{"title": "Dynamic pricing and profit maximization for the cloud with geo-distributed data centers.", "fields": ["profit maximization", "dynamic pricing", "provisioning", "online algorithm", "job scheduler"], "abstract": "Cloud providers often choose to operate datacenters over a large geographic span, in order that users may be served by resources in their proximity. Due to time and spatial diversities in utility prices and operational costs, different datacenters typically have disparate charges for the same services. Cloud users are free to choose the datacenters to run their jobs, based on a joint consideration of monetary charges and quality of service. A fundamental problem with significant economic implications is how the cloud should price its datacenter resources at different locations, such that its overall profit is maximized. The challenge escalates when dynamic resource pricing is allowed and long-term profit maximization is pursued. We design an efficient online algorithm for dynamic pricing of VM resources across datacenters in a geo-distributed cloud, together with job scheduling and server provisioning in each datacenter, to maximize the profit of the cloud provider over a long run. Theoretical analysis shows that our algorithm can schedule jobs within their respective deadlines, while achieving a time-average overall profit closely approaching the offline maximum, which is computed by assuming that perfect information on future job arrivals are freely available. Empirical studies further verify the efficacy of our online profit maximizing algorithm.", "citation": "Citations (63)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong"], "authors": ["Jian Zhao.....http://dblp.org/pers/hd/z/Zhao:Jian", "Hongxing Li.....http://dblp.org/pers/hd/l/Li:Hongxing", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Zhizhong Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhizhong", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2014", "pages": 9}