{"title": "One DBMS for all: the brawny few and the wimpy crowd.", "fields": ["codebase", "memory footprint", "online analytical processing", "megabyte", "online transaction processing"], "abstract": "Shipments of smartphones and tablets with wimpy CPUs are outpacing brawny PC and server shipments by an ever-increasing margin. While high performance database systems have traditionally been optimized for brawny systems, wimpy systems have received only little attention; leading to poor performance and energy inefficiency on such systems.   This demonstration presents HyPer, a high-performance hybrid OLTP&OLAP main memory database system that we optimized for both, brawny and wimpy systems. The efficient compilation of transactions and queries into efficient machine code allows for high performance, independent of the target platform. HyPer has a memory footprint of just a few megabytes, even though it supports the SQL-92 standard, a PL/SQL-like scripting language, and ACID-compliant transactions. It is the goal of this demonstration to showcase the same HyPer codebase running on (a) a wimpy ARM-based smartphone system and (b) a brawny x86-64-based server system. In particular, we run the TPC-C, TPC-H, and a combined CH-benCHmark and report performance and energy numbers. The demonstration further allows the interactive execution of arbitrary SQL queries and the visualization of optimized query plans.", "citation": "Citations (8)", "year": "2014", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "Technische Universität München", "Technische Universität München"], "conf": "sigmod", "authors": ["Tobias Mühlbauer.....http://dblp.org/pers/hd/m/M=uuml=hlbauer:Tobias", "Wolf Rödiger.....http://dblp.org/pers/hd/r/R=ouml=diger:Wolf", "Robert Seilbeck.....http://dblp.org/pers/hd/s/Seilbeck:Robert", "Angelika Reiser.....http://dblp.org/pers/hd/r/Reiser:Angelika", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas"], "pages": 4}