{"title": "Delay-constrained caching in cognitive radio networks.", "fields": ["cognitive radio", "distributed computing", "cognitive network", "computer network", "cache", "transmission delay", "computer science", "bounded function", "total cost"], "abstract": "In cognitive radio networks, unlicensed users can use under-utilized licensed spectrum to achieve substantial performance improvement. To avoid interference with licensed users, unlicensed users must vacate the spectrum when it is accessed by licensed (primary) users. Since it takes some time for unlicensed users to switch to other available channels, the ongoing data transmissions may have to be interrupted and the transmission delay can be significantly increased. This makes it hard for cognitive radio networks to meet the delay constraints of many applications. In this paper, we develop caching techniques to address this problem. We formulate the cache placement problem in cognitive radio networks as an optimization problem, where the goal is to minimize the total cost, subject to some delay constraint, i.e., the data access delay can be statistically bounded. To solve this problem, we propose a cost-based approach to minimize the caching cost, and design a delay-based approach to satisfy the delay constraint. Then, we combine them and propose a distributed hybrid approach to minimize the caching cost subject to the delay constraint. Simulation results show that our approaches outperform existing caching solutions in terms of total cost and delay constraint, and the hybrid approach performs the best among the approaches satisfying the delay constraint.", "citation": "Citations (11)", "departments": ["Pennsylvania State University", "University of Tennessee", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "University of Tennessee", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Jing Zhao.....http://dblp.org/pers/hd/z/Zhao_0001:Jing", "Wei Gao.....http://dblp.org/pers/hd/g/Gao_0006:Wei", "Yi Wang.....http://dblp.org/pers/hd/w/Wang_0014:Yi", "Guohong Cao.....http://dblp.org/pers/hd/c/Cao:Guohong"], "conf": "infocom", "year": "2014", "pages": 9}