{"title": "Stranger danger: exploring the ecosystem of ad-based URL shortening services.", "fields": ["commission", "url shortening", "earnings", "html5", "malware"], "abstract": "URL shortening services facilitate the need of exchanging long URLs using limited space, by creating compact URL aliases that redirect users to the original URLs when followed. Some of these services show advertisements (ads) to link-clicking users and pay a commission of their advertising earnings to link-shortening users.   In this paper, we investigate the ecosystem of these increasingly popular ad-based URL shortening services. Even though traditional URL shortening services have been thoroughly investigated in previous research, we argue that, due to the monetary incentives and the presence of third-party advertising networks, ad-based URL shortening services and their users are exposed to more hazards than traditional shortening services. By analyzing the services themselves, the advertisers involved, and their users, we uncover a series of issues that are actively exploited by malicious advertisers and endanger the users. Moreover, next to documenting the ongoing abuse, we suggest a series of defense mechanisms that services and users can adopt to protect themselves.", "citation": "Citations (23)", "departments": ["Katholieke Universiteit Leuven", "Polytechnic University of Milan", "University of California, Santa Barbara", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven"], "authors": ["Nick Nikiforakis.....http://dblp.org/pers/hd/n/Nikiforakis:Nick", "Federico Maggi.....http://dblp.org/pers/hd/m/Maggi:Federico", "Gianluca Stringhini.....http://dblp.org/pers/hd/s/Stringhini:Gianluca", "M. Zubair Rafique.....http://dblp.org/pers/hd/r/Rafique:M=_Zubair", "Wouter Joosen.....http://dblp.org/pers/hd/j/Joosen:Wouter", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Frank Piessens.....http://dblp.org/pers/hd/p/Piessens:Frank", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni", "Stefano Zanero.....http://dblp.org/pers/hd/z/Zanero:Stefano"], "conf": "www", "year": "2014", "pages": 12}