{"title": "Settling the APX-Hardness Status for Geometric Set Cover.", "fields": ["regular polygon", "apx", "fundamental class", "dtime", "polygon"], "abstract": "Weighted geometric set-cover problems arise naturally in several geometric and non-geometric settings (e.g. the breakthrough of Bansal and Pruhs (FOCS 2010) reduces a wide class of machine scheduling problems to weighted geometric set-cover). More than two decades of research has succeeded in settling the (1+e)-approximability status for most geometric set-cover problems, except for four basic scenarios which are still lacking. One is that of weighted disks in the plane for which, after a series of papers, Varadarajan (STOC 2010) presented a clever quasi-sampling technique, which together with improvements by Chan et al(SODA 2012), yielded a O(1)-approximation algorithm. Even for the unweighted case, a PTAS for a fundamental class of objects called pseudodisks (which includes disks, unit-height rectangles, translates of convex sets etc.) is currently unknown. Another fundamental case is weighted halfspaces in R3, for which a PTAS is currently lacking. In this paper, we present a QPTAS for all of these remaining problems. Our results are based on the separator framework of Adamaszek and Wiese (FOCS 2013, SODA 2014), who recently obtained a QPTAS for weighted independent set of polygonal regions. This rules out the possibility that these problems are APX-hard, assuming NP DTIME(2polylog(n)). Together with the recent work of Chan-Grant (CGTA 2014), this settles the APX-hardness status for all natural geometric set-cover problems.", "citation": "Citations (12)", "departments": ["ESIEE Paris", "Indraprastha Institute of Information Technology", "Ben-Gurion University of the Negev"], "authors": ["Nabil H. Mustafa.....http://dblp.org/pers/hd/m/Mustafa:Nabil_H=", "Rajiv Raman.....http://dblp.org/pers/hd/r/Raman:Rajiv", "Saurabh Ray.....http://dblp.org/pers/hd/r/Ray:Saurabh"], "conf": "focs", "year": "2014", "pages": 10}