{"title": "Modeling data for business processes.", "fields": ["artifact centric business process model", "process modeling", "business rule", "business process model and notation", "business process modeling"], "abstract": "An important omission in current development practice for business process (or workflow) management systems is modeling of data & access for a business process, including relationship of the process data and the persistent data in the underlying enterprise database(s). This paper develops and studies a new approach to modeling data for business processes: representing data used by a process as a hierarchically structured business entity with (i) keys, local keys, and update constraints, and (ii) a set of data mapping rules defining exact correspondence between entity data values and values in the enterprise database. This paper makes the following technical contributions: (1) A data mapping language is formulated based on path expressions, and shown to coincide with a subclass of the schema mapping language Clio. (2) Two new notions are formulated: Updatability allows each update on a business entity (or database) to be translated to updates on the database (or resp. business entity), a fundamental requirement for process implementation. Isolation reflects that updates by one process execution do not alter data used by another running process. The property provides an important clue in process design. (3) Decision algorithms for updatability and isolation are presented, and they can be easily adapted for data mappings expressed in the subclass of Clio.", "citation": "Citations (14)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "Peking University", "Macquarie University"], "authors": ["Yutian Sun.....http://dblp.org/pers/hd/s/Sun:Yutian", "Jianwen Su.....http://dblp.org/pers/hd/s/Su:Jianwen", "Budan Wu.....http://dblp.org/pers/hd/w/Wu:Budan", "Jian Yang.....http://dblp.org/pers/hd/y/Yang_0001:Jian"], "conf": "icde", "year": "2014", "pages": 12}