{"title": "Blowing hard is not all we want: Quantity vs quality of wind power in the smart grid.", "fields": ["wind hybrid power systems", "power optimizer", "intermittent energy source", "grid energy storage", "grid parity"], "abstract": "The growing awareness about global climate change has boosted the need to mitigate greenhouse gas emissions from existing power systems and spurred efforts to accelerate the integration of renewable energy sources (e.g. wind and solar power) into the electrical grid. A fundamental difficulty here is that renewable energy sources are usually of high variability. The electrical grid must absorb this variability through employing many additional operations (e.g., operating reserves, energy storage), which will largely raise the cost of electricity from renewable energy sources. To make it affordable, numerous advancements in technologies and methods for the smart grid are required. In this paper, we will confine ourselves to one of them: how to plan the construction of wind farms with high capacity and low variability locally and distributedly. We first study the characteristics of both wind resources and wind turbines and present a more accurate wind power evaluation method based on Gaussian Regression. Then, we analyze a trade-off between wind power’s quantity and quality and propose an approach to optimally combine different types of wind turbines to balance the trade-off for a specific site. Finally, we explore geographical diversity among different sites and develop an extended approach that jointly optimizes the combination of sites and turbine types. Extensive experiments using the realistic historical wind resource data are conducted for either of the local and distributed case. Encouraging results are shown for the proposed approaches and some interesting insights are also provided.", "citation": "Citations (5)", "departments": ["McGill University", "McGill University", "McGill University", "McGill University"], "authors": ["Fanxin Kong.....http://dblp.org/pers/hd/k/Kong:Fanxin", "Chuansheng Dong.....http://dblp.org/pers/hd/d/Dong:Chuansheng", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Haibo Zeng.....http://dblp.org/pers/hd/z/Zeng:Haibo"], "conf": "infocom", "year": "2014", "pages": 9}