{"title": "Decentralized Multi-Agent Reinforcement Learning in Average-Reward Dynamic DCOPs.", "fields": ["distributed constraint optimization", "distributed computing", "markov process", "reinforcement learning", "machine learning", "mathematical optimization"], "abstract": "Researchers have introduced the Dynamic Distributed Constraint Optimization Problem (Dynamic DCOP) formulation to model dynamically changing multi-agent coordination problems, where a dynamic DCOP is a sequence of (static canonical) DCOPs, each partially different from the DCOP preceding it. Existing work typically assumes that the problem in each time step is decoupled from the problems in other time steps, which might not hold in some applications. Therefore, in this paper, we make the following contributions: (i) We introduce a new model, called Markovian Dynamic DCOPs (MD-DCOPs), where the DCOP in the next time step is a function of the value assignments in the current time step; (ii)We introduce two distributed reinforcement learning algorithms, the Distributed RVI Q-learning algorithm and the Distributed R-learning algorithm, that balance exploration and exploitation to solve MD-DCOPs in an online manner; and (iii) We empirically evaluate them against an existing multiarm bandit DCOP algorithm on dynamic DCOPs.", "citation": "Citations (11)", "departments": ["Singapore Management University", "New Mexico State University", "Singapore Management University", "University of Massachusetts Amherst", "Massachusetts Institute of Technology", "Singapore Management University", "New Mexico State University", "Singapore Management University", "University of Massachusetts Amherst", "Massachusetts Institute of Technology"], "authors": ["Duc Thien Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Duc_Thien", "William Yeoh.....http://dblp.org/pers/hd/y/Yeoh_0001:William", "Hoong Chuin Lau.....http://dblp.org/pers/hd/l/Lau:Hoong_Chuin", "Shlomo Zilberstein.....http://dblp.org/pers/hd/z/Zilberstein:Shlomo", "Chongjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Chongjie"], "conf": "aaai", "year": "2014", "pages": 9}