{"title": "Pagrol: Parallel graph olap over large-scale attributed graphs.", "fields": ["cuboid", "graph", "online analytical processing", "small number", "graph database"], "abstract": "Attributed graphs are becoming important tools for modeling information networks, such as the Web and various social networks (e.g. Facebook, LinkedIn, Twitter). However, it is computationally challenging to manage and analyze attributed graphs to support effective decision making. In this paper, we propose, Pagrol, a parallel graph OLAP (Online Analytical Processing) system over attributed graphs. In particular, Pagrol introduces a new conceptual Hyper Graph Cube model (which is an attributed-graph analogue of the data cube model for relational DBMS) to aggregate attributed graphs at different granularities and levels. The proposed model supports different queries as well as a new set of graph OLAP Roll-Up/Drill-Down operations. Furthermore, on the basis of Hyper Graph Cube, Pagrol provides an efficient MapReduce-based parallel graph cubing algorithm, MRGraph-Cubing, to compute the graph cube for an attributed graph. Pagrol employs numerous optimization techniques: (a) a self-contained join strategy to minimize I/O cost; (b) a scheme that groups cuboids into batches so as to minimize redundant computations; (c) a cost-based scheme to allocate the batches into bags (each with a small number of batches); and (d) an efficient scheme to process a bag using a single MapReduce job. Results of extensive experimental studies using both real Facebook and synthetic datasets on a 128-node cluster show that Pagrol is effective, efficient and scalable.", "citation": "Citations (23)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "University of California, Santa Barbara"], "authors": ["Zhengkui Wang.....http://dblp.org/pers/hd/w/Wang:Zhengkui", "Qi Fan.....http://dblp.org/pers/hd/f/Fan:Qi", "Huiju Wang.....http://dblp.org/pers/hd/w/Wang:Huiju", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Divyakant Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Divyakant", "Amr El Abbadi.....http://dblp.org/pers/hd/a/Abbadi:Amr_El"], "conf": "icde", "year": "2014", "pages": 12}