{"title": "BugLocalizer: integrated tool support for bug localization.", "fields": ["tracking system", "bug tracking system", "security bug", "software bug", "dissemination"], "abstract": "To manage bugs that appear in a software, developers often make use of a bug tracking system such as Bugzilla. Users can report bugs that they encounter in such a system. Whenever a user reports a new bug report, developers need to read the summary and description of the bug report and manually locate the buggy files based on this information. This manual process is often time consuming and tedious. Thus, a number of past studies have proposed bug localization techniques to automatically recover potentially buggy files from bug reports. Unfortunately, none of these techniques are integrated to bug tracking systems and thus it hinders their adoption by practitioners. To help disseminate research in bug localization to practitioners, we develop a tool named BugLocalizer, which is implemented as a Bugzilla extension and builds upon a recently proposed bug localization technique. Our tool extracts texts from summary and description fields of a bug report and source code files. It then computes similarities of the bug report with source code files to find the buggy files. Developers can use our tool online from a Bugzilla web interface by providing a link to a git source code repository and specifying the version of the repository to be analyzed. We have released our tool publicly in GitHub, which is available at: https://github.com/smagsmu/buglocalizer. We have also provided a demo video, which can be accessed at: http://youtu.be/iWHaLNCUjBY.", "citation": "Citations (5)", "departments": ["Singapore Management University", "Singapore Management University", "Singapore Management University", "Singapore Management University"], "authors": ["Ferdian Thung.....http://dblp.org/pers/hd/t/Thung:Ferdian", "Tien-Duy B. Le.....http://dblp.org/pers/hd/l/Le:Tien=Duy_B=", "Pavneet Singh Kochhar.....http://dblp.org/pers/hd/k/Kochhar:Pavneet_Singh", "David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David"], "conf": "sigsoft", "year": "2014", "pages": 4}