{"title": "PORPLE: An Extensible Optimizer for Portable Data Placement on GPU.", "fields": ["memory ordering", "uniform memory access", "instruction set", "memory map", "texture memory"], "abstract": "GPU is often equipped with complex memory systems, including global memory, texture memory, shared memory, constant memory, and various levels of cache. Where to place the data is important for the performance of a GPU program. However, the decision is difficult for a programmer to make because of architecture complexity and the sensitivity of suitable data placements to input and architecture changes.   This paper presents PORPLE, a portable data placement engine that enables a new way to solve the data placement problem. PORPLE consists of a mini specification language, a source-to-source compiler, and a runtime data placer. The language allows an easy description of a memory system; the compiler transforms a GPU program into a form amenable to runtime profiling and data placement; the placer, based on the memory description and data access patterns, identifies on the fly appropriate placement schemes for data and places them accordingly. PORPLE is distinctive in being adaptive to program inputs and architecture changes, being transparent to programmers (in most cases), and being extensible to new memory architectures. Our experiments on three types of GPU systems show that PORPLE is able to consistently find optimal or near-optimal placement despite the large differences among GPU architectures and program inputs, yielding up to 2.08X (1.59X on average) speedups on a set of regular and irregular GPU benchmarks.", "citation": "Citations (35)", "departments": ["North Carolina State University", "Colorado School of Mines", "Oak Ridge National Laboratory", "North Carolina State University"], "authors": ["Guoyang Chen.....http://dblp.org/pers/hd/c/Chen:Guoyang", "Bo Wu.....http://dblp.org/pers/hd/w/Wu_0002:Bo", "Dong Li.....http://dblp.org/pers/hd/l/Li:Dong", "Xipeng Shen.....http://dblp.org/pers/hd/s/Shen:Xipeng"], "conf": "micro", "year": "2014", "pages": 13}