{"title": "Electronic frog eye: Counting crowd using WiFi.", "fields": ["scalability", "channel state information", "wireless site survey", "monotonic function", "channel"], "abstract": "Crowd counting, which count or accurately estimate the number of human beings within a region, is critical in many applications, such as guided tour and crowd control. A crowd counting solution should be scalable and be minimally intrusive (i.e., device-free) to users. Image-based solutions are device-free, but cannot work well in a dim or dark environment. Non-image based solutions usually require every human being carrying device, and are inaccurate and unreliable in practice. In this paper, we present FCC, a device-Free Crowd Counting approach based on Channel State Information (CSI). Our design is motivated by our observation that CSI is highly sensitive to environment variation, like a frog eye. We theoretically discuss the relationship between the number of moving people and the variation of wireless channel state. A major challenge in our design of FCC is to find a stable monotonic function to characterize the relationship between the crowd number and various features of CSI. To this end, we propose a metric, the Percentage of nonzero Elements (PEM), in the dilated CSI Matrix. The monotonic relationship can be explicitly formulated by the Grey Verhulst Model, which is used for crowd counting without a labor-intensive site survey. We implement FCC using off-theshelf IEEE 802.11n devices and evaluate its performance via extensive experiments in typical real-world scenarios. Our results demonstrate that FCC outperforms the state-of-art approaches with much better accuracy, scalability and reliability.", "citation": "Citations (167)", "departments": ["Xi'an Jiaotong University", "Xi'an Jiaotong University", "Tsinghua University", "Xi'an Jiaotong University", "Temple University"], "authors": ["Wei Xi.....http://dblp.org/pers/hd/x/Xi:Wei", "Jizhong Zhao.....http://dblp.org/pers/hd/z/Zhao:Jizhong", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Kun Zhao.....http://dblp.org/pers/hd/z/Zhao:Kun", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Zhiping Jiang.....http://dblp.org/pers/hd/j/Jiang:Zhiping"], "conf": "infocom", "year": "2014", "pages": 9}