{"title": "Achieving k-anonymity in privacy-aware location-based services.", "fields": ["k anonymity", "cloaking", "download", "location based service", "mobile device"], "abstract": "Location-Based Service (LBS) has become a vital part of our daily life. While enjoying the convenience provided by LBS, users may lose privacy since the untrusted LBS server has all the information about users in LBS and it may track them in various ways or release their personal data to third parties. To address the privacy issue, we propose a Dummy- Location Selection (DLS) algorithm to achieve k-anonymity for users in LBS. Different from existing approaches, the DLS algorithm carefully selects dummy locations considering that side information may be exploited by adversaries. We first choose these dummy locations based on the entropy metric, and then propose an enhanced-DLS algorithm, to make sure that the selected dummy locations are spread as far as possible. Evaluation results show that the proposed DLS algorithm can significantly improve the privacy level in terms of entropy. The enhanced-DLS algorithm can enlarge the cloaking region while keeping similar privacy level as the DLS algorithm. I. INTRODUCTION With the rapid development of mobile devices and social networks, Location-Based Service (LBS) has become a vital part in our daily activities in recent years. With smartphones or tablets, users can download location-based applications from Apple Store or Google Play Store. With the help of these", "citation": "Citations (183)", "departments": ["Xidian University", "University of Arkansas", "Xidian University", "Pennsylvania State University", "Xidian University"], "authors": ["Ben Niu.....http://dblp.org/pers/hd/n/Niu_0001:Ben", "Qinghua Li.....http://dblp.org/pers/hd/l/Li:Qinghua", "Xiaoyan Zhu.....http://dblp.org/pers/hd/z/Zhu:Xiaoyan", "Guohong Cao.....http://dblp.org/pers/hd/c/Cao:Guohong", "Hui Li.....http://dblp.org/pers/hd/l/Li_0006:Hui"], "conf": "infocom", "year": "2014", "pages": 9}