{"title": "CACH: Cycle-Adjustable Channel hopping for control channel establishment in cognitive radio networks.", "fields": ["cognitive radio", "modular arithmetic", "control channel", "degree", "rendezvous"], "abstract": "Establishing control channels in a cognitive radio network (CRN) is an important and challenging problem. To cope with the problem of control channel saturation and the problem of channel blocking by primary users, channel hopping (CH) schemes are commonly used in the literature for control channel establishment in CRNs. There are three metrics that are widely used for evaluating the performance of CH schemes: (i) degree of overlapping (the number of distinct rendezvous channels), (ii) worst case time-to-rendezvous (TTR), and (iii) system load. In this paper, we focus on the symmetric and synchronous setting and propose a novel Cycle-Adjustable Channel Hopping (CACH) scheme that outperforms several existing CH schemes, including SSCH and QCH, in terms of the three metrics. The key idea of CACH is to create an additional layer of logical channels on the top of physical channels so that the cycle of channel hopping sequences can be adjusted to optimize system performance. The mathematic tools for our scheme are based on the operations in Galois fields that are more general than the prime number modular arithmetic used in SSCH. We show that CACH is much more general than SSCH and it can achieve the maximum degree of overlapping while allowing the worst case TTR to be adjustable. It is also much better than QCH in terms of reducing system load while keeping the same degree of overlapping and the same worst case TTR. Our simulation results show that CACH outperforms several existing schemes in many other aspects, including throughput, and robustness to the disturbance of PUs.", "citation": "Citations (8)", "departments": ["National Taiwan University", "National Taiwan University", "National Tsing Hua University"], "authors": ["Tsung Ying Wu.....http://dblp.org/pers/hd/w/Wu:Tsung_Ying", "Wanjiun Liao.....http://dblp.org/pers/hd/l/Liao:Wanjiun", "Cheng-Shang Chang.....http://dblp.org/pers/hd/c/Chang:Cheng=Shang"], "conf": "infocom", "year": "2014", "pages": 9}