{"title": "Collaborative Verification of Information Flow for a High-Assurance App Store.", "fields": ["world wide web", "malware", "app store", "malware analysis", "internet privacy", "information flow", "computer science", "android", "usability"], "abstract": "Current app stores distribute some malware to unsuspecting users, even though the app approval process may be costly and time-consuming. High-integrity app stores must provide stronger guarantees that their apps are not malicious. We propose a verification model for use in such app stores to guarantee that the apps are free of malicious information flows. In our model, the software vendor and the app store auditor collaborate -- each does tasks that are easy for her/him, reducing overall verification cost. The software vendor provides a behavioral specification of information flow (at a finer granularity than used by current app stores) and source code annotated with information-flow type qualifiers. A flow-sensitive, context-sensitive information-flow type system checks the information flow type qualifiers in the source code and proves that only information flows in the specification can occur at run time. The app store auditor uses the vendor-provided source code to manually verify declassifications.   We have implemented the information-flow type system for Android apps written in Java, and we evaluated both its effectiveness at detecting information-flow violations and its usability in practice. In an adversarial Red Team evaluation, we analyzed 72 apps (576,000 LOC) for malware. The 57 Trojans among these had been written specifically to defeat a malware analysis such as ours. Nonetheless, our information-flow type system was effective: it detected 96% of malware whose malicious behavior was related to information flow and 82% of all malware. In addition to the adversarial evaluation, we evaluated the practicality of using the collaborative model. The programmer annotation burden is low: 6 annotations per 100 LOC. Every sound analysis requires a human to review potential false alarms, and in our experiments, this took 30 minutes per 1,000 LOC for an auditor unfamiliar with the app.", "citation": "Citations (78)", "year": "2014", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Waterloo", "University of Washington"], "conf": "ccs", "authors": ["Michael D. Ernst.....http://dblp.org/pers/hd/e/Ernst:Michael_D=", "René Just.....http://dblp.org/pers/hd/j/Just:Ren=eacute=", "Suzanne Millstein.....http://dblp.org/pers/hd/m/Millstein:Suzanne", "Werner Dietl.....http://dblp.org/pers/hd/d/Dietl:Werner", "Stuart Pernsteiner.....http://dblp.org/pers/hd/p/Pernsteiner:Stuart", "Franziska Roesner.....http://dblp.org/pers/hd/r/Roesner:Franziska", "Karl Koscher.....http://dblp.org/pers/hd/k/Koscher:Karl", "Paulo Barros.....http://dblp.org/pers/hd/b/Barros:Paulo", "Ravi Bhoraskar.....http://dblp.org/pers/hd/b/Bhoraskar:Ravi", "Seungyeop Han.....http://dblp.org/pers/hd/h/Han:Seungyeop", "Paul Vines.....http://dblp.org/pers/hd/v/Vines:Paul", "Edward XueJun Wu.....http://dblp.org/pers/hd/w/Wu:Edward_XueJun"], "pages": 13}