{"title": "A Bound for Multiparty Secret Key Agreement and Implications for a Problem of Secure Computing.", "fields": ["key distribution", "independent and identically distributed random variables", "secret sharing", "conditional independence", "secure multi party computation", "closeness", "pre shared key", "joint probability distribution", "key size", "theoretical computer science"], "abstract": "We consider secret key agreement by multiple parties observing correlated data and communicating interactively over an insecure communication channel. Our main contribution is a single-shot upper bound on the length of the secret keys that can be generated, without making any assumptions on the distribution of the underlying data. Heuristically, we bound the secret key length in terms of “how far” is the joint distribution of the initial observations of the parties and the eavesdropper from a distribution that renders the observations of the parties conditionally independent across some partition, when conditioned on the eavesdropper’s side information. The closeness of the two distributions is measured in terms of the exponent of the probability of error of type II for a binary hypothesis testing problem, thus bringing out a structural connection between secret key agreement and binary hypothesis testing. When the underlying data consists of an independent and identically distributed sequence, an application of our bound recovers several known upper bounds for the asymptotic rate of a secret key that can be generated, without requiring the agreement error probability or the security index to vanish to 0 asymptotically.", "citation": "Not cited", "year": "2014", "departments": ["University of California, Berkeley", "University of California", "University of Maryland, College Park", "University of Tokushima"], "conf": "eurocrypt", "authors": ["Himanshu Tyagi.....http://dblp.org/pers/hd/t/Tyagi:Himanshu", "Shun Watanabe.....http://dblp.org/pers/hd/w/Watanabe:Shun"], "pages": 18}