{"title": "The Mind-Mirror: See your brain in action in your head using EEG and augmented reality.", "fields": ["real image", "brain computer interface", "augmented reality", "neurofeedback", "data visualization"], "abstract": "Imagine you are facing a mirror, seeing at the same time both your real body and a virtual display of your brain in activity and perfectly superimposed to your real image “inside your real skull”. In this paper, we introduce a novel augmented reality paradigm called “Mind-Mirror” which enables the experience of seeing “through your own head”, visualizing your brain “in action and in situ”. Our approach relies on the use of a semi-transparent mirror positioned in front of a computer screen. A virtual brain is displayed on screen and automatically follows the head movements using an optical face-tracking system. The brain activity is extracted and processed in real-time with the help of an electroencephalography cap (EEG) worn by the user. A rear view is also proposed thanks to an additional webcam recording the rear of the user's head. The use of EEG classification techniques enables to test a Neurofeedback scenario in which the user can train and progressively learn how to control different mental states, such as “concentrated” versus “relaxed”. The results of a user study comparing a standard visualization used in Neurofeedback to our approach showed that the Mind-Mirror could be successfully used and that the participants have particularly appreciated its innovation and originality. We believe that, in addition to applications in Neurofeedback and Brain-Computer Interfaces, the Mind-Mirror could also be used as a novel visualization tool for education, training or entertainment applications.", "citation": "Citations (18)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Jonathan Mercier-Ganady.....http://dblp.org/pers/hd/m/Mercier=Ganady:Jonathan", "Fabien Lotte.....http://dblp.org/pers/hd/l/Lotte:Fabien", "Emilie Loup-Escande.....http://dblp.org/pers/hd/l/Loup=Escande:Emilie", "Maud Marchal.....http://dblp.org/pers/hd/m/Marchal:Maud", "Anatole Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Anatole"], "conf": "vr", "year": "2014", "pages": 6}