{"title": "Click-through-based Subspace Learning for Image Search.", "fields": ["click through rate", "human intelligence", "subspace topology", "feature detection", "automatic image annotation"], "abstract": "One of the fundamental problems in image search is to rank image documents according to a given textual query. We address two limitations of the existing image search engines in this paper. First, there is no straightforward way of comparing textual keywords with visual image content. Image search engines therefore highly depend on the surrounding texts, which are often noisy or too few to accurately describe the image content. Second, ranking functions are trained on query-image pairs labeled by human labelers, making the annotation intellectually expensive and thus cannot be scaled~up.   We demonstrate that the above two fundamental challenges can be mitigated by jointly exploring the subspace learning and the use of click-through data. The former aims to create a latent subspace with the ability in comparing information from the original incomparable views (i.e., textual and visual views), while the latter explores the largely available and freely accessible click-through data (i.e., \"crowdsourced\" human intelligence) for understanding query. Specifically, we investigate a series of click-through-based subspace learning techniques (CSL) for image search. We conduct experiments on MSR-Bing Grand Challenge and the final evaluation performance achieves  DCG @25=0.47225. Moreover, the feature dimension is significantly reduced by several orders of magnitude (e.g., from thousands to tens).", "citation": "Citations (10)", "departments": ["University of Science and Technology of China", "City University of Hong Kong", "University of Science and Technology of China", "University of Science and Technology of China", "City University of Hong Kong"], "authors": ["Yingwei Pan.....http://dblp.org/pers/hd/p/Pan:Yingwei", "Ting Yao.....http://dblp.org/pers/hd/y/Yao:Ting", "Xinmei Tian.....http://dblp.org/pers/hd/t/Tian:Xinmei", "Houqiang Li.....http://dblp.org/pers/hd/l/Li:Houqiang", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah"], "conf": "mm", "year": "2014", "pages": 4}