{"title": "yaSpMV: yet another SpMV framework on GPUs.", "fields": ["bit field", "cache", "cuda", "sparse matrix", "high memory"], "abstract": "SpMV is a key linear algebra algorithm and has been widely used in many important application domains. As a result, numerous attempts have been made to optimize SpMV on GPUs to leverage their massive computational throughput. Although the previous work has shown impressive progress, load imbalance and high memory bandwidth remain the critical performance bottlenecks for SpMV. In this paper, we present our novel solutions to these problems. First, we devise a new SpMV format, called blocked compressed common coordinate (BCCOO), which uses bit flags to store the row indices in a blocked common coordinate (COO) format so as to alleviate the bandwidth problem. We further improve this format by partitioning the matrix into vertical slices to enhance the cache hit rates when accessing the vector to be multiplied. Second, we revisit the segmented scan approach for SpMV to address the load imbalance problem. We propose a highly efficient matrix-based segmented sum/scan for SpMV and further improve it by eliminating global synchronization. Then, we introduce an auto-tuning framework to choose optimization parameters based on the characteristics of input sparse matrices and target hardware platforms. Our experimental results on GTX680 GPUs and GTX480 GPUs show that our proposed framework achieves significant performance improvement over the vendor tuned CUSPARSE V5.0 (up to 229% and 65% on average on GTX680 GPUs, up to 150% and 42% on average on GTX480 GPUs) and some most recently proposed schemes (e.g., up to 195% and 70% on average over clSpMV on GTX680 GPUs, up to 162% and 40% on average over clSpMV on GTX480 GPUs).", "citation": "Citations (85)", "year": "2014", "departments": ["Chinese Academy of Sciences", "North Carolina State University", "Chinese Academy of Sciences", "North Carolina State University"], "conf": "ppopp", "authors": ["Shengen Yan.....http://dblp.org/pers/hd/y/Yan:Shengen", "Chao Li.....http://dblp.org/pers/hd/l/Li_0004:Chao", "Yunquan Zhang.....http://dblp.org/pers/hd/z/Zhang:Yunquan", "Huiyang Zhou.....http://dblp.org/pers/hd/z/Zhou:Huiyang"], "pages": 12}