{"title": "CrowdMatcher: crowd-assisted schema matching.", "fields": ["crowdsourcing", "correctness", "schema matching", "data integration", "annotation"], "abstract": "Schema matching is a central challenge for data integration systems. Due to the inherent uncertainty arose from the inability of schema in fully capturing the semantics of the represented data, automatic tools are often uncertain about suggested matching results. However, human is good at understanding data represented in various forms and crowdsourcing platforms are making the human annotation process more affordable. Thus in this demo, we will show how to utilize the crowd to find the right matching. In order to do that, we need to make the tasks posted on the crowdsouricng platforms extremely simple, to be performed by non-expert people, and reduce the number of tasks as less as possible to save the cost.   We demonstrate  CrowdMatcher , a hybrid machine-crowd system for schema matching. The machine-generated matchings are verified by correspondence correctness queries (CCQs), which is to ask the crowd to determine whether a given correspondence is correct or not.  CrowdMatcher  includes several original features: it integrates different matchings generated from classical schema matching tools; in order to minimize the cost of crowdsourcing, it automatically selects the most informative set of CCQs from the possible matchings; it is able to manage inaccurate answers provided by the workers; the crowdsourced answers are used to improve matching results.", "citation": "Citations (8)", "year": "2014", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Michigan", "Hong Kong University of Science and Technology"], "conf": "sigmod", "authors": ["Chen Jason Zhang.....http://dblp.org/pers/hd/z/Zhang:Chen_Jason", "Ziyuan Zhao.....http://dblp.org/pers/hd/z/Zhao:Ziyuan", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "H. V. Jagadish.....http://dblp.org/pers/hd/j/Jagadish:H=_V=", "Caleb Chen Cao.....http://dblp.org/pers/hd/c/Cao:Caleb_Chen"], "pages": 4}