{"title": "In-Situ Feature Extraction of Large Scale Combustion Simulations Using Segmented Merge Trees.", "fields": ["merge", "topological data analysis", "feature extraction", "in situ", "scalability"], "abstract": "The ever increasing amount of data generated by scientific simulations coupled with system I/O constraints are fueling a need for in-situ analysis techniques. Of particular interest are approaches that produce reduced data representations while maintaining the ability to redefine, extract, and study features in a post-process to obtain scientific insights.   This paper presents two variants of in-situ feature extraction techniques using segmented merge trees, which encode a wide range of threshold based features. The first approach is a fast, low communication cost technique that generates an exact solution but has limited scalability. The second is a scalable, local approximation that nevertheless is guaranteed to correctly extract all features up to a predefined size. We demonstrate both variants using some of the largest combustion simulations available on leadership class supercomputers. Our approach allows state-of-the-art, feature-based analysis to be performed in-situ at significantly higher frequency than currently possible and with negligible impact on the overall simulation runtime.", "citation": "Citations (22)", "departments": ["University of Utah", "University of Utah", "University of Utah", "Sandia National Laboratories", "Sandia National Laboratories"], "authors": ["Aaditya G. Landge.....http://dblp.org/pers/hd/l/Landge:Aaditya_G=", "Valerio Pascucci.....http://dblp.org/pers/hd/p/Pascucci:Valerio", "Attila Gyulassy.....http://dblp.org/pers/hd/g/Gyulassy:Attila", "Janine Bennett.....http://dblp.org/pers/hd/b/Bennett:Janine", "Hemanth Kolla.....http://dblp.org/pers/hd/k/Kolla:Hemanth", "Jacqueline Chen.....http://dblp.org/pers/hd/c/Chen:Jacqueline", "Peer-Timo Bremer.....http://dblp.org/pers/hd/b/Bremer:Peer=Timo"], "conf": "sc", "year": "2014", "pages": 12}