{"title": "We can hear you with Wi-Fi!", "fields": ["network packet", "universal software radio peripheral", "multipath propagation", "vocabulary", "motion detection", "mimo"], "abstract": "Recent literature advances Wi-Fi signals to \"see\" people's motions and locations. This paper asks the following question: Can Wi-Fi \"hear\" our talks? We present WiHear, which enables Wi-Fi signals to \"hear\" our talks without deploying any devices. To achieve this, WiHear needs to detect and analyze fine-grained radio reflections from mouth movements. WiHear solves this micro-movement detection problem by introducing  Mouth Motion Profile  that leverages partial multipath effects and wavelet packet transformation. Since Wi-Fi signals do not require line-of-sight, WiHear can \"hear\" people talks within the radio range. Further, WiHear can simultaneously \"hear\" multiple people's talks leveraging MIMO technology. We implement WiHear on both USRP N210 platform and commercial Wi-Fi infrastructure. Results show that within our pre-defined vocabulary, WiHear can achieve detection accuracy of 91% on average for single individual speaking no more than 6 words and up to 74% for no more than 3 people talking simultaneously. Moreover, the detection accuracy can be further improved by deploying multiple receivers from different angles.", "citation": "Citations (164)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Shenzhen University", "Shenzhen University", "Shenzhen University", "Shenzhen University", "University of Macau"], "authors": ["Guanhua Wang.....http://dblp.org/pers/hd/w/Wang:Guanhua", "Yongpan Zou.....http://dblp.org/pers/hd/z/Zou:Yongpan", "Zimu Zhou.....http://dblp.org/pers/hd/z/Zhou:Zimu", "Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "mobicom", "year": "2014", "pages": 12}