{"title": "Network neutrality inference.", "fields": ["upstream and downstream", "inference", "nano", "neutrality", "credibility", "planetlab", "statistical hypothesis testing", "traffic shaping", "net neutrality", "network emulation", "network management", "the internet", "telecommunications service", "causal inference", "router", "operator", "network formation", "machine learning", "capital expenditure", "network tomography", "artificial intelligence"], "abstract": "We present NANO, a system that detects when ISPs apply policies that discriminate against specific classes of applications, users, or destinations. Existing systems for detecting discrimination are typically specific to an application or to a particular discrimination mechanism and rely on active measurement tests. Unfortunately, ISPs can change discrimination policies and mechanisms, and they can evade these tests by giving probe traffic higher priority. NANO detects ISP discrimination by passively collecting performance data from clients. To distinguish discrimination from other causes of degradation ( e.g. , overload, misconfiguration, failure), NANO establishes a causal relationship between an ISP and observed performance by adjusting for confounding factors. NANO agents deployed at participating clients across the Internet collect performance data for selected services and report this information to centralized servers, which analyze the measurements to establish causal relationship between an ISP and performance degradations. We have implemented NANO and deployed clients in a controlled environment on Emulab. We run a combination of controlled experiments on Emulab and wide-area experiments on PlanetLab that show that NANO can determine the extent and criteria for discrimination for a variety of discrimination policies and applications.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "University of Electronic Science and Technology of China", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "French Institute for Research in Computer Science and Automation"], "authors": ["Zhiyong Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhiyong", "Ovidiu Mara.....http://dblp.org/pers/hd/m/Mara:Ovidiu", "Katerina J. Argyraki.....http://dblp.org/pers/hd/a/Argyraki:Katerina_J="], "conf": "sigcomm", "year": "2014", "pages": 12}