{"title": "Cell planning for heterogeneous networks: An approximation algorithm.", "fields": ["global optimum", "macro", "heterogeneous network", "software deployment", "femto"], "abstract": "Low-power access points, such as pico base sta- tions (BSs), femto BSs, and relays are introduced to the next generation cellular systems to enhance coverage and improve system capacity. Deploying low-power access points to offload the conventional macro BSs is deemed as a spectrum- and cost- efficient way to meet the sharp increase of traffic requirements of cellular networks. However, it also leads to heterogeneous network framework and raises new challenges for cell planning. In this paper, we study the minimum cost cell planning problem in such a heterogeneous network. Our optimization task is to select a subset of candidate sites to lay BSs, including macro BSs, pico BSs and relays, to minimize the total deployment cost while satisfying the rate requirements of the demand nodes (DNs) served by the cellular network. We prove that the general case of the formulated problem is APX-hard, where a DN is constrained to be associated with only one BS. However, if each DN can be served by multiple BSs, which is a reasonable case for practical cellular systems, we show it is not APX-hard and develop an approximation algorithm to work out promising solutions. Our proposed algorithm guarantees an approximation ratio of O(logR) to the global optimum, where R is the maximum achievable capacity of the BSs. Numerical results indicate that our proposal can significantly reduce the deployment cost of the cellular network with given rate requirements of DNs compared to other cell planning schemes.", "citation": "Citations (20)", "departments": ["Nanjing University", "Nanjing University", "InterDigital, Inc.", "Nanjing University"], "authors": ["Wentao Zhao.....http://dblp.org/pers/hd/z/Zhao:Wentao", "Shaowei Wang.....http://dblp.org/pers/hd/w/Wang_0001:Shaowei", "Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang", "Xiaobing Wu.....http://dblp.org/pers/hd/w/Wu:Xiaobing"], "conf": "infocom", "year": "2014", "pages": 9}