{"title": "A trusted mechanised JavaScript specification.", "fields": ["implementation", "unobtrusive javascript", "test suite", "mathematical proof", "proof assistant"], "abstract": "JavaScript is the most widely used web language for client-side applications. Whilst the development of JavaScript was initially just led by implementation, there is now increasing momentum behind the ECMA standardisation process. The time is ripe for a formal, mechanised specification of JavaScript, to clarify ambiguities in the ECMA standards, to serve as a trusted reference for high-level language compilation and JavaScript implementations, and to provide a platform for high-assurance proofs of language properties.   We present JSCert, a formalisation of the current ECMA standard in the Coq proof assistant, and JSRef, a reference interpreter for JavaScript extracted from Coq to OCaml. We give a Coq proof that JSRef is correct with respect to JSCert and assess JSRef using test262, the ECMA conformance test suite. Our methodology ensures that JSCert is a comparatively accurate formulation of the English standard, which will only improve as time goes on. We have demonstrated that modern techniques of mechanised specification can handle the complexity of JavaScript.", "citation": "Citations (74)", "departments": ["École normale supérieure de Lyon", "University of Paris-Sud", "Imperial College London", "Imperial College London", "Imperial College London"], "authors": ["Martin Bodin.....http://dblp.org/pers/hd/b/Bodin:Martin", "Arthur Charguéraud.....http://dblp.org/pers/hd/c/Chargu=eacute=raud:Arthur", "Daniele Filaretti.....http://dblp.org/pers/hd/f/Filaretti:Daniele", "Philippa Gardner.....http://dblp.org/pers/hd/g/Gardner:Philippa", "Sergio Maffeis.....http://dblp.org/pers/hd/m/Maffeis:Sergio", "Daiva Naudziuniene.....http://dblp.org/pers/hd/n/Naudziuniene:Daiva", "Alan Schmitt.....http://dblp.org/pers/hd/s/Schmitt:Alan", "Gareth Smith.....http://dblp.org/pers/hd/s/Smith:Gareth"], "conf": "popl", "year": "2014", "pages": 14}