{"title": "Matching heterogeneous events with patterns.", "fields": ["heuristic", "synthetic data", "optimal matching", "schema matching", "discriminative model", "relational database", "pattern matching"], "abstract": "A large amount of heterogeneous event data are increasingly generated, e.g., in online systems for Web services or operational systems in enterprises. Owing to the difference between event data and traditional relational data, the matching of heterogeneous events is highly non-trivial. While event names are often opaque (e.g., merely with obscure IDs), the existing structure-based matching techniques for relational data also fail to perform owing to the poor discriminative power of dependency relationships between events. We note that interesting patterns exist in the occurrence of events, which may serve as discriminative features in event matching. In this paper, we formalize the problem of matching events with patterns. A generic pattern based matching framework is proposed, which is compatible with the existing structure based techniques. To improve the matching efficiency, we devise several bounds of matching scores for pruning. Since the exploration of patterns is costly and incrementally, our proposed techniques support matching in a pay-as-you-go style, i.e., incrementally update the matching results with the increase of available patterns. Finally, extensive experiments on both real and synthetic data demonstrate the effectiveness of our pattern based matching compared with approaches adapted from existing techniques, and the efficiency improved by the bounding/pruning methods.", "citation": "Not cited", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Illinois at Chicago", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Xiaochen Zhu.....http://dblp.org/pers/hd/z/Zhu:Xiaochen", "Shaoxu Song.....http://dblp.org/pers/hd/s/Song:Shaoxu", "Jianmin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianmin", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S=", "Jiaguang Sun.....http://dblp.org/pers/hd/s/Sun:Jiaguang"], "conf": "icde", "year": "2014", "pages": 12}