{"title": "Region sampling and estimation of geosocial data with dynamic range calibration.", "fields": ["gibbs sampling", "service provider", "ground truth", "snapshot", "application programming interface"], "abstract": "Location based social networks (LBSNs) are becoming increasingly popular with the fast deployment of broadband mobile networks and the growing prevalence of versatile mobile devices. This success has attracted great interest in studying and measuring the characteristics of LBSNs, such as Facebook Places, Yelp, and Google+ Local. However, it is often prohibitive, and sometimes too costly, to obtain a detailed and complete snapshot of a LBSN due to its usually massive scale. In this work, taking Foursquare as an example, we focus on sampling and estimating restricted geographic regions in LBSNs, such as a city or a country. By exploiting the application programming interfaces (APIs) provided by Foursquare for geographic search, we first introduce how to obtain the “ground truth”, namely, a complete set of all venues (i.e., places) in a specified region. Then, we propose random region sampling algorithms that allow us to draw representative samples of venues, and design unbiased estimators of regional characteristics of venues. We validate the efficiency of our sampling algorithms on Foursquare using complete datasets obtained from 12 regions, such as Switzerland, New York City and Los Angeles. Our results are applicable to perform sampling and estimation in all GeoDatabases, such as Facebook Places, Yelp, and Google+ Local, which have similar venue search APIs as Foursquare. These location service providers can also benefit from our results to enable efficient online statistic estimation.", "citation": "Citations (10)", "departments": ["Huawei", "University of Minnesota", "Bell Labs", "Binghamton University", "Akamai Inc., CA, USA"], "authors": ["Yanhua Li.....http://dblp.org/pers/hd/l/Li:Yanhua", "Moritz Steiner.....http://dblp.org/pers/hd/s/Steiner:Moritz", "Jie Bao.....http://dblp.org/pers/hd/b/Bao_0003:Jie", "Limin Wang.....http://dblp.org/pers/hd/w/Wang:Limin", "Ting Zhu.....http://dblp.org/pers/hd/z/Zhu:Ting"], "conf": "icde", "year": "2014", "pages": 12}