{"title": "Improved Generic Attacks against Hash-Based MACs and HAIFA.", "fields": ["double hashing", "length extension attack", "hash chain", "sha 2", "collision attack", "hash based message authentication code"], "abstract": "The security of HMAC (and more general hash-based MACs) against state-recovery and universal forgery attacks was shown to be suboptimal, following a series of results by Leurent et al. and Peyrin et al. These results have shown that such powerful attacks require significantly less than \\(2^{\\ell }\\) computations, contradicting the common belief (where \\(\\ell \\) denotes the internal state size). In this work, we revisit and extend these results, with a focus on concrete hash functions that limit the message length, and apply special iteration modes. We begin by devising the first state-recovery attack on HMAC with a HAIFA hash function (using a block counter in every compression function call), with complexity \\(2^{4\\ell /5}\\). Then, we describe improved tradeoffs between the message length and the complexity of a state-recovery attack on HMAC with a Merkle–Damgard hash function. Consequently, we obtain improved attacks on several HMAC constructions used in practice, in which the hash functions limits the maximal message length (e.g., SHA-1 and SHA-2). Finally, we present the first universal forgery attacks, which can be applied with short message queries to the MAC oracle. In particular, we devise the first universal forgery attacks applicable to SHA-1 and SHA-2. Despite their theoretical interest, our attacks do not seem to threaten the practical security of the analyzed concrete HMAC constructions.", "citation": "Not cited", "departments": ["École Normale Supérieure", "French Institute for Research in Computer Science and Automation", "Ben-Gurion University of the Negev", "French Institute for Research in Computer Science and Automation"], "authors": ["Itai Dinur.....http://dblp.org/pers/hd/d/Dinur:Itai", "Gaëtan Leurent.....http://dblp.org/pers/hd/l/Leurent:Ga=euml=tan"], "conf": "crypto", "year": "2014", "pages": 20}