{"title": "Software defined green data center network with exclusive routing.", "fields": ["policy based routing", "static routing", "data center network architectures", "routing domain", "multipath routing"], "abstract": "The explosive expansion of data center sizes ag- gravates the power consumption and carbon footprint, which has restricted the sustainable growth of cloud services and seriously troubled data center operators. In recent years, plenty of advanced data center network architectures have been proposed. They usually employ richly-connected topologies and multi-path routing to provide high network capacity. Unfortunately, they also undergo inefficient network energy usage during the traffic valley time. To address the problem, many energy-aware flow scheduling algorithms are proposed recently, primarily considering how to aggregate traffic by flexibly choosing the routing paths, with flows fairly sharing the link bandwidths. In this paper, we leverage software defined network (SDN) technique and explore a new solution to energy-aware flow scheduling, i.e., scheduling flows in the time dimension and using exclusive routing (EXR) for each flow, i.e., a flow always exclusively utilizes the links of its routing path. The key insight is that exclusive occupation of link resources usually results in higher link utilization in high-radix data center networks, since each flow does not need to compete for the link bandwidths with others. When scheduling the flows, EXR leaves flexibility to operators to define the priorities of flows, e.g., based on flow size, flow deadline, etc. Extensive simulations and testbed experiments both show that EXR can effectively save network energy compared with the regular fair-sharing routing (FSR), and significantly reduce the average flow completion time if assigning higher scheduling priorities to smaller flows. I. INTRODUCTION The explosive expansion of data center sizes aggravates the power consumption and carbon footprint. The statistics show that 1.5% of the global electricity usage came from data centers in 2011 (1), (2). The ever increasing energy consumption of data centers has restricted the sustainable growth of cloud services and raised economic and environmental concerns. Recently people pay attention to the contribution of networking part to the energy consumed by the whole data center. In typical data centers, the network accounts for 10-20% of the overall power consumption (3), while the proportion can be up to 50% if the mature server-side power management techniques are employed (4).", "citation": "Citations (62)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Dan Li.....http://dblp.org/pers/hd/l/Li:Dan", "Yunfei Shang.....http://dblp.org/pers/hd/s/Shang:Yunfei", "Congjie Chen.....http://dblp.org/pers/hd/c/Chen:Congjie"], "conf": "infocom", "year": "2014", "pages": 9}