{"title": "Techniques for improving regression testing in continuous integration development environments.", "fields": ["codebase", "test strategy", "test management approach", "regression testing", "non regression testing"], "abstract": "In continuous integration development environments, software engineers frequently integrate new or changed code with the mainline codebase. This can reduce the amount of code rework that is needed as systems evolve and speed up development time. While continuous integration processes traditionally require that extensive testing be performed following the actual submission of code to the codebase, it is also important to ensure that enough testing is performed prior to code submission to avoid breaking builds and delaying the fast feedback that makes continuous integration desirable. In this work, we present algorithms that make continuous integration processes more cost-effective. In an initial pre-submit phase of testing, developers specify modules to be tested, and we use regression test selection techniques to select a subset of the test suites for those modules that render that phase more cost-effective. In a subsequent post-submit phase of testing, where dependent modules as well as changed modules are tested, we use test case prioritization techniques to ensure that failures are reported more quickly. In both cases, the techniques we utilize are novel, involving algorithms that are relatively inexpensive and do not rely on code coverage information -- two requirements for conducting testing cost-effectively in this context. To evaluate our approach, we conducted an empirical study on a large data set from Google that we make publicly available. The results of our study show that our selection and prioritization techniques can each lead to cost-effectiveness improvements in the continuous integration process.", "citation": "Citations (104)", "departments": ["University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "Google"], "authors": ["Sebastian G. Elbaum.....http://dblp.org/pers/hd/e/Elbaum:Sebastian_G=", "Gregg Rothermel.....http://dblp.org/pers/hd/r/Rothermel:Gregg", "John Penix.....http://dblp.org/pers/hd/p/Penix:John"], "conf": "sigsoft", "year": "2014", "pages": 11}