{"title": "R2D2: Embracing device-to-device communication in next generation cellular networks.", "fields": ["job shop scheduling", "cellular traffic", "reuse", "telecommunications link", "schedule"], "abstract": "Device-to-device (D2D) communications is being pursued as an important feature in next generation cellular networks. D2D can improve resource utilization in two ways: Offloading cellular traffic to D2D, and Reuse of resources used by conventional cellular transmissions for D2D communication. In this paper, we show that in multi-cell environments that employ FFR (Fractional Frequency Reuse), the benefits from D2D toward reuse are limited. We then propose R2D2- a holistic approach to efficient offloading with D2D traffic. R2D2 leverages the flexible nature of D2D traffic (in using downlink/uplink resources) to cater effectively to the spatial and temporal asymmetry in traffic load both across and within cells. R2D2 incorporates a two time-scale solution: a coarse time-scale dynamic FFR scheme that leverages D2D traffic to determine the FFR patterns for downlink and uplink jointly among interfering sectors; and a fine time-scale scheduling solution that intelligently schedules cellular and D2D traffic jointly across DL (Downlink) and UL (Uplink) resources. We establish the hardness of the scheduling problem and present efficient and low complexity algorithms with approximation guarantees. Through extensive evaluations, we confirm that R2D2 delivers the offloading benefits of D2D, with its proposed algorithms performing very close to the optimal.", "citation": "Citations (13)", "departments": ["Ohio State University", "Princeton University", "Princeton University", "Ohio State University"], "authors": ["Tarun Bansal.....http://dblp.org/pers/hd/b/Bansal:Tarun", "Karthikeyan Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Karthikeyan", "Sampath Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan:Sampath", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun"], "conf": "infocom", "year": "2014", "pages": 9}