{"title": "Will cyber-insurance improve network security? A market analysis.", "fields": ["cyber insurance", "security convergence", "market analysis", "network security policy", "cloud computing security"], "abstract": "Recent work in security has illustrated that solutions aimed at detection and elimination of security threats alone are unlikely to result in a robust cyberspace. As an orthogonal approach to mitigating security problems, some have pursued the use of cyber-insurance as a suitable risk management technique. Such an approach has the potential to jointly align with the incentives of security vendors (e.g., Symantec, Microsoft, etc.), cyber-insurers (e.g., ISPs, cloud providers, security vendors, etc.), regulatory agencies (e.g., government), and network users (individuals and organizations), in turn paving the way for comprehensive and robust cyber-security mechanisms. To this end, in this work, we are motivated by the following important question: can cyber-insurance really improve the security in a network? To address this question, we adopt a market-based approach. Specifically, we analyze regulated monopolistic and competitive cyber-insurance markets, where the market elements consist of risk-averse cyber-insurers, risk-averse network users, a regulatory agency, and security vendors. Our results show that (i) without contract discrimination amongst users, there always exists a unique market equilibrium for both market types, but the equilibrium is inefficient and does not improve network security, and (ii) in monopoly markets, contract discrimination amongst users results in a unique market equilibrium that is efficient, which in turn results in network security improvement however, the cyber-insurer can make zero expected profits. The latter fact is often sufficient to de-incentivize the insurer to be a part of a market, and will eventually lead to its collapse. This fact also emphasizes the need for designing mechanisms that incentivize the insurer to permanently be part of the market.", "citation": "Citations (32)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "T-Labs., Germany"], "authors": ["Ranjan Pal.....http://dblp.org/pers/hd/p/Pal:Ranjan", "Leana Golubchik.....http://dblp.org/pers/hd/g/Golubchik:Leana", "Konstantinos Psounis.....http://dblp.org/pers/hd/p/Psounis:Konstantinos", "Pan Hui.....http://dblp.org/pers/hd/h/Hui:Pan"], "conf": "infocom", "year": "2014", "pages": 9}