{"title": "Cardinal Pill Testing of System Virtual Machines.", "fields": ["implementation", "pill testing", "malware", "virtual machine", "malware analysis"], "abstract": "Malware analysis relies heavily on the use of virtual machines for functionality and safety. There are subtle differences in operation between virtual machines and physical machines. Contemporary malware checks for these differences to detect that it is being run in a virtual machine, and modifies its behavior to thwart being analyzed by the defenders. Existing approaches to uncover these differences use randomized testing, or malware analysis, and cannot guarantee completeness.\n\nIn this paper we propose Cardinal Pill Testing--a modification of Red Pill Testing [21] that aims to enumerate the differences between a given VM and a physical machine, through carefully designed tests. Cardinal Pill Testing finds five times more pills by running fifteen times fewer tests than Red Pill Testing. We further examine the causes of pills and find that, while the majority of them stem from the failure of virtual machines to follow CPU design specifications, a significant number stem from under-specification of the effects of certain instructions by the Intel manual. This leads to divergent implementations in different CPU and virtual machine architectures. Cardinal Pill Testing successfully enumerates differences that stem from the first cause, but only exhaustive testing or an understanding of implementation semantics can enumerate those that stem from the second cause. Finally, we sketch a method to hide pills from malware by systematically correcting their outputs in the virtual machine.", "citation": "Citations (14)", "year": "2014", "departments": ["Information Sciences Institute", "Information Sciences Institute", "Information Sciences Institute"], "conf": "uss", "authors": ["Hao Shi.....http://dblp.org/pers/hd/s/Shi:Hao", "Abdulla Alwabel.....http://dblp.org/pers/hd/a/Alwabel:Abdulla", "Jelena Mirkovic.....http://dblp.org/pers/hd/m/Mirkovic:Jelena"], "pages": 15}