{"title": "SLQ: a user-friendly graph querying system.", "fields": ["ranking", "user friendly", "automatic summarization", "graph database", "granularity"], "abstract": "Querying complex graph databases such as knowledge graphs is a challenging task for non-professional users. In this demo, we present SLQ, a user-friendly graph querying system enabling schemales and structures graph querying, where a user need not describe queries precisely as required by most databases. SLQ system combines searching and ranking: it leverages a set of transformation functions, including abbreviation, ontology, synonym, etc., that map keywords and linkages from a query to their matches in a data graph, based on an automatically learned ranking model. To help users better understand search results at different levels of granularity, it supports effective result summarization with \"drill-down\" and \"roll-up\" operations. Better still, the architecture of SLQ is elastic for new transformation functions, query logs and user feedback, to iteratively refine the ranking model. SLQ significantly improves the usability of graph querying. This demonstration highlights (1) SLQ can automatically learn an effective ranking model,  without  assuming manually labeled training examples, (2) it can efficiently return top ranked matches over noisy, large data graphs, (3) it can summarize the query matches to help users easily access, explore and understand query results, and (4) its GUI can interact with users to help them construct queries, explore data graphs and inspect matches in a user-friendly manner.", "citation": "Citations (15)", "year": "2014", "departments": ["University of California, Santa Barbara", "Zhejiang University", "University of California, Santa Barbara", "Zhejiang University", "University of California, Santa Barbara"], "conf": "sigmod", "authors": ["Shengqi Yang.....http://dblp.org/pers/hd/y/Yang:Shengqi", "Yanan Xie.....http://dblp.org/pers/hd/x/Xie:Yanan", "Yinghui Wu.....http://dblp.org/pers/hd/w/Wu:Yinghui", "Tianyi Wu.....http://dblp.org/pers/hd/w/Wu:Tianyi", "Huan Sun.....http://dblp.org/pers/hd/s/Sun:Huan", "Jian Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jian", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng"], "pages": 4}