{"title": "Rescue Tail Queries: Learning to Image Search Re-rank via Click-wise Multimodal Fusion.", "fields": ["ranking", "training set", "search engine", "fusion", "modalities"], "abstract": "Image search engines have achieved good performance for head (popular) queries by leveraging text information and user click data. However, there still remain a large number of tail (rare) queries with relatively unsatisfying search results, which are often overlooked in existing research. Image search for these tail queries therefore provides a grand challenge for research communities. Most existing re-ranking approaches, though effective for head queries, cannot be extended to tail. The assumption of these approaches that  the re-ranked list should not go far away from the initial ranked list  is not applicable to the tail queries. The challenge, thus, relies on how to leverage the possibly unsatisfying initial ranked results and the very limited click data to solve the search intent gap of tail queries.    To deal with this challenge, we propose to mine relevant information from the very few click data by leveraging click-wise-based image pairs and query-dependent multimodal fusion. Specifically, we hypothesize that images with more clicks are more relevant to the given query than the ones with no or relatively less clicks and the effects of different visual modalities to re-rank images are query-dependent. We therefore propose a novel query-dependent learning to re-rank approach for tail queries, called ``click-wise multimodal fusion.'' The approach can not only effectively expand training data by learning relevant information from the constructed click-wise-based image pairs, but also fully explore the effects of multiple visual modalities by adaptively predicting the query-dependent fusion weights. The experiments conducted on a real-world dataset with 100 tail queries show that our proposed approach can significantly improve initial search results by 10.88% and 9.12% in terms of NDCG@5 and NDCG@10, respectively, and outperform several existing re-ranking approaches.", "citation": "Citations (1)", "departments": ["Chinese Academy of Sciences", "Microsoft", "Chinese Academy of Sciences"], "authors": ["Xiaopeng Yang.....http://dblp.org/pers/hd/y/Yang:Xiaopeng", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Yongdong Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongdong"], "conf": "mm", "year": "2014", "pages": 10}