{"title": "The plastic surgery hypothesis.", "fields": ["extant taxon", "chunking", "mount", "contiguity", "code reuse", "empirical process", "commit"], "abstract": "Recent work on genetic-programming-based approaches to automatic program patching have relied on the insight that the content of new code can often be assembled out of fragments of code that already exist in the code base. This insight has been dubbed the plastic surgery hypothesis; successful, well-known automatic repair tools such as GenProg rest on this hypothesis, but it has never been validated. We formalize and validate the plastic surgery hypothesis and empirically measure the extent to which raw material for changes actually already exists in projects. In this paper, we mount a large-scale study of several large Java projects, and examine a history of 15,723 commits to determine the extent to which these commits are graftable, i.e., can be reconstituted from existing code, and find an encouraging degree of graftability, surprisingly independent of commit size and type of commit. For example, we find that changes are 43% graftable from the exact version of the software being changed. With a view to investigating the difficulty of finding these grafts, we study the abundance of such grafts in three possible sources: the immediately previous version, prior history, and other projects. We also examine the contiguity or chunking of these grafts, and the degree to which grafts can be found in the same file. Our results are quite promising and suggest an optimistic future for automatic program patching methods that search for raw material in already extant code in the project being patched.", "citation": "Not cited", "departments": ["University College London", "University of Massachusetts Amherst", "University of California, Davis", "University College London", "University College London"], "authors": ["Earl T. Barr.....http://dblp.org/pers/hd/b/Barr:Earl_T=", "Yuriy Brun.....http://dblp.org/pers/hd/b/Brun:Yuriy", "Premkumar T. Devanbu.....http://dblp.org/pers/hd/d/Devanbu:Premkumar_T=", "Mark Harman.....http://dblp.org/pers/hd/h/Harman:Mark", "Federica Sarro.....http://dblp.org/pers/hd/s/Sarro:Federica"], "conf": "sigsoft", "year": "2014", "pages": 12}