{"title": "Large Pages May Be Harmful on NUMA Systems.", "fields": ["translation lookaside buffer", "demand paging", "flat memory model", "cache only memory architecture", "page address register"], "abstract": "Application virtual address space is divided into pages, each requiring a virtual-to-physical translation in the page table and the TLB. Large working sets, common among modern applications, necessitate a lot of translations, which increases memory consumption and leads to high TLB and page fault rates. To address this problem, recent hardware introduced support for large pages. Large pages require fewer translations to cover the same address space, so the associated problems diminish.\n\nWe discover, however, that on systems with nonuniform memory access times (NUMA) large pages may fail to deliver benefits or even cause performance degradation. On NUMA systems the memory is spread across several physical nodes; using large pages may contribute to the imbalance in the distribution of memory controller requests and reduced locality of accesses, both of which can drive up memory latencies.\n\nOur analysis concluded that: (a) on NUMA systems with large pages it is more crucial than ever to use memory placement algorithms that balance the load across memory controllers and maintain locality; (b) there are cases when NUMA-aware memory placement is not sufficient for optimal performance, and the only resort is to split the offending large pages. To address these challenges, we extend an existing NUMA page placement algorithm with support for large pages. We demonstrate that it recovers the performance lost due to the use of large pages and makes their benefits accessible to applications.", "citation": "Citations (27)", "departments": ["Simon Fraser University", "Centre national de la recherche scientifique", "University of Grenoble", "Simon Fraser University", "Simon Fraser University"], "authors": ["Fabien Gaud.....http://dblp.org/pers/hd/g/Gaud:Fabien", "Baptiste Lepers.....http://dblp.org/pers/hd/l/Lepers:Baptiste", "Jeremie Decouchant.....http://dblp.org/pers/hd/d/Decouchant:Jeremie", "Justin R. Funston.....http://dblp.org/pers/hd/f/Funston:Justin_R=", "Alexandra Fedorova.....http://dblp.org/pers/hd/f/Fedorova:Alexandra", "Vivien Quéma.....http://dblp.org/pers/hd/q/Qu=eacute=ma:Vivien"], "conf": "usenix", "year": "2014", "pages": 12}