{"title": "XvMotion: Unified Virtual Machine Migration over Long Distance.", "fields": ["live migration", "data migration", "network file system", "virtualization", "downtime"], "abstract": "Live virtual machine migration allows the movement of a running VM from one physical host to another with negligible disruption in service. This enables many compelling features including zero downtime hardware upgrades, dynamic resource management, and test to production service migration.\n\nHistorically, live migration worked only between machines that shared a common local subnet and storage system. As network speed and flexibility has increased and virtualization has become more pervasive, wide area migration is increasingly viable and compelling. Ad-hoc solutions for wide area migration have been built, combining existing mechanisms for memory migration with techniques for sharing storage including network file systems, proprietary storage array replication or software replicated block devices. Unfortunately, these solutions are complex, inflexible, unreliable and perform poorly compared to local migration, thus are rarely deployed.\n\nWe have built and deployed a live migration system called XvMotion that overcomes these limitations. Xv-Motion integrates support for memory and storage migration over the local and wide area. It is robust to the variable storage and network performance encountered when migrating long distances across heterogeneous systems, while yielding reliability, migration times and downtimes similar to local migration. Our system has been in active use by customers for over a year within metro area networks.", "citation": "Citations (26)", "departments": ["Stanford University", "VMware", "VMware", "VMware", "VMware"], "authors": ["Ali José Mashtizadeh.....http://dblp.org/pers/hd/m/Mashtizadeh:Ali_Jos=eacute=", "Min Cai.....http://dblp.org/pers/hd/c/Cai:Min", "Gabriel Tarasuk-Levin.....http://dblp.org/pers/hd/t/Tarasuk=Levin:Gabriel", "Ricardo Koller.....http://dblp.org/pers/hd/k/Koller:Ricardo", "Tal Garfinkel.....http://dblp.org/pers/hd/g/Garfinkel:Tal", "Sreekanth Setty.....http://dblp.org/pers/hd/s/Setty:Sreekanth"], "conf": "usenix", "year": "2014", "pages": 12}