{"title": "Phaser: enabling phased array signal processing on commodity WiFi access points.", "fields": ["phased array", "angle of arrival", "array processing", "sensor array", "offset"], "abstract": "Signal processing on antenna arrays has received much recent attention in the mobile and wireless networking research communities, with array signal processing approaches addressing the problems of human movement detection, indoor mobile device localization, and wireless network security. However, there are two important challenges inherent in the design of these systems that must be overcome if they are to be of practical use on commodity hardware. First, phase differences between the radio oscillators behind each antenna can make readings unusable, and so must be corrected in order for most techniques to yield high-fidelity results. Second, while the number of antennas on commodity access points is usually limited, most array processing increases in fidelity with more antennas. These issues work in synergistic opposition to array processing: without phase offset correction, no phase-difference array processing is possible, and with fewer antennas, automatic correction of these phase offsets becomes even more challenging. We present Phaser, a system that solves these intertwined problems to make phased array signal processing truly practical on the many WiFi access points deployed in the real world. Our experimental results on three- and five-antenna 802.11-based hardware show that 802.11 NICs can be calibrated and synchronized to a 20° median phase error, enabling inexpensive deployment of numerous phase-difference based spectral analysis techniques previously only available on costly, special-purpose hardware.", "citation": "Citations (96)", "departments": ["University College London", "University College London", "University College London", "University College London"], "authors": ["Jon Gjengset.....http://dblp.org/pers/hd/g/Gjengset:Jon", "Jie Xiong.....http://dblp.org/pers/hd/x/Xiong_0001:Jie", "Graeme McPhillips.....http://dblp.org/pers/hd/m/McPhillips:Graeme", "Kyle Jamieson.....http://dblp.org/pers/hd/j/Jamieson:Kyle"], "conf": "mobicom", "year": "2014", "pages": 12}