{"title": "LSDA: Large Scale Detection through Adaptation.", "fields": ["scaling", "object detection", "minimum bounding box", "convolutional neural network", "architecture"], "abstract": "A major challenge in scaling object detection is the difficulty of obtaining labeled images for large numbers of categories. Recently, deep convolutional neural networks (CNNs) have emerged as clear winners on object classification benchmarks, in part due to training with 1.2M+ labeled classification images. Unfortunately, only a small fraction of those labels are available for the detection task. It is much cheaper and easier to collect large quantities of image-level labels from search engines than it is to collect detection data and label it with precise bounding boxes. In this paper, we propose Large Scale Detection through Adaptation (LSDA), an algorithm which learns the difference between the two tasks and transfers this knowledge to classifiers for categories without bounding box annotated data, turning them into detectors. Our method has the potential to enable detection for the tens of thousands of categories that lack bounding box annotations, yet have plenty of classification data. Evaluation on the ImageNet LSVRC-2013 detection challenge demonstrates the efficacy of our approach. This algorithm enables us to produce a >7.6K detector by using available classification data from leaf nodes in the ImageNet tree. We additionally demonstrate how to modify our architecture to produce a fast detector (running at 2fps for the 7.6K detector). Models and software are available at lsda.berkeleyvision.org.", "citation": "Citations (159)", "year": "2014", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Tsinghua University", "University of California, Berkeley"], "conf": "nips", "authors": ["Judy Hoffman.....http://dblp.org/pers/hd/h/Hoffman:Judy", "Sergio Guadarrama.....http://dblp.org/pers/hd/g/Guadarrama:Sergio", "Eric Tzeng.....http://dblp.org/pers/hd/t/Tzeng:Eric", "Ronghang Hu.....http://dblp.org/pers/hd/h/Hu:Ronghang", "Jeff Donahue.....http://dblp.org/pers/hd/d/Donahue:Jeff", "Ross B. Girshick.....http://dblp.org/pers/hd/g/Girshick:Ross_B=", "Trevor Darrell.....http://dblp.org/pers/hd/d/Darrell:Trevor", "Kate Saenko.....http://dblp.org/pers/hd/s/Saenko:Kate"], "pages": 9}