{"title": "Efficient Shared-Memory Implementation of High-Performance Conjugate Gradient Benchmark and its Application to Unstructured Matrices.", "fields": ["shared memory", "xeon", "grid", "data access", "xeon phi"], "abstract": "A new sparse high performance conjugate gradient benchmark (HPCG) has been recently released to address challenges in the design of sparse linear solvers for the next generation extreme-scale computing systems. Key computation, data access, and communication pattern in HPCG represent building blocks commonly found in today's HPC applications. While it is a well known challenge to efficiently parallelize Gauss-Seidel smoother, the most time-consuming kernel in HPCG, our algorithmic and architecture-aware optimizations deliver 95% and 68% of the achievable bandwidth on Xeon and Xeon Phi, respectively. Based on available parallelism, our Xeon Phi shared-memory implementation of Gauss-Seidel smoother selectively applies block multi-color reordering. Combined with MPI parallelization, our implementation balances parallelism, data access locality, CG convergence rate, and communication overhead. Our implementation achieved 580 TFLOPS (82% parallelization efficiency) on Tianhe-2 system, ranking first on the most recent HPCG list in July 2014. In addition, we demonstrate that our optimizations not only benefit HPCG original dataset, which is based on structured 3D grid, but also a wide range of unstructured matrices.", "citation": "Citations (25)", "departments": ["Intel", "Intel", "Intel", "Intel", "Intel"], "authors": ["Jongsoo Park.....http://dblp.org/pers/hd/p/Park:Jongsoo", "Mikhail Smelyanskiy.....http://dblp.org/pers/hd/s/Smelyanskiy:Mikhail", "Karthikeyan Vaidyanathan.....http://dblp.org/pers/hd/v/Vaidyanathan:Karthikeyan", "Alexander Heinecke.....http://dblp.org/pers/hd/h/Heinecke:Alexander", "Dhiraj D. Kalamkar.....http://dblp.org/pers/hd/k/Kalamkar:Dhiraj_D=", "Xing Liu.....http://dblp.org/pers/hd/l/Liu:Xing", "Md. Mostofa Ali Patwary.....http://dblp.org/pers/hd/p/Patwary:Md=_Mostofa_Ali", "Yutong Lu.....http://dblp.org/pers/hd/l/Lu:Yutong", "Pradeep Dubey.....http://dblp.org/pers/hd/d/Dubey:Pradeep"], "conf": "sc", "year": "2014", "pages": 11}