{"title": "Finding Instability in Biological Models.", "fields": ["soundness", "brute force search", "speedup", "modular design", "limiting"], "abstract": "The stability of biological models is an important test for establishing their soundness and accuracy. Stability in biological systems represents the ability of a robust system to always return to homeostasis. In recent work, modular approaches for proving stability have been found to be swift and scalable. If stability is however not proved, the currently available techniques apply an exhaustive search through the unstable state space to find loops. This search is frequently prohibitively computationally expensive, limiting its usefulness. Here we present a new modular approach eliminating the need for an exhaustive search for loops. Using models of biological systems we show that the technique finds loops significantly faster than brute force approaches. Furthermore, for a subset of stable systems which are resistant to modular proofs, we observe a speed up of up to 3 orders of magnitude as the exhaustive searches for loops which cause instability are avoided. With our new procedure we are able to prove instability and stability in a number of realistic biological models, including adaptation in bacterial chemotaxis, the lambda phage lysogeny/lysis switch, voltage gated channel opening and cAMP oscillations in the slime mold Dictyostelium discoideum. This new approach will support the development of new tools for biomedicine.", "citation": "Not cited", "year": "2014", "departments": ["University College London", "University of Cambridge", "Microsoft", "Microsoft", "University of California, Berkeley"], "conf": "cav", "authors": ["Byron Cook.....http://dblp.org/pers/hd/c/Cook:Byron", "Jasmin Fisher.....http://dblp.org/pers/hd/f/Fisher:Jasmin", "Benjamin A. Hall.....http://dblp.org/pers/hd/h/Hall:Benjamin_A=", "Samin Ishtiaq.....http://dblp.org/pers/hd/i/Ishtiaq:Samin", "Garvit Juniwal.....http://dblp.org/pers/hd/j/Juniwal:Garvit", "Nir Piterman.....http://dblp.org/pers/hd/p/Piterman:Nir"], "pages": 15}