{"title": "Automated design of self-adaptive software with control-theoretical formal guarantees.", "fields": ["software design description", "verification and validation", "software engineering", "formal methods", "software construction", "software design", "software sizing", "software"], "abstract": "Self-adaptation enables software to execute successfully in dynamic, unpredictable, and uncertain environments.     Control theory provides a broad set of mathematically grounded techniques for adapting the behavior of dynamic systems. While it has been applied to specific software control problems, it has proved difficult to define methodologies allowing non-experts to systematically apply control techniques to create adaptive software. These difficulties arise because computer systems are usually non-linear, with varying workloads and heterogeneous components, making it difficult to model software as a dynamic system; i.e., by means of differential or difference equations.     This paper proposes a broad scope methodology for automatically constructing both an approximate dynamic model of a software system and a suitable controller for managing its non-functional requirements. Despite its generality, this methodology provides formal guarantees concerning the system's dynamic behavior by keeping its model continuously updated to compensate for changes in the execution environment and effects of the initial approximation.     We apply the methodology to three case studies, demonstrating its generality by tackling different domains (and different non-functional requirements) with the same approach. Being broadly applicable and fully automated, this methodology may allow the adoption of control theoretical solutions (and their formal properties) for a wide range of software adaptation problems.", "citation": "Not cited", "departments": ["University of Stuttgart", "University of Chicago", "Lund University"], "authors": ["Antonio Filieri.....http://dblp.org/pers/hd/f/Filieri:Antonio", "Henry Hoffmann.....http://dblp.org/pers/hd/h/Hoffmann:Henry", "Martina Maggio.....http://dblp.org/pers/hd/m/Maggio:Martina"], "conf": "icse", "year": "2014", "pages": 12}