{"title": "Spatio-temporal factorization of log data for understanding network events.", "fields": ["root cause", "cluster analysis", "networking hardware", "factorization", "network simulation"], "abstract": "Understanding the impacts and patterns of network events such as link flaps or hardware errors is crucial for diagnosing network anomalies. In large production networks, analyzing the log messages that record network events has become a challenging task due to the following two reasons. First, the log messages are composed of unstructured text messages generated by vendor-specific rules. Second, network equipment such as routers, switches, and RADIUS severs generate various log messages induced by network events that span across several geographical locations, network layers, protocols, and services. In this paper, we have tackled these obstacles by building two novel techniques: statistical template extraction (STE) and log tensor factorization (LTF). STE leverages a statistical clustering technique to automatically extract primary templates from un- structured log messages. LTF aims to build a statistical model that captures spatial-temporal patterns of log messages. Such spatial- temporal patterns provide useful insights into understanding the impacts and root cause of hidden network events. This paper first formulates our problem in a mathematical way. We then validate our techniques using massive amount of network log messages collected from a large operating network. We also demonstrate several case studies that validate the usefulness of our technique. I. INTRODUCTION", "citation": "Citations (19)", "departments": ["Waseda University", "NTT Network Tec ... usashino, Japan", "NTT Network Tec ... usashino, Japan", "NTT Service Evo ... Yokosuka, Japan", "NTT Network Tec ... usashino, Japan"], "authors": ["Tatsuaki Kimura.....http://dblp.org/pers/hd/k/Kimura:Tatsuaki", "Keisuke Ishibashi.....http://dblp.org/pers/hd/i/Ishibashi:Keisuke", "Tatsuya Mori.....http://dblp.org/pers/hd/m/Mori:Tatsuya", "Hiroshi Sawada.....http://dblp.org/pers/hd/s/Sawada:Hiroshi", "Tsuyoshi Toyono.....http://dblp.org/pers/hd/t/Toyono:Tsuyoshi", "Ken Nishimatsu.....http://dblp.org/pers/hd/n/Nishimatsu:Ken", "Akio Watanabe.....http://dblp.org/pers/hd/w/Watanabe:Akio", "Akihiro Shimoda.....http://dblp.org/pers/hd/s/Shimoda:Akihiro", "Kohei Shiomoto.....http://dblp.org/pers/hd/s/Shiomoto:Kohei"], "conf": "infocom", "year": "2014", "pages": 9}