{"title": "Computing with a full memory: catalytic space.", "fields": ["determinant", "algebraic number", "model of computation", "exponential time hypothesis", "pspace", "discrete mathematics", "mathematics"], "abstract": "We define the notion of a  catalytic-space  computation. This is a computation that has a small amount of clean space available and is equipped with additional auxiliary space, with the caveat that the additional space is initially in an arbitrary, possibly incompressible, state and must be returned to this state when the computation is finished. We show that the extra space can be used in a nontrivial way, to compute uniform TC 1 -circuits with just a logarithmic amount of clean space. The extra space thus works analogously to a catalyst in a chemical reaction. TC 1 -circuits can compute for example the determinant of a matrix, which is not known to be computable in logspace.   In order to obtain our results we study an algebraic model of computation, a variant of straight-line programs. We employ register machines with input registers  x  1 ,...,  x   n   and work registers  r  1 ,...,  r   m  . The instructions available are of the form  r   i   ←  r   i  ± u × v , with  u, v  registers (distinct from  r   i  ) or constants. We wish to compute a function  f ( x  1 ,...,  x   n  ) through a sequence of such instructions. The working registers have some arbitrary initial value  r   i    = τ   i   , and they may be altered throughout the computation, but by the end all registers must be returned to their initial value τ   i  , except for, say,  r  1  which must hold  τ  1  +  f ( x  1 ,...,  x   n  ). We show that all of Valiant's class VP, and more, can be computed in this model. This significantly extends the framework and techniques of Ben-Or and Cleve [6].   Upper bounding the power of catalytic computation we show that catalytic logspace is contained in ZPP. We further construct an oracle world where catalytic logpace is equal to PSPACE, and show that under the exponential time hypothesis (ETH), SAT can not be computed in catalytic sub-linear space.", "citation": "Not cited", "year": "2014", "departments": ["University of Amsterdam", "University of Waterloo", "Charles University in Prague", "CWI, Amsterdam", "CWI, Amsterdam"], "conf": "stoc", "authors": ["Harry Buhrman.....http://dblp.org/pers/hd/b/Buhrman:Harry", "Richard Cleve.....http://dblp.org/pers/hd/c/Cleve:Richard", "Michal Koucký.....http://dblp.org/pers/hd/k/Kouck=yacute=:Michal", "Bruno Loff.....http://dblp.org/pers/hd/l/Loff:Bruno", "Florian Speelman.....http://dblp.org/pers/hd/s/Speelman:Florian"], "pages": 10}