{"title": "Scaling laws for heterogeneous cognitive radio networks with cooperative secondary users.", "fields": ["scaling", "spectrum management", "cognitive radio", "time division multiple access", "idle"], "abstract": "Cognitive radio (CR) technique is considered an effective mechanism to relieve the spectrum scarcity issue, where the secondary users (SUs) can utilize the idle spectrum of the primary users (PUs). How the performance of the wireless network will be influenced by the introduction of CR technique has been attracting much attention in past years. While many efforts have been made to study the cognitive radio network, where the data source and the destination (S-D) is homogeneously distributed, the research on cognitive radio networks (CRN) with heterogeneous S-D distribution is still very limited. In this paper, we investigate the throughput and delay scaling law in the heterogeneous cognitive radio network (HCRN), where the S-D pair follows a rank based model and SUs provide relay service for PUs in reciprocating the utilization of PUs' idle spectrum. By applying a cellular TDMA scheduling scheme, we show that the primary network throughput is the same for different heterogeneous extents of S-D distribution owing to the flexible assistance of SUs, while the throughput of secondary networks is proven to be changing with respect to the S-D heterogeneity exponent denoted by . In addition, the delay scaling are derived for both primary and secondary networks and shown to be altering in accordance with . Further, we reveal that the density of SUs required to assist PUs can be dramatically reduced when considering the S-D heterogeneity, while achieving the same primary network throughput.", "citation": "Citations (4)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Hong Kong University of Science and Technology"], "authors": ["Riheng Jia.....http://dblp.org/pers/hd/j/Jia:Riheng", "Jinbei Zhang.....http://dblp.org/pers/hd/z/Zhang:Jinbei", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Xiaohua Tian.....http://dblp.org/pers/hd/t/Tian:Xiaohua", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian"], "conf": "infocom", "year": "2014", "pages": 9}