{"title": "An extendable framework for managing uncertain spatio-temporal data.", "fields": ["codebase", "probabilistic logic", "ground truth", "temporal database", "extensibility"], "abstract": "This demonstration presents our Uncertain-Spatio-Temporal (UST)} framework that we have developed in recent years. The framework allows not only to visualize and explore spatio-temporal data consisting of (location, time, object)-triples but also provides an extensive codebase easily extensible and customizable by developers and researchers. The main research focus of this UST-framework is the explicit consideration of uncertainty, an aspect that is inherent in spatio-temporal data, due to infrequent position updates, due to physical limitations and due to power constraints. The UST-framework can be used to obtain a deeper intuition of the quality of spatio-temporal data models. Such models aim at estimating the position of a spatio-temporal object at a time where the object's position is not explicitly known, for example by using both historic (traffic-) pattern information, and by using explicit observations of objects. The UST-framework illustrates the resulting distributions by allowing a user to move forward and backward in time. Additionally the framework allows users to specify simple spatio-temporal queries, such as spatio-temporal window queries and spatio-temporal nearest neighbor (NN) queries. Based on recently published theoretic concepts, the UST-framework allows to visually explore the impact of different models and parameters on spatio-temporal data. The main result showcased by the UST-framework is a minimization of uncertainty by employing stochastic processes, leading to small expected distances between ground truth trajectories and modelled positions.", "citation": "Not cited", "year": "2014", "departments": ["Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich"], "conf": "sigmod", "authors": ["Tobias Emrich.....http://dblp.org/pers/hd/e/Emrich:Tobias", "Maximilian Franzke.....http://dblp.org/pers/hd/f/Franzke:Maximilian", "Hans-Peter Kriegel.....http://dblp.org/pers/hd/k/Kriegel:Hans=Peter", "Johannes Niedermayer.....http://dblp.org/pers/hd/n/Niedermayer:Johannes", "Matthias Renz.....http://dblp.org/pers/hd/r/Renz:Matthias", "Andreas Züfle.....http://dblp.org/pers/hd/z/Z=uuml=fle:Andreas"], "pages": 4}