{"title": "Giving is caring: understanding donation behavior through email.", "fields": ["politics", "presidential election", "demographics", "donation", "social network"], "abstract": "Every day, thousands of people make donations to humanitarian, political, environmental, and other causes, a large amount of which occur on the Internet. The solicitations for support, the acknowledgment of a donation and the discussion of corresponding issues are often conducted via email, leaving a record of these social phenomena. In this paper, we describe a comprehensive large-scale data-driven study of donation behavior. We analyze a two-month anonymized email log from several perspectives motivated by past studies on charitable giving: (i) demographics, (ii) user interest, (iii) external time-related factors and (iv) social network influence. We show that email captures the demographic peculiarities of different interest groups, for instance, predicting demographic distributions found in US 2012 Presidential Election exit polls. Furthermore, we find that people respond to major national events, as well as to solicitations with special promotions, and that social connections are the most important factor in predicting donation behavior. Specifically, we identify trends not only for individual charities and campaigns, but also for high-level categories such as political campaigns, medical illnesses, and humanitarian relief. Thus, we show the extent to which large-scale email datasets reveal human donation behavior, and explore the limitations of such analysis.", "citation": "Citations (6)", "departments": ["Yahoo!", "Qatar Computing Research Institute", "Qatar Computing Research Institute", "University of California, Berkeley"], "authors": ["Yelena Mejova.....http://dblp.org/pers/hd/m/Mejova:Yelena", "Venkata Rama Kiran Garimella.....http://dblp.org/pers/hd/g/Garimella:Venkata_Rama_Kiran", "Ingmar Weber.....http://dblp.org/pers/hd/w/Weber:Ingmar", "Michael C. Dougal.....http://dblp.org/pers/hd/d/Dougal:Michael_C="], "conf": "cscw", "year": "2014", "pages": 11}