{"title": "Detecting energy bugs and hotspots in mobile apps.", "fields": ["non functional testing", "energy consumption", "idle", "hotspot", "android"], "abstract": "Over the recent years, the popularity of smartphones has increased dramatically. This has lead to a widespread availability of smartphone applications. Since smartphones operate on a limited amount of battery power, it is important to develop tools and techniques that aid in energy-efficient application development. Energy inefficiencies in smartphone applications can broadly be categorized into energy hotspots and energy bugs. An energy hotspot can be described as a scenario where executing an application causes the smartphone to consume abnormally high amount of battery power, even though the utilization of its hardware resources is low. In contrast, an energy bug can be described as a scenario where a malfunctioning application prevents the smartphone from becoming idle, even after it has completed execution and there is no user activity. In this paper, we present an automated test generation framework that detects energy hotspots/bugs in Android applications. Our framework systematically generates test inputs that are likely to capture energy hotspots/bugs. Each test input captures a sequence of user interactions (e.g. touches or taps on the smartphone screen) that leads to an energy hotspot/bug in the application. Evaluation with 30 freely-available Android applications from Google Play/F-Droid shows the efficacy of our framework in finding hotspots/bugs. Manual validation of the experimental results shows that our framework reports reasonably low number of false positives. Finally, we show the usage of the generated results by improving the energy-efficiency of some Android applications.", "citation": "Citations (110)", "departments": ["National University of Singapore", "National University of Singapore", "Linköping University", "National University of Singapore"], "authors": ["Abhijeet Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Abhijeet", "Lee Kee Chong.....http://dblp.org/pers/hd/c/Chong:Lee_Kee", "Sudipta Chattopadhyay.....http://dblp.org/pers/hd/c/Chattopadhyay_0001:Sudipta", "Abhik Roychoudhury.....http://dblp.org/pers/hd/r/Roychoudhury:Abhik"], "conf": "sigsoft", "year": "2014", "pages": 11}