{"title": "Continuous pattern detection over billion-edge graph using distributed framework.", "fields": ["strength of a graph", "graph bandwidth", "moral graph", "null graph", "graph operations"], "abstract": "Continuous pattern detection plays an important role in monitoring-related applications. The large size and dynamic update of graphs, along with the massive search space, pose huge challenges in developing an efficient continuous pattern detection system. In this paper, we leverage a distributed graph processing framework to approximately detect a given pattern over a large dynamic graph. We aim to improve the scalability and precision, and reduce the response time and message cost in the detection. We convert a given query pattern into a Single-Sink DAG (Directed Acyclic Graph), and propose an evaluation plan with message transitions on the DAG, which is shorten by SSD plan, to detect the pattern in a large dynamic graph. SSD plan can guide the data graph exploration via messages, and the messages will converge at data sink vertices, which then detect existences of the query pattern. We also conduct join operations over partial vertices during the graph exploration to improve the precision of pattern detection. In addition, we show that SSD plan can support the continuous query over dynamic graphs with slight extensions. We further design various sink vertex selection strategies and neighborhood based transition rule attachment to lower the evaluation cost. The experiments on billion-edge real-life graphs using Giraph, an open source implementation of Pregel, illustrate the efficiency and effectiveness of our method.", "citation": "Citations (25)", "departments": ["Chinese Ministry of Education", "Chinese Ministry of Education", "Chinese Ministry of Education", "The Chinese University of Hong Kong"], "authors": ["Jun Gao.....http://dblp.org/pers/hd/g/Gao:Jun", "Chang Zhou.....http://dblp.org/pers/hd/z/Zhou:Chang", "Jiashuai Zhou.....http://dblp.org/pers/hd/z/Zhou:Jiashuai", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu"], "conf": "icde", "year": "2014", "pages": 12}