{"title": "Intelligent SDN based traffic (de)Aggregation and Measurement Paradigm (iSTAMP).", "fields": ["traffic generation model", "openflow", "content addressable memory", "flow network", "network management"], "abstract": "Fine-grained traffic flow measurement, which provides useful information for network management tasks and security analysis, can be challenging to obtain due to monitoring resource constraints. The alternate approach of inferring flow statistics from partial measurement data has to be robust against dynamic temporal/spatial fluctuations of network traffic. In this paper, we propose an intelligent Traffic (de)Aggregation and Measurement Paradigm (iSTAMP), which partitions TCAM entries of switches/routers into two parts to: 1) optimally aggregate part of incoming flows for aggregate measurements, and 2) de-aggregate and directly measure the most informative flows for per-flow measurements. iSTAMP then processes these aggregate and per-flow measurements to effectively estimate network flows using a variety of optimization techniques. With the advent of Software-Defined-Networking (SDN), such real-time rule (re)configuration can be achieved via OpenFlow or other similar SDN APIs. We first show how to design the optimal aggregation matrix for minimizing the flow-size estimation error. Moreover, we propose a method for designing an efficient-compressive flow aggregation matrix under hard resource constraints of limited TCAM sizes. In addition, we propose an intelligent Multi-Armed Bandit based algorithm to adaptively sample the most 'rewarding' flows, whose accurate measurements have the highest impact on the overall flow measurement and estimation performance. We evaluate the performance of iSTAMP using real traffic traces from a variety of network environments and by considering two applications: traffic matrix estimation and heavy hitter detection. Also, we have implemented a prototype of iSTAMP and demonstrated its feasibility and effectiveness in Mininet environment. © 2014 IEEE.", "citation": "Citations (64)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "Hewlett-Packard"], "authors": ["Mehdi Malboubi.....http://dblp.org/pers/hd/m/Malboubi:Mehdi", "Liyuan Wang.....http://dblp.org/pers/hd/w/Wang:Liyuan", "Chen-Nee Chuah.....http://dblp.org/pers/hd/c/Chuah:Chen=Nee", "Puneet Sharma.....http://dblp.org/pers/hd/s/Sharma:Puneet"], "conf": "infocom", "year": "2014", "pages": 9}