{"title": "DC express: shortest latency protocol for reading phase change memory over PCI express.", "fields": ["context switch", "nvm express", "iops", "memory controller", "pci express"], "abstract": "Phase Change Memory (PCM) presents an architectural challenge: writing to it is slow enough to make attaching it to a CPU's main memory controller impractical, yet reading from it is so fast that using it in a peripheral storage device would leave much of its performance potential untapped at low command queue depths, throttled by the high latencies of the common peripheral buses and existing device protocols.\n\nHere we explore the limits of communication latency with a PCM-based storage device over PCI Express. We devised a communication protocol, dubbed DC Express, where the device continuously polls read command queues in host memory without waiting for host-driven initiation, and completion signals are eliminated in favor of a novel completion detection procedure that marks receive buffers in host memory with incomplete tags and monitors their disappearance. By eliminating superfluous PCI Express packets and context switches in this manner we are able to exceed 700,000 IOPS on small random reads at queue depth 1.", "citation": "Citations (17)", "departments": ["HGST San Jose Research Center", "HGST San Jose Research Center", "HGST San Jose Research Center", "HGST San Jose Research Center", "HGST San Jose Research Center"], "authors": ["Dejan Vucinic.....http://dblp.org/pers/hd/v/Vucinic:Dejan", "Qingbo Wang.....http://dblp.org/pers/hd/w/Wang:Qingbo", "Cyril Guyot.....http://dblp.org/pers/hd/g/Guyot:Cyril", "Robert Mateescu.....http://dblp.org/pers/hd/m/Mateescu:Robert", "Filip Blagojevic.....http://dblp.org/pers/hd/b/Blagojevic:Filip", "Luiz Franca-Neto.....http://dblp.org/pers/hd/f/Franca=Neto:Luiz", "Damien Le Moal.....http://dblp.org/pers/hd/m/Moal:Damien_Le", "Trevor Bunker.....http://dblp.org/pers/hd/b/Bunker:Trevor", "Jian Xu.....http://dblp.org/pers/hd/x/Xu:Jian", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven", "Zvonimir Bandic.....http://dblp.org/pers/hd/b/Bandic:Zvonimir"], "conf": "fast", "year": "2014", "pages": 7}