{"title": "3D Interest Maps From Simultaneous Video Recordings.", "fields": ["crowdsourcing", "salience", "mashup", "viewpoints", "semantics"], "abstract": "We consider an emerging situation where multiple cameras are filming the same event simultaneously from a diverse set of angles. The captured videos provide us with the multiple view geometry and an understanding of the 3D structure of the scene. We further extend this understanding by introducing the concept of  3D interest map  in this paper. As most users naturally film what they find interesting from their respective viewpoints, the 3D structure can be annotated with the level of interest, naturally crowdsourced from the users. A 3D interest map can be understood as an extension of saliency maps in the 3D space that captures the semantics of the scene. We evaluate the idea of 3D interest maps on two real datasets, taken from the environment or the cameras that are equipped enough to have an estimation of the poses of cameras and a reasonable synchronization between them. We study two aspects of the 3D interest maps in our evaluation. First, by projecting them into 2D, we compare them to state-of-the-art saliency maps. Second, to demonstrate the usefulness of the 3D interest maps, we apply them to a video mashup system that automatically produces an edited video from one of the datasets.", "citation": "Citations (3)", "departments": ["University of Toulouse", "Simula Research Laboratory", "National University of Singapore", "National University of Singapore", "University of Toulouse"], "authors": ["Axel Carlier.....http://dblp.org/pers/hd/c/Carlier:Axel", "Lilian Calvet.....http://dblp.org/pers/hd/c/Calvet:Lilian", "Duong-Trung-Dung Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Duong=Trung=Dung", "Wei Tsang Ooi.....http://dblp.org/pers/hd/o/Ooi:Wei_Tsang", "Pierre Gurdjos.....http://dblp.org/pers/hd/g/Gurdjos:Pierre", "Vincent Charvillat.....http://dblp.org/pers/hd/c/Charvillat:Vincent"], "conf": "mm", "year": "2014", "pages": 10}