{"title": "Graph logics with rational relations: the role of word combinatorics.", "fields": ["suffix", "monoidal t norm logic", "pspace", "t norm fuzzy logics", "undecidable problem", "graph database"], "abstract": "Graph databases make use of logics that combine traditional first-order features with navigation on paths, in the same way logics for model checking do. However, modern applications of graph databases impose a new requirement on the expressiveness of the logics: they need comparing labels of paths based on word relations (such as prefix, subword, or subsequence). This has led to the study of logics that extend basic graph languages with features for comparing labels of paths based on regular relations or the strictly more powerful rational relations. The evaluation problem for the former logic is decidable (and even tractable in data complexity), but already extending this logic with such a common rational relation as subword or suffix makes evaluation undecidable. In practice, however, it is rare to have the need for such powerful logics. Therefore, it is more realistic to study the complexity of less expressive logics that still allow comparing paths based on practically motivated rational relations. Here we concentrate on the most basic languages, which extend graph pattern logics with path comparisons based only on suffix, subword, or subsequence. We pinpoint the complexity of evaluation for each one of these logics, which shows that all of them are decidable in elementary time (P space  or NE xptime ). Furthermore, the extension with suffix is even tractable in data complexity (but the other two are not). In order to obtain our results we establish a link between the evaluation problem for graph logics and two important problems in word combinatorics: word equations with regular constraints and longest common subsequence.", "citation": "Citations (2)", "departments": ["University of Chile", "University of Chile", "University of Chile", "University of Chile"], "authors": ["Pablo Barceló.....http://dblp.org/pers/hd/b/Barcel=oacute=:Pablo", "Pablo Muñoz.....http://dblp.org/pers/hd/m/Mu=ntilde=oz:Pablo"], "conf": "lics", "year": "2014", "pages": 10}