{"title": "Latent Tensor Transfer Learning for RGB-D Action Recognition.", "fields": ["background subtraction", "rgb color model", "linear subspace", "source data", "transfer of learning"], "abstract": "This paper proposes a method to compensate RGB-D images from the original target RGB images by transferring the depth knowledge of source data. Conventional RGB databases (e.g., UT-Interaction database) do not contain depth information since they are captured by the RGB cameras. Therefore, the methods designed for {RGB} databases cannot take advantage of depth information, which proves useful for simplifying intra-class variations and background subtraction. In this paper, we present a novel transfer learning method that can transfer the knowledge from depth information to the RGB database, and use the additional source information to recognize human actions in RGB videos. Our method takes full advantage of 3D geometric information contained within the learned depth data, thus, can further improve action recognition performance. We treat action data as a fourth-order tensor (row, column, frame and sample), and apply latent low-rank transfer learning to learn shared subspaces of the source and target databases. Moreover, we introduce a novel cross-modality regularizer that plays an important role in finding the correlation between RGB and depth modalities, and then more depth information from the source database can be transferred to that of the target. Our method is extensively evaluated on public by available databases. Results of two action datasets show that our method outperforms existing methods.", "citation": "Citations (20)", "departments": ["Northeastern University", "Northeastern University", "Northeastern University", "Northeastern University"], "authors": ["Chengcheng Jia.....http://dblp.org/pers/hd/j/Jia:Chengcheng", "Yu Kong.....http://dblp.org/pers/hd/k/Kong:Yu", "Zhengming Ding.....http://dblp.org/pers/hd/d/Ding:Zhengming", "Yun Raymond Fu.....http://dblp.org/pers/hd/f/Fu:Yun_Raymond"], "conf": "mm", "year": "2014", "pages": 10}