{"title": "How should we measure functional sameness from program source code? an exploratory study on Java methods.", "fields": ["type signature", "exploratory research", "clone", "small number", "structural similarity"], "abstract": "Program source code is one of the main targets of software engineering research. A wide variety of research has been conducted on source code, and many studies have leveraged structural, vocabulary, and method signature similarities to measure the functional sameness of source code. In this research, we conducted an empirical study to ascertain how we should use three similarities to measure functional sameness. We used two large datasets and measured the three similarities between all the method pairs in the datasets, each of which included approximately 15 million Java method pairs. The relationships between the three similarities were analyzed to determine how we should use each to detect functionally similar code. The results of our study revealed the following. (1) Method names are not always useful for detecting functionally similar code. Only if there are a small number of methods having a given name, the methods are likely to include functionally similar code. (2) Existing file-level, method-level, and block-level clone detection techniques often miss functionally similar code generated by copy-and-paste operations between different projects. (3) In the cases we use structural similarity for detecting functionally similar code, we obtained many false positives. However, we can avoid detecting most false positives by using a vocabulary similarity in addition to a structural one. (4) Using a vocabulary similarity to detect functionally similar code is not suitable for method pairs in the same file because such method pairs use many of the same program elements such as private methods or private fields.", "citation": "Citations (7)", "departments": ["Osaka University", "Osaka University"], "authors": ["Yoshiki Higo.....http://dblp.org/pers/hd/h/Higo:Yoshiki", "Shinji Kusumoto.....http://dblp.org/pers/hd/k/Kusumoto:Shinji"], "conf": "sigsoft", "year": "2014", "pages": 12}