{"title": "Validating an iOS-based Rhythmic Auditory Cueing Evaluation (iRACE) for Parkinson's Disease.", "fields": ["concurrent validity", "gait analysis", "parkinson s disease", "movement disorders", "gait"], "abstract": "Movement disorders such as Parkinson's disease (PD) will affect a rapidly growing segment of the population as society continues to age. Rhythmic Auditory Cueing (RAC) is a well-supported evidence-based intervention for the treatment of gait impairments in PD. RAC interventions have not been widely adopted, however, due to limitations in access to personnel, technological, and financial resources. To help \"scale up\" RAC for wider distribution, we have developed an iOS-based Rhythmic Auditory Cueing Evaluation (iRACE) mobile application to deliver RAC and assess motor performance in PD patients. The touchscreen of the mobile device is used to assess motor timing during index finger tapping, and the device's built-in tri-axial accelerometer and gyroscope to assess step time and step length during walking. Novel machine learning-based gait analysis algorithms have been developed for iRACE, including heel strike detection, step length quantification, and left-versus-right foot identification. The concurrent validity of iRACE was assessed using a clinic-standard instrumented walking mat and a pair of force-sensing resistor sensors. Results from 10 PD patients reveal that iRACE has low error rates (", "citation": "Citations (7)", "departments": ["National University of Singapore", "National University of Singapore", "Beth Israel Deaconess Medical Center", "Singapore General Hospital", "National University of Singapore"], "authors": ["Shenggao Zhu.....http://dblp.org/pers/hd/z/Zhu:Shenggao", "Robert J. Ellis.....http://dblp.org/pers/hd/e/Ellis:Robert_J=", "Gottfried Schlaug.....http://dblp.org/pers/hd/s/Schlaug:Gottfried", "Yee Sien Ng.....http://dblp.org/pers/hd/n/Ng:Yee_Sien", "Ye Wang.....http://dblp.org/pers/hd/w/Wang:Ye"], "conf": "mm", "year": "2014", "pages": 10}