{"title": "Twins: Device-free object tracking using passive tags.", "fields": ["free object", "tracking system", "motion detection", "distributed computing", "phenomenon", "computer vision", "video tracking", "software deployment", "artificial intelligence"], "abstract": "Device-free object tracking provides a promising solution for many localization and tracking systems to monitor non-cooperative objects, such as intruders, which do not carry any transceiver. However, existing device-free solutions mainly use special sensors or active RFID tags, which are much more expensive compared to passive tags. In this paper, we propose a novel motion detection and tracking method using passive RFID tags, named Twins. The method leverages a newly observed phenomenon called critical state caused by interference among passive tags. We contribute to both theory and practice of this phenomenon by presenting a new interference model that precisely explains it and using extensive experiments to validate it. We design a practical Twins based intrusion detection system and implement a real prototype by commercial off-the-shelf RFID reader and tags. Experimental results show that Twins is effective in detecting the moving object, with very low location errors of 0.75 m in average (with a deployment spacing of 0.6 m).", "citation": "Citations (68)", "departments": ["Xi'an Jiaotong University", "University of Kentucky", "Xi'an Jiaotong University", "Xi'an Jiaotong University", "Xi'an Jiaotong University", "Xi'an Jiaotong University", "University of Kentucky", "Xi'an Jiaotong University", "Xi'an Jiaotong University", "Xi'an Jiaotong University"], "authors": ["Jinsong Han.....http://dblp.org/pers/hd/h/Han:Jinsong", "Chen Qian.....http://dblp.org/pers/hd/q/Qian_0001:Chen", "Xing Wang.....http://dblp.org/pers/hd/w/Wang:Xing", "Dan Ma.....http://dblp.org/pers/hd/m/Ma:Dan", "Jizhong Zhao.....http://dblp.org/pers/hd/z/Zhao:Jizhong", "Pengfeng Zhang.....http://dblp.org/pers/hd/z/Zhang:Pengfeng", "Wei Xi.....http://dblp.org/pers/hd/x/Xi:Wei", "Zhiping Jiang.....http://dblp.org/pers/hd/j/Jiang:Zhiping"], "conf": "infocom", "year": "2014", "pages": 8}