{"title": "Identifying Hierarchies for Fast Optimal Search.", "fields": ["strength of a graph", "null graph", "indifference graph", "factor critical graph", "block graph", "line graph", "simplex graph", "visibility graph", "pathwidth", "complement graph"], "abstract": "Search with Subgoal Graphs (Uras, Koenig, and Hernandez 2013) was a non-dominated optimal path-planning algorithm in the Grid-Based Path Planning Competitions 2012 and 2013. During a preprocessing phase, it computes a Simple Subgoal Graph from a given grid, which is analogous to a visibility graph for continuous terrain, and then partitions the vertices into global and local subgoals to obtain a Two-Level Subgoal Graph. During the path-planning phase, it performs an A* search that ignores local subgoals that are not relevant to the search, which significantly reduces the size of the graph being searched.\n\nIn this paper, we generalize this partitioning process to any undirected graph and show that it can be recursively applied to generate more than two levels, which reduces the size of the graph being searched even further. We distinguish between basic partitioning, which only partitions the vertices into different levels, and advanced partitioning, which can also add new edges. We show that the construction of Simple-Subgoal Graphs from grids and the construction of Two-Level Subgoal Graphs from Simple Subgoal Graphs are instances of generalized partitioning. We then report on experiments on Subgoal Graphs that demonstrate the effects of different types and levels of partitioning. We also report on experiments that demonstrate that our new N-Level Subgoal Graphs achieve a speed up of 1.6 compared to Two-Level Subgoal graphs from (Uras, Koenig, and Hernandez 2013) on maps from the video games StarCraft and Dragon Age: Origins.", "citation": "Not cited", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California"], "authors": ["Tansel Uras.....http://dblp.org/pers/hd/u/Uras:Tansel", "Sven Koenig.....http://dblp.org/pers/hd/k/Koenig:Sven"], "conf": "aaai", "year": "2014", "pages": 7}