{"title": "Multi-output Learning for Camera Relocalization.", "fields": ["rendering", "pose", "discriminative model", "3d reconstruction", "local optimum"], "abstract": "We address the problem of estimating the pose of a cam- era relative to a known 3D scene from a single RGB-D frame. We formulate this problem as inversion of the generative rendering procedure, i.e., we want to find the camera pose corresponding to a rendering of the 3D scene model that is most similar with the observed input. This is a non-convex optimization problem with many local optima. We propose a hybrid discriminative-generative learning architecture that consists of: (i) a set of M predictors which generate M camera pose hypotheses, and (ii) a 'selector' or 'aggregator' that infers the best pose from the multiple pose hypotheses based on a similarity function. We are interested in predictors that not only produce good hypotheses but also hypotheses that are different from each other. Thus, we propose and study methods for learning 'marginally relevant' predictors, and compare their performance when used with different selection procedures. We evaluate our method on a recently released 3D reconstruction dataset with challenging camera poses, and scene variability. Experiments show that our method learns to make multiple predictions that are marginally relevant and can effectively select an accurate prediction. Furthermore, our method outperforms the state-of-the-art discriminative approach for camera relocalization.", "citation": "Citations (27)", "year": "2014", "departments": ["University of Illinois at Urbana–Champaign", "Microsoft", "Imperial College London", "Microsoft", "Microsoft"], "conf": "cvpr", "authors": ["Abner Guzmán-Rivera.....http://dblp.org/pers/hd/g/Guzm=aacute=n=Rivera:Abner", "Pushmeet Kohli.....http://dblp.org/pers/hd/k/Kohli:Pushmeet", "Ben Glocker.....http://dblp.org/pers/hd/g/Glocker:Ben", "Jamie Shotton.....http://dblp.org/pers/hd/s/Shotton:Jamie", "Toby Sharp.....http://dblp.org/pers/hd/s/Sharp:Toby", "Andrew W. Fitzgibbon.....http://dblp.org/pers/hd/f/Fitzgibbon:Andrew_W=", "Shahram Izadi.....http://dblp.org/pers/hd/i/Izadi:Shahram"], "pages": 8}