{"title": "Approximation algorithms for bipartite matching with metric and geometric costs.", "fields": ["k nearest neighbors algorithm", "approximation algorithm", "binary logarithm", "matching", "bipartite graph"], "abstract": "Let G = G( A ∪ B,A × B ), with | A | = | B | =  n , be a weighted bipartite graph, and let d(·,·) be the cost function on the edges. Let w( M ) denote the weight of a matching in G, and  M * a minimum-cost perfect matching in G. We call a perfect matching  M c-approximate , for  c  ≥ 1, if w( M ) ≤  c  · w( M *). We present three approximation algorithms for computing minimum-cost perfect matchings in G.   First, we consider the case when d(·,·) is a metric. For any  Δ  > 0, we present an algorithm that, in  O ( n  2+ Δ   log  n  log 2 (1/ Δ )) time, computes a  O (1/ Δ   α  )-approximate matching of G, where  α  = log 3  2 ≈ 0.631. Next, we assume the existence of a dynamic data structure for answering approximate nearest neighbor (ANN) queries under d(··). Given two parameters  e, d e ) is the query and update time of an ( e /2)-ANN data structure.   Finally, we present an algorithm that works even if d(·,·) is not a metric but admits an ANN data structure for d(·,·). In particular, we present an algorithm that computes, in  O ( e  ---1  n  3/2  τ  ( n, e ) log 4 ( n / e ) log Δ) time, a (1 +  e )-approximate matching of  A  and  B ; here Δ is the ratio of the largest to the smallest-cost edge in G, and  τ  ( n, e ) is the query and update time of an ( e / c )-ANN data structure for some constant  c  > 1.   We show that our results lead to faster matching algorithms for many geometric settings.", "citation": "Citations (5)", "year": "2014", "departments": ["Duke University", "Stanford University"], "conf": "stoc", "authors": ["Pankaj K. Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Pankaj_K=", "R. Sharathkumar.....http://dblp.org/pers/hd/s/Sharathkumar:R="], "pages": 10}