{"title": "An excluded half-integral grid theorem for digraphs and the directed disjoint paths problem.", "fields": ["disjoint sets", "bidimensionality", "conjecture", "treewidth", "structure"], "abstract": "The excluded grid theorem, originally proved by Robertson and Seymour in Graph Minors V, is one of the most central results in the study of graph minors. It has found numerous applications in algorithmic graph structure theory, for instance as the basis for bidimensionality theory on graph classes excluding a fixed minor.   In 1997, Reed [25] and later Johnson, Robertson, Seymour and Thomas [17] conjectured an analogous theorem for directed graphs, i.e. the existence of a function  f : N  →  N such that every digraph of directed tree-width at least  f ( k ) contains a directed grid of order  k .   In this paper, we make significant progress toward this conjecture. Namely, we prove that every digraph of directed tree-width at least  f ( k ) contains a \"half-integral\" directed grid of order  k .   This structural result allows us to contribute to the disjoint paths problem. We show that the following can be done in polynomial time:   Suppose that we are given a digraph  G  and  k  terminal pairs ( s  1 ,  t  1 ), ( s  2 ,  t  2 ),..., ( s   k   , t   k  ), where  k  is a fixed constant. In polynomial time, either   • we can find  k  paths  P  1 ,...,  P   k   such that  P   i   is from  s   i   to  t   i   for  i  = 1,...,  k  and every vertex in  G  is in at most four of the paths, or   • we can conclude that  G  does not contain disjoint paths  P  1 ,...,  P   k   such that  P   i   is from  s   i   to  t   i   for  i  = 1,...,  k .   To the best of our knowledge, this is the first positive result for the general directed disjoint paths problem. Note that the directed disjoint paths problem is NP-hard even for  k  = 2. Therefore, polynomial-time algorithms for semiintegral disjoint paths is the best one can hope for.", "citation": "Citations (7)", "year": "2014", "departments": ["National Institute of Informatics", "University of Tokyo", "Technical University of Berlin"], "conf": "stoc", "authors": ["Ken-ichi Kawarabayashi.....http://dblp.org/pers/hd/k/Kawarabayashi:Ken=ichi", "Yusuke Kobayashi.....http://dblp.org/pers/hd/k/Kobayashi_0001:Yusuke", "Stephan Kreutzer.....http://dblp.org/pers/hd/k/Kreutzer:Stephan"], "pages": 9}