{"title": "Parallelization of Reordering Algorithms for Bandwidth and Wavefront Reduction.", "fields": ["supercomputer", "cache", "locality of reference", "speedup", "sparse matrix"], "abstract": "Many sparse matrix computations can be speeded up if the matrix is first reordered. Reordering was originally developed for direct methods but it has recently become popular for improving the cache locality of parallel iterative solvers since reordering the matrix to reduce bandwidth and wave front can improve the locality of reference of sparse matrix-vector multiplication (SpMV), the key kernel in iterative solvers. In this paper, we present the first parallel implementations of two widely used reordering algorithms: Reverse Cut hill-McKee (RCM) and Sloan. On 16 cores of the Stampede supercomputer, our parallel RCM is 5.56 times faster on the average than a state-of-the-art sequential implementation of RCM in the HSL library. Sloan is significantly more constrained than RCM, but our parallel implementation achieves a speedup of 2.88X on the average over sequential HSL-Sloan. Reordering the matrix using our parallel RCM and then performing 100 SpMV iterations is twice as fast as using HSL-RCM and then performing the SpMV iterations, it is also 1.5 times faster than performing the SpMV iterations without reordering the matrix.", "citation": "Citations (10)", "departments": ["University of Illinois at Urbana–Champaign", "University of Texas at Austin", "University of Texas at Austin", "University of Illinois at Urbana–Champaign", "University of Texas at Austin"], "authors": ["Konstantinos I. Karantasis.....http://dblp.org/pers/hd/k/Karantasis:Konstantinos_I=", "Andrew Lenharth.....http://dblp.org/pers/hd/l/Lenharth:Andrew", "Donald Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Donald", "María Jesús Garzarán.....http://dblp.org/pers/hd/g/Garzar=aacute=n:Mar=iacute=a_Jes=uacute=s", "Keshav Pingali.....http://dblp.org/pers/hd/p/Pingali:Keshav"], "conf": "sc", "year": "2014", "pages": 12}