{"title": "Non-malleability from Malleability: Simulation-Sound Quasi-Adaptive NIZK Proofs and CCA2-Secure Encryption from Homomorphic Signatures.", "fields": ["homomorphic encryption", "adaptive chosen ciphertext attack", "encryption", "verifiable secret sharing", "malleability", "mathematical proof"], "abstract": "Verifiability is central to building protocols and systems with integrity. Initially, efficient methods employed the Fiat-Shamir heuristics. Since 2008, the Groth-Sahai techniques have been the most efficient in constructing non-interactive witness indistinguishable and zero-knowledge proofs for algebraic relations in the standard model. For the important task of proving membership in linear subspaces, Jutla and Roy (Asiacrypt 2013) gave significantly more efficient proofs in the quasi-adaptive setting (QA-NIZK). For membership of the row space of a t ×n matrix, their QA-NIZK proofs save Ω(t) group elements compared to Groth-Sahai. Here, we give QA-NIZK proofs made of a constant number group elements – regardless of the number of equations or the number of variables – and additionally prove them unbounded simulation-sound. Unlike previous unbounded simulation-sound Groth-Sahai-based proofs, our construction does not involve quadratic pairing product equations and does not rely on a chosen-ciphertext-secure encryption scheme. Instead, we build on structure-preserving signatures with homomorphic properties. We apply our methods to design new and improved CCA2-secure encryption schemes. In particular, we build the first efficient threshold CCA-secure keyed-homomorphic encryption scheme (i.e., where homomorphic operations can only be carried out using a dedicated evaluation key) with publicly verifiable ciphertexts.", "citation": "Not cited", "year": "2014", "departments": ["Technicolor", "Université catholique de Louvain", "Technicolor", "Columbia University"], "conf": "eurocrypt", "authors": ["Benoît Libert.....http://dblp.org/pers/hd/l/Libert:Beno=icirc=t", "Thomas Peters.....http://dblp.org/pers/hd/p/Peters:Thomas", "Marc Joye.....http://dblp.org/pers/hd/j/Joye:Marc", "Moti Yung.....http://dblp.org/pers/hd/y/Yung:Moti"], "pages": 19}