{"title": "Random-walk domination in large graphs.", "fields": ["greedy randomized adaptive search procedure", "submodular set function", "greedy coloring", "maximum coverage problem", "domination analysis"], "abstract": "We introduce and formulate two types of random-walk domination problems in graphs motivated by a number of applications in practice (e.g., item-placement problem in online social networks, Ads-placement problem in advertisement networks, and resource-placement problem in P2P networks). Specifically, given a graph G, the goal of the first type of random-walk domination problem is to target k nodes such that the total hitting time of an L-length random walk starting from the remaining nodes to the targeted nodes is minimized. The second type of random-walk domination problem is to find k nodes to maximize the expected number of nodes that hit any one targeted node through an L-length random walk. We prove that these problems are two special instances of the submodular set function maximization with cardinality constraint problem. To solve them effectively, we propose a dynamic-programming (DP) based greedy algorithm which is with near-optimal performance guarantee. The DP-based greedy algorithm, however, is not very efficient due to the expensive marginal gain evaluation. To further speed up the algorithm, we propose an approximate greedy algorithm with linear time complexity w.r.t. the graph size and also with near-optimal performance guarantee. The approximate greedy algorithm is based on carefully designed random walk sampling and sample-materialization techniques. Extensive experiments demonstrate the effectiveness, efficiency and scalability of the proposed algorithms.", "citation": "Citations (11)", "departments": ["Shenzhen University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Rong-Hua Li.....http://dblp.org/pers/hd/l/Li:Rong=Hua", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Xin Huang.....http://dblp.org/pers/hd/h/Huang_0001:Xin", "Hong Cheng.....http://dblp.org/pers/hd/c/Cheng:Hong"], "conf": "icde", "year": "2014", "pages": 12}