{"title": "Model checking existential logic on partially ordered sets.", "fields": ["bounded function", "graded poset", "parameterized complexity", "substructure", "order theory"], "abstract": "We study the problem of checking whether an existential sentence (that is, a first-order sentence in prefix form built using existential quantifiers and all Boolean connectives) is true in a finite partially ordered set (in short, a poset). A poset is a reflexive, antisymmetric, and transitive digraph. The problem encompasses the fundamental embedding problem of finding an isomorphic copy of a poset as an induced substructure of another poset.   Model checking existential logic is already NP-hard on a fixed poset; thus we investigate structural properties of posets yielding conditions for fixed-parameter tractability when the problem is parameterized by the sentence. We identify width as a central structural property (the width of a poset is the maximum size of a subset of pairwise incomparable elements); our main algorithmic result is that model checking existential logic on classes of finite posets of bounded width is fixed-parameter tractable. We observe a similar phenomenon in classical complexity, where we prove that the isomorphism problem is polynomial-time tractable on classes of posets of bounded width; this settles an open problem in order theory.   We surround our main algorithmic result with complexity results on less restricted, natural neighboring classes of finite posets, establishing its tightness in this sense. We also relate our work with (and demonstrate its independence of) fundamental fixed-parameter tractability results for model checking on digraphs of bounded degree and bounded clique-width.", "citation": "Citations (10)", "departments": ["Vienna University of Technology", "Vienna University of Technology", "Vienna University of Technology", "Vienna University of Technology", "Vienna University of Technology", "Vienna University of Technology"], "authors": ["Simone Bova.....http://dblp.org/pers/hd/b/Bova:Simone", "Robert Ganian.....http://dblp.org/pers/hd/g/Ganian:Robert", "Stefan Szeider.....http://dblp.org/pers/hd/s/Szeider:Stefan"], "conf": "lics", "year": "2014", "pages": 10}