{"title": "Using Frankencerts for Automated Adversarial Testing of Certificate Validation in SSL/TLS Implementations.", "fields": ["merchant plug in", "ocsp stapling", "self signed certificate", "x 509", "hypertext transfer protocol over secure socket layer"], "abstract": "Modern network security rests on the Secure Sockets Layer (SSL) and Transport Layer Security (TLS) protocols. Distributed systems, mobile and desktop applications, embedded devices, and all of secure Web rely on SSL/TLS for protection against network attacks. This protection critically depends on whether SSL/TLS clients correctly validate X.509 certificates presented by servers during the SSL/TLS handshake protocol. We design, implement, and apply the first methodology for large-scale testing of certificate validation logic in SSL/TLS implementations. Our first ingredient is \"frankencerts,\" synthetic certificates that are randomly mutated from parts of real certificates and thus include unusual combinations of extensions and constraints. Our second ingredient is differential testing: if one SSL/TLS implementation accepts a certificate while another rejects the same certificate, we use the discrepancy as an oracle for finding flaws in individual implementations. Differential testing with frankencerts uncovered 208 discrepancies between popular SSL/TLS implementations such as OpenSSL, NSS, CyaSSL, GnuTLS, PolarSSL, MatrixSSL, etc. Many of them are caused by serious security vulnerabilities. For example, any server with a valid X.509 version1 certificate can act as a rogue certificate authority and issue fake certificates for any domain, enabling man-in-the-middle attacks against MatrixSSL and GnuTLS. Several implementations also accept certificate authorities created by unauthorized issuers, as well as certificates not intended for server authentication. We also found serious vulnerabilities in how users are warned about certificate validation errors. When presented with an expired, self-signed certificate, NSS, Safari, and Chrome (on Linux) report that the certificate has expired - a low-risk, often ignored error - but not that the connection is insecure against a man-in-the-middle attack. These results demonstrate that automated adversarial testing with frankencerts is a powerful methodology for discovering security flaws in SSL/TLS implementations.", "citation": "Citations (72)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of California, Davis", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Chad Brubaker.....http://dblp.org/pers/hd/b/Brubaker:Chad", "Suman Jana.....http://dblp.org/pers/hd/j/Jana:Suman", "Baishakhi Ray.....http://dblp.org/pers/hd/r/Ray:Baishakhi", "Sarfraz Khurshid.....http://dblp.org/pers/hd/k/Khurshid:Sarfraz", "Vitaly Shmatikov.....http://dblp.org/pers/hd/s/Shmatikov:Vitaly"], "conf": "sp", "year": "2014", "pages": 16}