{"title": "Understanding understanding source code with functional magnetic resonance imaging.", "fields": ["working memory", "program comprehension", "syntax error", "coding conventions", "cognitive neuroscience"], "abstract": "Program comprehension is an important cognitive process that inherently eludes direct measurement. Thus, researchers are struggling with providing suitable programming languages, tools, or coding conventions to support developers in their everyday work. In this paper, we explore whether functional magnetic resonance imaging (fMRI), which is well established in cognitive neuroscience, is feasible to soundly measure program comprehension. In a controlled experiment, we observed 17 participants inside an fMRI scanner while they were comprehending short source-code snippets, which we contrasted with locating syntax errors. We found a clear, distinct activation pattern of five brain regions, which are related to working memory, attention, and language processing---all processes that fit well to our understanding of program comprehension. Our results encourage us and, hopefully, other researchers to use fMRI in future studies to measure program comprehension and, in the long run, answer questions, such as: Can we predict whether someone will be an excellent programmer? How effective are new languages and tools for program understanding? How should we train programmers?", "citation": "Citations (81)", "departments": ["University of Passau", "Carnegie Mellon University", "University of Passau", "Georgia Institute of Technology", "Leibniz Institute for Neurobiology"], "authors": ["Janet Siegmund.....http://dblp.org/pers/hd/s/Siegmund:Janet", "Christian Kästner.....http://dblp.org/pers/hd/k/K=auml=stner:Christian", "Sven Apel.....http://dblp.org/pers/hd/a/Apel:Sven", "Chris Parnin.....http://dblp.org/pers/hd/p/Parnin:Chris", "Anja Bethmann.....http://dblp.org/pers/hd/b/Bethmann:Anja", "Thomas Leich.....http://dblp.org/pers/hd/l/Leich:Thomas", "Gunter Saake.....http://dblp.org/pers/hd/s/Saake:Gunter", "André Brechmann.....http://dblp.org/pers/hd/b/Brechmann:Andr=eacute="], "conf": "icse", "year": "2014", "pages": 12}