{"title": "Incremental cluster evolution tracking from highly dynamic network data.", "fields": ["streams", "data stream clustering", "fading", "computation", "dynamic network analysis"], "abstract": "Dynamic networks are commonly found in the current web age. In scenarios like social networks and social media, dynamic networks are noisy, are of large-scale and evolve quickly. In this paper, we focus on the cluster evolution tracking problem on highly dynamic networks, with clear application to event evolution tracking. There are several previous works on data stream clustering using a node-by-node approach for maintaining clusters. However, handling of bulk updates, i.e., a subgraph at a time, is critical for achieving acceptable performance over very large highly dynamic networks. We propose a subgraph-by-subgraph incremental tracking framework for cluster evolution in this paper. To effectively illustrate the techniques in our framework, we consider the event evolution tracking task in social streams as an application, where a social stream and an event are modeled as a dynamic post network and a dynamic cluster respectively. By monitoring through a fading time window, we introduce a skeletal graph to summarize the information in the dynamic network, and formalize cluster evolution patterns using a group of primitive evolution operations and their algebra. Two incremental computation algorithms are developed to maintain clusters and track evolution patterns as time rolls on and the network evolves. Our detailed experimental evaluation on large Twitter datasets demonstrates that our framework can effectively track the complete set of cluster evolution patterns from highly dynamic networks on the fly.", "citation": "Citations (31)", "departments": ["University of British Columbia", "University of British Columbia", "Dalhousie University"], "authors": ["Pei Lee.....http://dblp.org/pers/hd/l/Lee:Pei", "Laks V. S. Lakshmanan.....http://dblp.org/pers/hd/l/Lakshmanan:Laks_V=_S=", "Evangelos E. Milios.....http://dblp.org/pers/hd/m/Milios:Evangelos_E="], "conf": "icde", "year": "2014", "pages": 12}