{"title": "An empirical study on program comprehension with reactive programming.", "fields": ["comparison of multi paradigm programming languages", "reactive programming", "third generation programming language", "second generation programming language", "empirical research", "program comprehension", "programming domain", "natural language processing", "functional reactive programming", "programming language"], "abstract": "Starting from the first investigations with strictly functional languages, reactive programming has been proposed as THE programming paradigm for reactive applications. The advantages of designs based on this style over designs based on the Observer design pattern have been studied for a long time. Over the years, researchers have enriched reactive languages with more powerful abstractions, embedded these abstractions into mainstream languages – including object-oriented languages – and applied reactive programming to several domains, like GUIs, animations, Web applications, robotics, and sensor networks. However, an important assumption behind this line of research – that, beside other advantages, reactive programming makes a wide class of otherwise cumbersome applications more comprehensible – has never been evaluated. In this paper, we present the design and the results of the first empirical study that evaluates the effect of reactive programming on comprehensibility compared to the traditional object-oriented style with the Observer design pattern. Results confirm the conjecture that comprehensibility is enhanced by reactive programming. In the experiment, the reactive programming group significantly outperforms the other group.", "citation": "Not cited", "departments": ["Technische Universität Darmstadt", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "Lancaster University"], "authors": ["Guido Salvaneschi.....http://dblp.org/pers/hd/s/Salvaneschi:Guido", "Sven Amann.....http://dblp.org/pers/hd/a/Amann:Sven", "Sebastian Proksch.....http://dblp.org/pers/hd/p/Proksch:Sebastian", "Mira Mezini.....http://dblp.org/pers/hd/m/Mezini:Mira"], "conf": "sigsoft", "year": "2014", "pages": 12}