{"title": "SLICE: Reviving regions-based pruning for reverse k nearest neighbors queries.", "fields": ["data set", "principal variation search", "k nearest neighbors algorithm", "probabilistic logic", "pruning"], "abstract": "Given a set of facilities and a set of users, a reverse k nearest neighbors (RkNN) query q returns every user for which the query facility is one of the k-closest facilities. Due to its importance, RkNN query has received significant research attention in the past few years. Almost all of the existing techniques adopt a pruning-and-verification framework. Regions-based pruning and half-space pruning are the two most notable pruning strategies. The half-space based approach prunes a larger area and is generally believed to be superior. Influenced by this perception, almost all existing RkNN algorithms utilize and improve the half-space pruning strategy. We observe the weaknesses and strengths of both strategies and discover that the regions-based pruning has certain strengths that have not been exploited in the past. Motivated by this, we present a new RkNN algorithm called SLICE that utilizes the strength of regions-based pruning and overcomes its limitations. Our extensive experimental study on synthetic and real data sets demonstrate that SLICE is significantly more efficient than the existing algorithms. We also provide a detailed theoretical analysis to analyze various aspects of our algorithm such as I/O cost, the unpruned area, and the cost of its verification phase etc. The experimental study validates our theoretical analysis.", "citation": "Citations (13)", "departments": ["University of New South Wales", "Monash University", "University of New South Wales", "University of New South Wales"], "authors": ["Shiyu Yang.....http://dblp.org/pers/hd/y/Yang:Shiyu", "Muhammad Aamir Cheema.....http://dblp.org/pers/hd/c/Cheema:Muhammad_Aamir", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying"], "conf": "icde", "year": "2014", "pages": 12}