{"title": "Understanding employee social media chatter with enterprise social pulse.", "fields": ["social media", "analytics", "human resources", "social analytics", "active listening"], "abstract": "The rise of social media in the enterprise has enabled new ways for employees to speak up and communicate openly with colleagues. This rich textual data can potentially be mined to better understand the opinions and sentiment of employees for the benefit of the organization. In this paper, we introduce Enterprise Social Pulse (ESP) -- a tool designed to support analysts whose job involves understanding employee chatter. ESP aggregates and analyzes data from internal and external social media sources while respecting employee privacy. It surfaces the data through a user interface that supports organic results and keyword search, data segmentation and filtering, and several analytics and visualization features. An evaluation of ESP was conducted with 19 Human Resources professionals. Results from a survey and interviews with participants revealed the value and willingness to use ESP, but also surfaced challenges around deploying an employee social media listening solution in an organization.", "citation": "Citations (8)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["N. Sadat Shami.....http://dblp.org/pers/hd/s/Shami:N=_Sadat", "Jiang Yang.....http://dblp.org/pers/hd/y/Yang:Jiang", "Laura Panc.....http://dblp.org/pers/hd/p/Panc:Laura", "Casey Dugan.....http://dblp.org/pers/hd/d/Dugan:Casey", "Tristan Ratchford.....http://dblp.org/pers/hd/r/Ratchford:Tristan", "Jamie C. Rasmussen.....http://dblp.org/pers/hd/r/Rasmussen:Jamie_C=", "Yannick Assogba.....http://dblp.org/pers/hd/a/Assogba:Yannick", "Tal Steier.....http://dblp.org/pers/hd/s/Steier:Tal", "Todd Soule.....http://dblp.org/pers/hd/s/Soule:Todd", "Stela Lupushor.....http://dblp.org/pers/hd/l/Lupushor:Stela", "Werner Geyer.....http://dblp.org/pers/hd/g/Geyer:Werner", "Ido Guy.....http://dblp.org/pers/hd/g/Guy:Ido", "Jonathan Ferrar.....http://dblp.org/pers/hd/f/Ferrar:Jonathan"], "conf": "cscw", "year": "2014", "pages": 14}