{"title": "Revisiting loop fusion in the polyhedral framework.", "fields": ["loop interchange", "optimizing compiler", "frameworks supporting the polyhedral model", "loop fission", "loop optimization"], "abstract": "Loop fusion is an important compiler optimization for improving memory hierarchy performance through enabling data reuse. Traditional compilers have approached loop fusion in a manner decoupled from other high-level loop optimizations, missing several interesting solutions. Recently, the polyhedral compiler framework with its ability to compose complex transformations, has proved to be promising in performing loop optimizations for small programs. However, our experiments with large programs using state-of-the-art polyhedral compiler frameworks reveal suboptimal fusion partitions in the transformed code. We trace the reason for this to be lack of an effective cost model to choose a good fusion partitioning among the possible choices, which increase exponentially with the number of program statements. In this paper, we propose a fusion algorithm to choose good fusion partitions with two objective functions - achieving good data reuse and preserving parallelism inherent in the source code. These objectives, although targeted by previous work in traditional compilers, pose new challenges within the polyhedral compiler framework and have thus not been addressed. In our algorithm, we propose several heuristics that work effectively within the polyhedral compiler framework and allow us to achieve the proposed objectives. Experimental results show that our fusion algorithm achieves performance comparable to the existing polyhedral compilers for small kernel programs, and significantly outperforms them for large benchmark programs such as those in the SPEC benchmark suite.", "citation": "Citations (12)", "year": "2014", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota"], "conf": "ppopp", "authors": ["Sanyam Mehta.....http://dblp.org/pers/hd/m/Mehta:Sanyam", "Pei-Hung Lin.....http://dblp.org/pers/hd/l/Lin:Pei=Hung", "Pen-Chung Yew.....http://dblp.org/pers/hd/y/Yew:Pen=Chung"], "pages": 14}