{"title": "Mars: Real-time spatio-temporal queries on microblogs.", "fields": ["range query", "memory management", "microblogging", "web search query", "latency"], "abstract": "Mars demonstration exploits the microblogs location information to support a wide variety of important spatio-temporal queries on microblogs. Supported queries include range, nearest-neighbor, and aggregate queries. Mars works under a challenging environment where streams of microblogs are arriving with high arrival rates. Mars distinguishes itself with three novel contributions: (1) Efficient in-memory digestion/expiration techniques that can handle microblogs of high arrival rates up to 64,000 microblog/sec. This also includes highly accurate and efficient hopping-window based aggregation for incoming microblogs keywords. (2) Smart memory optimization and load shedding techniques that adjust in-memory contents based on the expected query load to trade off a significant storage savings with a slight and bounded accuracy loss. (3) Scalable real-time query processing, exploiting Zipf distributed microblogs data for efficient top-k aggregate query processing. In addition, Mars employs a scalable real-time nearest neighbor and range query processing module that employs various pruning techniques so that it serves heavy query workloads in real time. Mars is demonstrated using a stream of real tweets obtained from Twitter firehose with a production query workload obtained from Bing web search. We show that Mars serves incoming queries with an average latency of less than 4 msec and with 99% answer accuracy while saving up to 70% of storage overhead for different query loads.", "citation": "Citations (9)", "departments": ["University of Minnesota", "Purdue University", "University of Minnesota", "Microsoft", "Microsoft"], "authors": ["Amr Magdy.....http://dblp.org/pers/hd/m/Magdy_0001:Amr", "Ahmed M. Aly.....http://dblp.org/pers/hd/a/Aly:Ahmed_M=", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F=", "Sameh Elnikety.....http://dblp.org/pers/hd/e/Elnikety:Sameh", "Yuxiong He.....http://dblp.org/pers/hd/h/He:Yuxiong", "Suman Nath.....http://dblp.org/pers/hd/n/Nath:Suman"], "conf": "icde", "year": "2014", "pages": 4}