{"title": "JSAI: a static analysis platform for JavaScript.", "fields": ["type inference", "interpreter", "javascript", "string", "pointer analysis"], "abstract": "JavaScript is used everywhere from the browser to the server, including desktops and mobile devices. However, the current state of the art in JavaScript static analysis lags far behind that of other languages such as C and Java. Our goal is to help remedy this lack. We describe JSAI, a formally specified, robust abstract interpreter for JavaScript. JSAI uses novel abstract domains to compute a reduced product of type inference, pointer analysis, control-flow analysis, string analysis, and integer and boolean constant propagation. Part of JSAI's novelty is user-configurable analysis sensitivity, i.e., context-, path-, and heap-sensitivity. JSAI is designed to be provably sound with respect to a specific concrete semantics for JavaScript, which has been extensively tested against a commercial JavaScript implementation. We provide a comprehensive evaluation of JSAI's performance and precision using an extensive benchmark suite, including real-world JavaScript applications, machine generated JavaScript code via Emscripten, and browser addons. We use JSAI's configurability to evaluate a large number of analysis sensitivities (some well-known, some novel) and observe some surprising results that go against common wisdom. These results highlight the usefulness of a configurable analysis platform such as JSAI.", "citation": "Citations (75)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Vineeth Kashyap.....http://dblp.org/pers/hd/k/Kashyap:Vineeth", "Kyle Dewey.....http://dblp.org/pers/hd/d/Dewey:Kyle", "Ethan A. Kuefner.....http://dblp.org/pers/hd/k/Kuefner:Ethan_A=", "John Wagner.....http://dblp.org/pers/hd/w/Wagner:John", "Kevin Gibbons.....http://dblp.org/pers/hd/g/Gibbons:Kevin", "John Sarracino.....http://dblp.org/pers/hd/s/Sarracino:John", "Ben Wiedermann.....http://dblp.org/pers/hd/w/Wiedermann:Ben", "Ben Hardekopf.....http://dblp.org/pers/hd/h/Hardekopf:Ben"], "conf": "sigsoft", "year": "2014", "pages": 12}