{"title": "Prioritizing the devices to test your app on: a case study of Android game apps.", "fields": ["android", "software", "quality assurance", "internet privacy", "revenue"], "abstract": "Star ratings that are given by the users of mobile apps directly impact the revenue of its developers. At the same time, for popular platforms like Android, these apps must run on hundreds of devices increasing the chance for device-specific problems. Device-specific problems could impact the rating assigned to an app, given the varying capabilities of devices (e.g., hardware and software). To fix device-specific problems developers must test their apps on a large number of Android devices, which is costly and inefficient. Therefore, to help developers pick which devices to test their apps on, we propose using the devices that are mentioned in user reviews. We mine the user reviews of 99 free game apps and find that, apps receive user reviews from a large number of devices: between 38 to 132 unique devices. However, most of the reviews (80%) originate from a small subset of devices (on average, 33%). Furthermore, we find that developers of new game apps with no reviews can use the review data of similar game apps to select the devices that they should focus on first. Finally, among the set of devices that generate the most reviews for an app, we find that some devices tend to generate worse ratings than others. Our findings indicate that focusing on the devices with the most reviews (in particular the ones with negative ratings), developers can effectively prioritize their limited Quality Assurance (QA) efforts, since these devices have the greatest impact on ratings.", "citation": "Citations (60)", "departments": ["Queen's University", "Rochester Institute of Technology", "Concordia University", "Queen's University"], "authors": ["Hammad Khalid.....http://dblp.org/pers/hd/k/Khalid:Hammad", "Meiyappan Nagappan.....http://dblp.org/pers/hd/n/Nagappan:Meiyappan", "Emad Shihab.....http://dblp.org/pers/hd/s/Shihab:Emad", "Ahmed E. Hassan.....http://dblp.org/pers/hd/h/Hassan:Ahmed_E="], "conf": "sigsoft", "year": "2014", "pages": 11}