{"title": "Motivating contribution in a participatory sensing system via quid-pro-quo.", "fields": ["knowledge management", "information system", "crowds", "computer science", "participatory sensing"], "abstract": "Participatory sensing systems (PSS) require frequent injection of information that has a short shelf-life. The use of crowds to gather information for PSS is therefore particularly challenging. In this study, we explore the impact of two policies on user contributions. A quid-pro-quo policy exchanges contributions from users for access to critical information in the system. A request policy simply reminds the user that information is needed to make the system function well. Prior research has shown that request for help in crowdsourced system is an effective mechanism to increase contributions. During a large-scale experimental study within a publicly deployed, crowdsourced, transit information system, we analyzed metrics associated with frequency of contribution and commitment to long-term use over a 10-month period. Our results confirmed that quid-pro-quo led to more contribution, but at a cost of faster departure from the study. When a participant was simply requested to contribute, but could still access community-generated data if they ignored a request, was largely ineffective and was statistically similar to the control condition where no request for contribution occurred. Thus crowdsource system designers should consider imposing quid-pro-quo type policies for PSS that concentrate on fewer users, but makes them more productive.", "citation": "Citations (13)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Anthony Tomasic.....http://dblp.org/pers/hd/t/Tomasic:Anthony", "John Zimmerman.....http://dblp.org/pers/hd/z/Zimmerman:John", "Aaron Steinfeld.....http://dblp.org/pers/hd/s/Steinfeld:Aaron", "Yun Huang.....http://dblp.org/pers/hd/h/Huang:Yun"], "conf": "cscw", "year": "2014", "pages": 10}