{"title": "f4: Facebook's Warm BLOB Storage System.", "fields": ["storage efficiency", "haystack", "computer data storage", "binary large object", "low latency"], "abstract": "Facebook's corpus of photos, videos, and other Binary Large OBjects (BLOBs) that need to be reliably stored and quickly accessible is massive and continues to grow. As the footprint of BLOBs increases, storing them in our traditional storage system, Haystack, is becoming increasingly inefficient. To increase our storage efficiency, measured in the effective-replication-factor of BLOBs, we examine the underlying access patterns of BLOBs and identify temperature zones that include hot BLOBs that are accessed frequently and warm BLOBs that are accessed far less often. Our overall BLOB storage system is designed to isolate warm BLOBs and enable us to use a specialized warm BLOB storage system, f4. f4 is a new system that lowers the effective-replication-factor of warm BLOBs while remaining fault tolerant and able to support the lower throughput demands.\n\nf4 currently stores over 65PBs of logical BLOBs and reduces their effective-replication-factor from 3.6 to either 2.8 or 2.1. f4 provides low latency; is resilient to disk, host, rack, and datacenter failures; and provides sufficient throughput for warm BLOBs.", "citation": "Citations (153)", "departments": ["Facebook", "University of Southern California", "Facebook", "Facebook", "Facebook"], "authors": ["Muralidhar Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Muralidhar", "Wyatt Lloyd.....http://dblp.org/pers/hd/l/Lloyd:Wyatt", "Sabyasachi Roy.....http://dblp.org/pers/hd/r/Roy:Sabyasachi", "Cory Hill.....http://dblp.org/pers/hd/h/Hill:Cory", "Ernest Lin.....http://dblp.org/pers/hd/l/Lin:Ernest", "Weiwen Liu.....http://dblp.org/pers/hd/l/Liu:Weiwen", "Satadru Pan.....http://dblp.org/pers/hd/p/Pan:Satadru", "Shiva Shankar.....http://dblp.org/pers/hd/s/Shankar:Shiva", "Sivakumar Viswanathan.....http://dblp.org/pers/hd/v/Viswanathan:Sivakumar", "Linpeng Tang.....http://dblp.org/pers/hd/t/Tang:Linpeng", "Sanjeev Kumar.....http://dblp.org/pers/hd/k/Kumar:Sanjeev"], "conf": "osdi", "year": "2014", "pages": 16}