{"title": "ClusCite: effective citation recommendation by information network-based clustering.", "fields": ["behavioral pattern", "citation", "cluster analysis", "optimization problem", "machine learning"], "abstract": "Citation recommendation is an interesting but challenging research problem. Most existing studies assume that all papers adopt the same criterion and follow the same behavioral pattern in deciding relevance and authority of a paper. However, in reality, papers have distinct citation behavioral patterns when looking for different references, depending on paper content, authors and target venues. In this study, we investigate the problem in the context of heterogeneous bibliographic networks and propose a novel cluster-based citation recommendation framework, called ClusCite, which explores the principle that citations tend to be softly clustered into interest groups based on multiple types of relationships in the network. Therefore, we predict each query's citations based on related interest groups, each having its own model for paper authority and relevance. Specifically, we learn group memberships for objects and the significance of relevance features for each interest group, while also propagating relative authority between objects, by solving a joint optimization problem. Experiments on both DBLP and PubMed datasets demonstrate the power of the proposed approach, with 17.68% improvement in Recall@50 and 9.57% growth in MRR over the best performing baseline.", "citation": "Citations (53)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Xiang Ren.....http://dblp.org/pers/hd/r/Ren:Xiang", "Jialu Liu.....http://dblp.org/pers/hd/l/Liu:Jialu", "Xiao Yu.....http://dblp.org/pers/hd/y/Yu:Xiao", "Urvashi Khandelwal.....http://dblp.org/pers/hd/k/Khandelwal:Urvashi", "Quanquan Gu.....http://dblp.org/pers/hd/g/Gu:Quanquan", "Lidan Wang.....http://dblp.org/pers/hd/w/Wang:Lidan", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "kdd", "year": "2014", "pages": 10}