{"title": "Beyond the rainbow: self-adaptive failure avoidance in configurable systems.", "fields": ["test case", "guard", "software system", "workaround", "architecture"], "abstract": "Self-adaptive software systems monitor their state and then adapt when certain conditions are met, guided by a global utility function. In prior work we developed algorithms and conducted a post-hoc analysis demonstrating the possibility of adapting to software failures by judiciously changing configurations. In this paper we present the REFRACT framework that realizes this idea in practice by building on the self-adaptive Rainbow architecture. REFRACT extends Rainbow with new components and algorithms targeting failure avoidance. We use REFRACT in a case study running four independently executing Firefox clients with 36 passing test cases and 7 seeded faults. The study show that workarounds for all but one of the seeded faults are found and the one that is not found never fails -- it is guarded from failing by a related workaround. Moreover, REFRACT finds workarounds for eight configuration-related unseeded failures from tests that were expected to pass (and did under the default configuration). Finally, the data show that when a failure and its workaround are found, configuration guards prevent the failure from appearing again. In a simulation lasting 24 hours we see over 150 guard activations and no failures with workarounds remaining beyond 16 hours.", "citation": "Citations (10)", "departments": ["University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln"], "authors": ["Jacob Swanson.....http://dblp.org/pers/hd/s/Swanson:Jacob", "Myra B. Cohen.....http://dblp.org/pers/hd/c/Cohen:Myra_B=", "Matthew B. Dwyer.....http://dblp.org/pers/hd/d/Dwyer:Matthew_B=", "Brady J. Garvin.....http://dblp.org/pers/hd/g/Garvin:Brady_J=", "Justin Firestone.....http://dblp.org/pers/hd/f/Firestone:Justin"], "conf": "sigsoft", "year": "2014", "pages": 12}