{"title": "PrivBayes: private data release via bayesian networks.", "fields": ["data publishing", "tuple", "adversary", "curse of dimensionality", "differential privacy"], "abstract": "Privacy-preserving data publishing is an important problem that has been the focus of extensive study. The state-of-the-art solution for this problem is differential privacy, which offers a strong degree of privacy protection without making restrictive assumptions about the adversary. Existing techniques using differential privacy, however, cannot effectively handle the publication of high-dimensional data. In particular, when the input dataset contains a large number of attributes, existing methods require injecting a prohibitive amount of noise compared to the signal in the data, which renders the published data next to useless.   To address the deficiency of the existing methods, this paper presents P riv B ayes , a differentially private method for releasing high-dimensional data. Given a dataset  D , P riv B ayes  first constructs a Bayesian network  N , which (i) provides a succinct model of the correlations among the attributes in  D  and (ii) allows us to approximate the distribution of data in  D  using a set  P  of low-dimensional marginals of  D . After that, P riv B ayes  injects noise into each marginal in  P  to ensure differential privacy and then uses the noisy marginals and the Bayesian network to construct an approximation of the data distribution in  D . Finally, P riv B ayes  samples tuples from the approximate distribution to construct a synthetic dataset, and then releases the synthetic data. Intuitively, P riv B ayes  circumvents the curse of dimensionality, as it injects noise into the low-dimensional marginals in  P  instead of the high-dimensional dataset  D . Private construction of Bayesian networks turns out to be significantly challenging, and we introduce a novel approach that uses a surrogate function for mutual information to build the model more accurately. We experimentally evaluate P riv B ayes  on real data and demonstrate that it significantly outperforms existing solutions in terms of accuracy.", "citation": "Citations (114)", "year": "2014", "departments": ["Nanyang Technological University", "University of Warwick", "AT&T Labs", "AT&T Labs", "Nanyang Technological University"], "conf": "sigmod", "authors": ["Jun Zhang.....http://dblp.org/pers/hd/z/Zhang:Jun", "Graham Cormode.....http://dblp.org/pers/hd/c/Cormode:Graham", "Cecilia M. Procopiuc.....http://dblp.org/pers/hd/p/Procopiuc:Cecilia_M=", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui"], "pages": 12}