{"title": "System F with coercion constraints.", "fields": ["typing environment", "bounded quantification", "system f", "witness", "language construct"], "abstract": "We present a second-order λ-calculus with coercion constraints that generalizes a previous extension of System F with parametric coercion abstractions by allowing multiple but simultaneous type and coercion abstractions, as well as recursive coercions and equi-recursive types. This enables a uniform presentation of several type system features that had previously been studied separately: type containment, bounded and instance-bounded polymorphism, which are already encodable with parametric coercion abstraction, and ML-style subtyping constraints. Our framework allows for a clear separation of language constructs with and without computational content. We also distinguish coherent coercions that are fully erasable from potentially incoherent coercions that suspend the evaluation---and enable the encoding of GADTs.   Technically,  type  coercions that witness subtyping relations between types are replaced by a more expressive notion of  typing  coercions that witness subsumption relations between typings,  e.g . pairs composed of a typing environment and a type. Our calculus is equipped with full reduction that allows reduction under abstractions---but we also introduce a form of weak reduction as reduction cannot proceed under incoherent type abstractions. Type soundness is proved by adapting the step-indexed semantics technique to full reduction, moving indices inside terms so as to control the reduction steps internally---but this is only detailed in the extended version.", "citation": "Citations (3)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Julien Cretin.....http://dblp.org/pers/hd/c/Cretin:Julien", "Didier Rémy.....http://dblp.org/pers/hd/r/R=eacute=my:Didier"], "conf": "lics", "year": "2014", "pages": 10}