{"title": "Product selection problem: improve market share by learning consumer behavior.", "fields": ["submodular set function", "metric", "speedup", "brute force search", "approximation algorithm", "market share"], "abstract": "It is often crucial for manufacturers to decide what products to produce so that they can increase their market share in an increasingly fierce market. To decide which products to produce, manufacturers need to analyze the consumers’ requirements and how consumers make their purchase decisions so that the new products will be competitive in the market. In this paper, we first present a general distance-based product adoption model to capture consumers’ purchase behavior. Using this model, various distance metrics can be used to describe different real life purchase behavior. We then provide a learning algorithm to decide which set of distance metrics one should use when we are given some accessible historical purchase data. Based on the product adoption model, we formalize the  k most marketable products (or k- MMP )  selection problem and formally prove that the problem is  NP-hard . To tackle this problem, we propose an efficient greedy-based approximation algorithm with a provable solution guarantee. Using submodularity analysis, we prove that our approximation algorithm can achieve at least 63p of the optimal solution. We apply our algorithm on both synthetic datasets and real-world datasets (TripAdvisor.com), and show that our algorithm can easily achieve five or more orders of speedup over the exhaustive search and achieve about 96p of the optimal solution on average. Our experiments also demonstrate the robustness of our distance metric learning method, and illustrate how one can adopt it to improve the accuracy of product selection.", "citation": "Citations (3)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Silei Xu.....http://dblp.org/pers/hd/x/Xu:Silei", "John Chi-Shing Lui.....http://dblp.org/pers/hd/l/Lui:John_Chi=Shing"], "conf": "kdd", "year": "2014", "pages": 10}