{"title": "Parallel data analysis directly on scientific file formats.", "fields": ["file format", "workflow", "netcdf", "hierarchical data format", "bitmap"], "abstract": "Scientific experiments and large-scale simulations produce massive amounts of data. Many of these scientific datasets are arrays, and are stored in file formats such as HDF5 and NetCDF. Although scientific data management systems, such as SciDB, are designed to manipulate arrays, there are challenges in integrating these systems into existing analysis workflows. Major barriers include the expensive task of preparing and loading data before querying, and converting the final results to a format that is understood by the existing post-processing and visualization tools. As a consequence, integrating a data management system into an existing scientific data analysis workflow is time-consuming and requires extensive user involvement. In this paper, we present the design of a new scientific data analysis system that efficiently processes queries directly over data stored in the HDF5 file format. This design choice eliminates the tedious and error-prone data loading process, and makes the query results readily available to the next processing steps of the analysis workflow. Our design leverages the increasing main memory capacities found in supercomputers through bitmap indexing and in-memory query execution. In addition, query processing over the HDF5 data format can be effortlessly parallelized to utilize the ample concurrency available in large-scale supercomputers and modern parallel file systems. We evaluate the performance of our system on a large supercomputing system and experiment with both a synthetic dataset and a real cosmology observation dataset. Our system frequently outperforms the relational database system that the cosmology team currently uses, and is more than 10X faster than Hive when processing data in parallel. Overall, by eliminating the data loading step, our query processing system is more effective in supporting in situ scientific analysis workflows.", "citation": "Citations (57)", "year": "2014", "departments": ["Ohio State University", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory"], "conf": "sigmod", "authors": ["Spyros Blanas.....http://dblp.org/pers/hd/b/Blanas:Spyros", "Kesheng Wu.....http://dblp.org/pers/hd/w/Wu:Kesheng", "Surendra Byna.....http://dblp.org/pers/hd/b/Byna:Surendra", "Bin Dong.....http://dblp.org/pers/hd/d/Dong:Bin", "Arie Shoshani.....http://dblp.org/pers/hd/s/Shoshani:Arie"], "pages": 12}