{"title": "Cooperative anti-jamming for infrastructure-less wireless networks with stochastic relaying.", "fields": ["throughput", "best response", "controller", "leverage", "countermeasure"], "abstract": "Denial-of-service (DoS) attacks launched by mali- cious jammers can pose significant threats to infrastructure- less wireless networks where a centralized controller may not be available. While significant recent research efforts have dealt with such attacks and several possible countermeasures have been proposed, little attention has been paid to the idea of cooperative anti-jamming. Inspired by this observation, we propose and study a coop- erative anti-jamming scheme designed to enhance the quality of links degraded by jammers. To achieve this objective, users are allowed to cooperate at two levels. First, they cooperate to optimally regulate their channel access probabilities so that jammed users gain a higher share of channel utilization. Second, users leverage multiple-input single-output cooperative commu- nication techniques to enhance the throughput of jammed links. We formulate the problem of optimal cooperative anti-jamming as a distributed pricing-based optimization problem and propose a best response algorithm to solve it in a distributed way. Simulations demonstrate that the proposed algorithm achieves considerable gains (compared to traditional noncooperative anti- jamming) especially under heavy traffic or high jamming power. Furthermore, by comparing the proposed algorithm with a provably-optimal centralized algorithm, we show that it achieves close-to-global optimality under moderate traffic load.", "citation": "Citations (5)", "departments": ["University at Buffalo", "University at Buffalo", "University at Buffalo"], "authors": ["Liyang Zhang.....http://dblp.org/pers/hd/z/Zhang:Liyang", "Zhangyu Guan.....http://dblp.org/pers/hd/g/Guan:Zhangyu", "Tommaso Melodia.....http://dblp.org/pers/hd/m/Melodia:Tommaso"], "conf": "infocom", "year": "2014", "pages": 9}