{"title": "LinkSCAN*: Overlapping community detection using the link-space transformation.", "fields": ["graph bandwidth", "random geometric graph", "graph rewriting", "graph", "line graph"], "abstract": "In this paper, for overlapping community detection, we propose a novel framework of the link-space transformation that transforms a given original graph into a link-space graph. Its unique idea is to consider topological structure and link similarity separately using two distinct types of graphs: the line graph and the original graph. For topological structure, each link of the original graph is mapped to a node of the link-space graph, which enables us to discover overlapping communities using non-overlapping community detection algorithms as in the line graph. For link similarity, it is calculated on the original graph and carried over into the link-space graph, which enables us to keep the original structure on the transformed graph. Thus, our transformation, by combining these two advantages, facilitates overlapping community detection as well as improves the resulting quality. Based on this framework, we develop the algorithm LinkSCAN that performs structural clustering on the link-space graph. Moreover, we propose the algorithm LinkSCAN* that enhances the efficiency of LinkSCAN by sampling. Extensive experiments were conducted using the LFR benchmark networks as well as some real-world networks. The results show that our algorithms achieve higher accuracy, quality, and coverage than the state-of-the-art algorithms.", "citation": "Citations (29)", "departments": ["KAIST", "Samsung", "KAIST", "Seoul National University", "KAIST"], "authors": ["Sungsu Lim.....http://dblp.org/pers/hd/l/Lim:Sungsu", "Seungwoo Ryu.....http://dblp.org/pers/hd/r/Ryu:Seungwoo", "Sejeong Kwon.....http://dblp.org/pers/hd/k/Kwon:Sejeong", "Kyomin Jung.....http://dblp.org/pers/hd/j/Jung:Kyomin", "Jae-Gil Lee.....http://dblp.org/pers/hd/l/Lee_0001:Jae=Gil"], "conf": "icde", "year": "2014", "pages": 12}