{"title": "Hacking Blind.", "fields": ["physical access", "control system", "knowledge management", "system call", "exploit", "quantum", "adaptive user interface", "hacker", "encryption", "internet privacy", "user interface", "computer science", "channel", "bolster", "computational biology", "computer security", "address space layout randomization", "password", "adversary", "engineering", "physics", "return oriented programming", "clips", "stack buffer overflow", "login", "shoulder surfing"], "abstract": "We show that it is possible to write remote stack buffer overflow exploits without possessing a copy of the target binary or source code, against services that restart after a crash. This makes it possible to hack proprietary closed-binary services, or open-source servers manually compiled and installed from source where the binary remains unknown to the attacker. Traditional techniques are usually paired against a particular binary and distribution where the hacker knows the location of useful gadgets for Return Oriented Programming (ROP). Our Blind ROP (BROP) attack instead remotely finds enough ROP gadgets to perform a write system call and transfers the vulnerable binary over the network, after which an exploit can be completed using known techniques. This is accomplished by leaking a single bit of information based on whether a process crashed or not when given a particular input string. BROP requires a stack vulnerability and a service that restarts after a crash. We implemented Braille, a fully automated exploit that yielded a shell in under 4,000 requests (20 minutes) against a contemporary nginx vulnerability, yaSSL + MySQL, and a toy proprietary server written by a colleague. The attack works against modern 64-bit Linux with address space layout randomization (ASLR), no-execute page protection (NX) and stack canaries.", "citation": "Not cited", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "Sacred Heart University", "Worcester Polytechnic Institute", "Department of C ... , Kerala, India"], "authors": ["Andrea Bittau.....http://dblp.org/pers/hd/b/Bittau:Andrea", "Adam Belay.....http://dblp.org/pers/hd/b/Belay:Adam", "Ali José Mashtizadeh.....http://dblp.org/pers/hd/m/Mashtizadeh:Ali_Jos=eacute=", "David Mazières.....http://dblp.org/pers/hd/m/Mazi=egrave=res:David", "Dan Boneh.....http://dblp.org/pers/hd/b/Boneh:Dan"], "conf": "sp", "year": "2014", "pages": 16}