{"title": "Top-K interesting subgraph discovery in information networks.", "fields": ["ranking", "heterogeneous network", "exploit", "text processing", "subgraph isomorphism problem"], "abstract": "In the real world, various systems can be modeled using heterogeneous networks which consist of entities of different types. Many problems on such networks can be mapped to an underlying critical problem of discovering top-K subgraphs of entities with rare and surprising associations. Answering such subgraph queries efficiently involves two main challenges: (1) computing all matching subgraphs which satisfy the query and (2) ranking such results based on the rarity and the interestingness of the associations among entities in the subgraphs. Previous work on the matching problem can be harnessed for a naive ranking-after-matching solution. However, for large graphs, subgraph queries may have enormous number of matches, and so it is inefficient to compute all matches when only the top-K matches are desired. In this paper, we address the two challenges of matching and ranking in top-K subgraph discovery as follows. First, we introduce two index structures for the network: topology index, and graph maximum metapath weight index, which are both computed offline. Second, we propose novel top-K mechanisms to exploit these indexes for answering interesting subgraph queries online efficiently. Experimental results on several synthetic datasets and the DBLP and Wikipedia datasets containing thousands of entities show the efficiency and the effectiveness of the proposed approach in computing interesting subgraphs.", "citation": "Citations (57)", "departments": ["Microsoft", "University at Buffalo", "University of California, Santa Barbara", "United States Army Research Laboratory", "University of Illinois at Urbana–Champaign"], "authors": ["Manish Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Manish", "Jing Gao.....http://dblp.org/pers/hd/g/Gao:Jing", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Hasan Cam.....http://dblp.org/pers/hd/c/Cam:Hasan", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "icde", "year": "2014", "pages": 12}