{"title": "Distribution-Aware Sampling and Weighted Model Counting for SAT.", "fields": ["oracle", "minimum weight", "sampling", "weight distribution", "sat"], "abstract": "Given a CNF formula and a weight for each assignment of values to variables, two natural problems are weighted model counting and distribution-aware sampling of satisfying assignments. Both problems have a wide variety of important applications. Due to the inherent complexity of the exact versions of the problems, interest has focused on solving them approximately. Prior work in this area scaled only to small problems in practice, or failed to provide strong theoretical guarantees, or employed a computationally-expensive most-probable-explanation (MPE) queries that assumes prior knowledge of a factored representation of the weight distribution. We identify a novel parameter, tilt, which is the ratio of the maximum weight of satisfying assignment to minimum weight of satisfying assignment and present a novel approach that works with a black-box oracle for weights of assignments and requires only an NP-oracle (in practice, a SAT-solver) to solve both the counting and sampling problems when the tilt is small. Our approach provides strong theoretical guarantees, and scales to problems involving several thousand variables. We also show that the assumption of small tilt can be significantly relaxed while improving computational efficiency if a factored representation of the weights is known.", "citation": "Citations (54)", "departments": ["Indian Institute of Technology Bombay", "University of California, Berkeley", "Rice University", "University of California, Berkeley", "Rice University"], "authors": ["Supratik Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Supratik", "Daniel J. Fremont.....http://dblp.org/pers/hd/f/Fremont:Daniel_J=", "Kuldeep S. Meel.....http://dblp.org/pers/hd/m/Meel:Kuldeep_S=", "Sanjit A. Seshia.....http://dblp.org/pers/hd/s/Seshia:Sanjit_A=", "Moshe Y. Vardi.....http://dblp.org/pers/hd/v/Vardi:Moshe_Y="], "conf": "aaai", "year": "2014", "pages": 9}