{"title": "Experimental evaluation of user interfaces for visual indoor navigation.", "fields": ["mobile interaction", "virtual reality", "mobile robot navigation", "augmented reality", "mockup"], "abstract": "Mobile location recognition by capturing images of the environment (visual localization) is a promising technique for indoor navigation in arbitrary surroundings. However, it has barely been investigated so far how the user interface (UI) can cope with the challenges of the vision-based localization technique, such as varying quality of the query images. We implemented a novel UI for visual localization, consisting of Virtual Reality (VR) and Augmented Reality (AR) views that actively communicate and ensure localization accuracy. If necessary, the system encourages the user to point the smartphone at distinctive regions to improve localization quality. We evaluated the UI in a experimental navigation task with a prototype, informed by initial evaluation results using design mockups. We found that VR can contribute to efficient and effective indoor navigation even at unreliable location and orientation accuracy. We discuss identified challenges and share lessons learned as recommendations for future work.", "citation": "Citations (13)", "year": "2014", "departments": ["Technische Universität München", "University of Passau", "Technische Universität München", "Technische Universität München", "Technische Universität München"], "conf": "chi", "authors": ["Andreas Möller.....http://dblp.org/pers/hd/m/M=ouml=ller:Andreas", "Matthias Kranz.....http://dblp.org/pers/hd/k/Kranz:Matthias", "Stefan Diewald.....http://dblp.org/pers/hd/d/Diewald:Stefan", "Luis Roalter.....http://dblp.org/pers/hd/r/Roalter:Luis", "Robert Huitl.....http://dblp.org/pers/hd/h/Huitl:Robert", "Tobias Stockinger.....http://dblp.org/pers/hd/s/Stockinger:Tobias", "Marion Koelle.....http://dblp.org/pers/hd/k/Koelle:Marion", "Patrick Lindemann.....http://dblp.org/pers/hd/l/Lindemann:Patrick"], "pages": 10}