{"title": "Detecting unique column combinations on dynamic data.", "fields": ["search engine indexing", "tuple", "data profiling", "dynamic data", "candidate key"], "abstract": "The discovery of all unique (and non-unique) column combinations in an unknown dataset is at the core of any data profiling effort. Unique column combinations resemble candidate keys of a relational dataset. Several research approaches have focused on their efficient discovery in a given, static dataset. However, none of these approaches are suitable for applications on dynamic datasets, such as transactional databases, social networks, and scientific applications. In these cases, data profiling techniques should be able to efficiently discover new uniques and non-uniques (and validate old ones) after tuple inserts or deletes, without re-profiling the entire dataset. We present the first approach to efficiently discover unique and non-unique constraints on dynamic datasets that is independent of the initial dataset size. In particular, Swan makes use of intelligently chosen indices to minimize access to old data. We perform an exhaustive analysis of Swan and compare it with two state-of-the-art techniques for unique discovery: Gordian and Ducc. The results show that Swan significantly outperforms both, as well as their incremental adaptations. For inserts, Swan is more than 63x faster than Gordian and up to 50x faster than Ducc. For deletes, Swan is more than 15x faster than Gordian and up to 1 order of magnitude faster than Ducc. In fact, Swan even improves on the static case by dividing the dataset into a static part and a set of inserts.", "citation": "Citations (5)", "departments": ["Hasso Plattner Institute", "Qatar Computing Research Institute", "Hasso Plattner Institute"], "authors": ["Ziawasch Abedjan.....http://dblp.org/pers/hd/a/Abedjan:Ziawasch", "Jorge-Arnulfo Quiané-Ruiz.....http://dblp.org/pers/hd/q/Quian=eacute==Ruiz:Jorge=Arnulfo", "Felix Naumann.....http://dblp.org/pers/hd/n/Naumann:Felix"], "conf": "icde", "year": "2014", "pages": 12}