{"title": "All File Systems Are Not Created Equal: On the Complexity of Crafting Crash-Consistent Applications.", "fields": ["correctness", "file system", "crash", "virtualization", "persistence"], "abstract": "We present the first comprehensive study of application-level crash-consistency protocols built atop modern file systems. We find that applications use complex update protocols to persist state, and that the correctness of these protocols is highly dependent on subtle behaviors of the underlying file system, which we term persistence properties. We develop a tool named BOB that empirically tests persistence properties, and use it to demonstrate that these properties vary widely among six popular Linux file systems. We build a framework named ALICE that analyzes application update protocols and finds crash vulnerabilities, i.e., update protocol code that requires specific persistence properties to hold for correctness. Using ALICE, we analyze eleven widely-used systems (including databases, key-value stores, version control systems, distributed systems, and virtualization software) and find a total of 60 vulnerabilities, many of which lead to severe consequences. We also show that ALICE can be used to evaluate the effect of new file-system designs on application-level consistency.", "citation": "Citations (73)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Thanumalayan Sankaranarayana Pillai.....http://dblp.org/pers/hd/p/Pillai:Thanumalayan_Sankaranarayana", "Vijay Chidambaram.....http://dblp.org/pers/hd/c/Chidambaram:Vijay", "Ramnatthan Alagappan.....http://dblp.org/pers/hd/a/Alagappan:Ramnatthan", "Samer Al-Kiswany.....http://dblp.org/pers/hd/a/Al=Kiswany:Samer", "Andrea C. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Andrea_C=", "Remzi H. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Remzi_H="], "conf": "osdi", "year": "2014", "pages": 16}