{"title": "Loss differentiation: Moving onto high-speed wireless LANs.", "fields": ["frame aggregation", "network packet", "throughput", "testbed", "wi fi array"], "abstract": "A fundamental problem in 802.11 wireless networks is to accurately determine the cause of packet losses. This becomes increasingly important as wireless data rates scale to Gbps, where lack of loss differentiation leads to higher loss in throughput. Recent and upcoming high-speed WLAN standards, such as 802.11n and 802.11ac, use frame aggregation and block acknowledgements for achieving efficient communication. This paper presents BLMon, a framework for loss differentiation, that uses loss patterns within aggregate frames and aggregate frame retries to achieve accurate and low overhead loss differentiation. Towards this end, we carry out a detailed measurement study on a real testbed to ascertain the differences in loss patterns due to noise, collisions, and hidden nodes. We then devise metrics to quantitatively capture these differences. Finally, we design BLMon, which collectively uses these metrics to infer the cause of loss without requiring any out-of-band communication, protocol changes, or customized hardware support. BLMon can be readily deployed on commodity devices using only driver-level changes at the sender-side. We implement BLMon in the ath9k driver and using real testbed experiments, show that it can provide up to 5!improvement in throughput.", "citation": "Citations (10)", "departments": ["Lahore University of Management Sciences", "Lahore University of Management Sciences", "Lahore University of Management Sciences", "Lahore University of Management Sciences", "Lahore University of Management Sciences"], "authors": ["Ruwaifa Anwar.....http://dblp.org/pers/hd/a/Anwar:Ruwaifa", "Kamran Nishat.....http://dblp.org/pers/hd/n/Nishat:Kamran", "Mohsin Ali.....http://dblp.org/pers/hd/a/Ali:Mohsin", "Zahaib Akhtar.....http://dblp.org/pers/hd/a/Akhtar:Zahaib", "Haseeb Niaz.....http://dblp.org/pers/hd/n/Niaz:Haseeb", "Ihsan Ayyub Qazi.....http://dblp.org/pers/hd/q/Qazi:Ihsan_Ayyub"], "conf": "infocom", "year": "2014", "pages": 9}