{"title": "Coverage in visual sensor networks with Pan-Tilt-Zoom cameras: The MaxFoV problem.", "fields": ["smart camera", "computer vision", "worst case complexity", "zoom", "wireless sensor network"], "abstract": "We consider the problem of target coverage in visual sensor networks with Pan-Tilt-Zoom (PTZ) cameras. The finely controllable movement in PTZ dimensions creates a large number of possible Field-of-View (FoV) settings, making it pro- hibitively expensive to consider them all in coverage algorithms. However, these FoVs are redundant as each group of targets is generally covered by many FoVs. Thus, an important problem is, how to identify FoVs that cover all maximal subsets of targets (MaxFoV) efficiently? We show that MaxFoV is an instance of generating all maximal cliques, which is NP-hard in general but polynomial if the number of cliques is polynomial. We construct an optimal algorithm to solve the problem with a worst case complexity of O(n 3 ). Simulation and testbed experiments show that the algorithm drastically reduces the number of FoVs allowing multi-camera coverage to scale without sacrificing coverage quality. I. INTRODUCTION Smart camera networks, also called Visual Sensor Net- works (VSNs) (19), are used in a range of applications such as monitoring and surveillance, traffic management and health care (3), (14). Coverage is a key problem in VSNs: how can cameras select their Field-of-Views (FoVs) to increase the amount and quality of information collected by the network? Coverage algorithms require identification of a set of feasible FoVs for each camera. Out of the feasible FoVs, coverage algorithms assign one FoV to each camera. The complexity of coverage algorithms increases significantly as a function of the number of feasible FoVs. Thus, it is critical to reduce the number of feasible FoVs without affecting coverage quality. We focus on the problem of target coverage in VSNs with Pan-Tilt-Zoom (PTZ) cameras (18). PTZ cameras can change their Field-of-View (FoV) in three dimensions: horizontal (pan), vertical (tilt), and depth (zoom). In VSNs, coverage has typically been considered for directional sensors (or pan-only cameras) (7), (10), (21) where each sensor can orient (pan) to cover k different sectors. The coverage problem assigns each camera to one sector to meet the coverage objective; for instance, to maximize the total targets covered (7), (8), (16), or to schedule cameras to allocate their time among different targets (11). While PTZ cameras are able to provide superior coverage to pan-only cameras (or directional sensors), they introduce new challenges. In coverage algorithms for directional sensors (2), (7), (8), (10), (16), (21), all discrete FoVs (sectors corresponding to the pan directions) are considered by coverage algorithms. We", "citation": "Citations (10)", "departments": ["Binghamton University", "IBM", "Binghamton University"], "authors": ["Vikram P. Munishwar.....http://dblp.org/pers/hd/m/Munishwar:Vikram_P=", "Vinay Kolar.....http://dblp.org/pers/hd/k/Kolar:Vinay", "Nael B. Abu-Ghazaleh.....http://dblp.org/pers/hd/a/Abu=Ghazaleh:Nael_B="], "conf": "infocom", "year": "2014", "pages": 9}