{"title": "Blind Seer: A Scalable Private DBMS.", "fields": ["spatial query", "web query classification", "range query", "sargable", "web search query"], "abstract": "Query privacy in secure DBMS is an important feature, although rarely formally considered outside the theoretical community. Because of the high overheads of guaranteeing privacy in complex queries, almost all previous works addressing practical applications consider limited queries (e.g., just keyword search), or provide a weak guarantee of privacy. In this work, we address a major open problem in private DB: efficient sub linear search for arbitrary Boolean queries. We consider scalable DBMS with provable security for all parties, including protection of the data from both server (who stores encrypted data) and client (who searches it), as well as protection of the query, and access control for the query. We design, build, and evaluate the performance of a rich DBMS system, suitable for real-world deployment on today medium-to large-scale DBs. On a modern server, we are able to query a formula over 10TB, 100M-record DB, with 70 searchable index terms per DB row, in time comparable to (insecure) MySQL (many practical queries can be privately executed with work 1.2-3 times slower than MySQL, although some queries are costlier). We support a rich query set, including searching on arbitrary boolean formulas on keywords and ranges, support for stemming, and free keyword searches over text fields. We identify and permit a reasonable and controlled amount of leakage, proving that no further leakage is possible. In particular, we allow leakage of some search pattern information, but protect the query and data, provide a high level of privacy for individual terms in the executed search formula, and hide the difference between a query that returned no results and a query that returned a very small result set. We also support private and complex access policies, integrated in the search process so that a query with empty result set and a query that fails the policy are hard to tell apart.", "citation": "Citations (138)", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "authors": ["Vasilis Pappas.....http://dblp.org/pers/hd/p/Pappas:Vasilis", "Fernando Krell.....http://dblp.org/pers/hd/k/Krell:Fernando", "Binh Vo.....http://dblp.org/pers/hd/v/Vo:Binh", "Vladimir Kolesnikov.....http://dblp.org/pers/hd/k/Kolesnikov:Vladimir", "Tal Malkin.....http://dblp.org/pers/hd/m/Malkin:Tal", "Seung Geol Choi.....http://dblp.org/pers/hd/c/Choi:Seung_Geol", "Wesley George.....http://dblp.org/pers/hd/g/George:Wesley", "Angelos D. Keromytis.....http://dblp.org/pers/hd/k/Keromytis:Angelos_D=", "Steven M. Bellovin.....http://dblp.org/pers/hd/b/Bellovin:Steven_M="], "conf": "sp", "year": "2014", "pages": 16}