{"title": "Multi-object Tracking via Constrained Sequential Labeling.", "fields": ["local consistency", "exploit", "bittorrent tracker", "video tracking", "identifier"], "abstract": "This paper presents a new approach to tracking people in crowded scenes, where people are subject to long-term (partial) occlusions and may assume varying postures and articulations. In such videos, detection-based trackers give poor performance since detecting people occurrences is not reliable, and common assumptions about locally smooth trajectories do not hold. Rather, we use temporal mid-level features (e.g., supervoxels or dense point trajectories) as a more coherent spatiotemporal basis for handling occlusion and pose variations. Thus, we formulate tracking as labeling mid-level features by object identifiers, and specify a new approach, called constrained sequential labeling (CSL), for performing this labeling. CSL uses a cost function to sequentially assign labels while respecting the implications of hard constraints computed via constraint propagation. A key feature of this approach is that it allows for the use of flexible cost functions and constraints that capture complex dependencies that cannot be represented in standard network-flow formulations. To exploit this flexibility we describe how to learn constraints and give a provably correct learning algorithms for cost functions that achieves finitetime convergence at a rate that improves with the strength of the constraints. Our experimental results indicate that CSL outperforms the state-of-the-art on challenging real-world videos of volleyball, basketball, and pedestrians walking.", "citation": "Citations (21)", "year": "2014", "departments": ["Oregon State University", "Oregon State University", "Oregon State University"], "conf": "cvpr", "authors": ["Sheng Chen.....http://dblp.org/pers/hd/c/Chen:Sheng", "Alan Fern.....http://dblp.org/pers/hd/f/Fern:Alan", "Sinisa Todorovic.....http://dblp.org/pers/hd/t/Todorovic:Sinisa"], "pages": 8}