{"title": "Heterogeneity-aware data regeneration in distributed storage systems.", "fields": ["heuristic", "data integrity", "distributed data store", "redundancy", "computer data storage"], "abstract": "Distributed storage systems provide large-scale re- liable data storage services by spreading redundancy across a large group of storage nodes. In such big systems, node failures take place on a regular basis. When a node fails or leaves the system, to maintain the same level of redundancy, it is expected to regenerate the redundant data at a replacement node as soon as possible. Previous studies aim to minimize the network traffic in the regeneration process, but in practical networks, where link capacities vary in a wide range, minimizing network traffic does not always mean minimizing regeneration time. Considering the heterogeneous link capacities, Li et al. proposed a tree-structured regeneration scheme, called RCTREE, to bypass the low-capacitated link encountered in direct transmissions. However, we find that RCTREE may rapidly lose data integrity after several regenerations. In this paper, we reconsider the problem of minimizing regeneration time in networks with heterogeneous link capacities. We derive the minimum amount of data to be transmitted through each link to preserve data integrity. We prove that building an optimal regeneration tree is NP-complete and propose a heuristic algorithm for a near-optimal solution. We further introduce a flexible regeneration scheme, which allows providers to generate different amount of coded data. Simulation results show that the flexible tree-structured regeneration scheme can reduce the regeneration time significantly.", "citation": "Citations (9)", "departments": ["Fudan University", "Fudan University", "University of Calgary", "Fudan University"], "authors": ["Yan Wang.....http://dblp.org/pers/hd/w/Wang:Yan", "Dongsheng Wei.....http://dblp.org/pers/hd/w/Wei:Dongsheng", "Xunrui Yin.....http://dblp.org/pers/hd/y/Yin:Xunrui", "Xin Wang.....http://dblp.org/pers/hd/w/Wang_0002:Xin"], "conf": "infocom", "year": "2014", "pages": 9}