{"title": "Ranking item features by mining online user-item interactions.", "fields": ["ranking", "matrix decomposition", "interaction information", "flow network", "granularity"], "abstract": "We assume a database of items in which each item is described by a set of attributes, some of which could be multi-valued. We refer to each of the distinct attribute values as a feature. We also assume that we have information about the interactions (such as visits or likes) between a set of users and those items. In our paper, we would like to rank the features of an item using user-item interactions. For instance, if the items are movies, features could be actors, directors or genres, and user-item interaction could be user liking the movie. These information could be used to identify the most important actors for each movie. While users are drawn to an item due to a subset of its features, a user-item interaction only provides an expression of user preference over the entire item, and not its component features. We design algorithms to rank the features of an item depending on whether interaction information is available at aggregated or individual level granularity and extend them to rank composite features (set of features). Our algorithms are based on constrained least squares, network flow and non-trivial adaptations to non-negative matrix factorization. We evaluate our algorithms using both real-world and synthetic datasets.", "citation": "Citations (1)", "departments": ["Qatar Computing Research Institute", "University of Texas at Arlington", "University of Texas at Arlington", "Qatar Computing Research Institute", "University of Texas at Arlington"], "authors": ["Sofiane Abbar.....http://dblp.org/pers/hd/a/Abbar:Sofiane", "Habibur Rahman.....http://dblp.org/pers/hd/r/Rahman:Habibur", "Saravanan Thirumuruganathan.....http://dblp.org/pers/hd/t/Thirumuruganathan:Saravanan", "Carlos Castillo.....http://dblp.org/pers/hd/c/Castillo_0001:Carlos", "Gautam Das.....http://dblp.org/pers/hd/d/Das_0001:Gautam"], "conf": "icde", "year": "2014", "pages": 12}