{"title": "Fused one-vs-all mid-level features for fine-grained visual categorization.", "fields": ["discriminative model", "computer vision", "categorization", "convolutional neural network", "machine learning"], "abstract": "As an emerging research topic, fine-grained visual categorization has been attracting growing attentions in recent years. Due to the large inter-class similarity and intra-class variance, recognizing objects in fine-grained domains is extremely challenging, and sometimes even humans can not recognize them accurately. Traditional bag-of-words model could obtain desirable results for basic-level category classification by weak alignment using spatial pyramid matching model, but may easily fail in fine-grained domains since the discriminative features are not only subtle but also extremely localized. The fine differences often get swamped by those irrelevant features, and it is virtually impossible to distinguish them. To address the problems above, we propose a new framework for fine-grained visual categorization. We strengthen the spatial correspondence among parts by including foreground segmentation and part localization. Based on the part representations of the images, we learn a large set of mid-level features which are more suitable for fine-grained tasks. Comparing with the low level features directly extracted from the images, the learned one-vs-all mid-level features enjoy the following advantages. First, the dimension of the mid-level features is relatively small. In order to obtain high classification accuracy, the dimension of the low level features usually reaches several thousand to tens of thousand, and becomes even larger when introducing spatial pyramid model. However, the dimension of our mid-level features is related to the number of classes, which is far less. Second, each entry of the proposed mid-level features is meaningful, which forms a more compact representation of the image. Third, the mid-level features are more robust than the low level ones, which is helpful for classification. Fourth, the learning process of the mid-level features is independent and can be easily combined with other techniques to boost the performance. We evaluate the proposed approach on the extensive fine-grained dataset CUB 200-2011 and Stanford Dogs, by learning the mid-level features based on the popular Fisher vectors and convolutional neural network, we boost the classification accuracy by a considerable margin and advance the state-of-the-art performance in fine-grained visual categorization.", "citation": "Citations (15)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Science and Technology of China", "University of Texas at San Antonio"], "authors": ["Xiaopeng Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiaopeng", "Hongkai Xiong.....http://dblp.org/pers/hd/x/Xiong:Hongkai", "Wengang Zhou.....http://dblp.org/pers/hd/z/Zhou:Wengang", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "conf": "mm", "year": "2014", "pages": 10}