{"title": "Software Defined Monitoring of application protocols.", "fields": ["hardware acceleration", "distributed computing", "stateful firewall", "application layer", "network monitoring", "computer engineering", "computer science", "verification and validation", "process control monitoring", "software"], "abstract": "With the ongoing shift of network services to the application layer also the monitoring systems focus more on the data from the application layer. The increasing speed of the network links, together with the increased complexity of application protocol processing, require a new way of hardware acceleration. We propose a new concept of hardware acceleration for flexible flow-based application level traffic monitoring which we call Software Defined Monitoring. Application layer processing is performed by monitoring tasks implemented in the software in conjunction with a configurable hardware accelerator. The accelerator is a high-speed application-specific processor tailored to stateful flow processing. The software monitoring tasks control the level of detail retained by the hardware for each flow in such a way that the usable information is always retained, while the remaining data is processed by simpler methods. Flexibility of the concept is provided by a plugin-based design of both hardware and software, which ensures adaptability in the evolving world of network monitoring. Our high-speed implementation using FPGA acceleration board in a commodity server is able to perform a 100 Gb/s flow traffic measurement augmented by a selected application-level protocol analysis.", "citation": "Citations (16)", "departments": ["CESNET", "CESNET", "Brno University of Technology", "CESNET", "CESNET", "CESNET", "Brno University of Technology", "Luleå University of Technology"], "authors": ["Lukas Kekely.....http://dblp.org/pers/hd/k/Kekely:Lukas", "Viktor Pus.....http://dblp.org/pers/hd/p/Pus:Viktor", "Jan Korenek.....http://dblp.org/pers/hd/k/Korenek:Jan"], "conf": "infocom", "year": "2014", "pages": 9}