{"title": "ForeSight: Mapping vehicles in visual domain and electronic domain.", "fields": ["unicast", "cruise control", "assisted gps", "broadcasting", "dedicated short range communications"], "abstract": "Using broadcast in vehicular applications such as autonomous cruise control and collaborative driving can disturb unrelated drivers and fail to convey the message due to unspecified receiver, resulting in increased risk of accidents. For supporting the unicast communication primitive, it is important to know the electronic identities (EIDs), e.g., the IP addresses and the relative positions of the nearby vehicles. We show that the estimated GPS coordinates alone are not accurate enough to uniquely identify the intended vehicle. On the other hand, there is an increasing array of devices, such as on-board camera, RADAR, and DSRC radio that are becoming available in newer vehicles. These heterogeneously deployed devices provide information sources that have varying levels of accuracy and potentially different coverage regions, making it challenging to accurately identify the vehicle. As a first step, we design ForeSight, a system that dynamically integrates the information observed in the visual domain (e.g., from camera) and the electronic domain (e.g., WiFi radio) to match the vehicles observed in these two domains with high accuracy. The experiment and simulation results show that ForeSight is able to significantly improve the vehicle identification accuracy compared to using GPS or other algorithms. In our case study, ForeSight reduces disturbing messages by 14 × as compared to the number of a GPS-based communication method.", "citation": "Citations (5)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Dong Li.....http://dblp.org/pers/hd/l/Li:Dong", "Zhixue Lu.....http://dblp.org/pers/hd/l/Lu:Zhixue", "Tarun Bansal.....http://dblp.org/pers/hd/b/Bansal:Tarun", "Erik Schilling.....http://dblp.org/pers/hd/s/Schilling:Erik", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun"], "conf": "infocom", "year": "2014", "pages": 9}