{"title": "INDAPSON: An incentive data plan sharing system based on self-organizing network.", "fields": ["internet access", "self organizing network", "download", "mobile broadband", "upload"], "abstract": "The contradiction between dynamic user traffic and fixed data plans has drawn increasing attention in the field of mobile applications. In this paper we build a data plan sharing system named INDAPSON to consider a scenario where some smartphone users have surplus data traffic and are willing to help others download data. Virtual credits can be gained as reward, which can be used to ask for future help in downloading. To realize this model, we make the following contributions: 1) A dynamic self-organization strategy to adapt to mobile terminals; 2) An incentive mechanism named RAP to encourage participation; 3) Power-saving strategies to reduce power consumption. The main advantage of our system is that users gain improvement in download rate while being able to convert their surplus data traffic to virtual credits. The results of experiment and simulation show that users in our system can manage their surplus data plan more efficiently while a high- speed download rate can be achieved. I. INTRODUCTION With the rapid development of mobile computing, today's mobile terminals, such as smart phones and tablets, are be- coming more and more powerful and can offer people with highly convenient Internet access. Using mobile terminals to get Internet services is becoming increasingly important in people's daily life. People can browse webs or download data anytime and anywhere through their cellular connections. Indeed, cellular data traffic is growing rapidly these years. However, we have to notice that there exist many drawbacks of today's mobile data service, and we are interested in the following two common problems: Firstly, we notice a problem that many ISPs don't provide unlimited data plans, and overuse is of high cost. For users who prefer tiered data plans with a limited amount of data, their network usage is always dynamic while their data plan is fixed. Sometimes their data plans are overused but underused at other times. Thus users have to pay attention on their data usage. Secondly, with the increasing demand of data download through cellular connections, downstream rate offered by current cellular networks is insufficient to meet users' de- mand. Furthermore, the data rate of cellular network fluctuates severely over time. As a result, people often fail to get high quality of Internet service. Thus, it is of great significance to figure out an effective mechanism to make use of idle wireless interfaces and improve cellular bandwidth without unacceptable expense to update the infrastructures of ISPs. In this paper, we propose a novel INcentive DAta Plan Shar- ing system based on Self-Organizing Network (INDAPSON) to tackle the two problems mentioned above. Our proposal is based on two observations: 1) some users still have under-used data plan while some other users overuse their data plan. 2) people often stay together in daily life - for instance family members in houses, co-workers in meeting rooms, passengers on buses etc. These observations provide opportunities for our solution. The two goals that our system aims to achieve are 1) meeting users' dynamic traffic requirements and 2) increasing the download data rate. In order to discriminate different participators, we classify users into three types in our system: • Primary user: user who needs to download data from the Internet. • Assistant user: user who helps a download user download data from the Internet. • Detected user: user who acts as a candidate for assistant user. Our system fits a scenario where assistant or detected users have idle cellular links or are willing to deal with their surplus data traffic, and it works as follows: one primary user initiates the construction of a local wireless network, the members of which are called detected users. Several assistant users are cho- sen from the detected users to help the primary user download data from the Internet through their cellular connections, and then relay data segments arrived to the primary user through WiFi connections. Since the low downstream rate of cellular networks is the bottleneck of system performance, we run multiple threads on primary user to receive data from different sources (server and peers) simultaneously, avoiding block on single cellular connection. After a cooperation, records for the whole download process are uploaded to a management server on the Internet. With a pricing scheme called Reputation Adaptive Pricing (RAP) applied, a primary user can pay a certain amount of virtual credits to assistant users, which can be used to purchase the help from other users next time. One important feature of INDAPSON is that users do not necessarily know the existence of each other or are interested in the same data. They simply keep our application running in the background of their smartphones all the time without other manipulations. Some of previous works have discussed on the cooperative download within a small user group, where", "citation": "Citations (27)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Microsoft"], "authors": ["Tuo Yu.....http://dblp.org/pers/hd/y/Yu:Tuo", "Zilong Zhou.....http://dblp.org/pers/hd/z/Zhou:Zilong", "Da Zhang.....http://dblp.org/pers/hd/z/Zhang:Da", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Yunxin Liu.....http://dblp.org/pers/hd/l/Liu:Yunxin", "Songwu Lu.....http://dblp.org/pers/hd/l/Lu:Songwu"], "conf": "infocom", "year": "2014", "pages": 9}