{"title": "Towards automatic phone-to-phone communication for vehicular networking applications.", "fields": ["mobile phone tracking", "feature phone", "gsm services", "mobile phone signal", "cdma2000"], "abstract": "This paper explores direct phone-to-phone communication (via WiFi interface) among vehicles to support mobile sensing applications. Direct communication among drivers’ phones is important in improving data collection efficiency and sharing participatory sensing information in an inexpensive manner. We design a practical and optimized communication mechanism for direct phone-to-phone data transfer among drivers’ phones that strategically enables phone-to-phone and/or phone-toWiFiAP communications by optimally toggles the phone between the normal client and the hotspot modes. We take advantage of the WiFi hotspot functionality on smartphones, and hence require neither involvement of participants nor changes to existing wireless infrastructure and protocols. An analytical model is established to optimize toggling between client and hotspot modes for optimal system efficiency. We fully implement this system on off-the-shelf Google Galaxy Nexus and Nexus S phones. Through a 35-vehicle 2-month deployment study, as well as simulation experiments using the real-world T-drive 9,211-taxicab dataset, we show that our solution significantly reduces data transfer delay time and maintains over 80% efficiency under varying system parameters. We even achieve 90% for parameter settings of the latest smartphones.", "citation": "Citations (36)", "departments": ["University of Illinois at Urbana–Champaign", "University of Science and Technology of China", "University at Buffalo", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Shaohan Hu.....http://dblp.org/pers/hd/h/Hu:Shaohan", "Hengchang Liu.....http://dblp.org/pers/hd/l/Liu:Hengchang", "Lu Su.....http://dblp.org/pers/hd/s/Su:Lu", "Hongyan Wang.....http://dblp.org/pers/hd/w/Wang:Hongyan", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F=", "Pan Hui.....http://dblp.org/pers/hd/h/Hui:Pan", "Wei Zheng.....http://dblp.org/pers/hd/z/Zheng:Wei", "Zhiheng Xie.....http://dblp.org/pers/hd/x/Xie:Zhiheng", "John A. Stankovic.....http://dblp.org/pers/hd/s/Stankovic:John_A="], "conf": "infocom", "year": "2014", "pages": 9}