{"title": "Zero-reachability in probabilistic multi-counter automata.", "fields": ["ergodicity", "undecidable problem", "probabilistic logic", "stochastic petri net", "decidability"], "abstract": "We study the qualitative and quantitative zero-reachability problem in probabilistic multi-counter systems. We identify the undecidable variants of the problems, and then we concentrate on the remaining two cases. In the first case, when we are interested in the probability of all runs that visit zero in  some  counter, we show that the qualitative zero-reachability is decidable in time which is polynomial in the size of a given pMC and doubly exponential in the number of counters. Further, we show that the probability of all zero-reaching runs can be effectively approximated up to an arbitrarily small given error e > 0 in time which is polynomial in log(e), exponential in the size of a given pMC, and doubly exponential in the number of counters. In the second case, we are interested in the probability of all runs that visit zero in some counter different from the last counter. Here we show that the qualitative zero-reachability is decidable and SquareRootSum-hard, and the probability of all zero-reaching runs can be effectively approximated up to an arbitrarily small given error e > 0 (these results apply to pMC satisfying a suitable technical condition that can be verified in polynomial time). The proof techniques invented in the second case allow to construct counterexamples for some classical results about ergodicity in stochastic Petri nets.", "citation": "Citations (7)", "departments": ["Masaryk University", "University of Oxford", "Masaryk University", "Masaryk University", "RWTH Aachen University"], "authors": ["Tomás Brázdil.....http://dblp.org/pers/hd/b/Br=aacute=zdil:Tom=aacute=s", "Stefan Kiefer.....http://dblp.org/pers/hd/k/Kiefer:Stefan", "Antonín Kucera.....http://dblp.org/pers/hd/k/Kucera:Anton=iacute=n", "Petr Novotný.....http://dblp.org/pers/hd/n/Novotn=yacute=_0001:Petr", "Joost-Pieter Katoen.....http://dblp.org/pers/hd/k/Katoen:Joost=Pieter"], "conf": "lics", "year": "2014", "pages": 10}