{"title": "Satisfiability modulo counting: a new approach for analyzing privacy properties.", "fields": ["implementation", "personally identifiable information", "correctness", "finite model theory", "differential privacy"], "abstract": "Applications increasingly derive functionality from sensitive personal information, forcing developers who wish to preserve some notion of privacy or confidentiality to reason about partial information leakage. New definitions of privacy and confidentiality, such as differential privacy, address this by offering precise statements of acceptable disclosure that are useful in common settings. However, several recent published accounts of flawed implementations have surfaced, highlighting the need for verification techniques.   In this paper, we pose the problem of  model-counting satisfiability , and show that a diverse set of privacy and confidentiality verification problems can be reduced to instances of it. In this problem, constraints are placed on the outcome of model-counting operations, which occur over formulas containing  parameters . The object is to find an assignment to the parameters that satisfies the model-counting constraints, or to demonstrate unsatisfiability.   We present a logic for expressing these problems, and an abstract decision procedure for model-counting satisfiability problems fashioned after CDCL-based SMT procedures, encapsulating functionality specific to the underlying logic in which counting occurs in a small set of black-box routines similar to those required of theory solvers in SMT. We describe an implementation of this procedure for linear-integer arithmetic, as well as an effective strategy for generating lemmas. We conclude by applying our decision procedure to the verification of privacy properties over programs taken from a well-known privacy-preserving compiler, demonstrating its ability to find flaws or prove correctness sometimes in a matter of seconds.", "citation": "Citations (10)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Matthew Fredrikson.....http://dblp.org/pers/hd/f/Fredrikson:Matthew", "Somesh Jha.....http://dblp.org/pers/hd/j/Jha:Somesh"], "conf": "lics", "year": "2014", "pages": 10}