{"title": "A Tale of Two Solvers: Eager and Lazy Approaches to Bit-Vectors.", "fields": ["conjunctive normal form", "modular arithmetic", "satisfiability", "solver", "strict programming language", "eager evaluation", "lazy initialization", "propositional calculus", "architecture", "portfolio"], "abstract": "The standard method for deciding bit-vector constraints is via eager reduction to propositional logic. This is usually done after first applying powerful rewrite techniques. While often efficient in practice, this method does not scale on problems for which top-level rewrites cannot reduce the problem size sufficiently. A lazy solver can target such problems by doing many satisfiability checks, each of which only reasons about a small subset of the problem. In addition, the lazy approach enables a wide range of optimization techniques that are not available to the eager approach. In this paper we describe the architecture and features of our lazy solver (LBV). We provide a comparative analysis of the eager and lazy approaches, and show how they are complementary in terms of the types of problems they can efficiently solve. For this reason, we propose a portfolio approach that runs a lazy and eager solver in parallel. Our empirical evaluation shows that the lazy solver can solve problems none of the eager solvers can and that the portfolio solver outperforms other solvers both in terms of total number of problems solved and the time taken to solve them.", "citation": "Not cited", "year": "2014", "departments": ["New York University", "New York University", "SRI International", "New York University", "University of Iowa"], "conf": "cav", "authors": ["Liana Hadarean.....http://dblp.org/pers/hd/h/Hadarean:Liana", "Kshitij Bansal.....http://dblp.org/pers/hd/b/Bansal:Kshitij", "Dejan Jovanovic.....http://dblp.org/pers/hd/j/Jovanovic:Dejan", "Clark Barrett.....http://dblp.org/pers/hd/b/Barrett:Clark", "Cesare Tinelli.....http://dblp.org/pers/hd/t/Tinelli:Cesare"], "pages": 16}