{"title": "Robust and cost-effective architecture design for smart grid communications: A multi-stage middleware deployment approach.", "fields": ["hierarchical control system", "smart grid", "grid", "competitive analysis", "scada"], "abstract": "Wide-area monitoring, protection and control (WAMPAC) plays a critical role in smart grid, for protection against possible contingencies, by using the Supervisory Control and Data Acquisition (SCADA) system. However, a general consensus is that such a hierarchical system can be highly vulnerable to component (i.e., nodes and links) failures, calling for a robust and cost-effective communication system for smart grid. To this end, we consider a middleware approach to leverage the existing commercial communication infrastructure with abun- dant connectivity. In this approach, a natural question is how to use the middleware to cohesively \"glue\" the power grid and the commercial communication infrastructure together, in order to enhance robustness and cost-effectiveness. We tackle this problem while taking into consideration the multi-stage deployment of power devices and their redundant connections. We show that this problem can be cast as a minimum-cost middleware design under incremental deployment—an \"online\" problem where the input is provided gradually due to the incremental deployment. We design a randomized \"online\" algorithm, and show that it achieves the order-optimal average competitive ratio. Simulation results demonstrate the performance of our proposed algorithm, compared to the optimal offline solution. I. INTRODUCTION Existing power grids are now entering a new era of transfor- mation, driven by today's pressing needs such as cost-effective power generation, higher usage of renewable energy sources and two-way flows of electricity and information. Such a transformation of power grids is expected to put forth smart grid, which will enable electricity provisioning in a cleaner, safer, and more reliable and economical way. To accomplish such innovations, the major challenge lies in the reliability and security. This requires smart grid to be equipped with a wide- area monitoring, protection, and control (WAMPAC) system. A WAMPAC system makes use of system-wide information, collected over a wide geographic area, and communications in order to perform fast decision-making and switching actions for the system stability and protection (1). WAMPAC is playing an increasingly critical role in power systems for their reliable operation and protection from possible contingencies. Traditionally, the Supervisory Control and Data Acquisition (SCADA) system has been used to monitor and control the power grid. The SCADA system is a star network, where each substation is directly connected to a control center, and operates in a centralized fashion, i.e., the control center gathers", "citation": "Citations (4)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Dong-Hoon Shin.....http://dblp.org/pers/hd/s/Shin:Dong=Hoon", "Shibo He.....http://dblp.org/pers/hd/h/He:Shibo", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan"], "conf": "infocom", "year": "2014", "pages": 9}