{"title": "Toward strong, usable access control for shared distributed data.", "fields": ["digital data", "usable", "correctness", "enforcement", "distributed file system"], "abstract": "As non-expert users produce increasing amounts of personal digital data, usable access control becomes critical. Current approaches often fail, because they insufficiently protect data or confuse users about policy specification. This paper presents Penumbra, a distributed file system with access control designed to match users' mental models while providing principled security. Penumbra's design combines semantic, tag-based policy specification with logic-based access control, flexibly supporting intuitive policies while providing high assurance of correctness. It supports private tags, tag disagreement between users, decentralized policy enforcement, and unforgeable audit records. Penumbra's logic can express a variety of policies that map well to real users' needs. To evaluate Penumbra's design, we develop a set of detailed, realistic case studies drawn from prior research into users' access-control preferences. Using microbenchmarks and traces generated from the case studies, we demonstrate that Penumbra can enforce users' policies with overhead less than 5% for most system calls.", "citation": "Citations (17)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Michelle L. Mazurek.....http://dblp.org/pers/hd/m/Mazurek:Michelle_L=", "Yuan Liang.....http://dblp.org/pers/hd/l/Liang:Yuan", "William Melicher.....http://dblp.org/pers/hd/m/Melicher:William", "Manya Sleeper.....http://dblp.org/pers/hd/s/Sleeper:Manya", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Gregory R. Ganger.....http://dblp.org/pers/hd/g/Ganger:Gregory_R=", "Nitin Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Nitin", "Michael K. Reiter.....http://dblp.org/pers/hd/r/Reiter:Michael_K="], "conf": "fast", "year": "2014", "pages": 15}