{"title": "Resilient X10: efficient failure-aware programming.", "fields": ["domain knowledge", "software framework", "programmer", "invariance principle", "heap"], "abstract": "Scale-out programs run on multiple processes in a cluster. In scale-out systems, processes can fail. Computations using traditional libraries such as MPI fail when any component process fails. The advent of Map Reduce, Resilient Data Sets and MillWheel has shown dramatic improvements in productivity are possible when a high-level programming framework handles scale-out and resilience automatically.   We are concerned with the development of general-purpose languages that support resilient programming. In this paper we show how the X10 language and implementation can be extended to support resilience. In Resilient X10, places may fail asynchronously, causing loss of the data and tasks at the failed place. Failure is exposed through exceptions. We identify a {\\em Happens Before Invariance Principle} and require the runtime to automatically repair the global control structure of the program to maintain this principle. We show this reduces much of the burden of resilient programming. The programmer is only responsible for continuing execution with fewer computational resources and the loss of part of the heap, and can do so while taking advantage of domain knowledge.   We build a complete implementation of the language, capable of executing benchmark applications on hundreds of nodes. We describe the algorithms required to make the language runtime resilient. We then give three applications, each with a different approach to fault tolerance (replay, decimation, and domain-level checkpointing). These can be executed at scale and survive node failure. We show that for these programs the overhead of resilience is a small fraction of overall runtime by comparing to equivalent non-resilient X10 programs. On one program we show end-to-end performance of Resilient X10 is ~100x faster than Hadoop.", "citation": "Citations (64)", "year": "2014", "departments": ["Google", "IBM", "IBM", "IBM", "IBM"], "conf": "ppopp", "authors": ["David Cunningham.....http://dblp.org/pers/hd/c/Cunningham:David", "David Grove.....http://dblp.org/pers/hd/g/Grove:David", "Benjamin Herta.....http://dblp.org/pers/hd/h/Herta:Benjamin", "Arun Iyengar.....http://dblp.org/pers/hd/i/Iyengar:Arun", "Kiyokuni Kawachiya.....http://dblp.org/pers/hd/k/Kawachiya:Kiyokuni", "Hiroki Murata.....http://dblp.org/pers/hd/m/Murata:Hiroki", "Vijay A. Saraswat.....http://dblp.org/pers/hd/s/Saraswat:Vijay_A=", "Mikio Takeuchi.....http://dblp.org/pers/hd/t/Takeuchi:Mikio", "Olivier Tardieu.....http://dblp.org/pers/hd/t/Tardieu:Olivier"], "pages": 14}