{"title": "TalkBetter: family-driven mobile intervention care for children with language delay.", "fields": ["turn taking", "conversation", "social computing", "language delay", "everyday life"], "abstract": "Language delay is a developmental problem of children who do not acquire language as expected for their chronological ages. Without timely intervention, language delay can act as a lifelong risk factor. Speech-language pathologists highlight that effective parent participation in everyday parent-child conversation is important to treat children's language delay. For effective roles, however, parents need to alter their own lifelong-established conversation habits, requiring extensive period of conscious effort and staying alert. In this paper, we present new opportunities for mobile and social computing to reinforce everyday parent-child conversation with therapeutic implications for children with language delays. Specifically, we propose TalkBetter, a mobile in-situ intervention service to help parents in daily parent-child conversation through real-time meta-linguistic analysis of ongoing conversations. Through extensive field studies with speech-language pathologists and parents, we report the multilateral motivations and implications of TalkBetter. We present our development of TalkBetter prototype and report its performance evaluation.", "citation": "Citations (19)", "departments": ["KAIST", "KAIST", "KAIST", "Ewha Womans University", "Singapore Management University"], "authors": ["Inseok Hwang.....http://dblp.org/pers/hd/h/Hwang:Inseok", "Chungkuk Yoo.....http://dblp.org/pers/hd/y/Yoo:Chungkuk", "Chanyou Hwang.....http://dblp.org/pers/hd/h/Hwang:Chanyou", "Dongsun Yim.....http://dblp.org/pers/hd/y/Yim:Dongsun", "Youngki Lee.....http://dblp.org/pers/hd/l/Lee:Youngki", "Chulhong Min.....http://dblp.org/pers/hd/m/Min:Chulhong", "John Kim.....http://dblp.org/pers/hd/k/Kim:John", "Junehwa Song.....http://dblp.org/pers/hd/s/Song:Junehwa"], "conf": "cscw", "year": "2014", "pages": 14}