{"title": "SpringFS: bridging agility and performance in elastic distributed storage.", "fields": ["bounded function", "bridging", "computer data storage", "distributed data store", "server"], "abstract": "Elastic storage systems can be expanded or contracted to meet current demand, allowing servers to be turned off or used for other tasks. However, the usefulness of an elastic distributed storage system is limited by its agility: how quickly it can increase or decrease its number of servers. Due to the large amount of data they must migrate during elastic resizing, state-of-the-art designs usually have to make painful tradeoffs among performance, elasticity and agility.\n\nThis paper describes an elastic storage system, called SpringFS, that can quickly change its number of active servers, while retaining elasticity and performance goals. SpringFS uses a novel technique, termed bounded write offloading, that restricts the set of servers where writes to overloaded servers are redirected. This technique, combined with the read offloading and passive migration policies used in SpringFS, minimizes the work needed before deactivation or activation of servers. Analysis of real-world traces from Hadoop deployments at Facebook and various Cloudera customers and experiments with the SpringFS prototype confirm SpringFS's agility, show that it reduces the amount of data migrated for elastic resizing by up to two orders of magnitude, and show that it cuts the percentage of active servers required by 67- 82%, outdoing state-of-the-art designs by 6-120%.", "citation": "Citations (16)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Lianghong Xu.....http://dblp.org/pers/hd/x/Xu:Lianghong", "James Cipar.....http://dblp.org/pers/hd/c/Cipar:James", "Elie Krevat.....http://dblp.org/pers/hd/k/Krevat:Elie", "Alexey Tumanov.....http://dblp.org/pers/hd/t/Tumanov:Alexey", "Nitin Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Nitin", "Michael A. Kozuch.....http://dblp.org/pers/hd/k/Kozuch:Michael_A=", "Gregory R. Ganger.....http://dblp.org/pers/hd/g/Ganger:Gregory_R="], "conf": "fast", "year": "2014", "pages": 13}