{"title": "Towards Detecting Anomalous User Behavior in Online Social Networks.", "fields": ["operator", "subspace topology", "social network", "collusion", "anomaly detection"], "abstract": "Users increasingly rely on crowdsourced information, such as reviews on Yelp and Amazon, and liked posts and ads on Facebook. This has led to a market for blackhat promotion techniques via fake (e.g., Sybil) and compromised accounts, and collusion networks. Existing approaches to detect such behavior relies mostly on supervised (or semisupervised) learning over known (or hypothesized) attacks. They are unable to detect attacks missed by the operator while labeling, or when the attacker changes strategy.\n\nWe propose using unsupervised anomaly detection techniques over user behavior to distinguish potentially bad behavior from normal behavior. We present a technique based on Principal Component Analysis (PCA) that models the behavior of normal users accurately and identifies significant deviations from it as anomalous. We experimentally validate that normal user behavior (e.g., categories of Facebook pages liked by a user, rate of like activity, etc.) is contained within a low-dimensional subspace amenable to the PCA technique. We demonstrate the practicality and effectiveness of our approach using extensive ground-truth data from Facebook: we successfully detect diverse attacker strategies--fake, compromised, and colluding Facebook identities--with no a priori labeling while maintaining low false-positive rates. Finally, we apply our approach to detect click-spam in Facebook ads and find that a surprisingly large fraction of clicks are from anomalous users.", "citation": "Citations (127)", "year": "2014", "departments": ["Boston University", "Microsoft", "MPI-SWS", "MPI-SWS", "MPI-SWS"], "conf": "uss", "authors": ["Bimal Viswanath.....http://dblp.org/pers/hd/v/Viswanath:Bimal", "Muhammad Ahmad Bashir.....http://dblp.org/pers/hd/b/Bashir:Muhammad_Ahmad", "Mark Crovella.....http://dblp.org/pers/hd/c/Crovella:Mark", "Saikat Guha.....http://dblp.org/pers/hd/g/Guha:Saikat", "Krishna P. Gummadi.....http://dblp.org/pers/hd/g/Gummadi:Krishna_P=", "Balachander Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Balachander", "Alan Mislove.....http://dblp.org/pers/hd/m/Mislove:Alan"], "pages": 16}