{"title": "SBVLC: Secure barcode-based visible light communication for smartphones.", "fields": ["physical security", "internet privacy", "key exchange", "computer network", "mobile payment", "barcode", "visible light communication", "computer security"], "abstract": "2D barcodes have enjoyed a significant penetration rate in mobile applications. This is largely due to the extremely low barrier to adoption—almost every camera-enabled smartphone can scan 2D barcodes. As an alternative to NFC technology, 2D barcodes have been increasingly used for security-sensitive mobile applications including mobile payments and personal identification. However, the security of barcode-based communication in mobile applications has not been systematically studied. Due to the visual nature, 2D barcodes are subject to eavesdropping when they are displayed on the smartphone screens. On the other hand, the fundamental design principles of 2D barcodes make it difficult to add security features. In this paper, we propose SBVLC—a secure system for barcode-based visible light communication (VLC) between smartphones. We formally analyze the security of SBVLC based on geometric models and propose  physical  security enhancement mechanisms for barcode communication by manipulating screen view angles and leveraging user-induced motions. We then develop three secure data exchange schemes that encode information in barcode streams. These schemes are useful in many security-sensitive mobile applications including private information sharing, secure device pairing, and contactless payment. SBVLC is evaluated through extensive experiments on both Android and iOS smartphones.", "citation": "Citations (61)", "year": "2014", "departments": ["University at Buffalo", "University at Buffalo", "Michigan State University", "University of Massachusetts Lowell", "City University of Hong Kong", "University at Buffalo", "University at Buffalo", "Michigan State University", "University of Massachusetts Lowell", "City University of Hong Kong"], "conf": "infocom", "authors": ["Bingsheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Bingsheng", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Xinwen Fu.....http://dblp.org/pers/hd/f/Fu:Xinwen", "Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong"], "pages": 9}