{"title": "The effectiveness of an AR-based context-aware assembly support system in object assembly.", "fields": ["visualization", "augmented reality", "solid modeling", "data visualization", "overlay"], "abstract": "This study evaluates the effectiveness of an AR-based context-aware assembly support system with AR visualization modes proposed in object assembly. Although many AR-based assembly support systems have been proposed, few keep track of the assembly status in real-time and automatically recognize error and completion states at each step. Naturally, the effectiveness of such context-aware systems remains unexplored. Our test-bed system displays guidance information and error detection information corresponding to the recognized assembly status in the context of building block (LEGO) assembly. A user wearing a head mounted display (HMD) can intuitively build a building block structure on a table by visually confirming correct and incorrect blocks and locating where to attach new blocks. We proposed two AR visualization modes, one of them that displays guidance information directly overlaid on the physical model, and another one in which guidance information is rendered on a virtual model adjacent to the real model. An evaluation was conducted to comparatively evaluate these AR visualization modes as well as determine the effectiveness of context-aware error detection. Our experimental results indicate the visualization mode that shows target status next to real objects of concern outperforms the traditional direct overlay under moderate registration accuracy and marker-based tracking.", "citation": "Citations (14)", "departments": ["Osaka University", "Osaka University", "University of Maryland, College Park", "University of Central Florida", "Osaka University"], "authors": ["Bui Minh Khuong.....http://dblp.org/pers/hd/k/Khuong:Bui_Minh", "Kiyoshi Kiyokawa.....http://dblp.org/pers/hd/k/Kiyokawa:Kiyoshi", "Andrew Miller.....http://dblp.org/pers/hd/m/Miller:Andrew", "Joseph J. La Viola.....http://dblp.org/pers/hd/v/Viola:Joseph_J=_La", "Tomohiro Mashita.....http://dblp.org/pers/hd/m/Mashita:Tomohiro", "Haruo Takemura.....http://dblp.org/pers/hd/t/Takemura:Haruo"], "conf": "vr", "year": "2014", "pages": 6}