{"title": "The Computational Complexity of Structure-Based Causality.", "fields": ["polynomial hierarchy", "causality", "knowledge representation and reasoning", "machine learning", "complexity class", "computational complexity theory", "binary number", "mathematics", "causal model", "artificial intelligence"], "abstract": "Halpern and Pearl introduced a definition of actual causality; Eiter and Lukasiewicz showed that computing whether X = x is a cause of Y = y is NP-complete in binary models (where all variables can take on only two values) and Σ2P- complete in general models. In the final version of their paper, Halpern and Pearl slightly modified the definition of actual cause, in order to deal with problems pointed by Hopkins and Pearl. As we show, this modification has a nontrivial impact on the complexity of computing actual cause. To characterize the complexity, a new family DkP, k = 1, 2, 3,..., of complexity classes is introduced, which generalizes the class DP introduced by Papadimitriou and Yannakakis (DP is just D1P). We show that the complexity of computing causality under the updated definition is D2P -complete.\n\nChockler and Halpern extended the definition of causality by introducing notions of responsibility and blame. The complexity of determining the degree of responsibility and blame using the original definition of causality was completely characterized. Again, we show that changing the definition of causality affects the complexity, and completely characterize it using the updated definition.", "citation": "Citations (1)", "departments": ["IBM", "Cornell University", "IBM", "IBM", "King's College London", "Cornell University", "IBM", "Informatics"], "authors": ["Gadi Aleksandrowicz.....http://dblp.org/pers/hd/a/Aleksandrowicz:Gadi", "Hana Chockler.....http://dblp.org/pers/hd/c/Chockler:Hana", "Joseph Y. Halpern.....http://dblp.org/pers/hd/h/Halpern:Joseph_Y=", "Alexander Ivrii.....http://dblp.org/pers/hd/i/Ivrii:Alexander"], "conf": "aaai", "year": "2014", "pages": 7}