{"title": "What Videos Are Similar with You?: Learning a Common Attributed Representation for Video Recommendation.", "fields": ["recommender system", "external data representation", "interpretability", "concatenation", "granularity"], "abstract": "Although video recommender systems have become the predominant way for people to obtain video information, their performances are far from satisfactory in that (1) the recommended videos are often mismatched with the users' interests and (2) the recommendation results are, in most cases, hardly understandable for users and therefore cannot persuade them to engage. In this paper, we attempt to address the above problems in data representation level, and aim to learn a common attributed representation for users and videos in social media with good interpretability, stability and an appropriate level of granularity. The basic idea is to represent videos with users' social attributes, and represent users with content attributes of videos, such that both users and videos can be represented in a common space concatenated by social attributes and content attributes. The video recommendation problem can then be converted into a similarity matching problem in the common space. However, it is still challenging to balance the roles of social attributes and content attributes, learn such a common representation in sparse user-video interactions and deal with the cold-start problem. In this paper, we propose a REgularized Dual-fActor Regression (REDAR) method based on matrix factorization. In this method, social attributes and content attributes are flexibly combined, and social and content information are effectively exploited to alleviate the sparsity problem. An incremental version of REDAR is designed to solve the cold-start problem. We extensively evaluate the proposed method for video recommendation application in real social network dataset, and the results show that, in most cases, the proposed method can achieve a relative improvement of more than 20% compared to state-of-the-art baseline methods.", "citation": "Citations (23)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Peng Cui.....http://dblp.org/pers/hd/c/Cui_0001:Peng", "Zhiyu Wang.....http://dblp.org/pers/hd/w/Wang:Zhiyu", "Zhou Su.....http://dblp.org/pers/hd/s/Su:Zhou"], "conf": "mm", "year": "2014", "pages": 10}