{"title": "An application-specific instruction set for accelerating set-oriented database primitives.", "fields": ["query throughput", "instruction set", "speedup", "x86", "simd"], "abstract": "The key task of database systems is to efficiently manage large amounts of data. A high query throughput and a low query latency are essential for the success of a database system. Lately, research focused on exploiting hardware features like superscalar execution units, SIMD, or multiple cores to speed up processing. Apart from these software optimizations for given hardware, even tailor-made processing circuits running on FPGAs are built to run mostly stateless query plans with incredibly high throughput. A similar idea, which was already considered three decades ago, is to build tailor-made hardware like a database processor. Despite their superior performance, such application-specific processors were not considered to be beneficial because general-purpose processors eventually always caught up so that the high development costs did not pay off. In this paper, we show that the development of a database processor is much more feasible nowadays through the availability of customizable processors. We illustrate exemplarily how to create an instruction set extension for set-oriented database primitives. The resulting application-specific processor provides not only a high performance but it also enables very energy-efficient processing. Our processor requires in various configurations more than 960x less energy than a high-end x86 processor while providing the same performance.", "citation": "Citations (10)", "year": "2014", "departments": ["Dresden University of Technology", "Dresden University of Technology", "Dresden University of Technology", "Dresden University of Technology", "Dresden University of Technology"], "conf": "sigmod", "authors": ["Oliver Arnold.....http://dblp.org/pers/hd/a/Arnold:Oliver", "Sebastian Haas.....http://dblp.org/pers/hd/h/Haas:Sebastian", "Gerhard P. Fettweis.....http://dblp.org/pers/hd/f/Fettweis:Gerhard_P=", "Benjamin Schlegel.....http://dblp.org/pers/hd/s/Schlegel:Benjamin", "Thomas Kissinger.....http://dblp.org/pers/hd/k/Kissinger:Thomas", "Wolfgang Lehner.....http://dblp.org/pers/hd/l/Lehner:Wolfgang"], "pages": 12}