{"title": "Decorrelation of user defined function invocations in queries.", "fields": ["expressive power", "imperative programming", "decorrelation", "sql", "user defined function"], "abstract": "Queries containing user-defined functions (UDFs) are widely used, since they allow queries to be written using a mix of imperative language constructs and SQL, thereby increasing the expressive power of SQL; further, they encourage modularity, and make queries easier to understand. However, not much attention has been paid to their optimization, except for simple UDFs without imperative constructs. Queries invoking UDFs with imperative constructs are executed using iterative invocation of the UDFs, leading to poor performance, especially if the UDF contains queries. Such poor execution has been a major deterrent to the wider usage of complex UDFs. In this paper we present a novel technique to decorrelate UDFs containing imperative constructs, allowing set-oriented execution of queries that invoke UDFs. Our technique allows imperative execution to be modeled using the Apply construct used earlier to model correlated subqueries, and enables transformation rules to be applied subsequently to decorrelate (or inline) UDF bodies. Subquery decorrelation was critical to the wide use of subqueries; our work brings the same benefits to queries that invoke complex UDFs. We have applied our techniques to UDFs running on two commercial database systems, and present results showing up to orders of magnitude improvement.", "citation": "Citations (8)", "departments": ["Indian Institute of Technology, Hyderabad", "Indian Institute of Technology Bombay", "Indian Institute of Technology, Hyderabad", "Indian Institute of Technology, Hyderabad", "Indian Institute of Technology Bombay"], "authors": ["Varun Simhadri.....http://dblp.org/pers/hd/s/Simhadri:Varun", "Karthik Ramachandra.....http://dblp.org/pers/hd/r/Ramachandra_0002:Karthik", "Arun Chaitanya.....http://dblp.org/pers/hd/c/Chaitanya:Arun", "Ravindra Guravannavar.....http://dblp.org/pers/hd/g/Guravannavar:Ravindra", "S. Sudarshan.....http://dblp.org/pers/hd/s/Sudarshan_0001:S="], "conf": "icde", "year": "2014", "pages": 12}