{"title": "Checking the integrity of transactional mechanisms.", "fields": ["journaling file system", "commit", "downtime", "runtime verification", "shadow", "atomicity"], "abstract": "Data corruption is the most common consequence of file-system bugs, as shown by a recent study. When such corruption occurs, the file system's offline check and recovery tools need to be used, but they are error prone and cause significant downtime. Previous work has shown that a runtime checker for the Ext3 journaling file system can verify that metadata updates within a transaction are mutually consistent, helping detect corruption in metadata blocks at commit time. However, corruption can still be caused when a bug in the file system's transactional mechanism loses, misdirects, or corrupts writes. We show that a runtime checker needs to enforce the atomicity and durability properties of the file system on every write, in addition to checking transactions at commit time, to provide the strong guarantee that every block write will maintain file system consistency.\n\nIn this paper, we identify the invariants that need to be enforced on journaling and shadow paging file systems to preserve the integrity of committed transactions. We also describe the key properties that make it feasible to check these invariants for a file system. Based on this characterization, we have implemented runtime checkers for a modified version of the Ext3 file system and for the Btrfs file system. Our evaluation shows that both checkers detect data corruption effectively, and they can be used during normal operation with low overhead.", "citation": "Citations (6)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Daniel Fryer.....http://dblp.org/pers/hd/f/Fryer:Daniel", "Dai Qin.....http://dblp.org/pers/hd/q/Qin:Dai", "Jack Sun.....http://dblp.org/pers/hd/s/Sun:Jack", "Kah Wai Lee.....http://dblp.org/pers/hd/l/Lee:Kah_Wai", "Angela Demke Brown.....http://dblp.org/pers/hd/b/Brown:Angela_Demke", "Ashvin Goel.....http://dblp.org/pers/hd/g/Goel:Ashvin"], "conf": "fast", "year": "2014", "pages": 14}