{"title": "CrossNavi: enabling real-time crossroad navigation for the blind with commodity phones.", "fields": ["human computer interaction", "navigation system", "ranging", "commodity", "simulation"], "abstract": "Crossroad is among the most dangerous parts outside for the visually impaired people. Numerous studies have exploited navigating systems for the visually impaired community, providing services ranging from block detection, route planning to realtime localization. However, none of them have addressed the safety issue in crossroad and integrated three key factors necessary for a practical crossroad navigation system: detecting the crossroad, locating zebra patterns, and guiding the user within zebra crossing when passing the road. Our  CrossNavi  application responds to these needs, providing an integrated crossroad navigation service that incorporates all the essential functionalities mentioned above. The overall service is fulfilled by the collaboration of built-in sensors on commodity phones, and requires minimal human participation. We describe the technical aspects of its design, implementation, interface, and further improvements to make the system practical on a wider basis. Experimental results from three visually impaired volunteers show that the system exhibits promising behavior in both urban and rural areas.", "citation": "Citations (14)", "departments": ["Hong Kong University of Science and Technology", "Tsinghua University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University"], "authors": ["Longfei Shangguan.....http://dblp.org/pers/hd/s/Shangguan:Longfei", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng", "Zimu Zhou.....http://dblp.org/pers/hd/z/Zhou:Zimu", "Xiaolong Zheng.....http://dblp.org/pers/hd/z/Zheng_0002:Xiaolong", "Chenshu Wu.....http://dblp.org/pers/hd/w/Wu:Chenshu", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "huc", "year": "2014", "pages": 12}