{"title": "Anahita: A System for 3D Video Streaming with Depth Customization.", "fields": ["personalization", "stereoscopy", "depth perception", "anahita", "visual artifact"], "abstract": "Producing high-quality stereoscopic 3D content requires significantly more effort than preparing regular video footage. In order to assure good depth perception and visual comfort, 3D videos need to be carefully adjusted to specific viewing conditions before they are shown to viewers. While most stereoscopic 3D content is designed for viewing in movie theaters, where viewing conditions do not vary significantly, adapting the same content for viewing on home TV-sets, desktop displays, laptops, and mobile devices requires additional adjustments. To address this challenge, we propose a new system for 3D video streaming that provides automatic depth adjustments as one of its key features. Our system takes into account both the content and the display type in order to customize 3D videos and maximize their perceived quality. We propose a novel method for depth adjustment that is well-suited for videos of field sports such as soccer, football, and tennis. Our method is computationally efficient and it does not introduce any visual artifacts. We have implemented our 3D streaming system and conducted two user studies, which show: (i) adapting stereoscopic 3D videos for different displays is beneficial, and (ii) our proposed system can achieve up to 35% improvement in the perceived quality of the stereoscopic 3D content.", "citation": "Citations (10)", "departments": ["Simon Fraser University", "Massachusetts Institute of Technology", "Qatar Computing Research Institute", "Simon Fraser University", "Massachusetts Institute of Technology"], "authors": ["Kiana Calagari.....http://dblp.org/pers/hd/c/Calagari:Kiana", "Krzysztof Templin.....http://dblp.org/pers/hd/t/Templin:Krzysztof", "Tarek Elgamal.....http://dblp.org/pers/hd/e/Elgamal:Tarek", "Khaled M. Diab.....http://dblp.org/pers/hd/d/Diab:Khaled_M=", "Piotr Didyk.....http://dblp.org/pers/hd/d/Didyk:Piotr", "Wojciech Matusik.....http://dblp.org/pers/hd/m/Matusik:Wojciech", "Mohamed Hefeeda.....http://dblp.org/pers/hd/h/Hefeeda:Mohamed"], "conf": "mm", "year": "2014", "pages": 10}