{"title": "ASM: A Programmable Interface for Extending Android Security.", "fields": ["android", "access control", "authorization", "extensibility", "applications architecture"], "abstract": "Android, iOS, and Windows 8 are changing the application architecture of consumer operating systems. These new architectures required OS designers to rethink security and access control. While the new security architectures improve on traditional desktop and server OS designs, they lack sufficient protection semantics for different classes of OS customers (e.g., consumer, enterprise, and government). The Android OS in particular has seen over a dozen research proposals for security enhancements. This paper seeks to promote OS security extensibility in the Android OS. We propose the Android Security Modules (ASM) framework, which provides a programmable interface for defining new reference monitors for Android. We drive the ASM design by studying the authorization hook requirements of recent security enhancement proposals and identify that new OSes such as Android require new types of authorization hooks (e.g., replacing data). We describe the design and implementation of ASM and demonstrate its utility by developing reference monitors called ASM apps. Finally, ASM is not only beneficial for security researchers. If adopted by Google, we envision ASM enabling in-the-field security enhancement of Android devices without requiring root access, a significant limitation of existing bring-your-own-device solutions.", "citation": "Citations (101)", "year": "2014", "departments": ["Technische Universität Darmstadt", "North Carolina State University", "North Carolina State University", "Technische Universität Darmstadt"], "conf": "uss", "authors": ["Stephan Heuser.....http://dblp.org/pers/hd/h/Heuser:Stephan", "Adwait Nadkarni.....http://dblp.org/pers/hd/n/Nadkarni:Adwait", "William Enck.....http://dblp.org/pers/hd/e/Enck:William", "Ahmad-Reza Sadeghi.....http://dblp.org/pers/hd/s/Sadeghi:Ahmad=Reza"], "pages": 15}