{"title": "Enabling efficient access control with dynamic policy updating for big data in the cloud.", "fields": ["encryption", "cloud computing", "computation", "big data", "access control"], "abstract": "Due to the high volume and velocity of big data, it is an effective option to store big data in the cloud, because the cloud has capabilities of storing big data and processing high volume of user access requests. Attribute-Based Encryption (ABE) is a promising technique to ensure the end-to-end security of big data in the cloud. However, the policy updating has always been a challenging issue when ABE is used to construct access control schemes. A trivial implementation is to let data owners retrieve the data and re-encrypt it under the new access policy, and then send it back to the cloud. This method incurs a high communication overhead and heavy computation burden on data owners. In this paper, we propose a novel scheme that enabling efficient access control with dynamic policy updating for big data in the cloud. We focus on developing an outsourced policy updating method for ABE systems. Our method can avoid the transmission of encrypted data and minimize the computation work of data owners, by making use of the previously encrypted data with old access policies. Moreover, we also design policy updating algorithms for different types of access policies. The analysis show that our scheme is correct, complete, secure and efficient.", "citation": "Citations (28)", "departments": ["City University of Hong Kong", "City University of Hong Kong", "University at Buffalo", "City University of Hong Kong", "University of Science and Technology of China"], "authors": ["Kan Yang.....http://dblp.org/pers/hd/y/Yang_0001:Kan", "Xiaohua Jia.....http://dblp.org/pers/hd/j/Jia:Xiaohua", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Ruitao Xie.....http://dblp.org/pers/hd/x/Xie:Ruitao", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng"], "conf": "infocom", "year": "2014", "pages": 9}