{"title": "Improving mobile video streaming with link aware scheduling and client caches.", "fields": ["shadow", "mobile broadband", "throughput", "fading", "radio link protocol"], "abstract": "The rapid growth in multimedia traffic is straining mobile networks thus necessitating the need for efficient content delivery mechanisms. In this paper we present the design and analysis of a scheme for streaming non-live, pre-recorded content (e.g. Video on Demand) that opportunistically takes advantage of the \"slow fading\" variations in the wireless link quality. The proposed scheme works by selectively sending more content to sessions at times when they have better link quality while providing sufficient rate guarantees to keep their buffers from under-flowing. We establish analytically that the performance of such scheme is within two times that of any optimal scheme and that it results in throughput gains, per user and aggregate, that increase in proportion to the number of streaming users. Our performance evaluations indicate that by exploiting slow time- varying channels the streaming capacity can more than double with significant benefits to the users at the edge of the cell. I. INTRODUCTION Mobile data traffic has been growing at an exponential rate with traffic volume doubling every year and with some predicting more than 18-fold increase in data traffic in five years (4). As reported in (4), (15) every other bit being carried on mobile networks is now video, a significant portion of which is video on demand (non-interactive, pre-recorded content) with more than 25% coming from Youtube alone. Sustaining a constant high quality experience under wide variations in radio link channel quality due to fading is one of the major challenges for large scale delivery of video over mobile networks. Although considerable research has gone into designing schemes for the effective handling of fast fading, the slow-time variability in the wireless channel (e.g. by shadow fading) has not received the same attention. Simulations show that channel impairments due to slow fading can adversely impact the performance especially for users at the edge of the cell since their average channel quality is already quite low. In this work we directly address these challenges by designing and analyzing schemes that are particularly suited for content delivery under slow fading channels.", "citation": "Citations (10)", "departments": ["Bell Labs", "Bell Labs", "Alcatel-Lucent", "Bell Labs"], "authors": ["Randeep Bhatia.....http://dblp.org/pers/hd/b/Bhatia:Randeep", "T. V. Lakshman.....http://dblp.org/pers/hd/l/Lakshman:T=_V=", "Arun N. Netravali.....http://dblp.org/pers/hd/n/Netravali:Arun_N=", "Krishan K. Sabnani.....http://dblp.org/pers/hd/s/Sabnani:Krishan_K="], "conf": "infocom", "year": "2014", "pages": 9}