{"title": "Durable write cache in flash memory SSD for relational and NoSQL databases.", "fields": ["cache algorithms", "firmware", "atomicity", "nosql", "online transaction processing"], "abstract": "In order to meet the stringent requirements of low latency as well as high throughput, web service providers with large data centers have been replacing magnetic disk drives with flash memory solid-state drives (SSDs). They commonly use relational and NoSQL database engines to manage OLTP workloads in the warehouse-scale computing environments. These modern database engines rely heavily on redundant writes and frequent cache flushes to guarantee the atomicity and durability of transactional updates. This has become a serious bottleneck of performance in both relational and NoSQL database engines. This paper presents a new SSD prototype called DuraSSD equipped with tantalum capacitors. The tantalum capacitors make the device cache inside DuraSSD durable, and additional firmware features of DuraSSD take advantage of the durable cache to support the atomicity and durability of page writes. It is the first time that a flash memory SSD with durable cache has been used to achieve an order of magnitude improvement in transaction throughput without compromising the atomicity and durability. Considering that the simple capacitors increase the total cost of an SSD no more than one percent, DuraSSD clearly provides a cost-effective means for transactional support. DuraSSD is also expected to alleviate the problem of high tail latency by minimizing write stalls.", "citation": "Citations (23)", "year": "2014", "departments": ["Sungkyunkwan University", "Sungkyunkwan University", "Seoul National University", "Samsung", "Samsung"], "conf": "sigmod", "authors": ["Woon-Hak Kang.....http://dblp.org/pers/hd/k/Kang:Woon=Hak", "Sang-Won Lee.....http://dblp.org/pers/hd/l/Lee_0001:Sang=Won", "Bongki Moon.....http://dblp.org/pers/hd/m/Moon:Bongki", "Yang-Suk Kee.....http://dblp.org/pers/hd/k/Kee:Yang=Suk", "Moonwook Oh.....http://dblp.org/pers/hd/o/Oh:Moonwook"], "pages": 12}