{"title": "Montage: Combine frames with movement continuity for realtime multi-user tracking.", "fields": ["tracking system", "distributed computing", "latency", "mobile computing", "computer vision", "snapshot", "multi user", "artificial intelligence"], "abstract": "In this work, we design and develop  Montage  for real-time multi-user formation tracking and localization by off-the-shelf smartphones.  Montage  achieves submeter-level tracking accuracy by integrating temporal and spatial constraints from user  movement vector  estimation and distance measuring. In  Montage , we designed a suite of novel techniques to surmount a variety of challenges in real-time tracking, without infrastructure and fingerprints, and without any a priori user-specific (e.g., stride-length and phone-placement) or site-specific (e.g., digitalized map) knowledge: (1) a coded audio tone to support multi-user tracking with minimal latency, in the presence of high noise, multi-path effect, and Doppler Shift, (2) an innovative stride-length and walking direction estimation method without a priori knowledge of user and site, and (3) a vector-based multi-user tracking scheme which connects successive localization snapshots to refine users’ locations and generate continuous moving traces. We implemented, deployed, and evaluated  Montage   in both outdoor and indoor environment. Our experimental results (847 traces from 15 users) show that the stride-length estimated by  Montage  over all users has error within    $9\\text{\\,cm}$      , and the moving-direction estimated by  Montage  is within   $20$       degrees. For real-time tracking,  Montage  provides meter-second-level formation tracking accuracy with off-the-shelf mobile phones.", "citation": "Citations (17)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Science and Technology of China", "Tsinghua University", "City University of Hong Kong", "University of Science and Technology of China", "Tsinghua University"], "authors": ["Lan Zhang.....http://dblp.org/pers/hd/z/Zhang:Lan", "Kebin Liu.....http://dblp.org/pers/hd/l/Liu:Kebin", "Yonghang Jiang.....http://dblp.org/pers/hd/j/Jiang:Yonghang", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Panlong Yang.....http://dblp.org/pers/hd/y/Yang:Panlong"], "conf": "infocom", "year": "2014", "pages": 9}