{"title": "Verdi: a framework for implementing and formally verifying distributed systems.", "fields": ["raft", "linearizability", "crash", "correctness", "state machine replication"], "abstract": "Distributed systems are difficult to implement correctly because they must handle both concurrency and failures: machines may crash at arbitrary points and networks may reorder, drop, or duplicate packets. Further, their behavior is often too complex to permit exhaustive testing. Bugs in these systems have led to the loss of critical data and unacceptable service outages. We present Verdi, a framework for implementing and formally verifying distributed systems in Coq. Verdi formalizes various network semantics with different faults, and the developer chooses the most appropriate fault model when verifying their implementation. Furthermore, Verdi eases the verification burden by enabling the developer to first verify their system under an idealized fault model, then transfer the resulting correctness guarantees to a more realistic fault model without any additional proof burden. To demonstrate Verdi's utility, we present the first mechanically checked proof of linearizability of the Raft state machine replication algorithm, as well as verified implementations of a primary-backup replication system and a key-value store. These verified systems provide similar performance to unverified equivalents.", "citation": "Citations (108)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["James R. Wilcox.....http://dblp.org/pers/hd/w/Wilcox:James_R=", "Doug Woos.....http://dblp.org/pers/hd/w/Woos:Doug", "Pavel Panchekha.....http://dblp.org/pers/hd/p/Panchekha:Pavel", "Zachary Tatlock.....http://dblp.org/pers/hd/t/Tatlock:Zachary", "Xi Wang.....http://dblp.org/pers/hd/w/Wang:Xi", "Michael D. Ernst.....http://dblp.org/pers/hd/e/Ernst:Michael_D=", "Thomas E. Anderson.....http://dblp.org/pers/hd/a/Anderson:Thomas_E="], "conf": "pldi", "year": "2015", "pages": 12}