{"title": "Unsupervised Latent Aspect Discovery for Diverse Event Summarization.", "fields": ["social media", "data science", "visualization", "mobile device", "automatic summarization"], "abstract": "Recently, the fast growth of social media communities and mobile devices encourages more people to share their media data online than ever before. Analyzing data and summarizing data into useful information have become increasingly popular and important for modern society. Given a set of event keywords and a dataset, this paper performs event summarization, aiming to discover and summarize what people may concern for each event from the given dataset. More specifically, this paper extracts latent sub-events with diverse and representative attributes for each given event. This paper proposes effective methods on detecting events with (1) human attribute discovery, such as human pose and clothes, (2) scene analysis, (3) image aspect discovery, and (4) temporal and semantic analysis, to provide people different perspectives for the events they are interested in. For practical implementation, this paper studied and conducted experiments on YFCC100M, which is a dataset with 100 million of photos and videos, provided by Yahoo!. Finally, a comprehensive and complete system is created accordingly to support diverse event summarization.", "citation": "Citations (1)", "departments": ["National Taiwan ... pei, Taiwan Roc", "National Taiwan ... pei, Taiwan Roc", "National Taiwan ... pei, Taiwan Roc", "National Taiwan ... pei, Taiwan Roc", "National Taiwan ... pei, Taiwan Roc"], "authors": ["Wen-Yu Lee.....http://dblp.org/pers/hd/l/Lee:Wen=Yu", "Yin-Hsi Kuo.....http://dblp.org/pers/hd/k/Kuo:Yin=Hsi", "Peng-Ju Hsieh.....http://dblp.org/pers/hd/h/Hsieh:Peng=Ju", "Wen-Feng Cheng.....http://dblp.org/pers/hd/c/Cheng:Wen=Feng", "Ting-Hsuan Chao.....http://dblp.org/pers/hd/c/Chao:Ting=Hsuan", "Hui-Lan Hsieh.....http://dblp.org/pers/hd/h/Hsieh:Hui=Lan", "Chieh-En Tsai.....http://dblp.org/pers/hd/t/Tsai:Chieh=En", "Hsiao-Ching Chang.....http://dblp.org/pers/hd/c/Chang:Hsiao=Ching", "Jia-Shin Lan.....http://dblp.org/pers/hd/l/Lan:Jia=Shin", "Winston H. Hsu.....http://dblp.org/pers/hd/h/Hsu:Winston_H="], "conf": "mm", "year": "2015", "pages": 4}