{"title": "Feedback Turing Computability, and Turing Computability as Feedback.", "fields": ["turing reduction", "np easy", "description number", "hyperarithmetical theory", "post s theorem"], "abstract": "The notion of a feedback query is a natural generalization of choosing for an oracle the set of indices of halting computations. Notice that, in that setting, the computations being run are different from the computations in the oracle: the former can query an oracle, whereas the latter cannot. A feedback computation is one that can query an oracle, which itself contains the halting information about all feedback computations. Although this is self-referential, sense can be made of at least some such computations. This threatens, though, to obliterate the distinction between con- and divergence: before running a computation, a machine can ask the oracle whether that computation converges, and then run it if and only if the oracle says \"yes.\" This would quickly lead to a diagonalization paradox, except that a new distinction is introduced, this time between freezing and non-freezing computations. The freezing computations are even more extreme than the divergent ones, in that they prevent the dovetailing on all computations into a single run. In this paper, we study feedback around Turing computability. In one direction, we examine feedback Turing machines, and show that they provide exactly hyper arithmetic computability. In the other direction, Turing computability is itself feedback primitive recursion (at least, one version thereof). We also examine parallel feedback. Several different notions of parallelism in this context are identified. We show that parallel feedback Turing machines are strictly stronger than sequential feedback TMs, while in contrast parallel feedback p.r. Is the same as sequential feedback p.r.", "citation": "Citations (2)", "departments": ["Harvard University", "Massachusetts Institute of Technology", "Florida Atlantic University"], "authors": ["Nathanael Leedom Ackerman.....http://dblp.org/pers/hd/a/Ackerman:Nathanael_Leedom", "Cameron E. Freer.....http://dblp.org/pers/hd/f/Freer:Cameron_E=", "Robert S. Lubarsky.....http://dblp.org/pers/hd/l/Lubarsky:Robert_S="], "conf": "lics", "year": "2015", "pages": 12}