{"title": "When hybrid cloud meets flash crowd: Towards cost-effective service provisioning.", "fields": ["response time", "lyapunov optimization", "crowds", "outsourcing", "provisioning"], "abstract": "With rapid development in online shopping, e-commerce websites are facing intensive user requests from an increasing number of customers. Especially in promotion seasons, these websites may encounter flash crowds which pull heavy pressure o private infrastructure and even make he website unavailable. Such severe flash crowds can be addressed by leveraging hybrid cloud solution, which relieves workloads of the private cloud by offloading the excessive user requests to the IaaS public cloud. However, the bursty and fluctuation of flash crowds bring challenges to distributing user requests with targest of delay-minimizing and cost-saving. In his paper, we apply the queueing theory to evaluate the average response time and explore the tradeoff between performance and cost in the hybrid cloud. By taking advantage of Lyapunov optimization techniques, we design an online decision algorithm for request distribution which achieves the average response time arbitrarily close to the theoretically optimum and controls he outsourcing cost based on a given budge. The simulation results demonstrate ha in a hybrid cloud, our solution can reduce he cost of e-commerce services as well as guarantee performance when encountering flash crowds.", "citation": "Citations (15)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Simon Fraser University", "Hong Kong University of Science and Technology"], "authors": ["Yipei Niu.....http://dblp.org/pers/hd/n/Niu:Yipei", "Bin Luo.....http://dblp.org/pers/hd/l/Luo:Bin", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2015", "pages": 9}