{"title": "Beyond Doctors: Future Health Prediction from Multimedia and Multimodal Observations.", "fields": ["observational study", "linear system", "discriminative model", "disease", "modalities"], "abstract": "Although chronic diseases cannot be cured, they can be effectively controlled as long as we understand their progressions based on the current observational health records, which is often in the form of multimedia data. A large and growing body of literature has investigated the disease progression problem. However, far too little attention to date has been paid to jointly consider the following three observations of the chronic disease progression: 1) the health statuses at different time points are chronologically similar; 2) the future health statuses of each patient can be comprehensively revealed from the current multimedia and multimodal observations, such as visual scans, digital measurements and textual medical histories; and 3) the discriminative capabilities of different modalities vary significantly in accordance to specific diseases. In the light of these, we propose an adaptive multimodal multi-task learning model to co-regularize the modality agreement, temporal progression and discriminative capabilities of different modalities. We theoretically show that our proposed model is a linear system. Before training our model, we address the data missing problem via the matrix factorization approach. Extensive evaluations on a real-world Alzheimer's disease dataset well verify our proposed model. It should be noted that our model is also applicable to other chronic diseases.", "citation": "Citations (64)", "departments": ["National University of Singapore", "Hefei University of Technology", "University of Technology, Sydney", "Hefei University of Technology", "Hefei University of Technology"], "authors": ["Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Luming Zhang.....http://dblp.org/pers/hd/z/Zhang:Luming", "Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2015", "pages": 10}