{"title": "Rollback-Recovery for Middleboxes.", "fields": ["network packet", "failover", "rollback", "timeout", "middlebox"], "abstract": "Network middleboxes must offer high availability, with automatic failover when a device fails. Achieving high availability is challenging because failover must correctly restore lost state (e.g., activity logs, port mappings) but must do so quickly (e.g., in less than typical transport timeout values to minimize disruption to applications) and with little overhead to failure-free operation (e.g., additional per-packet latencies of 10-100s of us). No existing middlebox design provides failover that is correct, fast to recover, and imposes little increased latency on failure-free operations. We present a new design for fault-tolerance in middleboxes that achieves these three goals. Our system, FTMB (for Fault-Tolerant MiddleBox), adopts the classical approach of \"rollback recovery\" in which a system uses information logged during normal operation to correctly reconstruct state after a failure. However, traditional rollback recovery cannot maintain high throughput given the frequent output rate of middleboxes. Hence, we design a novel solution to record middlebox state which relies on two mechanisms: (1) 'ordered logging', which provides lightweight logging of the information needed after recovery, and (2) a `parallel release' algorithm which, when coupled with ordered logging, ensures that recovery is always correct. We implement ordered logging and parallel release in Click and show that for our test applications our design adds only 30$\\mu$s of latency to median per packet latencies. Our system introduces moderate throughput overheads (5-30%) and can reconstruct lost state in 40-275ms for practical systems.", "citation": "Citations (76)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of Washington"], "authors": ["Justine Sherry.....http://dblp.org/pers/hd/s/Sherry:Justine", "Peter Xiang Gao.....http://dblp.org/pers/hd/g/Gao:Peter_Xiang", "Soumya Basu.....http://dblp.org/pers/hd/b/Basu:Soumya", "Aurojit Panda.....http://dblp.org/pers/hd/p/Panda:Aurojit", "Arvind Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Arvind", "Christian Maciocco.....http://dblp.org/pers/hd/m/Maciocco:Christian", "Maziar Manesh.....http://dblp.org/pers/hd/m/Manesh:Maziar", "João Martins.....http://dblp.org/pers/hd/m/Martins:Jo=atilde=o", "Sylvia Ratnasamy.....http://dblp.org/pers/hd/r/Ratnasamy:Sylvia", "Luigi Rizzo.....http://dblp.org/pers/hd/r/Rizzo:Luigi", "Scott Shenker.....http://dblp.org/pers/hd/s/Shenker:Scott"], "conf": "sigcomm", "year": "2015", "pages": 14}