{"title": "DeepID-Net: Deformable deep convolutional neural networks for object detection.", "fields": ["deep learning", "object detection", "pooling", "convolutional neural network", "test set"], "abstract": "In this paper, we propose deformable deep convolutional neural networks for generic object detection. This new deep learning object detection framework has innovations in multiple aspects. In the proposed new deep architecture, a new deformation constrained pooling (def-pooling) layer models the deformation of object parts with geometric constraint and penalty. A new pre-training strategy is proposed to learn feature representations more suitable for the object detection task and with good generalization capability. By changing the net structures, training strategies, adding and removing some key components in the detection pipeline, a set of models with large diversity are obtained, which significantly improves the effectiveness of model averaging. The proposed approach improves the mean averaged precision obtained by RCNN [14], which was the state-of-the-art, from 31% to 50.3% on the ILSVRC2014 detection test set. It also outperforms the winner of ILSVRC2014, GoogLeNet, by 6.1%. Detailed component-wise analysis is also provided through extensive experimental evaluation, which provide a global view for people to understand the deep learning object detection pipeline.", "citation": "Citations (241)", "year": "2015", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "conf": "cvpr", "authors": ["Wanli Ouyang.....http://dblp.org/pers/hd/o/Ouyang:Wanli", "Xiaogang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaogang", "Xingyu Zeng.....http://dblp.org/pers/hd/z/Zeng:Xingyu", "Shi Qiu.....http://dblp.org/pers/hd/q/Qiu:Shi", "Ping Luo.....http://dblp.org/pers/hd/l/Luo_0002:Ping", "Yonglong Tian.....http://dblp.org/pers/hd/t/Tian:Yonglong", "Hongsheng Li.....http://dblp.org/pers/hd/l/Li:Hongsheng", "Shuo Yang.....http://dblp.org/pers/hd/y/Yang:Shuo", "Zhe Wang.....http://dblp.org/pers/hd/w/Wang_0006:Zhe", "Chen Change Loy.....http://dblp.org/pers/hd/l/Loy:Chen_Change", "Xiaoou Tang.....http://dblp.org/pers/hd/t/Tang:Xiaoou"], "pages": 10}