{"title": "Scalable SPARQL querying using path partitioning.", "fields": ["rdf query language", "linked data", "rdf", "sparql", "distributed database"], "abstract": "The emerging need for conducting complex analysis over big RDF datasets calls for scale-out solutions that can harness a computing cluster to process big RDF datasets. Queries over RDF data often involve complex self-joins, which would be very expensive to run if the data are not carefully partitioned across the cluster and hence distributed joins over massive amount of data are necessary. Existing RDF data partitioning methods can nicely localize simple queries but still need to resort to expensive distributed joins for more complex queries. In this paper, we propose a new data partitioning approach that takes use of the rich structural information in RDF datasets and minimizes the amount of data that have to be joined across different computing nodes. We conduct an extensive experimental study using two popular RDF benchmark data and one real RDF dataset that contain up to billions of RDF triples. The results indicate that our approach can produce a balanced and low redundant data partitioning scheme that can avoid or largely reduce the cost of distributed joins even for very complicated queries. In terms of query execution time, our approach can outperform the state-of-the-art methods by orders of magnitude.", "citation": "Citations (26)", "departments": ["Huazhong University of Science and Technology", "University of Southern Denmark", "Huazhong University of Science and Technology", "Georgia Institute of Technology", "Huazhong University of Science and Technology"], "authors": ["Buwen Wu.....http://dblp.org/pers/hd/w/Wu:Buwen", "Yongluan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yongluan", "Pingpeng Yuan.....http://dblp.org/pers/hd/y/Yuan:Pingpeng", "Ling Liu.....http://dblp.org/pers/hd/l/Liu_0001:Ling", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai"], "conf": "icde", "year": "2015", "pages": 12}