{"title": "Agile virtualized infrastructure to proactively defend against cyber attacks.", "fields": ["agile software development", "adversary", "application layer ddos attack", "resource", "planetlab"], "abstract": "DDoS attacks have been a persistent threat to network availability for many years. Most of the existing mitigation techniques attempt to protect against DDoS by filtering out attack traffic. However, as critical network resources are usually static, adversaries are able to bypass filtering by sending stealthy low traffic from large number of bots that mimic benign traffic behavior. Sophisticated stealthy attacks on critical links can cause a devastating effect such as partitioning domains and networks. In this paper, we propose to defend against DDoS attacks by proactively changing the footprint of critical resources in an unpredictable fashion to invalidate an adversary's knowledge and plan of attack against critical network resources. Our present approach employs virtual networks (VNs) to dynamically reallocate network resources using VN placement and offers constant VN migration to new resources. Our approach has two components: (1) a correct-by-construction VN migration planning that significantly increases the uncertainty about critical links of multiple VNs while preserving the VN placement properties, and (2) an efficient VN migration mechanism that identifies the appropriate configuration sequence to enable node migration while maintaining the network integrity (e.g., avoiding session disconnection). We formulate and implement this framework using SMT logic. We also demonstrate the effectiveness of our implemented framework on both PlanetLab and Mininet-based experimentations.", "citation": "Citations (14)", "departments": ["University of North Carolina at Charlotte", "University of North Carolina at Charlotte", "Georgia Institute of Technology", "University of North Carolina at Charlotte", "Georgia Institute of Technology"], "authors": ["Fida Gillani.....http://dblp.org/pers/hd/g/Gillani:Fida", "Ehab Al-Shaer.....http://dblp.org/pers/hd/a/Al=Shaer:Ehab", "Samantha Lo.....http://dblp.org/pers/hd/l/Lo:Samantha", "Qi Duan.....http://dblp.org/pers/hd/d/Duan:Qi", "Mostafa H. Ammar.....http://dblp.org/pers/hd/a/Ammar:Mostafa_H=", "Ellen W. Zegura.....http://dblp.org/pers/hd/z/Zegura:Ellen_W="], "conf": "infocom", "year": "2015", "pages": 9}