{"title": "Scalable Machine Learning Approaches for Neighborhood Classification Using Very High Resolution Remote Sensing Imagery.", "fields": ["homogeneous", "change detection", "scalability", "laplacian matrix", "histogram"], "abstract": "Urban neighborhood classification using very high resolution (VHR) remote sensing imagery is a challenging and {\\em emerging} application. A semi-supervised learning approach for identifying neighborhoods is presented which employs superpixel tessellation representations of VHR imagery. The image representation utilizes homogeneous and irregularly shaped regions termed superpixels and derives novel features based on intensity histograms, geometry, corner and superpixel density and scale of tessellation. The semi-supervised learning approach uses a support vector machine (SVM) to obtain a preliminary classification which is then subsequently refined using graph Laplacian propagation. Several intermediate stages in the pipeline are presented to showcase the important features of this approach. We evaluated this approach on four different geographic settings with varying neighborhood types and compared it with the recent Gaussian Multiple Learning algorithm. This evaluation shows several advantages, including model building, accuracy, and efficiency which makes it a great choice for deployment in large scale applications like global human settlement mapping and population distribution (e.g., LandScan), and change detection.", "citation": "Citations (2)", "departments": ["University of Florida", "University of Florida", "University of Florida", "North Carolina State University", "University of Florida"], "authors": ["Manu Sethi.....http://dblp.org/pers/hd/s/Sethi:Manu", "Yupeng Yan.....http://dblp.org/pers/hd/y/Yan:Yupeng", "Anand Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan_0001:Anand", "Ranga Raju Vatsavai.....http://dblp.org/pers/hd/v/Vatsavai:Ranga_Raju", "Sanjay Ranka.....http://dblp.org/pers/hd/r/Ranka:Sanjay"], "conf": "kdd", "year": "2015", "pages": 10}