{"title": "Holistic Indexing in Main-memory Column-stores.", "fields": ["physical design", "idle", "instruction cycle", "exploit", "cpu power dissipation"], "abstract": "Great database systems performance relies heavily on index tuning, i.e., creating and utilizing the best indices depending on the workload. However, the complexity of the index tuning process has dramatically increased in recent years due to ad-hoc workloads and shortage of time and system resources to invest in tuning.   This paper introduces  holistic indexing , a new approach to automated index tuning in dynamic environments. Holistic indexing requires zero set-up and tuning effort, relying on adaptive index creation as a side-effect of query processing. Indices are created incrementally and partially;they are continuously refined as we process more and more queries. Holistic indexing takes the state-of-the-art adaptive indexing ideas a big step further by introducing the notion of a system which never stops refining the index space, taking educated decisions about which index we should incrementally refine next based on continuous knowledge acquisition about the running workload and resource utilization. When the system detects idle CPU cycles, it utilizes those extra cycles by refining the adaptive indices which are most likely to bring a benefit for future queries. Such idle CPU cycles occur when the system cannot exploit all available cores up to 100%, i.e., either because the workload is not enough to saturate the CPUs or because the current tasks performed for query processing are not easy to parallelize to the point where all available CPU power is exploited.   In this paper, we present the design of holistic indexing for column-oriented database architectures and we discuss a detailed analysis against parallel versions of state-of-the-art indexing and adaptive indexing approaches. Holistic indexing is implemented in an open-source column-store DBMS. Our detailed experiments on both synthetic and standard benchmarks (TPC-H) and workloads (SkyServer) demonstrate that holistic indexing brings significant performance gains by being able to continuously refine the physical design in parallel to query processing, exploiting any idle CPU resources.", "citation": "Citations (11)", "year": "2015", "departments": ["Harvard University", "CWI, Amsterdam, Netherlands", "CWI, Amsterdam, Netherlands"], "conf": "sigmod", "authors": ["Eleni Petraki.....http://dblp.org/pers/hd/p/Petraki:Eleni", "Stratos Idreos.....http://dblp.org/pers/hd/i/Idreos:Stratos", "Stefan Manegold.....http://dblp.org/pers/hd/m/Manegold:Stefan"], "pages": 14}