{"title": "Need for speed: CORA scheduler for optimizing completion-times in the cloud.", "fields": ["performance improvement", "cloud computing", "resource allocation", "integer programming", "job scheduler"], "abstract": "There is an increasing need for cloud service performance that can be tailored to customer requirements. In the context of jobs submitted to cloud computing clusters, a crucial requirement is the specification of job completion-times. A natural way to model this specification, is through client/job utility functions that are dependent on job completion-times. We present a method to allocate and schedule heterogeneous resources to jointly optimize the utilities of jobs in a cloud. Specifically: (i) we formulate a completion-time optimal resource allocation (CORA) problem to apportion cluster resources across the jobs that enforces max-min fairness among job utilities, and (ii) starting with an integer programming problem, we perform a series of steps to transform it into an equivalent linear programming problem, and (iii) we implement the proposed framework as a utility-aware resource scheduler in the widely used Hadoop data processing framework, and finally (iv) through extensive experiments with real-world datasets, we show that our prototype achieves significant performance improvement over existing resource-allocation policies.", "citation": "Citations (12)", "departments": ["Hong Kong University of Science and Technology", "Princeton University", "Princeton University", "George Washington University", "Princeton University"], "authors": ["Zhe Huang.....http://dblp.org/pers/hd/h/Huang:Zhe", "Bharath Balasubramanian.....http://dblp.org/pers/hd/b/Balasubramanian:Bharath", "Michael Wang.....http://dblp.org/pers/hd/w/Wang_0002:Michael", "Tian Lan.....http://dblp.org/pers/hd/l/Lan:Tian", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung", "Danny H. K. Tsang.....http://dblp.org/pers/hd/t/Tsang:Danny_H=_K="], "conf": "infocom", "year": "2015", "pages": 9}