{"title": "Massively parallel phase-field simulations for ternary eutectic directional solidification.", "fields": ["eutectic system", "supercomputer", "directional solidification", "massively parallel", "ternary operation"], "abstract": "Microstructures forming during ternary eutectic directional solidification processes have significant influence on the macroscopic mechanical properties of metal alloys. For a realistic simulation, we use the well established thermodynamically consistent phase-field method and improve it with a new grand potential formulation to couple the concentration evolution. This extension is very compute intensive due to a temperature dependent diffusive concentration. We significantly extend previous simulations that have used simpler phase-field models or were performed on smaller domain sizes. The new method has been implemented within the massively parallel HPC framework waLBerla that is designed to exploit current supercomputers efficiently. We apply various optimization techniques, including buffering techniques, explicit SIMD kernel vectorization, and communication hiding. Simulations utilizing up to 262,144 cores have been run on three different supercomputing architectures and weak scalability results are shown. Additionally, a hierarchical, mesh-based data reduction strategy is developed to keep the I/O problem manageable at scale.", "citation": "Citations (15)", "year": "2015", "departments": ["University of Erlangen-Nuremberg", "Karlsruhe University of Applied Sciences", "Karlsruhe University of Applied Sciences", "Karlsruhe University of Applied Sciences", "Karlsruhe University of Applied Sciences"], "conf": "sc", "authors": ["Martin Bauer.....http://dblp.org/pers/hd/b/Bauer_0003:Martin", "Johannes Hötzer.....http://dblp.org/pers/hd/h/H=ouml=tzer:Johannes", "Marcus Jainta.....http://dblp.org/pers/hd/j/Jainta:Marcus", "Philipp Steinmetz.....http://dblp.org/pers/hd/s/Steinmetz:Philipp", "Marco Berghoff.....http://dblp.org/pers/hd/b/Berghoff:Marco", "Florian Schornbaum.....http://dblp.org/pers/hd/s/Schornbaum:Florian", "Christian Godenschwager.....http://dblp.org/pers/hd/g/Godenschwager:Christian", "Harald Köstler.....http://dblp.org/pers/hd/k/K=ouml=stler:Harald", "Britta Nestler.....http://dblp.org/pers/hd/n/Nestler:Britta", "Ulrich Rüde.....http://dblp.org/pers/hd/r/R=uuml=de:Ulrich"], "pages": 12}