{"title": "Price of fairness for opportunistic and priority schedulers.", "fields": ["quality of service", "upper and lower bounds", "computer network", "fair queuing", "constrained optimization"], "abstract": "1 When agents compete for common resource and when the utilities derived by them, upon allocation, are independent across the agents and time slots, an opportunistic scheduler is used. The instantaneous utility of one agent can be low, however few among many would have ‘good’ utility with high probability. Opportunistic schedulers utilize these opportunities, allocate resource at any time to a ‘good’ agent. Efficient schedulers maximize the sum of accumulated utilities. Thus, every time ‘best’ agent is allocated. This can result in negligible (unfair) accumulations for some agents, whose instantaneous utilities are ‘low’ with high probability. Fair opportunistic schedulers are thus introduced (e.g., alpha-fair schedulers). We study their price of fairness (PoF). We group the agents into finite classes, each class having identical utilities and QoS requirements. We study the asymptotic PoF as agents increase, while maintaining class-wise proportions constant. Asymptotic PoF is less than one, depends only upon the differences in the largest utilities of individual classes and is less than the maximum such normalized differences. The PoF is zero initially and increases with increase in fairness requirements to an upper bound strictly less than one. We observe that the fair schedulers are essentially priority schedulers, which facilitated easy analysis of PoF.", "citation": "Not cited", "departments": ["Indian Institute of Technology Bombay", "Indian Institute of Technology Bombay", "Indian Institute of Technology Bombay"], "authors": ["Malhar Mehta.....http://dblp.org/pers/hd/m/Mehta:Malhar", "Veeraruna Kavitha.....http://dblp.org/pers/hd/k/Kavitha:Veeraruna", "N. Hemachandra.....http://dblp.org/pers/hd/h/Hemachandra:N="], "conf": "infocom", "year": "2015", "pages": 9}