{"title": "Robust Subspace Clustering via Thresholding Ridge Regression.", "fields": ["k medians clustering", "cure data clustering algorithm", "canopy clustering algorithm", "data stream clustering", "flame clustering"], "abstract": "Given a data set from a union of multiple linear sub-spaces, a robust subspace clustering algorithm fits each group of data points with a low-dimensional subspace and then clusters these data even though they are grossly corrupted or sampled from the union of dependent sub-spaces. Under the framework of spectral clustering, recent works using sparse representation, low rank representation and their extensions achieve robust clustering results by formulating the errors (e.g., corruptions) into their objective functions so that the errors can be removed from the inputs. However, these approaches have suffered from the limitation that the structure of the errors should be known as the prior knowledge. In this paper, we present a new method of robust sub-space clustering by eliminating the effect of the errors from the projection space (representation) rather than from the input space. We firstly prove that l1-, l2-, and l∞ -norm-based linear projection spaces share the property of intra-subspace projection dominance, i.e., the coefficients over intra-subspace data points are larger than those over inter-subspace data points. Based on this property, we propose a robust and efficient sub-space clustering algorithm, called Thresholding Ridge Regression (TRR). TRR calculates the ∞2 -norm-based coefficients of a given data set and performs a hard thresholding operator; and then the coefficients are used to build a similarity graph for clustering. Experimental studies show that TRR outperforms the state-of-the-art methods with respect to clustering quality, robustness, and time-saving.", "citation": "Citations (58)", "departments": ["Agency for Science, Technology and Research", "Sichuan University", "Agency for Science, Technology and Research"], "authors": ["Xi Peng.....http://dblp.org/pers/hd/p/Peng_0001:Xi", "Zhang Yi.....http://dblp.org/pers/hd/y/Yi_0001:Zhang", "Huajin Tang.....http://dblp.org/pers/hd/t/Tang:Huajin"], "conf": "aaai", "year": "2015", "pages": 7}