{"title": "A Faster Cutting Plane Method and its Implications for Combinatorial and Convex Optimization.", "fields": ["convex function", "matrix multiplication", "matroid intersection", "absolute value", "convex set"], "abstract": "In this paper we improve upon the running time for finding a point in a convex set given a separation oracle. In particular, given a separation oracle for a convex set K a#x2282; Rn that is contained in a box of radius R we show how to either compute a point in K or prove that K does not contain a ball of radius a#x03B5; using an expected O(n log(nR=a#x03B5;)) evaluations of the oracle and additional time O(n3 logO(1)(nR=a#x03B5;)). This matches the oracle complexity and improves upon the O(na#x03C9;+1 log(nR=a#x03B5;)) additional time of the previous fastest algorithm achieved over 25 years ago by Vaidya [91] for the current value of the matrix multiplication constant a#x03C9; < 2:373 [98], [36] when R=a#x03B5; = O(poly(n)). Using a mix of standard reductions and new techniques we show how our algorithm can be used to improve the running time for solving classic problems in continuous and combinatorial optimization. In particular we provide the following running time improvements: a#x03B5; Sub modular Function Minimization: n is the size of the ground set, M is the maximum absolute value of function values and EO is the time for function evaluation. Our weakly and strongly polynomial time algorithms have a running time of O(n2 lognM EO+n3 logO(1) nM) and O(n3 log2 n EO+n4 logO(1) n), improving upon the previous best of O((n4 · EO+n5) logM) and O(n5 · EO + n6) respectively. a#x03B5; Sub modular Flow: n = |V|, m = |E|, C is the maximum edge cost in absolute value and U is maximum edge capacity in absolute value. We obtain a faster weakly polynomial running time of O(n2 log nCU · EO + n3 logO(1) nCU), improving upon the previous best of O(mn5 log nU · EO) and O(n4h min {log C, log U}) from 15 years ago by a factor of O(n4). We also achieve faster strongly polynomial time algorithms as a consequence of our result on sub modular minimization. a#x03B5; Matroid Intersection: n is the size of the ground set, r is the maximum size of independent sets, M is the maximum absolute value of element weight, Trank and Tind are the time for each rank and independence oracle query. We obtain a running time of O((nr log2 nTrank+n3 logO(1) n) lognM) and O((n2 log nTind+n3 logO(1) n) lognM), achieving the first quadratic bound on the query complexity for the independence and rank oracles. In the unweighted case, this is the first improvement since 1986 for independence oracle. a#x03B5; Semi definite Programming: n is the number of constraints, m is the number of dimensions and S is the total number of non-zeros in the constraint matrices. We obtain a running time of O(n(n2 +ma#x03C9; +S)), improving upon the previous best of O(n(na#x03C9; +ma#x03C9; +S)) for the regime S is small.", "citation": "Citations (74)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "University of California, Berkeley"], "authors": ["Yin Tat Lee.....http://dblp.org/pers/hd/l/Lee:Yin_Tat", "Aaron Sidford.....http://dblp.org/pers/hd/s/Sidford:Aaron", "Sam Chiu-wai Wong.....http://dblp.org/pers/hd/w/Wong:Sam_Chiu=wai"], "conf": "focs", "year": "2015", "pages": 17}