{"title": "Reliable multicast routing for software-defined networks.", "fields": ["distance vector multicast routing protocol", "xcast", "ip multicast", "reliable multicast", "pragmatic general multicast"], "abstract": "Current traffic engineering in SDN mostly focuses on unicast. By contrast, compared with individual unicast, multicast can effectively reduce network resources consumption to serve multiple clients jointly. Since many important applications require reliable transmissions, it is envisaged that reliable multicast plays a crucial role when an SDN operator plans to provide multicast services. However, the shortest-path tree (SPT) adopted in current Internet is not bandwidth-efficient, while the Steiner tree (ST) in Graph Theory is not designed to support reliable transmissions since the selection of recovery nodes is not examined. In this paper, therefore, we propose a new reliable multicast tree for SDN, named Recover-aware Steiner Tree (RST). The goal of RST is to minimize both tree and recovery costs, while finding an RST is very challenging. We prove that the RST problem is NP-Hard and inapproximable within k, which is the number of destination nodes. Thus, we design an approximate algorithm, called Recover Aware Edge Reduction Algorithm (RAERA), to solve the problem. The simulation results on real networks and large synthetic networks, together with the experiment on our SDN testbed with real YouTube traffic, all manifest that RST outperforms both SPT and ST. Also, the implementation of RAERA in SDN controllers shows that an RST can be returned within a few seconds and thereby is practical for SDN networks.", "citation": "Citations (17)", "departments": ["Academia Sinica", "Academia Sinica", "Academia Sinica", "Academia Sinica"], "authors": ["Shan-Hsiang Shen.....http://dblp.org/pers/hd/s/Shen:Shan=Hsiang", "Liang-Hao Huang.....http://dblp.org/pers/hd/h/Huang:Liang=Hao", "De-Nian Yang.....http://dblp.org/pers/hd/y/Yang:De=Nian", "Wen-Tsuen Chen.....http://dblp.org/pers/hd/c/Chen:Wen=Tsuen"], "conf": "infocom", "year": "2015", "pages": 9}