{"title": "A case for core-assisted bottleneck acceleration in GPUs: enabling flexible data compression with assist warps.", "fields": ["memory bandwidth", "memory hierarchy", "idle", "thread", "speedup"], "abstract": "Modern Graphics Processing Units (GPUs) are well provisioned to support the concurrent execution of thousands of threads. Unfortunately, different bottlenecks during execution and heterogeneous application requirements create imbalances in utilization of resources in the cores. For example, when a GPU is bottlenecked by the available off-chip memory bandwidth, its computational resources are often overwhelmingly idle, waiting for data from memory to arrive.   This paper introduces the Core-Assisted Bottleneck Acceleration (CABA) framework that employs idle on-chip resources to alleviate different bottlenecks in GPU execution. CABA provides flexible mechanisms to automatically generate \"assist warps\" that execute on GPU cores to perform specific tasks that can improve GPU performance and efficiency.   CABA enables the use of idle computational units and pipelines to alleviate the memory bandwidth bottleneck, e.g., by using assist warps to perform data compression to transfer less data from memory. Conversely, the same framework can be employed to handle cases where the GPU is bottlenecked by the available computational units, in which case the memory pipelines are idle and can be used by CABA to speed up computation, e.g., by performing memoization using assist warps.   We provide a comprehensive design and evaluation of CABA to perform effective and flexible data compression in the GPU memory hierarchy to alleviate the memory bandwidth bottleneck. Our extensive evaluations show that CABA, when used to implement data compression, provides an average performance improvement of 41.7% (as high as 2.6X) across a variety of memory-bandwidth-sensitive GPGPU applications.", "citation": "Citations (59)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Pennsylvania State University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Nandita Vijaykumar.....http://dblp.org/pers/hd/v/Vijaykumar:Nandita", "Gennady Pekhimenko.....http://dblp.org/pers/hd/p/Pekhimenko:Gennady", "Adwait Jog.....http://dblp.org/pers/hd/j/Jog:Adwait", "Abhishek Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick_0002:Abhishek", "Rachata Ausavarungnirun.....http://dblp.org/pers/hd/a/Ausavarungnirun:Rachata", "Chita R. Das.....http://dblp.org/pers/hd/d/Das:Chita_R=", "Mahmut T. Kandemir.....http://dblp.org/pers/hd/k/Kandemir:Mahmut_T=", "Todd C. Mowry.....http://dblp.org/pers/hd/m/Mowry:Todd_C=", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur"], "conf": "isca", "year": "2015", "pages": 13}