{"title": "The Pythia PRF Service.", "fields": ["verifiable secret sharing", "pseudorandom function family", "computer architecture", "cryptographic primitive", "computer science", "password", "hash based message authentication code"], "abstract": "Conventional cryptographic services such as hardware-security modules and software-based key-management systems offer the ability to apply a pseudorandom function (PRF) such as HMAC to inputs of a client's choosing. These services are used, for example, to harden stored password hashes against offline brute-force attacks.\n\nWe propose a modern PRF service called PYTHIA designed to offer a level of flexibility, security, and ease-of-deployability lacking in prior approaches. The keystone of PYTHIA is a new cryptographic primitive called a verifiable partially-oblivious PRF that reveals a portion of an input message to the service but hides the rest. We give a construction that additionally supports efficient bulk rotation of previously obtained PRF values to new keys. Performance measurements show that our construction, which relies on bilinear pairings and zero-knowledge proofs, is highly practical. We also give accompanying formal definitions and proofs of security.\n\nWe implement PYTHIA as a multi-tenant, scalable PRF service that can scale up to hundreds of millions of distinct client applications on commodity systems. In our prototype implementation, query latencies are 15 ms in local-area settings and throughput is within a factor of two of a standard HTTPS server. We further report on implementations of two applications using PYTHIA, showing how to bring its security benefits to a new enterprise password storage system and a new brainwallet system for Bitcoin.", "citation": "Not cited", "year": "2015", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "Royal Holloway, University of London", "Cornell University", "Cornell University"], "conf": "uss", "authors": ["Adam Everspaugh.....http://dblp.org/pers/hd/e/Everspaugh:Adam", "Rahul Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Rahul", "Samuel Scott.....http://dblp.org/pers/hd/s/Scott:Samuel", "Ari Juels.....http://dblp.org/pers/hd/j/Juels:Ari", "Thomas Ristenpart.....http://dblp.org/pers/hd/r/Ristenpart:Thomas"], "pages": 16}