{"title": "Helium: lifting high-performance stencil kernels from stripped x86 binaries to halide DSL code.", "fields": ["software rot", "stencil", "memory address", "x86", "stencil code"], "abstract": "Highly optimized programs are prone to bit rot, where performance quickly becomes suboptimal in the face of new hardware and compiler techniques. In this paper we show how to automatically lift performance-critical stencil kernels from a stripped x86 binary and generate the corresponding code in the high-level domain-specific language Halide. Using Halide’s state-of-the-art optimizations targeting current hardware, we show that new optimized versions of these kernels can replace the originals to rejuvenate the application for newer hardware. The original optimized code for kernels in stripped binaries is nearly impossible to analyze statically. Instead, we rely on dynamic traces to regenerate the kernels. We perform buffer structure reconstruction to identify input, intermediate and output buffer shapes. We abstract from a forest of concrete dependency trees which contain absolute memory addresses to symbolic trees suitable for high-level code generation. This is done by canonicalizing trees, clustering them based on structure, inferring higher-dimensional buffer accesses and finally by solving a set of linear equations based on buffer accesses to lift them up to simple, high-level expressions. Helium can handle highly optimized, complex stencil kernels with input-dependent conditionals. We lift seven kernels from Adobe Photoshop giving a 75% performance improvement, four kernels from IrfanView, leading to 4.97× performance, and one stencil from the miniGMG multigrid benchmark netting a 4.25× improvement in performance. We manually rejuvenated Photoshop by replacing eleven of Photoshop’s filters with our lifted implementations, giving 1.12× speedup without affecting the user experience.", "citation": "Citations (6)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Stanford University"], "authors": ["Charith Mendis.....http://dblp.org/pers/hd/m/Mendis:Charith", "Jeffrey Bosboom.....http://dblp.org/pers/hd/b/Bosboom:Jeffrey", "Kevin Wu.....http://dblp.org/pers/hd/w/Wu:Kevin", "Shoaib Kamil.....http://dblp.org/pers/hd/k/Kamil:Shoaib", "Jonathan Ragan-Kelley.....http://dblp.org/pers/hd/r/Ragan=Kelley:Jonathan", "Sylvain Paris.....http://dblp.org/pers/hd/p/Paris:Sylvain", "Qin Zhao.....http://dblp.org/pers/hd/z/Zhao:Qin", "Saman P. Amarasinghe.....http://dblp.org/pers/hd/a/Amarasinghe:Saman_P="], "conf": "pldi", "year": "2015", "pages": 12}