{"title": "Accelerating Dynamic Time Warping Clustering with a Novel Admissible Pruning Strategy.", "fields": ["correlation clustering", "constrained clustering", "canopy clustering algorithm", "data stream clustering", "cure data clustering algorithm"], "abstract": "Clustering time series is a useful operation in its own right, and an important subroutine in many higher-level data mining analyses, including data editing for classifiers, summarization, and outlier detection. While it has been noted that the general superiority of Dynamic Time Warping (DTW) over Euclidean Distance for  similarity search  diminishes as we consider ever larger datasets, as we shall show, the same is not true for  clustering . Thus, clustering time series under DTW remains a computationally challenging task. In this work, we address this lethargy in two ways. We propose a novel pruning strategy that exploits both upper and lower bounds to prune off a large fraction of the expensive distance calculations. This pruning strategy is admissible; giving us provably identical results to the brute force algorithm, but is at least an order of magnitude faster. For datasets where even this level of speedup is inadequate, we show that we can use a simple heuristic to order the unavoidable calculations in a  most-useful-first  ordering, thus casting the clustering as an anytime algorithm. We demonstrate the utility of our ideas with both single and multidimensional case studies in the domains of astronomy, speech physiology, medicine and entomology.", "citation": "Citations (54)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of Texas at Dallas", "University of California, Riverside"], "authors": ["Nurjahan Begum.....http://dblp.org/pers/hd/b/Begum:Nurjahan", "Liudmila Ulanova.....http://dblp.org/pers/hd/u/Ulanova:Liudmila", "Jun Wang.....http://dblp.org/pers/hd/w/Wang:Jun", "Eamonn J. Keogh.....http://dblp.org/pers/hd/k/Keogh:Eamonn_J="], "conf": "kdd", "year": "2015", "pages": 10}