{"title": "Enabling End-Host Network Functions.", "fields": ["network management station", "host", "intelligent computer network", "network traffic control", "network simulation"], "abstract": "Many network functions executed in modern datacenters, e.g., load balancing, application-level QoS, and congestion control, exhibit three common properties at the data-plane: they need to access and modify state, to perform computations, and to access application semantics -- this is critical since many network functions are best expressed in terms of application-level messages. In this paper, we argue that the end hosts are a natural enforcement point for these functions and we present Eden, an architecture for implementing network functions at datacenter end hosts with minimal network support. Eden comprises three components, a centralized controller, an enclave at each end host, and Eden-compliant applications called stages. To implement network functions, the controller configures stages to classify their data into messages and the enclaves to apply action functions based on a packet's class. Our Eden prototype includes enclaves implemented both in the OS kernel and on programmable NICs. Through case studies, we show how application-level classification and the ability to run actual programs on the data-path allows Eden to efficiently support a broad range of network functions at the network's edge.", "citation": "Citations (24)", "departments": ["Microsoft", "Microsoft", "Microsoft", "University of Cambridge", "Microsoft"], "authors": ["Hitesh Ballani.....http://dblp.org/pers/hd/b/Ballani:Hitesh", "Paolo Costa.....http://dblp.org/pers/hd/c/Costa:Paolo", "Christos Gkantsidis.....http://dblp.org/pers/hd/g/Gkantsidis:Christos", "Matthew P. Grosvenor.....http://dblp.org/pers/hd/g/Grosvenor:Matthew_P=", "Thomas Karagiannis.....http://dblp.org/pers/hd/k/Karagiannis:Thomas", "Lazaros Koromilas.....http://dblp.org/pers/hd/k/Koromilas:Lazaros", "Greg O'Shea.....http://dblp.org/pers/hd/o/O=Shea:Greg"], "conf": "sigcomm", "year": "2015", "pages": 15}