{"title": "A location-aware publish/subscribe framework for parameterized spatio-textual subscriptions.", "fields": ["popularity", "mobile telephony", "parameterized complexity", "spatial analysis", "publication"], "abstract": "With the rapid progress of mobile Internet and the growing popularity of smartphones, location-aware publish/subscribe systems have recently attracted significant attention. Different from traditional content-based publish/subscribe, subscriptions registered by subscribers and messages published by publishers include both spatial information and textual descriptions, and messages should be delivered to relevant subscribers whose subscriptions have high relevancy to the messages. To evaluate the relevancy between spatio-textual messages and subscriptions, we should combine the spatial proximity and textual relevancy. Since subscribers have different preferences - some subscribers prefer messages with high spatial proximity and some subscribers pay more attention to messages with high textual relevancy, it calls for new location-aware publish/subscribe techniques to meet various needs from different subscribers. In this paper, we allow subscribers to parameterize their subscriptions and study the location-aware publish/subscribe problem on parameterized spatio-textual subscriptions. One big challenge is to achieve high performance. To meet this requirement, we propose a filter-verification framework to efficiently deliver messages to relevant subscribers. In the filter step, we devise effective filters to prune large numbers of irreverent results and obtain some candidates. In the verification step, we verify the candidates to generate the answers. We propose three effective filters by integrating prefix filtering and spatial pruning techniques. Experimental results show our method achieves higher performance and better quality than baseline approaches.", "citation": "Citations (25)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "National University of Singapore"], "authors": ["Huiqi Hu.....http://dblp.org/pers/hd/h/Hu:Huiqi", "Yiqun Liu.....http://dblp.org/pers/hd/l/Liu:Yiqun", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Jianhua Feng.....http://dblp.org/pers/hd/f/Feng:Jianhua", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee"], "conf": "icde", "year": "2015", "pages": 12}