{"title": "A Flexible and Non-intrusive Approach for Computing Complex Structural Coverage Metrics.", "fields": ["linear code sequence and jump", "modified condition decision coverage", "kpi driven code analysis", "code review", "instrumentation"], "abstract": "Software analysis tools and techniques often leverage structural code coverage information to reason about the dynamic behavior of software. Existing techniques instrument the code with the required structural obligations and then monitor the execution of the compiled code to report coverage. Instrumentation based approaches often incur considerable runtime overhead for complex structural coverage metrics such as Modified Condition/Decision (MC/DC). Code instrumentation, in general, has to be approached with great care to ensure it does not modify the behavior of the original code. Furthermore, instrumented code cannot be used in conjunction with other analyses that reason about the structure and semantics of the code under test.   In this work, we introduce a  non-intrusive  preprocessing approach for computing structural coverage information. It uses a static partial evaluation of the decisions in the source code and a source-to-bytecode mapping to generate the information necessary to efficiently track structural coverage metrics during execution. Our technique is  flexible;  the results of the preprocessing can be used by a variety of coverage-driven software analysis tasks, including automated analyses that are not possible for instrumented code. Experimental results in the context of symbolic execution show the efficiency and flexibility of our non-intrusive approach for computing code coverage information.", "citation": "Citations (4)", "departments": ["University of Minnesota", "Langley Research Center", "Ames Research Center", "Google", "University of St Andrews"], "authors": ["Michael W. Whalen.....http://dblp.org/pers/hd/w/Whalen:Michael_W=", "Suzette Person.....http://dblp.org/pers/hd/p/Person:Suzette", "Neha Rungta.....http://dblp.org/pers/hd/r/Rungta:Neha", "Matt Staats.....http://dblp.org/pers/hd/s/Staats:Matt", "Daniela Grijincu.....http://dblp.org/pers/hd/g/Grijincu:Daniela"], "conf": "icse", "year": "2015", "pages": 11}