{"title": "A new paradigm for multiflow in wireless networks: Theory and applications.", "fields": ["polynomial", "approximation algorithm", "wireless network", "linear programming", "theoretical computer science"], "abstract": "Multiflow problems are one of the most fundamental problems in both wired networks and wireless networks. Due to the cross-layer nature, multiflow problems in wireless networks are significantly harder than their counterparts in wired networks and have received much research interest over the past decade. Common to most other early-staged research, the characterization of computational hardness and the “war” on achievable approximation bounds have been the priority to the existing studies of multiflow problems in wireless networks while their practical feasibility in both running time and memory requirement is ignored as long they are polynomial. In fact, almost all of the state-of-the-art approximation algorithms for multiflow problems in wireless networks are all resorted to the traditional linear programming (LP) methods exclusively. However, those traditional LP methods can require an inordinate amount of running time and memory even for a moderate sized input, and consequently they often prove unusable in practice. This paper presents a completely new paradigm for multiflow problems in general wireless networks which is radically different from the prevailing LP-based paradigm, and develops practical algorithmic solutions which are much faster and simpler.", "citation": "Citations (1)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Dalian University of Technology", "Nanjing University of Information Science and Technology", "Georgetown University"], "authors": ["Peng-Jun Wan.....http://dblp.org/pers/hd/w/Wan:Peng=Jun", "Boliu Xu.....http://dblp.org/pers/hd/x/Xu:Boliu", "Lei Wang.....http://dblp.org/pers/hd/w/Wang:Lei", "Sai Ji.....http://dblp.org/pers/hd/j/Ji:Sai", "Ophir Frieder.....http://dblp.org/pers/hd/f/Frieder:Ophir"], "conf": "infocom", "year": "2015", "pages": 9}