{"title": "Joint sensing task and subband allocation for large-scale spectrum profiling.", "fields": ["rounding", "narrowband", "special case", "maximization", "profiling"], "abstract": "While most of existing efforts for dynamic spectrum access have focused on spectrum sensing of a narrowband band in a given region, this paper takes a holistic perspective to determine the usage profile of wide spectrum bands over a large geographic region. Specifically, a mobile crowdsensing approach is taken to develop a spectrum-profiling framework, which leverages the wisdom of many mobile devices to accomplish large-scale sensing tasks. A key step for spectrum profiling via mobile crowdsensing is to strategically assign sensing tasks to mobile users, so as to maximize the utility of the sensing data acquired. We cast this problem as a joint sensing task and subband allocation problem for utility maximization, capturing the location-specific characteristics of spectrum sensing. Since the problem is NP-hard, we design approximation algorithms. First, we design a greedy approximation algorithm as a baseline. Our analysis shows that the proposed greedy algorithm achieves an approximation ratio of 1/6, i.e., at least 1/6 of the utility obtained by the optimal allocation. Next, we design a Linear Program (LP) rounding based approximation algorithm, aiming to achieve a better approximation ratio than the greedy algorithm. We show that the propopsed LP-rounding algorithm attains an approximation ratio of 1/2 (1 − 1/e) for the general case, and further it achieves 1 − 1/e for a special case of the problem, which is the best possible approximation ratio. We also present the complexity analysis of the two proposed algorithms. We perform numerical experiments to evaluate the average performance of the the proposed algorithms.", "citation": "Citations (3)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Dong-Hoon Shin.....http://dblp.org/pers/hd/s/Shin:Dong=Hoon", "Shibo He.....http://dblp.org/pers/hd/h/He:Shibo", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan"], "conf": "infocom", "year": "2015", "pages": 9}