{"title": "PhaseU: Real-time LOS identification with WiFi.", "fields": ["multipath propagation", "physical layer", "antenna diversity", "diversity scheme", "gesture recognition"], "abstract": "WiFi technology has fostered numerous mobile computing applications, such as adaptive communication, finegrained localization, gesture recognition, etc., which often achieve better performance or rely on the availability of Line-Of-Sight (LOS) signal propagation. Thus the awareness of LOS and Non-Line-Of-Sight (NLOS) plays as a key enabler for them. Realtime LOS identification on commodity WiFi devices, however, is challenging due to limited bandwidth of WiFi and resulting coarse multipath resolution. In this work, we explore and exploit the phase feature of PHY layer information, harnessing both space diversity with antenna elements and frequency diversity with OFDM subcarriers. On this basis, we propose PhaseU, a real-time LOS identification scheme that works in both static and mobile scenarios on commodity WiFi infrastructure. Experimental results in various indoor scenarios demonstrate that PhaseU consistently outperforms previous approaches, achieving overall LOS and NLOS detection rates of 94.35% and 94.19% in static cases and both higher than 80% in mobile contexts. Furthermore, PhaseU achieves real-time capability with millisecond-level delay for a connected AP and 1-second delay for unconnected APs, which is far beyond existing approaches.", "citation": "Citations (60)", "year": "2015", "departments": ["Tsinghua University", "Tsinghua University", "Hong Kong University of Science and Technology", "Tsinghua University", "Tsinghua University"], "conf": "infocom", "authors": ["Chenshu Wu.....http://dblp.org/pers/hd/w/Wu:Chenshu", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng", "Zimu Zhou.....http://dblp.org/pers/hd/z/Zhou:Zimu", "Kun Qian.....http://dblp.org/pers/hd/q/Qian_0004:Kun", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Mingyan Liu.....http://dblp.org/pers/hd/l/Liu:Mingyan"], "pages": 9}