{"title": "Effective Multi-Query Expansions: Robust Landmark Retrieval.", "fields": ["landmark", "ranking", "query expansion", "latent dirichlet allocation", "information retrieval"], "abstract": "Given a query photo issued by a user (q-user), the landmark retrieval is to return a set of photos with their landmarks similar to those of the query, while the existing studies on the landmark retrieval focus on exploiting geometries of landmarks for similarity matches between candidate photos and a query photo. We observe that the same landmarks provided by different users may convey different geometry information depending on the viewpoints and/or angles, and may subsequently yield very different results. In fact, dealing with the landmarks with shapes caused by the photography of q-users is often nontrivial and has never been studied.   Motivated by this, in this paper we propose a novel framework, namely multi-query expansions, to retrieve semantically robust landmarks by two steps. Firstly, we identify the top- k  photos regarding the latent topics of a query landmark to construct multi-query set so as to remedy its possible shape. For this purpose, we significantly extend the techniques of Latent Dirichlet Allocation. Secondly, we propose a novel technique to generate the robust yet compact pattern set from the multi-query photos. To ensure redundancy-free and enhance the efficiency, we adopt the existing minimum-description-length-principle based pattern mining techniques to remove similar query photos from the ( k +1) selected query photos. Then, a landmark retrieval rule is developed to calculate the ranking scores between mined pattern set and each photo in the database, which are ranked to serve as the final ranking list of landmark retrieval. Extensive experiments are conducted on real-world landmark datasets, validating the significantly higher accuracy of our approach.", "citation": "Citations (22)", "departments": ["University of New South Wales", "University of New South Wales", "University of Adelaide", "University of New South Wales"], "authors": ["Yang Wang.....http://dblp.org/pers/hd/w/Wang_0023:Yang", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Lin Wu.....http://dblp.org/pers/hd/w/Wu_0001:Lin", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie"], "conf": "mm", "year": "2015", "pages": 10}