{"title": "Robust Principal Component Analysis on Graphs.", "fields": ["robust principal component analysis", "sparse pca", "missing data", "optimization problem", "dimensionality reduction"], "abstract": "Principal Component Analysis (PCA) is the most widely used tool for linear dimensionality reduction and clustering. Still it is highly sensitive to outliers and does not scale well with respect to the number of data samples. Robust PCA solves the first issue with a sparse penalty term. The second issue can be handled with the matrix factorization model, which is however non-convex. Besides, PCA based clustering can also be enhanced by using a graph of data similarity. In this article, we introduce a new model called 'Robust PCA on Graphs' which incorporates spectral graph regularization into the Robust PCA framework. Our proposed model benefits from 1) the robustness of principal components to occlusions and missing values, 2) enhanced low-rank recovery, 3) improved clustering property due to the graph smoothness assumption on the low-rank matrix, and 4) convexity of the resulting optimization problem. Extensive experiments on 8 benchmark, 3 video and 2 artificial datasets with corruptions clearly reveal that our model outperforms 10 other state-of-the-art models in its clustering and low-rank recovery tasks.", "citation": "Citations (26)", "year": "2015", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Univ. della Svi ... no, Switzerland"], "conf": "iccv", "authors": ["Nauman Shahid.....http://dblp.org/pers/hd/s/Shahid:Nauman", "Vassilis Kalofolias.....http://dblp.org/pers/hd/k/Kalofolias:Vassilis", "Xavier Bresson.....http://dblp.org/pers/hd/b/Bresson:Xavier", "Michael M. Bronstein.....http://dblp.org/pers/hd/b/Bronstein:Michael_M=", "Pierre Vandergheynst.....http://dblp.org/pers/hd/v/Vandergheynst:Pierre"], "pages": 9}