{"title": "A Spoonful of Sugar?: The Impact of Guidance and Feedback on Password-Creation Behavior.", "fields": ["password policy", "password", "password strength", "cognitive password", "security policy"], "abstract": "Users often struggle to create passwords under strict requirements. To make this process easier, some providers present real-time feedback during password creation, indicating which requirements are not yet met. Other providers guide users through a multi-step password-creation process. Our 6,435-participant online study examines how feedback and guidance affect password security and usability. We find that real-time password-creation feedback can help users create strong passwords with fewer errors. We also find that although guiding participants through a three-step password-creation process can make creation easier, it may result in weaker passwords. Our results suggest that service providers should present password requirements with feedback to increase usability. However, the presentation of feedback and guidance must be carefully considered, since identical requirements can have different security and usability effects depending on presentation.", "citation": "Citations (17)", "year": "2015", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "chi", "authors": ["Richard Shay.....http://dblp.org/pers/hd/s/Shay:Richard", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Nicolas Christin.....http://dblp.org/pers/hd/c/Christin:Nicolas", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith", "Alain Forget.....http://dblp.org/pers/hd/f/Forget:Alain", "Saranga Komanduri.....http://dblp.org/pers/hd/k/Komanduri:Saranga", "Michelle L. Mazurek.....http://dblp.org/pers/hd/m/Mazurek:Michelle_L=", "William Melicher.....http://dblp.org/pers/hd/m/Melicher:William", "Sean M. Segreti.....http://dblp.org/pers/hd/s/Segreti:Sean_M=", "Blase Ur.....http://dblp.org/pers/hd/u/Ur:Blase"], "pages": 10}