{"title": "Purity: Building Fast, Highly-Available Enterprise Flash Storage from Commodity Components.", "fields": ["information repository", "data deduplication", "high availability", "storage area network", "converged storage"], "abstract": "Although flash storage has largely replaced hard disks in consumer class devices, enterprise workloads pose unique challenges that have slowed adoption of flash in ``performance tier'' storage appliances. In this paper, we describe Purity, the foundation of Pure Storage's Flash Arrays, the first all-flash enterprise storage system to support compression, deduplication, and high-availability.   Purity borrows techniques from modern database and key-value storage architectures, and introduces novel storage primitives that have wide applicability to data management systems. For instance, all writes in Purity are monotonic, and deletions are handled using an atomic predicate-based tuple  elision  primitive.   Purity's redundancy mechanisms are optimized for SSD failure modes and performance characteristics, allowing for fast recovery from component failures and lower space overhead than the best hard disk systems. We built deduplication and data compression schemes atop these primitives.   Flash changes storage capacity/performance tradeoffs: unlike disk-based systems, flash deployments are rarely performance bound. A single Purity appliance can provide over 7GiB/s of throughput on 32KiB random I/Os, even through multiple device failures, and while providing asynchronous off-site replication. Typical installations have 99.9% latencies under 1ms, and production arrays average 5.4x data reduction and 99.999% availability.   Purity takes advantage of storage performance increasing more rapidly than computational performance to build a simpler (with respect to engineering, installation, and management) scale-up storage appliance that supports hundreds of terabytes of highly-available, high-performance storage. The resulting performance and capacity supports many customer deployments of multiple applications, including scale-out and parallel systems, such as MongoDB and Oracle RAC, on a single Purity appliance.", "citation": "Citations (13)", "year": "2015", "departments": ["Pure Storage, M ... n View, CA, USA", "Pure Storage, M ... n View, CA, USA", "Pure Storage, M ... n View, CA, USA", "Pure Storage, M ... n View, CA, USA", "Pure Storage, M ... n View, CA, USA"], "conf": "sigmod", "authors": ["John Colgrove.....http://dblp.org/pers/hd/c/Colgrove:John", "John D. Davis.....http://dblp.org/pers/hd/d/Davis:John_D=", "John Hayes.....http://dblp.org/pers/hd/h/Hayes:John", "Ethan L. Miller.....http://dblp.org/pers/hd/m/Miller:Ethan_L=", "Cary Sandvig.....http://dblp.org/pers/hd/s/Sandvig:Cary", "Russell Sears.....http://dblp.org/pers/hd/s/Sears:Russell", "Ari Tamches.....http://dblp.org/pers/hd/t/Tamches:Ari", "Neil Vachharajani.....http://dblp.org/pers/hd/v/Vachharajani:Neil", "Feng Wang.....http://dblp.org/pers/hd/w/Wang_0003:Feng"], "pages": 12}