{"title": "TencentRec: Real-time Stream Recommendation in Practice.", "fields": ["big data", "web application", "data stream mining", "collaborative filtering", "data access"], "abstract": "With the arrival of the big data era, opportunities as well as challenges arise in both industry and academia. As an important service in most web applications, accurate real-time recommendation in the context of big data is of high demand. Traditional recommender systems that analyze data and update models at regular time intervals cannot satisfy the requirements of modern web applications, calling for real-time recommender systems.   In this paper, we tackle the ``big\", ``real-time\" and ``accurate\" challenges in real-time recommendation, and propose a general real-time stream recommender system built on Storm named TencentRec from three aspects, i.e., ``system\", ``algorithm\", and ``data\". We analyze the large amount of data streams from a wide range of applications leveraging the considerable computation ability of Storm, together with a data access component and a data storage component developed by us. To deal with various application specific demands, we have implemented several classic practical recommendation algorithms in TencentRec, including the item-based collaborative filtering, the content based, and the demographic based algorithms. Specially, we present a practical scalable item-based CF algorithm in detail, with the super characteristics such as robust to the implicit feedback problem, incremental update and real-time pruning. With the enhancement of real-time data collection and processing, we can capture the recommendation changes in real-time. We deploy the TencentRec in a series of production applications, and observe the superiority of TencentRec in providing accurate real-time recommendations for 10 billion user requests everyday.", "citation": "Citations (30)", "year": "2015", "departments": ["Peking University", "Peking University", "Tencent", "Tencent", "Peking University"], "conf": "sigmod", "authors": ["Yanxiang Huang.....http://dblp.org/pers/hd/h/Huang:Yanxiang", "Bin Cui.....http://dblp.org/pers/hd/c/Cui_0001:Bin", "Wenyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenyu", "Jie Jiang.....http://dblp.org/pers/hd/j/Jiang:Jie", "Ying Xu.....http://dblp.org/pers/hd/x/Xu:Ying"], "pages": 12}