{"title": "Mantle: a programmable metadata load balancer for the ceph file system.", "fields": ["global namespace", "metadata repository", "storage resource broker", "journaling file system", "metadata management"], "abstract": "Migrating resources is a useful tool for balancing load in a distributed system, but it is difficult to determine when to move resources, where to move resources, and how much of them to move. We look at resource migration for file system metadata and show how CephFS's dynamic subtree partitioning approach can exploit varying degrees of locality and balance because it can partition the namespace into variable sized units. Unfortunately, the current metadata balancer is complicated and difficult to control because it struggles to address many of the general resource migration challenges inherent to the metadata management problem. To help decouple policy from mechanism, we introduce a programmable storage system that lets the designer inject custom balancing logic. We show the flexibility and transparency of this approach by replicating the strategy of a state-of-the-art metadata balancer and conclude by comparing this strategy to other custom balancers on the same system.", "citation": "Citations (10)", "year": "2015", "departments": ["University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz"], "conf": "sc", "authors": ["Michael A. Sevilla.....http://dblp.org/pers/hd/s/Sevilla:Michael_A=", "Noah Watkins.....http://dblp.org/pers/hd/w/Watkins:Noah", "Carlos Maltzahn.....http://dblp.org/pers/hd/m/Maltzahn:Carlos", "Ike Nassi.....http://dblp.org/pers/hd/n/Nassi:Ike", "Scott A. Brandt.....http://dblp.org/pers/hd/b/Brandt:Scott_A=", "Sage A. Weil.....http://dblp.org/pers/hd/w/Weil:Sage_A=", "Greg Farnum.....http://dblp.org/pers/hd/f/Farnum:Greg", "Sam Fineberg.....http://dblp.org/pers/hd/f/Fineberg:Sam"], "pages": 12}