{"title": "Deep Model Based Transfer and Multi-Task Learning for Biological Image Analysis.", "fields": ["transfer of learning", "feature detection", "deep learning", "convolutional neural network", "multi task learning", "feature learning", "semi supervised learning", "annotation"], "abstract": "A central theme in learning from image data is to develop appropriate image representations for the specific task at hand. Traditional methods used handcrafted local features combined with high-level image representations to generate image-level representations. Thus, a practical challenge is to determine what features are appropriate for specific tasks. For example, in the study of gene expression patterns in  Drosophila melanogaster , texture features based on wavelets were particularly effective for determining the developmental stages from in situ hybridization (ISH) images. Such image representation is however not suitable for controlled vocabulary (CV) term annotation because each CV term is often associated with only a part of an image. Here, we developed problem-independent feature extraction methods to generate hierarchical representations for ISH images. Our approach is based on the deep convolutional neural networks (CNNs) that can act on image pixels directly. To make the extracted features generic, the models were trained using a natural image set with millions of labeled examples. These models were transferred to the ISH image domain and used directly as feature extractors to compute image representations. Furthermore, we employed multi-task learning method to fine-tune the pre-trained models with labeled ISH images, and also extracted features from the fine-tuned models. Experimental results showed that feature representations computed by deep models based on transfer and multi-task learning significantly outperformed other methods for annotating gene expression patterns at different stage ranges. We also demonstrated that the intermediate layers of deep models produced the best gene expression pattern representations.", "citation": "Citations (27)", "departments": ["Old Dominion University", "Old Dominion University", "Old Dominion University", "Arizona State University", "Temple University", "Old Dominion University"], "authors": ["Wenlu Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenlu", "Rongjian Li.....http://dblp.org/pers/hd/l/Li:Rongjian", "Tao Zeng.....http://dblp.org/pers/hd/z/Zeng:Tao", "Qian Sun.....http://dblp.org/pers/hd/s/Sun:Qian", "Sudhir Kumar.....http://dblp.org/pers/hd/k/Kumar:Sudhir", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping", "Shuiwang Ji.....http://dblp.org/pers/hd/j/Ji:Shuiwang"], "conf": "kdd", "year": "2015", "pages": 10}