{"title": "Experiences with eNav: a low-power vehicular navigation system.", "fields": ["turn by turn navigation", "mobile robot navigation", "navigation system", "waypoint", "dead reckoning"], "abstract": "This paper presents experiences with eNav, a smartphone-based vehicular GPS navigation system that has an  energy-saving  location sensing mode capable of drastically reducing navigation energy needs. Traditional navigation systems sample the phone's GPS at a fixed rate (usually around 1Hz), regardless of factors such as current vehicle speed and distance from the next navigation waypoint. This practice results in a large energy consumption and unnecessarily reduces the attainable length of a navigation session, if the phone is left unplugged. The paper investigates two questions. First, would drivers be willing to sacrifice some of the affordances of modern navigation systems in order to prolong battery life? Second, how much energy could be saved using straightforward alternative localization mechanisms, applied to complement GPS for vehicular navigation? According to a survey we conducted of 500 drivers, as much as 91% of drivers said they would like to have a vehicular navigation application with an energy saving mode. To meet this need, eNav exploits on-board accelerometers for approximate location sensing when the vehicle is sufficiently far from the next navigation waypoint (or is stopped). A user test-study of eNav shows that it results in roughly the same user experience as standard GPS navigation systems, while reducing navigation energy consumption by almost 80%. We conclude that drivers find an energy-saving mode on phone-based vehicular navigation applications desirable, even at the expense of some loss of functionality, and that significant savings can be achieved using straightforward location sensing mechanisms that avoid frequent GPS sampling.", "citation": "Citations (14)", "departments": ["University of Illinois at Urbana–Champaign", "University at Buffalo", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Shaohan Hu.....http://dblp.org/pers/hd/h/Hu:Shaohan", "Lu Su.....http://dblp.org/pers/hd/s/Su:Lu", "Shen Li.....http://dblp.org/pers/hd/l/Li:Shen", "Shiguang Wang.....http://dblp.org/pers/hd/w/Wang:Shiguang", "Chenji Pan.....http://dblp.org/pers/hd/p/Pan:Chenji", "Siyu Gu.....http://dblp.org/pers/hd/g/Gu:Siyu", "Md. Tanvir Al Amin.....http://dblp.org/pers/hd/a/Amin:Md=_Tanvir_Al", "Hengchang Liu.....http://dblp.org/pers/hd/l/Liu:Hengchang", "Suman Nath.....http://dblp.org/pers/hd/n/Nath:Suman", "Romit Roy Choudhury.....http://dblp.org/pers/hd/c/Choudhury:Romit_Roy", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F="], "conf": "huc", "year": "2015", "pages": 12}