{"title": "LearningAssistant: A novel learning resource recommendation system.", "fields": ["recommender system", "wish", "recreation", "electronic publishing", "ranking"], "abstract": "Reading online content for educational, learning, training or recreational purposes has become a very popular activity. While reading, people may have difficulty understanding a passage or wish to learn more about the topics covered by it, hence they may naturally seek additional or supplementary resources for the particular passage. These resources should be close to the passage both in terms of the subject matter and the reading level. However, using a search engine to find such resources interrupts the reading flow. It is also an inefficient, trial-and-error process because existing web search and recommendation systems do not support large queries, they do not understand semantic topics, and they do not take into account the reading level of the original document a person is reading. In this demo, we present LearningAssistant, a novel system that enables online reading material to be smoothly enriched with additional resources that can supplement or explain any passage from the original material for a reader on demand. The system facilitates the learning process by recommending learning resources (documents, videos, etc) for selected text passages of any length. The recommended resources are ranked based on two criteria (a) how they match the different topics covered within the selected passage, and (b) the reading level of the original text where the selected passage comes from. User feedback from students who use our system in two real pilots, one with a high school and one with a university, for their courses suggest that our system is promising and effective.", "citation": "Citations (11)", "departments": ["Hewlett-Packard", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Lei Liu.....http://dblp.org/pers/hd/l/Liu:Lei", "Georgia Koutrika.....http://dblp.org/pers/hd/k/Koutrika:Georgia", "Shanchan Wu.....http://dblp.org/pers/hd/w/Wu:Shanchan"], "conf": "icde", "year": "2015", "pages": 4}