{"title": "Approximate keyword search in semantic trajectory database.", "fields": ["query optimization", "web query classification", "query expansion", "web search query", "approximation algorithm"], "abstract": "Driven by the advances in location positioning techniques and the popularity of location sharing services, semantic enriched trajectory data have become unprecedentedly available. While finding relevant Point-of-Interest (POIs) based on users' locations and query keywords has been extensively studied in the past years, it is largely untouched to explore the keyword queries in the context of semantic trajectory database. In this paper, we study the problem of approximate keyword search in massive semantic trajectories. Given a set of query keywords, an approximate keyword query of semantic trajectory (AKQST) returns k trajectories that contain the most relevant keywords to the query and yield the least travel effort in the meantime. The main difference between AKQST and conventional spatial keyword queries is that there is no query location in AKQST, which means the search area cannot be localized. To capture the travel effort in the context of query keywords, a novel utility function, called spatio-textual utility function, is first defined. Then we develop a hybrid index structure called GiKi to organize the trajectories hierarchically, which enables pruning the search space by spatial and textual similarity simultaneously. Finally an efficient search algorithm and fast evaluation of the minimum value of spatio-textual utility function are proposed. The results of our empirical studies based on real check-in datasets demonstrate that our proposed index and algorithms can achieve good scalability.", "citation": "Citations (33)", "departments": ["University of Queensland", "Microsoft", "University of Queensland", "Microsoft", "University of Queensland"], "authors": ["Bolong Zheng.....http://dblp.org/pers/hd/z/Zheng:Bolong", "Nicholas Jing Yuan.....http://dblp.org/pers/hd/y/Yuan:Nicholas_Jing", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Shazia Wasim Sadiq.....http://dblp.org/pers/hd/s/Sadiq:Shazia_Wasim", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "icde", "year": "2015", "pages": 12}