{"title": "Exploratory Keyword Search with Interactive Input.", "fields": ["domain knowledge", "exploratory search", "user information", "ranging", "ambiguity"], "abstract": "Due to the intrinsic ambiguity of keyword queries, users usually need to reformulate their queries multiple times to get the desired information. Even worse, users either have no way to precisely specify their search intention, or have limited domain knowledge on the data to precisely express their search intention. Moreover, they may just have a general interest to explore the data by keyword query. Therefore, our goal is to design an exploratory search paradigm that is able to bring humans more actively into the search process, in order to meet various user information needs, ranging from simple lookup to learning and understanding of the data.   Besides, keyword queries against data with structure, such as XML, can run into multiple difficulties: how to identify the search target; more types of ambiguity arise as a keyword can be part of the structure as well as content of data, etc. Effectively addressing these requires solutions to multiple challenges. While some have been addressed to some extent individually, there is no previous effort to develop a comprehensive system to meet these important user needs and meet all of these challenges.   Therefore, we propose a framework called ClearMap that natively supports visualized exploratory search paradigm on XML data. In particular, we offer an interactive and visualized mechanism to present the outcome of the query, enable user to explore and manipulate the underlying data to either quickly find desired information or learn the relationship among data items, as well as provide interactive suggestions when their expected results do not exist in the data. A preliminary version of ClearMap and its source code are available for try at http://xmlclearmap.comp.nus.edu.sg.", "citation": "Citations (5)", "year": "2015", "departments": ["RMIT University", "National University of Singapore", "National University of Singapore", "School of Compu ...  Melbourne, USA"], "conf": "sigmod", "authors": ["Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng", "Yong Zeng.....http://dblp.org/pers/hd/z/Zeng:Yong", "H. V. Jagadish.....http://dblp.org/pers/hd/j/Jagadish:H=_V=", "Tok Wang Ling.....http://dblp.org/pers/hd/l/Ling:Tok_Wang"], "pages": 6}