{"title": "Rocking Drones with Intentional Sound Noise on Gyroscopic Sensors.", "fields": ["actuator", "countermeasure", "adversary", "gyroscope", "resonance"], "abstract": "Sensing and actuation systems contain sensors to observe the environment and actuators to influence it. However, these sensors can be tricked by maliciously fabricated physical properties. In this paper, we investigated whether an adversary could incapacitate drones equipped with Micro-Electro-Mechanical Systems (MEMS) gyroscopes using intentional sound noise. While MEMS gyroscopes are known to have resonant frequencies that degrade their accuracy, it is not known whether this property can be exploited maliciously to disrupt the operation of drones.\n\nWe first tested 15 kinds of MEMS gyroscopes against sound noise and discovered the resonant frequencies of seven MEMS gyroscopes by scanning the frequencies under 30 kHz using a consumer-grade speaker. The standard deviation of the resonant output from those gyroscopes was dozens of times larger than that of the normal output. After analyzing a target drone's flight control system, we performed real-world experiments and a software simulation to verify the effect of the crafted gyroscope output. Our real-world experiments showed that in all 20 trials, one of two target drones equipped with vulnerable gyroscopes lost control and crashed shortly after we started our attack. A few interesting applications and countermeasures are discussed at the conclusion of this paper.", "citation": "Citations (77)", "year": "2015", "departments": ["KAIST", "KAIST", "KAIST", "KAIST", "KAIST"], "conf": "uss", "authors": ["Yunmok Son.....http://dblp.org/pers/hd/s/Son:Yunmok", "Hocheol Shin.....http://dblp.org/pers/hd/s/Shin:Hocheol", "Dongkwan Kim.....http://dblp.org/pers/hd/k/Kim:Dongkwan", "Young-Seok Park.....http://dblp.org/pers/hd/p/Park:Young=Seok", "Juhwan Noh.....http://dblp.org/pers/hd/n/Noh:Juhwan", "Kibum Choi.....http://dblp.org/pers/hd/c/Choi:Kibum", "Jungwoo Choi.....http://dblp.org/pers/hd/c/Choi:Jungwoo", "Yongdae Kim.....http://dblp.org/pers/hd/k/Kim:Yongdae"], "pages": 16}