{"title": "Repairing Programs with Semantic Code Search (T).", "fields": ["search engine indexing", "debugging", "benchmark", "software bug", "maintenance engineering"], "abstract": "Automated program repair can potentially reduce debugging costs and improvesoftware quality but recent studies have drawn attention to shortcomings inthe quality of automatically generated repairs. We propose a new kind ofrepair that uses the large body of existing open-source code to findpotential fixes. The key challenges lie in efficiently finding codesemantically similar (but not identical) to defective code and thenappropriately integrating that code into a buggy program. We presentSearchRepair, a repair technique that addresses these challenges by(1) encoding a large database of human-written code fragments as SMTconstraints on input-output behavior, (2) localizing a given defect to likelybuggy program fragments and deriving the desired input-output behavior forcode to replace those fragments, (3) using state-of-the-art constraintsolvers to search the database for fragments that satisfy that desiredbehavior and replacing the likely buggy code with these potential patches, and (4) validating that the patches repair the bug against program testsuites. We find that SearchRepair repairs 150 (19%) of 778 benchmark Cdefects written by novice students, 20 of which are not repaired by GenProg, TrpAutoRepair, and AE. We compare the quality of the patches generated by thefour techniques by measuring how many independent, not-used-during-repairtests they pass, and find that SearchRepair-repaired programs pass 97.3% ofthe tests, on average, whereas GenProg-, TrpAutoRepair-, and AE-repairedprograms pass 68.7%, 72.1%, and 64.2% of the tests, respectively. We concludethat SearchRepair produces higher-quality repairs than GenProg, TrpAutoRepair, and AE, and repairs some defects those tools cannot.", "citation": "Citations (94)", "departments": ["North Carolina State University", "Carnegie Mellon University", "University of Washington"], "authors": ["Yalin Ke.....http://dblp.org/pers/hd/k/Ke:Yalin", "Kathryn T. Stolee.....http://dblp.org/pers/hd/s/Stolee:Kathryn_T=", "Claire Le Goues.....http://dblp.org/pers/hd/g/Goues:Claire_Le", "Yuriy Brun.....http://dblp.org/pers/hd/b/Brun:Yuriy"], "conf": "kbse", "year": "2015", "pages": 12}