{"title": "IOrchestra: supporting high-performance data-intensive applications in the cloud via collaborative virtualization.", "fields": ["hypervisor", "server", "hardware virtualization", "full virtualization", "virtualization"], "abstract": "Multi-tier data-intensive applications are widely deployed in virtualized data centers for high scalability and reliability. As the response time is vital for user satisfaction, this requires achieving good performance at each tier of the applications in order to minimize the overall latency. However, in such virtualized environments, each tier (e.g., application, database, web) is likely to be hosted by different virtual machines (VMs) on multiple physical servers, where a guest VM is unaware of changes outside its domain, and the hypervisor also does not know the configuration and runtime status of a guest VM. As a result, isolated virtualization domains lend themselves to performance unpredictability and variance. In this paper, we propose IOrchestra, a holistic collaborative virtualization framework, which bridges the semantic gaps of I/O stacks and system information across multiple VMs, improves virtual I/O performance through collaboration from guest domains, and increases resource utilization in data centers. We present several case studies to demonstrate that IOrchestra is able to address numerous drawbacks of the current practice and improve the I/O latency of various distributed cloud applications by up to 31%.", "citation": "Not cited", "year": "2015", "departments": ["University of St. Thomas", "George Washington University", "George Washington University", "AT&T Labs", "AT&T Labs"], "conf": "sc", "authors": ["Ron Chi-Lung Chiang.....http://dblp.org/pers/hd/c/Chiang:Ron_Chi=Lung", "H. Howie Huang.....http://dblp.org/pers/hd/h/Huang:H=_Howie", "Timothy Wood.....http://dblp.org/pers/hd/w/Wood_0001:Timothy", "Changbin Liu.....http://dblp.org/pers/hd/l/Liu:Changbin", "Oliver Spatscheck.....http://dblp.org/pers/hd/s/Spatscheck:Oliver"], "pages": 12}