{"title": "SOLD: Sub-optimal low-rank decomposition for efficient video segmentation.", "fields": ["segmentation", "discriminative model", "rank", "video denoising", "matrix"], "abstract": "This paper investigates how to perform robust and efficient unsupervised video segmentation while suppressing the effects of data noises and/or corruptions. We propose a general algorithm, called Sub-Optimal Low-rank Decomposition (SOLD), which pursues the low-rank representation for video segmentation. Given the supervoxels affinity matrix of an observed video sequence, SOLD seeks a sub-optimal solution by making the matrix rank explicitly determined. In particular, the affinity matrix with the rank fixed can be decomposed into two sub-matrices of low rank, and then we iteratively optimize them with closed-form solutions. Moreover, we incorporate a discriminative replication prior into our framework based on the obervation that small-size video patterns tend to recur frequently within the same object. The video can be segmented into several spatio-temporal regions by applying the Normalized-Cut (NCut) algorithm with the solved low-rank representation. To process the streaming videos, we apply our algorithm sequentially over a batch of frames over time, in which we also develop several temporal consistent constraints improving the robustness. Extensive experiments on the public benchmarks demonstrate superior performance of our framework over other state-of-the-art approaches.", "citation": "Citations (22)", "year": "2015", "departments": ["Anhui University", "Sun Yat-sen University", "Harbin Institute of Technology", "National University of Singapore", "Anhui University"], "conf": "cvpr", "authors": ["Chenglong Li.....http://dblp.org/pers/hd/l/Li_0002:Chenglong", "Liang Lin.....http://dblp.org/pers/hd/l/Lin:Liang", "Wangmeng Zuo.....http://dblp.org/pers/hd/z/Zuo:Wangmeng", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Jin Tang.....http://dblp.org/pers/hd/t/Tang:Jin"], "pages": 9}