{"title": "Discriminant analysis on Riemannian manifold of Gaussian distributions for face recognition with image sets.", "fields": ["riemannian manifold", "riemannian geometry", "gaussian", "information geometry", "statistical manifold", "kernel fisher discriminant analysis", "discriminative model", "manifold alignment", "gaussian function"], "abstract": "This paper presents a method named Discriminant Analysis on Riemannian manifold of Gaussian distributions (DARG) to solve the problem of face recognition with image sets. Our goal is to capture the underlying data distribution in each set and thus facilitate more robust classification. To this end, we represent image set as Gaussian Mixture Model (GMM) comprising a number of Gaussian components with prior probabilities and seek to discriminate Gaussian components from different classes. In the light of information geometry, the Gaussians lie on a specific Riemannian manifold. To encode such Riemannian geometry properly, we investigate several distances between Gaussians and further derive a series of provably positive definite probabilistic kernels. Through these kernels, a weighted Kernel Discriminant Analysis is finally devised which treats the Gaussians in GMMs as samples and their prior probabilities as sample weights. The proposed method is evaluated by face identification and verification tasks on four most challenging and largest databases, YouTube Celebrities, COX, YouTube Face DB and Point-and-Shoot Challenge, to demonstrate its superiority over the state-of-the-art.", "citation": "Not cited", "year": "2015", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "ETH Zurich", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "cvpr", "authors": ["Wen Wang.....http://dblp.org/pers/hd/w/Wang:Wen", "Ruiping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Ruiping", "Zhiwu Huang.....http://dblp.org/pers/hd/h/Huang:Zhiwu", "Shiguang Shan.....http://dblp.org/pers/hd/s/Shan:Shiguang", "Xilin Chen.....http://dblp.org/pers/hd/c/Chen:Xilin"], "pages": 10}