{"title": "User-Defined Game Input for Smart Glasses in Public Space.", "fields": ["gesture", "mobile device", "input device", "wearable technology", "wearable computer"], "abstract": "Smart glasses, such as Google Glass, provide always-available displays not offered by console and mobile gaming devices, and could potentially offer a pervasive gaming experience. However, research on input for games on smart glasses has been constrained by the available sensors to date. To help inform design directions, this paper explores user-defined game input for smart glasses beyond the capabilities of current sensors, and focuses on the interaction in public settings. We conducted a user-defined input study with 24 participants, each performing 17 common game control tasks using 3 classes of interaction and 2 form factors of smart glasses, for a total of 2448 trials. Results show that users significantly preferred non-touch and non-handheld interaction over using handheld input devices, such as in-air gestures. Also, for touch input without handheld devices, users preferred interacting with their palms over wearable devices (51% vs 20%). In addition, users preferred interactions that are less noticeable due to concerns with social acceptance, and preferred in-air gestures in front of the torso rather than in front of the face (63% vs 37%).", "citation": "Citations (19)", "year": "2015", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "HCI lab (R430), ... pei, Taiwan Roc", "HCI lab (R430), ... pei, Taiwan Roc"], "conf": "chi", "authors": ["Ying-Chao Tung.....http://dblp.org/pers/hd/t/Tung:Ying=Chao", "Chun-Yen Hsu.....http://dblp.org/pers/hd/h/Hsu:Chun=Yen", "Han-Yu Wang.....http://dblp.org/pers/hd/w/Wang:Han=Yu", "Silvia Chyou.....http://dblp.org/pers/hd/c/Chyou:Silvia", "Jhe-Wei Lin.....http://dblp.org/pers/hd/l/Lin:Jhe=Wei", "Pei-Jung Wu.....http://dblp.org/pers/hd/w/Wu:Pei=Jung", "Andries Valstar.....http://dblp.org/pers/hd/v/Valstar:Andries", "Mike Y. Chen.....http://dblp.org/pers/hd/c/Chen:Mike_Y="], "pages": 10}