{"title": "Dynamic defense strategy against advanced persistent threat with insiders.", "fields": ["insider threat", "best response", "advanced persistent threat", "non credible threat", "security level"], "abstract": "The landscape of cyber security has been reformed dramatically by the recently emerging Advanced Persistent Threat (APT). It is uniquely featured by the stealthy, continuous, sophisticated and well-funded attack process for long-term malicious gain, which render the current defense mechanisms inapplicable. A novel design of defense strategy, continuously combating APT in a long time-span with imperfect/incomplete information on attacker's actions, is urgently needed. The challenge is even more escalated when APT is coupled with the insider threat (a major threat in cyber-security), where insiders could trade valuable information to APT attacker for monetary gains. The interplay among the defender, APT attacker and insiders should be judiciously studied to shed insights on a more secure defense system. In this paper, we consider the joint threats from APT attacker and the insiders, and characterize the fore-mentioned interplay as a two-layer game model, i.e., a defense/attack game between defender and APT attacker and an information-trading game among insiders. Through rigorous analysis, we identify the best response strategies for each player and prove the existence of Nash Equilibrium for both games. Extensive numerical study further verifies our analytic results and examines the impact of different system configurations on the achievable security level.", "citation": "Citations (31)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "US Army CERDEC, USA"], "authors": ["Pengfei Hu.....http://dblp.org/pers/hd/h/Hu:Pengfei", "Hongxing Li.....http://dblp.org/pers/hd/l/Li:Hongxing", "Hao Fu.....http://dblp.org/pers/hd/f/Fu:Hao", "Derya Cansever.....http://dblp.org/pers/hd/c/Cansever:Derya", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant"], "conf": "infocom", "year": "2015", "pages": 9}