{"title": "Design and Implementation of the LogicBlox System.", "fields": ["declarative programming", "software development", "purely functional", "datalog", "predictive analytics"], "abstract": "The LogicBlox system aims to reduce the complexity of software development for modern applications which enhance and automate decision-making and enable their users to evolve their capabilities via a ``self-service'' model. Our perspective in this area is informed by over twenty years of experience building dozens of mission-critical enterprise applications that are in use by hundreds of large enterprises across industries such as retail, telecommunications, banking, and government. We designed and built LogicBlox to be the system we wished we had when developing those applications.   In this paper, we discuss the design considerations behind the LogicBlox system and give an overview of its implementation, highlighting innovative aspects. These include: LogiQL, a unified and declarative language based on Datalog; the use of purely functional data structures; novel join processing strategies; advanced incremental maintenance and live programming facilities; a novel concurrency control scheme; and built-in support for prescriptive and predictive analytics.", "citation": "Citations (93)", "year": "2015", "departments": ["LogicBlox, Atlanta, GA, USA", "LogicBlox, Atlanta, GA, USA", "LogicBlox, Atlanta, GA, USA", "LogicBlox, Atlanta, GA, USA", "LogicBlox, Atlanta, GA, USA"], "conf": "sigmod", "authors": ["Molham Aref.....http://dblp.org/pers/hd/a/Aref:Molham", "Balder ten Cate.....http://dblp.org/pers/hd/c/Cate:Balder_ten", "Todd J. Green.....http://dblp.org/pers/hd/g/Green:Todd_J=", "Benny Kimelfeld.....http://dblp.org/pers/hd/k/Kimelfeld:Benny", "Dan Olteanu.....http://dblp.org/pers/hd/o/Olteanu:Dan", "Emir Pasalic.....http://dblp.org/pers/hd/p/Pasalic:Emir", "Todd L. Veldhuizen.....http://dblp.org/pers/hd/v/Veldhuizen:Todd_L=", "Geoffrey Washburn.....http://dblp.org/pers/hd/w/Washburn:Geoffrey"], "pages": 12}