{"title": "VINCE: Exploiting visible light sensing for smartphone-based NFC systems.", "fields": ["visible light communication", "near field communication", "android", "refresh rate", "bit error rate"], "abstract": "This paper presents VINCE — a novel visible light sensing design for smartphone-based Near Field Communication (NFC) systems. VINCE encodes information as different brightness levels of smartphone screens, while receivers capture the light signal via light sensors. In contrast to RF technologies, the direction and distance of such a Visible Light Communication (VLC) link can be easily controlled, preserving communication privacy and security. As a result, VINCE can be used in a wide range of NFC applications such as contactless payments and device pairing. We experimentally profile the impact of screen brightness levels and refresh rates of smartphones, and then use the results to guide the design of light intensity encoding scheme of VINCE. We adopt several signal processing techniques and empirically derive a model to deal with the significant variation of received light intensity caused by noises and low screen refresh rates. To improve the communication reliability, VINCE adopts a feedback-based retransmission scheme, and dynamically adjusts the number of encoding brightness levels based on the current light channel condition. We also derive an analytical model that characterizes the relation among the distance, SNR (Signal to Noise Ratio), and BER (Bit Error Rate) of VINCE. Our design and theoretical model are validated via extensive evaluations using a hardware implementation of VINCE on Android smartphones and the Arduino platform.", "citation": "Citations (1)", "departments": ["Beihang University", "Beihang University", "Michigan State University", "Michigan State University", "Beihang University"], "authors": ["Jianwei Niu.....http://dblp.org/pers/hd/n/Niu_0002:Jianwei", "Fei Gu.....http://dblp.org/pers/hd/g/Gu:Fei", "Ruogu Zhou.....http://dblp.org/pers/hd/z/Zhou:Ruogu", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Wei Xiang.....http://dblp.org/pers/hd/x/Xiang:Wei"], "conf": "infocom", "year": "2015", "pages": 9}