{"title": "BD-CATS: big data clustering at trillion particle scale.", "fields": ["k d tree", "orders of magnitude", "dbscan", "big data", "petascale computing"], "abstract": "Modern cosmology and plasma physics codes are now capable of simulating trillions of particles on petascale systems. Each timestep output from such simulations is on the order of 10s of TBs. Summarizing and analyzing raw particle data is challenging, and scientists often focus on density structures, whether in the real 3D space, or a high-dimensional phase space. In this work, we develop a highly scalable version of the clustering algorithm D bscan , and apply it to the largest datasets produced by state-of-the-art codes. Our system, called B d -C ats , is the first one capable of performing end-to-end analysis at trillion particle scale (including: loading the data, geometric partitioning, computing kd-trees, performing clustering analysis, and storing the results). We show analysis of 1.4 trillion particles from a plasma physics simulation, and a 10,240 3  particle cosmological simulation, utilizing ~100,000 cores in 30 minutes. B d -C ats  is helping infer mechanisms behind particle acceleration in plasma physics and holds promise for qualitatively superior clustering in cosmology. Both of these results were previously intractable at the trillion particle scale.", "citation": "Citations (12)", "year": "2015", "departments": ["Intel", "Lawrence Berkeley National Laboratory", "Intel", "Intel", "Lawrence Berkeley National Laboratory"], "conf": "sc", "authors": ["Md. Mostofa Ali Patwary.....http://dblp.org/pers/hd/p/Patwary:Md=_Mostofa_Ali", "Surendra Byna.....http://dblp.org/pers/hd/b/Byna:Surendra", "Nadathur Rajagopalan Satish.....http://dblp.org/pers/hd/s/Satish:Nadathur_Rajagopalan", "Narayanan Sundaram.....http://dblp.org/pers/hd/s/Sundaram:Narayanan", "Zarija Lukic.....http://dblp.org/pers/hd/l/Lukic:Zarija", "Vadim Roytershteyn.....http://dblp.org/pers/hd/r/Roytershteyn:Vadim", "Michael J. Anderson.....http://dblp.org/pers/hd/a/Anderson:Michael_J=", "Yushu Yao.....http://dblp.org/pers/hd/y/Yao:Yushu", "Prabhat.....http://dblp.org/pers/hd/p/Prabhat:", "Pradeep Dubey.....http://dblp.org/pers/hd/d/Dubey:Pradeep"], "pages": 12}