{"title": "Multi-feature max-margin hierarchical Bayesian model for action recognition.", "fields": ["gibbs sampling", "inference", "regularization", "discriminative model", "generative model"], "abstract": "In this paper, a multi-feature max-margin hierarchical Bayesian model (M 3 HBM) is proposed for action recognition. Different from existing methods which separate representation and classification into two steps, M 3 HBM jointly learns a high-level representation by combining a hierarchical generative model (HGM) and discriminative max-margin classifiers in a unified Bayesian framework. Specifically, HGM is proposed to represent actions by distributions over latent spatial temporal patterns (STPs) which are learned from multiple feature modalities and shared among different classes. For recognition, we employ Gibbs classifiers to minimize the expected loss function based on the max-margin principle and use the classifiers as regularization terms of M 3 HBM to perform Bayeisan estimation for classifier parameters together with the learning of STPs. In addition, multi-task learning is applied to learn the model from multiple feature modalities for different classes. For test videos, we obtain the representations by the inference process and perform action recognition by the learned Gibbs classifiers. For the learning and inference process, we derive an efficient Gibbs sampling algorithm to solve the proposed M 3 HBM. Extensive experiments on several datasets demonstrate both the representation power and the classification capability of our approach for action recognition.", "citation": "Citations (11)", "year": "2015", "departments": ["Beijing Jiaotong University", "NLPR, Instituti ...  Beijing, China", "NLPR, Instituti ...  Beijing, China", "NLPR, Instituti ...  Beijing, China", "NLPR, Instituti ...  Beijing, China"], "conf": "cvpr", "authors": ["Shuang Yang.....http://dblp.org/pers/hd/y/Yang:Shuang", "Chunfeng Yuan.....http://dblp.org/pers/hd/y/Yuan:Chunfeng", "Baoxin Wu.....http://dblp.org/pers/hd/w/Wu:Baoxin", "Weiming Hu.....http://dblp.org/pers/hd/h/Hu:Weiming", "Fangshi Wang.....http://dblp.org/pers/hd/w/Wang:Fangshi"], "pages": 9}