{"title": "Incremental computation with names.", "fields": ["computation", "probabilistic logic", "memoization", "reuse", "first class"], "abstract": "Over the past thirty years, there has been significant progress in developing general-purpose, language-based approaches to incremental computation, which aims to efficiently update the result of a computation when an input is changed. A key design challenge in such approaches is how to provide efficient incremental support for a broad range of programs. In this paper, we argue that first-class names are a critical linguistic feature for efficient incremental computation. Names identify computations to be reused across differing runs of a program, and making them first class gives programmers a high level of control over reuse. We demonstrate the benefits of names by presenting Nominal Adapton, an ML-like language for incremental computation with names. We describe how to use Nominal Adapton to efficiently incrementalize several standard programming patterns---including maps, folds, and unfolds---and show how to build efficient, incremental probabilistic trees and tries. Since Nominal Adapton's implementation is subtle, we formalize it as a core calculus and prove it is from-scratch consistent, meaning it always produces the same answer as simply re-running the computation. Finally, we demonstrate that Nominal Adapton can provide large speedups over both from-scratch computation and Adapton, a previous state-of-the-art incremental computation system.", "citation": "Citations (10)", "departments": ["University of Maryland, College Park", "University of British Columbia", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Matthew A. Hammer.....http://dblp.org/pers/hd/h/Hammer:Matthew_A=", "Joshua Dunfield.....http://dblp.org/pers/hd/d/Dunfield:Joshua", "Kyle Headley.....http://dblp.org/pers/hd/h/Headley:Kyle", "Nicholas Labich.....http://dblp.org/pers/hd/l/Labich:Nicholas", "Jeffrey S. Foster.....http://dblp.org/pers/hd/f/Foster:Jeffrey_S=", "Michael W. Hicks.....http://dblp.org/pers/hd/h/Hicks:Michael_W=", "David Van Horn.....http://dblp.org/pers/hd/h/Horn:David_Van"], "conf": "oopsla", "year": "2015", "pages": 19}