{"title": "Exploiting asynchrony from exact forward recovery for DUE in iterative solvers.", "fields": ["compromise", "krylov subspace", "solver", "generalized minimal residual method", "biconjugate gradient stabilized method"], "abstract": "This paper presents a method to protect iterative solvers from Detected and Uncorrected Errors (DUE) relying on error detection techniques already available in commodity hardware. Detection operates at the memory page level, which enables the use of simple algorithmic redundancies to correct errors. Such redundancies would be inapplicable under coarse grain error detection, but become very powerful when the hardware is able to precisely detect errors. Relations straightforwardly extracted from the solver allow to recover lost data exactly. This method is free of the overheads of backwards recoveries like checkpointing, and does not compromise mathematical convergence properties of the solver as restarting would do. We apply this recovery to three widely used Krylov subspace methods, CG, GMRES and BiCGStab, and their preconditioned versions. We implement our resilience techniques on CG considering scenarios from small (8 cores) to large (1024 cores) scales, and demonstrate very low overheads compared to state-of-the-art solutions. We deploy our recovery techniques either by overlapping them with algorithmic computations or by forcing them to be in the critical path of the application. A trade-off exists between both approaches depending on the error rate the solver is suffering. Under realistic error rates, overlapping decreases overheads from 5.37% down to 3.59% for a non-preconditioned CG on 8 cores.", "citation": "Citations (12)", "year": "2015", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia"], "conf": "sc", "authors": ["Luc Jaulmes.....http://dblp.org/pers/hd/j/Jaulmes:Luc", "Marc Casas.....http://dblp.org/pers/hd/c/Casas:Marc", "Miquel Moretó.....http://dblp.org/pers/hd/m/Moret=oacute=:Miquel", "Eduard Ayguadé.....http://dblp.org/pers/hd/a/Ayguad=eacute=:Eduard", "Jesús Labarta.....http://dblp.org/pers/hd/l/Labarta:Jes=uacute=s", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "pages": 12}