{"title": "Convergence to Equilibria in Strategic Candidacy.", "fields": ["convergence", "nash equilibrium", "candidacy", "welfare economics", "mechanism design"], "abstract": "We study equilibrium dynamics in candidacy games, in which candidates may strategically decide to enter the election or withdraw their candidacy, following their own preferences over possible outcomes. Focusing on games under Plurality, we extend the standard model to allow for situations where voters may refuse to return their votes to those candidates who had previously left the election, should they decide to run again. We show that if at the time when a candidate withdraws his candidacy, with some positive probability each voter takes this candidate out of his future consideration, the process converges with probability 1. This is in sharp contrast with the original model where the very existence of a Nash equilibrium is not guaranteed. We then consider the two extreme cases of this setting, where voters may block a withdrawn candidate with probabilities 0 or 1. In these scenarios, we study the complexity of reaching equilibria from a given initial point, converging to an equilibrium with a predermined winner or to an equilibrium with a given set of running candidates. Except for one easy case, we show that these problems are NP-complete, even when the initial point is fixed to a natural--truthful-- state where all potential candidates stand for election.", "citation": "Citations (5)", "departments": ["University of Southampton", "Tel Aviv University", "Saint Petersburg State Polytechnic University", "University of Southampton", "Mobileye Vision ... s Ltd., Israel"], "authors": ["Maria Polukarov.....http://dblp.org/pers/hd/p/Polukarov:Maria", "Svetlana Obraztsova.....http://dblp.org/pers/hd/o/Obraztsova:Svetlana", "Zinovi Rabinovich.....http://dblp.org/pers/hd/r/Rabinovich:Zinovi", "Alexander Kruglyi.....http://dblp.org/pers/hd/k/Kruglyi:Alexander", "Nicholas R. Jennings.....http://dblp.org/pers/hd/j/Jennings:Nicholas_R="], "conf": "ijcai", "year": "2015", "pages": 7}