{"title": "Algorithms for the Hard Pre-Image Problem of String Kernels and the General Problem of String Prediction.", "fields": ["heuristic", "string kernel", "string", "string searching algorithm", "branch and bound"], "abstract": "We address the pre-image problem encountered in structured output prediction and the one of finding a string maximizing the prediction function of various kernel-based classifiers and regressors. We demonstrate that these problems reduce to a common combinatorial problem valid for many string kernels. For this problem, we propose an upper bound on the prediction function which has low computational complexity and which can be used in a branch and bound search algorithm to obtain optimal solutions. We also show that for many string kernels, the complexity of the problem increases significantly when the kernel is normalized.\n\nOn the optical word recognition task, the exact solution of the pre-image problem is shown to significantly improve the prediction accuracy in comparison with an approximation found by the best known heuristic. On the task of finding a string maximizing the prediction function of kernel-based classifiers and regressors, we highlight that existing methods can be biased toward long strings that contain many repeated symbols. We demonstrate that this bias is removed when using normalized kernels. Finally, we present results for the discovery of lead compounds in drug discovery. The source code can be found at https://github.com/a-ro/preimage.", "citation": "Not cited", "year": "2015", "departments": ["Laval University", "Université de Montréal", "Laval University", "Laval University", "Laval University"], "conf": "icml", "authors": ["Sébastien Giguère.....http://dblp.org/pers/hd/g/Gigu=egrave=re:S=eacute=bastien", "Amélie Rolland.....http://dblp.org/pers/hd/r/Rolland:Am=eacute=lie", "François Laviolette.....http://dblp.org/pers/hd/l/Laviolette:Fran=ccedil=ois", "Mario Marchand.....http://dblp.org/pers/hd/m/Marchand:Mario"], "pages": 9}