{"title": "DjiNN and Tonic: DNN as a service and its implications for future warehouse scale computers.", "fields": ["deep learning", "workload", "cuda", "facial recognition system", "server"], "abstract": "As applications such as Apple Siri, Google Now, Microsoft Cortana, and Amazon Echo continue to gain traction, web-service companies are adopting large deep neural networks (DNN) for machine learning challenges such as image processing, speech recognition, natural language processing, among others. A number of open questions arise as to the design of a server platform specialized for DNN and how modern warehouse scale computers (WSCs) should be outfitted to provide DNN as a service for these applications.   In this paper, we present  DjiNN , an open infrastructure for DNN as a service in WSCs, and  Tonic Suite , a suite of 7 end-to-end applications that span image, speech, and language processing. We use DjiNN to design a high throughput DNN system based on massive GPU server designs and provide insights as to the varying characteristics across applications. After studying the throughput, bandwidth, and power properties of DjiNN and Tonic Suite, we investigate several design points for future WSC architectures. We investigate the total cost of ownership implications of having a WSC with a disaggregated GPU pool versus a WSC composed of homogeneous integrated GPU servers. We improve DNN throughput by over 120x for all but one application (40x for Facial Recognition) on an NVIDIA K40 GPU. On a GPU server composed of 8 NVIDIA K40s, we achieve near-linear scaling (around 1000x throughput improvement) for 3 of the 7 applications. Through our analysis, we also find that GPU-enabled WSCs improve total cost of ownership over CPU-only designs by 4-20x, depending on the composition of the workload", "citation": "Citations (72)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Johann Hauswald.....http://dblp.org/pers/hd/h/Hauswald:Johann", "Yiping Kang.....http://dblp.org/pers/hd/k/Kang:Yiping", "Michael A. Laurenzano.....http://dblp.org/pers/hd/l/Laurenzano:Michael_A=", "Quan Chen.....http://dblp.org/pers/hd/c/Chen_0002:Quan", "Cheng Li.....http://dblp.org/pers/hd/l/Li:Cheng", "Trevor N. Mudge.....http://dblp.org/pers/hd/m/Mudge:Trevor_N=", "Ronald G. Dreslinski.....http://dblp.org/pers/hd/d/Dreslinski:Ronald_G=", "Jason Mars.....http://dblp.org/pers/hd/m/Mars:Jason", "Lingjia Tang.....http://dblp.org/pers/hd/t/Tang:Lingjia"], "conf": "isca", "year": "2015", "pages": 14}