{"title": "Query Optimization Time: The New Bottleneck in Real-time Analytics.", "fields": ["spatial query", "web query classification", "bottleneck", "sargable", "web search query"], "abstract": "In the recent past, in-memory distributed database management systems have become increasingly popular to manage and query huge amounts of data. For an in-memory distributed database like MemSQL, it is imperative that the analytical queries run fast. A huge proportion of MemSQL's customer workloads have ad-hoc analytical queries that need to finish execution within a second or a few seconds. This leaves us with very little time to perform query optimization for complex queries involving several joins, aggregations, sub-queries etc. Even for queries that are not ad-hoc, a change in data statistics can trigger query re-optimization. Query Optimization, if not done intelligently, could very well be the bottleneck for such complex analytical queries that require real-time response. In this paper, we outline some of the early steps that we have taken to reduce the query optimization time without sacrificing plan quality. We optimized the Enumerator (the optimizer component that determines operator order), which takes up bulk of the optimization time. Generating bushy plans inside the Enumerator can be a bottleneck and so we used heuristics to generate bushy plans via query rewrite. We also implemented new distribution aware greedy heuristics to generate a good starting candidate plan that significantly prunes out states during search space analysis inside the Enumerator. We demonstrate the effectiveness of these techniques over several queries in TPC-H and TPC-DS benchmarks.", "citation": "Citations (3)", "departments": ["MemSQL Inc., 53 ... CA 94107, U.S.A", "MemSQL Inc., 53 ... CA 94107, U.S.A", "MemSQL Inc., 53 ... CA 94107, U.S.A"], "authors": ["Rajkumar Sen.....http://dblp.org/pers/hd/s/Sen:Rajkumar", "Jack Chen.....http://dblp.org/pers/hd/c/Chen:Jack", "Nika Jimsheleishvilli.....http://dblp.org/pers/hd/j/Jimsheleishvilli:Nika"], "conf": "vldb", "year": "2015", "pages": 6}