{"title": "Fast Garbling of Circuits Under Standard Assumptions.", "fields": ["electronic engineering", "pseudorandom function family", "cryptographic primitive", "secure two party computation", "secure multi party computation", "random permutation", "electronic circuit", "computer science", "key"], "abstract": "Protocols for secure computation enable mutually distrustful parties to jointly compute on their private inputs without revealing anything but the result. Over recent years, secure computation has become practical and considerable effort has been made to make it more and more efficient. A highly important tool in the design of two-party protocols is Yao's garbled circuit construction (Yao 1986), and multiple optimizations on this primitive have led to performance improvements of orders of magnitude over the last years. However, many of these improvements come at the price of making very strong assumptions on the underlying cryptographic primitives being used (e.g., that AES is secure for related keys, that it is circular secure, and even that it behaves like a random permutation when keyed with a public fixed key). The justification behind making these strong assumptions has been that otherwise it is not possible to achieve fast garbling and thus fast secure computation. In this paper, we take a step back and examine whether it is really the case that such strong assumptions are needed. We provide new methods for garbling that are secure solely under the assumption that the primitive used (e.g., AES) is a pseudorandom function. Our results show that in many cases, the penalty incurred is not significant, and so a more conservative approach to the assumptions being used can be adopted.", "citation": "Not cited", "year": "2015", "departments": ["University of Haifa", "Bar-Ilan University", "Bar-Ilan University", "Bar-Ilan University", "University of Haifa", "Bar-Ilan University", "Bar-Ilan University", "Bar-Ilan University"], "conf": "ccs", "authors": ["Shay Gueron.....http://dblp.org/pers/hd/g/Gueron:Shay", "Yehuda Lindell.....http://dblp.org/pers/hd/l/Lindell:Yehuda", "Ariel Nof.....http://dblp.org/pers/hd/n/Nof:Ariel", "Benny Pinkas.....http://dblp.org/pers/hd/p/Pinkas:Benny"], "pages": 12}