{"title": "Resisting three-dimensional manipulations in distributed wireless spectrum auctions.", "fields": ["auction theory", "common value auction", "frequency allocation", "spectrum auction", "mechanism design"], "abstract": "Auctions are believed to be effective methods to solve the problem of wireless spectrum allocation. Existing spectrum auction mechanisms are all centralized and suffer from several critical drawbacks of the centralized systems, which motivates the design of distributed spectrum auction mechanisms. However, extending a centralized spectrum auction to a distributed one broadens the strategy space of agents from one dimension (bid) to three dimensions (bid, communication, and computation), and thus cannot be solved by traditional approaches from mechanism design. In this paper, we propose two distributed spectrum auction mechanisms, namely distributed VCG and FAITH. Distributed VCG implements the celebrated Vickrey-Clarke-Groves mechanism in a distributed fashion to achieve optimal social welfare, at the cost of exponential communication overhead. In contrast, FAITH achieves sub-optimal social welfare with tractable computation and communication overhead. We prove that both of the two proposed mechanisms achieve faithfulness, i.e., the agents' individual utilities are maximized, if they follow the intended strategies. We also implement FAITH and evaluate its performance in various setups. Evaluation results show that FAITH achieves superior performance compared with the Nash equilibrium based approach.", "citation": "Citations (3)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Texas at Dallas"], "authors": ["Dan Peng.....http://dblp.org/pers/hd/p/Peng:Dan", "Shuo Yang.....http://dblp.org/pers/hd/y/Yang:Shuo", "Fan Wu.....http://dblp.org/pers/hd/w/Wu_0006:Fan", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Tie Luo.....http://dblp.org/pers/hd/l/Luo:Tie"], "conf": "infocom", "year": "2015", "pages": 9}