{"title": "Efficient dependency detection for safe Java test acceleration.", "fields": ["java", "test case", "test suite", "build verification test", "wait"], "abstract": "Slow builds remain a plague for software developers. The frequency with which code can be built (compiled, tested and packaged) directly impacts the productivity of developers: longer build times mean a longer wait before determining if a change to the application being built was successful. We have discovered that in the case of some languages, such as Java, the majority of build time is spent running tests, where dependencies between individual tests are complicated to discover, making many existing test acceleration techniques unsound to deploy in practice. Without knowledge of which tests are dependent on others, we cannot safely parallelize the execution of the tests, nor can we perform incremental testing (i.e., execute only a subset of an application's tests for each build). The previous techniques for detecting these dependencies did not scale to large test suites: given a test suite that normally ran in two hours, the best-case running scenario for the previous tool would have taken over 422 CPU days to find dependencies between all test methods (and would not soundly find all dependencies) — on the same project the exhaustive technique (to find all dependencies) would have taken over 1e300 years. We present a novel approach to detecting all dependencies between test cases in large projects that can enable safe exploitation of parallelism and test selection with a modest analysis cost.", "citation": "Citations (11)", "departments": ["Columbia University", "Columbia University", "Electric Cloud, USA", "Electric Cloud, USA"], "authors": ["Jonathan Bell.....http://dblp.org/pers/hd/b/Bell_0001:Jonathan", "Gail E. Kaiser.....http://dblp.org/pers/hd/k/Kaiser:Gail_E=", "Eric Melski.....http://dblp.org/pers/hd/m/Melski:Eric", "Mohan Dattatreya.....http://dblp.org/pers/hd/d/Dattatreya:Mohan"], "conf": "sigsoft", "year": "2015", "pages": 12}