{"title": "On the co-existence of distributed and centralized routing control-planes.", "fields": ["distance vector routing protocol", "routing domain", "multipath routing", "equal cost multi path routing", "wireless routing protocol"], "abstract": "Network operators can and do deploy multiple routing control-planes, e.g., by running different protocols or instances of the same protocol. With the rise of SDN, multiple control-planes are likely to become even more popular, e.g., to enable hybrid SDN or multi-controller deployments. Unfortunately, previous works do not apply to arbitrary combinations of centralized and distributed control-planes. In this paper, we develop a general theory for coexisting control-planes. We provide a novel, exhaustive classification of existing and future control-planes (e.g., OSPF, EIGRP, and Open-Flow) based on fundamental control-plane properties that we identify. Our properties are general enough to study centralized and distributed control-planes under a common framework. We show that multiple uncoordinated control-planes can cause forwarding anomalies whose type solely depends on the identified properties. To show the wide applicability of our framework, we leverage our theoretical insight to (i) provide sufficient conditions to avoid anomalies, (ii) propose configuration guidelines, and (iii) define a provably-safe procedure for reconfigurations from any (combination of) control-planes to any other. Finally, we discuss prominent consequences of our findings on the deployment of new paradigms (notably, SDN) and previous research works.", "citation": "Citations (15)", "departments": ["Université catholique de Louvain", "Université catholique de Louvain", "Naval Postgraduate School", "Princeton University", "RomaTre University"], "authors": ["Stefano Vissicchio.....http://dblp.org/pers/hd/v/Vissicchio:Stefano", "Luca Cittadini.....http://dblp.org/pers/hd/c/Cittadini:Luca", "Olivier Bonaventure.....http://dblp.org/pers/hd/b/Bonaventure:Olivier", "Geoffrey G. Xie.....http://dblp.org/pers/hd/x/Xie:Geoffrey_G=", "Laurent Vanbever.....http://dblp.org/pers/hd/v/Vanbever:Laurent"], "conf": "infocom", "year": "2015", "pages": 9}