{"title": "Analytics in Motion: High Performance Event-Processing AND Real-Time Analytics in the Same Database.", "fields": ["analytics", "online analytical processing", "complex event processing", "queries per second", "online transaction processing"], "abstract": "Modern data-centric flows in the telecommunications industry require real time analytical processing over a rapidly changing and large dataset. The traditional approach of separating OLTP and OLAP workloads cannot satisfy this requirement. Instead, a new class of integrated solutions for handling hybrid workloads is needed. This paper presents an industrial use case and a novel architecture that integrates key-value-based event processing and SQL-based analytical processing on the same distributed store while minimizing the total cost of ownership. Our approach combines several well-known techniques such as shared scans, delta processing, a PAX-fashioned storage layout, and an interleaving of scanning and delta merging in a completely new way. Performance experiments show that our system scales out linearly with the number of servers. For instance, our system sustains event streams of 100,000 events per second while simultaneously processing 100 ad-hoc analytical queries per second, using a cluster of 12 commodity servers. In doing so, our system meets all response time goals of our telecommunication customers; that is, 10 milliseconds per event and 100 milliseconds for an ad-hoc analytical query. Moreover, our system beats commercial competitors by a factor of 2.5 in analytical and two orders of magnitude in update performance.", "citation": "Citations (13)", "year": "2015", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich"], "conf": "sigmod", "authors": ["Lucas Braun.....http://dblp.org/pers/hd/b/Braun:Lucas", "Thomas Etter.....http://dblp.org/pers/hd/e/Etter:Thomas", "Georgios Gasparis.....http://dblp.org/pers/hd/g/Gasparis:Georgios", "Martin Kaufmann.....http://dblp.org/pers/hd/k/Kaufmann:Martin", "Donald Kossmann.....http://dblp.org/pers/hd/k/Kossmann:Donald", "Daniel Widmer.....http://dblp.org/pers/hd/w/Widmer:Daniel", "Aharon Avitzur.....http://dblp.org/pers/hd/a/Avitzur:Aharon", "Anthony Iliopoulos.....http://dblp.org/pers/hd/i/Iliopoulos:Anthony", "Eliezer Levy.....http://dblp.org/pers/hd/l/Levy:Eliezer", "Ning Liang.....http://dblp.org/pers/hd/l/Liang:Ning"], "pages": 14}