{"title": "Indexing Metric Uncertain Data for Range Queries.", "fields": ["small set", "uncertain data", "range query", "probabilistic logic", "metric tree"], "abstract": "Range queries in metric spaces have applications in many areas such as multimedia retrieval, computational biology, and location-based services, where metric uncertain data exists in different forms, resulting from equipment limitations, high-throughput sequencing technologies, privacy preservation, or others. In this paper, we represent metric uncertain data by using an object-level model and a bi-level model, respectively. Two novel indexes, the uncertain pivot B+-tree (UPB-tree) and the uncertain pivot B+-forest (UPB-forest), are proposed accordingly in order to support probabilistic range queries w.r.t. a wide range of uncertain data types and similarity metrics. Both index structures use a small set of effective pivots chosen based on a newly defined criterion, and employ the B+-tree(s) as the underlying index. By design, they are easy to be integrated into any existing DBMS. In addition, we present efficient metric probabilistic range query algorithms, which utilize the validation and pruning techniques based on our derived probability lower and upper bounds. Extensive experiments with both real and synthetic data sets demonstrate that, compared against existing state-of-the-art indexes for metric uncertain data, the UPB-tree and UPB-forest incur much lower construction costs, consume smaller storage spaces, and can support more efficient metric probabilistic range queries.", "citation": "Citations (3)", "year": "2015", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Aalborg University", "Zhejiang University"], "conf": "sigmod", "authors": ["Lu Chen.....http://dblp.org/pers/hd/c/Chen:Lu", "Yunjun Gao.....http://dblp.org/pers/hd/g/Gao:Yunjun", "Xinhan Li.....http://dblp.org/pers/hd/l/Li:Xinhan", "Christian S. Jensen.....http://dblp.org/pers/hd/j/Jensen:Christian_S=", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Baihua Zheng.....http://dblp.org/pers/hd/z/Zheng:Baihua"], "pages": 15}