{"title": "GraphQ: Graph Query Processing with Abstraction Refinement - Scalable and Programmable Analytics over Very Large Graphs on a Single PC.", "fields": ["graph product", "complement graph", "clique width", "graph operations", "graph property"], "abstract": "This paper introduces GraphQ, a scalable querying framework for very large graphs. GraphQ is built on a key insight that many interesting graph properties -- such as finding cliques of a certain size, or finding vertices with a certain page rank -- can be effectively computed by exploring only a small fraction of the graph, and traversing the complete graph is an overkill. The centerpiece of our framework is the novel idea of abstraction refinement, where the very large graph is represented as multiple levels of abstractions, and a query is processed through iterative refinement across graph abstraction levels. As a result, GraphQ enjoys several distinctive traits unseen in existing graph processing systems: query processing is naturally budget-aware, friendly for out-of-core processing when \"Big Graphs\" cannot entirely fit into memory, and endowed with strong correctness properties on query answers. With GraphQ, a wide range of complex analytical queries over very large graphs can be answered with resources affordable to a single PC, which complies with the recent trend advocating single-machine-based Big Data processing.\n\nExperiments show GraphQ can answer queries in graphs 4-6 times bigger than the memory capacity, only in several seconds to minutes. In contrast, GraphChi, a state-of-the-art graph processing system, takes hours to days to compute a whole-graph solution. An additional comparison with a modified version of GraphChi that terminates immediately when a query is answered shows that GraphQ is on average 1.6-13.4× faster due to its ability to process partial graphs.", "citation": "Citations (23)", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Davis", "Binghamton University"], "authors": ["Kai Wang.....http://dblp.org/pers/hd/w/Wang:Kai", "Guoqing (Harry) Xu.....http://dblp.org/pers/hd/x/Xu:Guoqing_=Harry=", "Zhendong Su.....http://dblp.org/pers/hd/s/Su:Zhendong", "Yu David Liu.....http://dblp.org/pers/hd/l/Liu:Yu_David"], "conf": "usenix", "year": "2015", "pages": 15}