{"title": "Predictive tree: An efficient index for predictive queries on road networks.", "fields": ["probabilistic logic", "advanced traffic management system", "overhead", "extensibility", "user defined function"], "abstract": "Predictive queries on moving objects offer an important category of location-aware services based on the objects' expected future locations. A wide range of applications utilize this type of services, e.g., traffic management systems, location-based advertising, and ride sharing systems. This paper proposes a novel index structure, named Predictive tree (P-tree), for processing predictive queries against moving objects on road networks. The predictive tree: (1) provides a generic infrastructure for answering the common types of predictive queries including predictive point, range, KNN, and aggregate queries, (2) updates the probabilistic prediction of the object's future locations dynamically and incrementally as the object moves around on the road network, and (3) provides an extensible mechanism to customize the probability assignments of the object's expected future locations, with the help of user defined functions. The proposed index enables the evaluation of predictive queries in the absence of the objects' historical trajectories. Based solely on the connectivity of the road network graph and assuming that the object follows the shortest route to destination, the predictive tree determines the reachable nodes of a moving object within a specified time window T in the future. The predictive tree prunes the space around each moving object in order to reduce computation, and increase system efficiency. Tunable threshold parameters control the behavior of the predictive trees by trading the maximum prediction time and the details of the reported results on one side for the computation and memory overheads on the other side. The predictive tree is integrated in the context of the iRoad system in two different query processing modes, namely, the precomputed query result mode, and the on-demand query result mode. Extensive experimental results based on large scale real and synthetic datasets confirm that the predictive tree achieves better accuracy compared to the existing related work, and scales up to support a large number of moving objects and heavy predictive query workloads.", "citation": "Citations (16)", "departments": ["University of Washington", "University of Minnesota", "University of Minnesota", "Microsoft"], "authors": ["Abdeltawab M. Hendawi.....http://dblp.org/pers/hd/h/Hendawi:Abdeltawab_M=", "Jie Bao.....http://dblp.org/pers/hd/b/Bao_0003:Jie", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F=", "Mohamed H. Ali.....http://dblp.org/pers/hd/a/Ali:Mohamed_H="], "conf": "icde", "year": "2015", "pages": 12}