{"title": "Backpressure meets taxes: Faithful data collection in stochastic mobile phone sensing systems.", "fields": ["incentive compatibility", "asymptotically optimal algorithm", "lyapunov optimization", "mobile broadband", "android"], "abstract": "The use of sensor-enabled smart phones is considered to be a promising solution to large-scale urban data collection. In current approaches to mobile phone sensing systems (MPSS), phones directly transmit their sensor readings through cellular radios to the server. However, this simple solution suffers from not only significant costs in terms of energy and mobile data usage, but also produces heavy traffic loads on bandwidth-limited cellular networks. To address this issue, this paper investigates cost-effective data collection solutions for MPSS using hybrid cellular and opportunistic short-range communications. We first develop an adaptive and distribute algorithm OptMPSS to maximize phone user financial rewards accounting for their costs across the MPSS. To incentivize phone users to participate, while not subverting the behavior of OptMPSS, we then propose BMT, the first algorithm that merges stochastic Lyapunov optimization with mechanism design theory. We show that our proven incentive compatible approaches achieve an asymptotically optimal gross profit for all phone users. Experiments with Android phones and trace-driven simulations verify our theoretical analysis and demonstrate that our approach manages to improve the system performance significantly (around 100%) while confirming that our system achieves incentive compatibility, individual rationality, and server profitability.", "citation": "Citations (9)", "departments": ["University of Liverpool", "Imperial College London", "Imperial College London"], "authors": ["Shusen Yang.....http://dblp.org/pers/hd/y/Yang:Shusen", "Usman Adeel.....http://dblp.org/pers/hd/a/Adeel:Usman", "Julie A. McCann.....http://dblp.org/pers/hd/m/McCann:Julie_A="], "conf": "infocom", "year": "2015", "pages": 9}