{"title": "Are Students Representatives of Professionals in Software Engineering Experiments?", "fields": ["software walkthrough", "team software process", "software quality analyst", "software engineering process group", "software peer review"], "abstract": "Abstract -- Background: Most of the experiments in software engineering (SE) employ students as subjects. This raises concerns about the realism of the results acquired through students and adaptability of the results to software industry. Aim: We compare students and professionals to understand how well students represent professionals as experimental subjects in SE research. Method: The comparison was made in the context of two test-driven development experiments conducted with students in an academic setting and with professionals in a software organization. We measured the code quality of several tasks implemented by both subject groups and checked whether students and professionals perform similarly in terms of code quality metrics. Results: Except for minor differences, neither of the subject groups is better than the other. Professionals produce larger, yet less complex, methods when they use their traditional development approach, whereas both subject groups perform similarly when they apply a new approach for the first time. Conclusion: Given a carefully scoped experiment on a development approach that is new to both students and professionals, similar performances are observed. Further investigation is necessary to analyze the effects of subject demographics and level of experience on the results of SE experiments.", "citation": "Citations (81)", "departments": ["University of Oulu", "Istanbul Technical University", "Technical University of Madrid"], "authors": ["Iflaah Salman.....http://dblp.org/pers/hd/s/Salman:Iflaah", "Ayse Tosun Misirli.....http://dblp.org/pers/hd/m/Misirli:Ayse_Tosun", "Natalia Juristo Juzgado.....http://dblp.org/pers/hd/j/Juzgado:Natalia_Juristo"], "conf": "icse", "year": "2015", "pages": 11}