{"title": "Skew-Aware Join Optimization for Array Databases.", "fields": ["sparse array", "array dbms", "dynamic array", "joins", "sort merge join"], "abstract": "Science applications are accumulating an ever-increasing amount of multidimensional data. Although some of it can be processed in a relational database, much of it is better suited to array-based engines. As such, it is important to optimize the query processing of these systems. This paper focuses on efficient query processing of join operations within an array database. These engines invariably ``chunk'' their data into multidimensional tiles that they use to efficiently process spatial queries. As such, traditional relational algorithms need to be substantially modified to take advantage of array tiles. Moreover, most  n -dimensional science data is unevenly distributed in array space because its underlying observations rarely follow a uniform pattern. It is crucial that the optimization of array joins be skew-aware. In addition, owing to the scale of science applications, their query processing usually spans multiple nodes. This further complicates the planning of array joins.   In this paper, we introduce a join optimization framework that is skew-aware for distributed joins. This optimization consists of two phases. In the first, a logical planner selects the query's algorithm (e.g., merge join), the granularity of the its tiles, and the reorganization operations needed to align the data. The second phase implements this logical plan by assigning tiles to cluster nodes using an analytical cost model. Our experimental results, on both synthetic and real-world data, demonstrate that this optimization framework speeds up array joins by up to 2.5X in comparison to the baseline.", "citation": "Citations (9)", "year": "2015", "departments": ["Northwestern University", "Brandeis University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "sigmod", "authors": ["Jennie Duggan.....http://dblp.org/pers/hd/d/Duggan:Jennie", "Olga Papaemmanouil.....http://dblp.org/pers/hd/p/Papaemmanouil:Olga", "Leilani Battle.....http://dblp.org/pers/hd/b/Battle:Leilani", "Michael Stonebraker.....http://dblp.org/pers/hd/s/Stonebraker:Michael"], "pages": 13}