{"title": "Local face-view barrier coverage in camera sensor networks.", "fields": ["battlefield", "government", "software deployment", "intrusion", "image sensor"], "abstract": "Barrier coverage in visual camera sensor networks (visual barrier coverage) has important real-world applications like battlefield surveillance, environmental monitoring, and protection of government property. Cost-effective deployment, a fundamental issue of visual barrier coverage, considers how to deploy the fewest camera sensors along the barrier to detect intruders (e.g., capture faces) with desirable performance. Existing visual barrier coverage approaches like full-view coverage require numerous camera sensors for capturing intruders' faces deterministically for any trajectory and facing angle. However, intruders' trajectories and facing angles are bounded and deterministic intruder detection requires many camera sensors for rare intrusion cases. Certain practical applications can tolerate limited intrusion mis-detection given budget limitations. This paper proposes local face-view barrier coverage, a novel concept that achieves statistical barrier coverage in camera sensor networks leveraging intruders' trajectory lengths l along the barrier and head rotation angles δ. Using (l, δ) and other parameters, we derive a rigorous probability bound for intruder detection for local face-view barrier coverage via a feasible deployment pattern. Our detection probability bound and deployment pattern can guide practical camera sensor network deployments with camera sensor budgets. Extensive evaluations show that local face-view barrier coverage requires up to 50% fewer camera sensors than full-view barrier coverage.", "citation": "Citations (14)", "departments": ["University of Science and Technology, Sana'a", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Zuoming Yu.....http://dblp.org/pers/hd/y/Yu:Zuoming", "Fan Yang.....http://dblp.org/pers/hd/y/Yang:Fan", "Jin Teng.....http://dblp.org/pers/hd/t/Teng:Jin", "Adam C. Champion.....http://dblp.org/pers/hd/c/Champion:Adam_C=", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong"], "conf": "infocom", "year": "2015", "pages": 9}