{"title": "Budget-Constrained Item Cold-Start Handling in Collaborative Filtering Recommenders via Optimal Design.", "fields": ["cold start", "budget constraint", "recommender system", "baseline", "collaborative filtering"], "abstract": "It is well known that collaborative filtering (CF) based recommender systems provide better modeling of users and items associated with considerable rating history. The lack of historical ratings results in the user and the item cold-start problems. The latter is the main focus of this work. Most of the current literature addresses this problem by integrating content-based recommendation techniques to model the new item. However, in many cases such content is not available, and the question arises is whether this problem can be mitigated using CF techniques only. We formalize this problem as an optimization problem: given a new item, a pool of available users, and a budget constraint, select which users to assign with the task of rating the new item in order to minimize the prediction error of our model. We show that the objective function is monotone-supermodular, and propose efficient optimal design based algorithms that attain an approximation to its optimum. Our findings are verified by an empirical study using the Netflix dataset, where the proposed algorithms outperform several baselines for the problem at hand.", "citation": "Citations (11)", "departments": ["Technion – Israel Institute of Technology", "Yahoo!", "Yahoo!", "Yahoo!", "Outbrain Inc.,  ... etanya, Israel"], "authors": ["Oren Anava.....http://dblp.org/pers/hd/a/Anava:Oren", "Shahar Golan.....http://dblp.org/pers/hd/g/Golan:Shahar", "Nadav Golbandi.....http://dblp.org/pers/hd/g/Golbandi:Nadav", "Zohar Shay Karnin.....http://dblp.org/pers/hd/k/Karnin:Zohar_Shay", "Ronny Lempel.....http://dblp.org/pers/hd/l/Lempel:Ronny", "Oleg Rokhlenko.....http://dblp.org/pers/hd/r/Rokhlenko:Oleg", "Oren Somekh.....http://dblp.org/pers/hd/s/Somekh:Oren"], "conf": "www", "year": "2015", "pages": 10}