{"title": "FrauDetector: A Graph-Mining-based Framework for Fraudulent Phone Call Detection.", "fields": ["binary classification", "phone", "bipartite graph", "graph", "hits algorithm"], "abstract": "In recent years, fraud is increasing rapidly with the development of modern technology and global communication. Although many literatures have addressed the fraud detection problem, these existing works focus only on formulating the fraud detection problem as a binary classification problem. Due to limitation of information provided by telecommunication records, such classifier-based approaches for fraudulent phone call detection normally do not work well. In this paper, we develop a graph-mining-based fraudulent phone call detection framework for a mobile application to automatically annotate fraudulent phone numbers with a \"fraud\" tag, which is a crucial prerequisite for distinguishing fraudulent phone calls from normal phone calls. Our detection approach performs a weighted HITS algorithm to learn the trust value of a remote phone number. Based on telecommunication records, we build two kinds of directed bipartite graph: i) CPG and ii) UPG to represent telecommunication behavior of users. To weight the edges of CPG and UPG, we extract features for each pair of user and remote phone number in two different yet complementary aspects: 1) duration relatedness (DR) between user and phone number; and 2) frequency relatedness (FR) between user and phone number. Upon weighted CPG and UPG, we determine a trust value for each remote phone number. Finally, we conduct a comprehensive experimental study based on a dataset collected through an anti-fraud mobile application, Whoscall. The results demonstrate the effectiveness of our weighted HITS-based approach and show the strength of taking both DR and FR into account in feature extraction.", "citation": "Citations (9)", "departments": ["National Chiao Tung University", "National Chiao Tung University", "National Cheng Kung University", "Academia Sinica", "Gogolook Co. Lt ... pei, Taiwan Roc"], "authors": ["Vincent S. Tseng.....http://dblp.org/pers/hd/t/Tseng:Vincent_S=", "Jia-Ching Ying.....http://dblp.org/pers/hd/y/Ying:Jia=Ching", "Che-Wei Huang.....http://dblp.org/pers/hd/h/Huang:Che=Wei", "Yimin Kao.....http://dblp.org/pers/hd/k/Kao:Yimin", "Kuan-Ta Chen.....http://dblp.org/pers/hd/c/Chen:Kuan=Ta"], "conf": "kdd", "year": "2015", "pages": 10}