{"title": "LASSO with Non-linear Measurements is Equivalent to One With Linear Measurements.", "fields": ["standard normal table", "regularization", "estimator", "proportionality", "lasso"], "abstract": "Consider estimating an unknown, but structured (e.g. sparse, low-rank, etc.), signal x0 ∈ ℝn from a vector y ∈ ℝm of measurements of the form yi = gi(aiT x0), where the ai's are the rows of a known measurement matrix A, and, g(·) is a (potentially unknown) nonlinear and random link-function. Such measurement functions could arise in applications where the measurement device has nonlinearities and uncertainties. It could also arise by design, e.g., gi (x) = sign(x + zi), corresponds to noisy 1-bit quantized measurements. Motivated by the classical work of Brillinger, and more recent work of Plan and Vershynin, we estimate x0 via solving the Generalized-LASSO, i.e., x^ := arg minx ‖y - Ax0‖2 + λf(x) for some regularization parameter λ > 0 and some (typically non-smooth) convex regularizer f(·) that promotes the structure of x0, e.g. l1-norm, nuclear-norm, etc. While this approach seems to naively ignore the nonlinear function g(·), both Brillinger (in the non-constrained case) and Plan and Vershynin have shown that, when the entries of A are iid standard normal, this is a good estimator of x0 up to a constant of proportionality μ, which only depends on g(·). In this work, we considerably strengthen these results by obtaining explicit expressions for‖x^—μx0‖2, for the regularized Generalized-LASSO, that are asymptotically precise when m and n grow large. A main result is that the estimation performance of the Generalized LASSO with non-linear measurements is asymptotically the same as one whose measurements are linear yi = μaiTx0 + σzi, with μ = Eγg(γ) and σ2 = E(g(γ) - μγ)2, and, γ standard normal. To the best of our knowledge, the derived expressions on the estimation performance are the first-known precise results in this context. One interesting consequence of our result is that the optimal quantizer of the measurements that minimizes the estimation error of the Generalized LASSO is the celebrated Lloyd-Max quantizer.", "citation": "Citations (28)", "year": "2015", "departments": ["California Institute of Technology", "California Institute of Technology", "California Institute of Technology"], "conf": "nips", "authors": ["Christos Thrampoulidis.....http://dblp.org/pers/hd/t/Thrampoulidis:Christos", "Ehsan Abbasi.....http://dblp.org/pers/hd/a/Abbasi:Ehsan", "Babak Hassibi.....http://dblp.org/pers/hd/h/Hassibi:Babak"], "pages": 9}