{"title": "An empirical study of goto in C code from GitHub repositories.", "fields": ["commit", "empirical research", "goto", "dijkstra s algorithm", "control flow"], "abstract": "It is nearly 50 years since Dijkstra argued that goto obscures the flow of control in program execution and urged programmers to abandon the goto statement. While past research has shown that goto is still in use, little is known about whether goto is used in the unrestricted manner that Dijkstra feared, and if it is ‘harmful’ enough to be a part of a post-release bug. We, therefore, conduct a two part empirical study - (1) qualitatively analyze a statistically rep- resentative sample of 384 files from a population of almost 250K C programming language files collected from over 11K GitHub repositories and find that developers use goto in C files for error handling (80.21±5%) and cleaning up resources at the end of a procedure (40.36 ± 5%); and (2) quantitatively analyze the commit history from the release branches of six OSS projects and find that no goto statement was re- moved/modified in the post-release phase of four of the six projects. We conclude that developers limit themselves to using goto appropriately in most cases, and not in an unrestricted manner like Dijkstra feared, thus suggesting that goto does not appear to be harmful in practice.", "citation": "Citations (5)", "departments": ["Rochester Institute of Technology", "University of Chile", "Kyushu University", "University of Chile", "McGill University"], "authors": ["Meiyappan Nagappan.....http://dblp.org/pers/hd/n/Nagappan:Meiyappan", "Romain Robbes.....http://dblp.org/pers/hd/r/Robbes:Romain", "Yasutaka Kamei.....http://dblp.org/pers/hd/k/Kamei:Yasutaka", "Éric Tanter.....http://dblp.org/pers/hd/t/Tanter:=Eacute=ric", "Shane McIntosh.....http://dblp.org/pers/hd/m/McIntosh:Shane", "Audris Mockus.....http://dblp.org/pers/hd/m/Mockus:Audris", "Ahmed E. Hassan.....http://dblp.org/pers/hd/h/Hassan:Ahmed_E="], "conf": "sigsoft", "year": "2015", "pages": 11}