{"title": "Improving the scalability of the ocean barotropic solver in the community earth system model.", "fields": ["conjugate gradient method", "barotropic fluid", "speedup", "scalability", "solver"], "abstract": "High-resolution climate simulations are increasingly in demand and require tremendous computing resources. In the Community Earth SystemModel (CESM), the Parallel Ocean Model (POP) is computationally expensive for high-resolution grids (e.g., 0.1°) and is frequently the least scalable component of CESM for certain production simulations. In particular, the modified Preconditioned Conjugate Gradient (PCG), used to solve the elliptic system of equations in the barotropic mode, scales poorly at the high core counts, which is problematic for high-resolution simulations. In this work, we demonstrate that the communication costs in the barotropic solver occupy an increasing portion of the total POP execution time as core counts are increased. To mitigate this problem, we implement a preconditioned Chebyshev-type iterative method in POP (called P-CSI), which requires far fewer global reductions than PCG. We also develop an effective block preconditioner based on the Error Vector Propagation Method to attain a competitive convergence rate for P-CSI. We demonstrate that the improved scalability of P-CSI results in a 5.2x speedup of the barotropic mode in high-resolution POP on 16,875 cores, which yields a 1.7x speedup of the overall POP simulation. Further, we ensure that the new solver produces an ocean climate consistent with the original one via an ensemble-based statistical method.", "citation": "Citations (4)", "year": "2015", "departments": ["Tsinghua University", "Tsinghua University", "National Center for Atmospheric Research", "National Center for Atmospheric Research", "National Center for Atmospheric Research"], "conf": "sc", "authors": ["Yong Hu.....http://dblp.org/pers/hd/h/Hu:Yong", "Xiaomeng Huang.....http://dblp.org/pers/hd/h/Huang:Xiaomeng", "Allison H. Baker.....http://dblp.org/pers/hd/b/Baker:Allison_H=", "Yu-heng Tseng.....http://dblp.org/pers/hd/t/Tseng:Yu=heng", "Frank O. Bryan.....http://dblp.org/pers/hd/b/Bryan:Frank_O=", "John M. Dennis.....http://dblp.org/pers/hd/d/Dennis:John_M=", "Guangwen Yang.....http://dblp.org/pers/hd/y/Yang:Guangwen"], "pages": 12}