{"title": "Panoptic Studio: A Massively Multiview System for Social Motion Capture.", "fields": ["streams", "motion capture", "social group", "studio", "trajectory"], "abstract": "We present an approach to capture the 3D structure and motion of a group of people engaged in a social interaction. The core challenges in capturing social interactions are: (1) occlusion is functional and frequent, (2) subtle motion needs to be measured over a space large enough to host a social group, and (3) human appearance and configuration variation is immense. The Panoptic Studio is a system organized around the thesis that social interactions should be measured through the perceptual integration of a large variety of view points. We present a modularized system designed around this principle, consisting of integrated structural, hardware, and software innovations. The system takes, as input, 480 synchronized video streams of multiple people engaged in social activities, and produces, as output, the labeled time-varying 3D structure of anatomical landmarks on individuals in the space. The algorithmic contributions include a hierarchical approach for generating skeletal trajectory proposals, and an optimization framework for skeletal reconstruction with trajectory re-association.", "citation": "Citations (21)", "year": "2015", "departments": ["Carnegie Mellon University", "Ocean University of China", "Hunan University", "Ocean University of China"], "conf": "iccv", "authors": ["Hanbyul Joo.....http://dblp.org/pers/hd/j/Joo:Hanbyul", "Hao Liu.....http://dblp.org/pers/hd/l/Liu:Hao", "Lei Tan.....http://dblp.org/pers/hd/t/Tan:Lei", "Lin Gui.....http://dblp.org/pers/hd/g/Gui:Lin", "Bart C. Nabbe.....http://dblp.org/pers/hd/n/Nabbe:Bart_C=", "Iain A. Matthews.....http://dblp.org/pers/hd/m/Matthews:Iain_A=", "Takeo Kanade.....http://dblp.org/pers/hd/k/Kanade:Takeo", "Shohei Nobuhara.....http://dblp.org/pers/hd/n/Nobuhara:Shohei", "Yaser Sheikh.....http://dblp.org/pers/hd/s/Sheikh:Yaser"], "pages": 9}