{"title": "The role of dimensional symmetry on bimanual psychomotor skills education in immersive virtual environments.", "fields": ["immersion", "user experience design", "psychomotor learning", "metaphor", "cognitive load"], "abstract": "The need for virtual reality applications for education and training involving bimanual dexterous activities has been increasing in recent years. However, it is unclear how the amount of correspondence between a virtual interaction metaphor to the real-world equivalent, otherwise known as dimensional symmetry, affects bimanual pscyhomotor skills training and how skills learned in the virtual simulation transfer to the real world. How does the number of degrees of freedom enhance or hinder the learning process? Does the increase in dimensional symmetry affect cognitive load? In an empirical evaluation, we compare the effectiveness of a natural 6-DOF interaction metaphor to a simplified 3-DOF metaphor. Our simulation interactively educates users in the step-by-step process of taking a precise measurement using calipers and micrometers in a simulated technical workbench environment. We conducted a usability study to evaluate the user experience and pedagogical benefits using measures including a pre and post cognition questionnaire over all levels of Bloom's taxonomy, workload assessment, system usability, and real world psychomotor assessment tasks. Results from the pre and post cognition questionnaires suggest that learning outcomes improved throughout all levels of Bloom's taxonomy for both conditions, and trends in the data suggest that the 6-DOF metaphor was more effective in real-world skill transference compared to the 3-DOF metaphor.", "citation": "Citations (4)", "departments": ["Clemson University", "Clemson University", "Clemson University", "Clemson University", "Clemson University"], "authors": ["Jeffrey W. Bertrand.....http://dblp.org/pers/hd/b/Bertrand:Jeffrey_W=", "David Brickler.....http://dblp.org/pers/hd/b/Brickler:David", "Sabarish V. Babu.....http://dblp.org/pers/hd/b/Babu:Sabarish_V=", "Kapil Chalil Madathil.....http://dblp.org/pers/hd/m/Madathil:Kapil_Chalil", "Melissa Zelaya.....http://dblp.org/pers/hd/z/Zelaya:Melissa", "Tianwei Wang.....http://dblp.org/pers/hd/w/Wang:Tianwei", "John Wagner.....http://dblp.org/pers/hd/w/Wagner:John", "Anand K. Gramopadhye.....http://dblp.org/pers/hd/g/Gramopadhye:Anand_K=", "Jun Luo.....http://dblp.org/pers/hd/l/Luo:Jun"], "conf": "vr", "year": "2015", "pages": 8}