{"title": "Effectively Predicting Whether and When a Topic Will Become Prevalent in a Social Network.", "fields": ["data mining", "machine learning", "probabilistic logic", "topic model", "social network"], "abstract": "Effective forecasting of future prevalent topics plays an important role in social network business development. It involves two challenging aspects: predicting whether a topic will become prevalent, and when. This cannot be directly handled by the existing algorithms in topic modeling, item recommendation and action forecasting. The classic forecasting framework based on time series models may be able to predict a hot topic when a series of periodical changes to user-addressed frequency in a systematic way. However, the frequency of topics discussed by users often changes irregularly in social networks. In this paper, a generic probabilistic framework is proposed for hot topic prediction, and machine learning methods are explored to predict hot topic patterns. Two effective models, PreWHether and PreWHen, are introduced to predict whether and when a topic will become prevalent. In the PreWHether model, we simulate the constructed features of previously observed frequency changes for better prediction. In the PreWHen model, distributions of time intervals associated with the emergence to prevalence of a topic are modeled. Extensive experiments on real datasets demonstrate that our method outperforms the baselines and generates more effective predictions.", "citation": "Citations (6)", "departments": ["Peking University", "Peking University", "Anhui Normal University", "University of New South Wales", "University of Technology, Sydney"], "authors": ["Weiwei Liu.....http://dblp.org/pers/hd/l/Liu_0003:Weiwei", "Zhi-Hong Deng.....http://dblp.org/pers/hd/d/Deng:Zhi=Hong", "Xiuwen Gong.....http://dblp.org/pers/hd/g/Gong:Xiuwen", "Frank Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Frank", "Ivor W. Tsang.....http://dblp.org/pers/hd/t/Tsang:Ivor_W="], "conf": "aaai", "year": "2015", "pages": 7}