{"title": "Existential consistency: measuring and understanding consistency at Facebook.", "fields": ["local consistency", "eventual consistency", "weak consistency", "consistency model", "programming complexity"], "abstract": "Replicated storage for large Web services faces a trade-off between stronger forms of consistency and higher performance properties. Stronger consistency prevents anomalies, i.e., unexpected behavior visible to users, and reduces programming complexity. There is much recent work on improving the performance properties of systems with stronger consistency, yet the flip-side of this trade-off remains elusively hard to quantify. To the best of our knowledge, no prior work does so for a large, production Web service.   We use measurement and analysis of requests to Facebook's TAO system to quantify how often anomalies happen in practice, i.e., when results returned by eventually consistent TAO differ from what is allowed by stronger consistency models. For instance, our analysis shows that 0.0004% of reads to vertices would return different results in a linearizable system. This in turn gives insight into the benefits of stronger consistency; 0.0004% of reads are potential anomalies that a linearizable system would prevent. We directly study local consistency models---i.e., those we can analyze using requests to a sample of objects---and use the relationships between models to infer bounds on the others.   We also describe a practical consistency monitoring system that tracks p-consistency, a new consistency metric ideally suited for health monitoring. In addition, we give insight into the increased programming complexity of weaker consistency by discussing bugs our monitoring uncovered, and anti-patterns we teach developers to avoid.", "citation": "Citations (24)", "departments": ["University of Southern California", "Facebook", "Facebook", "Facebook", "Facebook"], "authors": ["Haonan Lu.....http://dblp.org/pers/hd/l/Lu:Haonan", "Kaushik Veeraraghavan.....http://dblp.org/pers/hd/v/Veeraraghavan:Kaushik", "Philippe Ajoux.....http://dblp.org/pers/hd/a/Ajoux:Philippe", "Jim Hunt.....http://dblp.org/pers/hd/h/Hunt:Jim", "Yee Jiun Song.....http://dblp.org/pers/hd/s/Song:Yee_Jiun", "Wendy Tobagus.....http://dblp.org/pers/hd/t/Tobagus:Wendy", "Sanjeev Kumar.....http://dblp.org/pers/hd/k/Kumar:Sanjeev", "Wyatt Lloyd.....http://dblp.org/pers/hd/l/Lloyd:Wyatt"], "conf": "sosp", "year": "2015", "pages": 16}