{"title": "Runtime pointer disambiguation.", "fields": ["software quality", "code", "alias analysis", "pointer", "compiler"], "abstract": "To optimize code effectively, compilers must deal with memory dependencies. However, the state-of-the-art heuristics available in the literature to track memory dependencies are inherently imprecise and computationally expensive. Consequently, the most advanced code transformations that compilers have today are ineffective when applied on real-world programs. The goal of this paper is to solve this conundrum through dynamic disambiguation of pointers. We provide different ways to determine at runtime when two memory locations can overlap. We then produce two versions of a code region: one that is aliasing-free - hence, easy to optimize - and another that is not. Our checks let us safely branch to the optimizable region. We have applied these ideas on Polly-LLVM, a loop optimizer built on top of the LLVM compilation infrastructure. Our experiments indicate that our method is precise, effective and useful: we can disambiguate every pair of pointer in the loop intensive Polybench benchmark suite. The result of this precision is code quality: the binaries we generate are 10% faster than those that Polly-LLVM produces without our optimization, at the -O3 optimization level of LLVM.", "citation": "Citations (9)", "departments": ["Universidade Federal de Minas Gerais", "French Institute for Research in Computer Science and Automation", "Saarland University", "French Institute for Research in Computer Science and Automation", "ETH Zurich"], "authors": ["Péricles Alves.....http://dblp.org/pers/hd/a/Alves:P=eacute=ricles", "Fabian Gruber.....http://dblp.org/pers/hd/g/Gruber:Fabian", "Johannes Doerfert.....http://dblp.org/pers/hd/d/Doerfert:Johannes", "Alexandros Lamprineas.....http://dblp.org/pers/hd/l/Lamprineas:Alexandros", "Tobias Grosser.....http://dblp.org/pers/hd/g/Grosser:Tobias", "Fabrice Rastello.....http://dblp.org/pers/hd/r/Rastello:Fabrice", "Fernando Magno Quintão Pereira.....http://dblp.org/pers/hd/p/Pereira:Fernando_Magno_Quint=atilde=o"], "conf": "oopsla", "year": "2015", "pages": 18}