{"title": "On optimal diversity in network-coding-based routing in wireless networks.", "fields": ["enhanced interior gateway routing protocol", "policy based routing", "zone routing protocol", "equal cost multi path routing", "wireless routing protocol"], "abstract": "Network coding (NC) based opportunistic routing has been well studied, but the impact of routing diversity on the performance of NC-based routing remains largely unexplored. Towards understanding the importance of routing diversity in NC-based routing, we study the problems of estimating and minimizing the data delivery cost in NC-based routing. In particular, we propose an analytical framework for estimating the total number of packet transmissions for NC-based routing in arbitrary topologies. We design a greedy algorithm that minimizes the total transmission cost of NC-based routing and determines the corresponding forwarder set for each node. We prove the optimality of this algorithm and show that 1) nodes on the shortest path may not always be favored when selecting forwarders for NC-based routing and 2)the minimal cost of NC-based routing is upper-bounded by the cost of shortest path routing. Based on the greedy, optimal algorithm, we design and implement ONCR, a distributed minimal cost NC-based routing protocol. Using the NetEye sensor testbed, we comparatively study the performance of ONCR and existing approaches such as the single path routing protocol CTP and the NC-based opportunistic routing protocols MORE and CodeOR. Results show that ONCR achieves close to 100% delivery reliability while having the lowest delivery cost among all the protocols and 25–28% less than the second best protocol CTP. This low delivery cost also enables ONCR to achieve the highest network goodput, i.e., about two-fold improvement over MORE and CodeOR. Our findings demonstrate the significance of optimizing data forwarding diversity in NC-based routing for data delivery reliability, efficiency, and goodput.", "citation": "Citations (6)", "departments": ["McGill University", "Wayne State University", "City University of Hong Kong", "Michigan State University", "Stony Brook University"], "authors": ["Qiao Xiang.....http://dblp.org/pers/hd/x/Xiang:Qiao", "Hongwei Zhang.....http://dblp.org/pers/hd/z/Zhang:Hongwei", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Shan Lin.....http://dblp.org/pers/hd/l/Lin:Shan", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue"], "conf": "infocom", "year": "2015", "pages": 9}