{"title": "Changing channel without strings: Coordination-free wideband spectrum adaptation.", "fields": ["wideband", "universal software radio peripheral", "channelized", "phy", "asynchronous communication"], "abstract": "Fixed channelization configuration in today's wireless devices falls inefficient in the presence of growing data traffic and heterogeneous devices. In this regard, a number of fairly recent studies have provided spectrum adaptation capabilities for current wireless devices, however, they are limited to inband adaptation or incur substantial coordination overhead. The target of this paper is to fill the gaps in spectrum adaptation by overcoming these limitations. We propose Seer, a frame-level wideband spectrum adaptation system which consists of two major components: i) a specially-constructed preamble that can be detected by receivers with arbitrary RF bands, and ii) a spectrum detection algorithm that identifies the intended transmission band in the context of multiple asynchronous senders by exploiting the preamble's temporal and spectral properties. Seer can be realized on commodity radios, and can be easily integrated into devices running different PHY/MAC protocols. We have prototyped Seer on the GNURadio/USRP platform and tested it under various environments. Furthermore, our evaluation using 1.6GHz spectrum measurements shows that Seer largely improves system throughput over fixed channel configuration and state-of-the-art spectrum adaptation approaches.", "citation": "Citations (2)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "South University of Science and Technology of China", "Hong Kong University of Science and Technology"], "authors": ["Wei Wang.....http://dblp.org/pers/hd/w/Wang_0050:Wei", "Yingjie Victor Chen.....http://dblp.org/pers/hd/c/Chen:Yingjie_Victor", "Zeyu Wang.....http://dblp.org/pers/hd/w/Wang:Zeyu", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "conf": "infocom", "year": "2015", "pages": 9}