{"title": "Exploring the effects of image persistence in low frame rate virtual environments.", "fields": ["rendering", "frame rate", "refresh rate", "blanking", "image persistence"], "abstract": "In virtual reality applications, there is an aim to provide real time graphics which run at high refresh rates. However, there are many situations in which this is not possible due to simulation or rendering issues. When running at low frame rates, several aspects of the user experience are affected. For example, each frame is displayed for an extended period of time, causing a high persistence image artifact. The effect of this artifact is that movement may lose continuity, and the image jumps from one frame to another. In this paper, we discuss our initial exploration of the effects of high persistence frames caused by low refresh rates and compare it to high frame rates and to a technique we developed to mitigate the effects of low frame rates. In this technique, the low frame rate simulation images are displayed with low persistence by blanking out the display during the extra time such image would be displayed. In order to isolate the visual effects, we constructed a simulator for low and high persistence displays that does not affect input latency. A controlled user study comparing the three conditions for the tasks of 3D selection and navigation was conducted. Results indicate that the low persistence display technique may not negatively impact user experience or performance as compared to the high persistence case. Directions for future work on the use of low persistence displays for low frame rate situations are discussed.", "citation": "Citations (9)", "departments": ["Duke University", "Duke University", "Duke University", "Duke University"], "authors": ["David J. Zielinski.....http://dblp.org/pers/hd/z/Zielinski:David_J=", "Hrishikesh Rao.....http://dblp.org/pers/hd/r/Rao:Hrishikesh", "Mark A. Sommer.....http://dblp.org/pers/hd/s/Sommer:Mark_A=", "Regis Kopper.....http://dblp.org/pers/hd/k/Kopper:Regis"], "conf": "vr", "year": "2015", "pages": 8}