{"title": "The Homeostasis Protocol: Avoiding Transaction Coordination Through Program Analysis.", "fields": ["overhead", "bounded function", "geo replication", "correctness", "strong consistency"], "abstract": "Datastores today rely on distribution and replication to achieve improved performance and fault-tolerance. But correctness of many applications depends on strong consistency properties--something that can impose substantial overheads, since it requires coordinating the behavior of multiple nodes. This paper describes a new approach to achieving strong consistency in distributed systems while minimizing communication between nodes. The key insight is to allow the state of the system to be inconsistent during execution, as long as this inconsistency is bounded and does not affect transaction correctness. In contrast to previous work, our approach uses program analysis to extract semantic information about permissible levels of inconsistency and is fully automated. We then employ a novel  homeostasis protocol  to allow sites to operate independently, without communicating, as long as any inconsistency is governed by appropriate  treaties  between the nodes. We discuss mechanisms for optimizing treaties based on workload characteristics to minimize communication, as well as a prototype implementation and experiments that demonstrate the benefits of our approach on common transactional benchmarks.", "citation": "Citations (25)", "year": "2015", "departments": ["Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University"], "conf": "sigmod", "authors": ["Sudip Roy.....http://dblp.org/pers/hd/r/Roy_0002:Sudip", "Lucja Kot.....http://dblp.org/pers/hd/k/Kot:Lucja", "Gabriel Bender.....http://dblp.org/pers/hd/b/Bender:Gabriel", "Bailu Ding.....http://dblp.org/pers/hd/d/Ding:Bailu", "Hossein Hojjat.....http://dblp.org/pers/hd/h/Hojjat:Hossein", "Christoph Koch.....http://dblp.org/pers/hd/k/Koch_0001:Christoph", "Nate Foster.....http://dblp.org/pers/hd/f/Foster:Nate", "Johannes Gehrke.....http://dblp.org/pers/hd/g/Gehrke:Johannes"], "pages": 16}