{"title": "Modular Order-Preserving Encryption, Revisited.", "fields": ["range query", "computer security model", "adversary", "database encryption", "sql"], "abstract": "Order-preserving encryption (OPE) schemes, whose ciphertexts preserve the natural ordering of the plaintexts, allow efficient range query processing over outsourced encrypted databases without giving the server access to the decryption key. Such schemes have recently received increased interest in both the database and the cryptographic communities. In particular,  modular  order-preserving encryption (MOPE), due to Boldyreva et al., is a promising extension that increases the security of the basic OPE by introducing a secret  modular  offset to each data value prior to encrypting it. However, executing range queries via MOPE in a naive way allows the adversary to learn this offset, negating any potential security gains of this approach.   In this paper, we systematically address this vulnerability and show that MOPE can be used to build a practical system for executing range queries on encrypted data while providing a significant security improvement over the basic OPE. We introduce two new query execution algorithms for MOPE: our first algorithm is efficient if the user's query distribution is well-spread, while the second scheme is efficient even for skewed query distributions. Interestingly, our second algorithm achieves this efficiency by leaking the  least-important  bits of the data, whereas OPE is known to leak the  most-important  bits of the data. We also show that our algorithms can be extended to the case where the query distribution is adaptively learned online. We present new, appropriate security models for MOPE and use them to rigorously analyze the security of our proposed schemes. Finally, we design a system prototype that integrates our schemes on top of an existing database system and apply query optimization methods to execute SQL queries with range predicates efficiently. We provide a performance evaluation of our prototype under a number of different database and query distributions, using both synthetic and real datasets", "citation": "Citations (26)", "year": "2015", "departments": ["Boston University", "Rose-Hulman Institute of Technology", "Georgetown University", "Boston University", "Boston University"], "conf": "sigmod", "authors": ["Charalampos Mavroforakis.....http://dblp.org/pers/hd/m/Mavroforakis:Charalampos", "Nathan Chenette.....http://dblp.org/pers/hd/c/Chenette:Nathan", "Adam O'Neill.....http://dblp.org/pers/hd/o/O=Neill:Adam", "George Kollios.....http://dblp.org/pers/hd/k/Kollios:George", "Ran Canetti.....http://dblp.org/pers/hd/c/Canetti:Ran"], "pages": 15}