{"title": "Predicting and Understanding Urban Perception with Convolutional Neural Networks.", "fields": ["attractiveness", "deep learning", "uniqueness", "convolutional neural network", "pooling"], "abstract": "Cities' visual appearance plays a central role in shaping human perception and response to the surrounding urban environment. For example, the visual qualities of urban spaces affect the psychological states of their inhabitants and can induce negative social outcomes. Hence, it becomes critically important to understand people's perceptions and evaluations of urban spaces. Previous works have demonstrated that algorithms can be used to predict high level attributes of urban scenes ( e.g.  safety, attractiveness, uniqueness), accurately emulating human perception. In this paper we propose a novel approach for predicting the perceived safety of a scene from Google Street View Images. Opposite to previous works, we formulate the problem of learning to predict high level judgments as a ranking task and we employ a Convolutional Neural Network (CNN), significantly improving the accuracy of predictions over previous methods. Interestingly, the proposed CNN architecture relies on a novel pooling layer, which permits to automatically discover the most important areas of the images for predicting the concept of perceived safety. An extensive experimental evaluation, conducted on the publicly available Place Pulse dataset, demonstrates the advantages of the proposed approach over state-of-the-art methods.", "citation": "Citations (22)", "departments": ["fondazione bruno kessler", "fondazione bruno kessler", "fondazione bruno kessler", "fondazione bruno kessler"], "authors": ["Lorenzo Porzi.....http://dblp.org/pers/hd/p/Porzi:Lorenzo", "Samuel Rota Bulò.....http://dblp.org/pers/hd/b/Bul=ograve=:Samuel_Rota", "Bruno Lepri.....http://dblp.org/pers/hd/l/Lepri:Bruno", "Elisa Ricci.....http://dblp.org/pers/hd/r/Ricci_0001:Elisa"], "conf": "mm", "year": "2015", "pages": 10}