{"title": "Secure cloud storage hits distributed string equality checking: More efficient, conceptually simpler, and provably secure.", "fields": ["verifiable secret sharing", "general inter orb protocol", "cryptographic protocol", "cloud storage", "universal composability"], "abstract": "Cloud storage has gained a remarkable success in recent years with an increasing number of consumers and enterprises outsourcing their data to the cloud. To assure the availability and integrity of the outsourced data, several protocols have been proposed to audit cloud storage. Despite the formally guaranteed security, the constructions employed heavy cryptographic operations as well as advanced concepts (e.g., bilinear maps over elliptic curves and digital signatures), and thus are inefficient to admit wide applicability in practice. In this paper, we design a novel secure cloud storage protocol, which is conceptually and technically simpler and significantly more efficient than previous constructions. Inspired by a classic string equality checking protocol in distributed computing, our protocol uses only basic integer arithmetic (without advanced techniques and concepts). As simple as the protocol is, it supports both randomized and deterministic auditing to fit different applications. We further extend the proposed protocol to support data dynamics, i.e., adding, deleting and modifying data, using a novel technique. As a further contribution, we find a systematic way to design secure cloud storage protocols based on verifiable computation protocols. Theoretical and experimental analyses validate the efficacy of our protocol.", "citation": "Citations (4)", "year": "2015", "departments": ["Shenzhen University", "Chongqing University", "Stony Brook University", "City University of Hong Kong", "The Chinese University of Hong Kong"], "conf": "infocom", "authors": ["Fei Chen.....http://dblp.org/pers/hd/c/Chen_0003:Fei", "Tao Xiang.....http://dblp.org/pers/hd/x/Xiang:Tao", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan", "Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong", "Shengyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Shengyu"], "pages": 9}