{"title": "Making Masking Security Proofs Concrete - Or How to Evaluate the Security of Any Leaking Device.", "fields": ["mathematical proof", "physical security", "adversary", "concrete security", "heuristic"], "abstract": "We investigate the relationships between theoretical studies of leaking cryptographic devices and concrete security evaluations with standard side-channel attacks. Our contributions are in four parts. First, we connect the formal analysis of the masking countermeasure proposed by Duc et al. (Eurocrypt 2014) with the Eurocrypt 2009 evaluation framework for side-channel key recovery attacks. In particular, we re-state their main proof for the masking countermeasure based on a mutual information metric, which is frequently used in concrete physical security evaluations. Second, we discuss the tightness of the Eurocrypt 2014 bounds based on experimental case studies. This allows us to conjecture a simplified link between the mutual information metric and the success rate of a side-channel adversary, ignoring technical parameters and proof artifacts. Third, we introduce heuristic (yet well-motivated) tools for the evaluation of the masking countermeasure when its independent leakage assumption is not perfectly fulfilled, as it is frequently encountered in practice. Thanks to these tools, we argue that masking with non-independent leakages may provide improved security levels in certain scenarios. Eventually, we consider the tradeoff between measurement complexity and key enumeration in divide-and-conquer side-channel attacks, and show that it can be predicted based on the mutual information metric, by solving a non-linear integer programming problem for which efficient solutions exist. The combination of these observations enables significant reductions of the evaluation costs for certification bodies.", "citation": "Citations (78)", "year": "2015", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Ruhr University Bochum", "Université catholique de Louvain"], "conf": "eurocrypt", "authors": ["Alexandre Duc.....http://dblp.org/pers/hd/d/Duc:Alexandre", "Sebastian Faust.....http://dblp.org/pers/hd/f/Faust:Sebastian", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier"], "pages": 29}