{"title": "Pushing the frontiers of unconstrained face detection and recognition: IARPA Janus Benchmark A.", "fields": ["face detection", "janus", "object class detection", "three dimensional face recognition", "benchmarking"], "abstract": "Rapid progress in unconstrained face recognition has resulted in a saturation in recognition accuracy for current benchmark datasets. While important for early progress, a chief limitation in most benchmark datasets is the use of a commodity face detector to select face imagery. The implication of this strategy is restricted variations in face pose and other confounding factors. This paper introduces the IARPA Janus Benchmark A (IJB-A), a publicly available media in the wild dataset containing 500 subjects with manually localized face images. Key features of the IJB-A dataset are: (i) full pose variation, (ii) joint use for face recognition and face detection benchmarking, (iii) a mix of images and videos, (iv) wider geographic variation of subjects, (v) protocols supporting both open-set identification (1∶N search) and verification (1∶1 comparison), (vi) an optional protocol that allows modeling of gallery subjects, and (vii) ground truth eye and nose locations. The dataset has been developed using 1,501,267 million crowd sourced annotations. Baseline accuracies for both face detection and face recognition from commercial and open source algorithms demonstrate the challenge offered by this new unconstrained benchmark.", "citation": "Citations (263)", "year": "2015", "departments": ["Noblis", "Noblis", "Noblis", "Noblis", "Noblis"], "conf": "cvpr", "authors": ["Brendan F. Klare.....http://dblp.org/pers/hd/k/Klare:Brendan_F=", "Ben Klein.....http://dblp.org/pers/hd/k/Klein:Ben", "Emma Taborsky.....http://dblp.org/pers/hd/t/Taborsky:Emma", "Austin Blanton.....http://dblp.org/pers/hd/b/Blanton:Austin", "Jordan Cheney.....http://dblp.org/pers/hd/c/Cheney:Jordan", "Kristen Allen.....http://dblp.org/pers/hd/a/Allen:Kristen", "Patrick Grother.....http://dblp.org/pers/hd/g/Grother:Patrick", "Alan Mah.....http://dblp.org/pers/hd/m/Mah:Alan", "Mark J. Burge.....http://dblp.org/pers/hd/b/Burge:Mark_J=", "Anil K. Jain.....http://dblp.org/pers/hd/j/Jain_0001:Anil_K="], "pages": 9}