{"title": "Gradient-based 2D-to-3D Conversion for Soccer Videos.", "fields": ["2d to 3d conversion", "depth perception", "mean opinion score", "stereo cameras", "stereoscopy"], "abstract": "A wide spread adoption of 3D videos and technologies is hindered by the lack of high-quality 3D content. One promising solution to address this problem is to use automated 2D-to-3D conversion. However, current conversion methods, while general, produce low-quality results with artifacts that are not acceptable to many viewers. We address this problem by showing how to construct a high-quality, domain-specific conversion method for soccer videos. We propose a novel, data-driven method that generates stereoscopic frames by transferring depth information from similar frames in a database of 3D stereoscopic videos. Creating a database of 3D stereoscopic videos with accurate depth is, however, very difficult. One of the key findings in this paper is showing that computer generated content in current sports computer games can be used to generate high-quality 3D video reference database for 2D-to-3D conversion methods. Once we retrieve similar 3D video frames, our technique transfers depth gradients to the target frame while respecting object boundaries. It then computes depth maps from the gradients, and generates the output stereoscopic video. We implement our method and validate it by conducting user-studies that evaluate depth perception and visual comfort of the converted 3D videos. We show that our method produces high-quality 3D videos that are almost indistinguishable from videos shot by stereo cameras. In addition, our method significantly outperforms the current state-of-the-art method. For example, up to 20% improvement in the perceived depth is achieved by our method, which translates to improving the mean opinion score from Good to Excellent.", "citation": "Citations (3)", "departments": ["Simon Fraser University", "Qatar Computing Research Institute", "Saarland University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Kiana Calagari.....http://dblp.org/pers/hd/c/Calagari:Kiana", "Mohamed A. Elgharib.....http://dblp.org/pers/hd/e/Elgharib:Mohamed_A=", "Piotr Didyk.....http://dblp.org/pers/hd/d/Didyk:Piotr", "Alexandre Kaspar.....http://dblp.org/pers/hd/k/Kaspar:Alexandre", "Wojciech Matusik.....http://dblp.org/pers/hd/m/Matusik:Wojciech", "Mohamed Hefeeda.....http://dblp.org/pers/hd/h/Hefeeda:Mohamed"], "conf": "mm", "year": "2015", "pages": 10}