{"title": "On the Limitation of Spectral Methods: From the Gaussian Hidden Clique Problem to Rank-One Perturbations of Gaussian Tensors.", "fields": ["independent and identically distributed random variables", "symmetric matrix", "spectral method", "gaussian", "gaussian noise", "clique problem", "triangular matrix", "gaussian function", "gaussian random field"], "abstract": "We consider the following detection problem: given a realization of a symmetric matrix X of dimension n, distinguish between the hypothesis that all upper triangular variables are i.i.d. Gaussians variables with mean 0 and variance 1 and the hypothesis that there is a planted principal submatrix B of dimension L for which all upper triangular variables are i.i.d. Gaussians with mean 1 and variance 1 , whereas all other upper triangular elements of X not in B are i.i.d. Gaussians variables with mean 0 and variance 1. We refer to this as the 'Gaussian hidden clique problem'. When L = (1 + ∊) √n (∊ > 0), it is possible to solve this detection problem with probability 1 - on(1) by computing the spectrum of X and considering the largest eigenvalue of X. We prove that when L < (1 - ∊) √n no algorithm that examines only the eigenvalues of X can detect the existence of a hidden Gaussian clique, with error probability vanishing as n → ∞. The result above is an immediate consequence of a more general result on rank-one perturbations of k-dimensional Gaussian tensors. In this context we establish a lower bound on the critical signal-to-noise ratio below which a rank-one signal cannot be detected.", "citation": "Citations (18)", "year": "2015", "departments": ["Stanford University", "University of California, Berkeley", "New York University", "Stanford University", "University of California, Berkeley", "Weizmann Institute of Science"], "conf": "nips", "authors": ["Andrea Montanari.....http://dblp.org/pers/hd/m/Montanari:Andrea", "Daniel Reichman.....http://dblp.org/pers/hd/r/Reichman_0001:Daniel", "Ofer Zeitouni.....http://dblp.org/pers/hd/z/Zeitouni:Ofer"], "pages": 9}