{"title": "Caraoke: An E-Toll Transponder Network for Smart Cities.", "fields": ["exploit", "electronic toll collection", "directional antenna", "transponder"], "abstract": "Electronic toll collection transponders, e.g., E-ZPass, are a widely-used wireless technology. About 70% to 89% of the cars in US have these devices, and some states plan to make them mandatory. As wireless devices however, they lack a basic function: a MAC protocol that prevents collisions. Hence, today, they can be queried only with directional antennas in isolated spots. However, if one could interact with e-toll transponders anywhere in the city despite collisions, it would enable many smart applications. For example, the city can query the transponders to estimate the vehicle flow at every intersection. It can also localize the cars using their wireless signals, and detect those that run a red-light. The same infrastructure can also deliver smart street-parking, where a user parks anywhere on the street, the city localizes his car, and automatically charges his account. This paper presents Caraoke, a networked system for delivering smart services using e-toll transponders. Our design operates with existing unmodified transponders, allowing for applications that communicate with, localize, and count transponders, despite wireless collisions. To do so, Caraoke exploits the structure of the transponders' signal and its properties in the frequency domain. We built Caraoke reader into a small PCB that harvests solar energy and can be easily deployed on street lamps. We also evaluated Caraoke on four streets on our campus and demonstrated its capabilities.", "citation": "Citations (17)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Omid Abari.....http://dblp.org/pers/hd/a/Abari:Omid", "Deepak Vasisht.....http://dblp.org/pers/hd/v/Vasisht:Deepak", "Dina Katabi.....http://dblp.org/pers/hd/k/Katabi:Dina", "Anantha Chandrakasan.....http://dblp.org/pers/hd/c/Chandrakasan:Anantha"], "conf": "sigcomm", "year": "2015", "pages": 14}