{"title": "Domain knowledge based energy management in handhelds.", "fields": ["application domain", "domain knowledge", "android", "brute force search", "heuristics"], "abstract": "Energy management in handheld devices is becoming a daunting task with the growing number of accelerators, increasing memory demands and high computing capacities required to support applications with stringent QoS needs. Current DVFS techniques that modulate power states of a single hardware component, or even recent proposals that manage multiple components, can lose out opportunities for attaining high energy efficiencies that may be possible by leveraging application domain knowledge. Thus, this paper proposes a coordinated multi-component energy optimization mechanism for handheld devices, where the energy profile of different components such as CPU, memory, GPU and IP cores are considered in unison to trigger the appropriate DVFS state by exploiting the application domain knowledge. Specifically, we show that for the important class of frame-based applications, the domain knowledge — frame processing rates, component utilization and available slack — can be used to decide effective DVFS states for each component from among the numerous choices. With such knowledge, rather than a brute force search of all speed setting choices, we propose two simpler heuristics, called Greedy policy and Kaldor-Hicks compensation policy, to make the decisions at frame boundaries. Our evaluations with 7 commonly-used Android apps show that our domain-aware coordinated DVFS policies have 23% better energy efficiency than the conventionally used Android governors, and are within ∼9% of an optimal policy that does not drop any frames.", "citation": "Citations (17)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Intel", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Nachiappan Chidambaram Nachiappan.....http://dblp.org/pers/hd/n/Nachiappan:Nachiappan_Chidambaram", "Praveen Yedlapalli.....http://dblp.org/pers/hd/y/Yedlapalli:Praveen", "Niranjan Soundararajan.....http://dblp.org/pers/hd/s/Soundararajan:Niranjan", "Anand Sivasubramaniam.....http://dblp.org/pers/hd/s/Sivasubramaniam:Anand", "Mahmut T. Kandemir.....http://dblp.org/pers/hd/k/Kandemir:Mahmut_T=", "Ravishankar R. Iyer.....http://dblp.org/pers/hd/i/Iyer:Ravishankar_R=", "Chita R. Das.....http://dblp.org/pers/hd/d/Das:Chita_R="], "conf": "hpca", "year": "2015", "pages": 11}