{"title": "k-Shape: Efficient and Accurate Clustering of Time Series.", "fields": ["k medians clustering", "consensus clustering", "canopy clustering algorithm", "constrained clustering", "data stream clustering"], "abstract": "The proliferation and ubiquity of temporal data across many disciplines has generated substantial interest in the analysis and mining of time series. Clustering is one of the most popular data mining methods, not only due to its exploratory power, but also as a preprocessing step or subroutine for other techniques. In this paper, we present k-Shape, a novel algorithm for time-series clustering. k-Shape relies on a scalable iterative refinement procedure, which creates homogeneous and well-separated clusters. As its distance measure, k-Shape uses a normalized version of the cross-correlation measure in order to consider the shapes of time series while comparing them. Based on the properties of that distance measure, we develop a method to compute cluster centroids, which are used in every iteration to update the assignment of time series to clusters. To demonstrate the robustness of k-Shape, we perform an extensive experimental evaluation of our approach against partitional, hierarchical, and spectral clustering methods, with combinations of the most competitive distance measures. k-Shape outperforms all scalable approaches in terms of accuracy. Furthermore, k-Shape also outperforms all non-scalable (and hence impractical) combinations, with one exception that achieves similar accuracy results. However, unlike k-Shape, this combination requires tuning of its distance measure and is two orders of magnitude slower than k-Shape. Overall, k-Shape emerges as a domain-independent, highly accurate, and highly efficient clustering approach for time series with broad applications.", "citation": "Citations (94)", "year": "2015", "departments": ["Columbia University", "Columbia University"], "conf": "sigmod", "authors": ["John Paparrizos.....http://dblp.org/pers/hd/p/Paparrizos:John", "Luis Gravano.....http://dblp.org/pers/hd/g/Gravano:Luis"], "pages": 16}