{"title": "Trajectory aware macro-cell planning for mobile users.", "fields": ["utility maximization problem", "upgrade", "heuristics", "software deployment", "macro"], "abstract": "We handle the problem of efficient user-mobility driven macro-cell planning in cellular networks. As cellular networks embrace heterogeneous technologies (including long range 3G/4G and short range WiFi, Femto-cells, etc.), most traffic generated by static users gets absorbed by the short-range technologies, thereby increasingly leaving mobile user traffic to macro-cells. To this end, we consider a novel approach that factors in the trajectories of mobile users as well as the impact of city geographies and their associated road networks for macro-cell planning. Given a budget k of base-stations that can be upgraded, our approach selects a deployment that improves the most number of user trajectories. The generic formulation incorporates the notion of quality of service of a user trajectory as a parameter to allow different application-specific requirements, and operator choices. We show that the proposed trajectory utility maximization problem is NP-hard, and design multiple heuristics. We evaluate our algorithms with real and synthetic datasets emulating different city geographies to demonstrate their efficacy. For instance, with an upgrade budget k of 20%, our algorithms perform 3–8 times better in improving the user quality of service on trajectories when compared to greedy location-based basestation upgrades.", "citation": "Citations (8)", "departments": ["Indian Institute of Technology Kanpur", "Indian Institute of Technology Madras", "IBM", "IBM", "Indian Institute of Technology Kanpur"], "authors": ["Shubhadip Mitra.....http://dblp.org/pers/hd/m/Mitra:Shubhadip", "Sayan Ranu.....http://dblp.org/pers/hd/r/Ranu:Sayan", "Vinay Kolar.....http://dblp.org/pers/hd/k/Kolar:Vinay", "Aditya Telang.....http://dblp.org/pers/hd/t/Telang:Aditya", "Arnab Bhattacharya.....http://dblp.org/pers/hd/b/Bhattacharya_0001:Arnab", "Ravi Kokku.....http://dblp.org/pers/hd/k/Kokku:Ravi", "Sriram Raghavan.....http://dblp.org/pers/hd/r/Raghavan:Sriram"], "conf": "infocom", "year": "2015", "pages": 9}