{"title": "Precise Power Delay Profiling with Commodity WiFi.", "fields": ["power delay profile", "channel capacity", "multipath propagation", "delay spread", "coherence time"], "abstract": "Power delay profiles characterize multipath channel features, which are widely used in motion- or localization-based applications. Recent studies show that the power delay profile may be derived from the CSI traces collected from commodity WiFi devices, but the performance is limited by two dominating factors. The resolution of the derived power delay profile is determined by the channel bandwidth, which is however limited on commodity WiFi. The collected CSI reflects the signal distortions due to both the channel attenuation and the hardware imperfection. A direct derivation of power delay profiles using raw CSI measures, as has been done in the literature, results in significant inaccuracy. In this paper, we present Splicer, a software-based system that derives high-resolution power delay profiles by splicing the CSI measurements from multiple WiFi frequency bands. We propose a set of key techniques to separate the mixed hardware errors from the collected CSI measurements. Splicer adapts its computations within stringent channel coherence time and thus can perform well in presence of mobility. Our experiments with commodity WiFi NICs show that Splicer substantially improves the accuracy in profiling multipath characteristics, reducing the errors of multipath distance estimation to be less than $2m$. Splicer can immediately benefit upper-layer applications. Our case study with recent single-AP localization achieves a median localization error of $0.95m$.", "citation": "Citations (122)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Yaxiong Xie.....http://dblp.org/pers/hd/x/Xie:Yaxiong", "Zhenjiang Li.....http://dblp.org/pers/hd/l/Li:Zhenjiang", "Mo Li.....http://dblp.org/pers/hd/l/Li:Mo"], "conf": "mobicom", "year": "2015", "pages": 12}