{"title": "AE: An Asymmetric Extremum content defined chunking algorithm for fast and bandwidth-efficient data deduplication.", "fields": ["data deduplication", "bottleneck", "redundancy", "extreme value theory", "chunking"], "abstract": "Data deduplication, a space-efficient and bandwidth-saving technology, plays an important role in bandwidth-efficient data transmission in various data-intensive network and cloud applications. Rabin-based and MAXP-based Content-Defined Chunking (CDC) algorithms, while robust in finding suitable cut-points for chunk-level redundancy elimination, face the key challenges of (1) low chunking throughput that renders the chunking stage the deduplication performance bottleneck and (2) large chunk-size variance that decreases deduplication efficiency. To address these challenges, this paper proposes a new CDC algorithm called the Asymmetric Extremum (AE) algorithm. The main idea behind AE is based on the observation that the extreme value in an asymmetric local range is not likely to be replaced by a new extreme value in dealing with the boundaries-shift problem, which motivates AE's use of asymmetric (rather than symmetric as in MAXP) local range to identify cut-points and simultaneously achieve high chunking throughput and low chunk-size variance. As a result, AE simultaneously addresses the problems of low chunking throughput in MAXP and Rabin and high chunk-size variance in Rabin. The experimental results based on four real-world datasets show that AE improves the throughput performance of the state-of-the-art CDC algorithms by 3x while attaining comparable or higher deduplication efficiency.", "citation": "Citations (11)", "departments": ["Huazhong University of Science and Technology", "University of Nebraska–Lincoln", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Yucheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Yucheng", "Hong Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Hong", "Dan Feng.....http://dblp.org/pers/hd/f/Feng_0001:Dan", "Wen Xia.....http://dblp.org/pers/hd/x/Xia:Wen", "Min Fu.....http://dblp.org/pers/hd/f/Fu_0002:Min", "Fangting Huang.....http://dblp.org/pers/hd/h/Huang:Fangting", "Yukun Zhou.....http://dblp.org/pers/hd/z/Zhou:Yukun"], "conf": "infocom", "year": "2015", "pages": 9}