{"title": "Who's Afraid of Itten: Using the Art Theory of Color Combination to Analyze Emotions in Abstract Paintings.", "fields": ["abstract art", "exploit", "painting", "sensory cue", "emotion recognition"], "abstract": "Color plays an essential role in everyday life and is one of the most important visual cues in human perception. In abstract art, color is one of the essential means to convey the artist's intention and to affect the viewer emotionally. However, colors are rarely experienced in isolation, rather, they are usually presented together with other colors. In fact, the expressive properties of two-color combinations have been extensively studied by artists. It is intriguing to try to understand how color combinations in abstract paintings might affect the viewer emotionally, and to investigate if a computer algorithm can learn this mechanism.   In this work, we propose a novel computational approach able to analyze the color combinations in abstract paintings and use this information to infer whether a painting will evoke positive or negative emotions in an observer. We exploit art theory concepts to design our features and the learning algorithm. To make use of the color-group information, we propose inferring the emotions elicited by paintings based on the sparse group lasso approach. Our results show that a relative improvement of between 6% and 8% can be achieved in this way. Finally, as an application, we employ our method to generate Mondrian-like paintings and do a prospective user study to evaluate the ability of our method as an automatic tool for generating abstract paintings able to elicit positive and negative emotional responses in people.", "citation": "Citations (5)", "departments": ["University of Trento", "University of Novi Sad", "University of Trento", "University of Trento"], "authors": ["Andreza Sartori.....http://dblp.org/pers/hd/s/Sartori:Andreza", "Dubravko Culibrk.....http://dblp.org/pers/hd/c/Culibrk:Dubravko", "Yan Yan.....http://dblp.org/pers/hd/y/Yan_0002:Yan", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu"], "conf": "mm", "year": "2015", "pages": 10}