{"title": "Risk-taking as a Learning Process for Shaping Teen's Online Information Privacy Behaviors.", "fields": ["coping", "social media", "secondary data", "information privacy", "knowledge management"], "abstract": "Through a secondary data analysis of a nationally representative Pew survey [35-36], we empirically test the validity of two contrasting theoretical models of adolescent information privacy behaviors. Our results suggest that in seeking to understand the underlying processes of teens' privacy risk-taking and risk-coping behaviors within social media, a \"risk-centric\" framework may be more useful than a traditional \"concern-centric\" framework that emphasizes privacy antecedents and outcomes. Our newly proposed and validated \"risk-centric\" framework implies a possible risk escalation process wherein teens make online disclosures and render themselves more susceptible to experiences of risky online interactions; in turn, these risky experiences are associated with higher levels of teen privacy concern. Higher levels of teen privacy concern predict both advice-seeking and remedy/corrective risk-coping behaviors. Drawing on theories of information privacy and developmental psychology, we discuss these findings from the perspective of allowing teens to experience some level of online risk so that they can learn how to navigate the dangers and reap the benefits of online engagement.", "citation": "Citations (18)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Haiyan Jia.....http://dblp.org/pers/hd/j/Jia:Haiyan", "Pamela J. Wisniewski.....http://dblp.org/pers/hd/w/Wisniewski:Pamela_J=", "Heng Xu.....http://dblp.org/pers/hd/x/Xu:Heng", "Mary Beth Rosson.....http://dblp.org/pers/hd/r/Rosson:Mary_Beth", "John M. Carroll.....http://dblp.org/pers/hd/c/Carroll:John_M="], "conf": "cscw", "year": "2015", "pages": 17}