{"title": "GSMem: Data Exfiltration from Air-Gapped Computers over GSM Frequencies.", "fields": ["cellular frequencies", "memory architecture", "baseband", "rootkit", "firmware"], "abstract": "Air-gapped networks are isolated, separated both logically and physically from public networks. Although the feasibility of invading such systems has been demonstrated in recent years, exfiltration of data from air-gapped networks is still a challenging task. In this paper we present GSMem, a malware that can exfiltrate data through an air-gap over cellular frequencies. Rogue software on an infected target computer modulates and transmits electromagnetic signals at cellular frequencies by invoking specific memory-related instructions and utilizing the multichannel memory architecture to amplify the transmission. Furthermore, we show that the transmitted signals can be received and demodulated by a rootkit placed in the baseband firmware of a nearby cellular phone. We present crucial design issues such as signal generation and reception, data modulation, and transmission detection. We implement a prototype of GSMem consisting of a transmitter and a receiver and evaluate its performance and limitations. Our current results demonstrate its efficacy and feasibility, achieving an effective transmission distance of 1 - 5.5 meters with a standard mobile phone. When using a dedicated, yet affordable hardware receiver, the effective distance reached over 30 meters.", "citation": "Citations (51)", "year": "2015", "departments": ["Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Telekom Innovation Laboratories"], "conf": "uss", "authors": ["Mordechai Guri.....http://dblp.org/pers/hd/g/Guri:Mordechai", "Assaf Kachlon.....http://dblp.org/pers/hd/k/Kachlon:Assaf", "Ofer Hasson.....http://dblp.org/pers/hd/h/Hasson:Ofer", "Gabi Kedma.....http://dblp.org/pers/hd/k/Kedma:Gabi", "Yisroel Mirsky.....http://dblp.org/pers/hd/m/Mirsky:Yisroel", "Yuval Elovici.....http://dblp.org/pers/hd/e/Elovici:Yuval"], "pages": 16}