{"title": "SAR: A sentiment-aspect-region model for user preference analysis in geo-tagged reviews.", "fields": ["location based service", "point of interest", "computation", "spatial analysis", "statistical model"], "abstract": "Many location based services, such as FourSquare, Yelp, TripAdvisor, Google Places, etc., allow users to compose reviews or tips on points of interest (POIs), each having a geographical coordinates. These services have accumulated a large amount of such geo-tagged review data, which allows deep analysis of user preferences in POIs. This paper studies two types of user preferences to POIs: topical-region preference and category aware topical-aspect preference. We propose a unified probabilistic model to capture these two preferences simultaneously. In addition, our model is capable of capturing the interaction of different factors, including topical aspect, sentiment, and spatial information. The model can be used in a number of applications, such as POI recommendation and user recommendation, among others. In addition, the model enables us to investigate whether people like an aspect of a POI or whether people like a topical aspect of some type of POIs (e.g., bars) in a region, which offer explanation for recommendations. Experiments on real world datasets show that the model achieves significant improvement in POI recommendation and user recommendation in comparison to the state-of-the-art methods. We also propose an efficient online recommendation algorithm based on our model, which saves up to 90% computation time.", "citation": "Citations (25)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Shanghai Jiao Tong University"], "authors": ["Kaiqi Zhao.....http://dblp.org/pers/hd/z/Zhao:Kaiqi", "Gao Cong.....http://dblp.org/pers/hd/c/Cong:Gao", "Quan Yuan.....http://dblp.org/pers/hd/y/Yuan_0001:Quan", "Kenny Q. Zhu.....http://dblp.org/pers/hd/z/Zhu:Kenny_Q="], "conf": "icde", "year": "2015", "pages": 12}