{"title": "Galileo: Perceiving Physical Object Properties by Integrating a Physics Engine with Deep Learning.", "fields": ["galileo", "deep learning", "property", "generative model", "physics engine"], "abstract": "Humans demonstrate remarkable abilities to predict physical events in dynamic scenes, and to infer the physical properties of objects from static images. We propose a generative model for solving these problems of physical scene understanding from real-world videos and images. At the core of our generative model is a 3D physics engine, operating on an object-based representation of physical properties, including mass, position, 3D shape, and friction. We can infer these latent properties using relatively brief runs of MCMC, which drive simulations in the physics engine to fit key features of visual observations. We further explore directly mapping visual inputs to physical properties, inverting a part of the generative process using deep learning. We name our model Galileo, and evaluate it on a video dataset with simple yet physically rich scenarios. Results show that Galileo is able to infer the physical properties of objects and predict the outcome of a variety of physical events, with an accuracy comparable to human subjects. Our study points towards an account of human vision with generative physical knowledge at its core, and various recognition models as helpers leading to efficient inference.", "citation": "Citations (104)", "year": "2015", "departments": ["Massachusetts Institute of Technology", "Rockefeller University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "nips", "authors": ["Jiajun Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jiajun", "Ilker Yildirim.....http://dblp.org/pers/hd/y/Yildirim:Ilker", "Joseph J. Lim.....http://dblp.org/pers/hd/l/Lim:Joseph_J=", "Bill Freeman.....http://dblp.org/pers/hd/f/Freeman:Bill", "Joshua B. Tenenbaum.....http://dblp.org/pers/hd/t/Tenenbaum:Joshua_B="], "pages": 9}