{"title": "SCREEN: Stream Data Cleaning under Speed Constraints.", "fields": ["data point", "global optimum", "smoothing", "computation", "local optimum"], "abstract": "Stream data are often dirty, for example, owing to unreliable sensor reading, or erroneous extraction of stock prices. Most stream data cleaning approaches employ a smoothing filter, which may seriously alter the data without preserving the original information. We argue that the cleaning should avoid changing those originally correct/clean data, a.k.a. the minimum change principle in data cleaning. To capture the knowledge about what is clean, we consider the (widely existing) constraints on the speed of data changes, such as fuel consumption per hour, or daily limit of stock prices.    Guided by these semantic constraints, in this paper, we propose SCREEN, the first constraint-based approach for cleaning stream data. It is notable that existing data repair techniques clean (a sequence of) data as a whole and fail to support stream computation. To this end, we have to relax the global optimum over the entire sequence to the local optimum in a window.    Rather than the commonly observed NP-hardness of general data repairing problems, our major contributions include: (1) polynomial time algorithm for global optimum, (2) linear time algorithm towards local optimum under an efficient Median Principle,(3) support on out-of-order arrivals of data points, and(4) adaptive window size for balancing repair accuracy and efficiency.    Experiments on real datasets demonstrate that SCREEN can show significantly higher repair accuracy than the existing approaches such as smoothing.", "citation": "Citations (10)", "year": "2015", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Illinois at Chicago"], "conf": "sigmod", "authors": ["Shaoxu Song.....http://dblp.org/pers/hd/s/Song:Shaoxu", "Aoqian Zhang.....http://dblp.org/pers/hd/z/Zhang:Aoqian", "Jianmin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianmin", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "pages": 15}