{"title": "Fast Orthogonal Projection Based on Kronecker Product.", "fields": ["matrix multiplication", "search problem", "orthogonal matrix", "kronecker product", "kronecker delta"], "abstract": "We propose a family of structured matrices to speed up orthogonal projections for high-dimensional data commonly seen in computer vision applications. In this, a structured matrix is formed by the Kronecker product of a series of smaller orthogonal matrices. This achieves O(dlogd) computational complexity and O(logd) space complexity for d-dimensional data, a drastic improvement over the standard unstructured projections whose computational and space complexities are both O(d^2). The proposed structured matrices are applicable to a number of application domains, and are faster and more compact than other structured matrices used in the past. We also introduce an efficient learning procedure for optimizing such matrices in a data dependent fashion. We demonstrate the significant advantages of the proposed approach in solving the approximate nearest neighbor (ANN) image search problem with both binary embedding and quantization. We find that the orthogonality plays a very important role in solving ANN problem, since the random orthogonal Kronecker projection has already provided promising performance. Comprehensive experiments show that the proposed approach can achieve similar or better accuracy as the existing state-of-the-art but with significantly less time and memory.", "citation": "Citations (13)", "year": "2015", "departments": ["Tsinghua University", "Google", "Google", "Google", "Tsinghua University"], "conf": "iccv", "authors": ["Xu Zhang.....http://dblp.org/pers/hd/z/Zhang:Xu", "Felix X. Yu.....http://dblp.org/pers/hd/y/Yu:Felix_X=", "Ruiqi Guo.....http://dblp.org/pers/hd/g/Guo:Ruiqi", "Sanjiv Kumar.....http://dblp.org/pers/hd/k/Kumar:Sanjiv", "Shengjin Wang.....http://dblp.org/pers/hd/w/Wang:Shengjin", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "pages": 9}