{"title": "Turkers, Scholars, \"Arafat\" and \"Peace\": Cultural Communities and Algorithmic Gold Standards.", "fields": ["crowdsourcing", "common ground", "semantic similarity", "gold standard", "ranging"], "abstract": "In just a few years, crowdsourcing markets like Mechanical Turk have become the dominant mechanism for for building \"gold standard\" datasets in areas of computer science ranging from natural language processing to audio transcription. The assumption behind this sea change - an assumption that is central to the approaches taken in hundreds of research projects - is that crowdsourced markets can accurately replicate the judgments of the general population for knowledge-oriented tasks. Focusing on the important domain of semantic relatedness algorithms and leveraging Clark's theory of common ground as a framework, we demonstrate that this assumption can be highly problematic. Using 7,921 semantic relatedness judgements from 72 scholars and 39 crowdworkers, we show that crowdworkers on Mechanical Turk produce significantly different semantic relatedness gold standard judgements than people from other communities. We also show that algorithms that perform well against Mechanical Turk gold standard datasets do significantly worse when evaluated against other communities' gold standards. Our results call into question the broad use of Mechanical Turk for the development of gold standard datasets and demonstrate the importance of understanding these datasets from a human-centered point-of-view. More generally, our findings problematize the notion that a universal gold standard dataset exists for all knowledge tasks.", "citation": "Citations (14)", "departments": ["Macalester College", "Macalester College", "Macalester College", "Macalester College", "Macalester College"], "authors": ["Shilad Sen.....http://dblp.org/pers/hd/s/Sen:Shilad", "Margaret E. Giesel.....http://dblp.org/pers/hd/g/Giesel:Margaret_E=", "Rebecca Gold.....http://dblp.org/pers/hd/g/Gold:Rebecca", "Benjamin Hillmann.....http://dblp.org/pers/hd/h/Hillmann:Benjamin", "Matt Lesicko.....http://dblp.org/pers/hd/l/Lesicko:Matt", "Samuel Naden.....http://dblp.org/pers/hd/n/Naden:Samuel", "Jesse Russell.....http://dblp.org/pers/hd/r/Russell:Jesse", "Zixiao (Ken) Wang.....http://dblp.org/pers/hd/w/Wang:Zixiao_=Ken=", "Brent J. Hecht.....http://dblp.org/pers/hd/h/Hecht:Brent_J="], "conf": "cscw", "year": "2015", "pages": 13}