{"title": "Open Source-Style Collaborative Development Practices in Commercial Projects Using GitHub.", "fields": ["software design", "code reuse", "knowledge sharing", "development environment", "crowdsourcing"], "abstract": "Researchers are currently drawn to study projects hosted on GitHub due to its popularity, ease of obtaining data, and its distinctive built-in social features. GitHub has been found to create a transparent development environment, which together with a pull request-based workflow, provides a lightweight mechanism for committing, reviewing and managing code changes. These features impact how GitHub is used and the benefits it provides to teams' development and collaboration. While most of the evidence we have is from GitHub's use in open source software ( oss ) projects, GitHub is also used in an increasing number of commercial projects. It is unknown how GitHub supports these projects given that GitHub's workflow model does not intuitively fit the commercial development way of working. In this paper, we report findings from an online survey and interviews with GitHub users on how GitHub is used for collaboration in commercial projects. We found that many commercial projects adopted practices that are more typical of  oss  projects including reduced communication, more independent work, and self-organization. We discuss how GitHub's transparency and popular workflow can promote open collaboration, allowing organizations to increase code reuse and promote knowledge sharing across their teams.", "citation": "Citations (20)", "departments": ["University of Victoria", "University of Victoria", "University of Victoria", "University of Victoria", "University of Victoria"], "authors": ["Eirini Kalliamvakou.....http://dblp.org/pers/hd/k/Kalliamvakou:Eirini", "Daniela E. Damian.....http://dblp.org/pers/hd/d/Damian:Daniela_E=", "Kelly Blincoe.....http://dblp.org/pers/hd/b/Blincoe:Kelly", "Leif Singer.....http://dblp.org/pers/hd/s/Singer:Leif", "Daniel M. Germán.....http://dblp.org/pers/hd/g/Germ=aacute=n:Daniel_M="], "conf": "icse", "year": "2015", "pages": 12}