{"title": "The Art of Testing Less without Sacrificing Quality.", "fields": ["software quality control", "verification and validation", "software quality management", "software quality analyst", "software reliability testing"], "abstract": "Testing is a key element of software development processes for the management and assessment of product quality. In most development environments, the software engineers are responsible for ensuring the functional correctness of code. However, for large complex software products, there is an additional need to check that changes do not negatively impact other parts of the software and they comply with system constraints such as backward compatibility, performance, security etc. Ensuring these system constraints may require complex verification infrastructure and test procedures. Although such tests are time consuming and expensive and rarely find defects they act as an insurance process to ensure the software is compliant. However, long lasting tests increasingly conflict with strategic aims to shorten release cycles. To decrease production costs and to improve development agility, we created a generic test selection strategy called  THEO  that accelerates test processes without sacrificing product quality. THEO is based on a cost model, which dynamically skips tests when the expected cost of running the test exceeds the expected cost of removing it. We replayed past development periods of three major Microsoft products resulting in a reduction of 50% of test executions, saving millions of dollars per year, while maintaining product quality.", "citation": "Citations (21)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Kim Herzig.....http://dblp.org/pers/hd/h/Herzig:Kim", "Michaela Greiler.....http://dblp.org/pers/hd/g/Greiler:Michaela", "Jacek Czerwonka.....http://dblp.org/pers/hd/c/Czerwonka:Jacek", "Brendan Murphy.....http://dblp.org/pers/hd/m/Murphy:Brendan"], "conf": "icse", "year": "2015", "pages": 11}