{"title": "Learning semantic relationships for better action retrieval in images.", "fields": ["computer vision", "pattern recognition", "artificial intelligence", "artificial neural network", "machine learning"], "abstract": "Human actions capture a wide variety of interactions between people and objects. As a result, the set of possible actions is extremely large and it is difficult to obtain sufficient training examples for all actions. However, we could compensate for this sparsity in supervision by leveraging the rich semantic relationship between different actions. A single action is often composed of other smaller actions and is exclusive of certain others. We need a method which can reason about such relationships and extrapolate unobserved actions from known actions. Hence, we propose a novel neural network framework which jointly extracts the relationship between actions and uses them for training better action retrieval models. Our model incorporates linguistic, visual and logical consistency based cues to effectively identify these relationships. We train and test our model on a largescale image dataset of human actions. We show a significant improvement in mean AP compared to different baseline methods including the HEX-graph approach from Deng et al. [8].", "citation": "Citations (30)", "year": "2015", "departments": ["Stanford University", "Google", "University of Michigan", "Google", "Google"], "conf": "cvpr", "authors": ["Vignesh Ramanathan.....http://dblp.org/pers/hd/r/Ramanathan:Vignesh", "Congcong Li.....http://dblp.org/pers/hd/l/Li:Congcong", "Jia Deng.....http://dblp.org/pers/hd/d/Deng:Jia", "Wei Han.....http://dblp.org/pers/hd/h/Han:Wei", "Zhen Li.....http://dblp.org/pers/hd/l/Li:Zhen", "Kunlong Gu.....http://dblp.org/pers/hd/g/Gu:Kunlong", "Yang Song.....http://dblp.org/pers/hd/s/Song:Yang", "Samy Bengio.....http://dblp.org/pers/hd/b/Bengio:Samy", "Chuck Rosenberg.....http://dblp.org/pers/hd/r/Rosenberg:Chuck", "Fei-Fei Li.....http://dblp.org/pers/hd/l/Li:Fei=Fei"], "pages": 10}