{"title": "Feral Concurrency Control: An Empirical Investigation of Modern Application Integrity.", "fields": ["remainder", "object relational impedance mismatch", "correctness", "concurrency", "concurrency control"], "abstract": "The rise of data-intensive \"Web 2.0\" Internet services has led to a range of popular new programming frameworks that collectively embody the latest incarnation of the vision of Object-Relational Mapping (ORM) systems, albeit at unprecedented scale. In this work, we empirically investigate modern ORM-backed applications' use and disuse of database concurrency control mechanisms. Specifically, we focus our study on the common use of  feral , or application-level, mechanisms for maintaining database integrity, which, across a range of ORM systems, often take the form of declarative correctness criteria, or invariants. We quantitatively analyze the use of these mechanisms in a range of open source applications written using the Ruby on Rails ORM and find that feral invariants are the most popular means of ensuring integrity (and, by usage, are over 37 times more popular than transactions). We evaluate which of these feral invariants actually ensure integrity (by usage, up to 86.9%) and which---due to concurrency errors and lack of database support---may lead to data corruption (the remainder), which we experimentally quantify. In light of these findings, we present recommendations for database system designers for better supporting these modern ORM programming patterns, thus eliminating their adverse effects on application integrity.", "citation": "Citations (21)", "year": "2015", "departments": ["University of California, Berkeley", "University of Sydney", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "sigmod", "authors": ["Peter Bailis.....http://dblp.org/pers/hd/b/Bailis:Peter", "Alan Fekete.....http://dblp.org/pers/hd/f/Fekete:Alan", "Michael J. Franklin.....http://dblp.org/pers/hd/f/Franklin:Michael_J=", "Ali Ghodsi.....http://dblp.org/pers/hd/g/Ghodsi_0002:Ali", "Joseph M. Hellerstein.....http://dblp.org/pers/hd/h/Hellerstein:Joseph_M=", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "pages": 16}