{"title": "Amazon Redshift and the Case for Simpler Data Warehouses.", "fields": ["amazon rainforest", "analytics", "business intelligence", "database engine", "data warehouse"], "abstract": "Amazon Redshift is a fast, fully managed, petabyte-scale data warehouse solution that makes it simple and cost-effective to efficiently analyze large volumes of data using existing business intelligence tools. Since launching in February 2013, it has been Amazon Web Service's (AWS) fastest growing service, with many thousands of customers and many petabytes of data under management. Amazon Redshift's pace of adoption has been a surprise to many participants in the data warehousing community. While Amazon Redshift was priced disruptively at launch, available for as little as $1000/TB/year, there are many open-source data warehousing technologies and many commercial data warehousing engines that provide free editions for development or under some usage limit. While Amazon Redshift provides a modern MPP, columnar, scale-out architecture, so too do many other data warehousing engines. And, while Amazon Redshift is available in the AWS cloud, one can build data warehouses using EC2 instances and the database engine of one's choice with either local or network-attached storage.   In this paper, we discuss an oft-overlooked differentiating characteristic of Amazon Redshift -- simplicity. Our goal with Amazon Redshift was not to compete with other data warehousing engines, but to compete with non-consumption. We believe the vast majority of data is collected but not analyzed. We believe, while most database vendors target larger enterprises, there is little correlation in today's economy between data set size and company size. And, we believe the models used to procure and consume analytics technology need to support experimentation and evaluation. Amazon Redshift was designed to bring data warehousing to a mass market by making it easy to buy, easy to tune and easy to manage while also being fast and cost-effective.", "citation": "Citations (13)", "year": "2015", "departments": ["Amazon Web Services", "Amazon Web Services", "Amazon Web Services", "Amazon Web Services", "Amazon Web Services"], "conf": "sigmod", "authors": ["Anurag Gupta.....http://dblp.org/pers/hd/g/Gupta:Anurag", "Deepak Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Deepak", "Derek Tan.....http://dblp.org/pers/hd/t/Tan:Derek", "Jakub Kulesza.....http://dblp.org/pers/hd/k/Kulesza:Jakub", "Rahul Pathak.....http://dblp.org/pers/hd/p/Pathak:Rahul", "Stefano Stefani.....http://dblp.org/pers/hd/s/Stefani:Stefano", "Vidhya Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Vidhya"], "pages": 7}