{"title": "Large-scale Predictive Analytics in Vertica: Fast Data Transfer, Distributed Model Creation, and In-database Prediction.", "fields": ["table", "terabyte", "gigabyte", "open database connectivity", "predictive analytics"], "abstract": "A typical predictive analytics workflow will pre-process data in a database, transfer the resulting data to an external statistical tool such as R, create machine learning models in R, and then apply the model on newly arriving data. Today, this workflow is slow and cumbersome. Extracting data from databases, using ODBC connectors, can take hours on multi-gigabyte datasets. Building models on single-threaded R does not scale. Finally, it is nearly impossible to use R or other common tools, to apply models on terabytes of newly arriving data.   We solve all the above challenges by integrating HP Vertica with Distributed R, a distributed framework for R. This paper presents the design of a high performance data transfer mechanism, new data-structures in Distributed R to maintain data locality with database table segments, and extensions to Vertica for saving and deploying R models. Our experiments show that data transfers from Vertica are 6x faster than using ODBC connections. Even complex predictive analysis on 100s of gigabytes of database tables can complete in minutes, and is as fast as in-memory systems like Spark running directly on a distributed file system.", "citation": "Citations (7)", "year": "2015", "departments": ["HP Vertica, Cambridge, MA, USA", "HP Vertica, Cambridge, MA, USA", "HP Vertica, Sunnyvale, CA, USA", "HP Vertica, Sunnyvale, CA, USA", "HP Vertica, Sunnyvale, CA, USA"], "conf": "sigmod", "authors": ["Shreya Prasad.....http://dblp.org/pers/hd/p/Prasad:Shreya", "Arash Fard.....http://dblp.org/pers/hd/f/Fard:Arash", "Vishrut Gupta.....http://dblp.org/pers/hd/g/Gupta:Vishrut", "Jorge Martinez.....http://dblp.org/pers/hd/m/Martinez:Jorge", "Jeff LeFevre.....http://dblp.org/pers/hd/l/LeFevre:Jeff", "Vincent Xu.....http://dblp.org/pers/hd/x/Xu:Vincent", "Meichun Hsu.....http://dblp.org/pers/hd/h/Hsu:Meichun", "Indrajit Roy.....http://dblp.org/pers/hd/r/Roy_0001:Indrajit"], "pages": 12}