{"title": "Query Suggestion and Data Fusion in Contextual Disambiguation.", "fields": ["ranking", "web query classification", "web search query", "sargable", "concept search"], "abstract": "Queries issued to a search engine are often under-specified or ambiguous. The user's search context or background may provide information that disambiguates their information need in order to automatically predict and issue a more effective query. The disambiguation can take place at different stages of the retrieval process. For instance, contextual query suggestions may be computed and recommended to users on the result page when appropriate, an approach that does not require modifying the original query's results. Alternatively, the search engine can attempt to provide efficient access to new relevant documents by injecting these documents directly into search results based on the user's context.   In this paper, we explore these complementary approaches and how they might be combined. We first develop a general framework for mining context-sensitive query reformulations for query suggestion. We evaluate our context-sensitive suggestions against a state-of-the-art baseline using a click-based metric. The resulting query suggestions generated by our approach outperform the baseline by 13% overall and by 16% on an ambiguous query subset.   While the query suggestions generated by our approach have higher quality than the existing baselines, we demonstrate that using them naively for injecting new documents into search results can lead to inferior rankings. To remedy this issue, we develop a classifier that decides when to inject new search results using features based on suggestion quality and user context. We show that our context-sensitive result fusion approach (Corfu) improves retrieval quality for ambiguous queries by up to 2.92%. Our approaches can efficiently scale to massive search logs, enabling a data-driven strategy that benefits from observing how users issue and reformulate queries in different contexts.", "citation": "Citations (4)", "departments": ["Microsoft", "University College London", "Microsoft", "University of Michigan", "Harvard University"], "authors": ["Milad Shokouhi.....http://dblp.org/pers/hd/s/Shokouhi:Milad", "Marc Sloan.....http://dblp.org/pers/hd/s/Sloan:Marc", "Paul N. Bennett.....http://dblp.org/pers/hd/b/Bennett:Paul_N=", "Kevyn Collins-Thompson.....http://dblp.org/pers/hd/c/Collins=Thompson:Kevyn", "Siranush Sarkizova.....http://dblp.org/pers/hd/s/Sarkizova:Siranush"], "conf": "www", "year": "2015", "pages": 10}