{"title": "The Impact of Mislabelling on the Performance and Interpretation of Defect Prediction Models.", "fields": ["predictive modelling", "data modeling", "noise measurement", "noisy data", "data quality"], "abstract": "The reliability of a prediction model depends on the quality of the data from which it was trained. Therefore, defect prediction models may be unreliable if they are trained using noisy data. Recent research suggests that randomly-injected noise that changes the classification (label) of software modules from defective to clean (and vice versa) can impact the performance of defect models. Yet, in reality, incorrectly labelled (i.e., mislabelled) issue reports are likely non-random. In this paper, we study whether mislabelling is random, and the impact that realistic mislabelling has on the performance and interpretation of defect models. Through a case study of 3,931 manually-curated issue reports from the Apache Jackrabbit and Lucene systems, we find that: (1) issue report mislabelling is not random; (2) precision is rarely impacted by mislabelled issue reports, suggesting that practitioners can rely on the accuracy of modules labelled as defective by models that are trained using noisy data; (3) however, models trained on noisy data typically achieve 56%-68% of the recall of models trained on clean data; and (4) only the metrics in top influence rank of our defect models are robust to the noise introduced by mislabelling, suggesting that the less influential metrics of models that are trained on noisy data should not be interpreted or used to make decisions.", "citation": "Citations (23)", "departments": ["Nara Institute of Science and Technology", "Queen's University", "Queen's University", "Nara Institute of Science and Technology", "Nara Institute of Science and Technology"], "authors": ["Chakkrit Tantithamthavorn.....http://dblp.org/pers/hd/t/Tantithamthavorn:Chakkrit", "Shane McIntosh.....http://dblp.org/pers/hd/m/McIntosh:Shane", "Ahmed E. Hassan.....http://dblp.org/pers/hd/h/Hassan:Ahmed_E=", "Akinori Ihara.....http://dblp.org/pers/hd/i/Ihara:Akinori", "Ken-ichi Matsumoto.....http://dblp.org/pers/hd/m/Matsumoto:Ken=ichi"], "conf": "icse", "year": "2015", "pages": 12}