{"title": "Who are the Devils Wearing Prada in New York City?", "fields": ["multimedia", "clothing", "advertising", "computer science"], "abstract": "Fashion is a perpetual topic in human social life, and the mass has the penchant to emulate what large city residents and celebrities wear. Undeniably, New York City is such a bellwether large city with all kinds of fashion leadership. Consequently, to study what the fashion trends are during this year, it is very helpful to learn the fashion trends of New York City. Discovering fashion trends in New York City could boost many applications such as clothing recommendation and advertising. Does the fashion trend in the New York Fashion Show actually influence the clothing styles on the public? To answer this question, we design a novel system that consists of three major components: (1) constructing a large dataset from the New York Fashion Shows and New York street chic in order to understand the likely clothing fashion trends in New York, (2) utilizing a learning-based approach to discover fashion attributes as the representative characteristics of fashion trends, and (3) comparing the analysis results from the New York Fashion Shows and street-chic images to verify whether the fashion shows have actual influence on the people in New York City. Through the preliminary experiments over a large clothing dataset, we demonstrate the effectiveness of our proposed system, and obtain useful insights on fashion trends and fashion influence.", "citation": "Citations (9)", "departments": ["National Taiwan University", "University of Rochester", "University of Rochester", "National Taiwan University", "University of Rochester"], "authors": ["Kuan-Ting Chen.....http://dblp.org/pers/hd/c/Chen:Kuan=Ting", "Kezhen Chen.....http://dblp.org/pers/hd/c/Chen:Kezhen", "Peizhong Cong.....http://dblp.org/pers/hd/c/Cong:Peizhong", "Winston H. Hsu.....http://dblp.org/pers/hd/h/Hsu:Winston_H=", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo"], "conf": "mm", "year": "2015", "pages": 4}