{"title": "Incentivizing sharing in realtime D2D streaming networks: A mean field game perspective.", "fields": ["common value auction", "incentive", "unicast", "repeated game", "testbed", "android"], "abstract": "We consider the problem of streaming live content to a cluster of co-located wireless devices that have both an expensive unicast base-station-to-device (B2D) interface, as well as an inexpensive broadcast device-to-device (D2D) interface, which can be used simultaneously. Our setting is a streaming system that uses a block-by-block random linear coding approach to achieve a target percentage of on-time deliveries with minimal B2D usage. Our goal is to design an incentive framework that would promote such cooperation across devices, while ensuring good quality of service. Based on the ideas drawn from truth-telling auctions, we design a mechanism that achieves this goal via appropriate transfers (monetary payments or rebates) in a setting with a large number of devices, and with peer arrivals and departures. Here, we show that a mean field game can be used to accurately approximate our system. Furthermore, the complexity of calculating the best responses under this regime is low. We implement the proposed system on an Android testbed, and illustrate its efficient performance using real world experiments.", "citation": "Citations (12)", "departments": ["Texas A&M University", "Texas A&M University", "Cisco Systems, Inc.", "Texas A&M University", "University of Michigan", "Texas A&M University", "Texas A&M University", "Texas A&M University", "Texas A&M University", "University of Michigan"], "authors": ["Jian Li.....http://dblp.org/pers/hd/l/Li_0008:Jian", "Rajarshi Bhattacharyya.....http://dblp.org/pers/hd/b/Bhattacharyya:Rajarshi", "Suman Paul.....http://dblp.org/pers/hd/p/Paul:Suman", "Srinivas Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Srinivas", "Vijay Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Vijay"], "conf": "infocom", "year": "2015", "pages": 9}