{"title": "Fair and optimal resource allocation for LTE multicast (eMBMS): Group partitioning and dynamics.", "fields": ["xcast", "source specific multicast", "ip multicast", "reliable multicast", "pragmatic general multicast"], "abstract": "With recent standardization and deployment of LTE eMBMS, cellular multicast is gaining traction as a method of efficiently using wireless spectrum to deliver large amounts of multimedia data to multiple cell sites. Cellular operators still seek methods of performing optimal resource allocation in eMBMS based on a complete understanding of the complex interactions among a number of mechanisms: the multicast coding scheme, the resources allocated to unicast users and their scheduling at the base stations, the resources allocated to a multicast group to satisfy the user experience of its members, and the number of groups and their membership, all of which we consider in this work. We determine the optimal allocation of wireless resources for users to maximize proportional fair utility. To handle the heterogeneity of user channel conditions, we efficiently and optimally partition multicast users into groups so that users with good signal strength do not suffer by being grouped together with users of poor signal strength. Numerical simulations are performed to compare our scheme to practical heuristics and state-of-the-art schemes. We demonstrate the tradeoff between improving unicast user rates and improving spectrum efficiency through multicast. Finally, we analyze the interaction between the globally fair solution and individual user's desire to maximize its rate. We show that even if the user deviates from the global solution in a number of scenarios, we can bound the number of selfish users that will choose to deviate.", "citation": "Citations (26)", "departments": ["Princeton University", "Princeton University", "AT&T Labs", "AT&T Labs", "University of California, Riverside"], "authors": ["Jiasi Chen.....http://dblp.org/pers/hd/c/Chen:Jiasi", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung", "Jeffrey Erman.....http://dblp.org/pers/hd/e/Erman:Jeffrey", "Guangzhi Li.....http://dblp.org/pers/hd/l/Li:Guangzhi", "K. K. Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:K=_K=", "Rakesh K. Sinha.....http://dblp.org/pers/hd/s/Sinha:Rakesh_K="], "conf": "infocom", "year": "2015", "pages": 9}