{"title": "WaveCube: A scalable, fault-tolerant, high-performance optical data center architecture.", "fields": ["single point of failure", "bottleneck", "bisection bandwidth", "scalability", "3d optical data storage"], "abstract": "Optical data center networks (DCNs) are becoming increasingly attractive due to their technological strengths compared to traditional electrical networks. However, prior optical DCNs are either hard to scale, vulnerable to single point of failure, or provide limited network bisection bandwidth for many practical DCN workloads. To this end, we present WaveCube, a scalable, fault-tolerant, high-performance optical DCN architecture. To scale, WaveCube removes MEMS 1 , a potential bottleneck, from its design. Wave-Cube is fault-tolerant since it does not have single point of failure and there are multiple node-disjoint parallel paths between any pair of Top-of-Rack (ToR) switches. WaveCube delivers high performance by exploiting multi-pathing and dynamic link bandwidth along the path. Our extensive evaluation results show that WaveCube outperforms previous optical DCNs by up to 400% and delivers network bisection bandwidth that is 70%–85% of an ideal non-blocking network under both realistic and synthetic traffic patterns. WaveCube's performance degrades gracefully under failures — it drops 20% even with 20% links cut. WaveCube also holds promise in practice — its wiring complexity is orders of magnitude lower than Fattree, BCube and c-Through at large scale, and its power consumption is 35% of them.", "citation": "Citations (23)", "departments": ["Hong Kong University of Science and Technology", "Northwestern University", "University of California, Los Angeles", "Northwestern University", "NEC Labs China"], "authors": ["Kai Chen.....http://dblp.org/pers/hd/c/Chen_0005:Kai", "Xitao Wen.....http://dblp.org/pers/hd/w/Wen:Xitao", "Xingyu Ma.....http://dblp.org/pers/hd/m/Ma:Xingyu", "Yan Chen.....http://dblp.org/pers/hd/c/Chen_0004:Yan", "Yong Xia.....http://dblp.org/pers/hd/x/Xia:Yong", "Chengchen Hu.....http://dblp.org/pers/hd/h/Hu:Chengchen", "Qunfeng Dong.....http://dblp.org/pers/hd/d/Dong:Qunfeng"], "conf": "infocom", "year": "2015", "pages": 9}