{"title": "Temporal Matching Kernel with Explicit Feature Maps.", "fields": ["result set", "score", "query expansion", "invariant", "timestamp"], "abstract": "This paper proposes a framework for content-based video retrieval that addresses various tasks as particular event retrieval, copy detection or video synchronization. Given a video query, the method is able to efficiently retrieve, from a large collection, similar video events or near-duplicates with temporarily consistent excerpts. As a byproduct of the representation, it provides a precise temporal alignment of the query and the detected video excerpts.   Our method converts a series of frame descriptors into a single visual-temporal descriptor, called a temporal invariant match kernel. This representation takes into account the relative positions of the visual frames: the frame descriptors are jointly encoded with their timestamps. When matching two videos, the method produces a score function for all possible relative timestamps, which is maximized to obtain both the similarity score and the relative time offset.   Then, we propose two complementary contributions to further improve the detection and localization performance.The first is a novel query expansion method that takes advantage of the joint descriptor/timestamp representation to automatically align the first result set and produce an enriched temporal query. In contrast to other query expansion methods proposed for videos, it preserves the localization capability. Second, we improve the localization trade-off between quality and representation size by using several complementary temporal match kernels.   We evaluate our approach on benchmarks for particular event retrieval, copy detection and video synchronization. Our experiments show that our approach achieve excellent detection and localization results.", "citation": "Citations (3)", "departments": ["National Institute of Informatics", "National Institute of Informatics", "French Institute for Research in Computer Science and Automation", "National Institute of Informatics", "MMLab - Univers ... i Minh, Vietnam"], "authors": ["Sébastien Poullot.....http://dblp.org/pers/hd/p/Poullot:S=eacute=bastien", "Shunsuke Tsukatani.....http://dblp.org/pers/hd/t/Tsukatani:Shunsuke", "Phuong Anh Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Phuong_Anh", "Hervé Jégou.....http://dblp.org/pers/hd/j/J=eacute=gou:Herv=eacute=", "Shin'ichi Satoh.....http://dblp.org/pers/hd/s/Satoh:Shin=ichi"], "conf": "mm", "year": "2015", "pages": 10}