{"title": "Distributed network resource allocation for multi-tiered multimedia applications.", "fields": ["multi frequency network", "max min fairness", "telecommunications network", "throughput", "heuristic"], "abstract": "The continuously growing number of multimedia applications in current communication networks highlights the necessity for an efficient resource allocation mechanism to capture the unique characteristics of multi-tiered multimedia applications and allocate network capacity in an efficient way. This paper examines the problem of sharing the network throughput under the existence of inelastic traffic flows that follow a multi-tiered utility function. First, the concept of multi-sigmoidal utilities is introduced in order to describe user satisfaction, then, the implications of the use of such utilities are discussed for two different allocation policies; the bandwidth-proportional and the utility-proportional fairness allocation policies. In the former case, the intrinsic reasons of possible network oscillations are analyzed in detail and a heuristic to overcome such situations is proposed. In the latter one, where such oscillations are not possible, efficient ways to calculate a closed form solution for the optimal rate allocation are described. Moreover, a novel mathematical representation of such a multi-sigmoidal utility is presented and closed form solutions for a number of application types are calculated. Finally, the efficiency and robustness of the proposed algorithms is evaluated by simulations for different network topologies and compared against other work in literature.", "citation": "Citations (1)", "year": "2015", "departments": ["Imperial College London", "Imperial College London", "Imperial College London"], "conf": "infocom", "authors": ["Georgios Tychogiorgos.....http://dblp.org/pers/hd/t/Tychogiorgos:Georgios", "Athanasios Gkelias.....http://dblp.org/pers/hd/g/Gkelias:Athanasios", "Kin K. Leung.....http://dblp.org/pers/hd/l/Leung:Kin_K="], "pages": 9}