{"title": "A Bayesian Approach to Perceptual 3D Object-Part Decomposition Using Skeleton-Based Representations.", "fields": ["medial axis", "active shape model", "probabilistic logic", "shape analysis", "topological skeleton"], "abstract": "We present a probabilistic approach to shape decomposition that creates a skeleton-based shape representation of a 3D object while simultaneously decomposing it into constituent parts. Our approach probabilistically combines two prominent threads from the shape literature: skeleton-based (medial axis) representations of shape, and part-based representations of shape, in which shapes are combinations of primitive parts. Our approach recasts skeleton-based shape representation as a mixture estimation problem, allowing us to apply probabilistic estimation techniques to the problem of 3D shape decomposition, extending earlier work on the 2D case. The estimated 3D shape decompositions approximate human shape decomposition judgments. We present a tractable implementation of the framework, which begins by over-segmenting objects at concavities, and then probabilistically merges them to create a distribution over possible decompositions. This results in a hierarchy of decompositions at different structural scales, again closely matching known properties of human shape representation. The probabilistic estimation procedures that arise naturally in the model allow effective prediction of missing parts. We present results on shapes from a standard database illustrating the effectiveness of the approach.", "citation": "Citations (5)", "departments": ["Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University"], "authors": ["Tarek El-Gaaly.....http://dblp.org/pers/hd/e/El=Gaaly:Tarek", "Vicky Froyen.....http://dblp.org/pers/hd/f/Froyen:Vicky", "Ahmed M. Elgammal.....http://dblp.org/pers/hd/e/Elgammal:Ahmed_M=", "Jacob Feldman.....http://dblp.org/pers/hd/f/Feldman:Jacob", "Manish Singh.....http://dblp.org/pers/hd/s/Singh:Manish"], "conf": "aaai", "year": "2015", "pages": 7}