{"title": "Proactive Annotation Management in Relational Databases.", "fields": ["delegation", "ranking", "exploit", "data curation", "tuple"], "abstract": "Annotation management and data curation has been extensively studied in the context of relational databases. However, existing annotation management techniques share a common limitation, which is that they are all passive engines, i.e., they only manage the annotations obtained from external sources such as DB admins, domain experts, and curation tools. They neither learn from the available annotations nor exploit the annotations-to-data correlations to further enhance the quality of the annotated database. Delegating such crucial and complex tasks to end-users---especially under large-scale databases and annotation sets---is clearly the wrong choice. In this paper, we propose the Nebula system, an advanced and proactive annotation management engine in relational databases. Nebula complements the state-of-art techniques in annotation management by learning from the available annotations, analyzing their content and semantics, and understanding their correlations with the data. And then, Nebula proactively discovers and recommends potentially missing annotation-to-data attachments. We propose context-aware ranking and prioritization of the discovered attachments that take into account the relationships among the data tuples and their annotations. We also propose approximation techniques and expert-enabled verification mechanisms that adaptively maintain high-accuracy predictions while minimizing the experts' involvement. Nebula is realized on top of an existing annotation management engine, and experimentally evaluated to illustrate the effectiveness of the proposed techniques, and to demonstrate the potential gain in enhancing the quality of annotated databases.", "citation": "Not cited", "year": "2015", "departments": ["Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute"], "conf": "sigmod", "authors": ["Karim Ibrahim.....http://dblp.org/pers/hd/i/Ibrahim:Karim", "Xiao Du.....http://dblp.org/pers/hd/d/Du:Xiao", "Mohamed Y. Eltabakh.....http://dblp.org/pers/hd/e/Eltabakh:Mohamed_Y="], "pages": 14}