{"title": "iCrowd: An Adaptive Crowdsourcing Framework.", "fields": ["crowdsourcing", "database", "computer science", "data mining"], "abstract": "Crowdsourcing is widely accepted as a means for resolving tasks that machines are not good at. Unfortunately, Crowdsourcing may yield relatively low-quality results if there is no proper quality control. Although previous studies attempt to eliminate \"bad\" workers by using qualification tests, the accuracies estimated from qualifications may not be accurate, because workers have diverse accuracies across tasks. Thus, the quality of the results could be further improved by selectively assigning tasks to the workers who are well acquainted with the tasks. To this end, we propose an adaptive crowdsourcing framework, called  i  Crowd .  i  Crowd  on-the-fly estimates accuracies of a worker by evaluating her performance on the completed tasks, and predicts which tasks the worker is well acquainted with. When a worker requests for a task,  i  Crowd  assigns her a task, to which the worker has the highest estimated accuracy among all online workers. Once a worker submits an answer to a task,  i  Crowd  analyzes her answer and adjusts estimation of her accuracies to improve subsequent task assignments. This paper studies the challenges that arise in  i  Crowd . The first is how to estimate diverse accuracies of a worker based on her completed tasks. The second is instant task assignment. We deploy  i  Crowd  on Amazon Mechanical Turk, and conduct extensive experiments on real datasets. Experimental results show that iCrowd achieves higher quality than existing approaches.", "citation": "Citations (85)", "year": "2015", "departments": ["National University of Singapore", "Tsinghua University", "National University of Singapore", "National University of Singapore", "Tsinghua University"], "conf": "sigmod", "authors": ["Ju Fan.....http://dblp.org/pers/hd/f/Fan:Ju", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Jianhua Feng.....http://dblp.org/pers/hd/f/Feng:Jianhua"], "pages": 16}