{"title": "Data Acquisition for Real-Time Decision-Making under Freshness Constraints.", "fields": ["real time computing", "data retrieval", "data mining", "baseline", "data acquisition"], "abstract": "The paper describes a novel algorithm for timely sensor data retrieval in resource-poor environments under freshness constraints. Consider a civil unrest, national security, or disaster management scenario, where a dynamic situation evolves and a decision-maker must decide on a course of action in view of latest data. Since the situation changes, so is the best course of action. The scenario offers two interesting constraints. First, one should be able to successfully compute the course of action within some appropriate time window, which we call the decision deadline. Second, at the time the course of action is computed, the data it is based on must be fresh (i.e., within some corresponding validity interval). We call it the freshness constraint. These constraints create an interesting novel problem of timely data retrieval. We address this problem in resource-scarce environments, where network resource limitations require that data objects (e.g., pictures and other sensor measurements pertinent to the decision) generally remain at the sources. Hence, one must decide on (i) which objects to retrieve and (ii) in what order, such that the cost of deciding on a valid course of action is minimized while meeting data freshness and decision deadline constraints. Such an algorithm is reported in this paper. The algorithm is shown in simulation to reduce the cost of data retrieval compared to a host of baselines that consider time or resource constraints. It is applied in the context of minimizing cost of finding unobstructed routes between specified locations in a disaster zone by retrieving data on the health of individual route segments.", "citation": "Citations (7)", "year": "2015", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Southern California"], "conf": "rtss", "authors": ["Shaohan Hu.....http://dblp.org/pers/hd/h/Hu:Shaohan", "Shuochao Yao.....http://dblp.org/pers/hd/y/Yao:Shuochao", "Haiming Jin.....http://dblp.org/pers/hd/j/Jin:Haiming", "Yiran Zhao.....http://dblp.org/pers/hd/z/Zhao:Yiran", "Yitao Hu.....http://dblp.org/pers/hd/h/Hu:Yitao", "Xiaochen Liu.....http://dblp.org/pers/hd/l/Liu:Xiaochen", "Nooreddin Naghibolhosseini.....http://dblp.org/pers/hd/n/Naghibolhosseini:Nooreddin", "Shen Li.....http://dblp.org/pers/hd/l/Li:Shen", "Akash Kapoor.....http://dblp.org/pers/hd/k/Kapoor:Akash", "William Dron.....http://dblp.org/pers/hd/d/Dron:William", "Lu Su.....http://dblp.org/pers/hd/s/Su:Lu", "Amotz Bar-Noy.....http://dblp.org/pers/hd/b/Bar=Noy:Amotz", "Pedro Szekely.....http://dblp.org/pers/hd/s/Szekely:Pedro", "Ramesh Govindan.....http://dblp.org/pers/hd/g/Govindan:Ramesh", "Reginald Hobbs.....http://dblp.org/pers/hd/h/Hobbs:Reginald", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F="], "pages": 10}