{"title": "A measurement study on TCP behaviors in HSPA+ networks on high-speed rails.", "fields": ["hstcp", "tcp hole punching", "tcp pacing", "tcp friendly rate control", "zeta tcp"], "abstract": "TCP has been the dominant transport protocol for mobile internet since its origin. Its behaviors play an essential role in determining quality of service/experience (QoS and QoE) for mobile apps. While TCP has been extensively studied in a static, walking, or driving mobility, it has not been well explored in highspeed (> 200 km/h) mobility cases. With increasing investment and deployment of high speed rails (HSRs), a critical demand of understanding TCP performance under extremely high-speed mobility arises. In this paper, we conduct an in-depth study to investigate TCP behaviors on HSR. We collect 90 GB of measurement data on HSPA+ networks in Chinese high-speed trains with a peak speed of 310 km/h, along various routes (covering 5,000 km) during an 8-month period. We analyze the impacts of high-speed mobility and handoff on performance metrics including RTT, packet loss and network disconnection. Then we demystify the grand challenges posed on TCP operations (TCP establishment, transmission, congestion control and termination). Our study shows that performance greatly declines in HSR, where RTT spikes, packet drops and network disconnections are more significant and occur more frequently, compared with static, slowly moving or driving mobility cases. Moreover, TCP fails to adapt well to such extremely high-speed and yields severely abnormal behaviors, such as high spurious RTO rate, aggressive congestion window reduction, long delay of connection establishment and closure, and transmission interruption. All these findings indicate that extremely high-speed indeed poses a big threat to today's TCP and it calls for urgent efforts to develop HSR-friendly protocols and wireless networks to address even more complicated challenges raised by faster trains/aircrafts in the foreseeable future.", "citation": "Citations (15)", "departments": ["Tsinghua University", "Tsinghua University", "Hong Kong Polytechnic University", "Ohio State University", "Tsinghua University"], "authors": ["Li Li.....http://dblp.org/pers/hd/l/Li_0034:Li", "Ke Xu.....http://dblp.org/pers/hd/x/Xu_0002:Ke", "Dan Wang.....http://dblp.org/pers/hd/w/Wang_0002:Dan", "Chunyi Peng.....http://dblp.org/pers/hd/p/Peng:Chunyi", "Qingyang Xiao.....http://dblp.org/pers/hd/x/Xiao:Qingyang", "Rashid Mijumbi.....http://dblp.org/pers/hd/m/Mijumbi:Rashid"], "conf": "infocom", "year": "2015", "pages": 9}