{"title": "Efficient Activity Retrieval through Semantic Graph Queries.", "fields": ["activity recognition", "precision and recall", "discriminative model", "blossom algorithm", "ranking"], "abstract": "We present an efficient retrieval approach for activity detection in large surveillance video datasets based on semantic graph queries. Unlike conventional approaches, our zero-shot retrievalmethod does not require knowledge of the activity classes contained in the video. We propose a novel user-centric approach thatmodels queries through the creation of sparse semantic graphs based on attributes and discriminative relationships. We then pose search as a ranked subgraph matching problem and leverage the fact that the attributes and relationships in the query have different levels of discriminability to filter out bad matches. Rather than solving the NP-hard exact subgraph matching problem, we develop a novel maximally discriminative spanning tree (MDST) as the relaxation of a given query graph, and then describe a matching algorithm that recovers matches to this tree in linear time using maximally discriminative subgraphmatching (MDSM).We utilize theMDST tominimize the number of possible matches to the original query while guaranteeing that the best matches are within this set. We test this algorithm on two large video datasets: the 35-GB Virat Ground dataset and a 1-TB aerial data collection from Yuma. These datasets yield graphs with 200,000 nodes and 1 million nodes, respectively, with an average degree of 5. Our approach finds complex, large-scale queries in seconds while maintaining comparable precision and recall to slower current approaches.", "citation": "Citations (9)", "departments": ["Boston University", "Boston University", "Boston University", "Boston University"], "authors": ["Gregory D. Castañón.....http://dblp.org/pers/hd/c/Casta=ntilde==oacute=n:Gregory_D=", "Yuting Chen.....http://dblp.org/pers/hd/c/Chen:Yuting", "Ziming Zhang.....http://dblp.org/pers/hd/z/Zhang:Ziming", "Venkatesh Saligrama.....http://dblp.org/pers/hd/s/Saligrama:Venkatesh"], "conf": "mm", "year": "2015", "pages": 10}