{"title": "Parallel Correlation Clustering on Big Graphs.", "fields": ["k medians clustering", "constrained clustering", "canopy clustering algorithm", "data stream clustering", "cure data clustering algorithm"], "abstract": "Given a similarity graph between items, correlation clustering (CC) groups similar items together and dissimilar ones apart. One of the most popular CC algorithms is KwikCluster: an algorithm that serially clusters neighborhoods of vertices, and obtains a 3-approximation ratio. Unfortunately, in practice KwikCluster requires a large number of clustering rounds, a potential bottleneck for large graphs. We present C4 and ClusterWild!, two algorithms for parallel correlation clustering that run in a polylogarithmic number of rounds, and provably achieve nearly linear speedups. C4 uses concurrency control to enforce serializability of a parallel clustering process, and guarantees a 3-approximation ratio. ClusterWild! is a coordination free algorithm that abandons consistency for the benefit of better scaling; this leads to a provably small loss in the 3 approximation ratio.\n\nWe demonstrate experimentally that both algorithms outperform the state of the art, both in terms of clustering accuracy and running time. We show that our algorithms can cluster billion-edge graphs in under 5 seconds on 32 cores, while achieving a 15 x speedup.", "citation": "Citations (21)", "year": "2015", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "nips", "authors": ["Xinghao Pan.....http://dblp.org/pers/hd/p/Pan:Xinghao", "Dimitris S. Papailiopoulos.....http://dblp.org/pers/hd/p/Papailiopoulos:Dimitris_S=", "Samet Oymak.....http://dblp.org/pers/hd/o/Oymak:Samet", "Benjamin Recht.....http://dblp.org/pers/hd/r/Recht:Benjamin", "Kannan Ramchandran.....http://dblp.org/pers/hd/r/Ramchandran:Kannan", "Michael I. Jordan.....http://dblp.org/pers/hd/j/Jordan:Michael_I="], "pages": 9}