{"title": "Discriminative learning of iteration-wise priors for blind deconvolution.", "fields": ["kernel density estimation", "discriminative model", "image restoration", "deblurring", "blind deconvolution"], "abstract": "The maximum a posterior (MAP)-based blind deconvolution framework generally involves two stages: blur kernel estimation and non-blind restoration. For blur kernel estimation, sharp edge prediction and carefully designed image priors are vital to the success of MAP. In this paper, we propose a blind deconvolution framework together with iteration specific priors for better blur kernel estimation. The family of hyper-Laplacian (Pr(d) ∝ ℯ −∥d∥pp/λ ) is adopted for modeling iteration-wise priors of image gra- dients, where each iteration has its own model parameters {λ (t) , p (t) }. To avoid heavy parameter tuning, all iteration-wise model parameters can be learned using our principled discriminative learning model from a training set, and can be directly applied to other dataset and real blurry images. Interestingly, with the generalized shrinkage / thresholding operator, negative p value (p <0) is allowable and we find that it contributes more in estimating the coarse shape of blur kernel. Experimental results on synthetic and real world images demonstrate that our method achieves better deblurring results than the existing gradient prior-based methods. Compared with the state-of-the-art patch prior-based method, our method is competitive in restoration results but is much more efficient.", "citation": "Citations (18)", "year": "2015", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Hong Kong Polytechnic University", "Sun Yat-sen University", "Hong Kong Polytechnic University"], "conf": "cvpr", "authors": ["Wangmeng Zuo.....http://dblp.org/pers/hd/z/Zuo:Wangmeng", "Dongwei Ren.....http://dblp.org/pers/hd/r/Ren:Dongwei", "Shuhang Gu.....http://dblp.org/pers/hd/g/Gu:Shuhang", "Liang Lin.....http://dblp.org/pers/hd/l/Lin:Liang", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0006:Lei"], "pages": 9}