{"title": "On the progressive spread over strategic diffusion: Asymptotic and computation.", "fields": ["coordination game", "sunk costs", "best response", "diffusion", "social graph"], "abstract": "We study how an innovation (e.g., product or technology) diffuses over a social network when individuals strategically make selfish, rational choices in adopting the new innovation. This diffusion has been studied by modeling individuals' interactions with a noisy best response dynamic over a networked coordination game, but mainly in the nonprogressive setup. In this paper, we study the case when people are progressive, i.e., never going back to the old technology once the new technology is chosen, where such a progressive behavior is explained using the notion of sunk cost fallacy in social psychology. Our main focus is on the diffusion time, i.e., time till all choose the new innovation. To this end, we first provide a combinatorial characterization of the diffusion time that corresponds to the time reaching the absorbing state in a Markov chain. Based on this, we propose a polynomial-time algorithm that computes the diffusion time, where such a task is known to be computationally intractable in the non-progressive diffusion. Second, we asymptotically quantify the diffusion times for a class of well-known social graph topologies, and compare them to those under the non-progressive diffusion. Finally, we study the impact of seeding to speed up the diffusion in the progressive setup, and show that the diffusion speed is impossible to significantly accelerate with just a small-budget seeding, which is in part in stark contrast to that in the non-progressive diffusion. Our results provide not only understandings on the progressive strategic diffusion in a social network, but also computational tractability on other related problems, e.g., seeding, which we believe should be of broader interest in the future.", "citation": "Citations (3)", "departments": ["KAIST", "KAIST", "KAIST"], "authors": ["Jungseul Ok.....http://dblp.org/pers/hd/o/Ok:Jungseul", "Jinwoo Shin.....http://dblp.org/pers/hd/s/Shin:Jinwoo", "Yung Yi.....http://dblp.org/pers/hd/y/Yi:Yung"], "conf": "infocom", "year": "2015", "pages": 9}