{"title": "Proactive self-adaptation under uncertainty: a probabilistic model checking approach.", "fields": ["lead time", "latency", "nondeterministic algorithm", "horizon", "factoring"], "abstract": "Self-adaptive systems tend to be reactive and myopic, adapting in response to changes without anticipating what the subsequent adaptation needs will be. Adapting reactively can result in inefficiencies due to the system performing a suboptimal sequence of adaptations. Furthermore, when adaptations have latency, and take some time to produce their effect, they have to be started with sufficient lead time so that they complete by the time their effect is needed. Proactive latency-aware adaptation addresses these issues by making adaptation decisions with a look-ahead horizon and taking adaptation latency into account. In this paper we present an approach for proactive latency-aware adaptation under uncertainty that uses probabilistic model checking for adaptation decisions. The key idea is to use a formal model of the adaptive system in which the adaptation decision is left underspecified through nondeterminism, and have the model checker resolve the nondeterministic choices so that the accumulated utility over the horizon is maximized. The adaptation decision is optimal over the horizon, and takes into account the inherent uncertainty of the environment predictions needed for looking ahead. Our results show that the decision based on a look-ahead horizon, and the factoring of both tactic latency and environment uncertainty, considerably improve the effectiveness of adaptation decisions.", "citation": "Citations (68)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "SEI, USA"], "authors": ["Gabriel A. Moreno.....http://dblp.org/pers/hd/m/Moreno:Gabriel_A=", "Javier Cámara.....http://dblp.org/pers/hd/c/C=aacute=mara:Javier", "David Garlan.....http://dblp.org/pers/hd/g/Garlan:David", "Bradley R. Schmerl.....http://dblp.org/pers/hd/s/Schmerl:Bradley_R="], "conf": "sigsoft", "year": "2015", "pages": 12}