{"title": "Non-Linear Regression for Bag-of-Words Data via Gaussian Process Latent Variable Set Model.", "fields": ["latent variable model", "probabilistic latent semantic analysis", "kernel embedding of distributions", "latent class model", "nonlinear regression"], "abstract": "Gaussian process (GP) regression is a widely used method for non-linear prediction. The performance of the GP regression depends on whether it can properly capture the covariance structure of target variables, which is represented by kernels between input data. However, when the input is represented as a set of features, e.g. bag-of-words, it is difficult to calculate desirable kernel values because the co-occurrence of different but relevant words cannot be reflected in the kernel calculation. To overcome this problem, we propose a Gaussian process latent variable set model (GP-LVSM), which is a non-linear regression model effective for bag-of-words data. With the GP-LVSM, a latent vector is associated with each word, and each document is represented as a distribution of the latent vectors for words appearing in the document. We efficiently represent the distributions by using the framework of kernel embed-dings of distributions that can hold high-order moment information of distributions without need for explicit density estimation. By learning latent vectors so as to maximize the posterior probability, kernels that reflect relations between words are obtained, and also words are visualized in a low-dimensional space. In experiments using 25 item review datasets, we demonstrate the effectiveness of the GP-LVSM in prediction and visualization.", "citation": "Citations (3)", "departments": ["Nara Institute of Science and Technology", "Nippon Telegraph and Telephone", "NTT Communicati ... , Kyoto, Japan"], "authors": ["Yuya Yoshikawa.....http://dblp.org/pers/hd/y/Yoshikawa:Yuya", "Tomoharu Iwata.....http://dblp.org/pers/hd/i/Iwata:Tomoharu", "Hiroshi Sawada.....http://dblp.org/pers/hd/s/Sawada:Hiroshi"], "conf": "aaai", "year": "2015", "pages": 7}