{"title": "A Genetic Algorithm for Detecting Significant Floating-Point Inaccuracies.", "fields": ["fitness function", "debugging", "cost estimate", "metaheuristic", "floating point"], "abstract": "It is well-known that using floating-point numbers may inevitably result in inaccurate results and sometimes even cause serious software failures. Safety-critical software often has strict requirements on the upper bound of inaccuracy, and a crucial task in testing is to check whether significant inaccuracies may be produced.   The main existing approach to the floating-point inaccuracy problem is error analysis, which produces an upper bound of inaccuracies that may occur. However, a high upper bound does not guarantee the existence of inaccuracy defects, nor does it give developers any concrete test inputs for debugging.   In this paper, we propose the first  metaheuristic search-based approach to automatically generating test inputs  that aim to trigger significant inaccuracies in floating-point programs. Our approach is based on the following two insights: (1) with FPDebug, a recently proposed dynamic analysis approach, we can build a reliable fitness function to guide the search; (2) two main factors --- the scales of exponents and the bit formations of significands --- may have significant impact on the accuracy of the output, but in largely different ways. We have implemented and evaluated our approach over 154 real-world floating-point functions. The results show that our approach can detect significant inaccuracies in the subjects.", "citation": "Citations (11)", "departments": ["Peking University", "Peking University", "Peking University", "Peking University", "University of California, Davis"], "authors": ["Daming Zou.....http://dblp.org/pers/hd/z/Zou:Daming", "Ran Wang.....http://dblp.org/pers/hd/w/Wang:Ran", "Yingfei Xiong.....http://dblp.org/pers/hd/x/Xiong:Yingfei", "Lu Zhang.....http://dblp.org/pers/hd/z/Zhang_0023:Lu", "Zhendong Su.....http://dblp.org/pers/hd/s/Su:Zhendong", "Hong Mei.....http://dblp.org/pers/hd/m/Mei:Hong"], "conf": "icse", "year": "2015", "pages": 11}