{"title": "Blazing Fast 2PC in the Offline/Online Setting with Security for Malicious Adversaries.", "fields": ["secure multi party computation", "computer security", "thread", "internet privacy", "overhead", "computer science", "computation", "theoretical computer science"], "abstract": "Recently, several new techniques were presented to dramatically improve key parts of secure two-party computation (2PC) protocols that use the cut-and-choose paradigm on garbled circuits for 2PC with security against malicious adversaries. These include techniques for reducing the number of garbled circuits (Lindell 13, Huang et al. 13, Lindell and Riva 14, Huang et al. 14) and techniques for reducing the overheads besides garbled circuits (Mohassel and Riva 13, Shen and Shelat~13). We design a highly optimized protocol in the offline/online setting that makes use of all state-of-the-art techniques, along with several new techniques that we introduce. A crucial part of our protocol is a new technique for enforcing consistency of the inputs used by the party who garbles the circuits. This technique has both theoretical and practical advantages over previous methods.   We present a prototype implementation of our new protocol. This is the first implementation of the amortized cut-and-choose technique of Lindell and Riva (Crypto 2014). Our prototype achieves a speed of just 7 ms in the online stage} and just 74 ms in the offline stage per 2PC invoked, for securely computing AES in the presence of malicious adversaries (using 9 threads on a 2.9GHz machine). We note that no prior work has gone below one second overall on average for the secure computation of AES for malicious adversaries (nor below 20ms in the online stage). Our implementation securely evaluates SHA-256 (which is a much bigger circuit) with 33 ms online time and $206$ ms offline time, per 2PC invoked.", "citation": "Not cited", "year": "2015", "departments": ["Bar-Ilan University", "Bar-Ilan University"], "conf": "ccs", "authors": ["Yehuda Lindell.....http://dblp.org/pers/hd/l/Lindell:Yehuda", "Ben Riva.....http://dblp.org/pers/hd/r/Riva:Ben"], "pages": 12}