{"title": "Borrowing from the Crowd: A Study of Recombination in Software Design Competitions.", "fields": ["crowdsourcing software development", "software design description", "resource oriented architecture", "software engineering process group", "software peer review"], "abstract": "One form of crowdsourcing is the competition, which poses an open call for competing solutions. Commercial systems such as TopCoder have begun to explore the application of competitions to software development, but have important limitations diminishing the potential benefits drawn from the crowd. In particular, they employ a model of independent work that ignores the opportunity for designs to arise from the ideas of multiple designers. In this paper, we examine the potential for software design competitions to incorporate recombination, in which competing designers are given the designs of others and encouraged to use them to revise their own designs. To explore this, we conducted two software design competitions in which participants were asked to produce both an initial and a revised design, drawing on lessons learned from the crowd. We found that, in both competitions, all participants borrowed ideas and most improved the quality of their designs. Our findings demonstrate the potential benefits of recombination in software design and suggest several ways in which software design competitions can be improved.", "citation": "Citations (11)", "departments": ["University of California, Irvine", "University of Amsterdam", "University of Amsterdam", "University of California, Irvine", "University of California, Irvine"], "authors": ["Thomas D. LaToza.....http://dblp.org/pers/hd/l/LaToza:Thomas_D=", "Micky Chen.....http://dblp.org/pers/hd/c/Chen:Micky", "Luxi Jiang.....http://dblp.org/pers/hd/j/Jiang:Luxi", "Mengyao Zhao.....http://dblp.org/pers/hd/z/Zhao:Mengyao", "André van der Hoek.....http://dblp.org/pers/hd/h/Hoek:Andr=eacute=_van_der"], "conf": "icse", "year": "2015", "pages": 12}