{"title": "Measuring Real-World Accuracies and Biases in Modeling Password Guessability.", "fields": ["password", "password strength", "cognitive password", "meter", "parameterized complexity"], "abstract": "Parameterized password guessability--how many guesses a particular cracking algorithm with particular training data would take to guess a password--has become a common metric of password security. Unlike statistical metrics, it aims to model real-world attackers and to provide per-password strength estimates. We investigate how cracking approaches often used by researchers compare to real-world cracking by professionals, as well as how the choice of approach biases research conclusions.\n\nWe find that semi-automated cracking by professionals outperforms popular fully automated approaches, but can be approximated by combining multiple such approaches. These approaches are only effective, however, with careful configuration and tuning; in commonly used default configurations, they underestimate the real-world guessability of passwords. We find that analyses of large password sets are often robust to the algorithm used for guessing as long as it is configured effectively. However, cracking algorithms differ systematically in their effectiveness guessing passwords with certain common features (e.g., character substitutions). This has important implications for analyzing the security of specific password characteristics or of individual passwords (e.g., in a password meter or security audit). Our results highlight the danger of relying only on a single cracking algorithm as a measure of password strength and constitute the first scientific evidence that automated guessing can often approximate guessing by professionals.", "citation": "Citations (82)", "year": "2015", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "uss", "authors": ["Blase Ur.....http://dblp.org/pers/hd/u/Ur:Blase", "Sean M. Segreti.....http://dblp.org/pers/hd/s/Segreti:Sean_M=", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Nicolas Christin.....http://dblp.org/pers/hd/c/Christin:Nicolas", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith", "Saranga Komanduri.....http://dblp.org/pers/hd/k/Komanduri:Saranga", "Darya Kurilova.....http://dblp.org/pers/hd/k/Kurilova:Darya", "Michelle L. Mazurek.....http://dblp.org/pers/hd/m/Mazurek:Michelle_L=", "William Melicher.....http://dblp.org/pers/hd/m/Melicher:William", "Richard Shay.....http://dblp.org/pers/hd/s/Shay:Richard"], "pages": 19}