{"title": "Spiteful Bidding in the Dollar Auction.", "fields": ["vickrey clarke groves auction", "auction theory", "reverse auction", "revenue equivalence", "dollar auction", "generalized second price auction"], "abstract": "Shubik's dollar auction is a simple yet powerful auction model that aims to shed light on the motives and dynamics of conflict escalation. Technically, a dollar auction is a two-player all-pay auction, where the players compete for a dollar.\n\nCommon intuition suggests that the dollar auction is a trap. Both players may substantially overbid since, at any stage, leaving the auction leads to a certain loss. On the other hand, bidding further gives a chance to win the prize and, at least, minimize losses. However, O'Neill proved that the dollar auction has a surprising solution in pure strategies. In particular, assuming the budgets of players are finite, only one player bids and wins the prize.\n\nDoes this mean that the conflict in the dollar auction does not escalate after all? In research we reconsider O'Neill's results following recent literature on spiteful bidders. We ask the question whether the escalation in the dollar auction can be induced by human meanness. Our results confirm this conjecture in various scenarios. A spiteful player is often able to escalate the auction and force the non-spiteful opponent to spend most of the budget. Still, it is the spiteful bidder who wins the prize.", "citation": "Not cited", "departments": ["University of Warsaw", "University of Oxford", "Masdar Institute of Science and Technology", "University of Warsaw", "University of Oxford", "Masdar Institute of Science and Technology", "Polish-Japanese ... Warsaw, Poland", "Polish-Japanese ... ion Technology"], "authors": ["Marcin Waniek.....http://dblp.org/pers/hd/w/Waniek:Marcin", "Agata Niescieruk.....http://dblp.org/pers/hd/n/Niescieruk:Agata", "Tomasz P. Michalak.....http://dblp.org/pers/hd/m/Michalak:Tomasz_P=", "Talal Rahwan.....http://dblp.org/pers/hd/r/Rahwan:Talal"], "conf": "ijcai", "year": "2015", "pages": 7}