{"title": "Protecting against screenshots: An image processing approach.", "fields": ["human visual system model", "exploit", "data protection act 1998", "information privacy", "data security"], "abstract": "Motivated by reasons related to data security and privacy, we propose a method to limit meaningful visual contents of a display from being captured by screenshots. Traditional methods take a system architectural approach to protect against screenshots. We depart from this framework, and instead exploit image processing techniques to distort visual data of a display and present the distorted data to the viewer. Given that a screenshot captures distorted visual contents, it yields limited useful data. We exploit the human visual system to empower viewers to automatically and mentally recover the distorted contents into a meaningful form in real-time. Towards this end, we leverage on findings from psychological studies which show that blending of visual information from recent and current fixations enables human to form meaningful representation of a scene. We model this blending of information by an additive process, and exploit this to design a visual contents distortion algorithm that supports real-time contents recovery by the human visual system. Our experiments and user study demonstrate the feasibility of our method to allow viewers to readily interpret visual contents of a display, while limiting meaningful contents from being captured by screenshots.", "citation": "Citations (2)", "year": "2015", "departments": ["Agency for Science, Technology and Research", "Rakuten Institu ... y, Tokyo, Japan", "Rakuten Institu ... y, Tokyo, Japan", "Rakuten Institu ... y, Tokyo, Japan"], "conf": "cvpr", "authors": ["Alex Yong-Sang Chia.....http://dblp.org/pers/hd/c/Chia:Alex_Yong=Sang", "Udana Bandara.....http://dblp.org/pers/hd/b/Bandara:Udana", "Xiangyu Wang.....http://dblp.org/pers/hd/w/Wang:Xiangyu", "Hiromi Hirano.....http://dblp.org/pers/hd/h/Hirano:Hiromi"], "pages": 9}