{"title": "Mitigating macro-cell outage in LTE-Advanced deployments.", "fields": ["channel state information", "beamforming", "network service", "lte advanced", "power control"], "abstract": "LTE network service reliability is highly dependent on the wireless coverage that is provided by cell towers (eNB). Therefore, the network operator's response to outage scenarios needs to be fast and efficient, in order to minimize any degradation in the Quality of Service (QoS). In this paper, we propose an outage mitigation framework for LTE-Advanced (LTE-A) wireless networks. Our framework exploits the inherent design features of LTE-A; it performs a dual optimization of the transmission power and beamforming weight parameters at each neighbor cell sector of the outage eNBs, while taking into account both the channel characteristics and residual eNB resources, after serving its current traffic load. Assuming statistical Channel State Information about the users at the eNBs, we show that this problem is theoretically NP-hard; thus we relax it as a convex optimization problem and solve for the optimal points using an iterative algorithm. Contrary to previously-proposed power control studies, our framework is specifically designed to alleviate the effects of sudden LTE-A eNB outages, where a large number of mobile users need to be efficiently offloaded to nearby towers. We present the detailed analytical design of our framework, and we assess its efficacy via extensive NS-3 simulations on an LTE-A topology. Our simulations demonstrate that our framework provides adequate coverage and QoS across all examined outage scenarios.", "citation": "Citations (2)", "departments": ["University of California, Davis", "AT&T Labs", "AT&T Labs", "Purdue University", "University of California, Davis"], "authors": ["Rajarajan Sivaraj.....http://dblp.org/pers/hd/s/Sivaraj:Rajarajan", "Ioannis Broustis.....http://dblp.org/pers/hd/b/Broustis:Ioannis", "N. K. Shankaranarayanan.....http://dblp.org/pers/hd/s/Shankaranarayanan:N=_K=", "Vaneet Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Vaneet", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant"], "conf": "infocom", "year": "2015", "pages": 9}