{"title": "A demonstration of Shahed: A MapReduce-based system for querying and visualizing satellite data.", "fields": ["search engine indexing", "visualization", "cloud computing", "user interface", "data visualization"], "abstract": "Several space agencies such as NASA are continuously collecting datasets of earth dynamics—e.g., temperature, vegetation, and cloud coverage—through satellites. This data is stored in a publicly available archive for scientists and researchers and is very useful for studying climate, desertification, and land use change. The benefit of this data comes from its richness as it provides an archived history for over 15 years of satellite observations. Unfortunately, the use of such data is very limited due to the huge size of archives (> 500TB) and the limited capabilities of traditional applications. In this demo, we present Shahed, an interactive system which provides an efficient way to index, query, and visualize satellite datasets available in NASA archive. Shahed is composed of four main modules. The uncertainty module resolves data uncertainty imposed by the satellites. The indexing module organizes the data in a novel multi-resolution spatio-temporal index designed for satellite data. The querying module uses the indexes to answer both spatiotemporal selection and aggregate queries provided by the user. The visualization module generates images, videos, and multi-level images which gives an insight of data distribution and dynamics over time. This demo gives users a hands-on experience with Shahed through a map-based web interface in which users can browse the available datasets using the map, issue spatiotemporal queries, and visualize the results as images or videos.", "citation": "Citations (4)", "departments": ["University of Minnesota", "Umm al-Qura University", "Umm al-Qura University", "Umm al-Qura University", "Umm al-Qura University"], "authors": ["Ahmed Eldawy.....http://dblp.org/pers/hd/e/Eldawy:Ahmed", "Saif Al-Harthi.....http://dblp.org/pers/hd/a/Al=Harthi:Saif", "Abdulhadi Alzaidy.....http://dblp.org/pers/hd/a/Alzaidy:Abdulhadi", "Anas Daghistani.....http://dblp.org/pers/hd/d/Daghistani:Anas", "Sohaib Ghani.....http://dblp.org/pers/hd/g/Ghani:Sohaib", "Saleh M. Basalamah.....http://dblp.org/pers/hd/b/Basalamah:Saleh_M=", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F="], "conf": "icde", "year": "2015", "pages": 4}