{"title": "Static power of mobile devices: Self-updating radio maps for wireless indoor localization.", "fields": ["exploit", "software deployment", "mobile computing", "mobile device", "rss"], "abstract": "The proliferation of mobile computing has prompted WiFi-based indoor localization to be one of the most attractive and promising techniques for ubiquitous applications. A primary concern for these technologies to be fully practical is to combat harsh indoor environmental dynamics, especially for long-term deployment. Despite numerous research on WiFi fingerprint-based localization, the problem of radio map adaptation has not been sufficiently studied and remains open. In this work, we propose AcMu, an automatic and continuous radio map self-updating service for wireless indoor localization that exploits the static behaviors of mobile devices. By accurately pinpointing mobile devices with a novel trajectory matching algorithm, we employ them as mobile reference points to collect real-time RSS samples when they are static. With these fresh reference data, we adapt the complete radio map by learning an underlying relationship of RSS dependency between different locations, which is expected to be relatively constant over time. Extensive experiments for 20 days across 6 months demonstrate that AcMu effectively accommodates RSS variations over time and derives accurate prediction of fresh radio map with average errors of less than 5dB. Moreover, AcMu provides 2x improvement on localization accuracy by maintaining an up-to-date radio map.", "citation": "Citations (25)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Chenshu Wu.....http://dblp.org/pers/hd/w/Wu:Chenshu", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng", "Chaowei Xiao.....http://dblp.org/pers/hd/x/Xiao:Chaowei", "Chaofan Yang.....http://dblp.org/pers/hd/y/Yang:Chaofan", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Mingyan Liu.....http://dblp.org/pers/hd/l/Liu:Mingyan"], "conf": "infocom", "year": "2015", "pages": 9}