{"title": "Test report prioritization to assist crowdsourced testing.", "fields": ["crowdsourced testing", "test management approach", "prioritization", "incentive", "test strategy"], "abstract": "In crowdsourced testing, users can be incentivized to perform testing tasks and report their results, and because crowdsourced workers are often paid per task, there is a financial incentive to complete tasks quickly rather than well. These reports of the crowdsourced testing tasks are called \"test reports\" and are composed of simple natural language and screenshots. Back at the software-development organization, developers must manually inspect the test reports to judge their value for revealing faults. Due to the nature of crowdsourced work, the number of test reports are often difficult to comprehensively inspect and process. In order to help with this daunting task, we created the first technique of its kind, to the best of our knowledge, to prioritize test reports for manual inspection. Our technique utilizes two key strategies: (1) a diversity strategy to help developers inspect a wide variety of test reports and to avoid duplicates and wasted effort on falsely classified faulty behavior, and (2) a risk strategy to help developers identify test reports that may be more likely to be fault-revealing based on past observations. Together, these strategies form our DivRisk strategy to prioritize test reports in crowd- sourced testing. Three industrial projects have been used to evaluate the effectiveness of test report prioritization methods. The results of the empirical study show that: (1) DivRisk can significantly outperform random prioritization; (2) DivRisk can approximate the best theoretical result for a real-world industrial mobile application. In addition, we provide some practical guidelines of test report prioritization for crowdsourced testing based on the empirical study and our experiences.", "citation": "Citations (16)", "departments": ["University of California, Irvine", "Nanjing University", "University of California, Irvine", "Nanjing University", "Nanjing University"], "authors": ["Yang Feng.....http://dblp.org/pers/hd/f/Feng:Yang", "Zhenyu Chen.....http://dblp.org/pers/hd/c/Chen_0001:Zhenyu", "James A. Jones.....http://dblp.org/pers/hd/j/Jones:James_A=", "Chunrong Fang.....http://dblp.org/pers/hd/f/Fang:Chunrong", "Baowen Xu.....http://dblp.org/pers/hd/x/Xu:Baowen"], "conf": "sigsoft", "year": "2015", "pages": 12}