{"title": "QASCA: A Quality-Aware Task Assignment System for Crowdsourcing Applications.", "fields": ["crowdsourcing", "crowdsourcing software development", "assignment problem", "name resolution", "sentiment analysis"], "abstract": "A crowdsourcing system, such as the Amazon Mechanical Turk (AMT), provides a platform for a large number of questions to be answered by Internet workers. Such systems have been shown to be useful to solve problems that are difficult for computers, including entity resolution, sentiment analysis, and image recognition. In this paper, we investigate the  online task assignment problem : Given a pool of n questions, which of the  k  questions should be assigned to a worker? A poor assignment may not only waste time and money, but may also hurt the quality of a crowdsourcing application that depends on the workers' answers. We propose to consider quality measures (also known as evaluation metrics) that are relevant to an application during the task assignment process. Particularly, we explore how Accuracy and F-score, two widely-used evaluation metrics for crowdsourcing applications, can facilitate task assignment. Since these two metrics assume that the ground truth of a question is known, we study their variants that make use of the probability distributions derived from workers' answers. We further investigate  online assignment strategies , which enables optimal task assignments. Since these algorithms are expensive, we propose solutions that attain high quality in linear time. We develop a system called the Quality-Aware Task Assignment System for Crowdsourcing Applications (QASCA) on top of AMT. We evaluate our approaches on five real crowdsourcing applications. We find that QASCA is efficient, and attains better result quality (of more than 8% improvement) compared with existing methods.", "citation": "Citations (90)", "year": "2015", "departments": ["University of Hong Kong", "University of California, Berkeley", "Tsinghua University", "University of Hong Kong", "Tsinghua University"], "conf": "sigmod", "authors": ["Yudian Zheng.....http://dblp.org/pers/hd/z/Zheng:Yudian", "Jiannan Wang.....http://dblp.org/pers/hd/w/Wang:Jiannan", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Reynold Cheng.....http://dblp.org/pers/hd/c/Cheng:Reynold", "Jianhua Feng.....http://dblp.org/pers/hd/f/Feng:Jianhua"], "pages": 16}