{"title": "Data preference matters: A new perspective of safety data dissemination in vehicular ad hoc networks.", "fields": ["network packet", "wireless ad hoc network", "vehicular ad hoc network", "throughput", "dissemination"], "abstract": "Vehicle-to-vehicle safety data dissemination plays an increasingly important role in ensuring the safety and efficiency of vehicle transportation. When collecting safety data, vehicles always prefer data generated at a closer location over data generated at a distant location, and prefer recent data over outdated data. However, these data preferences have been overlooked in most of existing safety data dissemination protocols, preventing vehicles getting more precise traffic information. In this paper, we explore the feasibility and benefits of incorporating the data preferences of vehicles in designing efficient safety data dissemination protocols. In particular, we propose the concept of packet-value to quantify these data preferences. We then design PVCast, a packet-value-based safety data dissemination protocol in VANET. PVCast makes the dissemination decision for each packet based on its packet-value and effective dissemination coverage in order to satisfy the data preferences of all the vehicles in the network. In addition, PVCast is lightweight and fully distributed. We evaluate the performance of PVCast on the ns-2 platform by comparing it with three representative data dissemination protocols. Simulation results in a typical highway scenario show that PVCast provides a significant improvement on per-vehicle throughput, per-packet dissemination coverage with small per-packet delay. Our findings demonstrate the importance and necessity of comprehensively considering the data preferences of vehicles when designing an efficient safety data dissemination protocol for VANET.", "citation": "Citations (14)", "departments": ["McGill University", "McGill University", "McGill University", "General Motors", "McGill University"], "authors": ["Qiao Xiang.....http://dblp.org/pers/hd/x/Xiang:Qiao", "Xi Chen.....http://dblp.org/pers/hd/c/Chen_0009:Xi", "Linghe Kong.....http://dblp.org/pers/hd/k/Kong:Linghe", "Lei Rao.....http://dblp.org/pers/hd/r/Rao:Lei", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue"], "conf": "infocom", "year": "2015", "pages": 9}