{"title": "Real-time visual analysis of microvascular blood flow for critical care.", "fields": ["image stabilization", "intuition", "resuscitation", "blood flow", "computer vision"], "abstract": "Microcirculatory monitoring plays an important role in diagnosis and treatment of critical care patients. Sidestream Dark Field (SDF) imaging devices have been used to visualize and support interpretation of the micro-vascular blood flow. However, due to subsurface scattering within the tissue that embeds the capillaries, transparency of plasma, imaging noise and lack of features, it is difficult to obtain reliable physiological data from SDF videos. Therefore, thus far microcirculatory videos have been analyzed manually with significant input from expert clinicians. In this paper, we present a framework that automates the analysis process. It includes stages of video stabilization, enhancement, and micro-vessel extraction, in order to automatically estimate statistics of the micro blood flows from SDF videos. Our method has been validated in critical care experiments conducted carefully to record the microcirculatory blood flow in test animal subjects before, during and after induced bleeding episodes, as well as to study the effect of fluid resuscitation. Our method is able to extract microcirculatory measurements that are consistent with clinical intuition and it has a potential to become a useful tool in critical care medicine.", "citation": "Citations (2)", "year": "2015", "departments": ["Carnegie Mellon University", "University of Pittsburgh", "Carnegie Mellon University", "Carnegie Mellon University", "University of Pittsburgh"], "conf": "cvpr", "authors": ["Chao Liu.....http://dblp.org/pers/hd/l/Liu:Chao", "Hernando Gomez.....http://dblp.org/pers/hd/g/Gomez:Hernando", "Srinivasa G. Narasimhan.....http://dblp.org/pers/hd/n/Narasimhan:Srinivasa_G=", "Artur Dubrawski.....http://dblp.org/pers/hd/d/Dubrawski:Artur", "Michael R. Pinsky.....http://dblp.org/pers/hd/p/Pinsky:Michael_R=", "Brian Zuckerbraun.....http://dblp.org/pers/hd/z/Zuckerbraun:Brian"], "pages": 9}