{"title": "Beyond the PDP-11: Architectural Support for a Memory-Safe C Abstract Machine.", "fields": ["flat memory model", "memory protection", "memory safety", "memory model", "pointer"], "abstract": "We propose a new memory-safe interpretation of the C abstract machine that provides stronger protection to benefit security and debugging. Despite ambiguities in the specification intended to provide implementation flexibility, contemporary implementations of C have converged on a memory model similar to the PDP-11, the original target for C. This model lacks support for memory safety despite well-documented impacts on security and reliability.   Attempts to change this model are often hampered by assumptions embedded in a large body of existing C code, dating back to the memory model exposed by the original C compiler for the PDP-11. Our experience with attempting to implement a memory-safe variant of C on the CHERI experimental microprocessor led us to identify a number of problematic idioms. We describe these as well as their interaction with existing memory safety schemes and the assumptions that they make beyond the requirements of the C specification. Finally, we refine the CHERI ISA and abstract model for C, by combining elements of the CHERI capability model and fat pointers, and present a softcore CPU that implements a C abstract machine that can run legacy C code with strong memory protection guarantees.", "citation": "Citations (55)", "year": "2015", "departments": ["University of Cambridge", "University of Cambridge", "University of Cambridge", "University of Cambridge", "University of Cambridge"], "conf": "asplos", "authors": ["David Chisnall.....http://dblp.org/pers/hd/c/Chisnall:David", "Colin Rothwell.....http://dblp.org/pers/hd/r/Rothwell:Colin", "Robert N. M. Watson.....http://dblp.org/pers/hd/w/Watson:Robert_N=_M=", "Jonathan Woodruff.....http://dblp.org/pers/hd/w/Woodruff:Jonathan", "Munraj Vadera.....http://dblp.org/pers/hd/v/Vadera:Munraj", "Simon W. Moore.....http://dblp.org/pers/hd/m/Moore:Simon_W=", "Michael Roe.....http://dblp.org/pers/hd/r/Roe:Michael", "Brooks Davis.....http://dblp.org/pers/hd/d/Davis:Brooks", "Peter G. Neumann.....http://dblp.org/pers/hd/n/Neumann:Peter_G="], "pages": 14}