{"title": "Drops for Stuff: An Analysis of Reshipping Mule Scams.", "fields": ["credit card fraud", "trade credit", "black market", "cash", "monetization"], "abstract": "Credit card fraud has seen rampant increase in the past years, as customers use credit cards and similar financial instruments frequently. Both online and brick-and-mortar outfits repeatedly fall victim to cybercriminals who siphon off credit card information in bulk. Despite the many and creative ways that attackers use to steal and trade credit card information, the stolen information can rarely be used to withdraw money directly, due to protection mechanisms such as PINs and cash advance limits. As such, cybercriminals have had to devise more advanced monetization schemes to work around the current restrictions. One monetization scheme that has been steadily gaining traction are reshipping scams. In such scams, cybercriminals purchase high-value or highly-demanded products from online merchants using stolen payment instruments, and then ship the items to a credulous citizen. This person, who has been recruited by the scammer under the guise of \"work-from-home\" opportunities, then forwards the received products to the cybercriminals, most of whom are located overseas. Once the goods reach the cybercriminals, they are then resold on the black market for an illicit profit. Due to the intricacies of this kind of scam, it is exceedingly difficult to trace, stop, and return shipments, which is why reshipping scams have become a common means for miscreants to turn stolen credit cards into cash.   In this paper, we report on the first large-scale analysis of reshipping scams, based on information that we obtained from multiple reshipping scam websites. We provide insights into the underground economy behind reshipping scams, such as the relationships among the various actors involved, the market size of this kind of scam, and the associated operational churn. We find that there exist prolific reshipping scam operations, with one having shipped nearly 6,000 packages in just 9 months of operation, exceeding 7.3 million US dollars in yearly revenue, contributing to an overall reshipping scam revenue of an estimated 1.8 billion US dollars per year. Finally, we propose possible approaches to intervene and disrupt reshipping scam services.", "citation": "Citations (6)", "year": "2015", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "Stony Brook University", "University College London", "Boston University"], "conf": "ccs", "authors": ["Shuang Hao.....http://dblp.org/pers/hd/h/Hao:Shuang", "Kevin Borgolte.....http://dblp.org/pers/hd/b/Borgolte:Kevin", "Nick Nikiforakis.....http://dblp.org/pers/hd/n/Nikiforakis:Nick", "Gianluca Stringhini.....http://dblp.org/pers/hd/s/Stringhini:Gianluca", "Manuel Egele.....http://dblp.org/pers/hd/e/Egele:Manuel", "Michael Eubanks.....http://dblp.org/pers/hd/e/Eubanks:Michael", "Brian Krebs.....http://dblp.org/pers/hd/k/Krebs:Brian", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "pages": 12}