{"title": "A truthful incentive mechanism for emergency demand response in colocation data centers.", "fields": ["demand response", "reverse auction", "backup", "demand reduction", "remuneration"], "abstract": "Data centers are key participants in demand response programs, including emergency demand response (EDR), where the grid coordinates large electricity consumers for demand reduction in emergency situations to prevent major economic losses. While existing literature concentrates on owner-operated data centers, this work studies EDR in multi-tenant colocation data centers where servers are owned and managed by individual tenants. EDR in colocation data centers is significantly more challenging, due to lack of incentives to reduce energy consumption by tenants who control their servers and are typically on fixed power contracts with the colocation operator. Consequently, to achieve demand reduction goals set by the EDR program, the operator has to rely on the highly expensive and/or environmentally-unfriendly on-site energy backup/generation. To reduce cost and environmental impact, an efficient incentive mechanism is therefore in need, motivating tenants' voluntary energy reduction in case of EDR. This work proposes a novel incentive mechanism, Truth-DR, which leverages a reverse auction to provide monetary remuneration to tenants according to their agreed energy reduction. Truth-DR is computationally efficient, truthful, and achieves 2-approximation in colocation-wide social cost. Trace-driven simulations verify the efficacy of the proposed auction mechanism.", "citation": "Citations (34)", "departments": ["University of Calgary", "Florida International University", "University of Hong Kong", "University of Calgary"], "authors": ["Linquan Zhang.....http://dblp.org/pers/hd/z/Zhang:Linquan", "Shaolei Ren.....http://dblp.org/pers/hd/r/Ren:Shaolei", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng"], "conf": "infocom", "year": "2015", "pages": 9}