{"title": "Location-Aware Pub/Sub System: When Continuous Moving Queries Meet Dynamic Event Streams.", "fields": ["boolean expression", "social media", "streams", "dissemination", "user intent"], "abstract": "In this paper, we propose a new location-aware pub/sub system, Elaps, that continuously monitors moving users subscribing to dynamic event streams from social media and E-commerce applications. Users are notified instantly when there is a matching event nearby. To the best of our knowledge, Elaps is the first to take into account continuous moving queries against dynamic event streams. Like existing works on continuous moving query processing,Elaps employs the concept of safe region to reduce communication overhead. However, unlike existing works which assume data from publishers are static, updates to safe regions may be triggered by newly arrived events. In Elaps, we develop a concept called \\textit{impact region} that allows us to identify whether a safe region is affected by newly arrived events. Moreover, we propose a novel cost model to optimize the safe region size to keep the communication overhead low. Based on the cost model, we design two incremental methods, iGM and idGM, for safe region construction. In addition, Elaps uses boolean expression, which is more expressive than keywords, to model user intent and we propose a novel index, BEQ-Tree, to handle spatial boolean expression matching. In our experiments, we use geo-tweets from Twitter and venues from Foursquare to simulate publishers and boolean expressions generated from AOL search log to represent users intentions. We test user movement in both synthetic trajectories and real taxi trajectories. The results show that Elaps can significantly reduce the communication overhead and disseminate events to users in real-time.", "citation": "Citations (24)", "year": "2015", "departments": ["National University of Singapore", "National University of Singapore", "Tsinghua University", "National University of Singapore", "RMIT University"], "conf": "sigmod", "authors": ["Long Guo.....http://dblp.org/pers/hd/g/Guo:Long", "Dongxiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Dongxiang", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng"], "pages": 15}