{"title": "On the construction of maximum-quality aggregation trees in deadline-constrained WSNs.", "fields": ["bounded function", "overhead", "sink", "optimization problem", "distributed algorithm"], "abstract": "In deadline-constrained data aggregation in wireless sensor networks (WSNs), the imposed sink deadline in an interference-limited network hinders participation of all sensor nodes in data aggregation. Thus, a subset of nodes can contribute in aggregation and quality of aggregation (QoA) increases with the growth of the number of participating nodes. Scheduling the nodes' transmissions is a central problem, which aims to maximize the QoA, while satisfying the sink deadline, i.e., on-time delivery of the sensed data to the sink node. Although the previous studies have proposed optimal scheduling algorithms to this problem given a particular aggregation tree, there is no work on constructing optimal tree in this context. The underlying aggregation tree can make a big difference on QoA since we demonstrate that the ratio between the maximum achievable QoAs of different trees could be as large as O(2 D ), where D is the sink deadline. In this paper, we cast an optimization problem to address optimal tree construction for deadline-constrained data aggregation in WSNs. The problem is combinatorial in nature and difficult to solve as we prove its NP-hardness. We employ Markov approximation framework and devise two distributed algorithms with different computation overheads to find bounded close-to-optimal solutions. Simulation experiments in a set of representative randomly-generated scenarios show that the proposed algorithms significantly improve QoA by 101% and 93% on average compared to the best, to our knowledge, existing alternative methods.", "citation": "Citations (8)", "departments": ["University of Tehran", "University of Tehran", "University of Tehran"], "authors": ["Bahram Alinia.....http://dblp.org/pers/hd/a/Alinia:Bahram", "Mohammad Hassan Hajiesmaili.....http://dblp.org/pers/hd/h/Hajiesmaili:Mohammad_Hassan", "Ahmad Khonsari.....http://dblp.org/pers/hd/k/Khonsari:Ahmad"], "conf": "infocom", "year": "2015", "pages": 9}