{"title": "Understanding GPU errors on large-scale HPC systems and the implications for system design and operation.", "fields": ["open science", "titan", "graphics hardware", "supercomputer", "gpu cluster"], "abstract": "Increase in graphics hardware performance and improvements in programmability has enabled GPUs to evolve from a graphics-specific accelerator to a general-purpose computing device. Titan, the world's second fastest supercomputer for open science in 2014, consists of more dum 18,000 GPUs that scientists from various domains such as astrophysics, fusion, climate, and combustion use routinely to run large-scale simulations. Unfortunately, while the performance efficiency of GPUs is well understood, their resilience characteristics in a large-scale computing system have not been fully evaluated. We present a detailed study to provide a thorough understanding of GPU errors on a large-scale GPU-enabled system. Our data was collected from the Titan supercomputer at the Oak Ridge Leadership Computing Facility and a GPU cluster at the Los Alamos National Laboratory. We also present results from our extensive neutron-beam tests, conducted at Los Alamos Neutron Science Center (LANSCE) and at ISIS (Rutherford Appleron Laboratories, UK), to measure the resilience of different generations of GPUs. We present several findings from our field data and neutron-beam experiments, and discuss the implications of our results for future GPU architects, current and future HPC computing facilities, and researchers focusing on GPU resilience.", "citation": "Citations (59)", "departments": ["Oak Ridge National Laboratory", "Oak Ridge National Laboratory", "Oak Ridge National Laboratory", "Oak Ridge National Laboratory", "Universidade Federal do Rio Grande do Sul"], "authors": ["Devesh Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Devesh", "Saurabh Gupta.....http://dblp.org/pers/hd/g/Gupta:Saurabh", "James H. Rogers.....http://dblp.org/pers/hd/r/Rogers:James_H=", "Don Maxwell.....http://dblp.org/pers/hd/m/Maxwell:Don", "Paolo Rech.....http://dblp.org/pers/hd/r/Rech:Paolo", "Sudharshan S. Vazhkudai.....http://dblp.org/pers/hd/v/Vazhkudai:Sudharshan_S=", "Daniel A. G. de Oliveira.....http://dblp.org/pers/hd/o/Oliveira:Daniel_A=_G=_de", "Dave Londo.....http://dblp.org/pers/hd/l/Londo:Dave", "Nathan DeBardeleben.....http://dblp.org/pers/hd/d/DeBardeleben:Nathan", "Philippe Olivier Alexandre Navaux.....http://dblp.org/pers/hd/n/Navaux:Philippe_Olivier_Alexandre", "Luigi Carro.....http://dblp.org/pers/hd/c/Carro:Luigi", "Arthur S. Bland.....http://dblp.org/pers/hd/b/Bland:Arthur_S="], "conf": "hpca", "year": "2015", "pages": 12}