{"title": "Even Metadata is Getting Big: Annotation Summarization using InsightNotes.", "fields": ["operator", "metadata", "annotation", "extensibility", "automatic summarization"], "abstract": "In this paper, we demonstrate the InsightNotes system, a summary-based annotation management engine over relational databases. InsightNotes addresses the unique challenges that arise in modern applications (especially scientific applications) that rely on rich and large-scale repositories of curation and annotation information. In these applications, the number and size of the raw annotations may grow beyond what end-users and scientists can comprehend and analyze. InsightNotes overcomes these limitations by integrating mining and summarization techniques with the annotation management engine in novel ways. The objective is to create concise and meaningful representations of the raw annotations, called ''annotation summaries'', to be the basic unit of processing. The core functionalities of InsightNotes include: (1) Extensibility, where domain experts can define the summary types suitable for their application, (2) Incremental Maintenance, where the system efficiently maintains the annotation summaries under the continuous addition of new annotations, (3) Summary-Aware Query Processing and Propagation, where the execution engine and query operators are extended for manipulating and propagating the annotation summaries within the query pipeline under complex transformations, and (4) Zoom-in Query Processing, where end-users can interactively expand specific annotation summaries of interest and retrieve their detailed (raw) annotations. We will demonstrate the InsightNotes's features using a real-world annotated database from the ornithological domain (the science of studying birds). We will design an interactive demonstration that engage the audience in annotating the data, visualizing how annotations are summarized and propagated, and zooming-in when desired to retrieve more details.", "citation": "Citations (1)", "year": "2015", "departments": ["Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute"], "conf": "sigmod", "authors": ["Dongqing Xiao.....http://dblp.org/pers/hd/x/Xiao:Dongqing", "Armir Bashllari.....http://dblp.org/pers/hd/b/Bashllari:Armir", "Tyler Menard.....http://dblp.org/pers/hd/m/Menard:Tyler", "Mohamed Y. Eltabakh.....http://dblp.org/pers/hd/e/Eltabakh:Mohamed_Y="], "pages": 6}