{"title": "FlashGraph: Processing Billion-Node Graphs on an Array of Commodity SSDs.", "fields": ["iops", "multi core processor", "power graph analysis", "vertex", "latency"], "abstract": "Graph analysis performs many random reads and writes, thus, these workloads are typically performed in memory. Traditionally, analyzing large graphs requires a cluster of machines so the aggregate memory exceeds the graph size. We demonstrate that a multicore server can process graphs with billions of vertices and hundreds of billions of edges, utilizing commodity SSDs with minimal performance loss. We do so by implementing a graph-processing engine on top of a user-space SSD file system designed for high IOPS and extreme parallelism. Our semi-external memory graph engine called FlashGraph stores vertex state in memory and edge lists on SSDs. It hides latency by overlapping computation with I/O. To save I/O bandwidth, FlashGraph only accesses edge lists requested by applications from SSDs; to increase I/O throughput and reduce CPU overhead for I/O, it conservatively merges I/O requests. These designs maximize performance for applications with different I/O characteristics. FlashGraph exposes a general and flexible vertex-centric programming interface that can express a wide variety of graph algorithms and their optimizations. We demonstrate that FlashGraph in semi-external memory performs many algorithms with performance up to 80% of its in-memory implementation and significantly outperforms PowerGraph, a popular distributed in-memory graph engine.", "citation": "Citations (103)", "departments": ["Johns Hopkins University", "Johns Hopkins University", "Johns Hopkins University", "Johns Hopkins University", "Johns Hopkins University"], "authors": ["Da Zheng.....http://dblp.org/pers/hd/z/Zheng:Da", "Disa Mhembere.....http://dblp.org/pers/hd/m/Mhembere:Disa", "Randal C. Burns.....http://dblp.org/pers/hd/b/Burns:Randal_C=", "Joshua T. Vogelstein.....http://dblp.org/pers/hd/v/Vogelstein:Joshua_T=", "Carey E. Priebe.....http://dblp.org/pers/hd/p/Priebe:Carey_E=", "Alexander S. Szalay.....http://dblp.org/pers/hd/s/Szalay:Alexander_S="], "conf": "fast", "year": "2015", "pages": 14}