{"title": "Monitoring and Debugging the Quality of Results in Approximate Programs.", "fields": ["implementation", "approximate computing", "quality of results", "computation", "debugging"], "abstract": "Energy efficiency is a key concern in the design of modern computer systems. One promising approach to energy-efficient computation, approximate computing, trades off output accuracy for significant gains in energy efficiency. However, debugging the actual cause of output quality problems in approximate programs is challenging. This paper presents dynamic techniques to debug and monitor the quality of approximate computations. We propose both offline debugging tools that instrument code to determine the key sources of output degradation and online approaches that monitor the quality of deployed applications.   We present two offline debugging techniques and three online monitoring mechanisms. The first offline tool identifies correlations between output quality and the execution of individual approximate operations. The second tracks approximate operations that flow into a particular value. Our online monitoring mechanisms are complementary approaches designed for detecting quality problems in deployed applications, while still maintaining the energy savings from approximation.   We present implementations of our techniques and describe their usage with seven applications. Our online monitors control output quality while still maintaining significant energy efficiency gains, and our offline tools provide new insights into the effects of approximation on output quality.", "citation": "Citations (22)", "year": "2015", "departments": ["University of Washington", "University of Washington", "Cornell University", "University of Washington", "University of Washington"], "conf": "asplos", "authors": ["Michael F. Ringenburg.....http://dblp.org/pers/hd/r/Ringenburg:Michael_F=", "Adrian Sampson.....http://dblp.org/pers/hd/s/Sampson:Adrian", "Isaac Ackerman.....http://dblp.org/pers/hd/a/Ackerman:Isaac", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Dan Grossman.....http://dblp.org/pers/hd/g/Grossman:Dan"], "pages": 13}