{"title": "Elastic-Arm: Human-scale passive haptic feedback for augmenting interaction and perception in virtual environments.", "fields": ["immersion", "stereotaxy", "use case", "resistance force", "3d interaction"], "abstract": "Haptic feedback is known to improve 3D interaction in virtual environments but current haptic interfaces remain complex and tailored to desktop interaction. In this paper, we introduce the “Elastic-Arm”, a novel approach for incorporating haptic feedback in immersive virtual environments in a simple and cost-effective way. The Elastic-Arm is based on a body-mounted elastic armature that links the user's hand to her shoulder. As a result, a progressive resistance force is perceived when extending the arm. This haptic feedback can be incorporated with various 3D interaction techniques and we illustrate the possibilities offered by our system through several use cases based on well-known examples such as the Bubble technique, Redirected Touching and pseudo-haptics. These illustrative use cases provide users with haptic feedback during selection and navigation tasks but they also enhance their perception of the virtual environment. Taken together, these examples suggest that the Elastic-Arm can be transposed in numerous applications and with various 3D interaction metaphors in which a mobile hap-tic feedback can be beneficial. It could also pave the way for the design of new interaction techniques based on “human-scale” egocentric haptic feedback.", "citation": "Citations (12)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Merwan Achibet.....http://dblp.org/pers/hd/a/Achibet:Merwan", "Adrien Girard.....http://dblp.org/pers/hd/g/Girard:Adrien", "Anthony Talvas.....http://dblp.org/pers/hd/t/Talvas:Anthony", "Maud Marchal.....http://dblp.org/pers/hd/m/Marchal:Maud", "Anatole Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Anatole"], "conf": "vr", "year": "2015", "pages": 6}