{"title": "Intelligible Models for HealthCare: Predicting Pneumonia Risk and Hospital 30-day Readmission.", "fields": ["random forest", "intelligibility", "pairwise comparison", "additive model", "generalized additive model"], "abstract": "In machine learning often a tradeoff must be made between accuracy and intelligibility. More accurate models such as boosted trees, random forests, and neural nets usually are not intelligible, but more intelligible models such as logistic regression, naive-Bayes, and single decision trees often have significantly worse accuracy. This tradeoff sometimes limits the accuracy of models that can be applied in mission-critical applications such as healthcare where being able to understand, validate, edit, and trust a learned model is important. We present two case studies where high-performance generalized additive models with pairwise interactions (GA2Ms) are applied to real healthcare problems yielding intelligible models with state-of-the-art accuracy. In the pneumonia risk prediction case study, the intelligible model uncovers surprising patterns in the data that previously had prevented complex learned models from being fielded in this domain, but because it is intelligible and modular allows these patterns to be recognized and removed. In the 30-day hospital readmission case study, we show that the same methods scale to large datasets containing hundreds of thousands of patients and thousands of attributes while remaining intelligible and providing accuracy comparable to the best (unintelligible) machine learning methods.", "citation": "Citations (189)", "departments": ["Microsoft", "LinkedIn", "Microsoft", "Microsoft", "NewYork–Presbyterian Hospital"], "authors": ["Rich Caruana.....http://dblp.org/pers/hd/c/Caruana:Rich", "Yin Lou.....http://dblp.org/pers/hd/l/Lou:Yin", "Johannes Gehrke.....http://dblp.org/pers/hd/g/Gehrke:Johannes", "Paul Koch.....http://dblp.org/pers/hd/k/Koch:Paul", "Marc Sturm.....http://dblp.org/pers/hd/s/Sturm:Marc", "Noemie Elhadad.....http://dblp.org/pers/hd/e/Elhadad:Noemie"], "conf": "kdd", "year": "2015", "pages": 10}