{"title": "Improving concurrency and asynchrony in multithreaded MPI applications using software offloading.", "fields": ["mutual exclusion", "general purpose computing on graphics processing units", "concurrency", "thread", "instruction set"], "abstract": "We present a new approach for multithreaded communication and asynchronous progress in MPI applications, wherein we offload communication processing to a dedicated thread. The central premise is that given the rapidly increasing core counts on modern systems, the improvements in MPI performance arising from dedicating a thread to drive communication outweigh the small loss of resources for application computation, particularly when overlap of communication and computation can be exploited. Our approach allows application threads to make MPI calls concurrently, enqueuing these as communication tasks to be processed by a dedicated communication thread. This not only guarantees progress for such communication operations, but also reduces load imbalance. Our implementation additionally significantly reduces the overhead of mutual exclusion seen in existing implementations for applications using MPI_THREAD_MULTIPLE. Our technique requires no modification to the application, and we demonstrate significant performance improvement (up to 2X) for QCD, 1-D FFT and deep learning CNN applications.", "citation": "Citations (8)", "year": "2015", "departments": ["Intel", "Intel", "Intel", "Intel", "Argonne National Laboratory"], "conf": "sc", "authors": ["Karthikeyan Vaidyanathan.....http://dblp.org/pers/hd/v/Vaidyanathan:Karthikeyan", "Dhiraj D. Kalamkar.....http://dblp.org/pers/hd/k/Kalamkar:Dhiraj_D=", "Kiran Pamnany.....http://dblp.org/pers/hd/p/Pamnany:Kiran", "Jeff R. Hammond.....http://dblp.org/pers/hd/h/Hammond:Jeff_R=", "Pavan Balaji.....http://dblp.org/pers/hd/b/Balaji:Pavan", "Dipankar Das.....http://dblp.org/pers/hd/d/Das_0002:Dipankar", "Jongsoo Park.....http://dblp.org/pers/hd/p/Park:Jongsoo", "Bálint Joó.....http://dblp.org/pers/hd/j/Jo=oacute=:B=aacute=lint"], "pages": 12}