{"title": "Convergence properties of general network selection games.", "fields": ["network management station", "network formation", "access network", "network architecture", "network simulation"], "abstract": "We study the convergence properties of distributed network selection in HetNets with priority-based service. Clients in such networks have different priority weights (e.g., QoS requirements, scheduling policies, etc.) for different access networks and act selfishly to maximize their own throughput. We formulate the problem as a non-cooperative game, and study its convergence for two models: (i) A purely client-centric model where each client uses its own preference to select a network, and (ii) a hybrid client-network model that uses a combination of client and network preferences to arrive at pairings. Our results reveal that: (a) Pure client-centric network selection with generic weights can result in infinite oscillations for any improvement path (i.e., shows strongly cyclic behavior). However, we show that under several classes of practical priority weights (e.g., weights that achieve different notions of fairness) or under additional client-side policies, convergence can be guaranteed; (b) We study convergence time under client-centric model and provide tight polynomial and linear bounds; (c) We show that applying a minimal amount of network control in the hybrid model, guarantees convergence for clients with generic weights. We also introduce a controllable knob that network controller can employ to balance between convergence time and its network-wide objective with predictable tradeoff.", "citation": "Citations (8)", "year": "2015", "departments": ["Illinois Institute of Technology", "Shiraz University", "Intel", "Illinois Institute of Technology", "Princeton University"], "conf": "infocom", "authors": ["Ehsan Monsef.....http://dblp.org/pers/hd/m/Monsef:Ehsan", "Alireza Keshavarz-Haddad.....http://dblp.org/pers/hd/k/Keshavarz=Haddad:Alireza", "Ehsan Aryafar.....http://dblp.org/pers/hd/a/Aryafar:Ehsan", "Jafar Saniie.....http://dblp.org/pers/hd/s/Saniie:Jafar", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung"], "pages": 9}