{"title": "Efficiency and Complexity of Price Competition Among Single-Product Vendors.", "fields": ["subsidy", "vendor", "competitor analysis", "mid price", "reservation price", "price of anarchy", "factor price", "price of stability"], "abstract": "Abstract   Motivated by recent progress on pricing in the AI literature, we study marketplaces that contain multiple vendors offering identical or similar products and unit-demand buyers with different valuations on these vendors. The objective of each vendor is to set the price of its product to a fixed value so that its profit is maximized. The profit depends on the vendor's price itself and the total volume of buyers that find the particular price more attractive than the price of the vendor's competitors. We model the behavior of buyers and vendors as a two-stage full-information game and study a series of questions related to the existence, efficiency (price of anarchy) and computational complexity of equilibria in this game. To overcome situations where equilibria do not exist or exist but are highly inefficient, we consider the scenario where some of the vendors are subsidized in order to keep prices low and buyers highly satisfied.", "citation": "Not cited", "departments": ["University of Patras", "University of Patras", "University of Patras", "University of Patras", "University of Patras", "University of Patras", "University of Patras", "University of Patras", "University of Patras", "University of Patras"], "authors": ["Ioannis Caragiannis.....http://dblp.org/pers/hd/c/Caragiannis:Ioannis", "Xenophon Chatzigeorgiou.....http://dblp.org/pers/hd/c/Chatzigeorgiou:Xenophon", "Panagiotis Kanellopoulos.....http://dblp.org/pers/hd/k/Kanellopoulos:Panagiotis", "George A. Krimpas.....http://dblp.org/pers/hd/k/Krimpas:George_A=", "Nikos Protopapas.....http://dblp.org/pers/hd/p/Protopapas:Nikos", "Alexandros A. Voudouris.....http://dblp.org/pers/hd/v/Voudouris:Alexandros_A="], "conf": "ijcai", "year": "2015", "pages": 7}