{"title": "BFAST: Unified and scalable index for NDN forwarding architecture.", "fields": ["pipeline", "distributed computing", "forwarding information base", "bloom filter", "scalability", "longest prefix match", "hash table", "computer science", "architecture"], "abstract": "Named Data Networking (NDN) as an instantiation of the Content-Centric Networking (CCN) approach, embraces the major shift of the network function — from host-to-host conversation to content dissemination. The NDN forwarding architecture consists of three tables — Content Store (CS), Pending Interest Table (PIT) and Forwarding Information Base (FIB), as well as two lookup rules — Longest Prefix Match (LPM) and Exact Match (EM). A software-based implementation for this forwarding architecture would be low-cost, flexible and have rich memory resource, but may also make the pipelining technique not readily applicable to table lookups. Therefore, forwarding a packet would go through multiple tables sequentially without pipelining, leading to high latency and low throughput. In order to take advantage of the software-based implementation and overcome its shortcoming, we find that, a single unified index that supports all the three tables and both LPM and EM lookup rules would benefit the forwarding performance. In this paper, we present such an index data structure called BFAST (Bloom Filter-Aided haSh Table). BFAST employs a Counting Bloom Filter to balance the load among hash table buckets, making the number of prefixes in each non-empty bucket close to 1, and thus enabling high lookup throughput and low latency. Evaluation results show that, for solely LMP lookup, BFAST can arrive at 36.41 million lookups per second (M/s) using 24 threads, and the latency is around 0.46 μs. When utilized to build the NDN forwarding architecture, BFAST obtains remarkable performance promotion under various request composition, e.g., BFAST achieves a lookup speed of 81.32 M/s with a synthetic request trace where 30% of the requests hit CS, another 30% hit PIT and the rest 40% hit FIB, while the lookup latency is only 0.29 μs.", "citation": "Not cited", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Huichen Dai.....http://dblp.org/pers/hd/d/Dai:Huichen", "Jianyuan Lu.....http://dblp.org/pers/hd/l/Lu:Jianyuan", "Yi Wang.....http://dblp.org/pers/hd/w/Wang_0004:Yi", "Bin Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bin"], "conf": "infocom", "year": "2015", "pages": 9}