{"title": "Microblog Entity Linking with Social Temporal Context.", "fields": ["search engine indexing", "rendering", "popularity", "microblogging", "entity linking"], "abstract": "Nowadays microblogging sites, such as Twitter and Chinese Sina Weibo, have established themselves as an invaluable information source, which provides a huge collection of manually-generated tweets with broad range of topics from daily life to breaking news. Entity linking is indispensable for understanding and maintaining such information, which in turn facilitates many real-world applications such as tweet clustering and classification, personalized microblog search, and so forth. However, tweets are short, informal and error-prone, rendering traditional approaches for entity linking in documents largely inapplicable. Recent work addresses this problem by utilising information from other tweets and linking entities in a batch manner. Nevertheless, the high computational complexity makes this approach infeasible for real-time applications given the high arrival rate of tweets. In this paper, we propose an efficient solution to link entities in tweets by analyzing their social and temporal context. Our proposed framework takes into consideration three features, namely entity popularity, entity recency, and user interest information embedded in social interactions to assist the entity linking task. Effective indexing structures along with incremental algorithms have also been developed to reduce the computation and maintenance costs of our approach. Experimental results based on real tweet datasets verify the effectiveness and efficiency of our proposals.", "citation": "Citations (6)", "year": "2015", "departments": ["University of Queensland", "University of Queensland", "University of Queensland"], "conf": "sigmod", "authors": ["Wen Hua.....http://dblp.org/pers/hd/h/Hua:Wen", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "pages": 15}