{"title": "Peak-minimizing online EV charging: Price-of-uncertainty and algorithm robustification.", "fields": ["heuristic", "online algorithm", "news aggregator", "competitive analysis", "robustification"], "abstract": "We study competitive online algorithms for EV (electrical vehicle) charging under the scenario of an aggregator serving a large number of EVs together with its background load, using both its own renewable energy (for free) and the energy procured from the external grid. The goal of the aggregator is to minimize its peak procurement from the grid, subject to the constraint that each EV has to be fully charged before its deadline. Further, the aggregator can predict the future demand and the renewable energy supply with some levels of uncertainty. The key challenge here is how to develop a model that captures the prior knowledge from such prediction, and how to best utilize this prior knowledge to reduce the peak under future uncertainty. In this paper, we first propose a 2-level increasing precision model (2-IPM), to capture the system uncertainty. We develop a powerful computation approach that can compute the optimal competitive ratio under 2-IPM over any online algorithm, and also online algorithms that can achieve the optimal competitive ratio. A dilemma for online algorithm design is that an online algorithm with good competitive ratio may exhibit poor average-case performance. We then propose a new Algorithm-Robustification procedure that can convert an online algorithm with reasonable average-case performance to one with both the optimal competitive ratio and good average-case performance. The robustified version of a well-known heuristic algorithm, Receding Horizon Control (RHC), is found to demonstrate superior performance via trace-based simulations.", "citation": "Citations (6)", "departments": ["Purdue University", "Purdue University", "The Chinese University of Hong Kong"], "authors": ["Shizhen Zhao.....http://dblp.org/pers/hd/z/Zhao:Shizhen", "Xiaojun Lin.....http://dblp.org/pers/hd/l/Lin:Xiaojun", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua"], "conf": "infocom", "year": "2015", "pages": 9}