{"title": "In-memory BLU acceleration in IBM's DB2 and dashDB: Optimized for modern workloads and hardware architectures.", "fields": ["interleaved memory", "shadow", "cache", "thread", "online transaction processing"], "abstract": "Although the DRAM for main memories of systems continues to grow exponentially according to Moore's Law and to become less expensive, we argue that memory hierarchies will always exist for many reasons, both economic and practical, and in particular due to concurrent users competing for working memory to perform joins and grouping. We present the in-memory BLU Acceleration used in IBM's DB2 for Linux, UNIX, and Windows, and now also the dashDB cloud offering, which was designed and implemented from the ground up to exploit main memory but is not limited to what fits in memory and does not require manual management of what to retain in memory, as its competitors do. In fact, BLU Acceleration views memory as too slow, and is carefully engineered to work in higher levels of the system cache by keeping the data encoded and packed densely into bit-aligned vectors that can exploit SIMD instructions in processing queries. To achieve scalable multi-core parallelism, BLU assigns to each thread independent data structures, or partitions thereof, designed to have low synchronization costs, and doles out batches of values to threads. On customer workloads, BLU has improved performance on complex analytics queries by 10 to 50 times, compared to the legacy row-organized run-time, while also significantly simplifying database administration, shortening time to value, and improving data compression. UPDATE and DELETE performance was improved by up to 112 times with the new Cancun release of DB2 with BLU Acceleration, which also added Shadow Tables for high performance on mixed OLTP and BI analytics workloads, and extended DB2's High Availability Disaster Recovery (HADR) and SQL compatibility features to BLU's column-organized tables.", "citation": "Citations (9)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Ronald Barber.....http://dblp.org/pers/hd/b/Barber:Ronald", "Guy M. Lohman.....http://dblp.org/pers/hd/l/Lohman:Guy_M=", "Vijayshankar Raman.....http://dblp.org/pers/hd/r/Raman:Vijayshankar", "Richard Sidle.....http://dblp.org/pers/hd/s/Sidle:Richard", "Sam Lightstone.....http://dblp.org/pers/hd/l/Lightstone:Sam", "Berni Schiefer.....http://dblp.org/pers/hd/s/Schiefer:Berni"], "conf": "icde", "year": "2015", "pages": 7}