{"title": "BigDansing: A System for Big Data Cleansing.", "fields": ["data cleansing", "operator", "ranging", "joins", "tuple"], "abstract": "Data cleansing approaches have usually focused on detecting and fixing errors with little attention to scaling to big datasets. This presents a serious impediment since data cleansing often involves costly computations such as enumerating pairs of tuples, handling inequality joins, and dealing with user-defined functions. In this paper, we present BigDansing, a Big Data Cleansing system to tackle efficiency, scalability, and ease-of-use issues in data cleansing. The system can run on top of most common general purpose data processing platforms, ranging from DBMSs to MapReduce-like frameworks. A user-friendly programming interface allows users to express data quality rules both declaratively and procedurally, with no requirement of being aware of the underlying distributed platform. BigDansing takes these rules into a series of transformations that enable distributed computations and several optimizations, such as shared scans and specialized joins operators. Experimental results on both synthetic and real datasets show that BigDansing outperforms existing baseline systems up to more than two orders of magnitude without sacrificing the quality provided by the repair algorithms.", "citation": "Citations (75)", "year": "2015", "departments": ["King Abdullah University of Science and Technology", "University of Waterloo", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Qatar Computing Research Institute"], "conf": "sigmod", "authors": ["Zuhair Khayyat.....http://dblp.org/pers/hd/k/Khayyat:Zuhair", "Ihab F. Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Ihab_F=", "Alekh Jindal.....http://dblp.org/pers/hd/j/Jindal:Alekh", "Samuel Madden.....http://dblp.org/pers/hd/m/Madden:Samuel", "Mourad Ouzzani.....http://dblp.org/pers/hd/o/Ouzzani:Mourad", "Paolo Papotti.....http://dblp.org/pers/hd/p/Papotti:Paolo", "Jorge-Arnulfo Quiané-Ruiz.....http://dblp.org/pers/hd/q/Quian=eacute==Ruiz:Jorge=Arnulfo", "Nan Tang.....http://dblp.org/pers/hd/t/Tang_0001:Nan", "Si Yin.....http://dblp.org/pers/hd/y/Yin:Si"], "pages": 16}