{"title": "Online Video Recommendation in Sharing Community.", "fields": ["clips", "exploit", "broadcasting", "hash function", "information retrieval"], "abstract": "The creation of sharing communities has resulted in the astonishing increasing of digital videos, and their wide applications in the domains such as entertainment, online news broadcasting etc. The improvement of these applications relies on effective solutions for social user access to video data. This fact has driven the recent research interest in social recommendation in shared communities. Although certain effort has been put into video recommendation in shared communities, the contextual information on social users has not been well exploited for effective recommendation. In this paper, we propose an approach based on the content and social information of videos for the recommendation in sharing communities. Specifically, we first exploit a robust video cuboid signature together with the Earth Mover's Distance to capture the content relevance of videos. Then, we propose to identify the social relevance of clips using the set of users belonging to a video. We fuse the content relevance and social relevance to identify the relevant videos for recommendation. Following that, we propose a novel scheme called sub-community-based approximation together with a hash-based optimization for improving the efficiency of our solution. Finally, we propose an algorithm for efficiently maintaining the social updates in dynamic shared communities. The extensive experiments are conducted to prove the high effectiveness and efficiency of our proposed video recommendation approach.", "citation": "Citations (9)", "year": "2015", "departments": ["RMIT University", "Hong Kong University of Science and Technology", "Victoria University, Australia", "University of Technology, Sydney", "Deakin University"], "conf": "sigmod", "authors": ["Xiangmin Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiangmin", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Yanchun Zhang.....http://dblp.org/pers/hd/z/Zhang:Yanchun", "Longbing Cao.....http://dblp.org/pers/hd/c/Cao:Longbing", "Guangyan Huang.....http://dblp.org/pers/hd/h/Huang:Guangyan", "Chen Wang.....http://dblp.org/pers/hd/w/Wang:Chen"], "pages": 12}