{"title": "An extreme-scale implicit solver for complex PDEs: highly heterogeneous flow in earth's mantle.", "fields": ["discretization", "multigrid method", "dissipative particle dynamics", "mantle convection", "solver"], "abstract": "Mantle convection is the fundamental physical process within earth's interior responsible for the thermal and geological evolution of the planet, including plate tectonics. The mantle is modeled as a viscous, incompressible, non-Newtonian fluid. The wide range of spatial scales, extreme variability and anisotropy in material properties, and severely nonlinear rheology have made global mantle convection modeling with realistic parameters prohibitive. Here we present a new implicit solver that exhibits optimal algorithmic performance and is capable of extreme scaling for hard PDE problems, such as mantle convection. To maximize accuracy and minimize runtime, the solver incorporates a number of advances, including aggressive multi-octree adaptivity, mixed continuous-discontinuous discretization, arbitrarily-high-order accuracy, hybrid spectral/geometric/algebraic multigrid, and novel Schur-complement preconditioning. These features present enormous challenges for extreme scalability. We demonstrate that---contrary to conventional wisdom---algorithmically optimal implicit solvers can be designed that scale out to 1.5 million cores for severely nonlinear, ill-conditioned, heterogeneous, and anisotropic PDEs.", "citation": "Citations (33)", "year": "2015", "departments": ["University of Texas at Austin", "IBM", "University of Texas at Austin", "New York University", "California Institute of Technology"], "conf": "sc", "authors": ["Johann Rudi.....http://dblp.org/pers/hd/r/Rudi:Johann", "A. Cristiano I. Malossi.....http://dblp.org/pers/hd/m/Malossi:A=_Cristiano_I=", "Tobin Isaac.....http://dblp.org/pers/hd/i/Isaac:Tobin", "Georg Stadler.....http://dblp.org/pers/hd/s/Stadler:Georg", "Michael Gurnis.....http://dblp.org/pers/hd/g/Gurnis:Michael", "Peter W. J. Staar.....http://dblp.org/pers/hd/s/Staar:Peter_W=_J=", "Yves Ineichen.....http://dblp.org/pers/hd/i/Ineichen:Yves", "Costas Bekas.....http://dblp.org/pers/hd/b/Bekas:Costas", "Alessandro Curioni.....http://dblp.org/pers/hd/c/Curioni:Alessandro", "Omar Ghattas.....http://dblp.org/pers/hd/g/Ghattas:Omar"], "pages": 12}