{"title": "Learning Large-Scale Dynamic Discrete Choice Models of Spatio-Temporal Preferences with Application to Migratory Pastoralism in East Africa.", "fields": ["discrete choice", "pastoralism", "probabilistic logic", "reinforcement learning", "arid"], "abstract": "Understanding spatio-temporal resource preferences is paramount in the design of policies for sustainable development. Unfortunately, resource preferences are often unknown to policy-makers and have to be inferred from data. In this paper we consider the problem of inferring agents' preferences from observed movement trajectories, and formulate it as an Inverse Reinforcement Learning (IRL) problem. With the goal of informing policy-making, we take a probabilistic approach and consider generative models that can be used to simulate behavior under new circumstances such as changes in resource availability, access policies, or climate. We study the Dynamic Discrete Choice (DDC) models from econometrics and prove that they generalize the Max-Entropy IRL model, a widely used probabilistic approach from the machine learning literature. Furthermore, we develop SPL-GD, a new learning algorithm for DDC models that is considerably faster than the state of the art and scales to very large datasets.\n\nWe consider an application in the context of pastoralism in the arid and semi-arid regions of Africa, where migratory pastoralists face regular risks due to resource availability, droughts, and resource degradation from climate change and development. We show how our approach based on satellite and survey data can accurately model migratory pastoralism in East Africa and that it considerably outperforms other approaches on a large-scale real-world dataset of pastoralists' movements in Ethiopia collected over 3 years.", "citation": "Citations (7)", "departments": ["Stanford University", "Cornell University", "University of Sydney", "Georgia Institute of Technology", "Cornell University"], "authors": ["Stefano Ermon.....http://dblp.org/pers/hd/e/Ermon:Stefano", "Yexiang Xue.....http://dblp.org/pers/hd/x/Xue:Yexiang", "Russell Toth.....http://dblp.org/pers/hd/t/Toth:Russell", "Bistra N. Dilkina.....http://dblp.org/pers/hd/d/Dilkina:Bistra_N=", "Richard Bernstein.....http://dblp.org/pers/hd/b/Bernstein:Richard", "Theodoros Damoulas.....http://dblp.org/pers/hd/d/Damoulas:Theodoros", "Patrick E. Clark.....http://dblp.org/pers/hd/c/Clark:Patrick_E=", "Steve DeGloria.....http://dblp.org/pers/hd/d/DeGloria:Steve", "Andrew Mude.....http://dblp.org/pers/hd/m/Mude:Andrew", "Christopher Barrett.....http://dblp.org/pers/hd/b/Barrett:Christopher", "Carla P. Gomes.....http://dblp.org/pers/hd/g/Gomes:Carla_P="], "conf": "aaai", "year": "2015", "pages": 7}