{"title": "Reinforcement Learning from Demonstration through Shaping.", "fields": ["robot learning", "error driven learning", "speedup", "leverage", "active learning"], "abstract": "Reinforcement learning describes how a learning agent can achieve optimal behaviour based on interactions with its environment and reward feedback. A limiting factor in reinforcement learning as employed in artificial intelligence is the need for an often prohibitively large number of environment samples before the agent reaches a desirable level of performance. Learning from demonstration is an approach that provides the agent with demonstrations by a supposed expert, from which it should derive suitable behaviour. Yet, one of the challenges of learning from demonstration is that no guarantees can be provided for the quality of the demonstrations, and thus the learned behavior. In this paper, we investigate the intersection of these two approaches, leveraging the theoretical guarantees provided by reinforcement learning, and using expert demonstrations to speed up this learning by biasing exploration through a process called reward shaping. This approach allows us to leverage human input without making an erroneous assumption regarding demonstration optimality. We show experimentally that this approach requires significantly fewer demonstrations, is more robust against suboptimality of demonstrations, and achieves much faster learning than the recently developed HAT algorithm.", "citation": "Citations (24)", "departments": ["Vrije Universiteit Brussel", "Vrije Universiteit Brussel", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Washington State University"], "authors": ["Tim Brys.....http://dblp.org/pers/hd/b/Brys:Tim", "Anna Harutyunyan.....http://dblp.org/pers/hd/h/Harutyunyan:Anna", "Halit Bener Suay.....http://dblp.org/pers/hd/s/Suay:Halit_Bener", "Sonia Chernova.....http://dblp.org/pers/hd/c/Chernova:Sonia", "Matthew E. Taylor.....http://dblp.org/pers/hd/t/Taylor:Matthew_E=", "Ann Nowé.....http://dblp.org/pers/hd/n/Now=eacute=:Ann"], "conf": "ijcai", "year": "2015", "pages": 7}