{"title": "PGX.D: a fast distributed graph processing engine.", "fields": ["wait for graph", "chunking", "power graph analysis", "graph database", "graph partition"], "abstract": "Graph analysis is a powerful method in data analysis. Although several frameworks have been proposed for processing large graph instances in distributed environments, their performance is much lower than using efficient single-machine implementations provided with enough memory. In this paper, we present a fast distributed graph processing system, namely PGX.D. We show that PGX.D outperforms other distributed graph systems like GraphLab significantly (3x -- 90x). Furthermore, PGX.D on 4 to 16 machines is also faster than an implementation optimized for single-machine execution. Using a fast cooperative context-switching mechanism, we implement PGX.D as a low-overhead, bandwidth-efficient communication framework that supports remote data-pulling patterns. Moreover, PGX.D achieves large traffic reduction and good workload balance by applying selective ghost nodes, edge partitioning, and edge chunking transparently to the user. Our analysis confirms that each of these features is indeed crucial for overall performance of certain kinds of graph algorithms. Finally, we advocate the use of balanced beefy clusters where the sustained random DRAM-access bandwidth in aggregate is matched with the bandwidth of the underlying interconnection fabric.", "citation": "Citations (27)", "year": "2015", "departments": ["Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Google", "University of Amsterdam"], "conf": "sc", "authors": ["Sungpack Hong.....http://dblp.org/pers/hd/h/Hong:Sungpack", "Siegfried Depner.....http://dblp.org/pers/hd/d/Depner:Siegfried", "Thomas Manhardt.....http://dblp.org/pers/hd/m/Manhardt:Thomas", "Jan Van Der Lugt.....http://dblp.org/pers/hd/l/Lugt:Jan_Van_Der", "Merijn Verstraaten.....http://dblp.org/pers/hd/v/Verstraaten:Merijn", "Hassan Chafi.....http://dblp.org/pers/hd/c/Chafi:Hassan"], "pages": 12}