{"title": "RFID cardinality estimation with blocker tags.", "fields": ["computer network", "distributed computing", "cardinality", "inference", "aloha"], "abstract": "The widely used RFID tags impose serious privacy concerns as a tag responds to queries from readers no matter they are authorized or not. The common solution is to use a commercially available blocker tag which behaves as if a set of tags with known blocking IDs are present. The use of blocker tags makes RFID estimation much more challenging as some genuine tag IDs are covered by the blocker tag and some are not. In this paper, we propose REB, the first RFID estimation scheme with the presence of blocker tags. REB uses the framed slotted Aloha protocol specified in the C1G2 standard. For each round of the Aloha protocol, REB first executes the protocol on the genuine tags and the blocker tag, and then virtually executes the protocol on the known blocking IDs using the same Aloha protocol parameters. The basic idea of REB is to conduct statistically inference from the two sets of responses and estimate the number of genuine tags. We conduct extensive simulations to evaluate the performance of REB, in terms of time-efficiency and estimation reliability. The experimental results reveal that our REB scheme runs tens of times faster than the fastest identification protocol with the same accuracy requirement.", "citation": "Citations (14)", "departments": ["Dalian University of Technology", "Hong Kong Polytechnic University", "Dalian University of Technology", "Temple University", "Michigan State University"], "authors": ["Xiulong Liu.....http://dblp.org/pers/hd/l/Liu:Xiulong", "Bin Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Bin", "Keqiu Li.....http://dblp.org/pers/hd/l/Li:Keqiu", "Jie Wu.....http://dblp.org/pers/hd/w/Wu:Jie", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Heng Qi.....http://dblp.org/pers/hd/q/Qi:Heng", "Xin Xie.....http://dblp.org/pers/hd/x/Xie:Xin"], "conf": "infocom", "year": "2015", "pages": 9}