{"title": "Pattern-Based Variant-Best-Neighbors Respiratory Motion Prediction Using Orthogonal Polynomials Approximation.", "fields": ["mathematical optimization", "radiation", "artificial intelligence", "orthogonal polynomials", "machine learning"], "abstract": "Motion-adaptive radiotherapy techniques are promising to deliver truly ablative radiation doses to tumors with minimal normal tissue exposure by accounting for realtime tumor movement. However, a major challenge of successful applications of these techniques is the realtime prediction of breathing-induced tumor motion to accommodate system delivery latencies. Predicting respiratory motion in real-time is challenging. The current respiratory motion prediction approaches are still not satisfactory in terms of accuracy and interpretabil-ity due to the complexity of breathing patterns and the high inter-individual variability across patients. In this paper, we propose a novel respiratory motion prediction framework which integrates four key components: a personalized monitoring window generator, an orthogonal polynomial approximation-based pattern library builder, a variant best neighbor pattern searcher, and a statistical prediction decision maker. The four functional components work together into a real-time prediction system and is capable of performing personalized tumor position prediction during radiotherapy. Based on a study of respiratory motion of 27 patients with lung cancer, the proposed prediction approach generated consistently better prediction performances than the current respiratory motion prediction approaches, particularly for long prediction horizons.", "citation": "Not cited", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Washington", "University of Washington"], "authors": ["KinMing Kam.....http://dblp.org/pers/hd/k/Kam:KinMing", "Shouyi Wang.....http://dblp.org/pers/hd/w/Wang:Shouyi", "Stephen R. Bowen.....http://dblp.org/pers/hd/b/Bowen:Stephen_R=", "Wanpracha Art Chaovalitwongse.....http://dblp.org/pers/hd/c/Chaovalitwongse:Wanpracha_Art"], "conf": "aaai", "year": "2015", "pages": 7}