{"title": "A Sparse Combined Regression-Classification Formulation for Learning a Physiological Alternative to Clinical Post-Traumatic Stress Disorder Scores.", "fields": ["binary decision diagram", "generalizability theory", "skin conductance", "traumatic stress", "experimental data"], "abstract": "Current diagnostic methods for mental pathologies, including Post-Traumatic Stress Disorder (PTSD), involve a cliniciancoded interview, which can be subjective. Heart rate and skin conductance, as well as other peripheral physiology measures, have previously shown utility in predicting binary diagnostic decisions. The binary decision problem is easier, but misses important information on the severity of the patients condition. This work utilizes a novel experimental set-up that exploits virtual reality videos and peripheral physiology for PTSD diagnosis. In pursuit of an automated physiology-based objective diagnostic method, we propose a learning formulation that integrates the description of the experimental data and expert knowledge on desirable properties of a physiological diagnostic score. From a list of desired criteria, we derive a new cost function that combines regression and classification while learning the salient features for predicting physiological score. The physiological score produced by Sparse Combined Regression-Classification (SCRC) is assessed with respect to three sets of criteria chosen to reflect design goals for an objective, physiological PTSD score: parsimony and context of selected features, diagnostic score validity, and learning generalizability. For these criteria, we demonstrate that Sparse Combined Regression-Classification performs better than more generic learning approaches.", "citation": "Citations (2)", "departments": ["Charles Stark Draper Laboratory", "Charles Stark Draper Laboratory", "Charles Stark Draper Laboratory", "Northeastern University"], "authors": ["Sarah Marie Brown.....http://dblp.org/pers/hd/b/Brown:Sarah_Marie", "Andrea Webb.....http://dblp.org/pers/hd/w/Webb:Andrea", "Rami Mangoubi.....http://dblp.org/pers/hd/m/Mangoubi:Rami", "Jennifer G. Dy.....http://dblp.org/pers/hd/d/Dy:Jennifer_G="], "conf": "aaai", "year": "2015", "pages": 7}