{"title": "Application-specific configuration selection in the cloud: Impact of provider policy and potential of systematic testing.", "fields": ["scheduling", "cloud computing", "overhead", "virtualization", "cloud testing"], "abstract": "Provider policy (e.g., bandwidth rate limits, virtualization, CPU scheduling) can significantly impact application performance in cloud environments. This paper takes a first step towards understanding the impact of provider policy and tackling the complexity of selecting configurations that can best meet the cost and performance requirements of applications. We make three contributions. First, we conduct a measurement study spanning a 19 months period of a wide variety of applications on Amazon EC2 to understand issues involved in configuration selection. Our results show that provider policy can impact communication and computation performance in unpredictable ways. Moreover, seemingly sensible rules of thumb are inappropriate — e.g., VMs with latest hardware or larger VM sizes do not always provide the best performance. Second, we systematically characterize the overheads and resulting benefits of a range of testing strategies for configuration selection. A key focus of our characterization is understanding the overheads of a testing approach in the face of variability in performance across deployments and measurements. Finally, we present configuration pruning and short-listing techniques for minimizing testing overheads. Evaluations on a variety of compute, bandwidth and data intensive applications validate the effectiveness of these techniques in selecting good configurations with low overheads.", "citation": "Citations (8)", "departments": ["Purdue University", "Rice University", "Purdue University", "Rice University", "Purdue University"], "authors": ["Mohammad Y. Hajjat.....http://dblp.org/pers/hd/h/Hajjat:Mohammad_Y=", "Ruiqi Liu.....http://dblp.org/pers/hd/l/Liu:Ruiqi", "Yiyang Chang.....http://dblp.org/pers/hd/c/Chang:Yiyang", "T. S. Eugene Ng.....http://dblp.org/pers/hd/n/Ng:T=_S=_Eugene", "Sanjay G. Rao.....http://dblp.org/pers/hd/r/Rao:Sanjay_G="], "conf": "infocom", "year": "2015", "pages": 9}