{"title": "Apache Tez: A Unifying Framework for Modeling and Building Data Processing Applications.", "fields": ["implementation", "scratch", "scaffold", "forwarding plane", "big data"], "abstract": "The broad success of Hadoop has led to a fast-evolving and diverse ecosystem of application engines that are building upon the YARN resource management layer. The open-source implementation of MapReduce is being slowly replaced by a collection of engines dedicated to specific verticals. This has led to growing fragmentation and repeated efforts with each new vertical engine re-implementing fundamental features (e.g. fault-tolerance, security, stragglers mitigation, etc.) from scratch.   In this paper, we introduce Apache Tez, an  open-source framework designed to build data-flow driven processing runtimes . Tez provides a scaffolding and library components that can be used to quickly build scalable and efficient data-flow centric engines. Central to our design is fostering  component re-use, without hindering customizability  of the performance-critical data plane. This is in fact the key differentiator with respect to the previous generation of systems (e.g. Dryad, MapReduce) and even emerging ones (e.g. Spark), that provided and mandated a fixed data plane implementation. Furthermore, Tez provides native support to build runtime optimizations, such as dynamic partition pruning for Hive.   Tez is deployed at Yahoo!, Microsoft Azure, LinkedIn and numerous Hortonworks customer sites, and a growing number of engines are being integrated with it. This confirms our intuition that most of the popular vertical engines can leverage a core set of building blocks. We complement qualitative accounts of real-world adoption with quantitative experimental evidence that Tez-based implementations of Hive, Pig, Spark, and Cascading on YARN outperform their original YARN implementation on popular benchmarks (TPC-DS, TPC-H) and production workloads.", "citation": "Citations (102)", "year": "2015", "departments": ["Hortonworks, Sa ...  Clara, CA, USA", "Hortonworks, Sa ...  Clara, CA, USA", "Hortonworks, Sa ...  Clara, CA, USA", "Hortonworks, Sa ...  Clara, CA, USA", "Hortonworks, Sa ...  Clara, CA, USA"], "conf": "sigmod", "authors": ["Bikas Saha.....http://dblp.org/pers/hd/s/Saha:Bikas", "Hitesh Shah.....http://dblp.org/pers/hd/s/Shah:Hitesh", "Siddharth Seth.....http://dblp.org/pers/hd/s/Seth:Siddharth", "Gopal Vijayaraghavan.....http://dblp.org/pers/hd/v/Vijayaraghavan:Gopal", "Arun C. Murthy.....http://dblp.org/pers/hd/m/Murthy:Arun_C=", "Carlo Curino.....http://dblp.org/pers/hd/c/Curino:Carlo"], "pages": 13}