{"title": "Dynamic interaction graphs with probabilistic edge decay.", "fields": ["snapshot", "classification of discontinuities", "implicit graph", "power graph analysis", "null model"], "abstract": "A large scale network of social interactions, such as mentions in Twitter, can often be modeled as a “dynamic interaction graph” in which new interactions (edges) are continually added over time. Existing systems for extracting timely insights from such graphs are based on either a cumulative “snapshot” model or a “sliding window” model. The former model does not sufficiently emphasize recent interactions. The latter model abruptly forgets past interactions, leading to discontinuities in which, e.g., the graph analysis completely ignores historically important influencers who have temporarily gone dormant. We introduce TIDE, a distributed system for analyzing dynamic graphs that employs a new “probabilistic edge decay” (PED) model. In this model, the graph analysis algorithm of interest is applied at each time step to one or more graphs obtained as samples from the current “snapshot” graph that comprises all interactions that have occurred so far. The probability that a given edge of the snapshot graph is included in a sample decays over time according to a user specified decay function. The PED model allows controlled trade-offs between recency and continuity, and allows existing analysis algorithms for static graphs to be applied to dynamic graphs essentially without change. For the important class of exponential decay functions, we provide efficient methods that leverage past samples to incrementally generate new samples as time advances. We also exploit the large degree of overlap between samples to reduce memory consumption from O(N) to O(logN) when maintaining N sample graphs. Finally, we provide bulk-execution methods for applying graph algorithms to multiple sample graphs simultaneously without requiring any changes to existing graph-processing APIs. Experiments on a real Twitter dataset demonstrate the effectiveness and efficiency of our TIDE prototype, which is built on top of the Spark distributed computing framework.", "citation": "Citations (8)", "departments": ["Cornell University", "IBM", "Google", "IBM", "Platfora, Inc., USA"], "authors": ["Wenlei Xie.....http://dblp.org/pers/hd/x/Xie:Wenlei", "Yuanyuan Tian.....http://dblp.org/pers/hd/t/Tian:Yuanyuan", "Yannis Sismanis.....http://dblp.org/pers/hd/s/Sismanis:Yannis", "Andrey Balmin.....http://dblp.org/pers/hd/b/Balmin:Andrey", "Peter J. Haas.....http://dblp.org/pers/hd/h/Haas:Peter_J="], "conf": "icde", "year": "2015", "pages": 12}