{"title": "Relevance-aware Filtering of Tuples Sorted by an Attribute Value via Direct Optimization of Search Quality Metrics.", "fields": ["learning to rank", "attribute domain", "linear search", "synthetic data", "tuple"], "abstract": "Sorting tuples by an attribute value is a common search scenario and many search engines support such capabilities, e.g. price-based sorting in e-commerce, time-based sorting on a job or social media website. However, sorting purely by the attribute value might lead to poor user experience because the relevance is not taken into account. Hence, at the top of the list the users might see irrelevant results. In this paper we choose a different approach. Rather than just returning the entire list of results sorted by the attribute value, additionally we suggest doing the relevance-aware search results (post-) filtering. Following this approach, we develop a new algorithm based on the dynamic programming that directly optimizes a given search quality metric. It can be seamlessly integrated as the final step of a query processing pipeline and provides a theoretical guarantee on optimality. We conduct a comprehensive evaluation of our algorithm on synthetic data and real learning to rank data sets. Based on the experimental results, we conclude that the proposed algorithm is superior to typically used heuristics and has a clear practical value for the search and related applications.", "citation": "Citations (1)", "departments": ["University of Illinois at Urbana–Champaign", "Moscow Institute of Physics and Technology", "Eindhoven University of Technology", "Stanford University", "Datastars, Mosc ... w, Russian Fed."], "authors": ["Nikita V. Spirin.....http://dblp.org/pers/hd/s/Spirin:Nikita_V=", "Mikhail P. Kuznetsov.....http://dblp.org/pers/hd/k/Kuznetsov:Mikhail_P=", "Julia Kiseleva.....http://dblp.org/pers/hd/k/Kiseleva:Julia", "Yaroslav V. Spirin.....http://dblp.org/pers/hd/s/Spirin:Yaroslav_V=", "Pavel A. Izhutov.....http://dblp.org/pers/hd/i/Izhutov:Pavel_A="], "conf": "sigir", "year": "2015", "pages": 4}