{"title": "Seamlessly integrating disk and tape in a multi-tiered distributed file system.", "fields": ["global namespace", "everything is a file", "storage area network", "virtual tape library", "magnetic tape data storage"], "abstract": "The explosion of data volumes in enterprise environments and limited budgets have triggered the need for multi-tiered storage systems. With the bulk of the data being extremely infrequently accessed, tape is a natural fit for storing such data. In this paper we present our approach to a file storage system that seamlessly integrates disk and tape, enabling a bottomless and cost-effective storage architecture that can scale to accommodate Big Data requirements. The proposed system offers access to data through a POSIX filesystem interface under a single global namespace, optimizing the placement of data across disk and tape tiers. Using a self-contained, standardized and open filesystem format on the removable tape media, the proposed system avoids dependence on proprietary software and external metadata servers to access the data stored on tape. By internally managing the tape tier resources, such as tape drives and cartridges, the system relieves the user from the burden of dealing with the complexities of tape storage. Our implementation, which is based on the GPFS and LTFS filesystems, demonstrates the applicability of the proposed architecture in real-world environments. Our experimental evaluation has shown that this is a very promising approach in terms scalability, performance and manageability. The proposed system has been productized by IBM as LTFS Enterprise Edition.", "citation": "Citations (2)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Ioannis Koltsidas.....http://dblp.org/pers/hd/k/Koltsidas:Ioannis", "Slavisa Sarafijanovic.....http://dblp.org/pers/hd/s/Sarafijanovic:Slavisa", "Martin Petermann.....http://dblp.org/pers/hd/p/Petermann:Martin", "Nils Haustein.....http://dblp.org/pers/hd/h/Haustein:Nils", "Harald Seipp.....http://dblp.org/pers/hd/s/Seipp:Harald", "Robert Haas.....http://dblp.org/pers/hd/h/Haas_0001:Robert", "Jens Jelitto.....http://dblp.org/pers/hd/j/Jelitto:Jens", "Thomas Weigold.....http://dblp.org/pers/hd/w/Weigold:Thomas", "Edwin R. Childers.....http://dblp.org/pers/hd/c/Childers:Edwin_R=", "David Pease.....http://dblp.org/pers/hd/p/Pease:David", "Evangelos Eleftheriou.....http://dblp.org/pers/hd/e/Eleftheriou:Evangelos"], "conf": "icde", "year": "2015", "pages": 12}