{"title": "Pyro: A Spatial-Temporal Big-Data Storage System.", "fields": ["distributed file system", "workload", "scalability", "big data", "response time"], "abstract": "With the rapid growth of mobile devices and applications, geo-tagged data has become a major workload for big data storage systems. In order to achieve scalability, existing solutions build an additional index layer above general purpose distributed data stores. Fulfilling the semantic level need, this approach, however, leaves a lot to be desired for execution efficiency, especially when users query for moving objects within a high resolution geometric area, which we call geometry queries. Such geometry queries translate to a much larger set of range scans, forcing the backend to handle orders of magnitude more requests. Moreover, spatial-temporal applications naturally create dynamic workload hotspots, which pushes beyond the design scope of existing solutions. This paper presents Pyro, a spatial-temporal bigdata storage system tailored for high resolution geometry queries and dynamic hotspots. Pyro understands geometries internally, which allows range scans of a geometry query to be aggregately optimized. Moreover, Pyro employs a novel replica placement policy in the DFS layer that allows Pyro to split a region without losing data locality benefits. Our evaluations use NYC taxi trace data and an 80-server cluster. Results show that Pyro reduces the response time by 60× on 1km×1km rectangle geometries compared to the state-of-the-art solutions. Pyro further achieves 10× throughput improvement on 100m×100m rectangle geometries.", "citation": "Citations (11)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "IBM", "IBM", "University of Illinois at Urbana–Champaign"], "authors": ["Shen Li.....http://dblp.org/pers/hd/l/Li:Shen", "Shaohan Hu.....http://dblp.org/pers/hd/h/Hu:Shaohan", "Raghu K. Ganti.....http://dblp.org/pers/hd/g/Ganti:Raghu_K=", "Mudhakar Srivatsa.....http://dblp.org/pers/hd/s/Srivatsa:Mudhakar", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F="], "conf": "usenix", "year": "2015", "pages": 13}