{"title": "Efficient Genome-Wide, Privacy-Preserving Similar Patient Query based on Private Edit Distance.", "fields": ["edit distance", "complement", "secure multi party computation", "genome", "data mining"], "abstract": "Edit distance has been proven to be an important and frequently-used metric in many human genomic research, with Similar Patient Query (SPQ) being a particularly promising and attractive example. However, due to the widespread privacy concerns on revealing personal genomic data, the scope and scale of many novel use of genome edit distance are substantially limited. While the problem of private genomic edit distance has been studied by the research community for over a decade [6], the state-of-the-art solution [31] is far from even close to be applicable to real genome sequences. In this paper, we propose several private edit distance protocols that feature unprecedentedly high efficiency and precision. Our construction is a combination of a novel genomic edit distance ap- proximation algorithm and new construction of private set difference size protocols. With the private edit distance based secure SPQ primitive, we propose GENSETS, a genome-wide, privacy- preserving similar patient query system. It is able to support search- ing large-scale, distributed genome databases across the nation. We have implemented a prototype of GENSETS. The experimental results show that, with 100 Mbps network connection, it would take GENSETS less than 200 minutes to search through 1 million breast cancer patients (distributed nation-wide in 250 hospitals, each having 4000 patients), based on edit distances between their genomes of lengths about 75 million nucleotides each.", "citation": "Citations (59)", "year": "2015", "departments": ["University of Maryland, College Park", "Indiana University Bloomington", "Indiana University Bloomington", "Indiana University Bloomington", "Indiana University Bloomington"], "conf": "ccs", "authors": ["Xiao Shaun Wang.....http://dblp.org/pers/hd/w/Wang:Xiao_Shaun", "Yan Huang.....http://dblp.org/pers/hd/h/Huang_0001:Yan", "Yongan Zhao.....http://dblp.org/pers/hd/z/Zhao:Yongan", "Haixu Tang.....http://dblp.org/pers/hd/t/Tang:Haixu", "XiaoFeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:XiaoFeng", "Diyue Bu.....http://dblp.org/pers/hd/b/Bu:Diyue"], "pages": 12}