{"title": "Image Profiling for History Events on the Fly.", "fields": ["pattern recognition", "profiling", "convolutional neural network", "ranging", "granularity"], "abstract": "History event related knowledge is precious and imagery is a powerful medium that records diverse information about the event. In this paper, we propose to automatically construct an image profile given a one sentence description of the historic event which contains where, when, who and what elements. Such a simple input requirement makes our solution easy to scale up and support a wide range of culture preservation and curation related applications ranging from wikipedia enrichment to history education. However, history relevant information on the web is available as \"wild and dirty\" data, which is quite different from clean, manually curated and structured information sources. There are two major challenges to build our proposed image profiles: 1) unconstrained image genre diversity. We categorize images into genres of documents/maps, paintings or photos. Image genre classification involves a full-spectrum of features from low-level color to high-level semantic concepts. 2) image content diversity. It can include faces, objects and scenes. Furthermore, even within the same event, the views and subjects of images are diverse and correspond to different facets of the event. To solve this challenge, we group images at two levels of granularity: iconic image grouping and facet image grouping. These require different types of features and analysis from near exact matching to soft semantic similarity. We develop a full-range feature analysis module which is composed of several levels, each suitable for different types of image analysis tasks. The wide range of features are based on both classical hand-crafted features and different layers of a convolutional neural network. We compare and study the performance of the different levels in the full-range features and show their effectiveness on handling such a wild, unconstrained dataset.", "citation": "Citations (2)", "departments": ["Shanghai Jiao Tong University", "Renmin University of China", "Shanghai Jiao Tong University", "University of Pittsburgh"], "authors": ["Jia Chen.....http://dblp.org/pers/hd/c/Chen:Jia", "Qin Jin.....http://dblp.org/pers/hd/j/Jin:Qin", "Yong Yu.....http://dblp.org/pers/hd/y/Yu:Yong", "Alexander G. Hauptmann.....http://dblp.org/pers/hd/h/Hauptmann:Alexander_G="], "conf": "mm", "year": "2015", "pages": 10}