{"title": "What are Popular: Exploring Twitter Features for Event Detection, Tracking and Visualization.", "fields": ["timestamp", "exploit", "convolutional neural network", "topic model", "visual word"], "abstract": "As one of the most representative social media platforms, Twitter provides various real-life information on social events in real time. Despite that social event detection has been actively studied, tweet images, which appear in around 36 percent of the total tweets, have not been well utilized for this research problem. Most existing event detection methods tend to represent an image as a bag-of-visual-words and then process these visual words in the same way as textual words. This may not fully exploit the visual properties of images. State-of-the-art visual features like convolutional neural network (CNN) features have shown significant performance gains over the traditional bag-of-visual-words in unveiling the image's semantics. Unfortunately, they have not been employed in detecting events from social websites. Hence, how to make the most of tweet images to improve the performance of social event detection and visualization remains open. In this paper, we thoroughly study the impact of tweet images on social event detection for different event categories using various visual features. A novel topic model which jointly models five Twitter features (text, image, location, timestamp and hashtag) is designed to discover events from the sheer amount of tweets. Moreover, the evolutions of events are tracked by linking the events detected on adjacent days and each event is visualized by representative images selected on three predefined criteria. Extensive experiments have been conducted on a real-life tweet dataset to verify the effectiveness of our method.", "citation": "Citations (19)", "departments": ["University of Queensland", "University of Electronic Science and Technology of China", "University of Queensland", "University of Queensland"], "authors": ["HongYun Cai.....http://dblp.org/pers/hd/c/Cai:HongYun", "Yang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Yang", "Xuefei Li.....http://dblp.org/pers/hd/l/Li:Xuefei", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi"], "conf": "mm", "year": "2015", "pages": 10}