{"title": "Virtual machine migration planning in software-defined networks.", "fields": ["virtual machine", "live migration", "downtime", "approximation algorithm", "integer programming", "load balancing"], "abstract": "Live migration is a key technique for virtual machine (VM) management in data center networks, which enables flexibility in resource optimization, fault tolerance, and load balancing. Despite its usefulness, the live migration still introduces performance degradations during the migration process. Thus, there has been continuous efforts in reducing the migration time in order to minimize the impact. From the network's perspective, the migration time is determined by the amount of data to be migrated and the available bandwidth used for such transfer. In this paper, we examine the problem of how to schedule the migrations and how to allocate network resources for migration when multiple VMs need to be migrated at the same time. We consider the problem in the Software-defined Network (SDN) context since it provides flexible control on routing. More specifically, we propose a method that computes the optimal migration sequence and network bandwidth used for each migration. We formulate this problem as a mixed integer programming, which is NP-hard. To make it computationally feasible for large scale data centers, we propose an approximation scheme via linear approximation plus fully polynomial time approximation, and obtain its theoretical performance bound. Through extensive simulations, we demonstrate that our fully polynomial time approximation (FPTA) algorithm has a good performance compared with the optimal solution and two state-of-the-art algorithms. That is, our proposed FPTA algorithm approaches to the optimal solution with less than 10% variation and much less computation time. Meanwhile, it reduces the total migration time and the service downtime by up to 40% and 20% compared with the state-of-the-art algorithms, respectively.", "citation": "Citations (16)", "departments": ["Tsinghua University", "Tsinghua University", "Ericsson", "Tsinghua University", "Tsinghua University"], "authors": ["Huandong Wang.....http://dblp.org/pers/hd/w/Wang:Huandong", "Yong Li.....http://dblp.org/pers/hd/l/Li_0008:Yong", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang:Ying", "Depeng Jin.....http://dblp.org/pers/hd/j/Jin:Depeng"], "conf": "infocom", "year": "2015", "pages": 9}