{"title": "Interactive Code Review for Systematic Changes.", "fields": ["codebase", "real time computing", "database", "code review", "software"], "abstract": "Developers often inspect a diff patch during peer code reviews. Diff patches show low-level program differences per file without summarizing  systematic changes ---similar, related changes to multiple contexts. We present C ritics , an interactive approach for inspecting systematic changes. When a developer specifies code change within a diff patch, C ritics  allows developers to customize the change template by iteratively generalizing change content and context. By matching a generalized template against the codebase, it summarizes similar changes and detects potential mistakes. We evaluated C ritics  using two methods. First, we conducted a user study at Salesforce.com, where professional engineers used C ritics  to investigate diff patches authored by their own team. After using C ritics , all six participants indicated that they would like C ritics  to be integrated into their current code review environment. This also attests to the fact that C ritics  scales to an industry-scale project and can be easily adopted by professional engineers. Second, we conducted a user study where twelve participants reviewed diff patches using C ritics  and Eclipse diff. The results show that human subjects using C ritics  answer questions about systematic changes 47.3% more correctly with 31.9% saving in time during code review tasks, in comparison to the baseline use of Eclipse diff. These results show that C ritics  should improve developer productivity in inspecting systematic changes during peer code reviews.", "citation": "Citations (18)", "departments": ["University of California, Los Angeles", "University of Texas at Austin", "University of Texas at Austin", "University of California, Los Angeles"], "authors": ["Tianyi Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Tianyi", "Myoungkyu Song.....http://dblp.org/pers/hd/s/Song:Myoungkyu", "Joseph Pinedo.....http://dblp.org/pers/hd/p/Pinedo:Joseph", "Miryung Kim.....http://dblp.org/pers/hd/k/Kim:Miryung"], "conf": "icse", "year": "2015", "pages": 12}