{"title": "Optimized layered integrated video encoding.", "fields": ["universal software radio peripheral", "multicast", "channel", "mimo", "antenna"], "abstract": "Wireless video traffic has grown at an unprecedented rate and put significant burden on wireless networks. Multicast can significantly reduce traffic by sending a single video to multiple receivers simultaneously. On the other hand, wireless receivers are heterogeneous due to both channel and antenna heterogeneity, the latter of which is rapidly increasing with the emergence of 802.11n and 802.11ac. In this paper, we develop optimized layered integrated video encoding (LIVE) to guarantee reasonable performance to weaker receivers (with worse channel and/or fewer antennas) and allow stronger receivers to enjoy better quality. Our approach has three distinct features: (i) It uses a novel layered coding to naturally accommodate the heterogeneity of different video receivers; (ii) It uses an optimization framework to optimize the amount of time used for transmission and the amount of information to transmit at each layer under the current channel condition; and (iii) It uses an integrated modulation, where most video data are transmitted using soft modulation to enjoy efficiency and resilience while the most important video data are transmitted using a combination of soft modulation and conventional hard modulation to further enhance their reliability. To our knowledge, this is the first approach that handles MIMO antenna heterogeneity in wireless video multicast. We demonstrate its effectiveness through extensive Matlab simulation and USRP testbed experiments.", "citation": "Citations (4)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Sangki Yun.....http://dblp.org/pers/hd/y/Yun:Sangki", "Daehyeok Kim.....http://dblp.org/pers/hd/k/Kim:Daehyeok", "Xiaofan Lu.....http://dblp.org/pers/hd/l/Lu:Xiaofan", "Lili Qiu.....http://dblp.org/pers/hd/q/Qiu:Lili"], "conf": "infocom", "year": "2015", "pages": 9}