{"title": "Forming external behaviors by leveraging internal opinions.", "fields": ["management science", "opinion leadership", "closeness", "social network", "approximation algorithm"], "abstract": "People make decisions and express their opinions according to their communities. A natural idea for controlling the diffusion of a behavior is to find influential people, and employ them to spread a desired behavior. We investigate an influencing problem when individuals' behaviors are affected by their friends in an opinion formation process. Our goal is to design efficient algorithms for finding opinion leaders such that changing their opinions has a great impact on the overall external behaviors in the society. We study directed social networks and define a set of problems like maximizing the sum of individuals' behaviors or maximizing the number of individuals whose external behaviors are above a threshold. We discuss the complexity of the defined problems and design polynomial-time optimum algorithms for the non NP-hard variants of them. We also propose polynomial-time approximation algorithms with guaranteed performances and prove inapproximability results for the NP-hard variants of these problems. Furthermore, we run simulations on real-world social networks and show our proposed algorithm outperforms the classical algorithms such as degree-based algorithm, closeness-based algorithm, and pagerank-based algorithm.", "citation": "Citations (3)", "departments": ["Sharif University of Technology", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["AmirMahdi Ahmadinejad.....http://dblp.org/pers/hd/a/Ahmadinejad:AmirMahdi", "Sina Dehghani.....http://dblp.org/pers/hd/d/Dehghani:Sina", "MohammadTaghi Hajiaghayi.....http://dblp.org/pers/hd/h/Hajiaghayi:MohammadTaghi", "Hamid Mahini.....http://dblp.org/pers/hd/m/Mahini:Hamid", "Saeed Seddighin.....http://dblp.org/pers/hd/s/Seddighin:Saeed", "Sadra Yazdanbod.....http://dblp.org/pers/hd/y/Yazdanbod:Sadra"], "conf": "infocom", "year": "2015", "pages": 9}