{"title": "Tracking Static Analysis Violations over Time to Capture Developer Characteristics.", "fields": ["static program analysis", "verification and validation", "regression testing", "software quality analyst", "software construction"], "abstract": "Many interesting questions about the software quality of a code base can only be answered adequately if fine-grained information about the evolution of quality metrics over time and the contributions of individual developers is known. We present an approach for tracking static analysis violations (which are often indicative of defects) over the revision history of a program, and for precisely attributing the introduction and elimination of these violations to individual developers. As one application, we demonstrate how this information can be used to compute ``fingerprints'' of developers that reflect which kinds of violations they tend to introduce or to fix. We have performed an experimental study on several large open-source projects written in different languages, providing evidence that these fingerprints are well-defined and capture characteristic information about the coding habits of individual developers.", "citation": "Citations (8)", "departments": ["Semmle Ltd., Ox ...  United Kingdom", "Semmle Ltd., Ox ...  United Kingdom", "Semmle Ltd., Ox ...  United Kingdom", "Semmle Ltd., Ox ...  United Kingdom", "Semmle Ltd., Ox ...  United Kingdom"], "authors": ["Pavel Avgustinov.....http://dblp.org/pers/hd/a/Avgustinov:Pavel", "Arthur I. Baars.....http://dblp.org/pers/hd/b/Baars:Arthur_I=", "Anders S. Henriksen.....http://dblp.org/pers/hd/h/Henriksen:Anders_S=", "R. Greg Lavender.....http://dblp.org/pers/hd/l/Lavender:R=_Greg", "Galen Menzel.....http://dblp.org/pers/hd/m/Menzel:Galen", "Oege de Moor.....http://dblp.org/pers/hd/m/Moor:Oege_de", "Max Schäfer.....http://dblp.org/pers/hd/s/Sch=auml=fer:Max", "Julian Tibble.....http://dblp.org/pers/hd/t/Tibble:Julian"], "conf": "icse", "year": "2015", "pages": 11}