{"title": "Virtual proxemics: Locomotion in the presence of obstacles in large immersive projection environments.", "fields": ["preferred walking speed", "immersion", "obstacle avoidance", "obstacle", "proxemics"], "abstract": "In this paper, we investigate obstacle avoidance behavior during real walking in a large immersive projection setup. We analyze the walking behavior of users when avoiding real and virtual static obstacles. In order to generalize our study, we consider both anthropomorphic and inanimate objects, each having his virtual and real counterpart. The results showed that users exhibit different locomotion behaviors in the presence of real and virtual obstacles, and in the presence of anthropomorphic and inanimate objects. Precisely, the results showed a decrease of walking speed as well as an increase of the clearance distance (i. e., the minimal distance between the walker and the obstacle) when facing virtual obstacles compared to real ones. Moreover, our results suggest that users act differently due to their perception of the obstacle: users keep more distance when the obstacle is anthropomorphic compared to an inanimate object and when the orientation of anthropomorphic obstacle is from the profile compared to a front position. We discuss implications on future large shared immersive projection spaces.", "citation": "Citations (10)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "University of Hamburg", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Ferran Argelaguet.....http://dblp.org/pers/hd/a/Argelaguet:Ferran", "Anne-Hélène Olivier.....http://dblp.org/pers/hd/o/Olivier:Anne=H=eacute=l=egrave=ne", "Gerd Bruder.....http://dblp.org/pers/hd/b/Bruder:Gerd", "Julien Pettré.....http://dblp.org/pers/hd/p/Pettr=eacute=:Julien", "Anatole Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Anatole"], "conf": "vr", "year": "2015", "pages": 6}