{"title": "Beyond Principal Components: Deep Boltzmann Machines for face modeling.", "fields": ["face hallucination", "facial recognition system", "active appearance model", "three dimensional face recognition", "parameterized complexity"], "abstract": "The “interpretation through synthesis”, i.e. Active Appearance Models (AAMs) method, has received considerable attention over the past decades. It aims at “explaining” face images by synthesizing them via a parameterized model of appearance. It is quite challenging due to appearance variations of human face images, e.g. facial poses, occlusions, lighting, low resolution, etc. Since these variations are mostly non-linear, it is impossible to represent them in a linear model, such as Principal Component Analysis (PCA). This paper presents a novel Deep Appearance Models (DAMs) approach, an efficient replacement for AAMs, to accurately capture both shape and texture of face images under large variations. In this approach, three crucial components represented in hierarchical layers are modeled using the Deep Boltzmann Machines (DBM) to robustly capture the variations of facial shapes and appearances. DAMs are therefore superior to AAMs in inferring a representation for new face images under various challenging conditions. In addition, DAMs have ability to generate a compact set of parameters in higher level representation that can be used for classification, e.g. face recognition and facial age estimation. The proposed approach is evaluated in facial image reconstruction, facial super-resolution on two databases, i.e. LFPW and Helen. It is also evaluated on FG-NET database for the problem of age estimation.", "citation": "Citations (19)", "year": "2015", "departments": ["Concordia University", "Carnegie Mellon University", "Concordia University", "Concordia University"], "conf": "cvpr", "authors": ["Chi Nhan Duong.....http://dblp.org/pers/hd/d/Duong:Chi_Nhan", "Khoa Luu.....http://dblp.org/pers/hd/l/Luu:Khoa", "Kha Gia Quach.....http://dblp.org/pers/hd/q/Quach:Kha_Gia", "Tien D. Bui.....http://dblp.org/pers/hd/b/Bui:Tien_D="], "pages": 9}