{"title": "Measurement and modeling of user transitioning among networks.", "fields": ["access network", "mobility model", "small number", "first class", "mobility management"], "abstract": "Physical human mobility has played an important role in the design and operation of mobile networks. Physical mobility, however, differs from user identity (name) mobility in both traditional mobility management protocols such as Mobile-IP and in new architectures, such as XIA and MobilityFirst, that support identity mobility and location independence as first class objects. A multi-homed stationary user or a stationary user shifting among multiple devices attached to different networks will persistently keep his/her identity but will change access networks and the IP address to which his/her identity is associated. We perform a measurement study of such user transitioning among networks from a network-level point of view, characterizing the sequence of networks to which a user is attached and discuss insights and implications drawn from these measurements. We characterize network transitioning in terms of network residency time, degree of multi-homing, transition rates and more. We find that users typically spend time attached to a small number of access networks, and that a surprisingly large number of users access two networks contemporaneously. We develop and validate a parsimonious Markov chain model of canonical user transitioning among networks that can be used to provision network services and to analyze mobility protocols.", "citation": "Citations (1)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Sookhyun Yang.....http://dblp.org/pers/hd/y/Yang:Sookhyun", "Jim Kurose.....http://dblp.org/pers/hd/k/Kurose:Jim", "Simon Heimlicher.....http://dblp.org/pers/hd/h/Heimlicher:Simon", "Arun Venkataramani.....http://dblp.org/pers/hd/v/Venkataramani:Arun"], "conf": "infocom", "year": "2015", "pages": 9}