{"title": "A framework for computation of popular paths from crowdsourced data.", "fields": ["popularity", "point of interest", "pareto principle", "geospatial analysis", "shortest path problem"], "abstract": "Directions and paths, as commonly provided by route guidance systems, are usually derived considering absolute metrics, e.g., finding the shortest path within the underlying road network. This demo presents a framework which uses crowdsourced geospatial data to obtain paths that do not only minimize travel time but also guide users along popular points of interest (POIs). By analyzing textual travel blog data and Flickr data, we define a measure for popularity of POIs. This measure is used as an additional cost criterion in the underlying road network graph. Furthermore, we propose an approach to reduce the problem of finding paths which maximize popularity while minimizing travel time to the computation of bicriterion pareto optimal paths. The presented framework allows users to specify origin and destination within a road network, returning the set of pareto optimal paths or a subset thereof if a desired number of POIs along the path has been specified. Each of the returned routes is enriched with representative Flickr images and textual information from travel blogs. The framework and its results show that the computed paths yield competitive solutions in terms of travel time while also providing more “popular” paths, making routing easier and more informative for the user.", "citation": "Citations (2)", "departments": ["Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "National Technical University of Athens", "Ludwig Maximilian University of Munich", "University of Alberta"], "authors": ["Gregor Jossé.....http://dblp.org/pers/hd/j/Joss=eacute=:Gregor", "Maximilian Franzke.....http://dblp.org/pers/hd/f/Franzke:Maximilian", "Georgios Skoumas.....http://dblp.org/pers/hd/s/Skoumas:Georgios", "Andreas Züfle.....http://dblp.org/pers/hd/z/Z=uuml=fle:Andreas", "Mario A. Nascimento.....http://dblp.org/pers/hd/n/Nascimento:Mario_A=", "Matthias Renz.....http://dblp.org/pers/hd/r/Renz:Matthias"], "conf": "icde", "year": "2015", "pages": 4}