{"title": "Optimizing energy consumption of GUIs in Android apps: a multi-objective approach.", "fields": ["energy consumption", "android", "mobile device", "software system", "objective approach"], "abstract": "The wide diffusion of mobile devices has motivated research towards optimizing energy consumption of software systems— including apps—targeting such devices. Besides efforts aimed at dealing with various kinds of energy bugs, the adoption of Organic Light-Emitting Diode (OLED) screens has motivated research towards reducing energy consumption by choosing an appropriate color palette. Whilst past research in this area aimed at optimizing energy while keeping an acceptable level of contrast, this paper proposes an approach, named GEMMA (Gui Energy Multi-objective optiMization for Android apps), for generating color palettes using a multi- objective optimization technique, which produces color solutions optimizing energy consumption and contrast while using consistent colors with respect to the original color palette. An empirical evaluation that we performed on 25 Android apps demonstrates not only significant improvements in terms of the three different objectives, but also confirmed that in most cases users still perceived the choices of colors as attractive. Finally, for several apps we interviewed the original developers, who in some cases expressed the intent to adopt the proposed choice of color palette, whereas in other cases pointed out directions for future improvements", "citation": "Citations (36)", "departments": ["College of William & Mary", "College of William & Mary", "University of Molise", "University of Sannio", "Free University ...  Bolzano, Italy"], "authors": ["Mario Linares Vásquez.....http://dblp.org/pers/hd/v/V=aacute=squez:Mario_Linares", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Carlos Eduardo Bernal-Cárdenas.....http://dblp.org/pers/hd/b/Bernal=C=aacute=rdenas:Carlos_Eduardo", "Rocco Oliveto.....http://dblp.org/pers/hd/o/Oliveto:Rocco", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "conf": "sigsoft", "year": "2015", "pages": 12}