{"title": "Hey, you have given me too many knobs!: understanding and dealing with over-designed configuration in system software.", "fields": ["system software", "software configuration management", "configuration design", "software system", "configuration space"], "abstract": "Configuration problems are not only prevalent, but also severely impair the reliability of today's system software. One fundamental reason is the ever-increasing complexity of configuration, reflected by the large number of configuration parameters (\"knobs\"). With hundreds of knobs, configuring system software to ensure high reliability and performance becomes a daunting, error-prone task. This paper makes a first step in understanding a fundamental question of configuration design: \"do users really need so many knobs?\" To provide the quantitatively answer, we study the configuration settings of real-world users, including thousands of customers of a commercial storage system (Storage-A), and hundreds of users of two widely-used open-source system software projects. Our study reveals a series of interesting findings to motivate software architects and developers to be more cautious and disciplined in configuration design. Motivated by these findings, we provide a few concrete, practical guidelines which can significantly reduce the configuration space. Take Storage-A as an example, the guidelines can remove 51.9% of its parameters and simplify 19.7% of the remaining ones with little impact on existing users. Also, we study the existing configuration navigation methods in the context of \"too many knobs\" to understand their effectiveness in dealing with the over-designed configuration, and to provide practices for building navigation support in system software.", "citation": "Citations (33)", "departments": ["University of California, San Diego", "University of California, San Diego", "Huazhong University of Science and Technology", "University of California, San Diego", "NetApp, USA"], "authors": ["Tianyin Xu.....http://dblp.org/pers/hd/x/Xu:Tianyin", "Long Jin.....http://dblp.org/pers/hd/j/Jin:Long", "Xuepeng Fan.....http://dblp.org/pers/hd/f/Fan:Xuepeng", "Yuanyuan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuanyuan", "Shankar Pasupathy.....http://dblp.org/pers/hd/p/Pasupathy:Shankar", "Rukma Talwadker.....http://dblp.org/pers/hd/t/Talwadker:Rukma"], "conf": "sigsoft", "year": "2015", "pages": 13}