{"title": "Rubik: Knowledge Guided Tensor Factorization and Completion for Health Data Analytics.", "fields": ["noisy data", "data analysis", "pairwise comparison", "tensor", "factorization"], "abstract": "Computational phenotyping is the process of converting heterogeneous electronic health records (EHRs) into meaningful clinical concepts. Unsupervised phenotyping methods have the potential to leverage a vast amount of labeled EHR data for phenotype discovery. However, existing unsupervised phenotyping methods do not incorporate current medical knowledge and cannot directly handle missing, or noisy data.   We propose Rubik, a constrained non-negative tensor factorization and completion method for phenotyping. Rubik incorporates 1) guidance constraints to align with existing medical knowledge, and 2) pairwise constraints for obtaining distinct, non-overlapping phenotypes. Rubik also has built-in tensor completion that can significantly alleviate the impact of noisy and missing data. We utilize the Alternating Direction Method of Multipliers (ADMM) framework to tensor factorization and completion, which can be easily scaled through parallel computing.   We evaluate Rubik on two EHR datasets, one of which contains 647,118 records for 7,744 patients from an outpatient clinic, the other of which is a public dataset containing 1,018,614 CMS claims records for 472,645 patients. Our results show that Rubik can discover more meaningful and distinct phenotypes than the baselines. In particular, by using knowledge guidance constraints, Rubik can also discover sub-phenotypes for several major diseases. Rubik also runs around seven times faster than current state-of-the-art tensor methods. Finally, Rubik is scalable to large datasets containing millions of EHR records.", "citation": "Citations (83)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "University of Texas at Austin", "Vanderbilt University", "Northwestern University"], "authors": ["Yichen Wang.....http://dblp.org/pers/hd/w/Wang:Yichen", "Robert Chen.....http://dblp.org/pers/hd/c/Chen:Robert", "Joydeep Ghosh.....http://dblp.org/pers/hd/g/Ghosh:Joydeep", "Joshua C. Denny.....http://dblp.org/pers/hd/d/Denny:Joshua_C=", "Abel N. Kho.....http://dblp.org/pers/hd/k/Kho:Abel_N=", "You Chen.....http://dblp.org/pers/hd/c/Chen:You", "Bradley A. Malin.....http://dblp.org/pers/hd/m/Malin:Bradley_A=", "Jimeng Sun.....http://dblp.org/pers/hd/s/Sun:Jimeng"], "conf": "kdd", "year": "2015", "pages": 10}