{"title": "Discriminative Pose-Free Descriptors for Face and Object Matching.", "fields": ["linear subspace", "generalizability theory", "subspace topology", "discriminative model", "3d pose estimation", "invariant", "canonical correlation"], "abstract": "Two Discriminative Pose-Free descriptors, DPF-SPR and DPF-LCC are proposed.The approach does not require separate training for different probe viewpoints.Very few poses required during training, the method can generalize to unseen poses.Experiments illustrate effectiveness in applications like face and object recognition. Pose invariant matching is a very important problem with various applications like recognizing faces in uncontrolled scenarios in which the facial images appear in wide variety of pose and illumination conditions along with low resolution. Here we propose two discriminative pose-free descriptors, Subspace Point Representation (DPF-SPR) and Layered Canonical Correlated (DPF-LCC) descriptor, for matching faces and objects across pose. Training examples at very few poses are used to generate virtual intermediate pose subspaces. An image is represented by a feature set obtained by projecting its low-level feature on these subspaces and a discriminative transform is applied to make this feature set suitable for recognition. We represent this discriminative feature set by two novel descriptors. In one approach, we transform it to a vector by using subspace to point representation technique. In the second approach, a layered structure of canonical correlated subspaces are formed, onto which the feature set is projected. Experiments on recognizing faces and objects across pose and comparisons with state-of-the-art show the effectiveness of the proposed approach.", "citation": "Citations (1)", "year": "2015", "departments": ["Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science"], "conf": "iccv", "authors": ["Soubhik Sanyal.....http://dblp.org/pers/hd/s/Sanyal:Soubhik", "Sivaram Prasad Mudunuri.....http://dblp.org/pers/hd/m/Mudunuri:Sivaram_Prasad", "Soma Biswas.....http://dblp.org/pers/hd/b/Biswas:Soma"], "pages": 9}