{"title": "Rectangles Are Nonnegative Juntas.", "fields": ["structured program theorem", "combinatorics", "gadget", "partition", "nonnegative rank", "communication complexity", "discrete mathematics", "mathematics", "rectangle"], "abstract": "We develop a new method to prove communication lower bounds for composed functions of the form f o g n  where f is any boolean function on n inputs and g is a sufficiently \"hard\" two-party gadget. Our main structure theorem states that each rectangle in the communication matrix of f o g n  can be simulated by a nonnegative combination of juntas. This is the strongest yet formalization for the intuition that each low-communication randomized protocol can only \"query\" few inputs of f as encoded by the gadget g. Consequently, we characterize the communication complexity of f o g n  in all known one-sided zero-communication models by a corresponding query complexity measure of f. These models in turn capture important lower bound techniques such as corruption, smooth rectangle bound, relaxed partition bound, and extended discrepancy. As applications, we resolve several open problems from prior work: We show that SBPcc (a class characterized by corruption) is not closed under intersection. An immediate corollary is that MAcc ≠ SBPcc. These results answer questions of Klauck (CCC 2003) and Bohler et al. (JCSS 2006). We also show that approximate nonnegative rank of partial boolean matrices does not admit efficient error reduction. This answers a question of Kol et al. (ICALP) for partial matrices.", "citation": "Citations (22)", "year": "2015", "departments": ["University of Toronto", "University of California, San Diego", "University of California, Los Angeles", "University of Toronto", "University of Texas at Austin"], "conf": "stoc", "authors": ["Mika Göös.....http://dblp.org/pers/hd/g/G=ouml==ouml=s:Mika", "Shachar Lovett.....http://dblp.org/pers/hd/l/Lovett:Shachar", "Raghu Meka.....http://dblp.org/pers/hd/m/Meka:Raghu", "Thomas Watson.....http://dblp.org/pers/hd/w/Watson_0001:Thomas", "David Zuckerman.....http://dblp.org/pers/hd/z/Zuckerman:David"], "pages": 10}