{"title": "Experience: Rethinking RRC State Machine Optimization in Light of Recent Advancements.", "fields": ["network packet", "radio resource control", "umts frequency bands", "random access channel", "telecommunications link"], "abstract": "Broadband mobile networks utilize a radio resource control (RRC) state machine to allocate scarce radio resources. Current implementations introduce high latencies and cross-layer degradation. Recently, the RRC enhancements, continuous packet connectivity (CPC) and the enhanced forward access channel (Enhanced FACH), have emerged in UMTS. We study the availability and performance of these enhancements on a network serving a market with a population in the millions. Our experience in the wild shows these enhancements offer significant reductions in latency, mobile device energy consumption, and improved end user experience. We develop new over-the-air measurements that resolve existing limitations in measuring RRC parameters. We find CPC provides significant benefits with minimal resource costs, prompting us to rethink past optimization strategies. We examine the cross-layer performance of CPC and Enhanced FACH, concluding that CPC provides reductions in mobile device energy consumption for many applications. While the performance increase of HS-FACH is substantial, cross-layer performance is limited by the legacy uplink random access channel (RACH), and we conclude full support of Enhanced FACH is necessary to benefit most applications. Given that UMTS growth will exceed LTE for several more years and the greater worldwide deployment of UMTS, our quantitative results should be of great interest to network operators adding capacity to these networks. Finally, these results provide new insights for application developers wishing to optimize performance with these RRC enhancements.", "citation": "Citations (2)", "departments": ["University of Cincinnati", "University of Cincinnati", "University of Cincinnati", "Northeastern University"], "authors": ["Theodore Stoner.....http://dblp.org/pers/hd/s/Stoner:Theodore", "Xuetao Wei.....http://dblp.org/pers/hd/w/Wei:Xuetao", "Joseph Knight.....http://dblp.org/pers/hd/k/Knight:Joseph", "Lei Guo.....http://dblp.org/pers/hd/g/Guo_0005:Lei"], "conf": "mobicom", "year": "2015", "pages": 9}