{"title": "Social Barriers Faced by Newcomers Placing Their First Contribution in Open Source Software Projects.", "fields": ["onboarding", "streams", "conceptual model", "socialization", "systematic review"], "abstract": "Newcomers' seamless onboarding is important for online communities that depend upon leveraging the contribution of outsiders. Previous studies investigated aspects of the joining process and motivation in open collaboration communities, but few have focused on identifying and understanding the critical barriers newcomers face when placing their first contribution, a period that frequently leads to dropout. This is important for Open Source Software (OSS) projects, which receive contributions from many one-time contributors. Focusing on OSS, our study qualitatively analyzed social barriers that hindered newcomers' first contributions. We defined a conceptual model composed of 58 barriers including 13 social barriers. The barriers were identified from a qualitative data analysis considering different sources: a systematic literature review; open question responses gathered from OSS projects' contributors; students contributing to OSS projects; and semi-structured interviews with 36 developers from 14 different projects. This paper focuses on social barriers and its contributions include gathering empirical evidence of the barriers faced by newcomers, organizing and better understanding these barriers, surveying the literature from the perspective of the barriers, and identifying new potential research streams.", "citation": "Citations (82)", "departments": ["Federal University of Technology - Paraná", "Federal University of Amazonas", "University of São Paulo", "University of California, Irvine"], "authors": ["Igor Steinmacher.....http://dblp.org/pers/hd/s/Steinmacher:Igor", "Tayana Conte.....http://dblp.org/pers/hd/c/Conte:Tayana", "Marco Aurélio Gerosa.....http://dblp.org/pers/hd/g/Gerosa:Marco_Aur=eacute=lio", "David F. Redmiles.....http://dblp.org/pers/hd/r/Redmiles:David_F="], "conf": "cscw", "year": "2015", "pages": 14}