{"title": "Paxos made transparent.", "fields": ["heuristics", "false positives and false negatives", "concurrency", "multi core processor", "partitioned global address space", "model checking", "transparency", "paxos", "programming paradigm", "compiler"], "abstract": "MODIST is the first model checker designed for transparently checking unmodified distributed systems running on unmodified operating systems. It achieves this transparency via a novel architecture: a thin interposition layer exposes all actions in a distributed system and a centralized, OS-independent model checking engine explores these actions systematically. We made MODIST practical through three techniques: an execution engine to simulate consistent, deterministic executions and failures; a virtual clock mechanism to avoid false positives and false negatives; and a state exploration framework to incorporate heuristics for efficient error detection.\n\nWe implemented MODIST on Windows and applied it to three well-tested distributed systems: Berkeley DB, a widely used open source database; MPS, a deployed Paxos implementation; and PACIFICA, a primary-backup replication protocol implementation. MODIST found 35 bugs in total. Most importantly, it found protocol-level bugs (i.e., flaws in the core distributed protocols) in every system checked: 10 in total, including 2 in Berkeley DB, 2 in MPS, and 6 in PACIFICA.", "citation": "Citations (192)", "departments": ["Columbia University", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Fudan University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Heming Cui.....http://dblp.org/pers/hd/c/Cui:Heming", "Rui Gu.....http://dblp.org/pers/hd/g/Gu:Rui", "Cheng Liu.....http://dblp.org/pers/hd/l/Liu:Cheng", "Tianyu Chen.....http://dblp.org/pers/hd/c/Chen:Tianyu", "Junfeng Yang.....http://dblp.org/pers/hd/y/Yang:Junfeng"], "conf": "sosp", "year": "2015", "pages": 16}