{"title": "When and Why Your Code Starts to Smell Bad.", "fields": ["software quality", "code smell", "regression testing", "technical debt", "code refactoring"], "abstract": "In past and recent years, the issues related to managing technical debt received significant attention by researchers from both industry and academia. There are several factors that contribute to technical debt. One of these is represented by code bad smells,  i.e. , symptoms of poor design and implementation choices. While the repercussions of smells on code quality have been empirically assessed, there is still only anecdotal evidence on  when  and  why  bad smells are introduced. To fill this gap, we conducted a large empirical study over the change history of 200 open source projects from different software ecosystems and investigated when bad smells are introduced by developers, and the circumstances and reasons behind their introduction. Our study required the development of a strategy to identify smell-introducing commits, the mining of over 0.5M commits, and the manual analysis of 9,164 of them ( i.e. , those identified as  smell-introducing ). Our findings mostly contradict common wisdom stating that smells are being introduced during evolutionary tasks. In the light of our results, we also call for the need to develop a new generation of recommendation systems aimed at properly planning smell refactoring activities.", "citation": "Citations (110)", "departments": ["College of William & Mary", "University of Salerno", "Free University of Bozen-Bolzano", "University of Molise", "University of Sannio"], "authors": ["Michele Tufano.....http://dblp.org/pers/hd/t/Tufano:Michele", "Fabio Palomba.....http://dblp.org/pers/hd/p/Palomba:Fabio", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Rocco Oliveto.....http://dblp.org/pers/hd/o/Oliveto:Rocco", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Andrea De Lucia.....http://dblp.org/pers/hd/l/Lucia:Andrea_De", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "conf": "icse", "year": "2015", "pages": 12}