{"title": "Tree dependence analysis.", "fields": ["divide and conquer algorithms", "data parallelism", "sentence", "recursion", "nested loop join", "tree", "circular dependency", "automatic parallelization", "tree traversal", "dependency", "exploit", "knowledge extraction", "dependency inversion principle", "dependence analysis", "phrase", "geometric data analysis", "recursive data type", "pointer", "task parallelism"], "abstract": "We develop a new framework for analyzing recursive methods that perform traversals over trees, called tree dependence analysis. This analysis translates dependence analysis techniques for regular programs to the irregular space, identifying the structure of dependences within a recursive method that traverses trees. We develop a dependence test that exploits the dependence structure of such programs, and can prove that several locality- and parallelism- enhancing transformations are legal. In addition, we extend our analysis with a novel path-dependent, conditional analysis to refine the dependence test and prove the legality of transformations for a wider range of algorithms. We then use these analyses to show that several common algorithms that manipulate trees recursively are amenable to several locality- and parallelism-enhancing transformations. This work shows that classical dependence analysis techniques, which have largely been confined to nested loops over array data structures, can be extended and translated to work for complex, recursive programs that operate over pointer-based data structures.", "citation": "Citations (5)", "departments": ["Purdue University", "Purdue University", "Purdue University", "Purdue University", "NEC", "Hokkaido University", "NEC", "NEC", "NEC", "University of Jena", "National Taiwan Ocean University"], "authors": ["Yusheng Weijiang.....http://dblp.org/pers/hd/w/Weijiang:Yusheng", "Shruthi Balakrishna.....http://dblp.org/pers/hd/b/Balakrishna:Shruthi", "Jianqiao Liu.....http://dblp.org/pers/hd/l/Liu:Jianqiao", "Milind Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni_0001:Milind"], "conf": "pldi", "year": "2015", "pages": 12}