{"title": "Learning Deep Features For MSR-bing Information Retrieval Challenge.", "fields": ["hierarchical clustering", "pagerank", "convolutional neural network", "ranking", "resizing"], "abstract": "Two tasks have been put forward in the MSR-bing Grand Challenge 2015. To address the information retrieval task, we raise and integrate a series of methods with visual features obtained by convolution neural network (CNN) models. In our experiments, we discover that the ranking strategies of Hierarchical clustering and PageRank methods are mutually complementary. Another task is fine-grained classification. In contrast to basic-level recognition, fine-grained classification aims to distinguish between different breeds or species or product models, and often requires distinctions that must be conditioned on the object pose for reliable identification. Current state-of-the-art techniques rely heavily upon the use of part annotations, while the bing datasets suffer both abundance of part annotations and dirty background. In this paper, we propose a CNN-based feature representation for visual recognition only using image-level information. Our CNN model is pre-trained on a collection of clean datasets and fine-tuned on the bing datasets. Furthermore, a multi-scale training strategy is adopted by simply resizing the input images into different scales and then merging the soft-max posteriors. We then implement our method into a unified visual recognition system on Microsoft cloud service. Finally, our solution achieved top performance in both tasks of the contest", "citation": "Citations (4)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Qiang Song.....http://dblp.org/pers/hd/s/Song:Qiang", "Sixie Yu.....http://dblp.org/pers/hd/y/Yu:Sixie", "Cong Leng.....http://dblp.org/pers/hd/l/Leng:Cong", "Jiaxiang Wu.....http://dblp.org/pers/hd/w/Wu:Jiaxiang", "Qinghao Hu.....http://dblp.org/pers/hd/h/Hu:Qinghao", "Jian Cheng.....http://dblp.org/pers/hd/c/Cheng_0001:Jian"], "conf": "mm", "year": "2015", "pages": 4}