{"title": "HTTP/2-Based Methods to Improve the Live Experience of Adaptive Streaming.", "fields": ["spdy", "quality of experience", "http 2", "push technology", "hypertext transfer protocol"], "abstract": "HTTP Adaptive Streaming (HAS) is today the number one video technology for over-the-top video distribution. In HAS, video content is temporally divided into multiple segments and encoded at different quality levels. A client selects and retrieves per segment the most suited quality version to create a seamless playout. Despite the ability of HAS to deal with changing network conditions, HAS-based live streaming often suffers from freezes in the playout due to buffer under-run, low average quality, large camera-to-display delay, and large initial/channel-change delay. Recently, IETF has standardized HTTP/2, a new version of the HTTP protocol that provides new features for reducing the page load time in Web browsing. In this paper, we present ten novel HTTP/2-based methods to improve the quality of experience of HAS. Our main contribution is the design and evaluation of a push-based approach for live streaming in which  super-short  segments are pushed from server to client as soon as they become available. We show that with an RTT of 300 ms, this approach can reduce the average server-to-display delay by 90.1% and the average start-up delay by 40.1%.", "citation": "Citations (16)", "departments": ["Bell Labs", "Ghent University", "Bell Labs", "Bell Labs", "Ghent University"], "authors": ["Rafael Huysegems.....http://dblp.org/pers/hd/h/Huysegems:Rafael", "Tom Bostoen.....http://dblp.org/pers/hd/b/Bostoen:Tom", "Patrice Rondao-Alface.....http://dblp.org/pers/hd/r/Rondao=Alface:Patrice", "Jeroen van der Hooft.....http://dblp.org/pers/hd/h/Hooft:Jeroen_van_der", "Stefano Petrangeli.....http://dblp.org/pers/hd/p/Petrangeli:Stefano", "Tim Wauters.....http://dblp.org/pers/hd/w/Wauters:Tim", "Filip De Turck.....http://dblp.org/pers/hd/t/Turck:Filip_De"], "conf": "mm", "year": "2015", "pages": 10}