{"title": "Strategy-Proofness of Scoring Allocation Correspondences for Indivisible Goods.", "fields": ["social choice theory", "power set", "ordinal number", "monotonic function", "if and only if"], "abstract": "We study resource allocation in a model due to Brams and King [2005] and further developed by Baumeister et al. [2014]. Resource allocation deals with the distribution of resources to agents. We assume resources to be indivisible, nonshareable, and of single-unit type. Agents have ordinal preferences over single resources. Using scoring vectors, every ordinal preference induces a utility function. These utility functions are used in conjunction with utilitarian social welfare to assess the quality of allocations of resources to agents. Then allocation correspondences determine the optimal allocations that maximize utilitarian social welfare.\n\nSince agents may have an incentive to misreport their true preferences, the question of strategyproofness is important to resource allocation. We assume that a manipulator has a strictly monotonic and strictly separable linear order on the power set of the resources. We use extension principles (from social choice theory, such as the Kelly and the Gardenfors extension) for preferences to study manipulation of allocation correspondences. We characterize strategy-proofness of the utilitarian allocation correspondence: It is Gardenfors/Kelly-strategy-proof if and only if the number of different values in the scoring vector is at most two or the number of occurrences of the greatest value in the scoring vector is larger than half the number of goods.", "citation": "Citations (5)", "departments": ["University of Düsseldorf", "University of Düsseldorf", "University of Düsseldorf"], "authors": ["Nhan-Tam Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Nhan=Tam", "Dorothea Baumeister.....http://dblp.org/pers/hd/b/Baumeister:Dorothea", "Jörg Rothe.....http://dblp.org/pers/hd/r/Rothe:J=ouml=rg"], "conf": "ijcai", "year": "2015", "pages": 7}