{"title": "Efficient secure similarity computation on encrypted trajectory data.", "fields": ["query optimization", "trajectory", "encryption", "scalability", "sql"], "abstract": "Outsourcing database to clouds is a scalable and cost-effective way for large scale data storage, management, and query processing. Trajectory data contain rich spatio-temporal relationships and reveal many forms of individual sensitive information (e.g., home address, health condition), which necessitate them to be encrypted before being outsourced for privacy concerns. However, efficient query processing over encrypted trajectory data is a very challenging task. Though some achievements have been reported very recently for simple queries (e.g., SQL queries, kNN queries) on encrypted data, there is rather limited progress on secure evaluation of trajectory queries because they are more complex and need special treatment. In this paper, we focus on secure trajectory similarity computation that is the cornerstone of secure trajectory query processing. More specifically, we propose an efficient solution to securely compute the similarity between two encrypted trajectories, which reveals nothing about the trajectories, but the final result. We theoretically prove that our solution is secure against the semi-honest adversaries model as all the intermediate information in our protocols can be simulated in polynomial time. Finally we empirically study the efficiency of the proposed method, which demonstrates the feasibility of our solution.", "citation": "Citations (30)", "departments": ["Soochow University", "University of Queensland", "University of Science and Technology of China", "Soochow University", "Soochow University"], "authors": ["An Liu.....http://dblp.org/pers/hd/l/Liu_0002:An", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Lu Li.....http://dblp.org/pers/hd/l/Li:Lu", "Guanfeng Liu.....http://dblp.org/pers/hd/l/Liu:Guanfeng", "Lei Zhao.....http://dblp.org/pers/hd/z/Zhao_0001:Lei", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "icde", "year": "2015", "pages": 12}