{"title": "Human Parsing with Contextualized Convolutional Neural Network.", "fields": ["categorization", "convolutional neural network", "parsing", "feature learning", "context model", "voting", "neighbourhood"], "abstract": "In this work, we address the human parsing task with a novel Contextualized Convolutional Neural Network (Co-CNN) architecture, which well integrates the cross-layer context, global image-level context, within-super-pixel context and cross-super-pixel neighborhood context into a unified network. Given an input human image, Co-CNN produces the pixel-wise categorization in an end-to-end way. First, the cross-layer context is captured by our basic local-to-global-to-local structure, which hierarchically combines the global semantic structure and the local fine details within the cross-layers. Second, the global image-level label prediction is used as an auxiliary objective in the intermediate layer of the Co-CNN, and its outputs are further used for guiding the feature learning in subsequent convolutional layers to leverage the global image-level context. Finally, to further utilize the local super-pixel contexts, the within-super-pixel smoothing and cross-super-pixel neighbourhood voting are formulated as natural sub-components of the Co-CNN to achieve the local label consistency in both training and testing process. Comprehensive evaluations on two public datasets well demonstrate the significant superiority of our Co-CNN architecture over other state-of-the-arts for human parsing. In particular, the F-1 score on the large dataset [15] reaches 76.95% by Co-CNN, significantly higher than 62.81% and 64.38% by the state-of-the-art algorithms, M-CNN [21] and ATR [15], respectively.", "citation": "Citations (81)", "year": "2015", "departments": ["Sun Yat-sen University", "National University of Singapore", "Adobe Systems", "Adobe Systems", "Sun Yat-sen University", "Huazhong University of Science and Technology", "Adobe Systems", "Adobe Systems", "Nanjing University of Science and Technology", "State Key Lab.  ...  Beijing, China"], "conf": "iccv", "authors": ["Xiaodan Liang.....http://dblp.org/pers/hd/l/Liang:Xiaodan", "Chunyan Xu.....http://dblp.org/pers/hd/x/Xu:Chunyan", "Xiaohui Shen.....http://dblp.org/pers/hd/s/Shen:Xiaohui", "Jianchao Yang.....http://dblp.org/pers/hd/y/Yang:Jianchao", "Si Liu.....http://dblp.org/pers/hd/l/Liu:Si", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "Liang Lin.....http://dblp.org/pers/hd/l/Lin:Liang", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "pages": 9}