{"title": "Adaptive data placement for staging-based coupled scientific workflows.", "fields": ["data sharing", "data analysis", "dynamic data", "staging area", "cray xk7"], "abstract": "Data staging and in-situ/in-transit data processing are emerging as attractive approaches for supporting extreme scale scientific workflows. These approaches improve end-to-end performance by enabling runtime data sharing between coupled simulations and data analytics components of the workflow. However, the complex and dynamic data exchange patterns exhibited by the workflows coupled with the varied data access behaviors make efficient data placement within the staging area challenging. In this paper, we present an adaptive data placement approach to address these challenges. Our approach adapts data placement based on application-specific dynamic data access patterns, and applies access pattern-driven and location-aware mechanisms to reduce data access costs and to support efficient data sharing between the multiple workflow components. We experimentally demonstrate the effectiveness of our approach on Titan Cray XK7 using a real combustion-analyses workflow. The evaluation results demonstrate that our approach can effectively improve data access performance and overall efficiency of coupled scientific workflows.", "citation": "Citations (6)", "year": "2015", "departments": ["Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University", "Rutgers University"], "conf": "sc", "authors": ["Qian Sun.....http://dblp.org/pers/hd/s/Sun:Qian", "Tong Jin.....http://dblp.org/pers/hd/j/Jin:Tong", "Melissa Romanus.....http://dblp.org/pers/hd/r/Romanus:Melissa", "Hoang Bui.....http://dblp.org/pers/hd/b/Bui:Hoang", "Fan Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Fan", "Hongfeng Yu.....http://dblp.org/pers/hd/y/Yu:Hongfeng", "Hemanth Kolla.....http://dblp.org/pers/hd/k/Kolla:Hemanth", "Scott Klasky.....http://dblp.org/pers/hd/k/Klasky:Scott", "Jacqueline Chen.....http://dblp.org/pers/hd/c/Chen:Jacqueline", "Manish Parashar.....http://dblp.org/pers/hd/p/Parashar:Manish"], "pages": 12}