{"title": "Online Learning to Rank for Content-Based Image Retrieval.", "fields": ["content based image retrieval", "learning to rank", "training set", "semantic gap", "image retrieval"], "abstract": "A major challenge in Content-Based Image Retrieval (CBIR) is to bridge the semantic gap between low-level image contents and high-level semantic concepts. Although researchers have investigated a variety of retrieval techniques using different types of features and distance functions, no single best retrieval solution can fully tackle this challenge. In a real-world CBIR task, it is often highly desired to combine multiple types of different feature representations and diverse distance measures in order to close the semantic gap. In this paper, we investigate a new framework of learning to rank for CBIR, which aims to seek the optimal combination of different retrieval schemes by learning from large-scale training data in CBIR. We first formulate the problem formally as a learning to rank task, which can be solved in general by applying the existing batch learning to rank algorithms from text information retrieval (IR). To further address the scalability towards large-scale online CBIR applications, we present a family of online learning to rank algorithms, which are significantly more efficient and scalable than classical batch algorithms for large-scale online CBIR. Finally, we conduct an extensive set of experiments, in which encouraging results show that our technique is effective, scalable and promising for large-scale CBIR.", "citation": "Citations (5)", "departments": ["Chinese Academy of Sciences", "Singapore Management University", "Singapore Management University", "Agency for Science, Technology and Research", "Chinese Academy of Sciences"], "authors": ["Ji Wan.....http://dblp.org/pers/hd/w/Wan:Ji", "Pengcheng Wu.....http://dblp.org/pers/hd/w/Wu:Pengcheng", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Peilin Zhao.....http://dblp.org/pers/hd/z/Zhao:Peilin", "Xingyu Gao.....http://dblp.org/pers/hd/g/Gao:Xingyu", "Dayong Wang.....http://dblp.org/pers/hd/w/Wang:Dayong", "Yongdong Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongdong", "Jintao Li.....http://dblp.org/pers/hd/l/Li:Jintao"], "conf": "ijcai", "year": "2015", "pages": 7}