{"title": "Cache-Efficient Aggregation: Hashing Is Sorting.", "fields": ["hash table", "dynamic perfect hashing", "external sorting", "universal hashing", "2 choice hashing"], "abstract": "For decades researchers have studied the duality of hashing and sorting for the implementation of the relational operators, especially for efficient aggregation. Depending on the underlying hardware and software architecture, the specifically implemented algorithms, and the data sets used in the experiments, different authors came to different conclusions about which is the better approach. In this paper we argue that in terms of cache efficiency, the two paradigms are actually the same. We support our claim by showing that the complexity of hashing is the same as the complexity of sorting in the external memory model. Furthermore we make the similarity of the two approaches obvious by designing an algorithmic framework that allows to switch seamlessly between hashing and sorting during execution. The fact that we mix hashing and sorting routines in the same algorithmic framework allows us to leverage the advantages of both approaches and makes their similarity obvious. On a more practical note, we also show how to achieve very low constant factors by tuning both the hashing and the sorting routines to modern hardware. Since we observe a complementary dependency of the constant factors of the two routines to the locality of the input, we exploit our framework to switch to the faster routine where appropriate. The result is a novel relational aggregation algorithm that is cache-efficient---independently and without prior knowledge of input skew and output cardinality---, highly parallelizable on modern multi-core systems, and operating at a speed close to the memory bandwidth, thus outperforming the state-of-the-art by up to 3.7x.", "citation": "Citations (9)", "year": "2015", "departments": ["Karlsruhe Institute of Technology", "Karlsruhe Institute of Technology", "Dresden University of Technology", "SAP SE, Walldorf, Germany", "SAP SE, Walldorf, Germany"], "conf": "sigmod", "authors": ["Ingo Müller.....http://dblp.org/pers/hd/m/M=uuml=ller_0002:Ingo", "Peter Sanders.....http://dblp.org/pers/hd/s/Sanders_0001:Peter", "Arnaud Lacurie.....http://dblp.org/pers/hd/l/Lacurie:Arnaud", "Wolfgang Lehner.....http://dblp.org/pers/hd/l/Lehner:Wolfgang", "Franz Färber.....http://dblp.org/pers/hd/f/F=auml=rber:Franz"], "pages": 14}