{"title": "A case for application-oblivious energy-efficient MPI runtime.", "fields": ["frequency scaling", "message passing interface", "exploit", "infiniband", "lever"], "abstract": "Power has become a major impediment in designing large scale high-end systems. Message Passing Interface (MPI) is the  de facto  communication interface used as the back-end for designing applications, programming models and runtime for these systems. Slack --- the time spent by an MPI process in a single MPI call---provides a potential for energy and power savings, if an appropriate power reduction technique such as core-idling/Dynamic Voltage and Frequency Scaling (DVFS) can be applied without affecting the application's performance. Existing techniques that exploit slack for power savings assume that application behavior repeats across iterations/executions. However, an increasing use of adaptive and data-dependent workloads combined with system factors (OS noise, congestion) negates this assumption. This paper proposes and implements Energy Aware MPI (EAM) --- an application-oblivious energy-efficient MPI runtime. EAM uses a combination of communication models for common MPI primitives (point-to-point, collective, progress, blocking/non-blocking) and an online observation of slack to maximize energy efficiency and to honor performance degradation limits. Each power lever incurs time overhead, which must be amortized over slack to minimize degradation. When predicted communication time exceeds a lever overhead, the lever is used  as soon as possible  --- to maximize energy efficiency. When a misprediction occurs, the lever(s) are used automatically at specific intervals for amortization. We implement EAM using MVAPICH2 and evaluate it on ten applications using up to 4,096 processes. Our performance evaluation on an InfiniBand cluster indicates that EAM can reduce energy consumption by 5-41% in comparison to the default approach, which prioritizes performance alone, with negligible (less than 4% in all cases) performance loss.", "citation": "Citations (8)", "year": "2015", "departments": ["Ohio State University", "Pacific Northwest National Laboratory", "Ohio State University", "Pacific Northwest National Laboratory", "Ohio State University"], "conf": "sc", "authors": ["Akshay Venkatesh.....http://dblp.org/pers/hd/v/Venkatesh:Akshay", "Abhinav Vishnu.....http://dblp.org/pers/hd/v/Vishnu:Abhinav", "Khaled Hamidouche.....http://dblp.org/pers/hd/h/Hamidouche:Khaled", "Nathan R. Tallent.....http://dblp.org/pers/hd/t/Tallent:Nathan_R=", "Dhabaleswar K. Panda.....http://dblp.org/pers/hd/p/Panda:Dhabaleswar_K=", "Darren J. Kerbyson.....http://dblp.org/pers/hd/k/Kerbyson:Darren_J=", "Adolfy Hoisie.....http://dblp.org/pers/hd/h/Hoisie:Adolfy"], "pages": 12}