{"title": "PGA: Using Graphs to Express and Automatically Reconcile Network Policies.", "fields": ["network management station", "enterprise private network", "intelligent computer network", "software defined networking", "network simulation"], "abstract": "Software Defined Networking (SDN) and cloud automation enable a large number of diverse parties (network operators, application admins, tenants/end-users) and control programs (SDN Apps, network services) to generate network policies independently and dynamically. Yet existing policy abstractions and frameworks do not support natural expression and automatic composition of high-level policies from diverse sources. We tackle the open problem of automatic, correct and fast composition of multiple independently specified network policies. We first develop a high-level Policy Graph Abstraction (PGA) that allows network policies to be expressed simply and independently, and leverage the graph structure to detect and resolve policy conflicts efficiently. Besides supporting ACL policies, PGA also models and composes service chaining policies, i.e., the sequence of middleboxes to be traversed, by merging multiple service chain requirements into conflict-free composed chains. Our system validation using a large enterprise network policy dataset demonstrates practical composition times even for very large inputs, with only sub-millisecond runtime latencies.", "citation": "Citations (99)", "departments": ["University of Wisconsin-Madison", "Hewlett-Packard", "Hewlett-Packard", "University of Wisconsin-Madison", "Banyan, San Francisco, CA, USA"], "authors": ["Chaithan Prakash.....http://dblp.org/pers/hd/p/Prakash:Chaithan", "Jeongkeun Lee.....http://dblp.org/pers/hd/l/Lee:Jeongkeun", "Yoshio Turner.....http://dblp.org/pers/hd/t/Turner:Yoshio", "Joon-Myung Kang.....http://dblp.org/pers/hd/k/Kang:Joon=Myung", "Aditya Akella.....http://dblp.org/pers/hd/a/Akella:Aditya", "Sujata Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Sujata", "Charles Clark.....http://dblp.org/pers/hd/c/Clark:Charles", "Yadi Ma.....http://dblp.org/pers/hd/m/Ma:Yadi", "Puneet Sharma.....http://dblp.org/pers/hd/s/Sharma:Puneet", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang:Ying"], "conf": "sigcomm", "year": "2015", "pages": 14}