{"title": "On the Structure, Covering, and Learning of Poisson Multinomial Distributions.", "fields": ["multivariate random variable", "poisson distribution", "binary logarithm", "total variation", "multinomial distribution"], "abstract": "An (n, k)-Poisson Multinomial Distribution (PMD) is the distribution of the sum of n independent random vectors supported on the set Bk={e1,, ek} of standard basis vectors in Rk. We prove a structural characterization of these distributions, showing that, for all a#x03B5; > 0, any (n, k)-Poisson multinomial random vector is a#x03B5;-close, in total variation distance, to the sum of a discretized multidimensional Gaussian and an independent (poly(k/a#x03B5;), k)-Poisson multinomial random vector. Our structural characterization extends the multi-dimensional CLT of Valiant and Valiant, by simultaneously applying to all approximation requirements a#x03B5;. In particular, it overcomes factors depending on log n and, importantly, the minimum Eigen value of the PMD's covariance matrix. We use our structural characterization to obtain an a#x03B5;-cover, in total variation distance, of the set of all (n, k)-PMDs, significantly improving the cover size of Daskalakis and Papadimitriou, and obtaining the same qualitative dependence of the cover size on n and a#x03B5; as the k=2 cover of Daskalakis and Papadimitriou. We further exploit this structure to show that (n, k)-PMDs can be learned to within a#x03B5; in total variation distance from Ok(1/a#x03B5;2) samples, which is near-optimal in terms of dependence on a#x03B5; and independent of n. In particular, our result generalizes the single-dimensional result of Daskalakis, Diakonikolas and Servedio for Poisson binomials to arbitrary dimension. Finally, as a corollary of our results on PMDs, we give a Ok(1/a#x03B5;2) sample algorithm for learning (n, k)-sums of independent integer random variables (SIIRVs), which is near-optimal for constant k.", "citation": "Citations (10)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Constantinos Daskalakis.....http://dblp.org/pers/hd/d/Daskalakis:Constantinos", "Gautam Kamath.....http://dblp.org/pers/hd/k/Kamath:Gautam", "Christos Tzamos.....http://dblp.org/pers/hd/t/Tzamos:Christos"], "conf": "focs", "year": "2015", "pages": 15}