{"title": "LiveTraj: Real-Time Trajectory Tracking over Live Video Streams.", "fields": ["internet access", "latency", "robotics", "video tracking", "tracking system"], "abstract": "We present LiveTraj, a novel system for tracking trajectories in a live video stream in real time, backed by a cloud platform. Although trajectory tracking is a well-studied topic in computer vision, so far most attention has been devoted to improving the accuracy of trajectory tracking, rather than the efficiency. To our knowledge, LiveTraj is the first that achieves real-time efficiency in trajectory tracking, which can be a key enabler in many important applications such as video surveillance, action recognition and robotics. LiveTraj is based on a state-of-the-art approach to (offline) trajectory tracking; its main innovation is to adapt this base solution to run on an elastic cloud platform to achieve real-time tracking speed at an affordable cost. The video demo shows the offline base solution and LiveTraj side by side, both running on a video stream containing human actions. Besides demonstrating the real-time efficiency of LiveTraj, our video demo also exhibits important system parameters to the audience such as latency and cloud resource usage for different components of the system. Further, if the conference venue provides sufficiently fast Internet connection to our cloud platform, we also plan to demonstrate LiveTraj on-site, during which we will show LiveTraj identifying and tracking trajectories from a live video stream captured by a camera.", "citation": "Citations (4)", "departments": ["National University of Singapore", "Khalifa University", "Advanced Digita ... pore, Singapore", "Advanced Digita ... pore, Singapore", "Advanced Digita ... pore, Singapore"], "authors": ["Tom Z. J. Fu.....http://dblp.org/pers/hd/f/Fu:Tom_Z=_J=", "Jianbing Ding.....http://dblp.org/pers/hd/d/Ding:Jianbing", "Richard T. B. Ma.....http://dblp.org/pers/hd/m/Ma:Richard_T=_B=", "Marianne Winslett.....http://dblp.org/pers/hd/w/Winslett:Marianne", "Yin Yang.....http://dblp.org/pers/hd/y/Yang:Yin", "Zhenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenjie", "Yong Pei.....http://dblp.org/pers/hd/p/Pei:Yong", "Bingbing Ni.....http://dblp.org/pers/hd/n/Ni:Bingbing"], "conf": "mm", "year": "2015", "pages": 4}