{"title": "Ad Injection at Scale: Assessing Deceptive Advertisement Modifications.", "fields": ["revenue", "internet security", "monetization", "small number", "syndicate"], "abstract": "Today, web injection manifests in many forms, but fundamentally occurs when malicious and unwanted actors tamper directly with browser sessions for their own profit. In this work we illuminate the scope and negative impact of one of these forms, ad injection, in which users have ads imposed on them in addition to, or different from, those that websites originally sent them. We develop a multi-staged pipeline that identifies ad injection in the wild and captures its distribution and revenue chains. We find that ad injection has entrenched itself as a cross-browser monetization platform impacting more than 5% of unique daily IP addresses accessing Google -- tens of millions of users around the globe. Injected ads arrive on a client's machine through multiple vectors: our measurements identify 50,870 Chrome extensions and 34,407 Windows binaries, 38% and 17% of which are explicitly malicious. A small number of software developers support the vast majority of these injectors who in turn syndicate from the larger ad ecosystem. We have contacted the Chrome Web Store and the advertisers targeted by ad injectors to alert each of the deceptive practices involved.", "citation": "Citations (58)", "departments": ["Google", "Google", "University of California, Berkeley", "University of California, Berkeley", "Google"], "authors": ["Kurt Thomas.....http://dblp.org/pers/hd/t/Thomas:Kurt", "Elie Bursztein.....http://dblp.org/pers/hd/b/Bursztein:Elie", "Chris Grier.....http://dblp.org/pers/hd/g/Grier:Chris", "Grant Ho.....http://dblp.org/pers/hd/h/Ho:Grant", "Nav Jagpal.....http://dblp.org/pers/hd/j/Jagpal:Nav", "Alexandros Kapravelos.....http://dblp.org/pers/hd/k/Kapravelos:Alexandros", "Damon McCoy.....http://dblp.org/pers/hd/m/McCoy:Damon", "Antonio Nappa.....http://dblp.org/pers/hd/n/Nappa:Antonio", "Vern Paxson.....http://dblp.org/pers/hd/p/Paxson:Vern", "Paul Pearce.....http://dblp.org/pers/hd/p/Pearce:Paul", "Niels Provos.....http://dblp.org/pers/hd/p/Provos:Niels", "Moheeb Abu Rajab.....http://dblp.org/pers/hd/r/Rajab:Moheeb_Abu"], "conf": "sp", "year": "2015", "pages": 17}