{"title": "Growing the charging station network for electric vehicles with trajectory data analytics.", "fields": ["charging station", "software deployment", "sustainable transport", "data analysis", "electric utility"], "abstract": "Electric vehicles (EVs) have undergone an explosive increase over recent years, due to the unparalleled advantages over gasoline cars in green transportation and cost efficiency. Such a drastic increase drives a growing need for widely deployed publicly accessible charging stations. Thus, how to strategically deploy the charging stations and charging points becomes an emerging and challenging question to urban planners and electric utility companies. In this paper, by analyzing a large scale electric taxi trajectory data, we make the first attempt to investigate this problem. We develop an optimal charging station deployment (OCSD) framework that takes the historical EV taxi trajectory data, road map data, and existing charging station information as input, and performs optimal charging station placement (OCSP) and optimal charging point assignment (OCPA). The OCSP and OCPA optimization components are designed to minimize the average time to the nearest charging station, and the average waiting time for an available charging point, respectively. To evaluate the performance of our OCSD framework, we conduct experiments on one-month real EV taxi trajectory data. The evaluation results demonstrate that our OCSD framework can achieve a 26%–94% reduction rate on average time to find a charging station, and up to two orders of magnitude reduction on waiting time before charging, over baseline methods. Moreover, our results reveal interesting insights in answering the question: “Super or small stations?”: When the number of deployable charging points is sufficiently large, more small stations are preferred; and when there are relatively few charging points to deploy, super stations is a wiser choice.", "citation": "Citations (24)", "departments": ["Huawei", "City University of Hong Kong", "City University of Hong Kong", "Hong Kong University of Science and Technology", "Shenzhen Instit ... ogy, CAS, China"], "authors": ["Yanhua Li.....http://dblp.org/pers/hd/l/Li:Yanhua", "Jun Luo.....http://dblp.org/pers/hd/l/Luo:Jun", "Chi-Yin Chow.....http://dblp.org/pers/hd/c/Chow:Chi=Yin", "Kam-Lam Chan.....http://dblp.org/pers/hd/c/Chan:Kam=Lam", "Ye Ding.....http://dblp.org/pers/hd/d/Ding:Ye", "Fan Zhang.....http://dblp.org/pers/hd/z/Zhang:Fan"], "conf": "icde", "year": "2015", "pages": 12}