{"title": "An elegant sufficiency: load-aware differentiated scheduling of data transfers.", "fields": ["job shop scheduling", "schedule", "gridftp", "file transfer", "slowdown"], "abstract": "We investigate the file transfer scheduling problem, where transfers among different endpoints must be scheduled to maximize pertinent metrics. We propose two new algorithms that exploit the fact that the aggregate bandwidth obtained over a network or at a storage system tends to increase with the number of concurrent transfers---but only up to a certain limit. The first algorithm, SEAL, uses runtime information and data-driven models to approximate system load and adapt transfer schedules and concurrency so as to maximize performance while avoiding saturation. We implement this algorithm using GridFTP as the transfer protocol and evaluate it using real transfer logs in a production WAN environment. Results show that SEAL can improve average slowdowns and turnaround times by up to 25% and worst-case slowdown and turnaround times by up to 50%, compared with the best-performing baseline scheme. Our second algorithm, STEAL, further leverages user-supplied categorization of transfers as either \"interactive\" (requiring immediate processing) or \"batch\" (less time-critical). Results show that STEAL reduces the average slowdown of interactive transfers by 63% compared to the best-performing baseline and by 21% compared to SEAL. For batch transfers, compared to the best-performing baseline, STEAL improves by 18% the utilization of the bandwidth unused by interactive transfers. By  elegantly  ensuring a  sufficient , but not excessive, allocation of concurrency to the right transfers, we significantly improve overall performance despite constraints.", "citation": "Citations (8)", "year": "2015", "departments": ["Argonne National Laboratory", "University of Massachusetts Amherst", "Ohio State University", "Ohio State University", "Argonne National Laboratory"], "conf": "sc", "authors": ["Rajkumar Kettimuthu.....http://dblp.org/pers/hd/k/Kettimuthu:Rajkumar", "Gayane Vardoyan.....http://dblp.org/pers/hd/v/Vardoyan:Gayane", "Gagan Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Gagan", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P=", "Ian T. Foster.....http://dblp.org/pers/hd/f/Foster:Ian_T="], "pages": 12}