{"title": "ITSEC: An information-theoretically secure framework for truthful spectrum auctions.", "fields": ["common value auction", "itsec", "secret sharing", "spectrum auction", "information leakage"], "abstract": "Truthful auctions make bidders reveal their true valuations for goods to maximize their utilities. Currently, almost all spectrum auction designs are required to be truthful. However, disclosure of one's true value causes numerous security vulnerabilities. Secure spectrum auctions are thus called for to address such information leakage. Previous secure auctions either did not achieve enough security, or were very slow due to heavy computation and communication overhead. In this paper, inspired by the idea of secret sharing, we design an information-theoretically secure framework (ITSEC) for truthful spectrum auctions. As a distinguished feature, ITSEC not only achieves information-theoretic security for spectrum auction protocols in the sense of cryptography, but also greatly reduces both computation and communication overhead by ensuring security without using any encryption/description algorithm. To our knowledge, ITSEC is the first information-theoretically secure framework for truthful spectrum auctions in the presence of semi-honest adversaries. We also design and implement circuits for both single-sided and double spectrum auctions under the ITSEC framework. Extensive experimental results demonstrate that ITSEC achieves comparable performance in terms of computation with respect to spectrum auction mechanisms without any security measure, and incurs only limited communication overhead.", "citation": "Citations (6)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "Centre national de la recherche scientifique"], "authors": ["Zhili Chen.....http://dblp.org/pers/hd/c/Chen:Zhili", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng", "Lin Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lin"], "conf": "infocom", "year": "2015", "pages": 9}