{"title": "Efficient MRC Construction with SHARDS.", "fields": ["analytics", "bounded function", "firmware", "locality of reference", "sampling"], "abstract": "Reuse-distance analysis is a powerful technique for characterizing temporal locality of workloads, often visualized with miss ratio curves (MRCs). Unfortunately, even the most efficient exact implementations are too heavyweight for practical online use in production systems.\n\nWe introduce a new approximation algorithm that employs uniform randomized spatial sampling, implemented by tracking references to representative locations selected dynamically based on their hash values. A further refinement runs in constant space by lowering the sampling rate adaptively. Our approach, called SHARDS (Spatially Hashed Approximate Reuse Distance Sampling), drastically reduces the space and time requirements of reuse-distance analysis, making continuous, online MRC generation practical to embed into production firmware or system software. SHARDS also enables the analysis of long traces that, due to memory constraints, were resistant to such analysis in the past.\n\nWe evaluate SHARDS using trace data collected from a commercial I/O caching analytics service. MRCs generated for more than a hundred traces demonstrate high accuracy with very low resource usage. MRCs constructed in a bounded 1 MB footprint, with effective sampling rates significantly lower than 1%, exhibit approximate miss ratio errors averaging less than 0.01. For large traces, this configuration reduces memory usage by a factor of up to 10,800 and run time by a factor of up to 204.", "citation": "Citations (26)", "departments": ["CloudPhysics, Inc.", "CloudPhysics, Inc.", "CloudPhysics, Inc.", "CloudPhysics, Inc."], "authors": ["Carl A. Waldspurger.....http://dblp.org/pers/hd/w/Waldspurger:Carl_A=", "Nohhyun Park.....http://dblp.org/pers/hd/p/Park:Nohhyun", "Alexander T. Garthwaite.....http://dblp.org/pers/hd/g/Garthwaite:Alexander_T=", "Irfan Ahmad.....http://dblp.org/pers/hd/a/Ahmad:Irfan"], "conf": "fast", "year": "2015", "pages": 16}