{"title": "A Unifying Hierarchy of Valuations with Complements and Substitutes.", "fields": ["set function", "monotonic function", "submodular set function", "hierarchy", "mathematical economics", "price of anarchy", "mathematics", "valuation", "monotone polygon"], "abstract": "We introduce a new hierarchy over monotone set functions, that we refer to as MPH (Maximum over Positive Hyper-graphs). Levels of the hierarchy correspond to the degree of complementarity in a given function. The highest level of the hierarchy, MPH-m (where m is the total number of items) captures all monotone functions. The lowest level, MPH-1, captures all monotone submodular functions, and more generally, the class of functions known as XOS. Every monotone function that has a positive hypergraph representation of rank κ (in the sense defined by Abraham, Babaioff, Dughmi and Roughgarden [EC 2012]) is in MPH-κ. Every monotone function that has supermodular degree κ (in the sense defined by Feige and Izsak [ITCS 2013]) is in MPH-(κ+1). In both cases, the converse direction does not hold, even in an approximate sense. We present additional results that demonstrate the expressiveness power of MPH-κ.\n\nOne can obtain good approximation ratios for some natural optimization problems, provided that functions are required to lie in low levels of the MPH hierarchy. We present two such applications. One shows that the maximum welfare problem can be approximated within a ratio of κ + 1 if all players hold valuation functions in MPH-κ. The other is an upper bound of 2κ on the price of anarchy of simultaneous first price auctions.", "citation": "Citations (18)", "departments": ["Weizmann Institute of Science", "Tel Aviv University", "Microsoft", "Weizmann Institute of Science", "Microsoft"], "authors": ["Uriel Feige.....http://dblp.org/pers/hd/f/Feige:Uriel", "Michal Feldman.....http://dblp.org/pers/hd/f/Feldman:Michal", "Nicole Immorlica.....http://dblp.org/pers/hd/i/Immorlica:Nicole", "Rani Izsak.....http://dblp.org/pers/hd/i/Izsak:Rani", "Brendan Lucier.....http://dblp.org/pers/hd/l/Lucier:Brendan", "Vasilis Syrgkanis.....http://dblp.org/pers/hd/s/Syrgkanis:Vasilis"], "conf": "aaai", "year": "2015", "pages": 7}