{"title": "Virus Propagation in Multiple Profile Networks.", "fields": ["steady state", "intuition", "machine learning", "distributed computing", "simulation"], "abstract": "Suppose we have a virus or one competing idea/product that propagates over a multiple profile (e.g., social) network. Can we predict what proportion of the network will actually get \"infected\" (e.g., spread the idea or buy the competing product), when the nodes of the network appear to have different sensitivity based on their profile? For example, if there are two profiles  A  and  B  in a network and the nodes of profile  A  and profile  B  are susceptible to a highly spreading virus with probabilities β  A   and β  B   respectively, what percentage of both profiles will actually get infected from the virus at the end? To reverse the question, what are the necessary conditions so that a predefined percentage of the network is infected? We assume that nodes of different profiles can infect one another and we prove that under realistic conditions, apart from the weak profile (great sensitivity), the stronger profile (low sensitivity) will get infected as well. First, we focus on cliques with the goal to provide exact theoretical results as well as to get some intuition as to how a virus affects such a multiple profile network. Then, we move to the theoretical analysis of arbitrary networks. We provide bounds on certain properties of the network based on the probabilities of infection of each node in it when it reaches the steady state. Finally, we provide extensive experimental results that verify our theoretical results and at the same time provide more insight on the problem.", "citation": "Citations (2)", "departments": ["University of Patras", "Ionian University", "Aristotle University of Thessaloniki", "American Hotel & Lodging Educational Institute"], "authors": ["Angeliki Rapti.....http://dblp.org/pers/hd/r/Rapti:Angeliki", "Spyros Sioutas.....http://dblp.org/pers/hd/s/Sioutas:Spyros", "Kostas Tsichlas.....http://dblp.org/pers/hd/t/Tsichlas:Kostas", "Giannis Tzimas.....http://dblp.org/pers/hd/t/Tzimas:Giannis"], "conf": "kdd", "year": "2015", "pages": 10}