{"title": "Minimizing Efforts in Validating Crowd Answers.", "fields": ["crowdsourcing", "management science", "data mining", "correctness", "web application"], "abstract": "In recent years, crowdsourcing has become essential in a wide range of Web applications. One of the biggest challenges of crowdsourcing is the quality of crowd answers as workers have wide-ranging levels of expertise and the worker community may contain faulty workers. Although various techniques for quality control have been proposed, a post-processing phase in which crowd answers are validated is still required. Validation is typically conducted by experts, whose availability is limited and who incur high costs. Therefore, we develop a probabilistic model that helps to identify the most beneficial validation questions in terms of both, improvement of result correctness and detection of faulty workers. Our approach allows us to guide the expert's work by collecting input on the most problematic cases, thereby achieving a set of high quality answers even if the expert does not validate the complete answer set. Our comprehensive evaluation using both real-world and synthetic datasets demonstrates that our techniques save up to 50% of expert efforts compared to baseline methods when striving for perfect result correctness. In absolute terms, for most cases, we achieve close to perfect correctness after expert input has been sought for only 20\\% of the questions.", "citation": "Citations (55)", "year": "2015", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Imperial College London", "École Polytechnique Fédérale de Lausanne"], "conf": "sigmod", "authors": ["Nguyen Quoc Viet Hung.....http://dblp.org/pers/hd/h/Hung:Nguyen_Quoc_Viet", "Duong Chi Thang.....http://dblp.org/pers/hd/t/Thang:Duong_Chi", "Matthias Weidlich.....http://dblp.org/pers/hd/w/Weidlich:Matthias", "Karl Aberer.....http://dblp.org/pers/hd/a/Aberer:Karl"], "pages": 16}