{"title": "Quantum Information Complexity.", "fields": ["schmidt decomposition", "polyhedron", "planar graph", "no teleportation theorem", "quantum capacity", "communication complexity", "quantum", "quantum network", "quantum state", "open quantum system", "quantum teleportation", "ranging", "quantum process", "quantum information science", "teleportation", "quantum nonlocality", "quantum channel", "uniform k 21 polytope", "quantum convolutional code", "polytope", "quantum complexity theory", "bell s theorem", "birkhoff polytope", "quantum technology", "arbitrarily large", "no communication theorem"], "abstract": "Quantum information processing is the emerging field that defines and realizes computing devices that make use of quantum mechanical principles, like the superposition principle, entanglement, and interference. Until recently the common notion of computing was based on classical mechanics, and did not take into account all the possibilities that physically-realizable computing devices offer in principle. The field gained momentum after Peter Shor developed an efficient algorithm for factoring numbers, demonstrating the potential computing powers that quantum computing devices can unleash. In this review we study the information counterpart of computing. It was realized early on by Holevo, that quantum bits, the quantum mechanical counterpart of classical bits, cannot be used for efficient transformation of information, in the sense that arbitrary k-bit messages can not be compressed into messages of k − 1 qubits. The abstract form of the distributed computing setting is called communication complexity. It studies the amount of information, in terms of bits or in our case qubits, that two spatially separated computing devices need to exchange in order to perform some computational task. Surprisingly, quantum mechanics can be used to obtain dramatic advantages for such tasks. We review the area of quantum communication complexity, and show how it connects the foundational physics questions regarding non-locality with those of communication complexity studied in theoretical computer science. The first examples exhibiting the advantage of the use of qubits in distributed information-processing tasks were based on non-locality tests. However, by now the field has produced strong and interesting quantum protocols and algorithms of its own that demonstrate that entanglement, although it cannot be used to replace communication, can be used to reduce the communication exponentially. In turn, these new advances yield a new outlook on the foundations of physics, and could even yield new proposals for experiments that test the foundations of physics.", "citation": "Citations (322)", "year": "2015", "departments": ["Centrum Wiskunde & Informatica", "Perimeter Institute for Theoretical Physics", "Université libre de Bruxelles", "Centrum Wiskunde & Informatica", "MagiQ Technologies, Inc.", "Weizmann Institute of Science", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of Amsterdam", "Centrum Wiskunde & Informatica", "Adam Mickiewicz University in Poznań", "Adam Mickiewicz University in Poznań", "Adam Mickiewicz University in Poznań", "Gdańsk University of Technology", "University of Calgary", "University of Oxford", "Los Alamos National Laboratory", "Université de Montréal", "McGill University", "Université libre de Bruxelles", "dFaculty of Mat ... Gdańsk, Poland;"], "conf": "stoc", "authors": ["Dave Touchette.....http://dblp.org/pers/hd/t/Touchette:Dave"], "pages": 10}