{"title": "GEARSHIFT: Guaranteeing availability requirements in SLAs using hybrid fault tolerance.", "fields": ["backbone network", "gear ratio", "cost efficiency", "dependability", "total cost"], "abstract": "The dependability of ICT systems is vital for today's society. However, operational systems are not fault free. Providers and customers have to define clear availability requirements and penalties on the delivered services by using SLAs. Fulfilling the stipulated availability may be expensive. The lack of mechanisms that allow a fine control of the SLA risk may lead to over-dimension the provided resources. Therefore, a relevant question for ICT service providers is: How to guarantee the SLA availability in a cost efficient way? This paper studies how to combine different fault tolerant techniques with different costs and properties, in order to economically fulfill a given SLA requirement. GEARSHIFT is a mechanism that enables ICT providers to set the fault tolerance technique (gear ratio) needed, depending on the current service conditions and requirements. We illustrate how to use the proposed model in a backbone network scenario, using measurements from a production national network. Finally, we show that the total costs of delivering an ICT service follow a simple convex function, which allows an easy selection of the optimal risk by tuning properly the combination of fault tolerant techniques.", "citation": "Citations (4)", "departments": ["Telenor", "Norwegian University of Science and Technology", "Norwegian University of Science and Technology", "Norwegian University of Science and Technology", "Uninett"], "authors": ["Andrés J. Gonzalez.....http://dblp.org/pers/hd/g/Gonzalez:Andr=eacute=s_J=", "Bjarne E. Helvik.....http://dblp.org/pers/hd/h/Helvik:Bjarne_E=", "Prakriti Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Prakriti", "Denis M. Becker.....http://dblp.org/pers/hd/b/Becker:Denis_M=", "Otto Wittner.....http://dblp.org/pers/hd/w/Wittner:Otto"], "conf": "infocom", "year": "2015", "pages": 9}