{"title": "Ultrasonic intra-body networking: Interference modeling, stochastic channel access and rate control.", "fields": ["channel state information", "distributed algorithm", "throughput", "asynchronous communication", "ultrasonic sensor"], "abstract": "We consider the problem of designing optimal network control algorithms for distributed networked systems of implantable medical devices wirelessly interconnected by means of ultrasonic waves, which are known to propagate better than radio-frequency electromagnetic waves in aqueous media such as human tissues. Specifically, we propose lightweight, asynchronous, and distributed algorithms for joint rate control and stochastic channel access designed to maximize the throughput of ultrasonic intra-body area networks under energy constraints. We first develop (and validate through testbed experiments) a statistical model of the ultrasonic channel and of the spatial and temporal variability of ultrasonic interference. Compared to in-air radio frequency (RF), human tissues show a much lower propagation speed, which further causes unaligned interference at the receiver. It is therefore inefficient to perform adaptation based on instantaneous channel state information (CSI). Based on this model, we formulate the problem of maximizing the network throughput by jointly controlling the transmission rate and the channel access probability over a finite time horizon based only on a statistical characterization of interference. We then propose a fully distributed solution algorithm, and through both simulation and testbed results, we show that the algorithm achieves considerable throughput gains compared with traditional algorithms.", "citation": "Citations (3)", "departments": ["Northeastern University", "Northeastern University", "Northeastern University"], "authors": ["Zhangyu Guan.....http://dblp.org/pers/hd/g/Guan:Zhangyu", "Giuseppe Enrico Santagati.....http://dblp.org/pers/hd/s/Santagati:Giuseppe_Enrico", "Tommaso Melodia.....http://dblp.org/pers/hd/m/Melodia:Tommaso"], "conf": "infocom", "year": "2015", "pages": 9}