{"title": "Efficient Algorithms for Answering the m-Closest Keywords Query.", "fields": ["query optimization", "web resource", "exact algorithm", "sargable", "order of magnitude"], "abstract": "As an important type of spatial keyword query, the  m -closest keywords ( m CK) query finds a group of objects such that they cover all query keywords and have the smallest diameter, which is defined as the largest distance between any pair of objects in the group. The query is useful in many applications such as detecting locations of web resources. However, the existing work does not study the intractability of this problem and only provides exact algorithms, which are computationally expensive.   In this paper, we prove that the problem of answering  m CK queries is NP-hard. We first devise a greedy algorithm that has an approximation ratio of 2. Then, we observe that an  m CK query can be approximately answered by finding the circle with the smallest diameter that encloses a group of objects together covering all query keywords. We prove that the group enclosed in the circle can answer the  m CK query with an approximation ratio of 2 over 3. Based on this, we develop an algorithm for finding such a circle exactly, which has a high time complexity. To improve efficiency, we propose another two algorithms that find such a circle approximately, with a ratio of 2 over √3 + e. Finally, we propose an exact algorithm that utilizes the group found by the 2 over √3 + e)-approximation algorithm to obtain the optimal group. We conduct extensive experiments using real-life datasets. The experimental results offer insights into both efficiency and accuracy of the proposed approximation algorithms, and the results also demonstrate that our exact algorithm outperforms the best known algorithm by an order of magnitude.", "citation": "Citations (26)", "year": "2015", "departments": ["Nanyang Technological University", "Queen's University Belfast", "Nanyang Technological University"], "conf": "sigmod", "authors": ["Tao Guo.....http://dblp.org/pers/hd/g/Guo:Tao", "Xin Cao.....http://dblp.org/pers/hd/c/Cao:Xin", "Gao Cong.....http://dblp.org/pers/hd/c/Cong:Gao"], "pages": 14}