{"title": "FloSIS: A Highly Scalable Network Flow Capture System for Fast Retrieval and Storage Efficiency.", "fields": ["packet processing", "packet analyzer", "network packet", "network management", "data deduplication"], "abstract": "Network packet capture performs essential functions in network management such as attack analysis, network troubleshooting, and performance debugging. As the network edge bandwidth exceeds 10 Gbps, the demand for scalable packet capture and retrieval is rapidly increasing. However, existing software-based packet capture systems neither provide high performance nor support flow-level indexing for fast query response. This would either prevent important packets from being stored or make it too slow to retrieve relevant flows.\n\nIn this paper, we present FloSIS, a highly scalable, software-based flow storing and indexing system. Flo-SIS is characterized as the following three aspects. First, it exercises full parallelism in multiple CPU cores and disks at all stages of packet processing. Second, it constructs two-stage flow-level indexes, which helps minimize expensive disk access for user queries. It also stores the packets in the same flow at a contiguous disk location, which maximizes disk read throughput. Third, we optimize storage usage by flow-level content deduplication at real time. Our evaluation shows that FloSIS on a dual octa-core CPU machine with 24 HDDs achieves 30 Gbps of zero-drop performance with real traffic, consuming only 0.25% of the space for indexing.", "citation": "Citations (4)", "departments": ["KAIST", "Electronics and Telecommunications Research Institute", "Electronics and Telecommunications Research Institute", "KAIST", "KAIST"], "authors": ["Jihyung Lee.....http://dblp.org/pers/hd/l/Lee:Jihyung", "Sungryoul Lee.....http://dblp.org/pers/hd/l/Lee:Sungryoul", "Junghee Lee.....http://dblp.org/pers/hd/l/Lee:Junghee", "Yung Yi.....http://dblp.org/pers/hd/y/Yi:Yung", "KyoungSoo Park.....http://dblp.org/pers/hd/p/Park:KyoungSoo"], "conf": "usenix", "year": "2015", "pages": 13}