{"title": "An Efficient and Scalable MetaFeature-based Document Classification Approach based on Massively Parallel Computing.", "fields": ["recommender system", "sentiment analysis", "massively parallel", "speedup", "document classification"], "abstract": "The unprecedented growth of available data nowadays has stimulated the development of new methods for organizing and extracting useful knowledge from this immense amount of data. Automatic Document Classification (ADC) is one of such methods, that uses machine learning techniques to build models capable of automatically associating documents to well-defined semantic classes. ADC is the basis of many important applications such as language identification, sentiment analysis, recommender systems, spam filtering, among others. Recently, the use of meta-features has been shown to substantially improve the effectiveness of ADC algorithms. In particular, the use of meta-features that make a combined use of local information (through kNN-based features) and global information (through category centroids) has produced promising results. However, the generation of these meta-features is very costly in terms of both, memory consumption and runtime since there is the need to constantly call the kNN algorithm. We take advantage of the current manycore GPU architecture and present a massively parallel version of the kNN algorithm for highly dimensional and sparse datasets (which is the case for ADC). Our experimental results show that we can obtain speedup gains of up to 15x while reducing memory consumption in more than 5000x when compared to a state-of-the-art parallel baseline. This opens up the possibility of applying meta-features based classification in large collections of documents, that would otherwise take too much time or require the use of an expensive computational platform.", "citation": "Citations (3)", "departments": ["Universidade Federal de Minas Gerais", "Universidade Federal de Minas Gerais", "Universidade Federal de Goiás", "Universidade Federal de Goiás", "Universidade Federal de Goiás"], "authors": ["Sérgio D. Canuto.....http://dblp.org/pers/hd/c/Canuto:S=eacute=rgio_D=", "Marcos André Gonçalves.....http://dblp.org/pers/hd/g/Gon=ccedil=alves:Marcos_Andr=eacute=", "Wisllay M. V. dos Santos.....http://dblp.org/pers/hd/s/Santos:Wisllay_M=_V=_dos", "Thierson Couto Rosa.....http://dblp.org/pers/hd/r/Rosa:Thierson_Couto", "Wellington Martins.....http://dblp.org/pers/hd/m/Martins:Wellington"], "conf": "sigir", "year": "2015", "pages": 10}