{"title": "GPU voltage noise: Characterization and hierarchical smoothing of spatial and temporal voltage noise interference in GPU architectures.", "fields": ["cpu core voltage", "smoothing", "voltage droop", "phenomenon", "central processing unit"], "abstract": "Energy efficiency is undoubtedly important for GPU architectures. Besides the traditionally explored energy-efficiency optimization techniques, exploiting the supply voltage guard-band remains a promising yet unexplored opportunity. Our hardware measurements show that up to 23% of the nominal supply voltage can be eliminated to improve CPU energy efficiency by as much as 25%. The key obstacle for exploiting this opportunity lies in understanding the characteristics and root causes of large voltage droops in GPU architectures and subsequently smoothing them away without severe performance penalties. The CPU's manycore nature complicates the voltage noise phenomenon, and its distinctive architecture features from the CPU necessitate a CPU-specific voltage noise analysis. In this paper, we make the following contributions. First, we provide a voltage noise categorization framework to identify, characterize, and understand voltage noise in the manycore CPU architecture. Second, we perform a microarchitecture-level voltage-droop root-cause analysis for the two major droop types we identify, namely the local first-order droop and the global second-order droop. Third, on the basis of our categorization and characterization, we propose a hierarchical voltage smoothing mechanism that mitigates each type of voltage droop. Our evaluation shows it can reduce up to 31% worst-case droop, which translates to 11.8% core-level and 7.8% processor-level energy reduction.", "citation": "Citations (9)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Jingwen Leng.....http://dblp.org/pers/hd/l/Leng:Jingwen", "Yazhou Zu.....http://dblp.org/pers/hd/z/Zu:Yazhou", "Vijay Janapa Reddi.....http://dblp.org/pers/hd/r/Reddi:Vijay_Janapa"], "conf": "hpca", "year": "2015", "pages": 13}