{"title": "Be responsible: A novel communications scheme for full-duplex MIMO radios.", "fields": ["duplex", "spectral efficiency", "beamforming", "mimo", "network layer"], "abstract": "Full-duplex (FD) radios have the potential to double a link's capacity. However, it has been recently reported that the network throughput gain of FD radios over half-duplex (HD) ones is unexpectedly marginal or even negative. This is because both ends of each link transmit at the same time, a set of concurrent FD links will experience more network interference (hence, reduction in the spatial reuse). This article identifies the unique advantages of FD radios and leverage multi-input multioutput (MIMO) communications to translate the FD spectral efficiency gain at the PHY level to throughput and power efficiency gain at the network layer. To that end, we first study the power minimization problem subject to rate demands in a FD-MIMO network. Sufficient conditions under which the FD network throughput can asymptotically double that of an HD network are then established. These conditions also guarantee the existence of a unique Nash Equilibrium that the game quickly converges to. By capturing “spatial signatures” of other radios, a FD-MIMO radio can instantly adjust its ongoing radiation pattern to avoid interfering with the reception directions at other radios. We exploit that to develop a novel MAC protocol that allows multiple FD links to concurrently communicate while adapting their radiation patterns to minimize network interference. The protocol does not require any feedback or coordination among nodes, but relies on the network interference perceived by these FD radios. Extensive simulations show that the proposed MAC design dramatically outperforms traditional FD-based CSMA protocols and HD radios w.r.t. both throughput and energy efficiency. A centralized algorithm for the FD network-wide transmit power minimization problem is also developed. Simulations show that, the proposed MAC protocol on average achieves almost the same power efficiency as the centralized algorithm. Interestingly, we even observe cases when the proposed distributed algorithm outperforms the centralized approach.", "citation": "Citations (5)", "departments": ["Macquarie University", "University of Arizona"], "authors": ["Diep N. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Diep_N=", "Marwan Krunz.....http://dblp.org/pers/hd/k/Krunz:Marwan"], "conf": "infocom", "year": "2015", "pages": 9}