{"title": "PLUTO+: near-complete modeling of affine transformations for parallelism and locality.", "fields": ["for loop", "periodic boundary conditions", "polytope model", "combinatorial explosion", "automatic parallelization"], "abstract": "Affine transformations have proven to be very powerful for loop restructuring due to their ability to model a very wide range of transformations. A single multi-dimensional affine function can represent a long and complex sequence of simpler transformations. Existing affine transformation frameworks like the Pluto algorithm, that include a cost function for modern multicore architectures where coarse-grained parallelism and locality are crucial, consider only a sub-space of transformations to avoid a combinatorial explosion in finding the transformations. The ensuing practical trade-offs lead to the exclusion of certain useful transformations, in particular, transformation compositions involving loop reversals and loop skewing by negative factors. In this paper, we propose an approach to address this limitation by modeling a much larger space of affine transformations in conjunction with the Pluto algorithm's cost function. We perform an experimental evaluation of both, the effect on compilation time, and performance of generated codes. The evaluation shows that our new framework, Pluto+, provides no degradation in performance in any of the Polybench benchmarks. For Lattice Boltzmann Method (LBM) codes with periodic boundary conditions, it provides a mean speedup of 1.33x over Pluto. We also show that Pluto+ does not increase compile times significantly. Experimental results on Polybench show that Pluto+ increases overall polyhedral source-to-source optimization time only by 15%. In cases where it improves execution time significantly, it increased polyhedral optimization time only by 2.04x.", "citation": "Citations (11)", "year": "2015", "departments": ["Indian Institute of Science", "Indian Institute of Science"], "conf": "ppopp", "authors": ["Aravind Acharya.....http://dblp.org/pers/hd/a/Acharya:Aravind", "Uday Bondhugula.....http://dblp.org/pers/hd/b/Bondhugula:Uday"], "pages": 11}