{"title": "Implicit Parallelism through Deep Language Embedding.", "fields": ["dataflow", "programmer", "scala", "control flow", "implicit parallelism"], "abstract": "The appeal of MapReduce has spawned a family of systems that implement or extend it. In order to enable parallel collection processing with User-Defined Functions (UDFs), these systems expose extensions of the MapReduce programming model as library-based dataflow APIs that are tightly coupled to their underlying runtime engine. Expressing data analysis algorithms with complex data and control flow structure using such APIs reveals a number of limitations that impede programmer's productivity.   In this paper we show that the design of data analysis languages and APIs from a runtime engine point of view bloats the APIs with low-level primitives and affects programmer's productivity. Instead, we argue that an approach based on  deeply embedding  the APIs in a host language can address the shortcomings of current data analysis languages. To demonstrate this, we propose a language for complex data analysis embedded in Scala, which ( i ) allows for declarative specification of dataflows and ( ii ) hides the notion of data-parallelism and distributed runtime behind a suitable intermediate representation. We describe a compiler pipeline that facilitates efficient data-parallel processing without imposing runtime engine-bound syntactic or semantic restrictions on the structure of the input programs. We present a series of experiments with two state-of-the-art systems that demonstrate the optimization potential of our approach.", "citation": "Citations (29)", "year": "2015", "departments": ["Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin"], "conf": "sigmod", "authors": ["Alexander Alexandrov.....http://dblp.org/pers/hd/a/Alexandrov_0001:Alexander", "Andreas Kunft.....http://dblp.org/pers/hd/k/Kunft:Andreas", "Asterios Katsifodimos.....http://dblp.org/pers/hd/k/Katsifodimos:Asterios", "Felix Schüler.....http://dblp.org/pers/hd/s/Sch=uuml=ler:Felix", "Lauritz Thamsen.....http://dblp.org/pers/hd/t/Thamsen:Lauritz", "Odej Kao.....http://dblp.org/pers/hd/k/Kao:Odej", "Tobias Herb.....http://dblp.org/pers/hd/h/Herb:Tobias", "Volker Markl.....http://dblp.org/pers/hd/m/Markl:Volker"], "pages": 15}