{"title": "HydraDB: a resilient RDMA-driven key-value middleware for in-memory cluster computing.", "fields": ["analytics", "exploit", "remote direct memory access", "data manipulation language", "computer cluster"], "abstract": "In this paper, we describe our experiences and lessons learned from building a general-purpose in-memory key-value middleware, called HydraDB. HydraDB synthesizes a collection of state-of-the-art techniques, including continuous fault-tolerance, Remote Direct Memory Access (RDMA), as well as awareness for multicore systems,  etc , to deliver a high-throughput, low-latency access service in a reliable manner for cluster computing applications. The uniqueness of HydraDB mainly lies in its design commitment to fully exploit the RDMA protocol to comprehensively optimize various aspects of a general-purpose key-value store, including latency-critical operations, read enhancement, and data replications for high-availability service,  etc.  At the same time, HydraDB strives to efficiently utilize multicore systems to prevent data manipulation on the servers from curbing the potential of RDMA. Many teams in our organization have adopted HydraDB to improve the execution of their cluster computing frameworks, including Hadoop, Spark, Sensemaking analytics, and Call Record Processing. In addition, our performance evaluation with a variety of YCSB workloads also shows that HydraDB can substantially outperform several existing in-memory key-value stores by an order of magnitude. Our detailed performance evaluation further corroborates our design choices.", "citation": "Citations (15)", "year": "2015", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "sc", "authors": ["Yandong Wang.....http://dblp.org/pers/hd/w/Wang:Yandong", "Li Zhang.....http://dblp.org/pers/hd/z/Zhang:Li", "Jian Tan.....http://dblp.org/pers/hd/t/Tan:Jian", "Min Li.....http://dblp.org/pers/hd/l/Li:Min", "Yuqing Gao.....http://dblp.org/pers/hd/g/Gao:Yuqing", "Xavier Guerin.....http://dblp.org/pers/hd/g/Guerin:Xavier", "Xiaoqiao Meng.....http://dblp.org/pers/hd/m/Meng:Xiaoqiao", "Shicong Meng.....http://dblp.org/pers/hd/m/Meng:Shicong"], "pages": 11}