{"title": "When smart grid meets geo-distributed cloud: An auction approach to datacenter demand response.", "fields": ["auction theory", "demand response", "workload", "smart grid", "distributed generation"], "abstract": "Datacenter demand response is envisioned as a promising tool for mitigating operational stability issues faced by smart grids. It enables significant potentials in peak load reduction and facilitates the incorporation of distributed generation. Monetary refund from the smart grid can also alleviate the cloud's burden in escalating electricity cost. However, the current demand response paradigm is inefficient towards incentivizing a cloud that runs over geo-distributed datacenters. Leveraging auction theory, this work presents an efficient incentive mechanism to elicit demand response from geo-distributed clouds. To determine the winning bids and their corresponding payments, the cloud that acts as the auctioneer needs to solve a set of winner determination problems that are highly challenging. By integrating techniques from the Gibbs sampling method and the alternating direction method of multipliers, we propose a decentralized algorithm for each datacenter to make autonomous decisions on winning bid selection and workload management, striking a balance among the economic efficiency, truthfulness and the computational efficiency. Through extensive trace-driven evaluations, we demonstrate that our incentive mechanism constitutes a win-win mechanism for both the geo-distributed cloud and the smart grid.", "citation": "Citations (27)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "University of Calgary", "Huazhong University of Science and Technology"], "authors": ["Zhi Zhou.....http://dblp.org/pers/hd/z/Zhou:Zhi", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai"], "conf": "infocom", "year": "2015", "pages": 9}