{"title": "Packet-Level Telemetry in Large Datacenter Networks.", "fields": ["network packet", "debugging", "telemetry", "troubleshooting", "complex network"], "abstract": "Debugging faults in complex networks often requires capturing and analyzing traffic at the packet level. In this task, datacenter networks (DCNs) present unique challenges with their scale, traffic volume, and diversity of faults. To troubleshoot faults in a timely manner, DCN administrators must a) identify affected packets inside large volume of traffic; b) track them across multiple network components; c) analyze traffic traces for fault patterns; and d) test or confirm potential causes. To our knowledge, no tool today can achieve both the specificity and scale required for this task.   We present Everflow, a packet-level network telemetry system for large DCNs. Everflow traces specific packets by implementing a powerful packet filter on top of \"match and mirror\" functionality of commodity switches. It shuffles captured packets to multiple analysis servers using load balancers built on switch ASICs, and it sends \"guided probes\" to test or confirm potential faults. We present experiments that demonstrate Everflow's scalability, and share experiences of troubleshooting network faults gathered from running it for over 6 months in Microsoft's DCNs.", "citation": "Citations (87)", "departments": ["University of California, Santa Barbara", "Princeton University", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Yibo Zhu.....http://dblp.org/pers/hd/z/Zhu:Yibo", "Nanxi Kang.....http://dblp.org/pers/hd/k/Kang:Nanxi", "Jiaxin Cao.....http://dblp.org/pers/hd/c/Cao:Jiaxin", "Albert G. Greenberg.....http://dblp.org/pers/hd/g/Greenberg:Albert_G=", "Guohan Lu.....http://dblp.org/pers/hd/l/Lu:Guohan", "Ratul Mahajan.....http://dblp.org/pers/hd/m/Mahajan:Ratul", "David A. Maltz.....http://dblp.org/pers/hd/m/Maltz:David_A=", "Lihua Yuan.....http://dblp.org/pers/hd/y/Yuan:Lihua", "Ming Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Ming", "Ben Y. Zhao.....http://dblp.org/pers/hd/z/Zhao:Ben_Y=", "Haitao Zheng.....http://dblp.org/pers/hd/z/Zheng:Haitao"], "conf": "sigcomm", "year": "2015", "pages": 13}