{"title": "A Subspace Learning Framework for Cross-Lingual Sentiment Classification with Partial Parallel Data.", "fields": ["sentiment analysis", "matrix decomposition", "labeled data", "subspace topology", "machine learning"], "abstract": "Cross-lingual sentiment classification aims to automatically predict sentiment polarity (e.g., positive or negative) of data in a label-scarce target language by exploiting labeled data from a label-rich language. The fundamental challenge of cross-lingual learning stems from a lack of overlap between the feature spaces of the source language data and that of the target language data. To address this challenge, previous work in the literature mainly relies on the large amount of bilingual parallel corpora to bridge the language gap. In many real applications, however, it is often the case that we have some partial parallel data but it is an expensive and time-consuming job to acquire large amount of parallel data on different languages. In this paper, we propose a novel subspace learning framework by leveraging the partial parallel data for cross-lingual sentiment classification. The proposed approach is achieved by jointly learning the document-aligned review data and un-aligned data from the source language and the target language via a non-negative matrix factorization framework. We conduct a set of experiments with cross-lingual sentiment classification tasks on multilingual Amazon product reviews. Our experimental results demonstrate the efficacy of the proposed cross-lingual approach.", "citation": "Citations (6)", "departments": ["Central China Normal University", "Central China Normal University", "University of Southern California", "National Labora ... Beijing, China"], "authors": ["Guangyou Zhou.....http://dblp.org/pers/hd/z/Zhou:Guangyou", "Tingting He.....http://dblp.org/pers/hd/h/He:Tingting", "Jun Zhao.....http://dblp.org/pers/hd/z/Zhao_0001:Jun", "Wensheng Wu.....http://dblp.org/pers/hd/w/Wu:Wensheng"], "conf": "ijcai", "year": "2015", "pages": 8}