{"title": "Inside the Social Network's (Datacenter) Network.", "fields": ["workload", "cache", "network architecture", "traffic engineering", "interconnection"], "abstract": "Large cloud service providers have invested in increasingly larger datacenters to house the computing infrastructure required to support their services. Accordingly, researchers and industry practitioners alike have focused a great deal of effort designing network fabrics to efficiently interconnect and manage the traffic within these datacenters in performant yet efficient fashions. Unfortunately, datacenter operators are generally reticent to share the actual requirements of their applications, making it challenging to evaluate the practicality of any particular design.   Moreover, the limited large-scale workload information available in the literature has, for better or worse, heretofore largely been provided by a single datacenter operator whose use cases may not be widespread. In this work, we report upon the network traffic observed in some of Facebook's datacenters. While Facebook operates a number of traditional datacenter services like Hadoop, its core Web service and supporting cache infrastructure exhibit a number of behaviors that contrast with those reported in the literature. We report on the contrasting locality, stability, and predictability of network traffic in Facebook's datacenters, and comment on their implications for network architecture, traffic engineering, and switch design.", "citation": "Citations (241)", "departments": ["University of California, San Diego", "Facebook", "Facebook", "University of California, San Diego", "University of California, San Diego"], "authors": ["Arjun Roy.....http://dblp.org/pers/hd/r/Roy:Arjun", "Hongyi Zeng.....http://dblp.org/pers/hd/z/Zeng:Hongyi", "Jasmeet Bagga.....http://dblp.org/pers/hd/b/Bagga:Jasmeet", "George Porter.....http://dblp.org/pers/hd/p/Porter:George", "Alex C. Snoeren.....http://dblp.org/pers/hd/s/Snoeren:Alex_C="], "conf": "sigcomm", "year": "2015", "pages": 15}