{"title": "Adaptive Congestion Control for Unpredictable Cellular Networks.", "fields": ["tcp tuning", "transmission delay", "processing delay", "packet loss", "tcp friendly rate control"], "abstract": "Legacy congestion controls including TCP and its variants are known to perform poorly over cellular networks due to highly variable capacities over short time scales, self-inflicted packet delays, and packet losses unrelated to congestion. To cope with these challenges, we present Verus, an end-to-end congestion control protocol that uses delay measurements to react quickly to the capacity changes in cellular networks without explicitly attempting to predict the cellular channel dynamics. The key idea of Verus is to continuously learn a delay profile that captures the relationship between end-to-end packet delay and outstanding window size over short epochs and uses this relationship to increment or decrement the window size based on the observed short-term packet delay variations. While the delay-based control is primarily for congestion avoidance, Verus uses standard TCP features including multiplicative decrease upon packet loss and slow start. Through a combination of simulations, empirical evaluations using cellular network traces, and real-world evaluations against standard TCP flavors and state of the art protocols like Sprout, we show that Verus outperforms these protocols in cellular channels. In comparison to TCP Cubic, Verus achieves an order of magnitude (> 10x) reduction in delay over 3G and LTE networks while achieving comparable throughput (sometimes marginally higher). In comparison to Sprout, Verus achieves up to 30% higher throughput in rapidly changing cellular networks.", "citation": "Citations (25)", "departments": ["New York University Abu Dhabi", "University of Bremen", "New York University Abu Dhabi", "University of Bremen", "NYU and CTED, New York, USA"], "authors": ["Yasir Zaki.....http://dblp.org/pers/hd/z/Zaki:Yasir", "Thomas Pötsch.....http://dblp.org/pers/hd/p/P=ouml=tsch:Thomas", "Jay Chen.....http://dblp.org/pers/hd/c/Chen:Jay", "Lakshminarayanan Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Lakshminarayanan", "Carmelita Görg.....http://dblp.org/pers/hd/g/G=ouml=rg:Carmelita"], "conf": "sigcomm", "year": "2015", "pages": 14}