{"title": "Continuous circular scribble arts.", "fields": ["scribble", "line", "clockwise", "grayscale", "feature"], "abstract": "Scribble art is a kind of illustrative drawing. Artists use continuous lines to convey the impression of an image or concept of a design. Unlike conventional line drawings such as sketching and hatching that commonly comprise of short and straight line segments, scribble artists aim at depicting the image with long and continuous curves. In this work, we study a typical curve pattern, circular scribble that appears most frequently in the artworks. Circular lines are drawn in either clockwise or counter-clockwise direction with varying radius in the circular scribble arts. The artists delicately trace along a seemingly random path and control the size and orientation of circular line pattern to depict a subject of their artwork. The main challenges lie in producing smooth transition between grayscale levels and preserving dominant image features using continuous loops and intersections of a circular scribble. Thus, the creation of circular scribble art is skill-demanding and time-consuming. In order to facilitate such process, we introduce a systematic approach to automatically synthesize circular scribble arts from images by tracing along a virtual path using solely a single continuous circular scribble with varying radius and orientation. We have tested our approach using a wide range of images and generate visually pleasing circular scribble arts (see Figure 1).", "citation": "Not cited", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Chun-Chia Chiu.....http://dblp.org/pers/hd/c/Chiu:Chun=Chia", "Yi-Hsiang Lo.....http://dblp.org/pers/hd/l/Lo:Yi=Hsiang", "Wei-Ting Ruan.....http://dblp.org/pers/hd/r/Ruan:Wei=Ting", "Cheng-Han Yang.....http://dblp.org/pers/hd/y/Yang:Cheng=Han", "Ruen-Rone Lee.....http://dblp.org/pers/hd/l/Lee:Ruen=Rone", "Hung-Kuo Chu.....http://dblp.org/pers/hd/c/Chu:Hung=Kuo"], "conf": "siggraph", "year": "2015", "pages": 1}