{"title": "IReS: Intelligent, Multi-Engine Resource Scheduler for Big Data Analytics Workflows.", "fields": ["operator", "analytics", "profiling", "workflow", "use case"], "abstract": "Big data analytics tools are steadily gaining ground at becoming indispensable to businesses worldwide. The complexity of the tasks they execute is ever increasing due to the surge in data and task heterogeneity. Current analytics platforms, while successful in harnessing multiple aspects of this ``data deluge\", bind their efficacy to a single data and compute model and often depend on proprietary systems. However, no single execution engine is suitable for all types of computation and no single data store is suitable for all types of data. To this end, we demonstrate  IReS , the  Intelligent Resource Scheduler  for complex analytics workflows executed over multi-engine environments. Our system models the cost and performance of the required tasks over the available platforms.  IReS  is then able to match distinct workflow parts to the execution and/or storage engine among the available ones in order to optimize with respect to a user-defined policy. During the demo, the attendees will be able to execute workflows that match real use cases and parametrize the input datasets and optimization policy. The underlying platform supports multiple compute and data engines, allowing the user to choose any subset of them. Through the inspection of the produced plan, its execution and the collection and presentation of numerous cost and performance metrics, the audience will experience first-hand how  IReS  takes advantage of heterogeneous runtimes and data stores and effectively models operator cost and performance for actual and diverse workflows.", "citation": "Citations (6)", "year": "2015", "departments": ["National Technical University of Athens", "National Technical University of Athens", "Ionian University", "National Technical University of Athens", "National Technical University of Athens"], "conf": "sigmod", "authors": ["Katerina Doka.....http://dblp.org/pers/hd/d/Doka:Katerina", "Nikolaos Papailiou.....http://dblp.org/pers/hd/p/Papailiou:Nikolaos", "Dimitrios Tsoumakos.....http://dblp.org/pers/hd/t/Tsoumakos:Dimitrios", "Christos Mantas.....http://dblp.org/pers/hd/m/Mantas:Christos", "Nectarios Koziris.....http://dblp.org/pers/hd/k/Koziris:Nectarios"], "pages": 6}