{"title": "Beyond Covariance: Feature Representation with Nonlinear Kernel Matrices.", "fields": ["real representation", "riemannian geometry", "kernel method", "covariance", "matrix representation"], "abstract": "Covariance matrix has recently received increasing attention in computer vision by leveraging Riemannian geometry of symmetric positive-definite (SPD) matrices. Originally proposed as a region descriptor, it has now been used as a generic representation in various recognition tasks. However, covariance matrix has shortcomings such as being prone to be singular, limited capability in modeling complicated feature relationship, and having a fixed form of representation. This paper argues that more appropriate SPD-matrix-based representations shall be explored to achieve better recognition. It proposes an open framework to use the kernel matrix over feature dimensions as a generic representation and discusses its properties and advantages. The proposed framework significantly elevates covariance representation to the unlimited opportunities provided by this new representation. Experimental study shows that this representation consistently outperforms its covariance counterpart on various visual recognition tasks. In particular, it achieves significant improvement on skeleton-based human action recognition, demonstrating the state-of-the-art performance over both the covariance and the existing non-covariance representations.", "citation": "Citations (25)", "year": "2015", "departments": ["Information Technology University", "Information Technology University", "Information Technology University", "Information Technology University", "Information Technology University"], "conf": "iccv", "authors": ["Lei Wang.....http://dblp.org/pers/hd/w/Wang_0001:Lei", "Jianjia Zhang.....http://dblp.org/pers/hd/z/Zhang:Jianjia", "Luping Zhou.....http://dblp.org/pers/hd/z/Zhou:Luping", "Chang Tang.....http://dblp.org/pers/hd/t/Tang:Chang", "Wanqing Li.....http://dblp.org/pers/hd/l/Li:Wanqing"], "pages": 9}