{"title": "Fast in-memory transaction processing using RDMA and HTM.", "fields": ["transactions per second", "distributed transaction", "transactional memory", "transaction processing system", "serializability", "online transaction processing"], "abstract": "We present DrTM, a fast in-memory transaction processing system that exploits advanced hardware features (i.e., RDMA and HTM) to improve latency and throughput by over one order of magnitude compared to state-of-the-art distributed transaction systems. The high performance of DrTM are enabled by mostly offloading concurrency control within a local machine into HTM and leveraging the strong consistency between RDMA and HTM to ensure serializability among concurrent transactions across machines. We further build an efficient hash table for DrTM by leveraging HTM and RDMA to simplify the design and notably improve the performance. We describe how DrTM supports common database features like read-only transactions and logging for durability. Evaluation using typical OLTP workloads including TPC-C and SmallBank show that DrTM scales well on a 6-node cluster and achieves over 5.52 and 138 million transactions per second for TPC-C and SmallBank Respectively. This number outperforms a state-of-the-art distributed transaction system (namely Calvin) by at least 17.9X for TPC-C.", "citation": "Citations (64)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Xingda Wei.....http://dblp.org/pers/hd/w/Wei:Xingda", "Jiaxin Shi.....http://dblp.org/pers/hd/s/Shi:Jiaxin", "Yanzhe Chen.....http://dblp.org/pers/hd/c/Chen:Yanzhe", "Rong Chen.....http://dblp.org/pers/hd/c/Chen_0001:Rong", "Haibo Chen.....http://dblp.org/pers/hd/c/Chen:Haibo"], "conf": "sosp", "year": "2015", "pages": 18}