{"title": "Big omics data experience.", "fields": ["workload", "workflow", "benchmarking", "speedup", "personalized medicine"], "abstract": "As personalized medicine becomes more integrated into healthcare, the rate at which human genomes are being sequenced is rising quickly together with a concomitant acceleration in compute and storage requirements. To achieve the most effective solution for genomic workloads without re-architecting the industry-standard software, we performed a rigorous analysis of usage statistics, benchmarks and available technologies to design a system for maximum throughput. We share our experiences designing a system optimized for the \"Genome Analysis ToolKit (GATK) Best Practices\" whole genome DNA and RNA pipeline based on an evaluation of compute, workload and I/O characteristics. The characteristics of genomic-based workloads are vastly different from those of traditional HPC workloads, requiring different configurations of the scheduler and the I/O subsystem to achieve reliability, performance and scalability. By understanding how our researchers and clinicians work, we were able to employ techniques not only to speed up their workflow yielding improved and repeatable performance, but also to make more efficient use of storage and compute resources.", "citation": "Citations (3)", "year": "2015", "departments": ["Icahn School of Medicine at Mount Sinai", "Icahn School of Medicine at Mount Sinai", "Icahn School of Medicine at Mount Sinai", "Icahn School of Medicine at Mount Sinai", "Icahn School of Medicine at Mount Sinai"], "conf": "sc", "authors": ["Patricia A. Kovatch.....http://dblp.org/pers/hd/k/Kovatch:Patricia_A=", "Anthony Costa.....http://dblp.org/pers/hd/c/Costa:Anthony", "Zachary Giles.....http://dblp.org/pers/hd/g/Giles:Zachary", "Eugene Fluder.....http://dblp.org/pers/hd/f/Fluder:Eugene", "Hyung Min Cho.....http://dblp.org/pers/hd/c/Cho:Hyung_Min", "Svetlana Mazurkova.....http://dblp.org/pers/hd/m/Mazurkova:Svetlana"], "pages": 12}