{"title": "How Can I Use This Method?", "fields": ["reusability", "heuristics", "clone", "program slicing", "software documentation"], "abstract": "Code examples are small source code fragments whose purpose is to illustrate how a programming language construct, an API, or a specific function/method works. Since code examples are not always available in the software documentation, researchers have proposed techniques to automatically extract them from existing software or to mine them from developer discussions. In this paper we propose  muse  (Method USage Examples), an approach for mining and ranking actual code examples that show how to use a specific method.  muse  combines static slicing (to simplify examples) with clone detection (to group similar examples), and uses heuristics to select and rank the best examples in terms of reusability, understandability, and popularity.  muse  has been empirically evaluated using examples mined from six libraries, by performing three studies involving a total of 140 developers to: (i) evaluate the selection and ranking heuristics, (ii) provide their perception on the usefulness of the selected examples, and (iii) perform specific programming tasks using the  muse  examples. The results indicate that  muse  selects and ranks examples close to how humans do, most of the code examples (82%) are perceived as useful, and they actually help when performing programming tasks.", "citation": "Citations (33)", "departments": ["University of Texas at Dallas", "Free University of Bozen-Bolzano", "University of Sannio", "University of Molise", "University of Texas at Dallas"], "authors": ["Laura Moreno.....http://dblp.org/pers/hd/m/Moreno:Laura", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Rocco Oliveto.....http://dblp.org/pers/hd/o/Oliveto:Rocco", "Andrian Marcus.....http://dblp.org/pers/hd/m/Marcus:Andrian"], "conf": "icse", "year": "2015", "pages": 11}