{"title": "Justified Representation in Approval-Based Committee Voting.", "fields": ["bullet voting", "approval voting", "cardinal voting systems", "anti plurality voting", "disapproval voting"], "abstract": "We consider approval-based committee voting, i.e., the setting where each voter approves a subset of candidates, and these votes are then used to select a fixed-size set of winners (committee). We propose a natural axiom for this setting, which we call justified representation (JR). This axiom requires that if a large enough group of voters exhibits agreement by supporting the same candidate, then at least one voter in this group has an approved candidate in the winning committee. We show that for every list of ballots it is possible to select a committee that provides JR. We then check if this axiom is fulfilled by well-known approval-based voting rules. We show that the answer is negative for most of the rules we consider, with notable exceptions of PAV (Proportional Approval Voting), an extreme version of RAV (Reweighted Approval Voting), and, for a restricted preference domain, MAV (Minimax Approval Voting). We then introduce a stronger version of the JR axiom, which we call extended justified representation (EJR), and show that PAV satisfies EJR, while other rules do not. We also consider several other questions related to JR and EJR, including the relationship between JR/EJR and unanimity, and the complexity of the associated algorithmic problems.", "citation": "Citations (54)", "departments": ["NICTA", "Duke University", "Duke University", "University of Oxford", "Duke University"], "authors": ["Haris Aziz.....http://dblp.org/pers/hd/a/Aziz_0001:Haris", "Markus Brill.....http://dblp.org/pers/hd/b/Brill:Markus", "Vincent Conitzer.....http://dblp.org/pers/hd/c/Conitzer:Vincent", "Edith Elkind.....http://dblp.org/pers/hd/e/Elkind:Edith", "Rupert Freeman.....http://dblp.org/pers/hd/f/Freeman:Rupert", "Toby Walsh.....http://dblp.org/pers/hd/w/Walsh:Toby"], "conf": "aaai", "year": "2015", "pages": 7}