{"title": "Effective Search-Space Pruning for Solvers of String Equations, Regular Expressions and Length Constraints.", "fields": ["symbolic execution", "length function", "boolean satisfiability problem", "string", "solver"], "abstract": "In recent years, string solvers have become an essential component in many formal-verification, security-analysis and bug-finding tools. Such solvers typically support a theory of string equations, the length function as well as the regular-expression membership predicate. These enable considerable expressive power, which comes at the cost of slow solving time, and in some cases even nontermination. We present two techniques, designed for word-based SMT string solvers, to mitigate these problems: (i) sound and complete detection of overlapping variables, which is essential to avoiding common cases of nontermination; and (ii) pruning of the search space via bi-directional integration between the string and integer theories, enabling new cross-domain heuristics. We have implemented both techniques atop the Z3-str solver, resulting in a significantly more robust and efficient solver, dubbed Z3str2, for the quantifier-free theory of string equations, the regular-expression membership predicate and linear arithmetic over the length function. We report on a series of experiments over four sets of challenging real-world benchmarks, where we compared Z3str2 with five different string solvers: S3, CVC4, Kaluza, PISA and Stranger. Each of these tools utilizes a different solving strategy and/or string representation (based e.g. on words, bit vectors or automata). The results point to the efficacy of our proposed techniques, which yield dramatic performance improvement. We argue that the techniques presented here are of broad applicability, and can be integrated into other SMT-backed string solvers to improve their performance.\nOpen image in new window", "citation": "Citations (14)", "year": "2015", "departments": ["IBM", "University of Waterloo", "University of Waterloo", "IBM", "IBM"], "conf": "cav", "authors": ["Yunhui Zheng.....http://dblp.org/pers/hd/z/Zheng:Yunhui", "Vijay Ganesh.....http://dblp.org/pers/hd/g/Ganesh:Vijay", "Sanu Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Sanu", "Omer Tripp.....http://dblp.org/pers/hd/t/Tripp:Omer", "Julian Dolby.....http://dblp.org/pers/hd/d/Dolby:Julian", "Xiangyu Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiangyu"], "pages": 20}