{"title": "Architecture-aware automatic computation offload for native applications.", "fields": ["mobile web", "server", "computation offloading", "mobile cloud computing", "mobile search"], "abstract": "Although mobile devices have been evolved enough to support complex mobile programs, performance of the mobile devices is lagging behind performance of servers. To bridge the performance gap, computation offloading allows a mobile device to remotely execute heavy tasks at servers. However, due to architectural differences between mobile devices and servers, most existing computation offloading systems rely on virtual machines, so they cannot offload native applications. Some offloading systems can offload native mobile applications, but their applicability is limited to well-analyzable simple applications. This work presents automatic cross-architecture computation offloading for general-purpose native applications with a prototype framework that is called Native Offloader. At compile-time, Native Offloader automatically finds heavy tasks without any annotation, and generates offloading-enabled native binaries with memory unification for a mobile device and a server. At run-time, Native Offloader efficiently supports seamless migration between the mobile device and the server with a unified virtual address space and communication optimization. Native Offloader automatically offloads 17 native C applications from SPEC CPU2000 and CPU2006 benchmark suites without a virtual machine, and achieves a geomean program speedup of 6.42 × and battery saving of 82.0%.", "citation": "Citations (9)", "departments": ["Pohang University of Science and Technology", "Pohang University of Science and Technology", "Pohang University of Science and Technology", "Samsung", "Samsung"], "authors": ["Gwangmu Lee.....http://dblp.org/pers/hd/l/Lee:Gwangmu", "Hyunjoon Park.....http://dblp.org/pers/hd/p/Park:Hyunjoon", "Seonyeong Heo.....http://dblp.org/pers/hd/h/Heo:Seonyeong", "Kyung-Ah Chang.....http://dblp.org/pers/hd/c/Chang:Kyung=Ah", "Hyogun Lee.....http://dblp.org/pers/hd/l/Lee:Hyogun", "Hanjun Kim.....http://dblp.org/pers/hd/k/Kim:Hanjun"], "conf": "micro", "year": "2015", "pages": 12}