{"title": "Visual Coding in a Semantic Hierarchy.", "fields": ["semantic property", "semantic grid", "social semantic web", "semantic compression", "semantic technology"], "abstract": "In recent years, tremendous research endeavours have been dedicated to seeking effective visual representations for facilitating various multimedia applications, such as visual annotation and retrieval. Nonetheless, existing approaches can hardly achieve satisfactory performance due to the scarcity of fully exploring semantic properties of visual codes. In this paper, we present a novel visual coding approach, termed as  hierarchical semantic visual coding  (HSVC), to effectively encode visual objects ( e.g. , image and video) in a semantic hierarchy. Specifically, we first construct a semantic-enriched dictionary hierarchy, which is comprised of dictionaries corresponding to all concepts in a semantic hierarchy as well as their hierarchical semantic correlation. Moreover, we devise an on-line semantic coding model, which simultaneously 1) exploits the rich hierarchical semantic prior knowledge in the learned dictionary, 2) reflects semantic sparse property of visual codes, and 3) explores semantic relationships among concepts in the semantic hierarchy. To this end, we propose to integrate concept-level group sparsity constraint and semantic correlation matrix into a unified regularization term. We design an effective algorithm to optimize the proposed model, and a rigorous mathematical analysis has been provided to guarantee that the algorithm converges to a global optima. Extensive experiments on various multimedia datasets have been conducted to illustrate the superiority of our proposed approach as compared to state-of-the-art methods.", "citation": "Citations (28)", "departments": ["University of Electronic Science and Technology of China", "National University of Singapore", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "Chinese Academy of Sciences"], "authors": ["Yang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Yang", "Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Mingxing Zhang.....http://dblp.org/pers/hd/z/Zhang:Mingxing", "Fumin Shen.....http://dblp.org/pers/hd/s/Shen:Fumin", "Xuelong Li.....http://dblp.org/pers/hd/l/Li:Xuelong"], "conf": "mm", "year": "2015", "pages": 10}