{"title": "Hermes: Latency optimal task assignment for resource-constrained mobile computing.", "fields": ["latency", "heuristics", "solver", "cloud computing", "dependency graph", "server", "online algorithm", "integer programming"], "abstract": "With mobile devices increasingly able to connect to cloud servers from anywhere, resource-constrained devices can potentially perform offloading of computational tasks to either improve resource usage or improve performance. It is of interest to find optimal assignments of tasks to local and remote devices that can take into account the application-specific profile, availability of computational resources, and link connectivity, and find a balance between energy consumption costs of mobile devices and latency for delay-sensitive applications. Given an application described by a task dependency graph, we formulate an optimization problem to minimize the latency while meeting prescribed resource utilization constraints. Different from most of existing works that either rely on an integer linear programming formulation, which is NP-hard and not applicable to general task dependency graph for latency metrics, or on intuitively derived heuristics that offer no theoretical performance guarantees, we propose Hermes, a novel fully polynomial time problem approximation scheme (FPTAS) algorithm to solve this problem. Hermes pros vides a solution with latency no more than (1 + e) times of the minimum while incurring complexity that is an polynomial in problem size and //e We evaluate the performance by using real data set collected from several benchmarks, and show that Hermes improves the latency by 16% (36% for larger scale application) compared to a previously published heuristic and increases CPU computing time by only 0.4% of overall latency.", "citation": "Citations (28)", "departments": ["University of Southern California", "University of Southern California", "AT&T", "General Motors", "University of Southern California", "University of Southern California", "AT&T", "General Motors"], "authors": ["Yi-Hsuan Kao.....http://dblp.org/pers/hd/k/Kao:Yi=Hsuan", "Bhaskar Krishnamachari.....http://dblp.org/pers/hd/k/Krishnamachari:Bhaskar", "Moo-Ryong Ra.....http://dblp.org/pers/hd/r/Ra:Moo=Ryong", "Fan Bai.....http://dblp.org/pers/hd/b/Bai:Fan"], "conf": "infocom", "year": "2015", "pages": 9}