{"title": "Cinema Data Mining: The Smell of Fear.", "fields": ["movie theater", "data mining", "granger causality", "skin conductance", "machine learning"], "abstract": "While the physiological response of humans to emotional events or stimuli is well-investigated for many modalities (like EEG, skin resistance, ...), surprisingly little is known about the exhalation of so-called Volatile Organic Compounds (VOCs) at quite low concentrations in response to such stimuli. VOCs are molecules of relatively small mass that quickly evaporate or sublimate and can be detected in the air that surrounds us. The paper introduces a new field of application for data mining, where trace gas responses of people reacting on-line to films shown in cinemas (or movie theaters) are related to the semantic content of the films themselves. To do so, we measured the VOCs from a movie theater over a whole month in intervals of thirty seconds, and annotated the screened films by a controlled vocabulary compiled from multiple sources. To gain a better understanding of the data and to reveal unknown relationships, we have built prediction models for so-called forward prediction (the prediction of future VOCs from the past), backward prediction (the prediction of past scene labels from future VOCs), which is some form of abductive reasoning, and Granger causality. Experimental results show that some VOCs and some labels can be predicted with relatively low error, and that hint for causality with low p-values can be detected in the data. The data set is publicly available at: https://github.com/jorro/smelloffear.", "citation": "Citations (6)", "departments": ["University of Mainz", "University of Mainz", "Max Planck Society", "Max Planck Society", "Max Planck Society"], "authors": ["Jörg Wicker.....http://dblp.org/pers/hd/w/Wicker:J=ouml=rg", "Nicolas Krauter.....http://dblp.org/pers/hd/k/Krauter:Nicolas", "Bettina Derstorff.....http://dblp.org/pers/hd/d/Derstorff:Bettina", "Christof Stönner.....http://dblp.org/pers/hd/s/St=ouml=nner:Christof", "Efstratios Bourtsoukidis.....http://dblp.org/pers/hd/b/Bourtsoukidis:Efstratios", "Thomas Klüpfel.....http://dblp.org/pers/hd/k/Kl=uuml=pfel:Thomas", "Jonathan Williams.....http://dblp.org/pers/hd/w/Williams:Jonathan", "Stefan Kramer.....http://dblp.org/pers/hd/k/Kramer_0001:Stefan"], "conf": "kdd", "year": "2015", "pages": 10}