{"title": "Leveled Fully Homomorphic Signatures from Standard Lattices.", "fields": ["homomorphic encryption", "integer", "homomorphic secret sharing", "upload", "tuple"], "abstract": "In a homomorphic signature scheme, a user Alice signs some large dataset x using her secret signing key and uploads the signed data to an untrusted remote server. The server can then run some computation y=f(x) over the signed data and homomorphically derive a  short  signature σ f,y  certifying that y is the correct output of the computation f. Anybody can verify the tuple (f, y, σ f,y ) using Alice's public verification key and become convinced of this fact without having to retrieve the entire underlying data. In this work, we construct the first  leveled  fully homomorphic signature} schemes that can evaluate arbitrary {circuits} over signed data. Only the maximal {depth} d of the circuits needs to be fixed a-priori at setup, and the size of the evaluated signature grows polynomially in d, but is otherwise independent of the circuit size or the data size. Our solution is based on the (sub-exponential) hardness of the  small integer solution  (SIS) problem in standard lattices and satisfies full (adaptive) security. In the standard model, we get a scheme with large public parameters whose size exceeds the total size of a dataset. In the random-oracle model, we get a scheme with short public parameters. In both cases, the schemes can be used to sign many different datasets. The complexity of verifying a signature for a computation f is at least as large as that of computing f, but can be amortized when verifying the same computation over many different datasets. Furthermore, the signatures can be made  context-hiding  so as not to reveal anything about the data beyond the outcome of the computation.   These results offer a significant improvement in capabilities and assumptions over the best prior homomorphic signature schemes, which were limited to evaluating polynomials of constant degree.   As a building block of independent interest, we introduce a new notion called  homomorphic trapdoor functions  (HTDF) which conceptually unites homomorphic encryption and signatures. We construct HTDFs by relying on the techniques developed by Gentry et al. (CRYPTO '13) and Boneh et al. (EUROCRYPT '14) in the contexts of fully homomorphic and attribute-based encryptions.", "citation": "Citations (96)", "year": "2015", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Northeastern University"], "conf": "stoc", "authors": ["Sergey Gorbunov.....http://dblp.org/pers/hd/g/Gorbunov:Sergey", "Vinod Vaikuntanathan.....http://dblp.org/pers/hd/v/Vaikuntanathan:Vinod", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "pages": 9}