{"title": "Do we need a perfect ground-truth for benchmarking Internet traffic classifiers?", "fields": ["anomaly detection", "latent class model", "internet traffic", "benchmarking", "traffic classification"], "abstract": "The classification of Internet traffic using supervised or semi-supervised statistical learning techniques, both for anomaly detection and identification of Internet applications, has been impaired by difficulties in obtaining a reliable ground-truth, required both to train the classifier and to evaluate its performance. A perfect ground-truth is increasingly difficult, or sometimes impossible, to obtain due to the growing percentage of cyphered traffic, the sophistication of network attacks, and the constant updates of Internet applications. In this paper, we study the impact of the ground-truth on training the classifier and estimating its performance measures. We show both theoretically and through simulation that ground-truth imperfections can severely bias the performance estimates. We then propose a latent class model that overcomes this problem by combining estimates of several classifiers over the same dataset. The model is evaluated using a high-quality dataset that includes the most representative Internet applications and network attacks. The results show that our latent class model produces very good performance estimates under mild levels of ground-truth imperfection, and can thus be used to correctly benchmark Internet traffic classifiers when only an imperfect ground-truth is available.", "citation": "Not cited", "departments": ["Instituto Superior Técnico", "Instituto Superior Técnico", "University of Lisbon", "University of Aveiro"], "authors": ["Maria Rosário de Oliveira.....http://dblp.org/pers/hd/o/Oliveira:Maria_Ros=aacute=rio_de", "João C. Neves.....http://dblp.org/pers/hd/n/Neves:Jo=atilde=o_C=", "Rui Valadas.....http://dblp.org/pers/hd/v/Valadas:Rui", "Paulo Salvador.....http://dblp.org/pers/hd/s/Salvador:Paulo"], "conf": "infocom", "year": "2015", "pages": 9}