{"title": "Self-Tuning, GPU-Accelerated Kernel Density Models for Multidimensional Selectivity Estimation.", "fields": ["kernel density estimation", "self tuning", "estimator", "general purpose computing on graphics processing units", "query optimization"], "abstract": "Quickly and accurately estimating the selectivity of multidimensional predicates is a vital part of a modern relational query optimizer. The state-of-the art in this field are multidimensional histograms, which offer good estimation quality but are complex to construct and hard to maintain. Kernel Density Estimation (KDE) is an interesting alternative that does not suffer from these problems. However, existing KDE-based selectivity estimators can hardly compete with the estimation quality of state-of-the art methods.   In this paper, we substantially expand the state-of-the-art in KDE-based selectivity estimation by improving along three dimensions: First, we demonstrate how to numerically optimize a KDE model, leading to substantially improved estimates. Second, we develop methods to continuously adapt the estimator to changes in both the database and the query workload. Finally, we show how to drastically improve the performance by pushing computations onto a GPU.   We provide an implementation of our estimator and experimentally evaluate it on a variety of datasets and workloads, demonstrating that it efficiently scales up to very large model sizes, adapts itself to database changes, and typically outperforms the estimation quality of both existing Kernel Density Estimators as well as state-of-the-art multidimensional histograms.", "citation": "Citations (5)", "year": "2015", "departments": ["Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin"], "conf": "sigmod", "authors": ["Max Heimel.....http://dblp.org/pers/hd/h/Heimel:Max", "Martin Kiefer.....http://dblp.org/pers/hd/k/Kiefer:Martin", "Volker Markl.....http://dblp.org/pers/hd/m/Markl:Volker"], "pages": 16}