{"title": "Iterative distribution-aware sampling for probabilistic symbolic execution.", "fields": ["probabilistic logic", "probabilistic analysis of algorithms", "symbolic execution", "discretization", "scalability"], "abstract": "Probabilistic symbolic execution aims at quantifying the probability of reaching program events of interest assuming that program inputs follow given probabilistic distributions. The technique collects constraints on the inputs that lead to the target events and analyzes them to quantify how likely it is for an input to satisfy the constraints. Current techniques either handle only linear constraints or only support continuous distributions using a “discretization” of the input domain, leading to imprecise and costly results. We propose an iterative distribution-aware sampling approach to support probabilistic symbolic execution for arbitrarily complex mathematical constraints and continuous input distributions. We follow a compositional approach, where the symbolic constraints are decomposed into sub-problems whose solution can be solved independently. At each iteration the convergence rate of the com- putation is increased by automatically refocusing the analysis on estimating the sub-problems that mostly affect the accuracy of the results, as guided by three different ranking strategies. Experiments on publicly available benchmarks show that the proposed technique improves on previous approaches in terms of scalability and accuracy of the results.", "citation": "Citations (5)", "departments": ["Federal University of Pernambuco", "University of Stuttgart", "Federal University of Pernambuco", "Ames Research Center"], "authors": ["Mateus Borges.....http://dblp.org/pers/hd/b/Borges:Mateus", "Antonio Filieri.....http://dblp.org/pers/hd/f/Filieri:Antonio", "Marcelo d'Amorim.....http://dblp.org/pers/hd/d/d=Amorim:Marcelo", "Corina S. Pasareanu.....http://dblp.org/pers/hd/p/Pasareanu:Corina_S="], "conf": "sigsoft", "year": "2015", "pages": 12}