{"title": "Analyzing and mitigating the impact of manufacturing variability in power-constrained supercomputing.", "fields": ["homogeneity", "supercomputer", "benchmark", "speedup", "limiting"], "abstract": "A key challenge in next-generation supercomputing is to effectively schedule limited power resources. Modern processors suffer from increasingly large power variations due to the chip manufacturing process. These variations lead to  power inhomogeneity  in current systems and manifest into  performance inhomogeneity  in power constrained environments, drastically limiting supercomputing performance. We present a first-of-its-kind study on manufacturing variability on four production HPC systems spanning four microarchitectures, analyze its impact on HPC applications, and propose a novel variation-aware power budgeting scheme to maximize effective application performance. Our low-cost and scalable budgeting algorithm strives to achieve performance homogeneity under a power constraint by deriving application-specific, module-level power allocations. Experimental results using a 1,920 socket system show up to 5.4X speedup, with an average speedup of 1.8X across all benchmarks when compared to a variation-unaware power allocation scheme.", "citation": "Citations (32)", "year": "2015", "departments": ["Kyushu University", "University of Arizona", "Kyushu University", "Kyushu University", "Lawrence Livermore National Laboratory"], "conf": "sc", "authors": ["Yuichi Inadomi.....http://dblp.org/pers/hd/i/Inadomi:Yuichi", "Tapasya Patki.....http://dblp.org/pers/hd/p/Patki:Tapasya", "Koji Inoue.....http://dblp.org/pers/hd/i/Inoue:Koji", "Mutsumi Aoyagi.....http://dblp.org/pers/hd/a/Aoyagi:Mutsumi", "Barry Rountree.....http://dblp.org/pers/hd/r/Rountree:Barry", "Martin Schulz.....http://dblp.org/pers/hd/s/Schulz_0001:Martin", "David K. Lowenthal.....http://dblp.org/pers/hd/l/Lowenthal:David_K=", "Yasutaka Wada.....http://dblp.org/pers/hd/w/Wada:Yasutaka", "Keiichiro Fukazawa.....http://dblp.org/pers/hd/f/Fukazawa:Keiichiro", "Masatsugu Ueda.....http://dblp.org/pers/hd/u/Ueda:Masatsugu", "Masaaki Kondo.....http://dblp.org/pers/hd/k/Kondo:Masaaki", "Ikuo Miyoshi.....http://dblp.org/pers/hd/m/Miyoshi:Ikuo"], "pages": 12}