{"title": "Having Your Cake and Eating It Too: Jointly Optimal Erasure Codes for I/O, Storage, and Network-bandwidth.", "fields": ["turbo code", "distributed data store", "fountain code", "tornado code", "online codes"], "abstract": "Erasure codes, such as Reed-Solomon (RS) codes, are increasingly being deployed as an alternative to data-replication for fault tolerance in distributed storage systems. While RS codes provide significant savings in storage space, they can impose a huge burden on the I/O and network resources when reconstructing failed or otherwise unavailable data. A recent class of erasure codes, called minimum-storage-regeneration (MSR) codes, has emerged as a superior alternative to the popular RS codes, in that it minimizes network transfers during reconstruction while also being optimal with respect to storage and reliability. However, existing practical MSR codes do not address the increasingly important problem of I/O overhead incurred during reconstructions, and are, in general, inferior to RS codes in this regard. In this paper, we design erasure codes that are simultaneously optimal in terms of I/O, storage, and network bandwidth. Our design builds on top of a class of powerful practical codes, called the product-matrix-MSR codes. Evaluations show that our proposed design results in a significant reduction the number of I/Os consumed during reconstructions (a 5× reduction for typical parameters), while retaining optimality with respect to storage, reliability, and network bandwidth.", "citation": "Citations (84)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["K. V. Rashmi.....http://dblp.org/pers/hd/r/Rashmi:K=_V=", "Preetum Nakkiran.....http://dblp.org/pers/hd/n/Nakkiran:Preetum", "Jingyan Wang.....http://dblp.org/pers/hd/w/Wang:Jingyan", "Nihar B. Shah.....http://dblp.org/pers/hd/s/Shah:Nihar_B=", "Kannan Ramchandran.....http://dblp.org/pers/hd/r/Ramchandran:Kannan"], "conf": "fast", "year": "2015", "pages": 14}