{"title": "SMART: A tool for analyzing and reconciling schema matching networks.", "fields": ["schema matching", "pairwise comparison", "schema migration", "data integration", "database schema"], "abstract": "Schema matching supports data integration by establishing correspondences between the attributes of independently designed database schemas. In recent years, various tools for automatic pair-wise matching of schemas have been developed. Since the matching process is inherently uncertain, the correspondences generated by such tools are often validated by a human expert. In this work, we consider scenarios in which attribute correspondences are identified in a network of schemas and not only in a pairwise setting. Here, correspondences between different schemas are interrelated, so that incomplete and erroneous matching results propagate in the network and the validation of a correspondence by an expert has ripple effects. To analyse and reconcile such matchings in schema networks, we present the Schema Matching Analyzer and Reconciliation Tool (SMART). It allows for the definition of network-level integrity constraints for the matching and, based thereon, detects and visualizes inconsistencies of the matching. The tool also supports the reconciliation of a matching by guiding an expert in the validation process and by offering semi-automatic conflict-resolution techniques.", "citation": "Citations (8)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of Rennes"], "authors": ["Nguyen Quoc Viet Hung.....http://dblp.org/pers/hd/h/Hung:Nguyen_Quoc_Viet", "Nguyen Thanh Tam.....http://dblp.org/pers/hd/t/Tam:Nguyen_Thanh", "Vinh Tuan Chau.....http://dblp.org/pers/hd/c/Chau:Vinh_Tuan", "Tri Kurniawan Wijaya.....http://dblp.org/pers/hd/w/Wijaya:Tri_Kurniawan", "Zoltán Miklós.....http://dblp.org/pers/hd/m/Mikl=oacute=s_0001:Zolt=aacute=n", "Karl Aberer.....http://dblp.org/pers/hd/a/Aberer:Karl", "Avigdor Gal.....http://dblp.org/pers/hd/g/Gal:Avigdor", "Matthias Weidlich.....http://dblp.org/pers/hd/w/Weidlich:Matthias"], "conf": "icde", "year": "2015", "pages": 4}