{"title": "Generalization Analysis for Game-Theoretic Machine Learning.", "fields": ["inductive transfer", "stability", "multi task learning", "early stopping", "online machine learning"], "abstract": "For Internet applications like sponsored search, cautions need to be taken when using machine learning to optimize their mechanisms (e.g., auction) since self-interested agents in these applications may change their behaviors (and thus the data distribution) in response to the mechanisms. To tackle this problem, a framework called game-theoretic machine learning (GTML) was recently proposed, which first learns a Markov behavior model to characterize agents behaviors, and then learns the optimal mechanism by simulating agents' behavior changes in response to the mechanism. While GTML has demonstrated practical success, its generalization analysis is challenging because the behavior data are non-i.i.d. and dependent on the mechanism. To address this challenge, first, we decompose the generalization error for GTML into the behavior learning error and the mechanism learning error; second, for the behavior learning error, we obtain novel non-asymptotic error bounds for both parametric and non-parametric behavior learning methods; third, for the mechanism learning error, we derive a uniform convergence bound based on a new concept called nested covering number of the mechanism space and the generalization analysis techniques developed for mixing sequences.", "citation": "Citations (4)", "departments": ["Chinese Academy of Sciences", "University of Science and Technology of China", "Microsoft", "Microsoft", "Chinese Academy of Sciences"], "authors": ["Haifang Li.....http://dblp.org/pers/hd/l/Li:Haifang", "Fei Tian.....http://dblp.org/pers/hd/t/Tian:Fei", "Wei Chen.....http://dblp.org/pers/hd/c/Chen_0034:Wei", "Tao Qin.....http://dblp.org/pers/hd/q/Qin:Tao", "Zhiming Ma.....http://dblp.org/pers/hd/m/Ma:Zhiming", "Tie-Yan Liu.....http://dblp.org/pers/hd/l/Liu:Tie=Yan"], "conf": "aaai", "year": "2015", "pages": 7}