{"title": "GetReal: Towards Realistic Selection of Influence Maximization Strategies in Competitive Networks.", "fields": ["nash equilibrium", "software deployment", "maximization", "game theory", "competitor analysis"], "abstract": "State-of-the-art classical  influence maximization  (IM) techniques are \"competition-unaware\" as they assume that a group (company) finds seeds (users) in a network independent of other groups who are also simultaneously interested in finding such seeds in the same network. However, in reality several groups often compete for the same market ( e.g., Samsung, HTC,  and  Apple  for the smart phone market) and hence may attempt to select seeds in the same network. This has led to increasing body of research in devising IM techniques for  competitive  networks. Despite the considerable progress made by these efforts toward finding seeds in a more realistic settings, unfortunately, they still make several unrealistic assumptions ( e.g. , a new company being aware of a rival's strategy,  alternate  seed selection, etc.) making their deployment impractical in real-world networks. In this paper, we propose a novel framework based on game theory to provide a more realistic solution to the IM problem in competitive networks by jettisoning these unrealistic assumptions. Specifically, we seek to find the \"best\" IM  strategy  (an algorithm or a mixture of algorithms) a group should adopt in the presence of rivals so that it can maximize its influence. As each group adopts some strategy, we model the problem as a game with each group as competitors and the expected influences under the strategies as payoffs. We propose a novel algorithm called GetReal to find each group's best solution by leveraging the competition between different groups. Specifically, it seeks to find whether there exist a  Nash Equilibrium  (NE) in a game, which guarantees that there exist an \"optimal\" strategy for each group. Our experimental study on real-world networks demonstrates the superiority of our solution in a more realistic environment.", "citation": "Citations (8)", "year": "2015", "departments": ["Xidian University", "Nanyang Technological University", "Xidian University", "Zhejiang University", "Xidian University"], "conf": "sigmod", "authors": ["Hui Li.....http://dblp.org/pers/hd/l/Li_0005:Hui", "Sourav S. Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick:Sourav_S=", "Jiangtao Cui.....http://dblp.org/pers/hd/c/Cui:Jiangtao", "Yunjun Gao.....http://dblp.org/pers/hd/g/Gao:Yunjun", "Jianfeng Ma.....http://dblp.org/pers/hd/m/Ma:Jianfeng"], "pages": 13}