{"title": "Reasoning with Style.", "fields": ["html", "css code", "style sheet", "cascading style sheets", "code refactoring"], "abstract": "The Cascading Style Sheets (CSS) language constitutes a key component of web applications. It offers a series of sophisticated features to stylize web pages. Its apparent simplicity and power are however counter-balanced by the difficulty of debugging and maintaining style sheets, tasks for which developers still lack appropriate tools. In particular, significant portions of CSS code become either useless or redundant, and tend to accumulate over time. The situation becomes even worse as more complex features are added to the CSS language (e.g. CSS3 powerful selectors). A direct consequence is a waste of CPU that is required to display web pages, as well as the significant amount of useless traffic at web scale.\n\nStyle sheets are designed to operate on a set of documents (possibly generated). However, existing techniques consist in syntax validators, optimizers and runtime debuggers that operate in one particular document instance. As such, they do not provide guarantees concerning all web pages in CSS refactoring, such as preservation of the formatting. This is partly because they are essentially syntactic and do not take advantage of CSS semantics to detect redundancies.\n\nWe propose a set of automated refactoring techniques aimed at removing redundant and inaccessible declarations and rules, without affecting the layout of any document to which the style sheet is applied. We implemented a prototype that has been extensively tested with popular web sites (such as Google Sites, CNN, Apple, etc.). We show that significant size reduction can be obtained while preserving the code readability and improving maintainability.", "citation": "Citations (1)", "departments": ["Polytechnic University of Catalonia", "Centre national de la recherche scientifique", "French Institute for Research in Computer Science and Automation"], "authors": ["Martí Bosch.....http://dblp.org/pers/hd/b/Bosch:Mart=iacute=", "Pierre Genevès.....http://dblp.org/pers/hd/g/Genev=egrave=s:Pierre", "Nabil Layaïda.....http://dblp.org/pers/hd/l/Laya=iuml=da:Nabil"], "conf": "ijcai", "year": "2015", "pages": 7}