{"title": "Coupled Sequence Labeling on Heterogeneous Annotations: POS Tagging as a Case Study.", "fields": ["sequence labeling", "pattern recognition", "conditional random field", "bundle", "annotation"], "abstract": "In order to effectively utilize multiple datasets with heterogeneous annotations, this paper proposes a coupled sequence labeling model that can directly learn and infer two heterogeneous annotations simultaneously, and to facilitate discussion we use Chinese part-ofspeech (POS) tagging as our case study. The key idea is to bundle two sets of POS tags together (e.g. “[NN, n]”), and build a conditional random field (CRF) based tagging model in the enlarged space of bundled tags with the help of ambiguous labelings. To train our model on two non-overlapping datasets that each has only one-side tags, we transform a one-side tag into a set of bundled tags by considering all possible mappings at the missing side and derive an objective function based on ambiguous labelings. The key advantage of our coupled model is to provide us with the flexibility of 1) incorporating joint features on the bundled tags to implicitly learn the loose mapping between heterogeneous annotations, and 2) exploring separate features on one-side tags to overcome the data sparseness problem of using only bundled tags. Experiments on benchmark datasets show that our coupled model significantly outperforms the state-ofthe-art baselines on both one-side POS tagging and annotation conversion tasks. The codes and newly annotated data are released for non-commercial usage.1 ∗Correspondence author. http://hlt.suda.edu.cn/ ̃zhli", "citation": "Citations (11)", "year": "2015", "departments": ["Soochow University", "Soochow University", "Soochow University", "Soochow University"], "conf": "acl", "authors": ["Zhenghua Li.....http://dblp.org/pers/hd/l/Li:Zhenghua", "Jiayuan Chao.....http://dblp.org/pers/hd/c/Chao:Jiayuan", "Min Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Min", "Wenliang Chen.....http://dblp.org/pers/hd/c/Chen:Wenliang"], "pages": 10}