{"title": "Efficient Anytime Techniques for Model-Based Safety Analysis.", "fields": ["counterexample", "fault tree analysis", "formal verification", "monotonic function", "formal methods"], "abstract": "Safety analysis investigates system behavior under faulty conditions. It is a fundamental step in the design of complex systems, that is often mandated by certification procedures. Safety analysis includes two key steps: the construction of all minimal cut sets (MCSs) for a given property (i.e. the sets of basic faults that may cause a failure), and the computation of the corresponding probability (given probabilities for the basic faults). Model-based Safety Analysis relies on formal verification to carry out these tasks. However, the available techniques suffer from scalability problems, and are unable to provide useful results if the computation does not complete. In this paper, we investigate and evaluate a family of IC3-based algorithms for MCSs computation. We work under the monotonicity assumption of safety analysis (i.e. an additional fault can not prevent the violation of the property). We specialize IC3-based routines for parame- ter synthesis by optimizing the counterexample generalization, by order- ing the exploration of MCSs based on increasing cardinality, and by exploiting the inductive invariants built by IC3 to accelerate convergence. Other enhancements yield an \"anytime\" algorithm, able to produce an increasingly precise probability estimate as the discovery of MCSs proceeds, even when the computation does not terminate. A thorough experimental evaluation clearly demonstrates the substan- tial advances resulting from the proposed methods.", "citation": "Citations (12)", "year": "2015", "departments": ["fondazione bruno kessler", "fondazione bruno kessler", "fondazione bruno kessler", "fondazione bruno kessler"], "conf": "cav", "authors": ["Marco Bozzano.....http://dblp.org/pers/hd/b/Bozzano:Marco", "Alessandro Cimatti.....http://dblp.org/pers/hd/c/Cimatti:Alessandro", "Alberto Griggio.....http://dblp.org/pers/hd/g/Griggio:Alberto", "Cristian Mattarei.....http://dblp.org/pers/hd/m/Mattarei:Cristian"], "pages": 19}