{"title": "Index policies for optimal mean-variance trade-off of inter-delivery times in real-time sensor networks.", "fields": ["network packet", "trade off", "fading", "markov decision process", "schedule"], "abstract": "A problem of much current practical interest is the replacement of the wiring infrastructure connecting approximately 200 sensor and actuator nodes in automobiles by an access point. This is motivated by the considerable savings in automobile weight, simplification of manufacturability, and future upgradability. A key issue is how to schedule the nodes on the shared access point so as to provide regular packet delivery. In this and other similar applications, the mean of the inter-delivery times of packets, i.e., throughput, is not sufficient to guarantee service-regularity. The time-averaged variance of the inter-delivery times of packets is also an important metric. So motivated, we consider a wireless network where an Access Point schedules real-time generated packets to nodes over a fading wireless channel. We are interested in designing simple policies which achieve optimal mean-variance tradeoff in interdelivery times of packets by minimizing the sum of time-averaged means and variances over all clients. Our goal is to explore the full range of the Pareto frontier of all weighted linear combinations of mean and variance so that one can fully exploit the design possibilities. We transform this problem into a Markov decision process and show that the problem of choosing which node's packet to transmit in each slot can be formulated as a bandit problem. We establish that this problem is indexable and explicitly derive the Whittle indices. The resulting Index policy is optimal in certain cases. We also provide upper and lower bounds on the cost for any policy. Extensive simulations show that Index policies perform better than previously proposed policies.", "citation": "Citations (8)", "departments": ["Texas A&M University", "Tsinghua University", "Texas A&M University"], "authors": ["Rahul Singh.....http://dblp.org/pers/hd/s/Singh:Rahul", "Xueying Guo.....http://dblp.org/pers/hd/g/Guo:Xueying", "P. R. Kumar.....http://dblp.org/pers/hd/k/Kumar:P=_R="], "conf": "infocom", "year": "2015", "pages": 8}