{"title": "Clean Application Compartmentalization with SOAAP.", "fields": ["vulnerability", "correctness", "compartmentalization", "conceptual framework", "software"], "abstract": "Application compartmentalization, a vulnerability mitigation technique employed in programs such as OpenSSH and the Chromium web browser, decomposes software into isolated components to limit privileges leaked or otherwise available to attackers. However, compartmentalizing applications -- and maintaining that compartmentalization -- is hindered by ad hoc methodologies and significantly increased programming effort. In practice, programmers stumble through (rather than overtly reason about) compartmentalization spaces of possible decompositions, unknowingly trading off correctness, security, complexity, and performance. We present a new conceptual framework embodied in an LLVM-based tool: the Security-Oriented Analysis of Application Programs (SOAAP) that allows programmers to reason about compartmentalization using source-code annotations (compartmentalization hypotheses). We demonstrate considerable benefit when creating new compartmentalizations for complex applications, and analyze existing compartmentalized applications to discover design faults and maintenance issues arising from application evolution.", "citation": "Citations (14)", "year": "2015", "departments": ["University of Cambridge", "University of Cambridge", "St. John's University", "University of Cambridge", "SRI International"], "conf": "ccs", "authors": ["Khilan Gudka.....http://dblp.org/pers/hd/g/Gudka:Khilan", "Robert N. M. Watson.....http://dblp.org/pers/hd/w/Watson:Robert_N=_M=", "Jonathan Anderson.....http://dblp.org/pers/hd/a/Anderson:Jonathan", "David Chisnall.....http://dblp.org/pers/hd/c/Chisnall:David", "Brooks Davis.....http://dblp.org/pers/hd/d/Davis:Brooks", "Ben Laurie.....http://dblp.org/pers/hd/l/Laurie:Ben", "Ilias Marinos.....http://dblp.org/pers/hd/m/Marinos:Ilias", "Peter G. Neumann.....http://dblp.org/pers/hd/n/Neumann:Peter_G=", "Alex Richardson.....http://dblp.org/pers/hd/r/Richardson:Alex"], "pages": 16}