{"title": "Towards unified depth and semantic prediction from a single image.", "fields": ["inference", "computer vision", "convolutional neural network", "conditional random field", "machine learning"], "abstract": "Depth estimation and semantic segmentation are two fundamental problems in image understanding. While the two tasks are strongly correlated and mutually beneficial, they are usually solved separately or sequentially. Motivated by the complementary properties of the two tasks, we propose a unified framework for joint depth and semantic prediction. Given an image, we first use a trained Convolutional Neural Network (CNN) to jointly predict a global layout composed of pixel-wise depth values and semantic labels. By allowing for interactions between the depth and semantic information, the joint network provides more accurate depth prediction than a state-of-the-art CNN trained solely for depth prediction [6]. To further obtain fine-level details, the image is decomposed into local segments for region-level depth and semantic prediction under the guidance of global layout. Utilizing the pixel-wise global prediction and region-wise local prediction, we formulate the inference problem in a two-layer Hierarchical Conditional Random Field (HCRF) to produce the final depth and semantic map. As demonstrated in the experiments, our approach effectively leverages the advantages of both tasks and provides the state-of-the-art results.", "citation": "Citations (129)", "year": "2015", "departments": ["University of California, Los Angeles", "Adobe Systems", "Adobe Systems", "Adobe Systems", "Adobe Systems"], "conf": "cvpr", "authors": ["Peng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Peng", "Xiaohui Shen.....http://dblp.org/pers/hd/s/Shen:Xiaohui", "Zhe Lin.....http://dblp.org/pers/hd/l/Lin_0001:Zhe", "Scott Cohen.....http://dblp.org/pers/hd/c/Cohen:Scott", "Brian L. Price.....http://dblp.org/pers/hd/p/Price:Brian_L=", "Alan L. Yuille.....http://dblp.org/pers/hd/y/Yuille:Alan_L="], "pages": 10}