{"title": "ISP-friendly peer-assisted on-demand streaming of long duration content in BBC iPlayer.", "fields": ["computer network", "swarm behaviour", "obstacle", "distributed computing", "scalability"], "abstract": "In search of scalable solutions, CDNs are exploring P2P support. However, the benefits of peer assistance can be limited by various obstacle factors such as ISP friendliness — requiring peers to be within the same ISP, bitrate stratification — the need to match peers with others needing similar bitrate, and partial participation — some peers choosing not to redistribute content. This work relates potential gains from peer assistance to the average number of users in a swarm, its capacity, and empirically studies the effects of these obstacle factors at scale, using a month-long trace of over 2 million users in London accessing BBC shows online. Results indicate that even when P2P swarms are localised within ISPs, up to 88% of traffic can be saved. Surprisingly, bitrate stratification results in 2 large sub-swarms and does not significantly affect savings. However, partial participation, and the need for a minimum swarm size do affect gains. We investigate improvements to gain from increasing content availability through two well-studied techniques: content bundling- combining multiple items to increase availability, and historical caching of previously watched items. Bundling proves ineffective as increased server traffic from larger bundles outweighs benefits of availability, but simple caching can considerably boost traffic gains from peer assistance.", "citation": "Citations (21)", "departments": ["King's College London", "King's College London", "BBC R&D, London, UK", "BBC R&D, London, UK"], "authors": ["Dmytro Karamshuk.....http://dblp.org/pers/hd/k/Karamshuk:Dmytro", "Nishanth Sastry.....http://dblp.org/pers/hd/s/Sastry:Nishanth", "Andrew Secker.....http://dblp.org/pers/hd/s/Secker:Andrew", "Jigna Chandaria.....http://dblp.org/pers/hd/c/Chandaria:Jigna"], "conf": "infocom", "year": "2015", "pages": 9}