{"title": "\"Anti-Caching\"-based elastic memory management for Big Data.", "fields": ["uniform memory access", "overlay", "flat memory model", "memory map", "in memory processing"], "abstract": "The increase in the capacity of main memory coupled with the decrease in cost has fueled the development of in-memory database systems that manage data entirely in memory, thereby eliminating the disk I/O bottleneck. However, as we shall explain, in the Big Data era, maintaining all data in memory is impossible, and even unnecessary. Ideally we would like to have the high access speed of memory, with the large capacity and low price of disk. This hinges on the ability to effectively utilize both the main memory and disk. In this paper, we analyze state-of-the-art approaches to achieving this goal for in-memory databases, which is called as “Anti-Caching” to distinguish it from traditional caching mechanisms. We conduct extensive experiments to study the effect of each fine-grained component of the entire process of “Anti-Caching” on both performance and prediction accuracy. To avoid the interference from other unrelated components of specific systems, we implement these approaches on a uniform platform to ensure a fair comparison. We also study the usability of each approach, and how intrusive it is to the systems that intend to incorporate it. Based on our findings, we propose some guidelines on designing a good “Anti-Caching” approach, and sketch a general and efficient approach, which can be utilized in most in-memory database systems without much code modification.", "citation": "Citations (4)", "departments": ["National University of Singapore", "Zhejiang University", "National University of Singapore", "National University of Singapore", "yzBigData Co., Ltd., China"], "authors": ["Hao Zhang.....http://dblp.org/pers/hd/z/Zhang_0029:Hao", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Weng-Fai Wong.....http://dblp.org/pers/hd/w/Wong:Weng=Fai", "Shensen Wu.....http://dblp.org/pers/hd/w/Wu:Shensen", "Yubin Xia.....http://dblp.org/pers/hd/x/Xia:Yubin"], "conf": "icde", "year": "2015", "pages": 12}