{"title": "FlexJava: language support for safe and modular approximate programming.", "fields": ["software development", "programming paradigm", "annotation", "modular design", "compiler"], "abstract": "Energy efficiency is a primary constraint in modern systems. Approximate computing is a promising approach that trades quality of result for gains in efficiency and performance. State- of-the-art approximate programming models require extensive manual annotations on program data and operations to guarantee safe execution of approximate programs. The need for extensive manual annotations hinders the practical use of approximation techniques. This paper describes FlexJava, a small set of language extensions, that significantly reduces the annotation effort, paving the way for practical approximate programming. These extensions enable programmers to annotate approximation-tolerant method outputs. The FlexJava compiler, which is equipped with an approximation safety analysis, automatically infers the operations and data that affect these outputs and selectively marks them approximable while giving safety guarantees. The automation and the language–compiler codesign relieve programmers from manually and explicitly an- notating data declarations or operations as safe to approximate. FlexJava is designed to support safety, modularity, generality, and scalability in software development. We have implemented FlexJava annotations as a Java library and we demonstrate its practicality using a wide range of Java applications and by con- ducting a user study. Compared to EnerJ, a recent approximate programming system, FlexJava provides the same energy savings with significant reduction (from 2× to 17×) in the number of annotations. In our user study, programmers spend 6× to 12× less time annotating programs using FlexJava than when using EnerJ.", "citation": "Citations (19)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Jongse Park.....http://dblp.org/pers/hd/p/Park:Jongse", "Hadi Esmaeilzadeh.....http://dblp.org/pers/hd/e/Esmaeilzadeh:Hadi", "Xin Zhang.....http://dblp.org/pers/hd/z/Zhang:Xin", "Mayur Naik.....http://dblp.org/pers/hd/n/Naik:Mayur", "William Harris.....http://dblp.org/pers/hd/h/Harris:William"], "conf": "sigsoft", "year": "2015", "pages": 13}