{"title": "Multi-Constrained Graph Pattern Matching in large-scale contextual social graphs.", "fields": ["graph bandwidth", "graph", "moral graph", "3 dimensional matching", "clique width"], "abstract": "Graph Pattern Matching (GPM) plays a significant role in social network analysis, which has been widely used in, for example, experts finding, social community mining and social position detection. Given a pattern graph G Q  and a data graph G D , a GPM algorithm finds those subgraphs, G M , that match G Q  in G D . However, the existing GPM methods do not consider the multiple constraints on edges in G Q , which are commonly exist in various applications such as, crowdsourcing travel, social network based e-commerce and study group selection, etc. In this paper, we first conceptually extend Bounded Simulation to Multi-Constrained Simulation (MCS), and propose a novel NP-Complete Multi-Constrained Graph Pattern Matching (MC-GPM) problem. Then, to address the efficiency issue in large-scale MC-GPM, we propose a new concept called Strong Social Component (SSC), consisting of participants with strong social connections. We also propose an approach to identify SSCs, and propose a novel index method and a graph compression method for SSC. Moreover, we devise a heuristic algorithm to identify MC-GPM results effectively and efficiently without decompressing graphs. An extensive empirical study on five real-world large-scale social graphs has demonstrated the effectiveness, efficiency and scalability of our approach.", "citation": "Citations (10)", "departments": ["Soochow University", "University of Queensland", "Macquarie University", "Macquarie University", "Soochow University"], "authors": ["Guanfeng Liu.....http://dblp.org/pers/hd/l/Liu:Guanfeng", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Yan Wang.....http://dblp.org/pers/hd/w/Wang_0002:Yan", "Mehmet A. Orgun.....http://dblp.org/pers/hd/o/Orgun:Mehmet_A=", "An Liu.....http://dblp.org/pers/hd/l/Liu_0002:An", "Lei Zhao.....http://dblp.org/pers/hd/z/Zhao_0001:Lei", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "icde", "year": "2015", "pages": 12}