{"title": "More Efficient Oblivious Transfer Extensions with Security for Malicious Adversaries.", "fields": ["random oracle", "secure multi party computation", "oblivious transfer", "small number", "hash function"], "abstract": "Oblivious transfer (OT) is one of the most fundamental primitives in cryptography and is widely used in protocols for secure two-party and multi-party computation. As secure computation becomes more practical, the need for practical large scale oblivious transfer protocols is becoming more evident. Oblivious transfer extensions are protocols that enable a relatively small number of \\base-OTs\" to be utilized to compute a very large number of OTs at low cost. In the semi-honest setting, Ishai et al. (CRYPTO 2003) presented an OT extension protocol for which the cost of each OT (beyond the base-OTs) is just a few hash function operations. In the malicious setting, Nielsen et al. (CRYPTO 2012) presented an ecient OT extension protocol for the setting of active adversaries, that is secure in the random oracle model. In this work, we present an OT extension protocol for the setting of malicious adversaries that is more ecient and uses less communication than previous works. In addition, our protocol can be proven secure in both the random oracle model, and in the standard model with a type of correlation robustness. Given the importance of OT in many secure computation protocols, increasing the eciency of OT extensions is another important step forward to making secure computation practical.", "citation": "Citations (60)", "year": "2015", "departments": ["Hebrew University of Jerusalem", "Bar-Ilan University", "Technische Universität Darmstadt", "Technische Universität Darmstadt"], "conf": "eurocrypt", "authors": ["Gilad Asharov.....http://dblp.org/pers/hd/a/Asharov:Gilad", "Yehuda Lindell.....http://dblp.org/pers/hd/l/Lindell:Yehuda", "Thomas Schneider.....http://dblp.org/pers/hd/s/Schneider_0003:Thomas", "Michael Zohner.....http://dblp.org/pers/hd/z/Zohner:Michael"], "pages": 29}