{"title": "Efficient Classifier Training to Minimize False Merges in Electron Microscopy Segmentation.", "fields": ["segmentation based object categorization", "segmentation", "classifier", "scale space segmentation", "tracing"], "abstract": "The prospect of neural reconstruction from Electron Microscopy (EM) images has been elucidated by the automatic segmentation algorithms. Although segmentation algorithms eliminate the necessity of tracing the neurons by hand, significant manual effort is still essential for correcting the mistakes they make. A considerable amount of human labor is also required for annotating groundtruth volumes for training the classifiers of a segmentation framework. It is critically important to diminish the dependence on human interaction in the overall reconstruction system. This study proposes a novel classifier training algorithm for EM segmentation aimed to reduce the amount of manual effort demanded by the groundtruth annotation and error refinement tasks. Instead of using an exhaustive pixel level groundtruth, an active learning algorithm is proposed for sparse labeling of pixel and boundaries of superpixels. Because over-segmentation errors are in general more tolerable and easier to correct than the under-segmentation errors, our algorithm is designed to prioritize minimization of false-merges over false-split mistakes. Our experiments on both 2D and 3D data suggest that the proposed method yields segmentation outputs that are more amenable to neural reconstruction than those of existing methods.", "citation": "Citations (4)", "year": "2015", "departments": ["Dalle Molle Institute for Artificial Intelligence Research", "Dalle Molle Institute for Artificial Intelligence Research", "HHMI Janelia Re ... shburn, VA, USA"], "conf": "iccv", "authors": ["Toufiq Parag.....http://dblp.org/pers/hd/p/Parag:Toufiq", "Dan C. Ciresan.....http://dblp.org/pers/hd/c/Ciresan:Dan_C=", "Alessandro Giusti.....http://dblp.org/pers/hd/g/Giusti:Alessandro"], "pages": 9}