{"title": "Use at your own risk: the Java unsafe API in the wild.", "fields": ["java api for xml based rpc", "generics in java", "java bytecode", "java concurrency", "strictfp"], "abstract": "Java is a safe language. Its runtime environment provides strong safety guarantees that any Java application can rely on. Or so we think. We show that the runtime actually does not provide these guarantees---for a large fraction of today's Java code. Unbeknownst to many application developers, the Java runtime includes a \"backdoor\" that allows expert library and framework developers to circumvent Java's safety guarantees. This backdoor is there by design, and is well known to experts, as it enables them to write high-performance \"systems-level\" code in Java. For much the same reasons that safe languages are preferred over unsafe languages, these powerful---but unsafe---capabilities in Java should be restricted. They should be made safe by changing the language, the runtime system, or the libraries. At the very least, their use should be restricted. This paper is a step in that direction. We analyzed 74 GB of compiled Java code, spread over 86,479 Java archives, to determine how Java's unsafe capabilities are used in real-world libraries and applications. We found that 25% of Java bytecode archives depend on unsafe third-party Java code, and thus Java's safety guarantees cannot be trusted. We identify 14 different usage patterns of Java's unsafe capabilities, and we provide supporting evidence for why real-world code needs these capabilities. Our long-term goal is to provide a foundation for the design of new language features to regain safety in Java.", "citation": "Citations (19)", "departments": ["University of Lugano", "University of Lugano", "University of Lugano", "University of Lugano", "University of Lugano"], "authors": ["Luis Mastrangelo.....http://dblp.org/pers/hd/m/Mastrangelo:Luis", "Luca Ponzanelli.....http://dblp.org/pers/hd/p/Ponzanelli:Luca", "Andrea Mocci.....http://dblp.org/pers/hd/m/Mocci:Andrea", "Michele Lanza.....http://dblp.org/pers/hd/l/Lanza:Michele", "Matthias Hauswirth.....http://dblp.org/pers/hd/h/Hauswirth:Matthias", "Nathaniel Nystrom.....http://dblp.org/pers/hd/n/Nystrom:Nathaniel"], "conf": "oopsla", "year": "2015", "pages": 16}