{"title": "New insights into Laplacian similarity search.", "fields": ["strength of a graph", "graph bandwidth", "quartic graph", "incidence matrix", "degree matrix"], "abstract": "Graph-based computer vision applications rely critically on similarity metrics which compute the pairwise similarity between any pair of vertices on graphs. This paper investigates the fundamental design of commonly used similarity metrics, and provides new insights to guide their use in practice. In particular, we introduce a family of similarity metrics in the form of (L + αΛ) −1 , where L is the graph Laplacian, Λ is a positive diagonal matrix acting as a regularizer, and α is a positive balancing factor. Such metrics respect graph topology when a is small, and reproduce well-known metrics such as hitting times and the pseudo-inverse of graph Laplacian with different regularizer Λ. This paper is the first to analyze the important impact of selecting Λ in retrieving the local cluster from a seed. We find that different Λ can lead to surprisingly complementary behaviors: Λ = D (degree matrix) can reliably extract the cluster of a query if it is sparser than surrounding clusters, while Λ = I (identity matrix) is preferred if it is denser than surrounding clusters. Since in practice there is no reliable way to determine the local density in order to select the right model, we propose a new design of Λ that automatically adapts to the local density. Experiments on image retrieval verify our theoretical arguments and confirm the benefit of the proposed metric. We expect the insights of our theory to provide guidelines for more applications in computer vision and other domains.", "citation": "Citations (2)", "year": "2015", "departments": ["Columbia University", "Huawei", "Columbia University"], "conf": "cvpr", "authors": ["Xiao-Ming Wu.....http://dblp.org/pers/hd/w/Wu:Xiao=Ming", "Zhenguo Li.....http://dblp.org/pers/hd/l/Li:Zhenguo", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "pages": 9}