{"title": "From Developer Networks to Verified Communities: A Fine-Grained Approach.", "fields": ["software design description", "software peer review", "software sizing", "resource oriented architecture", "backporting"], "abstract": "Effective software engineering demands a coordinated effort. Unfortunately, a comprehensive view on developer coordination is rarely available to support software-engineering decisions, despite the significant implications on software quality, software architecture, and developer productivity. We present a fine-grained, verifiable, and fully automated approach to capture a view on developer coordination, based on commit information and source-code structure, mined from version-control systems. We apply methodology from network analysis and machine learning to identify developer communities automatically. Compared to previous work, our approach is fine-grained, and identifies statistically significant communities using order-statistics and a community-verification technique based on graph conductance. To demonstrate the scalability and generality of our approach, we analyze ten open-source projects with complex and active histories, written in various programming languages. By surveying 53 open-source developers from the ten projects, we validate the authenticity of inferred community structure with respect to reality. Our results indicate that developers of open-source projects form statistically significant community structures and this particular view on collaboration largely coincides with developers' perceptions of real-world collaboration.", "citation": "Citations (16)", "departments": ["Siemens", "Siemens", "University of Passau", "University of Passau", "University of Erlangen-Nuremberg"], "authors": ["Mitchell Joblin.....http://dblp.org/pers/hd/j/Joblin:Mitchell", "Wolfgang Mauerer.....http://dblp.org/pers/hd/m/Mauerer:Wolfgang", "Sven Apel.....http://dblp.org/pers/hd/a/Apel:Sven", "Janet Siegmund.....http://dblp.org/pers/hd/s/Siegmund:Janet", "Dirk Riehle.....http://dblp.org/pers/hd/r/Riehle:Dirk"], "conf": "icse", "year": "2015", "pages": 11}