{"title": "Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas.", "fields": ["management science", "creativity", "leverage", "scalability", "ideation"], "abstract": "A growing number of large collaborative idea generation platforms promise that by generating ideas together, people can create better ideas than any would have alone. But how might these platforms best leverage the number and diversity of contributors to help each contributor generate even better ideas? Prior research suggests that seeing particularly creative or diverse ideas from others can inspire you, but few scalable mechanisms exist to assess diversity. We contribute a new scalable crowd-powered method for evaluating the diversity of sets of ideas. The method relies on similarity comparisons (is idea A more similar to B or C) generated by non-experts to create an abstract spatial idea map. Our validation study reveals that human raters agree with the estimates of dissimilarity derived from our idea map as much or more than they agree with each other. People seeing the diverse sets of examples from our idea map generate more diverse ideas than those seeing randomly selected examples. Our results also corroborate findings from prior research showing that people presented with creative examples generated more creative ideas than those who saw a set of random examples. We see this work as a step toward building more effective online systems for supporting large scale collective ideation.", "citation": "Citations (24)", "departments": ["Harvard University", "Harvard University", "Harvard University", "Carnegie Mellon University"], "authors": ["Pao Siangliulue.....http://dblp.org/pers/hd/s/Siangliulue:Pao", "Kenneth C. Arnold.....http://dblp.org/pers/hd/a/Arnold:Kenneth_C=", "Krzysztof Z. Gajos.....http://dblp.org/pers/hd/g/Gajos:Krzysztof_Z=", "Steven P. Dow.....http://dblp.org/pers/hd/d/Dow:Steven_P="], "conf": "cscw", "year": "2015", "pages": 9}