{"title": "Quantum Spectrum Testing.", "fields": ["representation theory of the symmetric group", "invariant", "property testing", "sublinear function", "quantum state"], "abstract": "In this work, we study the problem of testing properties of the spectrum of a mixed quantum state. Here one is given n copies of a mixed state ρ∈ C d x d  and the goal is to distinguish (with high probability) whether ρ's spectrum satisfies some property P or whether it is at least e-far in l 1 -distance from satisfying P. This problem was promoted under the name of testing unitarily invariant properties of mixed states. It is the natural quantum analogue of the classical problem of testing symmetric properties of probability distributions.   Unlike property testing probability distributions---where one generally hopes for algorithms with sample complexity that is sublinear in the domain size---here the hope is for algorithms with  subquadratic  copy complexity in the dimension d. This is because the (frequently rediscovered) \"empirical Young diagram (EYD) algorithm\" [ARS88,KW01,HM02,CM06] can estimate the spectrum of any mixed state up to e-accuracy using only O(d 2 /e 2 ) copies. In this work, we show that given a mixed state ρ ∈ C d x d : Θ(d/e 2 ) copies are necessary and sufficient to test whether ρ is the maximally mixed state, i.e., has spectrum (1/d, ..., 1/d). This can be viewed as the quantum analogue of a result of Paninski [Pan08]. Θ(r 2 /e) copies are necessary and sufficient to test with one-sided error whether ρ has rank r, i.e., has at most r nonzero eigenvalues. For two-sided error, a lower bound of Ω(r/e) copies holds. Θ(r 2 ) copies are necessary and sufficient to distinguish whether ρ is maximally mixed on an r-dimensional or an (r+1)-dimensional subspace. More generally, for r vs. r+Δ (with 1 ≤ Δ ≤ r), Θ(r 2 /Δ) copies are necessary and sufficient. The EYD algorithm requires Ω(d 2 /e 2 ) copies to estimate the spectrum of ρ up to e-accuracy, nearly matching the known upper bound. Our techniques involve the asymptotic representation theory of the symmetric group; in particular Kerov's algebra of polynomial functions on Young diagrams.", "citation": "Citations (13)", "year": "2015", "departments": ["Carnegie Mellon University", "Carnegie Mellon University"], "conf": "stoc", "authors": ["Ryan O'Donnell.....http://dblp.org/pers/hd/o/O=Donnell:Ryan", "John Wright.....http://dblp.org/pers/hd/w/Wright:John"], "pages": 10}