{"title": "STREAMCUBE: Hierarchical spatio-temporal hashtag clustering for event exploration over the Twitter stream.", "fields": ["ranking", "granularity", "speedup", "data cube", "zoom"], "abstract": "What is happening around the world? When and where? Mining the geo-tagged Twitter stream makes it possible to answer the above questions in real-time. Although a single tweet can be short and noisy, proper aggregations of tweets can provide meaningful results. In this paper, we focus on hierarchical spatio-temporal hashtag clustering techniques. Our system has the following features: (1) Exploring events (hashtag clusters) with different space granularity. Users can zoom in and out on maps to find out what is happening in a particular area. (2) Exploring events with different time granularity. Users can choose to see what is happening today or in the past week. (3) Efficient single-pass algorithm for event identification, which provides human-readable hashtag clusters. (4) Efficient event ranking which aims to find burst events and localized events given a particular region and time frame. To support aggregation with different space and time granularity, we propose a data structure called STREAMCUBE, which is an extension of the data cube structure from the database community with spatial and temporal hierarchy. To achieve high scalability, we propose a divide-and-conquer method to construct the STREAMCUBE. To support flexible event ranking with different weights, we proposed a top-k based index. Different efficient methods are used to speed up event similarity computations. Finally, we have conducted extensive experiments on a real twitter data. Experimental results show that our framework can provide meaningful results with high scalability.", "citation": "Citations (71)", "departments": ["Tsinghua University", "University of Illinois at Urbana–Champaign", "Tsinghua University", "University of Illinois at Urbana–Champaign", "Tsinghua University"], "authors": ["Wei Feng.....http://dblp.org/pers/hd/f/Feng:Wei", "Chao Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao", "Wei Zhang.....http://dblp.org/pers/hd/z/Zhang_0056:Wei", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Jianyong Wang.....http://dblp.org/pers/hd/w/Wang:Jianyong", "Charu C. Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Charu_C=", "Jianbin Huang.....http://dblp.org/pers/hd/h/Huang:Jianbin"], "conf": "icde", "year": "2015", "pages": 12}