{"title": "Max Is More than Min: Solving Maximization Problems with Heuristic Search.", "fields": ["beam search", "incremental heuristic search", "maximization", "dijkstra s algorithm", "path", "min conflicts algorithm", "bidirectional search"], "abstract": "Most work in heuristic search considers problems where a low cost solution is preferred (MIN problems). In this paper, we investigate the complementary setting where a solution of high reward is preferred (MAX problems). Example MAX problems include finding the longest simple path in a graph, maximal coverage, and various constraint optimization problems. We examine several popular search algorithms for MIN problems — optimal, suboptimal, and bounded suboptimal - and discover the curious ways in which they misbehave on MAX problems.  We propose modifications that preserve the original intentions behind the algorithms but allow them to solve MAX problems, and compare them theoretically and empirically.  Interesting results include the failure of bidirectional search and a discovered close relationships between Dijkstra's algorithm, weighted A*, and depth-first search. This work demonstrates that MAX problems demand their own heuristic search algorithms, which are worthy objects of study in their own right.", "citation": "Not cited", "departments": ["Ben-Gurion University of the Negev", "University of New Hampshire", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "University of New Hampshire", "Ben-Gurion University of the Negev", "University of New Hampshire", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "University of New Hampshire"], "authors": ["Roni Stern.....http://dblp.org/pers/hd/s/Stern:Roni", "Scott Kiesel.....http://dblp.org/pers/hd/k/Kiesel:Scott", "Rami Puzis.....http://dblp.org/pers/hd/p/Puzis:Rami", "Ariel Felner.....http://dblp.org/pers/hd/f/Felner:Ariel", "Wheeler Ruml.....http://dblp.org/pers/hd/r/Ruml:Wheeler"], "conf": "ijcai", "year": "2015", "pages": 7}