{"title": "Modeling Spatial-Temporal Clues in a Hybrid Deep Learning Framework for Video Classification.", "fields": ["long short term memory", "softmax function", "convolutional neural network", "spatial analysis", "deep learning"], "abstract": "Classifying videos according to content semantics is an important problem with a wide range of applications. In this paper, we propose a hybrid deep learning framework for video classification, which is able to model static spatial information, short-term motion, as well as long-term temporal clues in the videos. Specifically, the spatial and the short-term motion features are extracted separately by two Convolutional Neural Networks (CNN). These two types of CNN-based features are then combined in a regularized feature fusion network for classification, which is able to learn and utilize feature relationships for improved performance. In addition, Long Short Term Memory (LSTM) networks are applied on top of the two features to further model longer-term temporal clues. The main contribution of this work is the hybrid learning framework that can model several important aspects of the video data. We also show that (1) combining the spatial and the short-term motion features in the regularized fusion network is better than direct classification and fusion using the CNN with a softmax layer, and (2) the sequence-based LSTM is highly complementary to the traditional classification strategy without considering the temporal frame orders. Extensive experiments are conducted on two popular and challenging benchmarks, the UCF-101 Human Actions and the Columbia Consumer Videos (CCV). On both benchmarks, our framework achieves very competitive performance: 91.3% on the UCF-101 and 83.5% on the CCV.", "citation": "Citations (176)", "departments": ["Fudan University", "Fudan University", "Fudan University", "Fudan University", "Fudan University"], "authors": ["Zuxuan Wu.....http://dblp.org/pers/hd/w/Wu:Zuxuan", "Xi Wang.....http://dblp.org/pers/hd/w/Wang:Xi", "Yu-Gang Jiang.....http://dblp.org/pers/hd/j/Jiang:Yu=Gang", "Hao Ye.....http://dblp.org/pers/hd/y/Ye:Hao", "Xiangyang Xue.....http://dblp.org/pers/hd/x/Xue:Xiangyang"], "conf": "mm", "year": "2015", "pages": 10}