{"title": "Demonstration of Taghreed: A system for querying, analyzing, and visualizing geotagged microblogs.", "fields": ["backup", "microblogging", "query optimization", "indexer", "query plan"], "abstract": "This paper demonstrates Taghreed; a full-fledged system for efficient and scalable querying, analyzing, and visualizing geotagged microblogs, such as tweets. Taghreed supports a wide variety of queries on all microblogs attributes. In addition, it is able to manage a large number (billions) of microblogs for relatively long periods, e.g., months. Taghreed consists of four main components: (1) indexer, (2) query engine, (3) recovery manager, and (4) visualizer. Taghreed indexer efficiently digests incoming microblogs with high arrival rates in light main-memory indexes. When the memory becomes full, the memory contents are flushed to disk indexes which are managing billions of microblogs efficiently. On memory failure, the recovery manager restores the memory contents from backup copies. Taghreed query engine consists of two modules: a query optimizer and a query processor. The query optimizer generates an optimized query plan to be executed by the query processor to provide low query responses. Taghreed visualizer features to its users a wide variety of spatiotemporal queries and presents the answers on a map-based user interface that allows an interactive exploration. Taghreed is the first system that addresses all these challenges collectively for geotagged microblogs data. The system is demonstrated based on real system implementation through different scenarios that show system functionality and internals.", "citation": "Citations (9)", "departments": ["University of Minnesota", "University of Minnesota", "Umm al-Qura University", "Umm al-Qura University", "Metropolitan State University of Denver"], "authors": ["Amr Magdy.....http://dblp.org/pers/hd/m/Magdy_0001:Amr", "Louai Alarabi.....http://dblp.org/pers/hd/a/Alarabi:Louai", "Saif Al-Harthi.....http://dblp.org/pers/hd/a/Al=Harthi:Saif", "Mashaal Musleh.....http://dblp.org/pers/hd/m/Musleh:Mashaal", "Thanaa M. Ghanem.....http://dblp.org/pers/hd/g/Ghanem:Thanaa_M=", "Sohaib Ghani.....http://dblp.org/pers/hd/g/Ghani:Sohaib", "Saleh M. Basalamah.....http://dblp.org/pers/hd/b/Basalamah:Saleh_M=", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F="], "conf": "icde", "year": "2015", "pages": 4}