{"title": "Sparse Bayesian Multiview Learning for Simultaneous Association Discovery and Diagnosis of Alzheimer's Disease.", "fields": ["prior probability", "imaging genetics", "linkage disequilibrium", "laplacian matrix", "single nucleotide polymorphism"], "abstract": "In the analysis and diagnosis of many diseases, such as the Alzheimer's disease (AD), two important and related tasks are usually required: i) selecting genetic and phenotypical markers for diagnosis, and ii) identifying associations between genetic and phenotypical features. While previous studies treat these two tasks separately, they are tightly coupled due to the same underlying biological basis. To harness their potential benefits for each other, we propose a new sparse Bayesian approach to jointly carry out the two important and related tasks. In our approach, we extract common latent features from different data sources by sparse projection matrices and then use the latent features to predict disease severity levels; in return, the disease status can guide the learning of sparse projection matrices, which not only reveal interactions between data sources but also select groups of related biomarkers. In order to boost the learning of sparse projection matrices, we further incorporate graph Laplacian priors encoding the valuable linkage disequilibrium (LD) information. To efficiently estimate the model, we develop a variational inference algorithm. Analysis on an imaging genetics dataset for AD study shows that our model discovers biologically meaningful associations between single nucleotide polymorphisms (SNPs) and magnetic resonance imaging (MRI) features, and achieves significantly higher accuracy for predicting ordinal AD stages than competitive methods.", "citation": "Citations (6)", "departments": ["Purdue University", "University of Electronic Science and Technology of China", "Purdue University", "Eli Lilly and Company"], "authors": ["Shandian Zhe.....http://dblp.org/pers/hd/z/Zhe:Shandian", "Zenglin Xu.....http://dblp.org/pers/hd/x/Xu:Zenglin", "Yuan Qi.....http://dblp.org/pers/hd/q/Qi:Yuan", "Peng Yu.....http://dblp.org/pers/hd/y/Yu:Peng"], "conf": "aaai", "year": "2015", "pages": 7}