{"title": "HyperCam: hyperspectral imaging for ubiquitous computing applications.", "fields": ["imaging technology", "multispectral image", "industrial technology", "multispectral pattern recognition", "hyperspectral imaging"], "abstract": "Emerging uses of imaging technology for consumers cover a wide range of application areas from health to interaction techniques; however, typical cameras primarily transduce light from the visible spectrum into only three overlapping components of the spectrum: red, blue, and green. In contrast, hyperspectral imaging breaks down the electromagnetic spectrum into more narrow components and expands coverage beyond the visible spectrum. While hyperspectral imaging has proven useful as an industrial technology, its use as a sensing approach has been fragmented and largely neglected by the UbiComp community. We explore an approach to make hyperspectral imaging easier and bring it closer to the end-users. HyperCam provides a low-cost implementation of a multispectral camera and a software approach that automatically analyzes the scene and provides a user with an optimal set of images that try to capture the salient information of the scene. We present a number of use-cases that demonstrate HyperCam's usefulness and effectiveness.", "citation": "Citations (12)", "departments": ["University of Washington", "University of Washington", "University of Washington", "Microsoft", "Microsoft"], "authors": ["Mayank Goel.....http://dblp.org/pers/hd/g/Goel:Mayank", "Eric Whitmire.....http://dblp.org/pers/hd/w/Whitmire:Eric", "Alexander Mariakakis.....http://dblp.org/pers/hd/m/Mariakakis:Alexander", "T. Scott Saponas.....http://dblp.org/pers/hd/s/Saponas:T=_Scott", "Neel Joshi.....http://dblp.org/pers/hd/j/Joshi:Neel", "Dan Morris.....http://dblp.org/pers/hd/m/Morris:Dan", "Brian Guenter.....http://dblp.org/pers/hd/g/Guenter:Brian", "Marcel Gavriliu.....http://dblp.org/pers/hd/g/Gavriliu:Marcel", "Gaetano Borriello.....http://dblp.org/pers/hd/b/Borriello:Gaetano", "Shwetak N. Patel.....http://dblp.org/pers/hd/p/Patel:Shwetak_N="], "conf": "huc", "year": "2015", "pages": 12}