{"title": "Auto-completing bug reports for Android applications.", "fields": ["software development", "user experience design", "android", "security bug", "tracking system"], "abstract": "The modern software development landscape has seen a shift in focus toward mobile applications as tablets and smartphones near ubiquitous adoption. Due to this trend, the complexity of these “apps” has been increasing, making development and maintenance challenging. Additionally, current bug tracking systems are not able to effectively support construction of reports with actionable information that directly lead to a bug’s resolution. To address the need for an improved reporting system, we introduce a novel solution, called FUSION, that helps users auto-complete reproduction steps in bug reports for mobile apps. FUSION links user-provided information to program artifacts extracted through static and dynamic analysis performed before testing or release. The approach that FUSION employs is generalizable to other current mobile software platforms, and constitutes a new method by which off-device bug reporting can be conducted for mobile software projects. In a study involving 28 participants we applied FUSION to support the maintenance tasks of reporting and reproducing defects from 15 real-world bugs found in 14 open source Android apps while qualitatively and qualitatively measuring the user experience of the system. Our results demonstrate that FUSION both effectively facilitates reporting and allows for more reliable reproduction of bugs from reports compared to traditional issue tracking systems by presenting more detailed contextual app information.", "citation": "Citations (23)", "departments": ["College of William & Mary", "College of William & Mary", "College of William & Mary", "College of William & Mary"], "authors": ["Kevin Moran.....http://dblp.org/pers/hd/m/Moran:Kevin", "Mario Linares Vásquez.....http://dblp.org/pers/hd/v/V=aacute=squez:Mario_Linares", "Carlos Bernal-Cárdenas.....http://dblp.org/pers/hd/b/Bernal=C=aacute=rdenas:Carlos", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "conf": "sigsoft", "year": "2015", "pages": 14}