{"title": "Efficient metric indexing for similarity search.", "fields": ["random access", "minimum bounding box", "storage efficiency", "complex data type", "nearest neighbor search"], "abstract": "The goal in similarity search is to find objects similar to a specified query object given a certain similarity criterion. Although useful in many areas, such as multimedia retrieval, pattern recognition, and computational biology, to name but a few, similarity search is not yet supported well by commercial DBMS. This may be due to the complex data types involved and the needs for flexible similarity criteria seen in real applications. We propose an efficient disk-based metric access method, the Space-filling curve and Pivot-based B + -tree (SPB-tree), to support a wide range of data types and similarity metrics. The SPB-tree uses a small set of so-called pivots to reduce significantly the number of distance computations, uses a space-filling curve to cluster the data into compact regions, thus improving storage efficiency, and utilizes a B + -tree with minimum bounding box information as the underlying index. The SPB-tree also employs a separate random access file to efficiently manage a large and complex data. By design, it is easy to integrate the SPB-tree into an existing DBMS. We present efficient similarity search algorithms and corresponding cost models based on the SPB-tree. Extensive experiments using real and synthetic data show that the SPB-tree has much lower construction cost, smaller storage size, and can support more efficient similarity queries with high accuracy cost models than is the case for competing techniques. Moreover, the SPB-tree scales sublinearly with growing dataset size.", "citation": "Citations (19)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Aalborg University", "Zhejiang University"], "authors": ["Lu Chen.....http://dblp.org/pers/hd/c/Chen:Lu", "Yunjun Gao.....http://dblp.org/pers/hd/g/Gao:Yunjun", "Xinhan Li.....http://dblp.org/pers/hd/l/Li:Xinhan", "Christian S. Jensen.....http://dblp.org/pers/hd/j/Jensen:Christian_S=", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang"], "conf": "icde", "year": "2015", "pages": 12}