{"title": "Accurate Latency-based Congestion Feedback for Datacenters.", "fields": ["queuing delay", "network packet", "network congestion", "congestion window", "latency"], "abstract": "The nature of congestion feedback largely governs the behavior of congestion control. In datacenter networks, where RTTs are in hundreds of microseconds, accurate feedback is crucial to achieve both high utilization and low queueing delay. Proposals for datacenter congestion control predominantly leverage ECN or even explicit in-network feedback (e.g., RCP-type feedback) to minimize the queuing delay. In this work we explore latency-based feedback as an alternative and show its advantages over ECN. Against the common belief that such implicit feed-back is noisy and inaccurate, we demonstrate that latency-based implicit feedback is accurate enough to signal a single packet's queuing delay in 10 Gbps networks.\n\nDX enables accurate queuing delay measurements whose error falls within 1.98 and 0.53 microseconds using software-based and hardware-based latency measurements, respectively. This enables us to design a new congestion control algorithm that performs fine-grained control to adjust the congestion window just enough to achieve very low queuing delay while attaining full utilization. Our extensive evaluation shows that 1) the latency measurement accurately reflects the one-way queuing delay in single packet level; 2) the latency feedback can be used to perform practical and fine-grained congestion control in high-speed datacenter networks; and 3) DX outperforms DCTCP with 5.33× smaller median queueing delay at 1 Gbps and 1.57× at 10 Gbps.", "citation": "Citations (20)", "departments": ["KAIST", "KAIST", "Intel", "KAIST", "KAIST"], "authors": ["Changhyun Lee.....http://dblp.org/pers/hd/l/Lee:Changhyun", "Chunjong Park.....http://dblp.org/pers/hd/p/Park:Chunjong", "Keon Jang.....http://dblp.org/pers/hd/j/Jang:Keon", "Sue B. Moon.....http://dblp.org/pers/hd/m/Moon:Sue_B=", "Dongsu Han.....http://dblp.org/pers/hd/h/Han:Dongsu"], "conf": "usenix", "year": "2015", "pages": 13}