{"title": "COSNET: Connecting Heterogeneous Social Networks with Local and Global Consistency.", "fields": ["social network", "subgradient method", "pairwise comparison", "dynamic network analysis", "network science"], "abstract": "More often than not, people are active in more than one social network. Identifying users from multiple heterogeneous social networks and integrating the different networks is a fundamental issue in many applications. The existing methods tackle this problem by estimating pairwise similarity between users in two networks. However, those methods suffer from potential inconsistency of matchings between multiple networks.   In this paper, we propose COSNET (COnnecting heterogeneous Social NETworks with local and global consistency), a novel energy-based model, to address this problem by considering both local and global consistency among multiple networks. An efficient subgradient algorithm is developed to train the model by converting the original energy-based objective function into its dual form.   We evaluate the proposed model on two different genres of data collections: SNS and Academia, each consisting of multiple heterogeneous social networks. Our experimental results validate the effectiveness and efficiency of the proposed model. On both data collections, the proposed COSNET method significantly outperforms several alternative methods by up to 10-30% (p  t -test) in terms of F1-score. We also demonstrate that applying the integration results produced by our method can improve the accuracy of expert finding, an important task in social networks.", "citation": "Citations (96)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Simon Fraser University", "University of Illinois at Chicago"], "authors": ["Yutao Zhang.....http://dblp.org/pers/hd/z/Zhang:Yutao", "Jie Tang.....http://dblp.org/pers/hd/t/Tang_0001:Jie", "Zhilin Yang.....http://dblp.org/pers/hd/y/Yang:Zhilin", "Jian Pei.....http://dblp.org/pers/hd/p/Pei:Jian", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "conf": "kdd", "year": "2015", "pages": 10}