{"title": "Randomized algorithms to update partial singular value decomposition on a hybrid CPU/GPU cluster.", "fields": ["singular value decomposition", "small number", "randomized algorithm", "sparse matrix", "gpu cluster"], "abstract": "For data analysis, a partial singular value decomposition (SVD) of the sparse matrix representing the data is a powerful tool. However, computing the SVD of a large matrix can take a significant amount of time even on a current high-performance supercomputer. Hence, there is a growing interest in a novel algorithm that can quickly compute the SVD for efficiently processing massive amounts of data that are being generated from many modern applications. To respond to this demand, in this paper, we study randomized algorithms that update the SVD as changes are made to the data, which is often more efficient than recomputing the SVD from scratch. Furthermore, in some applications, recomputing the SVD may not be possible because the original data, for which the SVD has been already computed, is no longer available. Our experimental results with the data sets for the Latent Semantic Indexing and population clustering demonstrate that these randomized algorithms can obtain the desired accuracy of the SVD with a small number of data accesses, and compared to the state-of-the-art updating algorithm, they often require much lower computational and communication costs. Our performance results on a hybrid CPU/GPU cluster show that these randomized algorithms can obtain significant speedups over the state-of-the-art updating algorithm.", "citation": "Citations (4)", "year": "2015", "departments": ["University of Tennessee", "University of Tennessee", "University of Tennessee", "University of Tennessee"], "conf": "sc", "authors": ["Ichitaro Yamazaki.....http://dblp.org/pers/hd/y/Yamazaki:Ichitaro", "Jakub Kurzak.....http://dblp.org/pers/hd/k/Kurzak:Jakub", "Piotr Luszczek.....http://dblp.org/pers/hd/l/Luszczek:Piotr", "Jack J. Dongarra.....http://dblp.org/pers/hd/d/Dongarra:Jack_J="], "pages": 12}