{"title": "Towards a parameter-free and parallel itemset mining algorithm in linearithmic time.", "fields": ["data set", "permutation", "partition", "scalability", "complete lattice"], "abstract": "Extracting interesting patterns from large data stores efficiently is a challenging problem in many domains. In the data mining literature, pattern frequency has often been touted as a proxy for interestingness and has been leveraged as a pruning criteria to realize scalable solutions. However, while there exist many frequent pattern algorithms in the literature, all scale exponentially in the worst case, restricting their utility on very large data sets. Furthermore, as we theoretically argue in this article, the problem is very hard to approximate within a reasonable factor, with a polynomial time algorithm. As a counter point to this theoretical result, we present a practical algorithm called Localized Approximate Miner (LAM) that scales linearithmically with the input data. Instead of fully exploring the top of the search lattice to a user-defined point, as traditional mining algorithms do, we instead explore different parts of the complete lattice, efficiently. The key to this efficient exploration is the reliance on min-wise independent permutations to collect the data into highly similar subsets of a partition. It is straightforward to implement and scales to very large data sets. We illustrate its utility on a range of data sets, and demonstrate that the algorithm finds more patterns of higher utility in much less time than several state-of-the-art algorithms. Moreover, we realize a natural multi-level parallelization of LAM that further reduces runtimes by up to 193-fold when leveraging 256 CMP cores spanning 32 machines.", "citation": "Citations (5)", "departments": ["Microsoft", "Universidade Federal de Minas Gerais", "Ohio State University", "Ohio State University"], "authors": ["Gregory Buehrer.....http://dblp.org/pers/hd/b/Buehrer:Gregory", "Roberto L. de Oliveira Jr......http://dblp.org/pers/hd/o/Oliveira_Jr=:Roberto_L=_de", "David Fuhry.....http://dblp.org/pers/hd/f/Fuhry:David", "Srinivasan Parthasarathy.....http://dblp.org/pers/hd/p/Parthasarathy_0001:Srinivasan"], "conf": "icde", "year": "2015", "pages": 12}