{"title": "Optimizing throughput in optical networks: The joint routing and power control problem.", "fields": ["destination sequenced distance vector routing", "multipath routing", "triangular routing", "static routing", "path vector protocol", "equal cost multi path routing", "multi commodity flow problem"], "abstract": "It is well established that physical layer impairments significantly affect the performance of optical networks. The management of these impairments is critical for successful transmission, and may significantly affect network layer routing decisions. Hence, the traditional divide-and-conquer layered approach is sub-optimal, which has led to work on cross-layer techniques for routing in optical networks. Apart from fiber loss, one critical physical layer impairment that limits the capacity of optical networks is fiber nonlinearity. Handling nonlinearity introduces significant complexity to the traditional cross-layer approaches. We formulate and solve a joint routing and power control problem to optimize the system throughput that takes into consideration both fiber loss and nonlinearity. The joint power control and routing problem considered is a nonlinear integer programming problem. By characterizing the feasible solution space of the power control problem, we find a set of universal power settings that transform the complex power control and routing problem into a constrained path routing problem. We then propose an efficient fully polynomial time approximation scheme to solve the constrained path routing problem. Simulation results show that our proposed algorithm significantly improves network throughput and greatly outperforms greedy heuristics by providing a guaranteed performance bound.", "citation": "Not cited", "departments": ["New York University", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs", "New York University", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs"], "authors": ["Zizhong Cao.....http://dblp.org/pers/hd/c/Cao:Zizhong", "Paul Claisse.....http://dblp.org/pers/hd/c/Claisse:Paul", "René-Jean Essiambre.....http://dblp.org/pers/hd/e/Essiambre:Ren=eacute==Jean", "Murali S. Kodialam.....http://dblp.org/pers/hd/k/Kodialam:Murali_S=", "T. V. Lakshman.....http://dblp.org/pers/hd/l/Lakshman:T=_V="], "conf": "infocom", "year": "2015", "pages": 9}