{"title": "On optimizing machine learning workloads via kernel fusion.", "fields": ["multiplication", "operator", "locality of reference", "ranging", "scalability"], "abstract": "Exploitation of parallel architectures has become critical to scalable machine learning (ML). Since a wide range of ML algorithms employ linear algebraic operators, GPUs with BLAS libraries are a natural choice for such an exploitation. Two approaches are commonly pursued: (i) developing specific GPU accelerated implementations of complete ML algorithms; and (ii) developing GPU kernels for primitive linear algebraic operators like matrix-vector multiplication, which are then used in developing ML algorithms. This paper extends the latter approach by developing fused kernels for a combination of primitive operators that are commonly found in popular ML algorithms. We identify the generic pattern of computation (alpha * X^T (v * (X * y)) + beta * z) and its various instantiations. We develop a fused kernel to optimize this computation on GPUs -- with specialized techniques to handle both sparse and dense matrices. This approach not only reduces the cost of data loads due to improved temporal locality but also enables other optimizations like coarsening and hierarchical aggregation of partial results. We also present an analytical model that considers input data characteristics and available GPU resources to estimate near-optimal settings for kernel launch parameters. The proposed approach provides speedups ranging from 2 to 67 for different instances of the generic pattern compared to launching multiple operator-level kernels using GPU accelerated libraries. We conclude by demonstrating the effectiveness of the approach in improving end-to-end performance on an entire ML algorithm.", "citation": "Citations (10)", "year": "2015", "departments": ["Ohio State University", "IBM", "IBM", "IBM", "IBM"], "conf": "ppopp", "authors": ["Arash Ashari.....http://dblp.org/pers/hd/a/Ashari:Arash", "Shirish Tatikonda.....http://dblp.org/pers/hd/t/Tatikonda:Shirish", "Matthias Boehm.....http://dblp.org/pers/hd/b/Boehm_0001:Matthias", "Berthold Reinwald.....http://dblp.org/pers/hd/r/Reinwald:Berthold", "Keith Campbell.....http://dblp.org/pers/hd/c/Campbell:Keith", "John Keenleyside.....http://dblp.org/pers/hd/k/Keenleyside:John", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P="], "pages": 10}