{"title": "Energy and Performance of Smartphone Radio Bundling in Outdoor Environments.", "fields": ["wireless", "simulation", "energy consumption", "central processing unit", "mobile device"], "abstract": "Most of today's mobile devices come equipped with both cellular LTE and WiFi wireless radios, making radio bundling (simultaneous data transfers over multiple interfaces) both appealing and practical. Despite recent studies documenting the benefits of radio bundling with MPTCP, many fundamental questions remain about potential gains from radio bundling, or the relationship between performance and energy consumption in these scenarios. In this study, we seek to answer these questions using extensive measurements to empirically characterize both energy and performance for radio bundling approaches. In doing so, we quantify potential gains of bundling using MPTCP versus an ideal protocol. We study the links between traffic partitioning and bundling performance, and use a novel componentized energy model to quantify the energy consumed by CPUs (and radios) during traffic management. Our results show that MPTCP achieves only a fraction of the total performance gain possible, and that its energy-agnostic design leads to considerable power consumption by the CPU. We conclude that not only there is room for improved bundling performance, but an energy-aware bundling protocol is likely to achieve a much better tradeoff between performance and power consumption.", "citation": "Citations (23)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "Purdue University", "Purdue University", "Purdue University"], "authors": ["Ana Nika.....http://dblp.org/pers/hd/n/Nika:Ana", "Yibo Zhu.....http://dblp.org/pers/hd/z/Zhu:Yibo", "Ning Ding.....http://dblp.org/pers/hd/d/Ding:Ning", "Abhilash Jindal.....http://dblp.org/pers/hd/j/Jindal:Abhilash", "Y. Charlie Hu.....http://dblp.org/pers/hd/h/Hu:Y=_Charlie", "Xia Zhou.....http://dblp.org/pers/hd/z/Zhou:Xia", "Ben Y. Zhao.....http://dblp.org/pers/hd/z/Zhao:Ben_Y=", "Haitao Zheng.....http://dblp.org/pers/hd/z/Zheng:Haitao"], "conf": "www", "year": "2015", "pages": 11}