{"title": "TR-MABE: White-box traceable and revocable multi-authority attribute-based encryption and its applications to multi-level privacy-preserving e-healthcare cloud computing systems.", "fields": ["cloud computing security", "attribute based encryption", "client side encryption", "outsourcing", "privacy software"], "abstract": "Cloud-assisted e-healthcare systems significantly facilitate the patients to outsource their personal health information (PHI) for medical treatment of high quality and efficiency. Unfortunately, a series of unaddressed security and privacy issues dramatically impede its practicability and popularity. In e-healthcare systems, it is expected that only the primary physicians responsible for the patients treatment can not only access the PHI content but verify the real identity of the patient. Secondary physicians participating in medical consultation and/or research tasks, however, are only permitted to view or use the content of the protected PHI, while unauthorized entities cannot obtain anything. Existing work mainly focuses on patients conditional identity privacy by exploiting group signatures, which are very computationally costly. In this paper, we propose a white-box traceable and revocable multi-authority attribute-based encryption named TR-MABE to efficiently achieve multilevel privacy preservation without introducing additional special signatures. It can efficiently prevent secondary physicians from knowing the patients identity. Also, it can efficiently track the physicians who leak secret keys used to protect patients identity and PHI. Finally, formal security proof and extensive simulations demonstrate the effectiveness and practicability of our proposed TR-MABE in e-healthcare cloud computing systems.", "citation": "Citations (16)", "departments": ["Shanghai Jiao Tong University", "East China Normal University", "East China Normal University", "University of Ontario Institute of Technology"], "authors": ["Jun Zhou.....http://dblp.org/pers/hd/z/Zhou:Jun", "Zhenfu Cao.....http://dblp.org/pers/hd/c/Cao:Zhenfu", "Xiaolei Dong.....http://dblp.org/pers/hd/d/Dong:Xiaolei", "Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong"], "conf": "infocom", "year": "2015", "pages": 9}