{"title": "CodeHow: Effective Code Search Based on API Understanding and Extended Boolean Model (E).", "fields": ["codebase", "kpi driven code analysis", "code review", "extended boolean model", "microsoft visual studio"], "abstract": "Over the years of software development, a vast amount of source code has been accumulated. Many code search tools were proposed to help programmers reuse previously-written code by performing free-text queries over a large-scale codebase. Our experience shows that the accuracy of these code search tools are often unsatisfactory. One major reason is that existing tools lack of query understanding ability. In this paper, we propose CodeHow, a code search technique that can recognize potential APIs a user query refers to. Having understood the potentially relevant APIs, CodeHow expands the query with the APIs and performs code retrieval by applying the Extended Boolean model, which considers the impact of both text similarity and potential APIs on code search. We deploy the backend of CodeHow as a Microsoft Azure service and implement the front-end as a Visual Studio extension. We evaluate CodeHow on a large-scale codebase consisting of 26K C# projects downloaded from GitHub. The experimental results show that when the top 1 results are inspected, CodeHow achieves a precision score of 0.794 (i.e., 79.4% of the first returned results are relevant code snippets). The results also show that CodeHow outperforms conventional code search tools. Furthermore, we perform a controlled experiment and a survey of Microsoft developers. The results confirm the usefulness and effectiveness of CodeHow in programming practices.", "citation": "Citations (22)", "departments": ["Shanghai Jiao Tong University", "Microsoft", "Microsoft", "Microsoft", "Sch. of Inf. Sy ... pore, Singapore"], "authors": ["Fei Lv.....http://dblp.org/pers/hd/l/Lv_0002:Fei", "Hongyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Hongyu", "Jian-Guang Lou.....http://dblp.org/pers/hd/l/Lou:Jian=Guang", "Shaowei Wang.....http://dblp.org/pers/hd/w/Wang:Shaowei", "Dongmei Zhang.....http://dblp.org/pers/hd/z/Zhang:Dongmei", "Jianjun Zhao.....http://dblp.org/pers/hd/z/Zhao:Jianjun"], "conf": "kbse", "year": "2015", "pages": 11}