{"title": "Characterizing home wireless performance: The gateway view.", "fields": ["wireless lan controller", "fixed wireless", "municipal wireless network", "wireless site survey", "wireless wan"], "abstract": "In this paper, we analyze a large dataset of passive wireless measurements and obtain insights about wireless performance. We monitor 167 homes continuously for 4 months from the vantage point of the gateway, which allows us to capture all the activity on the home wireless network. We report on the makeup of the home wireless network, traffic activity, and performance characteristics. We find that in most homes, a small number of devices account for most of the observed traffic volume and the bulk of this traffic activity occurs in the evenings. Studying link performance, we find that overall, the vast majority of transmissions are carried out at high data rates and the wireless networks have good coverage. We find a small number of episodes where performance is poor; a few homes have a disproportionate number of poor performance reports. Investigating further, we observe that most of these are not caused by poor coverage (pointing to network interference). Our results significantly add to the understanding of home wireless networks and will help ISPs to understand their subscriber networks.", "citation": "Citations (13)", "departments": ["Hewlett-Packard", "Technicolor", "Technicolor", "Technicolor", "Technicolor"], "authors": ["Ioannis Pefkianakis.....http://dblp.org/pers/hd/p/Pefkianakis:Ioannis", "Henrik Lundgren.....http://dblp.org/pers/hd/l/Lundgren:Henrik", "Augustin Soule.....http://dblp.org/pers/hd/s/Soule:Augustin", "Jaideep Chandrashekar.....http://dblp.org/pers/hd/c/Chandrashekar:Jaideep", "Pascal Le Guyadec.....http://dblp.org/pers/hd/g/Guyadec:Pascal_Le", "Christophe Diot.....http://dblp.org/pers/hd/d/Diot:Christophe", "Martin May.....http://dblp.org/pers/hd/m/May:Martin", "Karel Van Doorselaer.....http://dblp.org/pers/hd/d/Doorselaer:Karel_Van", "Koen Van Oost.....http://dblp.org/pers/hd/o/Oost:Koen_Van"], "conf": "infocom", "year": "2015", "pages": 9}