{"title": "AP-Tree: Efficiently support continuous spatial-keyword queries over stream.", "fields": ["search engine indexing", "spatial query", "exploit", "streaming data", "server"], "abstract": "We investigate the problem of processing a large amount of continuous spatial-keyword queries over streaming data, which is essential in many applications such as location-based recommendation and advertising, thanks to the proliferation of geo-equipped devices and the ensuing location-based social media applications. For example, a location-based e-coupon system may allow potentially millions of users to register their continuous spatial-keyword queries (e.g., interests in nearby sales) by specifying a set of keywords and a spatial region; the system then delivers each incoming spatial-textual object (e.g., a geo-tagged e-coupon) to all the matched queries (i.e., users) whose spatial and textual requirements are satisfied. While there are several prior approaches aiming at providing efficient query processing techniques for the problem, their approaches belong to spatial-first indexing method which cannot well exploit the keyword distribution. In addition, their textual filtering techniques are built upon simple variants of traditional inverted indexes, which do not perform well for the textual constraint imposed by the problem. In this paper, we address the above limitations and provide a highly efficient solution based on a novel adaptive index, named AP-Tree. The AP-Tree adaptively groups registered queries using keyword and spatial partitions, guided by a cost model. The AP-Tree also naturally indexes ordered keyword combinations. We present index construction algorithm that seamlessly and effectively integrates keyword and spatial partitions. Consequently, our method adapts well to the underlying spatial and keyword distributions of the data. Our extensive experiments demonstrate that AP-Tree achieves up to an order of magnitude improvement on efficiency compared with prior state-of-the-art methods.", "citation": "Citations (26)", "departments": ["University of New South Wales", "University of Technology, Sydney", "University of New South Wales", "University of New South Wales", "University of New South Wales"], "authors": ["Xiang Wang.....http://dblp.org/pers/hd/w/Wang_0007:Xiang", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0011:Wei"], "conf": "icde", "year": "2015", "pages": 12}