{"title": "Witness validation and stepwise testification across software verifiers.", "fields": ["counterexample", "program analysis", "cpachecker", "computer science", "programming language", "software verification", "witness", "software"], "abstract": "It is commonly understood that a verification tool should provide a counterexample to witness a specification violation. Until recently, software verifiers dumped error witnesses in proprietary formats, which are often neither human- nor machine-readable, and an exchange of witnesses between different verifiers was impossible. To close this gap in software-verification technology, we have defined an exchange format for error witnesses that is easy to write and read by verification tools (for further processing, e.g., witness validation) and that is easy to convert into visualizations that conveniently let developers inspect an error path. To eliminate manual inspection of false alarms, we develop the notion of stepwise testification: in a first step, a verifier finds a problematic program path and, in addition to the verification result FALSE, constructs a witness for this path; in the next step, another verifier re-verifies that the witness indeed violates the specification. This process can have more than two steps, each reducing the state space around the error path, making it easier to validate the witness in a later step. An obvious application for testification is the setting where we have two verifiers: one that is efficient but imprecise and another one that is precise but expensive. We have implemented the technique of error-witness-driven program analysis in two state-of-the-art verification tools, CPAchecker and Ultimate Automizer, and show by experimental evaluation that the approach is applicable to a large set of verification tasks.", "citation": "Not cited", "departments": ["University of Passau", "University of Passau", "University of Freiburg", "University of Freiburg", "University of Passau"], "authors": ["Dirk Beyer.....http://dblp.org/pers/hd/b/Beyer_0001:Dirk", "Matthias Dangl.....http://dblp.org/pers/hd/d/Dangl:Matthias", "Daniel Dietsch.....http://dblp.org/pers/hd/d/Dietsch:Daniel", "Matthias Heizmann.....http://dblp.org/pers/hd/h/Heizmann:Matthias", "Andreas Stahlbauer.....http://dblp.org/pers/hd/s/Stahlbauer:Andreas"], "conf": "sigsoft", "year": "2015", "pages": 13}