{"title": "Cache-oblivious wavefront: improving parallelism of recursive dynamic programming algorithms without losing cache-efficiency.", "fields": ["cache invalidation", "floyd warshall algorithm", "cache algorithms", "cache oblivious algorithm", "cpu cache"], "abstract": "State-of-the-art cache-oblivious parallel algorithms for dynamic programming (DP) problems usually guarantee asymptotically optimal cache performance without any tuning of cache parameters, but they often fail to exploit the theoretically best parallelism at the same time. While these algorithms achieve cache-optimality through the use of a recursive divide-and-conquer (DAC) strategy, scheduling tasks at the granularity of task dependency introduces artificial dependencies in addition to those arising from the defining recurrence equations. We removed the artificial dependency by scheduling tasks ready for execution as soon as all its real dependency constraints are satisfied, while preserving the cache-optimality by inheriting the DAC strategy. We applied our approach to a set of widely known dynamic programming problems, such as Floyd-Warshall's All-Pairs Shortest Paths, Stencil, and LCS. Theoretical analyses show that our techniques improve the span of 2-way DAC-based Floyd Warshall's algorithm on an $n$ node graph from $Thn^2n$ to $Thn$, stencil computations on a $d$-dimensional hypercubic grid of width $w$ for $h$ time steps from $Th(d^2 h) w^ (d+2) - 1$ to $Thh$, and LCS on two sequences of length $n$ each from $Thn^_2 3$ to $Thn$. In each case, the total work and cache complexity remain asymptotically optimal. Experimental measurements exhibit a $3$ - $5$ times improvement in absolute running time, $10$ - $20$ times improvement in burdened span by Cilkview, and approximately the same L1/L2 cache misses by PAPI.", "citation": "Citations (10)", "year": "2015", "departments": ["Fudan University", "Fudan University", "Fudan University", "Stony Brook University", "Stony Brook University"], "conf": "ppopp", "authors": ["Yuan Tang.....http://dblp.org/pers/hd/t/Tang:Yuan", "Ronghui You.....http://dblp.org/pers/hd/y/You:Ronghui", "Haibin Kan.....http://dblp.org/pers/hd/k/Kan:Haibin", "Jesmin Jahan Tithi.....http://dblp.org/pers/hd/t/Tithi:Jesmin_Jahan", "Pramod Ganapathi.....http://dblp.org/pers/hd/g/Ganapathi:Pramod", "Rezaul Alam Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Rezaul_Alam"], "pages": 10}