{"title": "Sample (x) = (a*x<=t) is a Distinguisher with Probability 1/8.", "fields": ["monoid", "commutative property", "associative property", "attribute value pair", "p complete"], "abstract": "A random sampling function Sample: U a#x2192; {0, 1} for a key universe U is a distinguisher with probability. If for any given assignment of values v(x) to the keys x a#x03B5; U, including at least one non-zero v(x) a#x2260; 0, the sampled sum a#x2211;{v(x)|x a#x03B5; U a#x005E;. Sample(x) = 1} is non-zero with probability at least a#x0391;. Here the key values may come from any commutative monoid (addition is commutative and associative and zero is neutral). Such distinguishers were introduced by Vazirani [PhD thesis 1986], and Naor and Naor used them for their small bias probability spaces [STOC'90]. Constant probability distinguishers are used for testing in contexts where the key values are not computed directly, yet where the sum is easily computed. A simple example is when we get a stream of key value pairs (x1, v1), (x2, v2), , (xn, vn) where the same key may appear many times. The accumulated value of key x is v(x) = a#x2211;{v1|xi = x}. For space reasons, we may not be able to maintain x(x) for every key x, but the sampled sum is easily maintained as the single value a#x2211; {vi | Sample(xi) = 1}. Here we show that when dealing with a#x03A9;-bit integers, if a#x0391; is a uniform odd a#x03A9;-bit integer and t is a uniform a#x03A9;-bit integer, then Sample(x) = [ax mod 2a#x03A9; a#x2264;t] is a distinguisher with probability 1/8. Working with standard units, that is, a#x03A9; = 8,16,32,64, we exploit that a#x03A9;-bit multiplication works modulo 2., discarding overflow automatically, and then the sampling decision is implemented by the C-code a*x<=t. Previous such samplers were much less computer friendly, e.g., The distinguisher of Naor and Naor [STOC'90] was more complicated and involved a 7-independent hash function.", "citation": "Citations (2)", "departments": ["University of Copenhagen"], "authors": ["Mikkel Thorup.....http://dblp.org/pers/hd/t/Thorup:Mikkel"], "conf": "focs", "year": "2015", "pages": 15}