{"title": "Utilizing IDs to Accelerate Incremental View Maintenance.", "fields": ["algebraic number", "materialized view", "use case", "negation", "tuple"], "abstract": "Prior Incremental View Maintenance (IVM) algorithms specify the view tuples that need to be modified by computing diff sets, which we call  tuple-based diffs  since a diff set contains one diff tuple for each to-be-modified view tuple.  idIVM  assumes the base tables have keys and performs IVM by computing  ID-based diff  sets that compactly identify the to-be-modified tuples through their IDs.   This work makes the following contributions: (a) An ID-based IVM system for a large subset of SQL that includes the algebraic operators selection, join, grouping and aggregation, generalized projection involving functions, antisemijoin (and therefore negation/difference) and union. The system is based on a modular approach, allowing one to extend the supported language simply by adding one algebraic operator at-a-time, along with equations describing how ID-based changes are propagated through the operator. (b) An efficient algorithm that creates an IVM plan for a given view in four passes that are polynomial in the size of the view expression. (c) A formal analysis comparing the ID-based IVM algorithm to prior IVM approaches and analytically showing when one outperforms the other. (d) An experimental comparison of the ID-based IVM algorithm to prior IVM algorithms showing the superiority of the former in common use cases.", "citation": "Citations (5)", "year": "2015", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "sigmod", "authors": ["Yannis Katsis.....http://dblp.org/pers/hd/k/Katsis:Yannis", "Kian Win Ong.....http://dblp.org/pers/hd/o/Ong:Kian_Win", "Yannis Papakonstantinou.....http://dblp.org/pers/hd/p/Papakonstantinou:Yannis", "Kevin Keliang Zhao.....http://dblp.org/pers/hd/z/Zhao:Kevin_Keliang"], "pages": 16}