{"title": "Scalability limits of large immersive high-resolution displays.", "fields": ["information space", "immersion", "display size", "data visualization", "data exploration"], "abstract": "We present the results of a variable information space experiment, targeted at exploring the scalability limits of immersive highresolution, tiled-display walls under physical navigation. Our work is motivated by a lack of evidence supporting the extension of previously established benefits on substantially large, room-shaped displays. Using the Reality Deck, a gigapixel resolution immersive display, as its apparatus, our study spans four display form-factors, starting at 100 megapixels arranged planarly and up to one gi-gapixel in a horizontally immersive setting. We focus on four core tasks: visual search, attribute search, comparisons and pattern finding. We present a quantitative analysis of per-task user performance across the various display conditions. Our results demonstrate improvements in user performance as the display form-factor changes to 600 megapixels. At the 600 megapixel to 1 gigapixel transition, we observe no tangible performance improvements and the visual search task regressed substantially. Additionally, our analysis of subjective mental effort questionnaire responses indicates that subjective user effort grows as the display size increases, validating previous studies on smaller displays. Our analysis of the participants' physical navigation during the study sessions shows an increase in user movement as the display grew. Finally, by visualizing the participants' movement within the display apparatus space, we discover two main approaches (termed “overview” and “detail”) through which users chose to tackle the various data exploration tasks. The results of our study can inform the design of immersive high-resolution display systems and provide insight into how users navigate within these room-sized visualization spaces.", "citation": "Citations (2)", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Charilaos Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos:Charilaos", "Seyedkoosha Mirhosseini.....http://dblp.org/pers/hd/m/Mirhosseini:Seyedkoosha", "Ievgeniia Gutenko.....http://dblp.org/pers/hd/g/Gutenko:Ievgeniia", "Kaloian Petkov.....http://dblp.org/pers/hd/p/Petkov:Kaloian", "Arie E. Kaufman.....http://dblp.org/pers/hd/k/Kaufman:Arie_E=", "Bireswar Laha.....http://dblp.org/pers/hd/l/Laha:Bireswar"], "conf": "vr", "year": "2015", "pages": 8}