{"title": "The Semantic Paintbrush: Interactive 3D Mapping and Recognition in Large Outdoor Spaces.", "fields": ["computer graphics", "clean up", "augmented reality", "3d reconstruction", "paintbrush"], "abstract": "We present an augmented reality system for large scale 3D reconstruction and recognition in outdoor scenes. Unlike existing prior work, which tries to reconstruct scenes using active depth cameras, we use a purely passive stereo setup, allowing for outdoor use and extended sensing range. Our system not only produces a map of the 3D environment in real-time, it also allows the user to draw (or 'paint') with a laser pointer directly onto the reconstruction to segment the model into objects. Given these examples our system then learns to segment other parts of the 3D map during online acquisition. Unlike typical object recognition systems, ours therefore very much places the user 'in the loop' to segment particular objects of interest, rather than learning from predefined databases. The laser pointer additionally helps to 'clean up' the stereo reconstruction and final 3D map, interactively. Using our system, within minutes, a user can capture a full 3D map, segment it into objects of interest, and refine parts of the model during capture. We provide full technical details of our system to aid replication, as well as quantitative evaluation of system components. We demonstrate the possibility of using our system for helping the visually impaired navigate through spaces. Beyond this use, our system can be used for playing large-scale augmented reality games, shared online to augment streetview data, and used for more detailed car and person navigation.", "citation": "Citations (15)", "year": "2015", "departments": ["University of Oxford", "Stanford University", "University of Oxford", "University of Oxford", "Stanford University"], "conf": "chi", "authors": ["Ondrej Miksik.....http://dblp.org/pers/hd/m/Miksik:Ondrej", "Vibhav Vineet.....http://dblp.org/pers/hd/v/Vineet:Vibhav", "Morten Lidegaard.....http://dblp.org/pers/hd/l/Lidegaard:Morten", "Ram Prasaath.....http://dblp.org/pers/hd/p/Prasaath:Ram", "Matthias Nießner.....http://dblp.org/pers/hd/n/Nie=szlig=ner:Matthias", "Stuart Golodetz.....http://dblp.org/pers/hd/g/Golodetz:Stuart", "Stephen L. Hicks.....http://dblp.org/pers/hd/h/Hicks:Stephen_L=", "Patrick Pérez.....http://dblp.org/pers/hd/p/P=eacute=rez:Patrick", "Shahram Izadi.....http://dblp.org/pers/hd/i/Izadi:Shahram", "Philip H. S. Torr.....http://dblp.org/pers/hd/t/Torr:Philip_H=_S="], "pages": 10}