{"title": "Region and Effect Inference for Safe Parallelism (T).", "fields": ["recursion", "deterministic parallel java", "documentation", "constraint satisfaction problem", "wildcard"], "abstract": "In this paper, we present the first full regions-and-effects inference algorithm for explicitly parallel fork-join programs. We infer annotations inspired by Deterministic Parallel Java (DPJ) for a type-safe subset of C++. We chose the DPJ annotations because they give the strongest safety guarantees of any existing concurrency-checking approach we know of, static or dynamic, and it is also the most expressive static checking system we know of that gives strong safety guarantees. This expressiveness, however, makes manual annotation difficult and tedious, which motivates the need for automatic inference, but it also makes the inference problem very challenging: the code may use region polymorphism, imperative updates with complex aliasing, arbitrary recursion, hierarchical region specifications, and wildcard elements to describe potentially infinite sets of regions. We express the inference as a constraint satisfaction problem and develop, implement, and evaluate an algorithm for solving it. The region and effect annotations inferred by the algorithm constitute a checkable proof of safe parallelism, and it can be recorded both for documentation and for fast and modular safety checking.", "citation": "Citations (1)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Alexandros Tzannes.....http://dblp.org/pers/hd/t/Tzannes:Alexandros", "Stephen T. Heumann.....http://dblp.org/pers/hd/h/Heumann:Stephen_T=", "Lamyaa Eloussi.....http://dblp.org/pers/hd/e/Eloussi:Lamyaa", "Mohsen Vakilian.....http://dblp.org/pers/hd/v/Vakilian:Mohsen", "Vikram S. Adve.....http://dblp.org/pers/hd/a/Adve:Vikram_S=", "Michael Han.....http://dblp.org/pers/hd/h/Han:Michael"], "conf": "kbse", "year": "2015", "pages": 12}