{"title": "Spatial-aware Multimodal Location Estimation for Social Images.", "fields": ["learning to rank", "latent semantic indexing", "topic model", "geotagging", "language model"], "abstract": "Nowadays the locations of social images play an important role in geographic knowledge discovery. However, most social images still lack the location information, driving location estimation for social images to have recently become an active research topic. With the rapid growth of social images, new challenges have been posed: 1) data quality of social images is an issue because they are often associated with noises and error-prone user-generated content, such as junk comments and misspelled words; and 2) data sparsity exists in social images despite the large volume, since most of them are unevenly distributed around the world and their contextual information is often missing or incomplete. In this paper, we propose a spatial-aware multimodal location estimation (SMLE) framework to tackle the above challenges. Specifically, a spatial-aware language model (SLM) is proposed to detect the high quality location-indicative tags from large datasets. We also design a spatial-aware topic model, namely spatial-aware regularized latent semantic indexing (SRLSI), to discover geographic topics and alleviate the data sparseness problem existing in language modeling. Taking multi-modalities of social images into consideration, we employ the learning to rank approach to fuse multiple evidences derived from textual features represented by SLM and SRLSI, and visual features represented by bag-of-visual-words (BoVW). Importantly, an ad hoc method is introduced to construct the training dataset with spatial-aware relevance labels for learning to rank training. Finally, given a query image, its location is estimated as the location of its most relevant image returned from the learning to rank model. The proposed framework is evaluated on a public benchmark provided by MediaEval 2013 Placing Task, which contains more than 8.5 million images crawled from Flickr. Extensive experiments on this dataset demonstrate the superior performance of the proposed methods over the state-of-the-art approaches.", "citation": "Citations (7)", "departments": ["University of Queensland", "University of Queensland", "University of Electronic Science and Technology of China"], "authors": ["Jiewei Cao.....http://dblp.org/pers/hd/c/Cao:Jiewei", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Yang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Yang"], "conf": "mm", "year": "2015", "pages": 10}