{"title": "OFFICER: A general optimization framework for OpenFlow rule allocation and endpoint policy enforcement.", "fields": ["openflow", "network packet", "controller", "path length", "enforcement"], "abstract": "The Software-Defined Networking approach permits to realize new policies. In OpenFlow in particular, a controller decides on behalf of the switches which forwarding rules must be installed and where. However with this flexibility comes the challenge of the computation of a rule allocation matrix meeting both high-level policies and the network constraints such as memory or link capacity limitations. Nevertheless, in many situations (e.g., data-center networks), the exact path followed by packets does not severely impact performances as long as packets are delivered according to the endpoint policy. It is thus possible to deviate part of the traffic to alternative paths so to better use network resources without violating the endpoint policy. In this paper, we propose a linear optimization model of the rule allocation problem in resource constrained OpenFlow networks with relaxing routing policy. We show that the general problem is NP-hard and propose a polynomial time heuristic, called OFFICER, which aims to maximize the amount of carried traffic in under-provisioned networks. Our numerical evaluation on four different topologies shows that exploiting various paths allows to increase the amount of traffic supported by the network without significantly increasing the path length.", "citation": "Citations (16)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Xuan Nam Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Xuan_Nam", "Damien Saucez.....http://dblp.org/pers/hd/s/Saucez:Damien", "Chadi Barakat.....http://dblp.org/pers/hd/b/Barakat:Chadi", "Thierry Turletti.....http://dblp.org/pers/hd/t/Turletti:Thierry"], "conf": "infocom", "year": "2015", "pages": 9}