{"title": "Usees.", "fields": ["biology", "mineralogy", "performance art", "environmental science", "microbiology", "nuclear chemistry", "chemistry", "history"], "abstract": "Notre objectif principal est de caracteriser les eaux usees d’abattoir municipal de la ville de Kenitra (Maroc) et de recommander un traitement adequat permettant leurs reutilisations, reduisant ainsi les nuisances que subit le milieu recepteur (Oued Sebou) et de remedier aussi a la perte de cette source hydrique en matieres valorisables. La caracterisation physico-chimique des eaux usees brutes a revele que ce rejet liquide est tres charge en matiere organique en terme de DCO (Moy. = 219,52 mg/L ±51,07), en DBO5 (Moy. = 181,34 mg/L±30,04), en MES (Moy. = 482 mg/L ±222,7) et en matiere minerale exprimee en terme de Chlorures (Moy. = 237 mg/L ±109,6), en Conductivite electrique (Moy. = 1360,5 μs/cm ±1120,8) et en Alcalinite exprimee en CaCO3 (Moy. = 201 mg/L ±74,2) avec un pH de 7,5 (±0,8). Les teneurs moyennes en Nitrates et en Orthophosphates respectivement de l'ordre de 1,74 mg/L (±2,7) et 0,08 mg/L (±0,1). Malgre que ces eaux usees presentent une charge organique elevee (rapports DBO5/DCO = 0,83 et MES/DBO5 = 2,66), elles presentent une biodegradabilite satisfaisante. L’examen de rapport DCO/DBO5 = 1,21 souligne bien le caractere biodegradable des eaux usees de l'abattoir municipal de Kenitra auxquelles un traitement biologique parait tout a fait convenable. Cependant, il faut tenir compte les eaux usees domestiques melangees avec les effluents de l'abattoir. Il existe une correlation hautement significative entre la DCO et la DBO5 de nos echantillons d’eaux usees (R2= 0,93 et y = 1,2689x + 23,814). Par ailleurs, la correlation etablie entre l’oxygene dissous et la DBO5 montre un R2= 0,75 (y = 0,0057x + 0,7964).   Mots-cles  : eaux usees, abattoir, parametres physico-chimiques, traitement, Kenitra.", "citation": "Citations (2)", "year": "2015", "departments": ["Irstea – Centre ... leurbanne cedex", "Fédération nati ... e – 75011 Paris", "Fédération nati ... g – 75007 Paris", "Institut de l’é ... Angers cedex 02"], "conf": "chi", "authors": ["Eric P. S. Baumer.....http://dblp.org/pers/hd/b/Baumer:Eric_P=_S="], "pages": 4}