{"title": "Mining Subjective Properties on the Web.", "fields": ["test case", "web content", "ground truth", "snapshot", "negation"], "abstract": "Even with the recent developments in Web search of answering queries from structured data, search engines are still limited to queries with an objective answer, such as EUROPEAN CAPITALS or WOODY ALLEN MOVIES. However, many queries are subjective, such as SAFE CITIES, or CUTE ANIMALS. The underlying knowledge bases of search engines do not contain answers to these queries because they do not have a ground truth. We describe the Surveyor system that mines the dominant opinion held by authors of Web content about whether a subjective property applies to a given entity. The evidence on which SURVEYOR relies is statements extracted from Web text that either support the property or claim its negation. The key challenge that SURVEYOR faces is that simply counting the number of positive and negative statements does not suffice, because there are multiple hidden biases with which content tends to be authored on the Web. SURVEYOR employs a probabilistic model of how content is authored on the Web. As one example, this model accounts for correlations between the subjective property and the frequency with which it is mentioned on the Web. The parameters of the model are specialized to each property and entity type.   Surveyor was able to process a large Web snapshot within a few hours, resulting in opinions for over 4~billion entity-property combinations. We selected a subset of 500 entity-property combinations and compared our results to the dominant opinion of a large number of Amazon Mechanical Turk (AMT) workers. The predictions of Surveyor match the results from AMT in 77\\% of all cases (and 87\\% for test cases where inter-worker agreement is high), significantly outperforming competing approaches.", "citation": "Citations (6)", "year": "2015", "departments": ["École Polytechnique Fédérale de Lausanne", "Google", "Google", "Google", "Google"], "conf": "sigmod", "authors": ["Immanuel Trummer.....http://dblp.org/pers/hd/t/Trummer:Immanuel", "Alon Y. Halevy.....http://dblp.org/pers/hd/h/Halevy:Alon_Y=", "Hongrae Lee.....http://dblp.org/pers/hd/l/Lee:Hongrae", "Sunita Sarawagi.....http://dblp.org/pers/hd/s/Sarawagi:Sunita", "Rahul Gupta.....http://dblp.org/pers/hd/g/Gupta:Rahul"], "pages": 16}