{"title": "Collective Intelligence in Computer-Mediated Collaboration Emerges in Different Contexts and Cultures.", "fields": ["human computer interaction", "collective intelligence", "computer science"], "abstract": "Collective intelligence (CI) is a property of groups that emerges from the coordination and collaboration of members and predicts group performance on a wide range of tasks. Previous studies of CI have been conducted with lab-based groups in the USA. We introduce a new standardized online battery to measure CI and demonstrate consistent emergence of a CI factor across three different studies despite broad differences in (a) communication media (face-to-face vs online), (b) group contexts (short-term ad hoc groups vs long-term groups) and (c) cultural settings (US, Germany, and Japan). In two of the studies, we also show that CI is correlated with a group's performance on more complex tasks. Consequently, the CI metric provides a generalizable performance measure for groups that is robust to broad changes in media, context, and culture, making it useful for testing the effects of general-purpose collaboration technologies intended to improve group performance.", "citation": "Citations (6)", "year": "2015", "departments": ["Massachusetts Institute of Technology", "Carnegie Mellon University", "Tilburg University", "Union College", "Fuji Xerox"], "conf": "chi", "authors": ["David Engel.....http://dblp.org/pers/hd/e/Engel:David", "Anita Williams Woolley.....http://dblp.org/pers/hd/w/Woolley:Anita_Williams", "Ishani Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Ishani", "Christopher F. Chabris.....http://dblp.org/pers/hd/c/Chabris:Christopher_F=", "Masamichi Takahashi.....http://dblp.org/pers/hd/t/Takahashi:Masamichi", "Keiichi Nemoto.....http://dblp.org/pers/hd/n/Nemoto:Keiichi", "Carolin Kaiser.....http://dblp.org/pers/hd/k/Kaiser:Carolin", "Young Ji Kim.....http://dblp.org/pers/hd/k/Kim:Young_Ji", "Thomas W. Malone.....http://dblp.org/pers/hd/m/Malone:Thomas_W="], "pages": 10}