{"title": "SpecTrans: Versatile Material Classification for Interaction with Textureless, Specular and Transparent Surfaces.", "fields": ["speckle pattern", "wearable computer", "ubiquitous computing", "reflectivity", "specular reflection"], "abstract": "Surface and object recognition is of significant importance in ubiquitous and wearable computing. While various techniques exist to infer context from material properties and appearance, they are typically neither designed for real-time applications nor for optically complex surfaces that may be specular, textureless, and even transparent. These materials are, however, becoming increasingly relevant in HCI for transparent displays, interactive surfaces, and ubiquitous computing. We present SpecTrans, a new sensing technology for surface classification of exotic materials, such as glass, transparent plastic, and metal. The proposed technique extracts optical features by employing laser and multi-directional, multi-spectral LED illumination that leverages the material's optical properties. The sensor hardware is small in size, and the proposed classification method requires significantly lower computational cost than conventional image-based methods, which use texture features or reflectance analysis, thereby providing real-time performance for ubiquitous computing. Our evaluation of the sensing technique for nine different transparent materials, including air, shows a promising recognition rate of 99.0%. We demonstrate a variety of possible applications using SpecTrans' capabilities.", "citation": "Citations (6)", "year": "2015", "departments": ["Massachusetts Institute of Technology", "University of Tokyo", "Royal Institute of Technology", "Singapore University of Technology and Design", "University of Tokyo"], "conf": "chi", "authors": ["Munehiko Sato.....http://dblp.org/pers/hd/s/Sato:Munehiko", "Shigeo Yoshida.....http://dblp.org/pers/hd/y/Yoshida:Shigeo", "Alex Olwal.....http://dblp.org/pers/hd/o/Olwal:Alex", "Boxin Shi.....http://dblp.org/pers/hd/s/Shi:Boxin", "Atsushi Hiyama.....http://dblp.org/pers/hd/h/Hiyama:Atsushi", "Tomohiro Tanikawa.....http://dblp.org/pers/hd/t/Tanikawa:Tomohiro", "Michitaka Hirose.....http://dblp.org/pers/hd/h/Hirose:Michitaka", "Ramesh Raskar.....http://dblp.org/pers/hd/r/Raskar:Ramesh"], "pages": 10}