{"title": "From Dusk Till Dawn: Modeling in the Dark.", "fields": ["computer vision", "pattern recognition", "computer science", "artificial intelligence", "dusk"], "abstract": "Internet photo collections naturally contain a large variety of illumination conditions, with the largest difference between day and night images. Current modeling techniques do not embrace the broad illumination range often leading to reconstruction failure or severe artifacts. We present an algorithm that leverages the appearance variety to obtain more complete and accurate scene geometry along with consistent multi-illumination appearance information. The proposed method relies on automatic scene appearance grouping, which is used to obtain separate dense 3D models. Subsequent model fusion combines the separate models into a complete and accurate reconstruction of the scene. In addition, we propose a method to derive the appearance information for the model under the different illumination conditions, even for scene parts that are not observed under one illumination condition. To achieve this, we develop a cross-illumination color transfer technique. We evaluate our method on a large variety of landmarks from across Europe reconstructed from a database of 7.4M images.", "citation": "Citations (10)", "year": "2016", "departments": ["Czech Technical University in Prague", "ETH Zurich", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "Czech Technical University in Prague"], "conf": "cvpr", "authors": ["Filip Radenovic.....http://dblp.org/pers/hd/r/Radenovic:Filip", "Johannes L. Schönberger.....http://dblp.org/pers/hd/s/Sch=ouml=nberger:Johannes_L=", "Dinghuang Ji.....http://dblp.org/pers/hd/j/Ji:Dinghuang", "Jan-Michael Frahm.....http://dblp.org/pers/hd/f/Frahm:Jan=Michael", "Ondrej Chum.....http://dblp.org/pers/hd/c/Chum:Ondrej", "Jiri Matas.....http://dblp.org/pers/hd/m/Matas:Jiri"], "pages": 9}