{"title": "Micro-architectural Analysis of In-memory OLTP.", "fields": ["scratch", "exploit", "cache", "concurrency control", "online transaction processing"], "abstract": "Micro-architectural behavior of traditional disk-based online transaction processing (OLTP) systems has been investigated extensively over thepast couple of decades. Results show that traditional OLTP mostly under-utilize the available micro-architectural resources. In-memory OLTP systems, on the other hand, process all the data in main-memory, and therefore, can omit the buffer pool. In addition, they usually adopt more lightweight concurrency control mechanisms, cache-conscious data structures, and cleaner codebases since they are usually designed from scratch. Hence, we expect significant differences in micro-architectural behavior when running OLTP on platforms optimized for in-memory processing as opposed to disk-based database systems. In particular, we expect that in-memory systems exploit micro architectural features such as instruction and data caches significantly better than disk-based systems. This paper sheds light on the micro-architectural behavior of in-memory database systems by analyzing and contrasting it to the behavior of disk-based systems when running OLTP workloads. The results show that despite all the design changes, in-memory OLTP exhibits very similar micro-architectural behavior to disk-based OLTP systems: more than half of the execution time goes to memory stalls where L1 instruction misses and the long-latency data misses from the last-level cache are the dominant factors in the overall stall time. Even though aggressive compilation optimizations can almost eliminate instruction misses, the reduction in instruction stalls amplifies the impact of last-level cache data misses. As a result, the number of instructions retired per cycle barely reaches one on machines that are able to retire up to four for both traditional disk-based and new generation in-memory OLTP.", "citation": "Citations (10)", "year": "2016", "departments": ["École Polytechnique Fédérale de Lausanne", "IBM", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "conf": "sigmod", "authors": ["Utku Sirin.....http://dblp.org/pers/hd/s/Sirin:Utku", "Pinar Tözün.....http://dblp.org/pers/hd/t/T=ouml=z=uuml=n:Pinar", "Danica Porobic.....http://dblp.org/pers/hd/p/Porobic:Danica", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia"], "pages": 16}