{"title": "Bayesian Optimization of Partition Layouts for Mondrian Processes.", "fields": ["mondrian", "graph partition", "bayesian optimization", "partition refinement", "local optimum"], "abstract": "The Mondrian process (MP) produces hierarchical partitions on a product space as a kd-tree, which can be served as a flexible yet parsimonious partition prior for relational modeling. Due to the recursive generation of partitions and varying dimensionality of the partition state space, the inference procedure for the MP relational modeling is extremely difficult. The prevalent inference method reversible-jump MCMC for this problem requires a number of unnecessary retrospective steps to transit from one partition state to a very similar one and it is prone to fall into a local optimum. In this paper, we attempt to circumvent these drawbacks by proposing an alternative method for inferring the MP partition structure. Based on the observation that similar cutting rate measures on the partition space lead to similar partition layouts, we propose to impose a nonhomogeneous cutting rate measure on the partition space to control the layouts of the generated partitions - the original MCMC sampling problem is thus transformed into a Bayesian global optimization problem. The empirical tests demonstrate that Bayesian optimization is able to find better partition structures than MCMC sampling with the same number of partition structure proposals.", "citation": "Not cited", "year": "2016", "departments": ["University of New South Wales", "Commonwealth Scientific and Industrial Research Organisation", "Commonwealth Scientific and Industrial Research Organisation", "Commonwealth Scientific and Industrial Research Organisation", "Commonwealth Scientific and Industrial Research Organisation"], "conf": "ijcai", "authors": ["Yi Wang.....http://dblp.org/pers/hd/w/Wang:Yi", "Bin Li.....http://dblp.org/pers/hd/l/Li_0015:Bin", "Xuhui Fan.....http://dblp.org/pers/hd/f/Fan:Xuhui", "Yang Wang.....http://dblp.org/pers/hd/w/Wang:Yang", "Fang Chen.....http://dblp.org/pers/hd/c/Chen:Fang"], "pages": 7}