{"title": "System f-omega with equirecursive types for datatype-generic programming.", "fields": ["boilerplate code", "formal equivalence checking", "code refactoring", "type constructor", "system f"], "abstract": "Traversing an algebraic datatype by hand requires boilerplate code which duplicates the structure of the datatype. Datatype-generic programming (DGP) aims to eliminate such boilerplate code by decomposing algebraic datatypes into type constructor applications from which generic traversals can be synthesized. However, different traversals require different decompositions, which yield isomorphic but unequal types. This hinders the interoperability of different DGP techniques. In this paper, we propose Fωμ, an extension of the higher-order polymorphic lambda calculus Fω with records, variants, and equirecursive types. We prove the soundness of the type system, and show that type checking for first-order recursive types is decidable with a practical type checking algorithm. In our soundness proof we define type equality by interpreting types as infinitary λ-terms (in particular, Berarducci-trees). To decide type equality we β-normalize types, and then use an extension of equivalence checking for usual equirecursive types. Thanks to equirecursive types, new decompositions for a datatype can be added modularly and still interoperate with each other, allowing multiple DGP techniques to work together. We sketch how generic traversals can be synthesized, and apply these components to some examples. Since the set of datatype decomposition becomes extensible, System Fωμ enables using DGP techniques incrementally, instead of planning for them upfront or doing invasive refactoring.", "citation": "Not cited", "departments": ["University of Tübingen", "University of Tübingen", "University of Tübingen"], "authors": ["Yufei Cai.....http://dblp.org/pers/hd/c/Cai:Yufei", "Paolo G. Giarrusso.....http://dblp.org/pers/hd/g/Giarrusso:Paolo_G=", "Klaus Ostermann.....http://dblp.org/pers/hd/o/Ostermann:Klaus"], "conf": "popl", "year": "2016", "pages": 14}