{"title": "Revenue maximization by viral marketing: A social network host's perspective.", "fields": ["heuristic", "viral marketing", "maximization", "threshold model", "revenue"], "abstract": "We study the novel problem of revenue maximization of a social network host that sells viral marketing campaigns to multiple competing campaigners. Each client campaigner informs the social network host about her target users in the network, as well as how much money she is willing to pay to the host if one of her target users buys her product. The social network host, in turn, assigns a set of seed users to each of her client campaigners. The seed set for a campaigner is a limited number of users to whom the campaigner provides free samples, discounted price etc. with the expectation that these seed users will buy her product, and would also be able to influence many of her target users in the network towards buying her product. Because of various product-adoption costs, it is very unlikely that an average user will purchase more than one of the competing products. Therefore, from the host's perspective, it is important to assign seed users to client campaigners in such a way that the seed assignment guarantees the maximum aggregated revenue for the host considering all her client campaigners. We formulate our problem by following two well-established influence cascading models: the independent cascade model and the linear threshold model. While our problem using both these models is NP-hard, and neither monotonic, nor sub-modular; we develop approximated algorithms with theoretical performance guarantees. However, as our approximated algorithms often incur higher running times, we also design efficient heuristic methods that empirically perform as good as our approximated algorithms. Our detailed experimental evaluation attests that the proposed techniques are effective and scalable over real-world datasets.", "citation": "Citations (3)", "departments": ["Nanyang Technological University", "ETH Zurich", "ETH Zurich"], "authors": ["Arijit Khan.....http://dblp.org/pers/hd/k/Khan:Arijit", "Benjamin Zehnder.....http://dblp.org/pers/hd/z/Zehnder:Benjamin", "Donald Kossmann.....http://dblp.org/pers/hd/k/Kossmann:Donald"], "conf": "icde", "year": "2016", "pages": 12}