{"title": "From Improved Leakage Detection to the Detection of Points of Interests in Leakage Traces.", "fields": ["correlation coefficient", "intuition", "adversary", "leakage", "sampling"], "abstract": "Leakage detection usually refers to the task of identifying data-dependent information in side-channel measurements, independent of whether this information can be exploited. Detecting Points-Of-Interest POIs in leakage traces is a complementary task that is a necessary first step in most side-channel attacks, where the adversary wants to turn this information into e.g. a key recovery. In this paper, we discuss the differences between these tasks, by investigating a popular solution to leakage detection based on a t-test, and an alternative method exploiting Pearson's correlation coefficient. We first show that the simpler t-test has better sampling complexity, and that its gain over the correlation-based test can be predicted by looking at the Signal-to-Noise Ratio SNR of the leakage partitions used in these tests. This implies that the sampling complexity of both tests relates more to their implicit leakage assumptions than to the actual statistics exploited. We also put forward that this gain comes at the cost of some intuition loss regarding the localization of the exploitable leakage samples in the traces, and their informativeness. Next, and more importantly, we highlight that our reasoning based on the SNR allows defining an improved t-test with significantly faster detection speed with approximately 5 times less measurements in our experiments, which is therefore highly relevant for evaluation laboratories. We finally conclude that whereas t-tests are the method of choice for leakage detection only, correlation-based tests exploiting larger partitions are preferable for detecting POIs. We confirm this intuition by improving automated tools for the detection of POIs in the leakage measurements of a masked implementation, in a black box manner and without key knowledge, thanks to a correlation-based leakage detection test.", "citation": "Citations (30)", "year": "2016", "departments": ["Université catholique de Louvain", "Université catholique de Louvain"], "conf": "eurocrypt", "authors": ["François Durvaux.....http://dblp.org/pers/hd/d/Durvaux:Fran=ccedil=ois", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier"], "pages": 23}