{"title": "WebPerf: Evaluating What-If Scenarios for Cloud-hosted Web Applications.", "fields": ["latency", "cloud computing", "web application", "asynchronous communication", "web modeling"], "abstract": "Developers deploying web applications in the cloud often need to determine how changes such as service tiers or runtime loads may affect user-perceived page load time. We devise and evaluate a systematic methodology for exploring such \"what-if\" questions at the time a web application is deployed. Given a website, a web request, and “whatif” scenario, with a hypothetical configuration and runtime condition, our methodology, embedded in a system called WebPerf, can estimate a distribution of end-to-end response times for the request under the “what-if” scenario. WebPerf makes three contributions: (1) automated instrumentation of web sites written with increasingly popular task parallel libraries, to capture causal call dependencies of various computation and asynchronous I/O calls; (2) an algorithm to use the call dependencies, together with online- and offlineprofiled models of various I/O calls to estimate a distribution of end-to-end latency of the request; and (3) an algorithm to optimize modeling errors by deciding how many measurements to take within a limited time. We have implemented WebPerf for Microsoft Azure. Our experiments with five real websites and seven scenarios show that the median error of WebPerf’s estimation is within 7% for all applications and scenarios.", "citation": "Citations (4)", "departments": ["University of Southern California", "Microsoft", "Microsoft", "University of Southern California"], "authors": ["Yurong Jiang.....http://dblp.org/pers/hd/j/Jiang:Yurong", "Lenin Ravindranath Sivalingam.....http://dblp.org/pers/hd/s/Sivalingam:Lenin_Ravindranath", "Suman Nath.....http://dblp.org/pers/hd/n/Nath:Suman", "Ramesh Govindan.....http://dblp.org/pers/hd/g/Govindan:Ramesh"], "conf": "sigcomm", "year": "2016", "pages": 14}