{"title": "Linespace: A Sensemaking Platform for the Blind.", "fields": ["human computer interaction", "software engineering", "zoom", "design elements and principles", "computer science", "panning", "memorization", "sensemaking"], "abstract": "For visually impaired users, making sense of spatial information is difficult as they have to scan and memorize content before being able to analyze it. Even worse, any update to the displayed content invalidates their spatial memory, which can force them to manually rescan the entire display. Making display contents persist, we argue, is thus the highest priority in designing a sensemaking system for the visually impaired. We present a tactile display system designed with this goal in mind. The foundation of our system is a large tactile display (140x100cm, 23x larger than Hyperbraille), which we achieve by using a 3D printer to print raised lines of filament. The system's software then trades in this space in order to minimize screen updates. Instead of panning and zooming, for example, our system creates additional views, leaving display contents intact and thus supporting users in preserving their spatial memory. We illustrate our system and its design principles at the example of four spatial applications. We evaluated our system with six blind users. Participants responded favorably to the system and expressed, for example, that having multiple views at the same time was helpful. They also judged the increased expressiveness of lines over the more traditional dots as useful for encoding information.", "citation": "Not cited", "year": "2016", "departments": ["Hasso Plattner Institute", "Hasso Plattner Institute", "Hasso Plattner Institute", "Hasso Plattner Institute", "Potsdam, Potsdam, Germany"], "conf": "chi", "authors": ["Saiganesh Swaminathan.....http://dblp.org/pers/hd/s/Swaminathan:Saiganesh", "Thijs Roumen.....http://dblp.org/pers/hd/r/Roumen:Thijs", "Robert Kovacs.....http://dblp.org/pers/hd/k/Kovacs:Robert", "David Stangl.....http://dblp.org/pers/hd/s/Stangl:David", "Stefanie Müller.....http://dblp.org/pers/hd/m/M=uuml=ller_0001:Stefanie", "Patrick Baudisch.....http://dblp.org/pers/hd/b/Baudisch:Patrick"], "pages": 11}