{"title": "POLLUX: safely upgrading dependent application libraries.", "fields": ["test case", "optimizing compiler", "software maintenance", "software evolution", "backward compatibility"], "abstract": "Software evolution in third-party libraries across version upgrades can result in addition of new functionalities or change in existing APIs. As a result, there is a real danger of impairment of backward compatibility. Application developers, therefore, must keep constant vigil over library enhancements to ensure application consistency, i.e., application retains its semantic behavior across library upgrades. In this paper, we present the design and implementation of POLLUX, a framework to detect application-affecting changes across two versions of the same dependent non-adversarial library binary, and provide feedback on whether the application developer should link to the newer version or not. POLLUX leverages relevant application test cases to drive execution through both versions of the concerned library binary, records all concrete effects on the environment, and compares them to determine semantic similarity across the same API invocation for the two library versions. Our evaluation with 16 popular, open-source library binaries shows that POLLUX is accurate with no false positives and works across compiler optimizations.", "citation": "Citations (1)", "departments": ["Indraprastha Institute of Information Technology", "Indraprastha Institute of Information Technology", "Indraprastha Institute of Information Technology", "IBM", "Indian Institute of Technology Delhi"], "authors": ["Sukrit Kalra.....http://dblp.org/pers/hd/k/Kalra:Sukrit", "Ayush Goel.....http://dblp.org/pers/hd/g/Goel:Ayush", "Dhriti Khanna.....http://dblp.org/pers/hd/k/Khanna:Dhriti", "Mohan Dhawan.....http://dblp.org/pers/hd/d/Dhawan:Mohan", "Subodh Sharma.....http://dblp.org/pers/hd/s/Sharma:Subodh", "Rahul Purandare.....http://dblp.org/pers/hd/p/Purandare:Rahul"], "conf": "sigsoft", "year": "2016", "pages": 11}