{"title": "Scaffolding the scaffolding: Supporting children¿s social-emotional learning at home.", "fields": ["reinforcement", "scaffold", "social emotional learning", "experiential learning", "psychological intervention"], "abstract": "The development of strong social and emotional skills is central to personal wellbeing. Increasingly, these skills are being taught in schools through well researched curricula. Such social-emotional learning (SEL) curricula are most effective if reinforced by parents, thus transferring the skills into everyday contexts. Traditional SEL programs have however had limited success in engaging parents, and we argue that technology might be able to help bridge this school-home divide. Through interviews with SEL experts we identified central design considerations for technology and SEL content: the reliance on experiential learning and the need to scaffold the parents in scaffolding the interaction for their children. This informed the design of a technology probe comprising a magnet card and online SEL activities, deployed in a school and via Mturk. The results provide a nuanced understanding of how technology-based interventions could bridge the school-home gap in real-world settings and support at-home reinforcement of children's social-emotional skills.", "citation": "Citations (4)", "departments": ["Vienna University of Technology", "Microsoft", "Vienna University of Technology", "Microsoft", "Committee for Children"], "authors": ["Petr Slovák.....http://dblp.org/pers/hd/s/Slov=aacute=k:Petr", "Christopher Frauenberger.....http://dblp.org/pers/hd/f/Frauenberger:Christopher", "Ran Gilad-Bachrach.....http://dblp.org/pers/hd/g/Gilad=Bachrach:Ran", "Mia Doces.....http://dblp.org/pers/hd/d/Doces:Mia", "Brian Smith.....http://dblp.org/pers/hd/s/Smith:Brian", "Rachel Kamb.....http://dblp.org/pers/hd/k/Kamb:Rachel", "Kael Rowan.....http://dblp.org/pers/hd/r/Rowan:Kael", "Geraldine Fitzpatrick.....http://dblp.org/pers/hd/f/Fitzpatrick:Geraldine"], "conf": "cscw", "year": "2016", "pages": 15}