{"title": "Energy-efficient dynamic offloading and resource scheduling in mobile cloud computing.", "fields": ["frequency scaling", "clock rate", "computation offloading", "mobile cloud computing", "mobile device"], "abstract": "Mobile cloud computing (MCC) as an emerging and prospective computing paradigm, can significantly enhance computation capability and save energy of smart mobile devices (SMDs) by offloading computation-intensive tasks from resource-constrained SMDs onto the resource-rich cloud. However, how to achieve energy-efficient computation offloading under the hard constraint for application completion time remains a challenge issue. To address such a challenge, in this paper, we provide an energy-efficient dynamic offloading and resource scheduling (eDors) policy to reduce energy consumption and shorten application completion time. We first formulate the eDors problem into the energy-efficiency cost (EEC) minimization problem while satisfying the task-dependency requirements and the completion time deadline constraint. To solve the optimization problem, we then propose a distributed eDors algorithm consisting of three subalgorithms of computation offloading selection, clock frequency control and transmission power allocation. More importantly, we find that the computation offloading selection depends on not only the computing workload of a task, but also the maximum completion time of its immediate predecessors and the clock frequency and transmission power of the mobile device. Finally, our experimental results in a real testbed demonstrate that the eDors algorithm can effectively reduce the EEC by optimally adjusting the CPU clock frequency of SMDs based on the dynamic voltage and frequency scaling (DVFS) technique in local computing, and adapting the transmission power for the wireless channel conditions in cloud computing.", "citation": "Citations (56)", "departments": ["Southwest University", "Hong Kong Polytechnic University", "Stony Brook University", "Southwest University"], "authors": ["Songtao Guo.....http://dblp.org/pers/hd/g/Guo:Songtao", "Bin Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Bin", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan", "Yang Yang.....http://dblp.org/pers/hd/y/Yang:Yang"], "conf": "infocom", "year": "2016", "pages": 9}