{"title": "Cost-Effective Crowdsourced Entity Resolution: A Partial-Order Approach.", "fields": ["crowdsourcing", "computer science", "ask price", "name resolution", "data mining"], "abstract": "Crowdsourced entity resolution has recently attracted significant attentions because it can harness the wisdom of crowd to improve the quality of entity resolution. However existing techniques either cannot achieve high quality or incur huge monetary costs. To address these problems, we propose a cost-effective crowdsourced entity resolution framework, which significantly reduces the monetary cost while keeping high quality. We first define a partial order on the pairs of records. Then we select a pair as a question and ask the crowd to check whether the records in the pair refer to the same entity. After getting the answer of this pair, we infer the answers of other pairs based on the partial order. Next we iteratively select pairs without answers to ask until we get the answers of all pairs. We devise effective algorithms to judiciously select the pairs to ask in order to minimize the number of asked pairs. To further reduce the cost, we propose a grouping technique to group the pairs and we only ask one pair instead of all pairs in each group. We develop error-tolerant techniques to tolerate the errors introduced by the partial order and the crowd. Experimental results show that our method reduces the cost to 1.25% of existing approaches (or existing approaches take 80* monetary cost of our method) while not sacrificing the quality.", "citation": "Citations (23)", "year": "2016", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "conf": "sigmod", "authors": ["Chengliang Chai.....http://dblp.org/pers/hd/c/Chai:Chengliang", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Jian Li.....http://dblp.org/pers/hd/l/Li:Jian", "Dong Deng.....http://dblp.org/pers/hd/d/Deng:Dong", "Jianhua Feng.....http://dblp.org/pers/hd/f/Feng:Jianhua"], "pages": 16}