{"title": "\"The Web/Local\" Boundary Is Fuzzy: A Security Study of Chrome's Process-based Sandboxing.", "fields": ["rendering", "browser security", "executable", "sandbox", "scripting language"], "abstract": "Process-based isolation, suggested by several research prototypes, is a cornerstone of modern browser security architectures. Google Chrome is the first commercial browser that adopts this architecture. Unlike several research prototypes, Chrome's process-based design does not isolate different web origins, but primarily promises to protect \"the local system\" from \"the web\". However, as billions of users now use web-based cloud services (e.g., Dropbox and Google Drive), which are integrated into the local system, the premise that browsers can effectively isolate the web from the local system has become questionable. In this paper, we argue that, if the process-based isolation disregards the same-origin policy as one of its goals, then its promise of maintaining the \"web/local system (local)\" separation is doubtful. Specifically, we show that existing memory vulnerabilities in Chrome's renderer can be used as a stepping-stone to drop executables/scripts in the local file system, install unwanted applications and misuse system sensors. These attacks are purely data-oriented and do not alter any control flow or import foreign code. Thus, such attacks bypass binary-level protection mechanisms, including ASLR and in-memory partitioning. Finally, we discuss various full defenses and present a possible way to mitigate the attacks presented.", "citation": "Citations (1)", "year": "2016", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Microsoft", "National University of Singapore"], "conf": "ccs", "authors": ["Yaoqi Jia.....http://dblp.org/pers/hd/j/Jia:Yaoqi", "Zheng Leong Chua.....http://dblp.org/pers/hd/c/Chua:Zheng_Leong", "Hong Hu.....http://dblp.org/pers/hd/h/Hu:Hong", "Shuo Chen.....http://dblp.org/pers/hd/c/Chen:Shuo", "Prateek Saxena.....http://dblp.org/pers/hd/s/Saxena:Prateek", "Zhenkai Liang.....http://dblp.org/pers/hd/l/Liang:Zhenkai"], "pages": 14}