{"title": "Datometry Hyper-Q: Bridging the Gap Between Real-Time and Historical Analytics.", "fields": ["data virtualization", "query by example", "sql", "data analysis", "analytics"], "abstract": "Wall Street's trading engines are complex database applications written for time series databases like kdb+ that uses the query language Q to perform real-time analysis. Extending the models to include other data sources, e.g., historic data, is critical for backtesting and compliance. However, Q applications cannot run directly on SQL databases. Therefore, financial institutions face the dilemma of either maintaining two separate application stacks, one written in Q and the other in SQL, which means increased IT cost and increased risk, or migrating all Q applications to SQL, which results in losing the inherent competitive advantage on Q real-time processing. Neither solution is desirable as both alternatives are costly, disruptive, and suboptimal. In this paper we present Hyper-Q, a data virtualization plat- form that overcomes the chasm. Hyper-Q enables Q applications to run natively on PostgreSQL-compatible databases by translating queries and results on the fly. We outline the basic concepts, detail specific difficulties, and demonstrate the viability of the approach with a case study.", "citation": "Citations (1)", "year": "2016", "departments": ["Datometry Inc., ... ncisco, CA, USA", "Datometry Inc., ... ncisco, CA, USA", "Datometry Inc., ... ncisco, CA, USA", "Datometry Inc., ... ncisco, CA, USA", "Datometry Inc., ... ncisco, CA, USA"], "conf": "sigmod", "authors": ["Lyublena Antova.....http://dblp.org/pers/hd/a/Antova:Lyublena", "Rhonda Baldwin.....http://dblp.org/pers/hd/b/Baldwin:Rhonda", "Derrick Bryant.....http://dblp.org/pers/hd/b/Bryant:Derrick", "Tuan Cao.....http://dblp.org/pers/hd/c/Cao:Tuan", "Michael Duller.....http://dblp.org/pers/hd/d/Duller:Michael", "John Eshleman.....http://dblp.org/pers/hd/e/Eshleman:John", "Zhongxian Gu.....http://dblp.org/pers/hd/g/Gu:Zhongxian", "Entong Shen.....http://dblp.org/pers/hd/s/Shen:Entong", "Mohamed A. Soliman.....http://dblp.org/pers/hd/s/Soliman:Mohamed_A=", "F. Michael Waas.....http://dblp.org/pers/hd/w/Waas:F=_Michael"], "pages": 12}