{"title": "Micro Tells Macro: Predicting the Popularity of Micro-Videos via a Transductive Model.", "fields": ["transduction", "macro", "popularity", "online advertising", "modalities"], "abstract": "Micro-videos, a new form of user generated contents (UGCs), are gaining increasing enthusiasm. Popular micro-videos have enormous commercial potential in many ways, such as online marketing and brand tracking. In fact, the popularity prediction of traditional UGCs including tweets, web images, and long videos, has achieved good theoretical underpinnings and great practical success. However, little research has thus far been conducted to predict the popularity of the bite-sized videos. This task is non-trivial due to three reasons: 1) micro-videos are short in duration and of low quality; 2) they can be described by multiple heterogeneous channels, spanning from social, visual, acoustic to textual modalities; and 3) there are no available benchmark dataset and discriminant features that are suitable for this task. Towards this end, we present a transductive multi-modal learning model. The proposed model is designed to find the optimal latent common space, unifying and preserving information from different modalities, whereby micro-videos can be better represented. This latent space can be used to alleviate the information insufficiency problem caused by the brief nature of micro-videos. In addition, we built a benchmark dataset and extracted a rich set of popularity-oriented features to characterize the popular micro-videos. Extensive experiments have demonstrated the effectiveness of the proposed model. As a side contribution, we have released the dataset, codes and parameters to facilitate other researchers.", "citation": "Citations (33)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Jingyuan Chen.....http://dblp.org/pers/hd/c/Chen:Jingyuan", "Xuemeng Song.....http://dblp.org/pers/hd/s/Song:Xuemeng", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Xiang Wang.....http://dblp.org/pers/hd/w/Wang:Xiang", "Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2016", "pages": 10}