{"title": "Flexible hybrid stores: Constraint-based rewriting to the rescue.", "fields": ["rewriting", "soundness", "query rewriting", "data modeling", "data management"], "abstract": "Data management goes through interesting times1, as the number of currently available data management systems (DMSs in short) is probably higher than ever before. This leads to unique opportunities for data-intensive applications, as some systems provide excellent performance on certain data processing operations. Yet, it also raises great challenges, as a system efficient on some tasks may perform poorly or not support other tasks, making it impossible to use a single DMS for a given application. It is thus desirable to use different DMSs side by side in order to take advantage of their best performance, as advocated under terms such as hybrid or poly-stores. We present ESTOCADA, a novel system capable of exploiting side-by-side a practically unbound variety of DMSs, all the while guaranteeing the soundness and completeness of the store, and striving to extract the best performance out of the various DMSs. Our system leverages recent advances in the area of query rewriting under constraints, which we use to capture the various data models and describe the fragments each DMS stores.", "citation": "Citations (3)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "University of California, San Diego", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Francesca Bugiotti.....http://dblp.org/pers/hd/b/Bugiotti:Francesca", "Damian Bursztyn.....http://dblp.org/pers/hd/b/Bursztyn:Damian", "Alin Deutsch.....http://dblp.org/pers/hd/d/Deutsch:Alin", "Ioana Manolescu.....http://dblp.org/pers/hd/m/Manolescu:Ioana", "Stamatis Zampetakis.....http://dblp.org/pers/hd/z/Zampetakis:Stamatis"], "conf": "icde", "year": "2016", "pages": 4}