{"title": "Robust Face Recognition with Deep Multi-View Representation Learning.", "fields": ["discriminative model", "deep learning", "training set", "feature learning", "three dimensional face recognition"], "abstract": "This paper describes our proposed method targeting at the MSR Image Recognition Challenge MS-Celeb-1M. The challenge is to recognize one million celebrities from their face images captured in the real world. The challenge provides a large scale dataset crawled from the Web, which contains a large number of celebrities with many images for each subject. Given a new testing image, the challenge requires an identify for the image and the corresponding confidence score. To complete the challenge, we propose a two-stage approach consisting of data cleaning and multi-view deep representation learning. The data cleaning can effectively reduce the noise level of training data and thus improves the performance of deep learning based face recognition models. The multi-view representation learning enables the learned face representations to be more specific and discriminative. Thus the difficulties of recognizing faces out of a huge number of subjects are substantially relieved. Our proposed method achieves a coverage of 46.1% at 95% precision on the random set and a coverage of 33.0% at 95% precision on the hard set of this challenge.", "citation": "Citations (10)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Hefei University of Technology", "National University of Singapore"], "authors": ["Jianshu Li.....http://dblp.org/pers/hd/l/Li:Jianshu", "Jian Zhao.....http://dblp.org/pers/hd/z/Zhao:Jian", "Fang Zhao.....http://dblp.org/pers/hd/z/Zhao_0006:Fang", "Hao Liu.....http://dblp.org/pers/hd/l/Liu_0003:Hao", "Jing Li.....http://dblp.org/pers/hd/l/Li:Jing", "Shengmei Shen.....http://dblp.org/pers/hd/s/Shen:Shengmei", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi", "Terence Sim.....http://dblp.org/pers/hd/s/Sim:Terence"], "conf": "mm", "year": "2016", "pages": 5}