{"title": "Optimal downlink and uplink user association in backhaul-limited HetNets.", "fields": ["spectral efficiency", "heterogeneous network", "backhaul", "telecommunications link", "bottleneck"], "abstract": "Operators, struggling to continuously add capacity and upgrade their architecture to keep up with data traffic increase, are turning their attention to denser deployments that improve spectral efficiency. Denser deployments make the problem of user association challenging, and much work has been devoted to finding algorithms that strike a tradeoff between user quality of service (QoS), and network-wide performance (load-balancing). Nevertheless, the majority of these algorithms typically consider only the radio access part, and ignore the backhaul topology and potential capacity limitations. Backhaul constraints are emerging as a key performance bottleneck in future heterogeneous networks, partly due to the continuous improvement of the radio interface, and partly due to the need for inexpensive backhaul links to reduce CAPEX/OPEX. To this end, we propose an analytical framework for user association that jointly considers radio access and backhaul performance. We derive an algorithm that takes into account spectral efficiency, base station load, backhaul link capacities and topology, and uplink and downlink traffic demand, and prove it converges to an optimal solution. We then use extensive simulations to study the impact of (i) backhaul capacity limitations and (ii) backhaul topology on key performance metrics.", "citation": "Citations (7)", "departments": ["Institut Eurécom", "Institut Eurécom", "Institut Eurécom", "Intel Mobile Communications"], "authors": ["Nikolaos Sapountzis.....http://dblp.org/pers/hd/s/Sapountzis:Nikolaos", "Thrasyvoulos Spyropoulos.....http://dblp.org/pers/hd/s/Spyropoulos:Thrasyvoulos", "Navid Nikaein.....http://dblp.org/pers/hd/n/Nikaein:Navid", "Umer Salim.....http://dblp.org/pers/hd/s/Salim:Umer"], "conf": "infocom", "year": "2016", "pages": 9}