{"title": "Essentially Optimal Robust Secret Sharing with Maximal Corruptions.", "fields": ["approximation algorithm", "a share", "adversary", "secret sharing", "graph"], "abstract": "In a t-out-of-nrobust secret sharing scheme, a secret message is shared among n parties who can reconstruct the message by combining their shares. An adversary can adaptively corrupt upi¾?to t of the parties, get their shares, and modify them arbitrarily. The scheme should satisfy privacy, meaning that the adversary cannot learn anything about the shared message, and robustness, meaning that the adversary cannot cause the reconstruction procedure to output an incorrect message. Such schemes are only possible in the case of an honest majority, and here we focus on unconditional security in the maximal corruption setting where $$n = 2t+1$$ n=2t+1.\n\nIn this scenario, to share an m-bit message with a reconstruction failure probability of at most $$2^{-k}$$ 2-k, a known lower-bound shows that the share size must be at least $$m + k$$ m+ki¾?bits. On the other hand, all prior constructions have share size that scales linearly with the number of parties n, and the prior state-of-the-art scheme due to Cevallos et al. EUROCRYPT '12 achieves $$m + \\widetilde{O}k + n$$ m+O~k+n.\n\nIn this work, we construct the first robust secret sharing scheme in the maximal corruption setting with $$n=2t+1$$ n=2t+1, that avoids the linear dependence between share size and the number of parties n. In particular, we get a share size of only $$m + \\widetilde{O}k$$ m+O~ki¾?bits. Our scheme is computationally efficient and relies on approximation algorithms for the minimum graph bisection problem.", "citation": "Citations (10)", "year": "2016", "departments": ["Columbia University", "Columbia University", "Northeastern University", "Northeastern University"], "conf": "eurocrypt", "authors": ["Allison Bishop.....http://dblp.org/pers/hd/b/Bishop:Allison", "Valerio Pastro.....http://dblp.org/pers/hd/p/Pastro:Valerio", "Rajmohan Rajaraman.....http://dblp.org/pers/hd/r/Rajaraman:Rajmohan", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "pages": 29}