{"title": "Practical and secure nearest neighbor search on encrypted large-scale data.", "fields": ["cover tree", "nearest neighbor search", "best bin first", "locality sensitive hashing", "cryptographic primitive"], "abstract": "Nearest neighbor search (or k-nearest neighbor search in general) is one of the most fundamental queries on massive datasets, and it has extensive applications such as pattern recognition, statistical classification, graph algorithms, Location-Based Services and online recommendations. With the raising trend of outsourcing massive sensitive datasets to public clouds, it is urgent for companies and organizations to demand fast and secure nearest neighbor search solutions over their outsourced data, but without revealing privacy to untrusted clouds. However, existing solutions for secure nearest neighbor search still face significant limitations, which make them far from practice. In this paper, we propose a new searchable encryption scheme, which can efficiently and securely enable nearest neighbor search over encrypted data on untrusted clouds. Specifically, we modify the search algorithm of nearest neighbors with tree structures (e.g., R-trees), where the modified algorithm adapts to lightweight cryptographic primitives (e.g., Order-Preserving Encryption) without affecting the original faster-than-linear search complexity. As a result, we address all the limitations in the previous works while still maintaining correctness and security. Moreover, our design is general, which can be used for secure k-nearest neighbor search, and it is compatible with other similar tree structures. Our experimental results on Amazon EC2 show that our scheme is extremely practical over massive datasets.", "citation": "Citations (9)", "departments": ["University of Arizona", "Utah State University", "University of Arizona"], "authors": ["Boyang Wang.....http://dblp.org/pers/hd/w/Wang:Boyang", "Yantian Hou.....http://dblp.org/pers/hd/h/Hou:Yantian", "Ming Li.....http://dblp.org/pers/hd/l/Li:Ming"], "conf": "infocom", "year": "2016", "pages": 9}