{"title": "Synthesizing Robotic Handwriting Motion by Learning from Human Demonstrations.", "fields": ["ensemble learning", "simple algorithm", "handwriting", "human robot interaction", "robot"], "abstract": "This paper contributes a novel framework that enables a robotic agent to efficiently learn and synthesize believable handwriting motion. We situate the framework as a foundation with the goal of allowing children to observe, correct and engage with the robot to learn themselves the handwriting skill. The framework adapts the principle behind ensemble methods - where improved performance is obtained by combining the output of multiple simple algorithms - in an inverse optimal control problem. This integration addresses the challenges of rapid extraction and representation of multiple-mode motion trajectories, with the cost forms which are transferable and interpretable in the development of the robot compliance control. It also introduces the incorporation of a human movement inspired feature, which provides intuitive motion modulation to generalize the synthesis with poor robotic written samples for children to identify and correct. We present the results on the success of synthesizing a variety of natural-looking motion samples based upon the learned cost functions. The framework is validated by a user study, where the synthesized dynamical motion is shown to be hard to distinguish from the real human handwriting.", "citation": "Citations (6)", "year": "2016", "departments": ["École Polytechnique Fédérale de Lausanne", "INESC-ID", "Instituto Superior Técnico", "École Polytechnique Fédérale de Lausanne", "Instituto Superior Técnico"], "conf": "ijcai", "authors": ["Hang Yin.....http://dblp.org/pers/hd/y/Yin:Hang", "Patricia Alves-Oliveira.....http://dblp.org/pers/hd/a/Alves=Oliveira:Patricia", "Francisco S. Melo.....http://dblp.org/pers/hd/m/Melo:Francisco_S=", "Aude Billard.....http://dblp.org/pers/hd/b/Billard:Aude", "Ana Paiva.....http://dblp.org/pers/hd/p/Paiva:Ana"], "pages": 8}