{"title": "Efficient Nonparametric Subgraph Detection Using Tree Shaped Priors.", "fields": ["prior probability", "nonparametric statistics", "steiner tree problem", "parametric statistics", "statistic"], "abstract": "Non-parametric graph scan (NPGS) statistics are used to detect anomalous connected subgraphs on graphs, and have a wide variety of applications, such as disease outbreak detection, road traffic congestion detection, and event detection in social media. In contrast to traditional parametric scan statistics (e.g., the Kulldorff statistic), NPGS statistics are free of distributional assumptions and can be applied to heterogeneous graph data. In this paper, we make a number of contributions to the computational study of NPGS statistics. First, we present a novel reformulation of the problem as a sequence of Budget Price-Collecting Steiner Tree (BPCST) sub-problems. Second, we show that this reformulated problem is NP-hard for a large class of non-parametric statistic functions. Third, we further develop efficient exact and approximate algorithms for a special category of graphs in which the anomalous subgraphs can be reformulated in a fixed tree topology. Finally, using extensive experiments we demonstrate the performance of our proposed algorithms in two real-world application domains (water pollution detection in water sensor networks and spatial event detection in social media networks) and contrast against state-of-the-art connected subgraph detection methods.", "citation": "Citations (4)", "departments": ["Beihang University", "University at Albany, SUNY", "Beihang University", "University at Albany, SUNY", "Virginia Tech"], "authors": ["Nannan Wu.....http://dblp.org/pers/hd/w/Wu:Nannan", "Feng Chen.....http://dblp.org/pers/hd/c/Chen_0001:Feng", "Jianxin Li.....http://dblp.org/pers/hd/l/Li:Jianxin", "Baojian Zhou.....http://dblp.org/pers/hd/z/Zhou:Baojian", "Naren Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Naren"], "conf": "aaai", "year": "2016", "pages": 7}