{"title": "Dynamic control channel MAC for underwater cognitive acoustic networks.", "fields": ["underwater", "cognitive radio", "attenuation", "cognition", "simulation", "control channel", "search engine", "media access control", "network performance"], "abstract": "In recent years, the underwater cognitive acoustic network (UCAN) has been advocated as an efficient technique to enhance the utilization of acoustic channel, while not interrupting the activity of marine mammals, sonars and other acoustic users. In cognitive radios, the common control channel (CCC) based media access control (MAC) protocols are very popular for their high reliability, easy implementation and low overhead. However, due to the severe frequency-dependent attenuation of acoustic waves, a UCAN may not have enough bandwidth for CCC. How to prevent the control channel from congesting in a UCAN with heavy traffic should be investigated carefully. With this in mind, we propose a dynamic control channel MAC (DCC-MAC) for distributed UCANs. Nodes in DCC-MAC could adjust the bandwidth of their control channel adaptively based on the situation of network traffic. Whenever acoustic nodes detected the congestion of CCC, they could flexibly select proper data channels to extend the bandwidth of their control channel, and return excessive frequency bands back when the control channel becomes idle. Simulation results show that DCC-MAC could reduce the collision probability among control messages significantly, thereby providing a better network performance in terms of throughput and energy efficiency than conventional cognitive MAC protocols.", "citation": "Not cited", "departments": ["University of Connecticut", "University of Connecticut", "University of Connecticut", "University of Connecticut"], "authors": ["Yu Luo.....http://dblp.org/pers/hd/l/Luo_0001:Yu", "Lina Pu.....http://dblp.org/pers/hd/p/Pu:Lina", "Zheng Peng.....http://dblp.org/pers/hd/p/Peng_0001:Zheng", "Jun-Hong Cui.....http://dblp.org/pers/hd/c/Cui:Jun=Hong"], "conf": "infocom", "year": "2016", "pages": 9}