{"title": "Caliper: performance introspection for HPC software stacks.", "fields": ["software visualization", "software framework", "social software engineering", "software metric", "software construction"], "abstract": "Many performance engineering tasks, from long-term performance monitoring to post-mortem analysis and online tuning, require efficient runtime methods for introspection and performance data collection. To understand interactions between components in increasingly modular HPC software, performance introspection hooks must be integrated into runtime systems, libraries, and application codes across the software stack. This requires an interoperable, cross-stack, general-purpose approach to performance data collection, which neither application-specific performance measurement nor traditional profile or trace analysis tools provide. With Caliper, we have developed a general abstraction layer to provide performance data collection as a service to applications, runtime systems, libraries, and tools. Individual software components connect to Caliper in independent data producer, data consumer, and measurement control roles, which allows them to share performance data across software stack boundaries. We demonstrate Caliper's performance analysis capbilities with two case studies of production scenarios.", "citation": "Citations (6)", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory"], "authors": ["David Böhme.....http://dblp.org/pers/hd/b/B=ouml=hme:David", "Todd Gamblin.....http://dblp.org/pers/hd/g/Gamblin:Todd", "David Beckingsale.....http://dblp.org/pers/hd/b/Beckingsale:David", "Peer-Timo Bremer.....http://dblp.org/pers/hd/b/Bremer:Peer=Timo", "Alfredo Giménez.....http://dblp.org/pers/hd/g/Gim=eacute=nez:Alfredo", "Matthew P. LeGendre.....http://dblp.org/pers/hd/l/LeGendre:Matthew_P=", "Olga Pearce.....http://dblp.org/pers/hd/p/Pearce:Olga", "Martin Schulz.....http://dblp.org/pers/hd/s/Schulz_0001:Martin"], "conf": "sc", "year": "2016", "pages": 11}