{"title": "Learning Compact Visual Representation with Canonical Views for Robust Mobile Landmark Search.", "fields": ["binary code", "representativeness heuristic", "binary number", "intermediate language", "submodular set function"], "abstract": "Mobile Landmark Search (MLS) recently receives increasing attention. However, it still remains unsolved due to two important issues. One is high bandwidth consumption of query transmission, and the other is the huge visual variations of query images. This paper proposes a Canonical View based Compact Visual Representation (2CVR) to handle these problems via novel three-stage learning. First, a submodular function is designed to measure visual representativeness and redundancy of a view set. With it, canonical views, which capture key visual appearances of landmark with limited redundancy, are efficiently discovered with an iterative mining strategy. Second, multimodal sparse coding is applied to transform multiple visual features into an intermediate representation which can robustly characterize visual contents of varied landmark images with only fixed canonical views. Finally, compact binary codes are learned on intermediate representation within a tailored binary embedding model which preserves visual relations of images measured with canonical views and removes noises. With 2CVR, robust visual query processing, low-cost of query transmission, and fast search process are simultaneously supported. Experiments demonstrate the superior performance of 2CVR over several state-of-the-art methods.", "citation": "Citations (15)", "year": "2016", "departments": ["Singapore Management University", "Singapore Management University", "San Diego State University", "Wuhan University of Technology", "Shandong University"], "conf": "ijcai", "authors": ["Lei Zhu.....http://dblp.org/pers/hd/z/Zhu_0002:Lei", "Jialie Shen.....http://dblp.org/pers/hd/s/Shen:Jialie", "Xiaobai Liu.....http://dblp.org/pers/hd/l/Liu:Xiaobai", "Liang Xie.....http://dblp.org/pers/hd/x/Xie:Liang", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang"], "pages": 9}