{"title": "Nullification in the air: Interference neutralization in multi-hop wireless networks.", "fields": ["radio resource management", "reference model", "physical layer", "co channel interference", "hop"], "abstract": "Interference neutralization (IN) is an interference management technique that allows simultaneous transmission of multiple links by nullifying their mutual interference in the air via cooperation among the transmitters. Although IN has been studied from information theoretic perspective, its potential for a general multi-hop wireless network has not been explored. The goal of this paper is to understand IN in a multi-hop wireless network from networking perspective. We first establish an IN reference model. Based on this reference model, we develop a set of feasibility constraints for a subset of links to be active simultaneously. By identifying each eligible neutralization node (called neut), we study IN in a general multi-hop network and develop a set of necessary constraints to characterize neut selection, IN, and scheduling. These constraints allow us to study the performance of multi-hop networks without the need of getting involved into onerous signal design issues at the physical layer. Finally, we apply our IN model and constraints to study a throughput maximization problem and show that the use of IN can generally increase network throughput. In particular, throughput gain is most significant when the node density increases.", "citation": "Not cited", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech"], "authors": ["Huacheng Zeng.....http://dblp.org/pers/hd/z/Zeng:Huacheng", "Xu Yuan.....http://dblp.org/pers/hd/y/Yuan:Xu", "Xiaoqi Qin.....http://dblp.org/pers/hd/q/Qin:Xiaoqi", "Yi Shi.....http://dblp.org/pers/hd/s/Shi_0001:Yi", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing"], "conf": "infocom", "year": "2016", "pages": 9}