{"title": "KLAP: Kernel launch aggregation and promotion for optimizing dynamic parallelism.", "fields": ["thread", "network functions virtualization", "kernel preemption", "instruction level parallelism", "speedup"], "abstract": "Dynamic parallelism on GPUs simplifies the programming of many classes of applications that generate parallelizable work not known prior to execution. However, modern GPUs architectures do not support dynamic parallelism efficiently due to the high kernel launch overhead, limited number of simultaneous kernels, and limited depth of dynamic calls a device can support.   In this paper, we propose Kernel Launch Aggregation and Promotion (KLAP), a set of compiler techniques that improve the performance of kernels which use dynamic parallelism. Kernel launch aggregation fuses kernels launched by threads in the same warp, block, or kernel into a single aggregated kernel, thereby reducing the total number of kernels spawned and increasing the amount of work per kernel to improve occupancy. Kernel launch promotion enables early launch of child kernels to extract more parallelism between parents and children, and to aggregate kernel launches across generations mitigating the problem of limited depth.   We implement our techniques in a real compiler and show that kernel launch aggregation obtains a geometric mean speedup of 6.58x over regular dynamic parallelism. We also show that kernel launch promotion enables cases that were not originally possible, improving throughput by a geometric mean of 30.44x.", "citation": "Citations (9)", "departments": ["University of Illinois at Urbana–Champaign", "University of Córdoba", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Hewlett-Packard"], "authors": ["Izzat El Hajj.....http://dblp.org/pers/hd/h/Hajj:Izzat_El", "Juan Gómez-Luna.....http://dblp.org/pers/hd/g/G=oacute=mez=Luna:Juan", "Cheng Li.....http://dblp.org/pers/hd/l/Li:Cheng", "Li-Wen Chang.....http://dblp.org/pers/hd/c/Chang:Li=Wen", "Dejan S. Milojicic.....http://dblp.org/pers/hd/m/Milojicic:Dejan_S=", "Wen-mei W. Hwu.....http://dblp.org/pers/hd/h/Hwu:Wen=mei_W="], "conf": "micro", "year": "2016", "pages": 12}