{"title": "CacheOptimizer: helping developers configure caching frameworks for hibernate-based database-centric web applications.", "fields": ["hibernation", "cache", "speedup", "smart cache", "web application"], "abstract": "To help improve the performance of database-centric cloud-based web applications, developers usually use caching frameworks to speed up database accesses. Such caching frameworks require extensive knowledge of the application to operate effectively. However, all too often developers have limited knowledge about the intricate details of their own application. Hence, most developers find configuring caching frameworks a challenging and time-consuming task that requires extensive and scattered code changes. Furthermore, developers may also need to frequently change such configurations to accommodate the ever changing workload.     In this paper, we propose CacheOptimizer, a lightweight approach that helps developers optimize the configuration of caching frameworks for web applications that are implemented using Hibernate. CacheOptimizer leverages readily-available web logs to create mappings between a workload and database accesses. Given the mappings, CacheOptimizer discovers the optimal cache configuration using coloured Petri nets, and automatically adds the appropriate cache configurations to the application. We evaluate CacheOptimizer on three open-source web applications. We find that i) CacheOptimizer improves the throughput by 27--138%; and ii) after considering both the memory cost and throughput improvement, CacheOptimizer still brings statistically significant gains (with mostly large effect sizes) in comparison to the application's default cache configuration and to blindly enabling all possible caches.", "citation": "Citations (9)", "departments": ["Queen's University", "Concordia University", "Queen's University", "BlackBerry, Canada", "BlackBerry, Canada"], "authors": ["Tse-Hsun Chen.....http://dblp.org/pers/hd/c/Chen:Tse=Hsun", "Weiyi Shang.....http://dblp.org/pers/hd/s/Shang:Weiyi", "Ahmed E. Hassan.....http://dblp.org/pers/hd/h/Hassan:Ahmed_E=", "Mohamed N. Nasser.....http://dblp.org/pers/hd/n/Nasser:Mohamed_N=", "Parminder Flora.....http://dblp.org/pers/hd/f/Flora:Parminder"], "conf": "sigsoft", "year": "2016", "pages": 12}