{"title": "Can testedness be effectively measured?", "fields": ["mutation testing", "test suite", "java", "code coverage", "binary number"], "abstract": "Among the major questions that a practicing tester faces are deciding where to focus additional testing effort, and deciding when to stop testing. Test the least-tested code, and stop when all code is well-tested, is a reasonable answer. Many measures of \"testedness\" have been proposed; unfortunately, we do not know whether these are truly effective. In this paper we propose a novel evaluation of two of the most important and widely-used measures of test suite quality. The first measure is statement coverage, the simplest and best-known code coverage measure. The second measure is mutation score, a supposedly more powerful, though expensive, measure.     We evaluate these measures using the actual criteria of interest: if a program element is (by these measures) well tested at a given point in time, it should require fewer future bug-fixes than a \"poorly tested\" element. If not, then it seems likely that we are not effectively measuring testedness. Using a large number of open source Java programs from Github and Apache, we show that both statement coverage and mutation score have only a weak negative correlation with bug-fixes. Despite the lack of strong correlation, there are statistically and practically significant differences between program elements for various binary criteria. Program elements (other than classes) covered by any test case see about half as many bug-fixes as those not covered, and a similar line can be drawn for mutation score thresholds. Our results have important implications for both software engineering practice and research evaluation.", "citation": "Citations (7)", "departments": ["Oregon State University", "Oregon State University", "Oregon State University", "Oregon State University", "Oregon State University"], "authors": ["Iftekhar Ahmed.....http://dblp.org/pers/hd/a/Ahmed_0001:Iftekhar", "Rahul Gopinath.....http://dblp.org/pers/hd/g/Gopinath:Rahul", "Caius Brindescu.....http://dblp.org/pers/hd/b/Brindescu:Caius", "Alex Groce.....http://dblp.org/pers/hd/g/Groce:Alex", "Carlos Jensen.....http://dblp.org/pers/hd/j/Jensen:Carlos"], "conf": "sigsoft", "year": "2016", "pages": 12}