{"title": "RichReview++: Deployment of a Collaborative Multi-modal Annotation System for Instructor Feedback and Peer Discussion.", "fields": ["s voice", "software deployment", "deixis", "gesture", "modalities"], "abstract": "New multi-modal annotation tools hold the promise of bringing the benefits of face-to-face contact to remote, asynchronous interactions. One such system, RichReview++, incorporates new techniques to improve access to the embedded multimedia commentary and allows users to annotate with new modalities, like deictic gestures. We conducted a series of field deployments of RichReview++ to characterize how these features benefit students using them for activities in the university classroom. Our first deployment investigated the use of multi-modal annotations as a way for instructors to provide feedback on student term papers. Our second deployment used annotations to support peer discussion about assigned readings in a graduate-level course. We found that presenting voice comments as interactive waveforms seems to facilitate studentsâ   consumption of the instructorâ  s voice comments. We also found that gestural annotations clarify voice and give annotators a quick and lightweight way to alter the scope of their voice comments. Based on these results, we suggest ways to best leverage multi-modal annotation tools in education environments.", "citation": "Citations (10)", "departments": ["Cornell University", "Microsoft", "Cornell University", "Cornell University", "Cornell University"], "authors": ["Dongwook Yoon.....http://dblp.org/pers/hd/y/Yoon:Dongwook", "Nicholas Chen.....http://dblp.org/pers/hd/c/Chen:Nicholas", "Bernie Randles.....http://dblp.org/pers/hd/r/Randles:Bernie", "Amy Cheatle.....http://dblp.org/pers/hd/c/Cheatle:Amy", "Steven J. Jackson.....http://dblp.org/pers/hd/j/Jackson:Steven_J=", "Corinna E. Löckenhoff.....http://dblp.org/pers/hd/l/L=ouml=ckenhoff:Corinna_E=", "Abigail Sellen.....http://dblp.org/pers/hd/s/Sellen:Abigail", "François Guimbretière.....http://dblp.org/pers/hd/g/Guimbreti=egrave=re:Fran=ccedil=ois"], "conf": "cscw", "year": "2016", "pages": 11}