{"title": "SLR: A scalable latent role model for attribute completion and tie prediction in social networks.", "fields": ["homophily", "personalized search", "targeted advertising", "role model", "ranging"], "abstract": "Social networks are an important class of networks that span a wide variety of media, ranging from social websites such as Facebook and Google Plus, citation networks of academic papers and patents, caller networks in telecommunications, and hyperlinked document collections such as Wikipedia — to name a few. Many of these social networks now exceed millions of users or actors, each of which may be associated with rich attribute data such as user profiles in social websites and caller networks, or subject classifications in document collections and citation networks. Such attribute data is often incomplete for a number of reasons — for example, users may be unwilling to spend the effort to complete their profiles, while in the case of document collections, there may be insufficient human labor to accurately classify all documents. At the same time, the tie or link information in these networks may also be incomplete — in social websites, users may simply be unaware of potential acquaintances, while in citation networks, authors may be unaware of appropriate literature that should be referenced. Completing and predicting these missing attributes and ties is important to a spectrum of applications, such as recommendation, personalized search, and targeted advertising, yet large social networks can pose a scalability challenge to existing algorithms designed for this task. Towards this end, we propose an integrative probabilistic model, SLR, that captures both attribute and tie information simultaneously, and can be used for attribute completion and tie prediction, in order to enable the above mentioned applications. A key innovation in our model is the use of triangle motifs to represent ties in the network, in order to scale to networks with millions of nodes and beyond. Experiments on real world datasets show that SLR significantly improves the accuracy of attribute prediction and tie prediction compared to well-known methods, and our distributed, multi-machine implementation easily scales up to millions of users. In addition to fast and accurate attribute and tie prediction, we also demonstrate how SLR can identify the attributes most responsible for homophily within the network, thus revealing which attributes drive network tie formation.", "citation": "Not cited", "departments": ["National University of Singapore", "Agency for Science, Technology and Research", "Singapore Management University", "Singapore Management University"], "authors": ["Lizi Liao.....http://dblp.org/pers/hd/l/Liao:Lizi", "Qirong Ho.....http://dblp.org/pers/hd/h/Ho:Qirong", "Jing Jiang.....http://dblp.org/pers/hd/j/Jiang:Jing", "Ee-Peng Lim.....http://dblp.org/pers/hd/l/Lim:Ee=Peng"], "conf": "icde", "year": "2016", "pages": 12}