{"title": "Successor: Proactive cache warm-up of destination hosts in virtual machine migration contexts.", "fields": ["page cache", "bus sniffing", "snoopy cache", "smart cache", "cache pollution"], "abstract": "In virtualization platforms, host-side storage caches can serve virtual machines (VM) disk I/O requests, which originally target network storage servers. When these requests hit host-side caches, network and disk access latencies are obviated, and thus VMs perceive improved storage performance. VM migration is common in cloud environments, however, VM migration does not transfer host-side cache states. As a result, a newly migrated VM suffers performance degradation until the cache is fully rebuilt. The performance degradation period can be hours long if the cache is naturally warmed up. Employing existing cache warm-up solutions such as migrating host-side cache and Bonfire, VMs may either have a prolonged total migration time or undergo a performance degradation period of tens of minutes due to the warm-up caused storage contention. We propose Successor, which proactively warms up caches of destination hosts before migration completes. Specifically, accessibility of destination hosts during migration enables Successor to parallelize cache warm-up and VM migration. Compared with migrating host-side cache and Bonfire, Successor achieves zero VM-perceived cache warm-up time with low resource costs and performance penalties. We have implemented a prototype of Successor on QEMU/KVM based virtualization platform and verified its efficiency.", "citation": "Citations (1)", "departments": ["Virginia Commonwealth University", "Virginia Commonwealth University", "Virginia Commonwealth University", "Virginia Commonwealth University", "Virginia Commonwealth University"], "authors": ["Tao Lu.....http://dblp.org/pers/hd/l/Lu:Tao", "Ping Huang.....http://dblp.org/pers/hd/h/Huang:Ping", "Morgan Stuart.....http://dblp.org/pers/hd/s/Stuart:Morgan", "Yuhua Guo.....http://dblp.org/pers/hd/g/Guo:Yuhua", "Xubin He.....http://dblp.org/pers/hd/h/He:Xubin", "Ming Zhang.....http://dblp.org/pers/hd/z/Zhang:Ming"], "conf": "infocom", "year": "2016", "pages": 9}