{"title": "Which Way Did They Go? Newcomer Movement through the Zooniverse.", "fields": ["crowdsourcing", "citizen science", "peer production", "community engagement", "multimethodology"], "abstract": "Research on newcomer roles in peer production sites (e.g., Wikipedia) is characterized by a broad and relatively well articulated set of functionally and culturally recognizable roles. But not all communities come with well-defined roles that newcomers can aspire to occupy. The present study explores activity clusters newcomers create when faced with few recognizable roles to fill and limited access to other participantsâ   work that serves as an exemplar. Drawing on a mixed method research design, we present findings from an analysis of 1,687 newcomersâ   sessions in an online citizen science project. Our analysis revealed three major findings: (1) newcomersâ   activities exists across six session types; (2) newcomers toggle between light work sessions and more involved types of production or community engagement; (3) high-level contributors contribute large volumes of work but comment very little and another group contributes large volumes of comments, but works very little. The former group draws heavily on posts contributed by the latter group. Identifying shifts and regularities in contribution facilitate improved mechanisms for engaging participants and for the design of online citizen science communities.", "citation": "Citations (4)", "departments": ["Syracuse University", "Syracuse University", "Adler Planetarium", "Syracuse University", "Syracuse University"], "authors": ["Corey Brian Jackson.....http://dblp.org/pers/hd/j/Jackson:Corey_Brian", "Carsten S. Østerlund.....http://dblp.org/pers/hd/=/=Oslash=sterlund:Carsten_S=", "Veronica Maidel.....http://dblp.org/pers/hd/m/Maidel:Veronica", "Kevin Crowston.....http://dblp.org/pers/hd/c/Crowston:Kevin", "Gabriel Mugar.....http://dblp.org/pers/hd/m/Mugar:Gabriel"], "conf": "cscw", "year": "2016", "pages": 12}