{"title": "Antenna orientation and range assignment in WSNs with directional antennas.", "fields": ["graph bandwidth", "connectivity", "graph", "directional antenna", "bounded function"], "abstract": "Consider a set S of nodes in the plane such that the unit-disk graph G(S) spanning all nodes is connected. Each node in S is equipped with a directional antenna with beam-width θ = π/2. The objective of the Directional Antenna Orientation (AO) problem concerning symmetric connectivity is to determine an orientation of the antennas with a minimum transmission power range r = O(1) such that the induced symmetric communication graph is connected. Another related problem is the Antenna Orientation and Power Assignment (AOPA) problem whose objective is to assign each node u ∊ S an orientation of its antenna as well as a range r(u) such that the induced symmetric communication graph is connected and the total power assigned ∑u∊Sr(u)β is minimized, where β ≥ 1 is the distance-power gradient (typically 2 ≤ β ≤ 5). In this paper, we study both problems by first proving that they are NP-hard. To the best of our knowledge, these NP-hardness results have not been obtained before in the literature. We then propose an algorithm for the AO problem that orients the antennas to yield a symmetric connected graph where the transmission power range is bounded by 9 which is currently the best result for this problem. (Previous bound for this problem is 14√2 by Aschner et al [1].) We also propose a constant-approximation algorithm for the AOPA problem where our constant is smaller than the one in Aschner et al's algorithm [1].", "citation": "Citations (4)", "departments": ["University of Texas at Dallas", "Sam Houston State University", "University of Texas at Dallas"], "authors": ["Tien Tran.....http://dblp.org/pers/hd/t/Tran:Tien", "Min Kyung An.....http://dblp.org/pers/hd/a/An:Min_Kyung", "Dung T. Huynh.....http://dblp.org/pers/hd/h/Huynh:Dung_T="], "conf": "infocom", "year": "2016", "pages": 9}