{"title": "EMIT: An efficient MAC paradigm for the Internet of Things.", "fields": ["computer network", "exploit", "computer science", "internet of things"], "abstract": "The future Internet of Things (IoT) networks are expected to be composed of a large population of low-cost devices communicating dynamically with access points or neighboring devices to communicate small bundles of delay-sensitive data. To support the high-intensity and short-lived demands of these emerging networks, we propose an Efficient MAC paradigm for IoT (EMIT). Our paradigm bypasses the high overhead and coordination costs of existing MAC solutions by employing an interference-averaging strategy that allow users to share their resources simultaneously. In contrast to the predominant interference-suppressing approaches, EMIT exploits the dense and dynamic nature of IoT networks to reduce the spatio-temporal variability of interference to achieve low-delay and high-reliability in service. This paper introduces foundational ideas of EMIT by characterizing the global interference statistics in terms of single-device operation and develops power-rate allocation strategies to guarantee low-delay high-reliability performance. A significant portion of our work is aimed at validating these theoretical principles in experimental testbeds, where we compare the performance of EMIT to a CSMA-based MAC protocol. Our comparisons confirm the beneficial characteristics of EMIT, and reveal significant gains over CSMA strategies in the case of IoT traffic.", "citation": "Citations (3)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Arjun Bakshi.....http://dblp.org/pers/hd/b/Bakshi:Arjun", "Lu Chen.....http://dblp.org/pers/hd/c/Chen:Lu", "Kannan Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Kannan", "Can Emre Koksal.....http://dblp.org/pers/hd/k/Koksal:Can_Emre", "Atilla Eryilmaz.....http://dblp.org/pers/hd/e/Eryilmaz:Atilla"], "conf": "infocom", "year": "2016", "pages": 9}