{"title": "Deploying nEmesis: Preventing Foodborne Illness by Data Mining Social Media.", "fields": ["social media", "public health", "simulation", "food safety", "health department", "software deployment"], "abstract": "Foodborne illness afflicts 48 million people annually in the U.S. alone. Over 128,000 are hospitalized and 3,000 die from the infection. While preventable with proper food safety practices, the traditional restaurant inspection process has limited impact given the predictability and low frequency of inspections, and the dynamic nature of the kitchen environment. Despite this reality, the inspection process has remained largely unchanged for decades. We apply machine learning to Twitter data and develop a system that automatically detects venues likely to pose a public health hazard. Health professionals subsequently inspect individual flagged venues in a double blind experiment spanning the entire Las Vegas metropolitan area over three months. By contrast, previous research in this domain has been limited to indirect correlative validation using only aggregate statistics. We show that adaptive inspection process is 63% more effective at identifying problematic venues than the current state of the art. The live deployment shows that if every inspection in Las Vegas became adaptive, we can prevent over 9,000 cases of foodborne illness and 557 hospitalizations annually. Additionally, adaptive inspections result in unexpected benefits, including the identification of venues lacking permits, contagious kitchen staff, and fewer customer complaints filed with the Las Vegas health department.", "citation": "Citations (9)", "departments": ["University of Rochester", "University of Rochester", "University of Rochester", "University of Rochester", "University of Rochester", "University of Rochester", "Southern Nevada ...  Las Vegas, NV", "Southern Nevada ...  Las Vegas, NV", "Southern Nevada ... Health District", "Southern Nevada ... s Vegas, Nevada"], "authors": ["Adam Sadilek.....http://dblp.org/pers/hd/s/Sadilek:Adam", "Henry A. Kautz.....http://dblp.org/pers/hd/k/Kautz:Henry_A=", "Lauren DiPrete.....http://dblp.org/pers/hd/d/DiPrete:Lauren", "Brian Labus.....http://dblp.org/pers/hd/l/Labus:Brian", "Eric Portman.....http://dblp.org/pers/hd/p/Portman:Eric", "Jack Teitel.....http://dblp.org/pers/hd/t/Teitel:Jack", "Vincent Silenzio.....http://dblp.org/pers/hd/s/Silenzio:Vincent"], "conf": "aaai", "year": "2016", "pages": 9}