{"title": "Potential and Pitfalls of Domain-Specific Information Extraction at Web Scale.", "fields": ["information extraction", "focused crawler", "named entity recognition", "big data", "annotation"], "abstract": "In many domains, a plethora of textual information is available on the web as news reports, blog posts, community portals, etc. Information extraction (IE) is the default technique to turn unstructured text into structured fact databases, but systematically applying IE techniques to web input requires highly complex systems, starting from focused crawlers over quality assurance methods to cope with the HTML input to long pipelines of natural language processing and IE algorithms. Although a number of tools for each of these steps exists, their seamless, flexible, and scalable combination into a web scale end-to-end text analytics system still is a true challenge. In this paper, we report our experiences from building such a system for comparing the \"web view\" on health related topics with that derived from a controlled scientific corpus, i.e., Medline. The system combines a focused crawler, applying shallow text analysis and classification to maintain focus, with a sophisticated text analytic engine inside the Big Data processing system Stratosphere. We describe a practical approach to seed generation which led us crawl a corpus of ~1 TB web pages highly enriched for the biomedical domain. Pages were run through a complex pipeline of best-of-breed tools for a multitude of necessary tasks, such as HTML repair, boilerplate detection, sentence detection, linguistic annotation, parsing, and eventually named entity recognition for several types of entities. Results are compared with those from running the same pipeline (without the web-related tasks) on a corpus of 24 million scientific abstracts and a third corpus made of ~250K scientific full texts. We evaluate scalability, quality, and robustness of the employed methods and tools. The focus of this paper is to provide a large, real-life use case to inspire future research into robust, easy-to-use, and scalable methods for domain-specific IE at web scale.", "citation": "Not cited", "year": "2016", "departments": ["Humboldt University of Berlin", "Humboldt University of Berlin", "Humboldt University of Berlin", "Humboldt University of Berlin", "Humboldt University of Berlin"], "conf": "sigmod", "authors": ["Astrid Rheinländer.....http://dblp.org/pers/hd/r/Rheinl=auml=nder:Astrid", "Mario Lehmann.....http://dblp.org/pers/hd/l/Lehmann:Mario", "Anja Kunkel.....http://dblp.org/pers/hd/k/Kunkel:Anja", "Jörg Meier.....http://dblp.org/pers/hd/m/Meier:J=ouml=rg", "Ulf Leser.....http://dblp.org/pers/hd/l/Leser:Ulf"], "pages": 13}