{"title": "Scalable supergraph search in large graph databases.", "fields": ["graph", "tree decomposition", "graph database", "performance studies", "subgraph isomorphism problem"], "abstract": "Supergraph search is a fundamental problem in graph databases that is widely applied in many application scenarios. Given a graph database and a query-graph, supergraph search retrieves all data-graphs contained in the query-graph from the graph database. Most existing solutions for supergraph search follow the pruning-and-verification framework, which prunes false answers based on features in the pruning phase and performs subgraph isomorphism testings on the remaining graphs in the verification phase. However, they are not scalable to handle large-sized data-graphs and query-graphs due to three drawbacks. First, they rely on a frequent subgraph mining algorithm to select features which is expensive and cannot generate large features. Second, they require a costly verification phase. Third, they process features in a fixed order without considering their relationship to the query-graph. In this paper, we address the three drawbacks and propose new indexing and query processing algorithms. In indexing, we select features directly from the data-graphs without expensive frequent subgraph mining. The features form a feature-tree that contains all-sized features and both the cost sharing and pruning power of the features are considered. In query processing, we propose a verification-free algorithm, where the order to process features is query-dependent by considering both the cost sharing and the pruning power. We explore two optimization strategies to further improve the algorithm efficiency. The first strategy applies a lightweight graph compression technique and the second strategy optimizes the inclusion of answers. Finally, we conduct extensive performance studies on two real large datasets to demonstrate the high scalability of our algorithms.", "citation": "Citations (1)", "departments": ["East China Normal University", "University of Technology, Sydney", "University of New South Wales", "University of New South Wales", "The Chinese University of Hong Kong"], "authors": ["Bingqing Lyu.....http://dblp.org/pers/hd/l/Lyu:Bingqing", "Lu Qin.....http://dblp.org/pers/hd/q/Qin:Lu", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Lijun Chang.....http://dblp.org/pers/hd/c/Chang:Lijun", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu"], "conf": "icde", "year": "2016", "pages": 12}