{"title": "VADS: Visual attention detection with a smartphone.", "fields": ["latency", "computer vision", "smart environment", "artificial intelligence", "computer science"], "abstract": "Identifying the object that attracts human visual attention is an essential function for automatic services in smart environments. However, existing solutions can compute the gaze direction without providing the distance to the target. In addition, most of them rely on special devices or infrastructure support. This paper explores the possibility of using a smartphone to detect the visual attention of a user. By applying the proposed VADS system, acquiring the location of the intended object only requires one simple action: gazing at the intended object and holding up the smartphone so that the object as well as user's face can be simultaneously captured by the front and rear cameras. We extend the current advances of computer vision to develop efficient algorithms to obtain the distance between the camera and user, the user's gaze direction, and the object's direction from camera. The object's location can then be computed by solving a trigonometric problem. VADS has been prototyped on commercial off-the-shelf (COTS) devices. Extensive evaluation results show that VADS achieves low error (about 1.5° in angle and 0.15m in distance for objects within 12m) as well as short latency. We believe that VADS enables a large variety of applications in smart environments.", "citation": "Citations (5)", "departments": ["Xi'an Jiaotong University", "Xi'an Jiaotong University", "University of Kentucky", "Xi'an Jiaotong University", "Xi'an Jiaotong University"], "authors": ["Zhiping Jiang.....http://dblp.org/pers/hd/j/Jiang:Zhiping", "Jinsong Han.....http://dblp.org/pers/hd/h/Han:Jinsong", "Chen Qian.....http://dblp.org/pers/hd/q/Qian_0001:Chen", "Wei Xi.....http://dblp.org/pers/hd/x/Xi:Wei", "Kun Zhao.....http://dblp.org/pers/hd/z/Zhao:Kun", "Han Ding.....http://dblp.org/pers/hd/d/Ding:Han", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Jizhong Zhao.....http://dblp.org/pers/hd/z/Zhao:Jizhong", "Panlong Yang.....http://dblp.org/pers/hd/y/Yang:Panlong"], "conf": "infocom", "year": "2016", "pages": 9}