{"title": "ARdoc: app reviews development oriented classifier.", "fields": ["download", "sentiment analysis", "ranging", "software maintenance", "app store"], "abstract": "Google Play, Apple App Store and Windows Phone Store are well known distribution platforms where users can download mobile apps, rate them and write review comments about the apps they are using. Previous research studies demonstrated that these reviews contain important information to help developers improve their apps. However, analyzing reviews is challenging due to the large amount of reviews posted every day, the unstructured nature of reviews and its varying quality.     In this demo we present ARdoc, a tool which combines three techniques: (1) Natural Language Parsing, (2) Text Analysis and (3) Sentiment Analysis to automatically classify useful feedback contained in app reviews important for performing software maintenance and evolution tasks. Our quantitative and qualitative analysis (involving mobile professional developers) demonstrates that ARdoc correctly classifies feedback useful for maintenance perspectives in user reviews with high precision (ranging between 84% and 89%), recall (ranging between 84% and 89%), and F-Measure (ranging between 84% and 89%). While evaluating our tool developers of our study confirmed the usefulness of ARdoc in extracting important maintenance tasks for their mobile applications.     Demo URL: https://youtu.be/Baf18V6sN8E     Demo Web Page: http://www.ifi.uzh.ch/seal/people/panichella/tools/ARdoc.html", "citation": "Citations (13)", "year": "2016", "departments": ["University of Zurich", "University of Sannio", "University of Zurich", "University of Sannio", "University of Sannio"], "conf": "sigsoft", "authors": ["Sebastiano Panichella.....http://dblp.org/pers/hd/p/Panichella:Sebastiano", "Andrea Di Sorbo.....http://dblp.org/pers/hd/s/Sorbo:Andrea_Di", "Emitza Guzman.....http://dblp.org/pers/hd/g/Guzman:Emitza", "Corrado Aaron Visaggio.....http://dblp.org/pers/hd/v/Visaggio:Corrado_Aaron", "Gerardo Canfora.....http://dblp.org/pers/hd/c/Canfora:Gerardo", "Harald C. Gall.....http://dblp.org/pers/hd/g/Gall:Harald_C="], "pages": 5}