{"title": "Spice: Socially-driven learning-based mobile media prefetching.", "fields": ["mobile web", "quality of experience", "mobile technology", "mobile database", "mobile search"], "abstract": "Mobile online social networks (OSNs) are emerging as the popular mainstream platform for information and content sharing among people. In order to provide Quality of Experience (QoE) support for mobile OSN services, in this paper we propose a socially-driven learning-based framework, namely Spice, for media content prefetching to reduce the access delay and enhance mobile user's satisfaction. Through a large-scale data-driven analysis over real-life mobile Twitter traces from over 17,000 users during a period of five months, we reveal that the social friendship has a great impact on user's media content click behavior. To capture this effect, we conduct social friendship clustering over the set of user's friends, and then develop a cluster-based Latent Bias Model for socially-driven learning-based prefetching prediction. We then propose a usage-adaptive prefetching scheduling scheme by taking into account that different users may possess heterogeneous patterns in the mobile OSN app usage. We comprehensively evaluate the performance of Spice framework using trace-driven emulations on smartphones. Evaluation results corroborate that the Spice can achieve superior performance, with an average 67.2% access delay reduction at the low cost of cellular data and energy consumption. Furthermore, by enabling users to offload their machine learning procedures to a cloud server, our design can achieve speed-up of a factor of 1000 over the local data training execution on smartphones.", "citation": "Citations (8)", "departments": ["Tsinghua University", "University of Göttingen", "Tsinghua University", "Zhongyuan University of Technology", "University of Göttingen"], "authors": ["Chao Wu.....http://dblp.org/pers/hd/w/Wu_0002:Chao", "Xu Chen.....http://dblp.org/pers/hd/c/Chen_0004:Xu", "Yuezhi Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuezhi", "Ningyuan Li.....http://dblp.org/pers/hd/l/Li:Ningyuan", "Xiaoming Fu.....http://dblp.org/pers/hd/f/Fu_0001:Xiaoming", "Yaoxue Zhang.....http://dblp.org/pers/hd/z/Zhang:Yaoxue"], "conf": "infocom", "year": "2016", "pages": 9}