{"title": "Max-Information, Differential Privacy, and Post-selection Hypothesis Testing.", "fields": ["upper and lower bounds", "bounded function", "statistical hypothesis testing", "product distribution", "differential privacy"], "abstract": "In this paper, we initiate a principled study of how the generalization properties of approximate differential privacy can be used to perform adaptive hypothesis testing, while giving statistically valid p-value corrections. We do this by observing that the guarantees of algorithms with bounded approximate max-information are sufficient to correct the p-values of adaptively chosen hypotheses, and then by proving that algorithms that satisfy (e,δ)-differential privacy have bounded approximate max information when their inputs are drawn from a product distribution. This substantially extends the known connection between differential privacy and max-information, which previously was only known to hold for (pure) (e,0)-differential privacy. It also extends our understanding of max-information as a partially unifying measure controlling the generalization properties of adaptive data analyses. We also show a lower bound, proving that (despite the strong composition properties of max-information), when data is drawn from a product distribution, (e,δ)-differentially private algorithms can come first in a composition with other algorithms satisfying max-information bounds, but not necessarily second if the composition is required to itself satisfy a nontrivial max-information bound. This, in particular, implies that the connection between (e,δ)-differential privacy and max-information holds only for inputs drawn from product distributions, unlike the connection between (e,0)-differential privacy and max-information.", "citation": "Citations (2)", "departments": ["University of Pennsylvania", "University of Pennsylvania", "Pennsylvania State University", "Boston University"], "authors": ["Ryan M. Rogers.....http://dblp.org/pers/hd/r/Rogers:Ryan_M=", "Aaron Roth.....http://dblp.org/pers/hd/r/Roth:Aaron", "Adam D. Smith.....http://dblp.org/pers/hd/s/Smith:Adam_D=", "Om Thakkar.....http://dblp.org/pers/hd/t/Thakkar:Om"], "conf": "focs", "year": "2016", "pages": 8}