{"title": "Optimizing Bulk Transfers with Software-Defined Optical WAN.", "fields": ["network layer", "management system", "software defined networking", "testbed", "network topology"], "abstract": "Bulk transfer on the wide-area network (WAN) is a fundamental service to many globally-distributed applications. It is challenging to efficiently utilize expensive WAN bandwidth to achieve short transfer completion time and meet mission-critical deadlines. Advancements in software-defined networking (SDN) and optical hardware make it feasible and beneficial to quickly reconfigure optical devices in the optical layer, which brings a new opportunity for traffic management on the WAN.   We present Owan, a novel traffic management system that optimizes wide-area bulk transfers with centralized joint control of the optical and network layers. \\sysname can dynamically change the network-layer topology by reconfiguring the optical devices. We develop efficient algorithms to jointly optimize optical circuit setup, routing and rate allocation, and dynamically adapt them to traffic demand changes. We have built a prototype of Owan with commodity optical and electrical hardware. Testbed experiments and large-scale simulations on two ISP topologies and one inter-DC topology show that \\sysname completes transfers up to 4.45x faster on average, and up to 1.36x more transfers meet their deadlines, as compared to prior methods that only control the network layer.", "citation": "Citations (14)", "departments": ["Princeton University", "Tsinghua University", "Tsinghua University", "Stony Brook University", "Stony Brook University"], "authors": ["Xin Jin.....http://dblp.org/pers/hd/j/Jin_0008:Xin", "Yiran Li.....http://dblp.org/pers/hd/l/Li:Yiran", "Da Wei.....http://dblp.org/pers/hd/w/Wei:Da", "Siming Li.....http://dblp.org/pers/hd/l/Li:Siming", "Jie Gao.....http://dblp.org/pers/hd/g/Gao:Jie", "Lei Xu.....http://dblp.org/pers/hd/x/Xu:Lei", "Guangzhi Li.....http://dblp.org/pers/hd/l/Li:Guangzhi", "Wei Xu.....http://dblp.org/pers/hd/x/Xu:Wei", "Jennifer Rexford.....http://dblp.org/pers/hd/r/Rexford:Jennifer"], "conf": "sigcomm", "year": "2016", "pages": 14}