{"title": "Testing Assignments to Constraint Satisfaction Problems.", "fields": ["polymorphism", "property testing", "template", "trichotomy", "constraint satisfaction problem"], "abstract": "For a finite relational structure A, let CSP(A) denote the CSP instances whose constraint relations are taken from A. The resulting family of problems CSP(A) has been considered heavily in a variety of computational contexts. In this article, we consider this family from the perspective of property testing: given an instance of a CSP and query access to an assignment, one wants to decide whether the assignment satisfies the instance, or is far from so doing. While previous work on this scenario studied concrete templates or restricted classes of structures, this article presents comprehensive classification theorems. Our first contribution is a dichotomy theorem completely characterizing the structures A such that CSP(A) is constant-query testable: (i) If A has a majority polymorphism and a Maltsev polymorphism, then CSP(A) is constant-query testable with one-sided error. (ii) Else, testing CSP(A) requires a super-constant number of queries. Let ∃CSP(A) denote the extension of CSP(A) to instances which may include existentially quantified variables. Our second contribution is to classify all structures A in terms of the number of queries needed to test assignments to instances of ∃CSP(A), with one-sided error. More specifically, we show the following trichotomy (i) If A has a majority polymorphism and a Maltsev polymorphism, then ∃CSP(A) is constant-query testable with one-sided error. (ii) Else, if A has a (k + 1)-ary near-unanimity polymorphism for some k ≥ 2, and no Maltsev polymorphism then ∃CSP(A) is not constant-query testable (even with two-sided error) but is sublinear-query testable with one-sided error. (iii) Else, testing ∃CSP(A) with one-sided error requires a linear number of queries.", "citation": "Not cited", "departments": ["University of the Basque Country", "McMaster University", "National Institute of Informatics"], "authors": ["Hubie Chen.....http://dblp.org/pers/hd/c/Chen:Hubie", "Matthew Valeriote.....http://dblp.org/pers/hd/v/Valeriote:Matthew", "Yuichi Yoshida.....http://dblp.org/pers/hd/y/Yoshida:Yuichi"], "conf": "focs", "year": "2016", "pages": 10}