{"title": "Subversive-C: Abusing and Protecting Dynamic Message Dispatch.", "fields": ["os x", "memory management", "exploit", "computation", "counterfeit"], "abstract": "The lower layers in the modern computing infrastructure are written in languages threatened by exploitation of memory management errors. Recently deployed exploit mitigations such as control-flow integrity (CFI) can prevent traditional return-oriented programming (ROP) exploits but are much less effective against newer techniques such as Counterfeit Object-Oriented Programming (COOP) that execute a chain of C++ virtual methods. Since these methods are valid control-flow targets, COOP attacks are hard to distinguish from benign computations. Code randomization is likewise ineffective against COOP. Until now, however, COOP attacks have been limited to vulnerable C++ applications which makes it unclear whether COOP is as general and portable a threat as ROP.\n\nThis paper demonstrates the first COOP-style exploit for Objective-C, the predominant programming language on Apple's OS X and iOS platforms. We also retrofit the Objective-C runtime with the first practical and efficient defense against our novel attack. Our defense is able to protect complex, real-world software such as iTunes without recompilation. Our performance experiments show that the overhead of our defense is low in practice.", "citation": "Citations (7)", "departments": ["University of California, Irvine", "Ruhr University Bochum", "University of California, Irvine", "Microsoft", "Immunant, Inc."], "authors": ["Julian Lettner.....http://dblp.org/pers/hd/l/Lettner:Julian", "Benjamin Kollenda.....http://dblp.org/pers/hd/k/Kollenda:Benjamin", "Andrei Homescu.....http://dblp.org/pers/hd/h/Homescu:Andrei", "Per Larsen.....http://dblp.org/pers/hd/l/Larsen:Per", "Felix Schuster.....http://dblp.org/pers/hd/s/Schuster:Felix", "Lucas Davi.....http://dblp.org/pers/hd/d/Davi:Lucas", "Ahmad-Reza Sadeghi.....http://dblp.org/pers/hd/s/Sadeghi:Ahmad=Reza", "Thorsten Holz.....http://dblp.org/pers/hd/h/Holz:Thorsten", "Michael Franz.....http://dblp.org/pers/hd/f/Franz:Michael"], "conf": "usenix", "year": "2016", "pages": 13}