{"title": "Separations in query complexity based on pointer functions.", "fields": ["query optimization", "nand logic", "independent set", "quantum algorithm", "communication complexity", "computer science", "discrete mathematics", "pointer", "theoretical computer science"], "abstract": "In 1986, Saks and Wigderson conjectured that the largest separation between deterministic and zero-error randomized query complexity for a total boolean function is given by the function  f  on  n =2  k   bits defined by a complete binary tree of NAND gates of depth  k , which achieves  R  0 ( f ) =  O ( D ( f ) 0.7537… ). We show this is false by giving an example of a total boolean function  f  on  n  bits whose deterministic query complexity is Ω( n /log( n )) while its zero-error randomized query complexity is O(√ n ). We further show that the quantum query complexity of the same function is O( n  1/4 ), giving the first example of a total function with a super-quadratic gap between its quantum and deterministic query complexities.   We also construct a total boolean function  g  on  n  variables that has zero-error randomized query complexity Ω( n /log( n )) and bounded-error randomized query complexity  R ( g ) = O(√ n ). This is the first super-linear separation between these two complexity measures. The exact quantum query complexity of the same function is  Q   E  ( g ) = O(√ n ).   These functions show that the relations  D ( f ) =  O ( R  1 ( f ) 2 ) and  R  0 ( f ) = O( R ( f ) 2 ) are optimal, up to poly-logarithmic factors. Further variations of these functions give additional separations between other query complexity measures: a cubic separation between  Q  and  R  0 , a 3/2-power separation between  Q   E   and  R , and a 4th power separation between approximate degree and bounded-error randomized query complexity.   All of these examples are variants of a function recently introduced by Goos, Pitassi, and Watson which they used to separate the unambiguous 1-certificate complexity from deterministic query complexity and to resolve the famous Clique versus Independent Set problem in communication complexity.", "citation": "Citations (20)", "year": "2016", "departments": ["University of Latvia", "University of Latvia", "Nanyang Technological University", "National University of Singapore", "University of Latvia", "University of Latvia", "University of Latvia", "Centre for Quantum Technologies", "National University of Singapore", "CWI, Netherlands"], "conf": "stoc", "authors": ["Andris Ambainis.....http://dblp.org/pers/hd/a/Ambainis:Andris", "Kaspars Balodis.....http://dblp.org/pers/hd/b/Balodis:Kaspars", "Aleksandrs Belovs.....http://dblp.org/pers/hd/b/Belovs:Aleksandrs", "Troy Lee.....http://dblp.org/pers/hd/l/Lee:Troy", "Miklos Santha.....http://dblp.org/pers/hd/s/Santha:Miklos", "Juris Smotrovs.....http://dblp.org/pers/hd/s/Smotrovs:Juris"], "pages": 14}