{"title": "Murphy loves CI: Unfolding and improving constructive interference in WSNs.", "fields": ["network packet", "multicast", "flooding", "key distribution in wireless sensor networks", "phenomenon"], "abstract": "Constructive Interference (CI) phenomenon has been exploited by Glossy, a mechanism for low-latency and reliable network flooding and time synchronization for wireless sensor networks. Recently, CI has also been used for other applications such as data collection and multicasting in static and mobile WSNs. These applications base their working on the high reliability promised by Glossy regardless of the physical conditions of deployment, number of nodes in the network, and unreliable wireless channels that may be detrimental for CI. There are several works that study the working of CI, but they present inconsistent views. We study CI from a receiver's viewpoint, list factors that affect CI and also specify how and why they affect. We validate our arguments with results from extensive and rigorous experimentation in real-world settings. This paper presents comprehensive insights into CI phenomenon. With this understanding, we improve the performance of CI through an energy-efficient and distributed algorithm. We cause destructive interference on a designated byte to provide negative feedback. We leverage this to adapt transmission powers. Compared to Glossy, we achieve 25% lesser packet losses while using only half of its transmission power.", "citation": "Citations (4)", "departments": ["Delft University of Technology", "Indian Institute of Science", "Delft University of Technology", "Indian Institute of Science", "Delft University of Technology"], "authors": ["Vijay S. Rao.....http://dblp.org/pers/hd/r/Rao:Vijay_S=", "M. Koppal.....http://dblp.org/pers/hd/k/Koppal:M=", "R. Venkatesha Prasad.....http://dblp.org/pers/hd/p/Prasad:R=_Venkatesha", "Tamma V. Prabhakar.....http://dblp.org/pers/hd/p/Prabhakar:Tamma_V=", "Chayan Sarkar.....http://dblp.org/pers/hd/s/Sarkar:Chayan", "Ignas G. Niemegeers.....http://dblp.org/pers/hd/n/Niemegeers:Ignas_G="], "conf": "infocom", "year": "2016", "pages": 9}