{"title": "Real-time Video Recommendation Exploration.", "fields": ["recommender system", "big data", "video tracking", "collaborative filtering", "scalability"], "abstract": "Video recommendation has attracted growing attention in recent years. However, conventional techniques have limitations in real-time processing, accuracy or scalability for the large-scale video data. To address the deficiencies of current recommendation systems, we introduce some new techniques to provide real-time and accurate recommendations to users in the video recommendation system of Tencent Inc.. We develop a scalable online collaborative filtering algorithm based upon matrix factorization, with an adjustable updating strategy considering implicit feedback solution of different user actions. To select high-quality candidate videos for real-time top-N recommendation generation, we utilize additional factors like video type and time factor to compute similar videos. In addition, we propose the scalable implementation of our algorithm together with some optimizations to make the recommendations more efficient and accurate, including the demographic filtering and demographic training. To demonstrate the effectiveness and efficiency of our model, we conduct comprehensive experiments by collecting real data from Tencent Video. Furthermore, our video recommendation system is in production to provide recommendation services in Tencent Video, one of the largest video sites in China, and verifies its superiority in performance.", "citation": "Citations (8)", "year": "2016", "departments": ["Peking University", "Peking University", "Tencent", "Tencent", "Tencent"], "conf": "sigmod", "authors": ["Yanxiang Huang.....http://dblp.org/pers/hd/h/Huang:Yanxiang", "Bin Cui.....http://dblp.org/pers/hd/c/Cui_0001:Bin", "Jie Jiang.....http://dblp.org/pers/hd/j/Jiang:Jie", "Kunqian Hong.....http://dblp.org/pers/hd/h/Hong:Kunqian", "Wenyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenyu", "Yiran Xie.....http://dblp.org/pers/hd/x/Xie:Yiran"], "pages": 12}