{"title": "Dynamic virtual machine management via approximate Markov decision process.", "fields": ["approximation error", "exploit", "workload", "curse of dimensionality", "markov decision process"], "abstract": "Efficient virtual machine (VM) management can dramatically reduce energy consumption in data centers. Existing VM management algorithms fall into two categories based on whether the VMs' resource demands are assumed to be static or dynamic. The former category fails to maximize the resource utilization as they cannot adapt to the dynamic nature of VMs' resource demands. Most approaches in the latter category are heuristical and lack theoretical performance guarantees. In this work, we formulate dynamic VM management as a large-scale Markov Decision Process (MDP) problem and derive an optimal solution. Our analysis of real-world data traces supports our choice of the modeling approach. However, solving the large-scale MDP problem suffers from the curse of dimensionality. Therefore, we further exploit the special structure of the problem and propose an approximate MDP-based dynamic VM management method, called MadVM. We prove the convergence of MadVM and analyze the bound of its approximation error. Moreover, MadVM can be implemented in a distributed system, which should suit the needs of real data centers. Extensive simulations based on two real-world workload traces show that MadVM achieves significant performance gains over two existing baseline approaches in power consumption, resource shortage and the number of VM migrations. Specifically, the more intensely the resource demands fluctuate, the more MadVM outperforms.", "citation": "Citations (18)", "departments": ["Jinan University", "Shanghai Jiao Tong University", "South U. of Sci ...  Tech. of China", "South U. of Sci ...  Tech. of China", "South U. of Sci ...  Tech. of China"], "authors": ["Zhenhua Han.....http://dblp.org/pers/hd/h/Han:Zhenhua", "Haisheng Tan.....http://dblp.org/pers/hd/t/Tan:Haisheng", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai", "Rui Wang.....http://dblp.org/pers/hd/w/Wang_0007:Rui", "Yifan Chen.....http://dblp.org/pers/hd/c/Chen:Yifan", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2016", "pages": 9}