{"title": "madmom: A New Python Audio and Music Signal Processing Library.", "fields": ["music information retrieval", "object oriented design", "audio analyzer", "audio signal processing", "calling convention"], "abstract": "In this paper, we present madmom, an open-source audio processing and music information retrieval (MIR) library written in Python. madmom features a concise, NumPy-compatible, object oriented design with simple calling conventions and sensible default values for all parameters, which facilitates fast prototyping of MIR applications. Prototypes can be seamlessly converted into callable processing pipelines through madmom's concept of Processors, callable objects that run transparently on multiple cores. Processors can also be serialised, saved, and re-run to allow results to be easily reproduced anywhere. Apart from low-level audio processing, madmom puts emphasis on musically meaningful high-level features. Many of these incorporate machine learning techniques and madmom provides a module that implements some methods commonly used in MIR such as hidden Markov models and neural networks. Additionally, madmom comes with several state-of-the-art MIR algorithms for onset detection, beat, downbeat and meter tracking, tempo estimation, and chord recognition. These can easily be incorporated into bigger MIR systems or run as stand-alone programs.", "citation": "Citations (14)", "departments": ["Johannes Kepler University of Linz", "Johannes Kepler University of Linz", "Austrian Research Institute for Artificial Intelligence", "Johannes Kepler University of Linz", "Johannes Kepler University of Linz"], "authors": ["Sebastian Böck.....http://dblp.org/pers/hd/b/B=ouml=ck:Sebastian", "Filip Korzeniowski.....http://dblp.org/pers/hd/k/Korzeniowski:Filip", "Jan Schlüter.....http://dblp.org/pers/hd/s/Schl=uuml=ter:Jan", "Florian Krebs.....http://dblp.org/pers/hd/k/Krebs:Florian", "Gerhard Widmer.....http://dblp.org/pers/hd/w/Widmer:Gerhard"], "conf": "mm", "year": "2016", "pages": 5}