{"title": "Demographics inference through Wi-Fi network traffic analysis.", "fields": ["encryption", "demographics", "information sensitivity", "gender and education", "traffic analysis"], "abstract": "Although privacy leaking through content analysis of Wi-Fi traffic has received an increased attention, privacy inference through meta-data (e.g. IP, Host) analysis of Wi-Fi traffic represents a potentially more serious threat to user privacy. Firstly, it represents a more efficient and scalable approach to infer users' sensitive information without checking the content of Wi-Fi traffic. Secondly, meta-data based demographics inference can work on both unencrypted and encrypted traffic (e.g., HTTPS traffic). In this study, we present a novel approach to infer user demographic information by exploiting the meta-data of Wi-Fi traffic. We develop a proof-of-concept prototype, Demographic Information Predictor (DIP) system, and evaluate its performance on a real-world dataset, which includes the Wi-Fi access of 28,158 users in 5 months. DIP extracts four kinds of features from real-world Wi-Fi traffic and proposes a novel machine learning based inference technique to predict user demographics. Our analytical results show that, for unencrypted traffic, DIP can predict gender and education level of users with an accuracy of 78% and 74% respectively. It is surprising to show that, even for HTTPS traffic, user demographics can still be predicted at a precision of 67% and 72% respectively, which well demonstrates the practicality of the proposed privacy inference scheme.", "citation": "Citations (8)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Michigan", "University of Minnesota"], "authors": ["Huaxin Li.....http://dblp.org/pers/hd/l/Li:Huaxin", "Zheyu Xu.....http://dblp.org/pers/hd/x/Xu:Zheyu", "Haojin Zhu.....http://dblp.org/pers/hd/z/Zhu:Haojin", "Di Ma.....http://dblp.org/pers/hd/m/Ma:Di", "Shuai Li.....http://dblp.org/pers/hd/l/Li:Shuai", "Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai"], "conf": "infocom", "year": "2016", "pages": 9}