{"title": "Update or wait: How to keep your data fresh.", "fields": ["network packet", "state space", "phenomenon", "decision problem", "server", "throughput", "penalty method", "wait"], "abstract": "In this work we study how to manage the freshness of status updates sent from a source to a remote monitor via a network server. A proper metric of data freshness at the monitor is the age-of-information, which is defined as how old the freshest update is since the moment this update was generated at the source. A logical policy is the zero-wait policy, i.e., the source submits a fresh update once the server is free, which achieves the maximum throughput and the minimum average delay. Surprisingly, this zero-wait policy does not always minimize the average age. This motivates us to study how to optimally control the status updates to keep data fresh and to understand when the zero-wait policy is optimal. We introduce a penalty function to characterize the level of “dissatisfaction” on data staleness, and formulate the average age penalty minimization problem as a constrained semi-Markov decision process (SMDP) with an uncountable state space. Despite of the difficulty of this problem, we develop efficient algorithms to find the optimal status update policy. We show that, in many scenarios, the optimal policy is to wait for a certain amount of time before submitting a new update. In particular, the zero-wait policy can be far from the optimum if (i) the penalty function grows quickly with respect to the age, and (ii) the update service times are highly random and positive correlated. To the best of our knowledge, this is the first optimal control policy which is proven to minimize the age-of-information in status update systems.", "citation": "Citations (94)", "departments": ["Ohio State University", "Middle East Technical University", "Rutgers University", "Ohio State University", "Ohio State University", "Auburn University", "Middle East Technical University", "Rutgers University", "Ohio State University", "Ohio State University"], "authors": ["Yin Sun.....http://dblp.org/pers/hd/s/Sun:Yin", "Elif Uysal-Biyikoglu.....http://dblp.org/pers/hd/u/Uysal=Biyikoglu:Elif", "Roy D. Yates.....http://dblp.org/pers/hd/y/Yates:Roy_D=", "Can Emre Koksal.....http://dblp.org/pers/hd/k/Koksal:Can_Emre", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2016", "pages": 9}