{"title": "Hypothesis Testing in Unsupervised Domain Adaptation with Applications in Alzheimer's Disease.", "fields": ["mathematical optimization", "domain adaptation", "statistical hypothesis testing", "sample size determination", "mathematical analysis"], "abstract": "Consider samples from two different data sources $\\{\\mathbf{x_s^i}\\} \\sim P_{\\rm source}$ and $\\{\\mathbf{x_t^i}\\} \\sim P_{\\rm target}$. We only observe their transformed versions $h(\\mathbf{x_s^i})$ and $g(\\mathbf{x_t^i})$, for some known function class $h(\\cdot)$ and $g(\\cdot)$. Our goal is to perform a statistical test checking if $P_{\\rm source}$ = $P_{\\rm target}$ while removing the distortions induced by the transformations. This problem is closely related to concepts underlying numerous domain adaptation algorithms, and in our case, is motivated by the need to combine clinical and imaging based biomarkers from multiple sites and/or batches, where this problem is fairly common and an impediment in the conduct of analyses with much larger sample sizes. We develop a framework that addresses this problem using ideas from hypothesis testing on the transformed measurements, where in the distortions need to be estimated {\\it in tandem} with the testing. We derive a simple algorithm and study its convergence and consistency properties in detail, and we also provide lower-bound strategies based on recent work in continuous optimization. On a dataset of individuals at risk for neurological disease, our results are competitive with alternative procedures that are twice as expensive and in some cases operationally infeasible to implement.", "citation": "Citations (3)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Hao Henry Zhou.....http://dblp.org/pers/hd/z/Zhou:Hao_Henry", "Vamsi K. Ithapu.....http://dblp.org/pers/hd/i/Ithapu:Vamsi_K=", "Sathya Narayanan Ravi.....http://dblp.org/pers/hd/r/Ravi:Sathya_Narayanan", "Vikas Singh.....http://dblp.org/pers/hd/s/Singh:Vikas", "Grace Wahba.....http://dblp.org/pers/hd/w/Wahba:Grace", "Sterling C. Johnson.....http://dblp.org/pers/hd/j/Johnson:Sterling_C="], "conf": "nips", "year": "2016", "pages": 9}