{"title": "PRIME: A Novel Processing-in-Memory Architecture for Neural Network Computation in ReRAM-Based Main Memory.", "fields": ["conventional memory", "uniform memory access", "registered memory", "computing with memory", "interleaved memory"], "abstract": "Processing-in-memory (PIM) is a promising solution to address the \"memory wall\" challenges for future computer systems. Prior proposed PIM architectures put additional computation logic in or near memory. The emerging metal-oxide resistive random access memory (ReRAM) has showed its potential to be used for main memory. Moreover, with its crossbar array structure, ReRAM can perform matrix-vector multiplication efficiently, and has been widely studied to accelerate neural network (NN) applications. In this work, we propose a novel PIM architecture, called PRIME, to accelerate NN applications in ReRAM based main memory. In PRIME, a portion of ReRAM crossbar arrays can be configured as accelerators for NN applications or as normal memory for a larger memory space. We provide microarchitecture and circuit designs to enable the morphable functions with an insignificant area overhead. We also design a software/hardware interface for software developers to implement various NNs on PRIME. Benefiting from both the PIM architecture and the efficiency of using ReRAM for NN computation, PRIME distinguishes itself from prior work on NN acceleration, with significant performance improvement and energy saving. Our experimental results show that, compared with a state-of-the-art neural processing unit design, PRIME improves the performance by ~2360× and the energy consumption by ~895×, across the evaluated machine learning benchmarks.", "citation": "Citations (220)", "departments": ["University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "Hewlett-Packard", "Nvidia", "University of California, Berkeley", "University of California"], "authors": ["Ping Chi.....http://dblp.org/pers/hd/c/Chi:Ping", "Shuangchen Li.....http://dblp.org/pers/hd/l/Li:Shuangchen", "Cong Xu.....http://dblp.org/pers/hd/x/Xu:Cong", "Tao Zhang.....http://dblp.org/pers/hd/z/Zhang_0032:Tao", "Jishen Zhao.....http://dblp.org/pers/hd/z/Zhao:Jishen", "Yongpan Liu.....http://dblp.org/pers/hd/l/Liu:Yongpan", "Yu Wang.....http://dblp.org/pers/hd/w/Wang:Yu", "Yuan Xie.....http://dblp.org/pers/hd/x/Xie_0001:Yuan"], "conf": "isca", "year": "2016", "pages": 13}