{"title": "A parallel arbitrary-order accurate AMR algorithm for the scalar advection-diffusion equation.", "fields": ["adaptive mesh refinement", "discretization", "scalar", "method of characteristics", "solver"], "abstract": "We present a numerical method for solving the scalar advection-diffusion equation using adaptive mesh refinement. Our solver has three unique characteristics: (1) it supports arbitrary-order accuracy in space; (2) it allows different discretizations for the velocity and scalar advected quantity; (3) it combines the method of characteristics with an integral equation formulation; and (4) it supports shared and distributed memory architectures. In particular, our solver is based on a second-order accurate, unconditionally stable, semi-Lagrangian scheme combined with a spatially-adaptive Chebyshev octree for discretization. We study the convergence, single-node performance, strong scaling, and weak scaling of our scheme for several challenging flows that cannot be resolved efficiently without using high-order accurate discretizations. For example, we consider problems for which switching from 4th order to 14th order approximation results in two orders of magnitude speedups for a computation in which we keep the target accuracy in the solution fixed. For our largest run, we solve a problem with one billion unknowns on a tree with maximum depth equal to 10 and using 14th-order elements on 16,384 ×86 cores on the \"STAMPEDE\" system at the Texas Advanced Computing Center.", "citation": "Citations (1)", "departments": ["Technische Universität München", "University of Texas at Austin", "Technische Universität München", "University of Stuttgart", "Technische Universität München"], "authors": ["Arash Bakhtiari.....http://dblp.org/pers/hd/b/Bakhtiari:Arash", "Dhairya Malhotra.....http://dblp.org/pers/hd/m/Malhotra:Dhairya", "Amir Raoofy.....http://dblp.org/pers/hd/r/Raoofy:Amir", "Miriam Mehl.....http://dblp.org/pers/hd/m/Mehl:Miriam", "Hans-Joachim Bungartz.....http://dblp.org/pers/hd/b/Bungartz:Hans=Joachim", "George Biros.....http://dblp.org/pers/hd/b/Biros:George"], "conf": "sc", "year": "2016", "pages": 12}