{"title": "Probabilistic demand allocation for cloud service brokerage.", "fields": ["service level agreement", "nonlinear programming", "cloud computing", "probabilistic logic", "server"], "abstract": "Functioning as an intermediary between cloud tenants and providers, cloud service brokerages (CSBs) bring about great benefits to the cloud market. To maximize its own profit, a CSB is faced with a challenge: how to reserve servers and distribute tenant demands to the reserved servers such that the total reservation cost is minimized while the reserved servers can satisfy the tenant service level agreement (SLA)? Demand prediction and demand allocation are two steps to solve this problem. However, previous demand prediction methods cannot accurately predict tenant demands since they cannot accurately estimate prediction errors and also assume the existence of seasonal periods of demands. Previous demand allocation methods only aim to minimize the number of reserved servers rather than the server reservation cost, which is more challenging. To solve this challenge, we propose a Probabilistic Demand Allocation system (PDA). It predicts demands and more accurate prediction errors without the assumption of the existence of seasonal periods. It then formulates a nonlinear programming problem and has a decentralized method to find the problem solution. In addition to overcoming the shortcomings in previous methods, PDA is novel in that rather than separately conducting the prediction and demand allocation, it considers prediction errors in demand allocation in order to allocate demands with offsetting prediction errors (e.g., −1 and +1) to the same server, which helps find the problem solution. Both simulation and real-world experimental results demonstrate the superior performance of our system in reducing servers' reservation cost.", "citation": "Citations (5)", "departments": ["Clemson University", "Clemson University", "Clemson University"], "authors": ["Chenxi Qiu.....http://dblp.org/pers/hd/q/Qiu:Chenxi", "Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Liuhua Chen.....http://dblp.org/pers/hd/c/Chen:Liuhua"], "conf": "infocom", "year": "2016", "pages": 9}