{"title": "C-FLAT: Control-Flow Attestation for Embedded Systems Software.", "fields": ["hardware security module", "direct anonymous attestation", "security service", "exploit", "control flow"], "abstract": "Remote attestation is a crucial security service particularly relevant to increasingly popular IoT (and other embedded) devices. It allows a trusted party (verifier) to learn the state of a remote, and potentially malware-infected, device (prover). Most existing approaches are static in nature and only check whether benign software is initially loaded on the prover. However, they are vulnerable to runtime attacks that hijack the application's control or data flow, e.g., via return-oriented programming or data-oriented exploits. As a concrete step towards more comprehensive runtime remote attestation, we present the design and implementation of Control-FLow ATtestation (C-FLAT) that enables remote attestation of an application's control-flow path, without requiring the source code. We describe a full prototype implementation of C-FLAT on Raspberry Pi using its ARM TrustZone hardware security extensions. We evaluate C-FLAT's performance using a real-world embedded (cyber-physical) application, and demonstrate its efficacy against control-flow hijacking attacks.", "citation": "Citations (23)", "year": "2016", "departments": ["Technische Universität Darmstadt", "Aalto University", "Technische Universität Darmstadt", "Aalto University", "Trustonic, Helsinki, Finland"], "conf": "ccs", "authors": ["Tigist Abera.....http://dblp.org/pers/hd/a/Abera:Tigist", "N. Asokan.....http://dblp.org/pers/hd/a/Asokan:N=", "Lucas Davi.....http://dblp.org/pers/hd/d/Davi:Lucas", "Jan-Erik Ekberg.....http://dblp.org/pers/hd/e/Ekberg:Jan=Erik", "Thomas Nyman.....http://dblp.org/pers/hd/n/Nyman:Thomas", "Andrew Paverd.....http://dblp.org/pers/hd/p/Paverd:Andrew", "Ahmad-Reza Sadeghi.....http://dblp.org/pers/hd/s/Sadeghi:Ahmad=Reza", "Gene Tsudik.....http://dblp.org/pers/hd/t/Tsudik:Gene"], "pages": 12}