{"title": "Alpenhorn: Bootstrapping Secure Communication without Leaking Metadata.", "fields": ["forward secrecy", "key distribution", "secure communication", "adversary", "public key cryptography"], "abstract": "Alpenhorn is the first system for initiating an encrypted connection between two users that provides strong privacy and forward secrecy guarantees for metadata (i.e., information about which users connected to each other) and that does not require out-of-band communication other than knowing the other user's Alpenhorn username (email address). This resolves a significant shortcoming in all prior works on private messaging, which assume an out-of-band key distribution mechanism.\n\nAlpenhorn's design builds on three ideas. First, Alpenhorn provides each user with an address book of friends that the user can call. Second, when a user adds a friend for the first time, Alpenhorn ensures the adversary does not learn the friend's identity, by using identity-based encryption in a novel way to privately determine the friend's public key. Finally, when calling a friend, Alpenhorn ensures forward secrecy of metadata by storing pairwise shared secrets in friends' address books, and evolving them over time, using a new keywheel construction. Alpenhorn relies on a number of servers, but operates in an anytrust model, requiring just one of the servers to be honest.\n\nWe implemented a prototype of Alpenhorn, and integrated it into the Vuvuzela private messaging system (which did not previously provide privacy or forward secrecy of metadata when initiating conversations). Experimental results show that Alpenhorn can scale to many users, supporting 10 million users on three Alpenhorn servers with an average dial latency of 150 seconds and a client bandwidth overhead of 3.7 KB/sec.", "citation": "Citations (9)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["David Lazar.....http://dblp.org/pers/hd/l/Lazar:David", "Nickolai Zeldovich.....http://dblp.org/pers/hd/z/Zeldovich:Nickolai"], "conf": "osdi", "year": "2016", "pages": 16}