{"title": "Slicer: Auto-Sharding for Datacenter Applications.", "fields": ["web cache", "forwarding plane", "high availability", "shard", "low latency"], "abstract": "Sharding is a fundamental building block of large-scale applications, but most have their own custom, ad-hoc implementations. Our goal is to make sharding as easily reusable as a filesystem or lock manager. Slicer is Google's general purpose sharding service. It monitors signals such as load hotspots and server health to dynamically shard work over a set of servers. Its goals are to maintain high availability and reduce load imbalance while minimizing churn from moved work.\n\nIn this paper, we describe Slicer's design and implementation. Slicer has the consistency and global optimization of a centralized sharder while approaching the high availability, scalability, and low latency of systems that make local decisions. It achieves this by separating concerns: a reliable data plane forwards requests, and a smart control plane makes load-balancing decisions off the critical path. Slicer's small but powerful API has proven useful and easy to adopt in dozens of Google applications. It is used to allocate resources for web service front-ends, coalesce writes to increase storage bandwidth, and increase the efficiency of a web cache. It currently handles 2-7M req/s of production traffic. The median production Slicer-managed workload uses 63% fewer resources than it would with static sharding.", "citation": "Citations (1)", "departments": ["Google", "Google", "Google", "Google", "Google"], "authors": ["Atul Adya.....http://dblp.org/pers/hd/a/Adya:Atul", "Daniel Myers.....http://dblp.org/pers/hd/m/Myers:Daniel", "Jon Howell.....http://dblp.org/pers/hd/h/Howell:Jon", "Jeremy Elson.....http://dblp.org/pers/hd/e/Elson:Jeremy", "Colin Meek.....http://dblp.org/pers/hd/m/Meek:Colin", "Vishesh Khemani.....http://dblp.org/pers/hd/k/Khemani:Vishesh", "Stefan Fulger.....http://dblp.org/pers/hd/f/Fulger:Stefan", "Pan Gu.....http://dblp.org/pers/hd/g/Gu:Pan", "Lakshminath Bhuvanagiri.....http://dblp.org/pers/hd/b/Bhuvanagiri:Lakshminath", "Jason Hunter.....http://dblp.org/pers/hd/h/Hunter:Jason", "Roberto Peon.....http://dblp.org/pers/hd/p/Peon:Roberto", "Larry Kai.....http://dblp.org/pers/hd/k/Kai:Larry", "Alexander Shraer.....http://dblp.org/pers/hd/s/Shraer:Alexander", "Arif Merchant.....http://dblp.org/pers/hd/m/Merchant:Arif", "Kfir Lev-Ari.....http://dblp.org/pers/hd/l/Lev=Ari:Kfir"], "conf": "osdi", "year": "2016", "pages": 15}