{"title": "Characterizing parallel scientific applications on commodity clusters: an empirical study of a tapered fat-tree.", "fields": ["computer performance", "commodity", "empirical research", "science technology and society", "fat tree", "procurement", "search engine", "next generation network"], "abstract": "Understanding the characteristics and requirements of applications that run on commodity clusters is key to properly configuring current machines and, more importantly, procuring future systems effectively. There are only a few studies, however, that are current and characterize realistic workloads. For HPC practitioners and researchers, this limits our ability to design solutions that will have an impact on real systems.   We present a systematic study that characterizes applications with an emphasis on communication requirements. It includes cluster utilization data, identifying a representative set of applications from a U.S. Department of Energy laboratory, and characterizing their communication requirements. The driver for this work is understanding application sensitivity to a tapered fat-tree network. These results provided key insights into the procurement of our next generation commodity systems. We believe this investigation can provide valuable input to the HPC community in terms of workload characterization and requirements from a large supercomputing center.", "citation": "Not cited", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory"], "authors": ["Edgar A. León.....http://dblp.org/pers/hd/l/Le=oacute=n:Edgar_A=", "Ian Karlin.....http://dblp.org/pers/hd/k/Karlin:Ian", "Abhinav Bhatele.....http://dblp.org/pers/hd/b/Bhatele:Abhinav", "Steven H. Langer.....http://dblp.org/pers/hd/l/Langer:Steven_H=", "Chris Chambreau.....http://dblp.org/pers/hd/c/Chambreau:Chris", "Louis H. Howell.....http://dblp.org/pers/hd/h/Howell:Louis_H=", "Trent D'Hooge.....http://dblp.org/pers/hd/d/D=Hooge:Trent", "Matthew L. Leininger.....http://dblp.org/pers/hd/l/Leininger:Matthew_L="], "conf": "sc", "year": "2016", "pages": 12}