{"title": "Data-centric execution of speculative parallel programs.", "fields": ["speculative multithreading", "serialization", "exploit", "multi core processor", "database centric architecture"], "abstract": "Multicore systems must exploit locality to scale, scheduling tasks to minimize data movement. While locality-aware parallelism is well studied in non-speculative systems, it has received little attention in speculative systems (e.g., HTM or TLS), which hinders their scalability.   We present  spatial hints , a technique that leverages program knowledge to reveal and exploit locality in speculative parallel programs. A hint is an abstract integer, given when a speculative task is created, that denotes the data that the task is likely to access. We show it is easy to modify programs to convey locality through hints. We design simple hardware techniques that allow a state-of-the-art, tiled speculative architecture to exploit hints by: ( i ) running tasks likely to access the same data on the same tile, ( ii ) serializing tasks likely to conflict, and ( iii ) balancing tasks across tiles in a locality-aware fashion. We also show that programs can often be restructured to make hints more effective.   Together, these techniques make speculative parallelism practical on large-scale systems: at 256 cores, hints achieve near-linear scalability on nine challenging applications, improving performance over hint-oblivious scheduling by 3.3x gmean and by up to 16x. Hints also make speculation far more efficient, reducing wasted work by 6.4x and traffic by 3.5x on average.", "citation": "Citations (2)", "departments": ["Nvidia", "Massachustmnett ... e of Technology", "Massachustmnett ... e of Technology", "Massachustmnett ... e of Technology", "Massachustmnett ... e of Technology"], "authors": ["Mark C. Jeffrey.....http://dblp.org/pers/hd/j/Jeffrey:Mark_C=", "Suvinay Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Suvinay", "Maleen Abeydeera.....http://dblp.org/pers/hd/a/Abeydeera:Maleen", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S=", "Daniel Sánchez.....http://dblp.org/pers/hd/s/S=aacute=nchez_0003:Daniel"], "conf": "micro", "year": "2016", "pages": 13}