{"title": "Discovering Neighborhood Pattern Queries by sample answers in knowledge base.", "fields": ["small set", "phrase", "information retrieval", "knowledge base", "natural language"], "abstract": "Knowledge bases have shown their effectiveness in facilitating services like Web search and question-answering. Nevertheless, it remains challenging for ordinary users to fully understand the structure of a knowledge base and to issue structural queries. In many cases, users may have a natural language question and also know some popular (but not all) entities as sample answers. In this paper, we study the Reverse top-k Neighborhood Pattern Query problem, with the aim of discovering structural queries of the question based on: (i) the structure of the knowledge base, and (ii) the sample answers of the question. The proposed solution contains two phases: filter and refine. In the filter phase, a search space of candidate queries is systematically explored. The invalid queries whose result sets do not fully cover the sample answers are filtered out. In the refine phase, all surviving queries are verified to ensure that they are sufficiently relevant to the sample answers, with the assumption that the sample answers are more well-known or popular than other entities in the results of relevant queries. Several optimization techniques are proposed to accelerate the refine phrase. For evaluation, we conduct extensive experiments using the DBpedia knowledge base and a set of real-life questions. Empirical results show that our algorithm is able to provide a small set of possible queries, which contains the query matching the user question in natural language.", "citation": "Citations (7)", "departments": ["Nanyang Technological University", "University of Queensland", "Nanyang Technological University", "China University of Petroleum", "Renmin University of China"], "authors": ["Jialong Han.....http://dblp.org/pers/hd/h/Han:Jialong", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Aixin Sun.....http://dblp.org/pers/hd/s/Sun:Aixin", "Shuo Shang.....http://dblp.org/pers/hd/s/Shang:Shuo", "Ji-Rong Wen.....http://dblp.org/pers/hd/w/Wen:Ji=Rong"], "conf": "icde", "year": "2016", "pages": 12}