{"title": "Mutual information for symmetric rank-one matrix estimation: A proof of the replica formula.", "fields": ["sparse pca", "symmetric rank one", "mutual information", "ranging", "bayes theorem"], "abstract": "Factorizing low-rank matrices has many applications in machine learning and statistics. For probabilistic models in the Bayes optimal setting, a general expression for the mutual information has been proposed using heuristic statistical physics computations, and proven in few specific cases. Here, we show how to rigorously prove the conjectured formula for the symmetric rank-one case. This allows to express the minimal mean-square-error and to characterize the detectability phase transitions in a large set of estimation problems ranging from community detection to sparse PCA. We also show that for a large set of parameters, an iterative algorithm called approximate message-passing is Bayes optimal. There exists, however, a gap between what currently known polynomial algorithms can do and what is expected information theoretically. Additionally, the proof technique has an interest of its own and exploits three essential ingredients: the interpolation method introduced in statistical physics by Guerra, the analysis of the approximate message-passing algorithm and the theory of spatial coupling and threshold saturation in coding. Our approach is generic and applicable to other open problems in statistical estimation where heuristic statistical physics predictions are available.", "citation": "Citations (20)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Normale Supérieure", "École Polytechnique Fédérale de Lausanne", "École Normale Supérieure", "Centre national de la recherche scientifique"], "authors": ["Jean Barbier.....http://dblp.org/pers/hd/b/Barbier:Jean", "Mohamad Dia.....http://dblp.org/pers/hd/d/Dia:Mohamad", "Nicolas Macris.....http://dblp.org/pers/hd/m/Macris:Nicolas", "Florent Krzakala.....http://dblp.org/pers/hd/k/Krzakala:Florent", "Thibault Lesieur.....http://dblp.org/pers/hd/l/Lesieur:Thibault", "Lenka Zdeborová.....http://dblp.org/pers/hd/z/Zdeborov=aacute=:Lenka"], "conf": "nips", "year": "2016", "pages": 9}