{"title": "ERMIA: Fast Memory-Optimized Database System for Heterogeneous Workloads.", "fields": ["serializability", "optimistic concurrency control", "transaction processing system", "snapshot isolation", "multiversion concurrency control"], "abstract": "Large main memories and massively parallel processors have triggered not only a resurgence of high-performance transaction processing systems optimized for large main-memory and massively parallel processors, but also an increasing demand for processing heterogeneous workloads that include read-mostly transactions. Many modern transaction processing systems adopt a lightweight optimistic concurrency control (OCC) scheme to leverage its low overhead in low contention workloads. However, we observe that the lightweight OCC is not suitable for heterogeneous workloads, causing significant starvation of read-mostly transactions and overall performance degradation.   In this paper, we present ERMIA, a memory-optimized database system built from scratch to cater the need of handling heterogeneous workloads. ERMIA adopts snapshot isolation concurrency control to coordinate heterogeneous transactions and provides serializability when desired. Its physical layer supports the concurrency control schemes in a scalable way. Experimental results show that ERMIA delivers comparable or superior performance and near-linear scalability in a variety of workloads, compared to a recent lightweight OCC-based system. At the same time, ERMIA maintains high throughput on read-mostly transactions when the performance of the OCC-based system drops by orders of magnitude.", "citation": "Citations (17)", "year": "2016", "departments": ["University of Toronto", "University of Toronto", "Amazon Web Services", "LogicBlox, Atlanta, GA, USA"], "conf": "sigmod", "authors": ["Kangnyeon Kim.....http://dblp.org/pers/hd/k/Kim:Kangnyeon", "Tianzheng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Tianzheng", "Ryan Johnson.....http://dblp.org/pers/hd/j/Johnson_0001:Ryan", "Ippokratis Pandis.....http://dblp.org/pers/hd/p/Pandis:Ippokratis"], "pages": 13}