{"title": "Cloudlet load balancing in wireless metropolitan area networks.", "fields": ["cloudlet", "workload", "system model", "scalability", "load balancing"], "abstract": "With advances in wireless communication technology, more and more people depend heavily on portable mobile devices for businesses, entertainments and social interactions. Although such portable mobile devices can offer various promising applications, their computing resources remain limited due to their portable size. This however can be overcome by remotely executing computation-intensive tasks on clusters of near by computers known as cloudlets. As increasing numbers of people access the Internet via mobile devices, it is reasonable to envision in the near future that cloudlet services will be available for the public through easily accessible public wireless metropolitan area networks (WMANs). However, the outdated notion of treating cloudlets as isolated data-centers-in-a-box must be discarded as there are clear benefits to connecting multiple cloudlets together to form a network. In this paper we investigate how to balance the workload between multiple cloudlets in a network to optimize mobile application performance. We first introduce a system model to capture the response times of offloaded tasks, and formulate a novel optimization problem, that is to find an optimal redirection of tasks between cloudlets such that the maximum of the average response times of tasks at cloudlets is minimized. We then propose a fast, scalable algorithm for the problem. We finally evaluate the performance of the proposed algorithm through experimental simulations. The experimental results demonstrate the significant potential of the proposed algorithm in reducing the response times of tasks.", "citation": "Citations (17)", "departments": ["Australian National University", "Australian National University", "Australian National University", "Australian National University"], "authors": ["Mike Jia.....http://dblp.org/pers/hd/j/Jia:Mike", "Weifa Liang.....http://dblp.org/pers/hd/l/Liang:Weifa", "Zichuan Xu.....http://dblp.org/pers/hd/x/Xu:Zichuan", "Meitian Huang.....http://dblp.org/pers/hd/h/Huang:Meitian"], "conf": "infocom", "year": "2016", "pages": 9}