{"title": "Inter-Technology Backscatter: Towards Internet Connectivity for Implanted Devices.", "fields": ["network packet", "internet access", "bluetooth", "field programmable gate array", "backscatter", "fpga prototype", "internet of things"], "abstract": "We introduce inter-technology backscatter, a novel approach that transforms wireless transmissions from one technology to another, on the air. Specifically, we show for the first time that Bluetooth transmissions can be used to create Wi-Fi and ZigBee-compatible signals using backscatter communication. Since Bluetooth, Wi-Fi and ZigBee radios are widely available, this approach enables a backscatter design that works using only commodity devices.   We build prototype backscatter hardware using an FPGA and experiment with various Wi-Fi, Bluetooth and ZigBee devices. Our experiments show we can create 2--11~Mbps Wi-Fi standards-compliant signals by backscattering Bluetooth transmissions. To show the generality of our approach, we also demonstrate generation of standards-complaint ZigBee signals by backscattering Bluetooth transmissions. Finally, we build proof-of-concepts for previously infeasible applications including the first contact lens form-factor antenna prototype and an implantable neural recording interface that communicate directly with commodity devices such as smartphones and watches, thus enabling the vision of Internet connected implanted devices.", "citation": "Not cited", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Vikram Iyer.....http://dblp.org/pers/hd/i/Iyer:Vikram", "Vamsi Talla.....http://dblp.org/pers/hd/t/Talla:Vamsi", "Bryce Kellogg.....http://dblp.org/pers/hd/k/Kellogg:Bryce", "Shyamnath Gollakota.....http://dblp.org/pers/hd/g/Gollakota:Shyamnath", "Joshua R. Smith.....http://dblp.org/pers/hd/s/Smith:Joshua_R="], "conf": "sigcomm", "year": "2016", "pages": 14}