{"title": "Leveraging wearables for steering and driver tracking.", "fields": ["steering wheel", "match moving", "wearable technology", "smartwatch", "inertial measurement unit"], "abstract": "Given the increasing popularity of wearable devices, this paper explores the potential to use wearables for steering and driver tracking. Such capability would enable novel classes of mobile safety applications without relying on information or sensors in the vehicle. In particular, we study how wrist-mounted inertial sensors, such as those in smart watches and fitness trackers, can track steering wheel usage and angle. In particular, tracking steering wheel usage and turning angle provide fundamental techniques to improve driving detection, enhance vehicle motion tracking by mobile devices and help identify unsafe driving. The approach relies on motion features that allow distinguishing steering from other confounding hand movements. Once steering wheel usage is detected, it further uses wrist rotation measurements to infer steering wheel turning angles. Our on-road experiments show that the technique is 99% accurate in detecting steering wheel usage and can estimate turning angles with an average error within 3.4 degrees.", "citation": "Citations (14)", "departments": ["Rutgers University", "Rutgers University", "Rutgers University", "Stevens Institute of Technology", "Binghamton University"], "authors": ["Çagdas Karatas.....http://dblp.org/pers/hd/k/Karatas:=Ccedil=agdas", "Luyang Liu.....http://dblp.org/pers/hd/l/Liu:Luyang", "Hongyu Li.....http://dblp.org/pers/hd/l/Li:Hongyu", "Jian Liu.....http://dblp.org/pers/hd/l/Liu_0001:Jian", "Yan Wang.....http://dblp.org/pers/hd/w/Wang_0003:Yan", "Sheng Tan.....http://dblp.org/pers/hd/t/Tan:Sheng", "Jie Yang.....http://dblp.org/pers/hd/y/Yang_0003:Jie", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying", "Marco Gruteser.....http://dblp.org/pers/hd/g/Gruteser:Marco", "Richard P. Martin.....http://dblp.org/pers/hd/m/Martin:Richard_P="], "conf": "infocom", "year": "2016", "pages": 9}