{"title": "CASE: Cache-assisted stretchable estimator for high speed per-flow measurement.", "fields": ["internet traffic", "static random access memory", "cache", "universal memory", "bounded function"], "abstract": "Per-flow measurement can provide fine-grained statistics for advanced network management and thus has been studied extensively. As network line rate continues its rapid growth, wire-speed per-flow measurement meets great challenges, for large numbers of statistics counters are required to record flow information at extremely high speed. Most of the previous efforts are committed to elaborate excellent sampling algorithms to make counters' memory occupation as small as possible, so as to fit into off-chip SRAM(s), but the throughput is rigidly bounded by the speed of SRAM. To break the wall, we explore a new path by proposing CASE: a cache-assisted stretchable estimator, which uses the on-chip memory as the fast cache of the off-chip SRAM. In this way, most of the accesses to the counters will happen on cache, thanks to the heavy-tailed distribution of Internet traffic. In this paper, we present CASE's design and derive strict mathematical proof to its relative error bound. Extensive experiments on real-world traces are conducted and the evaluation results indicate CASE can achieve up to 300Gbps throughput when using on-chip memory with 128K entries (equivalent to 1.125MB). Meanwhile CASE is more accurate and stretchable than uncached approaches.", "citation": "Citations (5)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Yang Li.....http://dblp.org/pers/hd/l/Li:Yang", "Hao Wu.....http://dblp.org/pers/hd/w/Wu:Hao", "Tian Pan.....http://dblp.org/pers/hd/p/Pan:Tian", "Huichen Dai.....http://dblp.org/pers/hd/d/Dai:Huichen", "Jianyuan Lu.....http://dblp.org/pers/hd/l/Lu:Jianyuan", "Bin Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bin"], "conf": "infocom", "year": "2016", "pages": 9}