{"title": "Page As You Go: Piecewise Columnar Access In SAP HANA.", "fields": ["memory footprint", "inverted index", "working set", "sap hana", "piecewise"], "abstract": "In-memory columnar databases such as SAP HANA achieve extreme performance by means of vector processing over logical units of main memory resident columns. The core in-memory algorithms can be challenged when the working set of an application does not fit into main memory. To deal with memory pressure, most in-memory columnar databases evict candidate columns (or tables) using a set of heuristics gleaned from recent workload. As an alternative approach, we propose to reduce the unit of load and eviction from column to a contiguous portion of the in-memory columnar representation, which we call a page. In this paper, we adapt the core algorithms to be able to operate with partially loaded columns while preserving the performance benefits of vector processing. Our approach has two key advantages. First, partial column loading reduces the mandatory memory footprint for each column, making more memory available for other purposes. Second, partial eviction extends the in-memory lifetime of partially loaded column. We present a new in-memory columnar implementation for our approach, that we term page loadable column. We design a new persistency layout and access algorithms for the encoded data vector of the column, the order-preserving dictionary, and the inverted index. We compare the performance attributes of page loadable columns with those of regular in-memory columns and present a use-case for page loadable columns for cold data in data aging scenarios. Page loadable columns are completely integrated in SAP HANA, and we present extensive experimental results that quantify the performance overhead and the resource consumption when these columns are deployed.", "citation": "Citations (2)", "year": "2016", "departments": ["SAP SE, Waterloo, ON, Canada", "SAP SE, Burlington, MA, USA", "SAP SE, Paris, France", "SAP SE, Waterloo, ON, Canada", "SAP SE, Waterloo, ON, Canada"], "conf": "sigmod", "authors": ["Reza Sherkat.....http://dblp.org/pers/hd/s/Sherkat:Reza", "Colin Florendo.....http://dblp.org/pers/hd/f/Florendo:Colin", "Mihnea Andrei.....http://dblp.org/pers/hd/a/Andrei:Mihnea", "Anil K. Goel.....http://dblp.org/pers/hd/g/Goel:Anil_K=", "Anisoara Nica.....http://dblp.org/pers/hd/n/Nica:Anisoara", "Peter Bumbulis.....http://dblp.org/pers/hd/b/Bumbulis:Peter", "Ivan Schreter.....http://dblp.org/pers/hd/s/Schreter:Ivan", "Günter Radestock.....http://dblp.org/pers/hd/r/Radestock:G=uuml=nter", "Christian Bensberg.....http://dblp.org/pers/hd/b/Bensberg:Christian", "Daniel Booss.....http://dblp.org/pers/hd/b/Booss:Daniel", "Heiko Gerwens.....http://dblp.org/pers/hd/g/Gerwens:Heiko"], "pages": 12}