{"title": "Transaction Healing: Scaling Optimistic Concurrency Control on Multicores.", "fields": ["x open xa", "online transaction processing", "compensating transaction", "transaction processing system", "extreme transaction processing"], "abstract": "Today's main-memory databases can support very high transaction rate for OLTP applications. However, when a large number of concurrent transactions contend on the same data records, the system performance can deteriorate significantly. This is especially the case when scaling transaction processing with optimistic concurrency control (OCC) on multicore machines. In this paper, we propose a new concurrency-control mechanism, called  transaction healing , that exploits program semantics to scale the conventional OCC towards dozens of cores even under highly contended workloads. Transaction healing captures the dependencies across operations within a transaction prior to its execution. Instead of blindly rejecting a transaction once its validation fails, the proposed mechanism judiciously restores any non-serializable operation and heals inconsistent transaction states as well as query results according to the extracted dependencies. Transaction healing can partially update the membership of read/write sets when processing dependent transactions. Such overhead, however, is largely reduced by carefully avoiding false aborts and rearranging validation orders. We implemented the idea of transaction healing in TheDB, a main-memory database prototype that provides full ACID guarantee with a scalable commit protocol. By evaluating TheDB on a 48-core machine with two widely-used benchmarks, we confirm that transaction healing can scale near-linearly, yielding significantly higher transaction rate than the state-of-the-art OCC implementations.", "citation": "Citations (11)", "year": "2016", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "conf": "sigmod", "authors": ["Yingjun Wu.....http://dblp.org/pers/hd/w/Wu:Yingjun", "Chee Yong Chan.....http://dblp.org/pers/hd/c/Chan:Chee_Yong", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee"], "pages": 16}