{"title": "Human Pose Estimation from Depth Images via Inference Embedded Multi-task Learning.", "fields": ["articulated body pose estimation", "deep learning", "multi task learning", "pose", "3d pose estimation"], "abstract": "Human pose estimation (i.e., locating the body parts / joints of a person) is a fundamental problem in human-computer interaction and multimedia applications. Significant progress has been made based on the development of depth sensors, i.e., accessible human pose prediction from still depth images~\\cite{rf12pami}. However, most of the existing approaches to this problem involve several components/models that are independently designed and optimized, leading to suboptimal performances. In this paper, we propose a novel inference-embedded multi-task learning framework for predicting human pose from still depth images, which is implemented with a deep architecture of neural networks. Specifically, we handle two cascaded tasks: i) generating the heat (confidence) maps of body parts via a fully convolutional network (FCN); ii) seeking the optimal configuration of body parts based on the detected body part proposals via an inference built-in MatchNet~\\cite{mn15cvpr}, which measures the appearance and geometric kinematic compatibility of body parts and embodies the dynamic programming inference as an extra network layer. These two tasks are jointly optimized. Our extensive experiments show that the proposed deep model significantly improves the accuracy of human pose estimation over other several state-of-the-art methods or SDKs. We also release a large-scale dataset for comparison, which includes 100K depth images under challenging scenarios.", "citation": "Citations (4)", "departments": ["Sun Yat-sen University", "Sun Yat-sen University", "Sun Yat-sen University", "Sun Yat-sen University", "Sun Yat-sen University"], "authors": ["Keze Wang.....http://dblp.org/pers/hd/w/Wang:Keze", "Shengfu Zhai.....http://dblp.org/pers/hd/z/Zhai:Shengfu", "Hui Cheng.....http://dblp.org/pers/hd/c/Cheng:Hui", "Xiaodan Liang.....http://dblp.org/pers/hd/l/Liang:Xiaodan", "Liang Lin.....http://dblp.org/pers/hd/l/Lin:Liang"], "conf": "mm", "year": "2016", "pages": 10}