{"title": "Influence based cost optimization on user preference.", "fields": ["traverse", "popularity", "preference learning", "new product development", "competitor analysis"], "abstract": "The popularity of e-business and preference learning techniques have contributed a huge amount of product and user preference data. Analyzing the influence of an existing or new product among the users is critical to unlock the great scientific and social-economic value of these data. In this paper, we advocate the problem of influence-based cost optimization for the user preference and product data, which is fundamental in many real applications such as marketing and advertising. Generally, we aim to find a cost optimal position for a new product such that it can attract at least k or a particular percentage of users for the given user preference functions and competitors' products. Although we show the solution space of our problem can be reduced to a finite number of possible positions (points) by utilizing the classical k-level computation techniques, the computation cost is still very expensive due to the nature of the high combinatorial complexity of the k-level problem. To alleviate this issue, we develop efficient pruning and query processing techniques to significantly improve the performance. In particular, our traverse-based 2-dimensional algorithm is very efficient with time complexity O(n) where n is the number of user preference functions. For general multi-dimensional spaces, we develop space partition based algorithm to significantly improve the performance by utilizing cost-based, influence-based and local dominance based pruning techniques. Then, we show that the performance of the partition based algorithm can be further enhanced by utilizing sampling approach, where the problem can be reduced to the classical half-space intersection problem. We demonstrate the efficiency of our techniques with extensive experiments over real and synthetic datasets.", "citation": "Citations (1)", "departments": ["University of New South Wales", "University of Technology, Sydney", "University of New South Wales", "University of New South Wales"], "authors": ["Jianye Yang.....http://dblp.org/pers/hd/y/Yang:Jianye", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin"], "conf": "icde", "year": "2016", "pages": 12}