{"title": "Distributed-memory large deformation diffeomorphic 3D image registration.", "fields": ["preconditioner", "discretization", "image registration", "spline interpolation", "solver"], "abstract": "We present a parallel distributed-memory algorithm for large deformation diffeomorphic registration of volumetric images that produces large isochoric deformations (locally volume preserving). Image registration is a key technology in medical image analysis. Our algorithm uses a partial differential equation constrained optimal control formulation. Finding the optimal deformation map requires the solution of a highly nonlinear problem that involves pseudo-differential operators, biharmonic operators, and pure advection operators both forward and backward in time. A key issue is the time to solution, which poses the demand for efficient optimization methods as well as an effective utilization of high performance computing resources. To address this problem we use a preconditioned, inexact, Gauss-Newton-Krylov solver. Our algorithm integrates several components: a spectral discretization in space, a semi-Lagrangian formulation in time, analytic adjoints, different regularization functionals (including volume-preserving ones), a spectral preconditioner, a highly optimized distributed Fast Fourier Transform, and a cubic interpolation scheme for the semi-Lagrangian time-stepping. We demonstrate the scalability of our algorithm on images with resolution of up to 1024 3  on the \"Maverick\" and \"Stampede\" systems at the Texas Advanced Computing Center (TACC). The critical problem in the medical imaging application domain is strong scaling, that is, solving registration problems of a moderate size of 256 3 ---a typical resolution for medical images. We are able to solve the registration problem for images of this size in less than five seconds on 64 ×86 nodes of TACC's \"Maverick\" system.", "citation": "Citations (3)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Andreas Mang.....http://dblp.org/pers/hd/m/Mang:Andreas", "Amir Gholami.....http://dblp.org/pers/hd/g/Gholami:Amir", "George Biros.....http://dblp.org/pers/hd/b/Biros:George"], "conf": "sc", "year": "2016", "pages": 12}