{"title": "Cache-emulated register file: An integrated on-chip memory architecture for high performance GPGPUs.", "fields": ["conventional memory", "uniform memory access", "registered memory", "cache only memory architecture", "non uniform memory access"], "abstract": "The on-chip memory design is critical to the GPGPU performance because it serves between the massive threads and the huge external memory as a low-latency and high-throughput data communication point. However, the existing on-chip memory hierarchy is inherited from the conventional CPU architecture and is oftentimes sub-optimal to the SIMT (single instruction, multiple threads) execution. In this study, we surpass the traditional memory hierarchy design and reform the on-chip memory into an integrated architecture with the cache-emulated register file (RF) capability tailored for high performance GPGPU computing. With the lightweight support from ISA, compiler and the modified microarchitecture, this integrated architecture can dynamically emulate a variable-sized RF and a cache in a uniform way. Evaluation results demonstrate that this novel architecture can deliver better performance and energy efficiency with smaller on-chip memory size. For example, it can gain an average of 50% performance improvement for the cache-sensitive applications.", "citation": "Citations (3)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Naifeng Jing.....http://dblp.org/pers/hd/j/Jing:Naifeng", "Jianfei Wang.....http://dblp.org/pers/hd/w/Wang:Jianfei", "Fengfeng Fan.....http://dblp.org/pers/hd/f/Fan:Fengfeng", "Wenkang Yu.....http://dblp.org/pers/hd/y/Yu:Wenkang", "Li Jiang.....http://dblp.org/pers/hd/j/Jiang_0002:Li", "Chao Li.....http://dblp.org/pers/hd/l/Li_0009:Chao", "Xiaoyao Liang.....http://dblp.org/pers/hd/l/Liang:Xiaoyao"], "conf": "micro", "year": "2016", "pages": 12}