{"title": "A GPU-based index to support interactive spatio-temporal queries over historical data.", "fields": ["data set", "spatial query", "trips architecture", "speedup", "order of magnitude"], "abstract": "There are increasing volumes of spatio-temporal data from various sources such as sensors, social networks and urban environments. Analysis of such data requires flexible exploration and visualizations, but queries that span multiple geographical regions over multiple time slices are expensive to compute, making it challenging to attain interactive speeds for large data sets. In this paper, we propose a new indexing scheme that makes use of modern GPUs to efficiently support spatio-temporal queries over point data. The index covers multiple dimensions, thus allowing simultaneous filtering of spatial and temporal attributes. It uses a block-based storage structure to speed up OLAP-type queries over historical data, and supports query processing over in-memory and disk-resident data. We present different query execution algorithms that we designed to allow the index to be used in different hardware configurations, including CPU-only, GPU-only, and a combination of CPU and GPU. To demonstrate the effectiveness of our techniques, we implemented them on top of MongoDB and performed an experimental evaluation using two real-world data sets: New York City's (NYC) taxi data - consisting of over 868 million taxi trips spanning a period of five years, and Twitter posts - over 1.1 billion tweets collected over a period of 14 months. Our results show that our GPU-based index obtains interactive, sub-second response times for queries over large data sets and leads to at least two orders of magnitude speedup over spatial indexes implemented in existing open-source and commercial database systems.", "citation": "Citations (5)", "departments": ["New York University", "City University of New York", "New York University", "New York University"], "authors": ["Harish Doraiswamy.....http://dblp.org/pers/hd/d/Doraiswamy:Harish", "Huy T. Vo.....http://dblp.org/pers/hd/v/Vo:Huy_T=", "Cláudio T. Silva.....http://dblp.org/pers/hd/s/Silva:Cl=aacute=udio_T=", "Juliana Freire.....http://dblp.org/pers/hd/f/Freire:Juliana"], "conf": "icde", "year": "2016", "pages": 12}