{"title": "Link prediction in graph streams.", "fields": ["random geometric graph", "jaccard index", "without loss of generality", "minhash", "sketch"], "abstract": "Link prediction is a fundamental problem that aims to estimate the likelihood of the existence of edges (links) based on the current observed structure of a graph, and has found numerous applications in social networks, bioinformatics, E-commerce, and the Web. In many real-world scenarios, however, graphs are massive in size and dynamically evolving in a fast rate, which, without loss of generality, are often modeled and interpreted as graph streams. Existing link prediction methods fail to generalize in the graph stream setting because graph snapshots where link prediction is performed are no longer readily available in memory, or even on disks, for effective graph computation and analysis. It is therefore highly desirable, albeit challenging, to support link prediction online and in a dynamic way, which, in this paper, is referred to as the streaming link prediction problem in graph streams. In this paper, we consider three fundamental, neighborhood-based link prediction target measures, Jaccard coefficient, common neighbor, and Adamic-Adar, and provide accurate estimation to them in order to address the streaming link prediction problem in graph streams. Our main idea is to design cost-effective graph sketches (constant space per vertex) based on MinHash and vertex-biased sampling techniques, and to propose efficient sketch based algorithms (constant time per edge) with both theoretical accuracy guarantee and robust estimation results. We carry out experimental studies in a series of real-world graph streams. The results demonstrate that our graph sketch based methods are accurate, efficient, cost-effective, and thus can be practically employed for link prediction in real-world graph streams.", "citation": "Citations (7)", "departments": ["Florida State University", "IBM", "Florida State University"], "authors": ["Peixiang Zhao.....http://dblp.org/pers/hd/z/Zhao:Peixiang", "Charu C. Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Charu_C=", "Gewen He.....http://dblp.org/pers/hd/h/He:Gewen"], "conf": "icde", "year": "2016", "pages": 12}