{"title": "Digitally Augmenting Sports: An Opportunity for Exploring and Understanding Novel Balancing Techniques.", "fields": ["game mechanics", "simulation", "adversary", "non cooperative game", "user experience design"], "abstract": "Using game balancing techniques can provide the right level of challenge and hence enhance player engagement for sport players with different skill levels. Digital technology can support and enhance balancing techniques in sports, for example, by adjusting players' level of intensity based on their heart rate. However, there is limited knowledge on how to design such balancing and its impact on the user experience. To address this we created two novel balancing techniques enabled by digitally augmenting a table tennis table. We adjusted the more skilled player's performance by inducing two different styles of play and studied the effects on game balancing and player engagement. We showed that by altering the more skilled player's performance we can balance the game through: (i) encouraging game mistakes, and (ii) changing the style of play to one that is easier for the opponent to counteract. We outline the advantages and disadvantages of each approach, extending our understanding of game balancing design. We also show that digitally augmenting sports offers opportunities for novel balancing techniques while facilitating engaging experiences, guiding those interested in HCI and sports.", "citation": "Citations (14)", "year": "2016", "departments": ["University of Canterbury", "RMIT University", "University of Canterbury", "University of Canterbury", "University of South Australia"], "conf": "chi", "authors": ["David Altimira.....http://dblp.org/pers/hd/a/Altimira:David", "Florian 'Floyd' Mueller.....http://dblp.org/pers/hd/m/Mueller:Florian_=Floyd=", "Jenny Clarke.....http://dblp.org/pers/hd/c/Clarke:Jenny", "Gun A. Lee.....http://dblp.org/pers/hd/l/Lee:Gun_A=", "Mark Billinghurst.....http://dblp.org/pers/hd/b/Billinghurst:Mark", "Christoph Bartneck.....http://dblp.org/pers/hd/b/Bartneck:Christoph"], "pages": 11}