{"title": "Sneak-Peek: High speed covert channels in data center networks.", "fields": ["data center", "peek", "covert channel", "big data", "code rate"], "abstract": "With the advent of big data, modern businesses face an increasing need to store and process large volumes of sensitive customer information on the cloud. In these environments, resources are shared across a multitude of mutually untrusting tenants increasing propensity for data leakage. This problem stands to grow further in severity with increasing use of clouds in all aspects of our daily lives and the recent spate of high-profile data exfiltration attacks are evidence. To highlight this serious issue, we present a novel and highspeed network-based covert channel that is robust and circumvents a broad set of security mechanisms currently deployed by cloud vendors. We successfully test our channel on numerous network environments, including commercial clouds such as EC2 and Azure. Using an information theoretic model of the channel, we derive an upper bound on the maximum information rate and propose an optimal coding scheme. Our adaptive decoding algorithm caters to the cross traffic in the channel and maintains high bit rates and extremely low error rates. Finally, we discuss several effective avenues for mitigation of the aforementioned channel and provide insights into how data exfiltration can be prevented in such shared environments.", "citation": "Citations (4)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Chicago", "University of Illinois at Urbana–Champaign", "Lahore University of Management Sciences", "University of Illinois at Urbana–Champaign"], "authors": ["Rashid Tahir.....http://dblp.org/pers/hd/t/Tahir:Rashid", "Mohammad Taha Khan.....http://dblp.org/pers/hd/k/Khan:Mohammad_Taha", "Xun Gong.....http://dblp.org/pers/hd/g/Gong:Xun", "Adnan Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Adnan", "AmirEmad Ghassami.....http://dblp.org/pers/hd/g/Ghassami:AmirEmad", "Hasanat Kazmi.....http://dblp.org/pers/hd/k/Kazmi:Hasanat", "Matthew Caesar.....http://dblp.org/pers/hd/c/Caesar:Matthew", "Fareed Zaffar.....http://dblp.org/pers/hd/z/Zaffar:Fareed", "Negar Kiyavash.....http://dblp.org/pers/hd/k/Kiyavash:Negar"], "conf": "infocom", "year": "2016", "pages": 9}