{"title": "Programming moves: Design and evaluation of applying embodied interaction in virtual environments to enhance computational thinking in middle school students.", "fields": ["dance", "immersion", "computational thinking", "exploratory research", "embodied cognition"], "abstract": "We detail the design, implementation, and an initial evaluation of a virtual reality education and entertainment (edutainment) application called Virtual Environment Interactions (VEnvI). VEnvI is an application in which students learn computer science concepts through the process of choreographing movement for a virtual character using a fun and intuitive interface. In this exploratory study, 54 participants as part of a summer camp geared towards promoting participation of women in science and engineering programmatically crafted a dance performance for a virtual human. A subset of those students (16) participated in an immersive embodied interaction metaphor in VEnvI. In creating this metaphor that provides first-person, embodied experiences using self-avatars, we seek to facilitate engagement, excitement and interest in computational thinking. We qualitatively and quantitatively evaluated the extent to which the activities of the summer camp, programming the dance moves, and the embodied interaction within VEnvI facilitated students' edutainment, presence, interest, excitement, and engagement in computing, and the potential to alter their perceptions of computing and computer scientists. Results indicate that students enjoyed the experience and successfully engaged the virtual character in the immersive embodied interaction, thus exhibiting high telepresence and social presence. Students also showed increased interest and excitement regarding the computing field at the end of their summer camp experience using VEnvI.", "citation": "Citations (8)", "departments": ["Clemson University", "Clemson University", "Clemson University", "Clemson University", "Clemson University"], "authors": ["Dhaval Parmar.....http://dblp.org/pers/hd/p/Parmar:Dhaval", "Joseph Isaac.....http://dblp.org/pers/hd/i/Isaac:Joseph", "Sabarish V. Babu.....http://dblp.org/pers/hd/b/Babu:Sabarish_V=", "Nikeetha D'Souza.....http://dblp.org/pers/hd/d/D=Souza:Nikeetha", "Alison E. Leonard.....http://dblp.org/pers/hd/l/Leonard:Alison_E=", "Sophie Jörg.....http://dblp.org/pers/hd/j/J=ouml=rg:Sophie", "Kara Gundersen.....http://dblp.org/pers/hd/g/Gundersen:Kara", "Shaundra Bryant Daily.....http://dblp.org/pers/hd/d/Daily:Shaundra_Bryant"], "conf": "vr", "year": "2016", "pages": 10}