{"title": "Private Circuits III: Hardware Trojan-Resilience via Testing Amplification.", "fields": ["trojan", "cryptographic primitive", "electronic circuit", "hardware trojan", "concrete security", "computer science", "embedded system", "psychological resilience", "computer security compromised by hardware failure"], "abstract": "Security against hardware trojans is currently becoming an essential ingredient to ensure trust in information systems. A variety of solutions have been introduced to reach this goal, ranging from reactive (i.e., detection-based) to preventive (i.e., trying to make the insertion of a trojan more difficult for the adversary). In this paper, we show how testing (which is a typical detection tool) can be used to state concrete security guarantees for preventive approaches to trojan-resilience. For this purpose, we build on and formalize two important previous works which introduced ``input scrambling\" and ``split manufacturing\" as countermeasures to hardware trojans. Using these ingredients, we present a generic compiler that can transform any circuit into a trojan-resilient one, for which we can state quantitative security guarantees on the number of correct executions of the circuit thanks to a new tool denoted as ``testing amplification\". Compared to previous works, our threat model covers an extended range of hardware trojans while we stick with the goal of minimizing the number of honest elements in our transformed circuits. Since transformed circuits essentially correspond to redundant multiparty computations of the target functionality, they also allow reasonably efficient implementations, which can be further optimized if specialized to certain cryptographic primitives and security goals.", "citation": "Not cited", "year": "2016", "departments": ["University of Warsaw", "Ruhr University Bochum", "Université catholique de Louvain"], "conf": "ccs", "authors": ["Stefan Dziembowski.....http://dblp.org/pers/hd/d/Dziembowski:Stefan", "Sebastian Faust.....http://dblp.org/pers/hd/f/Faust:Sebastian", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier"], "pages": 12}