{"title": "CU-LTE: Spectrally-efficient and fair coexistence between LTE and Wi-Fi in unlicensed bands.", "fields": ["access stratum", "radio resource management", "cognitive radio", "network utility", "small cell"], "abstract": "To cope with the increasing scarcity of spectrum resources, researchers have been working to extend LTE/LTE-A cellular systems to unlicensed bands, leading to so-called unlicensed LTE (U-LTE). However, this extension is by no means straightforward, primarily because the radio resource management schemes used by LTE and by systems already deployed in unlicensed bands are incompatible. Specifically, it is well known that coexistence with scheduled systems like LTE degrades considerably the throughput of Wi-Fi networks that are based on carrier-sense medium access schemes. To address this challenge, we propose for the first time a cognitive coexistence scheme to enable spectrum sharing between U-LTE and Wi-Fi networks, referred to as CU-LTE. The proposed scheme is designed to jointly determine dynamic channel selection, carrier aggregation and fractional spectrum access for U-LTE networks, while guaranteeing fair spectrum access for Wi-Fi based on a newly designed cross-technology fairness criterion. We first derive a mathematical model of the spectrum sharing problem for the coexisting networks; we then design a solution algorithm to solve the resulting fairness constrained mixed integer nonlinear optimization problem. The algorithm, based on a combination of branch and bound and convex relaxation techniques, maximizes the network utility with guaranteed optimality precision that can be set arbitrarily to 1 at the expense of computational complexity. Performance evaluation indicates that near-optimal spectrum access can be achieved with guaranteed fairness between U-LTE and Wi-Fi. Issues regarding implementation of CU-LTE are also discussed.", "citation": "Citations (56)", "departments": ["Northeastern University", "Northeastern University"], "authors": ["Zhangyu Guan.....http://dblp.org/pers/hd/g/Guan:Zhangyu", "Tommaso Melodia.....http://dblp.org/pers/hd/m/Melodia:Tommaso"], "conf": "infocom", "year": "2016", "pages": 9}