{"title": "Delegated persist ordering.", "fields": ["memory ordering", "volatile", "persistent data structure", "3d xpoint", "order by"], "abstract": "Systems featuring a load-store interface to persistent memory (PM) are expected soon, making in-memory persistent data structures feasible. Ensuring persistent data structure recoverability requires constraints on the order PM writes become persistent. But, current memory systems reorder writes, providing no such guarantees. To complement their upcoming 3D XPoint memory, Intel has announced new instructions to enable programmer control of data persistence. We describe the semantics implied by these instructions, an ordering model we call  synchronous ordering.    Synchronous ordering (SO) enforces order by stalling execution when PM write ordering is required, exposing PM write latency on the execution critical path. It incurs an average slowdown of 7.21x over volatile execution without ordering in PM-write-intensive benchmarks. SO tightly couples enforcing order and flushing writes to PM, but this tight coupling is unneeded in many recoverable software systems. Instead, we propose  delegated ordering , wherein ordering requirements are communicated explicitly to the PM controller, fully decoupling PM write ordering from volatile execution and cache management. We demonstrate that delegated ordering can bring performance within 1.93x of volatile execution, improving over SO by 3.73x.", "citation": "Citations (17)", "departments": ["University of Michigan", "Snowflake Computing", "ARM", "ARM", "Snowflake Computing"], "authors": ["Aasheesh Kolli.....http://dblp.org/pers/hd/k/Kolli:Aasheesh", "Jeff Rosen.....http://dblp.org/pers/hd/r/Rosen:Jeff", "Stephan Diestelhorst.....http://dblp.org/pers/hd/d/Diestelhorst:Stephan", "Ali G. Saidi.....http://dblp.org/pers/hd/s/Saidi:Ali_G=", "Steven Pelley.....http://dblp.org/pers/hd/p/Pelley:Steven", "Sihang Liu.....http://dblp.org/pers/hd/l/Liu:Sihang", "Peter M. Chen.....http://dblp.org/pers/hd/c/Chen:Peter_M=", "Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F="], "conf": "micro", "year": "2016", "pages": 13}