{"title": "2PCP: Two-phase CP decomposition for billion-scale dense tensors.", "fields": ["data set", "data exchange", "server", "tensor", "anomaly detection"], "abstract": "Tensors are multi-dimensional arrays - consequently, tensor decomposition operations (CP and Tucker) are the bases for many high-dimensional data analysis tasks, from clustering, trend detection, anomaly detection, to correlation analysis in various application domains, including science and engineering1. One key problem with tensor decomposition is its computational complexity and space requirements. Especially, as the relevant data sets get denser, in-memory schemes for tensor decomposition become increasingly ineffective; therefore out-of-core (secondary-memory supported, potentially parallel) computing is necessitated. However, existing techniques do not consider the I/O and network data exchange costs that out-of-core execution of the tensor decomposition operation will incur. In this paper, we note that when this operation is implemented with the help of secondary-memory and/or multiple servers to tackle the memory limitations, we would need intelligent buffer-management and task-scheduling techniques which take into account the cost of bringing the relevant blocks into the buffer to minimize I/O in the system. In this paper, we introduce 2PCP, a two-phase, block-based CP decomposition system with intelligent buffer sensitive task scheduling and buffer management mechanisms. 2PCP aims to reduce I/O costs in the analysis of relatively dense tensors common in scientific and engineering applications. Experiment results compare with current state of art tensor decomposition algorithms and show that our algorithms can significantly reduce the amount of I/O and execution time while maintaining decomposition accuracy.", "citation": "Citations (2)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "University of Turin"], "authors": ["Xinsheng Li.....http://dblp.org/pers/hd/l/Li:Xinsheng", "Shengyu Huang.....http://dblp.org/pers/hd/h/Huang:Shengyu", "K. Selçuk Candan.....http://dblp.org/pers/hd/c/Candan:K=_Sel=ccedil=uk", "Maria Luisa Sapino.....http://dblp.org/pers/hd/s/Sapino:Maria_Luisa"], "conf": "icde", "year": "2016", "pages": 12}