{"title": "TARDiS: A Branch-and-Merge Approach To Weak Consistency.", "fields": ["transactional leadership", "eventual consistency", "weak consistency", "causal consistency", "thread"], "abstract": "This paper presents the design, implementation, and evaluation of TARDiS (Transactional Asynchronously Replicated Divergent Store), a transactional key-value store explicitly designed for weakly-consistent systems. Reasoning about these systems is hard, as neither causal consistency nor per-object eventual convergence allow applications to deal satisfactorily with write-write conflicts. TARDiS instead exposes as its fundamental abstraction the set of conflicting branches that arise in weakly-consistent systems. To this end, TARDiS introduces a new concurrency control mechanism: branch-on-conflict. On the one hand, TARDiS guarantees that storage will appear sequential to any thread of execution that extends a branch, keeping application logic simple. On the other, TARDiS provides applications, when needed, with the tools and context necessary to merge branches atomically, when and how applications want. Since branch-on-conflict in TARDiS is fast, weakly-consistent applications can benefit from adopting this paradigm not only for operations issued by different sites, but also, when appropriate, for conflicting local operations. We find that TARDiS reduces coding complexity for these applications and that judicious branch-on-conflict can improve their local throughput at each site by two to eight times.", "citation": "Citations (7)", "year": "2016", "departments": ["University of Texas at Austin", "University of Texas at Austin", "Max Planck Society", "University of Texas at Austin", "University of Texas at Austin"], "conf": "sigmod", "authors": ["Natacha Crooks.....http://dblp.org/pers/hd/c/Crooks:Natacha", "Youer Pu.....http://dblp.org/pers/hd/p/Pu:Youer", "Nancy Estrada.....http://dblp.org/pers/hd/e/Estrada:Nancy", "Trinabh Gupta.....http://dblp.org/pers/hd/g/Gupta:Trinabh", "Lorenzo Alvisi.....http://dblp.org/pers/hd/a/Alvisi:Lorenzo", "Allen Clement.....http://dblp.org/pers/hd/c/Clement:Allen"], "pages": 14}