{"title": "On-the-fly decomposition of specifications in software model checking.", "fields": ["runtime verification", "functional verification", "verification and validation", "verification", "software verification"], "abstract": "Major breakthroughs have increased the efficiency and effectiveness of software model checking considerably, such that this technology is now applicable to industrial-scale software. However, verifying the full formal specification of a software system is still considered too complex, and in practice, sets of properties are verified one by one in isolation. We propose an approach that takes the full formal specification as input and first tries to verify all properties simultaneously in one verification run. Our verification algorithm monitors itself and detects situations for which the full set of properties is too complex. In such cases, we perform an automatic decomposition of the full set of properties into smaller sets, and continue the verification seamlessly. To avoid state-space explosion for large sets of properties, we introduce on-the-fly property weaving: properties get weaved into the program's transition system on the fly, during the analysis; which properties to weave and verify is determined dynamically during the verification process. We perform an extensive evaluation based on verification tasks that were derived from 4336 Linux kernel modules, and a set of properties that define the correct usage of the Linux API. Checking several properties simultaneously can lead to a significant performance gain, due to the fact that abstract models share many parts among different properties.", "citation": "Citations (1)", "departments": ["University of Passau", "Ludwig Maximilian University of Munich", "Russian Academy of Sciences", "Russian Academy of Sciences", "University of Passau"], "authors": ["Sven Apel.....http://dblp.org/pers/hd/a/Apel:Sven", "Dirk Beyer.....http://dblp.org/pers/hd/b/Beyer_0001:Dirk", "Vitaly O. Mordan.....http://dblp.org/pers/hd/m/Mordan:Vitaly_O=", "Vadim S. Mutilin.....http://dblp.org/pers/hd/m/Mutilin:Vadim_S=", "Andreas Stahlbauer.....http://dblp.org/pers/hd/s/Stahlbauer:Andreas"], "conf": "sigsoft", "year": "2016", "pages": 13}