{"title": "Node-based service-balanced scheduling for provably guaranteed throughput and evacuation time performance.", "fields": ["network packet", "fair share scheduling", "workload", "round robin scheduling", "approximation algorithm", "two level scheduling", "fold", "bipartite graph", "rate monotonic scheduling", "maximum throughput scheduling"], "abstract": "This paper focuses on the design of provably efficient online link scheduling algorithms for multi-hop wireless networks. We consider single-hop flows and the one-hop interference model. The objective is twofold: 1) maximize the throughput when the flow sources continuously inject packets into the network, and 2) minimize the evacuation time when there are no future packet arrivals. The prior work mostly employs the link-based approach, which leads to throughput-efficient algorithms but often does not guarantee satisfactory evacuation time performance. In this paper, we adopt a novel node-based approach and propose a service-balanced online scheduling algorithm, called NSB, which gives balanced scheduling opportunities to the nodes with heavy workload. We rigorously prove that NSB guarantees to achieve an efficiency ratio no worse (or no smaller) than 2/3 for the throughput and an approximation ratio no worse (or no greater) than 3/2 for the evacuation time. It is remarkable that NSB is both throughput-optimal and evacuation-time-optimal if the underlying network graph is bipartite. Further, we develop a lower-complexity NSB algorithm, called LC-NSB, which provides the same performance guarantees as NSB. Finally, we conduct numerical experiments to elucidate our theoretical results.", "citation": "Not cited", "departments": ["Temple University", "AT&T Labs", "Temple University", "Temple University", "AT&T Labs", "Temple University"], "authors": ["Bo Ji.....http://dblp.org/pers/hd/j/Ji:Bo", "Gagan Raj Gupta.....http://dblp.org/pers/hd/g/Gupta:Gagan_Raj", "Yu Sang.....http://dblp.org/pers/hd/s/Sang:Yu"], "conf": "infocom", "year": "2016", "pages": 9}