{"title": "Opening the Chrysalis: On the Real Repair Performance of MSR Codes.", "fields": ["erasure code", "erasure", "distributed data store", "fountain code", "online codes"], "abstract": "Large distributed storage systems use erasure codes to reliably store data. Compared to replication, erasure codes are capable of reducing storage overhead. However, repairing lost data in an erasure coded system requires reading from many storage devices and transferring over the network large amounts of data. Theoretically, Minimum Storage Regenerating (MSR) codes can significantly reduce this repair burden. Although several explicit MSR code constructions exist, they have not been implemented in real-world distributed storage systems. We close this gap by providing a performance analysis of Butterfly codes, systematic MSR codes with optimal repair I/O. Due to the complexity of modern distributed systems, a straightforward approach does not exist when it comes to implementing MSR codes. Instead, we show that achieving good performance requires to vertically integrate the code with multiple system layers. The encoding approach, the type of inter-node communication, the interaction between different distributed system layers, and even the programming language have a significant impact on the code repair performance. We show that with new distributed system features, and careful implementation, we can achieve the theoretically expected repair performance of MSR codes.", "citation": "Citations (17)", "departments": ["University of Southern California", "WD Research", "WD Research", "WD Research", "WD Research"], "authors": ["Lluis Pamies-Juarez.....http://dblp.org/pers/hd/p/Pamies=Juarez:Lluis", "Filip Blagojevic.....http://dblp.org/pers/hd/b/Blagojevic:Filip", "Robert Mateescu.....http://dblp.org/pers/hd/m/Mateescu:Robert", "Cyril Guyot.....http://dblp.org/pers/hd/g/Guyot:Cyril", "Eyal En Gad.....http://dblp.org/pers/hd/g/Gad:Eyal_En", "Zvonimir Bandic.....http://dblp.org/pers/hd/b/Bandic:Zvonimir"], "conf": "fast", "year": "2016", "pages": 14}