{"title": "Smart Beholder: An Extensible Smart Lens Platform.", "fields": ["open smart card development platform", "symmetric multiprocessor system", "pi", "android", "extensibility"], "abstract": "Smart Lenses refer to detachable, orientable and zoomable lenses that stream live videos over wireless networks to heterogeneous computing devices, including tablets and smartphones. Various novel applications are made possible by smart lenses, including mobile photography, smart surveillance cameras, and Unmanned Aerial Vehicle (UAV) cameras. However, to our best knowledge, existing smart lenses are closed and proprietary, and thus we initiate an open-source project called Smart Beholder for end-to-end solutions of smart lenses. The code and documents of Smart Beholder can be found at our website http://www.smartbeholder.org. Our Smart Beholder platform are useful to researchers for fast prototyping, developers for rapid development, and amateurs for hobbies. We have implemented Smart Beholder server (camera) using a popular embedded Linux platform, called Raspberry Pi. We have also realized Smart Beholder client (controller) on various OS's, including Android. Our experimental results show the practicality and efficiency of our proposed Smart Beholder: we outperform commercial products in the market in terms of both objective and subjective metrics. We believe the release of Smart Beholder will stimulate future studies on novel multimedia applications enabled by smart lenses.", "citation": "Not cited", "departments": ["National Chiao Tung University", "National Tsing Hua University", "Academia Sinica", "National Tsing Hua University", "Academia Sinica"], "authors": ["Chun-Ying Huang.....http://dblp.org/pers/hd/h/Huang:Chun=Ying", "Ching-Ling Fan.....http://dblp.org/pers/hd/f/Fan:Ching=Ling", "Chih-Fan Hsu.....http://dblp.org/pers/hd/h/Hsu:Chih=Fan", "Hsin-Yu Chang.....http://dblp.org/pers/hd/c/Chang:Hsin=Yu", "Tsung-Han Tsai.....http://dblp.org/pers/hd/t/Tsai:Tsung=Han", "Kuan-Ta Chen.....http://dblp.org/pers/hd/c/Chen:Kuan=Ta", "Cheng-Hsin Hsu.....http://dblp.org/pers/hd/h/Hsu:Cheng=Hsin"], "conf": "mm", "year": "2016", "pages": 5}