{"title": "Graph Indexing for Shortest-Path Finding over Dynamic Sub-Graphs.", "fields": ["strength of a graph", "distance", "longest path problem", "simplex graph", "distance hereditary graph"], "abstract": "A variety of applications spanning various domains, e.g., social networks, transportation, and bioinformatics, have graphs as first-class citizens. These applications share a vital operation, namely, finding the shortest path between two nodes. In many scenarios, users are interested in filtering the graph before finding the shortest path. For example, in social networks, one may need to compute the shortest path between two persons on a sub-graph containing only family relationships. This paper focuses on dynamic graphs with labeled edges, where the target is to find a shortest path after filtering some edges based on user-specified query labels. This problem is termed the Edge-Constrained Shortest Path query (or ECSP, for short). This paper introduces Edge-Disjoint Partitioning (EDP, for short), a new technique for efficiently answering ECSP queries over dynamic graphs. EDP has two main components: a dynamic index that is based on graph partitioning, and a traversal algorithm that exploits the regular patterns of the answers of ECSP queries. The main idea of EDP is to partition the graph based on the labels of the edges. On demand, EDP computes specific sub-paths within each partition and updates its index. The computed sub-paths act as pre-computations that can be leveraged by future queries. To answer an ECSP query, EDP connects sub-paths from different partitions using its efficient traversal algorithm. EDP can dynamically handle various types of graph updates, e.g., label, edge, and node updates. The index entries that are potentially affected by graph updates are invalidated and re-computed on demand. EDP is evaluated using real graph datasets from various domains. Experimental results demonstrate that EDP can achieve query performance gains of up to four orders of magnitude in comparison to state of the art techniques.", "citation": "Citations (2)", "year": "2016", "departments": ["Purdue University", "Purdue University", "Purdue University"], "conf": "sigmod", "authors": ["Mohamed S. Hassan.....http://dblp.org/pers/hd/h/Hassan:Mohamed_S=", "Walid G. Aref.....http://dblp.org/pers/hd/a/Aref:Walid_G=", "Ahmed M. Aly.....http://dblp.org/pers/hd/a/Aly:Ahmed_M="], "pages": 15}