{"title": "Building the Enterprise Fabric for Big Data with Vertica and Spark Integration.", "fields": ["analytics", "predictive model markup language", "sql", "spark", "predictive analytics"], "abstract": "Enterprise customers increasingly require greater flexibility in the way they access and process their Big Data while at the same time they continue to request advanced analytics and access to diverse data sources. Yet customers also still require the robustness of enterprise class analytics for their mission-critical data. In this paper, we present our initial efforts toward a solution that satisfies the above requirements by integrating the HPE Vertica enterprise database with Apache Spark's open source big data computation engine. In particular, it enables fast, reliable transferring of data between Vertica and Spark; and deploying Machine Learning models created by Spark into Vertica for predictive analytics on Vertica data. This integration provides a fabric on which our customers get the best of both worlds: it extends Vertica's extensive SQL analytics capabilities with Spark's machine learning library (MLlib), giving Vertica users access to a wide range of ML functions; it also enables customers to leverage Spark as an advanced ETL engine for all data that require the guarantees offered by Vertica.", "citation": "Citations (1)", "year": "2016", "departments": ["HPE Vertica, Su ... nyvale, CA, USA", "HPE Vertica, Su ... nyvale, CA, USA", "HPE Vertica, Su ... nyvale, CA, USA", "HPE Vertica, Su ... nyvale, CA, USA", "HPE Vertica, Su ... nyvale, CA, USA"], "conf": "sigmod", "authors": ["Jeff LeFevre.....http://dblp.org/pers/hd/l/LeFevre:Jeff", "Rui Liu.....http://dblp.org/pers/hd/l/Liu:Rui", "Cornelio Inigo.....http://dblp.org/pers/hd/i/Inigo:Cornelio", "Lupita Paz.....http://dblp.org/pers/hd/p/Paz:Lupita", "Edward Ma.....http://dblp.org/pers/hd/m/Ma:Edward", "Malú Castellanos.....http://dblp.org/pers/hd/c/Castellanos:Mal=uacute=", "Meichun Hsu.....http://dblp.org/pers/hd/h/Hsu:Meichun"], "pages": 13}