{"title": "Fast motif discovery in short sequences.", "fields": ["sequence clustering", "eukaryotic linear motif resource", "motif", "big data", "planted motif search"], "abstract": "Motif discovery in sequence data is fundamental to many biological problems such as antibody biomarker identification. Recent advances in instrumental techniques make it possible to generate thousands of protein sequences at once, which raises a big data issue for the existing motif finding algorithms: They either work only in a small scale of several hundred sequences or have to trade accuracy for efficiency. In this work, we demonstrate that by intelligently clustering sequences, it is possible to significantly improve the scalability of all the existing motif finding algorithms without losing accuracy at all. An anchor based sequence clustering algorithm (ASC) is thus proposed to divide a sequence dataset into multiple smaller clusters so that sequences sharing the same motif will be located into the same cluster. Then an existing motif finding algorithm can be applied to each individual cluster to generate motifs. In the end, the results from multiple clusters are merged together as final output. Experimental results show that our approach is generic and orders of magnitude faster than traditional motif finding algorithms. It can discover motifs from protein sequences in the scale that no existing algorithm can handle. In particular, ASC reduces the running time of a very popular motif finding algorithm, MEME, from weeks to a few minutes with even better accuracy.", "citation": "Citations (3)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Honglei Liu.....http://dblp.org/pers/hd/l/Liu:Honglei", "Fangqiu Han.....http://dblp.org/pers/hd/h/Han:Fangqiu", "Hongjun Zhou.....http://dblp.org/pers/hd/z/Zhou:Hongjun", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Kenneth S. Kosik.....http://dblp.org/pers/hd/k/Kosik:Kenneth_S="], "conf": "icde", "year": "2016", "pages": 12}