{"title": "QUEPA: QUerying and Exploring a Polystore by Augmentation.", "fields": ["data integration", "specific storage", "nosql", "enterprise data management", "view"], "abstract": "Polystore systems (or simply polystores) have been recently proposed to support a common scenario in which enterprise data are stored in a variety of database technologies relying on different data models and languages. Polystores provide a loosely coupled integration of data sources and support the direct access, with the local language, to each specific storage engine to exploit its distinctive features. Given the absence of a global schema, new challenges for accessing data arise in these environments. In fact, it is usually hard to know in advance if a query to a specific data store can be satisfied with data stored elsewhere in the polystore. QUEPA addresses these issues by introducing augmented search and augmented exploration in a polystore, two access methods based on the automatic enrichment of the result of a query over a storage system with related data in the rest of the polystore. These features do not impact on the applications running on top of the polystore and are compatible with the most common database systems. QUEPA implements in this way a lightweight mechanism for data integration in the polystore and operates in a plug-and-play mode, thus reducing the need for ad-hoc configurations and for middleware layers involving standard APIs, unified query languages or shared data models. In our demonstration audience can experience with the augmentation construct by using the native query languages of the database systems available in the polystore.", "citation": "Citations (4)", "year": "2016", "departments": ["Roma Tre University", "Roma Tre University", "Roma Tre University"], "conf": "sigmod", "authors": ["Antonio Maccioni.....http://dblp.org/pers/hd/m/Maccioni:Antonio", "Edoardo Basili.....http://dblp.org/pers/hd/b/Basili:Edoardo", "Riccardo Torlone.....http://dblp.org/pers/hd/t/Torlone:Riccardo"], "pages": 4}