{"title": "Crowdsourcing-based real-time urban traffic speed estimation: From trends to speeds.", "fields": ["traffic congestion reconstruction with kerner s three phase theory", "traffic generation model", "graphical model", "small number", "crowdsourcing"], "abstract": "Real-time urban traffic speed estimation provides significant benefits in many real-world applications. However, existing traffic information acquisition systems only obtain coarse-grained traffic information on a small number of roads but cannot acquire fine-grained traffic information on every road. To address this problem, in this paper we study the traffic speed estimation problem, which, given a budget K, identifies K roads (called seeds) where the real traffic speeds on these seeds can be obtained using crowdsourcing, and infers the speeds of other roads (called non-seed roads) based on the speeds of these seeds. This problem includes two sub-problems: (1) Speed Inference - How to accurately infer the speeds of the non-seed roads; (2) Seed Selection - How to effectively select high-quality seeds. It is rather challenging to estimate the traffic speed accurately, because the traffic changes dynamically and the changes are hard to be predicted as many possible factors can affect the traffic. To address these challenges, we propose effective algorithms to judiciously select high-quality seeds and devise inference models to infer the speeds of the non-seed roads. On the one hand, we observe that roads have correlations and correlated roads have similar traffic trend: the speeds of correlated roads rise or fall compared with their historical average speed simultaneously. We utilize this property and propose a two-step model to estimate the traffic speed. The first step adopts a graphical model to infer the traffic trend and the second step devises a hierarchical linear model to estimate the traffic speed based on the traffic trend. On the other hand, we formulate the seed selection problem, prove that it is NP-hard, and propose several greedy algorithms with approximation guarantees. Experimental results on two large real datasets show that our method outperforms baselines by 2 orders of magnitude in efficiency and 40% in estimation accuracy.", "citation": "Citations (12)", "departments": ["Tsinghua University", "Tsinghua University", "RMIT University", "Tsinghua University", "Tsinghua University"], "authors": ["Huiqi Hu.....http://dblp.org/pers/hd/h/Hu:Huiqi", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng", "Yan Cui.....http://dblp.org/pers/hd/c/Cui:Yan", "Jianhua Feng.....http://dblp.org/pers/hd/f/Feng:Jianhua"], "conf": "icde", "year": "2016", "pages": 12}