{"title": "Boundary Negotiating Artifacts in Personal Informatics: Patient-Provider Collaboration with Patient-Generated Data.", "fields": ["negotiation", "wearable computer", "human computer interaction", "informatics", "knowledge management"], "abstract": "Patient-generated data is increasingly common in chronic disease care management. Smartphone applications and wearable sensors help patients more easily collect health information. However, current commercial tools often do not effectively support patients and providers in collaboration surrounding these data. This paper examines patient expectations and current collaboration practices around patient-generated data. We survey 211 patients, interview 18 patients, and re-analyze a dataset of 21 provider interviews. We find that collaboration occurs in every stage of self- tracking and that patients and providers create boundary negotiating artifacts to support the collaboration. Building upon current practices with patient-generated data, we use these theories of patient and provider collaboration to analyze misunderstandings and privacy concerns as well as identify opportunities to better support these collaborations. We reflect on the social nature of patient-provider collaboration to suggest future development of the stage-based model of personal informatics and the theory of boundary negotiating artifacts.", "citation": "Citations (59)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "Computer Science & Engineering"], "authors": ["Chia-Fang Chung.....http://dblp.org/pers/hd/c/Chung:Chia=Fang", "Kristin Dew.....http://dblp.org/pers/hd/d/Dew:Kristin", "Allison M. Cole.....http://dblp.org/pers/hd/c/Cole:Allison_M=", "Jasmine Zia.....http://dblp.org/pers/hd/z/Zia:Jasmine", "James A. Fogarty.....http://dblp.org/pers/hd/f/Fogarty:James_A=", "Julie A. Kientz.....http://dblp.org/pers/hd/k/Kientz:Julie_A=", "Sean A. Munson.....http://dblp.org/pers/hd/m/Munson:Sean_A="], "conf": "cscw", "year": "2016", "pages": 17}