{"title": "Automated change impact analysis between SysML models of requirements and design.", "fields": ["ranking", "change impact analysis", "program slicing", "systems modeling language", "design elements and principles"], "abstract": "An important activity in systems engineering is analyzing how a change in requirements will impact the design of a system. Performing this analysis manually is expensive, particularly for complex systems. In this paper, we propose an approach to automatically identify the impact of requirements changes on system design, when the requirements and design elements are expressed using models. We ground our approach on the Systems Modeling Language (SysML) due to SysMLâ  s increasing use in industrial applications.   Our approach has two steps: For a given change, we first apply a static slicing algorithm to extract an estimated set of impacted model elements. Next, we rank the elements of the resulting set according to a quantitative measure designed to predict how likely it is for each element to be impacted. The measure is computed using Natural Language Processing (NLP) applied to the textual content of the elements. Engineers can then inspect the ranked list of elements and identify those that are actually impacted. We evaluate our approach on an industrial case study with 16 real-world requirements changes. Our results suggest that, using our approach, engineers need to inspect on average only 4.8% of the entire design in order to identify the actually-impacted elements. We further show that our results consistently improve when our analysis takes into account both structural and behavioral diagrams rather than only structural ones, and the natural-language content of the diagrams in addition to only their structural and behavioral content.", "citation": "Citations (4)", "departments": ["University of Luxembourg", "University of Luxembourg", "University of Luxembourg", "University of Luxembourg", "Delphi Automotive"], "authors": ["Shiva Nejati.....http://dblp.org/pers/hd/n/Nejati:Shiva", "Mehrdad Sabetzadeh.....http://dblp.org/pers/hd/s/Sabetzadeh:Mehrdad", "Chetan Arora.....http://dblp.org/pers/hd/a/Arora_0002:Chetan", "Lionel C. Briand.....http://dblp.org/pers/hd/b/Briand:Lionel_C=", "Felix Mandoux.....http://dblp.org/pers/hd/m/Mandoux:Felix"], "conf": "sigsoft", "year": "2016", "pages": 12}