{"title": "Automated Demand-driven Resource Scaling in Relational Database-as-a-Service.", "fields": ["demand patterns", "database server", "relational database management system", "database engine", "stateless protocol"], "abstract": "Relational Database-as-a-Service (DaaS) platforms today support the abstraction of a resource container that guarantees a fixed amount of resources. Tenants are responsible for selecting a container size suitable for their workloads, which they can change to leverage the cloud's elasticity. However, automating this task is daunting for most tenants since estimating resource demands for arbitrary SQL workloads in an RDBMS is complex and challenging. In addition, workloads and resource requirements can vary significantly within minutes to hours, and container sizes vary by orders of magnitude both in the amount of resources as well as monetary cost. We present a solution to enable a DaaS to auto-scale container sizes on behalf of its tenants. Approaches to auto-scale stateless services, such as web servers, that rely on historical resource utilization as the primary signal, often perform poorly for stateful database servers which are significantly more complex. Our solution derives a set of robust signals from database engine telemetry and combines them to significantly improve accuracy of demand estimation for database workloads resulting in more accurate scaling decisions. Our solution raises the abstraction by allowing tenants to reason about monetary budget and query latency rather than resources. We prototyped our approach in Microsoft Azure SQL Database and ran extensive experiments using workloads with realistic time-varying resource demand patterns obtained from production traces. Compared to an approach that uses only resource utilization to estimate demand, our approach results in 1.5x to 3x lower monetary costs while achieving comparable query latencies.", "citation": "Citations (6)", "year": "2016", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Sudipto Das.....http://dblp.org/pers/hd/d/Das:Sudipto", "Feng Li.....http://dblp.org/pers/hd/l/Li:Feng", "Vivek R. Narasayya.....http://dblp.org/pers/hd/n/Narasayya:Vivek_R=", "Arnd Christian König.....http://dblp.org/pers/hd/k/K=ouml=nig:Arnd_Christian"], "pages": 12}