{"title": "Safe Serializable Secure Scheduling: Transactions and the Trade-Off Between Security and Consistency.", "fields": ["language based security", "serialization", "compensating transaction", "serializability", "commit"], "abstract": "Modern applications often operate on data in multiple administrative domains. In this federated setting, participants may not fully trust each other. These distributed applications use transactions as a core mechanism for ensuring reliability and consistency with persistent data. However, the coordination mechanisms needed for transactions can both leak confidential information and allow unauthorized influence. By implementing a simple attack, we show these side channels can be exploited. However, our focus is on preventing such attacks. We explore secure scheduling of atomic, serializable transactions in a federated setting. While we prove that no protocol can guarantee security and liveness in all settings, we establish conditions for sets of transactions that can safely complete under secure scheduling. Based on these conditions, we introduce \\ti{staged commit}, a secure scheduling protocol for federated transactions. This protocol avoids insecure information channels by dividing transactions into distinct stages. We implement a compiler that statically checks code to ensure it meets our conditions, and a system that schedules these transactions using the staged commit protocol. Experiments on this implementation demonstrate that realistic federated transactions can be scheduled securely, atomically, and efficiently.", "citation": "Citations (2)", "year": "2016", "departments": ["Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University"], "conf": "ccs", "authors": ["Isaac C. Sheff.....http://dblp.org/pers/hd/s/Sheff:Isaac_C=", "Tom Magrino.....http://dblp.org/pers/hd/m/Magrino:Tom", "Jed Liu.....http://dblp.org/pers/hd/l/Liu:Jed", "Andrew C. Myers.....http://dblp.org/pers/hd/m/Myers:Andrew_C=", "Robbert van Renesse.....http://dblp.org/pers/hd/r/Renesse:Robbert_van"], "pages": 13}