{"title": "Cache content-selection policies for streaming video services.", "fields": ["cache algorithms", "cache", "customer base", "popularity", "internet traffic"], "abstract": "The majority of internet traffic is now dominated by streamed video content. As video quality continues to increase, the strain that streaming traffic places on the network infrastructure also increases. Caching content closer to users, e.g., using Content Distribution Networks, is a common solution to reduce the load on the network. A simple approach to selecting what to put in regional caches is to put the videos that are most popular globally across the entire customer base. However, this approach ignores distinct regional taste. In this paper we explore the question of how a video content provider could go about determining whether or not they should use a cache filling policy based solely upon global popularity or take into account regional tastes as well. We propose a model that captures the overlap between inter-regional and intra-regional preferences. We focus on movie content and derive a synthetic model that captures “taste” using matrix factorization, similarly to the method used in recommender systems. Our model enables us to widely explore the parameter space, and derive a set of metrics providers can use to determine whether populating caches according to regional of global tastes provides better cache performance.", "citation": "Citations (11)", "departments": ["University of Massachusetts Amherst", "Google", "University of Massachusetts Amherst", "Facebook", "Technicolor"], "authors": ["Stefan Dernbach.....http://dblp.org/pers/hd/d/Dernbach:Stefan", "Nina Taft.....http://dblp.org/pers/hd/t/Taft:Nina", "Jim Kurose.....http://dblp.org/pers/hd/k/Kurose:Jim", "Udi Weinsberg.....http://dblp.org/pers/hd/w/Weinsberg:Udi", "Christophe Diot.....http://dblp.org/pers/hd/d/Diot:Christophe", "Azin Ashkan.....http://dblp.org/pers/hd/a/Ashkan:Azin"], "conf": "infocom", "year": "2016", "pages": 9}