{"title": "Scheduling jobs with non-uniform demands on multiple servers without interruption.", "fields": ["homogeneous", "heuristics", "preemption", "virtualization", "packing problems"], "abstract": "We consider the problem of scheduling jobs with varying demands on multiple servers. Each server has a certain computing capacity and can schedule multiple jobs simultaneously as long as the jobs' total demand does not exceed the server's capacity. This scenario arises commonly in virtualization, cloud computing, and MapReduce (or Hadoop). We study this problem with the requirement that jobs must be scheduled non-preemptively, meaning that every job must be completed without interruption once it gets started. Often, preemption is out of choice since preempting a job can be prohibitively costly or is not allowed due to system constraints. We focus on the popular objective of minimizing total completion time of jobs. This problem is NP hard hence we study heuristics with provable approximation guarantees. Succinctly, the interaction between two orthogonal quantities, jobs demands and sizes makes the scheduling decision significantly more challenging. In this paper we propose novel algorithms for scheduling jobs with non-uniform demands on multiple homogeneous servers without preemption. We first observe that the Smallest Volume First (SVF) algorithm that favors jobs with smaller volumes could perform very poorly in general. However, we show that SVF yields a nearly optimal schedule when the system is overloaded and jobs have demands considerably smaller than servers' capacities. This result supports the intuition that SVF should work well unless some jobs with high demands occupy the servers for long, blocking other jobs. Building on this intuition and using reduction to geometric packing problems, we develop algorithms that are constant approximation for all instances for the first time. Prior to our work, there was no theoretical study on this problem even for the single server case.", "citation": "Not cited", "departments": ["University of California, Merced", "University of California, Merced", "University of California, Merced"], "authors": ["Sungjin Im.....http://dblp.org/pers/hd/i/Im:Sungjin", "Mina Naghshnejad.....http://dblp.org/pers/hd/n/Naghshnejad:Mina", "Mukesh Singhal.....http://dblp.org/pers/hd/s/Singhal:Mukesh"], "conf": "infocom", "year": "2016", "pages": 9}