{"title": "A query system for social media signals.", "fields": ["clone", "nowcasting", "exploit", "popularity", "phenomenon"], "abstract": "Social media nowcasting, the process of estimating real-world phenomena from social media data, has grown in popularity over the last several years as an alternative to traditional data collection methods like phone surveys. Unfortunately, current nowcasting methods depend on pre-existing, traditionally collected survey data as an aid to sift through the huge number of signals that can be derived from social media. This dependence severely limits the applicability of current nowcasting techniques. If we could remove this need for conventional data, social media signals could describe a much wider range of target phenomena. We have built a nowcasting querying system that estimates real-world phenomena without requiring any conventional data, relying instead upon an interactive exploration with users. Specifically, our system exploits a user-provided multi-part query consisting of semantic and signal components. The user can explore in real time the tradeoff between these two components to find the most relevant social media signals to estimate the target phenomenon. Our demonstration system lets users search for signals within a large Twitter corpus using a dynamic web-based interface. Also, users can share results with the general public, review and comment on others' shared results, and clone these results as starting points for further exploration and querying.", "citation": "Citations (2)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Dolan Antenucci.....http://dblp.org/pers/hd/a/Antenucci:Dolan", "Michael R. Anderson.....http://dblp.org/pers/hd/a/Anderson:Michael_R=", "Penghua Zhao.....http://dblp.org/pers/hd/z/Zhao:Penghua", "Michael J. Cafarella.....http://dblp.org/pers/hd/c/Cafarella:Michael_J="], "conf": "icde", "year": "2016", "pages": 4}