{"title": "High-Performance Geospatial Analytics in HyPerSpace.", "fields": ["geospatial analysis", "computation", "geographic information systems in geospatial intelligence", "hyperspace", "spatial database"], "abstract": "In the past few years, massive amounts of location-based data has been captured. Numerous datasets containing user location information are readily available to the public. Analyzing such datasets can lead to fascinating insights into the mobility patterns and behaviors of users. Moreover, in recent times a number of geospatial data-driven companies like Uber, Lyft, and Foursquare have emerged. Real-time analysis of geospatial data is essential and enables an emerging class of applications. Database support for geospatial operations is turning into a necessity instead of a distinct feature provided by only a few databases. Even though a lot of database systems provide geospatial support nowadays, queries often do not consider the most current database state. Geospatial queries are inherently slow given the fact that some of these queries require a couple of geometric computations. Disk-based database systems that do support geospatial datatypes and queries, provide rich features and functions, but they fall behind when performance is considered: specifically if real-time analysis of the latest transactional state is a requirement. In this demonstration, we present HyPerSpace, an extension to the high-performance main-memory database system HyPer developed at the Technical University of Munich, capable of processing geospatial queries with sub-second latencies.", "citation": "Citations (6)", "year": "2016", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "Technische Universität München", "Technische Universität München"], "conf": "sigmod", "authors": ["Varun Pandey.....http://dblp.org/pers/hd/p/Pandey:Varun", "Andreas Kipf.....http://dblp.org/pers/hd/k/Kipf:Andreas", "Dimitri Vorona.....http://dblp.org/pers/hd/v/Vorona:Dimitri", "Tobias Mühlbauer.....http://dblp.org/pers/hd/m/M=uuml=hlbauer:Tobias", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons"], "pages": 4}