{"title": "SoK: Lessons Learned from Android Security Research for Appified Software Platforms.", "fields": ["software development", "android", "countermeasure", "software system", "privacy software"], "abstract": "Android security and privacy research has boomed in recent years, far outstripping investigations of other appified platforms. However, despite this attention, research efforts are fragmented and lack any coherent evaluation framework. We present a systematization of Android security and privacy research with a focus on the appification of software systems. To put Android security and privacy research into context, we compare the concept of appification with conventional operating system and software ecosystems. While appification has improved some issues (e.g., market access and usability), it has also introduced a whole range of new problems and aggravated some problems of the old ecosystems (e.g., coarse and unclear policy, poor software development practices). Some of our key findings are that contemporary research frequently stays on the beaten path instead of following unconventional and often promising new routes. Many security and privacy proposals focus entirely on the Android OS and do not take advantage of the unique features and actors of an appified ecosystem, which could be used to roll out new security mechanisms less disruptively. Our work highlights areas that have received the larger shares of attention, which attacker models were addressed, who is the target, and who has the capabilities and incentives to implement the countermeasures. We conclude with lessons learned from comparing the appified with the old world, shedding light on missed opportunities and proposing directions for future research.", "citation": "Citations (11)", "departments": ["Saarland University", "Saarland University", "Saarland University", "Saarland University", "Pennsylvania State University"], "authors": ["Yasemin Acar.....http://dblp.org/pers/hd/a/Acar:Yasemin", "Michael Backes.....http://dblp.org/pers/hd/b/Backes_0001:Michael", "Sven Bugiel.....http://dblp.org/pers/hd/b/Bugiel:Sven", "Sascha Fahl.....http://dblp.org/pers/hd/f/Fahl:Sascha", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D=", "Matthew Smith.....http://dblp.org/pers/hd/s/Smith_0001:Matthew"], "conf": "sp", "year": "2016", "pages": 19}