{"title": "Ramanujan coverings of graphs.", "fields": ["ramanujan s sum", "connectivity", "matching polynomial", "ramanujan graph", "covering space"], "abstract": "Let  G  be a finite connected graph, and let ρ be the spectral radius of its universal cover. For example, if  G  is  k -regular then ρ=2√ k −1. We show that for every  r , there is an  r -covering (a.k.a. an  r -lift) of  G  where all the new eigenvalues are bounded from above by ρ. It follows that a bipartite Ramanujan graph has a Ramanujan  r -covering for every  r . This generalizes the  r =2 case due to Marcus, Spielman and Srivastava (2013).   Every  r -covering of  G  corresponds to a labeling of the edges of  G  by elements of the symmetric group  S   r  . We generalize this notion to labeling the edges by elements of various groups and present a broader scenario where Ramanujan coverings are guaranteed to exist.   In particular, this shows the existence of richer families of bipartite Ramanujan graphs than was known before. Inspired by Marcus-Spielman-Srivastava, a crucial component of our proof is the existence of interlacing families of polynomials for complex reflection groups. The core argument of this component is taken from Marcus-Spielman-Srivastava (2015).   Another important ingredient of our proof is a new generalization of the matching polynomial of a graph. We define the  r -th matching polynomial of  G  to be the average matching polynomial of all  r -coverings of  G . We show this polynomial shares many properties with the original matching polynomial. For example, it is real rooted with all its roots inside [−ρ,ρ].", "citation": "Citations (9)", "year": "2016", "departments": ["University of Wyoming", "Princeton University", "Princeton University"], "conf": "stoc", "authors": ["Chris Hall.....http://dblp.org/pers/hd/h/Hall:Chris", "Doron Puder.....http://dblp.org/pers/hd/p/Puder:Doron", "William F. Sawin.....http://dblp.org/pers/hd/s/Sawin:William_F="], "pages": 9}