{"title": "Ranking Relevance in Yahoo Search.", "fields": ["ranking", "query rewriting", "semantic gap", "deep learning", "learning to rank"], "abstract": "Search engines play a crucial role in our daily lives. Relevance is the core problem of a commercial search engine. It has attracted thousands of researchers from both academia and industry and has been studied for decades. Relevance in a modern search engine has gone far beyond text matching, and now involves tremendous challenges. The semantic gap between queries and URLs is the main barrier for improving base relevance. Clicks help provide hints to improve relevance, but unfortunately for most tail queries, the click information is too sparse, noisy, or missing entirely. For comprehensive relevance, the recency and location sensitivity of results is also critical. In this paper, we give an overview of the solutions for relevance in the Yahoo search engine. We introduce three key techniques for base relevance -- ranking functions, semantic matching features and query rewriting. We also describe solutions for recency sensitive relevance and location sensitive relevance. This work builds upon 20 years of existing efforts on Yahoo search, summarizes the most recent advances and provides a series of practical relevance solutions. The performance reported is based on Yahoo's commercial search engine, where tens of billions of urls are indexed and served by the ranking system.", "citation": "Citations (15)", "departments": ["Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!"], "authors": ["Dawei Yin.....http://dblp.org/pers/hd/y/Yin:Dawei", "Yuening Hu.....http://dblp.org/pers/hd/h/Hu:Yuening", "Jiliang Tang.....http://dblp.org/pers/hd/t/Tang:Jiliang", "Tim Daly Jr......http://dblp.org/pers/hd/d/Daly_Jr=:Tim", "Mianwei Zhou.....http://dblp.org/pers/hd/z/Zhou:Mianwei", "Hua Ouyang.....http://dblp.org/pers/hd/o/Ouyang:Hua", "Jianhui Chen.....http://dblp.org/pers/hd/c/Chen:Jianhui", "Changsung Kang.....http://dblp.org/pers/hd/k/Kang:Changsung", "Hongbo Deng.....http://dblp.org/pers/hd/d/Deng:Hongbo", "Chikashi Nobata.....http://dblp.org/pers/hd/n/Nobata:Chikashi", "Jean-Marc Langlois.....http://dblp.org/pers/hd/l/Langlois:Jean=Marc", "Yi Chang.....http://dblp.org/pers/hd/c/Chang:Yi"], "conf": "kdd", "year": "2016", "pages": 10}