{"title": "Personalizing Human Video Pose Estimation.", "fields": ["human video", "estimator", "discriminative model", "pose", "3d pose estimation"], "abstract": "We propose a personalized ConvNet pose estimator that automatically adapts itself to the uniqueness of a person's appearance to improve pose estimation in long videos. We make the following contributions: (i) we show that given a few high-precision pose annotations, e.g. from a generic ConvNet pose estimator, additional annotations can be generated throughout the video using a combination of image-based matching for temporally distant frames, and dense optical flow for temporally local frames, (ii) we develop an occlusion aware self-evaluation model that is able to automatically select the high-quality and reject the erroneous additional annotations, and (iii) we demonstrate that these high-quality annotations can be used to fine-tune a ConvNet pose estimator and thereby personalize it to lock on to key discriminative features of the person's appearance. The outcome is a substantial improvement in the pose estimates for the target video using the personalized ConvNet compared to the original generic ConvNet. Our method outperforms the state of the art (including top ConvNet methods) by a large margin on three standard benchmarks, as well as on a new challenging YouTube video dataset. Furthermore, we show that training from the automatically generated annotations can be used to improve the performance of a generic ConvNet on other benchmarks.", "citation": "Citations (23)", "year": "2016", "departments": ["University of Leeds", "University of Oxford", "University of Leeds", "University of Leeds", "University of Oxford"], "conf": "cvpr", "authors": ["James Charles.....http://dblp.org/pers/hd/c/Charles:James", "Tomas Pfister.....http://dblp.org/pers/hd/p/Pfister:Tomas", "Derek R. Magee.....http://dblp.org/pers/hd/m/Magee:Derek_R=", "David C. Hogg.....http://dblp.org/pers/hd/h/Hogg:David_C=", "Andrew Zisserman.....http://dblp.org/pers/hd/z/Zisserman:Andrew"], "pages": 10}