{"title": "PrivTree: A Differentially Private Algorithm for Hierarchical Decompositions.", "fields": ["recursion", "exploit", "tuple", "laplace distribution", "differential privacy"], "abstract": "Given a set D of tuples defined on a domain Omega, we study differentially private algorithms for constructing a histogram over Omega to approximate the tuple distribution in D. Existing solutions for the problem mostly adopt a hierarchical decomposition approach, which recursively splits Omega into sub-domains and computes a noisy tuple count for each sub-domain, until all noisy counts are below a certain threshold. This approach, however, requires that we (i) impose a limit h on the recursion depth in the splitting of Omega and (ii) set the noise in each count to be proportional to h. The choice of h is a serious dilemma: a small h makes the resulting histogram too coarse-grained, while a large h leads to excessive noise in the tuple counts used in deciding whether sub-domains should be split. Furthermore, h cannot be directly tuned based on D; otherwise, the choice of h itself reveals private information and violates differential privacy. To remedy the deficiency of existing solutions, we present PrivTree, a histogram construction algorithm that adopts hierarchical decomposition but completely eliminates the dependency on a pre-defined h. The core of PrivTree is a novel mechanism that (i) exploits a new analysis on the Laplace distribution and (ii) enables us to use only a constant amount of noise in deciding whether a sub-domain should be split, without worrying about the recursion depth of splitting. We demonstrate the application of PrivTree in modelling spatial data, and show that it can be extended to handle sequence data (where the decision in sub-domain splitting is not based on tuple counts but a more sophisticated measure). Our experiments on a variety of real datasets show that PrivTree considerably outperforms the states of the art in terms of data utility.", "citation": "Citations (14)", "year": "2016", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Microsoft"], "conf": "sigmod", "authors": ["Jun Zhang.....http://dblp.org/pers/hd/z/Zhang:Jun", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing"], "pages": 16}