{"title": "Accelerating Markov Random Field Inference Using Molecular Optical Gibbs Sampling Units.", "fields": ["probabilistic analysis of algorithms", "curse of dimensionality", "probabilistic logic", "markov random field", "markov chain monte carlo"], "abstract": "The increasing use of probabilistic algorithms from statistics and machine learning for data analytics presents new challenges and opportunities for the design of computing systems. One important class of probabilistic machine learning algorithms is Markov Chain Monte Carlo (MCMC) sampling, which can be used on a wide variety of applications in Bayesian Inference. However, this probabilistic iterative algorithm can be inefficient in practice on today's processors, especially for problems with high dimensionality and complex structure. The source of inefficiency is generating samples from parameterized probability distributions.   This paper seeks to address this sampling inefficiency and presents a new approach to support probabilistic computing that leverages the native randomness of Resonance Energy Transfer (RET) networks to construct RET-based sampling units (RSU). Although RSUs can be designed for a variety of applications, we focus on the specific class of probabilistic problems described as Markov Random Field Inference. Our proposed RSU uses a RET network to implement a molecular-scale optical Gibbs sampling unit (RSU-G) that can be integrated into a processor / GPU as specialized functional units or organized as a discrete accelerator. We experimentally demonstrate the fundamental operation of an RSU using a macro-scale hardware prototype. Emulation-based evaluation of two computer vision applications for HD images reveal that an RSU augmented GPU provides speedups over a GPU of 3 and 16. Analytic evaluation shows a discrete accelerator that is limited by 336 GB/s DRAM produces speedups of 21 and 54 versus the GPU implementations.", "citation": "Citations (2)", "year": "2016", "departments": ["Duke University", "Duke University", "Duke University", "Duke University", "Duke University"], "conf": "isca", "authors": ["Siyang Wang.....http://dblp.org/pers/hd/w/Wang:Siyang", "Xiangyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiangyu", "Yuxuan Li.....http://dblp.org/pers/hd/l/Li:Yuxuan", "Ramin Bashizade.....http://dblp.org/pers/hd/b/Bashizade:Ramin", "Song Yang.....http://dblp.org/pers/hd/y/Yang:Song", "Chris Dwyer.....http://dblp.org/pers/hd/d/Dwyer:Chris", "Alvin R. Lebeck.....http://dblp.org/pers/hd/l/Lebeck:Alvin_R="], "pages": 12}