{"title": "BinGo: cross-architecture cross-OS binary search.", "fields": ["binary search algorithm", "malware", "vulnerability", "plagiarism detection", "binary code"], "abstract": "Binary code search has received much attention recently due to its impactful applications, e.g., plagiarism detection, malware detection and software vulnerability auditing. However, developing an effective binary code search tool is challenging due to the gigantic syntax and structural differences in binaries resulted from different compilers, architectures and OSs. In this paper, we propose BINGO — a scalable and robust binary search engine supporting various architectures and OSs. The key contribution is a selective inlining technique to capture the complete function semantics by inlining relevant library and user-defined functions. In addition, architecture and OS neutral function filtering is proposed to dramatically reduce the irrelevant target functions. Besides, we introduce length variant partial traces to model binary functions in a program structure agnostic fashion. The experimental results show that BINGO can find semantic similar functions across architecture and OS boundaries, even with the presence of program structure distortion, in a scalable manner. Using BINGO, we also discovered a zero-day vulnerability in Adobe PDF Reader, a COTS binary.", "citation": "Citations (11)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "DSO National Laboratories"], "authors": ["Mahinthan Chandramohan.....http://dblp.org/pers/hd/c/Chandramohan:Mahinthan", "Yinxing Xue.....http://dblp.org/pers/hd/x/Xue:Yinxing", "Zhengzi Xu.....http://dblp.org/pers/hd/x/Xu:Zhengzi", "Yang Liu.....http://dblp.org/pers/hd/l/Liu_0003:Yang", "Chia Yuan Cho.....http://dblp.org/pers/hd/c/Cho:Chia_Yuan", "Hee Beng Kuan Tan.....http://dblp.org/pers/hd/t/Tan:Hee_Beng_Kuan"], "conf": "sigsoft", "year": "2016", "pages": 12}