{"title": "Linear Hashing Is Awesome.", "fields": ["linear hashing", "k independent hashing", "linear probing", "rolling hash", "rabin karp algorithm"], "abstract": "The most classic textbook hash function, e.g. taught in CLRS [MIT Press'09], is h(x) = ((ax + b) mod p) mod m, (◊) where x, a, b e {0, 1, …, p –} and a, b are chosen uniformly at random. It is known that (◊) is 2-independent and almost uniform provided p is a prime and p » m. This implies that when using (◊) to build a hash table with chaining that contains n ≤ m keys, the expected query time is O(1) and the expected length of the longest chain is O(√n). This result holds for any 2-independent hash function. No hash function can improve on the expected query time, but the upper bound on the expected length of the longest chain is not known to be tight for (◊). Partially addressing this problem, Alon et al. [STOC'97] proved the existence of a class of linear hash functions such that the expected length of the longest chain is (√n) and leave as an open problem to decide which nontrivial properties (◊) has. We make the first progress on this fundamental problem, by showing that the expected length of the longest chain is at most n1/3o(1) which means that the performance of (◊) is similar to that of a 3-independent hash function for which we can prove an upper bound of O(n1/3). As a lemma we show that within a fixed set of integers there are few pairs such that the height of the ratio of the pairs are small. Given two non-zero coprime integers n, m e Z with the height of n/m is max t{|n|, |m|}, and the height is a way of measuring how complex a fraction is. This is proved using a mixture of techniques from additive combinatorics and number theory, and we believe that the result might be of independent interest. For a natural variation of (◊), we show that it is possible to apply second order moment bounds even when a hash value is fixed. As a consequence: For min-wise hashing it was known that any key from a set of n keys has the smallest hash value with probability O (1√n). We improve this to n–1+o(1). For linear probing it was known that the worst case expected query time is O (√n). We improve this to no(1).", "citation": "Citations (1)", "departments": ["University of Copenhagen"], "authors": ["Mathias Bæk Tejs Knudsen.....http://dblp.org/pers/hd/k/Knudsen:Mathias_B=aelig=k_Tejs"], "conf": "focs", "year": "2016", "pages": 8}