{"title": "Understanding and diagnosing real-world Femtocell performance problems.", "fields": ["macrocell", "femtocell", "small cell", "radio link protocol", "data as a service"], "abstract": "Femtocells (small cells) augment the current mobile network by providing users short-range radio access at home and small-business settings. They have rapidly emerged as a promising scheme to alleviate capacity and coverage shortage by offloading traffic from the conventional Macrocells (large cells). Despite its increasing popularity, the real-world Femtocell performance has remained largely unexplored. In this paper, we conduct an in-depth study to assess Femtocell performance and diagnose identified issues in operational carrier networks. We focus on user-deployed Femtocells in a top-tier US mobile network. While the Femtocell generally works well, unanticipated performance degradations and even failures still occur. Contrary to conventional wisdom in the research community, we find that, radio link quality and interference is not the main bottleneck of Femtocells in many real-life usage scenarios. For instance, while Femtocell deployment at blind-zones with no radio coverage is desirable, not all deployments have succeeded; Compared with their Macrocell counterparts, Femtocells exhibit lower speed and larger speed variations, and induce larger delay for data services. Moreover, mobility support for femtocells is incomplete and no seamless migration is available under certain usage scenarios. We pinpoint their root causes, quantify the potential impacts, and share the learned lessons.", "citation": "Citations (1)", "departments": ["Ohio State University", "University of California, Los Angeles", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Chunyi Peng.....http://dblp.org/pers/hd/p/Peng:Chunyi", "Yuanjie Li.....http://dblp.org/pers/hd/l/Li:Yuanjie", "Zhuoran Li.....http://dblp.org/pers/hd/l/Li:Zhuoran", "Jie Zhao.....http://dblp.org/pers/hd/z/Zhao:Jie", "Jiaqi Xu.....http://dblp.org/pers/hd/x/Xu:Jiaqi"], "conf": "infocom", "year": "2016", "pages": 9}