{"title": "Transient guarantees: maximizing the value of idle cloud capacity.", "fields": ["idle", "just in time compilation", "probabilistic logic", "peak demand", "revocation"], "abstract": "To prevent rejecting requests, cloud platforms typically provision for their peak demand. Thus, a platform's idle capacity can be significant, as demand varies widely over multiple time scales, e.g., daily and seasonally. To reduce waste, platforms have begun to offer this idle capacity in the form of  transient servers , which they may unilaterally revoke, for much lower prices---~50-90% less---than on-demand servers, which they cannot revoke. However, transient servers' revocation characteristics---their volatility and predictability---influence their performance, since they affect the overhead of fault-tolerance mechanisms applications use to handle revocations. Unfortunately, current cloud platforms offer no guarantees on revocation characteristics, which makes it difficult for users to optimally configure (and correctly value) transient servers. To address the problem, we propose the abstraction of a  transient guarantee , which offers probabilistic assurances on revocation characteristics. Transient guarantees have numerous benefits: they increase the performance of transient servers, enable users to optimally use and correctly value them, and permit platforms to control their freedom to revoke them. We present policies for partitioning a variable amount of idle capacity into classes with different transient guarantees to maximize performance and value. We then implement and evaluate these policies on job traces from a production Google cluster. We show that our approach can increase the aggregate revenue from idle server capacity by up to ~6.5X compared to existing approaches.", "citation": "Citations (5)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Supreeth Shastri.....http://dblp.org/pers/hd/s/Shastri:Supreeth", "Amr Rizk.....http://dblp.org/pers/hd/r/Rizk:Amr", "David E. Irwin.....http://dblp.org/pers/hd/i/Irwin:David_E="], "conf": "sc", "year": "2016", "pages": 11}