{"title": "An extensive study of static regression test selection in modern software evolution.", "fields": ["software", "granularity", "regression testing", "software evolution", "static analysis"], "abstract": "Regression test selection (RTS) aims to reduce regression testing time by only re-running the tests affected by code changes. Prior research on RTS can be broadly split into dy namic and static techniques. A recently developed dynamic RTS technique called Ekstazi is gaining some adoption in practice, and its evaluation shows that selecting tests at a coarser, class-level granularity provides better results than selecting tests at a finer, method-level granularity. As dynamic RTS is gaining adoption, it is timely to also evaluate static RTS techniques, some of which were proposed over three decades ago but not extensively evaluated on modern software projects.     This paper presents the first extensive study that evaluates the performance benefits of static RTS techniques and their safety; a technique is safe if it selects to run all tests that may be affected by code changes. We implemented two static RTS techniques, one class-level and one method-level, and compare several variants of these techniques. We also compare these static RTS techniques against Ekstazi, a state-of-the-art, class-level, dynamic RTS technique. The experimental results on 985 revisions of 22 open-source projects show that the class-level static RTS technique is comparable to Ekstazi, with similar performance benefits, but at the risk of being unsafe sometimes. In contrast, the method-level static RTS technique performs rather poorly.", "citation": "Citations (13)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Texas at Dallas", "University of Texas at Dallas"], "authors": ["Owolabi Legunsen.....http://dblp.org/pers/hd/l/Legunsen:Owolabi", "Farah Hariri.....http://dblp.org/pers/hd/h/Hariri:Farah", "August Shi.....http://dblp.org/pers/hd/s/Shi:August", "Yafeng Lu.....http://dblp.org/pers/hd/l/Lu:Yafeng", "Lingming Zhang.....http://dblp.org/pers/hd/z/Zhang:Lingming", "Darko Marinov.....http://dblp.org/pers/hd/m/Marinov:Darko"], "conf": "sigsoft", "year": "2016", "pages": 12}