{"title": "Estimating Cosmological Parameters from the Dark Matter Distribution.", "fields": ["lambda cdm model", "particle horizon", "non standard cosmology", "metric expansion of space", "dark energy"], "abstract": "A grand challenge of the 21st century cosmology is to accurately estimate the cosmological parameters of our Universe. A major approach in estimating the cosmological parameters is to use the large scale matter distribution of the Universe. Galaxy surveys provide the means to map out cosmic large-scale structure in three dimensions. Information about galaxy locations is typically summarized in a \"single\" function of scale, such as the galaxy correlation function or power-spectrum. We show that it is possible to estimate these cosmological parameters directly from the distribution of matter. This paper presents the application of deep 3D convolutional networks to volumetric representation of dark-matter simulations as well as the results obtained using a recently proposed distribution regression framework, showing that machine learning techniques are comparable to, and can sometimes outperform, maximum-likelihood point estimates using \"cosmological models\". This opens the way to estimating the parameters of our Universe with higher accuracy.", "citation": "Citations (3)", "year": "2016", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "icml", "authors": ["Siamak Ravanbakhsh.....http://dblp.org/pers/hd/r/Ravanbakhsh:Siamak", "Junier B. Oliva.....http://dblp.org/pers/hd/o/Oliva:Junier_B=", "Sebastian Fromenteau.....http://dblp.org/pers/hd/f/Fromenteau:Sebastian", "Layne Price.....http://dblp.org/pers/hd/p/Price:Layne", "Shirley Ho.....http://dblp.org/pers/hd/h/Ho:Shirley", "Jeff G. Schneider.....http://dblp.org/pers/hd/s/Schneider:Jeff_G=", "Barnabás Póczos.....http://dblp.org/pers/hd/p/P=oacute=czos:Barnab=aacute=s"], "pages": 10}