{"title": "Range-based Obstructed Nearest Neighbor Queries.", "fields": ["search engine indexing", "division", "range query", "polygon", "linear subspace"], "abstract": "In this paper, we study a novel variant of obstructed nearest neighbor queries, namely,  range-based obstructed nearest neighbor  (RONN) search. A natural generalization of  continuous obstructed nearest-neighbor  (CONN), an RONN query retrieves the  obstructed nearest neighbor  for every point in a specified range. To process RONN, we first propose a  CONN-Based  (CONNB) algorithm as our baseline, which reduces the RONN query into a range query and four CONN queries processed using an R-tree. To address the shortcomings of the CONNB algorithm, we then propose a new  RONN by R-tree Filtering  (RONN-RF) algorithm, which explores effective filtering, also using R-tree. Next, we propose a new index, called  O-tree , dedicated for indexing objects in the obstructed space. The novelty of O-tree lies in the idea of  dividing the obstructed space into non-obstructed subspaces , aiming to efficiently retrieve highly qualified candidates for RONN processing. We develop an O-tree construction algorithm and propose a space division scheme, called  optimal obstacle balance  (OOB) scheme, to address the tree balance problem. Accordingly, we propose an efficient algorithm, called  RONN by O-tree Acceleration  (RONN-OA), which exploits O-tree to accelerate query processing of RONN. In addition, we extend O-tree for indexing polygons. At last, we conduct a comprehensive performance evaluation using both real and synthetic datasets to validate our ideas and the proposed algorithms. The experimental result shows that the RONN-OA algorithm outperforms the two R-tree based algorithms significantly. Moreover, we show that the OOB scheme achieves the best tree balance in O-tree and outperforms two baseline schemes.", "citation": "Citations (3)", "year": "2016", "departments": ["Northeastern University", "Northeastern University", "Northeastern University", "Pennsylvania State University"], "conf": "sigmod", "authors": ["Huaijie Zhu.....http://dblp.org/pers/hd/z/Zhu:Huaijie", "Xiaochun Yang.....http://dblp.org/pers/hd/y/Yang_0001:Xiaochun", "Bin Wang.....http://dblp.org/pers/hd/w/Wang_0015:Bin", "Wang-Chien Lee.....http://dblp.org/pers/hd/l/Lee:Wang=Chien"], "pages": 16}