{"title": "Adaptive information density for augmented reality displays.", "fields": ["hierarchy", "hierarchical clustering", "augmented reality", "clutter", "data visualization"], "abstract": "Augmented Reality (AR) browsers show geo-referenced data in the current view of a user. When the amount of data grows too large, the display quickly becomes cluttered. Clustering items by spatial and semantic attributes can temporarily alleviate the issue, but is not effective against an increasing amount of data. We present an adaptive information density display for AR that balances the amount of presented information against the potential clutter created by placing items on the screen. We use hierarchical clustering to create a level-of-detail structure, in which nodes closer to the root encompass groups of items, while the leaf nodes contain single items. Our method selects items and groups from different levels of this hierarchy based on user-defined preferences and on the amount of visual clutter caused by placing these items. The number of presented items is adapted during user interaction to avoid clutter. We compare our interface to a conventional AR browser interface in a qualitative user study. Users clearly preferred our interface, because it provided a better overview of the data and allowed for easier comparison. In a second study, we evaluated the effect of different degrees of clustering on search and recall tasks. Users generally made fewer errors, when using our interface for a search task, which indicates that the reduced clutter allowed them to stay focused on finding the relevant items.", "citation": "Citations (3)", "departments": ["University of Salzburg", "University of Padua", "Graz University of Technology", "University of Helsinki", "University of Padua"], "authors": ["Markus Tatzgern.....http://dblp.org/pers/hd/t/Tatzgern:Markus", "Valeria Orso.....http://dblp.org/pers/hd/o/Orso:Valeria", "Denis Kalkofen.....http://dblp.org/pers/hd/k/Kalkofen:Denis", "Giulio Jacucci.....http://dblp.org/pers/hd/j/Jacucci:Giulio", "Luciano Gamberini.....http://dblp.org/pers/hd/g/Gamberini:Luciano", "Dieter Schmalstieg.....http://dblp.org/pers/hd/s/Schmalstieg:Dieter"], "conf": "vr", "year": "2016", "pages": 10}