{"title": "Dataplane Specialization for High-performance OpenFlow Software Switching.", "fields": ["packet processing", "openflow", "fast path", "cache", "machine code"], "abstract": "OpenFlow is an amazingly expressive dataplane programming language, but this expressiveness comes at a severe performance price as switches must do excessive packet classification in the fast path. The prevalent OpenFlow software switch architecture is therefore built on flow caching, but this imposes intricate limitations on the workloads that can be supported efficiently and may even open the door to malicious cache overflow attacks. In this paper we argue that instead of enforcing the same universal flow cache semantics to all OpenFlow applications and optimize for the common case, a switch should rather automatically specialize its dataplane piecemeal with respect to the configured workload. We introduce ESwitch, a novel switch architecture that uses on-the-fly template-based code generation to compile any OpenFlow pipeline into efficient machine code, which can then be readily used as fast path. We present a proof-of-concept prototype and we demonstrate on illustrative use cases that ESwitch yields a simpler architecture, superior packet processing speed, improved latency and CPU scalability, and predictable performance. Our prototype can easily scale beyond 100 Gbps on a single Intel blade even with complex OpenFlow pipelines.", "citation": "Citations (5)", "departments": ["Ericsson", "Ericsson", "Ericsson", "Ericsson", "Budapest University of Technology and Economics"], "authors": ["László Molnár.....http://dblp.org/pers/hd/m/Moln=aacute=r:L=aacute=szl=oacute=", "Gergely Pongrácz.....http://dblp.org/pers/hd/p/Pongr=aacute=cz:Gergely", "Gábor Enyedi.....http://dblp.org/pers/hd/e/Enyedi:G=aacute=bor", "Zoltán Lajos Kis.....http://dblp.org/pers/hd/k/Kis:Zolt=aacute=n_Lajos", "Levente Csikor.....http://dblp.org/pers/hd/c/Csikor:Levente", "Ferenc Juhász.....http://dblp.org/pers/hd/j/Juh=aacute=sz:Ferenc", "Attila Korösi.....http://dblp.org/pers/hd/k/Kor=ouml=si:Attila", "Gábor Rétvári.....http://dblp.org/pers/hd/r/R=eacute=tv=aacute=ri:G=aacute=bor"], "conf": "sigcomm", "year": "2016", "pages": 14}