{"title": "On main-memory flushing in microblogs data management systems.", "fields": ["search engine indexing", "fold", "exploit", "microblogging", "social media"], "abstract": "Searching microblogs, e.g., tweets and comments, is practically supported through main-memory indexing for scalable data digestion and efficient query evaluation. With continuity and excessive numbers of microblogs, it is infeasible to keep data in main-memory for long periods. Thus, once allocated memory budget is filled, a portion of data is flushed from memory to disk to continuously accommodate newly incoming data. Existing techniques come with either low memory hit ratio due to flushing items regardless of their relevance to incoming queries or significant overhead of tracking individual data items, which limit scalability of microblogs systems in either cases. In this paper, we propose kFlushing policy that exploits popularity of top-k queries in microblogs to smartly select a subset of microblogs to flush. kFlushing is mainly designed to increase memory hit ratio. To this end, it identifies and flushes in-memory data that does not contribute to incoming queries. The freed memory space is utilized to accumulate more useful data that is used to answer more queries from memory contents. When all memory is utilized for useful data, kFlushing flushes data that is less likely to degrade memory hit ratio. In addition, kFlushing comes with a little overhead that keeps high system scalability in terms of high digestion rates of incoming fast data. Extensive experimental evaluation shows the effectiveness and scalability of kFlushing to improve main-memory hit by 26–330% while coping up with fast microblog streams of up to 100K microblog/second.", "citation": "Citations (3)", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota"], "authors": ["Amr Magdy.....http://dblp.org/pers/hd/m/Magdy_0001:Amr", "Rami Alghamdi.....http://dblp.org/pers/hd/a/Alghamdi:Rami", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F="], "conf": "icde", "year": "2016", "pages": 12}