{"title": "Continuous Influence Maximization: What Discounts Should We Offer to Social Network Users?", "fields": ["empirical research", "coordinate descent", "maximization", "social network", "new product development"], "abstract": "Imagine we are introducing a new product through a social network, where we know for each user in the network the purchase probability curve with respect to discount. Then, what discount should we offer to those social network users so that the adoption of the product is maximized in expectation under a predefined budget? Although influence maximization has been extensively explored, surprisingly, this appealing practical problem still cannot be answered by the existing influence maximization methods. In this paper, we tackle the problem systematically. We formulate the general continuous influence maximization problem, investigate the essential properties, and develop a general coordinate descent algorithm as well as the engineering techniques for practical implementation. Our investigation does not assume any specific influence model and thus is general and principled. At the same time, using the most popularly adopted independent influence model as a concrete example, we demonstrate that more efficient methods are feasible under specific influence models. Our extensive empirical study on four benchmark real world networks with synthesized purchase probability curves clearly illustrates that continuous influence maximization can improve influence spread significantly with very moderate extra running time comparing to the classical influence maximization methods.", "citation": "Citations (18)", "year": "2016", "departments": ["Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Zhejiang University"], "conf": "sigmod", "authors": ["Yu Yang.....http://dblp.org/pers/hd/y/Yang:Yu", "Xiangbo Mao.....http://dblp.org/pers/hd/m/Mao:Xiangbo", "Jian Pei.....http://dblp.org/pers/hd/p/Pei:Jian", "Xiaofei He.....http://dblp.org/pers/hd/h/He:Xiaofei"], "pages": 15}