{"title": "Cross-layer betweenness centrality in multiplex networks with applications.", "fields": ["evolving networks", "phenomenon", "betweenness centrality", "traverse", "network science"], "abstract": "Several real-life social systems witness the presence of multiple interaction types (or layers) among the entities, thus establishing a collection of co-evolving networks, known as multiplex networks. More recently, there has been a significant interest in developing certain centrality measures in multiplex networks to understand the influential power of the entities (to be referred as vertices or nodes hereafter). In this paper, we consider the problem of studying how frequently the nodes occur on the shortest paths between other nodes in the multiplex networks. As opposed to simplex networks, the shortest paths between nodes can possibly traverse through multiple layers in multiplex networks. Motivated by this phenomenon, we propose a new metric to address the above problem and we call this new metric cross-layer betweenness centrality (CBC). Our definition of CBC measure takes into account the interplay among multiple layers in determining the shortest paths in multiplex networks. We propose an efficient algorithm to compute CBC and show that it runs much faster than the naive computation of this measure. We show the efficacy of the proposed algorithm using thorough experimentation on two real-world multiplex networks. We further demonstrate the practical utility of CBC by applying it in the following three application contexts: discovering non-overlapping community structure in multiplex networks, identifying interdisciplinary researchers from a multiplex co-authorship network, and the initiator selection for message spreading. In all these application scenarios, the respective solution methods based on the proposed CBC are found to be significantly better performing than that of the corresponding benchmark approaches.", "citation": "Citations (2)", "departments": ["Indian Institute of Technology Kharagpur", "IBM"], "authors": ["Tanmoy Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty_0002:Tanmoy", "Ramasuri Narayanam.....http://dblp.org/pers/hd/n/Narayanam:Ramasuri"], "conf": "icde", "year": "2016", "pages": 12}