{"title": "Optimizing coflow completion times with utility max-min fairness.", "fields": ["max min fairness", "spark", "lexicographical order", "maximization", "flow network"], "abstract": "In data parallel frameworks such as MapReduce and Spark, a coflow represents a set of network flows used to transfer intermediate data between successive computation stages for a job. The completion time of a job is then determined by the collective behavior of such a coflow, rather than any individual flow within, and influenced by the amount of network bandwidth allocated to it. Different jobs in a shared cluster have different degrees of sensitivity to their completion times, modeled by their respective utility functions. In this paper, we focus on the design and implementation of a new utility optimal scheduler across competing coflows, in order to provide differential treatment to coflows with different degrees of sensitivity, yet still satisfying max-min fairness across these coflows. Though this objective can be formulated as a lexicographical maximization problem, it is challenging to solve in practice due to its inherent multi-objective and discrete nature. To address this challenge, we first divide the problem into iterative steps of single-objective subproblems; and in each of these steps, we then perform a series of transformations to obtain an equivalent linear programming (LP) problem, which can be efficiently solved in practice. To demonstrate that our solutions are practically feasible, we have implemented it as a real-world coflow scheduler based on the Varys open-source framework to evaluate its effectiveness.", "citation": "Citations (5)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto", "Hong Kong University of Science and Technology"], "authors": ["Li Chen.....http://dblp.org/pers/hd/c/Chen_0019:Li", "Wei Cui.....http://dblp.org/pers/hd/c/Cui:Wei", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2016", "pages": 9}