{"title": "Learning Deep Intrinsic Video Representation by Exploring Temporal Coherence and Graph Structure.", "fields": ["intrinsic value", "coherence", "motion compensation", "convolutional neural network", "video tracking"], "abstract": "Learning video representation is not a trivial task, as video is an information-intensive media where each frame does not exist independently. Locally, a video frame is visually and semantically similar with its adjacent frames. Holistically, a video has its inherent structure--the correlations among video frames. For example, even the frames far from each other may also hold similar semantics. Such context information is therefore important to characterize the intrinsic representation of a video frame. In this paper, we present a novel approach to learn the deep video representation by exploring both local and holistic contexts. Specifically, we propose a triplet sampling mechanism to encode the local temporal relationship of adjacent frames based on their deep representations. In addition, we incorporate the graph structure of the video, as a priori, to holistically preserve the inherent correlations among video frames. Our approach is fully unsupervised and trained in an end-to-end deep convolutional neural network architecture. By extensive experiments, we show that our learned representation can significantly boost several video recognition tasks (retrieval, classification, and highlight detection) over traditional video representations.", "citation": "Citations (9)", "year": "2016", "departments": ["University of Science and Technology of China", "Sun Yat-sen University", "Microsoft", "Microsoft", "University of Science and Technology of China"], "conf": "ijcai", "authors": ["Yingwei Pan.....http://dblp.org/pers/hd/p/Pan:Yingwei", "Yehao Li.....http://dblp.org/pers/hd/l/Li:Yehao", "Ting Yao.....http://dblp.org/pers/hd/y/Yao:Ting", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Houqiang Li.....http://dblp.org/pers/hd/l/Li:Houqiang", "Yong Rui.....http://dblp.org/pers/hd/r/Rui:Yong"], "pages": 7}