{"title": "Using a virtual environment to study the impact of sending traffic alerts to texting pedestrians.", "fields": ["immersion", "virtual machine", "information and communications technology", "computer security", "simulation"], "abstract": "This paper presents an experiment conducted in a large-screen immersive virtual environment to evaluate how texting pedestrians respond to permissive traffic alerts delivered via their cell phone. We developed a cell phone app that delivered information to texting pedestrians about when traffic conditions permit safe crossing. We compared gap selection and movement timing in three groups of pedestrians: texting, texting with alerts, and no texting (control). Participants in the control and alert groups chose larger gaps and were more discriminating in their gap choices than participants in the texting group. Both the control and alert groups had more time to spare than the texting group when they exited the roadway even though the alert group timed their entry relative to the lead car less tightly than the control and texting groups. By choosing larger gaps, participants in the alert group were able to compensate for their poorer timing of entry, resulting in a margin of safety that did not differ from those who were not texting. However, they also relied heavily on the alert system and paid less attention to the roadway. The discussion focuses on the potential of assistive technologies based on Vehicle-to-Pedestrian (V2P) communications technology for mitigating pedestrian-motor vehicle crashes.", "citation": "Citations (4)", "departments": ["University of Iowa", "University of Iowa", "University of Iowa", "University of Iowa", "University of Iowa"], "authors": ["Pooya Rahimian.....http://dblp.org/pers/hd/r/Rahimian:Pooya", "Elizabeth E. O'Neal.....http://dblp.org/pers/hd/o/O=Neal:Elizabeth_E=", "Junghum Paul Yon.....http://dblp.org/pers/hd/y/Yon:Junghum_Paul", "Luke Franzen.....http://dblp.org/pers/hd/f/Franzen:Luke", "Yuanyuan Jiang.....http://dblp.org/pers/hd/j/Jiang:Yuanyuan", "Jodie M. Plumert.....http://dblp.org/pers/hd/p/Plumert:Jodie_M=", "Joseph K. Kearney.....http://dblp.org/pers/hd/k/Kearney:Joseph_K="], "conf": "vr", "year": "2016", "pages": 9}