{"title": "The CloudMdsQL Multistore System.", "fields": ["rdf query language", "query by example", "web query classification", "sargable", "view"], "abstract": "The blooming of different cloud data management infrastructures has turned multistore systems to a major topic in the nowadays cloud landscape. In this demonstration, we present a Cloud Multidatastore Query Language (CloudMdsQL), and its query engine. CloudMdsQL is a functional SQL-like language, capable of querying multiple heterogeneous data stores (relational and NoSQL) within a single query that may contain embedded invocations to each data store's native query interface. The major innovation is that a CloudMdsQL query can exploit the full power of local data stores, by simply allowing some local data store native queries (e.g. a breadth-first search query against a graph database) to be called as functions, and at the same time be optimized. Within our demonstration, we focus on two use cases each involving four diverse data stores (graph, document, relational, and key-value) with its corresponding CloudMdsQL queries. The query execution flows are visualized by an embedded real-time monitoring subsystem. The users can also try out different ad-hoc queries, not necessarily in the context of the use cases.", "citation": "Citations (6)", "year": "2016", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "LeanXcale and U ... , Madrid, Spain", "Sparsity Techno ... arcelona, Spain"], "conf": "sigmod", "authors": ["Boyan Kolev.....http://dblp.org/pers/hd/k/Kolev:Boyan", "Carlyna Bondiombouy.....http://dblp.org/pers/hd/b/Bondiombouy:Carlyna", "Patrick Valduriez.....http://dblp.org/pers/hd/v/Valduriez:Patrick", "Ricardo Jiménez-Peris.....http://dblp.org/pers/hd/j/Jim=eacute=nez=Peris:Ricardo", "Raquel Pau.....http://dblp.org/pers/hd/p/Pau:Raquel", "José Pereira.....http://dblp.org/pers/hd/p/Pereira:Jos=eacute="], "pages": 4}