{"title": "Short-Dot: Computing Large Linear Transforms Distributedly Using Coded Short Dot Products.", "fields": ["erasure code", "probabilistic analysis of algorithms", "dot product", "exploit", "wait"], "abstract": "Faced with saturation of Moore's law and increasing size and dimension of data, system designers have increasingly resorted to parallel and distributed computing to reduce computation time of machine-learning algorithms. However, distributed computing is often bottle necked by a small fraction of slow processors called \"stragglers\" that reduce the speed of computation because the fusion node has to wait for all processors to complete their processing. To combat the effect of stragglers, recent literature proposes introducing redundancy in computations across processors, e.g., using repetition-based strategies or erasure codes. The fusion node can exploit this redundancy by completing the computation using outputs from only a subset of the processors, ignoring the stragglers. In this paper, we propose a novel technique - that we call \"Short-Dot\" - to introduce redundant computations in a coding theory inspired fashion, for computing linear transforms of long vectors. Instead of computing long dot products as required in the original linear transform, we construct a larger number of redundant and short dot products that can be computed more efficiently at individual processors. Further, only a subset of these short dot products are required at the fusion node to finish the computation successfully. We demonstrate through probabilistic analysis as well as experiments on computing clusters that Short-Dot offers significant speed-up compared to existing techniques. We also derive trade-offs between the length of the dot-products and the resilience to stragglers (number of processors required to finish), for any such strategy and compare it to that achieved by our strategy.", "citation": "Citations (66)", "departments": ["Carnegie Mellon University", "Pennsylvania State University", "Carnegie Mellon University"], "authors": ["Sanghamitra Dutta.....http://dblp.org/pers/hd/d/Dutta:Sanghamitra", "Viveck R. Cadambe.....http://dblp.org/pers/hd/c/Cadambe:Viveck_R=", "Pulkit Grover.....http://dblp.org/pers/hd/g/Grover:Pulkit"], "conf": "nips", "year": "2016", "pages": 9}