{"title": "Limiting the Impact of Stealthy Attacks on Industrial Control Systems.", "fields": ["cyber physical system", "robust random early detection", "intrusion detection system", "industrial control system", "limiting"], "abstract": "While attacks on information systems have for most practical purposes binary outcomes (information was manipulated/eavesdropped, or not), attacks manipulating the sensor or control signals of Industrial Control Systems (ICS) can be tuned by the attacker to cause a continuous spectrum in damages. Attackers that want to remain undetected can attempt to hide their manipulation of the system by following closely the expected behavior of the system, while injecting just enough false information at each time step to achieve their goals. In this work, we study if attack-detection can limit the impact of such stealthy attacks. We start with a comprehensive review of related work on attack detection schemes in the security and control systems community. We then show that many of those works use detection schemes that are not limiting the impact of stealthy attacks. We propose a new metric to measure the impact of stealthy attacks and how they relate to our selection on an upper bound on false alarms. We finally show that the impact of such attacks can be mitigated in several cases by the proper combination and configuration of detection schemes. We demonstrate the effectiveness of our algorithms through simulations and experiments using real ICS testbeds and real ICS systems.", "citation": "Citations (69)", "year": "2016", "departments": ["University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "Singapore University of Technology and Design", "University of Texas at Dallas"], "conf": "ccs", "authors": ["David I. Urbina.....http://dblp.org/pers/hd/u/Urbina:David_I=", "Jairo Alonso Giraldo.....http://dblp.org/pers/hd/g/Giraldo:Jairo_Alonso", "Alvaro A. Cárdenas.....http://dblp.org/pers/hd/c/C=aacute=rdenas:Alvaro_A=", "Nils Ole Tippenhauer.....http://dblp.org/pers/hd/t/Tippenhauer:Nils_Ole", "Junia Valente.....http://dblp.org/pers/hd/v/Valente:Junia", "Mustafa Amir Faisal.....http://dblp.org/pers/hd/f/Faisal:Mustafa_Amir", "Justin Ruths.....http://dblp.org/pers/hd/r/Ruths:Justin", "Richard Candell.....http://dblp.org/pers/hd/c/Candell:Richard", "Henrik Sandberg.....http://dblp.org/pers/hd/s/Sandberg:Henrik"], "pages": 14}