{"title": "When group-buying meets cloud computing.", "fields": ["cloud computing security", "cloud computing", "group buying", "cost reduction", "solution concept"], "abstract": "As a major driving force for adopting cloud computing, continuous cost reduction has been constantly pursued by cloud users. For a group of users with heterogeneous cloud resource demands, it may be possible for them to buy resources in a collaborative way in order to save the purchase cost, which is known as group-buying in business. While group-buying can benefit cloud users in principle, the question is how to design an implementation scheme to support group-buying on the cloud market. In this paper, we address the question by studying a coalition formation game, aiming to design a way under which the users can form stable coalitions for group-buying. It turns out that group-buying on the cloud market is challenging in that most popular solution concepts may fail to constitute stable coalitions. In order to sustain group-buying for cloud services, we propose a new solution concept, contractually group stable, which is an extension of an existing concept in the literature. We show that this new solution concept can guarantee the existence of stable coalitions, making group-buying always possible on the cloud market. We also develop computing algorithms for solving the coalition formation game under our concept. Computational experiments show that our concept can bring in substantial cost reduction for cloud users.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Huawei", "City University of Hong Kong", "Shanghai University of Electric Power", "Shanghai Jiao Tong University"], "authors": ["Juntao Wang.....http://dblp.org/pers/hd/w/Wang:Juntao", "Xun Xiao.....http://dblp.org/pers/hd/x/Xiao:Xun", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Kejie Lu.....http://dblp.org/pers/hd/l/Lu:Kejie", "Xiaotie Deng.....http://dblp.org/pers/hd/d/Deng:Xiaotie", "Ashwin Gumaste.....http://dblp.org/pers/hd/g/Gumaste:Ashwin"], "conf": "infocom", "year": "2016", "pages": 9}