{"title": "An Online Sequence-to-Sequence Model Using Partial Conditioning.", "fields": ["backpropagation", "transducer", "symbol", "conditioning", "encoder"], "abstract": "Sequence-to-sequence models have achieved impressive results on various tasks. However, they are unsuitable for tasks that require incremental predictions to be made as more data arrives or tasks that have long input sequences and output sequences. This is because they generate an output sequence conditioned on an entire input sequence. In this paper, we present a Neural Transducer that can make incremental predictions as more input arrives, without redoing the entire computation. Unlike sequence-to-sequence models, the Neural Transducer computes the next-step distribution conditioned on the partially observed input sequence and the partially generated sequence. At each time step, the transducer can decide to emit zero to many output symbols. The data can be processed using an encoder and presented as input to the transducer. The discrete decision to emit a symbol at every time step makes it difficult to learn with conventional backpropagation. It is however possible to train the transducer by using a dynamic programming algorithm to generate target discrete decisions. Our experiments show that the Neural Transducer works well in settings where it is required to produce output predictions as data come in. We also find that the Neural Transducer performs well for long sequences even when attention mechanisms are not used.", "citation": "Citations (12)", "departments": ["Google", "Google", "University of California, Berkeley", "Google", "Stanford University"], "authors": ["Navdeep Jaitly.....http://dblp.org/pers/hd/j/Jaitly:Navdeep", "Quoc V. Le.....http://dblp.org/pers/hd/l/Le:Quoc_V=", "Oriol Vinyals.....http://dblp.org/pers/hd/v/Vinyals:Oriol", "Ilya Sutskever.....http://dblp.org/pers/hd/s/Sutskever:Ilya", "David Sussillo.....http://dblp.org/pers/hd/s/Sussillo:David", "Samy Bengio.....http://dblp.org/pers/hd/b/Bengio:Samy"], "conf": "nips", "year": "2016", "pages": 9}