{"title": "Blending on-demand and spot instances to lower costs for in-memory storage.", "fields": ["response time", "exploit", "lease", "workload", "boss"], "abstract": "In cloud computing, workloads that lease instances on demand get to execute exclusively for a set time. In contrast, workloads that lease spot instances execute until a competing workload outbids the current lease. Spot instances cost less than on-demand instances, but few workloads can use spot instances because of the variable leasing period. We present BOSS, a framework that uses spot instances to reduce costs for in-memory storage workloads. BOSS uses on-demand instances to create and update objects. It uses spot instances to handle read-only queries. BOSS leases instances from multiple sites and exploits varying prices between the sites. When spot instances stop abruptly at one site, BOSS places newly created objects at other sites, reducing the impact on response time. BOSS proposes a novel, online replication approach (1) avoids placing data at too many sites and (2) provides O(1.5)-competitive ratio under skewed cost distributions. Within a site, BOSS manages the tradeoff between savings and risks from replicating to spot instances. We implemented BOSS on top of Cassandra and deployed it on up to 78 instances across 8 sites in Amazon and Google clouds. With BOSS hosting TPC-W data, we spent $8 per hour on Amazon. For the same service, we spent $55 per hour to use ElastiCache and $49 per hour to use on-demand instances only. BOSS saved 85% and 84% respectively. Further, BOSS achieved 95th percentile response time within 13% of ElastiCache.", "citation": "Citations (14)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Zichen Xu.....http://dblp.org/pers/hd/x/Xu:Zichen", "Christopher Stewart.....http://dblp.org/pers/hd/s/Stewart:Christopher", "Nan Deng.....http://dblp.org/pers/hd/d/Deng:Nan", "Xiaorui Wang.....http://dblp.org/pers/hd/w/Wang:Xiaorui"], "conf": "infocom", "year": "2016", "pages": 9}