{"title": "Spatially Regularized Streaming Sensor Selection.", "fields": ["forgetting", "selection algorithm", "streams", "key distribution in wireless sensor networks", "data redundancy"], "abstract": "Sensor selection has become an active topic aimed at energy saving, information overload prevention, and communication cost planning in sensor networks. In many real applications, often the sensors' observation regions have overlaps and thus the sensor network is inherently redundant. Therefore it is important to select proper sensors to avoid data redundancy. This paper focuses on how to incrementally select a subset of sensors in a streaming scenario to minimize information redundancy, and meanwhile meet the power consumption constraint. We propose to perform sensor selection in a multi-variate interpolation framework, such that the data sampled by the selected sensors can well predict those of the inactive sensors. Importantly, we incorporate sensors' spatial information as two regularizers, which leads to significantly better prediction performance. We also define a statistical variable to store sufficient information for incremental learning, and introduce a forgetting factor to track sensor streams' evolvement. Experiments on both synthetic and real datasets validate the effectiveness of the proposed method. Moreover, our method is over 10 times faster than the state-of-the-art sensor selection algorithm.", "citation": "Not cited", "departments": ["IBM", "Stanford University", "IBM", "East China Normal University", "East China Normal University"], "authors": ["Changsheng Li.....http://dblp.org/pers/hd/l/Li:Changsheng", "Fan Wei.....http://dblp.org/pers/hd/w/Wei:Fan", "Weishan Dong.....http://dblp.org/pers/hd/d/Dong:Weishan", "Xiangfeng Wang.....http://dblp.org/pers/hd/w/Wang:Xiangfeng", "Junchi Yan.....http://dblp.org/pers/hd/y/Yan:Junchi", "Xiaobin Zhu.....http://dblp.org/pers/hd/z/Zhu:Xiaobin", "Qingshan Liu.....http://dblp.org/pers/hd/l/Liu_0001:Qingshan", "Xin Zhang.....http://dblp.org/pers/hd/z/Zhang:Xin"], "conf": "aaai", "year": "2016", "pages": 9}