{"title": "Assignment Techniques for Crowdsourcing Sensitive Tasks.", "fields": ["crowdsourcing", "information sensitivity", "collusion", "private information retrieval", "digitization"], "abstract": "Protecting the privacy of crowd workers has been an important topic in crowdsourcing, however, task privacy has largely been ignored despite the fact that many tasks, e.g., form digitization, live audio transcription or image tagging often contain sensitive information. Although assigning an entire job to a worker may leak private information, jobs can often be split into small components that individually do not. We study the problem of distributing such tasks to workers with the goal of maximizing task privacy using such an approach.   We introduce information loss functions to formally measure the amount of private information leaked as a function of the task assignment. We then design assignment mechanisms for three different assignment settings: PUSH, PULL and a new setting Tug Of War (TOW), which is an intermediate approach that balances flexibility for both workers and requesters. Our assignment algorithms have zero privacy loss for PUSH, and tight theoretical guarantees for PULL. For TOW, our assignment algorithm provably outperforms PULL; importantly the privacy loss is independent of the number of tasks, even when workers collude. We further analyze the performance and privacy tradeoffs empirically on simulated and real-world collusion networks and find that our algorithms outperform the theoretical guarantees.", "citation": "Citations (5)", "departments": ["École Polytechnique Fédérale de Lausanne", "Indian Institute of Technology Delhi", "Indian Institute of Technology Delhi", "Xerox"], "authors": ["L. Elisa Celis.....http://dblp.org/pers/hd/c/Celis:L=_Elisa", "Sai Praneeth Reddy.....http://dblp.org/pers/hd/r/Reddy:Sai_Praneeth", "Ishaan Preet Singh.....http://dblp.org/pers/hd/s/Singh:Ishaan_Preet", "Shailesh Vaya.....http://dblp.org/pers/hd/v/Vaya:Shailesh"], "conf": "cscw", "year": "2016", "pages": 12}