{"title": "An efficient and scalable algorithmic method for generating large: scale random graphs.", "fields": ["cost efficiency", "degree distribution", "stochastic block model", "sequential algorithm", "analysis of parallel algorithms"], "abstract": "Many real-world systems and networks are modeled and analyzed using various random graph models. These models must incorporate relevant properties such as degree distribution and clustering coefficient. Many models, such as the Chung-Lu (CL), stochastic Kronecker, stochastic block model (SBM), and block two-level Erdős-Renyi (BTER) models have been devised to capture those properties. However, the generative algorithms for these models are mostly sequential and take prohibitively long time to generate large-scale graphs. In this paper, we present a novel time and space efficient algorithmic method to generate random graphs using CL, BTER, and SBM models. First, we present an efficient sequential algorithm and an efficient distributed-memory parallel algorithm for the CL model. Our sequential algorithm takes  O ( m ) time and  O (Λ) space, where  m  and Λ are the number of edges and distinct degrees, and our parallel algorithm takes  O ( m/P  + Λ +  P ) time w.h.p. and  O (Λ) space using  P  processors. These algorithms are almost time optimal since any sequential and parallel algorithms need at least Ω( m ) and Ω( m/P ) time, respectively. Our algorithms outperform the best known previous algorithms by a significant margin in terms of both time and space. Experimental results on various large-scale networks show that both of our sequential and parallel algorithms require 400-15000 times less memory than the existing sequential and parallel algorithms, respectively, making our algorithms suitable for generating very large-scale networks. Moreover, both of our algorithms are about 3-4 times faster than the existing sequential and parallel algorithms. Finally, we show how our algorithmic method also leads to efficient parallel and sequential algorithms for the SBM and BTER models.", "citation": "Citations (2)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech"], "authors": ["Md. Maksudul Alam.....http://dblp.org/pers/hd/a/Alam:Md=_Maksudul", "Maleq Khan.....http://dblp.org/pers/hd/k/Khan:Maleq", "Anil Vullikanti.....http://dblp.org/pers/hd/v/Vullikanti:Anil", "Madhav V. Marathe.....http://dblp.org/pers/hd/m/Marathe:Madhav_V="], "conf": "sc", "year": "2016", "pages": 12}