{"title": "Server-side log data analytics for I/O workload characterization and coordination on large shared storage systems.", "fields": ["workload", "search engine", "input output", "pci express", "supercomputer", "data analysis", "server side", "job scheduler", "batch processing"], "abstract": "Inter-application I/O contention and performance interference have been recognized as severe problems. In this work, we demonstrate, through measurement from Titan (world's No. 3 supercomputer), that high I/O variance co-exists with the fact that individual storage units remain under-utilized for the majority of the time. This motivates us to propose AID, a system that performs automatic application I/O characterization and I/O-aware job scheduling. AID analyzes  existing  I/O traffic and batch job history logs, without any prior knowledge on applications or user/developer involvement. It identifies the small set of I/O-intensive candidates among all applications running on a supercomputer and subsequently mines their I/O patterns, using more detailed per-I/O-node traffic logs. Based on such auto-extracted information, AID provides online I/O-aware scheduling recommendations to steer I/O-intensive applications away from heavy ongoing I/O activities.   We evaluate AID on Titan, using both real applications (with extracted I/O patterns validated by contacting users) and our own pseudo-applications. Our results confirm that AID is able to (1) identify I/O-intensive applications and their detailed I/O characteristics, and (2) significantly reduce these applications' I/O performance degradation/variance by jointly evaluating outstanding applications' I/O pattern and real-time system I/O load.", "citation": "Citations (6)", "departments": ["North Carolina State University", "Oak Ridge National Laboratory", "Khalifa University", "Oak Ridge National Laboratory"], "authors": ["Yang Liu.....http://dblp.org/pers/hd/l/Liu:Yang", "Raghul Gunasekaran.....http://dblp.org/pers/hd/g/Gunasekaran:Raghul", "Xiaosong Ma.....http://dblp.org/pers/hd/m/Ma:Xiaosong", "Sudharshan S. Vazhkudai.....http://dblp.org/pers/hd/v/Vazhkudai:Sudharshan_S="], "conf": "sc", "year": "2016", "pages": 11}