{"title": "Incremental Consistency Guarantees for Replicated Objects.", "fields": ["ad serving", "eventual consistency", "distributed data store", "ticket", "stack"], "abstract": "Programming with replicated objects is difficult. Developers must face the fundamental trade-off between consistency and performance head on, while struggling with the complexity of distributed storage stacks. We introduce Correctables, a novel abstraction that hides most of this complexity, allowing developers to focus on the task of balancing consistency and performance. To aid developers with this task, Correctables provide incremental consistency guarantees, which capture successive refinements on the result of an ongoing operation on a replicated object. In short, applications receive both a preliminary--fast, possibly inconsistent--result, as well as a final--consistent--result that arrives later.\n\nWe show how to leverage incremental consistency guarantees by speculating on preliminary values, trading throughput and bandwidth for improved latency. We experiment with two popular storage systems (Cassandra and ZooKeeper) and three applications: a Twissandra-based microblogging service, an ad serving system, and a ticket selling system. Our evaluation on the Amazon EC2 platform with YCSB workloads A, B, and C shows that we can reduce the latency of strongly consistent operations by up to 40% (from 100ms to 60ms) at little cost (10% bandwidth increase, 6% throughput drop) in the ad system. Even if the preliminary result is frequently inconsistent (25% of accesses), incremental consistency incurs a bandwidth overhead of only 27%.", "citation": "Citations (4)", "year": "2016", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "conf": "osdi", "authors": ["Rachid Guerraoui.....http://dblp.org/pers/hd/g/Guerraoui:Rachid", "Matej Pavlovic.....http://dblp.org/pers/hd/p/Pavlovic:Matej", "Dragos-Adrian Seredinschi.....http://dblp.org/pers/hd/s/Seredinschi:Dragos=Adrian"], "pages": 16}