{"title": "Learning-Based Cleansing for Indoor RFID Data.", "fields": ["data cleansing", "tracking system", "ground truth", "software deployment", "video tracking"], "abstract": "RFID is widely used for object tracking in indoor environments, e.g., airport baggage tracking. Analyzing RFID data offers insight into the underlying tracking systems as well as the associated business processes. However, the inherent uncertainty in RFID data, including noise (cross readings) and incompleteness (missing readings), pose challenges to high-level RFID data querying and analysis. In this paper, we address these challenges by proposing a learning-based data cleansing approach that, unlike existing approaches, requires no detailed prior knowledge about the spatio-temporal properties of the indoor space and the RFID reader deployment. Requiring only minimal information about RFID deployment, the approach learns relevant knowledge from raw RFID data and uses it to cleanse the data. In particular, we model raw RFID readings as time series that are sparse because the indoor space is only partly covered by a limited number of RFID readers.   We propose the Indoor RFID Multi-variate Hidden Markov Model (IR-MHMM) to capture the uncertainties of indoor RFID data as well as the correlation of moving object locations and object RFID readings. We propose three state space design methods for IR-MHMM that enable the learning of parameters while contending with raw RFID data time series. We solely use raw uncleansed RFID data for the learning of model parameters, requiring no special labeled data or ground truth. The resulting IR-MHMM based RFID data cleansing approach is able to recover missing readings and reduce cross readings with high effectiveness and efficiency, as demonstrated by extensive experimental studies with both synthetic and real data. Given enough indoor RFID data for learning, the proposed approach achieves a data cleansing accuracy comparable to or even better than state-of-the-art techniques requiring very detailed prior knowledge, making our solution superior in terms of both effectiveness and employability.", "citation": "Citations (4)", "year": "2016", "departments": ["Aalborg University", "Aalborg University", "Aalborg University", "Aalborg University", "Auburn University"], "conf": "sigmod", "authors": ["Asif Iqbal Baba.....http://dblp.org/pers/hd/b/Baba:Asif_Iqbal", "Manfred Jaeger.....http://dblp.org/pers/hd/j/Jaeger:Manfred", "Hua Lu.....http://dblp.org/pers/hd/l/Lu_0001:Hua", "Torben Bach Pedersen.....http://dblp.org/pers/hd/p/Pedersen:Torben_Bach", "Wei-Shinn Ku.....http://dblp.org/pers/hd/k/Ku:Wei=Shinn", "Xike Xie.....http://dblp.org/pers/hd/x/Xie:Xike"], "pages": 12}