{"title": "Prefetch Side-Channel Attacks: Bypassing SMAP and Kernel ASLR.", "fields": ["user space", "instruction prefetch", "timing attack", "x86", "side channel attack"], "abstract": "Modern operating systems use hardware support to protect against control-flow hijacking attacks such as code-injection attacks. Typically, write access to executable pages is prevented and kernel mode execution is restricted to kernel code pages only. However, current CPUs provide no protection against code-reuse attacks like ROP. ASLR is used to prevent these attacks by making all addresses unpredictable for an attacker. Hence, the kernel security relies fundamentally on preventing access to address information. We introduce Prefetch Side-Channel Attacks, a new class of generic attacks exploiting major weaknesses in prefetch instructions. This allows unprivileged attackers to obtain address information and thus compromise the entire system by defeating SMAP, SMEP, and kernel ASLR. Prefetch can fetch inaccessible privileged memory into various caches on Intel x86. It also leaks the translation-level for virtual addresses on both Intel x86 and ARMv8-A. We build three attacks exploiting these properties. Our first attack retrieves an exact image of the full paging hierarchy of a process, defeating both user space and kernel space ASLR. Our second attack resolves virtual to physical addresses to bypass SMAP on 64-bit Linux systems, enabling ret2dir attacks. We demonstrate this from unprivileged user programs on Linux and inside Amazon EC2 virtual machines. Finally, we demonstrate how to defeat kernel ASLR on Windows 10, enabling ROP attacks on kernel and driver binary code. We propose a new form of strong kernel isolation to protect commodity systems incuring an overhead of only 0.06-5.09%.", "citation": "Citations (22)", "year": "2016", "departments": ["Graz University of Technology", "Graz University of Technology", "Graz University of Technology", "Graz University of Technology", "G DATA Advanced ... Bochum, Germany"], "conf": "ccs", "authors": ["Daniel Gruss.....http://dblp.org/pers/hd/g/Gruss:Daniel", "Clémentine Maurice.....http://dblp.org/pers/hd/m/Maurice:Cl=eacute=mentine", "Anders Fogh.....http://dblp.org/pers/hd/f/Fogh:Anders", "Moritz Lipp.....http://dblp.org/pers/hd/l/Lipp:Moritz", "Stefan Mangard.....http://dblp.org/pers/hd/m/Mangard:Stefan"], "pages": 12}