{"title": "Minerva: Enabling Low-Power, Highly-Accurate Deep Neural Network Accelerators.", "fields": ["static random access memory", "architecture", "fault detection and isolation", "artificial neural network", "internet of things"], "abstract": "The continued success of Deep Neural Networks (DNNs) in classification tasks has sparked a trend of accelerating their execution with specialized hardware. While published designs easily give an order of magnitude improvement over general-purpose hardware, few look beyond an initial implementation. This paper presents Minerva, a highly automated co-design approach across the algorithm, architecture, and circuit levels to optimize DNN hardware accelerators. Compared to an established fixed-point accelerator baseline, we show that fine-grained, heterogeneous datatype optimization reduces power by 1.5×; aggressive, inline predication and pruning of small activity values further reduces power by 2.0×; and active hardware fault detection coupled with domain-aware error mitigation eliminates an additional 2.7× through lowering SRAM voltages. Across five datasets, these optimizations provide a collective average of 8.1× power reduction over an accelerator baseline without compromising DNN model accuracy. Minerva enables highly accurate, ultra-low power DNN accelerators (in the range of tens of milliwatts), making it feasible to deploy DNNs in power-constrained IoT and mobile devices.", "citation": "Citations (145)", "year": "2016", "departments": ["Harvard University", "Harvard University", "Harvard University", "Harvard University", "Harvard University"], "conf": "isca", "authors": ["Brandon Reagen.....http://dblp.org/pers/hd/r/Reagen:Brandon", "Paul N. Whatmough.....http://dblp.org/pers/hd/w/Whatmough:Paul_N=", "Robert Adolf.....http://dblp.org/pers/hd/a/Adolf:Robert", "Saketh Rama.....http://dblp.org/pers/hd/r/Rama:Saketh", "Hyunkwang Lee.....http://dblp.org/pers/hd/l/Lee:Hyunkwang", "Sae Kyu Lee.....http://dblp.org/pers/hd/l/Lee:Sae_Kyu", "José Miguel Hernández-Lobato.....http://dblp.org/pers/hd/h/Hern=aacute=ndez=Lobato:Jos=eacute=_Miguel", "Gu-Yeon Wei.....http://dblp.org/pers/hd/w/Wei:Gu=Yeon", "David M. Brooks.....http://dblp.org/pers/hd/b/Brooks:David_M="], "pages": 12}