{"title": "OpenPiton: An Open Source Manycore Research Framework.", "fields": ["manycore processor", "distributed computing", "parallel computing", "uncore", "open architecture", "conceptual framework", "opensparc", "multi core processor", "extensibility", "computer science"], "abstract": "Industry is building larger, more complex, manycore processors on the back of strong institutional knowledge, but academic projects face difficulties in replicating that scale. To alleviate these difficulties and to develop and share knowledge, the community needs open architecture frameworks for simulation, synthesis, and software exploration which support extensibility, scalability, and configurability, alongside an established base of verification tools and supported software. In this paper we present OpenPiton, an open source framework for building scalable architecture research prototypes from 1 core to 500 million cores. OpenPiton is the world's first open source, general-purpose, multithreaded manycore processor and framework. OpenPiton leverages the industry hardened OpenSPARC T1 core with modifications and builds upon it with a scratch-built, scalable uncore creating a flexible, modern manycore design. In addition, OpenPiton provides synthesis and backend scripts for ASIC and FPGA to enable other researchers to bring their designs to implementation. OpenPiton provides a complete verification infrastructure of over 8000 tests, is supported by mature software tools, runs full-stack multiuser Debian Linux, and is written in industry standard Verilog. Multiple implementations of OpenPiton have been created including a taped-out 25-core implementation in IBM's 32nm process and multiple Xilinx FPGA prototypes.", "citation": "Not cited", "year": "2016", "departments": ["Princeton University", "Princeton University", "Princeton University", "Princeton University", "Princeton University"], "conf": "asplos", "authors": ["Jonathan Balkind.....http://dblp.org/pers/hd/b/Balkind:Jonathan", "Michael McKeown.....http://dblp.org/pers/hd/m/McKeown:Michael", "Yaosheng Fu.....http://dblp.org/pers/hd/f/Fu:Yaosheng", "Tri M. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tri_M=", "Yanqi Zhou.....http://dblp.org/pers/hd/z/Zhou:Yanqi", "Alexey Lavrov.....http://dblp.org/pers/hd/l/Lavrov:Alexey", "Mohammad Shahrad.....http://dblp.org/pers/hd/s/Shahrad:Mohammad", "Adi Fuchs.....http://dblp.org/pers/hd/f/Fuchs:Adi", "Samuel Payne.....http://dblp.org/pers/hd/p/Payne:Samuel", "Xiaohua Liang.....http://dblp.org/pers/hd/l/Liang:Xiaohua", "Matthew Matl.....http://dblp.org/pers/hd/m/Matl:Matthew", "David Wentzlaff.....http://dblp.org/pers/hd/w/Wentzlaff:David"], "pages": 16}