{"title": "Automated Volumetric Intravascular Plaque Classification Using Optical Coherence Tomography (OCT).", "fields": ["optical coherence tomography", "fibrous cap", "blood vessel", "thrombosis", "visualization"], "abstract": "An estimated 17.5 million people died from a cardiovascular disease in 2012, representing 31% of all global deaths. Most acute coronary events result from rupture of the protective fibrous cap overlying an atherosclerotic plaque. The task of early identification of plaque types that can potentially rupture is, therefore, of great importance. The state-of-the-art approach to imaging blood vessels is intravascular optical coherence tomography (IVOCT). However, currently, this is an offline approach where the images are first collected and then manually analyzed a frame at a time to identify regions at risk of thrombosis. This process is extremely laborious, time consuming and prone to human error. We are building a system that, when complete, will provide interactive 3D visualization of a blood vessel as an IVOCT is in progress. The visualization will highlight different plaque types and enable quick identification of regions at risk for thrombosis. In this paper, we describe our approach, focusing on machine learning methods that are a key enabling technology. Our empirical results using real OCT data show that our approach can identify different plaque types efficiently with high accuracy across multiple patients.", "citation": "Not cited", "departments": ["Case Western Reserve University", "Case Western Reserve University", "Cardiovascular  ...  Cleveland, OH", "Cardiovascular  ...  Cleveland, OH", "Cardiovascular  ...  Cleveland, OH"], "authors": ["Ronny Shalev.....http://dblp.org/pers/hd/s/Shalev:Ronny", "Daisuke Nakamura.....http://dblp.org/pers/hd/n/Nakamura:Daisuke", "Setsu Nishino.....http://dblp.org/pers/hd/n/Nishino:Setsu", "Andrew M. Rollins.....http://dblp.org/pers/hd/r/Rollins:Andrew_M=", "Hiram G. Bezerra.....http://dblp.org/pers/hd/b/Bezerra:Hiram_G=", "David L. Wilson.....http://dblp.org/pers/hd/w/Wilson:David_L=", "Soumya Ray.....http://dblp.org/pers/hd/r/Ray:Soumya"], "conf": "aaai", "year": "2016", "pages": 6}