{"title": "Radiation constrained wireless charger placement.", "fields": ["approximation algorithm", "discretization", "knapsack problem", "radiation", "wireless power transfer"], "abstract": "Wireless Power Transfer has become a commercially viable technology to charge devices because of the convenience of no power wiring and the reliability of continuous power supply. This paper concerns the fundamental issue of wireless charger placement with electromagnetic radiation (EMR) safety. Although there are a few wireless charging schemes consider EMR safety, none of them addresses the charger placement issue. In this paper, we propose PESA, a wireless charger Placement scheme that guarantees EMR SAfety for every location on the plane. First, we discretize the whole charging area and formulate the problem into the Multidimensional 0/1 Knapsack (MDK) problem. Second, we propose a fast approximation algorithm to the MDK problem. Third, we optimize our scheme to improve speed by double partitioning the area. We prove that the output of our algorithm is better than (1 − ∊) of the optimal solution to PESA with a smaller EMR threshold (1 − ∊/2)Rt and a larger EMR coverage radius (1 + ∊/2)D. We conducted both simulations and field experiments to evaluate the performance of our scheme. Our experimental results show that in terms of charging utility, our algorithm outperforms the prior art by up to 45.7%.", "citation": "Citations (12)", "departments": ["Nanjing University", "Chinese Ministry of Public Security", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Haipeng Dai.....http://dblp.org/pers/hd/d/Dai:Haipeng", "Yunhuai Liu.....http://dblp.org/pers/hd/l/Liu:Yunhuai", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Lingtao Kong.....http://dblp.org/pers/hd/k/Kong:Lingtao", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "infocom", "year": "2016", "pages": 9}