{"title": "10M-core scalable fully-implicit solver for nonhydrostatic atmospheric dynamics.", "fields": ["incomplete lu factorization", "multigrid method", "solver", "sunway taihulight", "symmetric multiprocessor system", "scalability", "simulation", "search engine", "computational science"], "abstract": "An ultra-scalable fully-implicit solver is developed for stiff time-dependent problems arising from the hyperbolic conservation laws in nonhydrostatic atmospheric dynamics. In the solver, we propose a highly efficient hybrid domain-decomposed multigrid preconditioner that can greatly accelerate the convergence rate at the extreme scale. For solving the overlapped subdomain problems, a geometry-based pipelined incomplete LU factorization method is designed to further exploit the on-chip fine-grained concurrency. We perform systematic optimizations on different hardware levels to achieve best utilization of the heterogeneous computing units and substantial reduction of data movement cost. The fully-implicit solver successfully scales to the entire system of the Sunway TaihuLight supercomputer with over 10.5M heterogeneous cores, sustaining an aggregate performance of 7.95 PFLOPS in double-precision, and enables fast and accurate atmospheric simulations at the 488-m horizontal resolution (over 770 billion unknowns) with 0.07 simulated-years-per-day. This is, to our knowledge, the largest fully-implicit simulation to date.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Tsinghua University", "Tsinghua University", "Tsinghua University", "National Resear ... chnology, China"], "authors": ["Chao Yang.....http://dblp.org/pers/hd/y/Yang_0002:Chao", "Wei Xue.....http://dblp.org/pers/hd/x/Xue:Wei", "Haohuan Fu.....http://dblp.org/pers/hd/f/Fu:Haohuan", "Hongtao You.....http://dblp.org/pers/hd/y/You:Hongtao", "Xinliang Wang.....http://dblp.org/pers/hd/w/Wang:Xinliang", "Yulong Ao.....http://dblp.org/pers/hd/a/Ao:Yulong", "Fangfang Liu.....http://dblp.org/pers/hd/l/Liu:Fangfang", "Lin Gan.....http://dblp.org/pers/hd/g/Gan:Lin", "Ping Xu.....http://dblp.org/pers/hd/x/Xu:Ping", "Lanning Wang.....http://dblp.org/pers/hd/w/Wang:Lanning", "Guangwen Yang.....http://dblp.org/pers/hd/y/Yang:Guangwen", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin"], "conf": "sc", "year": "2016", "pages": 12}