{"title": "Campus-Scale Mobile Crowd-Tasking: Deployment & Behavioral Insights.", "fields": ["human computer interaction", "computer science", "software deployment", "phenomenon", "simulation"], "abstract": "Mobile crowd-tasking markets are growing at an unprecedented rate with increasing number of smartphone users. Such platforms differ from their online counterparts in that they demand physical mobility and can benefit from smartphone processors and sensors for verification purposes. Despite the importance of such mobile crowd-tasking markets, little is known about the labor supply dynamics and mobility patterns of the users.   In this paper we design, develop and experiment with a real-world mobile crowd-tasking platform, called TA$Ker. Our contributions are two-fold: (a) We develop TA$Ker, a system that allows us to empirically study the worker responses to push vs. pull strategies for task recommendation and selection. (b) We evaluate our system via experimentation with 80 real users on our campus, over a 4 week period with a corpus of over 1000 tasks. We then provide an in-depth analysis of labor supply, worker behavior & task selection preferences (including the phenomenon of super agents who complete large portions of the tasks) and the efficacy of push-based approaches that recommend tasks based on predicted movement patterns of individual workers.", "citation": "Citations (15)", "departments": ["Singapore Management University", "Singapore Management University", "Singapore Management University", "Singapore Management University", "Singapore Management University"], "authors": ["Thivya Kandappu.....http://dblp.org/pers/hd/k/Kandappu:Thivya", "Archan Misra.....http://dblp.org/pers/hd/m/Misra:Archan", "Shih-Fen Cheng.....http://dblp.org/pers/hd/c/Cheng:Shih=Fen", "Nikita Jaiman.....http://dblp.org/pers/hd/j/Jaiman:Nikita", "Randy Tandriansyah.....http://dblp.org/pers/hd/t/Tandriansyah:Randy", "Cen Chen.....http://dblp.org/pers/hd/c/Chen:Cen", "Hoong Chuin Lau.....http://dblp.org/pers/hd/l/Lau:Hoong_Chuin", "Deepthi Chander.....http://dblp.org/pers/hd/c/Chander:Deepthi", "Koustuv Dasgupta.....http://dblp.org/pers/hd/d/Dasgupta:Koustuv"], "conf": "cscw", "year": "2016", "pages": 13}