{"title": "Cnvlutin: Ineffectual-Neuron-Free Deep Neural Network Computing.", "fields": ["operand", "hardware acceleration", "critical path method", "memory hierarchy", "contextual image classification"], "abstract": "This work observes that a large fraction of the computations performed by Deep Neural Networks (DNNs) are intrinsically ineffectual as they involve a multiplication where one of the inputs is zero. This observation motivates  Cnvlutin  ( CNV ), a value-based approach to hardware acceleration that eliminates most of these ineffectual operations, improving performance and energy over a state-of-the-art accelerator with no accuracy loss.  CNV  uses hierarchical data-parallel units, allowing groups of lanes to proceed mostly independently enabling them to skip over the ineffectual computations. A co-designed data storage format encodes the computation elimination decisions taking them off the critical path while avoiding control divergence in the data parallel units. Combined, the units and the data storage format result in a data-parallel architecture that maintains wide, aligned accesses to its memory hierarchy and that keeps its data lanes busy. By loosening the ineffectual computation identification criterion,  CNV  enables further performance and energy efficiency improvements, and more so if a loss in accuracy is acceptable. Experimental measurements over a set of state-of-the-art DNNs for image classification show that  CNV  improves performance over a state-of-the-art accelerator from 1.24× to 1.55× and by 1.37× on average without any loss in accuracy by removing zero-valued operand multiplications alone. While  CNV  incurs an area overhead of 4.49%, it improves overall  EDP  (Energy Delay Product) and  ED  2  P  (Energy Delay Squared Product) on average by 1.47× and 2.01×, respectively. The average performance improvements increase to 1.52× without any loss in accuracy with a broader ineffectual identification policy. Further improvements are demonstrated with a loss in accuracy.", "citation": "Citations (141)", "departments": ["University of Toronto", "University of Toronto", "University of British Columbia", "University of British Columbia", "University of Toronto"], "authors": ["Jorge Albericio.....http://dblp.org/pers/hd/a/Albericio:Jorge", "Patrick Judd.....http://dblp.org/pers/hd/j/Judd:Patrick", "Tayler H. Hetherington.....http://dblp.org/pers/hd/h/Hetherington:Tayler_H=", "Tor M. Aamodt.....http://dblp.org/pers/hd/a/Aamodt:Tor_M=", "Natalie D. Enright Jerger.....http://dblp.org/pers/hd/j/Jerger:Natalie_D=_Enright", "Andreas Moshovos.....http://dblp.org/pers/hd/m/Moshovos:Andreas"], "conf": "isca", "year": "2016", "pages": 13}