{"title": "GEM: An analytic geometrical approach to fast event matching for multi-dimensional content-based publish/subscribe services.", "fields": ["computer network", "graph partition", "cache", "publication", "combinatorial optimization"], "abstract": "Event matching is vital in multi-dimensional content-based publish/subscribe services, which are widely employed for data dissemination in various scenarios. Existing mechanisms suffer from performance degradation in high-dynamic large-scale systems. To this end, we present GEM (Geometrical Event Matching), an analytic geometrical approach to fast event matching. GEM offers a very high event matching speed, and it also has low costs for subscription insertion/deletion operations and memory usage. In GEM, subscriptions are organized efficiently by a triangle-like index structure. A graph partitioning matching method and a selection matching method are jointly used for single-dimensional matching (SDM). Optimized by a decision algorithm for each incoming event, the event matching process is carried out in a pipeline consisting the SDM for each dimension. The search space shrinks continuously as the process goes, so that the event matching performance is promoted adaptively. A cache method is also designed to boost the first SDM in the pipeline. We implement extensive experiments to evaluate the performance of GEM in comparison with 3 state-of-the-art reference algorithms (TAMA, H-TREE and REIN). The results show that, the event matching time, subscription insertion/deletion time and memory consumption of GEM is on average 53.9%, 42.3%/49.5% and 31.8% lower than the best in other 3 algorithms, respectively. The event matching time of GEM is reduced efficiently via the cache method. The superiority of GEM appears more significantly as system scale and dynamic grow, and its performance also maintains in a high stability.", "citation": "Not cited", "departments": ["Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications"], "authors": ["Wenhao Fan.....http://dblp.org/pers/hd/f/Fan:Wenhao", "Yuan'an Liu.....http://dblp.org/pers/hd/l/Liu:Yuan=an", "Bihua Tang.....http://dblp.org/pers/hd/t/Tang:Bihua"], "conf": "infocom", "year": "2016", "pages": 9}