{"title": "Learning abstract snippet detectors with Temporal embedding in convolutional neural Networks.", "fields": ["snippet", "data type", "convolutional neural network", "ranging", "embedding"], "abstract": "The prediction of periodical time-series remains challenging due to various types of scaling, misalignments and distortion effects. Here, we propose a novel model called Temporal embedding-enhanced convolutional neural Network (TeNet) to learn repeatedly-occurring-yet-hidden structural elements in periodical time-series, called abstract snippet detectors, to predict future changes. Our model effectively learns a new feature space for a time-series dataset. In the new feature space, distorted time-series that have implicit similarity but substantial differences in value and sequence to regular patterns are re-aligned to the regular patterns in the dataset, and subsequently contribute to a robust prediction mode. The model is robust to various types of distortions and misalignments and demonstrates strong prediction power for periodical time-series. We conduct extensive experiments and discover that the proposed model shows significant and consistent advantages over existing methods on a variety of data modalities ranging from human mobility to household power consumption records, when evaluated under four metrics. The model is also robust to various factors such as number of samples, variance of data, numerical ranges of data etc. The experiments verify that the intuition behind the model can be generalized to multiple data types and applications and promises significant improvement in prediction performance across the datasets studied.", "citation": "Citations (1)", "departments": ["Renmin University of China", "Commonwealth Scientific and Industrial Research Organisation", "Commonwealth Scientific and Industrial Research Organisation", "Renmin University of China", "University of Queensland"], "authors": ["Jiajun Liu.....http://dblp.org/pers/hd/l/Liu:Jiajun", "Kun Zhao.....http://dblp.org/pers/hd/z/Zhao:Kun", "Brano Kusy.....http://dblp.org/pers/hd/k/Kusy:Brano", "Ji-Rong Wen.....http://dblp.org/pers/hd/w/Wen:Ji=Rong", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Raja Jurdak.....http://dblp.org/pers/hd/j/Jurdak:Raja"], "conf": "icde", "year": "2016", "pages": 11}