{"title": "Energy Efficient Architecture for Graph Analytics Accelerators.", "fields": ["analytics", "architecture", "electrical efficiency", "systemc", "logic synthesis"], "abstract": "Specialized hardware accelerators can significantly improve the performance and power efficiency of compute systems. In this paper, we focus on hardware accelerators for graph analytics applications and propose a configurable architecture template that is specifically optimized for iterative vertex-centric graph applications with irregular access patterns and asymmetric convergence. The proposed architecture addresses the limitations of the existing multi-core CPU and GPU architectures for these types of applications. The SystemC-based template we provide can be customized easily for different vertex-centric applications by inserting application-level data structures and functions. After that, a cycle-accurate simulator and RTL can be generated to model the target hardware accelerators. In our experiments, we study several graph-parallel applications, and show that the hardware accelerators generated by our template can outperform a 24 core high end server CPU system by up to 3x in terms of performance. We also estimate the area requirement and power consumption of these hardware accelerators through physical-aware logic synthesis, and show up to 65x better power consumption with significantly smaller area.", "citation": "Citations (8)", "year": "2016", "departments": ["Bilkent University", "Bilkent University", "Intel", "Intel", "Intel"], "conf": "isca", "authors": ["Muhammet Mustafa Ozdal.....http://dblp.org/pers/hd/o/Ozdal:Muhammet_Mustafa", "Serif Yesil.....http://dblp.org/pers/hd/y/Yesil:Serif", "Taemin Kim.....http://dblp.org/pers/hd/k/Kim:Taemin", "Andrey Ayupov.....http://dblp.org/pers/hd/a/Ayupov:Andrey", "John Greth.....http://dblp.org/pers/hd/g/Greth:John", "Steven M. Burns.....http://dblp.org/pers/hd/b/Burns:Steven_M=", "Özcan Özturk.....http://dblp.org/pers/hd/=/=Ouml=zturk_0001:=Ouml=zcan"], "pages": 12}