{"title": "Personal recommendation using deep recurrent neural networks in NetEase.", "fields": ["world wide web", "exploit", "web page", "recurrent neural network", "collaborative filtering"], "abstract": "Each user session in an e-commerce system can be modeled as a sequence of web pages, indicating how the user interacts with the system and makes his/her purchase. A typical recommendation approach, e.g., Collaborative Filtering, generates its results at the beginning of each session, listing the most likely purchased items. However, such approach fails to exploit current viewing history of the user and hence, is unable to provide a real-time customized recommendation service. In this paper, we build a deep recurrent neural network to address the problem. The network tracks how users browse the website using multiple hidden layers. Each hidden layer models how the combinations of webpages are accessed and in what order. To reduce the processing cost, the network only records a finite number of states, while the old states collapse into a single history state. Our model refreshes the recommendation result each time when user opens a new web page. As user's session continues, the recommendation result is gradually refined. Furthermore, we integrate the recurrent neural network with a Feedfoward network which represents the user-item correlations to increase the prediction accuracy. Our approach has been applied to Kaola (http://www.kaola.com), an e-commerce website powered by the NetEase technologies. It shows a significant improvement over previous recommendation service.", "citation": "Citations (11)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "University of Electronic Science and Technology of China"], "authors": ["Sai Wu.....http://dblp.org/pers/hd/w/Wu:Sai", "Weichao Ren.....http://dblp.org/pers/hd/r/Ren:Weichao", "Chengchao Yu.....http://dblp.org/pers/hd/y/Yu:Chengchao", "Gang Chen.....http://dblp.org/pers/hd/c/Chen:Gang", "Dongxiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Dongxiang", "Jingbo Zhu.....http://dblp.org/pers/hd/z/Zhu:Jingbo"], "conf": "icde", "year": "2016", "pages": 12}