{"title": "Research Challenges in Developing Multimedia Systems for Managing Emergency Situations.", "fields": ["emergency management", "assimilation", "big data", "data stream mining", "participatory sensing"], "abstract": "With an increasing amount of diverse heterogeneous data and information, the methodology of multimedia analysis has become increasingly relevant in solving challenging societal problems such as managing emergency situations during disasters. Using cybernetic principles combined with multimedia technology, researchers can develop effective frameworks for using diverse multimedia (including traditional multimedia as well as diverse multimodal) data for situation recognition, and determining and communicating appropriate actions to people stranded during disasters. We present known issues in disaster management and then focus on emergency situations. We show that an emergency management problem is fundamentally a multimedia information assimilation problem for situation recognition and for connecting people's needs to available resources effectively, efficiently, and promptly. Major research challenges for managing emergency situations are identified and discussed. We also present a intelligently detecting evolving environmental situations, and discuss the role of multimedia micro-reports as spontaneous participatory sensing data streams in emergency responses. Given enormous progress in concept recognition using machine learning in the last few years, situation recognition may be the next major challenge for learning approaches in multimedia contextual big data. The data needed for developing such approaches is now easily available on the Web and many challenging research problems in this area are ripe for exploration in order to positively impact our society during its most difficult times.", "citation": "Citations (4)", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Irvine"], "authors": ["Mengfan Tang.....http://dblp.org/pers/hd/t/Tang:Mengfan", "Siripen Pongpaichet.....http://dblp.org/pers/hd/p/Pongpaichet:Siripen", "Ramesh Jain.....http://dblp.org/pers/hd/j/Jain:Ramesh"], "conf": "mm", "year": "2016", "pages": 10}