{"title": "graphVizdb: A scalable platform for interactive large graph visualization.", "fields": ["graph", "interactive visualization", "graph drawing", "spqr tree", "graph database"], "abstract": "We present a novel platform for the interactive visualization of very large graphs. The platform enables the user to interact with the visualized graph in a way that is very similar to the exploration of maps at multiple levels. Our approach involves an offline preprocessing phase that builds the layout of the graph by assigning coordinates to its nodes with respect to a Euclidean plane. The respective points are indexed with a spatial data structure, i.e., an R-tree, and stored in a database. Multiple abstraction layers of the graph based on various criteria are also created offline, and they are indexed similarly so that the user can explore the dataset at different levels of granularity, depending on her particular needs. Then, our system translates user operations into simple and very efficient spatial operations (i.e., window queries) in the backend. This technique allows for a fine-grained access to very large graphs with extremely low latency and memory requirements and without compromising the functionality of the tool. Our web-based prototype supports three main operations: (1) interactive navigation, (2) multi-level exploration, and (3) keyword search on the graph metadata.", "citation": "Citations (10)", "departments": ["National Technical University of Athens", "ETH Zurich", "National Technical University of Athens", "Swinburne University of Technology", "ATHENA Research Center, Greece"], "authors": ["Nikos Bikakis.....http://dblp.org/pers/hd/b/Bikakis:Nikos", "John Liagouris.....http://dblp.org/pers/hd/l/Liagouris:John", "Maria Krommyda.....http://dblp.org/pers/hd/k/Krommyda:Maria", "George Papastefanatos.....http://dblp.org/pers/hd/p/Papastefanatos:George", "Timos K. Sellis.....http://dblp.org/pers/hd/s/Sellis:Timos_K="], "conf": "icde", "year": "2016", "pages": 4}