{"title": "Detecting table clones and smells in spreadsheets.", "fields": ["header", "computational semantics", "end user", "clone", "database"], "abstract": "Spreadsheets are widely used by end users for various business tasks, such as data analysis and financial reporting. End users may perform similar tasks by cloning a block of cells (table) in their spreadsheets. The corresponding cells in these cloned tables are supposed to keep the same or similar computational semantics. However, when spreadsheets evolve, thus cloned tables can become inconsistent due to ad-hoc modifications, and as a result suffer from smells. In this paper, we propose TableCheck to detect table clones and related smells due to inconsistency among them. We observe that two tables with the same header information at their corresponding cells are likely to be table clones. Inspired by existing fingerprint-based code clone detection techniques, we developed a detection algorithm to detect this kind of table clones. We further detected outliers among corresponding cells as smells in the detected table clones. We implemented our idea into TableCheck, and applied it to real-world spreadsheets from the EUSES corpus. Experimental results show that table clones commonly exist (21.8%), and 25.6% of the spreadsheets with table clones suffer from smells due to inconsistency among these clones. TableCheck detected table clones and their smells with a precision of 92.2% and 85.5%, respectively, while existing techniques detected no more than 35.6% true smells that TableCheck could detect.", "citation": "Citations (4)", "departments": ["Chinese Academy of Sciences", "Hong Kong University of Science and Technology", "Chinese Academy of Sciences", "Nanjing University", "Chinese Academy of Sciences"], "authors": ["Wensheng Dou.....http://dblp.org/pers/hd/d/Dou:Wensheng", "Shing-Chi Cheung.....http://dblp.org/pers/hd/c/Cheung:Shing=Chi", "Chushu Gao.....http://dblp.org/pers/hd/g/Gao:Chushu", "Chang Xu.....http://dblp.org/pers/hd/x/Xu_0001:Chang", "Liang Xu.....http://dblp.org/pers/hd/x/Xu:Liang", "Jun Wei.....http://dblp.org/pers/hd/w/Wei_0001:Jun"], "conf": "sigsoft", "year": "2016", "pages": 12}