{"title": "Health Monitoring on Social Media over Time.", "fields": ["social media", "data modeling", "data availability", "public health", "topic model", "mean squared prediction error", "architecture tradeoff analysis method"], "abstract": "Social media has become a major source for analyzing all aspects of daily life. Thanks to dedicated latent topic analysis methods such as the Ailment Topic Aspect Model (ATAM), public health can now be observed on Twitter. In this work, we are interested in using social media to monitor people’s health over time. The use of tweets has several benefits including instantaneous data availability at virtually no cost. Early monitoring of health data is complementary to post-factum studies and enables a range of applications such as measuring behavioral risk factors and triggering health campaigns. We formulate two problems:  health transition detection  and   health transition prediction.  We first propose the Temporal Ailment Topic Aspect Model (TM–ATAM), a new latent model dedicated to solving the first problem by capturing transitions that involve health-related topics. TM–ATAM is a non-obvious extension to ATAM that was designed to extract health-related topics. It learns health-related topic transitions by  minimizing the prediction error on topic distributions between consecutive posts at different time and geographic granularities.  To solve the second problem, we develop T–ATAM, a Temporal Ailment Topic Aspect Model where time is treated as a random variable  natively  inside ATAM. Our experiments on an 8-month corpus of tweets show that TM–ATAM outperforms TM–LDA in estimating health-related transitions from tweets for different geographic populations. We examine the ability of TM–ATAM to detect transitions due to climate conditions in different geographic regions. We then show how T–ATAM can be used to predict the most important transition and additionally compare T–ATAM with CDC (Center for Disease Control) data and Google Flu Trends.", "citation": "Not cited", "departments": ["Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "University Pari ... , Paris, France"], "authors": ["Sumit Sidana.....http://dblp.org/pers/hd/s/Sidana:Sumit", "Shashwat Mishra.....http://dblp.org/pers/hd/m/Mishra:Shashwat", "Sihem Amer-Yahia.....http://dblp.org/pers/hd/a/Amer=Yahia:Sihem", "Marianne Clausel.....http://dblp.org/pers/hd/c/Clausel:Marianne", "Massih-Reza Amini.....http://dblp.org/pers/hd/a/Amini:Massih=Reza"], "conf": "sigir", "year": "2016", "pages": 4}