{"title": "Promoting Joint Attention with Computer Supported Collaboration in Children with Autism.", "fields": ["autism spectrum disorder", "joint attention", "psychological intervention", "gesture", "exploratory research"], "abstract": "There exists mounting evidence in favor of computer supported autism interventions at the individual level. However, the potential benefits of using computer supported collaboration to encourage social interactions between individuals with autism and typically developed individuals are underexplored, particularly in developing regions. We present an exploratory study of a collaborative gesture-based application, Balloons. The application encourages joint attention, which is defined as the shared attention between two individuals towards the same object. Using mixed methods, we evaluated Balloons for three weeks in New Delhi with ten medium-low functioning autistic children. Our findings suggest that employing CSC interventions for children with autism in India provide (a) observable improvements in social interaction with typically developed peers, (b) the opportunity to customize and individualize intervention to cater to a large spectrum of children and (c) the potential opportunity of reducing fears of certain objects.", "citation": "Citations (6)", "departments": ["University of Tampere", "Xerox", "University of Tampere", "Tamana School of Hope", "Tamana School of Hope"], "authors": ["Sumita Sharma.....http://dblp.org/pers/hd/s/Sharma:Sumita", "Saurabh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Saurabh", "Krishnaveni Achary.....http://dblp.org/pers/hd/a/Achary:Krishnaveni", "Blessin Varkey.....http://dblp.org/pers/hd/v/Varkey:Blessin", "Tomi Heimonen.....http://dblp.org/pers/hd/h/Heimonen:Tomi", "Jaakko Samuli Hakulinen.....http://dblp.org/pers/hd/h/Hakulinen:Jaakko_Samuli", "Markku Turunen.....http://dblp.org/pers/hd/t/Turunen:Markku", "Nitendra Rajput.....http://dblp.org/pers/hd/r/Rajput:Nitendra"], "conf": "cscw", "year": "2016", "pages": 12}