{"title": "Interactive and guided architectural refactoring with search-based recommendation.", "fields": ["systems engineering", "high level design", "real time computing", "code refactoring", "computer science"], "abstract": "Architectural refactorings can contain hundreds of steps and experienced developers could carry them out over several weeks. Moreover, developers need to explore a correct sequence of refactorings steps among many more incorrect alternatives. Thus, carrying out architectural refactorings is costly, risky, and challenging. In this paper, we present Refactoring Navigator: a tool-supported and interactive recommendation approach for aiding architectural refactoring. Our approach takes a given implementation as the starting point, a desired high-level design as the target, and iteratively recommends a series of refactoring steps. Moreover, our approach allows the user to accept, reject, or ignore a recommended refactoring step, and uses the user's feedback in further refactoring recommendations. We evaluated the effectiveness of our approach and tool using a controlled experiment and an industrial case study. The controlled experiment shows that the participants who used Refactoring Navigator accomplished their tasks in 77.4% less time and manually edited 98.3% fewer lines than the control group. The industrial case study suggests that Refactoring Navigator has the potential to help with architectural refactorings in practice.", "citation": "Citations (7)", "departments": ["Fudan University", "Fudan University", "Drexel University", "Oregon State University", "Fudan University"], "authors": ["Yun Lin.....http://dblp.org/pers/hd/l/Lin_0001:Yun", "Xin Peng.....http://dblp.org/pers/hd/p/Peng:Xin", "Yuanfang Cai.....http://dblp.org/pers/hd/c/Cai:Yuanfang", "Danny Dig.....http://dblp.org/pers/hd/d/Dig:Danny", "Diwen Zheng.....http://dblp.org/pers/hd/z/Zheng:Diwen", "Wenyun Zhao.....http://dblp.org/pers/hd/z/Zhao:Wenyun"], "conf": "sigsoft", "year": "2016", "pages": 12}