{"title": "TRANSFORMERS: Robust spatial joins on non-uniform data distributions.", "fields": ["database", "density ratio", "computer science", "joins", "data mining"], "abstract": "Spatial joins are becoming increasingly ubiquitous in many applications, particularly in the scientific domain. While several approaches have been proposed for joining spatial datasets, each of them has a strength for a particular type of density ratio among the joined datasets. More generally, no single proposed method can efficiently join two spatial datasets in a robust manner with respect to their data distributions. Some approaches do well for datasets with contrasting densities while others do better with similar densities. None of them does well when the datasets have locally divergent data distributions. In this paper we develop TRANSFORMERS, an efficient and robust spatial join approach that is indifferent to such variations of distribution among the joined data. TRANSFORMERS achieves this feat by departing from the state-of-the-art through adapting the join strategy and data layout to local density variations among the joined data. It employs a join method based on data-oriented partitioning when joining areas of substantially different local densities, whereas it uses big partitions (as in space-oriented partitioning) when the densities are similar, while seamlessly switching among these two strategies at runtime. We experimentally demonstrate that TRANSFORMERS outperforms state-of-the-art approaches by a factor of between 2 and 8.", "citation": "Citations (1)", "departments": ["École Polytechnique Fédérale de Lausanne", "Imperial College London", "Oracle Corporation", "Skolkovo Institute of Science and Technology", "École Polytechnique Fédérale de Lausanne"], "authors": ["Mirjana Pavlovic.....http://dblp.org/pers/hd/p/Pavlovic:Mirjana", "Thomas Heinis.....http://dblp.org/pers/hd/h/Heinis:Thomas", "Farhan Tauheed.....http://dblp.org/pers/hd/t/Tauheed:Farhan", "Panagiotis Karras.....http://dblp.org/pers/hd/k/Karras:Panagiotis", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia"], "conf": "icde", "year": "2016", "pages": 12}