{"title": "Detecting Good Abandonment in Mobile Search.", "fields": ["world wide web", "mobile device", "dwell time", "gesture", "mobile search"], "abstract": "Web search queries for which there are no clicks are referred to as abandoned queries and are usually considered as leading to user dissatisfaction. However, there are many cases where a user may not click on any search result page (SERP) but still be satisfied. This scenario is referred to as good abandonment and presents a challenge for most approaches measuring search satisfaction, which are usually based on clicks and dwell time. The problem is exacerbated further on mobile devices where search providers try to increase the likelihood of users being satisfied directly by the SERP. This paper proposes a solution to this problem using gesture interactions, such as reading times and touch actions, as signals for differentiating between good and bad abandonment. These signals go beyond clicks and characterize user behavior in cases where clicks are not needed to achieve satisfaction. We study different good abandonment scenarios and investigate the different elements on a SERP that may lead to good abandonment. We also present an analysis of the correlation between user gesture features and satisfaction. Finally, we use this analysis to build models to automatically identify good abandonment in mobile search achieving an accuracy of 75%, which is significantly better than considering query and session signals alone. Our findings have implications for the study and application of user satisfaction in search systems.", "citation": "Citations (18)", "departments": ["Pennsylvania State University", "Eindhoven University of Technology", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Kyle Williams.....http://dblp.org/pers/hd/w/Williams:Kyle", "Julia Kiseleva.....http://dblp.org/pers/hd/k/Kiseleva:Julia", "Aidan C. Crook.....http://dblp.org/pers/hd/c/Crook:Aidan_C=", "Imed Zitouni.....http://dblp.org/pers/hd/z/Zitouni:Imed", "Ahmed Hassan Awadallah.....http://dblp.org/pers/hd/a/Awadallah:Ahmed_Hassan", "Madian Khabsa.....http://dblp.org/pers/hd/k/Khabsa:Madian"], "conf": "www", "year": "2016", "pages": 11}