{"title": "Optimizing secure classification performance with privacy-aware feature selection.", "fields": ["software deployment", "inference", "leverage", "decision making", "personalized medicine"], "abstract": "Recent advances in personalized medicine point towards a future where clinical decision making will be dependent upon the individual characteristics of the patient, e.g., their age, race, genomic variation, and lifestyle. Already, there are numerous commercial entities working towards the provision of software to support such decisions as cloud-based services. However, deployment of such services in such settings raises important challenges for privacy. A recent attack shows that disclosing personalized drug dosage recommendations, combined with several pieces of demographic knowledge, can be leveraged to infer single nucleotide polymorphism variants of a patient. One manner to prevent such inference is to apply secure multi-party computation (SMC) techniques that hide all patient data, so that no information, including the clinical recommendation, is disclosed during the decision making process. Yet, SMC is a computationally cumbersome process and disclosing some information may be necessary for various compliance purposes. Additionally, certain information (e.g., demographic information) may already be publicly available. In this work, we provide a novel approach to selectively disclose certain information before the SMC process to significantly improve personalized decision making performance while preserving desired levels of privacy. To achieve this goal, we introduce mechanisms to quickly compute the loss in privacy due to information disclosure while considering its performance impact on SMC execution phase. Our empirical analysis show that we can achieve up to three orders of magnitude improvement compared to pure SMC solutions with only a slight increase in privacy risks.", "citation": "Citations (1)", "departments": ["University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "Vanderbilt University"], "authors": ["Erman Pattuk.....http://dblp.org/pers/hd/p/Pattuk:Erman", "Murat Kantarcioglu.....http://dblp.org/pers/hd/k/Kantarcioglu:Murat", "Huseyin Ulusoy.....http://dblp.org/pers/hd/u/Ulusoy:Huseyin", "Bradley Malin.....http://dblp.org/pers/hd/m/Malin:Bradley"], "conf": "icde", "year": "2016", "pages": 12}