{"title": "TASKer: behavioral insights via campus-based experimental mobile crowd-sourcing.", "fields": ["analytics", "pricing strategies", "cheating", "testbed", "last mile"], "abstract": "While mobile crowd-sourcing has become a game-changer for many urban operations, such as last mile logistics and municipal monitoring, we believe that the design of such crowd-sourcing strategies must better accommodate the real-world behavioral preferences and characteristics of users. To provide a real-world testbed to study the impact of novel mobile crowd-sourcing strategies, we have designed, developed and experimented with a real-world mobile crowd-tasking platform on the SMU campus, called  TASKer.  We enhanced the  TA$Ker  platform to support several new features (e.g., task bundling, differential pricing and cheating analytics) and experimentally investigated these features via a two-month deployment of  TA$Ker , involving 900 real users on the SMU campus who performed over 30,000 tasks. Our studies (i) show the benefits of bundling tasks as a combined package, (ii) reveal the effectiveness of differential pricing strategies and (iii) illustrate key aspects of cheating (false reporting) behavior observed among workers.", "citation": "Citations (13)", "departments": ["Singapore Management University", "Singapore Management University", "Singapore Management University", "Singapore Management University", "Singapore Management University"], "authors": ["Thivya Kandappu.....http://dblp.org/pers/hd/k/Kandappu:Thivya", "Nikita Jaiman.....http://dblp.org/pers/hd/j/Jaiman:Nikita", "Randy Tandriansyah.....http://dblp.org/pers/hd/t/Tandriansyah:Randy", "Archan Misra.....http://dblp.org/pers/hd/m/Misra:Archan", "Shih-Fen Cheng.....http://dblp.org/pers/hd/c/Cheng:Shih=Fen", "Cen Chen.....http://dblp.org/pers/hd/c/Chen:Cen", "Hoong Chuin Lau.....http://dblp.org/pers/hd/l/Lau:Hoong_Chuin", "Deepthi Chander.....http://dblp.org/pers/hd/c/Chander:Deepthi", "Koustuv Dasgupta.....http://dblp.org/pers/hd/d/Dasgupta:Koustuv"], "conf": "huc", "year": "2016", "pages": 11}