{"title": "Sharing-Aware Outlier Analytics over High-Volume Data Streams.", "fields": ["memory footprint", "analytics", "cpu time", "data stream mining", "parameterized complexity"], "abstract": "Real-time analytics of anomalous phenomena on streaming data typically relies on processing a large variety of continuous outlier detection requests, each configured with different parameter settings. The processing of such complex outlier analytics workloads is resource consuming due to the algorithmic complexity of the outlier mining process. In this work we propose a sharing-aware multi-query execution strategy for outlier detection on data streams called SOP. A key insight of SOP is to transform the problem of handling a multi-query outlier analytics workload into a single-query skyline computation problem. We prove that the output of the skyline computation process corresponds to the minimal information needed for determining the outlier status of any point in the stream. Based on this new formulation, we design a customized skyline algorithm called K-SKY that leverages the domination relationships among the streaming data points to minimize the number of data points that must be evaluated for supporting multi-query outlier detection. Based on this K-SKY algorithm, our SOP solution achieves minimal utilization of both computational and memory resources for the processing of these complex outlier analytics workload. Our experimental study demonstrates that SOP consistently outperforms the state-of-art solutions by three orders of magnitude in CPU time, while only consuming 5% of their memory footprint - a clear win-win. Furthermore, SOP is shown to scale to large workloads composed of thousands of parameterized queries.", "citation": "Citations (4)", "year": "2016", "departments": ["IBM", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute"], "conf": "sigmod", "authors": ["Lei Cao.....http://dblp.org/pers/hd/c/Cao:Lei", "Jiayuan Wang.....http://dblp.org/pers/hd/w/Wang:Jiayuan", "Elke A. Rundensteiner.....http://dblp.org/pers/hd/r/Rundensteiner:Elke_A="], "pages": 14}