{"title": "DECOrrelated feature space partitioning for distributed sparse regression.", "fields": ["embarrassingly parallel", "feature selection", "sample space", "feature vector", "distributed algorithm"], "abstract": "Fitting statistical models is computationally challenging when the sample size or the dimension of the dataset is huge. An attractive approach for down-scaling the problem size is to first partition the dataset into subsets and then fit using distributed algorithms. The dataset can be partitioned either horizontally (in the sample space) or vertically (in the feature space). While the majority of the literature focuses on sample space partitioning, feature space partitioning is more effective when p >> n. Existing methods for partitioning features, however, are either vulnerable to high correlations or inefficient in reducing the model dimension. In this paper, we solve these problems through a new embarrassingly parallel framework named DECO for distributed variable selection and parameter estimation. In DECO, variables are first partitioned and allocated to m distributed workers. The decorrelated subset data within each worker are then fitted via any algorithm designed for high-dimensional problems. We show that by incorporating the decorrelation step, DECO can achieve consistent variable selection and parameter estimation on each subset with (almost) no assumptions. In addition, the convergence rate is nearly minimax optimal for both sparse and weakly sparse models and does NOT depend on the partition number m. Extensive numerical experiments are provided to illustrate the performance of the new framework.", "citation": "Citations (6)", "departments": ["Duke University", "Duke University", "National University of Singapore"], "authors": ["Xiangyu Wang.....http://dblp.org/pers/hd/w/Wang:Xiangyu", "David B. Dunson.....http://dblp.org/pers/hd/d/Dunson:David_B=", "Chenlei Leng.....http://dblp.org/pers/hd/l/Leng:Chenlei"], "conf": "nips", "year": "2016", "pages": 9}