{"title": "An economical and SLO-guaranteed cloud storage service across multiple cloud service providers.", "fields": ["leverage", "schedule", "cost efficiency", "service level objective", "cloud storage", "payment"], "abstract": "It is important for cloud service brokers to provide a multi-cloud storage service to minimize their payment cost to cloud service providers (CSPs) while providing service level objective (SLO) guarantee to their customers. Many multi-cloud storage services have been proposed or payment cost minimization or SLO guarantee. However, no previous works fully leverage the current cloud pricing policies (such as resource reservation pricing) to reduce the payment cost. Also, few works achieve both cost minimization and SLO guarantee. In this paper, we propose a multi-cloud Economical and SLO-guaranteed Storage Service (  $ES^3$      ), which determines data allocation and resource reservation schedules with payment cost minimization and SLO guarantee.    $ES^3$       incorporates (1) a coordinated data allocation and resource reservation method, which allocates each data item to a datacenter and determines the resource reservation amount on datacenters by leveraging all the pricing policies; (2) a genetic algorithm based data allocation adjustment method, which reduce data Get/Put rate variance in each datacenter to maximize the reservation benefit. We also propose several algorithms to enhance the cost efficient and SLO guarantee performance of   $ES^3$       including i) dynamic request redirection, ii) grouped Gets for cost reduction, iii) lazy update for cost-efficient Puts, and iv) concurrent requests for rigid Get SLO guarantee. Our trace-driven experiments on a supercomputing cluster and on real clouds (i.e., Amazon S3, Windows Azure Storage and Google Cloud Storage) show the superior performance of    $ES^3$       in payment cost minimization and SLO guarantee in comparison with previous methods.", "citation": "Citations (2)", "departments": ["Clemson University", "University of Virginia", "University of Virginia", "Clemson University", "Clemson University"], "authors": ["Guoxin Liu.....http://dblp.org/pers/hd/l/Liu:Guoxin", "Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying"], "conf": "infocom", "year": "2016", "pages": 9}