{"title": "A Study of Sorting Algorithms on Approximate Memory.", "fields": ["sorting algorithm", "phase change memory", "sorting", "access time", "computer data storage"], "abstract": "Hardware evolution has been one of the driving factors for the redesign of database systems. Recently, approximate storage emerges in the area of computer architecture. It trades off precision for better performance and/or energy consumption. Previous studies have demonstrated the benefits of approximate storage for applications that are tolerant to imprecision such as image processing. However, it is still an open question whether and how approximate storage can be used for applications that do not expose such intrinsic tolerance. In this paper, we study one of the most basic operations in database--sorting on a hybrid storage system with both precise storage and approximate storage. Particularly, we start with a study of three common sorting algorithms on approximate storage. Experimental results show that a 95% sorted sequence can be obtained with up to 40% reduction in total write latencies. Thus, we propose an approx-refine execution mechanism to improve the performance of sorting algorithms on the hybrid storage system to produce precise results. Our optimization gains the performance benefits by offloading the sorting operation to approximate storage, followed by an efficient refinement to resolve the unsortedness on the output of the approximate storage. Our experiments show that our approx-refine can reduce the total memory access time by up to 11%. These studies shed light on the potential of approximate hardware for improving the performance of applications that require precise results.", "citation": "Citations (2)", "year": "2016", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Nanyang Technological University", "Nanyang Technological University"], "conf": "sigmod", "authors": ["Shuang Chen.....http://dblp.org/pers/hd/c/Chen:Shuang", "Shunning Jiang.....http://dblp.org/pers/hd/j/Jiang:Shunning", "Bingsheng He.....http://dblp.org/pers/hd/h/He:Bingsheng", "Xueyan Tang.....http://dblp.org/pers/hd/t/Tang:Xueyan"], "pages": 16}