{"title": "Deep-based Ingredient Recognition for Cooking Recipe Retrieval.", "fields": ["categorization", "recipe", "fuzzy logic", "scalability", "ingredient"], "abstract": "Retrieving recipes corresponding to given dish pictures facilitates the estimation of nutrition facts, which is crucial to various health relevant applications. The current approaches mostly focus on recognition of food category based on global dish appearance without explicit analysis of ingredient composition. Such approaches are incapable for retrieval of recipes with unknown food categories, a problem referred to as zero-shot retrieval. On the other hand, content-based retrieval without knowledge of food categories is also difficult to attain satisfactory performance due to large visual variations in food appearance and ingredient composition. As the number of ingredients is far less than food categories, understanding ingredients underlying dishes in principle is more scalable than recognizing every food category and thus is suitable for zero-shot retrieval. Nevertheless, ingredient recognition is a task far harder than food categorization, and this seriously challenges the feasibility of relying on them for retrieval. This paper proposes deep architectures for simultaneous learning of ingredient recognition and food categorization, by exploiting the mutual but also fuzzy relationship between them. The learnt deep features and semantic labels of ingredients are then innovatively applied for zero-shot retrieval of recipes. By experimenting on a large Chinese food dataset with images of highly complex dish appearance, this paper demonstrates the feasibility of ingredient recognition and sheds light on this zero-shot problem peculiar to cooking recipe retrieval.", "citation": "Citations (32)", "departments": ["City University of Hong Kong", "City University of Hong Kong"], "authors": ["Jingjing Chen.....http://dblp.org/pers/hd/c/Chen:Jingjing", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah"], "conf": "mm", "year": "2016", "pages": 10}