{"title": "Data Programming: Creating Large Training Sets, Quickly.", "fields": ["discriminative model", "deep learning", "generative grammar", "test set", "generative model"], "abstract": "Large labeled training sets are the critical building blocks of supervised learning methods and are key enablers of deep learning techniques. For some applications, creating labeled training sets is the most time-consuming and expensive part of applying machine learning. We therefore propose a paradigm for the programmatic creation of training sets called data programming in which users provide a set of labeling functions, which are programs that heuristically label subsets of the data, but that are noisy and may conflict. By viewing these labeling functions as implicitly describing a generative model for this noise, we show that we can recover the parameters of this model to \"denoise\" the generated training set, and establish theoretically that we can recover the parameters of these generative models in a handful of settings. We then show how to modify a discriminative loss function to make it noise-aware, and demonstrate our method over a range of discriminative models including logistic regression and LSTMs. Experimentally, on the 2014 TAC-KBP Slot Filling challenge, we show that data programming would have led to a new winning score, and also show that applying data programming to an LSTM model leads to a TAC-KBP score almost 6 F1 points over a state-of-the-art LSTM baseline (and into second place in the competition). Additionally, in initial user studies we observed that data programming may be an easier way for non-experts to create machine learning models when training data is limited or unavailable.", "citation": "Citations (81)", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "authors": ["Alexander J. Ratner.....http://dblp.org/pers/hd/r/Ratner:Alexander_J=", "Christopher De Sa.....http://dblp.org/pers/hd/s/Sa:Christopher_De", "Sen Wu.....http://dblp.org/pers/hd/w/Wu_0002:Sen", "Daniel Selsam.....http://dblp.org/pers/hd/s/Selsam:Daniel", "Christopher Ré.....http://dblp.org/pers/hd/r/R=eacute=:Christopher"], "conf": "nips", "year": "2016", "pages": 9}