{"title": "Stochastically Transitive Models for Pairwise Comparisons: Statistical and Computational Issues.", "fields": ["transitive relation", "parametric model", "minimax", "pairwise comparison", "thurstone scale"], "abstract": "There are various parametric models for analyzing pairwise comparison data, including the Bradley–Terry–Luce (BTL) and Thurstone models, but their reliance on strong parametric assumptions is limiting. In this paper, we study a flexible model for pairwise comparisons, under which the probabilities of outcomes are required only to satisfy a natural form of stochastic transitivity. This class includes parametric models, including the BTL and Thurstone models as special cases, but is considerably more general. We provide various examples of models in this broader stochastically transitive class for which classical parametric models provide poor fits. Despite this greater flexibility, we show that the matrix of probabilities can be estimated at the same rate as in standard parametric models up to logarithmic terms. On the other hand, unlike in the BTL and Thurstone models, computing the minimax-optimal estimator in the stochastically transitive model is non-trivial, and we explore various computationally tractable alternatives. We show that a simple singular value thresholding algorithm is statistically consistent but does not achieve the minimax rate. We then propose and study algorithms that achieve the minimax rate over interesting sub-classes of the full stochastically transitive class. We complement our theoretical results with thorough numerical simulations.", "citation": "Citations (60)", "year": "2016", "departments": ["University of California, Berkeley", "Carnegie Mellon University", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Carnegie Mellon University", "University of California, Berkeley", "University of California, Berkeley"], "conf": "icml", "authors": ["Nihar B. Shah.....http://dblp.org/pers/hd/s/Shah:Nihar_B=", "Sivaraman Balakrishnan.....http://dblp.org/pers/hd/b/Balakrishnan:Sivaraman", "Aditya Guntuboyina.....http://dblp.org/pers/hd/g/Guntuboyina:Aditya", "Martin J. Wainwright.....http://dblp.org/pers/hd/w/Wainwright:Martin_J="], "pages": 10}