{"title": "Push-Button Verification of File Systems via Crash Refinement.", "fields": ["device file", "crash", "parallel computing", "class implementation file", "push button", "self certifying file system", "computer science", "journaling file system", "versioning file system"], "abstract": "The file system is an essential operating system component for persisting data on storage devices. Writing bug-free file systems is non-trivial, as they must correctly implement and maintain complex on-disk data structures even in the presence of system crashes and reorderings of disk operations.\n\nThis paper presents Yggdrasil, a toolkit for writing file systems with push-button verification: Yggdrasil requires no manual annotations or proofs about the implementation code, and it produces a counterexample if there is a bug. Yggdrasil achieves this automation through a novel definition of file system correctness called crash refinement, which requires the set of possible disk states produced by an implementation (including states produced by crashes) to be a subset of those allowed by the specification. Crash refinement is amenable to fully automated satisfiability modulo theories (SMT) reasoning, and enables developers to implement file systems in a modular way for verification.\n\nWith Yggdrasil, we have implemented and verified the Yxv6 journaling file system, the Ycp file copy utility, and the Ylog persistent log. Our experience shows that the ease of proof and counterexample-based debugging support make Yggdrasil practical for building reliable storage applications.", "citation": "Citations (9)", "departments": ["University of Washington", "University of Washington", "Carnegie Mellon University", "Carnegie Mellon University", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Helgi Sigurbjarnarson.....http://dblp.org/pers/hd/s/Sigurbjarnarson:Helgi", "James Bornholt.....http://dblp.org/pers/hd/b/Bornholt:James", "Emina Torlak.....http://dblp.org/pers/hd/t/Torlak:Emina", "Xi Wang.....http://dblp.org/pers/hd/w/Wang:Xi"], "conf": "osdi", "year": "2016", "pages": 16}