{"title": "Blocking for large-scale Entity Resolution: Challenges, algorithms, and practical examples.", "fields": ["toolbox", "data mining", "data integration", "name resolution", "schema"], "abstract": "Entity Resolution constitutes one of the cornerstone tasks for the integration of overlapping information sources. Due to its quadratic complexity, a large amount of research has focused on improving its efficiency so that it scales to Web Data collections, which are inherently voluminous and highly heterogeneous. The most common approach for this purpose is blocking, which clusters similar entities into blocks so that the pair-wise comparisons are restricted to the entities contained within each block. In this tutorial, we take a close look on blocking-based Entity Resolution, starting from the early blocking methods that were crafted for database integration. We highlight the challenges posed by contemporary heterogeneous, noisy, voluminous Web Data and explain why they render inapplicable these schema-based techniques. We continue with the presentation of blocking methods that have been developed for large-scale and heterogeneous information and are suitable for Web Data collections. We also explain how their efficiency can be further improved by meta-blocking and parallelization techniques. We conclude with a hands-on session that demonstrates the relative performance of several, state-of-the-art techniques. The participants of the tutorial will put in practice all the topics discussed in the theory part, and will get familiar with a reference toolbox, which includes the most prominent techniques in the area and can be readily used to tackle Entity Resolution problems.", "citation": "Citations (1)", "departments": ["National and Kapodistrian University of Athens", "Paris Descartes University"], "authors": ["George Papadakis.....http://dblp.org/pers/hd/p/Papadakis_0001:George", "Themis Palpanas.....http://dblp.org/pers/hd/p/Palpanas:Themis"], "conf": "icde", "year": "2016", "pages": 4}