{"title": "Detecting driver phone calls in a moving vehicle based on voice features.", "fields": ["mobile phone tracking", "phone", "uniqueness", "gsm services", "distraction"], "abstract": "The use of mobile phones while driving has become a major source of distraction to drivers, leading to a large number of car accidents. In this paper, we study the problem of automatically detecting driver phone calls by monitoring smartphone activities and utilizing the vehicle on-board unit. The challenges to overcome include: i) passenger phone calls should be allowed while the calls of the driver should be blocked; ii) the detection mechanism should be phone position-independent and phone owner-independent as the driver may put the smartphone at any position in the front row and make calls via an earphone, or the driver may borrow a passenger's phone to make a call; iii) the in-vehicle environment is noisy resulted from the operating engine, the music the driver and passenger may listen to, and the conversation between passengers and/or the driver; and iv) the computational cost at the smartphone should be light as realtime phone call detection is expected to effectively block an ongoing call to and from the driver. To overcome these challenges and achieve our objective of detecting driver phone calls, we take advantage of the uniqueness of individual's voice features. Through a short period of learning stage, our proposed system can recognize the driver's voice from the collected audio data. Combined with the smartphone's call state, our scheme can determine whether the driver is participating in the current phone call or not. Our strategy takes into account the complicated in-vehicle environment, and the proposed algorithm does not rely on the location of the phone within the vehicle nor the ownership of the smartphone, as the most existing driver phone call detection mechanisms do. We develop a client-server based system with the smartphones being the clients and the vehicle on-board unit being the server. To validate our mechanism, we perform extensive real-world experiments under different scenarios. The results demonstrate a high probability of detecting driver phone calls with a small false alarm rate.", "citation": "Citations (2)", "departments": ["George Washington University", "George Washington University", "George Washington University", "Qufu Normal University", "Beijing Normal University"], "authors": ["Tianyi Song.....http://dblp.org/pers/hd/s/Song:Tianyi", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen", "Hongjuan Li.....http://dblp.org/pers/hd/l/Li:Hongjuan", "Jiguo Yu.....http://dblp.org/pers/hd/y/Yu:Jiguo", "Shengling Wang.....http://dblp.org/pers/hd/w/Wang_0001:Shengling", "Rongfang Bie.....http://dblp.org/pers/hd/b/Bie:Rongfang"], "conf": "infocom", "year": "2016", "pages": 9}