{"title": "Work and Play: An Experiment in Enterprise Gamification.", "fields": ["game mechanics", "game design", "modular design", "extensibility", "web application"], "abstract": "In recent years, gamification, “the use of game design elements in non-game contexts”, has drawn the attention of an increasing number of scientists. Although several studies highlighted the benefits of gamification in many applications, its potential in the \\emph{enterprise} environment still needs to be fully understood.   This work contributes to the studies in enterprise gamification with an experiment performed at a large multinational company. The experiment involved 206 employees for a period of 2 months. We describe a modular and extensible framework for enterprise gamification, designed to seamlessly integrate with existing enterprise-class Web systems. We studied how a gamified tool can help to foster employees' engagement with such systems, by making day-to-day tasks more stimulating.   We show how different game mechanics can help to achieve two business needs, namely social interaction and learning. To this end, we exploited the gamification framework to develop a Q&A Web application combined with learning, news sharing, and social connections capabilities. Results provide strong evidence of how a gamified experience can foster learning and social behaviour in employees, and provide new insights about the effectiveness of several game mechanics in an enterprise context.", "citation": "Citations (19)", "departments": ["Delft University of Technology", "Delft University of Technology", "IBM", "Delft University of Technology"], "authors": ["Laurentiu Catalin Stanculescu.....http://dblp.org/pers/hd/s/Stanculescu:Laurentiu_Catalin", "Alessandro Bozzon.....http://dblp.org/pers/hd/b/Bozzon:Alessandro", "Robert-Jan Sips.....http://dblp.org/pers/hd/s/Sips:Robert=Jan", "Geert-Jan Houben.....http://dblp.org/pers/hd/h/Houben:Geert=Jan"], "conf": "cscw", "year": "2016", "pages": 13}