{"title": "Sidewinder: An Energy Efficient and Developer Friendly Heterogeneous Architecture for Continuous Mobile Sensing.", "fields": ["distributed computing", "efficient energy use", "participatory sensing", "architecture", "software deployment", "mobile device", "software portability", "computer science"], "abstract": "Applications that perform continuous sensing on mobile phones have the potential to revolutionize everyday life. Examples range from medical and health monitoring applications, such as pedometers and fall detectors, to participatory sensing applications, such as noise pollution, traffic and seismic activity monitoring. Unfortunately, current mobile devices are a poor match for continuous sensing applications as they require the device to remain awake for extended periods of time, resulting in poor battery life. This paper presents Sidewinder, a new approach towards offloading sensor data processing to a low-power processor and waking up the main processor when events of interest occur. This approach differs from other heterogeneous architectures in that developers are presented with a programming interface that lets them construct application specific wake-up conditions by linking together and parameterizing predefined sensor data processing algorithms. Our experiments indicate performance that is comparable to approaches that provide fully programmable offloading, but do so with a much simpler programming interface that facilitates deployment and portability.", "citation": "Not cited", "year": "2016", "departments": ["University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto"], "conf": "asplos", "authors": ["Daniyal Liaqat.....http://dblp.org/pers/hd/l/Liaqat:Daniyal", "Silviu Jingoi.....http://dblp.org/pers/hd/j/Jingoi:Silviu", "Eyal de Lara.....http://dblp.org/pers/hd/l/Lara:Eyal_de", "Ashvin Goel.....http://dblp.org/pers/hd/g/Goel:Ashvin", "Wilson To.....http://dblp.org/pers/hd/t/To:Wilson", "Kevin Lee.....http://dblp.org/pers/hd/l/Lee:Kevin", "Italo De Moraes Garcia.....http://dblp.org/pers/hd/g/Garcia:Italo_De_Moraes", "Manuel Saldaña.....http://dblp.org/pers/hd/s/Salda=ntilde=a:Manuel"], "pages": 11}