{"title": "Fiber optic vs. wireless sensors in energy-efficient integrated FiWi smart grid networks: An energy-delay and TCO comparison.", "fields": ["network performance", "time division multiple access", "backhaul", "smart grid", "fiber optic sensor"], "abstract": "This paper aims at designing an ecoconscious future-proof sensor enhanced fiber-wireless (SFiWi) network based on EPON, WLAN, wireless sensor (WS), and fiber optic sensor (FOS) technologies as a shared communications infrastructure for broadband access and smart grids. A total cost of ownership (TCO) model is developed to help utilities decide whether to deploy WSs or FOSs in different scenarios and estimate sensor-related costs. To prolong battery life of wireless devices and maximize the overall energy efficiency, a novel energy conservation scheme for SFiWi networks (ECO-SFiWi) is proposed. ECO-SFiWi designs the whole network in three TDMA layers to enhance network performance, while scheduling network components to sleep outside their transmission slots. A comprehensive energy saving model accounting for both optical backhaul and wireless front-end components and a delay analysis based on M/G/1 queuing are presented. Results reveal that with their extremely long lifetime and ability to sustain in harsh environments, FOSs are superior to WSs when advanced interrogation techniques are deployed to reduce their total cost. ECO-SFiWi achieves more than 89% of energy savings, while maintaining low delay for both broadband and smart grid traffic in typical scenarios. FPGA hardware emulation and analytical results match well verifying the effectiveness of ECO-SFiWi.", "citation": "Citations (5)", "departments": ["Institut national de la recherche scientifique", "Institut national de la recherche scientifique", "Optical Network ... hnology, Sweden"], "authors": ["Dung Pham Van.....http://dblp.org/pers/hd/v/Van:Dung_Pham", "Bhaskar Prasad Rimal.....http://dblp.org/pers/hd/r/Rimal:Bhaskar_Prasad", "Martin Maier.....http://dblp.org/pers/hd/m/Maier:Martin"], "conf": "infocom", "year": "2016", "pages": 9}