{"title": "SQL-SA for big data discovery polymorphic and parallelizable SQL user-defined scalar and aggregate infrastructure in Teradata Aster 6.20.", "fields": ["query by example", "stored procedure", "null", "end user", "pipeline"], "abstract": "There is increasing demand to integrate big data analytic systems using SQL. Given the vast ecosystem of SQL applications, enabling SQL capabilities allows big data platforms to expose their analytic potential to a wide variety of end users, accelerating discovery processes and providing significant business value. Most existing big data frameworks are based on one particular programming model such as MapReduce or Graph. However, data scientists are often forced to manually create adhoc data pipelines to connect various big data tools and platforms to serve their analytic needs. When the analytic tasks change, these data pipelines may be costly to modify and maintain. In this paper we present SQL-SA, a polymorphic and parallelizable SQL scalar and aggregate infrastructure in Aster 6.20. This infrastructure extends Aster 6's MapReduce and Graph capabilities to support polymorphic user-defined scalar and aggregate functions using flexible SQL syntax. The implementation enhances main Aster components including query syntax, API, planning and execution extensively. Integrating these new user-defined scalar and aggregate functions with Aster MapReduce and Graph functions, Aster 6.20 enables data scientists to integrate diverse programming models in a single SQL statement. The statement is automatically converted to an optimal data pipeline and executed in parallel. Using a real world business problem and data, Aster 6.20 demonstrates a significant performance advantage (25%+) over Hadoop Pig and Hive.", "citation": "Not cited", "departments": ["Teradata", "Teradata", "Teradata", "Teradata", "Teradata"], "authors": ["Xin Tang.....http://dblp.org/pers/hd/t/Tang:Xin", "Robert M. Wehrmeister.....http://dblp.org/pers/hd/w/Wehrmeister:Robert_M=", "James Shau.....http://dblp.org/pers/hd/s/Shau:James", "Abhirup Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Abhirup", "Daley Alex.....http://dblp.org/pers/hd/a/Alex:Daley", "Awny Al Omari.....http://dblp.org/pers/hd/o/Omari:Awny_Al", "Feven Atnafu.....http://dblp.org/pers/hd/a/Atnafu:Feven", "Jeff Davis.....http://dblp.org/pers/hd/d/Davis:Jeff", "Litao Deng.....http://dblp.org/pers/hd/d/Deng:Litao", "Deepak Jaiswal.....http://dblp.org/pers/hd/j/Jaiswal:Deepak", "Chittaranjan Keswani.....http://dblp.org/pers/hd/k/Keswani:Chittaranjan", "Yafeng Lu.....http://dblp.org/pers/hd/l/Lu:Yafeng", "Chao Ren.....http://dblp.org/pers/hd/r/Ren:Chao", "Tom Reyes.....http://dblp.org/pers/hd/r/Reyes:Tom", "Kashif Siddiqui.....http://dblp.org/pers/hd/s/Siddiqui:Kashif", "David E. Simmen.....http://dblp.org/pers/hd/s/Simmen:David_E=", "Devendra Vidhani.....http://dblp.org/pers/hd/v/Vidhani:Devendra", "Ling Wang.....http://dblp.org/pers/hd/w/Wang:Ling", "Shuai Yang.....http://dblp.org/pers/hd/y/Yang:Shuai", "Daniel Yu.....http://dblp.org/pers/hd/y/Yu:Daniel"], "conf": "icde", "year": "2016", "pages": 12}