{"title": "The Good, the Bad, and the Differences: Better Network Diagnostics with Differential Provenance.", "fields": ["network packet", "subnet", "root cause", "debugger", "form of the good"], "abstract": "In this paper, we propose a new approach to diagnosing problems in complex distributed systems. Our approach is based on the insight that many of the trickiest problems are anomalies. For instance, in a network, problems often affect only a small fraction of the traffic (e.g., perhaps a certain subnet), or they only manifest infrequently. Thus, it is quite common for the operator to have “examples” of both working and non-working traffic readily available – perhaps a packet that was misrouted, and a similar packet that was routed correctly. In this case, the cause of the problem is likely to be wherever the two packets were treated differently by the network.   We present the design of a debugger that can leverage this information using a novel concept that we call differential provenance. Differential provenance tracks the causal connections between network states and state changes, just like classical provenance, but it can additionally perform root-cause analysis by reasoning about the differences between two provenance trees. We have built a diagnostic tool that is based on differential provenance, and we have used our tool to debug a number of complex, realistic problems in two scenarios: software-defined networks and MapReduce jobs. Our results show that differential provenance can be maintained at relatively low cost, and that it can deliver very precise diagnostic information; in many cases, it can even identify the precise root cause of the problem.", "citation": "Citations (13)", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "Georgetown University", "University of Pennsylvania"], "authors": ["Ang Chen.....http://dblp.org/pers/hd/c/Chen:Ang", "Yang Wu.....http://dblp.org/pers/hd/w/Wu:Yang", "Andreas Haeberlen.....http://dblp.org/pers/hd/h/Haeberlen:Andreas", "Wenchao Zhou.....http://dblp.org/pers/hd/z/Zhou:Wenchao", "Boon Thau Loo.....http://dblp.org/pers/hd/l/Loo:Boon_Thau"], "conf": "sigcomm", "year": "2016", "pages": 14}