{"title": "Joint Word Representation Learning Using a Corpus and a Semantic Lexicon.", "fields": ["semantic lexicon", "semeval", "explicit semantic analysis", "semantic property", "semantic compression"], "abstract": "Methods for learning word representations using large text corpora have received much attention lately due to their impressive performance in numerous natural language processing (NLP) tasks such as, semantic similarity measurement, and word analogy detection. Despite their success, these data-driven word representation learning methods do not consider the rich semantic relational structure between words in a co-occurring context. On the other hand, already much manual effort has gone into the construction of semantic lexicons such as the WordNet that represent the meanings of words by defining the various relationships that exist among the words in a language. We consider the question, can we improve the word representations learnt using a corpora by integrating the knowledge from semantic lexicons?. For this purpose, we propose a joint word representation learning method that simultaneously predicts the co-occurrences of two words in a sentence subject to the relational constrains given by the semantic lexicon. We use relations that exist between words in the lexicon to regularize the word representations learnt from the corpus. Our proposed method statistically significantly outperforms previously proposed methods for incorporating semantic lexicons into word representations on several benchmark datasets for semantic similarity and word analogy.", "citation": "Citations (11)", "departments": ["University of Liverpool", "University of Liverpool", "Shizuoka University", "National Institute of Informatics"], "authors": ["Danushka Bollegala.....http://dblp.org/pers/hd/b/Bollegala:Danushka", "Mohammed Alsuhaibani.....http://dblp.org/pers/hd/a/Alsuhaibani:Mohammed", "Takanori Maehara.....http://dblp.org/pers/hd/m/Maehara:Takanori", "Ken-ichi Kawarabayashi.....http://dblp.org/pers/hd/k/Kawarabayashi:Ken=ichi"], "conf": "aaai", "year": "2016", "pages": 7}