{"title": "Continuous detection of design flaws in evolving object-oriented programs using incremental multi-pattern matching.", "fields": ["static program analysis", "code smell", "software maintenance", "software metric", "software construction"], "abstract": "Design flaws in object-oriented programs may seriously corrupt code quality thus increasing the risk for introducing subtle errors during software maintenance and evolution. Most recent approaches identify design flaws in an ad-hoc manner, either focusing on software metrics, locally restricted code smells, or on coarse-grained architectural anti-patterns. In this paper, we utilize an abstract program model capturing high-level object-oriented code entities, further augmented with qualitative and quantitative design-related information such as coupling/cohesion. Based on this model, we propose a comprehensive methodology for specifying object-oriented design flaws by means of compound rules integrating code metrics, code smells and anti-patterns in a modular way. This approach allows for efficient, automated design-flaw detection through incremental multi-pattern matching, by facilitating systematic information reuse among multiple detection rules as well as between subsequent detection runs on continuously evolving programs. Our tool implementation comprises well-known anti-patterns for Java programs. The results of our experimental evaluation show high detection precision, scalability to real-size programs, as well as a remarkable gain in efficiency due to information reuse.", "citation": "Citations (2)", "departments": ["University of Koblenz and Landau", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "Institute of So ... arburg, Germany"], "authors": ["Sven Peldszus.....http://dblp.org/pers/hd/p/Peldszus:Sven", "Géza Kulcsár.....http://dblp.org/pers/hd/k/Kulcs=aacute=r:G=eacute=za", "Malte Lochau.....http://dblp.org/pers/hd/l/Lochau:Malte", "Sandro Schulze.....http://dblp.org/pers/hd/s/Schulze:Sandro"], "conf": "kbse", "year": "2016", "pages": 12}