{"title": "Reducing Solid-State Storage Device Write Stress through Opportunistic In-place Delta Compression.", "fields": ["cache", "lossless compression", "write buffer", "solid state storage", "delta encoding"], "abstract": "Inside modern SSDs, a small portion of MLC/TLC NAND flash memory blocks operate in SLC-mode to serve as write buffer/cache and/or store hot data. These SLC-mode blocks absorb a large percentage of write operations. To balance memory wear-out, such MLC/TLC-to-SLC configuration rotates among all the memory blocks inside SSDs. This paper presents a simple yet effective design approach to reduce write stress on SLC-mode flash blocks and hence improve the overall SSD lifetime. The key is to implement well-known delta compression without being subject to the read latency and data management complexity penalties inherent to conventional practice. The underlying theme is to leverage the partial programmability of SLC-mode flash memory pages to ensure that the original data and all the subsequent deltas always reside in the same memory physical page. To avoid the storage capacity overhead, we further propose to combine intra-sector lossless data compression with intra-page delta compression, leading to opportunistic in-place delta compression. This paper presents specific techniques to address important issues for its practical implementation, including data error correction, and intra-page data placement and management. We carried out comprehensive experiments, simulations, and ASIC (application-specific integrated circuit) design. The results show that the proposed design solution can largely reduce the write stress on SLC-mode flash memory pages without significant latency overhead and meanwhile incurs relatively small silicon implementation cost.", "citation": "Citations (11)", "departments": ["Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "SanDisk", "Rensselaer Polytechnic Institute"], "authors": ["Xuebin Zhang.....http://dblp.org/pers/hd/z/Zhang:Xuebin", "Jiangpeng Li.....http://dblp.org/pers/hd/l/Li:Jiangpeng", "Hao Wang.....http://dblp.org/pers/hd/w/Wang_0042:Hao", "Kai Zhao.....http://dblp.org/pers/hd/z/Zhao_0005:Kai", "Tong Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Tong"], "conf": "fast", "year": "2016", "pages": 14}