{"title": "Improved Masking for Tweakable Blockciphers with Applications to Authenticated Encryption.", "fields": ["logarithm", "distributed computing", "authenticated encryption", "parallelizable manifold", "microarchitecture", "computer science", "masking", "cycles per byte"], "abstract": "A popular approach to tweakable blockcipher design is via masking, where a certain primitive a blockcipher or a permutation is preceded and followed by an easy-to-compute tweak-dependent mask. In this work, we revisit the principle of masking. We do so alongside the introduction of the tweakable Even-Mansour construction $$\\mathsf {MEM}$$MEM. Its masking function combines the advantages of word-oriented LFSR- and powering-up-based methods. We show in particular how recent advancements in computing discrete logarithms over finite fields of characteristic 2 can be exploited in a constructive way to realize highly efficient, constant-time masking functions. If the masking satisfies a set of simple conditions, then $$\\mathsf {MEM}$$MEM is a secure tweakable blockcipher upi¾?to the birthday bound. The strengths of $$\\mathsf {MEM}$$MEM are exhibited by the design of fully parallelizable authenticated encryption schemes $$\\mathsf {OPP}$$OPP nonce-respecting and $$\\mathsf {MRO}$$MRO misuse-resistant. If instantiated with a reduced-round BLAKE2b permutation, $$\\mathsf {OPP}$$OPP and $$\\mathsf {MRO}$$MRO achieve speeds upi¾?to 0.55 and 1.06 cycles per byte on the Intel Haswell microarchitecture, and are able to significantly outperform their closest competitors.", "citation": "Not cited", "year": "2016", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Katholieke Universiteit Leuven", "University of Coimbra"], "conf": "eurocrypt", "authors": ["Robert Granger.....http://dblp.org/pers/hd/g/Granger:Robert", "Philipp Jovanovic.....http://dblp.org/pers/hd/j/Jovanovic:Philipp", "Bart Mennink.....http://dblp.org/pers/hd/m/Mennink:Bart", "Samuel Neves.....http://dblp.org/pers/hd/n/Neves:Samuel"], "pages": 31}