{"title": "Distillation as a Defense to Adversarial Perturbations Against Deep Neural Networks.", "fields": ["deep learning", "adversarial system", "distillation", "adversarial machine learning", "online machine learning"], "abstract": "Deep learning algorithms have been shown to perform extremely well on manyclassical machine learning problems. However, recent studies have shown thatdeep learning, like other machine learning techniques, is vulnerable to adversarial samples: inputs crafted to force adeep neural network (DNN) to provide adversary-selected outputs. Such attackscan seriously undermine the security of the system supported by the DNN, sometimes with devastating consequences. For example, autonomous vehicles canbe crashed, illicit or illegal content can bypass content filters, or biometricauthentication systems can be manipulated to allow improper access. In thiswork, we introduce a defensive mechanism called defensive distillationto reduce the effectiveness of adversarial samples on DNNs. We analyticallyinvestigate the generalizability and robustness properties granted by the useof defensive distillation when training DNNs. We also empirically study theeffectiveness of our defense mechanisms on two DNNs placed in adversarialsettings. The study shows that defensive distillation can reduce effectivenessof sample creation from 95% to less than 0.5% on a studied DNN. Such dramaticgains can be explained by the fact that distillation leads gradients used inadversarial sample creation to be reduced by a factor of 1030. We alsofind that distillation increases the average minimum number of features thatneed to be modified to create adversarial samples by about 800% on one of theDNNs we tested.", "citation": "Citations (379)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "United States Army Research Laboratory"], "authors": ["Nicolas Papernot.....http://dblp.org/pers/hd/p/Papernot:Nicolas", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D=", "Xi Wu.....http://dblp.org/pers/hd/w/Wu_0001:Xi", "Somesh Jha.....http://dblp.org/pers/hd/j/Jha:Somesh", "Ananthram Swami.....http://dblp.org/pers/hd/s/Swami:Ananthram"], "conf": "sp", "year": "2016", "pages": 16}