{"title": "The Snowflake Elastic Data Warehouse.", "fields": ["data warehouse", "sql", "software as a service", "snowflake", "upload"], "abstract": "We live in the golden age of distributed computing. Public cloud platforms now offer virtually unlimited compute and storage resources on demand. At the same time, the Software-as-a-Service (SaaS) model brings enterprise-class systems to users who previously could not afford such systems due to their cost and complexity. Alas, traditional data warehousing systems are struggling to fit into this new environment. For one thing, they have been designed for fixed resources and are thus unable to leverage the cloud's elasticity. For another thing, their dependence on complex ETL pipelines and physical tuning is at odds with the flexibility and freshness requirements of the cloud's new types of semi-structured data and rapidly evolving workloads. We decided a fundamental redesign was in order. Our mission was to build an enterprise-ready data warehousing solution for the cloud. The result is the Snowflake Elastic Data Warehouse, or \"Snowflake\" for short. Snowflake is a multi-tenant, transactional, secure, highly scalable and elastic system with full SQL support and built-in extensions for semi-structured and schema-less data. The system is offered as a pay-as-you-go service in the Amazon cloud. Users upload their data to the cloud and can immediately manage and query it using familiar tools and interfaces. Implementation began in late 2012 and Snowflake has been generally available since June 2015. Today, Snowflake is used in production by a growing number of small and large organizations alike. The system runs several million queries per day over multiple petabytes of data.   In this paper, we describe the design of Snowflake and its novel multi-cluster, shared-data architecture. The paper highlights some of the key features of Snowflake: extreme elasticity and availability, semi-structured and schema-less data, time travel, and end-to-end security. It concludes with lessons learned and an outlook on ongoing work.", "citation": "Citations (9)", "year": "2016", "departments": ["Snowflake Compu ...  Mateo, CA, USA", "Snowflake Compu ...  Mateo, CA, USA", "Snowflake Compu ...  Mateo, CA, USA", "Snowflake Compu ...  Mateo, CA, USA", "Snowflake Compu ...  Mateo, CA, USA"], "conf": "sigmod", "authors": ["Benoît Dageville.....http://dblp.org/pers/hd/d/Dageville:Beno=icirc=t", "Thierry Cruanes.....http://dblp.org/pers/hd/c/Cruanes:Thierry", "Marcin Zukowski.....http://dblp.org/pers/hd/z/Zukowski:Marcin", "Vadim Antonov.....http://dblp.org/pers/hd/a/Antonov:Vadim", "Artin Avanes.....http://dblp.org/pers/hd/a/Avanes:Artin", "Jon Bock.....http://dblp.org/pers/hd/b/Bock:Jon", "Jonathan Claybaugh.....http://dblp.org/pers/hd/c/Claybaugh:Jonathan", "Daniel Engovatov.....http://dblp.org/pers/hd/e/Engovatov:Daniel", "Martin Hentschel.....http://dblp.org/pers/hd/h/Hentschel_0001:Martin", "Jiansheng Huang.....http://dblp.org/pers/hd/h/Huang:Jiansheng", "Allison W. Lee.....http://dblp.org/pers/hd/l/Lee:Allison_W=", "Ashish Motivala.....http://dblp.org/pers/hd/m/Motivala:Ashish", "Abdul Q. Munir.....http://dblp.org/pers/hd/m/Munir:Abdul_Q=", "Steven Pelley.....http://dblp.org/pers/hd/p/Pelley:Steven", "Peter Povinec.....http://dblp.org/pers/hd/p/Povinec:Peter", "Greg Rahn.....http://dblp.org/pers/hd/r/Rahn:Greg", "Spyridon Triantafyllis.....http://dblp.org/pers/hd/t/Triantafyllis:Spyridon", "Philipp Unterbrunner.....http://dblp.org/pers/hd/u/Unterbrunner:Philipp"], "pages": 12}