{"title": "Ensemble of Sparse Cross-Modal Metrics for Heterogeneous Face Recognition.", "fields": ["ensemble learning", "facial recognition system", "expression", "feature selection", "modalities"], "abstract": "Heterogeneous face recognition aims to identify or verify person identity by matching facial images of different modalities. In practice, it is known that its performance is highly influenced by modality inconsistency, appearance occlusions, illumination variations and expressions. In this paper, a new method named as ensemble of sparse cross-modal metrics is proposed for tackling these challenging issues. In particular, a weak sparse cross-modal metric learning method is firstly developed to measure distances between samples of two modalities. It learns to adjust rank-one cross-modal metrics to satisfy two sets of triplet based cross-modal distance constraints in a compact form. Meanwhile, a group based feature selection is performed to enforce that features in the same position of two modalities are selected simultaneously. By neglecting features that attribute to \"noise\" in the face regions (eye glasses, expressions and so on), the performance of learned weak metrics can be markedly improved. Finally, an ensemble framework is incorporated to combine the results of differently learned sparse metrics into a strong one. Extensive experiments on various face datasets demonstrate the benefit of such feature selection especially when heavy occlusions exist. The proposed ensemble metric learning has been shown superiority over several state-of-the-art methods in heterogeneous face recognition.", "citation": "Citations (2)", "departments": ["Nanjing University", "Nanjing University", "Nanjing University", "Nanjing Normal University", "University of Manchester"], "authors": ["Jing Huo.....http://dblp.org/pers/hd/h/Huo:Jing", "Yang Gao.....http://dblp.org/pers/hd/g/Gao_0001:Yang", "Yinghuan Shi.....http://dblp.org/pers/hd/s/Shi:Yinghuan", "Wanqi Yang.....http://dblp.org/pers/hd/y/Yang:Wanqi", "Hujun Yin.....http://dblp.org/pers/hd/y/Yin:Hujun"], "conf": "mm", "year": "2016", "pages": 10}