{"title": "New Insights on AES-Like SPN Ciphers.", "fields": ["key schedule", "distributed computing", "block size", "linear span", "cipher", "computer science", "whirlpool", "theoretical computer science"], "abstract": "It has been proved in Eurocrypti¾?2016 by Sun et al. that if the details of the S-boxes are not exploited, an impossible differential and a zero-correlation linear hull can extend over at most 4 rounds of the AES. This paper concentrates on distinguishing properties of AES-like SPN ciphers by investigating the details of both the underlying S-boxes and the MDS matrices, and illustrates some new insights on the security of these schemes. Firstly, we construct several types of 5-round zero-correlation linear hulls for AES-like ciphers that adopt identical S-boxes to construct the round function and that have two identical elements in a column of the inverse of their MDS matrices. We then use these linear hulls to construct 5-round integrals provided that the difference of two sub-key bytes is known. Furthermore, we prove that we can always distinguish 5 rounds of such ciphers from random permutations even when the difference of the sub-keys is unknown. Secondly, the constraints for the S-boxes and special property of the MDS matrices can be removed if the cipher is used as a building block of the Miyaguchi-Preneel hash function. As an example, we construct two types of 5-round distinguishers for the hash function Whirlpool. Finally, we show that, in the chosen-ciphertext mode, there exist some nontrivial distinguishers for 5-round AES. To the best of our knowledge, this is the longest distinguisher for the round-reduced AES in the secret-key setting. Since the 5-round distinguisher for the AES can only be constructed in the chosen-ciphertext mode, the security margin for the round-reduced AES under the chosen-plaintext attack may be different from that under the chosen-ciphertext attack.", "citation": "Citations (8)", "departments": ["National University of Defense Technology", "Chinese Academy of Sciences", "Nanyang Technological University", "National University of Defense Technology", "Katholieke Universiteit Leuven"], "authors": ["Bing Sun.....http://dblp.org/pers/hd/s/Sun:Bing", "Meicheng Liu.....http://dblp.org/pers/hd/l/Liu:Meicheng", "Jian Guo.....http://dblp.org/pers/hd/g/Guo_0001:Jian", "Longjiang Qu.....http://dblp.org/pers/hd/q/Qu:Longjiang", "Vincent Rijmen.....http://dblp.org/pers/hd/r/Rijmen:Vincent"], "conf": "crypto", "year": "2016", "pages": 20}