{"title": "High-Throughput Semi-Honest Secure Three-Party Computation with an Honest Majority.", "fields": ["secure multi party computation", "secure two party computation", "kerberos", "key distribution center", "throughput", "computer science", "computation", "login", "theoretical computer science"], "abstract": "In this paper, we describe a new information-theoretic protocol (and a computationally-secure variant) for secure three-party computation with an honest majority. The protocol has very minimal computation and communication; for Boolean circuits, each party sends only a single bit for every AND gate (and nothing is sent for XOR gates). Our protocol is (simulation-based) secure in the presence of semi-honest adversaries, and achieves privacy in the client/server model in the presence of malicious adversaries. On a cluster of three 20-core servers with a 10Gbps connection, the implementation of our protocol carries out over 1.3 million AES computations per second, which involves processing over 7 billion gates per second. In addition, we developed a Kerberos extension that replaces the ticket-granting-ticket encryption on the Key Distribution Center (KDC) in MIT-Kerberos with our protocol, using keys/ passwords that are shared between the servers. This enables the use of Kerberos while protecting passwords. Our implementation is able to support a login storm of over 35,000 logins per second, which suffices even for very large organizations. Our work demonstrates that high-throughput secure computation is possible on standard hardware.", "citation": "Not cited", "year": "2016", "departments": ["NEC", "NEC", "Bar-Ilan University", "Bar-Ilan University", "NEC"], "conf": "ccs", "authors": ["Toshinori Araki.....http://dblp.org/pers/hd/a/Araki:Toshinori", "Jun Furukawa.....http://dblp.org/pers/hd/f/Furukawa_0001:Jun", "Yehuda Lindell.....http://dblp.org/pers/hd/l/Lindell:Yehuda", "Ariel Nof.....http://dblp.org/pers/hd/n/Nof:Ariel", "Kazuma Ohara.....http://dblp.org/pers/hd/o/Ohara:Kazuma"], "pages": 13}