{"title": "Subexponential Parameterized Algorithms for Planar and Apex-Minor-Free Graphs via Low Treewidth Pattern Covering.", "fields": ["clique sum", "pathwidth", "forbidden graph characterization", "tree depth", "partial k tree"], "abstract": "We prove the following theorem. Given a planar graph G and an integer k, it is possible in polynomial time to randomly sample a subset A of vertices of G with the following properties: ● A induces a subgraph of G of treewidth O(√k log k), and ● for every connected subgraph H of G on at most k vertices, the probability that A covers the whole vertex set of H is at least (2O(√k log2 k)· nO(1))-1, where n is the number of vertices of G. Together with standard dynamic programming techniques for graphs of bounded treewidth, this result gives a versatile technique for obtaining (randomized) subexponential parameterized algorithms for problems on planar graphs, usually with running time bound 2O(√ k log2 k) nO(1). The technique can be applied to problems expressible as searching for a small, connected pattern with a prescribed property in a large host graph, examples of such problems include DIRECTED k-Path, WEIGHTED k-Path, VERTEX COVER LOCAL SEARCH, and SUBGRAPH ISOMORPHISM, among others. Up to this point, it was open whether these problems can be solved in subexponential parameterized time on planar graphs, because they are not amenable to the classic technique of bidimensionality. Furthermore, all our results hold in fact on any class of graphs that exclude a fixed apex graph as a minor, in particular on graphs embeddable in any fixed surface.", "citation": "Citations (3)", "departments": ["University of Bergen", "University of Bergen", "Hungarian Academy of Sciences", "University of Warwick", "University of Warsaw"], "authors": ["Fedor V. Fomin.....http://dblp.org/pers/hd/f/Fomin:Fedor_V=", "Daniel Lokshtanov.....http://dblp.org/pers/hd/l/Lokshtanov:Daniel", "Dániel Marx.....http://dblp.org/pers/hd/m/Marx:D=aacute=niel", "Marcin Pilipczuk.....http://dblp.org/pers/hd/p/Pilipczuk:Marcin", "Michal Pilipczuk.....http://dblp.org/pers/hd/p/Pilipczuk:Michal", "Saket Saurabh.....http://dblp.org/pers/hd/s/Saurabh_0001:Saket"], "conf": "focs", "year": "2016", "pages": 10}