{"title": "Mosaic: A low-cost mobile sensing system for urban air quality monitoring.", "fields": ["filter", "airflow", "small number", "system deployment", "air quality index"], "abstract": "Air quality monitoring has attracted a lot of attention from governments, academia and industry, especially for PM2.5 due to its significant impact on our respiratory systems. In this paper, we present the design, implementation, and evaluation of Mosaic, a low cost urban PM2.5 monitoring system based on mobile sensing. In Mosaic, a small number of air quality monitoring nodes are deployed on city buses to measure air quality. Current low-cost particle sensors based on light-scattering, however, are vulnerable to airflow disturbance on moving vehicles. In order to address this problem, we build our air quality monitoring nodes, Mosaic-Nodes, with a novel constructive airflow-disturbance design based on a carefully tuned airflow structure and a GPS-assisted filtering method. Further, the buses used for system deployment are selected by a novel algorithm which achieves both high coverage and low computation overhead. The collected sensor data is also used to calculate the PM2.5 of locations without direct measurements by an existing inference model. We apply the Mosaic system in a testing urban area which includes more than 70 point-of-interests. Results show that the Mosaic system can accurately obtain the urban air quality with high coverage and low cost.", "citation": "Citations (18)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "McGill University", "Zhejiang University"], "authors": ["Yi Gao.....http://dblp.org/pers/hd/g/Gao:Yi", "Wei Dong.....http://dblp.org/pers/hd/d/Dong_0001:Wei", "Kai Guo.....http://dblp.org/pers/hd/g/Guo:Kai", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Yuan Chen.....http://dblp.org/pers/hd/c/Chen:Yuan", "Xiaojin Liu.....http://dblp.org/pers/hd/l/Liu:Xiaojin", "Jiajun Bu.....http://dblp.org/pers/hd/b/Bu:Jiajun", "Chun Chen.....http://dblp.org/pers/hd/c/Chen:Chun"], "conf": "infocom", "year": "2016", "pages": 9}