{"title": "Zephyr: Ubiquitous accurate multi-sensor fusion-based respiratory rate estimation using smartphones.", "fields": ["estimator", "signal processing", "accelerometer", "respiratory rate", "sensor fusion"], "abstract": "Human respiratory rate is widely recognized as a vital measure of a patient's health and a primary indicator of several medical problems. Yet, it is usually ignored by medical practitioners due to limitations with available measurements techniques that are either performed through visual counting by trained personnel or using invasive and/or devices limited to medical facilities. We present Zephyr, a ubiquitous low-cost smartphone-based robust respiratory rate estimator. Our analysis shows that accelerometer and gyroscope measurements from a standard smartphone held on a person's chest is affected by her respiration cycle. Zephyr employs a series of signal processing modules to extract the breathing signal from the noisy inertial sensor measurements and handle noisy user movements. Furthermore, as part of Zephyr design, we propose a novel respiratory rate signal quality estimate that we leverage through a probabilistic framework to fuse the estimates from the different sensors, leading to a robust respiratory rate estimate. Implementation of the system on different off-the-shelf Android devices using more than 150 experiments with seven participants of different ages and genders under different typical settings with a side-by-side comparison to a commercial device shows that Zephyr can estimate the user's respiratory rate accurately with a median absolute error of 0.04 breaths per minute in realtime. In addition, Zephyr's quality-based probabilistic framework improves the respiratory rate estimation by more than 51% as compared to using any of the individual sensor measurements. This remarkable accuracy is achieved within 30 seconds of measurements, highlighting the viability of Zephyr as a ubiquitous low-cost respiratory rate estimator.", "citation": "Citations (12)", "departments": ["University of Maryland, College Park", "Jordan University of Science and Technology"], "authors": ["Heba Aly.....http://dblp.org/pers/hd/a/Aly:Heba", "Moustafa Youssef.....http://dblp.org/pers/hd/y/Youssef:Moustafa"], "conf": "infocom", "year": "2016", "pages": 9}