{"title": "Toward compositional verification of interruptible OS kernels and device drivers.", "fields": ["kernel", "correctness", "system software", "real time computing", "proof assistant", "abstraction layer"], "abstract": "An operating system (OS) kernel forms the lowest level of any system software stack. The correctness of the OS kernel is the basis for the correctness of the entire system. Recent efforts have demonstrated the feasibility of building formally verified general-purpose kernels, but it is unclear how to extend their work to verify the functional correctness of device drivers, due to the non-local effects of interrupts. In this paper, we present a novel compositional framework for building certified interruptible OS kernels with device drivers. We provide a general device model that can be instantiated with various hardware devices, and a realistic formal model of interrupts, which can be used to reason about interruptible code. We have realized this framework in the Coq proof assistant. To demonstrate the effectiveness of our new approach, we have successfully extended an existing verified non-interruptible kernel with our framework and turned it into an interruptible kernel with verified device drivers. To the best of our knowledge, this is the first verified interruptible operating system with device drivers.", "citation": "Citations (14)", "departments": ["University of Electronic Science and Technology of China", "Yale University", "Yale University", "Yale University", "Yale University", "Yale University", "University of Electronic Science and Technology of China", "Yale University", "Yale University", "Yale University", "Yale University"], "authors": ["Hao Chen.....http://dblp.org/pers/hd/c/Chen_0023:Hao", "Xiongnan (Newman) Wu.....http://dblp.org/pers/hd/w/Wu:Xiongnan_=Newman=", "Zhong Shao.....http://dblp.org/pers/hd/s/Shao:Zhong", "Joshua Lockerman.....http://dblp.org/pers/hd/l/Lockerman:Joshua", "Ronghui Gu.....http://dblp.org/pers/hd/g/Gu:Ronghui"], "conf": "pldi", "year": "2016", "pages": 17}