{"title": "TicToc: Time Traveling Optimistic Concurrency Control.", "fields": ["timestamp based concurrency control", "isolation", "optimistic concurrency control", "non lock concurrency control", "multiversion concurrency control"], "abstract": "Concurrency control for on-line transaction processing (OLTP) database management systems (DBMSs) is a nasty game. Achieving higher performance on emerging many-core systems is difficult. Previous research has shown that timestamp management is the key scalability bottleneck in concurrency control algorithms. This prevents the system from scaling to large numbers of cores. In this paper we present TicToc, a new optimistic concurrency control algorithm that avoids the scalability and concurrency bottlenecks of prior T/O schemes. TicToc relies on a novel and provably correct data-driven timestamp management protocol. Instead of assigning timestamps to transactions, this protocol assigns read and write timestamps to data items and uses them to lazily compute a valid commit timestamp for each transaction. TicToc removes the need for centralized timestamp allocation, and commits transactions that would be aborted by conventional T/O schemes. We implemented TicToc along with four other concurrency control algorithms in an in-memory, shared-everything OLTP DBMS and compared their performance on different workloads. Our results show that TicToc achieves up to 92% better throughput while reducing the abort rate by 3.3x over these previous algorithms.", "citation": "Citations (17)", "year": "2016", "departments": ["Massachusetts Institute of Technology", "Carnegie Mellon University", "Massachusetts Institute of Technology", "Massachusetts I ... bridge, MA, USA"], "conf": "sigmod", "authors": ["Xiangyao Yu.....http://dblp.org/pers/hd/y/Yu:Xiangyao", "Andrew Pavlo.....http://dblp.org/pers/hd/p/Pavlo:Andrew", "Daniel Sánchez.....http://dblp.org/pers/hd/s/S=aacute=nchez_0003:Daniel", "Srinivas Devadas.....http://dblp.org/pers/hd/d/Devadas:Srinivas"], "pages": 14}