{"title": "Multimedia and Medicine: Teammates for Better Disease Detection and Survival.", "fields": ["scalability", "automatic summarization", "competence", "data analysis", "endoscope"], "abstract": "Health care has a long history of adopting technology to save lives and improve the quality of living. Visual information is frequently applied for disease detection and assessment, and the established fields of computer vision and medical imaging provide essential tools. It is, however, a misconception that disease detection and assessment are provided exclusively by these fields and that they provide the solution for all challenges. Integration and analysis of data from several sources, real-time processing, and the assessment of usefulness for end-users are core competences of the multimedia community and are required for the successful improvement of health care systems. We have conducted initial investigations into two use cases surrounding diseases of the gastrointestinal (GI) tract, where the detection of abnormalities provides the largest chance of successful treatment if the initial observation of disease indicators occurs before the patient notices any symptoms. Although such detection is typically provided visually by applying an endoscope, we are facing a multitude of new multimedia challenges that differ between use cases. In real-time assistance for colonoscopy, we combine sensor information about camera position and direction to aid in detecting, investigate means for providing support to doctors in unobtrusive ways, and assist in reporting. In the area of large-scale capsular endoscopy, we investigate questions of scalability, performance and energy efficiency for the recording phase, and combine video summarization and retrieval questions for analysis.", "citation": "Citations (16)", "departments": ["Simula Research Laboratory", "Simula Research Laboratory", "University of Catania", "Vestre Viken Hospital Trust", "Klagenfurt Univ ... enfurt, Austria"], "authors": ["Michael Riegler.....http://dblp.org/pers/hd/r/Riegler:Michael", "Mathias Lux.....http://dblp.org/pers/hd/l/Lux:Mathias", "Carsten Griwodz.....http://dblp.org/pers/hd/g/Griwodz:Carsten", "Concetto Spampinato.....http://dblp.org/pers/hd/s/Spampinato:Concetto", "Thomas de Lange.....http://dblp.org/pers/hd/l/Lange:Thomas_de", "Sigrun Losada Eskeland.....http://dblp.org/pers/hd/e/Eskeland:Sigrun_Losada", "Konstantin Pogorelov.....http://dblp.org/pers/hd/p/Pogorelov:Konstantin", "Wallapak Tavanapong.....http://dblp.org/pers/hd/t/Tavanapong:Wallapak", "Peter Thelin Schmidt.....http://dblp.org/pers/hd/s/Schmidt:Peter_Thelin", "Cathal Gurrin.....http://dblp.org/pers/hd/g/Gurrin:Cathal", "Dag Johansen.....http://dblp.org/pers/hd/j/Johansen:Dag", "Håvard D. Johansen.....http://dblp.org/pers/hd/j/Johansen:H=aring=vard_D=", "Pål Halvorsen.....http://dblp.org/pers/hd/h/Halvorsen:P=aring=l"], "conf": "mm", "year": "2016", "pages": 10}