{"title": "DRIVING: Distributed Scheduling for Video Streaming in Vehicular Wi-Fi Systems.", "fields": ["network packet", "latency", "antenna array", "goodput", "hotspot"], "abstract": "Video streaming has been dominating the mobile bandwidth, and is still expanding drastically. Its tremendous economic benefits have driven the automobile industry to equip vehicles with video streaming capacity. As a result, the new in-cabin Wi-Fi systems have been deployed, enabling each vehicle as a streaming hotspot on the wheels. A built-in Access Point (AP) bridges the communications between Wi-Fi devices inside and cellular networks outside. Distinct advantages offered by this system include a more powerful antenna array to improve multimedia quality, a constant energy source to power the streaming, etc. However, there exist two challenging features that may jeopardize the system performance. (1) The in-cabin Wi-Fi hotspots are mostly deployed on private vehicles, and thus are completely decentralized. (2) Video packets need to be delivered before their deadlines with small delays. Due to these features, existing algorithms may fail to efficiently schedule the in-cabin Wi-Fi video streaming. To fill the gap, we propose the Delay-awaRe dIstributed Video schedulING (DRIVING) framework. Being fully distributed and delay-aware, DRIVING not only increases the streaming goodput, but also reduces the delivery latency and deadline missing ratio. %In order to optimize this new framework, we establish cross-layer analytical models, which help us tune the framework parameters for better performance. In a typical scenario, DRIVING increases the goodput by up to 27.0%, while reducing the queueing delay and the deadline missing ratio by up to 40.0% and 38.4%, respectively.", "citation": "Citations (1)", "departments": ["McGill University", "General Motors", "Yale University", "McGill University", "General Motors"], "authors": ["Xi Chen.....http://dblp.org/pers/hd/c/Chen_0009:Xi", "Lei Rao.....http://dblp.org/pers/hd/r/Rao:Lei", "Qiao Xiang.....http://dblp.org/pers/hd/x/Xiang:Qiao", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Fan Bai.....http://dblp.org/pers/hd/b/Bai:Fan"], "conf": "mm", "year": "2016", "pages": 10}