{"title": "FPTree: A Hybrid SCM-DRAM Persistent and Concurrent B-Tree for Storage Class Memory.", "fields": ["dram", "b tree", "transactional memory", "data management", "concurrency"], "abstract": "The advent of Storage Class Memory (SCM) is driving a rethink of storage systems towards a single-level architecture where memory and storage are merged. In this context, several works have investigated how to design persistent trees in SCM as a fundamental building block for these novel systems. However, these trees are significantly slower than DRAM-based counterparts since trees are latency-sensitive and SCM exhibits higher latencies than DRAM. In this paper we propose a novel hybrid SCM-DRAM persistent and concurrent B-Tree, named Fingerprinting Persistent Tree (FPTree) that achieves similar performance to DRAM-based counterparts. In this novel design, leaf nodes are persisted in SCM while inner nodes are placed in DRAM and rebuilt upon recovery. The FPTree uses Fingerprinting, a technique that limits the expected number of in-leaf probed keys to one. In addition, we propose a hybrid concurrency scheme for the FPTree that is partially based on Hardware Transactional Memory. We conduct a thorough performance evaluation and show that the FPTree outperforms state-of-the-art persistent trees with different SCM latencies by up to a factor of 8.2. Moreover, we show that the FPTree scales very well on a machine with 88 logical cores. Finally, we integrate the evaluated trees in memcached and a prototype database. We show that the FPTree incurs an almost negligible performance overhead over using fully transient data structures, while significantly outperforming other persistent trees.", "citation": "Citations (23)", "year": "2016", "departments": ["Dresden University of Technology", "Intel", "Dresden University of Technology", "SAP SE, Walldorf, Germany", "SAP SE, Waterloo, ON, Canada"], "conf": "sigmod", "authors": ["Ismail Oukid.....http://dblp.org/pers/hd/o/Oukid:Ismail", "Johan Lasperas.....http://dblp.org/pers/hd/l/Lasperas:Johan", "Anisoara Nica.....http://dblp.org/pers/hd/n/Nica:Anisoara", "Thomas Willhalm.....http://dblp.org/pers/hd/w/Willhalm:Thomas", "Wolfgang Lehner.....http://dblp.org/pers/hd/l/Lehner:Wolfgang"], "pages": 16}