{"title": "SHARE Interface in Flash Storage for Relational and NoSQL Databases.", "fields": ["write amplification", "database tuning", "flash file system", "journaling file system", "consistency"], "abstract": "Database consistency and recoverability require guaranteeing write atomicity for one or more pages. However, contemporary database systems consider write operations non-atomic. Thus, many database storage engines have traditionally relied on either journaling or copy-on-write approaches for atomic propagation of updated pages to the storage. This reliance achieves write atomicity at the cost of various write amplifications such as redundant writes, tree-wandering, and compaction. This write amplification results in reduced performance and, for flash storage, accelerates device wear-out. In this paper, we propose a flash storage interface, SHARE. Being able to explicitly remap the address mapping inside flash storage using SHARE interface enables host-side database storage engines to achieve write atomicity without causing write amplification. We have implemented SHARE on a real SSD board, OpenSSD, and modified MySQL/InnoDB and Couchbase NoSQL storage engines to make them compatible with the extended SHARE interface. Our experimental results show that this SHARE-based MySQL/InnoDB and Couchbase configurations can significantly boost database performance. In particular, the inevitable and costly Couchbase compaction process can complete without copying any data pages.", "citation": "Citations (8)", "year": "2016", "departments": ["Sungkyunkwan University", "Samsung", "Sungkyunkwan University", "Couchbase, Inc. ... anta Clara, USA", "Couchbase, Inc. ... anta Clara, USA"], "conf": "sigmod", "authors": ["Gihwan Oh.....http://dblp.org/pers/hd/o/Oh:Gihwan", "Chiyoung Seo.....http://dblp.org/pers/hd/s/Seo:Chiyoung", "Ravi Mayuram.....http://dblp.org/pers/hd/m/Mayuram:Ravi", "Yang-Suk Kee.....http://dblp.org/pers/hd/k/Kee:Yang=Suk", "Sang-Won Lee.....http://dblp.org/pers/hd/l/Lee_0001:Sang=Won"], "pages": 12}