{"title": "Approxilyzer: Towards a systematic framework for instruction-level approximate computing and its application to hardware resiliency.", "fields": ["address space layout randomization", "timing attack", "trade off", "approximate computing", "side channel attack"], "abstract": "Approximate computing environments trade off computational accuracy for improvements in performance, energy, and resiliency cost. For widespread adoption of approximate computing, a fundamental requirement is to understand how perturbations to a computation affect the outcome of the execution in terms of its output quality.   This paper presents a framework for approximate computing, called  Approxilyzer , that quantifies the quality impact of a single-bit error in  all dynamic instructions  of an execution with high accuracy (95% on average). We demonstrate two uses of Approxilyzer. First, we show how Approxilyzer can be used to quantitatively tune output quality vs. resiliency vs. overhead to enable ultra-low cost resiliency solutions (with a single bit error model). For example, we show that Approxilyzer determines that a very small loss in output quality (1%) can yield large resiliency overhead reduction (up to 55%) for 99% resiliency coverage. Second, we show how Approxilyzer can be used to provide a first-order estimate of the approximation potential of general-purpose programs. It does so in an automated way while requiring minimal user input and no program modifications. This enables programmers or other tools to focus on the promising subset of approximable instructions for further analysis.", "citation": "Citations (10)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Nvidia", "University of Illinois at Urbana–Champaign"], "authors": ["Radha Venkatagiri.....http://dblp.org/pers/hd/v/Venkatagiri:Radha", "Abdulrahman Mahmoud.....http://dblp.org/pers/hd/m/Mahmoud:Abdulrahman", "Siva Kumar Sastry Hari.....http://dblp.org/pers/hd/h/Hari:Siva_Kumar_Sastry", "Sarita V. Adve.....http://dblp.org/pers/hd/a/Adve:Sarita_V="], "conf": "micro", "year": "2016", "pages": 14}