{"title": "An Experimental Comparison of Thirteen Relational Equi-Joins in Main Memory.", "fields": ["hash join", "recursive join", "sort merge join", "hash table", "query plan"], "abstract": "Relational equi-joins are at the heart of almost every query plan. They have been studied, improved, and reexamined on a regular basis since the existence of the database community. In the past four years several new join algorithms have been proposed and experimentally evaluated. Some of those papers contradict each other in their experimental findings. This makes it surprisingly hard to answer a very simple question: what is the fastest join algorithm in 2015? In this paper we will try to develop an answer. We start with an end-to-end black box comparison of the most important methods. Afterwards, we inspect the internals of these algorithms in a white box comparison. We derive improved variants of state-of-the-art join algorithms by applying optimizations like~software-write combine buffers, various hash table implementations, as well as NUMA-awareness in terms of data placement and scheduling. We also inspect various radix partitioning strategies. Eventually, we are in the position to perform a comprehensive comparison of thirteen different join algorithms. We factor in scaling effects in terms of size of the input datasets, the number of threads, different page sizes, and data distributions. Furthermore, we analyze the impact of various joins on an (unchanged) TPC-H query. Finally, we conclude with a list of major lessons learned from our study and a guideline for practitioners implementing massive main-memory joins. As is the case with almost all algorithms in databases, we will learn that there is no single best join algorithm. Each algorithm has its strength and weaknesses and shines in different areas of the parameter space.", "citation": "Citations (15)", "year": "2016", "departments": ["Saarland University", "Saarland University", "Saarland University"], "conf": "sigmod", "authors": ["Stefan Schuh.....http://dblp.org/pers/hd/s/Schuh:Stefan", "Xiao Chen.....http://dblp.org/pers/hd/c/Chen:Xiao", "Jens Dittrich.....http://dblp.org/pers/hd/d/Dittrich:Jens"], "pages": 16}