{"title": "Programmable Packet Scheduling at Line Rate.", "fields": ["fixed priority pre emptive scheduling", "two level scheduling", "round robin scheduling", "lottery scheduling", "earliest deadline first scheduling"], "abstract": "Switches today provide a small menu of scheduling algorithms. While we can tweak scheduling parameters, we cannot modify algorithmic logic, or add a completely new algorithm, after the switch has been designed. This paper presents a design for a {\\em programmable} packet scheduler, which allows scheduling algorithms---potentially algorithms that are unknown today---to be programmed into a switch without requiring hardware redesign.   Our design uses the property that scheduling algorithms make two decisions: in what order to schedule packets and when to schedule them. Further, we observe that in many scheduling algorithms, definitive decisions on these two questions can be made when packets are enqueued. We use these observations to build a programmable scheduler using a single abstraction: the push-in first-out queue (PIFO), a priority queue that maintains the scheduling order or time.   We show that a PIFO-based scheduler lets us program a wide variety of scheduling algorithms. We present a hardware design for this scheduler for a 64-port 10 Gbit/s shared-memory (output-queued) switch. Our design costs an additional 4% in chip area. In return, it lets us program many sophisticated algorithms, such as a 5-level hierarchical scheduler with programmable decisions at each level.", "citation": "Citations (25)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Cisco Systems, Inc.", "Cisco Systems, Inc."], "authors": ["Anirudh Sivaraman.....http://dblp.org/pers/hd/s/Sivaraman:Anirudh", "Suvinay Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Suvinay", "Mohammad Alizadeh.....http://dblp.org/pers/hd/a/Alizadeh:Mohammad", "Sharad Chole.....http://dblp.org/pers/hd/c/Chole:Sharad", "Shang-Tse Chuang.....http://dblp.org/pers/hd/c/Chuang:Shang=Tse", "Anurag Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Anurag", "Hari Balakrishnan.....http://dblp.org/pers/hd/b/Balakrishnan:Hari", "Tom Edsall.....http://dblp.org/pers/hd/e/Edsall:Tom", "Sachin Katti.....http://dblp.org/pers/hd/k/Katti:Sachin", "Nick McKeown.....http://dblp.org/pers/hd/m/McKeown:Nick"], "conf": "sigcomm", "year": "2016", "pages": 14}