{"title": "Reusable Fuzzy Extractors for Low-Entropy Distributions.", "fields": ["random oracle", "reusability", "key derivation function", "hamming code", "string"], "abstract": "Fuzzy extractors Dodis et al., Eurocrypt 2004 convert repeated noisy readings of a secret into the same uniformly distributed key. To eliminate noise, they require an initial enrollment phase that takes the first noisy reading of the secret and produces a nonsecret helper string to be used in subsequent readings. Reusable fuzzy extractors Boyen, CCS 2004 remain secure even when this initial enrollment phase is repeated multiple times with noisy versions of the same secret, producing multiple helper strings for example, when a single person's biometric is enrolled with multiple unrelated organizations.\n\nWe construct the first reusable fuzzy extractor that makes no assumptions about how multiple readings of the source are correlated the only prior construction assumed a very specific, unrealistic class of correlations. The extractor works for binary strings with Hamming noise; it achieves computational security under assumptions on the security of hash functions or in the random oracle model. It is simple and efficient and tolerates near-linear error rates.\n\nOur reusable extractor is secure for source distributions of linear min-entropy rate. The construction is also secure for sources with much lower entropy rates--lower than those supported by prior nonreusable constructions--assuming that the distribution has some additional structure, namely, that random subsequences of the source have sufficient minentropy. We show that such structural assumptions are necessary to support low entropy rates.\n\nWe then explore further how different structural properties of a noisy source can be used to construct fuzzy extractors when the error rates are high, building a computationally secure and an information-theoretically secure construction for large-alphabet sources.", "citation": "Citations (16)", "year": "2016", "departments": ["Tel Aviv University", "Massachusetts Institute of Technology", "Boston University", "Boston University", "Pennsylvania State University"], "conf": "eurocrypt", "authors": ["Ran Canetti.....http://dblp.org/pers/hd/c/Canetti:Ran", "Benjamin Fuller.....http://dblp.org/pers/hd/f/Fuller:Benjamin", "Omer Paneth.....http://dblp.org/pers/hd/p/Paneth:Omer", "Leonid Reyzin.....http://dblp.org/pers/hd/r/Reyzin:Leonid", "Adam D. Smith.....http://dblp.org/pers/hd/s/Smith:Adam_D="], "pages": 30}