{"title": "Battery-free sensing platform for wearable devices: The synergy between two feet.", "fields": ["power management", "energy harvesting", "battery", "wearable technology", "bluetooth"], "abstract": "Recent years have witnessed the prevalence of wearable devices. Wearable devices are intelligent and multifunctional, but they rely heavily on batteries. This greatly limits their application scope, where replacement of battery or recharging is challenging or inconvenient. We note that wearable devices have the opportunity to harvest energy from human motion, as they are worn by the people as long as being functioning. In this study, we propose a battery-free sensing platform for wearable devices in the form-factor of shoes. It harvests the kinetic energy from walking or running to supply devices with power for sensing, processing and wireless communication, covering all the functionalities of commercial wearable devices. We achieve this goal by enabling the whole system running on the harvested energy from two feet. Each foot performs separate tasks and two feet are coordinated by ambient backscatter communication. We instantiate this idea by building a prototype, containing energy harvesting insoles, power management circuits and ambient backscatter module. Evaluation results demonstrate that the system can wake up shortly after several seconds' walk and have sufficient Bluetooth throughput for supporting many applications. We believe that our framework can stir a lot of useful applications that were infeasible previously.", "citation": "Citations (5)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Huazhong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Qianyi Huang.....http://dblp.org/pers/hd/h/Huang:Qianyi", "Yan Mei.....http://dblp.org/pers/hd/m/Mei:Yan", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0050:Wei", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "conf": "infocom", "year": "2016", "pages": 9}