{"title": "Work stealing for interactive services to meet target latency.", "fields": ["job shop scheduling", "latency", "model predictive control", "thread", "work stealing"], "abstract": "Interactive web services increasingly drive critical business workloads such as search, advertising, games, shopping, and finance. Whereas optimizing parallel programs and distributed server systems have historically focused on average latency and throughput, the primary metric for interactive applications is instead consistent responsiveness, i.e., minimizing the number of requests that miss a target latency. This paper is the first to show how to generalize work-stealing, which is traditionally used to minimize the makespan of a single parallel job, to optimize for a target latency in interactive services with multiple parallel requests.   We design a new adaptive work stealing policy, called  tail-control , that reduces the number of requests that miss a target latency. It uses instantaneous request progress, system load, and a target latency to choose when to parallelize requests with stealing, when to admit new requests, and when to limit parallelism of large requests. We implement this approach in the Intel Thread Building Block (TBB) library and evaluate it on real-world workloads and synthetic workloads. The tail-control policy substantially reduces the number of requests exceeding the desired target latency and delivers up to 58% relative improvement over various baseline policies. This generalization of work stealing for multiple requests effectively optimizes the number of requests that complete within a target latency, a key metric for interactive services.", "citation": "Citations (5)", "year": "2016", "departments": ["Washington University in St. Louis", "Washington University in St. Louis", "Microsoft", "Microsoft", "Washington University in St. Louis"], "conf": "ppopp", "authors": ["Jing Li.....http://dblp.org/pers/hd/l/Li_0025:Jing", "Kunal Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Kunal", "Sameh Elnikety.....http://dblp.org/pers/hd/e/Elnikety:Sameh", "Yuxiong He.....http://dblp.org/pers/hd/h/He:Yuxiong", "I-Ting Angelina Lee.....http://dblp.org/pers/hd/l/Lee:I=Ting_Angelina", "Chenyang Lu.....http://dblp.org/pers/hd/l/Lu:Chenyang", "Kathryn S. McKinley.....http://dblp.org/pers/hd/m/McKinley:Kathryn_S="], "pages": 13}