{"title": "pSCAN: Fast and exact structural graph clustering.", "fields": ["strength of a graph", "hypercube graph", "quartic graph", "biconnected graph", "factor critical graph"], "abstract": "In this paper, we study the problem of structural graph clustering, a fundamental problem in managing and analyzing graph data. Given a large graph G = (V, E), structural graph clustering is to assign vertices in V to clusters and to identify the sets of hub vertices and outlier vertices as well, such that vertices in the same cluster are densely connected to each other while vertices in different clusters are loosely connected to each other. Firstly, we prove that the existing SCAN approach is worst-case optimal. Nevertheless, it is still not scalable to large graphs due to exhaustively computing structural similarity for every pair of adjacent vertices. Secondly, we make three observations about structural graph clustering, which present opportunities for further optimization. Based on these observations, in this paper we develop a new two-step paradigm for scalable structural graph clustering. Thirdly, following this paradigm, we present a new approach aiming to reduce the number of structural similarity computations. Moreover, we propose optimization techniques to speed up checking whether two vertices are structure-similar to each other. Finally, we conduct extensive performance studies on large real and synthetic graphs, which demonstrate that our new approach outperforms the state-of-the-art approaches by over one order of magnitude. Noticeably, for the twitter graph with 1 billion edges, our approach takes 25 minutes while the state-of-the-art approach cannot finish even after 24 hours.", "citation": "Citations (14)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "University of Technology, Sydney", "University of New South Wales"], "authors": ["Lijun Chang.....http://dblp.org/pers/hd/c/Chang:Lijun", "Wei Li.....http://dblp.org/pers/hd/l/Li:Wei", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Lu Qin.....http://dblp.org/pers/hd/q/Qin:Lu", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie"], "conf": "icde", "year": "2016", "pages": 12}