{"title": "RescueDP: Real-time spatio-temporal crowd-sourced data publishing with differential privacy.", "fields": ["data publishing", "differential privacy", "mobile phone", "streaming data", "privacy software"], "abstract": "Nowadays gigantic crowd-sourced data collected from mobile phone users have become widely available, which enables the possibility of many important data mining applications to improve the quality of our daily lives. While providing tremendous benefits, the release of these data to the public will pose a considerable threat to mobile users' privacy. To solve this problem, the notion of differential privacy has been proposed to provide privacy with theoretical guarantee, and recently it has been applied in streaming data publishing. However, most of the existing literature focus on either event-level privacy on infinite streams or user-level privacy on finite streams. In this paper, we investigate the problem of real-time spatiotemporal crowd-sourced data publishing with privacy preservation. Specifically, we consider continuous publication of population statistics for monitoring purposes and design RescueDP — an online aggregate monitoring scheme over infinite streams with privacy guarantee. RescueDP's key components include adaptive sampling, adaptive budget allocation, dynamic grouping, perturbation and filtering, which are seamlessly integrated as a whole to provide privacy-preserving statistics publishing on infinite time stamps. We show that RescueDP can achieve w-event privacy over data generated and published periodically by crowd users. We evaluate our scheme with real-world as well as synthetic datasets and compare it with two w-event privacy-assured representative benchmarks. Experimental results show that our solution outperforms the existing methods and improves the utility with strong privacy guarantee.", "citation": "Citations (9)", "departments": ["Wuhan University", "Wuhan University", "Wuhan University", "Wuhan University", "Wuhan University"], "authors": ["Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Yan Zhang.....http://dblp.org/pers/hd/z/Zhang:Yan", "Xiao Lu.....http://dblp.org/pers/hd/l/Lu:Xiao", "Zhibo Wang.....http://dblp.org/pers/hd/w/Wang:Zhibo", "Zhan Qin.....http://dblp.org/pers/hd/q/Qin:Zhan", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui"], "conf": "infocom", "year": "2016", "pages": 9}