{"title": "Matrix Sketching Over Sliding Windows.", "fields": ["augmented matrix", "state transition matrix", "convergent matrix", "generator matrix", "essential matrix"], "abstract": "Large-scale matrix computation becomes essential for many data data applications, and hence the problem of sketching matrix with small space and high precision has received extensive study for the past few years. This problem is often considered in the row-update streaming model, where the data set is a matrix A -- R n x d , and the processor receives a row (1 x d) of A at each timestamp. The goal is to maintain a smaller matrix (termed approximation matrix, or simply approximation) B -- R l x d  as an approximation to A, such that the covariance error |A T  A - B T B| is small and l ll n.   This paper studies continuous tracking approximations to the matrix defined by a sliding window of most recent rows. We consider both sequence-based and time-based window. We show that maintaining A T A exactly requires linear space in the sliding window model, as opposed to O(d 2 ) space in the streaming model. With this observation, we present three general frameworks for matrix sketching on sliding windows. The sampling techniques give random samples of the rows in the window according to their squared norms. The Logarithmic Method converts a  mergeable  streaming matrix sketch into a matrix sketch on time-based sliding windows. The Dyadic Interval framework converts arbitrary streaming matrix sketch into a matrix sketch on sequence-based sliding windows. In addition to proving all algorithmic properties theoretically, we also conduct extensive empirical study with real data sets to demonstrate the efficiency of these algorithms.", "citation": "Citations (7)", "year": "2016", "departments": ["Renmin University of China", "Renmin University of China", "University of Utah", "Renmin University of China", "Renmin University of China"], "conf": "sigmod", "authors": ["Zhewei Wei.....http://dblp.org/pers/hd/w/Wei:Zhewei", "Xuancheng Liu.....http://dblp.org/pers/hd/l/Liu:Xuancheng", "Feifei Li.....http://dblp.org/pers/hd/l/Li_0001:Feifei", "Shuo Shang.....http://dblp.org/pers/hd/s/Shang:Shuo", "Xiaoyong Du.....http://dblp.org/pers/hd/d/Du:Xiaoyong", "Ji-Rong Wen.....http://dblp.org/pers/hd/w/Wen:Ji=Rong"], "pages": 16}