{"title": "The Death and Life of Great Italian Cities: A Mobile Phone Data Perspective.", "fields": ["open data", "urban studies", "census", "road map", "mobile phone"], "abstract": "The Death and Life of Great American Cities was written in 1961 and is now one of the most influential book in city planning. In it, Jane Jacobs proposed four conditions that promote life in a city. However, these conditions have not been empirically tested until recently. This is mainly because it is hard to collect data about \"city life\". The city of Seoul recently collected pedestrian activity through surveys at an unprecedented scale, with an effort spanning more than a decade, allowing researchers to conduct the first study successfully testing Jacobs's conditions.\n\nIn this paper, we identify a valuable alternative to the lengthy and costly collection of activity survey data: mobile phone data. We extract human activity from such data, collect land use and socio-demographic information from the Italian Census and Open Street Map, and test the four conditions in six Italian cities. Although these cities are very different from the places for which Jacobs's conditions were spelled out (i.e., great American cities) and from the places in which they were recently tested (i.e., the Asian city of Seoul), we find those conditions to be indeed associated with urban life in Italy as well. Our methodology promises to have a great impact on urban studies, not least because, if replicated, it will make it possible to test Jacobs's theories at scale.", "citation": "Citations (52)", "departments": ["fondazione bruno kessler", "University of Paris", "Telecom Italia", "University of Trento", "Bell Labs"], "authors": ["Marco De Nadai.....http://dblp.org/pers/hd/n/Nadai:Marco_De", "Jacopo Staiano.....http://dblp.org/pers/hd/s/Staiano:Jacopo", "Roberto Larcher.....http://dblp.org/pers/hd/l/Larcher:Roberto", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu", "Daniele Quercia.....http://dblp.org/pers/hd/q/Quercia:Daniele", "Bruno Lepri.....http://dblp.org/pers/hd/l/Lepri:Bruno"], "conf": "www", "year": "2016", "pages": 11}