{"title": "Perilla: metadata-based optimizations of an asynchronous runtime for adaptive mesh refinement.", "fields": ["data mining", "asynchronous communication", "runtime system", "search engine", "speedup", "adaptive mesh refinement", "hardware architecture", "software framework", "metadata", "legacy code"], "abstract": "Hardware architecture is increasingly complex, urging the development of asynchronous runtime systems with advance resource and locality management supports. However, these supports may come at the cost of complicating the user interface while programming remains one of the major constraints to wide adoption of asynchronous runtimes in practice. In this paper, we propose a solution that leverages application metadata to enable challenging optimizations as well as to facilitate the task of transforming legacy code to an asynchronous representation. We develop  Perilla , a task graph-based runtime system that requires only modest programming effort. Perilla utilizes metadata of an AMR software framework to enable various optimizations at the communication layer without complicating its API. Experimental results with different applications on up to 24K processor cores show that Perilla can realize up to 1.44x speedup over the synchronous code variant. The metadata enabled optimizations account for 25% to 100% of the performance improvement.", "citation": "Not cited", "departments": ["Lawrence Berkeley National Laboratory", "Koç University", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Koç University"], "authors": ["Tan Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tan", "Didem Unat.....http://dblp.org/pers/hd/u/Unat:Didem", "Weiqun Zhang.....http://dblp.org/pers/hd/z/Zhang:Weiqun", "Ann S. Almgren.....http://dblp.org/pers/hd/a/Almgren:Ann_S=", "Muhammed Nufail Farooqi.....http://dblp.org/pers/hd/f/Farooqi:Muhammed_Nufail", "John Shalf.....http://dblp.org/pers/hd/s/Shalf:John"], "conf": "sc", "year": "2016", "pages": 12}