{"title": "Graph Analytics Through Fine-Grained Parallelism.", "fields": ["wait for graph", "analytics", "optimistic concurrency control", "speedup", "concurrency control"], "abstract": "Large graphs are getting increasingly popular and even indispensable in many applications, for example, in social media data, large networks, and knowledge bases. Efficient graph analytics thus becomes an important subject of study. To increase efficiency and scalability, in-memory computation and parallelism have been explored extensively to speed up various graph analytical workloads. In many graph analytical engines (e.g., Pregel, Neo4j, GraphLab), parallelism is achieved via one of the three concurrency control models, namely, bulk synchronization processing (BSP), asynchronous processing, and synchronous processing. Among them, synchronous processing has the potential to achieve the best performance due to fine-grained parallelism, while ensuring the correctness and the convergence of the computation, if an effective concurrency control scheme is used. This paper explores the topological properties of the underlying graph to design and implement a highly effective concurrency control scheme for efficient synchronous processing in an in-memory graph analytical engine. Our design uses a novel hybrid approach that combines 2PL (two-phase locking) with OCC (optimistic concurrency control), for high degree and low degree vertices in a graph respectively. Our results show that the proposed hybrid synchronous scheduler has significantly outperformed other synchronous schedulers in existing graph analytical engines, as well as BSP and asynchronous schedulers.", "citation": "Citations (4)", "year": "2016", "departments": ["The Chinese University of Hong Kong", "University of Utah", "The Chinese University of Hong Kong", "Hong Kong Baptist University", "The Chinese University of Hong Kong"], "conf": "sigmod", "authors": ["Zechao Shang.....http://dblp.org/pers/hd/s/Shang:Zechao", "Feifei Li.....http://dblp.org/pers/hd/l/Li_0001:Feifei", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Zhiwei Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhiwei", "Hong Cheng.....http://dblp.org/pers/hd/c/Cheng:Hong"], "pages": 16}