{"title": "DBSherlock: A Performance Diagnostic Tool for Transactional Databases.", "fields": ["transactional leadership", "database tuning", "database administrator", "debugging", "online transaction processing"], "abstract": "Running an online transaction processing (OLTP) system is one of the most daunting tasks required of database administrators (DBAs). As businesses rely on OLTP databases to support their mission-critical and real-time applications, poor database performance directly impacts their revenue and user experience. As a result, DBAs constantly monitor, diagnose, and rectify any performance decays. Unfortunately, the manual process of debugging and diagnosing OLTP performance problems is extremely tedious and non-trivial. Rather than being caused by a single slow query, performance problems in OLTP databases are often due to a large number of concurrent and competing transactions adding up to compounded, non-linear effects that are difficult to isolate. Sudden changes in request volume, transactional patterns, network traffic, or data distribution can cause previously abundant resources to become scarce, and the performance to plummet.   This paper presents a practical tool for assisting DBAs in quickly and reliably diagnosing performance problems in an OLTP database. By analyzing hundreds of statistics and configurations collected over the lifetime of the system, our algorithm quickly identifies a small set of potential causes and presents them to the DBA. The root-cause established by the DBA is reincorporated into our algorithm as a new causal model to improve future diagnoses. Our experiments show that this algorithm is substantially more accurate than the state-of-the-art algorithm in finding correct explanations.", "citation": "Citations (10)", "year": "2016", "departments": ["University of Michigan", "University of Michigan", "University of Michigan"], "conf": "sigmod", "authors": ["Dong Young Yoon.....http://dblp.org/pers/hd/y/Yoon:Dong_Young", "Ning Niu.....http://dblp.org/pers/hd/n/Niu:Ning", "Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan"], "pages": 16}