{"title": "Quality-driven disorder handling for m-way sliding window stream joins.", "fields": ["stream processing", "sliding window protocol", "network delay", "joins", "operator"], "abstract": "Sliding window join is one of the most important operators for stream applications. To produce high quality join results, a stream processing system must deal with the ubiquitous disorder within input streams which is caused by network delay, parallel processing, etc. Disorder handling involves an inevitable tradeoff between the latency and the quality of produced join results. To meet different requirements of stream applications, it is desirable to provide a user-configurable result-latency vs. result-quality tradeoff. Existing disorder handling approaches either do not provide such configurability, or support only user-specified latency constraints. In this work, we advocate the idea of quality-driven disorder handling, and propose a buffer-based disorder handling approach for sliding window joins, which minimizes sizes of input-sorting buffers, thus the result latency, while respecting user-specified result-quality requirements. The core of our approach is an analytical model which directly captures the relationship between sizes of input buffers and the produced result quality. Our approach is generic. It supports m-way sliding window joins with arbitrary join conditions. Experiments on real-world and synthetic datasets show that, compared to the state of the art, our approach can reduce the result latency incurred by disorder handling by up to 95% while providing the same level of result quality.", "citation": "Citations (3)", "departments": ["SAP SE, Germany", "SAP SE, Germany", "SAP SE, Canada", "SAP SE, Germany", "SAP SE, Germany"], "authors": ["Yuanzhen Ji.....http://dblp.org/pers/hd/j/Ji:Yuanzhen", "Jun Sun.....http://dblp.org/pers/hd/s/Sun:Jun", "Anisoara Nica.....http://dblp.org/pers/hd/n/Nica:Anisoara", "Zbigniew Jerzak.....http://dblp.org/pers/hd/j/Jerzak:Zbigniew", "Gregor Hackenbroich.....http://dblp.org/pers/hd/h/Hackenbroich:Gregor", "Christof Fetzer.....http://dblp.org/pers/hd/f/Fetzer:Christof"], "conf": "icde", "year": "2016", "pages": 12}