{"title": "Differentially private multi-party high-dimensional data publishing.", "fields": ["publishing", "bayesian network", "clustering high dimensional data", "dynamic programming", "differential privacy"], "abstract": "In this paper, we study the novel problem of publishing high-dimensional data in a distributed multi-party environment under differential privacy. In particular, with the assistance of a semi-trusted curator, the involved parties (i.e., local data owners) collectively generate a synthetic integrated dataset while satisfying e-differential privacy for any local dataset. To solve this problem, we present a differentially private sequential update of Bayesian network (DP-SUBN) solution. In DP-SUBN, the parties and the curator collaboratively identify the Bayesian network ℕ that best fits the integrated dataset D in a sequential manner, from which a synthetic dataset can then be generated. The fundamental advantage of adopting the sequential update manner is that the parties can treat the statistical results provided by previous parties as their prior knowledge to direct how to learn ℕ. The core of DP-SUBN is the construction of the search frontier, which can be seen as a priori knowledge to guide the parties to update ℕ. To improve the fitness of ℕ and reduce the communication cost, we introduce a correlation-aware search frontier construction (CSFC) approach, where attribute pairs with strong correlations are used to construct the search frontier. In particular, to privately quantify the correlations of attribute pairs without introducing too much noise, we first propose a non-overlapping covering design (NOCD) method, and then introduce a dynamic programming method to find the optimal parameters used in NOCD to ensure that the injected noise is minimum. Through formal privacy analysis, we show that DP-SUBN satisfies e-differential privacy for any local dataset. Extensive experiments on a real dataset demonstrate that DP-SUBN offers desirable data utility with low communication cost.", "citation": "Citations (5)", "departments": ["Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Samsung", "Beijing University of Posts and Telecommunications"], "authors": ["Sen Su.....http://dblp.org/pers/hd/s/Su:Sen", "Peng Tang.....http://dblp.org/pers/hd/t/Tang:Peng", "Xiang Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Xiang", "Rui Chen.....http://dblp.org/pers/hd/c/Chen:Rui", "Zequn Wu.....http://dblp.org/pers/hd/w/Wu:Zequn"], "conf": "icde", "year": "2016", "pages": 12}