{"title": "Vendors¿ Perspectives of Coordination in the Information Technology Offshore Outsourcing Industry: An Exploratory Study from the Philippines.", "fields": ["exploratory research", "newly industrialized country", "thematic analysis", "computer supported cooperative work", "outsourcing", "offshore outsourcing", "virtual team"], "abstract": "This study investigates how offshore information technology (IT) service providers (vendors) coordinate work with their clients (employers) in order to succeed in the global IT offshore outsourcing industry. We reviewed literature on coordination studies, interviewed offshore service providers in the Philippines, and used thematic analysis to analyse coordination practices from the point of view of these individual vendors in a newly industrialized country. We used Olson and Olsonâ  s framework on â  collaboration at a distanceâ   as a lens to structure the results. The study provides an understanding of vendorsâ   individual attitudes towards the coordination of distributed work and draws attention to how differences in power affect the work situation of vendors, and by implication all stakeholders. We offer this insight as a way to enhance existing CSCW frameworks, by imbuing them with the perspective of non-equal relationships. The study found that vendors were generally able to produce outputs that satisfy their clients, however these results were only achieved because individuals were willing to take risks and make sacrifices in their personal lives. The relationship was further characterised by a complex interplay between the clientâ  s control of the overall work arrangements and the vendorsâ   ability to establish a level of autonomy in their work practices and their flexible use of coordination tools.", "citation": "Not cited", "departments": ["Mindanao State University – Iligan Institute of Technology", "Queensland University of Technology", "Queensland University of Technology"], "authors": ["Aloha May Hufana Ambe.....http://dblp.org/pers/hd/a/Ambe:Aloha_May_Hufana", "Margot F. Brereton.....http://dblp.org/pers/hd/b/Brereton:Margot_F=", "Markus Rittenbruch.....http://dblp.org/pers/hd/r/Rittenbruch:Markus"], "conf": "cscw", "year": "2016", "pages": 16}