{"title": "Adaptive Logging: Optimizing Logging and Recovery Costs in Distributed In-memory Databases.", "fields": ["transaction processing", "bottleneck", "online transaction processing", "data logger", "two phase commit protocol"], "abstract": "By maintaining the data in main memory, in-memory databases dramatically reduce the I/O cost of transaction processing. However, for recovery purposes, in-memory systems still need to flush the log to disk, which incurs a substantial number of I/Os. Recently, command logging has been proposed to replace the traditional data log (e.g., ARIES logging) in in-memory databases. Instead of recording how the tuples are updated, command logging only tracks the transactions that are being executed, thereby effectively reducing the size of the log and improving the performance. However, when a failure occurs, all the transactions in the log after the last checkpoint must be redone sequentially and this significantly increases the cost of recovery. In this paper, we first extend the command logging technique to a distributed system, where all the nodes can perform their recovery in parallel. We show that in a distributed system, the only bottleneck of recovery caused by command logging is the synchronization process that attempts to resolve the data dependency among the transactions. We then propose an adaptive logging approach by combining data logging and command logging. The percentage of data logging versus command logging becomes a tuning knob between the performance of transaction processing and recovery to meet different OLTP requirements, and a model is proposed to guide such tuning. Our experimental study compares the performance of our proposed adaptive logging, ARIES-style data logging and command logging on top of H-Store. The results show that adaptive logging can achieve a 10x boost for recovery and a transaction throughput that is comparable to that of command logging.", "citation": "Citations (9)", "year": "2016", "departments": ["National University of Singapore", "University of California, Santa Barbara", "Zhejiang University", "National University of Singapore", "Zhejiang University"], "conf": "sigmod", "authors": ["Chang Yao.....http://dblp.org/pers/hd/y/Yao:Chang", "Divyakant Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Divyakant", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Sai Wu.....http://dblp.org/pers/hd/w/Wu:Sai"], "pages": 16}