{"title": "Discovering interpretable geo-social communities for user behavior prediction.", "fields": ["graph partition", "semantic similarity", "interpretability", "probabilistic logic", "generative model"], "abstract": "Social community detection is a growing field of interest in the area of social network applications, and many approaches have been developed, including graph partitioning, latent space model, block model and spectral clustering. Most existing work purely focuses on network structure information which is, however, often sparse, noisy and lack of interpretability. To improve the accuracy and interpretability of community discovery, we propose to infer users' social communities by incorporating their spatiotemporal data and semantic information. Technically, we propose a unified probabilistic generative model, User-Community-Geo-Topic (UCGT), to simulate the generative process of communities as a result of network proximities, spatiotemporal co-occurrences and semantic similarity. With a well-designed multi-component model structure and a parallel inference implementation to leverage the power of multicores and clusters, our UCGT model is expressive while remaining efficient and scalable to growing large-scale geo-social networking data. We deploy UCGT to two application scenarios of user behavior predictions: check-in prediction and social interaction prediction. Extensive experiments on two large-scale geo-social networking datasets show that UCGT achieves better performance than existing state-of-the-art comparison methods.", "citation": "Citations (30)", "departments": ["University of Queensland", "Carnegie Mellon University", "University of Queensland", "Chinese Academy of Sciences", "University of Queensland"], "authors": ["Hongzhi Yin.....http://dblp.org/pers/hd/y/Yin:Hongzhi", "Zhiting Hu.....http://dblp.org/pers/hd/h/Hu:Zhiting", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang", "Hao Wang.....http://dblp.org/pers/hd/w/Wang_0005:Hao", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Nguyen Quoc Viet Hung.....http://dblp.org/pers/hd/h/Hung:Nguyen_Quoc_Viet", "Shazia Wasim Sadiq.....http://dblp.org/pers/hd/s/Sadiq:Shazia_Wasim"], "conf": "icde", "year": "2016", "pages": 12}