{"title": "SABER: Window-Based Hybrid Stream Processing for Heterogeneous Architectures.", "fields": ["stream processing", "hybrid scheduling", "general purpose computing on graphics processing units", "data parallelism", "sql"], "abstract": "Modern servers have become heterogeneous, often combining multi-core CPUs with many-core GPGPUs. Such heterogeneous architectures have the potential to improve the performance of data-intensive stream processing applications, but they are not supported by current relational stream processing engines. For an engine to exploit a heterogeneous architecture, it must execute streaming SQL queries with sufficient data-parallelism to fully utilise all available heterogeneous processors, and decide how to use each in the most effective way. It must do this while respecting the semantics of streaming SQL queries, in particular with regard to window handling.   We describe Saber, a  hybrid  high-performance relational stream processing engine for CPUs and GPGPUs. Saber executes window-based streaming SQL queries in a data-parallel fashion using all available CPU and GPGPU cores. Instead of statically assigning query operators to heterogeneous processors, Saber employs a new adaptive  heterogeneous lookahead scheduling  strategy, which increases the share of queries executing on the processor that yields the highest performance. To hide data movement costs, Saber pipelines the transfer of stream data between CPU and GPGPU memory. Our experimental comparison against state-of-the-art engines shows that Saber increases processing throughput while maintaining low latency for a wide range of streaming SQL queries with both small and large window sizes.", "citation": "Citations (12)", "year": "2016", "departments": ["Imperial College London", "Humboldt University of Berlin", "Imperial College London", "Imperial College London", "Microsoft"], "conf": "sigmod", "authors": ["Alexandros Koliousis.....http://dblp.org/pers/hd/k/Koliousis:Alexandros", "Matthias Weidlich.....http://dblp.org/pers/hd/w/Weidlich:Matthias", "Raul Castro Fernandez.....http://dblp.org/pers/hd/f/Fernandez:Raul_Castro", "Alexander L. Wolf.....http://dblp.org/pers/hd/w/Wolf:Alexander_L=", "Paolo Costa.....http://dblp.org/pers/hd/c/Costa:Paolo", "Peter R. Pietzuch.....http://dblp.org/pers/hd/p/Pietzuch:Peter_R="], "pages": 15}