{"title": "Characterizing the life cycle of point of interests using human mobility patterns.", "fields": ["prosperity", "real estate", "point of interest", "urban planning", "granularity"], "abstract": "A Point of Interest (POI) refers to a specific location that people may find useful or interesting. While a large body of research has been focused on identifying and recommending POIs, there are few studies on characterizing the life cycle of POIs. Indeed, a comprehensive understanding of POI life cycle can be helpful for various tasks, such as urban planning, business site selection, and real estate evaluation. In this paper, we develop a framework, named  POLIP,  for characterizing the POI life cycle with multiple data sources. Specifically, to investigate the POI evolution process over time, we first formulate a serial classification problem to predict the life status of POIs. The prediction approach is designed to integrate two important perspectives: 1) the spatial-temporal dependencies associated with the prosperity of POIs, and 2) the human mobility dynamics hidden in the citywide taxicab data related to the POIs at multiple granularity levels. In addition, based on the predicted life statuses in successive time windows for a given POI, we design an algorithm to characterize its life cycle. Finally, we performed extensive experiments using large-scale and real-world datasets. The results demonstrate the feasibility in automatic characterizing POI life cycle and shed important light on future research directions.", "citation": "Citations (5)", "departments": ["Northwestern Polytechnical University", "Northwestern Polytechnical University", "Dalian University of Technology", "Drexel University", "Rutgers University"], "authors": ["Xinjiang Lu.....http://dblp.org/pers/hd/l/Lu:Xinjiang", "Zhiwen Yu.....http://dblp.org/pers/hd/y/Yu_0001:Zhiwen", "Leilei Sun.....http://dblp.org/pers/hd/s/Sun:Leilei", "Chuanren Liu.....http://dblp.org/pers/hd/l/Liu:Chuanren", "Hui Xiong.....http://dblp.org/pers/hd/x/Xiong:Hui", "Chu Guan.....http://dblp.org/pers/hd/g/Guan:Chu"], "conf": "huc", "year": "2016", "pages": 12}