{"title": "Articulation points guided redundancy elimination for betweenness centrality.", "fields": ["tree traversal", "partial redundancy elimination", "power graph analysis", "betweenness centrality", "speedup"], "abstract": "Betweenness centrality (BC) is an important metrics in graph analysis which indicates critical vertices in large-scale networks based on shortest path enumeration. Typically, a BC algorithm constructs a shortest-path DAG for each vertex to calculate its BC score. However, for emerging real-world graphs, even the state-of-the-art BC algorithm will introduce a number of redundancies, as suggested by the existence of articulation points. Articulation points imply some common sub-DAGs in the DAGs for different vertices, but existing algorithms do not leverage such information and miss the optimization opportunity.   We propose a redundancy elimination approach, which identifies the common sub-DAGs shared between the DAGs for different vertices. Our approach leverages the articulation points and reuses the results of the common sub-DAGs in calculating the BC scores, which eliminates redundant computations. We implemented the approach as an algorithm with two-level parallelism and evaluated it on a multicore platform. Compared to the state-of-the-art implementation using shared memory, our approach achieves an average speedup of 4.6x across a variety of real-world graphs, with the traversal rates up to 45 ~ 2400 MTEPS (Millions of Traversed Edges per Second).", "citation": "Citations (4)", "year": "2016", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "ppopp", "authors": ["Lei Wang.....http://dblp.org/pers/hd/w/Wang_0004:Lei", "Fan Yang.....http://dblp.org/pers/hd/y/Yang:Fan", "Liangji Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Liangji", "Huimin Cui.....http://dblp.org/pers/hd/c/Cui:Huimin", "Fang Lv.....http://dblp.org/pers/hd/l/Lv:Fang", "Xiaobing Feng.....http://dblp.org/pers/hd/f/Feng_0002:Xiaobing"], "pages": 13}