{"title": "Detecting Rumors from Microblogs with Recurrent Neural Networks.", "fields": ["social media", "microblogging", "recurrent neural network", "rumor", "machine learning"], "abstract": "Microblogging platforms are an ideal place for spreading rumors and automatically debunking rumors is a crucial problem. To detect rumors, existing approaches have relied on hand-crafted features for employing machine learning algorithms that require daunting manual effort. Upon facing a dubious claim, people dispute its truthfulness by posting various cues over time, which generates long-distance dependencies of evidence. This paper presents a novel method that learns continuous representations of microblog events for identifying rumors. The proposed model is based on recurrent neural networks (RNN) for learning the hidden representations that capture the variation of contextual information of relevant posts over time. Experimental results on datasets from two real-world microblog platforms demonstrate that (1) the RNN method outperforms state-of-the-art rumor detection models that use hand-crafted features; (2) performance of the RNN-based algorithm is further improved via sophisticated recurrent units and extra hidden layers; (3) RNN-based method detects rumors more quickly and accurately than existing techniques, including the leading online rumor debunking services.", "citation": "Citations (71)", "year": "2016", "departments": ["The Chinese University of Hong Kong", "Qatar Computing Research Institute", "Qatar Computing Research Institute", "KAIST", "Qatar Computing Research Institute"], "conf": "ijcai", "authors": ["Jing Ma.....http://dblp.org/pers/hd/m/Ma:Jing", "Wei Gao.....http://dblp.org/pers/hd/g/Gao_0001:Wei", "Prasenjit Mitra.....http://dblp.org/pers/hd/m/Mitra:Prasenjit", "Sejeong Kwon.....http://dblp.org/pers/hd/k/Kwon:Sejeong", "Bernard J. Jansen.....http://dblp.org/pers/hd/j/Jansen:Bernard_J=", "Kam-Fai Wong.....http://dblp.org/pers/hd/w/Wong:Kam=Fai", "Meeyoung Cha.....http://dblp.org/pers/hd/c/Cha:Meeyoung"], "pages": 7}