{"title": "Playful Backstalking and Serious Impression Management: How Young Adults Reflect on their Past Identities on Facebook.", "fields": ["social media", "interpersonal ties", "young adult", "reminiscence", "impression management"], "abstract": "Parents, educators, and policymakers have expressed concern about the future implications of young peopleâ  s sharing practices on social media sites. However, little is known about how young people themselves feel about their online behaviors being preserved and resurfaced later in adulthood. We conducted semi-structured interviews with 28 college-going, primarily female, young adults about their use of social media and their transition from adolescence into young adulthood. We find that participants recognize archival value in their own Facebook histories, despite sometimes perceiving these histories to be embarrassing. They experience tensions between meeting their current self-presentational goals and maintaining the authenticity of historical content. To reconcile these tensions, they engage in retrospective impression management practices, such as curating past content. They also engage in â  backstalkingâ   behaviors, in which they view and engage with other usersâ   Facebook historiesâ  openly with close ties and discreetly with weak ties. We consider this ludic engagement through the lens of emerging adulthood and discuss the theoretical implications of our findings, especially in light of emerging applications which intentionally resurface digital traces.", "citation": "Citations (12)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Pennsylvania"], "authors": ["Sarita Yardi Schoenebeck.....http://dblp.org/pers/hd/s/Schoenebeck:Sarita_Yardi", "Nicole B. Ellison.....http://dblp.org/pers/hd/e/Ellison:Nicole_B=", "Lindsay Blackwell.....http://dblp.org/pers/hd/b/Blackwell:Lindsay", "Joseph B. Bayer.....http://dblp.org/pers/hd/b/Bayer:Joseph_B=", "Emily B. Falk.....http://dblp.org/pers/hd/f/Falk:Emily_B="], "conf": "cscw", "year": "2016", "pages": 13}