{"title": "A state-space model of cross-region dynamic connectivity in MEG/EEG.", "fields": ["prior probability", "information flow", "magnetoencephalography", "state space representation", "state variable"], "abstract": "Cross-region dynamic connectivity, which describes spatio-temporal dependence of neural activity among multiple brain regions of interest (ROIs), can provide important information for understanding cognition. For estimating such connectivity, magnetoencephalography (MEG) and electroencephalography (EEG) are well-suited tools because of their millisecond temporal resolution. However, localizing source activity in the brain requires solving an under-determined linear problem. In typical two-step approaches, researchers first solve the linear problem with general priors assuming independence across ROIs, and secondly quantify cross-region connectivity. In this work, we propose a one-step state-space model to improve estimation of dynamic connectivity. The model treats the mean activity in individual ROIs as the state variable, and describes non-stationary dynamic dependence across ROIs using time-varying auto-regression. Compared with a two-step method, which first obtains the commonly used minimum-norm estimates of source activity, and then fits the auto-regressive model, our state-space model yielded smaller estimation errors on simulated data where the model assumptions held. When applied on empirical MEG data from one participant in a scene-processing experiment, our state-space model also demonstrated intriguing preliminary results, indicating leading and lagged linear dependence between the early visual cortex and a higher-level scene-sensitive region, which could reflect feed-forward and feedback information flow within the visual cortex during scene processing.", "citation": "Citations (2)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Ying Yang.....http://dblp.org/pers/hd/y/Yang:Ying", "Elissa Aminoff.....http://dblp.org/pers/hd/a/Aminoff:Elissa", "Michael J. Tarr.....http://dblp.org/pers/hd/t/Tarr:Michael_J=", "Robert E. Kass.....http://dblp.org/pers/hd/k/Kass:Robert_E="], "conf": "nips", "year": "2016", "pages": 9}