{"title": "Play and Rewind: Optimizing Binary Representations of Videos by Self-Supervised Temporal Hashing.", "fields": ["binary code", "backpropagation", "encoder", "sequence learning", "pooling"], "abstract": "We focus on hashing videos into short binary codes for efficient Content-based Video Retrieval (CBVR), which is a fundamental technique that supports access to the ever-growing abundance of videos on the Web. Existing video hash functions are built on three isolated stages: frame pooling, relaxed learning, and binarization, which have not adequately explored the temporal order of video frames in a joint binary optimization model, resulting in severe information loss. In this paper, we propose a novel unsupervised video hashing framework called Self-Supervised Temporal Hashing (SSTH) that is able to capture the temporal nature of videos in an end-to-end learning-to-hash fashion. Specifically, the hash function of SSTH is an encoder RNN equipped with the proposed Binary LSTM (BLSTM) that generates binary codes for videos. The hash function is learned in a self-supervised fashion, where a decoder RNN is proposed to reconstruct the original video frames in both forward and reverse orders. For binary code optimization, we develop a backpropagation rule that tackles the non-differentiability of BLSTM. This rule allows efficient deep network training without suffering from the binarization loss. Through extensive CBVR experiments on two real-world consumer video datasets of Youtube and Flickr, we show that SSTH consistently outperforms state-of-the-art video hashing methods, eg., in terms of mAP@20, SSTH using only 128 bits can still outperform others using 256 bits by at least 9% to 15% on both datasets.", "citation": "Citations (21)", "departments": ["Hefei University of Technology", "Hefei University of Technology", "NUS, Singapore, Singapore", "NUS, Singapore, Singapore"], "authors": ["Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2016", "pages": 10}