{"title": "Crowdsourced POI labelling: Location-aware result inference and Task Assignment.", "fields": ["crowdsourcing", "inference", "labelling", "point of interest", "spatial database"], "abstract": "Identifying the labels of points of interest (POIs), aka POI labelling, provides significant benefits in location-based services. However, the quality of raw labels manually added by users or generated by artificial algorithms cannot be guaranteed. Such low-quality labels decrease the usability and result in bad user experiences. In this paper, by observing that crowdsourcing is a best-fit for computer-hard tasks, we leverage crowdsourcing to improve the quality of POI labelling. To our best knowledge, this is the first work on crowdsourced POI labelling tasks. In particular, there are two sub-problems: (1) how to infer the correct labels for each POI based on workers' answers, and (2) how to effectively assign proper tasks to workers in order to make more accurate inference for next available workers. To address these two problems, we propose a framework consisting of an inference model and an online task assigner. The inference model measures the quality of a worker on a POI by elaborately exploiting (i) worker's inherent quality, (ii) the spatial distance between the worker and the POI, and (iii) the POI influence, which can provide reliable inference results once a worker submits an answer. As workers are dynamically coming, the online task assigner judiciously assigns proper tasks to them so as to benefit the inference. The inference model and task assigner work alternately to continuously improve the overall quality. We conduct extensive experiments on a real crowdsourcing platform, and the results on two real datasets show that our method significantly outperforms state-of-the-art approaches.", "citation": "Citations (25)", "departments": ["Tsinghua University", "University of Hong Kong", "RMIT University", "Tsinghua University", "Tsinghua University"], "authors": ["Huiqi Hu.....http://dblp.org/pers/hd/h/Hu:Huiqi", "Yudian Zheng.....http://dblp.org/pers/hd/z/Zheng:Yudian", "Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Jianhua Feng.....http://dblp.org/pers/hd/f/Feng:Jianhua", "Reynold Cheng.....http://dblp.org/pers/hd/c/Cheng:Reynold"], "conf": "icde", "year": "2016", "pages": 12}