{"title": "Reliable and efficient performance monitoring in linux.", "fields": ["data mining", "parallel computing", "schedule", "event scheduling", "science technology and society", "engineering", "real time computing", "linux kernel", "search engine", "data science"], "abstract": "Processor hardware performance counters have recently improved in quality and features, while performance monitoring support in Linux has been significantly revamped with the development of the perf_events subsystem, which contributed in making performance analysis an increasingly common practice among developers. However, no performance analysis is possible without an efficient monitoring interface and reliable hardware counter data. In this paper, we first address a reliability issue in the Performance Monitoring Unit of recent Intel processors with Hyper-Threading enabled. A published erratum causes cross hyper-thread hardware counter corruption and may produce unreliable results. We propose a cache-coherence style protocol which we implement in the Linux kernel to address the issue by introducing cross hyper-thread dynamic event scheduling. Second, we improve event scheduling efficiency by introducing an algorithm which optimally schedules events onto hardware counters consistently. The proposed optimizations do not require any user level changes. They leverage the internal design of the perf_events subsystem and have broader applicability in processors. The improvements have been contributed to the upstream Linux kernel 4.1.", "citation": "Not cited", "departments": ["Stanford University", "National Technical University of Athens", "Stanford University", "Mountain View"], "authors": ["Maria Dimakopoulou.....http://dblp.org/pers/hd/d/Dimakopoulou:Maria", "Stéphane Eranian.....http://dblp.org/pers/hd/e/Eranian:St=eacute=phane", "Nectarios Koziris.....http://dblp.org/pers/hd/k/Koziris:Nectarios", "Nicholas Bambos.....http://dblp.org/pers/hd/b/Bambos:Nicholas"], "conf": "sc", "year": "2016", "pages": 13}