{"title": "BASIC: backbone-assisted successive interference cancellation.", "fields": ["network packet", "time division multiple access", "single antenna interference cancellation", "telecommunications link", "greedy algorithm"], "abstract": "To meet the growing demand for wireless data, it is time to move away from the age-old paradigm of prohibiting interfering nodes from transmissions. Instead, through proactive management of interference among multiple colliding packets, we can design high throughput wireless systems. This is well explored in the Information Theory community and there are also a few implementational efforts that have been recently reported. The existing solutions are nontrivial to use in real systems as they require either tight time/frequency synchronization or exchange of data between transmitters prior to the transmissions. These requirements are hard to meet in practice especially for uplink transmissions. This paper proposes BASIC, a lightweight multi-user uplink transmission strategy that does not require tight synchronization or exchange of samples among nodes, which makes it an attractive alternative compared to its counterparts. BASIC exploits receiver diversity by controlling the data rates of the clients. A novel greedy algorithm is proposed for data rate selection. We implement BASIC on a software-defined radio platform. Our experiments on a real testbed show that BASIC outperforms TDMA by 48% in terms of overall throughput. Our trace-driven simulations show up to 4.8x gain in throughput with similar flow fairness.", "citation": "Citations (7)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Wenjie Zhou.....http://dblp.org/pers/hd/z/Zhou:Wenjie", "Tanmoy Das.....http://dblp.org/pers/hd/d/Das:Tanmoy", "Lu Chen.....http://dblp.org/pers/hd/c/Chen:Lu", "Kannan Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Kannan", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun"], "conf": "mobicom", "year": "2016", "pages": 13}