{"title": "Dynamo: Facebook's Data Center-Wide Power Management System.", "fields": ["dynamo", "power usage effectiveness", "power management system", "circuit breaker", "provisioning"], "abstract": "Data center power is a scarce resource that often goes underutilized due to conservative planning. This is because the penalty for overloading the data center power delivery hierarchy and tripping a circuit breaker is very high, potentially causing long service outages. Recently, dynamic server power capping, which limits the amount of power consumed by a server, has been proposed and studied as a way to reduce this penalty, enabling more aggressive utilization of provisioned data center power. However, no real at-scale solution for data center-wide power monitoring and control has been presented in the literature.   In this paper, we describe Dynamo -- a data center-wide power management system that monitors the entire power hierarchy and makes coordinated control decisions to safely and efficiently use provisioned data center power. Dynamo has been developed and deployed across all of Facebook's data centers for the past three years. Our key insight is that in real-world data centers, different power and performance constraints at different levels in the power hierarchy necessitate coordinated data center-wide power management.   We make three main contributions. First, to understand the design space of Dynamo, we provide a characterization of power variation in data centers running a diverse set of modern workloads. This characterization uses fine-grained power samples from tens of thousands of servers and spanning a period of over six months. Second, we present the detailed design of Dynamo. Our design addresses several key issues not addressed by previous simulation-based studies. Third, the proposed techniques and design have been deployed and evaluated in large scale data centers serving billions of users. We present production results showing that Dynamo has prevented 18 potential power outages in the past 6 months due to unexpected power surges; that Dynamo enables optimizations leading to a 13% performance boost for a production Hadoop cluster and a nearly 40% performance increase for a search cluster; and that Dynamo has already enabled an 8% increase in the power capacity utilization of one of our data centers with more aggressive power subscription measures underway.", "citation": "Citations (17)", "year": "2016", "departments": ["Facebook", "Facebook", "Facebook", "University of Michigan", "Facebook"], "conf": "isca", "authors": ["Qiang Wu.....http://dblp.org/pers/hd/w/Wu:Qiang", "Qingyuan Deng.....http://dblp.org/pers/hd/d/Deng:Qingyuan", "Lakshmi Ganesh.....http://dblp.org/pers/hd/g/Ganesh:Lakshmi", "Chang-Hong Hsu.....http://dblp.org/pers/hd/h/Hsu:Chang=Hong", "Yun Jin.....http://dblp.org/pers/hd/j/Jin:Yun", "Sanjeev Kumar.....http://dblp.org/pers/hd/k/Kumar:Sanjeev", "Bin Li.....http://dblp.org/pers/hd/l/Li:Bin", "Justin Meza.....http://dblp.org/pers/hd/m/Meza:Justin", "Yee Jiun Song.....http://dblp.org/pers/hd/s/Song:Yee_Jiun"], "pages": 12}