{"title": "Uncovering Bugs in Distributed Storage Systems during Testing (Not in Production!).", "fields": ["debugging", "executable", "black box testing", "distributed data store", "white box testing"], "abstract": "Testing distributed systems is challenging due to multiple sources of nondeterminism. Conventional testing techniques, such as unit, integration and stress testing, are ineffective in preventing serious but subtle bugs from reaching production. Formal techniques, such as TLA+, can only verify high-level specifications of systems at the level of logic-based models, and fall short of checking the actual executable code. In this paper, we present a new methodology for testing distributed systems. Our approach applies advanced systematic testing techniques to thoroughly check that the executable code adheres to its high-level specifications, which significantly improves coverage of important system behaviors.\n\nOur methodology has been applied to three distributed storage systems in the Microsoft Azure cloud computing platform. In the process, numerous bugs were identified, reproduced, confirmed and fixed. These bugs required a subtle combination of concurrency and failures, making them extremely difficult to find with conventional testing techniques. An important advantage of our approach is that a bug is uncovered in a small setting and witnessed by a full system trace, which dramatically increases the productivity of debugging.", "citation": "Citations (2)", "departments": ["Imperial College London", "Massachusetts Institute of Technology", "Imperial College London", "Microsoft", "Imperial College London"], "authors": ["Pantazis Deligiannis.....http://dblp.org/pers/hd/d/Deligiannis:Pantazis", "Matt McCutchen.....http://dblp.org/pers/hd/m/McCutchen:Matt", "Paul Thomson.....http://dblp.org/pers/hd/t/Thomson:Paul", "Shuo Chen.....http://dblp.org/pers/hd/c/Chen_0001:Shuo", "Alastair F. Donaldson.....http://dblp.org/pers/hd/d/Donaldson:Alastair_F=", "John Erickson.....http://dblp.org/pers/hd/e/Erickson:John", "Cheng Huang.....http://dblp.org/pers/hd/h/Huang:Cheng", "Akash Lal.....http://dblp.org/pers/hd/l/Lal:Akash", "Rashmi Mudduluru.....http://dblp.org/pers/hd/m/Mudduluru:Rashmi", "Shaz Qadeer.....http://dblp.org/pers/hd/q/Qadeer:Shaz", "Wolfram Schulte.....http://dblp.org/pers/hd/s/Schulte:Wolfram"], "conf": "fast", "year": "2016", "pages": 14}