{"title": "User Redirection and Direct Haptics in Virtual Environments.", "fields": ["image warping", "kernel virtual address space", "metaverse", "emulation", "virtual image"], "abstract": "This paper proposes a haptic interaction system for Virtual Reality (VR) based on a combination of tracking devices for hands and objects and a real-to-virtual mapping system for user redirection. In our solution the user receives haptic stimuli by manipulating real objects mapped to virtual ob- jects. This solution departs from systems that rely on haptic devices (e.g., haptic gloves) as interfaces for the user to inter- act with objects in the Virtual Environment (VE). As such, the proposed solution makes use of direct haptics (touching) and redirection techniques to guide the user through the vir- tual environment. Using the mapping framework, when the user touches a virtual object in the VE, he will simultane- ously be physically touching the equivalent real object. A relevant feature of the framework is the possibility to de- fine a warped mapping between the real and virtual worlds, such that the relation between the user and the virtual space can be different from the one between the user and the real space. This is particularly useful when the application re- quires the emulation of large virtual spaces but the physical space available is more confined. To achieve this, both the user's hands and the objects are tracked. In the presented prototype we use a head-mounted depth sensor (i.e., Leap Motion) and a depth-sensing camera (i.e., Kinect). To assess the feasibility of this solution, a functional prototype and a room setup with core functionality were implemented. The test sessions with users evaluated the mapping accuracy, the user execution time and the awareness of the user regarding the warped space when performing tasks with redirection. The results gathered indicate that the solution can be used to provide direct haptic feedback in VR applications and for warping space perception within certain limits.", "citation": "Citations (2)", "departments": ["FEUP, Porto, Portugal", "FEUP/INESC TEC, ... Porto, Portugal", "FEUP, Porto, Portugal", "FEUP/INESC TEC, ... Porto, Portugal"], "authors": ["Cristiano Carvalheiro.....http://dblp.org/pers/hd/c/Carvalheiro:Cristiano", "Rui Nóbrega.....http://dblp.org/pers/hd/n/N=oacute=brega:Rui", "Hugo da Silva.....http://dblp.org/pers/hd/s/Silva:Hugo_da", "Rui Amaral Rodrigues.....http://dblp.org/pers/hd/r/Rodrigues:Rui_Amaral"], "conf": "mm", "year": "2016", "pages": 10}