{"title": "Towards efficient content-aware search over encrypted outsourced data in cloud.", "fields": ["semantic computing", "encryption", "threat model", "outsourcing", "semantic search"], "abstract": "With the increasing adoption of cloud computing, a growing number of users outsource their datasets into cloud. The datasets usually are encrypted before outsourcing to preserve the privacy. However, the common practice of encryption makes the effective utilization difficult, for example, search the given keywords in the encrypted datasets. Many schemes are proposed to make encrypted data searchable based on keywords. However, keyword-based search schemes ignore the semantic representation information of users retrieval, and cannot completely meet with users search intention. Therefore, how to design a content-based search scheme and make semantic search more effective and context-aware is a difficult challenge. In this paper, we proposed an innovative semantic search scheme based on the concept hierarchy and the semantic relationship between concepts in the encrypted datasets. More specifically, our scheme first indexes the documents and builds trapdoor based on the concept hierarchy. To further improve the search efficiency, we utilize a tree-based index structure to organize all the document index vectors. Our experiment results based on the real world datasets show the scheme is more efficient than previous scheme. We also study the threat model of our approach and prove it does not introduce any security risk.", "citation": "Citations (87)", "departments": ["Nanjing University of Information Science and Technology", "Nanjing University of Information Science and Technology", "Nanjing University of Information Science and Technology", "University of California, Riverside"], "authors": ["Zhangjie Fu.....http://dblp.org/pers/hd/f/Fu:Zhangjie", "Xingming Sun.....http://dblp.org/pers/hd/s/Sun:Xingming", "Sai Ji.....http://dblp.org/pers/hd/j/Ji:Sai", "Guowu Xie.....http://dblp.org/pers/hd/x/Xie:Guowu"], "conf": "infocom", "year": "2016", "pages": 9}