{"title": "Recurrent Face Aging.", "fields": ["ghosting", "computer vision", "age progression", "recurrent neural network", "neglect"], "abstract": "Modeling the aging process of human face is important for cross-age face verification and recognition. In this paper, we introduce a recurrent face aging (RFA) framework based on a recurrent neural network which can identify the ages of people from 0 to 80. Due to the lack of labeled face data of the same person captured in a long range of ages, traditional face aging models usually split the ages into discrete groups and learn a one-step face feature transformation for each pair of adjacent age groups. However, those methods neglect the in-between evolving states between the adjacent age groups and the synthesized faces often suffer from severe ghosting artifacts. Since human face aging is a smooth progression, it is more appropriate to age the face by going through smooth transition states. In this way, the ghosting artifacts can be effectively eliminated and the intermediate aged faces between two discrete age groups can also be obtained. Towards this target, we employ a twolayer gated recurrent unit as the basic recurrent module whose bottom layer encodes a young face to a latent representation and the top layer decodes the representation to a corresponding older face. The experimental results demonstrate our proposed RFA provides better aging faces over other state-of-the-art age progression methods.", "citation": "Citations (66)", "year": "2016", "departments": ["University of Trento", "Southeast University", "University of Trento", "National University of Singapore", "4360 Artificial ... l. Inst., China"], "conf": "cvpr", "authors": ["Wei Wang.....http://dblp.org/pers/hd/w/Wang_0108:Wei", "Zhen Cui.....http://dblp.org/pers/hd/c/Cui:Zhen", "Yan Yan.....http://dblp.org/pers/hd/y/Yan_0002:Yan", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Xiangbo Shu.....http://dblp.org/pers/hd/s/Shu:Xiangbo", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu"], "pages": 9}