{"title": "Crowdsourcing Biodiversity Monitoring: How Sharing your Photo Stream can Sustain our Planet.", "fields": ["crowdsourcing", "scale up", "sustainable development", "reuse", "mobile search"], "abstract": "Large scale biodiversity monitoring is essential for sustainable development (earth stewardship). With the recent advances in computer vision, we see the emergence of more and more effective identification tools allowing to set-up large-scale data collection platforms such as the popular Pl@ntNet initiative that allow to reuse interaction data. Although it covers only a fraction of the world flora, this platform is already being used by more than 300K people who produce tens of thousands of validated plant observations each year. This explicitly shared and validated data is only the tip of the iceberg. The real potential relies on the millions of raw image queries submitted by the users of the mobile application for which there is no human validation. People make such requests to get information on a plant along a hike or something they find in their garden but not know anything about. Allowing the exploitation of such contents in a fully automatic way could scale up the world-wide collection of implicit plant observations by several orders of magnitude, which can complement the explicit monitoring efforts. In this paper, we first survey existing automated plant identification systems through a five-year synthesis of the PlantCLEF benchmark and an impact study of the Pl@ntNet platform. We then focus on the implicit monitoring scenario and discuss related research challenges at the frontier of computer science and biodiversity studies. Finally, we discuss the results of a preliminary study focused on implicit monitoring of invasive species in mobile search logs. We show that the results are promising but that there is room for improvement before being able to automatically share implicit observations within international platforms.", "citation": "Citations (3)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "IRD, Montpellier, France", "HES-SO, Sierre, Switzerland"], "authors": ["Alexis Joly.....http://dblp.org/pers/hd/j/Joly:Alexis", "Hervé Goëau.....http://dblp.org/pers/hd/g/Go=euml=au:Herv=eacute=", "Julien Champ.....http://dblp.org/pers/hd/c/Champ:Julien", "Samuel Dufour-Kowalski.....http://dblp.org/pers/hd/d/Dufour=Kowalski:Samuel", "Henning Müller.....http://dblp.org/pers/hd/m/M=uuml=ller:Henning", "Pierre Bonnet.....http://dblp.org/pers/hd/b/Bonnet:Pierre"], "conf": "mm", "year": "2016", "pages": 10}