{"title": "Performance-guaranteed strongly connected dominating sets in heterogeneous wireless sensor networks.", "fields": ["mobile wireless sensor network", "topology control", "dominating set", "key distribution in wireless sensor networks", "connected dominating set"], "abstract": "In wireless sensor networks, Virtual Backbone (VB) construction based on connected dominating set is a competitive issue for routing efficiency and topology control. Transmission ranges of sensors are not always equivalent. A sensor networks is modeled as a directed graph while sensors have different transmission ranges. In this paper, we will try to find a special Strongly Connected Bidirectional Dominating Set (SCBDS) within minimum routing cost for each pair of nodes in directed graphs. The SCBDS forms a VB of the networks whose sensors have different transmission radius. For any pair of sensors, the length of the shortest path they communicate with each other through VB should be no more than a constant times the length of the shortest path without using VB. We propose a constant approximate scheme to construct the SCBDS with the bounded size 3∗(8ρ+1)2 (2ρ+1)2 opt. A centralized and a distributed algorithm with the same performance ratio are presented to show the details to construct the SCDS in directed graphs. Simulation results show that the average shortest path length through our algorithms is reduced greatly compared with other algorithms.", "citation": "Citations (4)", "departments": ["Harbin Institute of Technology Shenzhen Graduate School", "Harbin Institute of Technology Shenzhen Graduate School", "Harbin Institute of Technology Shenzhen Graduate School", "Harbin Institute of Technology Shenzhen Graduate School"], "authors": ["Chunyan Liu.....http://dblp.org/pers/hd/l/Liu:Chunyan", "Hejiao Huang.....http://dblp.org/pers/hd/h/Huang:Hejiao", "Hongwei Du.....http://dblp.org/pers/hd/d/Du:Hongwei", "Xiaohua Jia.....http://dblp.org/pers/hd/j/Jia:Xiaohua"], "conf": "infocom", "year": "2016", "pages": 9}