{"title": "SAMPO: Online subflow association for multipath TCP with partial flow records.", "fields": ["online algorithm", "network dynamics", "networking hardware", "multipath tcp", "network socket"], "abstract": "Multipath TCP (MPTCP) is a promising technique for boosting application throughput while using well-known and versatile network socket interfaces. Recently, many interesting applications of MPTCP in various environments such as wireless networks and data centers have been proposed, but little work has been done to investigate the impact of this protocol on conventional network devices. For example, MPTCP throughput advantage can be better achieved if all MPTCP subflows are routed on disjoint paths, but this is currently not feasible since routers are not designed to recognize the membership of MPTCP subflows. In this paper, we take a first step to address this issue by proposing SAMPO, an online algorithm to detect and associate MPTCP subflows in network. The main challenge is that sampling techniques and network dynamics may cause a network device to only obtain partial flow records. SAMPO takes advantage of both protocol information and statistical characteristics of MPTCP data sequence number to overcome the challenge in network. Through analysis and experimentation, we show that SAMPO is able to detect and associate MPTCP subflows with high accuracy even when a small portion of the entire flow records are available.", "citation": "Citations (1)", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "Bell Labs", "Bell Labs"], "authors": ["Yang Zhang.....http://dblp.org/pers/hd/z/Zhang:Yang", "Hesham Mekky.....http://dblp.org/pers/hd/m/Mekky:Hesham", "Zhi-Li Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhi=Li", "Fang Hao.....http://dblp.org/pers/hd/h/Hao:Fang", "Sarit Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Sarit", "T. V. Lakshman.....http://dblp.org/pers/hd/l/Lakshman:T=_V="], "conf": "infocom", "year": "2016", "pages": 9}