{"title": "THEMIS: Fairness in Federated Stream Processing under Overload.", "fields": ["stream processing", "cloud computing", "load shedding", "grid", "source data"], "abstract": "Federated stream processing systems, which utilise nodes from multiple independent domains, can be found increasingly in multi-provider cloud deployments, internet-of-things systems, collaborative sensing applications and large-scale grid systems. To pool resources from several sites and take advantage of local processing, submitted queries are split into query fragments, which are executed collaboratively by different sites. When supporting many concurrent users, however, queries may exhaust available processing resources, thus requiring constant load shedding. Given that individual sites have autonomy over how they allocate query fragments on their nodes, it is an open challenge how to ensure global fairness on processing quality experienced by queries in a federated scenario.   We describe THEMIS, a federated stream processing system for resource-starved, multi-site deployments. It executes queries in a globally fair fashion and provides users with constant feedback on the experienced processing quality for their queries. THEMIS associates stream data with its source information content (SIC), a metric that quantifies the contribution of that data towards the query result, based on the amount of source data used to generate it. We provide the BALANCE-SIC distributed load shedding algorithm that balances the SIC values of result data. Our evaluation shows that the BALANCE-SIC algorithm yields balanced SIC values across queries, as measured by Jain's Fairness Index. Our approach also incurs a low execution time overhead.", "citation": "Citations (9)", "year": "2016", "departments": ["City University London", "Imperial College London", "IBM", "Imperial College London"], "conf": "sigmod", "authors": ["Evangelia Kalyvianaki.....http://dblp.org/pers/hd/k/Kalyvianaki:Evangelia", "Marco Fiscato.....http://dblp.org/pers/hd/f/Fiscato:Marco", "Theodoros Salonidis.....http://dblp.org/pers/hd/s/Salonidis:Theodoros", "Peter R. Pietzuch.....http://dblp.org/pers/hd/p/Pietzuch:Peter_R="], "pages": 13}