{"title": "GMove: Group-Level Mobility Modeling Using Geo-Tagged Social Media.", "fields": ["data set", "social media", "mobility model", "data consistency", "hidden markov model"], "abstract": "Understanding human mobility is of great importance to various applications, such as urban planning, traffic scheduling, and location prediction. While there has been fruitful research on modeling human mobility using tracking data (e.g., GPS traces), the recent growth of geo-tagged social media (GeoSM) brings new opportunities to this task because of its sheer size and multi-dimensional nature. Nevertheless, how to obtain quality mobility models from the highly sparse and complex GeoSM data remains a challenge that cannot be readily addressed by existing techniques. We propose GMove, a group-level mobility modeling method using GeoSM data. Our insight is that the GeoSM data usually contains multiple user groups, where the users within the same group share significant movement regularity. Meanwhile, user grouping and mobility modeling are two intertwined tasks: (1) better user grouping offers better within-group data consistency and thus leads to more reliable mobility models; and (2) better mobility models serve as useful guidance that helps infer the group a user belongs to. GMove thus alternates between user grouping and mobility modeling, and generates an ensemble of Hidden Markov Models (HMMs) to characterize group-level movement regularity. Furthermore, to reduce text sparsity of GeoSM data, GMove also features a text augmenter. The augmenter computes keyword correlations by examining their spatiotemporal distributions. With such correlations as auxiliary knowledge, it performs sampling-based augmentation to alleviate text sparsity and produce high-quality HMMs.   Our extensive experiments on two real-life data sets demonstrate that GMove can effectively generate meaningful group-level mobility models. Moreover, with context-aware location prediction as an example application, we find that GMove significantly outperforms baseline mobility models in terms of prediction accuracy.", "citation": "Citations (30)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Hefei University of Technology", "United States Army Research Laboratory"], "authors": ["Chao Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao", "Keyang Zhang.....http://dblp.org/pers/hd/z/Zhang:Keyang", "Quan Yuan.....http://dblp.org/pers/hd/y/Yuan_0001:Quan", "Luming Zhang.....http://dblp.org/pers/hd/z/Zhang:Luming", "Tim Hanratty.....http://dblp.org/pers/hd/h/Hanratty:Tim", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "kdd", "year": "2016", "pages": 10}