{"title": "UrbanEye: An outdoor localization system for public transport.", "fields": ["public transport", "probabilistic logic", "software deployment", "volatile", "schedule"], "abstract": "Public transport in suburban cities (covers 80% of the urban landscape) of developing regions suffer from the lack of information in Google Transit, unpredictable travel times, chaotic schedules, absence of information board inside the vehicle. Consequently, passengers suffer from lack of information about the exact location where the bus is at present as well as the estimated time to be taken to reach the desired destination. We find that off-the-shelf deployment of existing (non-GPS) localization schemes exhibit high error due to sparsity of stable and structured outdoor landmarks (anchor points). Through rigorous experiments conducted over a month however, we realize that there are a certain class of volatile landmarks which may be useful in developing efficient localization scheme. Consequently, in this paper, we design a novel generalized energy-efficient outdoor localization scheme — UrbanEye, which efficiently combines the volatile and non-volatile landmarks using a specialized data structure, the probabilistic timed automata. UrbanEye uses speed-breakers, turns and stops as landmarks, estimates the travel time with a mean accuracy of ±2.5 mins and produces a mean localization accuracy of 50 m. Results from several runs taken in two cities, Durgapur and Kharagpur, reveal that UrbanEye provides more than 50% better localization accuracy compared to the existing system Dejavu [1], and consumes significantly less energy.", "citation": "Citations (4)", "departments": ["Indian Institute of Technology Kharagpur", "Indian Institute of Technology Kharagpur", "Indian Institute of Technology Kharagpur", "National Institute of Technology, Durgapur", "Indian Institute of Technology Kharagpur"], "authors": ["Rohit Verma.....http://dblp.org/pers/hd/v/Verma:Rohit", "Aviral Shrivastava.....http://dblp.org/pers/hd/s/Shrivastava:Aviral", "Bivas Mitra.....http://dblp.org/pers/hd/m/Mitra:Bivas", "Sujoy Saha.....http://dblp.org/pers/hd/s/Saha:Sujoy", "Niloy Ganguly.....http://dblp.org/pers/hd/g/Ganguly:Niloy", "Subrata Nandi.....http://dblp.org/pers/hd/n/Nandi:Subrata", "Sandip Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Sandip"], "conf": "infocom", "year": "2016", "pages": 9}