{"title": "Towards a Hybrid Design for Fast Query Processing in DB2 with BLU Acceleration Using Graphical Processing Units: A Technology Demonstration.", "fields": ["sort", "query optimization", "relational database management system", "multi core processor", "metadata"], "abstract": "In this paper, we show how we use Nvidia GPUs and host CPU cores for faster query processing in a DB2 database using BLU Acceleration (DB2's column store technology). Moreover, we show the benefits and problems of using hardware accelerators (more specifically GPUs) in a real commercial Relational Database Management System(RDBMS).We investigate the effect of off-loading specific database operations to a GPU, and show how doing so results in a significant performance improvement. We then demonstrate that for some queries, using just CPU to perform the entire operation is more beneficial. While we use some of Nvidia's fast kernels for operations like sort, we have also developed our own high performance kernels for operations such as group by and aggregation. Finally, we show how we use a dynamic design that can make use of optimizer metadata to intelligently choose a GPU kernel to run. For the first time in the literature, we use benchmarks representative of customer environments to gauge the performance of our prototype, the results of which show that we can get a speed increase upwards of 2x, using a realistic set of queries.", "citation": "Citations (3)", "year": "2016", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "sigmod", "authors": ["Sina Meraji.....http://dblp.org/pers/hd/m/Meraji:Sina", "Berni Schiefer.....http://dblp.org/pers/hd/s/Schiefer:Berni", "Lan Pham.....http://dblp.org/pers/hd/p/Pham:Lan", "Lee Chu.....http://dblp.org/pers/hd/c/Chu:Lee", "Peter Kokosielis.....http://dblp.org/pers/hd/k/Kokosielis:Peter", "Adam J. Storm.....http://dblp.org/pers/hd/s/Storm:Adam_J=", "Wayne Young.....http://dblp.org/pers/hd/y/Young:Wayne", "Chang Ge.....http://dblp.org/pers/hd/g/Ge_0002:Chang", "Geoffrey Ng.....http://dblp.org/pers/hd/n/Ng:Geoffrey", "Kajan Kanagaratnam.....http://dblp.org/pers/hd/k/Kanagaratnam:Kajan"], "pages": 10}