{"title": "A practical guide to select quality indicators for assessing pareto-based search algorithms in search-based software engineering.", "fields": ["search based software engineering", "statistical classification", "search algorithm", "pareto principle", "multi objective optimization"], "abstract": "Many software engineering problems are multi-objective in nature, which has been largely recognized by the Search-based Software Engineering (SBSE) community. In this regard, Pareto- based search algorithms, e.g., Non-dominated Sorting Genetic Algorithm II, have already shown good performance for solving multi-objective optimization problems. These algorithms produce Pareto fronts, where each Pareto front consists of a set of non- dominated solutions. Eventually, a user selects one or more of the solutions from a Pareto front for their specific problems. A key challenge of applying Pareto-based search algorithms is to select appropriate quality indicators, e.g., hypervolume, to assess the quality of Pareto fronts. Based on the results of an extended literature review, we found that the current literature and practice in SBSE lacks a practical guide for selecting quality indicators despite a large number of published SBSE works. In this direction, the paper presents a practical guide for the SBSE community to select quality indicators for assessing Pareto-based search algorithms in different software engineering contexts. The practical guide is derived from the following complementary theoretical and empirical methods: 1) key theoretical foundations of quality indicators; 2) evidence from an extended literature review; and 3) evidence collected from an extensive experiment that was conducted to evaluate eight quality indicators from four different categories with six Pareto-based search algorithms using three real industrial problems from two diverse domains.", "citation": "Citations (30)", "departments": ["Simula Research Laboratory", "Simula Research Laboratory", "Simula Research Laboratory", "Beihang University", "Cisco Systems, Inc."], "authors": ["Shuai Wang.....http://dblp.org/pers/hd/w/Wang_0001:Shuai", "Shaukat Ali.....http://dblp.org/pers/hd/a/Ali_0001:Shaukat", "Tao Yue.....http://dblp.org/pers/hd/y/Yue_0002:Tao", "Yan Li.....http://dblp.org/pers/hd/l/Li:Yan", "Marius Liaaen.....http://dblp.org/pers/hd/l/Liaaen:Marius"], "conf": "icse", "year": "2016", "pages": 12}