{"title": "Scalable data management: NoSQL data stores in research and practice.", "fields": ["scalability", "polyglot", "data management", "leverage", "nosql"], "abstract": "The unprecedented scale at which data is consumed and generated today has shown a large demand for scalable data management and given rise to non-relational, distributed “NoSQL” database systems. Two central problems triggered this process: 1) vast amounts of user-generated content in modern applications and the resulting requests loads and data volumes 2) the desire of the developer community to employ problem-specific data models for storage and querying. To address these needs, various data stores have been developed by both industry and research, arguing that the era of one-size-fits-all database systems is over. The heterogeneity and sheer amount of these systems - now commonly referred to as NoSQL data stores - make it increasingly difficult to select the most appropriate system for a given application. Therefore, these systems are frequently combined in polyglot persistence architectures to leverage each system in its respective sweet spot. This tutorial gives an in-depth survey of the most relevant NoSQL databases to provide comparative classification and highlight open challenges. To this end, we analyze the approach of each system to derive its scalability, availability, consistency, data modeling and querying characteristics. We present how each system's design is governed by a central set of trade-offs over irreconcilable system properties. We then cover recent research results in distributed data management to illustrate that some shortcomings of NoSQL systems could already be solved in practice, whereas other NoSQL data management problems pose interesting and unsolved research challenges.", "citation": "Citations (3)", "departments": ["University of Hamburg", "University of Hamburg"], "authors": ["Felix Gessert.....http://dblp.org/pers/hd/g/Gessert:Felix", "Norbert Ritter.....http://dblp.org/pers/hd/r/Ritter:Norbert"], "conf": "icde", "year": "2016", "pages": 4}