{"title": "ROLL: Fast In-Memory Generation of Gigantic Scale-free Networks.", "fields": ["roulette", "webgraph", "preferential attachment", "scale free network", "degree distribution"], "abstract": "Real-world graphs are not always publicly available or sometimes do not meet specific research requirements. These challenges call for generating synthetic networks that follow properties of the real-world networks. Barabasi-Albert (BA) is a well-known model for generating scale-free graphs, i.e graphs with power-law degree distribution. In BA model, the network is generated through an iterative stochastic process called preferential attachment. Although BA is highly demanded, due to the inherent complexity of the preferential attachment, this model cannot be scaled to generate billion-node graphs. In this paper, we propose ROLL-tree, a fast in-memory roulette wheel data structure that accelerates the BA network generation process by exploiting the statistical behaviors of the underlying growth model. Our proposed method has the following properties: (a) Fast: It performs +1000 times faster than the state-of-the-art on a single node PC; (b) Exact: It strictly follows the BA model, using an efficient data structure instead of approximation techniques; (c) Generalizable: It can be adapted for other \"rich-get-richer\" stochastic growth models. Our extensive experiments prove that ROLL-tree can effectively accelerate graph-generation through the preferential attachment process. On a commodity single processor machine, for example, ROLL-tree generates a scale-free graph of 1.1 billion nodes and 6.6 billion edges (the size of Yahoo's Webgraph) in 62 minutes while the state-of-the-art (SA) takes about four years on the same machine.", "citation": "Citations (6)", "year": "2016", "departments": ["Iran University of Science and Technology", "Iran University of Science and Technology", "Innopolis Unive ... s, Russian Fed.", "Innopolis Unive ... s, Russian Fed."], "conf": "sigmod", "authors": ["Ali Hadian.....http://dblp.org/pers/hd/h/Hadian:Ali", "Sadegh Nobari.....http://dblp.org/pers/hd/n/Nobari:Sadegh", "Behrouz Minaei-Bidgoli.....http://dblp.org/pers/hd/m/Minaei=Bidgoli:Behrouz", "Qiang Qu.....http://dblp.org/pers/hd/q/Qu:Qiang"], "pages": 14}