{"title": "Bounded-Communication Leakage Resilience via Parity-Resilient Circuits.", "fields": ["secure multi party computation", "bounded function", "oblivious transfer", "communication complexity", "encryption"], "abstract": "We consider the problem of distributing a computation between two parties, such that any bounded-communication leakage function applied to the local views of the two parties reveals essentially nothing about the input. This problem can be motivated by the goal of outsourcing computations on sensitive data to two servers in the cloud, where both servers can be simultaneously corrupted by viruses that have a limited communication bandwidth. We present a simple and efficient reduction of the above problem to that of constructing parity-resilient circuits, namely circuits that map an encoded input to an encoded output so that the parity of any subset of the wires is essentially independent of the input. We then construct parity-resilient circuits from circuits that are resilient to local leakage, which can in turn be obtained from protocols for secure multiparty computation. Our main reduction builds on a novel generalization of the e-biased masking lemma that applies to interactive protocols. Applying the above, we obtain two-party protocols with resilience to bounded-communication leakage either in the information-theoretic setting, relying on random oblivious transfer correlations, or in the computational setting, relying on non-committing encryption which can be based on a variety of standard cryptographic assumptions.", "citation": "Citations (3)", "departments": ["Microsoft", "Technion – Israel Institute of Technology", "Purdue University", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Yuval Ishai.....http://dblp.org/pers/hd/i/Ishai:Yuval", "Hemanta K. Maji.....http://dblp.org/pers/hd/m/Maji:Hemanta_K=", "Amit Sahai.....http://dblp.org/pers/hd/s/Sahai:Amit", "Alexander A. Sherstov.....http://dblp.org/pers/hd/s/Sherstov:Alexander_A="], "conf": "focs", "year": "2016", "pages": 10}