{"title": "GARNET: A holistic system approach for trending queries in microblogs.", "fields": ["market analysis", "special case", "microblogging", "granularity", "popularity"], "abstract": "The recent wide popularity of microblogs (e.g., tweets, online comments) has empowered various important applications, including, news delivery, event detection, market analysis, and target advertising. A core module in all these applications is a frequent/trending query processor that aims to find out those topics that are highly frequent or trending in the social media through posted microblogs. Unfortunately current attempts for such core module suffer from several drawbacks. Most importantly, their narrow scope, as they focus only on solving trending queries for a very special case of localized and very recent microblogs. This paper presents GARNET; a holistic system equipped with one-stop efficient and scalable solution for supporting a generic form of context-aware frequent and trending queries on microblogs. GARNET supports both frequent and trending queries, any arbitrary time interval either current, recent, or past, of fixed granularity, and having a set of arbitrary filters over contextual attributes. From a system point of view, GARNET is very appealing and industry-friendly, as one needs to realize it once in the system. Then, a myriad of various forms of trending and frequent queries are immediately supported. Experimental evidence based on a real system prototype of GARNET and billions of real Twitter data show the scalability and efficiency of GARNET for various query types.", "citation": "Citations (2)", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "University of Minnesota"], "authors": ["Christopher Jonathan.....http://dblp.org/pers/hd/j/Jonathan:Christopher", "Amr Magdy.....http://dblp.org/pers/hd/m/Magdy_0001:Amr", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F=", "Albert Jonathan.....http://dblp.org/pers/hd/j/Jonathan:Albert"], "conf": "icde", "year": "2016", "pages": 12}