{"title": "GenomiX: A Novel Interaction Tool for Self-Exploration of Personal Genomic Data.", "fields": ["personal genomics", "human computer interaction", "data mining", "medical research", "usability"], "abstract": "The increase in the availability of personal genomic data to lay consumers using online services poses a challenge to HCI researchers: such data are complex and sensitive, involve multiple dimensions of uncertainty, and can have substantial implications for individuals' well-being. Personal genomic data are also unique because unlike other personal data, which constantly change, genomic data are largely stable during a person's lifetime; it is their interpretation and implications that change over time as new medical research exposes relationships between genes and health. In this paper, we present a novel tool for self exploration of personal genomic data. To evaluate the usability and utility of the tool, we conducted the first study of a genome interpretation tool to date, in which users used their own personal genomic data. We conclude by offering design implications for the development of interactive personal genomic reports.", "citation": "Citations (4)", "year": "2016", "departments": ["Wellesley College", "New York University", "Wellesley College", "New York University", "Wellesley College"], "conf": "chi", "authors": ["Orit Shaer.....http://dblp.org/pers/hd/s/Shaer:Orit", "Oded Nov.....http://dblp.org/pers/hd/n/Nov:Oded", "Johanna Okerlund.....http://dblp.org/pers/hd/o/Okerlund:Johanna", "Martina Balestra.....http://dblp.org/pers/hd/b/Balestra:Martina", "Elizabeth Stowell.....http://dblp.org/pers/hd/s/Stowell:Elizabeth", "Lauren Westendorf.....http://dblp.org/pers/hd/w/Westendorf:Lauren", "Christina Pollalis.....http://dblp.org/pers/hd/p/Pollalis:Christina", "Jasmine Davis.....http://dblp.org/pers/hd/d/Davis:Jasmine", "Liliana Westort.....http://dblp.org/pers/hd/w/Westort:Liliana", "Madeleine Ball.....http://dblp.org/pers/hd/b/Ball:Madeleine"], "pages": 12}