{"title": "OLAP over probabilistic data cubes I: Aggregating, materializing, and querying.", "fields": ["cuboid", "analytics", "online analytical processing", "data cube", "source data"], "abstract": "On-Line Analytical Processing (OLAP) enables powerful analytics by quickly computing aggregate values of numerical measures over multiple hierarchical dimensions for massive datasets. However, many types of source data, e.g., from GPS, sensors, and other measurement devices, are intrinsically inaccurate (imprecise and/or uncertain) and thus OLAP cannot be readily applied. In this paper, we address the resulting data veracity problem in OLAP by proposing the concept of probabilistic data cubes. Such a cube is comprised of a set of probabilistic cuboids which summarize the aggregated values in the form of probability mass functions (pmfs in short) and thus offer insights into the underlying data quality and enable confidence-aware query evaluation and analysis. However, the probabilistic nature of data poses computational challenges as even simple operations are #P-hard under the possible world semantics. Even worse, it is hard to share computations among different cuboids, as aggregation functions that are distributive for traditional data cubes, e.g., SUM and COUNT, become holistic in probabilistic settings. In this paper, we propose a complete set of techniques for probabilistic data cubes, from cuboid aggregation, over cube materialization, to query evaluation. For aggregation, we focus on how to maximize the sharing of computation among cells and cuboids. We present two aggregation methods: convolution and sketch-based. The two methods scale down the time complexities of building a probabilistic cuboid to polynomial and linear, respectively. Each of the two supports both full and partial data cube materialization. Then, we devise a cost model which guides the aggregation methods to be deployed and combined during the cube materialization. We further provide algorithms for probabilistic slicing and dicing queries on the data cube. Extensive experiments over real and synthetic datasets are conducted to show that the techniques are effective and scalable.", "citation": "Citations (4)", "departments": ["Aalborg University", "University of Science and Technology of China", "Aalborg University", "University of Science and Technology of China", "Renmin University of China"], "authors": ["Xike Xie.....http://dblp.org/pers/hd/x/Xie:Xike", "Xingjun Hao.....http://dblp.org/pers/hd/h/Hao:Xingjun", "Torben Bach Pedersen.....http://dblp.org/pers/hd/p/Pedersen:Torben_Bach", "Peiquan Jin.....http://dblp.org/pers/hd/j/Jin:Peiquan", "Jinchuan Chen.....http://dblp.org/pers/hd/c/Chen:Jinchuan"], "conf": "icde", "year": "2016", "pages": 12}