{"title": "Composite Correlation Quantization for Efficient Multimodal Retrieval.", "fields": ["search engine indexing", "binary code", "isomorphism", "composite number", "hash function"], "abstract": "Efficient similarity retrieval from large-scale multimodal database is pervasive in modern search engines and social networks. To support queries across content modalities, the system should enable cross-modal correlation and computation-efficient indexing. While hashing methods have shown great potential in achieving this goal, current attempts generally fail to learn isomorphic hash codes in a seamless scheme, that is, they embed multiple modalities in a continuous isomorphic space and separately threshold embeddings into binary codes, which incurs substantial loss of retrieval accuracy. In this paper, we approach seamless multimodal hashing by proposing a novel Composite Correlation Quantization (CCQ) model. Specifically, CCQ jointly finds correlation-maximal mappings that transform different modalities into isomorphic latent space, and learns composite quantizers that convert the isomorphic latent features into compact binary codes. An optimization framework is devised to preserve both intra-modal similarity and inter-modal correlation through minimizing both reconstruction and quantization errors, which can be trained from both paired and partially paired data in linear time. A comprehensive set of experiments clearly show the superior effectiveness and efficiency of CCQ against the state of the art hashing methods for both unimodal and cross-modal retrieval.", "citation": "Citations (15)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Illinois at Chicago"], "authors": ["Mingsheng Long.....http://dblp.org/pers/hd/l/Long:Mingsheng", "Yue Cao.....http://dblp.org/pers/hd/c/Cao:Yue", "Jianmin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianmin", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "conf": "sigir", "year": "2016", "pages": 10}