{"title": "Emma in Action: Declarative Dataflows for Scalable Data Analysis.", "fields": ["dataflow", "programmer", "lag", "object relational impedance mismatch", "scala"], "abstract": "Parallel dataflow APIs based on second-order functions were originally seen as a flexible alternative to SQL. Over time, however, their complexity increased due to the number of physical aspects that had to be exposed by the underlying engines in order to facilitate efficient execution. To retain a sufficient level of abstraction and lower the barrier of entry for data scientists, projects like Spark and Flink currently offer domain-specific APIs on top of their parallel collection abstractions. This demonstration highlights the benefits of an alternative design based on deep language embedding. We showcase Emma - a programming language embedded in Scala. Emma promotes parallel collection processing through native constructs like Scala's for-comprehensions - a declarative syntax akin to SQL. In addition, Emma also advocates quasi-quoting the entire data analysis algorithm rather than its individual dataflow expressions. This allows for decomposing the quoted code into (sequential) control flow and (parallel) dataflow fragments, optimizing the dataflows in context, and transparently offloading them to an engine like Spark or Flink. The proposed design promises increased programmer productivity due to avoiding an impedance mismatch, thereby reducing the lag times and cost of data analysis.", "citation": "Citations (3)", "year": "2016", "departments": ["Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin"], "conf": "sigmod", "authors": ["Alexander Alexandrov.....http://dblp.org/pers/hd/a/Alexandrov_0001:Alexander", "Andreas Salzmann.....http://dblp.org/pers/hd/s/Salzmann:Andreas", "Georgi Krastev.....http://dblp.org/pers/hd/k/Krastev:Georgi", "Asterios Katsifodimos.....http://dblp.org/pers/hd/k/Katsifodimos:Asterios", "Volker Markl.....http://dblp.org/pers/hd/m/Markl:Volker"], "pages": 4}