{"title": "StraightTaint: decoupled offline symbolic taint analysis.", "fields": ["reverse engineering", "malware", "bottleneck", "real time computing", "taint checking"], "abstract": "Taint analysis has been widely applied in ex post facto security applications, such as attack provenance investigation, computer forensic analysis, and reverse engineering. Unfortunately, the high runtime overhead imposed by dynamic taint analysis makes it impractical in many scenarios. The key obstacle is the strict coupling of program execution and taint tracking logic code. To alleviate this performance bottleneck, recent work seeks to offload taint analysis from program execution and run it on a spare core or a different CPU. However, since the taint analysis has heavy data and control dependencies on the program execution, the massive data in recording and transformation overshadow the benefit of decoupling. In this paper, we propose a novel technique to allow very lightweight logging, resulting in much lower execution slowdown, while still permitting us to perform full-featured offline taint analysis. We develop StraightTaint, a hybrid taint analysis tool that completely decouples the program execution and taint analysis. StraightTaint relies on very lightweight logging of the execution information to reconstruct a straight-line code, enabling an offline symbolic taint analysis without frequent data communication with the application. While StraightTaint does not log complete runtime or input values, it is able to precisely identify the causal relationships between sources and sinks, for example. Compared with traditional dynamic taint analysis tools, StraightTaint has much lower application runtime overhead.", "citation": "Citations (3)", "departments": ["Penn State College of Information Sciences and Technology", "Penn State College of Information Sciences and Technology", "Penn State College of Information Sciences and Technology", "Penn State College of Information Sciences and Technology", "Penn State College of Information Sciences and Technology"], "authors": ["Jiang Ming.....http://dblp.org/pers/hd/m/Ming_0002:Jiang", "Dinghao Wu.....http://dblp.org/pers/hd/w/Wu:Dinghao", "Jun Wang.....http://dblp.org/pers/hd/w/Wang:Jun", "Gaoyao Xiao.....http://dblp.org/pers/hd/x/Xiao:Gaoyao", "Peng Liu.....http://dblp.org/pers/hd/l/Liu:Peng"], "conf": "kbse", "year": "2016", "pages": 12}