{"title": "PurTreeClust: A purchase tree clustering algorithm for large-scale customer transaction data.", "fields": ["k medians clustering", "cover tree", "canopy clustering algorithm", "fractal tree index", "data stream clustering"], "abstract": "Clustering of customer transaction data is usually an important procedure to analyze customer behaviors in retail and e-commerce companies. Note that products from companies are often organized as a product tree, in which the leaf nodes are goods to sell, and the internal nodes (except root node) could be multiple product categories. Based on this tree, we present to use a “personalized product tree”, called purchase tree, to represent a customer's transaction data. The customer transaction data set can be represented as a set of purchase trees. We propose a PurTreeClust algorithm for clustering of large-scale customers from purchase trees. We define a new distance metric to effectively compute the distance between two purchase trees from the entire levels in the tree. A cover tree is then built for indexing the purchase tree data and we propose a leveled density estimation method for selecting initial cluster centers from a cover tree. PurTreeClust, a fast clustering method for clustering of large-scale purchase trees, is then presented. Last, we propose a gap statistic based method for estimating the number of clusters from the purchase tree clustering results. A series of experiments were conducted on ten large-scale transaction data sets which contain up to four million transaction records, and experimental results have verified the effectiveness and efficiency of the proposed method. We also compared our method with three clustering algorithms, e.g., spectral clustering, hierarchical agglomerative clustering and DBSCAN. The experimental results have demonstrated the superior performance of the proposed method.", "citation": "Citations (2)", "departments": ["Shenzhen University", "Shenzhen University", "Ecosystem & Clo ... IAT, CAS, China"], "authors": ["Xiaojun Chen.....http://dblp.org/pers/hd/c/Chen_0006:Xiaojun", "Joshua Zhexue Huang.....http://dblp.org/pers/hd/h/Huang:Joshua_Zhexue", "Jun Luo.....http://dblp.org/pers/hd/l/Luo:Jun"], "conf": "icde", "year": "2016", "pages": 12}