{"title": "Consolidating Concurrency Control and Consensus for Commits under Conflicts.", "fields": ["commit", "janus", "distributed transaction", "paxos", "serialization"], "abstract": "Conventional fault-tolerant distributed transactions layer a traditional concurrency control protocol on top of the Paxos consensus protocol. This approach provides scalability, availability, and strong consistency. When used for wide-area storage, however, this approach incurs cross-data-center coordination twice, in serial: once for concurrency control, and then once for consensus. In this paper, we make the key observation that the coordination required for concurrency control and consensus is highly similar. Specifically, each tries to ensure the serialization graph of transactions is acyclic. We exploit this insight in the design of Janus, a unified concurrency control and consensus protocol. Janus targets one-shot transactions written as stored procedures, a common, but restricted, class of transactions. Like MDCC [16] and TAPIR [51], Janus can commit unconflicted transactions in this class in one round-trip. Unlike MDCC and TAPIR, Janus avoids aborts due to contention: it commits conflicted transactions in this class in at most two round-trips as long as the network is well behaved and a majority of each server replica is alive.\n\nWe compare Janus with layered designs and TAPIR under a variety of workloads in this class. Our evaluation shows that Janus achieves ∼5× the throughput of a layered system and 90% of the throughput of TAPIR under a contention-free microbenchmark. When the workloads become contended, Janus provides much lower latency and higher throughput (up to 6:8×) than the baselines.", "citation": "Citations (6)", "departments": ["New York University", "New York University", "University of Southern California", "New York University"], "authors": ["Shuai Mu.....http://dblp.org/pers/hd/m/Mu_0001:Shuai", "Lamont Nelson.....http://dblp.org/pers/hd/n/Nelson:Lamont", "Wyatt Lloyd.....http://dblp.org/pers/hd/l/Lloyd:Wyatt", "Jinyang Li.....http://dblp.org/pers/hd/l/Li_0001:Jinyang"], "conf": "osdi", "year": "2016", "pages": 16}