{"title": "Finite Sample Prediction and Recovery Bounds for Ordinal Embedding.", "fields": ["embedding problem", "ordinal number", "embedding", "invertible matrix", "distance matrix"], "abstract": "The goal of ordinal embedding is to represent items as points in a low-dimensional Euclidean space given a set of constraints like ``item $i$ is closer to item $j$ than item $k$''. Ordinal constraints like this often come from human judgments. The classic approach to solving this problem is known as non-metric multidimensional scaling. To account for errors and variation in judgments, we consider the noisy situation in which the given constraints are independently corrupted by reversing the correct constraint with some probability. The ordinal embedding problem has been studied for decades, but most past work pays little attention to the question of whether accurate embedding is possible, apart from empirical studies. This paper shows that under a generative data model it is possible to learn the correct embedding from noisy distance comparisons. In establishing this fundamental result, the paper makes several new contributions. First, we derive prediction error bounds for embedding from noisy distance comparisons by exploiting the fact that the rank of a distance matrix of points in $\\R^d$ is at most $d+2$. These bounds characterize how well a learned embedding predicts new comparative judgments. Second, we show that the underlying embedding can be recovered by solving a simple convex optimization. This result is highly non-trivial since we show that the linear map corresponding to distance comparisons is non-invertible, but there exists a nonlinear map that is invertible. Third, two new algorithms for ordinal embedding are proposed and evaluated in experiments.", "citation": "Citations (9)", "departments": ["University of Wisconsin-Madison", "University of California, Berkeley", "University of Wisconsin-Madison"], "authors": ["Lalit Jain.....http://dblp.org/pers/hd/j/Jain:Lalit", "Kevin G. Jamieson.....http://dblp.org/pers/hd/j/Jamieson:Kevin_G=", "Robert D. Nowak.....http://dblp.org/pers/hd/n/Nowak:Robert_D="], "conf": "nips", "year": "2016", "pages": 9}