{"title": "BigDebug: debugging primitives for interactive big data processing in spark.", "fields": ["debugging", "tracing", "crash", "debugger", "breakpoint"], "abstract": "Developers use cloud computing platforms to process a large quantity of data in parallel when developing big data analytics. Debugging the massive parallel computations that run in today's datacenters is time consuming and error-prone. To address this challenge, we design a set of interactive, real-time debugging primitives for big data processing in Apache Spark, the next generation data-intensive scalable cloud computing platform. This requires rethinking the notion of step-through debugging in a traditional debugger such as gdb, because pausing the entire computation across distributed worker nodes causes significant delay and naively inspecting millions of records using a watchpoint is too time consuming for an end user.   First, B ig D ebug 's simulated breakpoints and on-demand watchpoints allow users to selectively examine distributed, intermediate data on the cloud with little overhead. Second, a user can also pinpoint a crash-inducing record and selectively resume relevant sub-computations after a quick fix. Third, a user can determine the root causes of errors (or delays) at the level of individual records through a fine-grained data provenance capability. Our evaluation shows that B ig D ebug  scales to terabytes and its record-level tracing incurs less than 25% overhead on average. It determines crash culprits orders of magnitude more accurately and provides up to 100% time saving compared to the baseline replay debugger. The results show that B ig D ebug  supports debugging at interactive speeds with minimal performance impact.", "citation": "Citations (21)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Muhammad Ali Gulzar.....http://dblp.org/pers/hd/g/Gulzar:Muhammad_Ali", "Matteo Interlandi.....http://dblp.org/pers/hd/i/Interlandi:Matteo", "Seunghyun Yoo.....http://dblp.org/pers/hd/y/Yoo:Seunghyun", "Sai Deep Tetali.....http://dblp.org/pers/hd/t/Tetali:Sai_Deep", "Tyson Condie.....http://dblp.org/pers/hd/c/Condie:Tyson", "Todd D. Millstein.....http://dblp.org/pers/hd/m/Millstein:Todd_D=", "Miryung Kim.....http://dblp.org/pers/hd/k/Kim:Miryung"], "conf": "icse", "year": "2016", "pages": 12}