{"title": "Interface Design Optimization as a Multi-Armed Bandit Problem.", "fields": ["random assignment", "game design", "design science", "multi armed bandit", "interface design"], "abstract": "\"Multi-armed bandits\" offer a new paradigm for the AI-assisted design of user interfaces. To help designers understand the potential, we present the results of two experimental comparisons between bandit algorithms and random assignment. Our studies are intended to show designers how bandits algorithms are able to rapidly explore an experimental design space and automatically select the optimal design configuration. Our present focus is on the optimization of a game design space. The results of our experiments show that bandits can make data-driven design more efficient and accessible to interface designers, but that human participation is essential to ensure that AI systems optimize for the right metric. Based on our results, we introduce several design lessons that help keep human design judgment in the loop. We also consider the future of human-technology teamwork in AI-assisted design and scientific inquiry. Finally, as bandits deploy fewer low-performing conditions than typical experiments, we discuss ethical implications for bandits in large-scale experiments in education.", "citation": "Citations (6)", "year": "2016", "departments": ["University of California, San Diego", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "chi", "authors": ["J. Derek Lomas.....http://dblp.org/pers/hd/l/Lomas:J=_Derek", "Jodi Forlizzi.....http://dblp.org/pers/hd/f/Forlizzi:Jodi", "Nikhil Poonwala.....http://dblp.org/pers/hd/p/Poonwala:Nikhil", "Nirmal Patel.....http://dblp.org/pers/hd/p/Patel:Nirmal", "Sharan Shodhan.....http://dblp.org/pers/hd/s/Shodhan:Sharan", "Kishan Patel.....http://dblp.org/pers/hd/p/Patel:Kishan", "Kenneth R. Koedinger.....http://dblp.org/pers/hd/k/Koedinger:Kenneth_R=", "Emma Brunskill.....http://dblp.org/pers/hd/b/Brunskill:Emma"], "pages": 12}