{"title": "DUALSIM: Parallel Subgraph Enumeration in a Massive Graph on a Single Machine.", "fields": ["graph factorization", "reconstruction conjecture", "universal graph", "factor critical graph", "forbidden graph characterization"], "abstract": "Subgraph enumeration is important for many applications such as subgraph frequencies, network motif discovery, graphlet kernel computation, and studying the evolution of social networks. Most earlier work on subgraph enumeration assumes that graphs are resident in memory, which results in serious scalability problems. Recently, efforts to enumerate all subgraphs in a large-scale graph have seemed to enjoy some success by partitioning the data graph and exploiting the distributed frameworks such as MapReduce and distributed graph engines. However, we notice that all existing distributed approaches have serious performance problems for subgraph enumeration due to the explosive number of partial results. In this paper, we design and implement a disk-based, single machine  parallel subgraph enumeration solution  called DualSim that can handle massive graphs without maintaining exponential numbers of partial results. Specifically, we propose a novel concept of the  dual approach  for subgraph enumeration. The dual approach swaps the roles of the data graph and the query graph. Specifically, instead of fixing the matching order in the query and then matching data vertices, it fixes the data vertices by fixing a set of disk pages and then finds all subgraph matchings in these pages. This enables us to significantly reduce the number of disk reads. We conduct extensive experiments with various real-world graphs to systematically demonstrate the superiority of DualSim over state-of-the-art distributed subgraph enumeration methods. DualSim outperforms the state-of-the-art methods by up to orders of magnitude, while they fail for many queries due to explosive intermediate results.", "citation": "Citations (6)", "year": "2016", "departments": ["Pohang University of Science and Technology", "Pohang University of Science and Technology", "Nanyang Technological University", "Pohang University of Science and Technology", "Pohang University of Science and Technology"], "conf": "sigmod", "authors": ["Hyeonji Kim.....http://dblp.org/pers/hd/k/Kim:Hyeonji", "Juneyoung Lee.....http://dblp.org/pers/hd/l/Lee:Juneyoung", "Sourav S. Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick:Sourav_S=", "Wook-Shin Han.....http://dblp.org/pers/hd/h/Han:Wook=Shin", "Jeong-Hoon Lee.....http://dblp.org/pers/hd/l/Lee:Jeong=Hoon", "Seongyun Ko.....http://dblp.org/pers/hd/k/Ko:Seongyun", "Moath H. A. Jarrah.....http://dblp.org/pers/hd/j/Jarrah:Moath_H=_A="], "pages": 15}