{"title": "Local Similarity Search for Unstructured Text.", "fields": ["popularity", "rendering", "security token", "speedup", "nearest neighbor search"], "abstract": "With the growing popularity of electronic documents, replication can occur for many reasons. People may copy text segments from various sources and make modifications. In this paper, we study the problem of local similarity search to find partially replicated text. Unlike existing studies on similarity search which find entirely duplicated documents, our target is to identify documents that approximately share a pair of sliding windows which differ by no more than τ tokens. Our problem is technically challenging because for sliding windows the tokens to be indexed are less selective than entire documents, rendering set similarity join-based algorithms less efficient. Our proposed method is based on enumerating token combinations to obtain signatures with high selectivity. In order to strike a balance between signature and candidate generation, we partition the token universe and for different partitions we generate combinations composed of different numbers of tokens. A cost-aware algorithm is devised to find a good partitioning of the token universe. We also propose to leverage the overlap between adjacent windows to share computation and thus speed up query processing. In addition, we develop the techniques to support the large thresholds. Experiments on real datasets demonstrate the efficiency of our method against alternative solutions.", "citation": "Citations (3)", "year": "2016", "departments": ["Nagoya University", "Nagoya University", "University of New South Wales", "University of New South Wales", "University of New South Wales"], "conf": "sigmod", "authors": ["Pei Wang.....http://dblp.org/pers/hd/w/Wang:Pei", "Chuan Xiao.....http://dblp.org/pers/hd/x/Xiao:Chuan", "Jianbin Qin.....http://dblp.org/pers/hd/q/Qin:Jianbin", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0011:Wei", "Xiaoyang Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiaoyang", "Yoshiharu Ishikawa.....http://dblp.org/pers/hd/i/Ishikawa:Yoshiharu"], "pages": 15}