{"title": "Online Spatio-Temporal Matching in Stochastic and Dynamic Domains.", "fields": ["dynamic programming", "scalability", "server", "data set", "stochastic optimization", "taxis", "machine learning"], "abstract": "Abstract   Online spatio-temporal matching of servers/services to customers is a problem that arises at a large scale in many domains associated with shared transportation (e.g., taxis, ride sharing, super shuttles, etc.) and delivery services (e.g., food, equipment, clothing, home fuel, etc.). A key characteristic of these problems is that the matching of servers/services to customers in one stage has a direct impact on the matching in the next stage. For instance, it is efficient for taxis to pick up customers closer to the drop off point of the customer from the first stage of matching. Traditionally, greedy/myopic approaches have been adopted to address such large scale online matching problems. While they provide solutions in a scalable manner, due to their myopic nature, the quality of matching obtained can be improved significantly (demonstrated in our experimental results). In this paper, we present a multi-stage stochastic optimization formulation to consider potential future demand scenarios (obtained from past data). We then provide an enhancement to solve large scale problems more effectively and efficiently online. We also provide the worst-case theoretical bounds on the performance of different approaches. Finally, we demonstrate the significant improvement provided by our techniques over myopic approaches and two other multi-stage approaches from literature (Approximate Dynamic Programming and Hybrid Multi-Stage Stochastic optimization formulation) on three real world taxi data sets.", "citation": "Not cited", "departments": ["Singapore Management University", "Singapore Management University", "Massachusetts Institute of Technology", "Singapore Management University", "Singapore Management University", "Massachusetts Institute of Technology"], "authors": ["Meghna Lowalekar.....http://dblp.org/pers/hd/l/Lowalekar:Meghna", "Pradeep Varakantham.....http://dblp.org/pers/hd/v/Varakantham:Pradeep", "Patrick Jaillet.....http://dblp.org/pers/hd/j/Jaillet:Patrick"], "conf": "aaai", "year": "2016", "pages": 7}