{"title": "Just One More: Modeling Binge Watching Behavior.", "fields": ["binge watching", "customer retention", "mixture model", "audience measurement", "revenue"], "abstract": "Easy accessibility can often lead to over-consumption, as seen in food and alcohol habits. On video on-demand (VOD) services, this has recently been referred to as binge watching, where potentially entire seasons of TV shows are consumed in a single viewing session. While a user viewership model may reveal this binging behavior, creating an accurate model has several challenges, including censored data, deviations in the population, and the need to consider external influences on consumption habits. In this paper, we introduce a novel statistical mixture model that incorporates these factors and presents a first of its kind characterization of viewer consumption behavior using a real-world dataset that includes playback data from a VOD service. From our modeling, we tackle various predictive tasks to infer the consumption decisions of a user in a viewing session, including estimating the number of episodes they watch and classifying if they continue watching another episode. Using these insights, we then identify binge watching sessions based on deviation from normal viewing behavior. We observe different types of binging behavior, that binge watchers often view certain content out-of-order, and that binge watching is not a consistent behavior among our users. These insights and our findings have application in VOD revenue generation, consumer health applications, and customer retention analysis.", "citation": "Citations (8)", "departments": ["École Polytechnique Fédérale de Lausanne", "Technicolor", "Technicolor", "Technicolor"], "authors": ["William Trouleau.....http://dblp.org/pers/hd/t/Trouleau:William", "Azin Ashkan.....http://dblp.org/pers/hd/a/Ashkan:Azin", "Weicong Ding.....http://dblp.org/pers/hd/d/Ding:Weicong", "Brian Eriksson.....http://dblp.org/pers/hd/e/Eriksson:Brian"], "conf": "kdd", "year": "2016", "pages": 10}