{"title": "Revisiting congestion control for multipath TCP with shared bottleneck detection.", "fields": ["h tcp", "tcp tuning", "cubic tcp", "tcp friendly rate control", "tcp westwood plus"], "abstract": "Multipath TCP (MPTCP) enables the simultaneous use of multiple links for bandwidth aggregation, better resource utilization and improved reliability. Its coupled congestion control intends to reap the increased bandwidth of multiple links, while avoiding being more aggressive than regular TCP flows on every used link. We argue that this leads to a very conservative behavior when paths do not share a bottleneck. Therefore, in this paper, we first quantify the penalty of the coupled congestion control for links that do not share a bottleneck. Then, in order to overcome this penalty, we design and implement a practical shared bottleneck detection (SBD) algorithm for MPTCP, namely MPTCP-SBD. Through extensive emulations, we show that MPTCP-SBD outperforms all currently deployed MPTCP coupled congestion controls by accurately detecting bottlenecks. For the non-shared bottleneck scenario, we observe throughput gains of up to 40% with two subflows and the gains increase significantly as the number of subflows increase, reaching more than 100% for five subflows. Furthermore, for the shared bottleneck scenario, we show that MPTCP-SBD remains fair to TCP. We complement the emulation results with real-network experiments justifying its safeness for deployment.", "citation": "Citations (5)", "departments": ["Simula Research Laboratory", "Simula Research Laboratory", "Simula Research Laboratory", "Universitetet i ... for informatikk", "Universitetet i ... for informatikk"], "authors": ["Simone Ferlin.....http://dblp.org/pers/hd/f/Ferlin:Simone", "Özgü Alay.....http://dblp.org/pers/hd/a/Alay:=Ouml=zg=uuml=", "Thomas Dreibholz.....http://dblp.org/pers/hd/d/Dreibholz:Thomas", "David A. Hayes.....http://dblp.org/pers/hd/h/Hayes:David_A=", "Michael Welzl.....http://dblp.org/pers/hd/w/Welzl:Michael"], "conf": "infocom", "year": "2016", "pages": 9}