{"title": "PISCES: A Programmable, Protocol-Independent Software Switch.", "fields": ["codebase", "network packet", "optimizing compiler", "communications protocol", "debugging"], "abstract": "Hypervisors use software switches to steer packets to and from virtual machines (VMs). These switches frequently need upgrading and customization—to support new protocol headers or encapsulations for tunneling and overlays, to improve measurement and debugging features, and even to add middlebox-like functions. Software switches are typically based on a large body of code, including kernel code, and changing the switch is a formidable undertaking requiring domain mastery of network protocol design and developing, testing, and maintaining a large, complex codebase. Changing how a software switch forwards packets should not require intimate knowledge of its implementation. Instead, it should be possible to specify how packets are processed and forwarded in a high-level domain-specific language (DSL) such as P4, and compiled to run on a software switch. We present PISCES, a software switch derived from Open vSwitch (OVS), a hard-wired hypervisor switch, whose behavior is customized using P4. PISCES is not hard-wired to specific protocols; this independence makes it easy to add new features. We also show how the compiler can analyze the high-level specification to optimize forwarding performance. Our evaluation shows that PISCES performs comparably to OVS and that PISCES programs are about 40 times shorter than equivalent changes to OVS source code.", "citation": "Citations (68)", "departments": ["Princeton University", "Stanford University", "VMware", "Princeton University", "Barefoot Networks"], "authors": ["Muhammad Shahbaz.....http://dblp.org/pers/hd/s/Shahbaz:Muhammad", "Sean Choi.....http://dblp.org/pers/hd/c/Choi:Sean", "Ben Pfaff.....http://dblp.org/pers/hd/p/Pfaff:Ben", "Changhoon Kim.....http://dblp.org/pers/hd/k/Kim:Changhoon", "Nick Feamster.....http://dblp.org/pers/hd/f/Feamster:Nick", "Nick McKeown.....http://dblp.org/pers/hd/m/McKeown:Nick", "Jennifer Rexford.....http://dblp.org/pers/hd/r/Rexford:Jennifer"], "conf": "sigcomm", "year": "2016", "pages": 14}