{"title": "Moving tag detection via physical layer analysis for large-scale RFID systems.", "fields": ["collision", "embedded system", "decoding methods", "physical layer", "real time computing"], "abstract": "In a number of RFID-based applications such as logistics monitoring, the RFID systems are deployed to monitor a large number of RFID tags. They are usually required to track the movement of all tags in a real-time approach, since the tagged-goods are moved in and out in a rather frequent approach. However, a typical cycle of tag inventory in COTS RFID system usually takes tens of seconds to interrogate hundreds of RFID tags. This hinders the system to track the movement of all tags in time. One critical issue in such type of tag monitoring is to efficiently distinguish the motion status of all tags, i.e., stationary or moving. According to the motion status of different tags, the state-of-art localization schemes can further track those moving tags, instead of tracking all tags. In this paper, we propose a real-time approach to detect the moving tags in the monitoring area, which is a fundamental premise to support tracking the movement of all tags. We achieve the time efficiency by decoding collisions from the physical layer. Instead of using the EPC ID, which cannot be decoded in collision slots, we are able to extract two kinds of physical-layer features of RFID tags, i.e., the phase profile and the backscatter link frequency, to distinguish among different tags in different positions. By resolving the two physical-layer features from the tag collisions, we are able to derive the motion status of multiple tags simultaneously, and greatly improve the time-efficiency. Experiment result shows that our solution can accurately detect the moving tags while reducing 80% of inventory time compared with the state-of-art solutions.", "citation": "Citations (12)", "departments": ["Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Chuyu Wang.....http://dblp.org/pers/hd/w/Wang:Chuyu", "Lei Xie.....http://dblp.org/pers/hd/x/Xie_0004:Lei", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0002:Wei", "Tao Xue.....http://dblp.org/pers/hd/x/Xue:Tao", "Sanglu Lu.....http://dblp.org/pers/hd/l/Lu:Sanglu"], "conf": "infocom", "year": "2016", "pages": 9}