{"title": "Adwords management for third-parties in SEM: An optimisation model and the potential of Twitter.", "fields": ["project portfolio management", "portfolio", "bridging", "return on investment", "search engine optimization"], "abstract": "In Search Engine Marketing (SEM), “third-party” partners play an important intermediate role by bridging the gap between search engines and advertisers in order to optimise advertisers' campaigns in exchange of a service fee. In this paper, we present an economic analysis of the market involving a third-party broker in Google AdWords and the broker's customers. We show that in order to optimise his profit, a third-party broker should minimise the weighted average Cost Per Click (CPC) of the portfolio of keywords attached to customer's ads while still satisfying the negotiated customer's demand. To help the broker build and manage such portfolio of keywords, we develop an optimisation framework inspired from the classical Markowitz portfolio management which integrates the customer's demand constraint and enables the broker to manage the tradeoff between return on investment and risk through a single risk aversion parameter. We then propose a method to augment the keywords portfolio with relevant keywords extracted from trending and popular topics on Twitter. Our evaluation shows that such a keywords-augmented strategy is very promising and enables the broker to achieve, on average, four folds larger return on investment than with a non-augmented strategy, while still maintaining the same level of risk.", "citation": "Citations (1)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Commonwealth Scientific and Industrial Research Organisation", "University of Savoy"], "authors": ["Dong Wang.....http://dblp.org/pers/hd/w/Wang:Dong", "Zhenyu Li.....http://dblp.org/pers/hd/l/Li_0001:Zhenyu", "Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang", "Mohamed Ali Kâafar.....http://dblp.org/pers/hd/k/K=acirc=afar:Mohamed_Ali", "Kavé Salamatian.....http://dblp.org/pers/hd/s/Salamatian:Kav=eacute="], "conf": "infocom", "year": "2016", "pages": 9}