{"title": "Complexity of Manipulation with Partial Information in Voting.", "fields": ["complete information", "voting", "simulation", "existential quantification", "manipulator", "computational complexity theory", "machine learning"], "abstract": "The Coalitional Manipulation problem has been studied extensively in the literature for many voting rules. However, most studies have focused on the complete information setting, wherein the manipulators know the votes of the non-manipulators. While this assumption is reasonable for purposes of showing intractability, it is unrealistic for algorithmic considerations. In most real-world scenarios, it is impractical for the manipulators to have accurate knowledge of all the other votes. In this paper, we investigate manipulation with incomplete information. In our framework, the manipulators know a partial order for each voter that is consistent with the true preference of that voter. In this setting, we formulate three natural computational notions of manipulation, namely weak, opportunistic, and strong manipulation. We consider several scenarios for which the traditional manipulation problems are easy (for instance, Borda with a single manipulator). For many of them, the corresponding manipulative questions that we propose turn out to be computationally intractable. Our hardness results often hold even when very little information is missing, or in other words, even when the instances are quite close to the complete information setting. Our overall conclusion is that computational hardness continues to be a valid obstruction to manipulation, in the context of a more realistic model.", "citation": "Not cited", "year": "2016", "departments": ["Indian Institute of Science", "Indian Institute of Technology Gandhinagar", "Indian Institute of Science"], "conf": "ijcai", "authors": ["Palash Dey.....http://dblp.org/pers/hd/d/Dey:Palash", "Neeldhara Misra.....http://dblp.org/pers/hd/m/Misra:Neeldhara", "Y. Narahari.....http://dblp.org/pers/hd/n/Narahari:Y="], "pages": 7}