{"title": "Morpheus: Creating Application Objects Efficiently for Heterogeneous Computing.", "fields": ["serialization", "symmetric multiprocessor system", "overhead", "speedup", "central processing unit"], "abstract": "In high performance computing systems, object deserialization can become a surprisingly important bottleneck---in our test, a set of general-purpose, highly parallelized applications spends 64% of total execution time deserializing data into objects.   This paper presents the Morpheus model, which allows applications to move such computations to a storage device. We use this model to deserialize data into application objects inside storage devices, rather than in the host CPU. Using the Morpheus model for object deserialization avoids unnecessary system overheads, frees up scarce CPU and main memory resources for compute-intensive workloads, saves I/O bandwidth, and reduces power consumption. In heterogeneous, co-processor-equipped systems, Morpheus allows application objects to be sent directly from a storage device to a co-processor (e.g., a GPU) by peer-to-peer transfer, further improving application performance as well as reducing the CPU and main memory utilizations.   This paper implements Morpheus-SSD, an SSD supporting the Morpheus model. Morpheus-SSD improves the performance of object deserialization by 1.66×, reduces power consumption by 7%, uses 42% less energy, and speeds up the total execution time by 1.32×. By using NVMe-P2P that realizes peer-to-peer communication between Morpheus-SSD and a GPU, Morpheus-SSD can speed up the total execution time by 1.39× in a heterogeneous computing platform.", "citation": "Citations (9)", "departments": ["University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California"], "authors": ["Hung-Wei Tseng.....http://dblp.org/pers/hd/t/Tseng:Hung=Wei", "Qianchen Zhao.....http://dblp.org/pers/hd/z/Zhao:Qianchen", "Yuxiao Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuxiao", "Mark Gahagan.....http://dblp.org/pers/hd/g/Gahagan:Mark", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "conf": "isca", "year": "2016", "pages": 13}