{"title": "Predicting Personalized Emotion Perceptions of Social Images.", "fields": ["categorical variable", "affect", "emotion classification", "semantics", "social environment"], "abstract": "Images can convey rich semantics and induce various emotions to viewers. Most existing works on affective image analysis focused on predicting the dominant emotions for the majority of viewers. However, such dominant emotion is often insufficient in real-world applications, as the emotions that are induced by an image are highly subjective and different with respect to different viewers. In this paper, we propose to predict the personalized emotion perceptions of images for each individual viewer. Different types of factors that may affect personalized image emotion perceptions, including visual content, social context, temporal evolution, and location influence, are jointly investigated. Rolling multi-task hypergraph learning is presented to consistently combine these factors and a learning algorithm is designed for automatic optimization. For evaluation, we set up a large scale image emotion dataset from Flickr, named Image-Emotion-Social-Net, on both dimensional and categorical emotion representations with over 1 million images and about 8,000 users. Experiments conducted on this dataset demonstrate that the proposed method can achieve significant performance gains on personalized emotion classification, as compared to several state-of-the-art approaches.", "citation": "Citations (23)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Tsinghua University", "Xiamen University", "Harbin Institute of Technology"], "authors": ["Sicheng Zhao.....http://dblp.org/pers/hd/z/Zhao:Sicheng", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Yue Gao.....http://dblp.org/pers/hd/g/Gao:Yue", "Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Wenlong Xie.....http://dblp.org/pers/hd/x/Xie:Wenlong", "Xiaolei Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaolei", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2016", "pages": 10}