{"title": "\"Congruent\" and \"Opposite\" Neurons: Sisters for Multisensory Integration and Segregation.", "fields": ["vestibular system", "dorsum", "congruence", "multisensory integration", "offset"], "abstract": "Experiments reveal that in the dorsal medial superior temporal (MSTd) and the ventral intraparietal (VIP) areas, where visual and vestibular cues are integrated to infer heading direction, there are two types of neurons with roughly the same number. One is “congruent” cells, whose preferred heading directions are similar in response to visual and vestibular cues; and the other is “opposite” cells, whose preferred heading directions are nearly “opposite” (with an offset of 180 degree) in response to visual vs. vestibular cues. Congruent neurons are known to be responsible for cue integration, but the computational role of opposite neurons remains largely unknown. Here, we propose that opposite neurons may serve to encode the disparity information between cues necessary for multisensory segregation. We build a computational model composed of two reciprocally coupled modules, MSTd and VIP, and each module consists of groups of congruent and opposite neurons. In the model, congruent neurons in two modules are reciprocally connected with each other in the congruent manner, whereas opposite neurons are reciprocally connected in the opposite manner. Mimicking the experimental protocol, our model reproduces the characteristics of congruent and opposite neurons, and demonstrates that in each module, the sisters of congruent and opposite neurons can jointly achieve optimal multisensory information integration and segregation. This study sheds light on our understanding of how the brain implements optimal multisensory integration and segregation concurrently in a distributed manner.", "citation": "Citations (2)", "departments": ["Beijing Normal University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Beijing Normal University"], "authors": ["Wenhao Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Wenhao", "He Wang.....http://dblp.org/pers/hd/w/Wang_0004:He", "K. Y. Michael Wong.....http://dblp.org/pers/hd/w/Wong:K=_Y=_Michael", "Si Wu.....http://dblp.org/pers/hd/w/Wu:Si"], "conf": "nips", "year": "2016", "pages": 9}