{"title": "Observability, Identifiability and Sensitivity of Vision-Aided Inertial Navigation.", "fields": ["singleton", "parameter identification problem", "point estimation", "inertial measurement unit", "identifiability", "inertial navigation system"], "abstract": "We analyze the observability of 3-D pose from the fusion of visual and inertial sensors. Because the model contains unknown parameters, such as sensor biases, the problem is usually cast as a mixed filtering/identification, with the resulting observability analysis providing necessary conditions for convergence to a unique point estimate. Most models treat sensor bias rates as “noise,” independent of other states, including biases themselves, an assumption that is patently violated in practice. We show that, when this assumption is lifted, the resulting model is not observable, and therefore existing analyses cannot be used to conclude that the set of states that are indistinguishable from the measurements is a singleton. In other words, the resulting model is not observable. We therefore re-cast the analysis as one of sensitivity: Rather than attempting to prove that the set of indistinguishable trajectories is a singleton, we derive bounds on its volume, as a function of characteristics of the sensor and other sufficient excitation conditions. This provides an explicit characterization of the indistinguishable set that can be used for analysis and validation purposes.", "citation": "Not cited", "year": "2016", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "conf": "ijcai", "authors": ["Joshua Hernandez.....http://dblp.org/pers/hd/h/Hernandez:Joshua", "Konstantine Tsotsos.....http://dblp.org/pers/hd/t/Tsotsos:Konstantine", "Stefano Soatto.....http://dblp.org/pers/hd/s/Soatto:Stefano"], "pages": 5}