{"title": "Effectiveness of code contribution: from patch-based to pull-request-based tools.", "fields": ["data mining", "software", "bittorrent tracker", "mailing list", "latent variable"], "abstract": "Code contributions in Free/Libre and Open Source Software projects are controlled to maintain high-quality of software. Alternatives to patch-based code contribution tools such as mailing lists and issue trackers have been developed with the pull request systems being the most visible and widely available on GitHub. Is the code contribution process more effective with pull request systems? To answer that, we quantify the effectiveness via the rates contributions are accepted and ignored, via the time until the first response and final resolution and via the numbers of contributions. To control for the latent variables, our study includes a project that migrated from an issue tracker to the GitHub pull request system and a comparison between projects using mailing lists and pull request systems. Our results show pull request systems to be associated with reduced review times and larger numbers of contributions. However, not all the comparisons indicate substantially better accept or ignore rates in pull request systems. These variations may be most simply explained by the differences in contribution practices the projects employ and may be less affected by the type of tool. Our results clarify the importance of understanding the role of tools in effective management of the broad network of potential contributors and may lead to strategies and practices making the code contribution more satisfying and efficient from both contributors' and maintainers' perspectives.", "citation": "Citations (4)", "departments": ["Peking University", "Peking University", "University of Tennessee"], "authors": ["Jiaxin Zhu.....http://dblp.org/pers/hd/z/Zhu:Jiaxin", "Minghui Zhou.....http://dblp.org/pers/hd/z/Zhou:Minghui", "Audris Mockus.....http://dblp.org/pers/hd/m/Mockus:Audris"], "conf": "sigsoft", "year": "2016", "pages": 12}