{"title": "Uber-in-light: Unobtrusive visible light communication leveraging complementary color channel.", "fields": ["frame rate", "optoelectronics", "telecommunications", "visible light communication", "rgb color model", "complementary colors", "frame synchronization", "channel"], "abstract": "Recently, Visible Light Communication (VLC) over a screen-camera channel has drawn considerable attention to unobtrusive design. It overcomes the distractive nature of traditional coded image approaches (e.g., barcodes). Previous unobtrusive methods fall into two categories: 1) utilizing alpha channel, a well known concept in computer graphics, to encode bits into the pixel translucency change with off-the-shelf smart devices; and 2) leveraging the spatial-temporal flicker-fusion property of human vision system with the fast frame rate of modern displays. However, these approaches heavily rely on high-end devices to achieve both unobtrusive and high accuracy screen-camera-based data communication without affecting video-viewing experience. Unlike previous approaches, we propose Uber-in-light, a novel unobtrusive and accurate VLC system, that enables real-time screen-camera communication, applicable to any screen and camera. The proposed system encodes the data as complementary intensity changes over Red, Green, and Blue (RGB) color channels that could be successfully decoded by camera while leaving the human visual perception unaffected. We design a MFSK modulation scheme with dedicated frame synchronization signal embedded in an orthogonal color channel to achieve high throughput. Furthermore, together with the complementary color intensity, an enhanced MUSIC-based demodulation scheme is developed to ensure highly accurate data transmission. Our user experience experiments confirmed the effectiveness of delivering unobtrusive data across different types of video content and resolutions. Extensive real-time performance evaluations are conducted using our prototype implementation to demonstrate the efficiency and reliability of the proposed system under diverse wireless environments.", "citation": "Not cited", "departments": ["Purdue University", "Stevens Institute of Technology", "Purdue University", "Stevens Institute of Technology", "Purdue University"], "authors": ["Mostafa Izz.....http://dblp.org/pers/hd/i/Izz:Mostafa", "Zhong Yuan Li.....http://dblp.org/pers/hd/l/Li:Zhong_Yuan", "Hongbo Liu.....http://dblp.org/pers/hd/l/Liu:Hongbo", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying", "Feng Li.....http://dblp.org/pers/hd/l/Li:Feng"], "conf": "infocom", "year": "2016", "pages": 9}