{"title": "Proactive patrol dispatch surveillance system by inferring mobile trajectories of multiple intruders using binary proximity sensors.", "fields": ["sensor node", "binary number", "robustness", "computer security", "proximity sensor"], "abstract": "In this paper, we consider the problem of distributing patrol officers inside a building to maximize the probability of catching multiple intruders while minimizing the distance the patrol officers travel to reach the locations of the intruders. In our problem setting, the patrol officers are assisted by the information collected by a network of binary proximity sensors installed in the building. We claim that learning even common movement sub-patterns that originate due to the constrained physical environment helps to find likely locations of intruders where each major location is instrumented using a sensor node. We use a series of binary detection events to infer likely future trajectories in a real-world building. For a given set of detectable nodes on the inferred future trajectories, we aim to find the optimal patrol dispatch node location with high exposure to intruders' future appearance using patrol officers in limited numbers, ideally fewer than the intruders. In order to prevent possible crime and perform responsive defense against potential intruders, our algorithm also tries to reduce the travel distance from patrols current positions to their dispatched positions at the same time. We validate our proposed scheme in terms of detection accuracy by varying the number of intruders, robustness against missing events, and responsiveness compared to a practical baseline counterpart through real-world system experiments.", "citation": "Citations (1)", "departments": ["Ewha Womans University", "KAIST", "University of Houston", "Ewha Womans University"], "authors": ["Dahee Jeong.....http://dblp.org/pers/hd/j/Jeong:Dahee", "Minkyoung Cho.....http://dblp.org/pers/hd/c/Cho:Minkyoung", "Omprakash Gnawali.....http://dblp.org/pers/hd/g/Gnawali:Omprakash", "HyungJune Lee.....http://dblp.org/pers/hd/l/Lee:HyungJune"], "conf": "infocom", "year": "2016", "pages": 9}