{"title": "Hybrid Pulling/Pushing for I/O-Efficient Distributed and Iterative Graph Computing.", "fields": ["performance prediction", "vertex", "scalability", "performance studies", "communication source"], "abstract": "Billion-node graphs are rapidly growing in size in many applications such as online social networks. Most graph algorithms generate a large number of messages during iterative computations. Vertex-centric distributed systems usually store graph data and message data on disk to improve scalability. Currently, these distributed systems with disk-resident data take a push-based approach to handle messages. This works well if few messages reside on disk. Otherwise, it is I/O-inefficient due to expensive random writes. By contrast, the existing memory-resident pull-based approach individually pulls messages for each vertex on demand. Although it can be used to avoid disk operations regarding messages, expensive I/O costs are incurred by random and frequent access to vertices.   This paper proposes a hybrid solution to support switching between push and pull adaptively, to obtain optimal performance for distributed systems with disk-resident data in different scenarios. We first employ a new block-centric technique (b-pull) to improve the I/O-performance of pulling messages, although the iterative computation is vertex-centric. I/O costs of data accesses are shifted from the receiver side where messages are written/read by push to the sender side where graph data are read by b-pull. Graph data are organized by clustering vertices and edges to achieve high I/O-efficiency in b-pull. Second, we design a seamless switching mechanism and a prominent performance prediction method to guarantee efficiency when switching between push and b-pull. We conduct extensive performance studies to confirm the effectiveness of our proposals over existing up-to-date solutions using a broad spectrum of real-world graphs.", "citation": "Citations (7)", "year": "2016", "departments": ["Northeastern University", "Northeastern University", "Northeastern University", "Northeastern University", "The Chinese University of Hong Kong"], "conf": "sigmod", "authors": ["Zhigang Wang.....http://dblp.org/pers/hd/w/Wang:Zhigang", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0002:Yu", "Yubin Bao.....http://dblp.org/pers/hd/b/Bao:Yubin", "Ge Yu.....http://dblp.org/pers/hd/y/Yu_0001:Ge", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu"], "pages": 16}