{"title": "Truss Decomposition of Probabilistic Graphs: Semantics and Algorithms.", "fields": ["probabilistic logic", "computability", "truss", "witness", "complex network"], "abstract": "A key operation in network analysis is the discovery of cohesive subgraphs. The notion of $k$-truss has gained considerable popularity in this regard, based on its rich structure and efficient computability. However, many complex networks such as social, biological and communication networks feature uncertainty, best modeled using probabilities. Unfortunately the problem of discovering k-trusses in probabilistic graphs has received little attention to date. In this paper, given a probabilistic graph G, number k and parameter γ --(0,1], we define a  (k,γ)-truss  as a maximal connected subgraph H ⊆ G, in which for each edge, the probability that it is contained in at least (k-2) triangles is at least γ. We develop an efficient dynamic programming algorithm for decomposing a probabilistic graph into such maximal (k,γ)-trusses. The above definition of a (k,γ)-truss is  local  in that the \"witness\" graphs that has the (k-2) triangles containing an edge in H may be quite different for distinct edges. Hence, we also propose: a  global  (k,γ)-truss, which in addition to being a local (k,γ)-truss, has to satisfy the condition that the probability that H contains a k-truss is at least γ. We show that unlike local (k,γ)-trusses, the global (k,γ)-truss decomposition on a probabilistic graph is intractable. We propose a novel sampling technique which enables approximate discovery of global (k,γ)-trusses with high probability. Our extensive experiments on real datasets demonstrate the efficacy of our proposed approach and the usefulness of local and global (k,γ)-truss.", "citation": "Citations (14)", "year": "2016", "departments": ["University of British Columbia", "University of British Columbia", "University of British Columbia"], "conf": "sigmod", "authors": ["Xin Huang.....http://dblp.org/pers/hd/h/Huang_0001:Xin", "Wei Lu.....http://dblp.org/pers/hd/l/Lu_0002:Wei", "Laks V. S. Lakshmanan.....http://dblp.org/pers/hd/l/Lakshmanan:Laks_V=_S="], "pages": 14}