{"title": "Flash-Loc: Flashing mobile phones for accurate indoor localization.", "fields": ["augmented reality", "image subtraction", "mobile phone", "dead reckoning", "pulse width modulation"], "abstract": "Accurate indoor localization is a key enabling technology for numerous applications such as indoor navigation, mobile social networking, and augmented reality. Despite major effort from the research community, state-of-the-art indoor localization performance remains unsatisfactory. Current approaches using radio frequency entail tedious site surveys and have limited accuracy. While vision-based localization techniques are promising, they struggle with human recognition and changing environments. This paper proposes Flash-Loc, an accurate indoor localization system leveraging flashes of light to localize people carrying mobile phones in areas with deployed surveillance cameras. A person's mobile phone emits a sequence of flashes that uniquely “represents” the person from the cameras' view. Flash-Loc develops three key mechanisms that distinguish people while avoiding long irritating flashes: adaptive-length flash coding, pulse width modulation based flash generation, and image subtraction based flash localization. Further, we design a system in which Flash-Loc cooperates with fingerprinting and dead reckoning for accurate human localization. We implement Flash-Loc on commercial off-the-shelf equipment. Our real-world experiments show Flash-Loc achieves accurate indoor localization by itself and in cooperation with other localization technology. In particular, Flash-Loc can localize a user 45 m away from the camera with sub-meter accuracy.", "citation": "Citations (2)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "University of Macau"], "authors": ["Fan Yang.....http://dblp.org/pers/hd/y/Yang:Fan", "Qiang Zhai.....http://dblp.org/pers/hd/z/Zhai:Qiang", "Guoxing Chen.....http://dblp.org/pers/hd/c/Chen:Guoxing", "Adam C. Champion.....http://dblp.org/pers/hd/c/Champion:Adam_C=", "Junda Zhu.....http://dblp.org/pers/hd/z/Zhu:Junda", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong"], "conf": "infocom", "year": "2016", "pages": 9}