{"title": "FlexCase: Enhancing Mobile Interaction with a Flexible Sensing and Display Cover.", "fields": ["mobile interaction", "flex", "input output", "gesture", "phone"], "abstract": "FlexCase is a novel flip cover for smartphones, which brings flexible input and output capabilities to existing mobile phones. It combines an e-paper display with a pressure- and bend-sensitive input sensor to augment the capabilities of a phone. Due to the form factor, FlexCase can be easily transformed into several different configurations, each with different interaction possibilities. Users can use FlexCase to perform a variety of touch, pressure, grip and bend gestures in a natural manner, much like interacting with a sheet of paper. The secondary e-paper display can act as a mechanism for providing user feedback and persisting content from the main display. In this paper, we explore the rich design space of FlexCase and present a number of different interaction techniques. Beyond, we highlight how touch and flex sensing can be combined to support a novel type of gestures, which we call Grip & Bend gestures. We also describe the underlying technology and gesture sensing algorithms. Numerous applications apply the interaction techniques in convincing real-world examples, including enhanced e-paper reading and interaction, a new copy and paste metaphor, high degree of freedom 3D and 2D manipulation, and the ability to transfer content and support input between displays in a natural and flexible manner.", "citation": "Citations (9)", "year": "2016", "departments": ["Microsoft", "Microsoft", "Joanneum Research", "University of A ... enberg, Austria", "University of A ... enberg, Austria"], "conf": "chi", "authors": ["Christian Rendl.....http://dblp.org/pers/hd/r/Rendl:Christian", "David Kim.....http://dblp.org/pers/hd/k/Kim:David", "Patrick Parzer.....http://dblp.org/pers/hd/p/Parzer:Patrick", "Sean Ryan Fanello.....http://dblp.org/pers/hd/f/Fanello:Sean_Ryan", "Martin Zirkl.....http://dblp.org/pers/hd/z/Zirkl:Martin", "Gregor Scheipl.....http://dblp.org/pers/hd/s/Scheipl:Gregor", "Michael Haller.....http://dblp.org/pers/hd/h/Haller:Michael", "Shahram Izadi.....http://dblp.org/pers/hd/i/Izadi:Shahram"], "pages": 13}