{"title": "Synthesizing framework models for symbolic execution.", "fields": ["java collections framework", "software design pattern", "program synthesis", "symbolic execution", "android"], "abstract": "Symbolic execution is a powerful program analysis technique, but it is difficult to apply to programs built using frameworks such as Swing and Android, because the framework code itself is hard to symbolically execute. The standard solution is to manually create a framework  model  that can be symbolically executed, but developing and maintaining a model is difficult and error-prone. In this paper, we present P asket , a new system that takes a first step toward automatically generating Java framework models to support symbolic execution. P asket's  focus is on creating models by  instantiating design patterns . P asket  takes as input class, method, and type information from the framework API, together with tutorial programs that exercise the framework. From these artifacts and P asket's  internal knowledge of design patterns, P asket  synthesizes a framework model whose behavior on the tutorial programs matches that of the original framework. We evaluated P asket  by synthesizing models for subsets of Swing and Android. Our results show that the models derived by P asket  are sufficient to allow us to use off-the-shelf symbolic execution tools to analyze Java programs that rely on frameworks.", "citation": "Citations (12)", "departments": ["University of Maryland, College Park", "Massachusetts Institute of Technology", "University of Maryland, College Park", "University of Maryland, College Park", "Massachusetts Institute of Technology"], "authors": ["Jinseong Jeon.....http://dblp.org/pers/hd/j/Jeon:Jinseong", "Xiaokang Qiu.....http://dblp.org/pers/hd/q/Qiu:Xiaokang", "Jonathan Fetter-Degges.....http://dblp.org/pers/hd/f/Fetter=Degges:Jonathan", "Jeffrey S. Foster.....http://dblp.org/pers/hd/f/Foster:Jeffrey_S=", "Armando Solar-Lezama.....http://dblp.org/pers/hd/s/Solar=Lezama:Armando"], "conf": "icse", "year": "2016", "pages": 12}