{"title": "Client as a first-class citizen: Practical user-centric network MIMO clustering.", "fields": ["spatial multiplexing", "first class citizen", "practical number", "mimo", "3g mimo"], "abstract": "Recent advances have demonstrated the potential of network MIMO (netMIMO), which combines a practical number of distributed antennas as a virtual netMIMO AP (nAP) to improve spatial multiplexing of an WLAN. Existing solutions, however, either simply cluster nearby antennas as static nAPs, or dynamically cluster antennas on a per-packet basis so as to maximize the sum rate of the scheduled clients. To strike the balance between the above two extremes, in this paper, we present the design, implementation and evaluation of FlexNEMO, a practical two-phase netMIMO clustering system. Unlike previous per-packet clustering approaches, FlexNEMO only clusters antennas when client distribution and traffic pattern change, as a result being more practical to be implemented. A medium access control protocol is then designed to allow the clients at the center of nAPs to have a higher probability to gain access opportunities, but still ensure long-term fairness among clients. By combining on-demand clustering and priority-based access control, FlexNEMO not only improves antenna utilization, but also optimizes the channel condition for every individual client. We evaluated our design via both testbed experiments on USRPs and trace-driven emulations. The results demonstrate that FlexNEMO can deliver 94.7% and 93.7% throughput gains over static antenna clustering in a 4-antenna testbed and 16-antenna emulation, respectively.", "citation": "Citations (1)", "departments": ["Academia Sinica", "Academia Sinica", "Academia Sinica", "Microsoft"], "authors": ["Wei-Liang Shen.....http://dblp.org/pers/hd/s/Shen:Wei=Liang", "Kate Ching-Ju Lin.....http://dblp.org/pers/hd/l/Lin:Kate_Ching=Ju", "Ming-Syan Chen.....http://dblp.org/pers/hd/c/Chen:Ming=Syan", "Kun Tan.....http://dblp.org/pers/hd/t/Tan:Kun"], "conf": "infocom", "year": "2016", "pages": 9}