{"title": "Dealbreaker: A Nonlinear Latent Variable Model for Educational Data.", "fields": ["latent variable model", "rasch model", "item response theory", "personalized learning", "affine transformation"], "abstract": "Statistical models of student responses on assessment questions, such as those in homeworks and exams, enable educators and computer-based personalized learning systems to gain insights into students' knowledge using machine learning. Popular student-response models, including the Rasch model and item response theory models, represent the probability of a student answering a question correctly using an affine function of latent factors. While such models can accurately predict student responses, their ability to interpret the underlying knowledge structure (which is certainly nonlinear) is limited. In response, we develop a new, nonlinear latent variable model that we call the dealbreaker model, in which a student's success probability is determined by their weakest concept mastery. We develop efficient parameter inference algorithms for this model using novel methods for nonconvex optimization. We show that the deal-breaker model achieves comparable or better prediction performance as compared to affine models with real-world educational datasets. We further demonstrate that the parameters learned by the dealbreaker model are interpretable--they provide key insights into which concepts are critical (i.e., the \"dealbreaker\") to answering a question correctly. We conclude by reporting preliminary results for a movie-rating dataset, which illustrate the broader applicability of the dealbreaker model.", "citation": "Citations (3)", "year": "2016", "departments": ["Rice University", "University of Maryland, College Park", "Rice University", "Cornell University"], "conf": "icml", "authors": ["Andrew S. Lan.....http://dblp.org/pers/hd/l/Lan:Andrew_S=", "Tom Goldstein.....http://dblp.org/pers/hd/g/Goldstein:Tom", "Richard G. Baraniuk.....http://dblp.org/pers/hd/b/Baraniuk:Richard_G=", "Christoph Studer.....http://dblp.org/pers/hd/s/Studer:Christoph"], "pages": 10}