{"title": "Automated test suite generation for time-continuous simulink models.", "fields": ["code generation", "test suite", "search algorithm", "cyber physical system", "toolbox"], "abstract": "All engineering disciplines are founded and rely on models, although they may differ on purposes and usages of modeling. Interdisciplinary domains such as Cyber Physical Systems (CPSs) seek approaches that incorporate different modeling needs and usages. Specifically, the Simulink modeling platform greatly appeals to CPS engineers due to its seamless support for simulation and code generation. In this paper, we propose a test generation approach that is applicable to Simulink models built for both purposes of simulation and code generation. We define test inputs and outputs as signals that capture evolution of values over time. Our test generation approach is implemented as a meta-heuristic search algorithm and is guided to produce test outputs with diverse shapes according to our proposed notion of diversity. Our evaluation, performed on industrial and public domain models, demonstrates that: (1) In contrast to the existing tools for testing Simulink models that are only applicable to a subset of code generation models, our approach is applicable to both code generation and simulation Simulink models. (2) Our new notion of diversity for output signals outperforms random baseline testing and an existing notion of signal diversity in revealing faults in Simulink models. (3) The fault revealing ability of our test generation approach outperforms that of the Simulink Design Verifier, the only testing toolbox for Simulink.", "citation": "Citations (17)", "departments": ["University of Luxembourg", "University of Luxembourg", "University of Luxembourg", "Delphi Automotive"], "authors": ["Reza Matinnejad.....http://dblp.org/pers/hd/m/Matinnejad:Reza", "Shiva Nejati.....http://dblp.org/pers/hd/n/Nejati:Shiva", "Lionel C. Briand.....http://dblp.org/pers/hd/b/Briand:Lionel_C=", "Thomas Bruckmann.....http://dblp.org/pers/hd/b/Bruckmann:Thomas"], "conf": "icse", "year": "2016", "pages": 12}