{"title": "VColor: A practical vertex-cut based approach for coloring large graphs.", "fields": ["edge coloring", "complete coloring", "fractional coloring", "greedy coloring", "brooks theorem"], "abstract": "Graph coloring is a fundamental NP-hard problem in graph theory. It has a wide range of real applications, such as Operations Research, Communication Network, Computational Biology and Compiler Optimization. Notable efforts have been spent on designing its approximation algorithms. Halldrsson proposed the algorithm (denoted as SampleIS) with the current best known approximation ratio. However, its time complexity is O(|G|3), where |G| is the number of vertices of a graph G. It is clear that SampleIS is not practical for large graphs. In this paper, we propose a practical vertex-cut based coloring technique (VColor) for coloring large graphs. First, we partition G into k connected components (CCs) of a small size s by removing a vertex-cut component (VCC). For each CC, we apply our novel coloring algorithm, based on maximal independent set enumeration. The approximation ratio and the time complexity for coloring the k CCs are log s + 1 and O(ks23s/3), respectively, whereas those of SampleIS are ks(log log ks)2/ log3 ks and O(k3s3). For the VCC, we simply apply SampleIS. To combine the colorings of the CCs and the VCC, we propose a maximum matching based algorithm. Second, in the context of a database of graphs, users may color many graphs. We propose an optimization technique, inspired by multi-query optimization, for coloring a set of graphs. We design a VP hierarchy (VPH) to represent the common subgraphs as the common CCs. Third, we propose techniques for determining the optimal values of the parameters of VColor. Our extensive experimental evaluation on real-world graphs confirms the efficiency and/or effectiveness of our proposed techniques. In particular, VColor is more than 500 times faster than SampleIS, and the number of colors used are comparable on real graphs Yeast and LS.", "citation": "Not cited", "departments": ["Qilu University of Technology", "Hong Kong Baptist University", "Nanyang Technological University", "Fudan University", "Qilu University of Technology"], "authors": ["Yun Peng.....http://dblp.org/pers/hd/p/Peng:Yun", "Byron Choi.....http://dblp.org/pers/hd/c/Choi:Byron", "Bingsheng He.....http://dblp.org/pers/hd/h/He:Bingsheng", "Shuigeng Zhou.....http://dblp.org/pers/hd/z/Zhou:Shuigeng", "Ruzhi Xu.....http://dblp.org/pers/hd/x/Xu:Ruzhi", "Xiaohui Yu.....http://dblp.org/pers/hd/y/Yu:Xiaohui"], "conf": "icde", "year": "2016", "pages": 12}