{"title": "CSMA networks in a many-sources regime: A mean-field approach.", "fields": ["network packet", "internet traffic engineering", "transmission delay", "processing delay", "queue"], "abstract": "With the rapid advance of the Internet of Everything, both the number of devices and the range of applications that rely on wireless connectivity show huge growth. Driven by these pervasive trends, wireless networks grow in size and complexity, supporting immense numbers of nodes and data volumes, with highly diverse traffic profiles and performance requirements. While well-established methods are available for evaluating the throughput of persistent sessions with saturated buffers, these provide no insight in the delay performance of flows with intermittent packet arrivals. The occurrence of empty buffers in the latter scenario results in a complex interaction between activity states and packet queues, which severely complicates the performance analysis. Motivated by these challenges, we develop a mean-field approach to analyze buffer contents and packet delays in wireless networks in a many-sources regime. The mean-field behavior simplifies the analysis of a large-scale network with packet arrivals and buffer dynamics to a low-dimensional fixed-point calculation for a network with saturated buffers. In particular, the analysis yields explicit expressions for the buffer content and packet delay distribution in terms of the fixed-point solution. Extensive simulation experiments demonstrate that these expressions provide highly accurate approximations, even for a fairly moderate number of sources.", "citation": "Citations (2)", "departments": ["Eindhoven University of Technology", "Eindhoven University of Technology", "Eindhoven University of Technology", "Macquarie University"], "authors": ["Fabio Cecchi.....http://dblp.org/pers/hd/c/Cecchi:Fabio", "Sem C. Borst.....http://dblp.org/pers/hd/b/Borst:Sem_C=", "J. S. H. van Leeuwaarden.....http://dblp.org/pers/hd/l/Leeuwaarden:J=_S=_H=_van", "Philip A. Whiting.....http://dblp.org/pers/hd/w/Whiting:Philip_A="], "conf": "infocom", "year": "2016", "pages": 9}