{"title": "Temporal Information Retrieval.", "fields": ["ranking", "dynamic web page", "human computer information retrieval", "information retrieval applications", "cognitive models of information retrieval", "adversarial information retrieval", "relevance feedback", "exploratory search", "document clustering", "concept search", "relevance", "information space", "automatic summarization"], "abstract": "Temporal dynamics and how they impact upon various components of information retrieval IR systems have received a large share of attention in the last decade. In particular, the study of relevance in information retrieval can now be framed within the so-called temporal IR approaches, which explain how user behavior, document content and scale vary with time, and how we can use them in our favor in order to improve retrieval effectiveness. This survey provides a comprehensive overview of temporal IR approaches, centered on the following questions: what are temporal dynamics, why do they occur, and when and how to leverage temporal information throughout the search cycle and architecture. We first explain the general and wide aspects associated to temporal dynamics by focusing on the web domain, from content and structural changes to variations of user behavior and interactions. Next, we pinpoint several research issues and the impact of such temporal characteristics on search, essentially regarding processing dynamic content, temporal query analysis and time-aware ranking. We also address particular aspects of temporal information extraction for instance, how to timestamp documents and generate temporal profiles of text. To this end, we present existing temporal search engines and applications in related research areas, e.g., exploration, summarization, and clustering of search results, as well as future event retrieval and prediction, where the time dimension also plays an important role.", "citation": "Citations (25)", "departments": ["Yahoo!", "Norwegian University of Science and Technology", "University of California, Davis", "University of California, Davis", "Aalborg University", "Leibniz University of Hanover", "L3S Research Center, Hanover"], "authors": ["Nattiya Kanhabua.....http://dblp.org/pers/hd/k/Kanhabua:Nattiya", "Avishek Anand.....http://dblp.org/pers/hd/a/Anand:Avishek"], "conf": "sigir", "year": "2016", "pages": 4}