{"title": "Multi-modal Multi-view Topic-opinion Mining for Social Event Analysis.", "fields": ["sentiment analysis", "data science", "web mining", "visualization", "social media"], "abstract": "In this paper, we propose a novel multi-modal multi-view topic-opinion mining (MMTOM) model for social event analysis in multiple collection sources. Compared with existing topic-opinion mining methods, our proposed model has several advantages: (1) The proposed MMTOM can effectively take into account multi-modal and multi-view properties jointly in a unified and principled way for social event modeling. (2) Our model is general and can be applied to many other applications in multimedia, such as opinion mining and sentiment analysis, multi-view association visualization, and topic-opinion mining for movie review. (3) The proposed MMTOM is able to not only discover multi-modal common topics from all collections as well as summarize the similarities and differences of these collections along each specific topic, but also automatically mine multi-view opinions on the learned topics across different collections. (4) Our topic-opinion mining results can be effectively applied to many applications including multi-modal multi-view topic-opinion retrieval and visualization, which achieve much better performance than existing methods. To evaluate the proposed model, we collect a real-world dataset for research on multi-modal multi-view social event analysis, and will release it for academic use. We have conducted extensive experiments, and both qualitative and quantitative evaluation results have demonstrated the effectiveness of the proposed MMTOM.", "citation": "Citations (5)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Shengsheng Qian.....http://dblp.org/pers/hd/q/Qian:Shengsheng", "Tianzhu Zhang.....http://dblp.org/pers/hd/z/Zhang:Tianzhu", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng"], "conf": "mm", "year": "2016", "pages": 10}