{"title": "Path confidence based lookahead prefetching.", "fields": ["offset", "multi core processor", "parallel computing", "persistence", "physical address"], "abstract": "Designing prefetchers to maximize system performance often requires a delicate balance between coverage and accuracy. Achieving both high coverage and accuracy is particularly challenging in workloads with complex address patterns, which may require large amounts of history to accurately predict future addresses. This paper describes the Signature Path Prefetcher (SPP), which offers effective solutions for three classic challenges in prefetcher design. First, SPP uses a compressed history based scheme that accurately predicts complex address patterns. Second, unlike other history based algorithms, which miss out on many prefetching opportunities when address patterns make a transition between physical pages, SPP tracks complex patterns across physical page boundaries and continues prefetching as soon as they move to new pages. Finally, SPP uses the confidence it has in its predictions to adaptively throttle itself on a per-prefetch stream basis. In our analysis, we find that SPP improves performance by 27.2% over a no-prefetching baseline, and outperforms the state-of-the-art Best Offset prefetcher by 6.4%. SPP does this with minimal overhead, operating strictly in the physical address space, and without requiring any additional processor core state, such as the PC.", "citation": "Citations (8)", "departments": ["Intel", "Intel", "Texas A& M University", "Texas A& M University", "Texas A& M University"], "authors": ["Jinchun Kim.....http://dblp.org/pers/hd/k/Kim:Jinchun", "Seth H. Pugsley.....http://dblp.org/pers/hd/p/Pugsley:Seth_H=", "Paul V. Gratz.....http://dblp.org/pers/hd/g/Gratz:Paul_V=", "A. L. Narasimha Reddy.....http://dblp.org/pers/hd/r/Reddy:A=_L=_Narasimha", "Chris Wilkerson.....http://dblp.org/pers/hd/w/Wilkerson:Chris", "Zeshan Chishti.....http://dblp.org/pers/hd/c/Chishti:Zeshan"], "conf": "micro", "year": "2016", "pages": 12}