{"title": "FOCUS: Shedding light on the high search response time in the wild.", "fields": ["web crawler", "search analytics", "response time", "web search query", "semantic search"], "abstract": "Response time plays a key role in Web services, as it significantly impacts user engagement, and consequently the Web providers' revenue. Using a large search engine as a case study, we propose a machine learning based analysis framework, called FOCUS, as the first step to automatically debug high search response time (HSRT) in search logs. The output of FOCUS offers a promising starting point for operators' further investigation. FOCUS has been deployed in one of the largest search engines for 2.5 months and analyzed about one billion search logs. Compared with a previous approach, FOCUS generates 90% less items for investigation and achieves both higher recall and higher precision. The results of FOCUS enable us to make several interesting observations. For example, we find that popular queries are more image-intensive (e.g., TV series and shopping), but they have relatively low SRT because they are cached well by servers. Additionally, as suggested by the first-month analysis results of FOCUS, we conduct an optimization on image transmission time. A one-month real-world deployment shows that we successfully reduce the 80th percentile of search response time by 253ms, and reduce the fraction of HSRT by one third.", "citation": "Citations (2)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Dapeng Liu.....http://dblp.org/pers/hd/l/Liu:Dapeng", "Youjian Zhao.....http://dblp.org/pers/hd/z/Zhao:Youjian", "Kaixin Sui.....http://dblp.org/pers/hd/s/Sui:Kaixin", "Lei Zou.....http://dblp.org/pers/hd/z/Zou:Lei", "Dan Pei.....http://dblp.org/pers/hd/p/Pei:Dan", "Qingqian Tao.....http://dblp.org/pers/hd/t/Tao:Qingqian", "Xiyang Chen.....http://dblp.org/pers/hd/c/Chen:Xiyang", "Dai Tan.....http://dblp.org/pers/hd/t/Tan:Dai"], "conf": "infocom", "year": "2016", "pages": 9}