{"title": "Dynamic Resource Provisioning with QoS Guarantee for Video Transcoding in Online Video Sharing Service.", "fields": ["workload", "online algorithm", "transcoding", "cloud computing", "provisioning"], "abstract": "Video transcoding is widely adopted in online video sharing services to encode video content into multiple representations. This solution, however, could consume huge amount of computing resource and incur excessive processing delays. Moreover, content has heterogeneous QoS requirements for transcoding. Some content must be transcoded in real time, while some are deferrable for transcoding. It needs to determine the strategy for intelligently provisioning the right amount of resource under dynamic workload to meet the heterogeneous QoS requirements. To this end, this paper develops a robust dynamic resource provisioning scheme for transcoding with heterogeneous QoS criteria. We adopt the Preemptive Resume Priority discipline for scheduling, so that the transcoding-deferrable content can utilize idle resources for transcoding to maximize resource utilization while remain transparent to delay-sensitive content. We leverage Model Predictive Control to design the online algorithm for dynamic resource provisioning using predictions to accommodate time-varying workload. To seek robustness of system performance against prediction noises, we improve our online algorithm through Robust Design. The experiment results in a real environment demonstrate that our proposed framework can achieve the QoS requirements while reducing 50% of resource consumption on average.", "citation": "Citations (6)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "University of California, Santa Cruz"], "authors": ["Guanyu Gao.....http://dblp.org/pers/hd/g/Gao:Guanyu", "Yonggang Wen.....http://dblp.org/pers/hd/w/Wen:Yonggang", "Cédric Westphal.....http://dblp.org/pers/hd/w/Westphal:C=eacute=dric"], "conf": "mm", "year": "2016", "pages": 10}