{"title": "SQL Schema Design: Foundations, Normal Forms, and Normalization.", "fields": ["boyce codd normal form", "database schema", "sql schemata", "data redundancy", "data set", "sql", "query by example", "null", "database normalization", "third normal form"], "abstract": "Normalization helps us find a database schema at design time that can process the most frequent updates efficiently at run time. Unfortunately, relational normalization only works for idealized database instances in which duplicates and null markers are not present. On one hand, these features occur frequently in real-world data compliant with the industry standard SQL, and especially in modern application domains. On the other hand, the features impose challenges that have made it impossible so far to extend the existing forty year old normalization framework to SQL. We introduce a new class of functional dependencies and show that they provide the right notion for SQL schema design. Axiomatic and linear-time algorithmic characterizations of the associated implication problem are established. These foundations enable us to propose a Boyce-Codd normal form for SQL. Indeed, we justify the normal form by showing that it permits precisely those SQL instances which are free from data redundancy. Unlike the relational case, there are SQL schemata that cannot be converted into Boyce-Codd normal form. Nevertheless, for an expressive sub-class of our functional dependencies we establish a normalization algorithm that always produces a schema in Value-Redundancy free normal form. This normal form permits precisely those instances which are free from any redundant data value occurrences other than the null marker. Experiments show that our functional dependencies occur frequently in real-world data and that they are effective in eliminating redundant values from these data sets without loss of information.", "citation": "Not cited", "year": "2016", "departments": ["Massey University", "University of Auckland"], "conf": "sigmod", "authors": ["Henning Köhler.....http://dblp.org/pers/hd/k/K=ouml=hler:Henning", "Sebastian Link.....http://dblp.org/pers/hd/l/Link:Sebastian"], "pages": 13}