{"title": "Input responsiveness: using canary inputs to dynamically steer approximation.", "fields": ["approximate computing", "discounting", "speedup", "image processing", "compiler"], "abstract": "This paper introduces Input Responsive Approximation (IRA), an approach that uses a canary input — a small program input carefully constructed to capture the intrinsic properties of the original input — to automatically control how program approximation is applied on an input-by-input basis. Motivating this approach is the observation that many of the prior techniques focusing on choosing how to approximate arrive at conservative decisions by discounting substantial differences between inputs when applying approximation. The main challenges in overcoming this limitation lie in making the choice of how to approximate both effectively (e.g., the fastest approximation that meets a particular accuracy target) and rapidly for every input. With IRA, each time the approximate program is run, a canary input is constructed and used dynamically to quickly test a spectrum of approximation alternatives. Based on these runtime tests, the approximation that best fits the desired accuracy constraints is selected and applied to the full input to produce an approximate result. We use IRA to select and parameterize mixes of four approximation techniques from the literature for a range of 13 image processing, machine learning, and data mining applications. Our results demonstrate that IRA significantly outperforms prior approaches, delivering an average of 10.2× speedup over exact execution while minimizing accuracy losses in program outputs.", "citation": "Citations (7)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Michael A. Laurenzano.....http://dblp.org/pers/hd/l/Laurenzano:Michael_A=", "Parker Hill.....http://dblp.org/pers/hd/h/Hill:Parker", "Mehrzad Samadi.....http://dblp.org/pers/hd/s/Samadi:Mehrzad", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A=", "Jason Mars.....http://dblp.org/pers/hd/m/Mars:Jason", "Lingjia Tang.....http://dblp.org/pers/hd/t/Tang:Lingjia"], "conf": "pldi", "year": "2016", "pages": 16}