{"title": "Randomised Procedures for Initialising and Switching Actions in Policy Iteration.", "fields": ["bounded function", "pi", "decision problem", "markov decision process", "exponential function"], "abstract": "Policy Iteration (PI) (Howard 1960) is a classical method for computing an optimal policy for a finite Markov Decision Problem (MDP). The method is conceptually simple: starting from some initial policy, \"policy improvement\" is repeatedly performed to obtain progressively dominating policies, until eventually, an optimal policy is reached. Being remarkably efficient in practice, PI is often favoured over alternative approaches such as Value Iteration and Linear Programming. Unfortunately, even after several decades of study, theoretical bounds on the complexity of PI remain unsatisfactory. For an MDP with n states and k actions, Mansour and Singh (1999) bound the number of iterations taken by Howard's PI, the canonical variant of the method, by O(kn / n). This bound merely improves upon the trivial bound of kn by a linear factor. However, a randomised variant of PI introduced by Mansour and Singh (1999) does yield an exponential improvement, with its expected number of iterations bounded by O(((1 + 2/log2(k)) k/2)n).\n\nWith the objective of furnishing improved upper bounds for PI, we introduce two randomised procedures in this paper. Our first contribution is a routine to find a good initial policy for PI. After evaluating a number of randomly generated policies, this procedure applies a novel criterion to pick one to initialise PI. When PI is subsequently applied, we show that the expected number of policy evaluations—including both the initialisation and the improvement stages—remains bounded in expectation by O(kn/2). The key construction employed in this routine is a total order on the set of policies. Our second contribution is a randomised action-switching rule for PI, which admits a bound of (2 + ln(k – 1))n on the expected number of iterations. To the best of our knowledge, this is the tightest complexity bound known for PI when k ≥ 3.", "citation": "Citations (2)", "departments": ["Indian Institute of Technology Bombay", "Indian Institute of Technology Gandhinagar", "Indian Institute of Science"], "authors": ["Shivaram Kalyanakrishnan.....http://dblp.org/pers/hd/k/Kalyanakrishnan:Shivaram", "Neeldhara Misra.....http://dblp.org/pers/hd/m/Misra:Neeldhara", "Aditya Gopalan.....http://dblp.org/pers/hd/g/Gopalan:Aditya"], "conf": "aaai", "year": "2016", "pages": 7}