{"title": "From Duels to Battlefields: Computing Equilibria of Blotto and Other Games.", "fields": ["combinatorial game theory", "normal form game", "best response", "coordination game", "oracle"], "abstract": "We study the problem of computing Nash equilibria of zero-sum games. Many natural zero-sum games have exponentially many strategies, but highly structured payoffs. For example, in the well-studied Colonel Blotto game (introduced by Borel in 1921), players must divide a pool of troops among a set of battlefields with the goal of winning (i.e., having more troops in) a majority. The Colonel Blotto game is commonly used for analyzing a wide range of applications from the U.S presidential election, to innovative technology competitions, to advertisement, to sports. However, because of the size of the strategy space, standard methods for computing equilibria of zero-sum games fail to be computationally feasible. Indeed, despite its importance, only few solutions for special variants of the problem are known.\n\nIn this paper we show how to compute equilibria of Colonel Blotto games. Moreover, our approach takes the form of a general reduction: to find a Nash equilibrium of a zero-sum game, it suffices to design a separation oracle for the strategy polytope of any bilinear game that is payoff-equivalent. We then apply this technique to obtain the first polytime algorithms for a variety of games. In addition to Colonel Blotto, we also show how to compute equilibria in an infinite-strategy variant called the General Lotto game; this involves showing how to prune the strategy space to a finite subset before applying our reduction. We also consider the class of dueling games, first introduced by Immorlica et al. (2011). We show that our approach provably extends the class of dueling games for which equilibria can be computed: we introduce a new dueling game, the matching duel, on which prior methods fail to be computationally feasible but upon which our reduction can be applied.", "citation": "Citations (5)", "departments": ["Stanford University", "University of Maryland, College Park", "University of Maryland, College Park", "Microsoft", "University of Maryland, College Park"], "authors": ["AmirMahdi Ahmadinejad.....http://dblp.org/pers/hd/a/Ahmadinejad:AmirMahdi", "Sina Dehghani.....http://dblp.org/pers/hd/d/Dehghani:Sina", "MohammadTaghi Hajiaghayi.....http://dblp.org/pers/hd/h/Hajiaghayi:MohammadTaghi", "Brendan Lucier.....http://dblp.org/pers/hd/l/Lucier:Brendan", "Hamid Mahini.....http://dblp.org/pers/hd/m/Mahini:Hamid", "Saeed Seddighin.....http://dblp.org/pers/hd/s/Seddighin:Saeed"], "conf": "aaai", "year": "2016", "pages": 7}