{"title": "Practical private shortest path computation based on Oblivious Storage.", "fields": ["system model", "adversary", "information sensitivity", "information privacy", "fisher yates shuffle"], "abstract": "As location-based services (LBSs) become popular, location-dependent queries have raised serious privacy concerns since they may disclose sensitive information in query processing. Among typical queries supported by LBSs, shortest path queries may reveal information about not only current locations of the clients, but also their potential destinations and travel plans. Unfortunately, existing methods for private shortest path computation suffer from issues of weak privacy property, low performance or poor scalability. In this paper, we aim at a strong privacy guarantee, where the adversary cannot infer almost any information about the queries, with better performance and scalability. To achieve this goal, we introduce a general system model based on the concept of Oblivious Storage (OS), which can deal with queries requiring strong privacy properties. Furthermore, we propose a new oblivious shuffle algorithm to optimize an existing OS scheme. By making trade-offs between query performance, scalability and privacy properties, we design different schemes for private shortest path computation. Eventually, we comprehensively evaluate our schemes upon real road networks in a practical environment and show their efficiency.", "citation": "Citations (4)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Nanyang Technological University"], "authors": ["Dong Xie.....http://dblp.org/pers/hd/x/Xie_0001:Dong", "Guanru Li.....http://dblp.org/pers/hd/l/Li:Guanru", "Bin Yao.....http://dblp.org/pers/hd/y/Yao_0002:Bin", "Xuan Wei.....http://dblp.org/pers/hd/w/Wei:Xuan", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Yunjun Gao.....http://dblp.org/pers/hd/g/Gao:Yunjun", "Minyi Guo.....http://dblp.org/pers/hd/g/Guo:Minyi"], "conf": "icde", "year": "2016", "pages": 12}