{"title": "Coordinated multi-point transmissions based on interference alignment and neutralization.", "fields": ["precoding", "zero forcing precoding", "spectral efficiency", "single antenna interference cancellation", "co channel interference"], "abstract": "Both interference alignment (IA) and interference neutralization (IN) are exploited for Coordinated Multi-Point (CoMP) transmissions. With the base station's cooperation, transmit precoder and receive filter are designed jointly, and then concurrent transmissions of multiple data streams are achieved. In the design of preprocessing, IN is applied to the interferences carrying same data so as to align the interfering signals with opposite directions in a subspace. On the other hand, for interferences carrying different information, IA is employed to align them with the same direction in a subspace, thus reducing the interference signal dimension observed at the user side. Based on different precoding schemes at the transmitter's side, receivers adopt zero-forcing (ZF) so as to recover the desired data. The proposed interference alignment and neutralization based CoMP (IAN-CoMP) mechanism can achieve effective interference cancellation and suppression by exploiting limited and flexible collaboration only at the base station (BS) side. We also extend the mechanism to general cases where the antenna configurations at both transmitter and receiver side, the number of transmitters participating in CoMP and simultaneously served users are variable. In addition, the proposed scheme can also achieve a flexible tradeoff between cooperation overhead and the system's achievable degrees of freedom (DoFs). Our in-depth simulation results show that IAN-CoMP can significantly improve the spectral efficiency (SE) for cell-edge users.", "citation": "Citations (1)", "departments": ["Xidian University", "Xidian University", "University of Michigan", "Xidian University"], "authors": ["Zhao Li.....http://dblp.org/pers/hd/l/Li:Zhao", "Sha Cui.....http://dblp.org/pers/hd/c/Cui:Sha", "Kang G. Shin.....http://dblp.org/pers/hd/s/Shin:Kang_G=", "Jun Gu.....http://dblp.org/pers/hd/g/Gu:Jun"], "conf": "infocom", "year": "2016", "pages": 9}