{"title": "Shasta: Interactive Reporting At Scale.", "fields": ["materialized view", "data warehouse", "cache", "sql", "user defined function"], "abstract": "We describe Shasta, a middleware system built at Google to support interactive reporting in complex user-facing applications related to Google's Internet advertising business. Shasta targets applications with challenging requirements: First, user query latencies must be low. Second, underlying transactional data stores have complex \"read-unfriendly\" schemas, placing significant transformation logic between stored data and the read-only views that Shasta exposes to its clients. This transformation logic must be expressed in a way that scales to large and agile engineering teams. Finally, Shasta targets applications with strong data freshness requirements, making it challenging to precompute query results using common techniques such as ETL pipelines or materialized views. Instead, online queries must go all the way from primary storage to user-facing views, resulting in complex queries joining 50 or more tables.   Designed as a layer on top of Google's F1 RDBMS and Mesa data warehouse, Shasta combines language and system techniques to meet these requirements. To help with expressing complex view specifications, we developed a query language called RVL, with support for modularized view templates that can be dynamically compiled into SQL. To execute these SQL queries with low latency at scale, we leveraged and extended F1's distributed query engine with facilities such as safe execution of C++ and Java UDFs. To reduce latency and increase read parallelism, we extended F1 storage with a distributed read-only in-memory cache. The system we describe is in production at Google, powering critical applications used by advertisers and internal sales teams. Shasta has significantly improved system scalability and software engineering efficiency compared to the middleware solutions it replaced.", "citation": "Not cited", "year": "2016", "departments": ["Google", "Google", "Google", "Google", "Google"], "conf": "sigmod", "authors": ["Gokul Nath Babu Manoharan.....http://dblp.org/pers/hd/m/Manoharan:Gokul_Nath_Babu", "Stephan Ellner.....http://dblp.org/pers/hd/e/Ellner:Stephan", "Karl Schnaitter.....http://dblp.org/pers/hd/s/Schnaitter:Karl", "Sridatta Chegu.....http://dblp.org/pers/hd/c/Chegu:Sridatta", "Alejandro Estrella-Balderrama.....http://dblp.org/pers/hd/e/Estrella=Balderrama:Alejandro", "Stephan Gudmundson.....http://dblp.org/pers/hd/g/Gudmundson:Stephan", "Apurv Gupta.....http://dblp.org/pers/hd/g/Gupta:Apurv", "Ben Handy.....http://dblp.org/pers/hd/h/Handy:Ben", "Bart Samwel.....http://dblp.org/pers/hd/s/Samwel:Bart", "Chad Whipkey.....http://dblp.org/pers/hd/w/Whipkey:Chad", "Larysa Aharkava.....http://dblp.org/pers/hd/a/Aharkava:Larysa", "Himani Apte.....http://dblp.org/pers/hd/a/Apte:Himani", "Nitin Gangahar.....http://dblp.org/pers/hd/g/Gangahar:Nitin", "Jun Xu.....http://dblp.org/pers/hd/x/Xu:Jun", "Shivakumar Venkataraman.....http://dblp.org/pers/hd/v/Venkataraman:Shivakumar", "Divyakant Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Divyakant", "Jeffrey D. Ullman.....http://dblp.org/pers/hd/u/Ullman:Jeffrey_D="], "pages": 12}