{"title": "When does Relevance Mean Usefulness and User Satisfaction in Web Search?", "fields": ["training set", "data mining", "computer science", "computer user satisfaction", "information retrieval"], "abstract": "Relevance is a fundamental concept in information retrieval (IR) studies. It is however often observed that relevance as annotated by secondary assessors may not necessarily mean usefulness and satisfaction perceived by users. In this study, we confirm the difference by a laboratory study in which we collect relevance annotations by external assessors, usefulness and user satisfaction information by users, for a set of search tasks. We also find that a measure based on usefulness rather than relevance annotated has a better correlation with user satisfaction. However, we show that external assessors are capable of annotating usefulness when provided with more search context information. In addition, we also show that it is possible to generate automatically usefulness labels when some training data is available. Our findings explain why traditional system-centric evaluation metrics are not well aligned with user satisfaction and suggest that a usefulness-based evaluation method can be defined to better reflect the quality of search systems perceived by the users.", "citation": "Citations (15)", "departments": ["Tsinghua University", "Tsinghua University", "Yahoo!", "Université de Montréal", "Tsinghua University"], "authors": ["Jiaxin Mao.....http://dblp.org/pers/hd/m/Mao:Jiaxin", "Yiqun Liu.....http://dblp.org/pers/hd/l/Liu:Yiqun", "Ke Zhou.....http://dblp.org/pers/hd/z/Zhou:Ke", "Jian-Yun Nie.....http://dblp.org/pers/hd/n/Nie:Jian=Yun", "Jingtao Song.....http://dblp.org/pers/hd/s/Song:Jingtao", "Min Zhang.....http://dblp.org/pers/hd/z/Zhang_0006:Min", "Shaoping Ma.....http://dblp.org/pers/hd/m/Ma:Shaoping", "Jiashen Sun.....http://dblp.org/pers/hd/s/Sun:Jiashen", "Hengliang Luo.....http://dblp.org/pers/hd/l/Luo:Hengliang"], "conf": "sigir", "year": "2016", "pages": 10}