{"title": "Automated parameter optimization of classification techniques for defect prediction models.", "fields": ["caret", "predictive modelling", "decision tree", "random forest", "boosting"], "abstract": "Defect prediction models are classifiers that are trained to identify defect-prone software modules. Such classifiers have configurable parameters that control their characteristics (e.g., the number of trees in a random forest classifier). Recent studies show that these classifiers may underperform due to the use of suboptimal default parameter settings. However, it is impractical to assess all of the possible settings in the parameter spaces. In this paper, we investigate the performance of defect prediction models where Caret --- an automated parameter optimization technique --- has been applied. Through a case study of 18 datasets from systems that span both proprietary and open source domains, we find that (1) Caret improves the AUC performance of defect prediction models by as much as 40 percentage points; (2) Caret-optimized classifiers are at least as stable as (with 35% of them being more stable than) classifiers that are trained using the default settings; and (3) Caret increases the likelihood of producing a top-performing classifier by as much as 83%. Hence, we conclude that parameter settings can indeed have a large impact on the performance of defect prediction models, suggesting that researchers should experiment with the parameters of the classification techniques. Since automated parameter optimization techniques like Caret yield substantially benefits in terms of performance improvement and stability, while incurring a manageable additional computational cost, they should be included in future defect prediction studies.", "citation": "Citations (86)", "departments": ["Nara Institute of Science and Technology", "McGill University", "Queen's University", "Nara Institute of Science and Technology"], "authors": ["Chakkrit Tantithamthavorn.....http://dblp.org/pers/hd/t/Tantithamthavorn:Chakkrit", "Shane McIntosh.....http://dblp.org/pers/hd/m/McIntosh:Shane", "Ahmed E. Hassan.....http://dblp.org/pers/hd/h/Hassan:Ahmed_E=", "Kenichi Matsumoto.....http://dblp.org/pers/hd/m/Matsumoto:Kenichi"], "conf": "icse", "year": "2016", "pages": 12}