{"title": "A forward model at Purkinje cell synapses facilitates cerebellar anticipatory control.", "fields": ["motor control", "controller", "learning rule", "spite", "model predictive control"], "abstract": "How does our motor system solve the problem of anticipatory control in spite of a wide spectrum of response dynamics from different musculo-skeletal systems, transport delays as well as response latencies throughout the central nervous system? To a great extent, our highly-skilled motor responses are a result of a reactive feedback system, originating in the brain-stem and spinal cord, combined with a feed-forward anticipatory system, that is adaptively fine-tuned by sensory experience and originates in the cerebellum. Based on that interaction we design the counterfactual predictive control (CFPC) architecture, an anticipatory adaptive motor control scheme in which a feed-forward module, based on the cerebellum, steers an error feedback controller with counterfactual error signals. Those are signals that trigger reactions as actual errors would, but that do not code for any current of forthcoming errors. In order to determine the optimal learning strategy, we derive a novel learning rule for the feed-forward module that involves an eligibility trace and operates at the synaptic level. In particular, our eligibility trace provides a mechanism beyond co-incidence detection in that it convolves a history of prior synaptic inputs with error signals. In the context of cerebellar physiology, this solution implies that Purkinje cell synapses should generate eligibility traces using a forward model of the system being controlled. From an engineering perspective, CFPC provides a general-purpose anticipatory control architecture equipped with a learning rule that exploits the full dynamics of the closed-loop system.", "citation": "Citations (6)", "departments": ["Pompeu Fabra University", "Pompeu Fabra University", "Pompeu Fabra University"], "authors": ["Ivan Herreros.....http://dblp.org/pers/hd/h/Herreros:Ivan", "Xerxes D. Arsiwalla.....http://dblp.org/pers/hd/a/Arsiwalla:Xerxes_D=", "Paul F. M. J. Verschure.....http://dblp.org/pers/hd/v/Verschure:Paul_F=_M=_J="], "conf": "nips", "year": "2016", "pages": 9}