{"title": "Emergeables: Deformable Displays for Continuous Eyes-Free Mobile Interaction.", "fields": ["mobile interaction", "touchscreen", "simulation", "affordance", "usability"], "abstract": "In this paper we present the concept of  Emergeables  -- mobile surfaces that can deform or 'morph' to provide fully-actuated, tangible controls. Our goal in this work is to provide the flexibility of graphical touchscreens, coupled with the affordance and tactile benefits offered by physical widgets. In contrast to previous research in the area of deformable displays, our work focuses on continuous controls (e.g., dials or sliders), and strives for fully-dynamic positioning, providing versatile widgets that can change shape and location depending on the user's needs. We describe the design and implementation of two prototype emergeables built to demonstrate the concept, and present an in-depth evaluation that compares both with a touchscreen alternative. The results show the strong potential of emergeables for on-demand, eyes-free control of continuous parameters, particularly when comparing the accuracy and usability of a high-resolution emergeable to a standard GUI approach. We conclude with a discussion of the level of resolution that is necessary for future emergeables, and suggest how high-resolution versions might be achieved.", "citation": "Citations (16)", "year": "2016", "departments": ["Swansea University", "Swansea University", "Swansea University", "Université Gren ... renoble, France", "Université Gren ... renoble, France"], "conf": "chi", "authors": ["Simon Robinson.....http://dblp.org/pers/hd/r/Robinson:Simon", "Céline Coutrix.....http://dblp.org/pers/hd/c/Coutrix:C=eacute=line", "Jennifer Pearson.....http://dblp.org/pers/hd/p/Pearson_0001:Jennifer", "Juan Rosso.....http://dblp.org/pers/hd/r/Rosso:Juan", "Matheus Fernandes Torquato.....http://dblp.org/pers/hd/t/Torquato:Matheus_Fernandes", "Laurence Nigay.....http://dblp.org/pers/hd/n/Nigay:Laurence", "Matt Jones.....http://dblp.org/pers/hd/j/Jones_0001:Matt"], "pages": 13}