{"title": "Efficient and Progressive Group Steiner Tree Search.", "fields": ["suurballe s algorithm", "kruskal s algorithm", "reverse delete algorithm", "ramer douglas peucker algorithm", "population based incremental learning"], "abstract": "The Group Steiner Tree (GST) problem is a fundamental problem in database area that has been successfully applied to keyword search in relational databases and team search in social networks. The state-of-the-art algorithm for the GST problem is a parameterized dynamic programming (DP) algorithm, which finds the optimal tree in O(3 k n+2 k (n log n + m)) time, where k is the number of given groups, m and n are the number of the edges and nodes of the graph respectively. The major limitations of the parameterized DP algorithm are twofold: (i) it is intractable even for very small values of k (e.g., k=8) in large graphs due to its exponential complexity, and (ii) it cannot generate a solution until the algorithm has completed its entire execution. To overcome these limitations, we propose an efficient and progressive GST algorithm in this paper, called PrunedDP. It is based on newly-developed optimal-tree decomposition and conditional tree merging techniques. The proposed algorithm not only drastically reduces the search space of the parameterized DP algorithm, but it also produces progressively-refined feasible solutions during algorithm execution. To further speed up the PrunedDP algorithm, we propose a progressive A*-search algorithm, based on several carefully-designed lower-bounding techniques. We conduct extensive experiments to evaluate our algorithms on several large scale real-world graphs. The results show that our best algorithm is not only able to generate progressively-refined feasible solutions, but it also finds the optimal solution with at least two orders of magnitude acceleration over the state-of-the-art algorithm, using much less memory.", "citation": "Citations (1)", "year": "2016", "departments": ["Shenzhen University", "University of Technology, Sydney", "The Chinese University of Hong Kong", "Shenzhen University"], "conf": "sigmod", "authors": ["Rong-Hua Li.....http://dblp.org/pers/hd/l/Li:Rong=Hua", "Lu Qin.....http://dblp.org/pers/hd/q/Qin:Lu", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Rui Mao.....http://dblp.org/pers/hd/m/Mao:Rui"], "pages": 16}