{"title": "Fast, Lean, and Accurate: Modeling Password Guessability Using Neural Networks.", "fields": ["latency", "distributed computing", "password strength", "computer science", "password cracking", "password", "artificial neural network", "markov model"], "abstract": "Human-chosen text passwords, today’s dominant form of authentication, are vulnerable to guessing attacks. Unfortunately, existing approaches for evaluating password strength by modeling adversarial password guessing are either inaccurate or orders of magnitude too large and too slow for real-time, client-side password checking. We propose using artificial neural networks to model text passwords’ resistance to guessing attacks and explore how different architectures and training methods impact neural networks’ guessing effectiveness. We show that neural networks can often guess passwords more effectively than state-of-the-art approaches, such as probabilistic context-free grammars and Markov models. We also show that our neural networks can be highly compressed—to as little as hundreds of kilobytes— without substantially worsening guessing effectiveness. Building on these results, we implement in JavaScript the first principled client-side model of password guessing, which analyzes a password’s resistance to a guessing attack of arbitrary duration with sub-second latency. Together, our contributions enable more accurate and practical password checking than was previously possible.", "citation": "Not cited", "year": "2016", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "University of Chicago", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "uss", "authors": ["William Melicher.....http://dblp.org/pers/hd/m/Melicher:William", "Blase Ur.....http://dblp.org/pers/hd/u/Ur:Blase", "Sean M. Segreti.....http://dblp.org/pers/hd/s/Segreti:Sean_M=", "Saranga Komanduri.....http://dblp.org/pers/hd/k/Komanduri:Saranga", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Nicolas Christin.....http://dblp.org/pers/hd/c/Christin:Nicolas", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith"], "pages": 17}