{"title": "Personality differences predict decision-making in an accident situation in virtual driving.", "fields": ["immersion", "psychopathy", "virtual reality", "simulation", "personality"], "abstract": "Understanding how humans make decisions in challenging situations — such as trying to save peoples' lives even though this endangers one's own life — is crucial in optimizing rescue operations and dealing with natural disasters and other crises. The experimental study of these decisions, however, has often been done using text-based surveys, which is known to emphasize rational and reflective judgments. Here, we used virtual reality to investigate decision-making in a real-world context, in which a decision needs to be made intuitively under time pressure — for this we simulated an accident situation in an immersive virtual driving scenario. In the scenario, participants were told to race a course as fast as possible. After training, participants were confronted with the sudden appearance of pedestrians on the race course. We observed three different behaviors: group one ignored the pedestrians and/or hit the accelerator, group two hit the brake, and group three tried to steer the car to avoid pedestrians. We found that most Avoid-group participants had more real and virtual driving experience compared to the other two groups and they also felt more competent during the game as measured by subjective game experience questionnaires. Importantly, results from established personality questionnaires showed that participants who did not brake (therefore potentially harming the pedestrians) had significantly lower scores in perspective-taking and higher scores in psychopathy compared to participants who tried to avoid the accident situation. Our results demonstrate that personality differences to some degree are able to predict intuitive decision-making and that such processes can be studied in a controlled, immersive VR simulation.", "citation": "Not cited", "departments": ["Korea University", "Korea University", "Korea University"], "authors": ["Ui Jong Ju.....http://dblp.org/pers/hd/j/Ju:Ui_Jong", "June Kang.....http://dblp.org/pers/hd/k/Kang:June", "Christian Wallraven.....http://dblp.org/pers/hd/w/Wallraven:Christian"], "conf": "vr", "year": "2016", "pages": 6}