{"title": "We are Humor Beings: Understanding and Predicting Visual Humor.", "fields": ["computer science", "computational model", "computer vision", "artificial intelligence", "machine learning"], "abstract": "Humor is an integral part of human lives. Despite being tremendously impactful, it is perhaps surprising that we do not have a detailed understanding of humor yet. As interactions between humans and AI systems increase, it is imperative that these systems are taught to understand subtleties of human expressions such as humor. In this work, we are interested in the question – what content in a scene causes it to be funny? As a first step towards understanding visual humor, we analyze the humor manifested in abstract scenes and design computational models for them. We collect two datasets of abstract scenes that facilitate the study of humor at both the scene-level and the object-level. We analyze the funny scenes and explore the different types of humor depicted in them via human studies. We model two tasks that we believe demonstrate an understanding of some aspects of visual humor. The tasks involve predicting the funniness of a scene and altering the funniness of a scene. We show that our models perform well quantitatively, and qualitatively through human studies. Our datasets are publicly available.", "citation": "Citations (10)", "year": "2016", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech", "TTI-Chicago, Chicago, IL, USA"], "conf": "cvpr", "authors": ["Arjun Chandrasekaran.....http://dblp.org/pers/hd/c/Chandrasekaran:Arjun", "Ashwin K. Vijayakumar.....http://dblp.org/pers/hd/v/Vijayakumar:Ashwin_K=", "Stanislaw Antol.....http://dblp.org/pers/hd/a/Antol:Stanislaw", "Mohit Bansal.....http://dblp.org/pers/hd/b/Bansal:Mohit", "Dhruv Batra.....http://dblp.org/pers/hd/b/Batra:Dhruv", "C. Lawrence Zitnick.....http://dblp.org/pers/hd/z/Zitnick:C=_Lawrence", "Devi Parikh.....http://dblp.org/pers/hd/p/Parikh:Devi"], "pages": 10}