{"title": "The Devil Is in the Details: Implementing Flash Page Reuse with WOM Codes.", "fields": ["coding theory", "server", "overhead", "reuse", "flash memory"], "abstract": "Flash memory is prevalent in modern servers and devices. Coupled with the scaling down of flash technology, the popularity of flash memory motivates the search for methods to increase flash reliability and lifetime. Erasures are the dominant cause of flash cell wear, but reducing them is challenging because flash is a write-once medium--memory cells must be erased prior to writing.\n\nAn approach that has recently received considerable attention relies on write-once memory (WOM) codes, designed to accommodate additional writes on write-once media. However, the techniques proposed for reusing flash pages with WOM codes are limited in their scope. Many focus on the coding theory alone, while others suggest FTL designs that are application specific, or not applicable due to their complexity, overheads, or specific constraints of MLC flash.\n\nThis work is the first that addresses all aspects of page reuse within an end-to-end implementation of a general-purpose FTL on MLC flash. We use our hardware implementation to directly measure the short and long-term effects of page reuse on SSD durability, I/O performance and energy consumption, and show that FTL design must explicitly take them into account.", "citation": "Citations (12)", "departments": ["University of Mainz", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "California Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Fabio Margaglia.....http://dblp.org/pers/hd/m/Margaglia:Fabio", "Gala Yadgar.....http://dblp.org/pers/hd/y/Yadgar:Gala", "Eitan Yaakobi.....http://dblp.org/pers/hd/y/Yaakobi:Eitan", "Yue Li.....http://dblp.org/pers/hd/l/Li_0001:Yue", "Assaf Schuster.....http://dblp.org/pers/hd/s/Schuster:Assaf", "André Brinkmann.....http://dblp.org/pers/hd/b/Brinkmann:Andr=eacute="], "conf": "fast", "year": "2016", "pages": 15}