{"title": "Timely wireless flows with arbitrary traffic patterns: Capacity region and scheduling algorithms.", "fields": ["traffic generation model", "wireless network", "telecommunications link", "markov decision process", "curse of dimensionality"], "abstract": "Most existing wireless networking solutions are best-effort and do not provide any delay guarantee required by important applications such as the control traffic of cyber-physical systems. Recently, Hou and Kumar provided the first framework for analyzing and designing delay-guaranteed network solutions. While inspiring, their idle-time-based analysis appears to apply only to flows with a special traffic (arrival and expiration) pattern, and the problem remains largely open for general traffic patterns. This paper addresses this challenge by proposing a new framework that characterizes and achieves the complete delay-constrained capacity region with general traffic patterns in single-hop downlink access-point wireless networks. We first formulate the timely capacity problem as an infinite-horizon Markov Decision Process (MDP) and then judiciously combine different simplification methods to convert it to an equivalent finite-size linear program (LP). This allows us to characterize the timely capacity region of flows with general traffic patterns for the first time in the literature. We then design three timely-flow scheduling algorithms for general traffic patterns. The first algorithm achieves the optimal utility but suffers from the curse of dimensionality. The second and third algorithms are inspired by our MDP framework and are of polynomial-time complexity. Simulation results show that both achieve near-optimal performance and outperform other existing alternatives.", "citation": "Citations (2)", "departments": ["The Chinese University of Hong Kong", "Purdue University", "The Chinese University of Hong Kong", "Purdue University"], "authors": ["Lei Deng.....http://dblp.org/pers/hd/d/Deng:Lei", "Chih-Chun Wang.....http://dblp.org/pers/hd/w/Wang:Chih=Chun", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Shizhen Zhao.....http://dblp.org/pers/hd/z/Zhao:Shizhen"], "conf": "infocom", "year": "2016", "pages": 9}