{"title": "T-Update: A tree-structured update scheme with top-down transmission in erasure-coded systems.", "fields": ["erasure code", "parity", "erasure", "computation", "server"], "abstract": "Erasure coding has received considerable attention due to the better tradeoff between the space efficiency and reliability. However, it consumes large network traffic and long time to complete the update, involving updates of both data nodes and parity nodes. Existing solutions to this problem mainly focus on proposing new class of codes with lower update complexity to reduce the network traffic, ignoring the optimization of data transmission structure. In fact, the data transmission structure has great impact on the update. In this paper, we propose T-Update, a tree-structured update scheme with top-down transmission that minimizes the update time for erasure-coded data with no additional network traffic. Specially, we propose a rack-aware tree construction technique to construct an update tree to organize the data connections, with the data node as the root and the parity nodes as the children. To maximize the update efficiency, we propose a top-down data transmission technique to guide the data transmission and distribute the data computation for updating the parity nodes. To evaluate the performance of T-Update, we conduct experiments on HDFS-RAID under various parameter settings on both 30 physical and 200 virtual servers. Extensive experiments confirm that T-Update reduces the update time by 27% and 32% on average compared with two typical update schemes respectively.", "citation": "Citations (3)", "departments": ["National University of Defense Technology", "National University of Defense Technology", "National University of Defense Technology", "National University of Defense Technology"], "authors": ["Xiaoqiang Pei.....http://dblp.org/pers/hd/p/Pei:Xiaoqiang", "Yijie Wang.....http://dblp.org/pers/hd/w/Wang:Yijie", "Xingkong Ma.....http://dblp.org/pers/hd/m/Ma:Xingkong", "Fangliang Xu.....http://dblp.org/pers/hd/x/Xu:Fangliang"], "conf": "infocom", "year": "2016", "pages": 9}