{"title": "Practical Private Range Search Revisited.", "fields": ["symmetric key algorithm", "mathematical proof", "provable security", "data management", "range query"], "abstract": "We consider a data owner that outsources its dataset to an untrusted server. The owner wishes to enable the server to answer range queries on a single attribute, without compromising the privacy of the data and the queries. There are several schemes on \"practical\" private range search (mainly in Databases venues) that attempt to strike a trade-off between efficiency and security. Nevertheless, these methods either lack provable security guarantees, or permit unacceptable privacy leakages. In this paper, we take an interdisciplinary approach, which combines the rigor of Security formulations and proofs with efficient Data Management techniques. We construct a wide set of novel schemes with realistic security/performance trade-offs, adopting the notion of Searchable Symmetric Encryption (SSE) primarily proposed for keyword search. We reduce range search to multi-keyword search using range covering techniques with tree-like indexes. We demonstrate that, given any secure SSE scheme, the challenge boils down to (i) formulating leakages that arise from the index structure, and (ii) minimizing false positives incurred by some schemes under heavy data skew. We analytically detail the superiority of our proposals over prior work and experimentally confirm their practicality.", "citation": "Citations (19)", "year": "2016", "departments": ["University of Maryland, College Park", "Intel", "École Polytechnique Fédérale de Lausanne", "Technical University of Crete", "Technical University of Crete"], "conf": "sigmod", "authors": ["Ioannis Demertzis.....http://dblp.org/pers/hd/d/Demertzis:Ioannis", "Stavros Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos_0001:Stavros", "Odysseas Papapetrou.....http://dblp.org/pers/hd/p/Papapetrou:Odysseas", "Antonios Deligiannakis.....http://dblp.org/pers/hd/d/Deligiannakis:Antonios", "Minos N. Garofalakis.....http://dblp.org/pers/hd/g/Garofalakis:Minos_N="], "pages": 14}