{"title": "Code anomalies flock together: exploring code anomaly agglomerations for locating design problems.", "fields": ["urban agglomeration", "internal documentation", "code smell", "software system", "static program analysis"], "abstract": "Design problems affect every software system. Diverse software systems have been discontinued or reengineered due to design problems. As design documentation is often informal or nonexistent, design problems need to be located in the source code. The main difficulty to identify a design problem in the implementation stems from the fact that such problem is often scattered through several program elements. Previous work assumed that code anomalies -- popularly known as code smells -- may provide sufficient hints about the location of a design problem. However, each code anomaly alone may represent only a partial embodiment of a design problem. In this paper, we hypothesize that code anomalies tend to ``flock together'' to realize a design problem. We analyze to what extent groups of inter-related code anomalies, named agglomerations, suffice to locate design problems. We analyze more than 2200 agglomerations found in seven software systems of different sizes and from different domains. Our analysis indicates that certain forms of agglomerations are consistent indicators of both congenital and evolutionary design problems, with accuracy often higher than 80%.", "citation": "Citations (18)", "departments": ["Pontifical Catholic University of Rio de Janeiro", "Pontifical Catholic University of Rio de Janeiro", "Pontifical Catholic University of Rio de Janeiro", "Pontifical Catholic University of Rio de Janeiro", "USC, Los Angeles"], "authors": ["Willian Nalepa Oizumi.....http://dblp.org/pers/hd/o/Oizumi:Willian_Nalepa", "Alessandro F. Garcia.....http://dblp.org/pers/hd/g/Garcia:Alessandro_F=", "Leonardo da Silva Sousa.....http://dblp.org/pers/hd/s/Sousa:Leonardo_da_Silva", "Bruno Barbieri Pontes Cafeo.....http://dblp.org/pers/hd/c/Cafeo:Bruno_Barbieri_Pontes", "Yixue Zhao.....http://dblp.org/pers/hd/z/Zhao:Yixue"], "conf": "icse", "year": "2016", "pages": 12}