{"title": "Towards a Non-2PC Transaction Management in Distributed Database Systems.", "fields": ["x open xa", "two phase commit protocol", "compensating transaction", "transaction processing system", "extreme transaction processing"], "abstract": "Shared-nothing architecture has been widely used in distributed databases to achieve good scalability. While it offers superior performance for local transactions, the overhead of processing distributed transactions can degrade the system performance significantly. The key contributor to the degradation is the expensive two-phase commit (2PC) protocol used to ensure atomic commitment of distributed transactions. In this paper, we propose a transaction management scheme called LEAP to avoid the 2PC protocol within distributed transaction processing. Instead of processing a distributed transaction across multiple nodes, LEAP converts the distributed transaction into a local transaction. This benefits the processing locality and facilitates adaptive data repartitioning when there is a change in data access pattern. Based on LEAP, we develop an online transaction processing (OLTP) system, L-Store, and compare it with the state-of-the-art distributed in-memory OLTP system, H-Store, which relies on the 2PC protocol for distributed transaction processing, and H^L-Store, a H-Store that has been modified to make use of LEAP. Results of an extensive experimental evaluation show that our LEAP-based engines are superior over H-Store by a wide margin, especially for workloads that exhibit locality-based data accesses.", "citation": "Citations (5)", "year": "2016", "departments": ["National University of Singapore", "Zhejiang University", "Zhejiang University", "National University of Singapore", "National University of Singapore"], "conf": "sigmod", "authors": ["Qian Lin.....http://dblp.org/pers/hd/l/Lin:Qian", "Pengfei Chang.....http://dblp.org/pers/hd/c/Chang:Pengfei", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Zhengkui Wang.....http://dblp.org/pers/hd/w/Wang:Zhengkui"], "pages": 16}