{"title": "Social learning networks: Efficiency optimization for MOOC forums.", "fields": ["social learning", "data mining", "maximization", "ask price", "machine learning"], "abstract": "A Social Learning Network (SLN) emerges when users exchange information on educational topics with structured interactions. The recent proliferation of massively scaled online (human) learning, such as Massive Open Online Courses (MOOCs), has presented a plethora of research challenges surrounding SLN. In this paper, we ask: How efficient are these networks? We propose a framework in which SLN efficiency is determined by comparing user benefit in the observed network to a benchmark of maximum utility achievable through optimization. Our framework defines the optimal SLN through utility maximization subject to a set of constraints that can be inferred from the network. Through evaluation on four MOOC discussion forum datasets and optimizing over millions of variables, we find that SLN efficiency can be rather low (from 68% to 82% depending on the specific parameters and dataset), which indicates that much can be gained through optimization. We find that the gains in global utility (i.e., average across users) can be obtained without making the distribution of local utilities (i.e., utility of individual users) less fair. We also discuss ways of realizing the optimal network in practice, through curated news feeds in online SLN.", "citation": "Citations (4)", "departments": ["Princeton University", "Princeton University", "Princeton University", "Princeton University", "Princeton University"], "authors": ["Christopher G. Brinton.....http://dblp.org/pers/hd/b/Brinton:Christopher_G=", "Swapna Buccapatnam.....http://dblp.org/pers/hd/b/Buccapatnam:Swapna", "Felix Ming Fai Wong.....http://dblp.org/pers/hd/w/Wong:Felix_Ming_Fai", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung", "H. Vincent Poor.....http://dblp.org/pers/hd/p/Poor:H=_Vincent"], "conf": "infocom", "year": "2016", "pages": 9}