{"title": "Real-Time False-Contours Removal for Inverse Tone Mapped HDR Content.", "fields": ["operator", "signal reconstruction", "inverse", "high dynamic range imaging", "dynamic range"], "abstract": "High Dynamic Ranges (HDR) displays can show images with higher color contrast levels and peak luminosities than the commonly used Low Dynamic Range (LDR) displays. Although HDR displays are still expensive, they are reaching the consumer market in the coming years. Unfortunately, most video content is recorded and/or graded in LDR format. Typically, dynamic range expansion by using an Inverse Tone Mapped Operator (iTMO) is required to show LDR content in HDR displays. The most common type of artifact derived from dynamic range expansion is false contouring, which negatively affects the overall image quality. In this paper, we propose a new fast iterative false-contour removal method for inverse tone mapped HDR content. We consider the false-contour removal as a signal reconstruction problem, and we solve it using an iterative Projection Onto Convex Sets (POCS) minimization algorithm. Unlike most other false-contour removal techniques, we define reconstruction constraints taking into account the iTMO used. Experimental results demonstrate the effectiveness of the proposed method to remove false contours while preserving details in the image. In order speed-up the execution time, the proposed method was implemented to run on a GPU. We were able to show that it can be used to remove false contours in real-time from an inverse tone mapped High-definition HDR video sequences at 24 fps.", "citation": "Not cited", "departments": ["Escuela Superior Politecnica del Litoral", "Ghent University", "Ghent University", "Ghent University", "Escuela Superior Politecnica del Litoral"], "authors": ["Gonzalo Luzardo.....http://dblp.org/pers/hd/l/Luzardo:Gonzalo", "Jan Aelterman.....http://dblp.org/pers/hd/a/Aelterman:Jan", "Hiêp Quang Luong.....http://dblp.org/pers/hd/l/Luong:Hi=ecirc=p_Quang", "Wilfried Philips.....http://dblp.org/pers/hd/p/Philips:Wilfried", "Daniel Ochoa.....http://dblp.org/pers/hd/o/Ochoa:Daniel"], "conf": "mm", "year": "2017", "pages": 8}