{"title": "Optimizing stochastic scheduling in fork-join queueing models: Bounds and applications.", "fields": ["probabilistic logic", "fair share scheduling", "raid", "dynamic priority scheduling", "fork join queue"], "abstract": "Fork-Join (FJ) queueing models capture the dynamics of system parallelization under synchronization constraints, for example, for applications such as MapReduce, multipath transmission and RAID systems. Arriving jobs are first split into tasks and mapped to servers for execution, such that a job can only leave the system when all of its tasks are executed. In this paper, we provide computable stochastic bounds for the waiting and response time distributions for heterogeneous FJ systems under general parallelization benefit. Our main contribution is a generalized mathematical framework for probabilistic server scheduling strategies that are essentially characterized by a probability distribution over the number of utilized servers, and the optimization thereof. We highlight the trade-off between the scaling benefit due to parallelization and the FJ inherent synchronization penalty. Further, we provide optimal scheduling strategies for arbitrary scaling regimes that map to different levels of parallelization benefit. One notable insight obtained from our results is that different applications with varying parallelization benefits result in different optimal strategies. Finally, we complement our analytical results by applying them to various applications showing the optimality of the proposed scheduling strategies.", "citation": "Citations (1)", "departments": ["Bioinspired Com ... mstadt, Germany", "Multimedia Comm ... mstadt, Germany", "Multimedia Comm ... mstadt, Germany", "Bioinspired Com ... mstadt, Germany"], "authors": ["Wasiur R. KhudaBukhsh.....http://dblp.org/pers/hd/k/KhudaBukhsh:Wasiur_R=", "Amr Rizk.....http://dblp.org/pers/hd/r/Rizk:Amr", "Alexander Frömmgen.....http://dblp.org/pers/hd/f/Fr=ouml=mmgen:Alexander", "Heinz Koeppl.....http://dblp.org/pers/hd/k/Koeppl:Heinz"], "conf": "infocom", "year": "2017", "pages": 9}