{"title": "A Novel Tensor-Based Video Rain Streaks Removal Approach via Utilizing Discriminatively Intrinsic Priors.", "fields": ["matrix norm", "operator", "prior probability", "discriminative model", "smoothness"], "abstract": "Rain streaks removal is an important issue of the outdoor vision system and has been recently investigated extensively. In this paper, we propose a novel tensor based video rain streaks removal approach by fully considering the discriminatively intrinsic characteristics of rain streaks and clean videos, which needs neither rain detection nor time-consuming dictionary learning stage. In specific, on the one hand, rain streaks are sparse and smooth along the raindrops direction, and on the other hand, the clean videos possess smoothness along the rain-perpendicular direction and global and local correlation along time direction. We use the l1 norm to enhance the sparsity of the underlying rain, two unidirectional Total Variation (TV) regularizers to guarantee the different discriminative smoothness, and a tensor nuclear norm and a time directional difference operator to characterize the exclusive correlation of the clean video along time. Alternation direction method of multipliers (ADMM) is employed to solve the proposed concise tensor based convex model. Experiments implemented on synthetic and real data substantiate the effectiveness and efficiency of the proposed method. Under comprehensive quantitative performance measures, our approach outperforms other state-of-the-art methods.", "citation": "Citations (4)", "year": "2017", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "Xi'an Jiaotong University"], "conf": "cvpr", "authors": ["Tai-Xiang Jiang.....http://dblp.org/pers/hd/j/Jiang:Tai=Xiang", "Ting-Zhu Huang.....http://dblp.org/pers/hd/h/Huang:Ting=Zhu", "Xi-Le Zhao.....http://dblp.org/pers/hd/z/Zhao:Xi=Le", "Liang-Jian Deng.....http://dblp.org/pers/hd/d/Deng:Liang=Jian", "Yao Wang.....http://dblp.org/pers/hd/w/Wang_0003:Yao"], "pages": 10}