{"title": "Multi-feature Fusion for Predicting Social Media Popularity.", "fields": ["ranking", "popularity", "local binary patterns", "upload", "social media"], "abstract": "This paper presents the method that underlies our submission to the popularity prediction task of Social Media Prediction Challenge 2017. The task is designed to predict the impact of sharing different posts for a publisher on social media. There are many factors that influence image popularity; these include not only the visual features of the image, but also the social features, such as user characteristics of its poster and even the upload time. In this project, we propose a fast and effective framework for popularity prediction. First, we investigate and extract visual and social features of images. For the visual feature, we introduce 1) global feature descriptors, such as Local Binary Pattern and Color Names, 2) local feature descriptors, such as Local Maximal Occurrence, and 3) deep features. For the social feature, we adopt users features (average views, group count, and member count), post features (title length, description length, and tag count), and time features (month, weekday, day, and hour). Furthermore, we fed a fusion of multi-feature to Linear Regression, Matrix Factorization based on Time and feature Cluster, and Support Vector Regression models respectively, and present comparative analysis of the prediction results. Finally, we choose the best model to predict the popularity scores of the test images. Experimental results demonstrate that our method can achieve 0.8581, 1.4062 and 0.8625 in terms of Spearman Ranking Correlation, Mean Absolute Error, and Mean Squared Error, respectively.", "citation": "Citations (1)", "departments": ["Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications"], "authors": ["Jinna Lv.....http://dblp.org/pers/hd/l/Lv:Jinna", "Wu Liu.....http://dblp.org/pers/hd/l/Liu:Wu", "Meng Zhang.....http://dblp.org/pers/hd/z/Zhang:Meng", "He Gong.....http://dblp.org/pers/hd/g/Gong:He", "Bin Wu.....http://dblp.org/pers/hd/w/Wu:Bin", "Huadong Ma.....http://dblp.org/pers/hd/m/Ma:Huadong"], "conf": "mm", "year": "2017", "pages": 6}