{"title": "Meta-activity recognition: A wearable approach for logic cognition-based activity sensing.", "fields": ["edit distance", "wearable computer", "activity recognition", "raw data", "waveform"], "abstract": "Activity sensing has become a key technology for many ubiquitous applications, such as exercise monitoring and elder care. Most traditional approaches track the human motions and perform activity recognition based on the waveform matching schemes in the raw data representation level. In regard to the complex activities with relatively large moving range, they usually fail to accurately recognize these activities, due to the inherent variations in human activities. In this paper, we propose a wearable approach for logic cognition-based activity sensing scheme in the logical representation level, by leveraging the meta-activity recognition. Our solution extracts the angle profiles from the raw inertial measurements, to depict the angle variation of limb movement in regard to the consistent body coordinate system. It further extracts the meta-activity profiles to depict the sequence of small-range activity units in the complex activity. By leveraging the least edit distance-based matching scheme, our solution is able to accurately perform the activity sensing. Based on the logic cognition-based activity sensing, our solution achieves lightweight-training recognition, which requires a small quantity of training samples to build the templates, and user-independent recognition, which requires no training from the specific user. The experiment results in real settings shows that our meta-activity recognition achieves an average accuracy of 92% for user-independent activity sensing.", "citation": "Not cited", "departments": ["Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Lei Xie.....http://dblp.org/pers/hd/x/Xie:Lei", "Xu Dong.....http://dblp.org/pers/hd/d/Dong:Xu", "Wei Wang.....http://dblp.org/pers/hd/w/Wang:Wei", "Dawei Huang.....http://dblp.org/pers/hd/h/Huang:Dawei"], "conf": "infocom", "year": "2017", "pages": 9}