{"title": "Video Question Answering via Gradually Refined Attention over Appearance and Motion.", "fields": ["multimedia", "question answering", "computer science", "artificial neural network"], "abstract": "Recently image question answering (ImageQA) has gained lots of attention in the research community. However, as its natural extension, video question answering (VideoQA) is less explored. Although both tasks look similar, VideoQA is more challenging mainly because of the complexity and diversity of videos. As such, simply extending the ImageQA methods to videos is insufficient and suboptimal. Particularly, working with the video needs to model its inherent temporal structure and analyze the diverse information it contains. In this paper, we consider exploiting the appearance and motion information resided in the video with a novel attention mechanism. More specifically, we propose an end-to-end model which gradually refines its attention over the appearance and motion features of the video using the question as guidance. The question is processed word by word until the model generates the final optimized attention. The weighted representation of the video, as well as other contextual information, are used to generate the answer. Extensive experiments show the advantages of our model compared to other baseline models. We also demonstrate the effectiveness of our model by analyzing the refined attention weights during the question answering procedure.", "citation": "Citations (2)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Columbia University"], "authors": ["Dejing Xu.....http://dblp.org/pers/hd/x/Xu:Dejing", "Zhou Zhao.....http://dblp.org/pers/hd/z/Zhao:Zhou", "Jun Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Jun", "Fei Wu.....http://dblp.org/pers/hd/w/Wu_0001:Fei", "Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Xiangnan He.....http://dblp.org/pers/hd/h/He_0001:Xiangnan", "Yueting Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yueting"], "conf": "mm", "year": "2017", "pages": 9}