{"title": "SmartMD: A High Performance Deduplication Engine with Mixed Pages.", "fields": ["hypervisor", "page table", "translation lookaside buffer", "virtualization", "data deduplication"], "abstract": "In hypervisor-based virtualization environments, translation lookaside buffers (TLBs) misses may induce two-dimensional page table walks, which may incur a long access latency, and this issue becomes worse with ever increasing memory capacity. To reduce the overhead of TLB misses, large pages (e.g., 2M-pages) are widely supported in modern hardware platforms to reduce the number of page table entries. However, memory management with large pages can be inefficient in deduplication, leading to low utilization of memory, which is a precious resource for a variety of applications.\n\nTo simultaneously enjoy benefits of high performance by accessing memory with large pages (e.g., 2M-pages) and high deduplication rate by managing memory with base pages (e.g., 4K-pages), we propose Smart Memory Deduplciation, or SmartMD in short, which is an adaptive and efficient management scheme for mixed-page memory. Specifically, we propose two lightweight schemes to accurately monitor pages' access frequency and repetition rate, and present a dynamic and adaptive conversion scheme to selectively split or reconstruct large pages. We implement a prototype system and conduct extensive experiments with various workloads. Experiment results show that SmartMD can simultaneously achieve high access performance similar to systems using large pages, and achieves a deduplication rate similar to that applying aggressive deduplication scheme (i.e., KSM) at the same time on base pages.", "citation": "Citations (2)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Texas at Arlington", "The Chinese University of Hong Kong"], "authors": ["Fan Guo.....http://dblp.org/pers/hd/g/Guo:Fan", "Yongkun Li.....http://dblp.org/pers/hd/l/Li:Yongkun", "Yinlong Xu.....http://dblp.org/pers/hd/x/Xu:Yinlong", "Song Jiang.....http://dblp.org/pers/hd/j/Jiang:Song", "John C. S. Lui.....http://dblp.org/pers/hd/l/Lui:John_C=_S="], "conf": "usenix", "year": "2017", "pages": 12}