{"title": "FloodDefender: Protecting data and control plane resources under SDN-aimed DoS attacks.", "fields": ["openflow", "network packet", "routing control plane", "controller", "packet loss"], "abstract": "The separated control and data planes in software-defined networking (SDN) with high programmability introduce a more flexible way to manage and control network traffic. However, SDN will experience long packet delay and high packet loss rate when the communication link between two planes is jammed by SDN-aimed DoS attacks with massive table-miss packets. In this paper, we propose FloodDefender, an efficient and protocol-independent defense framework for SDN/OpenFlow networks to mitigate DoS attacks. It stands between the controller platform and other controller apps, and can protect both the data and control plane resources by leveraging three new techniques: table-miss engineering to prevent the communication bandwidth from being exhausted; packet filter to identify attack traffic and save computational resources of the control plane; and flow rule management to eliminate most of useless flow entries in the switch flow table. All designs of FloodDefender conform to the OpenFlow policy, requiring no additional devices. We implement a prototype of FloodDefender and evaluate its performance in both software and hardware environments. Experimental results show that FloodDefender can efficiently mitigate the SDN-aimed DoS attacks, incurring less than 0.5% CPU computation to handle attack traffic, only 18ms packet delay and 5% packet loss rate under attacks.", "citation": "Citations (11)", "departments": ["Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Southeast University", "State University of New York System"], "authors": ["Shang Gao.....http://dblp.org/pers/hd/g/Gao:Shang", "Zhe Peng.....http://dblp.org/pers/hd/p/Peng:Zhe", "Bin Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Bin", "Aiqun Hu.....http://dblp.org/pers/hd/h/Hu:Aiqun", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui"], "conf": "infocom", "year": "2017", "pages": 9}