{"title": "Deep Low-rank Sparse Collective Factorization for Cross-Domain Recommendation.", "fields": ["recommender system", "sparse approximation", "factorization", "collaborative filtering", "binary number"], "abstract": "In cross-domain recommendation, data sparsity becomes more and more serious when the ratings are expressed numerically, e.g., 5-star grades. In this work, we focus on borrowing the knowledge from other domains in the form of binary ratings, such as likes and dislikes for certain items. Most existing works conventionally assume that multiple domains share some common latent information across users and items. In practice, however, the related domains not only share the common latent feature of users and items, but also share some knowledge of rating patterns. Furthermore, conventional methods did not consider the hierarchical structures (i.e., genre, sub genre, detailed-category) in real-world recommendation system. In this paper, we propose a novel Deep Low-rank Sparse Collective Factorization (DLSCF) to facilitate the cross-domain recommendation. Specifically, the low-rank sparse decomposition is adopted to capture the most shared rating patterns with low-rank constraint while integrating the domain-specific patterns with group-sparse scheme. Furthermore, we factorize the rating pattern matrix in multiple layers to obtain the user/item latent category affiliation matrices, which could indicate the affiliation relation between latent categories and latent sub-categories. Experimental results on MoviePilot and Netfilx datasets demonstrate the effectiveness of our proposed algorithm at various sparsity levels, by comparing it with several state-of-the-art approaches.", "citation": "Citations (1)", "departments": ["Northeastern University", "Northeastern University", "Northeastern University"], "authors": ["Shuhui Jiang.....http://dblp.org/pers/hd/j/Jiang:Shuhui", "Zhengming Ding.....http://dblp.org/pers/hd/d/Ding:Zhengming", "Yun Fu.....http://dblp.org/pers/hd/f/Fu:Yun"], "conf": "mm", "year": "2017", "pages": 9}