{"title": "Towards Unified Data and Lifecycle Management for Deep Learning.", "fields": ["deep learning", "domain specific language", "application lifecycle management", "abstraction layer", "sql"], "abstract": "Deep learning has improved state-of-the-art results in many important fields, and has been the subject of much research in recent years, leading to the development of several systems for facilitating deep learning. Current systems, however, mainly focus on model building and training phases, while the issues of data management, model sharing, and lifecycle management are largely ignored. Deep learning modeling lifecycle generates a rich set of data artifacts, e.g., learned parameters and training logs, and it comprises of several frequently conducted tasks, e.g., to understand the model behaviors and to try out new models. Dealing with such artifacts and tasks is cumbersome and largely left to the users. This paper describes our vision and implementation of a data and lifecycle management system for deep learning. First, we generalize model exploration and model enumeration queries from commonly conducted tasks by deep learning modelers, and propose a high-level domain specific language (DSL), inspired by SQL, to raise the abstraction level and thereby accelerate the modeling process. To manage the variety of data artifacts, especially the large amount of checkpointed float parameters, we design a novel model versioning system (dlv), and a read-optimized parameter archival storage system (PAS) that minimizes storage footprint and accelerates query workloads with minimal loss of accuracy. PAS archives versioned models using deltas in a multi-resolution fashion by separately storing the less significant bits, and features a novel progressive query (inference) evaluation algorithm. Third, we develop e cient algorithms for archiving versioned models using deltas under co-retrieval constraints. We conduct extensive experiments over several real datasets from computer vision domain to show the e ciency of the proposed techniques.", "citation": "Citations (4)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Hui Miao.....http://dblp.org/pers/hd/m/Miao_0001:Hui", "Ang Li.....http://dblp.org/pers/hd/l/Li_0001:Ang", "Larry S. Davis.....http://dblp.org/pers/hd/d/Davis:Larry_S=", "Amol Deshpande.....http://dblp.org/pers/hd/d/Deshpande:Amol"], "conf": "icde", "year": "2017", "pages": 12}