{"title": "Neural EPI-Volume Networks for Shape from Light Field.", "fields": ["regularization", "classification of discontinuities", "light field", "epipolar geometry", "computer vision", "computer science", "network architecture", "artificial intelligence"], "abstract": "This paper presents a novel deep regression network to extract geometric information from Light Field (LF) data. Our network builds upon u-shaped network architectures. Those networks involve two symmetric parts, an encoding and a decoding part. In the first part the network encodes relevant information from the given input into a set of high-level feature maps. In the second part the generated feature maps are then decoded to the desired output. To predict reliable and robust depth information the proposed network examines 3D subsets of the 4D LF called Epipolar Plane Image (EPI) volumes. An important aspect of our network is the use of 3D convolutional layers, that allow to propagate information from two spatial dimensions and one directional dimension of the LF. Compared to previous work this allows for an additional spatial regularization, which reduces depth artifacts and simultaneously maintains clear depth discontinuities. Experimental results show that our approach allows to create high-quality reconstruction results, which outperform current state-of-the-art Shape from Light Field (SfLF) techniques. The main advantage of the proposed approach is the ability to provide those high-quality reconstructions at a low computation time.", "citation": "Not cited", "year": "2017", "departments": ["Graz University of Technology", "Graz University of Technology", "Austrian Institute of Technology", "Graz University of Technology", "Graz University of Technology", "Institute of Co ... d Vision (7100)"], "conf": "iccv", "authors": ["Stefan Heber.....http://dblp.org/pers/hd/h/Heber:Stefan", "Wei Yu.....http://dblp.org/pers/hd/y/Yu_0014:Wei", "Thomas Pock.....http://dblp.org/pers/hd/p/Pock:Thomas"], "pages": 9}