{"title": "Incidental computing on IoT nonvolatile processors.", "fields": ["internet of things", "backup", "parallel computing", "computation", "compiler"], "abstract": "Batteryless IoT devices powered through energy harvesting face a fundamental imbalance between the potential volume of collected data and the amount of energy available for processing that data locally. However, many such devices perform similar operations across each new input record, which provides opportunities for mining the potential information in buffered historical data, at potentially lower effort, while processing new data rather than abandoning old inputs due to limited computational energy. We call this approach  incidental computing , and highlight synergies between this approach and approximation techniques when deployed on a non-volatile processor platform (NVP). In addition to incidental computations, the backup and restore operations in an incidental NVP provide approximation opportunities and optimizations that are unique to NVPs.   We propose a variety of incidental approximation approaches suited to NVPs, with a focus on approximate backup and restore, and approximate recomputation in the face of power interruptions. We perform RTL level evaluation for many frequently used workloads. We show that these incidental techniques provide an average of 4.2X more forward progress than precise NVP execution.", "citation": "Citations (2)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Tsinghua University", "Tsinghua University", "University of California, Santa Barbara"], "authors": ["Kaisheng Ma.....http://dblp.org/pers/hd/m/Ma:Kaisheng", "Xueqing Li.....http://dblp.org/pers/hd/l/Li:Xueqing", "Jinyang Li.....http://dblp.org/pers/hd/l/Li_0002:Jinyang", "Yongpan Liu.....http://dblp.org/pers/hd/l/Liu:Yongpan", "Yuan Xie.....http://dblp.org/pers/hd/x/Xie_0001:Yuan", "Jack Sampson.....http://dblp.org/pers/hd/s/Sampson:Jack", "Mahmut Taylan Kandemir.....http://dblp.org/pers/hd/k/Kandemir:Mahmut_Taylan", "Vijaykrishnan Narayanan.....http://dblp.org/pers/hd/n/Narayanan:Vijaykrishnan"], "conf": "micro", "year": "2017", "pages": 15}