{"title": "H-TIME: Haptic-enabled Tele-Immersive Musculoskeletal Examination.", "fields": ["immersion", "rendering", "feeling", "mixed reality", "haptic technology"], "abstract": "The current state-of-the-art tele-medicine applications only allow audiovisual communication between a doctor and the patient, necessitating a clinician to physically examine the patient. The doctor relies on the physical examination performed by the clinician, along with the audiovisual dialogue with the patient. In this paper, a Haptic-enabled Tele-Immersive Musculoskeletal Examination (H-TIME) system is introduced, that allows doctors to physically examine musculoskeletal conditions of the patients remotely, by looking at the 3D reconstructed model of the patient in the virtual world, and physically feeling the patient's range of mobility using a haptic device. The proposed bidirectional haptic rendering in H-TIME can allow the doctor to evaluate a patient who suffers from problems in their upper extremities, such as the shoulder, elbow, wrist, etc., and evaluate them remotely. Real world user study was performed, between the doctors and the patients, and it highlighted the potential of the proposed system. The study indicated a high degree of correlation between the in-person and H-TIME evaluations of the patient. Both the doctors and patients involved in the study, felt that the system could potentially replace in-person consultations, someday.", "citation": "Citations (2)", "departments": ["University of Texas at Dallas", "University of Texas Southwestern Medical Center", "University of Texas Southwestern Medical Center", "University of Illinois at Urbana–Champaign", "Mobiweb Inc, Plano, TX, USA"], "authors": ["Yuan Tian.....http://dblp.org/pers/hd/t/Tian_0002:Yuan", "Suraj Raghuraman.....http://dblp.org/pers/hd/r/Raghuraman:Suraj", "Thiru Annaswamy.....http://dblp.org/pers/hd/a/Annaswamy:Thiru", "Aleksander Borresen.....http://dblp.org/pers/hd/b/Borresen:Aleksander", "Klara Nahrstedt.....http://dblp.org/pers/hd/n/Nahrstedt:Klara", "Balakrishnan Prabhakaran.....http://dblp.org/pers/hd/p/Prabhakaran:Balakrishnan"], "conf": "mm", "year": "2017", "pages": 9}