{"title": "Understanding object-level memory access patterns across the spectrum.", "fields": ["extant taxon", "tracing", "profiling", "scalability", "data analysis"], "abstract": "Memory accesses limit the performance and scalability of countless applications. Many design and optimization efforts will benefit from an in-depth understanding of memory access behavior, which is not offered by extant access tracing and profiling methods.   In this paper, we adopt a holistic memory access profiling approach to enable a better understanding of program-system memory interactions. We have developed a two-pass tool adopting fast online and slow offline profiling, with which we have profiled, at the  variable/object level , a collection of 38 representative applications spanning major domains (HPC, personal computing, data analytics, AI, graph processing, and datacenter workloads), at varying problem sizes. We have performed detailed result analysis and code examination. Our findings provide new insights into application memory behavior, including insights on per-object access patterns, adoption of data structures, and memory-access changes at different problem sizes. We find that scientific computation applications exhibit distinct behaviors compared to datacenter workloads, motivating separate memory system design/optimizations.", "citation": "Citations (1)", "year": "2017", "departments": ["Tsinghua University", "Oak Ridge National Laboratory", "Massachusetts Institute of Technology", "Qatar Computing Research Institute", "Sogang University"], "conf": "sc", "authors": ["Xu Ji.....http://dblp.org/pers/hd/j/Ji:Xu", "Chao Wang.....http://dblp.org/pers/hd/w/Wang:Chao", "Nosayba El-Sayed.....http://dblp.org/pers/hd/e/El=Sayed:Nosayba", "Xiaosong Ma.....http://dblp.org/pers/hd/m/Ma:Xiaosong", "Youngjae Kim.....http://dblp.org/pers/hd/k/Kim_0001:Youngjae", "Sudharshan S. Vazhkudai.....http://dblp.org/pers/hd/v/Vazhkudai:Sudharshan_S=", "Wei Xue.....http://dblp.org/pers/hd/x/Xue:Wei", "Daniel Sánchez.....http://dblp.org/pers/hd/s/S=aacute=nchez_0003:Daniel"], "pages": 12}