{"title": "Semi-Relaxation Supervised Hashing for Cross-Modal Retrieval.", "fields": ["feature hashing", "dynamic perfect hashing", "k independent hashing", "universal hashing", "locality sensitive hashing"], "abstract": "Recently, some cross-modal hashing methods have been devised for cross-modal search task. Essentially, given a similarity matrix, most of these methods tackle a discrete optimization problem by separating it into two stages, i.e., first relaxing the binary constraints and finding a solution of the relaxed optimization problem, then quantizing the solution to obtain the binary codes. This scheme will generate large quantization error. Some discrete optimization methods have been proposed to tackle this; however, the generation of the binary codes is independent of the features in the original space, which makes it not robust to noise. To consider these problems, in this paper, we propose a novel supervised cross-modal hashing method---Semi-Relaxation Supervised Hashing (SRSH). It can learn the hash functions and the binary codes simultaneously. At the same time, to tackle the optimization problem, it relaxes a part of binary constraints, instead of all of them, by introducing an intermediate representation variable. By doing this, the quantization error can be reduced and the optimization problem can also be easily solved by an iterative algorithm proposed in this paper. Extensive experimental results on three benchmark datasets demonstrate that SRSH can obtain competitive results and outperform state-of-the-art unsupervised and supervised cross-modal hashing methods.", "citation": "Citations (3)", "departments": ["Shandong University", "Shandong University", "Shandong University", "Shandong University", "Shandong University"], "authors": ["Pengfei Zhang.....http://dblp.org/pers/hd/z/Zhang:Pengfei", "Chuan-Xiang Li.....http://dblp.org/pers/hd/l/Li:Chuan=Xiang", "Meng-Yuan Liu.....http://dblp.org/pers/hd/l/Liu:Meng=Yuan", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Xin-Shun Xu.....http://dblp.org/pers/hd/x/Xu:Xin=Shun"], "conf": "mm", "year": "2017", "pages": 9}