{"title": "Emerging internet content and service providers' relationships: Models and analyses of engineering, business and policy impact.", "fields": ["service provider", "business engineering", "the internet", "stackelberg competition", "broadband", "cache", "net neutrality", "public relations", "enhanced telecom operations map", "last mile"], "abstract": "We study engineering and business relationships between Content Providers and broadband access ISPs in various organizational and policy environments. We focus on pricing and capacity decisions for bandwidth and caches for delivery of the CP's content over the “last mile” of the ISP's infrastructure. We model the CP-ISP interaction by the Stackelberg “leader-follower” game and the Integrated Operations model. We consider cases where premium bandwidth is offered to subscribers of the CP's service over the last mile, and cases where this is prohibited by Net Neutrality regulations. We develop a uniform solution procedure for all four resulting models. We explore the connections between optimal bandwidth and cache deployments, and, together with fees, their impact on the number of users, and related business and policy topics. We show that the decrease in profitability of caching due to Net Neutrality regulations is greater than the decrease from Integrated Operations to the Stackelberg game. In the Stackelberg game we prove that if a certain condition is satisfied, then with Net Neutrality the ISP will increase the cache price so that it is unprofitable for the CP to use caches. Moreover, this condition is satisfied in a typical case studied in detail.", "citation": "Not cited", "departments": ["University of Illinois at Urbana–Champaign", "Columbia University", "Columbia Univesity"], "authors": ["Debasis Mitra.....http://dblp.org/pers/hd/m/Mitra_0001:Debasis", "Qiong Wang.....http://dblp.org/pers/hd/w/Wang:Qiong", "Ao Hong.....http://dblp.org/pers/hd/h/Hong:Ao"], "conf": "infocom", "year": "2017", "pages": 9}