{"title": "5th Int. workshop on human activity sensing corpus and applications (HASCA): towards open-ended context awareness.", "fields": ["int", "human behavior", "activity recognition", "participatory sensing", "gesture recognition"], "abstract": "Technological advances enable the inclusion of miniature sensors (e.g., accelerometers, gyroscopes) on a variety of wearable/portable information devices. Most current devices utilize these sensors for simple orientation and gesture recognition only. However, in the future the recognition of more complex and subtle human behaviors from these sensors will enable next-generation human-oriented computing in scenarios of high societal value (e.g., dementia care). This will require large-scale human activity corpuses and much improved methods to recognize activities and the context in which they occur. This workshop deals with the challenges of designing reproducible experimental setups, running large-scale dataset collection campaigns, designing activity and context recognition methods that are robust and adaptive, and evaluating systems in the real world. As a special topic this year, we wish to reflect on the challenges and possible approaches to recognize situations, events or activities outside of a statically pre-defined pool, which is the current state of the art, and instead adopt an  open-ended  view on activity and context awareness. Following the huge success of previous years, we are further planning to share these experiences of current research on human activity corpus and their applications among the researchers and the practitioners and to have a deep discussion on the future of activity sensing, in particular towards open-ended contextual intelligence.", "citation": "Not cited", "departments": ["Nagoya University", "Ritsumeikan University", "University of Sussex", "Kyushu Institute of Technology", "University of Oulu"], "authors": ["Nobuo Kawaguchi.....http://dblp.org/pers/hd/k/Kawaguchi:Nobuo", "Nobuhiko Nishio.....http://dblp.org/pers/hd/n/Nishio:Nobuhiko", "Daniel Roggen.....http://dblp.org/pers/hd/r/Roggen:Daniel", "Sozo Inoue.....http://dblp.org/pers/hd/i/Inoue:Sozo", "Susanna Pirttikangas.....http://dblp.org/pers/hd/p/Pirttikangas:Susanna", "Kristof Van Laerhoven.....http://dblp.org/pers/hd/l/Laerhoven:Kristof_Van"], "conf": "huc", "year": "2017", "pages": 7}