{"title": "Weighted Bandits or: How Bandits Learn Distorted Values That Are Not Expected.", "fields": ["distortion function", "binary logarithm", "m 2", "sublinear function", "parameterized complexity"], "abstract": "Motivated by models of human decision making proposed to explain commonly observed deviations from conventional expected value preferences, we formulate two stochastic multi-armed bandit problems with distorted probabilities on the cost distributions: the classic  K -armed bandit and the linearly parameterized bandit. In both settings, we propose algorithms that are inspired by Upper Confidence Bound (UCB) algorithms, incorporate cost distortions, and exhibit sublinear regret assuming Holder continuous weight distortion functions. For the  K -armed setting, we show that the algorithm, called W-UCB, achieves problem-dependent regret  O ( L  2   M  2  log  n  / Δ(2/α – 1), where  n  is the number of plays, Δ is the gap in distorted expected value between the best and next best arm,  L  and alpha are the Holder constants for the distortion function, and  M  is an upper bound on costs, and a problem-independent regret bound of  O (( KL  2  M  2 ) (α/2)   n  (2 – α)/2) ). We also present a matching lower bound on the regret, showing that the regret of W-UCB is essentially unimprovable over the class of Holder-continuous weight distortions. For the linearly parameterized setting, we develop a new algorithm, a variant of the Optimism in the Face of Uncertainty Linear bandit (OFUL) algorithm called WOFUL (Weight-distorted OFUL), and show that it has regret  O ( d √ n  polylog( n) ) with high probability, for sub-Gaussian cost distributions.", "citation": "Not cited", "departments": ["Indian Institute of Science", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Aditya Gopalan.....http://dblp.org/pers/hd/g/Gopalan:Aditya", "Prashanth L. A......http://dblp.org/pers/hd/a/A=:Prashanth_L=", "Michael C. Fu.....http://dblp.org/pers/hd/f/Fu:Michael_C=", "Steven I. Marcus.....http://dblp.org/pers/hd/m/Marcus:Steven_I="], "conf": "aaai", "year": "2017", "pages": 7}