{"title": "Guided, stochastic model-based GUI testing of Android apps.", "fields": ["android", "static analysis", "correctness", "graphical user interface testing", "model based testing"], "abstract": "Mobile apps are ubiquitous, operate in complex environments and are developed under the time-to-market pressure. Ensuring their correctness and reliability thus becomes an important challenge. This paper introduces Stoat, a novel guided approach to perform stochastic model-based testing on Android apps. Stoat operates in two phases: (1) Given an app as input, it uses dynamic analysis enhanced by a weighted UI exploration strategy and static analysis to reverse engineer a stochastic model of the app's GUI interactions; and (2) it adapts Gibbs sampling to iteratively mutate/refine the stochastic model and guides test generation from the mutated models toward achieving high code and model coverage and exhibiting diverse sequences. During testing, system-level events are randomly injected to further enhance the testing effectiveness.     Stoat was evaluated on 93 open-source apps. The results show (1) the models produced by Stoat cover 17~31% more code than those by existing modeling tools; (2) Stoat detects 3X more unique crashes than two state-of-the-art testing tools, Monkey and Sapienz. Furthermore, Stoat tested 1661 most popular Google Play apps, and detected 2110 previously unknown and unique crashes. So far, 43 developers have responded that they are investigating our reports. 20 of reported crashes have been confirmed, and 8 already fixed.", "citation": "Citations (13)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Shanghai Jiao Tong University", "East China Normal University", "East China Normal University"], "authors": ["Ting Su.....http://dblp.org/pers/hd/s/Su:Ting", "Guozhu Meng.....http://dblp.org/pers/hd/m/Meng:Guozhu", "Yuting Chen.....http://dblp.org/pers/hd/c/Chen:Yuting", "Ke Wu.....http://dblp.org/pers/hd/w/Wu:Ke", "Weiming Yang.....http://dblp.org/pers/hd/y/Yang:Weiming", "Yao Yao.....http://dblp.org/pers/hd/y/Yao:Yao", "Geguang Pu.....http://dblp.org/pers/hd/p/Pu:Geguang", "Yang Liu.....http://dblp.org/pers/hd/l/Liu_0003:Yang", "Zhendong Su.....http://dblp.org/pers/hd/s/Su:Zhendong"], "conf": "sigsoft", "year": "2017", "pages": 12}