{"title": "Optimizing placement of commodity depth cameras for known 3D dynamic scene capture.", "fields": ["simulated annealing", "simulation", "solid modeling", "mathematical optimization", "greedy algorithm"], "abstract": "Commodity depth cameras, such as the Microsoft Kinect®, have been widely used for the capture and reconstruction of the 3D structure of room-sized dynamic scenes. Camera placement and coverage during capture significantly impact the quality of the resulting reconstruction. In particular, dynamic occlusions and sensor interference have been shown to result in poor resolution and holes in the reconstruction results. This paper presents a novel algorithmic framework and a method for off-line optimization of depth cameras placements for a given 3D dynamic scene, simulated using virtual 3D models. We derive a fitness metric for a particular configuration of sensors by combining factors such as visibility and resolution of the entire dynamic scene with probabilities of interference between sensors. We employ this fitness metric both in a greedy algorithm that determines the number of depth cameras needed to cover the scene, and in a simulated annealing algorithm that optimizes the placements of those sensors. We compare our algorithm's optimized placements with manual sensor placements for a real dynamic scene. We present quantitative assessments using our fitness metric, as well as qualitative assessments to demonstrate that our algorithm not only enhances the resolution and total coverage of the reconstruction, but also fills in voids by avoiding occlusions and sensor interference when compared with the reconstruction of the same scene using mual sensor placement.", "citation": "Citations (1)", "departments": ["University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill"], "authors": ["Rohan Chabra.....http://dblp.org/pers/hd/c/Chabra:Rohan", "Adrian Ilie.....http://dblp.org/pers/hd/i/Ilie:Adrian", "Nicholas Rewkowski.....http://dblp.org/pers/hd/r/Rewkowski:Nicholas", "Young-Woon Cha.....http://dblp.org/pers/hd/c/Cha:Young=Woon", "Henry Fuchs.....http://dblp.org/pers/hd/f/Fuchs:Henry"], "conf": "vr", "year": "2017", "pages": 10}