{"title": "Inferring Fine-grained Control Flow Inside SGX Enclaves with Branch Shadowing.", "fields": ["guard", "root cause", "branch predictor", "control flow", "side channel attack"], "abstract": "In this paper, we explore a new, yet critical, side-channel attack against Intel Software Guard Extension (SGX), called a branch shadowing attack, which can reveal fine-grained control flows (i.e., each branch) of an enclave program running on real SGX hardware. The root cause of this attack is that Intel SGX does not clear the branch history when switching from enclave mode to non-enclave mode, leaving the fine-grained traces to the outside world through a branch-prediction side channel. However, exploiting the channel is not so straightforward in practice because 1) measuring branch prediction/misprediction penalties based on timing is too inaccurate to distinguish fine-grained control-flow changes and 2) it requires sophisticated control over the enclave execution to force its execution to the interesting code blocks. To overcome these challenges, we developed two novel exploitation techniques: 1) Intel PT- and LBR-based history-inferring techniques and 2) APIC-based technique to control the execution of enclave programs in a fine-grained manner. As a result, we could demonstrate our attack by breaking recent security constructs, including ORAM schemes, Sanctum, SGX-Shield, and T-SGX. Not limiting our work to the attack itself, we thoroughly studied the feasibility of hardware-based solutions (e.g., branch history clearing) and also proposed a software-based countermeasure, called Zigzagger, to mitigate the branch shadowing attack in practice.", "citation": "Citations (100)", "year": "2017", "departments": ["Pohang University of Science and Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "uss", "authors": ["Sangho Lee.....http://dblp.org/pers/hd/l/Lee_0001:Sangho", "Ming-Wei Shih.....http://dblp.org/pers/hd/s/Shih:Ming=Wei", "Prasun Gera.....http://dblp.org/pers/hd/g/Gera:Prasun", "Taesoo Kim.....http://dblp.org/pers/hd/k/Kim:Taesoo", "Hyesoon Kim.....http://dblp.org/pers/hd/k/Kim:Hyesoon", "Marcus Peinado.....http://dblp.org/pers/hd/p/Peinado:Marcus"], "pages": 18}