{"title": "Analyzing APIs documentation and code to detect directive defects.", "fields": ["look and feel", "api writer", "data scraping", "program comprehension", "software documentation"], "abstract": "Application Programming Interface (API) documents represent one of the most important references for API users. However, it is frequently reported that the documentation is inconsistent with the source code and deviates from the API itself. Such inconsistencies in the documents inevitably confuse the API users hampering considerably their API comprehension and the quality of software built from such APIs. In this paper, we propose an automated approach to detect defects of API documents by leveraging techniques from program comprehension and natural language processing. Particularly, we focus on the directives of the API documents which are related to parameter constraints and exception throwing declarations. A first-order logic based constraint solver is employed to detect such defects based on the obtained analysis results. We evaluate our approach on parts of well documented JDK 1.8 APIs. Experiment results show that, out of around 2000 API usage constraints, our approach can detect 1158 defective document directives, with a precision rate of 81.6%, and a recall rate of 82.0%, which demonstrates its practical feasibility.", "citation": "Citations (6)", "departments": ["Nanjing University of Aeronautics and Astronautics", "Nanjing University of Aeronautics and Astronautics", "Middlesex University", "Nanjing University of Aeronautics and Astronautics", "University of Zurich"], "authors": ["Yu Zhou.....http://dblp.org/pers/hd/z/Zhou:Yu", "Ruihang Gu.....http://dblp.org/pers/hd/g/Gu:Ruihang", "Taolue Chen.....http://dblp.org/pers/hd/c/Chen:Taolue", "Zhiqiu Huang.....http://dblp.org/pers/hd/h/Huang:Zhiqiu", "Sebastiano Panichella.....http://dblp.org/pers/hd/p/Panichella:Sebastiano", "Harald C. Gall.....http://dblp.org/pers/hd/g/Gall:Harald_C="], "conf": "icse", "year": "2017", "pages": 11}