{"title": "A Deep Hierarchical Approach to Lifelong Learning in Minecraft.", "fields": ["sample complexity", "architecture", "reuse", "lifelong learning", "reinforcement learning"], "abstract": "The ability to reuse or transfer knowledge from one task to another in lifelong learning problems, such as Minecraft, is one of the major challenges faced in AI. Reusing knowledge across tasks is crucial to solving tasks efficiently with lower sample complexity. We provide a Reinforcement Learning agent with the ability to transfer knowledge by learning reusable skills, a type of temporally extended action (also known as Options (Sutton et. al. 1999)). The agent learns reusable skills to solve tasks in Minecraft, a popular video game which is an unsolved and high-dimensional lifelong learning problem. These reusable skills, which we refer to as Deep Skill Networks (DSNs), are then incorporated into our novel Hierarchical Deep Reinforcement Learning Network (H-DRLN) architecture. The H-DRLN, a hierarchical extension of Deep Q-Networks, learns to efficiently solve tasks by reusing knowledge from previously learned DSNs. The DSNs are incorporated into the H-DRLN using two techniques: (1) a DSN array and (2) skill distillation, our novel variation of policy distillation (Rusu et. al. 2015) for learning skills. Skill distillation enables the H-DRLN to scale in lifelong learning, by accumulating knowledge and encapsulating multiple reusable skills into a single distilled network. The H-DRLN exhibits superior performance and lower learning sample complexity (by taking advantage of temporally extended actions) compared to the regular Deep Q Network (Mnih et. al. 2015) in sub-domains of Minecraft. We also show the potential to transfer knowledge between related Minecraft tasks without any additional learning.", "citation": "Citations (73)", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Chen Tessler.....http://dblp.org/pers/hd/t/Tessler:Chen", "Shahar Givony.....http://dblp.org/pers/hd/g/Givony:Shahar", "Tom Zahavy.....http://dblp.org/pers/hd/z/Zahavy:Tom", "Daniel J. Mankowitz.....http://dblp.org/pers/hd/m/Mankowitz:Daniel_J=", "Shie Mannor.....http://dblp.org/pers/hd/m/Mannor:Shie"], "conf": "aaai", "year": "2017", "pages": 9}