{"title": "Real-Time Video Super-Resolution with Spatio-Temporal Networks and Motion Compensation.", "fields": ["superresolution", "exploit", "motion compensation", "convolutional neural network", "convolution"], "abstract": "Convolutional neural networks have enabled accurate image super-resolution in real-time. However, recent attempts to benefit from temporal correlations in video super-resolution have been limited to naive or inefficient architectures. In this paper, we introduce spatio-temporal sub-pixel convolution networks that effectively exploit temporal redundancies and improve reconstruction accuracy while maintaining real-time speed. Specifically, we discuss the use of early fusion, slow fusion and 3D convolutions for the joint processing of multiple consecutive video frames. We also propose a novel joint motion compensation and video super-resolution algorithm that is orders of magnitude more efficient than competing methods, relying on a fast multi-resolution spatial transformer module that is end-to-end trainable. These contributions provide both higher accuracy and temporally more consistent videos, which we confirm qualitatively and quantitatively. Relative to single-frame models, spatio-temporal networks can either reduce the computational cost by 30% whilst maintaining the same quality or provide a 0.2dB gain for a similar computational cost. Results on publicly available datasets demonstrate that the proposed algorithms surpass current state-of-the-art performance in both accuracy and efficiency.", "citation": "Citations (13)", "year": "2017", "departments": ["Twitter", "Twitter", "Twitter", "Twitter", "Twitter"], "conf": "cvpr", "authors": ["Jose Caballero.....http://dblp.org/pers/hd/c/Caballero:Jose", "Christian Ledig.....http://dblp.org/pers/hd/l/Ledig:Christian", "Andrew P. Aitken.....http://dblp.org/pers/hd/a/Aitken:Andrew_P=", "Alejandro Acosta.....http://dblp.org/pers/hd/a/Acosta:Alejandro", "Johannes Totz.....http://dblp.org/pers/hd/t/Totz:Johannes", "Zehan Wang.....http://dblp.org/pers/hd/w/Wang:Zehan", "Wenzhe Shi.....http://dblp.org/pers/hd/s/Shi:Wenzhe"], "pages": 10}