{"title": "AutoLock: Why Cache Attacks on ARM Are Harder Than You Think.", "fields": ["microarchitecture", "arm architecture", "vulnerability assessment", "cache", "mobile device"], "abstract": "Attacks on the microarchitecture of modern processors have become a practical threat to security and privacy in desktop and cloud computing. Recently, cache attacks have successfully been demonstrated on ARM based mobile devices, suggesting they are as vulnerable as their desktop or server counterparts. In this work, we show that previous literature might have left an overly pessimistic conclusion of ARM's security as we unveil AutoLock: an internal performance enhancement found in inclusive cache levels of ARM processors that adversely affects Evict+Time, Prime+Probe, and Evict+Reload attacks. AutoLock's presence on system-on-chips (SoCs) is not publicly documented, yet knowing that it is implemented is vital to correctly assess the risk of cache attacks. We therefore provide a detailed description of the feature and propose three ways to detect its presence on actual SoCs. We illustrate how AutoLock impedes cross-core cache evictions, but show that its effect can also be compensated in a practical attack. Our findings highlight the intricacies of cache attacks on ARM and suggest that a fair and comprehensive vulnerability assessment requires an in-depth understanding of ARM's cache architectures and rigorous testing across a broad range of ARM based devices.", "citation": "Citations (1)", "year": "2017", "departments": ["Worcester Polytechnic Institute", "Fraunhofer Society", "Worcester Polytechnic Institute", "Fraunhofer Society"], "conf": "uss", "authors": ["Marc Green.....http://dblp.org/pers/hd/g/Green:Marc", "Leandro Rodrigues Lima.....http://dblp.org/pers/hd/l/Lima:Leandro_Rodrigues", "Andreas Zankl.....http://dblp.org/pers/hd/z/Zankl:Andreas", "Gorka Irazoqui.....http://dblp.org/pers/hd/i/Irazoqui:Gorka", "Johann Heyszl.....http://dblp.org/pers/hd/h/Heyszl:Johann", "Thomas Eisenbarth.....http://dblp.org/pers/hd/e/Eisenbarth:Thomas"], "pages": 17}