{"title": "Variable-Version Lovász Local Lemma: Beyond Shearer's Bound.", "fields": ["random regular graph", "lovasz local lemma", "complement graph", "cubic graph", "forbidden graph characterization"], "abstract": "A tight criterion under which the abstract version Lovász Local Lemma (abstract-LLL) holds was given by Shearer [41] decades ago. However, little is known about that of the variable version LLL (variable-LLL) where events are generated by independent random variables, though variable- LLL naturally models and is enough for almost all applications of LLL. We introduce a necessary and sufficient criterion for variable-LLL, in terms of the probabilities of the events and the event-variable graph specifying the dependency among the events. Based on this new criterion, we obtain boundaries for two families of event-variable graphs, namely, cyclic and treelike bigraphs. These are the first two non-trivial cases where the variable-LLL boundary is fully determined. As a byproduct, we also provide a universal constructive method to find a set of events whose union has the maximum probability, given the probability vector and the event-variable graph.Though it is #P-hard in general to determine variable- LLL boundaries, we can to some extent decide whether a gap exists between a variable-LLL boundary and the corresponding abstract-LLL boundary. In particular, we show that the gap existence can be decided without solving Shearer’s conditions or checking our variable-LLL criterion. Equipped with this powerful theorem, we show that there is no gap if the base graph of the event-variable graph is a tree, while gap appears if the base graph has an induced cycle of length at least 4. The problem is almost completely solved except when the base graph has only 3-cliques, in which case we also get partial solutions.A set of reduction rules are established that facilitate to infer gap existence of a event-variable graph from known ones. As an application, various event-variable graphs, in particular combinatorial ones, are shown to be gapful/gapless.", "citation": "Citations (1)", "departments": ["Chinese Academy of Sciences", "ETH Zurich", "Chinese Academy of Sciences"], "authors": ["Kun He.....http://dblp.org/pers/hd/h/He_0011:Kun", "Liang Li.....http://dblp.org/pers/hd/l/Li:Liang", "Xingwu Liu.....http://dblp.org/pers/hd/l/Liu:Xingwu", "Yuyi Wang.....http://dblp.org/pers/hd/w/Wang:Yuyi", "Mingji Xia.....http://dblp.org/pers/hd/x/Xia:Mingji"], "conf": "focs", "year": "2017", "pages": 12}