{"title": "Modeling the Resource Requirements of Convolutional Neural Networks on Mobile Devices.", "fields": ["deep learning", "cache", "convolutional neural network", "cuda", "profiling"], "abstract": "Convolutional Neural Networks (CNNs) have revolutionized the research in computer vision, due to their ability to capture complex patterns, resulting in high inference accuracies. However, the increasingly complex nature of these neural networks means that they are particularly suited for server computers with powerful GPUs. We envision that deep learning applications will be eventually and widely deployed on mobile devices,  e.g. , smartphones, self-driving cars, and drones. Therefore, in this paper, we aim to understand the resource requirements (time, memory) of CNNs on mobile devices. First, by deploying several popular CNNs on mobile CPUs and GPUs, we measure and analyze the performance and resource usage for every layer of the CNNs. Our findings point out the potential ways of optimizing the performance on mobile devices. Second, we model the resource requirements of the different CNN computations. Finally, based on the measurement, profiling, and modeling, we build and evaluate our modeling tool,  Augur , which takes a CNN configuration (descriptor) as the input and estimates the compute time and resource usage of the CNN, to give insights about whether and how efficiently a CNN can be run on a given mobile platform. In doing so Augur tackles several challenges: ( i ) how to overcome profiling and measurement overhead; ( ii ) how to capture the variance in different mobile platforms with different processors, memory, and cache sizes; and ( iii ) how to account for the variance in the number, type and size of layers of the different CNN configurations.", "citation": "Citations (2)", "departments": ["Peking University", "IBM", "United States Army Research Laboratory", "Pennsylvania State University"], "authors": ["Zongqing Lu.....http://dblp.org/pers/hd/l/Lu:Zongqing", "Swati Rallapalli.....http://dblp.org/pers/hd/r/Rallapalli:Swati", "Kevin S. Chan.....http://dblp.org/pers/hd/c/Chan:Kevin_S=", "Thomas F. La Porta.....http://dblp.org/pers/hd/p/Porta:Thomas_F=_La"], "conf": "mm", "year": "2017", "pages": 9}