{"title": "\"I've been manipulated!\": Designing Second Screen Experiences for Critical Viewing of Reality TV.", "fields": ["critical thinking", "social media", "welfare", "second screen", "welfare reform"], "abstract": "The recent proliferation of a reality TV genre that focusses on welfare recipients has led to concerns that prime-time media experiences are exacerbating misconceptions, and stifling critical debate, around major societal issues such as welfare reform and poverty. Motivated by arguments that 'second screening' practices offer opportunities to engage viewers with issues of political concern, we describe the design and evaluation of two smartphone apps that facilitate and promote more critical live-viewing of reality TV. Our apps,  Spotting Guide  and  Moral Compass , encourage users to identify, categorise, tag and filter patterns and tropes within reality TV, as well as reinterpret social media posts associated with their broadcast. We show that such interactions encourage critical thinking around typical editing and production techniques and foster co-discussion and reflection amongst viewers. We discuss, more broadly, how these interactions encourage users to identify the wider consequences and framings of reality TV, and offer implications and considerations for design that provokes criticality and reflection in second screening contexts.", "citation": "Citations (1)", "year": "2017", "departments": ["Northumbria University", "Northumbria University", "Newcastle University", "University of Bath", "Newcastle University"], "conf": "chi", "authors": ["Tom Feltwell.....http://dblp.org/pers/hd/f/Feltwell:Tom", "Gavin Wood.....http://dblp.org/pers/hd/w/Wood:Gavin", "Kiel Long.....http://dblp.org/pers/hd/l/Long:Kiel", "Phillip Brooker.....http://dblp.org/pers/hd/b/Brooker:Phillip", "Tom Schofield.....http://dblp.org/pers/hd/s/Schofield:Tom", "Ioannis Petridis.....http://dblp.org/pers/hd/p/Petridis:Ioannis", "Julie Barnett.....http://dblp.org/pers/hd/b/Barnett:Julie", "John Vines.....http://dblp.org/pers/hd/v/Vines:John", "Shaun W. Lawson.....http://dblp.org/pers/hd/l/Lawson:Shaun_W="], "pages": 12}