{"title": "Data Breaches, Phishing, or Malware?: Understanding the Risks of Stolen Credentials.", "fields": ["phishing", "credential", "online identity", "password", "data breach"], "abstract": "In this paper, we present the first longitudinal measurement study of the underground ecosystem fueling credential theft and assess the risk it poses to millions of users. Over the course of March, 2016--March, 2017, we identify 788,000 potential victims of off-the-shelf keyloggers; 12.4 million potential victims of phishing kits; and 1.9 billion usernames and passwords exposed via data breaches and traded on blackmarket forums. Using this dataset, we explore to what degree the stolen passwords---which originate from thousands of online services---enable an attacker to obtain a victim's valid email credentials---and thus complete control of their online identity due to transitive trust. Drawing upon Google as a case study, we find 7--25% of exposed passwords match a victim's Google account. For these accounts, we show how hardening authentication mechanisms to include additional risk signals such as a user's historical geolocations and device profiles helps to mitigate the risk of hijacking. Beyond these risk metrics, we delve into the global reach of the miscreants involved in credential theft and the blackhat tools they rely on. We observe a remarkable lack of external pressure on bad actors, with phishing kit playbooks and keylogger capabilities remaining largely unchanged since the mid-2000s.", "citation": "Citations (7)", "year": "2017", "departments": ["Google", "University of California, Berkeley", "Google", "Google", "Google"], "conf": "ccs", "authors": ["Kurt Thomas.....http://dblp.org/pers/hd/t/Thomas:Kurt", "Frank Li.....http://dblp.org/pers/hd/l/Li:Frank", "Ali Zand.....http://dblp.org/pers/hd/z/Zand:Ali", "Jacob Barrett.....http://dblp.org/pers/hd/b/Barrett:Jacob", "Juri Ranieri.....http://dblp.org/pers/hd/r/Ranieri:Juri", "Luca Invernizzi.....http://dblp.org/pers/hd/i/Invernizzi:Luca", "Yarik Markov.....http://dblp.org/pers/hd/m/Markov:Yarik", "Oxana Comanescu.....http://dblp.org/pers/hd/c/Comanescu:Oxana", "Vijay Eranti.....http://dblp.org/pers/hd/e/Eranti:Vijay", "Angelika Moscicki.....http://dblp.org/pers/hd/m/Moscicki:Angelika", "Daniel Margolis.....http://dblp.org/pers/hd/m/Margolis:Daniel", "Vern Paxson.....http://dblp.org/pers/hd/p/Paxson:Vern", "Elie Bursztein.....http://dblp.org/pers/hd/b/Bursztein:Elie"], "pages": 14}