{"title": "Automated Personalized Feedback in Introductory Java Programming MOOCs.", "fields": ["small set", "functional testing", "computational thinking", "software verification", "software bug"], "abstract": "Currently, there is a \"boom\" in introductory programming courses to help students develop their computational thinking skills. Providing timely, personalized feedback that makes students reflect about what and why they did correctly or incorrectly is critical in such courses. However, the limited number of instructors and the great volume of submissions instructors need to assess, especially in Massive Open Online Courses (MOOCs), prove this task a challenge. One solution is to hire graders or create peer discussions among students, however, feedback may be too general, incomplete or even incorrect. Automatic techniques focus on: a) Functional testing, in which feedback usually does not sufficiently guide novices, b) Software verification to find code bugs, which may confuse novices since these tools usually skip true errors or produce false errors, and c) Comparing using reference solutions, in which a large amount of reference solutions or pre-existing correct submissions are usually required. This paper presents a semantic-aware technique to provide personalized feedback that aims to mimic an instructor looking for code snippets in student submissions. These snippets are modeled as subgraph patterns with natural language feedback attached to them. Submissions are transformed into extended program dependence graphs combining control and data flows. We leverage subgraph matching techniques to compute the adequate personalized feedback. Also, constraints correlating patterns allow performing fine-grained assessments. We have evaluated our method on several introductory programming assignments and a large number of submissions. Our technique delivered personalized feedback in milliseconds using a small set of patterns, which makes it appealing in real-world settings.", "citation": "Citations (4)", "departments": ["Rochester Institute of Technology", "Rochester Institute of Technology"], "authors": ["Victor J. Marin.....http://dblp.org/pers/hd/m/Marin:Victor_J=", "Tobin Pereira.....http://dblp.org/pers/hd/p/Pereira:Tobin", "Srinivas Sridharan.....http://dblp.org/pers/hd/s/Sridharan:Srinivas", "Carlos R. Rivero.....http://dblp.org/pers/hd/r/Rivero:Carlos_R="], "conf": "icde", "year": "2017", "pages": 12}