{"title": "Binarized Mode Seeking for Scalable Visual Pattern Discovery.", "fields": ["binary code", "discriminative model", "binary constraint", "mean shift", "binary number"], "abstract": "This paper studies visual pattern discovery in large-scale image collections via binarized mode seeking, where images can only be represented as binary codes for efficient storage and computation. We address this problem from the perspective of binary space mode seeking. First, a binary mean shift (bMS) is proposed to discover frequent patterns via mode seeking directly in binary space. The binomial-based kernel and binary constraint are introduced for binarized analysis. Second, we further extend bMS to a more general form, namely contrastive binary mean shift (cbMS), which maximizes the contrastive density in binary space, for finding informative patterns that are both frequent and discriminative for the dataset. With the binarized algorithm and optimization, our methods demonstrate significant computation (50×) and storage (32×) improvement compared to standard techniques operating in Euclidean space, while the performance does not largely degenerate. Furthermore, cbMS discovers more informative patterns by suppressing low discriminative modes. We evaluate our methods on both annotated ILSVRC (1M images) and un-annotated blind Flickr (10M images) datasets with million scale images, which demonstrates both the scalability and effectiveness of our algorithms for discovering frequent and informative patterns in large scale collection.", "citation": "Citations (2)", "year": "2017", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "cvpr", "authors": ["Wei Zhang.....http://dblp.org/pers/hd/z/Zhang:Wei", "Xiaochun Cao.....http://dblp.org/pers/hd/c/Cao:Xiaochun", "Rui Wang.....http://dblp.org/pers/hd/w/Wang_0032:Rui", "Yuanfang Guo.....http://dblp.org/pers/hd/g/Guo:Yuanfang", "Zhineng Chen.....http://dblp.org/pers/hd/c/Chen:Zhineng"], "pages": 9}