{"title": "Detecting aged deterioration of a radio base station map for wi-fi positioning.", "fields": ["global positioning system", "standard deviation", "radio base station", "base station", "relocation"], "abstract": "Currently GPS is utilized for localization but is not reliable indoors or underground where its signals cannot reach. Instead, localization using Wi-Fi is investigated in the field of indoor positioning. Wi-Fi localization is performed using a radio model created by observed information collected beforehand; however, the model deteriorates over-time as Radio Base Stations (RBS) appear, disappear, and are relocated. As a result, localization accuracy decreases. Accuracy of positioning is affected by RBS and the number of RBS used for localization, thus, updating the model is required whenever deterioration occurs. There is no way to detect deterioration and necessity to update. This research investigates a method to detect such deterioration only by analyzing logs collected from navigation applications. Appearance and disappearance of RBS can be detected by analyzing observed date with its interval related to its average and standard deviation. Relocation of RBS can be detected by finding change-point of RBS's co-occurrence with other RBS. As results, it is demonstrated that RBS which possibly appears and/or disappears can be specified, if observed over certain days. It is also demonstrated that RBS which possibly be relocated can be specified by finding the best threshold.", "citation": "Not cited", "departments": ["Ritsumeikan University", "Ritsumeikan University", "Yahoo!", "Ritsumeikan University", "Ritsumeikan University"], "authors": ["Makiko Kawanaka.....http://dblp.org/pers/hd/k/Kawanaka:Makiko", "Kohei Yamamoto.....http://dblp.org/pers/hd/y/Yamamoto:Kohei", "Kota Tsubouchi.....http://dblp.org/pers/hd/t/Tsubouchi:Kota", "Kazuya Murao.....http://dblp.org/pers/hd/m/Murao:Kazuya", "Masahiro Mochizuki.....http://dblp.org/pers/hd/m/Mochizuki:Masahiro", "Nobuhiko Nishio.....http://dblp.org/pers/hd/n/Nishio:Nobuhiko"], "conf": "huc", "year": "2017", "pages": 10}