{"title": "Designing vector-friendly compact BLAS and LAPACK kernels.", "fields": ["vectorization", "solver", "basic linear algebra subprograms", "speedup", "simd"], "abstract": "Many applications, such as PDE based simulations and machine learning, apply  blas/lapack  routines to large groups of small matrices. While existing batched  blas  APIs provide meaningful speedup for this problem type, a non-canonical data layout enabling cross-matrix vectorization may provide further significant speedup. In this paper, we propose a new compact data layout that interleaves matrices in blocks according to the SIMD vector length. We combine this compact data layout with a new interface to  blas/lapack  routines that can be used within a hierarchical parallel application. Our layout provides up to 14X, 45X, and 27X speedup against OpenMP loops around optimized  dgemm ,  dtrsm  and  dgetrf  kernels, respectively, on the Intel Knights Landing architecture. We discuss the compact batched  blas/lapack  implementations in two libraries, KokkosKernels and Intel ®  Math Kernel Library. We demonstrate the APIs in a line solver for coupled PDEs. Finally, we present detailed performance analysis of our kernels.", "citation": "Citations (2)", "year": "2017", "departments": ["Sandia National Laboratories", "Intel", "Sandia National Laboratories", "Sandia National Laboratories", "Sandia National Laboratories"], "conf": "sc", "authors": ["Kyungjoo Kim.....http://dblp.org/pers/hd/k/Kim:Kyungjoo", "Timothy B. Costa.....http://dblp.org/pers/hd/c/Costa:Timothy_B=", "Mehmet Deveci.....http://dblp.org/pers/hd/d/Deveci:Mehmet", "Andrew M. Bradley.....http://dblp.org/pers/hd/b/Bradley:Andrew_M=", "Simon D. Hammond.....http://dblp.org/pers/hd/h/Hammond:Simon_D=", "Murat Efe Guney.....http://dblp.org/pers/hd/g/Guney:Murat_Efe", "Sarah Knepper.....http://dblp.org/pers/hd/k/Knepper:Sarah", "Shane Story.....http://dblp.org/pers/hd/s/Story:Shane", "Sivasankaran Rajamanickam.....http://dblp.org/pers/hd/r/Rajamanickam:Sivasankaran"], "pages": 12}