{"title": "Perceiving accurate CSI phases with commodity WiFi devices.", "fields": ["channel state information", "received signal strength indication", "radio spectrum", "channel", "passband"], "abstract": "WiFi technology has gained a wide prevalence for not only wireless communication but also pervasive sensing. A wide variety of emerging applications leverage accurate measurements of the Channel State Information (CSI) information obtained from commodity WiFi devices. Due to hardware imperfection of commodity WiFi devices, the frequency response of internal signal processing circuit is mixed with the real channel frequency response in passband, which makes deriving accurate channel frequency response from CSI measurements a challenging task. In this paper, we identify non-negligible non-linear CSI phase errors and report that IQ imbalance is the root source of non-linear CSI phase errors. We conduct intensive analysis on the characteristics of such non-linear errors and find that such errors are prevalent among various WiFi devices. Furthermore, they are rather stable along time and the received signal strength indication (RSSI) but sensitive to frequency bands used between a transmission pair. Based on these key observations, we propose new calibration methods to compensate both non-linear and linear CSI phase errors. We demonstrate the efficacy of the proposed methods by applying them in CSI splicing. Results of extensive real-world experiments indicate that accurate CSI phase measurements can significantly improve the performance of splicing and the stability of the derived power delay profiles (PDPs).", "citation": "Not cited", "year": "2017", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Donghua University"], "conf": "infocom", "authors": ["Yiwei Zhuo.....http://dblp.org/pers/hd/z/Zhuo:Yiwei", "Hongzi Zhu.....http://dblp.org/pers/hd/z/Zhu:Hongzi", "Hua Xue.....http://dblp.org/pers/hd/x/Xue:Hua", "Shan Chang.....http://dblp.org/pers/hd/c/Chang:Shan"], "pages": 9}