{"title": "From In-Place Updates to In-Place Appends: Revisiting Out-of-Place Updates on Flash.", "fields": ["write amplification", "byte", "nand gate", "page layout", "online transaction processing"], "abstract": "Under update intensive workloads (TPC, LinkBench) small updates dominate the write behavior, e.g. 70% of all updates change less than 10 bytes across all TPC OLTP workloads. These are typically performed as in-place updates and result in random writes in page-granularity, causing major write-overhead on Flash storage, a write amplification of several hundred times and lower device longevity.   In this paper we propose an approach that transforms those small in-place updates into small update deltas that are appended to the original page. We utilize the commonly ignored fact that modern Flash memories (SLC, MLC, 3D NAND) can handle appends to already programmed physical pages by using various low-level techniques such as ISPP to avoid expensive erases and page migrations. Furthermore, we extend the traditional NSM page-layout with a delta-record area that can absorb those small updates. We propose a scheme to control the write behavior as well as the space allocation and sizing of database pages.   The proposed approach has been implemented under Shore- MT and evaluated on real Flash hardware (OpenSSD) and a Flash emulator. Compared to In-Page Logging [21] it performs up to 62% less reads and writes and up to 74% less erases on a range of workloads. The experimental evaluation indicates: (i) significant reduction of erase operations resulting in twice the longevity of Flash devices under update-intensive workloads; (ii) 15%-60% lower read/write I/O latencies; (iii) up to 45% higher transactional throughput; (iv) 2x to 3x reduction in overall write amplification.", "citation": "Citations (3)", "year": "2017", "departments": ["Technische Universität Darmstadt", "Reutlingen University", "Technische Universität Darmstadt", "Technische Universität Darmstadt"], "conf": "sigmod", "authors": ["Sergey Hardock.....http://dblp.org/pers/hd/h/Hardock:Sergey", "Ilia Petrov.....http://dblp.org/pers/hd/p/Petrov:Ilia", "Robert Gottstein.....http://dblp.org/pers/hd/g/Gottstein:Robert", "Alejandro P. Buchmann.....http://dblp.org/pers/hd/b/Buchmann:Alejandro_P="], "pages": 16}