{"title": "The pebbling comonad in Finite Model Theory.", "fields": ["elementary equivalence", "monad", "finite model theory", "morphism"], "abstract": "Pebble games are a powerful tool in the study of finite model theory, constraint satisfaction and database theory. Monads and comonads are basic notions of category theory which are widely used in semantics of computation and in modern functional programming. We show that existential k-pebble games have a natural comonadic formulation. Winning strategies for Duplicator in the k-pebble game for structures A and B are equivalent to morphisms from A to B in the coKleisli category for this comonad. This leads on to comonadic characterisations of a number of central concepts in Finite Model Theory: • Isomorphism in the co-Kleisli category characterises elementary equivalence in the k-variable logic with counting quantifiers. • Symmetric games corresponding to equivalence in full k-variable logic are also characterized. • The treewidth of a structure A is characterised in terms of its coalgebra number: the least k for which there is a coalgebra structure on A for the k-pebbling comonad. • Co-Kleisli morphisms are used to characterize strong consistency, and to give an account of a Cai-Furer-Immerman construction. • The k-pebbling comonad is also used to give semantics to a novel modal operator. These results lay the basis for some new and promising connections between two areas within logic in computer science which have largely been disjoint: (1) finite and algorithmic model theory, and (2) semantics and categorical structures of computation.", "citation": "Citations (2)", "departments": ["University of Oxford", "University of Cambridge", "University of Cambridge"], "authors": ["Samson Abramsky.....http://dblp.org/pers/hd/a/Abramsky:Samson", "Anuj Dawar.....http://dblp.org/pers/hd/d/Dawar:Anuj", "Pengming Wang.....http://dblp.org/pers/hd/w/Wang:Pengming"], "conf": "lics", "year": "2017", "pages": 12}