{"title": "Massively Parallel Processing of Whole Genome Sequence Data: An In-Depth Performance Study.", "fields": ["genomics", "massively parallel", "whole genome sequencing", "big data", "speedup"], "abstract": "This paper presents a joint effort between a group of computer scientists and bioinformaticians to take an important step towards a general big data platform for genome analysis pipelines. The key goals of this study are to  develop a thorough understanding of the strengths and limitations of big data technology for genomic data analysis, and to identify the key questions that the research community could address  to realize the vision of personalized genomic medicine. Our platform, called Gesall, is based on the new \"Wrapper Technology\" that supports existing genomic data analysis programs in their native forms, without having to rewrite them. To do so, our system provides several layers of software, including a new Genome Data Parallel Toolkit (GDPT), which can be used to \"wrap\" existing data analysis programs. This platform offers a concrete context for evaluating big data technology for genomics: we report on super-linear speedup and sublinear speedup for various tasks, as well as the reasons why a parallel program could produce different results from those of a serial program. These results lead to key research questions that require a synergy between genomics scientists and computer scientists to find solutions.", "citation": "Citations (3)", "year": "2017", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "New York Genome ... k City, NY, USA", "New York Genome ... k City, NY, USA", "New York Genome ... k City, NY, USA"], "conf": "sigmod", "authors": ["Abhishek Roy.....http://dblp.org/pers/hd/r/Roy:Abhishek", "Yanlei Diao.....http://dblp.org/pers/hd/d/Diao:Yanlei", "Uday Evani.....http://dblp.org/pers/hd/e/Evani:Uday", "Avinash Abhyankar.....http://dblp.org/pers/hd/a/Abhyankar:Avinash", "Clinton Howarth.....http://dblp.org/pers/hd/h/Howarth:Clinton", "Rémi Le Priol.....http://dblp.org/pers/hd/p/Priol:R=eacute=mi_Le", "Toby Bloom.....http://dblp.org/pers/hd/b/Bloom:Toby"], "pages": 16}