{"title": "Beyond Human-level License Plate Super-resolution with Progressive Vehicle Search and Domain Priori GAN.", "fields": ["discriminator", "computer vision", "superresolution", "license", "kernel"], "abstract": "In this paper, we address the challenging problem of vehicle license plate image super-resolution. Different from existing image super-resolution approaches only resorted to one single image, we propose to leverage complementary information from multiple images to recover the license plate numbers. To achieve this goal, we design a principled license plate images super-resolution framework which is composed of two components: progressive vehicle search and Domain Priori GAN (DP-GAN). Particularly, we design a null space based progressive vehicle search approach to retrieve the relevant images captured by different cameras given one vehicle with a low-resolution license plate. To handle the extremely varied license plate images caused by different sensors, times, depths, and viewpoints, we also propose a DP-GAN framework to generate multiple spatial correspondences and high-resolution plate images. In the generator network of DP-GAN, a license plate synthesis pipeline is exploited to generate the nearly canonical license plates. In the discriminator network, a spatial split layer is designed to simultaneously preserve the global and local manufacture standards of the license plate. Finally, a multiple images super-resolution GAN is exploited to combine all the synthetic license plates into one high-resolution image. Different from previous super-resolution criteria mainly focus on pixel-level detail recovery condition, we leverage the downstream tasks, i.e. license plate recognition and vehicle search as criteria. The results on a new collected real-world dataset demonstrate that the proposed method achieves the beyond human-level license plate super-resolution performance for automatic license plate recognition and vehicle search.", "citation": "Not cited", "departments": ["Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications"], "authors": ["Wu Liu.....http://dblp.org/pers/hd/l/Liu:Wu", "Xinchen Liu.....http://dblp.org/pers/hd/l/Liu:Xinchen", "Huadong Ma.....http://dblp.org/pers/hd/m/Ma:Huadong", "Peng Cheng.....http://dblp.org/pers/hd/c/Cheng:Peng"], "conf": "mm", "year": "2017", "pages": 9}