{"title": "Adaptive Low-Rank Multi-Label Active Learning for Image Classification.", "fields": ["contextual image classification", "training set", "redundancy", "noisy data", "active learning"], "abstract": "Multi-label active learning for image classification has attracted great attention over recent years and a lot of relevant works are published continuously. However, there still remain some problems that need to be solved, such as existing multi-label active learning algorithms do not reflect on the cleanness of sample data and their ways on label correlation mining are defective. For one thing, sample data is usually contaminated in reality, which disturbs the estimation of data distribution and further hinders the model training. For another, previous approaches for label relationship exploration are purely based on the observed label distribution of an incomplete training set, which cannot provide sufficiently efficient information. To address these issues, we propose a novel adaptive low-rank multi-label active learning algorithm, called LRMAL. Specifically, we first use low-rank matrix recovery to learn an effective low-rank feature representation from the noisy data. In a subsequent sampling phase, we make use of its superiorities to evaluate the general informativeness of each unlabeled example-label pair. Based on an intrinsic mapping relation between the example space and the label space of a certain multi-label dataset, we recover the incomplete labels of a training set for a more comprehensive label correlation mining. Furthermore, to reduce the redundancy among the selected example-label pairs, we use a diversity measurement to diversify the sampled data. Finally, an effective sampling strategy is developed by integrating these two aspects of potential information with uncertainty based on an adaptive integration scheme. Experimental results demonstrate the effectiveness of our approach.", "citation": "Citations (1)", "departments": ["Washington University in St. Louis", "Soochow University", "University of Central Arkansas", "Soochow University", "Soochow University"], "authors": ["Jian Wu.....http://dblp.org/pers/hd/w/Wu_0002:Jian", "Anqian Guo.....http://dblp.org/pers/hd/g/Guo:Anqian", "Victor S. Sheng.....http://dblp.org/pers/hd/s/Sheng:Victor_S=", "Pengpeng Zhao.....http://dblp.org/pers/hd/z/Zhao:Pengpeng", "Zhiming Cui.....http://dblp.org/pers/hd/c/Cui:Zhiming", "Hua Li.....http://dblp.org/pers/hd/l/Li:Hua"], "conf": "mm", "year": "2017", "pages": 9}