{"title": "Union of Intersections (UoI) for Interpretable Data Driven Discovery and Prediction.", "fields": ["data set", "matrix decomposition", "small number", "model selection", "lasso"], "abstract": "The increasing size and complexity of scientific data could dramatically enhance discovery and prediction for basic scientific applications, e.g., neuroscience, genetics, systems biology, etc. Realizing this potential, however, requires novel statistical analysis methods that are both interpretable and predictive. We introduce the Union of Intersections (UoI) method, a flexible, modular, and scalable framework for enhanced model selection and estimation. The method performs model selection and model estimation through intersection and union operations, respectively. We show that UoI can satisfy the bi-criteria of low-variance and nearly unbiased estimation of a small number of interpretable features, while maintaining high-quality prediction accuracy. We perform extensive numerical investigation to evaluate a UoI algorithm ($UoI_{Lasso}$) on synthetic and real data. In doing so, we demonstrate the extraction of interpretable functional networks from human electrophysiology recordings as well as the accurate prediction of phenotypes from genotype-phenotype data with reduced features. We also show (with the $UoI_{L1Logistic}$ and $UoI_{CUR}$ variants of the basic framework) improved prediction parsimony for classification and matrix factorization on several benchmark biomedical data sets. These results suggest that methods based on UoI framework could improve interpretation and prediction in data-driven discovery across scientific fields.", "citation": "Not cited", "year": "2017", "departments": ["Lawrence Berkeley National Laboratory", "University of California, Berkeley", "University of California, Berkeley", "University of Minnesota", "Lawrence Berkeley National Laboratory"], "conf": "nips", "authors": ["Kristofer E. Bouchard.....http://dblp.org/pers/hd/b/Bouchard:Kristofer_E=", "Alejandro F. Bujan.....http://dblp.org/pers/hd/b/Bujan:Alejandro_F=", "Farbod Roosta-Khorasani.....http://dblp.org/pers/hd/r/Roosta=Khorasani:Farbod", "Shashanka Ubaru.....http://dblp.org/pers/hd/u/Ubaru:Shashanka", "Prabhat.....http://dblp.org/pers/hd/p/Prabhat:", "Antoine Snijders.....http://dblp.org/pers/hd/s/Snijders:Antoine", "Jian-Hua Mao.....http://dblp.org/pers/hd/m/Mao:Jian=Hua", "Edward Chang.....http://dblp.org/pers/hd/c/Chang:Edward", "Michael W. Mahoney.....http://dblp.org/pers/hd/m/Mahoney:Michael_W=", "Sharmodeep Bhattacharyya.....http://dblp.org/pers/hd/b/Bhattacharyya:Sharmodeep"], "pages": 9}