{"title": "On the Power of Statistical Zero Knowledge.", "fields": ["complexity class", "oracle", "zero knowledge proof", "communication complexity", "randomized algorithm"], "abstract": "We examine the power of statistical zero knowledge proofs (captured by the complexity class SZK) and their variants. First, we give the strongest known relativized evidence that SZK contains hard problems, by exhibiting an oracle relative to which SZK (indeed, even NISZK) is not contained in the class UPP, containing those problems solvable by randomized algorithms with unbounded error. This answers an open question of Watrous from 2002. Second, we lift this oracle separation to the setting of communication complexity, thereby answering a question of Göös et al. (ICALP 2016). Third, we give relativized evidence that perfect zero knowledge proofs (captured by the class PZK) are weaker than general zero knowledge proofs. Specifically, we exhibit oracles which separate SZK from PZK, NISZK from NIPZK and PZK from coPZK. The first of these results answers a question raised in 1991 by Aiello and Håstad (Information and Computation), and the second answers a question of Lovett and Zhang (2016). We also describe additional applications of these results outside of structural complexity.The technical core of our results is a stronger hardness amplification theorem for approximate degree, which roughly says that composing the gapped-majority function with any function of high approximate degree yields a function with high threshold degree.", "citation": "Citations (2)", "departments": ["Massachusetts Institute of Technology", "Tsinghua University", "Massachusetts Institute of Technology", "Georgetown University", "Massachusetts Institute of Technology"], "authors": ["Adam Bouland.....http://dblp.org/pers/hd/b/Bouland:Adam", "Lijie Chen.....http://dblp.org/pers/hd/c/Chen:Lijie", "Dhiraj Holden.....http://dblp.org/pers/hd/h/Holden:Dhiraj", "Justin Thaler.....http://dblp.org/pers/hd/t/Thaler:Justin", "Prashant Nalini Vasudevan.....http://dblp.org/pers/hd/v/Vasudevan:Prashant_Nalini"], "conf": "focs", "year": "2017", "pages": 12}