{"title": "Speed/Accuracy Trade-Offs for Modern Convolutional Object Detectors.", "fields": ["coco", "architecture", "object detection", "residual", "mobile device"], "abstract": "The goal of this paper is to serve as a guide for selecting a detection architecture that achieves the right speed/memory/accuracy balance for a given application and platform. To this end, we investigate various ways to trade accuracy for speed and memory usage in modern convolutional object detection systems. A number of successful systems have been proposed in recent years, but apples-toapples comparisons are difficult due to different base feature extractors (e.g., VGG, Residual Networks), different default image resolutions, as well as different hardware and software platforms. We present a unified implementation of the Faster R-CNN [30], R-FCN [6] and SSD [25] systems, which we view as meta-architectures and trace out the speed/accuracy trade-off curve created by using alternative feature extractors and varying other critical parameters such as image size within each of these meta-architectures. On one extreme end of this spectrum where speed and memory are critical, we present a detector that achieves real time speeds and can be deployed on a mobile device. On the opposite end in which accuracy is critical, we present a detector that achieves state-of-the-art performance measured on the COCO detection task.", "citation": "Citations (320)", "year": "2017", "departments": ["Google", "Google", "Google", "University of California, Irvine"], "conf": "cvpr", "authors": ["Jonathan Huang.....http://dblp.org/pers/hd/h/Huang:Jonathan", "Vivek Rathod.....http://dblp.org/pers/hd/r/Rathod:Vivek", "Chen Sun.....http://dblp.org/pers/hd/s/Sun:Chen", "Menglong Zhu.....http://dblp.org/pers/hd/z/Zhu:Menglong", "Anoop Korattikara.....http://dblp.org/pers/hd/k/Korattikara:Anoop", "Alireza Fathi.....http://dblp.org/pers/hd/f/Fathi:Alireza", "Ian Fischer.....http://dblp.org/pers/hd/f/Fischer:Ian", "Zbigniew Wojna.....http://dblp.org/pers/hd/w/Wojna:Zbigniew", "Yang Song.....http://dblp.org/pers/hd/s/Song:Yang", "Sergio Guadarrama.....http://dblp.org/pers/hd/g/Guadarrama:Sergio", "Kevin Murphy.....http://dblp.org/pers/hd/m/Murphy_0002:Kevin"], "pages": 2}