{"title": "Mind the Class Weight Bias: Weighted Maximum Mean Discrepancy for Unsupervised Domain Adaptation.", "fields": ["prior probability", "open problem", "domain adaptation", "expectation maximization algorithm", "kernel"], "abstract": "In domain adaptation, maximum mean discrepancy (MMD) has been widely adopted as a discrepancy metric between the distributions of source and target domains. However, existing MMD-based domain adaptation methods generally ignore the changes of class prior distributions, i.e., class weight bias across domains. This remains an open problem but ubiquitous for domain adaptation, which can be caused by changes in sample selection criteria and application scenarios. We show that MMD cannot account for class weight bias and results in degraded domain adaptation performance. To address this issue, a weighted MMD model is proposed in this paper. Specifically, we introduce class-specific auxiliary weights into the original MMD for exploiting the class prior probability on source and target domains, whose challenge lies in the fact that the class label in target domain is unavailable. To account for it, our proposed weighted MMD model is defined by introducing an auxiliary weight for each class in the source domain, and a classification EM algorithm is suggested by alternating between assigning the pseudo-labels, estimating auxiliary weights and updating model parameters. Extensive experiments demonstrate the superiority of our weighted MMD over conventional MMD for domain adaptation.", "citation": "Citations (12)", "year": "2017", "departments": ["Dalian University of Technology", "Dalian University of Technology"], "conf": "cvpr", "authors": ["Hongliang Yan.....http://dblp.org/pers/hd/y/Yan:Hongliang", "Yukang Ding.....http://dblp.org/pers/hd/d/Ding:Yukang", "Peihua Li.....http://dblp.org/pers/hd/l/Li:Peihua", "Qilong Wang.....http://dblp.org/pers/hd/w/Wang:Qilong", "Yong Xu.....http://dblp.org/pers/hd/x/Xu:Yong", "Wangmeng Zuo.....http://dblp.org/pers/hd/z/Zuo:Wangmeng"], "pages": 10}