{"title": "Cardiac Scan: A Non-contact and Continuous Heart-based User Authentication System.", "fields": ["fiducial marker", "liveness", "demodulation", "login session", "usability"], "abstract": "Continuous authentication is of great importance to maintain the security level of a system throughout the login session. The goal of this work is to investigate a trustworthy, continuous, and non-contact user authentication approach based on a heart-related biometric that works in a daily-life environment. To this end, we present a novel, continuous authentication system, namely  Cardiac Scan , based on geometric and non-volitional features of the cardiac motion. Cardiac motion is an automatic heart deformation caused by self-excitement of the cardiac muscle, which is unique to each user and is difficult (if not impossible) to counterfeit.  Cardiac Scan  features intrinsic liveness detection, unobtrusiveness, cost-effectiveness, and high usability. We prototype a remote, high-resolution cardiac motion sensing system based on the smart DC-coupled continuous-wave radar. Fiducial-based invariant identity descriptors of cardiac motion are extracted after the radar signal demodulation. We conduct a pilot study with 78 subjects to evaluate  Cardiac Scan  in  accuracy ,  authentication time ,  permanence ,  evaluation in complex conditions , and  vulnerability . Specifically,  Cardiac Scan  achieves 98.61% balanced accuracy (BAC) and 4.42% equal error rate (EER) in a real-world setup. We demonstrate that  Cardiac Scan  is a robust and usable continuous authentication system.", "citation": "Citations (4)", "departments": ["University at Buffalo", "University at Buffalo", "University at Buffalo", "University at Buffalo", "Texas Tech University"], "authors": ["Feng Lin.....http://dblp.org/pers/hd/l/Lin_0004:Feng", "Chen Song.....http://dblp.org/pers/hd/s/Song:Chen", "Yan Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yan", "Wenyao Xu.....http://dblp.org/pers/hd/x/Xu:Wenyao", "Changzhi Li.....http://dblp.org/pers/hd/l/Li:Changzhi", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui"], "conf": "mobicom", "year": "2017", "pages": 14}