{"title": "Exploring Consistent Preferences: Discrete Hashing with Pair-Exemplar for Scalable Landmark Search.", "fields": ["hash table", "dynamic perfect hashing", "discrete optimization", "universal hashing", "hash function"], "abstract": "Content-based visual landmark search (CBVLS) enjoys great importance in many practical applications. In this paper, we propose a novel discrete hashing with pair-exemplar (DHPE) to support scalable and efficient large-scale CBVLS. Our approach mainly solves two essential problems in scalable landmark hashing: 1) Intra-landmark visual diversity, and 2) Discrete optimization of hashing codes. Motivated by the characteristic of landmark, we explore the consistent preferences of tourists on landmark as pair-exemplars for scalable discrete hashing learning. In this paper, a pair-exemplar is comprised of a canonical view and the corresponding representative tags. Canonical view captures the key visual component of landmarks, and representative tags potentially involve landmark-specific semantics that can cope with the visual variations of intra-landmark. Based on pair-exemplars, a unified hashing learning framework is formulated to combine visual preserving with exemplar graph and the semantic guidance from representative tags. Further, to guarantee direct semantic transfer for hashing codes and remove information redundancy, we design a novel optimization method based on augmented Lagrange multiplier to explicitly deal with the discrete constraint, the bit-uncorrelated constraint and balance constraint. The whole learning process has linear computation complexity and enjoys desirable scalability. Experiments demonstrate the superior performance of DHPE compared with state-of-the-art methods.", "citation": "Citations (5)", "departments": ["University of Queensland", "University of Queensland", "Carnegie Mellon University", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China"], "authors": ["Lei Zhu.....http://dblp.org/pers/hd/z/Zhu_0002:Lei", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Xiaojun Chang.....http://dblp.org/pers/hd/c/Chang:Xiaojun", "Jingkuan Song.....http://dblp.org/pers/hd/s/Song:Jingkuan", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao"], "conf": "mm", "year": "2017", "pages": 9}