{"title": "Checks and balances: A tripartite public key infrastructure for secure web-based connections.", "fields": ["certificate management protocol", "public key infrastructure", "public key cryptography", "compromise", "certificate authority"], "abstract": "Recent real-world attacks against Certification Authorities (CAs) and fraudulently issued certificates arouse the public to rethink the security of public key infrastructure for web-based connections. To distribute the trust of CAs, notaries, as an independent party, are introduced to record certificates, and a client can request an audit proof of certificates from notaries directly. However, there are two challenges. On one hand, existing works consider the security of notaries insufficiently. Due to lack of systematic mutual verification, notaries might bring safety bottlenecks. On the other hand, the service of these works is not sustainable, when any party leaks its private key or fails. In this paper, we propose a Tripartite Public Key Infrastructure (TriPKI), using Certificates Authorities, Integrity Log Servers, and Domain Name Servers, to provide a basis for establishing secure SSL/TLS connections. Specifically, we apply checks-and balances among those three parties in the structure to make them verify mutually, which avoids any single party compromise. Furthermore, we design a collaborative certificate management scheme to provide sustainable services. The security analysis and experiment results demonstrate that our scheme is suitable for practical usage with moderate overhead.", "citation": "Not cited", "departments": ["Wuhan University", "Wuhan University", "University of Texas of the Permian Basin", "Arizona State University", "Collaborative I ... n, China 430072"], "authors": ["Jing Chen.....http://dblp.org/pers/hd/c/Chen_0003:Jing", "Shixiong Yao.....http://dblp.org/pers/hd/y/Yao:Shixiong", "Quan Yuan.....http://dblp.org/pers/hd/y/Yuan_0003:Quan", "Ruiying Du.....http://dblp.org/pers/hd/d/Du:Ruiying", "Guoliang Xue.....http://dblp.org/pers/hd/x/Xue:Guoliang"], "conf": "infocom", "year": "2017", "pages": 9}