{"title": "Robust Softmax Regression for Multi-class Classification with Self-Paced Learning.", "fields": ["weighting", "softmax function", "noisy data", "multiclass classification", "outlier"], "abstract": "Softmax regression, a generalization of Logistic regression (LR) in the setting of multi-class classification, has been widely used in many machine learning applications. However, the performance of softmax regression is extremely sensitive to the presence of noisy data and outliers. To address this issue, we propose a model of robust softmax regression (RoSR) originated from the self-paced learning (SPL) paradigm for multi-class classification. Concretely, RoSR equipped with the soft weighting scheme is able to evaluate the importance of each data instance. Then, data instances participate in the classification problem according to their weights. In this way, the influence of noisy data and outliers (which are typically with small weights) can be significantly reduced. However, standard SPL may suffer from the imbalanced class influence problem, where some classes may have little influence in the training process if their instances are not sensitive to the loss. To alleviate this problem, we design two novel soft weighting schemes that assign weights and select instances locally for each class. Experimental results demonstrate the effectiveness of the proposed methods.", "citation": "Citations (2)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China"], "authors": ["Yazhou Ren.....http://dblp.org/pers/hd/r/Ren:Yazhou", "Peng Zhao.....http://dblp.org/pers/hd/z/Zhao:Peng", "Yongpan Sheng.....http://dblp.org/pers/hd/s/Sheng:Yongpan", "Dezhong Yao.....http://dblp.org/pers/hd/y/Yao:Dezhong", "Zenglin Xu.....http://dblp.org/pers/hd/x/Xu:Zenglin"], "conf": "ijcai", "year": "2017", "pages": 7}