{"title": "DeepSD: Generating High Resolution Climate Change Projections through Single Image Super-Resolution.", "fields": ["downscaling", "deep learning", "convolutional neural network", "earth system science", "predictability"], "abstract": "The impacts of climate change are felt by most critical systems, such as infrastructure, ecological systems, and power-plants. However, contemporary Earth System Models (ESM) are run at spatial resolutions too coarse for assessing effects this localized. Local scale projections can be obtained using statistical downscaling, a technique which uses historical climate observations to learn a low-resolution to high-resolution mapping. Depending on statistical modeling choices, downscaled projections have been shown to vary significantly terms of accuracy and reliability. The spatio-temporal nature of the climate system motivates the adaptation of super-resolution image processing techniques to statistical downscaling. In our work, we present DeepSD, a generalized stacked super resolution convolutional neural network (SRCNN) framework for statistical downscaling of climate variables. DeepSD augments SRCNN with multi-scale input channels to maximize predictability in statistical downscaling. We provide a comparison with Bias Correction Spatial Disaggregation as well as three Automated-Statistical Downscaling approaches in downscaling daily precipitation from 1 degree (~100km) to 1/8 degrees (~12.5km) over the Continental United States. Furthermore, a framework using the NASA Earth Exchange (NEX) platform is discussed for downscaling more than 20 ESM models with multiple emission scenarios.", "citation": "Citations (4)", "departments": ["Northeastern University", "Ames Research Center", "Ames Research Center", "risQ Inc., Cambridge, MA, USA", "University Corp ... ey Bay, CA, USA"], "authors": ["Thomas Vandal.....http://dblp.org/pers/hd/v/Vandal:Thomas", "Evan Kodra.....http://dblp.org/pers/hd/k/Kodra:Evan", "Sangram Ganguly.....http://dblp.org/pers/hd/g/Ganguly:Sangram", "Andrew R. Michaelis.....http://dblp.org/pers/hd/m/Michaelis:Andrew_R=", "Ramakrishna R. Nemani.....http://dblp.org/pers/hd/n/Nemani:Ramakrishna_R=", "Auroop R. Ganguly.....http://dblp.org/pers/hd/g/Ganguly:Auroop_R="], "conf": "kdd", "year": "2017", "pages": 10}