{"title": "Conflict graph embedding for wireless network optimization.", "fields": ["wireless mesh network", "radio resource management", "graph embedding", "key distribution in wireless sensor networks", "feature vector"], "abstract": "With the dense deployment of wireless infrastructure such as radio towers and WiFi access points, wireless network optimization becomes very important for improving the network capacity and enhancing the communication quality of wireless links. Most optimization algorithms rely on the conflict graph to describe the interference situation. However, building a conflict graph requires exhaustive measurements of the whole network and the existing estimation approaches are static and inaccurate. In this paper, we propose a conflict graph embedding approach to assess network interference situations by representing the wireless nodes with low-dimensional vectors while preserving their conflict relationships. Specifically, our approach introduces a sliding-window based partial measurement method to sample the interference graph in the network, then adopts a learning algorithm to obtain the vector representation of the nodes, and then infers the interference situations by exploring the feature vectors. The proposed approach has been proved to be low measurement overhead, low computational cost, and self-adaptive, which is suitable for large-scale dynamic wireless networks. We illustrate that conflict graph embedding can be used for interference-aware wireless network optimizations. We conduct extensive experiments based on real wireless network datasets, which show the efficiency of the proposed approach.", "citation": "Not cited", "departments": ["Nanjing University", "Nanjing University", "Nanjing University of Aeronautics and Astronautics"], "authors": ["Wenzhong Li.....http://dblp.org/pers/hd/l/Li:Wenzhong", "Jinggong Zhang.....http://dblp.org/pers/hd/z/Zhang:Jinggong", "Yanchao Zhao.....http://dblp.org/pers/hd/z/Zhao:Yanchao"], "conf": "infocom", "year": "2017", "pages": 9}