{"title": "Zensei: Embedded, Multi-electrode Bioimpedance Sensing for Implicit, Ubiquitous User Recognition.", "fields": ["ubiquitous computing", "wireless", "authentication", "data collection", "personalization"], "abstract": "Interactions and connectivity is increasingly expanding to shared objects and environments, such as furniture, vehicles, lighting, and entertainment systems. For transparent personalization in such contexts, we see an opportunity for embedded recognition, to complement traditional, explicit authentication. We introduce Zensei, an implicit sensing system that leverages bio-sensing, signal processing and machine learning to classify uninstrumented users by their body's electrical properties. Zensei could allow many objects to recognize users. E.g., phones that unlock when held, cars that automatically adjust mirrors and seats, or power tools that restore user settings. We introduce wide-spectrum bioimpedance hardware that measures both amplitude and phase. It extends previous approaches through multi-electrode sensing and high-speed wireless data collection for embedded devices. We implement the sensing in devices and furniture, where unique electrode configurations generate characteristic profiles based on user's unique electrical properties. Finally, we discuss results from a comprehensive longitudinal 22-day data collection experiment with 46 subjects. Our analysis shows promising classification accuracy and low false acceptance rate.", "citation": "Citations (2)", "year": "2017", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Takram London,  ...  United Kingdom", "Takram London,  ...  United Kingdom"], "conf": "chi", "authors": ["Munehiko Sato.....http://dblp.org/pers/hd/s/Sato:Munehiko", "Rohan S. Puri.....http://dblp.org/pers/hd/p/Puri:Rohan_S=", "Alex Olwal.....http://dblp.org/pers/hd/o/Olwal:Alex", "Yosuke Ushigome.....http://dblp.org/pers/hd/u/Ushigome:Yosuke", "Lukas Franciszkiewicz.....http://dblp.org/pers/hd/f/Franciszkiewicz:Lukas", "Deepak Chandra.....http://dblp.org/pers/hd/c/Chandra:Deepak", "Ivan Poupyrev.....http://dblp.org/pers/hd/p/Poupyrev:Ivan", "Ramesh Raskar.....http://dblp.org/pers/hd/r/Raskar:Ramesh"], "pages": 14}