{"title": "Blotter: Low Latency Transactions for Geo-Replicated Storage.", "fields": ["codebase", "isolation", "weak consistency", "distributed transaction", "snapshot isolation"], "abstract": "Most geo-replicated storage systems use weak consistency to avoid the performance penalty of coordinating replicas in different data centers. This departure from strong semantics poses problems to application programmers, who need to address the anomalies enabled by weak consistency. In this paper we use a recently proposed isolation level, called Non-Monotonic Snapshot Isolation, to achieve ACID transactions with low latency. To this end, we present Blotter, a geo-replicated system that leverages these semantics in the design of a new concurrency control protocol that leaves a small amount of local state during reads to make commits more efficient, which is combined with a configuration of Paxos that is tailored for good performance in wide area settings. Read operations always run on the local data center, and update transactions complete in a small number of message steps to a subset of the replicas. We implemented Blotter as an extension to Cassandra. Our experimental evaluation shows that Blotter has a small overhead at the data center scale, and performs better across data centers when compared with our implementations of the core Spanner protocol and of Snapshot Isolation on the same codebase.", "citation": "Citations (1)", "departments": ["Google", "Universidade Nova de Lisboa", "Microsoft", "Universidade Nova de Lisboa", "NOVA LINCS & SU ... sboa, Portugal"], "authors": ["Henrique Moniz.....http://dblp.org/pers/hd/m/Moniz:Henrique", "João Leitão.....http://dblp.org/pers/hd/l/Leit=atilde=o_0001:Jo=atilde=o", "Ricardo J. Dias.....http://dblp.org/pers/hd/d/Dias:Ricardo_J=", "Johannes Gehrke.....http://dblp.org/pers/hd/g/Gehrke:Johannes", "Nuno M. Preguiça.....http://dblp.org/pers/hd/p/Pregui=ccedil=a:Nuno_M=", "Rodrigo Rodrigues.....http://dblp.org/pers/hd/r/Rodrigues:Rodrigo"], "conf": "www", "year": "2017", "pages": 10}