{"title": "Joint sensing duty cycle scheduling for heterogeneous coverage guarantee.", "fields": ["scheduling", "approximation algorithm", "binary logarithm", "duty cycle", "schedule"], "abstract": "In this paper we study the following problem: given a set of m sensors that collectively cover a set of n target points with heterogeneous coverage requirements (target j needs to be covered every fj slots), how to schedule the sensor duty cycles such that all coverage requirements are satisfied and the maximum number of sensors turned on at any time slot is minimized. The problem models varied real-world applications in which sensing tasks exhibit high discrepancy in coverage requirements — critical locations often need to be covered much more frequently. We provide multiple algorithms with best approximation ratio of O (log n + log m) for the maximum number of sensors to turn on, and bi-criteria algorithm with (α, β)-approximation factors with high probability, where the number of sensors turned on is an α = O(δ(log (n) + log(m))/β)-approximation of the optimal (satisfying all requirements) and the coverage requirement is a β-approximation; δ is the approximation ratio achievable in an appropriate instance of set multi-cover. When the sensor coverage exhibits extra geometric properties, the approximation ratios can be further improved. We also evaluated our algorithms via simulations and experiments on a camera testbed. The performance improvement (energy saving) is substantial compared to turning on all sensors all the time, or a random scheduling baseline.", "citation": "Not cited", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Kin Sum Liu.....http://dblp.org/pers/hd/l/Liu:Kin_Sum", "Tyler Mayer.....http://dblp.org/pers/hd/m/Mayer:Tyler", "Hao-Tsung Yang.....http://dblp.org/pers/hd/y/Yang:Hao=Tsung", "Esther M. Arkin.....http://dblp.org/pers/hd/a/Arkin:Esther_M=", "Jie Gao.....http://dblp.org/pers/hd/g/Gao:Jie", "Mayank Goswami.....http://dblp.org/pers/hd/g/Goswami:Mayank", "Matthew P. Johnson.....http://dblp.org/pers/hd/j/Johnson:Matthew_P=", "Nirman Kumar.....http://dblp.org/pers/hd/k/Kumar:Nirman", "Shan Lin.....http://dblp.org/pers/hd/l/Lin:Shan"], "conf": "infocom", "year": "2017", "pages": 9}