{"title": "Fast Failure Recovery for Main-Memory DBMSs on Multicores.", "fields": ["parallel database", "stored procedure", "degree of parallelism", "compile time", "transaction processing"], "abstract": "Main-memory database management systems (DBMS) can achieve excellent performance when processing massive volume of on-line transactions on modern multi-core machines. But existing durability schemes, namely, tuple-level and transaction-level logging-and-recovery mechanisms, either degrade the performance of transaction processing or slow down the process of failure recovery. In this paper, we show that, by exploiting application semantics, it is possible to achieve speedy failure recovery without introducing any costly logging overhead to the execution of concurrent transactions. We propose PACMAN, a parallel database recovery mechanism that is specifically designed for lightweight, coarse-grained transaction-level logging. PACMAN leverages a combination of static and dynamic analyses to parallelize the log recovery: at compile time, PACMAN decomposes stored procedures by carefully analyzing dependencies within and across programs; at recovery time, PACMAN exploits the availability of the runtime parameter values to attain an execution schedule with a high degree of parallelism. As such, recovery performance is remarkably increased. We evaluated PACMAN in a fully-fledged main-memory DBMS running on a 40-core machine. Compared to several state-of-the-art database recovery mechanisms, can significantly reduce recovery time without compromising the efficiency of transaction processing.", "citation": "Citations (1)", "year": "2017", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "conf": "sigmod", "authors": ["Yingjun Wu.....http://dblp.org/pers/hd/w/Wu:Yingjun", "Wentian Guo.....http://dblp.org/pers/hd/g/Guo:Wentian", "Chee-Yong Chan.....http://dblp.org/pers/hd/c/Chan:Chee=Yong", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee"], "pages": 15}