{"title": "Revisiting unsupervised learning for defect prediction.", "fields": ["empirical research", "exploit", "machine learning", "unsupervised learning", "software"], "abstract": "Collecting quality data from software projects can be time-consuming and expensive. Hence, some researchers explore â  unsupervisedâ   approaches to quality prediction that does not require labelled data. An alternate technique is to use â  supervisedâ   approaches that learn models from project data labelled with, say, â  defectiveâ   or â  not-defectiveâ  . Most researchers use these supervised models since, it is argued, they can exploit more knowledge of the projects.   At FSEâ  16, Yang et al. reported startling results where unsupervised defect predictors outperformed supervised predictors for effort-aware just-in-time defect prediction. If confirmed, these results would lead to a dramatic simplification of a seemingly complex task (data mining) that is widely explored in the software engineering literature.   This paper repeats and refutes those results as follows. (1) There is much variability in the efficacy of the Yang et al. predictors so even with their approach, some supervised data is required to prune weaker predictors away. (2) Their findings were grouped across  N  projects. When we repeat their analysis on a project-by-project basis, supervised predictors are seen to work better.   Even though this paper rejects the specific conclusions of Yang et al., we still endorse their general goal. In our our experiments, supervised predictors did not perform outstandingly better than unsupervised ones for effort-aware just-in-time defect prediction. Hence, they may indeed be some combination of unsupervised learners to achieve comparable performance to supervised ones. We therefore encourage others to work in this promising area.", "citation": "Citations (7)", "departments": ["North Carolina State University", "North Carolina State University"], "authors": ["Wei Fu.....http://dblp.org/pers/hd/f/Fu_0002:Wei", "Tim Menzies.....http://dblp.org/pers/hd/m/Menzies:Tim"], "conf": "sigsoft", "year": "2017", "pages": 12}