{"title": "What's in a Name?: Understanding Profile Name Reuse on Twitter.", "fields": ["popularity", "trademark", "phenomenon", "reuse", "search engine optimization"], "abstract": "Users on Twitter are commonly identified by their profile names. These names are used when directly addressing users on Twitter, are part of their profile page URLs, and can become a trademark for popular accounts, with people referring to celebrities by their real name and their profile name, interchangeably. Twitter, however, has chosen to not permanently link profile names to their corresponding user accounts. In fact, Twitter allows users to change their profile name, and afterwards makes the old profile names available for other users to take.\n\nIn this paper, we provide a large-scale study of the phenomenon of profile name reuse on Twitter. We show that this phenomenon is not uncommon, investigate the dynamics of profile name reuse, and characterize the accounts that are involved in it. We find that many of these accounts adopt abandoned profile names for questionable purposes, such as spreading malicious content, and using the profile name's popularity for search engine optimization. Finally, we show that this problem is not unique to Twitter (as other popular online social networks also release profile names) and argue that the risks involved with profile-name reuse outnumber the advantages provided by this feature.", "citation": "Not cited", "departments": ["University College London", "University College London", "Stony Brook University", "University College London", "Boston University"], "authors": ["Enrico Mariconti.....http://dblp.org/pers/hd/m/Mariconti:Enrico", "Jeremiah Onaolapo.....http://dblp.org/pers/hd/o/Onaolapo:Jeremiah", "Syed Sharique Ahmad.....http://dblp.org/pers/hd/a/Ahmad:Syed_Sharique", "Nicolas Nikiforou.....http://dblp.org/pers/hd/n/Nikiforou:Nicolas", "Manuel Egele.....http://dblp.org/pers/hd/e/Egele:Manuel", "Nick Nikiforakis.....http://dblp.org/pers/hd/n/Nikiforakis:Nick", "Gianluca Stringhini.....http://dblp.org/pers/hd/s/Stringhini:Gianluca"], "conf": "www", "year": "2017", "pages": 10}