{"title": "Turbulent Touch: Touchscreen Input for Cockpit Flight Displays.", "fields": ["cockpit", "workload", "touchscreen", "stencil", "overlay"], "abstract": "Touchscreen input in commercial aircraft cockpits offers potential advantages, including ease of use, modifiability, and reduced weight. However, tolerance to turbulence is a challenge for their deployment. To better understand the impact of turbulence on cockpit input methods we conducted a comparative study of user performance with three input methods -- touch, trackball (as currently used in commercial aircraft), and a touchscreen stencil overlay designed to assist finger stabilization. These input methods were compared across a variety of interactive tasks and at three levels of simulated turbulence (none, low, and high). Results showed that performance degrades and subjective workload increases as vibration increases. Touch-based interaction was faster than the trackball when precision requirements were low (at all vibrations), but it was slower and less accurate for more precise pointing, particularly at high vibrations. The stencil did not improve touch selection times, although it did reduce errors on small targets at high vibrations, but only when finger lift-off errors had been eliminated by a timeout. Our work provides new information on the types of tasks affected by turbulence and the input mechanisms that perform best under different levels of vibration.", "citation": "Citations (9)", "year": "2017", "departments": ["University of Canterbury", "University of Saskatchewan", "Paul Sabatier University", "Airbus", "University of Saskatchewan"], "conf": "chi", "authors": ["Andy Cockburn.....http://dblp.org/pers/hd/c/Cockburn:Andy", "Carl Gutwin.....http://dblp.org/pers/hd/g/Gutwin:Carl", "Philippe A. Palanque.....http://dblp.org/pers/hd/p/Palanque:Philippe_A=", "Yannick Deleris.....http://dblp.org/pers/hd/d/Deleris:Yannick", "Catherine Trask.....http://dblp.org/pers/hd/t/Trask:Catherine", "Ashley Coveney.....http://dblp.org/pers/hd/c/Coveney:Ashley", "Marcus Yung.....http://dblp.org/pers/hd/y/Yung:Marcus", "Karon E. MacLean.....http://dblp.org/pers/hd/m/MacLean:Karon_E="], "pages": 12}