{"title": "Where are the Sweet Spots?: A Systematic Approach to Reproducible DASH Player Comparisons.", "fields": ["dash", "homogeneous", "quality of experience", "dynamic adaptive streaming over http", "emulation"], "abstract": "The current body of research on Dynamic Adaptive Streaming over HTTP (DASH) contributes various adaptation algorithms aiming to optimize performance metrics such as the Quality of Experience. Intuitively, the heterogeneity of the streaming environment and the underlying technologies lead many of the developed approaches to possess clear performance affinities denoted here as  sweet spots . We observe, however, that systematic comparisons of these algorithms are usually conducted within homogeneous player environments.   In this work, we show the substantial impact of player choice and configuration on the streaming performance. To this end, we systematically examine three established open-source DASH players, i.e., DASH.JS, Google's Shaka Player, and AStream, that implement fundamentally different configurations featuring various adaptation algorithms. By establishing a large scale emulation framework we ( i ) extract player sweet spots and ( ii ) achieve a direct, reproducible comparison of real-world DASH players and algorithms. We present empirical evidence demonstrating that an isolated analysis of DASH player modules is insufficient to capture the player streaming performance. One of the major observations is that the choice of the target buffer size together with the player implementation dominates the choice of the adaptation algorithms.", "citation": "Citations (4)", "departments": ["Technische Universität Darmstadt", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "University of Massachusetts Amherst", "Technische Universität Darmstadt"], "authors": ["Denny Stohr.....http://dblp.org/pers/hd/s/Stohr:Denny", "Alexander Frömmgen.....http://dblp.org/pers/hd/f/Fr=ouml=mmgen:Alexander", "Amr Rizk.....http://dblp.org/pers/hd/r/Rizk:Amr", "Michael Zink.....http://dblp.org/pers/hd/z/Zink:Michael", "Ralf Steinmetz.....http://dblp.org/pers/hd/s/Steinmetz:Ralf", "Wolfgang Effelsberg.....http://dblp.org/pers/hd/e/Effelsberg:Wolfgang"], "conf": "mm", "year": "2017", "pages": 9}