{"title": "Identifying Human Mobility via Trajectory Embeddings.", "fields": ["trajectory", "exploit", "semantics", "recurrent neural network", "embedding"], "abstract": "Understanding human trajectory patterns is an important task in many location based social networks (LBSNs) applications, such as personalized recommendation and preference-based route planning. Most of the existing methods classify a trajectory (or its segments) based on spatio-temporal values and activities, into some predefined categories, e.g., walking or jogging. We tackle a novel trajectory classification problem: we identify and link trajectories to users who generate them in the LBSNs, a problem called Trajectory-User Linking (TUL). Solving the TUL problem is not a trivial task because: (1) the number of the classes (i.e., users) is much larger than the number of motion patterns in the common trajectory classification problems; and (2) the location based trajectory data, especially the check-ins, are often extremely sparse. To address these challenges, a Recurrent Neural Networks (RNN) based semi-supervised learning model, called TULER (TUL via Embedding and RNN) is proposed, which exploits the spatio-temporal data to capture the underlying semantics of user mobility patterns. Experiments conducted on real-world datasets demonstrate that TULER achieves better accuracy than the existing methods.", "citation": "Citations (1)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Maryland, College Park", "Northwestern University", "University of Electronic Science and Technology of China"], "authors": ["Qiang Gao.....http://dblp.org/pers/hd/g/Gao:Qiang", "Fan Zhou.....http://dblp.org/pers/hd/z/Zhou_0002:Fan", "Kunpeng Zhang.....http://dblp.org/pers/hd/z/Zhang:Kunpeng", "Goce Trajcevski.....http://dblp.org/pers/hd/t/Trajcevski:Goce", "Xucheng Luo.....http://dblp.org/pers/hd/l/Luo:Xucheng", "Fengli Zhang.....http://dblp.org/pers/hd/z/Zhang:Fengli"], "conf": "ijcai", "year": "2017", "pages": 7}