{"title": "Generalized finitary real-time calculus.", "fields": ["algebraic operation", "memory footprint", "finitary", "correctness", "periodic graph"], "abstract": "Real-time Calculus (RTC) is a non-stochastic queuing theory to the worst-case performance analysis of distributed real-time systems. Workload as well as resources are modelled as piece-wise linear, pseudo-periodic curves and the system under investigation is modelled as a sequence of algebraic operations over these curves. The memory footprint of computed curves increases exponentially with the sequence of operations and RTC may become computationally infeasible fast. Recently, Finitary RTC has been proposed to counteract this problem. Finitary RTC restricts curves to finite input domains and thereby counteracts the memory demand explosion seen with pseudo periodic curves of common RTC implementations. However, the proof to the correctness of Finitary RTC specifically exploits the operational semantic of the greed processing component (GPC) model and is tied to the maximum busy window size. This is an inherent limitation, which prevents a straight-forward generalization. In this paper, we provide a generalized Finitary RTC that abstracts from the operational semantic of a specific component model and reduces the finite input domains of curves even further. The novel approach allows for faster computations and the extension of the Finitary RTC idea to a much wider range of RTC models.", "citation": "Citations (2)", "departments": ["Uppsala University", "Kaiserslautern University of Technology", "Kaiserslautern University of Technology", "Hong Kong Polytechnic University", "Uppsala University"], "authors": ["Kai Lampka.....http://dblp.org/pers/hd/l/Lampka:Kai", "Steffen Bondorf.....http://dblp.org/pers/hd/b/Bondorf:Steffen", "Jens B. Schmitt.....http://dblp.org/pers/hd/s/Schmitt:Jens_B=", "Nan Guan.....http://dblp.org/pers/hd/g/Guan:Nan", "Wang Yi.....http://dblp.org/pers/hd/y/Yi_0001:Wang"], "conf": "infocom", "year": "2017", "pages": 9}