{"title": "Can you find me now? Evaluation of network-based localization in a 4G LTE network.", "fields": ["operator", "cellular network", "training set", "coverage map", "capacity planning"], "abstract": "User location is of critical importance to cellular network operators. It is often used for network capacity planning and to aid in the analysis of service and network diagnostics. However, existing localization techniques rely on user-provided information (e.g., Angle-of-Arrival), which are not available to the operator, and often require a significant effort to collect training data. Our main contribution is the design and evaluation of the Network-Based Localization (NBL) System for localizing a user in a 4G LTE network. The NBL System consists of 2 stages. In an offline stage, we develop RF coverage maps based on a large-scale crowd-sourced channel measurement campaign. Then, in an online stage, we present a localization algorithm to quickly match RF measurements (which are already collected as part of normal network operation) to coverage map locations. The system is more practical than related works, as it does not make any assumptions about user mobility, nor does it require expensive manual training measurements. Despite the realistic assumptions, our extensive evaluations in a national 4G LTE network show that the NBL System achieves a localization accuracy which is comparable to related works (i.e., a median accuracy of 5% of the cell's coverage region).", "citation": "Not cited", "departments": ["AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "authors": ["Robert Margolies.....http://dblp.org/pers/hd/m/Margolies:Robert", "Richard A. Becker.....http://dblp.org/pers/hd/b/Becker:Richard_A=", "Simon D. Byers.....http://dblp.org/pers/hd/b/Byers:Simon_D=", "Supratim Deb.....http://dblp.org/pers/hd/d/Deb:Supratim", "Rittwik Jana.....http://dblp.org/pers/hd/j/Jana:Rittwik", "Simon Urbanek.....http://dblp.org/pers/hd/u/Urbanek:Simon", "Chris Volinsky.....http://dblp.org/pers/hd/v/Volinsky:Chris"], "conf": "infocom", "year": "2017", "pages": 9}