{"title": "Large-scale invisible attack on AFC systems with NFC-equipped smartphones.", "fields": ["plaintext", "operator", "near field communication", "web server", "database transaction"], "abstract": "Automated Fare Collection (AFC) systems have been globally deployed for decades, particularly in public transportation. Although the transaction messages of AFC systems are mostly transferred in plaintext, which is obviously insecure, system operators do not need to pay much attention to this issue, since the AFC network is well isolated from public network (e.g., the Internet). Nevertheless, in recent years, the advent of Near Field Communication (NFC)-equipped smartphones has bridged the gap between the AFC network and the Internet through Host-based Card Emulation (HCE). Motivated by this fact, we design and practice a novel paradigm of attack on modern distance-based pricing AFC systems, enabling users to pay much less than actually required. Our constructed attack has two important properties: 1) it is invisible to AFC system operators because the attack never causes any inconsistency in the backend database of the operators; and 2) it can be scalable to large number of users (e.g., 10,000) by maintaining a moderate-sized AFC card pool (e.g., containing 150 cards). Based upon this constructed attack, we developed an HCE app, named LessPay. Our real-world experiments on LessPay demonstrate not only the feasibility of our attack (with 97.6% success rate), but also its low-overhead in terms of bandwidth and computation.", "citation": "Citations (1)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Yale University", "University at Buffalo"], "authors": ["Fan Dang.....http://dblp.org/pers/hd/d/Dang:Fan", "Pengfei Zhou.....http://dblp.org/pers/hd/z/Zhou:Pengfei", "Zhenhua Li.....http://dblp.org/pers/hd/l/Li_0001:Zhenhua", "Ennan Zhai.....http://dblp.org/pers/hd/z/Zhai:Ennan", "Aziz Mohaisen.....http://dblp.org/pers/hd/m/Mohaisen:Aziz", "Qingfu Wen.....http://dblp.org/pers/hd/w/Wen:Qingfu", "Mo Li.....http://dblp.org/pers/hd/l/Li:Mo"], "conf": "infocom", "year": "2017", "pages": 9}