{"title": "Mining Spatio-Temporal Reachable Regions over Massive Trajectory Data.", "fields": ["search engine indexing", "reachability", "range query", "data access", "trajectory"], "abstract": "Mining spatio-temporal reachable regions aims to find a set of road segments from massive trajectory data, that are reachable from a user-specified location and within a given temporal period. Accurately extracting such spatiotemporal reachable area is vital in many urban applications, e.g., (i) location-based recommendation, (ii) location-based advertising, and (iii) business coverage analysis. The traditional approach of answering such queries essentially performs a distance-based range query over the given road network, which have two main drawbacks: (i) it only works with the physical travel distances, where the users usually care more about dynamic traveling time, and (ii) it gives the same result regardless of the querying time, where the reachable area could vary significantly with different traffic conditions. Motivated by these observations, we propose a data-driven approach to formulate the problem as mining actual reachable region based on real historical trajectory dataset. The main challenge in our approach is the system efficiency, as verifying the reachability over the massive trajectories involves huge amount of disk I/Os. In this paper, we develop two indexing structures: 1) spatio-temporal index (ST-Index) and 2) connection index (Con-Index) to reduce redundant trajectory data access operations. We also propose a novel query processing algorithm with: 1) maximum bounding region search, which directly extracts a small searching region from the index structure and 2) trace back search, which refines the search results from the previous step to find the final query result. Moreover, our system can also efficiently answer the spatio-temporal reachability query with multiple query locations by skipping the overlapped area search. We evaluate our system extensively using a large-scale real taxi trajectory data in Shenzhen, China, where results demonstrate that the proposed algorithms can reduce 50%-90% running time over baseline algorithms.", "citation": "Citations (5)", "departments": ["Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Microsoft", "Microsoft"], "authors": ["Guojun Wu.....http://dblp.org/pers/hd/w/Wu:Guojun", "Yichen Ding.....http://dblp.org/pers/hd/d/Ding:Yichen", "Yanhua Li.....http://dblp.org/pers/hd/l/Li:Yanhua", "Jie Bao.....http://dblp.org/pers/hd/b/Bao_0003:Jie", "Yu Zheng.....http://dblp.org/pers/hd/z/Zheng_0004:Yu", "Jun Luo.....http://dblp.org/pers/hd/l/Luo:Jun"], "conf": "icde", "year": "2017", "pages": 12}