{"title": "Deterministic Distributed Edge-Coloring via Hypergraph Maximal Matching.", "fields": ["edge coloring", "hypergraph", "degree", "maximal independent set", "p complete"], "abstract": "We present a deterministic distributed algorithm that computes a (2δ-1)-edge-coloring, or even list-edge-coloring, in any n-node graph with maximum degree δ, in O(log^8 δ ⋅ log n) rounds. This answers one of the long-standing open questions of distributed graph algorithms} from the late 1980s, which asked for a polylogarithmic-time algorithm. See, e.g., Open Problem 4 in the Distributed Graph Coloring book of Barenboim and Elkin. The previous best round complexities were 2^{O(√{log n})} by Panconesi and Srinivasan [STOC92] and Õ(√{δ}) + O(log^* n) by Fraigniaud, Heinrich, and Kosowski [FOCS16]. A corollary of our deterministic list-edge-coloring also improves the randomized complexity of (2δ-1)-edge-coloring to poly(loglog n) rounds.The key technical ingredient is a deterministic distributed algorithm for hypergraph maximal matching, which we believe will be of interest beyond this result. In any hypergraph of rank r — where each hyperedge has at most r vertices — with n nodes and maximum degree δ, this algorithm computes a maximal matching in O(r^5 log^{6+log r } δ ⋅ log n) rounds.This hypergraph matching algorithm and its extensions also lead to a number of other results. In particular, we obtain a polylogarithmic-time deterministic distributed maximal independent set (MIS) algorithm for graphs with bounded neighborhood independence, hence answering Open Problem 5 of Barenboim and Elkins book, a \\big((log δ/ε)^{O(log 1/ε)}\\big)-round deterministic algorithm for (1+ε)-approximation of maximum matching, and a quasi-polylogarithmic-time deterministic distributed algorithm for orienting λ-arboricity graphs with out-degree at most \\lceil (1+ε)λ \\rceil, for any constant ε 0, hence partially answering Open Problem 10 of Barenboim and Elkins book.", "citation": "Citations (8)", "departments": ["ETH Zurich", "ETH Zurich", "University of Freiburg"], "authors": ["Manuela Fischer.....http://dblp.org/pers/hd/f/Fischer:Manuela", "Mohsen Ghaffari.....http://dblp.org/pers/hd/g/Ghaffari:Mohsen", "Fabian Kuhn.....http://dblp.org/pers/hd/k/Kuhn:Fabian"], "conf": "focs", "year": "2017", "pages": 12}