{"title": "Machine learning-based detection of open source license exceptions.", "fields": ["categorization", "redistribution", "reuse", "license", "empirical research"], "abstract": "From a legal perspective, software licenses govern the redistribution, reuse, and modification of software as both source and binary code. Free and Open Source Software (FOSS) licenses vary in the degree to which they are permissive or restrictive in allowing redistribution or modification under licenses different from the original one(s). In certain cases, developers may modify the license by appending to it an exception to specifically allow reuse or modification under a particular condition. These exceptions are an important factor to consider for license compliance analysis since they modify the standard (and widely understood) terms of the original license. In this work, we first perform a large-scale empirical study on the change history of over 51K FOSS systems aimed at quantitatively investigating the prevalence of known license exceptions and identifying new ones. Subsequently, we performed a study on the detection of license exceptions by relying on machine learning. We evaluated the license exception classification with four different supervised learners and sensitivity analysis. Finally, we present a categorization of license exceptions and explain their implications.", "citation": "Citations (4)", "departments": ["College of William & Mary", "University of Los Andes", "University of Lugano", "University of Sannio", "University of Victoria"], "authors": ["Christopher Vendome.....http://dblp.org/pers/hd/v/Vendome:Christopher", "Mario Linares Vásquez.....http://dblp.org/pers/hd/v/V=aacute=squez:Mario_Linares", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Daniel M. Germán.....http://dblp.org/pers/hd/g/Germ=aacute=n:Daniel_M=", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "conf": "icse", "year": "2017", "pages": 12}