{"title": "Magic-wall: Visualizing Room Decoration.", "fields": ["convolutional neural network", "parsing", "color space", "edge detection", "deep learning"], "abstract": "This work focuses on Magic-wall, an automatic system for visualizing the effect of room decoration. Given an image of the indoor scene and a preferred color, the Magic-wall can automatically locate the wall regions in the image and smoothly replace the existing color with the required one. The key idea of the proposed Magic-wall is to leverage visual semantics to guide the entire process of color substitution including wall segmentation and color replacement. We propose an edge-aware fully convolutional neural network (FCN) for indoor semantic scene parsing, in which a novel edge-prior branch is introduced to better identify the boundary of different semantic regions. To accurately localize the wall regions, we adapt a semantic-dependent optimized strategy, which pays more attention to those pixels belonging to the wall by adapting larger optimization weights compared with those from other semantic regions. Finally, to naturally replace the color of original walls, a simple yet effective color space conversion method is proposed for replacement with brightness reservation. We build a new indoor scene dataset upon ADE20K for training and testing, which includes 6 semantic labels. Extensive experimental evaluations and visualizations well demonstrate that the proposed Magic-wall is effective and can automatically generate a set of visually pleasing results.", "citation": "Not cited", "departments": ["Beijing Jiaotong University", "National University of Singapore", "Beijing Jiaotong University", "Chinese Academy of Sciences", "Beijing Jiaotong University"], "authors": ["Ting Liu.....http://dblp.org/pers/hd/l/Liu:Ting", "Yunchao Wei.....http://dblp.org/pers/hd/w/Wei:Yunchao", "Yao Zhao.....http://dblp.org/pers/hd/z/Zhao:Yao", "Si Liu.....http://dblp.org/pers/hd/l/Liu:Si", "Shikui Wei.....http://dblp.org/pers/hd/w/Wei:Shikui"], "conf": "mm", "year": "2017", "pages": 9}