{"title": "When and how much to neutralize interference?", "fields": ["spectral efficiency", "transmitter", "interference", "transmitter power output", "channel"], "abstract": "Interference management (IM) is essential to wireless communication networks, but interference suppression, a key component of IM, is known to degrade users' achievable spectral efficiency (SE). It is thus important to select an appropriate IM method with optimal operating parameters according to diverse network deployments, transmit power differences of various communication equipments, and dynamically changing channel conditions so as to balance the benefits brought by and the cost of IM. Interference neutralization (IN) has recently been receiving considerable attention, with which a duplicate of interference of the same strength and opposite phase w.r.t. the original interfering signal is generated to neutralize the disturbance at the intended receiver. However, to the best of our knowledge, all existing IN schemes assume that interference is completely neutralized without accounting for their power consumption. To remedy this deficiency, we propose a novel scheme, called dynamic interference neutralization (DIN). By intelligently determining the appropriate portion of interference to be neutralized, we balance the transmitter's power used for IN and the desired signal's transmission. We then present a new way to adaptively select one of DIN and other IM methods by taking into account the cost of multiple IM methods and their benefits. Our analysis has shown that DIN can include complete IN and non-interference management (non-IM) as special cases. The proposed strategy is shown via simulation to be able to make better use of the transmit power than existing IM methods, hence enhancing users' SE.", "citation": "Not cited", "departments": ["Xidian University", "University of Michigan", "Xidian University"], "authors": ["Zhao Li.....http://dblp.org/pers/hd/l/Li:Zhao", "Kang G. Shin.....http://dblp.org/pers/hd/s/Shin:Kang_G=", "Lu Zhen.....http://dblp.org/pers/hd/z/Zhen:Lu"], "conf": "infocom", "year": "2017", "pages": 9}