{"title": "Handling flash deals with soft guarantee in hybrid cloud.", "fields": ["response time", "business logic", "online algorithm", "competitive analysis", "web server"], "abstract": "Flash deal applications, which offer significant benefits (e.g., discount) to subscribers within a short period of time, are becoming increasingly prevalent. Motivated by such transient profit, flash crowds of subscribers request services simultaneously. Considering the unique business logic, a hybrid cloud with soft guarantee, i.e., bounding the response time of delay-tolerant requests, has great potential to handle flash crowds. In this paper, to cost-effectively withstand flash crowds with soft guarantee, we propose a solution that makes smart decisions on scheduling requests in the hybrid cloud and adjusting the capacity of the public cloud. In respect of scheduling requests, we apply Sequential Quadratic Programming (SQP) to achieve soft guarantee. Furthermore, for adjusting capacity, we design an online algorithm to tune the scale of the public cloud towards jointly minimizing cost and response time, yet without a priori knowledge of request arrival rate. We prove that the online algorithm can obtain a competitive ratio of 1–6e against the optimal solution, where e can be tuned close to 0. By conducting extensive trace-driven experiments in a website prototype deployed on OpenStack Mitaka and Amazon Web Service, our solution reduces response time by 15% compared with previous work under given budget.", "citation": "Not cited", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Yipei Niu.....http://dblp.org/pers/hd/n/Niu:Yipei", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Xincai Fei.....http://dblp.org/pers/hd/f/Fei:Xincai", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2017", "pages": 9}