{"title": "Expect the unexpected: Sub-second optimization for segment routing.", "fields": ["routing table", "destination sequenced distance vector routing", "multipath routing", "equal cost multi path routing", "virtual routing and forwarding"], "abstract": "In this paper, we study how to perform traffic engineering at an extremely-small time scale with segment routing, addressing a critical need for modern wide area networks. Prior work has shown that segment routing enables to better engineer traffic, thanks to its ability to program detours in forwarding paths, at scale. Two main approaches have been explored for traffic engineering with segment routing, respectively based on integer linear programming and constraint programming. However, no previous work deeply investigated how quickly those approaches can react to unexpected traffic changes and failures. We highlight limitations of existing algorithms, both in terms of required execution time and amount of path changes to be applied. Thus, we propose a new approach, based on local search and focused on the quick re-arrangement of (few) forwarding paths. We describe heuristics for sub-second recomputation of segment-routing paths that comply with requirements on the maximum link load (e.g., for congestion avoidance). Our heuristics enable a prompt answer to sudden criticalities affecting network services and business agreements. Through extensive simulations, we indeed experimentally show that our proposal significantly outperforms previous algorithms in the context of time-constrained optimization, supporting radical traffic changes in few tens of milliseconds for realistic networks.", "citation": "Citations (2)", "departments": ["Google", "University College London"], "authors": ["Steven Gay.....http://dblp.org/pers/hd/g/Gay:Steven", "Renaud Hartert.....http://dblp.org/pers/hd/h/Hartert:Renaud", "Stefano Vissicchio.....http://dblp.org/pers/hd/v/Vissicchio:Stefano"], "conf": "infocom", "year": "2017", "pages": 9}