{"title": "Distilling Information Reliability and Source Trustworthiness from Digital Traces.", "fields": ["point process", "convex optimization", "stack overflow", "trustworthiness", "leverage"], "abstract": "Online knowledge repositories typically rely on their users or dedicated editors to evaluate the reliability of their contents. These explicit feedback mechanisms can be viewed as noisy measurements of both information reliability and information source trustworthiness. Can we leverage these noisy measurements, often biased, to distill a robust, unbiased and interpretable measure of both notions?\n\nIn this paper, we argue that the large volume of digital traces left by the users within knowledge repositories also reflect information reliability and source trustworthiness. In particular, we propose a temporal point process modeling framework which links the temporal behavior of the users to information reliability and source trustworthiness. Furthermore, we develop an efficient convex optimization procedure to learn the parameters of the model from historical traces of the evaluations provided by these users. Experiments on real-world data gathered from Wikipedia and Stack Overflow show that our modeling framework accurately predicts evaluation events, provides an interpretable measure of information reliability and source trustworthiness, and yields interesting insights about real-world events.", "citation": "Citations (8)", "departments": ["Max Planck Society", "Max Planck Society", "Georgia Institute of Technology", "Georgia Institute of Technology", "Max Planck Society"], "authors": ["Behzad Tabibian.....http://dblp.org/pers/hd/t/Tabibian:Behzad", "Isabel Valera.....http://dblp.org/pers/hd/v/Valera:Isabel", "Mehrdad Farajtabar.....http://dblp.org/pers/hd/f/Farajtabar:Mehrdad", "Le Song.....http://dblp.org/pers/hd/s/Song:Le", "Bernhard Schölkopf.....http://dblp.org/pers/hd/s/Sch=ouml=lkopf:Bernhard", "Manuel Gomez-Rodriguez.....http://dblp.org/pers/hd/g/Gomez=Rodriguez:Manuel"], "conf": "www", "year": "2017", "pages": 9}