{"title": "Efficient Ad-Hoc Graph Inference and Matching in Biological Databases.", "fields": ["tree traversal", "microarray analysis techniques", "biological network", "probabilistic logic", "gene regulatory network"], "abstract": "In many real applications such as bioinformatics and biological network analysis, it has always been an important, yet challenging, topic to accurately infer/reconstruct  gene regulatory networks  ( GRNs ) from microarray data, and efficiently identify those matching  GRNs  with similar interaction structures for potential disease analysis and treatment tasks. Motivated by this, in this paper, we formalize the problem of  ad-hoc inference and matching over gene regulatory networks  ( IM-GRN ), which deciphers ad-hoc  GRN  graph structures online from gene feature databases (without full  GRN  materializations), and retrieves the inferred  GRNs  that are subgraph-isomorphic to a query  GRN  graph with high confidences. Specifically, we propose a novel probabilistic score to measure the possible interaction between any two genes (inferred from gene feature vectors), and thus model GRNs by probabilistic graphs, containing edge existence probabilities. In order to efficiently process  IM-GRN  queries, we propose effective reduction, pruning, and embedding strategies to significantly reduce the search space of  GRN  inference and matching, without materializing all  GRNs . We also present an effective indexing mechanism and an efficient  IM-GRN  query processing algorithm by the index traversal. Finally, extensive experiments have been conducted to verify the efficiency and effectiveness of our proposed  IM-GRN  query answering approaches over real/synthetic  GRN  data sets.", "citation": "Not cited", "year": "2017", "departments": ["Kent State University", "The University of Texas Rio Grande Valley"], "conf": "sigmod", "authors": ["Xiang Lian.....http://dblp.org/pers/hd/l/Lian:Xiang", "Dongchul Kim.....http://dblp.org/pers/hd/k/Kim:Dongchul"], "pages": 15}