{"title": "Continuous variable-specific resolutions of feature interactions.", "fields": ["machine learning", "theoretical computer science", "system integration", "feature interaction problem", "internet of things"], "abstract": "Systems that are assembled from independently developed features suffer from  feature interactions , in which features affect one anotherâ  s behaviour in surprising ways. The  Feature Interaction Problem  results from trying to implement an appropriate resolution for each interaction within each possible context, because the number of possible contexts to consider increases exponentially with the number of features in the system. Resolution strategies aim to combat the Feature Interaction Problem by offering default strategies that resolve entire classes of interactions, thereby reducing the work needed to resolve lots of interactions. However most such approaches employ coarse-grained resolution strategies (e.g., feature priority) or a centralized arbitrator.   Our work focuses on employing variable-specific default-resolution strategies that aim to resolve at runtime featuresâ   conflicting actions on a systemâ  s outputs. In this paper, we extend prior work to enable co-resolution of interactions on coupled output variables and to promote smooth continuous resolutions over execution paths. We implemented our approach within the PreScan simulator and performed a case study involving 15 automotive features; this entailed our devising and implementing three resolution strategies for three output variables. The results of the case study show that the approach produces smooth and continuous resolutions of interactions throughout interesting scenarios.", "citation": "Citations (1)", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Mohammad Hadi Zibaeenejad.....http://dblp.org/pers/hd/z/Zibaeenejad:Mohammad_Hadi", "Chi Zhang.....http://dblp.org/pers/hd/z/Zhang:Chi", "Joanne M. Atlee.....http://dblp.org/pers/hd/a/Atlee:Joanne_M="], "conf": "sigsoft", "year": "2017", "pages": 11}