{"title": "On the scalability of Linux kernel maintainers' work.", "fields": ["software maintainer", "workload", "linux kernel", "software evolution", "ranging"], "abstract": "Open source software ecosystems evolve ways to balance the workload among groups of participants ranging from core groups to peripheral groups. As ecosystems grow, it is not clear whether the mechanisms that previously made them work will continue to be relevant or whether new mechanisms will need to evolve. The impact of failure for critical ecosystems such as Linux is enormous, yet the understanding of why they function and are effective is limited. We, therefore, aim to understand how the Linux kernel sustains its growth, how to characterize the workload of maintainers, and whether or not the existing mechanisms are scalable. We quantify maintainersâ   work through the files that are maintained, and the change activity and the numbers of contributors in those files. We find systematic differences among modules; these differences are stable over time, which suggests that certain architectural features, commercial interests, or module-specific practices lead to distinct sustainable equilibria. We find that most of the modules have not grown appreciably over the last decade; most growth has been absorbed by a few modules. We also find that the effort per maintainer does not increase, even though the community has hypothesized that required effort might increase. However, the distribution of work among maintainers is highly unbalanced, suggesting that a few maintainers may experience increasing workload. We find that the practice of assigning multiple maintainers to a file yields only a power of 1/2 increase in productivity. We expect that our proposed framework to quantify maintainer practices will help clarify the factors that allow rapidly growing ecosystems to be sustainable.", "citation": "Not cited", "departments": ["Peking University", "Peking University", "University of Tennessee", "Intel"], "authors": ["Minghui Zhou.....http://dblp.org/pers/hd/z/Zhou:Minghui", "Qingying Chen.....http://dblp.org/pers/hd/c/Chen:Qingying", "Audris Mockus.....http://dblp.org/pers/hd/m/Mockus:Audris", "Fengguang Wu.....http://dblp.org/pers/hd/w/Wu:Fengguang"], "conf": "sigsoft", "year": "2017", "pages": 11}