{"title": "Amazon Aurora: Design Considerations for High Throughput Cloud-Native Relational Databases.", "fields": ["relational database", "cloud computing", "crash", "asynchronous communication", "online transaction processing"], "abstract": "Amazon Aurora is a relational database service for OLTP workloads offered as part of Amazon Web Services (AWS). In this paper, we describe the architecture of Aurora and the design considerations leading to that architecture. We believe the central constraint in high throughput data processing has moved from compute and storage to the network. Aurora brings a novel architecture to the relational database to address this constraint, most notably by pushing redo processing to a multi-tenant scale-out storage service, purpose-built for Aurora. We describe how doing so not only reduces network traffic, but also allows for fast crash recovery, failovers to replicas without loss of data, and fault-tolerant, self-healing storage. We then describe how Aurora achieves consensus on durable state across numerous storage nodes using an efficient asynchronous scheme, avoiding expensive and chatty recovery protocols. Finally, having operated Aurora as a production service for over 18 months, we share the lessons we have learnt from our customers on what modern cloud applications expect from databases.", "citation": "Citations (3)", "year": "2017", "departments": ["Amazon Web Services", "Amazon Web Services", "Amazon Web Services", "Amazon Web Services", "Amazon Web Services"], "conf": "sigmod", "authors": ["Alexandre Verbitski.....http://dblp.org/pers/hd/v/Verbitski:Alexandre", "Anurag Gupta.....http://dblp.org/pers/hd/g/Gupta:Anurag", "Debanjan Saha.....http://dblp.org/pers/hd/s/Saha:Debanjan", "Murali Brahmadesam.....http://dblp.org/pers/hd/b/Brahmadesam:Murali", "Kamal Gupta.....http://dblp.org/pers/hd/g/Gupta:Kamal", "Raman Mittal.....http://dblp.org/pers/hd/m/Mittal:Raman", "Sailesh Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Sailesh", "Sandor Maurice.....http://dblp.org/pers/hd/m/Maurice:Sandor", "Tengiz Kharatishvili.....http://dblp.org/pers/hd/k/Kharatishvili:Tengiz", "Xiaofeng Bao.....http://dblp.org/pers/hd/b/Bao:Xiaofeng"], "pages": 12}