{"title": "Adverse Drug Event Detection in Tweets with Semi-Supervised Convolutional Neural Networks.", "fields": ["small set", "deep learning", "ade classification", "labeled data", "convolutional neural network"], "abstract": "Current Adverse Drug Events (ADE) surveillance systems are often associated with a sizable time lag before such events are published. Online social media such as Twitter could describe adverse drug events in real-time, prior to official reporting. Deep learning has significantly improved text classification performance in recent years and can potentially enhance ADE classification in tweets. However, these models typically require large corpora with human expert-derived labels, and such resources are very expensive to generate and are hardly available. Semi-supervised deep learning models, which offer a plausible alternative to fully supervised models, involve the use of a small set of labeled data and a relatively larger collection of unlabeled data for training. Traditionally, these models are trained on labeled and unlabeled data from similar topics or domains. In reality, millions of tweets generated daily often focus on disparate topics, and this could present a challenge for building deep learning models for ADE classification with random Twitter stream as unlabeled training data. In this work, we build several semi-supervised convolutional neural network (CNN) models for ADE classification in tweets, specifically leveraging different types of unlabeled data in developing the models to address the problem. We demonstrate that, with the selective use of a variety of unlabeled data, our semi-supervised CNN models outperform a strong state-of-the-art supervised classification model by +9.9% F1-score. We evaluated our models on the Twitter data set used in the PSB 2016 Social Media Shared Task. Our results present the new state-of-the-art for this data set.", "citation": "Citations (12)", "departments": ["Northwestern University", "Philips", "Philips", "Philips", "Brandeis University"], "authors": ["Kathy Lee.....http://dblp.org/pers/hd/l/Lee:Kathy", "Ashequl Qadir.....http://dblp.org/pers/hd/q/Qadir:Ashequl", "Sadid A. Hasan.....http://dblp.org/pers/hd/h/Hasan:Sadid_A=", "Vivek V. Datla.....http://dblp.org/pers/hd/d/Datla:Vivek_V=", "Aaditya Prakash.....http://dblp.org/pers/hd/p/Prakash:Aaditya", "Joey Liu.....http://dblp.org/pers/hd/l/Liu:Joey", "Oladimeji Farri.....http://dblp.org/pers/hd/f/Farri:Oladimeji"], "conf": "www", "year": "2017", "pages": 10}