{"title": "Fast low-rank matrix approximation with locality sensitive hashing for quick anomaly detection.", "fields": ["locality sensitive hashing", "matrix decomposition", "low rank approximation", "sparse matrix", "singular value decomposition"], "abstract": "Detecting anomalous traffic is a critical task for advanced Internet management. The traditional approaches based on Principal Component Analysis (PCA) are effective only when the corruption is caused by small additive i.i.d. Gaussian noise. The recent Direct Robust Matrix Factorization (DRMF) is proven to be more robust and accurate in anomaly detection, but it incurs a high computation cost due to its need of singular value decomposition (SVD) for low-rank matrix approximation and the iterative use of SVD execution to find the final solution. To enable the anomaly detection for large traffic matrix with the use of DRMF, we formulate the low-rank matrix approximation problem as a problem of searching for the subspace to project the traffic matrix with the minimum error. We propose a novel approach, LSH-subspace, for fast low-rank matrix approximation. To facilitate the matrix partition for the quick search of the subspace, we propose several novel techniques: a multi-layer locality sensitive hashing (LSH) table to reorder the OD pairs based on LSH function, a partition principle to guide the partition to minimize the projection error, and a lightweight algorithm to exploit the sparsity of the outlier matrix to update the LSH table at low overhead. Our extensive simulations based on real trace data demonstrate that our LSH-subspace is 3 times faster than DRMF with high anomaly detection accuracy.", "citation": "Citations (1)", "departments": ["Chinese Academy of Sciences", "Hunan University", "Hunan University", "New York University", "Hunan University"], "authors": ["Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang", "Kun Xie.....http://dblp.org/pers/hd/x/Xie:Kun", "Jun Huang.....http://dblp.org/pers/hd/h/Huang:Jun", "Xin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Xin", "Yuxiang Chen.....http://dblp.org/pers/hd/c/Chen:Yuxiang", "Jigang Wen.....http://dblp.org/pers/hd/w/Wen:Jigang"], "conf": "infocom", "year": "2017", "pages": 9}