{"title": "Attend and Predict: Understanding Gene Regulation by Selective Attention on Chromatin.", "fields": ["encode", "deep learning", "pattern recognition", "regulation of gene expression", "saliency map"], "abstract": "The past decade has seen a revolution in genomic technologies that enabled a flood of genome-wide profiling of chromatin marks. Recent literature tried to understand gene regulation by predicting gene expression from large-scale chromatin measurements. Two fundamental challenges exist for such learning tasks: (1) genome-wide chromatin signals are spatially structured, high-dimensional and highly modular; and (2) the core aim is to understand what are the relevant factors and how they work together. Previous studies either failed to model complex dependencies among input signals or relied on separate feature analysis to explain the decisions. This paper presents an attention-based deep learning approach; AttentiveChrome, that uses a unified architecture to model and to interpret dependencies among chromatin factors for controlling gene regulation. AttentiveChrome uses a hierarchy of multiple Long Short-Term Memory (LSTM) modules to encode the input signals and to model how various chromatin marks cooperate automatically. AttentiveChrome trains two levels of attention jointly with the target prediction, enabling it to attend differentially to relevant marks and to locate important positions per mark. We evaluate the model across 56 different cell types (tasks) in human. Not only is the proposed architecture more accurate, but its attention scores also provide a better interpretation than state-of-the-art feature visualization methods such as saliency map.", "citation": "Citations (1)", "year": "2017", "departments": ["University of Virginia", "University of Virginia", "University of Virginia"], "conf": "nips", "authors": ["Ritambhara Singh.....http://dblp.org/pers/hd/s/Singh:Ritambhara", "Jack Lanchantin.....http://dblp.org/pers/hd/l/Lanchantin:Jack", "Arshdeep Sekhon.....http://dblp.org/pers/hd/s/Sekhon:Arshdeep", "Yanjun Qi.....http://dblp.org/pers/hd/q/Qi:Yanjun"], "pages": 11}