{"title": "Scalable and Interactive Graph Clustering Algorithm on Multicore CPUs.", "fields": ["canopy clustering algorithm", "clustering coefficient", "anytime algorithm", "thread", "speedup"], "abstract": "The structural graph clustering algorithm SCAN is a fundamental technique for managing and analyzing graph data. However, its high runtime remains a computational bottleneck, which limits its applicability. In this paper, we propose a novel interactive approach for tackling this problem on multicore CPUs. Our algorithm, called anySCAN, iteratively processes vertices in blocks. The acquired results are merged into an underlying cluster structures consisting of the so-called supernodes for building clusters. During its runtime, anySCAN can be suppressed for examining intermediate results and resumed for finding better result at arbitrary time points, making it an anytime algorithm which is capable to deal with very large graphs in an interactive way and under arbitrary time constraints. Moreover, its block processing scheme allows the design of a scalable parallel algorithm on shared memory architectures such as multicore CPUs for further speeding up the algorithm at each iteration. Consequently, anySCAN uniquely is an interactive and parallel algorithm at the same time. Experiments are conducted on very large real graph datasets for demonstrating the performance of anySCAN. It acquires very good approximate results early, leading to orders of magnitude speedup factor compared to SCAN and its variants. Using 16 threads, the acquired speed up factors are up to 13.5 times over its sequential version.", "citation": "Citations (6)", "departments": ["Aarhus University", "Aarhus University", "Aarhus University", "Aarhus University"], "authors": ["Son T. Mai.....http://dblp.org/pers/hd/m/Mai:Son_T=", "Martin Storgaard Dieu.....http://dblp.org/pers/hd/d/Dieu:Martin_Storgaard", "Ira Assent.....http://dblp.org/pers/hd/a/Assent:Ira", "Jon Jacobsen.....http://dblp.org/pers/hd/j/Jacobsen:Jon", "Jesper Kristensen.....http://dblp.org/pers/hd/k/Kristensen:Jesper", "Mathias Birk.....http://dblp.org/pers/hd/b/Birk:Mathias"], "conf": "icde", "year": "2017", "pages": 12}