{"title": "Cooperative and competitive operator pricing for mobile crowdsourced internet access.", "fields": ["internet access", "cellular network", "tethering", "mobile telephony", "network congestion"], "abstract": "Mobile Crowdsourced Access (MCA) enables mobile users (MUs) to share their Internet connections by serving as tethers to other MUs, hence can improve the quality of service of MUs as well as the overall utilization of network resources. However, MCA can also reduce the revenue-generating mobile traffic and increase the network congestion for mobile network operators (MNOs), and thus has been blocked by some MNOs in practice. In this work, we reconcile the conflicting objectives of MNOs and MUs by introducing a pricing framework for MCA, where the direct traffic and tethering traffic are charged independently according to a data price and a tethering price, respectively. We derive the optimal data and tethering prices systematically for MUs with the α-fair utility in two scenarios with cooperative and competitive MNOs, respectively. We show that the optimal tethering prices are zero and the optimal usage-based data prices are identical for all MUs, in both the cooperative and competitive scenarios. Such optimal pricing schemes will lead to mutually beneficial results for MNOs and MUs. Our simulation results show that the proposed pricing scheme approximately triples both the MNOs' profit and the MUs' payoff when the MNOs cooperate, comparing to the case where MCA is blocked. Moreover, competition among MNOs will decrease MNOs' profit and further increase the MUs' payoff.", "citation": "Citations (2)", "departments": ["The Chinese University of Hong Kong", "Harbin Institute of Technology", "The Chinese University of Hong Kong", "Northwestern University"], "authors": ["Meng Zhang.....http://dblp.org/pers/hd/z/Zhang:Meng", "Lin Gao.....http://dblp.org/pers/hd/g/Gao_0001:Lin", "Jianwei Huang.....http://dblp.org/pers/hd/h/Huang:Jianwei", "Michael L. Honig.....http://dblp.org/pers/hd/h/Honig:Michael_L="], "conf": "infocom", "year": "2017", "pages": 9}