{"title": "My VM is Lighter (and Safer) than your Container.", "fields": ["fork", "hypervisor", "temporal isolation among virtual machines", "hardware virtualization", "virtualization"], "abstract": "Containers are in great demand because they are lightweight when compared to virtual machines. On the downside, containers offer weaker isolation than VMs, to the point where people run containers in virtual machines to achieve proper isolation. In this paper, we examine whether there is indeed a strict tradeoff between isolation (VMs) and efficiency (containers). We find that VMs can be as nimble as containers, as long as they are small and the toolstack is fast enough.   We achieve lightweight VMs by using unikernels for specialized applications and with Tinyx, a tool that enables creating tailor-made, trimmed-down Linux virtual machines. By themselves, lightweight virtual machines are not enough to ensure good performance since the virtualization control plane (the toolstack) becomes the performance bottleneck. We present LightVM, a new virtualization solution based on Xen that is optimized to offer fast boot-times regardless of the number of active VMs. LightVM features a complete redesign of Xen's control plane, transforming its centralized operation to a distributed one where interactions with the hypervisor are reduced to a minimum. LightVM can boot a VM in 2.3ms, comparable to fork/exec on Linux (1ms), and two orders of magnitude faster than Docker. LightVM can pack thousands of LightVM guests on modest hardware with memory and CPU usage comparable to that of processes.", "citation": "Citations (9)", "departments": ["Politehnica University of Bucharest", "NEC Laboratories Europe", "NEC Laboratories Europe", "NEC Laboratories Europe", "NEC Laboratories Europe"], "authors": ["Filipe Manco.....http://dblp.org/pers/hd/m/Manco:Filipe", "Costin Lupu.....http://dblp.org/pers/hd/l/Lupu:Costin", "Florian Schmidt.....http://dblp.org/pers/hd/s/Schmidt_0002:Florian", "Jose Mendes.....http://dblp.org/pers/hd/m/Mendes:Jose", "Simon Kuenzer.....http://dblp.org/pers/hd/k/Kuenzer:Simon", "Sumit Sati.....http://dblp.org/pers/hd/s/Sati:Sumit", "Kenichi Yasukata.....http://dblp.org/pers/hd/y/Yasukata:Kenichi", "Costin Raiciu.....http://dblp.org/pers/hd/r/Raiciu:Costin", "Felipe Huici.....http://dblp.org/pers/hd/h/Huici:Felipe"], "conf": "sosp", "year": "2017", "pages": 16}