{"title": "Investigating the perceptibility different notification types on smartphones depending on the smartphone position.", "fields": ["phone", "internet privacy", "computer science", "computer security", "distraction"], "abstract": "Smartphones keep their users up to date by notifying them about new messages or phone calls, among others. They offer different notification types such as ringtone, vibration and LED. However, users do not always perceive incoming notifications. Within a lab study with 36 subjects we investigated the perceptibility of these notification types depending on different smartphone positions: on the table, in the trouser pocket or in the backpack. Our results show that vibration and ringtone are perceived best at all positions. There is a statistically significant difference between these types and LED which was only perceived while the phone was on the table - if perceived at all. Users felt that vibration is most pleasant than the ringtone due to habit, lower obtrusiveness, lower disturbance, and lower distraction. Qualitative feedback reveals that the habits of the user, their (social) context, and their current task also influence the suitability of the notification type. We conclude that the best solution would be an automatic notification type selection that uses mostly vibration, though ringtone for important notifications and LED for unimportant notifications or those received while being surrounded by other people.", "citation": "Citations (2)", "departments": ["Karlsruhe Institute of Technology", "Karlsruhe Institute of Technology", "Karlsruhe Institute of Technology", "Karlsruhe Institute of Technology", "Karlsruhe Institute of Technology"], "authors": ["Anja Exler.....http://dblp.org/pers/hd/e/Exler:Anja", "Christian Dinse.....http://dblp.org/pers/hd/d/Dinse:Christian", "Zeynep Günes.....http://dblp.org/pers/hd/g/G=uuml=nes:Zeynep", "Nadim Hammoud.....http://dblp.org/pers/hd/h/Hammoud:Nadim", "Steffen Mattes.....http://dblp.org/pers/hd/m/Mattes:Steffen", "Michael Beigl.....http://dblp.org/pers/hd/b/Beigl:Michael"], "conf": "huc", "year": "2017", "pages": 7}