{"title": "Legion: Enriching Internet Services with Peer-to-Peer Interactions.", "fields": ["peer to peer", "legacy system", "server", "latency", "web application"], "abstract": "Many web applications are built around direct interactions among users, from collaborative applications and social networks to multi-user games. Despite being user-centric, these applications are usually supported by services running on servers that mediate all interactions among clients. When users are in close vicinity of each other, relying on a centralized infrastructure for mediating user interactions leads to unnecessarily high latency while hampering fault-tolerance and scalability.\n\nIn this paper, we propose to extend user-centric Internet services with peer-to-peer interactions. We have designed a framework named Legion that enables client web applications to securely replicate data from servers, and synchronize these replicas directly among them. Legion allows for client-side modules, that we dub adapters, to leverage existing web platforms for storing data and to assist in Legion operation. Using these adapters, legacy applications accessing directly the web platforms can co-exist with new applications that use our framework, while accessing the same shared objects.Our experimental evaluation shows that, besides supporting direct client interactions, even when disconnected from the servers, Legion provides lower latency for update propagation with decreased network traffic for servers.", "citation": "Citations (1)", "departments": ["Universidade Nova de Lisboa", "Universidade Nova de Lisboa", "Universidade Nova de Lisboa", "Universidade Nova de Lisboa", "Kaiserslautern University of Technology"], "authors": ["Albert van der Linde.....http://dblp.org/pers/hd/l/Linde:Albert_van_der", "Pedro Fouto.....http://dblp.org/pers/hd/f/Fouto:Pedro", "João Leitão.....http://dblp.org/pers/hd/l/Leit=atilde=o_0001:Jo=atilde=o", "Nuno M. Preguiça.....http://dblp.org/pers/hd/p/Pregui=ccedil=a:Nuno_M=", "Santiago J. Castiñeira.....http://dblp.org/pers/hd/c/Casti=ntilde=eira:Santiago_J=", "Annette Bieniusa.....http://dblp.org/pers/hd/b/Bieniusa:Annette"], "conf": "www", "year": "2017", "pages": 10}