{"title": "The serverless trilemma: function composition for serverless computing.", "fields": ["function composition", "black box", "liskov substitution principle", "stateless protocol", "trilemma"], "abstract": "The field of serverless computing has recently emerged in support of highly scalable, event-driven applications. A serverless application is a set of stateless  functions , along with the events that should  trigger  their activation. A serverless runtime allocates resources as events arrive, avoiding the need for costly pre-allocated or dedicated hardware.   While an attractive economic proposition, serverless computing currently lags behind the state of the art when it comes to  function composition . This paper addresses the challenge of programming a composition of functions, where the composition is itself a serverless function.   We demonstrate that engineering function composition into a serverless application is possible, but requires a careful evaluation of trade-offs. To help in evaluating these trade-offs, we identify three competing constraints: functions should be considered as  black boxes ; function composition should obey a  substitution principle  with respect to synchronous invocation; and invocations should not be  double-billed .   Furthermore, we argue that, if the serverless runtime is limited to a  reactive core , i.e. one that deals only with dispatching functions in response to events, then these constraints form the  serverless trilemma . Without specific runtime support, compositions-as-functions must violate at least one of the three constraints.   Finally, we demonstrate an extension to the reactive core of an open-source serverless runtime that enables the sequential composition of functions in a trilemma-satisfying way. We conjecture that this technique could be generalized to support other combinations of functions.", "citation": "Citations (2)", "year": "2017", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "oopsla", "authors": ["Ioana Baldini.....http://dblp.org/pers/hd/b/Baldini:Ioana", "Perry Cheng.....http://dblp.org/pers/hd/c/Cheng:Perry", "Stephen J. Fink.....http://dblp.org/pers/hd/f/Fink:Stephen_J=", "Nick Mitchell.....http://dblp.org/pers/hd/m/Mitchell:Nick", "Vinod Muthusamy.....http://dblp.org/pers/hd/m/Muthusamy:Vinod", "Rodric Rabbah.....http://dblp.org/pers/hd/r/Rabbah:Rodric", "Philippe Suter.....http://dblp.org/pers/hd/s/Suter:Philippe", "Olivier Tardieu.....http://dblp.org/pers/hd/t/Tardieu:Olivier"], "pages": 15}