{"title": "LightTouch: Securely connecting wearables to ambient displays with user intent.", "fields": ["shared secret", "computer monitor", "bootstrapping", "wearable computer", "bluetooth"], "abstract": "Wearables are small and have limited user interfaces, so they often wirelessly interface with a personal smartphone/computer to relay information from the wearable for display or other interactions. In this paper, we envision a new method, LightTouch, by which a wearable can establish a secure connection to an ambient display, such as a television or a computer monitor, while ensuring the user's intention to connect to the display. LightTouch uses standard RF methods (like Bluetooth) for communicating the data to display, securely bootstrapped via the visible-light communication (the brightness channel) from the display to the low-cost, low-power, ambient light sensor of a wearable. A screen ‘touch’ gesture is adopted by users to ensure that the modulation of screen brightness can be securely captured by the ambient light sensor with minimized noise. Wireless coordination with the processor driving the display establishes a shared secret based on the brightness channel information. We further propose novel onscreen localization and correlation algorithms to improve security and reliability. Through experiments and a preliminary user study we demonstrate that LightTouch is compatible with current display and wearable designs, is easy to use (about 6 seconds to connect), is reliable (up to 98% success connection ratio), and is secure against attacks.", "citation": "Citations (2)", "departments": ["University of Massachusetts Boston", "Dartmouth College", "Dartmouth College", "Dartmouth College"], "authors": ["Xiaohui Liang.....http://dblp.org/pers/hd/l/Liang:Xiaohui", "Tianlong Yun.....http://dblp.org/pers/hd/y/Yun:Tianlong", "Ronald A. Peterson.....http://dblp.org/pers/hd/p/Peterson:Ronald_A=", "David Kotz.....http://dblp.org/pers/hd/k/Kotz:David"], "conf": "infocom", "year": "2017", "pages": 9}