{"title": "Contextual RNN-GANs for Abstract Reasoning Diagram Generation.", "fields": ["diagram", "diagrammatic reasoning", "generative grammar", "recurrent neural network", "discriminator"], "abstract": "Understanding, predicting, and generating object motions and transformations is a core problem in artificial intelligence. Modeling sequences of evolving images may provide better representations and models of motion and may ultimately be used for forecasting, simulation, or video generation. Diagrammatic Abstract Reasoning is an avenue in which diagrams evolve in complex patterns and one needs to infer the underlying pattern sequence and generate the next image in the sequence. For this, we develop a novel Contextual Generative Adversarial Network based on Recurrent Neural Networks (Context-RNN-GANs), where both the generator and the discriminator modules are based on contextual history (modeled as RNNs) and the adversarial discriminator guides the generator to produce realistic images for the particular time step in the image sequence. We evaluate the Context-RNN-GAN model (and its variants) on a novel dataset of Diagrammatic Abstract Reasoning, where it performs competitively with 10th-grade human performance but there is still scope for interesting improvements as compared to college-grade human performance. We also evaluate our model on a standard video next-frame prediction task, achieving improved performance over comparable state-of-the-art.", "citation": "Citations (8)", "departments": ["University of Oxford", "University of Oxford", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur", "Toyota Technological Institute at Chicago"], "authors": ["Viveka Kulharia.....http://dblp.org/pers/hd/k/Kulharia:Viveka", "Arnab Ghosh.....http://dblp.org/pers/hd/g/Ghosh:Arnab", "Amitabha Mukerjee.....http://dblp.org/pers/hd/m/Mukerjee:Amitabha", "Vinay P. Namboodiri.....http://dblp.org/pers/hd/n/Namboodiri:Vinay_P=", "Mohit Bansal.....http://dblp.org/pers/hd/b/Bansal:Mohit"], "conf": "aaai", "year": "2017", "pages": 7}