{"title": "Judgment Analysis Based on Crowdsourced Opinions.", "fields": ["crowdsourcing", "markov chain", "biclustering", "smart city", "markov process"], "abstract": "A vast majority of the existing crowd opinion aggregation models deal with independent opinions of the crowd workers, where the annotators (crowd workers) provide their opinions unanimously and these opinions are not visible to everyone. But in real life, it is seen that there are many applications in which an annotator can see others' opinions. As a result, there is a high chance that the opinion of an annotator gets biased by the other opinions. My proposed research is about finding a better consensus from multiple crowd opinions (dependent) obtained for a particular question. So, this work addresses a novel problem of dependent judgment analysis and proposes methods that derive the final judgment from a given set of ordered opinions. For the said problem, a Markov chain based aggregation method is proposed that can handle the ordered opinions of the crowd workers, and thus aggregate them to find a consensus. I have used a real-life dataset that contains the independent and dependent crowd opinions over some questions. Furthermore, I am studying a recently proposed model that collects crowd opinions twice (in independent and dependent fashion) to understand their relation. In a recent study, I have proposed a biclustering approach to compute aggregated judgment from multiple crowd opinions. In another current work, I have introduced a new problem dealing with constrained crowd opinions and demonstrated that proper aggregation of those type of opinions can be very helpful for smart city planning. These studies altogether focus on the different novel directions of the judgment analysis problem.", "citation": "Citations (1)", "departments": ["Kalyani Government Engineering College", "Kalyani Government Engineering College", "Indian Institute of Engineering Science and Technology, Shibpur"], "authors": ["Sujoy Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Sujoy", "Anirban Mukhopadhyay.....http://dblp.org/pers/hd/m/Mukhopadhyay_0001:Anirban", "Malay Bhattacharyya.....http://dblp.org/pers/hd/b/Bhattacharyya_0001:Malay"], "conf": "icde", "year": "2017", "pages": 5}