{"title": "Quality-of-Experience of Adaptive Video Streaming: Exploring the Space of Adaptations.", "fields": ["subjective video quality", "quality of experience", "end user", "phenomenon", "video quality"], "abstract": "With the remarkable growth of adaptive streaming media applications, especially the wide usage of dynamic adaptive streaming schemes over HTTP (DASH), it becomes ever more important to understand the perceptual quality-of-experience (QoE) of end users, who may be constantly experiencing adaptations (switchings) of video bitrate, spatial resolution, and frame-rate from one time segment to another in a scale of a few seconds. This is a sophisticated and challenging problem, for which existing visual studies provide very limited guidance. Here we build a new adaptive streaming video database and carry out a series of subjective experiments to understand human QoE behaviors in this multi-dimensional adaptation space. Our study leads to several useful findings. First, our path-analytic results show that quality deviation introduced by quality adaptation is asymmetric with respect to the adaptation direction (positive or negative), and is further influenced by the intensity of quality change ( intensity ), dimension of adaptation ( type ), intrinsic video quality (level), content, and the interactions between them. Second, we find that for the same intensity of quality adaptation, a positive adaptation occurred in the low-quality range has more impact on QoE, suggesting an interesting Weber's law effect; while such phenomenon is reversed for a negative adaptation. Third, existing objective video quality assessment models are very limited in predicting time-varying video quality.", "citation": "Not cited", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Zhengfang Duanmu.....http://dblp.org/pers/hd/d/Duanmu:Zhengfang", "Kede Ma.....http://dblp.org/pers/hd/m/Ma:Kede", "Zhou Wang.....http://dblp.org/pers/hd/w/Wang:Zhou"], "conf": "mm", "year": "2017", "pages": 9}