{"title": "Learning privately: Privacy-preserving canonical correlation analysis for cross-media retrieval.", "fields": ["inverse iteration", "ciphertext", "information sensitivity", "information privacy", "big data"], "abstract": "A massive explosion of various types of data has been triggered in the “Big Data” era. In big data systems, machine learning plays an important role due to its effectiveness in discovering hidden information and valuable knowledge. Data privacy, however, becomes an unavoidable concern since big data usually involve multiple organizations, e.g., different healthcare systems and hospitals, who are not in the same trust domain and may be reluctant to share their data publicly. Applying traditional cryptographic tools is a straightforward approach to protect sensitive information, but it often renders learning algorithms useless inevitably. In this work, we, for the first time, propose a novel privacy-preserving scheme for canonical correlation analysis (CCA), which is a well-known learning technique and has been widely used in cross-media retrieval system. We first develop a library of building blocks to support various arithmetics over encrypted real numbers by leveraging additively homomorphic encryption and garbled circuits. Then we encrypt private data by randomly splitting the numerical data, formalize CCA problem and reduce it to a symmetric eigenvalue problem by designing new protocols for privacy-preserving QR decomposition. Finally, we solve all the eigenvalues and the corresponding eigenvectors by running Newton-Raphson method and inverse power method over the ciphertext domain. We carefully analyze the security and extensively evaluate the effectiveness of our design. The results show that our scheme is practically secure, incurs negligible errors compared with performing CCA in the clear and performs comparably in cross-media retrieval systems.", "citation": "Not cited", "departments": ["Wuhan University", "Wuhan University", "Wuhan University", "Wuhan University", "University at Buffalo"], "authors": ["Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Shengshan Hu.....http://dblp.org/pers/hd/h/Hu:Shengshan", "Minxin Du.....http://dblp.org/pers/hd/d/Du:Minxin", "Jingjun Wang.....http://dblp.org/pers/hd/w/Wang:Jingjun", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui"], "conf": "infocom", "year": "2017", "pages": 9}