{"title": "Deep Siamese Network with Multi-level Similarity Perception for Person Re-identification.", "fields": ["discriminative model", "pairwise comparison", "perception", "convolutional neural network", "architecture"], "abstract": "Person re-identification (re-ID), which aims at spotting a person of interest across multiple camera views, has gained more and more attention in computer vision community. In this paper, we propose a novel deep Siamese architecture based on convolutional neural network (CNN) and multi-level similarity perception. According to the distinct characteristics of diverse feature maps, we effectively apply different similarity constraints to both low-level and high-level feature maps, during training stage. Therefore, our network can efficiently learn discriminative feature representations at different levels, which significantly improves the re-ID performance. Besides, our framework has two additional benefits. Firstly, classification constraints can be easily incorporated into the framework, forming a unified multi-task network with similarity constraints. Secondly, as similarity comparable information has been encoded in the network's learning parameters via back-propagation, pairwise input is not necessary at test time. That means we can extract features of each gallery image and build index in an off-line manner, which is essential for large-scale real-world applications. Experimental results on multiple challenging benchmarks demonstrate that our method achieves splendid performance compared with the current state-of-the-art approaches.", "citation": "Citations (2)", "departments": ["Zhejiang University", "Alibaba Group", "Shanghai Jiao Tong University", "Zhejiang University", "Zhejiang University"], "authors": ["Chen Shen.....http://dblp.org/pers/hd/s/Shen:Chen", "Zhongming Jin.....http://dblp.org/pers/hd/j/Jin:Zhongming", "Yiru Zhao.....http://dblp.org/pers/hd/z/Zhao:Yiru", "Zhihang Fu.....http://dblp.org/pers/hd/f/Fu:Zhihang", "Rongxin Jiang.....http://dblp.org/pers/hd/j/Jiang:Rongxin", "Yaowu Chen.....http://dblp.org/pers/hd/c/Chen:Yaowu", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng"], "conf": "mm", "year": "2017", "pages": 9}