{"title": "TummyTrials: A Feasibility Study of Using Self-Experimentation to Detect Individualized Food Triggers.", "fields": ["everyday life", "management science", "self experimentation", "personally identifiable information", "clinical research"], "abstract": "Diagnostic self-tracking, the recording of personal information to diagnose or manage a health condition, is a common practice, especially for people with chronic conditions. Unfortunately, many who attempt diagnostic self tracking have trouble accomplishing their goals. People often lack knowledge and skills needed to design and conduct scientifically rigorous experiments, and current tools provide little support. To address these shortcomings and explore opportunities for diagnostic self tracking, we designed, developed, and evaluated a mobile app that applies a self experimentation framework to support patients suffering from irritable bowel syndrome (IBS) in identifying their personal food triggers. TummyTrials aids a person in designing, executing, and analyzing self experiments to evaluate whether a specific food triggers their symptoms. We examined the feasibility of this approach in a field study with 15 IBS patients, finding that participants could use the tool to reliably undergo a self-experiment. However, we also discovered an underlying tension between scientific validity and the lived experience of self experimentation. We discuss challenges of applying clinical research methods in everyday life, motivating a need for the design of self experimentation systems to balance rigor with the uncertainties of everyday life.", "citation": "Citations (10)", "year": "2017", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "conf": "chi", "authors": ["Ravi Karkar.....http://dblp.org/pers/hd/k/Karkar:Ravi", "Jessica Schroeder.....http://dblp.org/pers/hd/s/Schroeder:Jessica", "Daniel A. Epstein.....http://dblp.org/pers/hd/e/Epstein:Daniel_A=", "Laura R. Pina.....http://dblp.org/pers/hd/p/Pina:Laura_R=", "Jeffrey Scofield.....http://dblp.org/pers/hd/s/Scofield:Jeffrey", "James Fogarty.....http://dblp.org/pers/hd/f/Fogarty:James", "Julie A. Kientz.....http://dblp.org/pers/hd/k/Kientz:Julie_A=", "Sean A. Munson.....http://dblp.org/pers/hd/m/Munson:Sean_A=", "Roger Vilardaga.....http://dblp.org/pers/hd/v/Vilardaga:Roger", "Jasmine Zia.....http://dblp.org/pers/hd/z/Zia:Jasmine"], "pages": 14}