{"title": "I¿¿¿: a calculus for internet of things automation.", "fields": ["home automation", "domain specific language", "end user", "iota", "ranging"], "abstract": "Programmatically controllable home devices are proliferating, ranging from lights, locks, and motion sensors to smart refrigerators, televisions, and cameras, giving end users unprecedented control over their environment. New domain-specific languages are emerging to supplant general purpose programming platforms as a means for end users to configure home automation. These languages, based on event-condition-action (ECA) rules, have an appealing simplicity. But programmatic control lets users write programs with bugs, introducing the frustrations of software engineering with none of the tool support. The subtle semantics of the home automation domain---and the varying interfaces and implementation strategies that existing home automation platforms use---exacerbates the problem. In this work, we present the Internet of Things Automation (Iota) calculus, the first calculus for the domain of home automation. Iota models an ECA language equipped with first-class notions of time, state, and device aggregation, and comes equipped with a precise semantics inspired by a careful analysis of five existing home automation platforms. We show that the Iota calculus is useful by implementing two analyses from the software engineering literature, and expressive by encoding sixteen programs from these home automation platforms. Along the way, we highlight where the design of the Iota semantics rules out subtle classes of bugs.", "citation": "Not cited", "year": "2017", "departments": ["University of Washington", "Samsung", "Samsung", "Samsung", "Samsung"], "conf": "oopsla", "authors": ["Julie L. Newcomb.....http://dblp.org/pers/hd/n/Newcomb:Julie_L=", "Satish Chandra.....http://dblp.org/pers/hd/c/Chandra_0001:Satish", "Jean-Baptiste Jeannin.....http://dblp.org/pers/hd/j/Jeannin:Jean=Baptiste", "Cole Schlesinger.....http://dblp.org/pers/hd/s/Schlesinger:Cole", "Manu Sridharan.....http://dblp.org/pers/hd/s/Sridharan:Manu"], "pages": 15}