{"title": "User Personalized Satisfaction Prediction via Multiple Instance Deep Learning.", "fields": ["instance based learning", "exploit", "question answering", "knowledge sharing", "deep learning"], "abstract": "Community question answering(CQA) services have arisen as a popular knowledge sharing pattern for netizens. With abundant interactions among users, individuals are capable of obtaining satisfactory information. However, it is not effective for users to attain satisfying answers within minutes. Users have to check the progress over time until the appropriate answers submitted. We address this problem as a user personalized satisfaction prediction task. Existing methods usually exploit manual feature selection. It is not desirable as it requires careful design and is labor intensive. In this paper, we settle this issue by developing a new multiple instance deep learning framework. Specifically, in our settings, each question follows a multiple instance learning assumption, where its obtained answers can be regarded as instance sets in a bag and we define the question resolved with at least one satisfactory answer. We design an efficient framework exploiting multiple instance learning property with deep learning tactic to model the question-answer pairs relevance and rank the asker's satisfaction possibility. Extensive experiments on large-scale datasets from different forums of Stack Exchange demonstrate the feasibility of our proposed framework in predicting asker personalized satisfaction.", "citation": "Not cited", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University"], "authors": ["Zheqian Chen.....http://dblp.org/pers/hd/c/Chen:Zheqian", "Ben Gao.....http://dblp.org/pers/hd/g/Gao:Ben", "Huimin Zhang.....http://dblp.org/pers/hd/z/Zhang:Huimin", "Zhou Zhao.....http://dblp.org/pers/hd/z/Zhao:Zhou", "Haifeng Liu.....http://dblp.org/pers/hd/l/Liu:Haifeng", "Deng Cai.....http://dblp.org/pers/hd/c/Cai:Deng"], "conf": "www", "year": "2017", "pages": 9}