{"title": "ER: Early recognition of inattentive driving leveraging audio devices on smartphones.", "fields": ["computer science", "audio signal", "simulation"], "abstract": "Real-time driving behavior monitoring is a corner stone to improve driving safety. Most of the existing studies on driving behavior monitoring using smartphones only provide detection results after an abnormal driving behavior is finished, not sufficient for driver alert and avoiding car accidents. In this paper, we leverage existing audio devices on smartphones to realize early recognition of inattentive driving events including Fetching Forward, Picking up Drops, Turning Back and Eating or Drinking. Through empirical studies of driving traces collected in real driving environments, we find that each type of inattentive driving event exhibits unique patterns on Doppler profiles of audio signals. This enables us to develop an Early Recognition system, ER, which can recognize inattentive driving events at an early stage and alert drivers timely. ER employs machine learning methods to first generate binary classifiers for every pair of inattentive driving events, and then develops a modified vote mechanism to form a multi-classifier for all inattentive driving events along with other driving behaviors. It next turns the multi-classifier into a gradient model forest to achieve early recognition of inattentive driving. Through extensive experiments with 8 volunteers driving for about half a year, ER can achieve an average total accuracy of 94.80% for inattentive driving recognition and recognize over 80% inattentive driving events before the event is 50% finished.", "citation": "Citations (3)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Stevens Institute of Technology", "Shanghai Jiao Tong University"], "authors": ["Xiangyu Xu.....http://dblp.org/pers/hd/x/Xu:Xiangyu", "Hang Gao.....http://dblp.org/pers/hd/g/Gao:Hang", "Jiadi Yu.....http://dblp.org/pers/hd/y/Yu:Jiadi", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Guangtao Xue.....http://dblp.org/pers/hd/x/Xue:Guangtao", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu"], "conf": "infocom", "year": "2017", "pages": 9}