{"title": "Ontology-Based Approach for Academic Evaluation System.", "fields": ["situated", "upper ontology", "sparql", "process ontology", "ontology based data integration"], "abstract": "Academic evaluation is an important activity regularly conducted by every higher education institution to gauge the performance of education services and help the administrators of the institution improve the quality of those services. Implementation of academic evaluation almost always requires an integration of relevant data, which are often scattered in separate systems. Such an integration effort is often tedious and time consuming because the data must be gathered from different systems, manually integrated, and then presented in a format that meets some pre-determined academic evaluation criteria. One way to help reducing the amount of effort expended in the integration is to make the data available in a format that enables linking between any part of the data and allows various academic evaluation queries to be performed on them. Our work intends to realise this idea by using Semantic Web technologies, in particular ontology and linked data. In particular, our work is situated in a concrete use case based on the academic evaluation process as periodically conducted in Universitas Indonesia (UI). In this paper, we focus on the first step of this effort, namely the development of an ontology for academic evaluation with a particular emphasis on evaluation of undergraduate degree programs in UI. There has been a number of prior work focusing on the development of an ontology for a similar problem, yet none of them takes into account the fact that academic data evolve over time. Our ontology thus accounts for this aspect according to the UIs academic evaluation criteria. We also demonstrate that the ontology can be used as a basis in answering SPARQL queries that capture those criteria, which indicates the suitability and usability of the ontology.", "citation": "Citations (1)", "year": "2017", "departments": [], "conf": "icde", "authors": ["Siti Aminah.....http://dblp.org/pers/hd/a/Aminah:Siti", "Iis Afriyanti.....http://dblp.org/pers/hd/a/Afriyanti:Iis", "Adila Krisnadhi.....http://dblp.org/pers/hd/k/Krisnadhi:Adila"], "pages": 6}