{"title": "Unveiling polarization in social networks: A matrix factorization approach.", "fields": ["almost surely", "matrix decomposition", "cluster analysis", "factorization", "social conflict"], "abstract": "This paper presents unsupervised algorithms to uncover polarization in social networks (namely, Twitter) and identify polarized groups. The approach is language-agnostic and thus broadly applicable to global and multilingual media. In cases of conflict, dispute, or situations involving multiple parties with contrasting interests, opinions get divided into different camps. Previous manual inspection of tweets has shown that such situations produce distinguishable signatures on Twitter, as people take sides leading to clusters that preferentially propagate information confirming their individual cluster-specific bias. We propose a model for polarized social networks, and show that approaches based on factorizing the matrix of sources and their claims can automate the discovery of polarized clusters with no need for prior training or natural language processing. In turn, identifying such clusters offers insights into prevalent social conflicts and helps automate the generation of less biased descriptions of ongoing events. We evaluate our factorization algorithms and their results on multiple Twitter datasets involving polarization of opinions, demonstrating the efficacy of our approach. Experiments show that our method is almost always correct in identifying the polarized information from real-world twitter traces, and outperforms the baseline mechanisms by a large margin.", "citation": "Citations (3)", "departments": ["University of Illinois at Urbana–Champaign", "IBM", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "United States Army Research Laboratory"], "authors": ["Md. Tanvir Al Amin.....http://dblp.org/pers/hd/a/Amin:Md=_Tanvir_Al", "Charu C. Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Charu_C=", "Shuochao Yao.....http://dblp.org/pers/hd/y/Yao:Shuochao", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F=", "Lance M. Kaplan.....http://dblp.org/pers/hd/k/Kaplan:Lance_M="], "conf": "infocom", "year": "2017", "pages": 9}