{"title": "DBF: A general framework for anomaly detection in RFID systems.", "fields": ["wireless", "universal software radio peripheral", "supply chain", "bloom filter", "anomaly detection"], "abstract": "RFID technologies are making their way into numerous applications, including inventory management, supply chain, product tracking, transportation, logistics, etc. One important application is to automatically detect anomalies in RFID systems, such as missing tags, unknown tags, or cloned tags due to theft, management error, or targeted attacks. Existing solutions are all designed to detect a certain type of RFID anomalies, but lack a general functionality for detecting different types of anomalies. This paper attempts to propose a general framework for anomaly detection in RFID systems, thereby reducing the complexity for readers and tags to implement different anomaly-detection protocols. We introduce a new concept of differential Bloom filter (DBF), which turns physical-layer signal data into a segmented Bloom filter that encodes the IDs of abnormal tags. As a case study, we propose a protocol that builds DBF for identifying all missing tags in an efficient way. We implement a prototype for missing-tag identification using USRP and WISP tags to verify the effectiveness our protocol, and use large-scale simulations for performance evaluation. The results show that our solution can significantly improve time efficiency, when comparing with the best existing work.", "citation": "Citations (1)", "departments": ["University of Florida", "Nanjing University", "University of Florida", "University of Florida", "Hong Kong Polytechnic University"], "authors": ["Min Chen.....http://dblp.org/pers/hd/c/Chen_0007:Min", "Jia Liu.....http://dblp.org/pers/hd/l/Liu_0008:Jia", "Shigang Chen.....http://dblp.org/pers/hd/c/Chen:Shigang", "Yan Qiao.....http://dblp.org/pers/hd/q/Qiao:Yan", "Yuanqing Zheng.....http://dblp.org/pers/hd/z/Zheng:Yuanqing"], "conf": "infocom", "year": "2017", "pages": 9}