{"title": "Virtualized Network Service Topology Exploration Using Nepal.", "fields": ["network management station", "network service", "intelligent computer network", "graph database", "virtual network"], "abstract": "Modern communication networks are large, dynamic, and complex. To deploy, maintain, and troubleshoot such networks, it is essential to understand how network elements such as servers, switches, virtual machines, and virtual network functions are connected to one another, and to be able to discover communication paths between them. For network maintenance applications such as troubleshooting and service quality management it is also essential to understand how connections change over time, and be able to pose time-travel queries to retrieve information about past network states. With the industry-wide move to SDNs and virtualized network functions [13], maintaining these inventory databases becomes a critical issue.   We represent a communication network inventory as a graph where the nodes are network entities and edges represent relationships between them, e.g. hosted-on, communicates-with, and so on. We have found that querying such a graph for e.g., troubleshooting, using a typical graph query language is too cumbersome for network analysts.   In this demonstration we present Nepal -- a network path query language which is designed to effectively retrieve desired paths from a network graph. Nepal treats paths as first-class citizens of the language, which achieves closure under composition while maintaining simplicity. The Nepal schema system allows the complexities of items in the inventory database to be abstracted away when desired, and yet provide strongly-typed access. We demonstrate how Nepal path queries can simplify the extraction of information from a dynamic inventory of a multi-layer network and can be used for troubleshooting.", "citation": "Citations (1)", "year": "2017", "departments": ["AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "conf": "sigmod", "authors": ["Pramod A. Jamkhedkar.....http://dblp.org/pers/hd/j/Jamkhedkar:Pramod_A=", "Theodore Johnson.....http://dblp.org/pers/hd/j/Johnson:Theodore", "Yaron Kanza.....http://dblp.org/pers/hd/k/Kanza:Yaron", "Aman Shaikh.....http://dblp.org/pers/hd/s/Shaikh:Aman", "N. K. Shankaranarayanan.....http://dblp.org/pers/hd/s/Shankaranarayanan:N=_K=", "Vladislav Shkapenyuk.....http://dblp.org/pers/hd/s/Shkapenyuk:Vladislav", "Gordon Woodhull.....http://dblp.org/pers/hd/w/Woodhull:Gordon"], "pages": 4}