{"title": "Visual face scanning and emotion perception analysis between autistic and typically developing children.", "fields": ["eye tracking", "emotion classification", "emotion recognition", "emotion perception", "autism"], "abstract": "Autism is a neuro-developmental condition that is characterized by a number of unconventional behaviors such as restricted and repetitive activities. It is often largely attributed to deficiency in communication and social interaction. Therefore, it is difficult to make autistic individuals, especially children, to comply with researches that aim at comprehending this condition. However, with the availability of non-invasive eye-tracking technology, this problem has become easier to deal with. The following research probes into the visual face scanning patterns and emotion recognition between 21 autistic and 21 control or TD (typically developing) children when displayed pictures of 6 basic emotions (happy, sad, angry, disgusted, fearful and surprised). Tobii EyeX Controller was used to attain the gaze data and the data was processed and analyzed in MATLAB. The results revealed that children with autism look less at the core features of the face (eyes, nose and mouth) while scanning faces and have more difficulty in perceiving the correct emotion compared to the typically developing children. This atypical face scanning and lack of preference to the core features of the face can be the reason why autistic individuals have trouble understanding others' emotions and an overall incompetency in communication and social interaction. To delve more into this, further eye-tracking, neuroimaging and behavioral studies should be done in integration.", "citation": "Not cited", "departments": ["University of Dhaka", "University of Dhaka", "University of Dhaka", "University of Dhaka", "University of Dhaka"], "authors": ["Uzma Haque Syeda.....http://dblp.org/pers/hd/s/Syeda:Uzma_Haque", "Ziaul Zafar.....http://dblp.org/pers/hd/z/Zafar:Ziaul", "Zishan Zahidul Islam.....http://dblp.org/pers/hd/i/Islam:Zishan_Zahidul", "Syed Mahir Tazwar.....http://dblp.org/pers/hd/t/Tazwar:Syed_Mahir", "Miftahul Jannat Rasna.....http://dblp.org/pers/hd/r/Rasna:Miftahul_Jannat", "Koichi Kise.....http://dblp.org/pers/hd/k/Kise:Koichi", "Md. Atiqur Rahman Ahad.....http://dblp.org/pers/hd/a/Ahad:Md=_Atiqur_Rahman"], "conf": "huc", "year": "2017", "pages": 10}