{"title": "The MONDO collaboration framework: secure collaborative modeling over existing version control systems.", "fields": ["merge", "bottleneck", "scalability", "asynchronous communication", "usability"], "abstract": "Model-based systems engineering of critical cyber-physical systems necessitates effective collaboration between different stakeholders while still providing secure protection of intellectual properties of all involved parties. While engineering artifacts are frequently stored in version control repositories, secure access control is limited to file-level strategies in most existing frameworks where models are split into multiple fragments with all-or-nothing permissions, which becomes a scalability and usability bottleneck in case of complex industrial models.     In this paper, we introduce the MONDO Collaboration Framework, which provides rule-based fine-grained model-level secure access control, property-based locking and automated model merge integrated over existing version control systems such as Subversion (SVN) for storage and version control. Our framework simultaneously supports offline collaboration (asynchronous checkout-modify-commit) on top of off-the-shelf modeling tools and online scenarios (GoogleDocs-style short transactions) scenarios by offering a web-based modeling frontend.     Screencast Demo: https://youtu.be/Ix3CgmsYIU0", "citation": "Citations (1)", "departments": ["Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics"], "authors": ["Csaba Debreceni.....http://dblp.org/pers/hd/d/Debreceni:Csaba", "Gábor Bergmann.....http://dblp.org/pers/hd/b/Bergmann:G=aacute=bor", "Márton Búr.....http://dblp.org/pers/hd/b/B=uacute=r:M=aacute=rton", "István Ráth.....http://dblp.org/pers/hd/r/R=aacute=th:Istv=aacute=n", "Dániel Varró.....http://dblp.org/pers/hd/v/Varr=oacute=:D=aacute=niel"], "conf": "sigsoft", "year": "2017", "pages": 5}