{"title": "DRISA: a DRAM-based reconfigurable in-situ accelerator.", "fields": ["uniform memory access", "interleaved memory", "memory rank", "cuda pinned memory", "computing with memory"], "abstract": "Data movement between the processing units and the memory in traditional  von Neumann  architecture is creating the \"memory wall\" problem. To bridge the gap, two approaches, the memory-rich processor (more on-chip memory) and the compute-capable memory (processing-in-memory) have been studied. However, the first one has strong computing capability but limited memory capacity/bandwidth, whereas the second one is the exact the opposite.     To address the challenge, we propose DRISA, a DRAM-based Reconfigurable In-Situ Accelerator architecture, to provide both powerful computing capability and large memory capacity/bandwidth. DRISA is primarily composed of DRAM memory arrays, in which every memory bitline can perform bitwise Boolean logic operations (such as NOR). DRISA can be reconfigured to compute various functions with the combination of the functionally complete Boolean logic operations and the proposed hierarchical internal data movement designs.We further optimize DRISA to achieve high performance by simultaneously activating multiple rows and subarrays to provide massive parallelism, unblocking the internal data movement bottlenecks, and optimizing activation latency and energy. We explore four design options and present a comprehensive case study to demonstrate significant acceleration of convolutional neural networks. The experimental results show that DRISA can achieve 8.8x speedup and 1.2x better energy efficiency compared with ASICs, and 7.7x speedup and 15x better energy efficiency over GPUs with integer operations.", "citation": "Citations (3)", "departments": ["University of California, Berkeley", "University of California", "Samsung", "Samsung", "Samsung", "Samsung"], "authors": ["Shuangchen Li.....http://dblp.org/pers/hd/l/Li:Shuangchen", "Dimin Niu.....http://dblp.org/pers/hd/n/Niu:Dimin", "Krishna T. Malladi.....http://dblp.org/pers/hd/m/Malladi:Krishna_T=", "Hongzhong Zheng.....http://dblp.org/pers/hd/z/Zheng:Hongzhong", "Bob Brennan.....http://dblp.org/pers/hd/b/Brennan:Bob", "Yuan Xie.....http://dblp.org/pers/hd/x/Xie_0001:Yuan"], "conf": "micro", "year": "2017", "pages": 14}