{"title": "Analysis of tandem PIT and CS with non-zero download delay.", "fields": ["download", "random variable", "cache", "architecture", "server"], "abstract": "Collapsed forwarding has long been used in cache systems to reduce the load on servers by aggregating requests for the same content. Named Data Networking (NDN) as a future Internet architecture incorporates this technique through a data structure called Pending Interest Table (PIT). The request aggregation feature suggests that PIT can be viewed as a nonreset time-to-live (TTL) based cache. The Content Store (CS) is a content cache placed in front of the PIT on the NDN forwarding path, so they make up a tandem cache network. To investigate the metrics of interest in this network, like the hit probability for the PIT and the CS, the expected PIT size, non-zero download delay (non-ZDD) should be taken into consideration. Caching policies usually assume zero download delay (ZDD), i.e., request and object arrive simultaneously, and numerous analytical methods have been proposed to study the ZDD caching policies. In this paper, after dissecting the LRU policy, we for the first time propose two LRU variants considering non-ZDD by defining separate operations for the request and object arrivals. When CS adopts the proposed LRU variants, the analysis of the CS-PIT network can still take advantage of the existing models, so the metrics of interest can be computed. Especially, the distribution for the “inter-miss” time of this network can be derived, which has not been achieved by prior works. Finally, the analytical results are verified through simulations.", "citation": "Not cited", "departments": ["Tsinghua University", "Tsinghua University", "Washington University in St. Louis", "Washington University in St. Louis", "Tsinghua University"], "authors": ["Huichen Dai.....http://dblp.org/pers/hd/d/Dai:Huichen", "Bin Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bin", "Haowei Yuan.....http://dblp.org/pers/hd/y/Yuan:Haowei", "Patrick Crowley.....http://dblp.org/pers/hd/c/Crowley:Patrick", "Jianyuan Lu.....http://dblp.org/pers/hd/l/Lu:Jianyuan"], "conf": "infocom", "year": "2017", "pages": 9}