{"title": "A signaling game model for moving target defense.", "fields": ["active defense", "information asymmetry", "exploit", "signaling game", "stackelberg competition"], "abstract": "Incentive-driven advanced attacks have become a major concern to cyber-security. Traditional defense techniques that adopt a passive and static approach by assuming a fixed attack type are insufficient in the face of highly adaptive and stealthy attacks. In particular, a passive defense approach often creates information asymmetry where the attacker knows more about the defender. To this end, moving target defense (MTD) has emerged as a promising way to reverse this information asymmetry. The main idea of MTD is to (continuously) change certain aspects of the system under control to increase the attacker's uncertainty, which in turn increases attack cost/complexity and reduces the chance of a successful exploit in a given amount of time. In this paper, we go one step beyond and show that MTD can be further improved when combined with information disclosure. In particular, we consider that the defender adopts a MTD strategy to protect a critical resource across a network of nodes, and propose a Bayesian Stackelberg game model with the defender as the leader and the attacker as the follower. After fully characterizing the defender's optimal migration strategies, we show that the defender can design a signaling scheme to exploit the uncertainty created by MTD to further affect the attacker's behavior for its own advantage. We obtain conditions under which signaling is useful, and show that strategic information disclosure can be a promising way to further reverse the information asymmetry and achieve more efficient active defense.", "citation": "Citations (1)", "departments": ["University of California, Davis", "Tulane University", "United States Army Research Laboratory", "University of California, Davis", "US Army CERDEC, USA"], "authors": ["Xiaotao Feng.....http://dblp.org/pers/hd/f/Feng:Xiaotao", "Zizhan Zheng.....http://dblp.org/pers/hd/z/Zheng:Zizhan", "Derya Cansever.....http://dblp.org/pers/hd/c/Cansever:Derya", "Ananthram Swami.....http://dblp.org/pers/hd/s/Swami:Ananthram", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant"], "conf": "infocom", "year": "2017", "pages": 9}