{"title": "From Hard to Soft: Towards more Human-like Emotion Recognition by Modelling the Perception Uncertainty.", "fields": ["long short term memory", "exploit", "subjectivity", "emotion recognition", "multi task learning"], "abstract": "Over the last decade, automatic emotion recognition has become well established. The gold standard target is thereby usually calculated based on multiple annotations from different raters. All related efforts assume that the emotional state of a human subject can be identified by a 'hard' category or a unique value. This assumption tries to ease the human observer's subjectivity when observing patterns such as the emotional state of others. However, as the number of annotators cannot be infinite, uncertainty remains in the emotion target even if calculated from several, yet few human annotators. The common procedure to use this same emotion target in the learning process thus inevitably introduces noise in terms of an uncertain learning target. In this light, we propose a 'soft' prediction framework to provide a more human-like and comprehensive prediction of emotion. In our novel framework, we provide an additional target to indicate the uncertainty of human perception based on the inter-rater disagreement level, in contrast to the traditional framework which is merely producing one single prediction (category or value). To exploit the dependency between the emotional state and the newly introduced perception uncertainty, we implement a multi-task learning strategy. To evaluate the feasibility and effectiveness of the proposed soft prediction framework, we perform extensive experiments on a time- and value-continuous spontaneous audiovisual emotion database including late fusion results. We show that the soft prediction framework with multi-task learning of the emotional state and its perception uncertainty significantly outperforms the individual tasks in both the arousal and valence dimensions.", "citation": "Citations (2)", "departments": ["University of Augsburg", "University of Passau", "University of Augsburg", "Imperial College London", "University of Augsburg"], "authors": ["Jing Han.....http://dblp.org/pers/hd/h/Han_0010:Jing", "Zixing Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Zixing", "Maximilian Schmitt.....http://dblp.org/pers/hd/s/Schmitt:Maximilian", "Maja Pantic.....http://dblp.org/pers/hd/p/Pantic:Maja", "Björn W. Schuller.....http://dblp.org/pers/hd/s/Schuller:Bj=ouml=rn_W="], "conf": "mm", "year": "2017", "pages": 8}