{"title": "Deep Attribute-preserving Metric Learning for Natural Language Object Retrieval.", "fields": ["expression", "exploit", "feature learning", "bridging", "visual objects"], "abstract": "Retrieving image content with a natural language expression is an emerging interdisciplinary problem at the intersection of multimedia, natural language processing and artificial intelligence. Existing methods tackle this challenging problem by learning features from the visual and linguistic domains independently while the critical semantic correlations bridging two domains have been under-explored in the feature learning process. In this paper, we propose to exploit sharable semantic attributes as \"anchors\" to ensure the learned features are well aligned across domains for better object retrieval. We define \"attributes\" as the common concepts that are informative for object retrieval and can be easily learned from both visual content and language expression. In particular, diverse and complex attributes (e.g., location, color, category, interaction between object and context) are modeled and incorporated to promote cross-domain alignment for feature learning from multiple perspectives. Based on the sharable attributes, we propose a deep Attribute-Preserving Metric learning (AP-Metric) framework that jointly generates unique query-sensitive region proposals and conducts novel cross-modal feature learning that explicitly pursues consistency over semantic attribute abstraction within both domains for deep metric learning. Benefiting from the cross-modal semantic correlations, our proposed framework can localize challenging visual objects to match complex query expressions within cluttered background accurately. The overall framework is end-to-end trainable. Extensive evaluations on popular datasets including ReferItGame, RefCOCO, and RefCOCO+ well demonstrate its superiority. Notably, it achieves state-of-the-art performance on the challenging ReferItGame dataset.", "citation": "Not cited", "departments": ["Beijing Institute of Technology", "National University of Singapore", "Carnegie Mellon University", "National University of Singapore", "National University of Singapore"], "authors": ["Jianan Li.....http://dblp.org/pers/hd/l/Li:Jianan", "Yunchao Wei.....http://dblp.org/pers/hd/w/Wei:Yunchao", "Xiaodan Liang.....http://dblp.org/pers/hd/l/Liang:Xiaodan", "Fang Zhao.....http://dblp.org/pers/hd/z/Zhao_0006:Fang", "Jianshu Li.....http://dblp.org/pers/hd/l/Li:Jianshu", "Tingfa Xu.....http://dblp.org/pers/hd/x/Xu:Tingfa", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi"], "conf": "mm", "year": "2017", "pages": 9}