{"title": "Community Preserving Network Embedding.", "fields": ["modularity", "exploit", "non negative matrix factorization", "feature learning", "correctness"], "abstract": "Network embedding, aiming to learn the low-dimensional representations of nodes in networks, is of paramount importance in many real applications. One basic requirement of network embedding is to preserve the structure and inherent properties of the networks. While previous network embedding methods primarily preserve the microscopic structure, such as the first- and second-order proximities of nodes, the mesoscopic community structure, which is one of the most prominent feature of networks, is largely ignored. In this paper, we propose a novel Modularized Nonnegative Matrix Factorization (M-NMF) model to incorporate the community structure into network embedding. We exploit the consensus relationship between the representations of nodes and community structure, and then jointly optimize NMF based representation learning model and modularity based community detection model in a unified framework, which enables the learned representations of nodes to preserve both of the microscopic and community structures. We also provide efficient updating rules to infer the parameters of our model, together with the correctness and convergence guarantees. Extensive experimental results on a variety of real-world networks show the superior performance of the proposed method over the state-of-the-arts.", "citation": "Citations (90)", "departments": ["Tsinghua University", "Tsinghua University", "Bournemouth University", "Simon Fraser University", "Tsinghua University"], "authors": ["Xiao Wang.....http://dblp.org/pers/hd/w/Wang:Xiao", "Peng Cui.....http://dblp.org/pers/hd/c/Cui_0001:Peng", "Jing Wang.....http://dblp.org/pers/hd/w/Wang_0023:Jing", "Jian Pei.....http://dblp.org/pers/hd/p/Pei:Jian", "Wenwu Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Wenwu", "Shiqiang Yang.....http://dblp.org/pers/hd/y/Yang:Shiqiang"], "conf": "aaai", "year": "2017", "pages": 7}