{"title": "RSPP: A reliable, searchable and privacy-preserving e-healthcare system for cloud-assisted body area networks.", "fields": ["delegation", "encryption", "message authentication code", "digital transformation", "cloud storage"], "abstract": "The integration of cloud computing and Internet of Things (loT) is quickly becoming the key enabler for the digital transformation of the healthcare industry by offering comprehensive improvements in patient engagements, productivity and risk mitigation. This paradigm shift, while bringing numerous benefits and new opportunities to healthcare organizations, has raised a lot of security and privacy concerns. In this paper, we present a reliable, searchable and privacy-preserving e-healthcare system, which takes advantage of emerging cloud storage and IoT infrastructure and enables healthcare service providers (HSPs) to realize remote patient monitoring in a secure and regulatory compliant manner. Our system is built upon a novel dynamic searchable symmetric encryption scheme with forward privacy and delegated verifiability for periodically generated healthcare data. While the forward privacy is achieved by maintaining an increasing counter for each keyword at an IoT gateway, the data owner delegated verifiability comes from the combination of the Bloom filter and aggregate message authentication code. Moreover, our system is able to support multiple HSPs through either data owner assistance or delegation. The detailed security analysis as well as the extensive simulations on a large data set with millions of records demonstrate the practical efficiency of the proposed system for real world healthcare applications.", "citation": "Citations (1)", "departments": ["University of Kansas", "Bosch", "Bosch"], "authors": ["Lei Yang.....http://dblp.org/pers/hd/y/Yang:Lei", "Qingji Zheng.....http://dblp.org/pers/hd/z/Zheng:Qingji", "Xinxin Fan.....http://dblp.org/pers/hd/f/Fan:Xinxin"], "conf": "infocom", "year": "2017", "pages": 9}