{"title": "The Impact of Assistive Technology on Communication Quality Between Deaf and Hearing Individuals.", "fields": ["human computer interaction", "conversation", "sign language", "focus group", "communication"], "abstract": "Deaf individuals often experience communication difficulties in face-to-face interactions with hearing people. In order to support deaf individuals in such situations, an active stream of assistive technology (AT) research focuses on real-time translation of sign language. We investigate the impact of real-time translation-based ATs on communication quality between deaf and hearing individuals. We conducted a focus group and aWizard of Oz study in which deaf and hearing participants jointly interacted with different assistive technologies. We find that while ATs facilitate communication, communication quality is degraded by to breaks in the conversation. Using Co-Cultural Theory, we identify deaf people as a subordinate group inside a hearing society. Our results indicate that current ATs reinforce this subordination by emphasizing deficiency of mastering the dominant form of communication. Based on our findings, we propose a change in design perspective by enabling the hearing to sign rather than the deaf to \"hear\". We argue that ATs should not be seen as \"just\" a tool for the Deaf but rather as a collaborative technology.", "citation": "Citations (2)", "departments": ["University of Ulm", "University of Ulm", "University of Michigan", "University of Ulm", "University of Ulm"], "authors": ["Jan Gugenheimer.....http://dblp.org/pers/hd/g/Gugenheimer:Jan", "Katrin Plaumann.....http://dblp.org/pers/hd/p/Plaumann:Katrin", "Florian Schaub.....http://dblp.org/pers/hd/s/Schaub:Florian", "Patrizia Di Campli San Vito.....http://dblp.org/pers/hd/v/Vito:Patrizia_Di_Campli_San", "Saskia Duck.....http://dblp.org/pers/hd/d/Duck:Saskia", "Melanie Rabus.....http://dblp.org/pers/hd/r/Rabus:Melanie", "Enrico Rukzio.....http://dblp.org/pers/hd/r/Rukzio:Enrico"], "conf": "cscw", "year": "2017", "pages": 14}