{"title": "When Will Negotiation Agents Be Able to Represent Us? The Challenges and Opportunities for Autonomous Negotiators.", "fields": ["negotiation", "management science", "autonomy", "internet of things", "smart grid"], "abstract": "textabstractComputers that negotiate on our behalf hold great\npromise for the future and will even become indispensable in emerging\napplication domains such as the smart grid and the Internet of Things.\nMuch research has thus been expended to create agents that are able to\nnegotiate in an abundance of circumstances. However, up until now, truly\nautonomous negotiators have rarely been deployed in real-world\napplications. This paper sizes up current negotiating agents and\nexplores a number of technological, societal and ethical challenges that\nautonomous negotiation systems have brought about. The questions we\naddress are: in what sense are these systems autonomous, what has been\nholding back their further proliferation, and is their spread something\nwe should encourage? We relate the automated negotiation research agenda\nto dimensions of autonomy and distill three major themes that we believe\nwill propel autonomous negotiation forward: accurate representation,\nlong-term perspective, and user trust. We argue these orthogonal\nresearch directions need to be aligned and advanced in unison to sustain\ntangible progress in the field.", "citation": "Citations (3)", "year": "2017", "departments": ["Centrum Wiskunde & Informatica", "Centrum Wiskunde & Informatica", "University of Southampton", "Delft University of Technology", "University of Southern California"], "conf": "ijcai", "authors": ["Tim Baarslag.....http://dblp.org/pers/hd/b/Baarslag:Tim", "Michael Kaisers.....http://dblp.org/pers/hd/k/Kaisers:Michael", "Enrico H. Gerding.....http://dblp.org/pers/hd/g/Gerding:Enrico_H=", "Catholijn M. Jonker.....http://dblp.org/pers/hd/j/Jonker:Catholijn_M=", "Jonathan Gratch.....http://dblp.org/pers/hd/g/Gratch:Jonathan"], "pages": 7}