{"title": "Source-LDA: Enhancing Probabilistic Topic Models Using Prior Knowledge Sources.", "fields": ["hyperparameter", "probabilistic logic", "topic model", "dirichlet distribution", "latent dirichlet allocation"], "abstract": "Topic modeling has increasingly attracted interests from researchers. Common methods of topic modeling usually produce a collection of unlabeled topics where each topic is depicted by a distribution of words. Associating semantic meaning with these word distributions is not always straightforward. Traditionally, this task is left to human interpretation. Manually labeling the topics is unfortunately not always easy, as topics generated by unsupervised learning methods do not necessarily align well with our prior knowledge in the subject domains. Currently, two approaches to solve this issue exist. The first is a post-processing procedure that assigns each topic with a label from the prior knowledge base that is semantically closest to the word distribution of the topic. The second is a supervised topic modeling approach that restricts the topics to a predefined set whose word distributions are provided beforehand. Neither approach is ideal, as the former may produce labels that do not accurately describe the word distributions, and the latter lacks the ability to detect unknown topics that are crucial to enrich our knowledge base. Our goal in this paper is to introduce a semisupervised Latent Dirichlet allocation (LDA) model, Source-LDA, which incorporates prior knowledge to guide the topic modeling process to improve both the quality of the resulting topics and of the topic labeling. We accomplish this by integrating existing labeled knowledge sources representing known potential topics into a probabilistic topic model. These knowledge sources are translated into a distribution and used to set the hyperparameters of the Dirichlet generated distribution over words. This approach ensures that the topic inference process is consistent with existing knowledge, and simultaneously, allows for discovery of new topics. The results show improved topic generation and increased accuracy in topic labeling when compared to those obtained using various labeling approaches based off LDA.", "citation": "Citations (4)", "departments": ["University of California, Los Angeles"], "authors": ["Justin Wood.....http://dblp.org/pers/hd/w/Wood:Justin", "Patrick Tan.....http://dblp.org/pers/hd/t/Tan:Patrick", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0010:Wei", "Corey W. Arnold.....http://dblp.org/pers/hd/a/Arnold:Corey_W="], "conf": "icde", "year": "2017", "pages": 12}