{"title": "Interactive Learning from Policy-Dependent Human Feedback.", "fields": ["simulation", "negative feedback", "feature", "interactive learning", "local optimum"], "abstract": "For agents and robots to become more useful, they must be able to quickly learn from non-technical users. This paper investigates the problem of interactively learning behaviors communicated by a human teacher using positive and negative feedback. Much previous work on this problem has made the assumption that people provide feedback for decisions that is dependent on the behavior they are teaching and is independent from the learner's current policy. We present empirical results that show this assumption to be false---whether human trainers give a positive or negative feedback for a decision is influenced by the learner's current policy. We argue that policy-dependent feedback, in addition to being commonplace, enables useful training strategies from which agents should benefit. Based on this insight, we introduce Convergent Actor-Critic by Humans (COACH), an algorithm for learning from policy-dependent feedback that converges to a local optimum. Finally, we demonstrate that COACH can successfully learn multiple behaviors on a physical robot, even with noisy image features.", "citation": "Citations (2)", "year": "2017", "departments": ["Brown University", "Brown University", "North Carolina State University", "Washington State University", "Brown University"], "conf": "icml", "authors": ["James MacGlashan.....http://dblp.org/pers/hd/m/MacGlashan:James", "Mark K. Ho.....http://dblp.org/pers/hd/h/Ho:Mark_K=", "Robert Tyler Loftin.....http://dblp.org/pers/hd/l/Loftin:Robert_Tyler", "Bei Peng.....http://dblp.org/pers/hd/p/Peng:Bei", "Guan Wang.....http://dblp.org/pers/hd/w/Wang:Guan", "David L. Roberts.....http://dblp.org/pers/hd/r/Roberts:David_L=", "Matthew E. Taylor.....http://dblp.org/pers/hd/t/Taylor:Matthew_E=", "Michael L. Littman.....http://dblp.org/pers/hd/l/Littman:Michael_L="], "pages": 10}