{"title": "Photo2Trip: Exploiting Visual Contents in Geo-tagged Photos for Personalized Tour Recommendation.", "fields": ["recommender system", "multimedia", "probabilistic logic", "optimization problem", "collaborative filtering"], "abstract": "Recently accumulated massive amounts of geo-tagged photos provide an excellent opportunity to understand human behaviors and can be used for personalized tour recommendation. However, no existing work has considered the visual content information in these photos for tour recommendation. We believe the visual features of photos provide valuable information on measuring user / Point-of-Interest (POI) similarities, which is challenging due to data sparsity. To this end, in this paper, we propose a visual feature enhanced tour recommender system, named 'Photo2Trip', to utilize the visual contents and collaborative filtering models for recommendation. Specifically, we first extract various visual features from photos taken by tourists. Then, we propose a Visual-enhanced Probabilistic Matrix Factorization model (VPMF), which integrates visual features into the collaborative filtering model, to learn user interests by leveraging the historical travel records. Moreover, user interests together with trip constraints are formalized to an optimization problem for trip planning. Finally, the experimental results on real-world data show that our proposed visual-enhanced personalized tour recommendation method outperforms other benchmark methods in terms of recommendation accuracy. The results also show that visual features are effective on alleviating the data sparsity and cold start problems on personalized tour recommendation.", "citation": "Citations (2)", "departments": ["Soochow University", "Soochow University", "Rutgers University", "University of Central Arkansas", "Soochow University"], "authors": ["Pengpeng Zhao.....http://dblp.org/pers/hd/z/Zhao:Pengpeng", "Xiefeng Xu.....http://dblp.org/pers/hd/x/Xu:Xiefeng", "Yanchi Liu.....http://dblp.org/pers/hd/l/Liu:Yanchi", "Victor S. Sheng.....http://dblp.org/pers/hd/s/Sheng:Victor_S=", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Hui Xiong.....http://dblp.org/pers/hd/x/Xiong:Hui"], "conf": "mm", "year": "2017", "pages": 9}