{"title": "Drizzle: Fast and Adaptable Stream Processing at Scale.", "fields": ["stream processing", "latency", "drizzle", "adaptability", "low latency"], "abstract": "Large scale streaming systems aim to provide high throughput and low latency. They are often used to run mission-critical applications, and must be available 24x7. Thus such systems need to adapt to failures and inherent changes in workloads, with minimal impact on latency and throughput. Unfortunately, existing solutions require operators to choose between achieving low latency during normal operation and incurring minimal impact during adaptation. Continuous operator streaming systems, such as Naiad and Flink, provide low latency during normal execution but incur high overheads during adaptation (e.g., recovery), while micro-batch systems, such as Spark Streaming and FlumeJava, adapt rapidly at the cost of high latency during normal operations.   Our key observation is that while streaming workloads require millisecond-level processing, workload and cluster properties change less frequently. Based on this, we develop Drizzle, a system that decouples the processing interval from the coordination interval used for fault tolerance and adaptability. Our experiments on a 128 node EC2 cluster show that on the Yahoo Streaming Benchmark, Drizzle can achieve end-to-end record processing latencies of less than 100ms and can get 2-3x lower latency than Spark. Drizzle also exhibits better adaptability, and can recover from failures 4x faster than Flink while having up to 13x lower latency during recovery.", "citation": "Citations (12)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Databricks"], "authors": ["Shivaram Venkataraman.....http://dblp.org/pers/hd/v/Venkataraman:Shivaram", "Aurojit Panda.....http://dblp.org/pers/hd/p/Panda:Aurojit", "Kay Ousterhout.....http://dblp.org/pers/hd/o/Ousterhout:Kay", "Michael Armbrust.....http://dblp.org/pers/hd/a/Armbrust:Michael", "Ali Ghodsi.....http://dblp.org/pers/hd/g/Ghodsi_0002:Ali", "Michael J. Franklin.....http://dblp.org/pers/hd/f/Franklin:Michael_J=", "Benjamin Recht.....http://dblp.org/pers/hd/r/Recht:Benjamin", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "conf": "sosp", "year": "2017", "pages": 16}