{"title": "Summarizer: trading communication with computing near storage.", "fields": ["application programming interface", "nvm express", "design space exploration", "flash file system", "bottleneck"], "abstract": "Modern data center solid state drives (SSDs) integrate multiple general-purpose embedded cores to manage flash translation layer, garbage collection, wear-leveling, and etc., to improve the performance and the reliability of SSDs. As the performance of these cores steadily improves there are opportunities to repurpose these cores to perform application driven computations on stored data, with the aim of reducing the communication between the host processor and the SSD. Reducing host-SSD bandwidth demand cuts down the I/O time which is a bottleneck for many applications operating on large data sets. However, the embedded core performance is still significantly lower than the host processor, as generally wimpy embedded cores are used within SSD for cost effective reasons. So there is a trade-off between the computation overhead associated with near SSD processing and the reduction in communication overhead to the host system.   In this work, we design a set of application programming interfaces (APIs) that can be used by the host application to offload a data intensive task to the SSD processor. We describe how these APIs can be implemented by simple modifications to the existing Non-Volatile Memory Express (NVMe) command interface between the host and the SSD processor. We then quantify the computation versus communication tradeoffs for near storage computing using applications from two important domains, namely data analytics and data integration. Using a fully functional SSD evaluation platform we perform design space exploration of our proposed approach by varying the bandwidth and computation capabilities of the SSD processor. We evaluate static and dynamic approaches for dividing the work between the host and SSD processor, and show that our design may improve the performance by up to 20% when compared to processing at the host processor only, and 6X when compared to processing at the SSD processor only.", "citation": "Citations (1)", "departments": ["University of Southern California", "University of Southern California", "North Carolina State University", "University of Southern California", "University of California, Berkeley", "University of California"], "authors": ["Gunjae Koo.....http://dblp.org/pers/hd/k/Koo:Gunjae", "Kiran Kumar Matam.....http://dblp.org/pers/hd/m/Matam:Kiran_Kumar", "Te I.....http://dblp.org/pers/hd/i/I:Te", "H. V. Krishna Giri Narra.....http://dblp.org/pers/hd/n/Narra:H=_V=_Krishna_Giri", "Jing Li.....http://dblp.org/pers/hd/l/Li_0021:Jing", "Hung-Wei Tseng.....http://dblp.org/pers/hd/t/Tseng:Hung=Wei", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven", "Murali Annavaram.....http://dblp.org/pers/hd/a/Annavaram:Murali"], "conf": "micro", "year": "2017", "pages": 13}