{"title": "Rate-aware flow scheduling for commodity data center networks.", "fields": ["user space", "test data generation", "linux kernel", "shortest remaining time", "server"], "abstract": "Flow completion times (FCTs) are critical for many cloud applications. To minimize the average FCT, recent transport designs, such as pFabric, PASE, and PIAS, approximate the Shortest Remaining Time First (SRTF) scheduling. A common, implicit assumption of these solutions is that the remaining time is only determined by the remaining flow size. However, this assumption does not hold in many real-world scenarios where applications generate data at diverse rates that are smaller than the network capacity. In this paper, we look into this issue from system perspective and find that the operating system (OS) kernel can be exploited to better estimate the remaining time of a flow. In particular, we use the rate of copying data from user space to kernel space to measure the data generation rate. We design RAX, a rate aware flow scheduling method, that calculates the remaining time of a flow more accurately, based on not only the flow size but also the data generation rate. We have implemented a RAX prototype in Linux kernel and evaluated it through testbed experiments and ns-2 simulations. Our testbed results show that RAX reduces FCT by up to 14.9%/41.8% and 7.8%/22.9% over DCTCP and PIAS for all/medium flows respectively.", "citation": "Not cited", "departments": ["National University of Defense Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "KAIST", "National University of Defense Technology"], "authors": ["Ziyang Li.....http://dblp.org/pers/hd/l/Li:Ziyang", "Wei Bai.....http://dblp.org/pers/hd/b/Bai_0001:Wei", "Kai Chen.....http://dblp.org/pers/hd/c/Chen_0005:Kai", "Dongsu Han.....http://dblp.org/pers/hd/h/Han:Dongsu", "Yiming Zhang.....http://dblp.org/pers/hd/z/Zhang:Yiming", "Dongsheng Li.....http://dblp.org/pers/hd/l/Li:Dongsheng", "Hongfang Yu.....http://dblp.org/pers/hd/y/Yu:Hongfang"], "conf": "infocom", "year": "2017", "pages": 9}