{"title": "FitCoach: Virtual fitness coach empowered by wearable mobile devices.", "fields": ["wearable computer", "robustness", "mobile device", "wearable technology", "simulation"], "abstract": "Acknowledging the powerful sensors on wearables and smartphones enabling various applications to improve users' life styles and qualities (e.g., sleep monitoring and running rhythm tracking), this paper takes one step forward developing FitCoach, a virtual fitness coach leveraging users' wearable mobile devices (including wrist-worn wearables and arm-mounted smartphones) to assess dynamic postures (movement patterns & positions) in workouts. FitCoach aims to help the user to achieve effective workout and prevent injury by dynamically depicting the short-term and long-term picture of a user's workout based on various sensors in wearable mobile devices. In particular, FitCoach recognizes different types of exercises and interprets fine-grained fitness data (i.e., motion strength and speed) to an easy-to-understand exercise review score, which provides a comprehensive workout performance evaluation and recommendation. FitCoach has the ability to align the sensor readings from wearable devices to the human coordinate system, ensuring the accuracy and robustness of the system. Extensive experiments with over 5000 repetitions of 12 types of exercises involve 12 participants doing both anaerobic and aerobic exercises in indoors as well as outdoors. Our results demonstrate that FitCoach can provide meaningful review and recommendations to users by accurately measure their workout performance and achieve 93% accuracy for workout analysis.", "citation": "Not cited", "departments": ["Stevens Institute of Technology", "Stevens Institute of Technology", "Stevens Institute of Technology"], "authors": ["Xiaonan Guo.....http://dblp.org/pers/hd/g/Guo:Xiaonan", "Jian Liu.....http://dblp.org/pers/hd/l/Liu_0001:Jian", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying"], "conf": "infocom", "year": "2017", "pages": 9}