{"title": "Programming bots by synthesizing natural language expressions into API invocations.", "fields": ["source lines of code", "graph", "theoretical computer science", "expression", "natural language"], "abstract": "At present, bots are still in their preliminary stages of development. Many are relatively simple, or developed ad-hoc for a very specific use-case. For this reason, they are typically programmed manually, or utilize machine-learning classifiers to interpret a fixed set of user utterances. In reality, real world conversations with humans require support for dynamically capturing users expressions. Moreover, bots will derive immeasurable value by programming them to invoke APIs for their results. Today, within the Web and Mobile development community, complex applications are being stringed together with a few lines of code — all made possible by APIs. Yet, developers today are not as empowered to program bots in much the same way. To overcome this, we introduce BotBase, a bot programming platform that dynamically synthesizes natural language user expressions into API invocations. Our solution is two faceted: Firstly, we construct an API knowledge graph to encode and evolve APIs; secondly, leveraging the above we apply techniques in NLP, ML and Entity Recognition to perform the required synthesis from natural language user expressions into API calls.", "citation": "Citations (1)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "Tomsk Polytechnic University", "University of New South Wales"], "authors": ["Shayan Zamanirad.....http://dblp.org/pers/hd/z/Zamanirad:Shayan", "Boualem Benatallah.....http://dblp.org/pers/hd/b/Benatallah:Boualem", "Moshe Chai Barukh.....http://dblp.org/pers/hd/b/Barukh:Moshe_Chai", "Fabio Casati.....http://dblp.org/pers/hd/c/Casati:Fabio", "Carlos Rodríguez.....http://dblp.org/pers/hd/r/Rodr=iacute=guez_0001:Carlos"], "conf": "kbse", "year": "2017", "pages": 6}