{"title": "What is and What is Not a Salient Object? Learning Salient Object Detector by Ensembling Linear Exemplar Regressors.", "fields": ["visualization", "detector", "salient", "object detection", "embedding"], "abstract": "Finding what is and what is not a salient object can be helpful in developing better features and models in salient object detection (SOD). In this paper, we investigate the images that are selected and discarded in constructing a new SOD dataset and find that many similar candidates, complex shape and low objectness are three main attributes of many non-salient objects. Moreover, objects may have diversified attributes that make them salient. As a result, we propose a novel salient object detector by ensembling linear exemplar regressors. We first select reliable foreground and background seeds using the boundary prior and then adopt locally linear embedding (LLE) to conduct manifold-preserving foregroundness propagation. In this manner, a foregroundness map can be generated to roughly pop-out salient objects and suppress non-salient ones with many similar candidates. Moreover, we extract the shape, foregroundness and attention descriptors to characterize the extracted object proposals, and a linear exemplar regressor is trained to encode how to detect salient proposals in a specific image. Finally, various linear exemplar regressors are ensembled to form a single detector that adapts to various scenarios. Extensive experimental results on 5 dataset and the new SOD dataset show that our approach outperforms 9 state-of-art methods.", "citation": "Citations (5)", "year": "2017", "departments": ["Beihang University", "Beihang University", "Beihang University", "Beihang University"], "conf": "cvpr", "authors": ["Changqun Xia.....http://dblp.org/pers/hd/x/Xia:Changqun", "Jia Li.....http://dblp.org/pers/hd/l/Li_0003:Jia", "Xiaowu Chen.....http://dblp.org/pers/hd/c/Chen:Xiaowu", "Anlin Zheng.....http://dblp.org/pers/hd/z/Zheng:Anlin", "Yu Zhang.....http://dblp.org/pers/hd/z/Zhang_0035:Yu"], "pages": 9}