{"title": "Tunable Efficient Unitary Neural Networks (EUNN) and their application to RNNs.", "fields": ["architecture", "subspace topology", "mnist database", "recurrent neural network", "ranging"], "abstract": "Using unitary (instead of general) matrices in artificial neural networks (ANNs) is a promising way to solve the gradient explosion/vanishing problem, as well as to enable ANNs to learn long-term correlations in the data. This approach appears particularly promising for Recurrent Neural Networks (RNNs). In this work, we present a new architecture for implementing an Efficient Unitary Neural Network (EUNNs); its main advantages can be summarized as follows. Firstly, the representation capacity of the unitary space in an EUNN is fully tunable, ranging from a subspace of SU(N) to the entire unitary space. Secondly, the computational complexity for training an EUNN is merely $\\mathcal{O}(1)$ per parameter. Finally, we test the performance of EUNNs on the standard copying task, the pixel-permuted MNIST digit recognition benchmark as well as the Speech Prediction Test (TIMIT). We find that our architecture significantly outperforms both other state-of-the-art unitary RNNs and the LSTM architecture, in terms of the final performance and/or the wall-clock training speed. EUNNs are thus promising alternatives to RNNs and LSTMs for a wide variety of applications.", "citation": "Citations (8)", "year": "2017", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "University of Zagreb", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "icml", "authors": ["Li Jing.....http://dblp.org/pers/hd/j/Jing:Li", "Yichen Shen.....http://dblp.org/pers/hd/s/Shen:Yichen", "Tena Dubcek.....http://dblp.org/pers/hd/d/Dubcek:Tena", "John Peurifoy.....http://dblp.org/pers/hd/p/Peurifoy:John", "Scott A. Skirlo.....http://dblp.org/pers/hd/s/Skirlo:Scott_A=", "Yann LeCun.....http://dblp.org/pers/hd/l/LeCun:Yann", "Max Tegmark.....http://dblp.org/pers/hd/t/Tegmark:Max", "Marin Soljacic.....http://dblp.org/pers/hd/s/Soljacic:Marin"], "pages": 9}