{"title": "GraphPIM: Enabling Instruction-Level PIM Offloading in Graph Computing Frameworks.", "fields": ["graph", "bottleneck", "hybrid memory cube", "speedup", "software"], "abstract": "With the emergence of data science, graph computing has become increasingly important these days. Unfortunately, graph computing typically suffers from poor performance when mapped to modern computing systems because of the overhead of executing atomic operations and inefficient utilization of the memory subsystem. Meanwhile, emerging technologies, such as Hybrid Memory Cube (HMC), enable the processing-in-memory (PIM) functionality with offloading operations at an instruction level. Instruction offloading to the PIM side has considerable potentials to overcome the performance bottleneck of graph computing. Nevertheless, this functionality for graph workloads has not been fully explored, and its applications and shortcomings have not been well identified thus far. In this paper, we present GraphPIM, a full-stack solution for graph computing that achieves higher performance using PIM functionality. We perform an analysis on modern graph workloads to assess the applicability of PIM offloading and present hardware and software mechanisms to efficiently make use of the PIM functionality. Following the real-world HMC 2.0 specification, GraphPIM provides performance benefits for graph applications without any user code modification or ISA changes. In addition, we propose an extension to PIM operations that can further bring performance benefits for more graph applications. The evaluation results show that GraphPIM achieves up to a 2.4X speedup with a 37% reduction in energy consumption.", "citation": "Citations (6)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Lifeng Nai.....http://dblp.org/pers/hd/n/Nai:Lifeng", "Ramyad Hadidi.....http://dblp.org/pers/hd/h/Hadidi:Ramyad", "Jaewoong Sim.....http://dblp.org/pers/hd/s/Sim:Jaewoong", "Hyojong Kim.....http://dblp.org/pers/hd/k/Kim:Hyojong", "Pranith Kumar.....http://dblp.org/pers/hd/k/Kumar:Pranith", "Hyesoon Kim.....http://dblp.org/pers/hd/k/Kim:Hyesoon"], "conf": "hpca", "year": "2017", "pages": 12}