{"title": "Multi-Modal Knowledge Representation Learning via Webly-Supervised Relationships Mining.", "fields": ["open knowledge base connectivity", "common knowledge", "procedural knowledge", "body of knowledge", "knowledge extraction"], "abstract": "Knowledge representation learning (KRL) encodes enormous structured information with entities and relations into a continuous low-dimensional semantic space. Most conventional methods solely focus on learning knowledge representation from single modality, yet neglect the complementary information from others. The more and more rich available multi-modal data on Internet also drive us to explore a novel approach for KRL in multi-modal way, and overcome the limitations of previous single-modal based methods. This paper proposes a novel multi-modal knowledge representation learning (MM-KRL) framework which attempts to handle knowledge from both textual and visual modal web data. It consists of two stages, i.e., webly-supervised multi-modal relationship mining, and bi-enhanced cross-modal knowledge representation learning. Compared with existing knowledge representation methods, our framework has several advantages: (1) It can effectively mine multi-modal knowledge with structured textual and visual relationships from web automatically. (2) It is able to learn a common knowledge space which is independent to both task and modality by the proposed Bi-enhanced Cross-modal Deep Neural Network (BC-DNN). (3) It has the ability to represent unseen multi-modal relationships by transferring the learned knowledge with isolated seen entities and relations into unseen relationships. We build a large-scale multi-modal relationship dataset (MMR-D) and the experimental results show that our framework achieves excellent performance in zero-shot multi-modal retrieval and visual relationship recognition.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Anhui University", "Chinese Academy of Sciences"], "authors": ["Fudong Nian.....http://dblp.org/pers/hd/n/Nian:Fudong", "Bing-Kun Bao.....http://dblp.org/pers/hd/b/Bao:Bing=Kun", "Teng Li.....http://dblp.org/pers/hd/l/Li_0001:Teng", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng"], "conf": "mm", "year": "2017", "pages": 9}