{"title": "Towards Diverse and Natural Image Descriptions via a Conditional GAN.", "fields": ["bleu", "generative grammar", "closed captioning", "reinforcement learning", "naturalness", "computer vision", "computer science", "artificial intelligence"], "abstract": "Despite the substantial progress in recent years, the image captioning techniques are still far from being perfect. Sentences produced by existing methods, e.g. those based on RNNs, are often overly rigid and lacking in variability. This issue is related to a learning principle widely used in practice, that is, to maximize the likelihood of training samples. This principle encourages high resemblance to the “ground-truth” captions, while suppressing other reasonable descriptions. Conventional evaluation metrics, e.g. BLEU and METEOR, also favor such restrictive methods. In this paper, we explore an alternative approach, with the aim to improve the naturalness and diversity – two essential properties of human expression. Specifically, we propose a new framework based on Conditional Generative Adversarial Networks (CGAN), which jointly learns a generator to produce descriptions conditioned on images and an evaluator to assess how well a description fits the visual content. It is noteworthy that training a sequence generator is nontrivial. We overcome the difficulty by Policy Gradient, a strategy stemming from Reinforcement Learning, which allows the generator to receive early feedback along the way. We tested our method on two large datasets, where it performed competitively against real people in our user study and outperformed other methods on various tasks.", "citation": "Not cited", "year": "2017", "departments": ["The Chinese University of Hong Kong", "University of Toronto", "University of Toronto", "Toyota Technological Institute at Chicago", "The Chinese University of Hong Kong", "University of Toronto", "University of Toronto", "Toyota Technological Institute at Chicago"], "conf": "iccv", "authors": ["Bo Dai.....http://dblp.org/pers/hd/d/Dai:Bo", "Sanja Fidler.....http://dblp.org/pers/hd/f/Fidler:Sanja", "Raquel Urtasun.....http://dblp.org/pers/hd/u/Urtasun:Raquel", "Dahua Lin.....http://dblp.org/pers/hd/l/Lin:Dahua"], "pages": 10}