{"title": "ZipWeave: Towards efficient and reliable measurement based mobile coverage maps.", "fields": ["signal strength", "nonuniform sampling", "sample size determination", "radio propagation", "region of interest"], "abstract": "The accuracy of measurement-driven mobile coverage maps depends on the quality, density and pattern of the signal strength observations. Thus, identifying an efficient measurement data collection methodology is essential, especially when considering the cost associated with the measurement collection approaches (e.g., drive tests, crowd approaches). We propose ZipWeave, a novel measurement data collection and fusion framework for building efficient and reliable measurement-based mobile coverage maps. ZipWeave incorporates a novel nonuniform sampling strategy to achieve reliable coverage maps with reduced sample size. Assuming prior knowledge of the propagation characteristics of the region of interest, we first examine the potential gains of this non-uniform sampling strategy in different cases via a measurement-based statistical analysis methodology; this involves irregular spatial tessellation of the region of interest into sub-regions with internally similar radio propagation characteristics and sampling based on these sub-regions. We then present a practical form of ZipWeave nonuniform sampling strategy that can be used even without any prior information. In all our evaluations, we show that the ZipWeave non-uniform sampling approach reduces the samples by half compared to the common systematic-random sampling, while maintaining similar accuracy. Moreover, we show that the other key feature of ZipWeave to combine high-quality controlled measurements (that present limited geographic footprint similar to drive tests) with crowdsourced measurements (that cover a wider footprint) leads to more reliable mobile coverage maps overall.", "citation": "Citations (2)", "departments": ["University of Edinburgh", "Simula Research Laboratory", "University of Edinburgh", "Simula Research Laboratory"], "authors": ["Mah-Rukh Fida.....http://dblp.org/pers/hd/f/Fida:Mah=Rukh", "Andra Lutu.....http://dblp.org/pers/hd/l/Lutu:Andra", "Mahesh K. Marina.....http://dblp.org/pers/hd/m/Marina:Mahesh_K=", "Ozgu Alay.....http://dblp.org/pers/hd/a/Alay:Ozgu"], "conf": "infocom", "year": "2017", "pages": 9}