{"title": "Falcon: Scaling Up Hands-Off Crowdsourced Entity Matching to Build Cloud Services.", "fields": ["implementation", "falcon", "relational database management system", "crowdsourcing", "tuple"], "abstract": "Many works have applied crowdsourcing to entity matching (EM). While promising, these approaches are limited in that they often require a developer to be in the loop. As such, it is difficult for an organization to deploy multiple crowdsourced EM solutions, because there are simply not enough developers. To address this problem, a recent work has proposed  Corleone , a solution that crowdsources the  entire   EM  workflow, requiring no developers. While promising,  Corleone  is severely limited in that it does not scale to large tables. We propose  Falcon , a solution that scales up the hands-off crowdsourced  EM  approach of  Corleone , using  RDBMS -style query execution and optimization over a Hadoop cluster. Specifically, we define a set of operators and develop efficient implementations. We translate a hands-off crowdsourced  EM  workflow into a plan consisting of these operators, optimize, then execute the plan. These plans involve both machine and crowd activities, giving rise to novel optimization techniques such as using crowd time to mask machine time. Extensive experiments show that Falcon can scale up to tables of millions of tuples, thus providing a practical solution for hands-off crowdsourced  EM , to build cloud-based  EM  services.", "citation": "Citations (5)", "year": "2017", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "Walmart Labs"], "conf": "sigmod", "authors": ["Sanjib Das.....http://dblp.org/pers/hd/d/Das:Sanjib", "Paul Suganthan G. C......http://dblp.org/pers/hd/c/C=:Paul_Suganthan_G=", "AnHai Doan.....http://dblp.org/pers/hd/d/Doan:AnHai", "Jeffrey F. Naughton.....http://dblp.org/pers/hd/n/Naughton:Jeffrey_F=", "Ganesh Krishnan.....http://dblp.org/pers/hd/k/Krishnan:Ganesh", "Rohit Deep.....http://dblp.org/pers/hd/d/Deep:Rohit", "Esteban Arcaute.....http://dblp.org/pers/hd/a/Arcaute:Esteban", "Vijay Raghavendra.....http://dblp.org/pers/hd/r/Raghavendra:Vijay", "Youngchoon Park.....http://dblp.org/pers/hd/p/Park:Youngchoon"], "pages": 16}