{"title": "Sequential Prediction of Social Media Popularity with Deep Temporal Context Networks.", "fields": ["ranking", "machine learning", "popularity", "streams", "social media"], "abstract": "Prediction of popularity has profound impact for social media, since it offers opportunities to reveal individual preference and public attention from evolutionary social systems. Previous research, although achieves promising results, neglects one distinctive characteristic of social data, i.e., sequentiality. For example, the popularity of online content is generated over time with sequential post streams of social media. To investigate the sequential prediction of popularity, we propose a novel prediction framework called Deep Temporal Context Networks (DTCN) by incorporating both temporal context and temporal attention into account. Our DTCN contains three main components, from embedding, learning to predicting. With a joint embedding network, we obtain a unified deep representation of multi-modal user-post data in a common embedding space. Then, based on the embedded data sequence over time, temporal context learning attempts to recurrently learn two adaptive temporal contexts for sequential popularity. Finally, a novel temporal attention is designed to predict new popularity (the popularity of a new user-post pair) with temporal coherence across multiple time-scales. Experiments on our released image dataset with about 600K Flickr photos demonstrate that DTCN outperforms state-of-the-art deep prediction algorithms, with an average of 21.51% relative performance improvement in the popularity prediction (Spearman Ranking Correlation).", "citation": "Citations (6)", "departments": ["Chinese Academy of Sciences", "Center for Information Technology", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Bo Wu.....http://dblp.org/pers/hd/w/Wu_0018:Bo", "Wen-Huang Cheng.....http://dblp.org/pers/hd/c/Cheng:Wen=Huang", "Yongdong Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongdong", "Qiushi Huang.....http://dblp.org/pers/hd/h/Huang:Qiushi", "Jintao Li.....http://dblp.org/pers/hd/l/Li:Jintao", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao"], "conf": "ijcai", "year": "2017", "pages": 7}