{"title": "Inner Garden: Connecting Inner States to a Mixed Reality Sandbox for Mindfulness.", "fields": ["iterative and incremental development", "sandbox", "mixed reality", "meditation", "mindfulness"], "abstract": "Digital technology has been completely integrated into our daily lives, yet the potential of technology to improve its users' life satisfaction is still largely untapped. Mindfulness, the act of paying a deliberate and non-judgmental attention to the present moment, has been shown to have a positive impact on a person's health and subjective well-being--commonly called \"happiness\". Based on an iterative process with meditation teachers and practitioners, we designed a new tool to support mindfulness practices. This tool takes the shape of an augmented sandbox, designed to inspire the user's self-motivation and curiosity. By shaping the sand, the user creates a living miniature world that is projected back onto the sand. The natural elements of the garden are connected to real-time physiological measurements, such as breathing, helping the user to stay focused on the body. Moreover, using a Virtual Reality headset, they can travel inside their garden for a dedicated meditation session. Preliminary results seem to indicate that the system is well suited for mindfulness and induces a calm and mindful state on the user. The meditation teachers envisioned the use of Inner Garden in their practice.", "citation": "Citations (9)", "year": "2017", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "University of Bordeaux", "French Institute for Research in Computer Science and Automation"], "conf": "chi", "authors": ["Joan Sol Roo.....http://dblp.org/pers/hd/r/Roo:Joan_Sol", "Renaud Gervais.....http://dblp.org/pers/hd/g/Gervais:Renaud", "Jérémy Frey.....http://dblp.org/pers/hd/f/Frey:J=eacute=r=eacute=my", "Martin Hachet.....http://dblp.org/pers/hd/h/Hachet:Martin"], "pages": 12}