{"title": "Detecting missing information in bug descriptions.", "fields": ["data mining", "computer science", "software"], "abstract": "Bug reports document unexpected software behaviors experienced by users. To be effective, they should allow bug triagers to easily understand and reproduce the potential reported bugs, by clearly describing the Observed Behavior (OB), the Steps to Reproduce (S2R), and the Expected Behavior (EB). Unfortunately, while considered extremely useful, reporters often miss such pieces of information in bug reports and, to date, there is no effective way to automatically check and enforce their presence. We manually analyzed nearly 3k bug reports to understand to what extent OB, EB, and S2R are reported in bug reports and what discourse patterns reporters use to describe such information. We found that (i) while most reports contain OB (i.e., 93.5%), only 35.2% and 51.4% explicitly describe EB and S2R, respectively; and (ii) reporters recurrently use 154 discourse patterns to describe such content. Based on these findings, we designed and evaluated an automated approach to detect the absence (or presence) of EB and S2R in bug descriptions. With its best setting, our approach is able to detect missing EB (S2R) with 85.9% (69.2%) average precision and 93.2% (83%) average recall. Our approach intends to improve bug descriptions quality by alerting reporters about missing EB and S2R at reporting time.", "citation": "Citations (3)", "departments": ["University of Texas at Dallas", "University of Texas at Dallas", "University of Sannio", "Colorado State University", "University of Sannio"], "authors": ["Oscar Chaparro.....http://dblp.org/pers/hd/c/Chaparro:Oscar", "Jing Lu.....http://dblp.org/pers/hd/l/Lu:Jing", "Fiorella Zampetti.....http://dblp.org/pers/hd/z/Zampetti:Fiorella", "Laura Moreno.....http://dblp.org/pers/hd/m/Moreno:Laura", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Andrian Marcus.....http://dblp.org/pers/hd/m/Marcus:Andrian", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Vincent Ng.....http://dblp.org/pers/hd/n/Ng:Vincent"], "conf": "sigsoft", "year": "2017", "pages": 12}