{"title": "Extreme scale multi-physics simulations of the tsunamigenic 2004 sumatra megathrust earthquake.", "fields": ["seafloor spreading", "earthquake simulation", "megathrust earthquake", "polygon mesh", "code generation"], "abstract": "We present a high-resolution simulation of the 2004 Sumatra-Andaman earthquake, including non-linear frictional failure on a megathrustsplay fault system. Our method exploits unstructured meshes capturing the complicated geometries in subduction zones that are crucial to understand large earthquakes and tsunami generation. These up-to-date largest and longest dynamic rupture simulations enable analysis of dynamic source effects on the seafloor displacements.   To tackle the extreme size of this scenario an end-to-end optimization of the simulation code SeisSol was necessary. We implemented a new cache-aware wave propagation scheme and optimized the dynamic rupture kernels using code generation. We established a novel clustered local-time-stepping scheme for dynamic rupture. In total, we achieved a speed-up of 13.6 compared to the previous implementation. For the Sumatra scenario with 221 million elements this reduced the time-to-solution to 13.9 hours on 86, 016 Haswell cores. Furthermore, we used asynchronous output to overlap I/O and compute time.", "citation": "Citations (1)", "year": "2017", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich"], "conf": "sc", "authors": ["Carsten Uphoff.....http://dblp.org/pers/hd/u/Uphoff:Carsten", "Sebastian Rettenberger.....http://dblp.org/pers/hd/r/Rettenberger:Sebastian", "Michael Bader.....http://dblp.org/pers/hd/b/Bader:Michael", "Elizabeth H. Madden.....http://dblp.org/pers/hd/m/Madden:Elizabeth_H=", "Thomas Ulrich.....http://dblp.org/pers/hd/u/Ulrich:Thomas", "Stephanie Wollherr.....http://dblp.org/pers/hd/w/Wollherr:Stephanie", "Alice-Agnes Gabriel.....http://dblp.org/pers/hd/g/Gabriel:Alice=Agnes"], "pages": 16}