{"title": "Client-side Name Collision Vulnerability in the New gTLD Era: A Systematic Study.", "fields": ["name server", "exploit", "client", "man in the middle attack", "vulnerability"], "abstract": "The recent unprecedented delegation of new generic top-level domains (gTLDs) has exacerbated an existing, but fallow, problem called name collisions. One concrete exploit of such problem was discovered recently, which targets internal namespaces and enables Man in the Middle (MitM) attacks against end-user devices from anywhere on the Internet. Analysis of the underlying problem shows that it is not specific to any single service protocol, but little attention has been paid to understand the vulnerability status and the defense solution space at the service level. In this paper, we perform the first systematic study of the robustness of internal network services under name collision attacks.   We first perform a measure study and uncover a wide spectrum of services affected by the name collision problem. We then collect their client implementations and systematically analyze their vulnerability status under name collision attacks using dynamic analysis. Out of the 48 identified exposed services, we find that nearly all (45) of them expose vulnerabilities in popular clients. To demonstrate the severity, we construct exploits and find a set of new name collision attacks with severe security implications including MitM attacks, internal or personal document leakage, malicious code injection, and credential theft. We analyze the causes, and find that the name collision problem broadly breaks common security assumptions made in today's service client software. Leveraging the insights from our analysis, we propose multiple service software level solutions, which enables the victim services to actively defend against name collision attacks.", "citation": "Not cited", "year": "2017", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "Verisign Labs, Reston, VA, USA", "Verisign Labs, Reston, VA, USA"], "conf": "ccs", "authors": ["Qi Alfred Chen.....http://dblp.org/pers/hd/c/Chen:Qi_Alfred", "Matthew Thomas.....http://dblp.org/pers/hd/t/Thomas:Matthew", "Eric Osterweil.....http://dblp.org/pers/hd/o/Osterweil:Eric", "Yulong Cao.....http://dblp.org/pers/hd/c/Cao:Yulong", "Jie You.....http://dblp.org/pers/hd/y/You:Jie", "Zhuoqing Morley Mao.....http://dblp.org/pers/hd/m/Mao:Zhuoqing_Morley"], "pages": 16}