{"title": "Dual Iterative Hard Thresholding: From Non-convex Sparse Minimization to Non-smooth Concave Maximization.", "fields": ["small number", "restricted isometry property", "duality", "dual space", "stochastic optimization"], "abstract": "Iterative Hard Thresholding (IHT) is a class of projected gradient descent methods for optimizing sparsity-constrained minimization models, with the best known efficiency and scalability in practice. As far as we know, the existing IHT-style methods are designed for sparse minimization in primal form. It remains open to explore duality theory and algorithms in such a non-convex and NP-hard setting. In this article, we bridge the gap by establishing a duality theory for sparsity-constrained minimization with $\\ell_2$-regularized objective and proposing an IHT-style algorithm for dual maximization. Our sparse duality theory provides a set of sufficient and necessary conditions under which the original NP-hard/non-convex problem can be equivalently solved in a dual space. The proposed dual IHT algorithm is a super-gradient method for maximizing the non-smooth dual objective. An interesting finding is that the sparse recovery performance of dual IHT is invariant to the Restricted Isometry Property (RIP), which is required by all the existing primal IHT without sparsity relaxation. Moreover, a stochastic variant of dual IHT is proposed for large-scale stochastic optimization. Numerical results demonstrate that dual IHT algorithms can achieve more accurate model estimation given small number of training data and have higher computational efficiency than the state-of-the-art primal IHT-style algorithms.", "citation": "Citations (1)", "year": "2017", "departments": ["Rutgers University", "Nanjing University of Information Science and Technology", "Rutgers University", "Nanjing University of Information Science and Technology", "Rutgers University"], "conf": "icml", "authors": ["Bo Liu.....http://dblp.org/pers/hd/l/Liu_0005:Bo", "Xiao-Tong Yuan.....http://dblp.org/pers/hd/y/Yuan:Xiao=Tong", "Lezi Wang.....http://dblp.org/pers/hd/w/Wang:Lezi", "Qingshan Liu.....http://dblp.org/pers/hd/l/Liu_0001:Qingshan", "Dimitris N. Metaxas.....http://dblp.org/pers/hd/m/Metaxas:Dimitris_N="], "pages": 9}