{"title": "Deep Multimodal Representation Learning from Temporal Data.", "fields": ["deep learning", "semi supervised learning", "feature learning", "recurrent neural network", "multimodal learning"], "abstract": "In recent years, Deep Learning has been successfully applied to multimodal learning problems, with the aim of learning useful joint representations in data fusion applications. When the available modalities consist of time series data such as video, audio and sensor signals, it becomes imperative to consider their temporal structure during the fusion process. In this paper, we propose the Correlational Recurrent Neural Network (CorrRNN), a novel temporal fusion model for fusing multiple input modalities that are inherently temporal in nature. Key features of our proposed model include: (i) simultaneous learning of the joint representation and temporal dependencies between modalities, (ii) use of multiple loss terms in the objective function, including a maximum correlation loss term to enhance learning of cross-modal information, and (iii) the use of an attention model to dynamically adjust the contribution of different input modalities to the joint representation. We validate our model via experimentation on two different tasks: video-and sensor-based activity classification, and audio-visual speech recognition. We empirically analyze the contributions of different components of the proposed CorrRNN model, and demonstrate its robustness, effectiveness and state-of-the-art performance on multiple datasets.", "citation": "Citations (2)", "year": "2017", "departments": ["University of Rochester", "Xerox", "Michigan State University", "Xerox"], "conf": "cvpr", "authors": ["Xitong Yang.....http://dblp.org/pers/hd/y/Yang:Xitong", "Palghat Ramesh.....http://dblp.org/pers/hd/r/Ramesh:Palghat", "Radha Chitta.....http://dblp.org/pers/hd/c/Chitta:Radha", "Sriganesh Madhvanath.....http://dblp.org/pers/hd/m/Madhvanath:Sriganesh", "Edgar A. Bernal.....http://dblp.org/pers/hd/b/Bernal:Edgar_A=", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo"], "pages": 9}