{"title": "Dissecting Spear Phishing Emails for Older vs Young Adults: On the Interplay of Weapons of Influence and Life Domains in Predicting Susceptibility to Phishing.", "fields": ["phishing", "data collection", "scarcity", "spear", "personalization"], "abstract": "Spear phishing emails are key in many cyber attacks. Successful emails employ psychological weapons of influence and relevant life domains. This paper investigates spear phishing susceptibility as a function of Internet user age (old vs young), weapon of influence, and life domain. A 21-day study was conducted with 158 participants (younger and older Internet users). Data collection took place at the participants' homes to increase ecological validity. Our results show that older women were the most vulnerable group to phishing attacks. While younger adults were most susceptible to scarcity, older adults were most susceptible to reciprocation. Further, there was a discrepancy, particularly among older users, between self-reported susceptibility awareness and their behavior during the intervention. Our results show the need for demographic personalization for warnings, training and educational tools in targeting the specifics of the older adult population.", "citation": "Citations (10)", "year": "2017", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "University of Florida"], "conf": "chi", "authors": ["Daniela A. S. de Oliveira.....http://dblp.org/pers/hd/o/Oliveira:Daniela_A=_S=_de", "Harold Rocha.....http://dblp.org/pers/hd/r/Rocha:Harold", "Huizi Yang.....http://dblp.org/pers/hd/y/Yang:Huizi", "Donovan Ellis.....http://dblp.org/pers/hd/e/Ellis:Donovan", "Sandeep Dommaraju.....http://dblp.org/pers/hd/d/Dommaraju:Sandeep", "Melis Muradoglu.....http://dblp.org/pers/hd/m/Muradoglu:Melis", "Devon Weir.....http://dblp.org/pers/hd/w/Weir:Devon", "Adam Soliman.....http://dblp.org/pers/hd/s/Soliman:Adam", "Tian Lin.....http://dblp.org/pers/hd/l/Lin:Tian", "Natalie Ebner.....http://dblp.org/pers/hd/e/Ebner:Natalie"], "pages": 13}