{"title": "When Cloud Meets Uncertain Crowd: An Auction Approach for Crowdsourced Livecast Transcoding.", "fields": ["incentive compatibility", "transcoding", "common value auction", "bidding", "edge computing"], "abstract": "In the emerging crowd sourced live cast services, numerous amateur broadcasters live stream their video contents to worldwide viewers and constantly interact with them through chat messages. Live video contents are transcoded into multiple quality versions to better service viewers with different network and device configurations. Cloud computing becomes a natural choice to handle these computational intensive tasks due to its elasticity and the \"pay-as-you-go\" billing model. However, given the significantly large number of concurrent channel numbers and the diverse viewer geo-distributions in this new crowd sourced live cast service, even the cloud becomes significantly expensive to cover the whole community and inadequate in fulfilling the latency requirement. In this paper, after observing the abundant computational resources residing in end viewers, we propose a Cloud-Crowd collaborative system, C2, which combines end viewers with cloud to perform video transcoding in a cost-efficient way. To quantify the heterogeneity and uncertainty of viewers and pass the asymmetric information barrier, we incorporate statistical descriptions into our bidding language and design truthful auctions to recruit stable viewers with appropriate incentives. We further tailor redundancy strategies for workloads with different Quality of Service requirements to improve the stability of our system. Desirable economic properties, like social efficiency, ex-post incentive compatibility, individual rationality, are proved to be guaranteed in our studied scenarios. Using traces captured from the popular Twitch platform, we show that C2 achieves up to 93% more cost saving than a pure cloud-based solution, and significantly outperforms other baseline approaches in both social welfare and system stability.", "citation": "Citations (1)", "departments": ["Simon Fraser University", "Simon Fraser University", "Tsinghua University", "Simon Fraser University"], "authors": ["Yifei Zhu.....http://dblp.org/pers/hd/z/Zhu:Yifei", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Zhi Wang.....http://dblp.org/pers/hd/w/Wang_0001:Zhi", "Cong Zhang.....http://dblp.org/pers/hd/z/Zhang:Cong"], "conf": "mm", "year": "2017", "pages": 9}