{"title": "Compass: Spatio Temporal Sentiment Analysis of US Election What Twitter Says!", "fields": ["social media", "sentiment analysis", "health indicator", "happiness", "compass"], "abstract": "With the widespread growth of various social network tools and platforms, analyzing and understanding societal response and crowd reaction to important and emerging social issues and events through social media data is increasingly an important problem. However, there are numerous challenges towards realizing this goal effectively and efficiently, due to the unstructured and noisy nature of social media data. The large volume of the underlying data also presents a fundamental challenge. Furthermore, in many application scenarios, it is often interesting, and in some cases critical, to discover patterns and trends based on geographical and/or temporal partitions, and keep track of how they will change overtime.   This brings up the interesting problem of  spatio-temporal sentiment analysis  from large-scale social media data. This paper investigates this problem through a data science project called \"US Election 2016, What Twitter Says\". The objective is to discover sentiment on Twitter towards either the democratic or the republican party at US county and state levels over any arbitrary temporal intervals, using a large collection of geotagged tweets from a period of 6 months leading up to the US Presidential Election in 2016. Our results demonstrate that by integrating and developing a combination of machine learning and data management techniques, it ispossible to do this at scale with effective outcomes. The results of our project have the potential to be adapted towards solving and influencing other interesting social issues such as building neighborhood happiness and health indicators.", "citation": "Citations (3)", "departments": ["University of Utah", "University of Utah", "University of Utah", "University of Utah", "University of Utah"], "authors": ["Debjyoti Paul.....http://dblp.org/pers/hd/p/Paul:Debjyoti", "Feifei Li.....http://dblp.org/pers/hd/l/Li_0001:Feifei", "Murali Krishna Teja.....http://dblp.org/pers/hd/t/Teja:Murali_Krishna", "Xin Yu.....http://dblp.org/pers/hd/y/Yu:Xin", "Richie Frost.....http://dblp.org/pers/hd/f/Frost:Richie"], "conf": "kdd", "year": "2017", "pages": 10}