{"title": "PIC2DISH: A Customized Cooking Assistant System.", "fields": ["clips", "recipe", "multimedia", "convolutional neural network", "ingredient"], "abstract": "The art of cooking is always fascinating. Nevertheless, reproducing a delicious dish that one has never encountered before is not easy. Even if the name of dish is known and the corresponding recipe could be retrieved, the right ingredients for cooking the dish may not be available due to factors such as geography region or season. Furthermore, knowing how to cut, cook and control timing may be challenging for one whose has no cooking experience. In this paper, an all-around cooking assistant mobile app, named Pic2Dish, is developed to help users who would like to cook a dish but neither know the name of dish nor has cooking skill. Basically, by inputting a picture of the dish and the list of ingredients at hand, Pic2Dish automatically recognizes the dish name and recommends a customized recipe together with video clips to guide user on how to cook the dish. Importantly, the recommended recipe is modified from a retrieved recipe that best matches the given dish, with missing ingredients being replaced with the available ingredients that match dish context and taste. The whole process involves the recognition of dishes with convolutional neural network, classification of key and non-key ingredients, and context analysis of ingredient relationship and their cooking/cutting methods. The user studies, which recruit real users to cook dishes by using Pic2Dish, shows the usefulness of the app.", "citation": "Not cited", "departments": ["Tsinghua University", "National University of Singapore", "City University of Hong Kong", "City University of Hong Kong", "Tsinghua University"], "authors": ["Yongsheng An.....http://dblp.org/pers/hd/a/An:Yongsheng", "Yu Cao.....http://dblp.org/pers/hd/c/Cao:Yu", "Jingjing Chen.....http://dblp.org/pers/hd/c/Chen:Jingjing", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah", "Jia Jia.....http://dblp.org/pers/hd/j/Jia_0001:Jia", "Huanbo Luan.....http://dblp.org/pers/hd/l/Luan:Huanbo", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2017", "pages": 5}