{"title": "Optimising 5G infrastructure markets: The business of network slicing.", "fields": ["slicing", "business service provider", "cellular network", "adaptive algorithm", "revenue"], "abstract": "In addition to providing substantial performance enhancements, future 5G networks will also change the mobile network ecosystem. Building on the network slicing concept, 5G allows to “slice” the network infrastructure into separate logical networks that may be operated independently and targeted at specific services. This opens the market to new players: the infrastructure provider, which is the owner of the infrastructure, and the tenants, which may acquire a network slice from the infrastructure provider to deliver a specific service to their customers. In this new context, we need new algorithms for the allocation of network resources that consider these new players. In this paper, we address this issue by designing an algorithm for the admission and allocation of network slices requests that (i) maximises the infrastructure provider's revenue and (ii) ensures that the service guarantees provided to tenants are satisfied. Our key contributions include: (i) an analytical model for the admissibility region of a network slicing-capable 5G Network, (ii) the analysis of the system (modelled as a Semi-Markov Decision Process) and the optimisation of the infrastructure provider's revenue, and (iii) the design of an adaptive algorithm (based on Q-learning) that achieves close to optimal performance.", "citation": "Citations (7)", "departments": ["IMDEA Networks", "IMDEA Networks", "IMDEA Networks", "Huawei", "NEC Laboratorie ... elberg, Germany"], "authors": ["Dario Bega.....http://dblp.org/pers/hd/b/Bega:Dario", "Marco Gramaglia.....http://dblp.org/pers/hd/g/Gramaglia:Marco", "Albert Banchs.....http://dblp.org/pers/hd/b/Banchs:Albert", "Vincenzo Sciancalepore.....http://dblp.org/pers/hd/s/Sciancalepore:Vincenzo", "Konstantinos Samdanis.....http://dblp.org/pers/hd/s/Samdanis:Konstantinos", "Xavier Pérez Costa.....http://dblp.org/pers/hd/c/Costa:Xavier_P=eacute=rez"], "conf": "infocom", "year": "2017", "pages": 9}