{"title": "Dictionary Learning Based on Sparse Distribution Tomography.", "fields": ["isometry", "k svd", "linear combination", "central limit theorem", "estimator"], "abstract": "We propose a new statistical dictionary learning algorithm for sparse signals that is based on an α-stable innovation model. The parameters of the underlying model—that is, the atoms of the dictionary, the sparsity index α and the dispersion of the transform-domain coefficients—are recovered using a new type of probability distribution tomography. Specifically, we drive our estimator with a series of random projections of the data, which results in an efficient algorithm. Moreover, since the projections are achieved using linear combinations, we can invoke the generalized central limit theorem to justify the use of our method for sparse signals that are not necessarily α-stable. We evaluate our algorithm by performing two types of experiments: image in-painting and image denoising. In both cases, we find that our approach is competitive with state-of-the-art dictionary learning techniques. Beyond the algorithm itself, two aspects of this study are interesting in their own right. The first is our statistical formulation of the problem, which unifies the topics of dictionary learning and independent component analysis. The second is a generalization of a classical theorem about isometries of $ l _{ p } $ -norms that constitutes the foundation of our approach.", "citation": "Not cited", "year": "2017", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "conf": "icml", "authors": ["Pedram Pad.....http://dblp.org/pers/hd/p/Pad:Pedram", "Farnood Salehi.....http://dblp.org/pers/hd/s/Salehi:Farnood", "L. Elisa Celis.....http://dblp.org/pers/hd/c/Celis:L=_Elisa", "Patrick Thiran.....http://dblp.org/pers/hd/t/Thiran:Patrick", "Michael Unser.....http://dblp.org/pers/hd/u/Unser:Michael"], "pages": 10}