{"title": "Tsallis Regularized Optimal Transport and Ecological Inference.", "fields": ["convergence", "inference", "joint probability distribution", "mathematical proof", "probability distribution"], "abstract": "Optimal transport is a powerful framework for computing distances between probability distributions. We unify the two main approaches to optimal transport, namely Monge-Kantorovitch and Sinkhorn-Cuturi, into what we define as Tsallis regularized optimal transport (\\trot). \\trot~interpolates a rich family of distortions from Wasserstein to Kullback-Leibler, encompassing as well Pearson, Neyman and Hellinger divergences, to name a few. We show that metric properties known for Sinkhorn-Cuturi generalize to \\trot, and provide efficient algorithms for finding the optimal transportation plan with formal convergence proofs. We also present the first application of optimal transport to the problem of ecological inference, that is, the reconstruction of joint distributions from their marginals, a problem of large interest in the social sciences. \\trot~provides a convenient framework for ecological inference by allowing to compute the joint distribution --- that is, the optimal transportation plan itself --- when side information is available, which is \\textit{e.g.} typically what census represents in political science. Experiments on data from the 2012 US presidential elections display the potential of \\trot~in delivering a faithful reconstruction of the joint distribution of ethnic groups and voter preferences.", "citation": "Citations (4)", "departments": ["École Polytechnique", "Australian National University", "Australian National University", "École Polytechnique"], "authors": ["Boris Muzellec.....http://dblp.org/pers/hd/m/Muzellec:Boris", "Richard Nock.....http://dblp.org/pers/hd/n/Nock:Richard", "Giorgio Patrini.....http://dblp.org/pers/hd/p/Patrini:Giorgio", "Frank Nielsen.....http://dblp.org/pers/hd/n/Nielsen:Frank"], "conf": "aaai", "year": "2017", "pages": 7}