{"title": "Perceived language complexity in GitHub issue discussions and their effect on issue resolution.", "fields": ["software development", "language complexity", "rhetoric", "pragmatics", "language model"], "abstract": "Modern software development is increasingly collaborative. Open Source Software (OSS) are the bellwether; they support dynamic teams, with tools for code sharing, communication, and issue tracking. The success of an OSS project is reliant on team communication. E.g., in issue discussions, individuals rely on rhetoric to argue their position, but also maintain technical relevancy. Rhetoric and technical language are on opposite ends of a language complexity spectrum: the former is stylistically natural; the latter is terse and concise. Issue discussions embody this duality, as developers use rhetoric to describe technical issues. The style mix in any discussion can define group culture and affect performance, e.g., issue resolution times may be longer if discussion is imprecise. Using GitHub, we studied issue discussions to understand whether project-specific language differences exist, and to what extent users conform to a language norm. We built project-specific and overall GitHub language models to study the effect of perceived language complexity on multiple responses. We find that experienced users conform to project-specific language norms, popular individuals use overall GitHub language rather than project-specific language, and conformance to project-specific language norms reduces issue resolution times. We also provide a tool to calculate project-specific perceived language complexity.", "citation": "Not cited", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["David Kavaler.....http://dblp.org/pers/hd/k/Kavaler:David", "Sasha Sirovica.....http://dblp.org/pers/hd/s/Sirovica:Sasha", "Vincent Hellendoorn.....http://dblp.org/pers/hd/h/Hellendoorn:Vincent", "Raúl Aranovich.....http://dblp.org/pers/hd/a/Aranovich:Ra=uacute=l", "Vladimir Filkov.....http://dblp.org/pers/hd/f/Filkov:Vladimir"], "conf": "kbse", "year": "2017", "pages": 12}