{"title": "Contutto: a novel FPGA-based prototyping platform enabling innovation in the memory subsystem of a server class processor.", "fields": ["conventional memory", "uniform memory access", "extended memory", "computing with memory", "interleaved memory"], "abstract": "We demonstrate the use of an FPGA as a memory buffer in a POWER8® system, creating a novel prototyping platform that enables innovation in the memory subsystem of POWER-based servers. Our platform, called ConTutto, is pin-compatible with POWER8 buffered memory DIMMs and plugs into a memory slot of a standard POWER8 processor system, running at aggregate memory channel speeds of 35 GB/s per link. ConTutto, which means \"with everything\", is a platform to experiment with different memory technologies, such as STT-MRAM and NAND Flash, in an end-to-end system context. Enablement of STT-MRAM and NVDIMM using ConTutto shows up to 12.5x lower latency and 7.5x higher bandwidth compared to the respective technologies when attached to the PCIe bus. Moreover, due to the unique attach-point of the FPGA between the processor and system memory, ConTutto provides a means for in-line acceleration of certain computations on-route to memory, and enables sensitivity analysis for memory latency while running real applications. To the best of our knowledge, ConTutto is the first ever FPGA platform on the memory bus of a server class processor.", "citation": "Not cited", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Bharat Sukhwani.....http://dblp.org/pers/hd/s/Sukhwani:Bharat", "Thomas Roewer.....http://dblp.org/pers/hd/r/Roewer:Thomas", "Charles L. Haymes.....http://dblp.org/pers/hd/h/Haymes:Charles_L=", "Kyu-hyoun Kim.....http://dblp.org/pers/hd/k/Kim:Kyu=hyoun", "Adam J. McPadden.....http://dblp.org/pers/hd/m/McPadden:Adam_J=", "Daniel M. Dreps.....http://dblp.org/pers/hd/d/Dreps:Daniel_M=", "Dean Sanner.....http://dblp.org/pers/hd/s/Sanner:Dean", "Jan van Lunteren.....http://dblp.org/pers/hd/l/Lunteren:Jan_van", "Sameh W. Asaad.....http://dblp.org/pers/hd/a/Asaad:Sameh_W="], "conf": "micro", "year": "2017", "pages": 12}