{"title": "DeftNN: addressing bottlenecks for DNN execution on GPUs via synapse vector elimination and near-compute data fission.", "fields": ["deep learning", "memory bandwidth", "bottleneck", "speedup", "bridging"], "abstract": "Deep neural networks (DNNs) are key computational building blocks for emerging classes of web services that interact in real time with users via voice, images and video inputs. Although GPUs have gained popularity as a key accelerator platform for deep learning workloads, the increasing demand for DNN computation leaves a significant gap between the compute capabilities of GPU-enabled datacenters and the compute needed to service demand.   The state-of-the-art techniques to improve DNN performance have significant limitations in bridging the gap on real systems. Current network pruning techniques remove computation, but the resulting networks map poorly to GPU architectures, yielding no performance benefit or even slowdowns. Meanwhile, current bandwidth optimization techniques focus on reducing off-chip bandwidth while overlooking on-chip bandwidth, a key DNN bottleneck.   To address these limitations, this work introduces DeftNN, a GPU DNN execution framework that targets the key architectural bottlenecks of DNNs on GPUs to automatically and transparently improve execution performance. DeftNN is composed of two novel optimization techniques - (1) synapse vector elimination, a technique that identifies non-contributing synapses in the DNN and carefully transforms data and removes the computation and data movement of these synapses while fully utilizing the GPU to improve performance, and (2) near-compute data fission, a mechanism for scaling down the on-chip data movement requirements within DNN computations. Our evaluation of DeftNN spans 6 state-of-the-art DNNs. By applying both optimizations in concert, DeftNN is able to achieve an average speedup of 2.1X on real GPU hardware. We also introduce a small additional hardware unit per GPU core to facilitate efficient data fission operations, increasing the speedup achieved by DeftNN to 2.6X.", "citation": "Not cited", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Parker Hill.....http://dblp.org/pers/hd/h/Hill:Parker", "Animesh Jain.....http://dblp.org/pers/hd/j/Jain:Animesh", "Mason Hill.....http://dblp.org/pers/hd/h/Hill:Mason", "Babak Zamirai.....http://dblp.org/pers/hd/z/Zamirai:Babak", "Chang-Hong Hsu.....http://dblp.org/pers/hd/h/Hsu:Chang=Hong", "Michael A. Laurenzano.....http://dblp.org/pers/hd/l/Laurenzano:Michael_A=", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A=", "Lingjia Tang.....http://dblp.org/pers/hd/t/Tang:Lingjia", "Jason Mars.....http://dblp.org/pers/hd/m/Mars:Jason"], "conf": "micro", "year": "2017", "pages": 14}