{"title": "Redesigning CAM-SE for peta-scale climate modeling performance and ultra-high resolution on Sunway TaihuLight.", "fields": ["porting", "sunway taihulight", "vectorization", "climate model", "peta"], "abstract": "The Community Atmosphere Model (CAM) is ported, redesigned, and scaled to the full system of the Sunway TaihuLight, and provides peta-scale climate modeling performance. We refactored and optimized the complete code using OpenACC directives at the first stage. A more aggressive and finer-grained redesign is then applied on the CAM, to achieve finer memory control and usage, more efficient vectorization and compute and communication overlapping. We further improve the CAM performance of a 260-core Sunway processor to the range of 28 to 184 Intel CPU cores, and achieve a sustainable double-precision performance of 3.3 PFlops for a 750 m global simulation when using 10,075,000 cores. CAM on Sunway achieves the simulation speed of 3.4 and 21.5 simulation-year-per-day (SYPD) for global 25-km and 100-km resolution respectively; and enables us to perform, to our knowledge, the first simulation of the complete lifecycle of hurricane Katrina, and achieve close-to-observation simulation results for both track and intensity.", "citation": "Citations (1)", "year": "2017", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Shandong University", "Tsinghua University"], "conf": "sc", "authors": ["Haohuan Fu.....http://dblp.org/pers/hd/f/Fu:Haohuan", "Junfeng Liao.....http://dblp.org/pers/hd/l/Liao:Junfeng", "Nan Ding.....http://dblp.org/pers/hd/d/Ding:Nan", "Xiaohui Duan.....http://dblp.org/pers/hd/d/Duan:Xiaohui", "Lin Gan.....http://dblp.org/pers/hd/g/Gan:Lin", "Yishuang Liang.....http://dblp.org/pers/hd/l/Liang:Yishuang", "Xinliang Wang.....http://dblp.org/pers/hd/w/Wang:Xinliang", "Jinzhe Yang.....http://dblp.org/pers/hd/y/Yang:Jinzhe", "Yan Zheng.....http://dblp.org/pers/hd/z/Zheng:Yan", "Weiguo Liu.....http://dblp.org/pers/hd/l/Liu:Weiguo", "Lanning Wang.....http://dblp.org/pers/hd/w/Wang:Lanning", "Guangwen Yang.....http://dblp.org/pers/hd/y/Yang:Guangwen"], "pages": 12}