{"title": "An Analysis of Persistent Memory Use with WHISPER.", "fields": ["byte", "volatile memory", "persistent data structure", "addressability", "cpu cache"], "abstract": "Emerging non-volatile memory (NVM) technologies promise durability with read and write latencies comparable to volatile memory (DRAM). We define Persistent Memory (PM) as NVM accessed with byte addressability at low latency via normal memory instructions. Persistent-memory applications ensure the consistency of persistent data by inserting ordering points between writes to PM allowing the construction of higher-level transaction mechanisms. An epoch is a set of writes to PM between ordering points.   To put systems research in PM on a firmer footing, we developed and analyzed a PM benchmark suite called WHISPER (Wisconsin-HP Labs Suite for Persistence) that comprises ten PM applications we gathered to cover all current interfaces to PM. A quantitative analysis reveals several insights: (a) only 4% of writes in PM-aware applications are to PM and the rest are to volatile memory, (b) software transactions are often implemented with 5 to 50 ordering points (c) 75% of epochs update exactly one 64B cache line, (d) 80% of epochs from the same thread depend on previous epochs from the same thread, while few epochs depend on epochs from other threads.   Based on our analysis, we propose the Hands-off Persistence System (HOPS) to track updates to PM in hardware. Current hardware design requires applications to force data to PM as each epoch ends. HOPS provides high-level ISA primitives for applications to express durability and ordering constraints separately and enforces them automatically, while achieving 24.3% better performance over current approaches to persistence.", "citation": "Citations (14)", "year": "2017", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "Hewlett-Packard"], "conf": "asplos", "authors": ["Sanketh Nalli.....http://dblp.org/pers/hd/n/Nalli:Sanketh", "Swapnil Haria.....http://dblp.org/pers/hd/h/Haria:Swapnil", "Mark D. Hill.....http://dblp.org/pers/hd/h/Hill:Mark_D=", "Michael M. Swift.....http://dblp.org/pers/hd/s/Swift:Michael_M=", "Haris Volos.....http://dblp.org/pers/hd/v/Volos_0001:Haris", "Kimberly Keeton.....http://dblp.org/pers/hd/k/Keeton:Kimberly"], "pages": 14}