{"title": "Inferring Generative Model Structure with Static Analysis.", "fields": ["generative grammar", "labeled data", "discriminative model", "generative model", "static analysis"], "abstract": "Obtaining enough labeled data to robustly train complex discriminative models is a major bottleneck in the machine learning pipeline. A popular solution is combining multiple sources of weak supervision using generative models. The structure of these models affects the quality of the training labels, but is difficult to learn without any ground truth labels. We instead rely on weak supervision sources having some structure by virtue of being encoded programmatically. We present Coral, a paradigm that infers generative model structure by statically analyzing the code for these heuristics, thus significantly reducing the amount of data required to learn structure. We prove that Coral's sample complexity scales quasilinearly with the number of heuristics and number of relations identified, improving over the standard sample complexity, which is exponential in n for learning n-th degree relations. Empirically, Coral matches or outperforms traditional structure learning approaches by up to 3.81 F1 points. Using Coral to model dependencies instead of assuming independence results in better performance than a fully supervised model by 3.07 accuracy points when heuristics are used to label radiology data without ground truth labels.", "citation": "Citations (3)", "year": "2017", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University"], "conf": "nips", "authors": ["Paroma Varma.....http://dblp.org/pers/hd/v/Varma:Paroma", "Bryan D. He.....http://dblp.org/pers/hd/h/He:Bryan_D=", "Payal Bajaj.....http://dblp.org/pers/hd/b/Bajaj:Payal", "Nishith Khandwala.....http://dblp.org/pers/hd/k/Khandwala:Nishith", "Imon Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Imon", "Daniel L. Rubin.....http://dblp.org/pers/hd/r/Rubin:Daniel_L=", "Christopher Ré.....http://dblp.org/pers/hd/r/R=eacute=:Christopher"], "pages": 11}