{"title": "S-Caffe: Co-designing MPI Runtimes and Caffe for Scalable Deep Learning on Modern GPU Clusters.", "fields": ["deep learning", "massively parallel", "computation", "speedup", "scalability"], "abstract": "Availability of large data sets like ImageNet and massively parallel computation support in modern HPC devices like NVIDIA GPUs have fueled a renewed interest in Deep Learning (DL) algorithms. This has triggered the development of DL frameworks like Caffe, Torch, TensorFlow, and CNTK. However, most DL frameworks have been limited to a single node. In order to scale out DL frameworks and bring HPC capabilities to the DL arena, we propose, S-Caffe; a scalable and distributed Caffe adaptation for modern multi-GPU clusters. With an in-depth analysis of new requirements brought forward by the DL frameworks and limitations of current communication runtimes, we present a co-design of the Caffe framework and the MVAPICH2-GDR MPI runtime. Using the co-design methodology, we modify Caffe's workflow to maximize the overlap of computation and communication with multi-stage data propagation and gradient aggregation schemes. We bring DL-Awareness to the MPI runtime by proposing a hierarchical reduction design that benefits from CUDA-Aware features and provides up to a massive 133x speedup over OpenMPI and 2.6x speedup over MVAPICH2 for 160 GPUs. S-Caffe successfully scales up to 160 K-80 GPUs for GoogLeNet (ImageNet) with a speedup of 2.5x over 32 GPUs. To the best of our knowledge, this is the first framework that scales up to 160 GPUs. Furthermore, even for single node training, S-Caffe shows an improvement of 14\\% and 9\\% over Nvidia's optimized Caffe for 8 and 16 GPUs, respectively. In addition, S-Caffe achieves up to 1395 samples per second for the AlexNet model, which is comparable to the performance of Microsoft CNTK.", "citation": "Citations (17)", "year": "2017", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "conf": "ppopp", "authors": ["Ammar Ahmad Awan.....http://dblp.org/pers/hd/a/Awan:Ammar_Ahmad", "Khaled Hamidouche.....http://dblp.org/pers/hd/h/Hamidouche:Khaled", "Jahanzeb Maqbool Hashmi.....http://dblp.org/pers/hd/h/Hashmi:Jahanzeb_Maqbool", "Dhabaleswar K. Panda.....http://dblp.org/pers/hd/p/Panda:Dhabaleswar_K="], "pages": 13}