{"title": "An Image-based Deep Spectrum Feature Representation for the Recognition of Emotional Speech.", "fields": ["spectrogram", "contextual image classification", "convolutional neural network", "feature"], "abstract": "The outputs of the higher layers of deep pre-trained convolutional neural networks (CNNs) have consistently been shown to provide a rich representation of an image for use in recognition tasks. This study explores the suitability of such an approach for speech-based emotion recognition tasks. First, we detail a new acoustic feature representation, denoted as deep spectrum features, derived from feeding spectrograms through a very deep image classification CNN and forming a feature vector from the activations of the last fully connected layer. We then compare the performance of our novel features with standardised brute-force and bag-of-audio-words (BoAW) acoustic feature representations for 2- and 5-class speech-based emotion recognition in clean, noisy and denoised conditions. The presented results show that image-based approaches are a promising avenue of research for speech-based recognition tasks. Key results indicate that deep-spectrum features are comparable in performance with the other tested acoustic feature representations in matched for noise type train-test conditions; however, the BoAW paradigm is better suited to cross-noise-type train-test conditions.", "citation": "Citations (2)", "departments": ["University of Passau", "University of Passau", "University of Passau", "University of Passau", "University of Erlangen-Nuremberg"], "authors": ["Nicholas Cummins.....http://dblp.org/pers/hd/c/Cummins:Nicholas", "Shahin Amiriparian.....http://dblp.org/pers/hd/a/Amiriparian:Shahin", "Gerhard Hagerer.....http://dblp.org/pers/hd/h/Hagerer:Gerhard", "Anton Batliner.....http://dblp.org/pers/hd/b/Batliner:Anton", "Stefan Steidl.....http://dblp.org/pers/hd/s/Steidl:Stefan", "Björn W. Schuller.....http://dblp.org/pers/hd/s/Schuller:Bj=ouml=rn_W="], "conf": "mm", "year": "2017", "pages": 7}