{"title": "Control replication: compiling implicit parallelism to efficient SPMD with logical regions.", "fields": ["programming paradigm", "programmer", "spmd", "thread", "implicit parallelism"], "abstract": "We present control  replication , a technique for generating high-performance and scalable SPMD code from implicitly parallel programs. In contrast to traditional parallel programming models that require the programmer to explicitly manage threads and the communication and synchronization between them, implicitly parallel programs have sequential execution semantics and naturally avoid the pitfalls of explicitly parallel code. However, without optimizations to distribute control overhead, scalability is often poor.   Performance on distributed-memory machines is especially sensitive to communication and synchronization in the program, and thus optimizations for these machines require an intimate understanding of a program's memory accesses. Control replication achieves particularly effective and predictable results by leveraging language support for first-class data partitioning in the source programming model. We evaluate an implementation of control replication for Regent and show that it achieves up to 99% parallel efficiency at 1024 nodes with absolute performance comparable to hand-written MPI(+X) codes.", "citation": "Citations (2)", "year": "2017", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Nvidia"], "conf": "sc", "authors": ["Elliott Slaughter.....http://dblp.org/pers/hd/s/Slaughter:Elliott", "Wonchan Lee.....http://dblp.org/pers/hd/l/Lee:Wonchan", "Sean Treichler.....http://dblp.org/pers/hd/t/Treichler:Sean", "Wen Zhang.....http://dblp.org/pers/hd/z/Zhang:Wen", "Michael Bauer.....http://dblp.org/pers/hd/b/Bauer:Michael", "Galen M. Shipman.....http://dblp.org/pers/hd/s/Shipman:Galen_M=", "Patrick S. McCormick.....http://dblp.org/pers/hd/m/McCormick:Patrick_S=", "Alex Aiken.....http://dblp.org/pers/hd/a/Aiken:Alex"], "pages": 12}