{"title": "Incremental Graph Computations: Doable and Undoable.", "fields": ["bounded function", "query optimization", "pattern matching", "graph traversal", "small data"], "abstract": "The incremental problem for a class Q of graph queries aims to compute, given a query  Q  in 'Q, graph  G , output  Q(G)  and updates Δ  G  to  G  as input, changes Δ  O  to  Q(G)  such that  Q ( G  ⊕ Δ  G ) =  Q ( G ) ⊕ Δ  O . It is called  bounded  if its cost can be expressed as a polynomial function in the sizes of  Q , Δ  G  and Δ  O . It is to reduce computations on possibly big  G  to small Δ  G  and Δ  O . No matter how desirable, however, our first results are negative: for common graph queries such as graph traversal, connectivity, keyword search and pattern matching, their incremental problems are unbounded.   In light of the negative results, we propose two characterizations for the effectiveness of incremental computation: (a)  localizable , if its cost is decided by small neighbors of nodes in Δ  G  instead of the entire  G ; and (b)  bounded relative  to a batch algorithm  T , if the cost is determined by the sizes of Δ  G  and changes to the affected area that is necessarily checked by  T . We show that the incremental computations above are either localizable or relatively bounded, by providing corresponding incremental algorithms. That is, we can either reduce the incremental computations on big graphs to small data, or incrementalize batch algorithms by minimizing unnecessary recomputation. Using real-life graphs, we experimentally verify the effectiveness of our algorithms.", "citation": "Citations (9)", "year": "2017", "departments": ["University of Edinburgh", "Beihang University", "University of Edinburgh"], "conf": "sigmod", "authors": ["Wenfei Fan.....http://dblp.org/pers/hd/f/Fan:Wenfei", "Chunming Hu.....http://dblp.org/pers/hd/h/Hu:Chunming", "Chao Tian.....http://dblp.org/pers/hd/t/Tian:Chao"], "pages": 15}