{"title": "A feasibility study of using automated program repair for introductory programming assignments.", "fields": ["computer engineering", "know how", "intelligent tutoring system", "software bug", "software"], "abstract": "Despite the fact an intelligent tutoring system for programming (ITSP) education has long attracted interest, its widespread use has been hindered by the difficulty of generating personalized feedback automatically. Meanwhile, automated program repair (APR) is an emerging new technology that automatically fixes software bugs, and it has been shown that APR can fix the bugs of large real-world software. In this paper, we study the feasibility of marrying intelligent programming tutoring and APR. We perform our feasibility study with four state-of-the-art APR tools (GenProg, AE, Angelix, and Prophet), and 661 programs written by the students taking an introductory programming course. We found that when APR tools are used out of the box, only about 30% of the programs in our dataset are repaired. This low repair rate is largely due to the student programs often being significantly incorrect â   in contrast, professional software for which APR was successfully applied typically fails only a small portion of tests. To bridge this gap, we adopt in APR a new repair policy akin to the hint generation policy employed in the existing ITSP. This new repair policy admits partial repairs that address part of failing tests, which results in 84% improvement of repair rate. We also performed a user study with 263 novice students and 37 graders, and identified an understudied problem; while novice students do not seem to know how to effectively make use of generated repairs as hints, the graders do seem to gain benefits from repairs.", "citation": "Citations (4)", "departments": ["Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur", "National University of Singapore", "National University of Singapore", "Innopolis University, Russia"], "authors": ["Jooyong Yi.....http://dblp.org/pers/hd/y/Yi:Jooyong", "Umair Z. Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Umair_Z=", "Amey Karkare.....http://dblp.org/pers/hd/k/Karkare:Amey", "Shin Hwei Tan.....http://dblp.org/pers/hd/t/Tan:Shin_Hwei", "Abhik Roychoudhury.....http://dblp.org/pers/hd/r/Roychoudhury:Abhik"], "conf": "sigsoft", "year": "2017", "pages": 12}