{"title": "PAD: programming third-party web advertisement censorship.", "fields": ["blame", "delegation", "memory protection", "bidding", "enforcement"], "abstract": "In the current online advertisement delivery, an ad slot on a publisher's website may go through multiple layers of bidding and reselling until the final ad content is delivered. The publishers have little control on the ads being displayed on their web pages. As a result, website visitors may suffer from unwanted ads such as malvertising, intrusive ads, and information disclosure ads. Unfortunately, the visitors often blame the publisher for their unpleasant experience and switch to competitor websites. In this paper, we propose a novel programming support system for ad delivery, called PAD, for publisher programmers, who specify their policies on regulating third-party ads shown on their websites. PAD features an expressive specification language and a novel persistent policy enforcement runtime that can self-install and self-protect throughout the entire ad delegation chain. It also provides an ad-specific memory protection scheme that prevents malvertising by corrupting malicious payloads. Our experiments show that PAD has negligible runtime overhead. It effectively suppresses a set of malvertising cases and unwanted ad behaviors reported in the real world, without affecting normal functionalities and regular ads.", "citation": "Not cited", "departments": ["Purdue University", "Purdue University", "IBM", "Purdue University", "Purdue University"], "authors": ["Weihang Wang.....http://dblp.org/pers/hd/w/Wang:Weihang", "Yonghwi Kwon.....http://dblp.org/pers/hd/k/Kwon:Yonghwi", "Yunhui Zheng.....http://dblp.org/pers/hd/z/Zheng:Yunhui", "Yousra Aafer.....http://dblp.org/pers/hd/a/Aafer:Yousra", "I Luk Kim.....http://dblp.org/pers/hd/k/Kim:I_Luk", "Wen-Chuan Lee.....http://dblp.org/pers/hd/l/Lee:Wen=Chuan", "Yingqi Liu.....http://dblp.org/pers/hd/l/Liu:Yingqi", "Weijie Meng.....http://dblp.org/pers/hd/m/Meng:Weijie", "Xiangyu Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiangyu", "Patrick Eugster.....http://dblp.org/pers/hd/e/Eugster:Patrick"], "conf": "kbse", "year": "2017", "pages": 12}