{"title": "Wide Table Layout Optimization based on Column Ordering and Duplication.", "fields": ["column", "workload", "data analysis", "redundancy", "input output"], "abstract": "Modern data analytical tasks often witness very wide tables, from a few hundred columns to a few thousand. While it is commonly agreed that column stores are an appropriate data format for wide tables and analytical workloads, the physical  order of columns  has not been investigated. Column ordering plays a critical role in I/O performance, because in wide tables accessing the columns in a single horizontal partition may involve multiple disk seeks. An optimal column ordering will incur minimal cumulative disk seek costs for the set of queries applied to the data. In this paper, we aim to find such an optimal column layout to maximize I/O performance. Specifically, we study two problems for column stores on HDFS: column ordering and column duplication. Column ordering seeks an approximately optimal order of columns; column duplication complements column ordering in that some columns may be duplicated multiple times to reduce contention among the queries' diverse requirements on the column order. We consider an actual fine-grained cost model for column accesses and propose algorithms that take a query workload as input and output a column ordering strategy with or without storage redundancy that significantly improves the overall I/O performance. Experimental results over real-life data and production query workloads confirm the effectiveness of the proposed algorithms in diverse settings.", "citation": "Citations (2)", "year": "2017", "departments": ["Renmin University of China", "Microsoft", "Massachusetts Institute of Technology", "Microsoft", "Renmin University of China"], "conf": "sigmod", "authors": ["Haoqiong Bian.....http://dblp.org/pers/hd/b/Bian:Haoqiong", "Ying Yan.....http://dblp.org/pers/hd/y/Yan:Ying", "Wenbo Tao.....http://dblp.org/pers/hd/t/Tao:Wenbo", "Liang Jeff Chen.....http://dblp.org/pers/hd/c/Chen:Liang_Jeff", "Yueguo Chen.....http://dblp.org/pers/hd/c/Chen:Yueguo", "Xiaoyong Du.....http://dblp.org/pers/hd/d/Du:Xiaoyong", "Thomas Moscibroda.....http://dblp.org/pers/hd/m/Moscibroda:Thomas"], "pages": 16}