{"title": "RF-scanner: Shelf scanning with robot-assisted RFID systems.", "fields": ["smart system", "systems architecture", "system deployment", "robot kinematics", "school library"], "abstract": "Shelf scanning is one of the most important processes for inventory management in a library. It helps the librarians and library users discover the miss-shelved books and pinpoint where they are, improving the quality of service. By traditional means, however, manually checking each bookshelf suffers from extremely intensive labor and long scanning delay. Although some existing RFID-enabled approaches have been proposed, they suffer from either high-cost infrastructure or complicated system deployment, forming a great barrier to commercial adoption. In light of this, we in this paper propose a smart system called RF-Scanner that can perform the shelf scanning automatically by combining the robot technology and the RFID technology. The former is used for replacing the librarians and liberating them from intensively manual labor. The later is installed on the robot and moves with the robot to scan the on-the-shelf books. We formulate two important issues concerned by librarians, the book localization and the lying-down book detection, and give the sophisticated solutions to them. Besides, we implement RF-Scanner and put it into practical use in our school library. Long-term experiments and studies show that RF-Scanner provides fine-grained book localization with a mean error of just 1.3 cm and accurate detection accuracy of lying-down books with a mean error of 6%.", "citation": "Citations (2)", "departments": ["Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Jia Liu.....http://dblp.org/pers/hd/l/Liu_0008:Jia", "Feng Zhu.....http://dblp.org/pers/hd/z/Zhu_0003:Feng", "Yanyan Wang.....http://dblp.org/pers/hd/w/Wang:Yanyan", "Xia Wang.....http://dblp.org/pers/hd/w/Wang:Xia", "Qing-feng Pan.....http://dblp.org/pers/hd/p/Pan:Qing=feng", "Lijun Chen.....http://dblp.org/pers/hd/c/Chen_0006:Lijun"], "conf": "infocom", "year": "2017", "pages": 9}