{"title": "Ensuring the Reliability of Your Model Checker: Interval Iteration for Markov Decision Processes.", "fields": ["strongly connected component", "offset", "partially observable markov decision process", "markov decision process", "markov model"], "abstract": "Probabilistic model checking provides formal guarantees on quantitative properties such as reliability, performance or risk, so the accuracy of the numerical results that it returns is critical. However, recent results have shown that implementations of value iteration, a widely used iterative numerical method for computing reachability probabilities, can return results that are incorrect by several orders of magnitude. To remedy this, interval iteration, which instead converges simultaneously from both above and below, has been proposed. In this paper, we present interval iteration techniques for computing expected accumulated weights (or costs), a considerably broader class of properties. This relies on an efficient, mainly graph-based method to determine lower and upper bounds for extremal expected accumulated weights. To offset the additional effort of dual convergence, we also propose topological interval iteration, which increases efficiency using a model decomposition into strongly connected components. Finally, we present a detailed experimental evaluation, which highlights inaccuracies in standard benchmarks, rather than just artificial examples, and illustrates the feasibility of our techniques.", "citation": "Citations (7)", "year": "2017", "departments": ["Dresden University of Technology", "Dresden University of Technology", "Dresden University of Technology", "University of Birmingham", "Dresden University of Technology"], "conf": "cav", "authors": ["Christel Baier.....http://dblp.org/pers/hd/b/Baier:Christel", "Joachim Klein.....http://dblp.org/pers/hd/k/Klein_0001:Joachim", "Linda Leuschner.....http://dblp.org/pers/hd/l/Leuschner:Linda", "David Parker.....http://dblp.org/pers/hd/p/Parker_0001:David", "Sascha Wunderlich.....http://dblp.org/pers/hd/w/Wunderlich:Sascha"], "pages": 21}