{"title": "EMF: Embedding multiple flows of information in existing traffic for concurrent communication among heterogeneous IoT devices.", "fields": ["bit error rate", "internet of things", "radio spectrum", "throughput", "communication source"], "abstract": "The exponentially increasing number of IoT devices makes the unlicensed industrial, scientific, and medical (ISM) radio bands (e.g., 2.4 GHz) extremely crowded. Currently, there is no efficient solution to coordinate the large amount heterogeneous IoT devices that have different communication technologies (e.g., WiFi and ZigBee). To fill this gap, in this paper, we introduce embedded multiple flows (EMF) communication method, which (i) embeds different pieces of information in existing traffic and (ii)concurrently sends out these information from one IoT sender to multiple IoT receivers that have a different communication technology from the sender. By doing this, our EMF method (i) enables cross-technology communication among heterogeneous IoT devices, (ii) does not introduce any extra control traffic, and (iii) is transparent to the higher layer applications. Our approach is implemented on USRPs and commercial off-the-shelf (COTS) ZigBee devices. We also conducted extensive experiments to evaluate our approach in real-world settings. The evaluation results show that EMF's throughput is more than 14 times higher than the latest cross-technology communication technique (i.e. FreeBee[1]).", "citation": "Citations (3)", "departments": ["University of Maryland, Baltimore County", "University of Maryland, Baltimore County", "University of Maryland, Baltimore County", "University of Maryland, Baltimore County", "University of Maryland, Baltimore County"], "authors": ["Zicheng Chi.....http://dblp.org/pers/hd/c/Chi:Zicheng", "Zhichuan Huang.....http://dblp.org/pers/hd/h/Huang:Zhichuan", "Yao Yao.....http://dblp.org/pers/hd/y/Yao:Yao", "Tiantian Xie.....http://dblp.org/pers/hd/x/Xie:Tiantian", "Hongyu Sun.....http://dblp.org/pers/hd/s/Sun_0005:Hongyu", "Ting Zhu.....http://dblp.org/pers/hd/z/Zhu:Ting"], "conf": "infocom", "year": "2017", "pages": 9}