{"title": "How they interact? Understanding cyber and physical interactions against fault propagation in smart grid.", "fields": ["power system protection", "legacy system", "load shedding", "on the fly", "power engineering"], "abstract": "In the smart grid, computer networks (i.e., the cyber domain) are built upon physical infrastructures (i.e., the physical domain) to facilitate advanced functionalities that were considered not possible in legacy systems. It is envisioned that such a cyber-physical paradigm enables intelligent, collaborative controls to prevent faults from propagating along large-scale infrastructures, which is a primary cause for massive blackouts (e.g., Northeast blackout of 2003). Despite this promising vision, how effective cyber and physical interactions are against fault propagation is not yet fully investigated. In this paper, we use analysis and system-level simulations to characterize such interactions during load shedding, which is a process to stop fault propagation by shedding a computed amount of loads based on collaborative communication. Specifically, we model faults happening in the physical domain as a counting process, with each count triggering a load shedding action on the fly in the cyber domain. We show that although global load shedding design is considered optimal by globally coordinating shedding actions in power engineering, its induced failure probability (defined as the one that at least a given number of power lines fail) is scalable to the delay performance and the system size in the cyber domain, thus less likely to stop fault propagation in large systems than local shedding design that sheds loads within a limited system scope. Our study demonstrates that a joint view on cyber and physical factors is essential for failure prevention design in the smart grid.", "citation": "Citations (1)", "departments": ["University of South Florida", "Sam Houston State University", "Chinese Academy of Sciences"], "authors": ["Zhuo Lu.....http://dblp.org/pers/hd/l/Lu:Zhuo", "Mingkui Wei.....http://dblp.org/pers/hd/w/Wei:Mingkui", "Xiang Lu.....http://dblp.org/pers/hd/l/Lu:Xiang"], "conf": "infocom", "year": "2017", "pages": 9}