{"title": "An Efficient Approach to Event Detection and Forecasting in Dynamic Multivariate Social Media Networks.", "fields": ["prior probability", "nonparametric statistics", "approximation algorithm", "lagrangian relaxation", "scan statistic"], "abstract": "Anomalous subgraph detection has been successfully applied to event detection in social media. However, the subgraph detection problembecomes challenging when the social media network incorporates abundant attributes, which leads to a multivariate network. The multivariate characteristic makes most existing methods incapable to tackle this problem effectively and efficiently, as it involves joint feature selection and subgraph detection that has not been well addressed in the current literature, especially, in the dynamic multivariate networks in which attributes evolve over time.\n\nThis paper presents a generic framework, namely dynamic multivariate evolving anomalous subgraphs scanning (DMGraphScan), to addressthis problem in dynamic multivariate social media networks. We generalize traditional nonparametric statistics, and propose a new class of scan statistic functions for measuring the joint significance of evolving subgraphs and subsets of attributes to indicate the ongoing or forthcoming event in dynamic multivariate networks. We reformulate each scan statistic function as a sequence of subproblems with provable guarantees, and then propose an efficient approximation algorithm for tackling each subproblem. This algorithm resorts to the Lagrangian relaxation and a dynamic programming based on tree-shaped priors. As a case study, we conduct extensive experiments to demonstrate the performance of our proposed approach on two real-world applications (flu outbreak detection, haze detection) in different domains.", "citation": "Citations (2)", "departments": ["Beihang University", "Beihang University", "University at Albany, SUNY", "Beihang University", "Beihang University"], "authors": ["Minglai Shao.....http://dblp.org/pers/hd/s/Shao:Minglai", "Jianxin Li.....http://dblp.org/pers/hd/l/Li:Jianxin", "Feng Chen.....http://dblp.org/pers/hd/c/Chen_0001:Feng", "Hongyi Huang.....http://dblp.org/pers/hd/h/Huang:Hongyi", "Shuai Zhang.....http://dblp.org/pers/hd/z/Zhang:Shuai", "Xunxun Chen.....http://dblp.org/pers/hd/c/Chen:Xunxun"], "conf": "www", "year": "2017", "pages": 9}