{"title": "LSHiForest: A Generic Framework for Fast Tree Isolation Based Ensemble Anomaly Analysis.", "fields": ["locality sensitive hashing", "data type", "anomaly detection", "big data", "distance measures"], "abstract": "Anomaly or outlier detection is a major challenge in big data analytics because anomaly patterns provide valuable insights for decision-making in a wide range of applications. Recently proposed anomaly detection methods based on the tree isolation mechanism are very fast due to their logarithmic time complexity, making them capable of handling big data sets efficiently. However, the underlying similarity or distance measures in these methods have not been well understood. Contrary to the claims that these methods never rely on any distance measure, we find that they have close relationships with certain distance measures. This implies that the current use of this fast isolation mechanism is only limited to these distance measures and fails to generalise to other commonlyused measures. In this paper, we propose a generic framework named LSHiForest for fast tree isolation based ensemble anomaly analysis with the use of a Locality-Sensitive Hashing (LSH) forest. Being generic, the proposed framework can be instantiated with a diverse range of LSH families, and the fast isolation mechanism can be extended to any distance measures, data types and data spaces where an LSH family is defined. In particular, the instances of our framework with kernelised LSH families or learning based hashing schemes can detect complicated anomalies like local or surrounded anomalies. We also formally show that the existing tree isolation based detection methods are special cases of our framework with the corresponding distance measures. Extensive experiments on both synthetic and real-world benchmark data sets show that the framework can achieve both high time efficiency and anomaly detection quality.", "citation": "Citations (1)", "departments": ["University of Auckland", "Nanjing University", "University of Melbourne"], "authors": ["Xuyun Zhang.....http://dblp.org/pers/hd/z/Zhang:Xuyun", "Wan-Chun Dou.....http://dblp.org/pers/hd/d/Dou:Wan=Chun", "Qiang He.....http://dblp.org/pers/hd/h/He_0001:Qiang", "Rui Zhou.....http://dblp.org/pers/hd/z/Zhou_0001:Rui", "Christopher Leckie.....http://dblp.org/pers/hd/l/Leckie:Christopher", "Kotagiri Ramamohanarao.....http://dblp.org/pers/hd/r/Ramamohanarao:Kotagiri", "Zoran A. Salcic.....http://dblp.org/pers/hd/s/Salcic:Zoran_A="], "conf": "icde", "year": "2017", "pages": 12}