{"title": "Enabling mutation testing for Android apps.", "fields": ["application domain", "mutation testing", "test suite", "prioritization", "android"], "abstract": "Mutation testing has been widely used to assess the fault-detection effectiveness of a test suite, as well as to guide test case generation or prioritization. Empirical studies have shown that, while mutants are generally representative of real faults, an effective application of mutation testing requires “traditional” operators designed for programming languages to be augmented with operators specific to an application domain and/or technology. This paper proposes MDroid+, a framework for effective mutation testing of Android apps. First, we systematically devise a taxonomy of 262 types of Android faults grouped in 14 categories by manually analyzing 2,023 so ware artifacts from different sources (e.g., bug reports, commits). Then, we identified a set of 38 mutation operators, and implemented an infrastructure to automatically seed mutations in Android apps with 35 of the identified operators. The taxonomy and the proposed operators have been evaluated in terms of stillborn/trivial mutants generated as compared to well know mutation tools, and their capacity to represent real faults in Android apps", "citation": "Citations (9)", "departments": ["University of Los Andes", "University of Lugano", "College of William & Mary", "College of William & Mary", "University of Sannio"], "authors": ["Mario Linares Vásquez.....http://dblp.org/pers/hd/v/V=aacute=squez:Mario_Linares", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Michele Tufano.....http://dblp.org/pers/hd/t/Tufano:Michele", "Kevin Moran.....http://dblp.org/pers/hd/m/Moran:Kevin", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Christopher Vendome.....http://dblp.org/pers/hd/v/Vendome:Christopher", "Carlos Bernal-Cárdenas.....http://dblp.org/pers/hd/b/Bernal=C=aacute=rdenas:Carlos", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "conf": "sigsoft", "year": "2017", "pages": 12}