{"title": "Automated control of multiple software goals using multiple actuators.", "fields": ["actuator", "software", "non functional requirement", "generality", "experimental data"], "abstract": "Modern software should satisfy multiple goals simultaneously: it should provide predictable performance, be robust to failures, handle peak loads and deal seamlessly with unexpected conditions and changes in the execution environment. For this to happen, software designs should account for the possibility of runtime changes and provide formal guarantees of the software's behavior. Control theory is one of the possible design drivers for runtime adaptation, but adopting control theoretic principles often requires additional, specialized knowledge. To overcome this limitation, automated methodologies have been proposed to extract the necessary information from experimental data and design a control system for runtime adaptation. These proposals, however, only process one goal at a time, creating a chain of controllers. In this paper, we propose and evaluate the first automated strategy that takes into account multiple goals without separating them into multiple control strategies. Avoiding the separation allows us to tackle a larger class of problems and provide stronger guarantees. We test our methodology's generality with three case studies that demonstrate its broad applicability in meeting performance, reliability, quality, security, and energy goals despite environmental or requirements changes.", "citation": "Citations (1)", "departments": ["Lund University", "Mälardalen University College", "Imperial College London", "University of Chicago"], "authors": ["Martina Maggio.....http://dblp.org/pers/hd/m/Maggio:Martina", "Alessandro Vittorio Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos:Alessandro_Vittorio", "Antonio Filieri.....http://dblp.org/pers/hd/f/Filieri:Antonio", "Henry Hoffmann.....http://dblp.org/pers/hd/h/Hoffmann:Henry"], "conf": "sigsoft", "year": "2017", "pages": 12}