{"title": "Deep Structures of Collaboration: Physiological Correlates of Collective Intelligence and Group Satisfaction.", "fields": ["arousal", "social psychology", "collective intelligence", "social perception", "facial expression"], "abstract": "Collective intelligence (CI), a group's capacity to perform a wide variety of tasks, is a key factor in successful collaboration. Group composition, particularly diversity and member social perceptiveness, are consistent predictors of CI, but we have limited knowledge about the mechanisms underlying their effects. To address this gap, we examine how physiological synchrony, as an indicator of coordination and rapport, relates to CI in computer-mediated teams, and if synchrony might serve as a mechanism explaining the effect of group composition on CI. We present results from a laboratory experiment where 60 dyads completed the Test of Collective Intelligence (TCI) together online and rated their group satisfaction, while wearing physiological sensors. We find that synchrony in facial expressions (indicative of shared experience) was associated with CI and synchrony in electrodermal activity (indicative of shared arousal) with group satisfaction. Furthermore, various forms of synchrony mediated the effect of member diversity and social perceptiveness on CI and group satisfaction. Our results have important implications for online collaborations and distributed teams.", "citation": "Citations (5)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Massachusetts Institute of Technology", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Prerna Chikersal.....http://dblp.org/pers/hd/c/Chikersal:Prerna", "Maria Tomprou.....http://dblp.org/pers/hd/t/Tomprou:Maria", "Young Ji Kim.....http://dblp.org/pers/hd/k/Kim:Young_Ji", "Anita Williams Woolley.....http://dblp.org/pers/hd/w/Woolley:Anita_Williams", "Laura Dabbish.....http://dblp.org/pers/hd/d/Dabbish:Laura"], "conf": "cscw", "year": "2017", "pages": 16}