{"title": "When Personal Tracking Becomes Social: Examining the Use of Instagram for Healthy Eating.", "fields": ["social media", "social support", "multimedia", "impression management", "computer science"], "abstract": "Many people appropriate social media and online communities in their pursuit of personal health goals, such as healthy eating or increased physical activity. However, people struggle with impression management, and with reaching the right audiences when they share health information on these platforms. Instagram, a popular photo-based social media platform, has attracted many people who post and share their food photos. We aim to inform the design of tools to support healthy behaviors by understanding how people appropriate Instagram to track and share food data, the benefits they obtain from doing so, and the challenges they encounter. We interviewed 16 women who consistently record and share what they eat on Instagram. Participants tracked to support themselves and others in their pursuit of healthy eating goals. They sought social support for their own tracking and healthy behaviors and strove to provide that support for others. People adapted their personal tracking practices to better receive and give this support. Applying these results to the design of health tracking tools has the potential to help people better access social support.", "citation": "Citations (15)", "year": "2017", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "conf": "chi", "authors": ["Chia-Fang Chung.....http://dblp.org/pers/hd/c/Chung:Chia=Fang", "Elena Agapie.....http://dblp.org/pers/hd/a/Agapie:Elena", "Jessica Schroeder.....http://dblp.org/pers/hd/s/Schroeder:Jessica", "Sonali R. Mishra.....http://dblp.org/pers/hd/m/Mishra:Sonali_R=", "James Fogarty.....http://dblp.org/pers/hd/f/Fogarty:James", "Sean A. Munson.....http://dblp.org/pers/hd/m/Munson:Sean_A="], "pages": 14}