{"title": "Energy-efficient joint communication-motion planning for relay-assisted wireless robot surveillance.", "fields": ["asymptotically optimal algorithm", "bit error rate", "remote base station", "motion planning", "relay"], "abstract": "In this paper, we consider a surveillance scenario where a team of sensing robots survey a sensitive area and transmit the monitored data to a remote base station through a mobile relay. In this scenario, it is challenging to autonomously adjust the position of the mobile relay for the sake of minimizing the total communication-motion energy consumption of the system, while maintaining the communication quality of the mobile sensing robots. We first derive the asymptotically optimal transmit powers of the mobile relay and of the sensing robots according to the predefined end-to-end packet error rate (PER) requirement. Then, we propose a joint communication-motion planning (JCMP) method for minimizing the total communication-motion energy consumption in both: single- and multi-sensing-robot scenarios, where the trajectories of the sensing robots are rigorously defined. We further consider the scenario where the sensing robots' trajectories are not fixed but can be optimized in restrained areas. The effectiveness of the proposed JCMP is verified by analysis and numerical results for different system configurations, showing that a substantial energy-efficiency improvement may be achieved in comparison with the benchmark that only optimizes the communication energy consumption.", "citation": "Citations (1)", "departments": ["National University of Defense Technology", "National University of Defense Technology", "University of Southampton", "National University of Defense Technology", "National University of Defense Technology"], "authors": ["Yunlong Wu.....http://dblp.org/pers/hd/w/Wu:Yunlong", "Bo Zhang.....http://dblp.org/pers/hd/z/Zhang_0007:Bo", "Shaoshi Yang.....http://dblp.org/pers/hd/y/Yang:Shaoshi", "Xiaodong Yi.....http://dblp.org/pers/hd/y/Yi:Xiaodong", "Xuejun Yang.....http://dblp.org/pers/hd/y/Yang:Xuejun"], "conf": "infocom", "year": "2017", "pages": 9}