{"title": "Load balancing in large-scale systems with multiple dispatchers.", "fields": ["idle", "bottleneck", "information exchange", "load management", "wait"], "abstract": "Load balancing algorithms play a crucial role in delivering robust application performance in data centers and cloud networks. Recently, strong interest has emerged in Join-the-Idle-Queue (JIQ) algorithms, which rely on tokens issued by idle servers in dispatching tasks and outperform power-of-d policies. Specifically, JiQ strategies involve minimal information exchange, and yet achieve zero blocking and wait in the many-server limit. The latter property prevails in a multiple-dispatcher scenario when the loads are strictly equal among dispatchers. For various reasons it is not uncommon however for skewed load patterns to occur. We leverage product-form representations and fluid limits to establish that the blocking and wait then no longer vanish, even for arbitrarily low overall load. Remarkably, it is the least-loaded dispatcher that throttles tokens and leaves idle servers stranded, thus acting as bottleneck. Motivated by the above issues, we introduce two enhancements of the ordinary JIQ scheme where tokens are either distributed non-uniformly or occasionally exchanged among the various dispatchers. We prove that these extensions can achieve zero blocking and wait in the many-server limit, for any subcritical overall load and arbitrarily skewed load profiles. Extensive simulation experiments demonstrate that the asymptotic results are highly accurate, even for moderately sized systems.", "citation": "Citations (1)", "departments": ["Eindhoven University of Technology", "Eindhoven University of Technology", "Eindhoven University of Technology"], "authors": ["Mark van der Boor.....http://dblp.org/pers/hd/b/Boor:Mark_van_der", "Sem C. Borst.....http://dblp.org/pers/hd/b/Borst:Sem_C=", "Johan van Leeuwaarden.....http://dblp.org/pers/hd/l/Leeuwaarden:Johan_van"], "conf": "infocom", "year": "2017", "pages": 9}