{"title": "Fashion World Map: Understanding Cities Through Streetwear Fashion.", "fields": ["impression", "steiner tree problem", "visual analytics", "social media", "world map"], "abstract": "Fashion is an integral part of life. Streets as a social center for people's interaction become the most important public stage to showcase the fashion culture of a metropolitan area. In this paper, therefore, we propose a novel framework based on deep neural networks (DNN) for depicting the street fashion of a city by automatically discovering fashion items (e.g., jackets) in a particular look that are most  iconic  for the city, directly from a large collection of geo-tagged street fashion photos. To obtain a reasonable collection of iconic items, our task is formulated as the prize-collecting Steiner tree (PCST) problem, whereby a visually intuitive summary of the world's iconic street fashion can be created. To the best of our knowledge, this is the first work devoted to investigate the world's fashion landscape in modern times through the visual analytics of big social data. It shows how the visual impression of local fashion cultures across the world can be depicted, modeled, analyzed, compared, and exploited. In the experiments, our approach achieves the best performance (43.19%) on our large collected GSFashion dataset (170K photos), with an average of two times higher than all the other algorithms (FII: 20.13%, AP: 18.76%, DC: 17.90%), in terms of the users' agreement ratio on the discovered iconic fashion items of a city. The potential of our proposed framework for advanced sociological understanding is also demonstrated via practical applications.", "citation": "Not cited", "departments": ["Academia Sinica", "Academia Sinica", "Chinese Academy of Sciences", "National Taiwan University of Science and Technology"], "authors": ["Yu-Ting Chang.....http://dblp.org/pers/hd/c/Chang:Yu=Ting", "Wen-Haung Cheng.....http://dblp.org/pers/hd/c/Cheng:Wen=Haung", "Bo Wu.....http://dblp.org/pers/hd/w/Wu:Bo", "Kai-Lung Hua.....http://dblp.org/pers/hd/h/Hua:Kai=Lung"], "conf": "mm", "year": "2017", "pages": 9}