{"title": "Taming the Unpredictability of Cultural Markets with Social Influence.", "fields": ["resource allocation", "popularity", "social influence", "market share", "matthew effect"], "abstract": "Unpredictability is often portrayed as an undesirable outcome of social influence in cultural markets. Unpredictability stems from the \"rich get richer\" effect, whereby small fluctuations in the market share or popularity of products are amplified over time by social influence. In this paper, we report results of an experimental study that shows that unpredictability is not an inherent property of social influence. We investigate strategies for creating markets in which the popularity of products is better-and more predictably-aligned with their underlying quality. For our study, we created a cultural market of science stories and conducted randomized experiments on different policies for presenting the stories to study participants. Specifically, we varied how the stories were ranked, and whether or not participants were shown the ratings these stories received from others. We present a policy that leverages social influence and product positioning to help distinguish the product's market share (popularity) from underlying quality. Highlighting products with the highest estimated quality reduces the \"rich get richer\" effect highlighting popular products. We show that this policy allows us to more robustly and predictably identify high quality products and promote blockbusters. The policy can be used to create more efficient online cultural markets with a better allocation of resources to products.", "citation": "Citations (4)", "departments": ["Massachusetts Institute of Technology", "Melbourne Business School", "University of Michigan", "University of Southern California", "Institute for M ...  Alto, CA, USA"], "authors": ["Andrés Abeliuk.....http://dblp.org/pers/hd/a/Abeliuk:Andr=eacute=s", "Gerardo Berbeglia.....http://dblp.org/pers/hd/b/Berbeglia:Gerardo", "Pascal Van Hentenryck.....http://dblp.org/pers/hd/h/Hentenryck:Pascal_Van", "Tad Hogg.....http://dblp.org/pers/hd/h/Hogg:Tad", "Kristina Lerman.....http://dblp.org/pers/hd/l/Lerman:Kristina"], "conf": "www", "year": "2017", "pages": 10}