{"title": "NCAP: Network-Driven, Packet Context-Aware Power Management for Client-Server Architecture.", "fields": ["service level agreement", "network interface controller", "network packet", "power management", "response time"], "abstract": "The rate of network packets encapsulating requests from clients can significantly affect the utilization, and thus performance and sleep states of processors in servers deploying a power management policy. To improve energy efficiency, servers may adopt an aggressive power management policy that frequently transitions a processor to a low-performance or sleep state at a low utilization. However, such servers may not respond to a sudden increase in the rate of requests from clients early enough due to a considerable performance penalty of transitioning a processor from a sleep or low-performance state to a high-performance state. This in turn entails violations of a service level agreement (SLA), discourages server operators from deploying an aggressive power management policy, and thus wastes energy during low-utilization periods. For both fast response time and high energy-efficiency, we propose NCAP, Network-driven, packet Context-Aware Power management for client-server architecture. NCAP enhances a network interface card (NIC) and its driver such that it can examine received and transmitted network packets, determine the rate of network packets containing latency-critical requests, and proactively transition a processor to an appropriate performance or sleep state. To demonstrate the efficacy, we evaluate on-line data-intensive (OLDI) applications and show that a server deploying NCAP consumes 37~61% lower processor energy than a baseline server while satisfying a given SLA at various load levels.", "citation": "Citations (1)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Wisconsin-Madison", "University of Illinois at Urbana–Champaign", "Daegu Gyeongbuk Institute of Science and Technology", "National Center for Supercomputing Applications", "University of Illinois at Urbana–Champaign"], "authors": ["Mohammad Alian.....http://dblp.org/pers/hd/a/Alian:Mohammad", "Ahmed H. M. O. Abulila.....http://dblp.org/pers/hd/a/Abulila:Ahmed_H=_M=_O=", "Lokesh Jindal.....http://dblp.org/pers/hd/j/Jindal:Lokesh", "Daehoon Kim.....http://dblp.org/pers/hd/k/Kim:Daehoon", "Nam Sung Kim.....http://dblp.org/pers/hd/k/Kim:Nam_Sung"], "conf": "hpca", "year": "2017", "pages": 12}