{"title": "Strategy logic with imperfect information.", "fields": ["ctl", "atomic sentence", "undecidable problem", "universal quantification", "decidability"], "abstract": "We introduce an extension of Strategy logic for the imperfect-information setting, called SL ii , and study its model-checking problem. As this logic naturally captures multi-player games with imperfect information, the problem turns out to be undecidable. We introduce a syntactical class of “hierarchical instances” for which, intuitively, as one goes down the syntactic tree of the formula, strategy quantifications are concerned with finer observations of the model. We prove that model-checking SL ii  restricted to hierarchical instances is decidable. This result, because it allows for complex patterns of existential and universal quantification on strategies, greatly generalises previous ones, such as decidability of multi-player games with imperfect information and hierarchical observations, and decidability of distributed synthesis for hierarchical systems. To establish the decidability result, we introduce and study QCTL ii *, an extension of QCTL (itself an extension of CTL with second-order quantification over atomic propositions) by parameterising its quantifiers with observations. The simple syntax of QCTL ii * allows us to provide a conceptually neat reduction of SL ii  to QCTL ii * that separates concerns, allowing one to forget about strategies and players and focus solely on second-order quantification. While the model-checking problem of QCTL ii * is, in general, undecidable, we identify a syntactic fragment of hierarchical formulas and prove, using an automata-theoretic approach, that it is decidable. The decidability result for SL ii  follows since the reduction maps hierarchical instances of SL ii  to hierarchical formulas of QCTL ii *.", "citation": "Citations (7)", "departments": ["École Normale Supérieure", "Rice University", "Università degl ... , Naples, Italy", "Università degl ... , Naples, Italy", "Università degl ... , Naples, Italy"], "authors": ["Raphaël Berthon.....http://dblp.org/pers/hd/b/Berthon:Rapha=euml=l", "Bastien Maubert.....http://dblp.org/pers/hd/m/Maubert:Bastien", "Aniello Murano.....http://dblp.org/pers/hd/m/Murano:Aniello", "Sasha Rubin.....http://dblp.org/pers/hd/r/Rubin:Sasha", "Moshe Y. Vardi.....http://dblp.org/pers/hd/v/Vardi:Moshe_Y="], "conf": "lics", "year": "2017", "pages": 12}