{"title": "Fine-grained DRAM: energy-efficient DRAM for extreme bandwidth systems.", "fields": ["dram", "cas latency", "universal memory", "high bandwidth memory", "memory controller"], "abstract": "Future GPUs and other high-performance throughput processors will require multiple TB/s of bandwidth to DRAM. Satisfying this bandwidth demand within an acceptable energy budget is a challenge in these extreme bandwidth memory systems. We propose a new high-bandwidth DRAM architecture, Fine-Grained DRAM (FGDRAM), which improves bandwidth by 4× and improves the energy efficiency of DRAM by 2× relative to the highest-bandwidth, most energy-efficient contemporary DRAM, High Bandwidth Memory (HBM2). These benefits are in large measure achieved by partitioning the DRAM die into many independent units, called grains, each of which has a local, adjacent I/O. This approach unlocks the bandwidth of all the banks in the DRAM to be used simultaneously, eliminating shared buses interconnecting various banks. Furthermore, the on-DRAM data movement energy is significantly reduced due to the much shorter wiring distance between the cell array and the local I/O. This FGDRAM architecture readily lends itself to leveraging existing techniques to reducing the effective DRAM row size in an area efficient manner, reducing wasteful row activate energy in applications with low locality. In addition, when FGDRAM is paired with a memory controller optimized to exploit the additional concurrency provided by the independent grains, it improves GPU system performance by 19% over an iso-bandwidth and iso-capacity future HBM baseline. Thus, this energy-efficient, high-bandwidth FGDRAM architecture addresses the needs of future extreme-bandwidth memory systems.", "citation": "Not cited", "departments": ["University of Texas at Austin", "Nvidia", "Nvidia", "Nvidia", "Nvidia"], "authors": ["Mike O'Connor.....http://dblp.org/pers/hd/o/O=Connor:Mike", "Niladrish Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Niladrish", "Donghyuk Lee.....http://dblp.org/pers/hd/l/Lee:Donghyuk", "John M. Wilson.....http://dblp.org/pers/hd/w/Wilson_0002:John_M=", "Aditya Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Aditya", "Stephen W. Keckler.....http://dblp.org/pers/hd/k/Keckler:Stephen_W=", "William J. Dally.....http://dblp.org/pers/hd/d/Dally:William_J="], "conf": "micro", "year": "2017", "pages": 14}