{"title": "Understanding the impact of refactoring on smells: a longitudinal study of 23 software projects.", "fields": ["god object", "code smell", "code refactoring", "generality", "longitudinal study"], "abstract": "Code smells in a program represent indications of structural quality problems, which can be addressed by software refactoring. However, refactoring intends to achieve different goals in practice, and its application may not reduce smelly structures. Developers may neglect or end up creating new code smells through refactoring. Unfortunately, little has been reported about the beneficial and harmful effects of refactoring on code smells. This paper reports a longitudinal study intended to address this gap. We analyze how often commonly-used refactoring types affect the density of 13 types of code smells along the version histories of 23 projects. Our findings are based on the analysis of 16,566 refactorings distributed in 10 different types. Even though 79.4% of the refactorings touched smelly elements, 57% did not reduce their occurrences. Surprisingly, only 9.7% of refactorings removed smells, while 33.3% induced the introduction of new ones. More than 95% of such refactoring-induced smells were not removed in successive commits, which suggest refactorings tend to more frequently introduce long-living smells instead of eliminating existing ones. We also characterized and quantified typical refactoring-smell patterns, and observed that harmful patterns are frequent, including: (i) approximately 30% of the  Move Method  and  Pull Up Method  refactorings induced the emergence of  God Class , and (ii) the  Extract Superclass  refactoring creates the smell  Speculative Generality  in 68% of the cases.", "citation": "Not cited", "departments": ["Pontifical Catholic University of Rio de Janeiro", "Pontifical Catholic University of Rio de Janeiro", "Federal University of Campina Grande", "Federal University of Campina Grande", "Pontifical Catholic University of Rio de Janeiro"], "authors": ["Diego Cedrim.....http://dblp.org/pers/hd/c/Cedrim:Diego", "Alessandro Garcia.....http://dblp.org/pers/hd/g/Garcia:Alessandro", "Melina Mongiovi.....http://dblp.org/pers/hd/m/Mongiovi:Melina", "Rohit Gheyi.....http://dblp.org/pers/hd/g/Gheyi:Rohit", "Leonardo da Silva Sousa.....http://dblp.org/pers/hd/s/Sousa:Leonardo_da_Silva", "Rafael Maiani de Mello.....http://dblp.org/pers/hd/m/Mello:Rafael_Maiani_de", "Baldoino Fonseca.....http://dblp.org/pers/hd/f/Fonseca:Baldoino", "Márcio Ribeiro.....http://dblp.org/pers/hd/r/Ribeiro:M=aacute=rcio", "Alexander Chávez.....http://dblp.org/pers/hd/c/Ch=aacute=vez:Alexander"], "conf": "sigsoft", "year": "2017", "pages": 11}