{"title": "A Paralinguistic Approach To Speaker Diarisation: Using Age, Gender, Voice Likability and Personality Traits.", "fields": ["voice activity detection", "paralanguage", "speaker diarisation", "big five personality traits", "speaker recognition"], "abstract": "In this work, we present a new view on automatic speaker diarisation, i.e., assessing \"who speaks when\", based on the recognition of speaker traits such as age, gender, voice likability, and personality. Traditionally, speaker diarisation is accomplished using low-level audio descriptors (e.g., cepstral or spectral features), neglecting the fact that speakers can be well discriminated by humans according to various perceived characteristics. Thus, we advocate a novel paralinguistic approach that combines speaker diarisation with speaker characterisation by automatically identifying the speakers according to their individual traits. In a three-tier processing flow, speaker segmentation by voice activity detection (VAD) is initially performed to detect speaker turns. Next, speaker attributes are predicted using pre-trained paralinguistic models. To tag the speakers, clustering algorithms are applied to the predicted traits. We evaluate our methods against state-of-the-art open source and commercial systems on a corpus of realistic, spontaneous dyadic conversations recorded in the wild from three different cultures (Chinese, English, German). Our results provide clear evidence that using paralinguistic features for speaker diarisation is a promising avenue of research.", "citation": "Not cited", "departments": ["Imperial College London", "Nuance Communications", "Imperial College London", "University of Passau", "audEERING GmbH, ... lching, Germany"], "authors": ["Yue Zhang.....http://dblp.org/pers/hd/z/Zhang_0014:Yue", "Felix Weninger.....http://dblp.org/pers/hd/w/Weninger:Felix", "Boqing Liu.....http://dblp.org/pers/hd/l/Liu:Boqing", "Maximilian Schmitt.....http://dblp.org/pers/hd/s/Schmitt:Maximilian", "Florian Eyben.....http://dblp.org/pers/hd/e/Eyben:Florian", "Björn W. Schuller.....http://dblp.org/pers/hd/s/Schuller:Bj=ouml=rn_W="], "conf": "mm", "year": "2017", "pages": 6}