{"title": "Database System Support for Personalized Recommendation Applications.", "fields": ["database design", "analytics", "personalization", "database engine", "database search engine"], "abstract": "Personalized recommendation has become popular in modern web services. For instance, Amazon recommends new items to shoppers. Also, Netflix recommends shows to viewers, and Facebook recommends friends to its users. Despite the ubiquity of recommendation applications, classic database management systems still do not provide in-house support for recommending data stored in the database. In this paper, we present the anatomy of RecDB an open source PostgreSQLbased system that provides a unified approach for declarative data recommendation inside the database engine. RecDB realizes the personalized recommendation functionality as query operators inside the database kernel. That facilitates applying the recommendation functionality and typical database operations (e.g., Selection, Join, Top-k) side-by-side. To further reduce the application latency, RecDB pre-computes and caches the generated recommendation in the database. In the paper, we present extensive experiments that study the performance of personalized recommendation applications based on an actual implementation inside PostgreSQL 9.2 using real Movie recommendation and location-aware recommendation scenarios. The results show that a recommendation-aware database engine, i.e., RecDB, outperforms the classic approach that implements the recommendation logic on-top of the database engine in various recommendation applications.", "citation": "Not cited", "departments": ["Arizona State University", "IBM", "Computing, Info ... hool of (CIDSE)", "Computer Scienc ... and Engineering"], "authors": ["Mohamed Sarwat.....http://dblp.org/pers/hd/s/Sarwat:Mohamed", "Raha Moraffah.....http://dblp.org/pers/hd/m/Moraffah:Raha", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F=", "James L. Avery.....http://dblp.org/pers/hd/a/Avery:James_L="], "conf": "icde", "year": "2017", "pages": 12}