{"title": "Efficient Computation of Regret-ratio Minimizing Set: A Compact Maxima Representative.", "fields": ["ranking", "linear combination", "regret", "linear function", "tuple"], "abstract": "Finding the maxima of a database based on a user preference, especially when the ranking function is a linear combination of the attributes, has been the subject of recent research. A critical observation is that the  em convex hull  is the subset of tuples that can be used to find the maxima of any linear function. However, in real world applications the convex hull can be a significant portion of the database, and thus its performance is greatly reduced. Thus, computing a subset limited to $r$ tuples that minimizes the  regret ratio  (a measure of the user's dissatisfaction with the result from the limited set versus the one from the entire database) is of interest.   In this paper, we make several fundamental theoretical as well as practical advances in developing such a compact set. In the case of two dimensional databases, we develop an optimal linearithmic time algorithm by leveraging the ordering of skyline tuples. In the case of higher dimensions, the problem is known to be NPcomplete. As one of our main results of this paper, we develop an approximation algorithm that runs in linearithmic time and guarantees a regret ratio, within any arbitrarily small user-controllable distance from the optimal regret ratio. The comprehensive set of experiments on both synthetic and publicly available real datasets confirm the efficiency, quality of output, and scalability of our proposed algorithms.", "citation": "Citations (2)", "year": "2017", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "George Washington University", "University of Texas at Arlington"], "conf": "sigmod", "authors": ["Abolfazl Asudeh.....http://dblp.org/pers/hd/a/Asudeh:Abolfazl", "Azade Nazi.....http://dblp.org/pers/hd/n/Nazi:Azade", "Nan Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Nan", "Gautam Das.....http://dblp.org/pers/hd/d/Das_0001:Gautam"], "pages": 14}