{"title": "Learning Continuous Semantic Representations of Symbolic Expressions.", "fields": ["semantic equivalence", "deep learning", "expression", "feature learning", "procedural knowledge"], "abstract": "The question of how procedural knowledge is represented and inferred is a fundamental problem in machine learning and artificial intelligence. Recent work on program induction has proposed neural architectures, based on abstractions like stacks, Turing machines, and interpreters,  that operate on abstract computational machines or on execution traces. But the recursive abstraction that is central to procedural knowledge is perhaps most naturally represented by symbolic representations that have syntactic structure, such as logical expressions and source code. Combining abstract, symbolic reasoning with continuous neural reasoning is a grand challenge of representation learning. As a step in this direction, we propose a new architecture, called neural equivalence networks, for the problem of learning continuous semantic representations of mathematical and logical expressions. These networks are trained to represent semantic equivalence, even of expressions that are syntactically very different. The challenge is that semantic representations must be computed in a syntax-directed manner, because semantics is compositional, but at the same time, small changes in syntax can lead to very large changes in semantics, which can be difficult for continuous neural architectures. We perform an exhaustive evaluation  on the task of checking equivalence on a highly diverse class of symbolic algebraic and boolean expression types, showing that our model significantly outperforms existing architectures.", "citation": "Citations (7)", "departments": ["University of Edinburgh", "University of Edinburgh", "Microsoft", "University of Edinburgh"], "authors": ["Miltiadis Allamanis.....http://dblp.org/pers/hd/a/Allamanis:Miltiadis", "Pankajan Chanthirasegaran.....http://dblp.org/pers/hd/c/Chanthirasegaran:Pankajan", "Pushmeet Kohli.....http://dblp.org/pers/hd/k/Kohli:Pushmeet", "Charles A. Sutton.....http://dblp.org/pers/hd/s/Sutton:Charles_A="], "conf": "icml", "year": "2017", "pages": 9}