{"title": "Augmenting max-weight with explicit learning for wireless scheduling with switching costs.", "fields": ["wireless", "lyapunov function", "distributed computing", "markov process", "queue", "computer science", "scheduling", "markov chain", "channel"], "abstract": "In small-cell wireless networks where users are connected to multiple base stations (BSs), it is often advantageous to opportunistically switch off a subset of BSs to minimize energy costs. We consider two types of energy cost: (i) the cost of maintaining a BS in the active state, and (ii) the cost of switching a BS from the active state to inactive state. The problem is to operate the network at the lowest possible energy cost (sum of activation and switching costs) subject to queue stability. In this setting, the traditional approach — a Max-Weight algorithm along with a Lyapunov-based stability argument — does not suffice to show queue stability, essentially due to the temporal co-evolution between channel scheduling and the BS activation decisions induced by the switching cost. Instead, we develop a learning and BS activation algorithm with slow temporal dynamics, and a Max-Weight based channel scheduler that has fast temporal dynamics. We show using convergence of time-inhomogeneous Markov chains, that the co-evolving dynamics of learning, BS activation and queue lengths lead to near optimal average energy costs along with queue stability.", "citation": "Not cited", "departments": ["University of Texas at Austin", "Indian Institute of Science", "University of Texas at Austin", "University of Texas at Austin", "Indian Institute of Science"], "authors": ["Subhashini Krishnasamy.....http://dblp.org/pers/hd/k/Krishnasamy:Subhashini", "P. T. Akhil.....http://dblp.org/pers/hd/a/Akhil:P=_T=", "Ari Arapostathis.....http://dblp.org/pers/hd/a/Arapostathis:Ari", "Sanjay Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Sanjay", "Rajesh Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Rajesh"], "conf": "infocom", "year": "2017", "pages": 9}