{"title": "More Than Peer Production: Fanfiction Communities as Sites of Distributed Mentoring.", "fields": ["discussion group", "peer production", "thematic analysis", "affordance", "informal learning"], "abstract": "From Harry Potter to American Horror Story, fanfiction is extremely popular among young people. Sites such as Fanfiction.net host millions of stories, with thousands more posted each day. Enthusiasts are sharing their writing and reading stories written by others. Exactly how does a generation known more for videogame expertise than long-form writing become so engaged in reading and writing in these communities? Via a nine-month ethnographic investigation of fanfiction communities that included participant observation, interviews, a thematic analysis of 4,500 reader reviews and an in-depth case study of a discussion group, we found that members of fanfiction communities spontaneously mentor each other in open forums, and that this mentoring builds upon previous interactions in a way that is distinct from traditional forms of mentoring and made possible by the affordances of networked publics. This work extends and develops the theory of distributed mentoring. Our findings illustrate how distributed mentoring supports fanfiction authors as they work to develop their writing skills. We believe distributed mentoring holds potential for supporting learning in a variety of formal and informal learning environments.", "citation": "Citations (4)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Sarah Evans.....http://dblp.org/pers/hd/e/Evans:Sarah", "Katie Davis.....http://dblp.org/pers/hd/d/Davis:Katie", "Abigail Evans.....http://dblp.org/pers/hd/e/Evans:Abigail", "Julie Ann Campbell.....http://dblp.org/pers/hd/c/Campbell:Julie_Ann", "David P. Randall.....http://dblp.org/pers/hd/r/Randall:David_P=", "Kodlee Yin.....http://dblp.org/pers/hd/y/Yin:Kodlee", "Cecilia R. Aragon.....http://dblp.org/pers/hd/a/Aragon:Cecilia_R="], "conf": "cscw", "year": "2017", "pages": 14}