{"title": "SmartGuidance'17: 2nd workshop on intelligent personal support of human behavior.", "fields": ["information overload", "human behavior", "social issues", "ubiquitous computing", "digital library"], "abstract": "In today's fast-paced environment, humans are faced with various problems such as information overload, stress, health and social issues. So-called  anticipatory systems  promise to approach these issues through personal guidance or support within a user's daily and professional life.   The  Second Workshop on Intelligent Personal Support of Human Behavior  (SmartGuidance'17) aims to build on the success of the previous workshop (namely  Smarticipation ) organized in conjunction with UbiComp 2016, to continue discussing the latest research outcomes of anticipatory mobile systems. We invite the submission of papers within this emerging, interdisciplinary research field of  anticipatory mobile computing  that focuses on understanding, design, and development of such ubiquitous systems. We also welcome contributions that investigate human behaviors, underlying recognition and prediction models; conduct field studies; as well as propose novel HCI techniques to provide personal support. All workshop contributions will be published in supplemental proceedings of the UbiComp 2017 conference and included in the ACM Digital Library.", "citation": "Not cited", "departments": ["Technische Universität Darmstadt", "University of East London", "University of Freiburg", "Technische Universität Darmstadt", "UET, Taxila, Pakistan"], "authors": ["Christian Meurisch.....http://dblp.org/pers/hd/m/Meurisch:Christian", "Usman Naeem.....http://dblp.org/pers/hd/n/Naeem:Usman", "Philipp M. Scholl.....http://dblp.org/pers/hd/s/Scholl:Philipp_M=", "Muhammad Awais Azam.....http://dblp.org/pers/hd/a/Azam:Muhammad_Awais", "Sebastian Günther.....http://dblp.org/pers/hd/g/G=uuml=nther:Sebastian", "Paul Baumann.....http://dblp.org/pers/hd/b/Baumann:Paul", "Shafiq ur Réhman.....http://dblp.org/pers/hd/r/R=eacute=hman:Shafiq_ur", "Max Mühlhäuser.....http://dblp.org/pers/hd/m/M=uuml=hlh=auml=user:Max"], "conf": "huc", "year": "2017", "pages": 4}