{"title": "Regression test selection across JVM boundaries.", "fields": ["source lines of code", "system call", "linux kernel", "regression testing", "software development process"], "abstract": "Modern software development processes recommend that changes be integrated into the main development line of a project multiple times a day. Before a new revision may be integrated, developers practice regression testing to ensure that the latest changes do not break any previously established functionality. The cost of regression testing is high, due to an increase in the number of revisions that are introduced per day, as well as the number of tests developers write per revision. Regression test selection (RTS) optimizes regression testing by skipping tests that are not affected by recent project changes. Existing dynamic RTS techniques support only projects written in a single programming language, which is unfortunate knowing that an open-source project is on average written in several programming languages.     We present the first dynamic RTS technique that does not stop at predefined language boundaries. Our technique dynamically detects, at the operating system level, all file artifacts a test depends on. Our technique is, hence, oblivious to the specific means the test uses to actually access the files: be it through spawning a new process, invoking a system call, invoking a library written in a different language, invoking a library that spawns a process which makes a system call, etc. We also provide a set of extension points which allow for a smooth integration with testing frameworks and build systems. We implemented our technique in a tool called RTSLinux as a loadable Linux kernel module and evaluated it on 21 Java projects that escape JVM by spawning new processes or invoking native code, totaling 2,050,791 lines of code. Our results show that RTSLinux, on average, skips 74.17% of tests and saves 52.83% of test execution time compared to executing all tests.", "citation": "Citations (3)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "Microsoft", "University of Texas at Austin"], "authors": ["Ahmet Çelik.....http://dblp.org/pers/hd/=/=Ccedil=elik:Ahmet", "Marko Vasic.....http://dblp.org/pers/hd/v/Vasic:Marko", "Aleksandar Milicevic.....http://dblp.org/pers/hd/m/Milicevic:Aleksandar", "Milos Gligoric.....http://dblp.org/pers/hd/g/Gligoric:Milos"], "conf": "sigsoft", "year": "2017", "pages": 12}