{"title": "Face Aging with Contextual Generative Adversarial Nets.", "fields": ["residual", "generative grammar", "discriminative model", "generative model", "adversarial system"], "abstract": "Face aging, which renders aging faces for an input face, has attracted extensive attention in the multimedia research. Recently, several conditional Generative Adversarial Nets (GANs) based methods have achieved great success. They can generate images fitting the real face distributions conditioned on each individual age group. However, these methods fail to capture the transition patterns, e.g., the gradual shape and texture changes between adjacent age groups. In this paper, we propose a novel Contextual Generative Adversarial Nets (C-GANs) to specifically take it into consideration. The C-GANs consists of a conditional transformation network and two discriminative networks. The conditional transformation network imitates the aging procedure with several specially designed residual blocks. The age discriminative network guides the synthesized face to fit the real conditional distribution. The transition pattern discriminative network is novel, aiming to distinguish the real transition patterns with the fake ones. It serves as an extra regularization term for the conditional transformation network, ensuring the generated image pairs to fit the corresponding real transition pattern distribution. Experimental results demonstrate the proposed framework produces appealing results by comparing with the state-of-the-art and ground truth. We also observe performance gain for cross-age face verification.", "citation": "Citations (6)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "University of Trento"], "authors": ["Si Liu.....http://dblp.org/pers/hd/l/Liu:Si", "Yao Sun.....http://dblp.org/pers/hd/s/Sun:Yao", "Defa Zhu.....http://dblp.org/pers/hd/z/Zhu:Defa", "Renda Bao.....http://dblp.org/pers/hd/b/Bao:Renda", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0108:Wei", "Xiangbo Shu.....http://dblp.org/pers/hd/s/Shu:Xiangbo", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2017", "pages": 9}