{"title": "Adaptively Secure Conjunctive Query Processing over Encrypted Data for Cloud Computing.", "fields": ["random oracle", "conjunctive query", "range query", "boolean conjunctive query", "tree traversal"], "abstract": "This paper concerns the fundamental problem of processing conjunctive queries that contain both keyword conditions and range conditions on public clouds in a privacy preserving manner. No prior Searchable Symmetric Encryption (SSE) based privacy-preserving conjunctive query processing scheme satisfies the three requirements of adaptive security, efficient query processing, and scalable index size. In this paper, we propose the first privacy preserving conjunctive query processing scheme that satisfies the above requirements. To achieve adaptive security, we propose an Indistinguishable Bloom Filter (IBF) data structure for indexing. To achieve efficient query processing and structure indistinguishability, we propose a highly balanced binary tree data structure called Indistinguishable Binary Tree (IBtree). To optimize searching efficiency, we propose a traversal width minimization algorithm and a traversal depth minimization algorithm. To achieve scalable and compact index size, we propose an IBtree space compression algorithm to remove redundant information in IBFs. We formally prove that our scheme is adaptive secure using a random oracle model. The key contribution of this paper is on achieving conjunctive query processing with both strong privacy guarantee and practical efficiency in terms of both speed and space. We implemented our scheme in C++, evaluated and compared its performance with KRB [24] for keyword queries and PBtree [32] for range queries on two realworld data sets. Experimental results show that our scheme is fast and scalable (in milliseconds).", "citation": "Citations (2)", "departments": ["Dongguan University of Technology", "Dongguan University of Technology"], "authors": ["Rui Li.....http://dblp.org/pers/hd/l/Li:Rui", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X="], "conf": "icde", "year": "2017", "pages": 12}