{"title": "Monitoring quality-of-experience for operational cellular networks using machine-to-machine traffic.", "fields": ["operator", "cellular traffic", "level measurement", "quality of experience", "machine to machine"], "abstract": "It is crucial for cellular data network operators to understand the service quality perceived by its customers. The state-of-art systems deployed in cellular networks mostly report service quality aggregated on cell site level, which is typically an aggregation of tens or hundreds of customers depending on the locations of the cell sites. In this paper, we propose to enhance the measurement of customer-perceived service quality by leveraging M2M devices as sensors in the field, which provide an unprecedented opportunity for cellular network operators to measure what end-users experience with better accuracy and coverage. Our approach is to identify a set of M2M devices which are stationary and communicate continuously over the cellular network over an indefinite period of time. We use these M2M devices to estimate the customer-perceived service quality during cell site outages. We implement our methodology as a system called M2MScan and evaluate M2MScan with both synthetic outages and real outages from a large-scale operational cellular network. To the best of our knowledge, this is the first work that employs M2M devices to measure the service quality perceived by customers in operational cellular networks at a large scale.", "citation": "Not cited", "departments": ["Michigan State University", "AT&T Labs", "AT&T Labs", "Michigan State University", "AT&T Labs"], "authors": ["Faraz Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Faraz", "Jeffrey Erman.....http://dblp.org/pers/hd/e/Erman:Jeffrey", "Zihui Ge.....http://dblp.org/pers/hd/g/Ge:Zihui", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Jia Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jia", "He Yan.....http://dblp.org/pers/hd/y/Yan:He"], "conf": "infocom", "year": "2017", "pages": 9}