{"title": "CENTURION: Incentivizing multi-requester mobile crowd sensing.", "fields": ["double auction", "data aggregator", "rationality", "incentive", "outsourcing"], "abstract": "The recent proliferation of increasingly capable mobile devices has given rise to mobile crowd sensing (MCS) systems that outsource the collection of sensory data to a crowd of participating workers that carry various mobile devices. Aware of the paramount importance of effectively incentivizing participation in such systems, the research community has proposed a wide variety of incentive mechanisms. However, different from most of these existing mechanisms which assume the existence of only one data requester, we consider MCS systems with multiple data requesters, which are actually more common in practice. Specifically, our incentive mechanism is based on double auction, and is able to stimulate the participation of both data requesters and workers. In real practice, the incentive mechanism is typically not an isolated module, but interacts with the data aggregation mechanism that aggregates workers' data. For this reason, we propose CENTURION, a novel integrated framework for multi-requester MCS systems, consisting of the aforementioned incentive and data aggregation mechanism. CENTURION's incentive mechanism satisfies truthfulness, individual rationality, computational efficiency, as well as guaranteeing non-negative social welfare, and its data aggregation mechanism generates highly accurate aggregated results. The desirable properties of CENTURION are validated through both theoretical analysis and extensive simulations.", "citation": "Citations (6)", "departments": ["University of Illinois at Urbana–Champaign", "University at Buffalo", "University of Illinois at Urbana–Champaign"], "authors": ["Haiming Jin.....http://dblp.org/pers/hd/j/Jin:Haiming", "Lu Su.....http://dblp.org/pers/hd/s/Su:Lu", "Klara Nahrstedt.....http://dblp.org/pers/hd/n/Nahrstedt:Klara"], "conf": "infocom", "year": "2017", "pages": 9}