{"title": "Cimplifier: automatically debloating containers.", "fields": ["virtualization", "agile software development", "principle of least privilege", "sword", "privilege separation"], "abstract": "Application containers, such as those provided by Docker, have recently gained popularity as a solution for agile and seamless software deployment. These light-weight virtualization environments run applications that are packed together with their resources and configuration information, and thus can be deployed across various software platforms. Unfortunately, the ease with which containers can be created is oftentimes a double-edged sword, encouraging the packaging of logically distinct applications, and the inclusion of significant amount of unnecessary components, within a single container. These practices needlessly increase the container sizeâ  sometimes by orders of magnitude. They also decrease the overall security, as each included componentâ  necessary or notâ  may bring in security issues of its own, and there is no isolation between multiple applications packaged within the same container image. We propose algorithms and a tool called Cimplifier, which address these concerns: given a container and simple user-defined constraints, our tool partitions it into simpler containers, which (i) are isolated from each other, only communicating as necessary, and (ii) only include enough resources to perform their functionality. Our evaluation on real-world containers demonstrates that Cimplifier preserves the original functionality, leads to reduction in image size of up to 95%, and processes even large containers in under thirty seconds.", "citation": "Citations (2)", "departments": ["University of Wisconsin-Madison", "Colorado State University", "University of Wisconsin-Madison", "Pennsylvania State University", "Tala Security, USA"], "authors": ["Vaibhav Rastogi.....http://dblp.org/pers/hd/r/Rastogi:Vaibhav", "Drew Davidson.....http://dblp.org/pers/hd/d/Davidson:Drew", "Lorenzo De Carli.....http://dblp.org/pers/hd/c/Carli:Lorenzo_De", "Somesh Jha.....http://dblp.org/pers/hd/j/Jha:Somesh", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D="], "conf": "sigsoft", "year": "2017", "pages": 11}