{"title": "Improved Degree Bounds and Full Spectrum Power Laws in Preferential Attachment Networks.", "fields": ["graph", "power law", "preferential attachment", "exponent", "discrete mathematics"], "abstract": "Consider a random preferential attachment model  G ( p ) for network evolution that allows both node and edge arrivals. Starting with an arbitrary nonempty graph  G  0 , at each time step, there are two possible events: with probability  p  > 0 a new node arrives and a new edge is added between the new node and an existing node, and with probability 1 -  p  a new edge is added between two existing nodes. In both cases, the involved existing nodes are chosen at random according to preferential attachment, i.e., with probability proportional to their degree.  G ( p ) is known to generate  power law networks , i.e., the fraction of nodes with degree  k  is proportional to  k -β. Here β=(4-p)/(2- p ) is in the range (2,3].   Denoting the number of nodes of degree  k  at time  t  by  m   k,t  , we significantly improve some long-standing results. In particular, we show that  m   k,t   is concentrated around its mean with a deviation of  O (√ t ), which is independent of  k . We also tightly bound the expectation E m k,t   with an additive error of  O (1/ k ), which is independent of  t . These new bounds allow us to tightly estimate  m k,t   for a considerably larger  k  values than before. This, in turn, enables us to estimate other important quantities, e.g., the size of the  k -rich club, namely, the set of all nodes with a degree at least  k .   Finally, we introduce a new generalized model,  G ( p t , r t , q t  ), which extends  G ( p ) by allowing also  time-varying  probabilities for node and edge arrivals, as well as the formation of new components. We show that the extended model can produce power law networks with any exponent β in the range (1,∞). Furthermore, the concentration bounds established for  m k,t   in  G ( p ) also apply in  G ( p t , r t , q t  ).", "citation": "Not cited", "departments": ["Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Weizmann Institute of Science", "Weizmann Institute of Science"], "authors": ["Chen Avin.....http://dblp.org/pers/hd/a/Avin:Chen", "Zvi Lotker.....http://dblp.org/pers/hd/l/Lotker:Zvi", "Yinon Nahum.....http://dblp.org/pers/hd/n/Nahum:Yinon", "David Peleg.....http://dblp.org/pers/hd/p/Peleg:David"], "conf": "kdd", "year": "2017", "pages": 9}