{"title": "Tiny-Tail Flash: Near-Perfect Elimination of Garbage Collection Tail Latencies in NAND SSDs.", "fields": ["parity", "parallel computing", "latency", "flash drive", "instability", "nand gate", "garbage collection"], "abstract": "Flash storage has become the mainstream destination for storage users. However, SSDs do not always deliver the performance that users expect. The core culprit of flash performance instability is the well-known garbage collection (GC) process, which causes long delays as the SSD cannot serve (blocks) incoming I/Os, which then induces the long tail latency problem. We present  tt F lash  as a solution to this problem.  tt F lash  is a “tiny-tail” flash drive (SSD) that eliminates GC-induced tail latencies by circumventing GC-blocked I/Os with four novel strategies: plane-blocking GC, rotating GC, GC-tolerant read, and GC-tolerant flush. These four strategies leverage the timely combination of modern SSD internal technologies such as powerful controllers, parity-based redundancies, and capacitor-backed RAM. Our strategies are dependent on the use of intra-plane copyback operations. Through an extensive evaluation, we show that  tt F lash  comes significantly close to a “no-GC” scenario. Specifically, between the 99 and 99.99th percentiles,  tt F lash  is only 1.0 to 2.6× slower than the no-GC case, while a base approach suffers from 5–138× GC-induced slowdowns.", "citation": "Not cited", "departments": ["University of Chicago", "University of Chicago", "University of Chicago", "University of Chicago", "University of Chicago", "University of Chicago", "University of Chicago", "University of Chicago", "Parallel Machines", "Parallel Machines"], "authors": ["Shiqin Yan.....http://dblp.org/pers/hd/y/Yan:Shiqin", "Huaicheng Li.....http://dblp.org/pers/hd/l/Li:Huaicheng", "Mingzhe Hao.....http://dblp.org/pers/hd/h/Hao:Mingzhe", "Michael Hao Tong.....http://dblp.org/pers/hd/t/Tong:Michael_Hao", "Swaminathan Sundararaman.....http://dblp.org/pers/hd/s/Sundararaman:Swaminathan", "Andrew A. Chien.....http://dblp.org/pers/hd/c/Chien:Andrew_A=", "Haryadi S. Gunawi.....http://dblp.org/pers/hd/g/Gunawi:Haryadi_S="], "conf": "fast", "year": "2017", "pages": 14}