{"title": "Silent Data Corruption Resilient Two-sided Matrix Factorizations.", "fields": ["checksum", "eigendecomposition of a matrix", "cholesky decomposition", "scalapack", "tridiagonal matrix"], "abstract": "This paper presents an algorithm based fault tolerance method to harden three two-sided matrix factorizations against soft errors: reduction to Hessenberg form, tridiagonal form, and bidiagonal form. These two sided factorizations are usually the prerequisites to computing eigenvalues/eigenvectors and singular value decomposition. Algorithm based fault tolerance has been shown to work on three main one-sided matrix factorizations: LU, Cholesky, and QR, but extending it to cover two sided factorizations is non-trivial because there are no obvious \\textit{offline, problem} specific maintenance of checksums. We thus develop an \\textit{online, algorithm} specific checksum scheme and show how to systematically adapt the two sided factorization algorithms used in LAPACK and ScaLAPACK packages to introduce the algorithm based fault tolerance.   The resulting ABFT scheme can detect and correct arithmetic errors \\textit{continuously} during the factorizations that allow timely error handling. Detailed analysis and experiments are conducted to show the cost and the gain in resilience. We demonstrate that our scheme covers a significant portion of the operations of the factorizations. Our checksum scheme achieves high error detection coverage and error correction coverage compared to the state of the art, with low overhead and high scalability.", "citation": "Citations (3)", "year": "2017", "departments": ["University of California, Riverside", "Los Alamos National Laboratory", "Los Alamos National Laboratory", "Los Alamos National Laboratory", "University of California, Riverside"], "conf": "ppopp", "authors": ["Panruo Wu.....http://dblp.org/pers/hd/w/Wu:Panruo", "Nathan DeBardeleben.....http://dblp.org/pers/hd/d/DeBardeleben:Nathan", "Qiang Guan.....http://dblp.org/pers/hd/g/Guan:Qiang", "Sean Blanchard.....http://dblp.org/pers/hd/b/Blanchard:Sean", "Jieyang Chen.....http://dblp.org/pers/hd/c/Chen:Jieyang", "Dingwen Tao.....http://dblp.org/pers/hd/t/Tao:Dingwen", "Xin Liang.....http://dblp.org/pers/hd/l/Liang:Xin", "Kaiming Ouyang.....http://dblp.org/pers/hd/o/Ouyang:Kaiming", "Zizhong Chen.....http://dblp.org/pers/hd/c/Chen:Zizhong"], "pages": 13}