{"title": "One step at a time: Optimizing SDN upgrades in ISP networks.", "fields": ["traffic engineering", "upgrade", "control reconfiguration", "software defined networking", "submodular set function"], "abstract": "Nowadays, there is a fast-paced shift from legacy telecommunication systems to novel Software Defined Network (SDN) architectures that can support on-the-fly network reconfiguration, therefore, empowering advanced traffic engineering mechanisms. Despite this momentum, migration to SDN cannot be realized at once especially in high-end cost networks of Internet Service Providers (ISPs). It is expected that ISPs will gradually upgrade their networks to SDN over a period that spans several years. In this paper, we study the SDN upgrading problem in an ISP network: which nodes to upgrade and when. We consider a general model that captures different migration costs and network topologies, and two plausible ISP objectives; first, the maximization of the traffic that traverses at least one SDN node, and second, the maximization of the number of dynamically selectable routing paths enabled by SDN nodes. We leverage the theory of submodular and supermodular functions to devise algorithms with provable approximation ratios for each objective. Using real-world network topologies and traffic matrices, we evaluate the performance of our algorithms and show up to 54% gains over state-of-the-art methods. Moreover, we describe the interplay between the two objectives; maximizing one may cause a factor of 2 loss to the other.", "citation": "Citations (2)", "departments": ["Yale University", "Yale University", "Technical University of Berlin", "Yale University"], "authors": ["Konstantinos Poularakis.....http://dblp.org/pers/hd/p/Poularakis:Konstantinos", "George Iosifidis.....http://dblp.org/pers/hd/i/Iosifidis:George", "Georgios Smaragdakis.....http://dblp.org/pers/hd/s/Smaragdakis:Georgios", "Leandros Tassiulas.....http://dblp.org/pers/hd/t/Tassiulas:Leandros"], "conf": "infocom", "year": "2017", "pages": 9}