{"title": "In-Memory Distributed Matrix Computation Processing and Optimization.", "fields": ["numerical linear algebra", "distributed database", "ranging", "sparse matrix", "query plan"], "abstract": "The use of large-scale machine learning and data mining methods is becoming ubiquitous in many application domains ranging from business intelligence and bioinformatics to self-driving cars. These methods heavily rely on matrix computations, and it is hence critical to make these computations scalable and efficient. These matrix computations are often complex and involve multiple steps that need to be optimized and sequenced properly for efficient execution. This paper presents new efficient and scalable matrix processing and optimization techniques for in-memory distributed clusters. The proposed techniques estimate the sparsity of intermediate matrix-computation results and optimize communication costs. An evaluation plan generator for complex matrix computations is introduced as well as a distributed plan optimizer that exploits dynamic cost-based analysis and rule-based heuristics to optimize the cost of matrix computations in an in-memory distributed environment. The result of a matrix operation will often serve as an input to another matrix operation, thus defining the matrix data dependencies within a matrix program. The matrix query plan generator produces query execution plans that minimize memory usage and communication overhead by partitioning the matrix based on the data dependencies in the execution plan. We implemented the proposed matrix processing and optimization techniques in Spark, a distributed in-memory computing platform. Experiments on both real and synthetic data demonstrate that our proposed techniques achieve up to an order-of-magnitude performance improvement over state-of the-art distributed matrix computation systems on a wide range of applications.", "citation": "Not cited", "departments": ["Purdue University", "Purdue University", "Purdue University", "Qatar University", "Qatar Computing Research Institute"], "authors": ["Yongyang Yu.....http://dblp.org/pers/hd/y/Yu:Yongyang", "MingJie Tang.....http://dblp.org/pers/hd/t/Tang:MingJie", "Walid G. Aref.....http://dblp.org/pers/hd/a/Aref:Walid_G=", "Qutaibah M. Malluhi.....http://dblp.org/pers/hd/m/Malluhi:Qutaibah_M=", "Mostafa M. Abbas.....http://dblp.org/pers/hd/a/Abbas:Mostafa_M=", "Mourad Ouzzani.....http://dblp.org/pers/hd/o/Ouzzani:Mourad"], "conf": "icde", "year": "2017", "pages": 12}