{"title": "DyMo: Dynamic monitoring of large scale LTE-Multicast systems.", "fields": ["quality of service", "software deployment", "multimedia broadcast multicast service", "multicast", "user equipment"], "abstract": "LTE evolved Multimedia Broadcast/Multicast Service (eMBMS) is an attractive solution for video delivery to very large groups in crowded venues. However, deployment and management of eMBMS systems is challenging, due to the lack of realtime feedback from the User Equipment (UEs). Therefore, we present the Dynamic Monitoring (DyMo) system for low-overhead feedback collection. DyMo leverages eMBMS for broadcasting Stochastic Group Instructions to all UEs. These instructions indicate the reporting rates as a function of the observed Quality of Service (QoS). This simple feedback mechanism collects very limited QoS reports from the UEs. The reports are used for network optimization, thereby ensuring high QoS to the UEs. We present the design aspects of DyMo and evaluate its performance analytically and via extensive simulations. Specifically, we show that DyMo infers the optimal eMBMS settings with extremely low overhead, while meeting strict QoS requirements under different UE mobility patterns and presence of network component failures. For instance, DyMo can detect the eMBMS Signal-to-Noise Ratio (SNR) experienced by the 0.1% percentile of the UEs with Root Mean Square Error (RMSE) of 0.05% with only 5 to 10 reports per second regardless of the number of UEs.", "citation": "Not cited", "departments": ["Bell Labs", "Nokia", "Bell Labs", "Columbia University", "Columbia University"], "authors": ["Yigal Bejerano.....http://dblp.org/pers/hd/b/Bejerano:Yigal", "Chandru Raman.....http://dblp.org/pers/hd/r/Raman:Chandru", "Chun-Nam Yu.....http://dblp.org/pers/hd/y/Yu:Chun=Nam", "Varun Gupta.....http://dblp.org/pers/hd/g/Gupta_0002:Varun", "Craig Gutterman.....http://dblp.org/pers/hd/g/Gutterman:Craig", "Tomas Young.....http://dblp.org/pers/hd/y/Young:Tomas", "Hugo Infante.....http://dblp.org/pers/hd/i/Infante:Hugo", "Yousef Abdelmalek.....http://dblp.org/pers/hd/a/Abdelmalek:Yousef", "Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil"], "conf": "infocom", "year": "2017", "pages": 9}