{"title": "Optimal Set of 360-Degree Videos for Viewport-Adaptive Streaming.", "fields": ["implementation", "video quality", "video processing", "viewport", "offset"], "abstract": "With the decreasing price of Head-Mounted Displays (HMDs), 360-degree videos are becoming popular. The streaming of such videos through the Internet with state of the art streaming architectures requires, to provide high immersion feeling, much more bandwidth than the median user's access bandwidth. To decrease the need for bandwidth consumption while providing high immersion to users, scientists and specialists proposed to prepare and encode 360-degree videos into quality-variable video versions and to implement viewport-adaptive streaming. Quality-variable versions are different versions of the same video with non-uniformly spread quality: there exists some so-called Quality Emphasized Regions (QERs). With viewport-adaptive streaming the client, based on head movement prediction, downloads the video version with the high quality region closer to where the user will watch. In this paper we propose a generic theoretical model to find out the optimal set of quality-variable video versions based on traces of head positions of users watching a 360-degree video. We propose extensions to adapt the model to popular quality-variable version implementations such as tiling and offset projection. We then solve a simplified version of the model with two quality levels and restricted shapes for the QER. With this simplified model, we show that an optimal set of four quality-variable video versions prepared by a streaming server, together with a perfect head movement prediction, allow for 45% bandwidth savings to display video with the same average quality as state of the art solutions or allows an increase of 102% of the displayed quality for the same bandwidth budget.", "citation": "Citations (5)", "departments": ["Huawei", "University of Alabama", "IMT Atlantique  ...  Rennes, France", "IMT Atlantique  ...  Rennes, France"], "authors": ["Xavier Corbillon.....http://dblp.org/pers/hd/c/Corbillon:Xavier", "Alisa Devlic.....http://dblp.org/pers/hd/d/Devlic:Alisa", "Gwendal Simon.....http://dblp.org/pers/hd/s/Simon:Gwendal", "Jacob Chakareski.....http://dblp.org/pers/hd/c/Chakareski:Jacob"], "conf": "mm", "year": "2017", "pages": 9}