{"title": "Generic online animal activity recognition on collar tags.", "fields": ["training set", "activity recognition", "collar", "artificial neural network", "multi task learning"], "abstract": "Animal behaviour is a commonly-used and sensitive indicator of animal welfare. Moreover, the behaviour of animals can provide rich information about their environment. For online activity recognition on collar tags of animals, fundamental challenges include: limited energy resources, limited CPU and memory availability, and heterogeneity of animals. In this paper, we propose to tackle these challenges with a framework that employs Multitask Learning for embedded platforms. We train the classifiers with shared training data and a shared feature-representation. We show that Multitask Learning has a significant positive effect on the performance of the classifiers. Furthermore, we compare 7 types of classifiers in terms of resource usage and activity recognition performance on real-world movement data from goats and sheep. A Deep Neural Network could obtain an accuracy of 94% when tested with the data from both species. Our results show that a Deep Neural Network performs the best among the compared classifiers in terms of complexity versus performance. This work supports the development of a robust generic classifier that can run on a small embedded system with good performance, as well as sustain the lifetime of online activity recognition systems.", "citation": "Not cited", "departments": ["University of Twente", "University of Twente", "University of Twente", "University of Twente", "University of Twente"], "authors": ["Jacob W. Kamminga.....http://dblp.org/pers/hd/k/Kamminga:Jacob_W=", "Helena C. Bisby.....http://dblp.org/pers/hd/b/Bisby:Helena_C=", "Duc V. Le.....http://dblp.org/pers/hd/l/Le:Duc_V=", "Nirvana Meratnia.....http://dblp.org/pers/hd/m/Meratnia:Nirvana", "Paul J. M. Havinga.....http://dblp.org/pers/hd/h/Havinga:Paul_J=_M="], "conf": "huc", "year": "2017", "pages": 10}