{"title": "Exploring Query Auto-Completion and Click Logs for Contextual-Aware Web Search and Query Suggestion.", "fields": ["ranking", "statistical model", "contextual design", "latent dirichlet allocation", "search engine"], "abstract": "Contextual data plays an important role in modeling search engine users' behaviors on both query auto-completion (QAC) log and normal query (click) log. User's recent search history on each log has been widely studied individually as the context to benefit the modeling of users' behaviors on that log. However, there is no existing work that explores or incorporates both logs together for contextual data. As QAC and click logs actually record users' sequential behaviors while interacting with a search engine, the available context of a user's current behavior based on the same type of log can be strengthened from the user's recent search history shown on the other type of log. Our paper proposes to model users' behaviors on both QAC and click logs simultaneously by utilizing both logs as the contextual data of each other. The key idea is to capture the correlation between users' behavior patterns on both logs. We model such correlation through a novel probabilistic model based on the Latent Dirichlet allocation (LDA) model. The learned users' behavior patterns on both logs are utilized to address not only the application of query auto-completion on QAC logs, but also the click prediction and relevance ranking of web documents on click logs. Experiments on real-world logs demonstrate the effectiveness of the proposed model on both applications.", "citation": "Citations (3)", "departments": ["Yahoo!", "East China Normal University", "East China Normal University", "East China Normal University", "East China Normal University"], "authors": ["Liangda Li.....http://dblp.org/pers/hd/l/Li:Liangda", "Hongbo Deng.....http://dblp.org/pers/hd/d/Deng:Hongbo", "Anlei Dong.....http://dblp.org/pers/hd/d/Dong:Anlei", "Yi Chang.....http://dblp.org/pers/hd/c/Chang:Yi", "Ricardo A. Baeza-Yates.....http://dblp.org/pers/hd/b/Baeza=Yates:Ricardo_A=", "Hongyuan Zha.....http://dblp.org/pers/hd/z/Zha:Hongyuan"], "conf": "www", "year": "2017", "pages": 10}