{"title": "The Feasibility of Dynamically Granted Permissions: Aligning Mobile Privacy with User Preferences.", "fields": ["humanoid robot", "word error rate", "data access", "information privacy", "privacy software"], "abstract": "Current smartphone operating systems regulate application permissions by prompting users on an ask-on-first-use basis. Prior research has shown that this method is ineffective because it fails to account for context: the circumstances under which an application first requests access to data may be vastly different than the circumstances under which it subsequently requests access. We performed a longitudinal 131-person field study to analyze the contextuality behind user privacy decisions to regulate access to sensitive resources. We built a classifier to make privacy decisions on the user's behalf by detecting when context has changed and, when necessary, inferring privacy preferences based on the user's past decisions and behavior. Our goal is to automatically grant appropriate resource requests without further user intervention, deny inappropriate requests, and only prompt the user when the system is uncertain of the user's preferences. We show that our approach can accurately predict users' privacy decisions 96.8% of the time, which is a four-fold reduction in error rate compared to current systems.", "citation": "Citations (7)", "departments": ["University of British Columbia", "University of California, Berkeley", "University of California, Berkeley", "University of Calgary", "International Computer Science Institute"], "authors": ["Primal Wijesekera.....http://dblp.org/pers/hd/w/Wijesekera:Primal", "Arjun Baokar.....http://dblp.org/pers/hd/b/Baokar:Arjun", "Lynn Tsai.....http://dblp.org/pers/hd/t/Tsai:Lynn", "Joel Reardon.....http://dblp.org/pers/hd/r/Reardon:Joel", "Serge Egelman.....http://dblp.org/pers/hd/e/Egelman:Serge", "David A. Wagner.....http://dblp.org/pers/hd/w/Wagner_0001:David_A=", "Konstantin Beznosov.....http://dblp.org/pers/hd/b/Beznosov:Konstantin"], "conf": "sp", "year": "2017", "pages": 17}