{"title": "Joint offloading and resource allocation for computation and communication in mobile cloud with computing access point.", "fields": ["access network", "default gateway", "cloud computing", "mobile cloud computing", "server"], "abstract": "We consider a general multi-user mobile cloud computing system with a computing access point (CAP), where each mobile user has multiple independent tasks that may be processed locally, at the CAP, or at a remote cloud server. The CAP serves both as the network access gateway and a computation service provider to the mobile users. We aim to jointly optimize the offloading decisions of all users' tasks as well as the allocation of computation and communication resources, to minimize the overall cost of energy, computation, and delay for all users. This problem is NP-hard in general. We propose an efficient three-step algorithm comprising of semidefinite relaxation (SDR), alternating optimization (AO), and sequential tuning (ST). It is shown to always compute a locally optimal solution, and give nearly optimal performance under a wide range of parameter settings. Through evaluating the performance of different combinations of the three components of this SDR-AO-ST algorithm, we provide insights into their roles and contributions in the overall solution. We further compare the performance of SDR-AO-ST against a lower bound to the minimum cost, purely local processing, purely cloud processing, and hybrid local-cloud processing without using the CAP. Our numerical results demonstrate the effectiveness of the proposed algorithm in the joint management of computation and communication resources in mobile cloud computing systems with a CAP.", "citation": "Citations (5)", "departments": ["University of Toronto", "University of Toronto", "University of Ontario Institute of Technology"], "authors": ["Meng-Hsi Chen.....http://dblp.org/pers/hd/c/Chen:Meng=Hsi", "Ben Liang.....http://dblp.org/pers/hd/l/Liang:Ben", "Min Dong.....http://dblp.org/pers/hd/d/Dong:Min"], "conf": "infocom", "year": "2017", "pages": 9}