{"title": "Probabilistic model checking of perturbed MDPs with applications to cloud computing.", "fields": ["probabilistic logic", "nondeterministic algorithm", "software system", "markov decision process", "formal verification"], "abstract": "Probabilistic model checking is a formal verification technique that has been applied successfully in a variety of domains, providing identification of system errors through quantitative verification of stochastic system models. One domain that can benefit from probabilistic model checking is cloud computing, which must provide highly reliable and secure computational and storage services to large numbers of mission-critical software systems.   For real-world domains like cloud computing, external system factors and environmental changes must be estimated accurately in the form of probabilities in system models; inaccurate estimates for the model probabilities can lead to invalid verification results. To address the effects of uncertainty in probability estimates, in previous work we have developed a variety of techniques for  perturbation analysis  of discrete- and continuous-time Markov chains (DTMCs and CTMCs). These techniques determine the consequences of the uncertainty on verification of system properties. In this paper, we present the first approach for perturbation analysis of Markov decision processes (MDPs), a stochastic formalism that is especially popular due to the significant expressive power it provides through the combination of both probabilistic and nondeterministic choice.   Our primary contribution is a novel technique for efficiently analyzing the effects of perturbations of model probabilities on verification of reachability properties of MDPs. The technique heuristically explores the space of  adversaries  of an MDP, which encode the different ways of resolving the MDPâ  s nondeterministic choices. We demonstrate the practical effectiveness of our approach by applying it to two case studies of cloud systems.", "citation": "Citations (1)", "departments": ["National University of Singapore", "University of Wollongong", "National University of Singapore"], "authors": ["Yamilet R. Serrano Llerena.....http://dblp.org/pers/hd/l/Llerena:Yamilet_R=_Serrano", "Guoxin Su.....http://dblp.org/pers/hd/s/Su:Guoxin", "David S. Rosenblum.....http://dblp.org/pers/hd/r/Rosenblum:David_S="], "conf": "sigsoft", "year": "2017", "pages": 11}