{"title": "Efficient Binary Coding for Subspace-based Query-by-Image Video Retrieval.", "fields": ["binary code", "subspace topology", "bilinear interpolation", "projection", "metric"], "abstract": "Subspace representations have been widely applied for videos in many tasks. In particular, the subspace-based query-by-image video retrieval (QBIVR), facing high challenges on similarity-preserving measurements and efficient retrieval schemes, urgently needs considerable research attention. In this paper, we propose a novel subspace-based QBIVR framework to enable efficient video search. We first define a new geometry-preserving distance metric to measure the image-to-video distance, which transforms the QBIVR task to be the Maximum Inner Product Search (MIPS) problem. The merit of this distance metric lies in that it helps to preserve the genuine geometric relationship between query images and database videos to the greatest extent. To boost the efficiency of solving the MIPS problem, we introduce two asymmetric hashing schemes which can bridge the domain gap of images and videos properly. The first approach, termed Inner-product Binary Coding (IBC), achieves high-quality binary codes by learning the binary codes and coding functions simultaneously without continuous relaxations. The other one, Bilinear Binary Coding (BBC) approach, employs compact bilinear projections instead of a single large projection matrix to further improve the retrieval efficiency. Extensive experiments on four real-world video datasets verify the effectiveness of our proposed approaches, as compared to the state-of-the-art methods.", "citation": "Not cited", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China"], "authors": ["Ruicong Xu.....http://dblp.org/pers/hd/x/Xu:Ruicong", "Yang Yang.....http://dblp.org/pers/hd/y/Yang:Yang", "Fumin Shen.....http://dblp.org/pers/hd/s/Shen:Fumin", "Ning Xie.....http://dblp.org/pers/hd/x/Xie_0003:Ning", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao"], "conf": "mm", "year": "2017", "pages": 9}