{"title": "A Longitudinal, End-to-End View of the DNSSEC Ecosystem.", "fields": ["name server", "public key infrastructure", "end to end principle", "domain name system", "publication"], "abstract": "The Domain Name System’s Security Extensions (DNSSEC) allow clients and resolvers to verify that DNS responses have not been forged or modified in-flight. DNSSEC uses a public key infrastructure (PKI) to achieve this integrity, without which users can be subject to a wide range of attacks. However, DNSSEC can operate only if each of the principals in its PKI properly performs its management tasks: authoritative name servers must generate and publish their keys and signatures correctly, child zones that support DNSSEC must be correctly signed with their parent’s keys, and resolvers must actually validate the chain of signatures. This paper performs the first large-scale, longitudinal measurement study into how well DNSSEC’s PKI is managed. We use data from all DNSSEC-enabled subdomains under the .com, .org, and .net TLDs over a period of 21 months to analyze DNSSEC deployment and management by domains; we supplement this with active measurements of more than 59K DNS resolvers worldwide to evaluate resolver-side validation. Our investigation reveals pervasive mismanagement of the DNSSEC infrastructure. For example, we found that 31% of domains that support DNSSEC fail to publish all relevant records required for validation; 39% of the domains use insufficiently strong key-signing keys; and although 82% of resolvers in our study request DNSSEC records, only 12% of them actually attempt to validate them. These results highlight systemic problems, which motivate improved automation and auditing of DNSSEC management.", "citation": "Citations (4)", "year": "2017", "departments": ["Northeastern University", "Technical University of Berlin", "Northeastern University", "University of Maryland, College Park", "Design and Anal ... ication Systems"], "conf": "uss", "authors": ["Taejoong Chung.....http://dblp.org/pers/hd/c/Chung:Taejoong", "Roland van Rijswijk-Deij.....http://dblp.org/pers/hd/r/Rijswijk=Deij:Roland_van", "Balakrishnan Chandrasekaran.....http://dblp.org/pers/hd/c/Chandrasekaran_0002:Balakrishnan", "David R. Choffnes.....http://dblp.org/pers/hd/c/Choffnes:David_R=", "Dave Levin.....http://dblp.org/pers/hd/l/Levin:Dave", "Bruce M. Maggs.....http://dblp.org/pers/hd/m/Maggs:Bruce_M=", "Alan Mislove.....http://dblp.org/pers/hd/m/Mislove:Alan", "Christo Wilson.....http://dblp.org/pers/hd/w/Wilson:Christo"], "pages": 16}