{"title": "Recommending and localizing change requests for mobile apps based on user reviews.", "fields": ["heuristics", "user interface design", "user modeling", "computer user satisfaction", "source code"], "abstract": "Researchers have proposed several approaches to extract information from user reviews useful for maintaining and evolving mobile apps. However, most of them just perform automatic classification of user reviews according to specific keywords (e.g., bugs, features). Moreover, they do not provide any support for linking user feedback to the source code components to be changed, thus requiring a manual, time-consuming, and error-prone task. In this paper, we introduce C hange A dvisor , a novel approach that analyzes the structure, semantics, and sentiments of sentences contained in user reviews to extract useful (user) feedback from maintenance perspectives and recommend to developers changes to software artifacts. It relies on natural language processing and clustering algorithms to group user reviews around similar user needs and suggestions for change. Then, it involves textual based heuristics to determine the code artifacts that need to be maintained according to the recommended software changes. The quantitative and qualitative studies carried out on 44 683 user reviews of 10 open source mobile apps and their original developers showed a high accuracy of C hange A dvisor  in (i) clustering similar user change requests and (ii) identifying the code components impacted by the suggested changes. Moreover, the obtained results show that C hange A dvisor  is more accurate than a baseline approach for linking user feedback clusters to the source code in terms of both precision (+47%) and recall (+38%).", "citation": "Citations (13)", "departments": ["Delft University of Technology", "University of Salerno", "University of Zurich", "University of Zurich", "University of Zurich"], "authors": ["Fabio Palomba.....http://dblp.org/pers/hd/p/Palomba:Fabio", "Pasquale Salza.....http://dblp.org/pers/hd/s/Salza:Pasquale", "Adelina Ciurumelea.....http://dblp.org/pers/hd/c/Ciurumelea:Adelina", "Sebastiano Panichella.....http://dblp.org/pers/hd/p/Panichella:Sebastiano", "Harald C. Gall.....http://dblp.org/pers/hd/g/Gall:Harald_C=", "Filomena Ferrucci.....http://dblp.org/pers/hd/f/Ferrucci:Filomena", "Andrea De Lucia.....http://dblp.org/pers/hd/l/Lucia:Andrea_De"], "conf": "icse", "year": "2017", "pages": 12}