{"title": "Pl@ntNet - My Business.", "fields": ["business object", "training set", "citizen journalism", "added value", "business idea"], "abstract": "Pl@ntNet is a world-scale participatory platform and information system dedicated to the monitoring of plant biodiversity through image-based plant identification. Nowadays, the mobile front-end of Pl@ntNet has been downloaded by more than 4 millions users in about 170 countries and an active community of contributors produce and revise new observations everyday (it is often referred to as the \"shazam of plants\"). This paper presents a business proposal allowing enterprises or organizations to set up their own private collaborative workflow within Pl@ntNet information system. The main added value is to allow them working on their own business object ( e.g.  plant disease diagnostic, deficiency measurements, railway lines maintenance, fishery surveillance, etc.) and with their own community of contributors and end-users (employees, sales representatives, clients, observers network, etc.). This business idea answers to a growing demand in agriculture and environmental economics. Actors in these domains begin to know that machine learning techniques are mature enough but the lack of training data and of efficient tools to collect them is a major breakthrough. A collaborative platform like Pl@ntNet is the ideal tool to bridge this gap. It initiates a powerful positive feedback loop boosting the production of training data while improving the work of the employees.", "citation": "Not cited", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Cirad, Montpellier, France", "Cirad, Montpellier, France"], "authors": ["Alexis Joly.....http://dblp.org/pers/hd/j/Joly:Alexis", "Pierre Bonnet.....http://dblp.org/pers/hd/b/Bonnet:Pierre", "Antoine Affouard.....http://dblp.org/pers/hd/a/Affouard:Antoine", "Jean-Christophe Lombardo.....http://dblp.org/pers/hd/l/Lombardo:Jean=Christophe", "Hervé Goëau.....http://dblp.org/pers/hd/g/Go=euml=au:Herv=eacute="], "conf": "mm", "year": "2017", "pages": 5}