{"title": "Characterizing Organ Donation Awareness from Social Media.", "fields": ["public relations", "social media", "donation", "mass media", "data mining"], "abstract": "Approximately 22 people die every day in the USA due to a lack of organs for transplant. Research suggests that the most effective solution is to increase organ donor rates, current, proposals range from expanding the donor eligibility criteria (donor pool) to performing mass media campaigns. However, little is known about the extent in which activities on social media are associated with aspects (e.g. awareness) of organ donation. Our hypothesis is that social media can be utilized as a sensor to characterize organ donation awareness and population engagement in donation for each different organ. In this sense, we collected Twitter messages (tweets) regarding organ donation, and characterized organ awareness by aggregating tweets from users who mostly mentioned that organ. Similarly, we assessed the relative risk between the cumulative incidence of organrelated conversations inside and outside geographical regions to characterize them regarding organ donation awareness. Our characterization suggests that organ-related conversations on social media seems to be indeed associated with aspects of organ donation such as the co-occurrence of organ transplantations. Also, we found variations regarding the specific organs that are prominently discussed in each geographical region, and that such variations seem to be associated with aspects of organ donation in that region, for instance, the abnormal amount of conversations about kidneys in Kansas. Our findings suggest that the proposed approach has the potential to characterize the awareness of organ donation in real-time.", "citation": "Not cited", "departments": ["Florida Institute of Technology", "Florida Institute of Technology", "University of California, Los Angeles", "Florida Institute of Technology"], "authors": ["Diogo Ferreira Pacheco.....http://dblp.org/pers/hd/p/Pacheco:Diogo_Ferreira", "Diego Pinheiro.....http://dblp.org/pers/hd/p/Pinheiro:Diego", "Martin Cadeiras.....http://dblp.org/pers/hd/c/Cadeiras:Martin", "Ronaldo Menezes.....http://dblp.org/pers/hd/m/Menezes:Ronaldo"], "conf": "icde", "year": "2017", "pages": 8}