{"title": "ExtremeWeather: A large-scale climate dataset for semi-supervised detection, localization, and understanding of extreme weather events.", "fields": ["climate pattern", "extreme weather", "weather front", "convolutional neural network", "effects of global warming"], "abstract": "Then detection and identification of extreme weather events in large-scale climate simulations is an important problem for risk management, informing governmental policy decisions and advancing our basic understanding of the climate system. Recent work has shown that fully supervised convolutional neural networks (CNNs) can yield acceptable accuracy for classifying well-known types of extreme weather events when large amounts of labeled data are available. However, many different types of spatially localized climate patterns are of interest including hurricanes, extra-tropical cyclones, weather fronts, and blocking events among others. Existing labeled data for these patterns can be incomplete in various ways, such as covering only certain years or geographic areas and having false negatives. This type of climate data therefore poses a number of interesting machine learning challenges. We present a multichannel spatiotemporal CNN architecture for semi-supervised bounding box prediction and exploratory data analysis. We demonstrate that our approach is able to leverage temporal information and unlabeled data to improve the localization of extreme weather events. Further, we explore the representations learned by our model in order to better understand this important data. We present a dataset, ExtremeWeather, to encourage machine learning research in this area and to help facilitate further work in understanding and mitigating the effects of climate change. The dataset is available at extremeweatherdataset.github.io and the code is available at https://github.com/eracah/hur-detect.", "citation": "Citations (6)", "year": "2017", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "MILA, Polytechnic Montreal", "Montreal Instit ... ning Algorithms", "Montréal Instit ... ning Algorithms"], "conf": "nips", "authors": ["Evan Racah.....http://dblp.org/pers/hd/r/Racah:Evan", "Christopher Beckham.....http://dblp.org/pers/hd/b/Beckham:Christopher", "Tegan Maharaj.....http://dblp.org/pers/hd/m/Maharaj:Tegan", "Samira Ebrahimi Kahou.....http://dblp.org/pers/hd/k/Kahou:Samira_Ebrahimi", "Prabhat.....http://dblp.org/pers/hd/p/Prabhat:", "Chris Pal.....http://dblp.org/pers/hd/p/Pal:Chris"], "pages": 12}