{"title": "Tuning Crowdsourced Human Computation.", "fields": ["homogeneous", "crowdsourcing", "clock rate", "latency", "remuneration"], "abstract": "As crowdsourcing has been dramatically investigated and utilized to address problems in the real world, it is essential and important to think about performance optimization. Analogous to computer systems with CPUs, treating each worker as a HPU (Human Processing Unit [1]) and studying the performance optimization on top of HPUs are interesting perspectives to resolve crowdsourcing issues. However, as we characterize HPUs in detail for this purpose, we find that there are significant differences between CPUs and HPUs, leading to the need of completely new optimization algorithms. In this paper, we study the specific optimization problem of obtaining results the fastest for a crowdsourced job with a fixed total budget. In crowdsourcing, jobs are usually broken down into sets of small tasks, which are assigned to workers one at a time. We consider three scenarios of increasing complexity: Identical Round Homogeneous Tasks, Multiplex Round Homogeneous Tasks, and Multiple Round Heterogeneous Tasks. For each scenario, we analyze the stochastic behavior of the HPU clock rate as a function of the remuneration offered. After that, we develop an optimum Budget Allocation Strategy to minimize the latency of the job completion. We validate our results through extensive simulations and experiments on Amazon Mechanical Turk.", "citation": "Citations (2)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Electrical Engi ... and Engineering"], "authors": ["Caleb Chen Cao.....http://dblp.org/pers/hd/c/Cao:Caleb_Chen", "Jiayang Tu.....http://dblp.org/pers/hd/t/Tu:Jiayang", "Zheng Liu.....http://dblp.org/pers/hd/l/Liu_0001:Zheng", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "H. V. Jagadish.....http://dblp.org/pers/hd/j/Jagadish:H=_V="], "conf": "icde", "year": "2017", "pages": 12}