{"title": "Utility Cost of Formal Privacy for Releasing National Employer-Employee Statistics.", "fields": ["limiting", "differential privacy", "statutory law", "privacy by design", "privacy software"], "abstract": "National statistical agencies around the world publish tabular summaries based on combined employer-employee (ER-EE) data. The privacy of both individuals and business establishments that feature in these data are protected by law in most countries. These data are currently released using a variety of statistical disclosure limitation (SDL) techniques that do not reveal the exact characteristics of particular employers and employees, but lack provable privacy guarantees limiting inferential disclosures.   In this work, we present novel algorithms for releasing tabular summaries of linked ER-EE data with formal, provable guarantees of privacy. We show that state-of-the-art differentially private algorithms add too much noise for the output to be useful. Instead, we identify the privacy requirements mandated by current interpretations of the relevant laws, and formalize them using the Pufferfish framework. We then develop new privacy definitions that are customized to ER-EE data and satisfy the statutory privacy requirements. We implement the experiments in this paper on production data gathered by the U.S. Census Bureau. An empirical evaluation of utility for these data shows that for reasonable values of the privacy-loss parameter e≥ 1, the additive error introduced by our provably private algorithms is comparable, and in some cases better, than the error introduced by existing SDL techniques that have no provable privacy guarantees. For some complex queries currently published, however, our algorithms do not have utility comparable to the existing traditional SDL algorithms. Those queries are fodder for future research.", "citation": "Citations (3)", "year": "2017", "departments": ["Duke University", "Duke University", "United States Census Bureau", "United States Census Bureau", "United States Census Bureau"], "conf": "sigmod", "authors": ["Samuel Haney.....http://dblp.org/pers/hd/h/Haney:Samuel", "Ashwin Machanavajjhala.....http://dblp.org/pers/hd/m/Machanavajjhala:Ashwin", "John M. Abowd.....http://dblp.org/pers/hd/a/Abowd:John_M=", "Matthew Graham.....http://dblp.org/pers/hd/g/Graham:Matthew", "Mark Kutzbach.....http://dblp.org/pers/hd/k/Kutzbach:Mark", "Lars Vilhuber.....http://dblp.org/pers/hd/v/Vilhuber:Lars"], "pages": 16}