{"title": "What your Facebook Profile Picture Reveals about your Personality.", "fields": ["portrait", "neuroticism", "extraversion and introversion", "mirroring", "big five personality traits"], "abstract": "People spend considerable effort managing the impressions they give others. Social psychologists have shown that people manage these impressions differently depending upon their personality. Facebook and other social media provide a new forum for this fundamental process; hence, understanding people's behaviour on social media could provide interesting insights on their personality. In this paper we investigate automatic personality recognition from Facebook profile pictures. We analyze the effectiveness of four families of visual features and we discuss some human interpretable patterns that explain the personality traits of the individuals. For example, extroverts and agreeable individuals tend to have warm colored pictures and to exhibit many faces in their portraits, mirroring their inclination to socialize; while neurotic ones have a prevalence of pictures of indoor places. Then, we propose a classification approach to automatically recognize personality traits from these visual features. Finally, we compare the performance of our classification approach to the one obtained by human raters and we show that computer-based classifications are significantly more accurate than averaged human-based classifications for Extraversion and Neuroticism.", "citation": "Citations (3)", "departments": ["California Institute of Technology", "University of Trento", "University of Trento", "Stanford University", "University of Cambridge"], "authors": ["Cristina Segalin.....http://dblp.org/pers/hd/s/Segalin:Cristina", "Fabio Celli.....http://dblp.org/pers/hd/c/Celli:Fabio", "Luca Polonio.....http://dblp.org/pers/hd/p/Polonio:Luca", "Michal Kosinski.....http://dblp.org/pers/hd/k/Kosinski:Michal", "David Stillwell.....http://dblp.org/pers/hd/s/Stillwell:David", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu", "Marco Cristani.....http://dblp.org/pers/hd/c/Cristani:Marco", "Bruno Lepri.....http://dblp.org/pers/hd/l/Lepri:Bruno"], "conf": "mm", "year": "2017", "pages": 9}