{"title": "Runtime Monitoring with Recovery of the SENT Communication Protocol.", "fields": ["regular expression", "runtime verification", "systemc", "electronic control unit", "debugging"], "abstract": "We show how the requirements of the SENT communication protocol between a magnetic sensor and an electronic control unit (ECU) can be monitored in real time, with a monitor capable of processing 70 million samples per second. We elaborate on a complete flow from formalizing electrical and timing requirements using Signal Temporal Logic (STL) and Timed Regular Expressions (TRE), to implementing runtime monitors in FPGA hardware and evaluating the results in the lab. For a class of asynchronous serial protocols, we define a procedure to obtain monitors that are capable to recover after violations. We elaborate on two different approaches to monitor the requirements of interest: (i) temporal testers with SystemC, STL and High-Level Synthesis; (ii) automata-based approach with TRE in HDL. We also present how the results of the monitoring can be used for error logging to provide users with extensive debugging information. Our approach allows to monitor requirements-specification conformance in real time for long-term tests.", "citation": "Citations (4)", "year": "2017", "departments": ["Vienna University of Technology", "Austrian Institute of Technology", "Vienna University of Technology", "Infineon Technologies", "Infineon Technologies", "Infineon Technologies"], "conf": "cav", "authors": ["Konstantin Selyunin.....http://dblp.org/pers/hd/s/Selyunin:Konstantin", "Stefan Jaksic.....http://dblp.org/pers/hd/j/Jaksic:Stefan", "Thang Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Thang", "Christian Reidl.....http://dblp.org/pers/hd/r/Reidl:Christian", "Udo Hafner.....http://dblp.org/pers/hd/h/Hafner:Udo", "Ezio Bartocci.....http://dblp.org/pers/hd/b/Bartocci:Ezio", "Dejan Nickovic.....http://dblp.org/pers/hd/n/Nickovic:Dejan", "Radu Grosu.....http://dblp.org/pers/hd/g/Grosu:Radu"], "pages": 20}