{"title": "Pilot-based full-duplex spectrum-sensing and multichannel-MAC over non-time-slotted cognitive radio networks.", "fields": ["duplex", "cognitive radio", "synchronization", "throughput", "channel"], "abstract": "In the non-time-slotted cognitive radio networks (CRNs), the synchronization between PUs and secondary users (SUs) cannot be guaranteed, resulting in two challenging problems: the reactivation-failure of PUs and the frequently unexpected hand-offs among SUs. The reactivation-failure of PUs is the incident that the SUs cannot detect the PUs' reactivation when the SUs are occupying the channels to transmit their data in non-time-slotted CRNs. The frequently unexpected handoffs among SUs are the events that the SU cannot distinguish between the PUs' reactivation and the other SUs' contention, thus causing many unexpected hand-offs among SUs, which severely degrade the achieved throughput of SUs in non-time-slotted CRNs. Employing the energy-detection based wireless full-duplex spectrum sensing schemes, the PUs' reactivation-failure problem can be efficiently solved, thus guaranteeing the required throughput of PUs. However, the key of CRNs is not only the throughput-guarantees for PUs, but also the throughput-boosts for SUs. To optimize the throughput of SUs in multichannel non-time-slotted CRNs, in this paper we develop the pilot-based full-duplex spectrum sensing (PF-SS) scheme and the pilot-based medium access control (P-MAC) protocol to not only guarantee the required throughput of PUs, but also significantly increase the throughput of SUs in multichannel non-time-slotted CRNs. Using the PF-SS scheme, the SUs can identify whether the PUs' signal or the SUs' signal, thus significantly reducing the frequently unexpected hand-offs among SUs. Then, based on the PF-SS scheme, the P-MAC protocol can significantly increase the throughput of SUs. We conduct extensive numerical analyses to show that our developed PF-SS scheme and P-MAC protocol can significantly increase the throughput of SUs while guaranteeing the required throughput for PUs in multichannel non-time-slotted CRNs.", "citation": "Not cited", "departments": ["Xidian University", "Texas A&M University", "Xidian University"], "authors": ["Wenchi Cheng.....http://dblp.org/pers/hd/c/Cheng:Wenchi", "Xi Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Xi", "Hailin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Hailin"], "conf": "infocom", "year": "2017", "pages": 9}