{"title": "Matrix Tri-Factorization with Manifold Regularizations for Zero-Shot Learning.", "fields": ["manifold alignment", "matrix decomposition", "manifold", "factorization", "embedding"], "abstract": "Zero-shot learning (ZSL) aims to recognize objects of unseen classes with available training data from another set of seen classes. Existing solutions are focused on exploring knowledge transfer via an intermediate semantic embedding (e.g., attributes) shared between seen and unseen classes. In this paper, we propose a novel projection framework based on matrix tri-factorization with manifold regularizations. Specifically, we learn the semantic embedding projection by decomposing the visual feature matrix under the guidance of semantic embedding and class label matrices. By additionally introducing manifold regularizations on visual data and semantic embeddings, the learned projection can effectively captures the geometrical manifold structure residing in both visual and semantic spaces. To avoid the projection domain shift problem, we devise an effective prediction scheme by exploiting the test-time manifold structure. Extensive experiments on four benchmark datasets show that our approach significantly outperforms the state-of-the-arts, yielding an average improvement ratio by 7.4% and 31.9% for the recognition and retrieval task, respectively.", "citation": "Citations (14)", "year": "2017", "departments": ["Center for Futu ...  Chengdu, China", "Center for Futu ...  Chengdu, China", "Center for Futu ...  Chengdu, China", "Center for Futu ...  Chengdu, China", "Center for Futu ...  Chengdu, China"], "conf": "cvpr", "authors": ["Xing Xu.....http://dblp.org/pers/hd/x/Xu:Xing", "Fumin Shen.....http://dblp.org/pers/hd/s/Shen:Fumin", "Yang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Yang", "Dongxiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Dongxiang", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Jingkuan Song.....http://dblp.org/pers/hd/s/Song:Jingkuan"], "pages": 10}