{"title": "On Redundant Topological Constraints (Extended Abstract).", "fields": ["solution set", "region connection calculus", "subclass", "computer science", "discrete mathematics", "subnetwork", "unique prime"], "abstract": "The Region Connection Calculus (RCC) is a well-known calculus for representing part-whole and topological relations. It plays an important role in qualitative spatial reasoning, geographical information science, and ontology. The computational complexity of reasoning with RCC has been investigated in depth in the literature. Most of these works focus on the consistency of RCC constraint networks. In this paper, we consider the important problem of redundant RCC constraints. For a set Γ of RCC constraints, we say a constraint (xRy) in Γ is redundant if it can be entailed by the rest of Γ. A prime subnetwork of Γ is a subset of Γ which contains no redundant constraints but has the same solution set as Γ. It is natural to ask how to compute a prime subnetwork, and when it is unique. In this paper, we show that this problem is in general intractable, but becomes tractable if Γ is over a tractable subclass of RCC. If S is a tractable subclass in which weak composition distributes over non-empty intersections, then we can show that r has a unique prime network, which is obtained by removing all redundant constraints from Γ. As a byproduct, we identify a sufficient condition for a path-consistent network being minimal.", "citation": "Not cited", "year": "2017", "departments": ["University of Technology, Sydney", "University of Technology, Sydney", "Baidu", "RMIT University", "University of Melbourne", "University of Melbourne", "University of Technology, Sydney", "University of Technology, Sydney", "University of Technology, Sydney"], "conf": "ijcai", "authors": ["Sanjiang Li.....http://dblp.org/pers/hd/l/Li:Sanjiang", "Zhiguo Long.....http://dblp.org/pers/hd/l/Long:Zhiguo", "Weiming Liu.....http://dblp.org/pers/hd/l/Liu:Weiming", "Matt Duckham.....http://dblp.org/pers/hd/d/Duckham:Matt", "Alan Both.....http://dblp.org/pers/hd/b/Both:Alan"], "pages": 5}