{"title": "Automatic Music Video Generation Based on Simultaneous Soundtrack Recommendation and Video Editing.", "fields": ["dynamic time warping", "video capture", "video editing", "concatenation", "video processing"], "abstract": "An automated process that can suggest a soundtrack to a user-generated video (UGV) and make the UGV a music-compliant professional-like video is challenging but desirable. To this end, this paper presents an automatic music video (MV) generation system that conducts soundtrack recommendation and video editing simultaneously. Given a long UGV, it is first divided into a sequence of fixed-length short (e.g., 2 seconds) segments, and then a multi-task deep neural network (MDNN) is applied to predict the pseudo acoustic (music) features (or called the pseudo song) from the visual (video) features of each video segment. In this way, the distance between any pair of video and music segments of same length can be computed in the music feature space. Second, the sequence of pseudo acoustic (music) features of the UGV and the sequence of the acoustic (music) features of each music track in the music collection are temporarily aligned by the dynamic time warping (DTW) algorithm with a pseudo-song-based deep similarity matching (PDSM) metric. Third, for each music track, the video editing module selects and concatenates the segments of the UGV based on the target and concatenation costs given by a pseudo-song-based deep concatenation cost (PDCC) metric according to the DTW-aligned result to generate a music-compliant professional-like video. Finally, all the generated MVs are ranked, and the best MV is recommended to the user. The MDNN for pseudo song prediction and the PDSM and PDCC metrics are trained by an annotated official music video (OMV) corpus. The results of objective and subjective experiments demonstrate that the proposed system performs well and can generate appealing MVs with better viewing and listening experiences.", "citation": "Not cited", "departments": ["Academia Sinica", "Academia Sinica", "National Chiao Tung University", "Academia Sinica", "Academia Sinica"], "authors": ["Jen-Chun Lin.....http://dblp.org/pers/hd/l/Lin:Jen=Chun", "Wen-Li Wei.....http://dblp.org/pers/hd/w/Wei:Wen=Li", "James Yang.....http://dblp.org/pers/hd/y/Yang:James", "Hsin-Min Wang.....http://dblp.org/pers/hd/w/Wang:Hsin=Min", "Hong-Yuan Mark Liao.....http://dblp.org/pers/hd/l/Liao:Hong=Yuan_Mark"], "conf": "mm", "year": "2017", "pages": 9}