{"title": "Statistical Inference of Gaussian-Laplace Distribution for Person Verification.", "fields": ["statistical inference", "pattern recognition", "laplace distribution", "gaussian", "machine learning"], "abstract": "Metric learning is an important issue in the person verification problem, which is to identify whether a pair of face or human body images is about the same person. Due to low running cost, the non-iterative statistical inference methods for metric learning show their efficiency and effectiveness to large scale datasets and on-line updating person verification applications. The KISSME method is a typical one that constructs the metric based on two assumptions that both of the discrepancy spaces of negative pairs and positive pairs should be Gaussian structures. However, we find that, in fact, the distribution of discrepancies of positive pairs might tend to the Laplace distribution rather than the Gaussian distribution. Based on this finding, we propose a metric learning method by exploiting Gaussian-Laplace distribution statistical inference, where the Gaussian distribution of negative discrepancies and the Laplace distribution of positive discrepancies are considered together. Experiments conducted on two human body datasets (VIPeR and Market-1501) and one face dataset (LFW) show its superiority in terms of effectiveness and efficiency as compared with the state-of-the-art approaches, no matter the appearance description is handcrafted or deep learned.", "citation": "Citations (2)", "departments": ["Wuhan University", "Wuhan University", "National Institute of Informatics", "China University of Geosciences", "Wuhan University"], "authors": ["Zheng Wang.....http://dblp.org/pers/hd/w/Wang_0007:Zheng", "Ruimin Hu.....http://dblp.org/pers/hd/h/Hu:Ruimin", "Yi Yu.....http://dblp.org/pers/hd/y/Yu_0001:Yi", "Junjun Jiang.....http://dblp.org/pers/hd/j/Jiang:Junjun", "Jiayi Ma.....http://dblp.org/pers/hd/m/Ma_0001:Jiayi", "Shin'ichi Satoh.....http://dblp.org/pers/hd/s/Satoh:Shin=ichi"], "conf": "mm", "year": "2017", "pages": 9}