{"title": "Prism aftereffects for throwing with a self-avatar in an immersive virtual environment.", "fields": ["throwing", "immersion", "prism adaptation", "clockwise", "visual field"], "abstract": "The use of first-person self-avatars in immersive virtual environments (VEs) has grown over recent years. It is unknown, however, how visual feedback from a self-avatar influences a user's online actions and subsequent calibration of actions within an immersive VE. The current paper uses a prism throwing adaptation paradigm to test the role of a self-avatar arm or full body on action calibration in a VE. Participants' throwing accuracy to a target on the ground was measured first in a normal viewing environment, then with the visual field rotated clockwise about their vertical axis by 17° (prism simulation), and then again in the normal viewing environment with the prism distortion removed. Participants experienced either no-avatar, a first-person avatar arm and hand, or a first-person full body avatar during the entire experimental session, in a between-subjects manipulation. Results showed similar throwing error and adaptation during the prism exposure for all conditions, but a reduced aftereffect (displacement with respect to the target in the opposite direction of the prism-exposure) when the avatar arm or full body was present. The results are discussed in the context of how an avatar can provide a visual frame of reference to aid in action calibration.", "citation": "Not cited", "departments": ["Vanderbilt University", "University of Utah", "University of Utah", "Vanderbilt University", "University of Utah"], "authors": ["Bobby Bodenheimer.....http://dblp.org/pers/hd/b/Bodenheimer:Bobby", "Sarah H. Creem-Regehr.....http://dblp.org/pers/hd/c/Creem=Regehr:Sarah_H=", "Jeanine Stefanucci.....http://dblp.org/pers/hd/s/Stefanucci:Jeanine", "Elena Shemetova.....http://dblp.org/pers/hd/s/Shemetova:Elena", "William B. Thompson.....http://dblp.org/pers/hd/t/Thompson:William_B="], "conf": "vr", "year": "2017", "pages": 7}