{"title": "Measuring Global Disease with Wikipedia: Success, Failure, and a Research Agenda.", "fields": ["disease surveillance", "semantic similarity", "source code", "training set", "observational study"], "abstract": "Effective disease monitoring provides a foundation for effective public health systems. This has historically been accomplished with patient contact and bureaucratic aggregation, which tends to be slow and expensive. Recent internet-based approaches promise to be real-time and cheap, with few parameters. However, the question of when and how these approaches work remains open. We addressed this question using Wikipedia access logs and category links. Our experiments, replicable and extensible using our open source code and data, test the effect of semantic article filtering, amount of training data, forecast horizon, and model staleness by comparing across 6 diseases and 4 countries using thousands of individual models. We found that our minimal-configuration, language-agnostic article selection process based on semantic relatedness is effective for improving predictions, and that our approach is relatively insensitive to the amount and age of training data. We also found, in contrast to prior work, very little forecasting value, and we argue that this is consistent with theoretical considerations about the nature of forecasting. These mixed results lead us to propose that the currently observational field of internet-based disease surveillance must pivot to include theoretical models of information flow as well as controlled experiments based on simulations of disease.", "citation": "Citations (3)", "departments": ["Los Alamos National Laboratory", "Los Alamos National Laboratory", "Los Alamos National Laboratory", "Los Alamos National Laboratory", "Los Alamos National Laboratory"], "authors": ["Reid Priedhorsky.....http://dblp.org/pers/hd/p/Priedhorsky:Reid", "Dave Osthus.....http://dblp.org/pers/hd/o/Osthus:Dave", "Ashlynn R. Daughton.....http://dblp.org/pers/hd/d/Daughton:Ashlynn_R=", "Kelly R. Moran.....http://dblp.org/pers/hd/m/Moran:Kelly_R=", "Nicholas Generous.....http://dblp.org/pers/hd/g/Generous:Nicholas", "Geoffrey Fairchild.....http://dblp.org/pers/hd/f/Fairchild:Geoffrey", "Alina Deshpande.....http://dblp.org/pers/hd/d/Deshpande:Alina", "Sara Y. Del Valle.....http://dblp.org/pers/hd/v/Valle:Sara_Y=_Del"], "conf": "cscw", "year": "2017", "pages": 23}