{"title": "Repeat after me: Using mixed reality humans to influence best communication practices.", "fields": ["patient safety", "mixed reality", "information exchange", "models of communication", "interpersonal communication"], "abstract": "In the past few years, advances have been made on how mixed reality humans (MRHs) can be used for interpersonal communication skills training for medical teams; however, little research has looked at how MRHs can influence communication skills during training. One way to influence communication skills is to leverage MRHs as models of communication behavior. We created a mixed reality medical team training exercise designed to impact communication behaviors that are critical for patient safety. We recruited anesthesia residents to go through an operating room training exercise with MRHs to assess and influence residents' closed loop communication behaviors during medication administration. We manipulated the behavior of the MRHs to determine if the MRHs could influence the residents' closed loop communication behavior. Our results showed that residents' closed loop communications behaviors were influenced by MRHs. Additionally, we found there was a statistically significant difference between groups based on which MRH behavior residents observed. Because the MRHs significantly impacted how residents communicated in simulation, this work expands the boundaries for how VR can be used and demonstrates that MRHs could be used as tools to address complex communication dynamics in a team setting.", "citation": "Not cited", "departments": ["University of Florida", "University of Florida", "University of Virginia", "University of Florida", "University of Florida"], "authors": ["Andrew Cordar.....http://dblp.org/pers/hd/c/Cordar:Andrew", "Adam Wendling.....http://dblp.org/pers/hd/w/Wendling:Adam", "Casey White.....http://dblp.org/pers/hd/w/White:Casey", "Samsun Lampotang.....http://dblp.org/pers/hd/l/Lampotang:Samsun", "Benjamin Lok.....http://dblp.org/pers/hd/l/Lok:Benjamin"], "conf": "vr", "year": "2017", "pages": 9}