{"title": "Most Influential Community Search over Large Social Networks.", "fields": ["group cohesiveness", "analytics", "sentiment analysis", "social media", "search problem"], "abstract": "Detecting social communities in large social networks provides an effective way to analyze the social media users' behaviors and activities. It has drawn extensive attention from both academia and industry. One essential aspect of communities in social networks is outer influence which is the capability to spread internal information of communities to external users. Detecting the communities of high outer influence has particular interest in a wide range of applications, e.g., Ads trending analytics, social opinion mining and news propagation pattern discovery. However, the existing detection techniques largely ignore the outer influence of the communities. To fill the gap, this work investigates the Most Influential Community Search problem to disclose the communities with the highest outer influences. We firstly propose a new community model, maximal kr-Clique community, which has desirable properties, i.e., society, cohesiveness, connectivity, and maximum. Then, we design a novel tree-based index structure, denoted as C-Tree, to maintain the offline computed r-cliques. To efficiently search the most influential communities, we also develop four advanced index-based algorithms which improve the search performance of non-indexed solution by about 200 times. The efficiency and effectiveness of our solution have been extensively verified using six real datasets and a small case study.", "citation": "Citations (5)", "departments": ["University of Western Australia", "RMIT University", "RMIT University", "Northeastern University", "Swinburne University of Technology"], "authors": ["Jianxin Li.....http://dblp.org/pers/hd/l/Li:Jianxin", "Xinjue Wang.....http://dblp.org/pers/hd/w/Wang:Xinjue", "Ke Deng.....http://dblp.org/pers/hd/d/Deng:Ke", "Xiaochun Yang.....http://dblp.org/pers/hd/y/Yang_0001:Xiaochun", "Timos Sellis.....http://dblp.org/pers/hd/s/Sellis:Timos", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu"], "conf": "icde", "year": "2017", "pages": 12}