{"title": "Egeria: a framework for automatic synthesis of HPC advising tools through multi-layered natural language processing.", "fields": ["general purpose computing on graphics processing units", "cuda", "memorization", "code refactoring", "xeon phi"], "abstract": "Achieving high performance on modern systems is challenging. Even with a detailed profile from a performance tool, writing or refactoring a program to remove its performance issues is still a daunting task for application programmers: it demands lots of program optimization expertise that is often system specific.   Vendors often provide some detailed optimization guides to assist programmers in the process. However, these guides are frequently hundreds of pages long, making it difficult for application programmers to master and memorize all the rules and guidelines and properly apply them to a specific problem instance.   In this work, we develop a framework named Egeria to alleviate the difficulty. Through Egeria, one can easily construct an advising tool for a certain high performance computing (HPC) domain (e.g., GPU programming) by providing Egeria with a optimization guide or other related documents for the target domain. An advising tool produced by Egeria provides a concise list of essential rules automatically extracted from the documents. At the same time, the advising tool serves as a question-answer agent that can interactively offers suggestions for specific optimization questions. Egeria is made possible through a distinctive multi-layered design that leverages natural language processing techniques and extends them with knowledge of HPC domains and how to extract information relevant to code optimization Experiments on CUDA, OpenCL, and Xeon Phi programming guides demonstrate, both qualitatively and quantitatively, the usefulness of Egeria for HPC.", "citation": "Citations (1)", "year": "2017", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University"], "conf": "sc", "authors": ["Hui Guan.....http://dblp.org/pers/hd/g/Guan:Hui", "Xipeng Shen.....http://dblp.org/pers/hd/s/Shen:Xipeng", "Hamid Krim.....http://dblp.org/pers/hd/k/Krim:Hamid"], "pages": 14}