{"title": "A Fast and Verified Software Stack for Secure Function Evaluation.", "fields": ["oblivious transfer", "implementation", "secure multi party computation", "real time computing", "computer science", "boolean circuit", "optimizing compiler", "software"], "abstract": "We present a high-assurance software stack for secure function evaluation (SFE). Our stack consists of three components: i. a verified compiler (CircGen) that translates C programs into Boolean circuits; ii. a verified implementation of Yao's SFE protocol based on garbled circuits and oblivious transfer; and iii. transparent application integration and communications via FRESCO, an open-source framework for secure multiparty computation (MPC). CircGen is a general purpose tool that builds on CompCert, a verified optimizing compiler for C. It can be used in arbitrary Boolean circuit-based cryptography deployments. The security of our SFE protocol implementation is formally verified using EasyCrypt, a tool-assisted framework for building high-confidence cryptographic proofs, and it leverages a new formalization of garbled circuits based on the framework of Bellare, Hoang, and Rogaway (CCS 2012). We conduct a practical evaluation of our approach, and conclude that it is competitive with state-of-the-art (unverified) approaches. Our work provides concrete evidence of the feasibility of building efficient, verified, implementations of higher-level cryptographic systems. All our development is publicly available.", "citation": "Not cited", "year": "2017", "departments": ["University of Minho", "University of Porto", "IMDEA", "University of Surrey", "French Institute for Research in Computer Science and Automation"], "conf": "ccs", "authors": ["José Bacelar Almeida.....http://dblp.org/pers/hd/a/Almeida:Jos=eacute=_Bacelar", "Manuel Barbosa.....http://dblp.org/pers/hd/b/Barbosa:Manuel", "Gilles Barthe.....http://dblp.org/pers/hd/b/Barthe:Gilles", "François Dupressoir.....http://dblp.org/pers/hd/d/Dupressoir:Fran=ccedil=ois", "Benjamin Grégoire.....http://dblp.org/pers/hd/g/Gr=eacute=goire:Benjamin", "Vincent Laporte.....http://dblp.org/pers/hd/l/Laporte:Vincent", "Vitor Pereira.....http://dblp.org/pers/hd/p/Pereira:Vitor"], "pages": 18}