{"title": "NutShell: Scalable Whittled Proxy Execution for Low-Latency Web over Cellular Networks.", "fields": ["latency", "low latency", "program slicing", "javascript", "reverse proxy"], "abstract": "Despite much recent progress, Web page latencies over cellular networks remain much higher than those over wired networks. Proxies that execute Web page JavaScript (JS) and push objects needed by the client can reduce latency. However, a key concern is the scalability of the proxy which must execute JS for many concurrent users. In this paper, we propose to scale the proxies, focusing on a design where the proxy's execution is solely to push the needed objects and the client completely executes the page as normal. Such redundant execution is a simple, yet effective approach to cutting network latencies, which dominate page load delays in cellular settings. We develop whittling, a technique to identify and execute in the proxy only the JS code necessary to identify and push the objects required for the client page load, while skipping other code. Whittling is closely related to program slicing, but with the important distinction that it is acceptable to approximate the program slice in the proxy given the client's complete execution. Experiments with top Alexa Web pages show NutShell can sustain, on average, 27\\% more user requests per second than a proxy performing fully redundant execution, while preserving, and sometimes enhancing, the latency benefits.", "citation": "Not cited", "departments": ["Purdue University", "Purdue University", "Purdue University", "AT&T Labs", "AT&T Labs"], "authors": ["Ashiwan Sivakumar.....http://dblp.org/pers/hd/s/Sivakumar:Ashiwan", "Chuan Jiang.....http://dblp.org/pers/hd/j/Jiang:Chuan", "Yun Seong Nam.....http://dblp.org/pers/hd/n/Nam:Yun_Seong", "Shankaranarayanan Puzhavakath Narayanan.....http://dblp.org/pers/hd/n/Narayanan:Shankaranarayanan_Puzhavakath", "Vijay Gopalakrishnan.....http://dblp.org/pers/hd/g/Gopalakrishnan:Vijay", "Sanjay G. Rao.....http://dblp.org/pers/hd/r/Rao:Sanjay_G=", "Subhabrata Sen.....http://dblp.org/pers/hd/s/Sen:Subhabrata", "Mithuna Thottethodi.....http://dblp.org/pers/hd/t/Thottethodi:Mithuna", "T. N. Vijaykumar.....http://dblp.org/pers/hd/v/Vijaykumar:T=_N="], "conf": "mobicom", "year": "2017", "pages": 14}