{"title": "LAMP: data provenance for graph based machine learning algorithms through derivative computation.", "fields": ["data set", "partial derivative", "information engineering", "debugging", "automatic differentiation"], "abstract": "Data provenance tracking determines the set of inputs related to a given output. It enables quality control and problem diagnosis in data engineering. Most existing techniques work by tracking program dependencies. They cannot quantitatively assess the importance of related inputs, which is critical to machine learning algorithms, in which an output tends to depend on a huge set of inputs while only some of them are of importance. In this paper, we propose LAMP, a provenance computation system for machine learning algorithms. Inspired by automatic differentiation (AD), LAMP quantifies the importance of an input for an output by computing the partial derivative. LAMP separates the original data processing and the more expensive derivative computation to different processes to achieve cost-effectiveness. In addition, it allows quantifying importance for inputs related to discrete behavior, such as control flow selection. The evaluation on a set of real world programs and data sets illustrates that LAMP produces more precise and succinct provenance than program dependence based techniques, with much less overhead. Our case studies demonstrate the potential of LAMP in problem diagnosis in data engineering.", "citation": "Citations (1)", "departments": ["Purdue University", "Purdue University", "Nanjing University", "Purdue University", "Nanjing University"], "authors": ["Shiqing Ma.....http://dblp.org/pers/hd/m/Ma:Shiqing", "Yousra Aafer.....http://dblp.org/pers/hd/a/Aafer:Yousra", "Zhaogui Xu.....http://dblp.org/pers/hd/x/Xu:Zhaogui", "Wen-Chuan Lee.....http://dblp.org/pers/hd/l/Lee:Wen=Chuan", "Juan Zhai.....http://dblp.org/pers/hd/z/Zhai:Juan", "Yingqi Liu.....http://dblp.org/pers/hd/l/Liu:Yingqi", "Xiangyu Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiangyu"], "conf": "sigsoft", "year": "2017", "pages": 12}