{"title": "Voyager 2: Augmenting Visual Analysis with Partial View Specifications.", "fields": ["commit", "voyager program", "data field", "data visualization", "chart"], "abstract": "Visual data analysis involves both open-ended and focused exploration. Manual chart specification tools support question answering, but are often tedious for early-stage exploration where systematic data coverage is needed. Visualization recommenders can encourage broad coverage, but irrelevant suggestions may distract users once they commit to specific questions. We present  Voyager 2 , a mixed-initiative system that blends manual and automated chart specification to help analysts engage in both open-ended exploration and targeted question answering. We contribute two partial specification interfaces:  wildcards  let users specify multiple charts in parallel, while  related views  suggest visualizations relevant to the currently specified chart. We present our interface design and applications of the  CompassQL  visualization query language to enable these interfaces. In a controlled study we find that Voyager 2 leads to increased data field coverage compared to a traditional specification tool, while still allowing analysts to flexibly drill-down and answer specific questions.", "citation": "Citations (7)", "year": "2017", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "conf": "chi", "authors": ["Kanit Wongsuphasawat.....http://dblp.org/pers/hd/w/Wongsuphasawat:Kanit", "Zening Qu.....http://dblp.org/pers/hd/q/Qu:Zening", "Dominik Moritz.....http://dblp.org/pers/hd/m/Moritz:Dominik", "Riley Chang.....http://dblp.org/pers/hd/c/Chang:Riley", "Felix Ouk.....http://dblp.org/pers/hd/o/Ouk:Felix", "Anushka Anand.....http://dblp.org/pers/hd/a/Anand:Anushka", "Jock D. Mackinlay.....http://dblp.org/pers/hd/m/Mackinlay:Jock_D=", "Bill Howe.....http://dblp.org/pers/hd/h/Howe:Bill", "Jeffrey Heer.....http://dblp.org/pers/hd/h/Heer:Jeffrey"], "pages": 12}