{"title": "Competitive analysis for online scheduling in software-defined optical WAN.", "fields": ["job shop scheduling", "network layer", "schedule", "competitive analysis", "wide area network"], "abstract": "Modern planetary-scale online services have massive data to transfer over the wide area network (WAN). Due to the tremendous cost of building WANs and the stringent timing requirement of distributed applications, it is critical for network operators to make efficient use of network resources to optimize data transfers. By leveraging software-defined networking (SDN) and reconfigurable optical devices, recent solutions design centralized systems to jointly control the network layer and the optical layer. While these solutions show it is promising to significantly reduce data transfer times by centralized cross-layer control, they do not have any theoretical guarantees on the proposed algorithms. This paper presents approximation algorithms and theoretical analysis for the online transfer scheduling problem over optical WANs. The goal of the scheduling problem is to minimize the makespan (the time to finish all transfers) or the total sum of completion times. We design and analyze various greedy, online scheduling algorithms that can achieve 3-competitive ratio for makespan, 2-competitive ratio for minimum sum completion time for jobs of unit size, and 3α-competitive ratio for jobs of arbitrary transfer size and each node having degree constraint d, where α = 1 when d = 1 and α = 1.86 when d ≥ 2. We also evaluated the performance of these algorithms and compared the performance with prior heuristics.", "citation": "Citations (4)", "departments": ["Stony Brook University", "Johns Hopkins University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Su Jia.....http://dblp.org/pers/hd/j/Jia:Su", "Xin Jin.....http://dblp.org/pers/hd/j/Jin_0008:Xin", "Golnaz Ghasemiesfeh.....http://dblp.org/pers/hd/g/Ghasemiesfeh:Golnaz", "Jiaxin Ding.....http://dblp.org/pers/hd/d/Ding:Jiaxin", "Jie Gao.....http://dblp.org/pers/hd/g/Gao:Jie"], "conf": "infocom", "year": "2017", "pages": 9}