{"title": "Attend in Groups: A Weakly-Supervised Deep Learning Framework for Learning from Web Data.", "fields": ["robustness", "deep learning", "discriminative model", "visualization", "noise measurement"], "abstract": "Large-scale datasets have driven the rapid development of deep neural networks for visual recognition. However, annotating a massive dataset is expensive and time-consuming. Web images and their labels are, in comparison, much easier to obtain, but direct training on such automatially harvested images can lead to unsatisfactory performance, because the noisy labels of Web images adversely affect the learned recognition models. To address this drawback we propose an end-to-end weakly-supervised deep learning framework which is robust to the label noise in Web images. The proposed framework relies on two unified strategies – random grouping and attention – to effectively reduce the negative impact of noisy web image annotations. Specifically, random grouping stacks multiple images into a single training instance and thus increases the labeling accuracy at the instance level. Attention, on the other hand, suppresses the noisy signals from both incorrectly labeled images and less discriminative image regions. By conducting intensive experiments on two challenging datasets, including a newly collected fine-grained dataset with Web images of different car models, the superior performance of the proposed methods over competitive baselines is clearly demonstrated.", "citation": "Citations (7)", "year": "2017", "departments": ["University of Adelaide", "University of Adelaide", "University of Adelaide", "University of Adelaide", "University of Adelaide"], "conf": "cvpr", "authors": ["Bohan Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Bohan", "Lingqiao Liu.....http://dblp.org/pers/hd/l/Liu:Lingqiao", "Yao Li.....http://dblp.org/pers/hd/l/Li_0003:Yao", "Chunhua Shen.....http://dblp.org/pers/hd/s/Shen:Chunhua", "Ian D. Reid.....http://dblp.org/pers/hd/r/Reid_0001:Ian_D="], "pages": 10}