{"title": "One-tag checker: Message-locked integrity auditing on encrypted cloud deduplication storage.", "fields": ["random oracle", "retrievability", "data deduplication", "cloud storage", "proxy server"], "abstract": "In this paper, we investigate the problem of integrity auditing for cloud deduplication storage. Specifically, in addition to the outsourced data confidentiality, we also aim to ensure the integrity of the deduplicated cloud storage. With the existing works based on Provable Data Possession (PDP)/Proof of Retrievability (PoR), we are either required to rely on a fully trusted proxy server or inevitably sacrifice the privacy and efficiency. In contrast, we present a novel message-locked integrity auditing scheme without an additional proxy server, which is applicable to both file-level and chunk-level deduplication systems. In particular, our scheme is storage efficient in the sense that apart from eliminating the ciphertext redundancy, we also enable the integrity tag deduplication by a message-derived signing key, which merely incurs minimal client-side computation overhead. Besides, we can still publicly perform the integrity check over any client's cloud storage by incorporating the proxy re-signature technique. We show that the proposed scheme will not disclose the data ownership information and is provably secure under the Computational Diffie-Hellman (CDH) assumption in the random oracle model. Finally, the performance evaluation demonstrates its effectiveness and efficiency.", "citation": "Citations (2)", "departments": ["Xidian University", "Virginia Tech", "Virginia Tech", "Xidian University", "Xidian University"], "authors": ["Xuefeng Liu.....http://dblp.org/pers/hd/l/Liu:Xuefeng", "Wenhai Sun.....http://dblp.org/pers/hd/s/Sun:Wenhai", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Qingqi Pei.....http://dblp.org/pers/hd/p/Pei:Qingqi", "Yuqing Zhang.....http://dblp.org/pers/hd/z/Zhang:Yuqing"], "conf": "infocom", "year": "2017", "pages": 9}