{"title": "Adaptive scheduling of parallel jobs in spark streaming.", "fields": ["stream processing", "latency", "workload", "complex event processing", "low latency"], "abstract": "Streaming data analytics has become increasingly vital in many applications such as dynamic content delivery (e.g., advertisements), Twitter sentiment analysis, and security event processing (e.g., intrusion detection systems, and spam filters). Emerging stream processing systems, such as Spark Streaming, treat the continuous stream as a series of micro-batches of data and continuously process these micro-batch jobs. Such micro-batch based stream processing provides several advantages over traditional stream processing systems, which process streaming data one record at a time, including fast recovery from failures, better load balancing and scalability. However, efficient scheduling of micro-batch jobs to achieve high throughput and low latency is very challenging due to the complex data dependency and dynamism inherent in streaming workloads. In this paper, we propose A-scheduler, an adaptive scheduling approach that dynamically schedules parallel micro-batch jobs in Spark Streaming and automatically adjusts scheduling parameters to improve performance and resource efficiency. Specifically, A-scheduler dynamically schedules multiple jobs concurrently using different policies based on their data dependencies and automatically adjusts the level of job parallelism and resource shares among jobs based on workload properties. We implemented A-scheduler and evaluated it with a real-time security event processing workload. Our experimental results show that A-scheduler can reduce end-to-end latency by 42% and improve workload throughput and energy efficiency by 21% and 13%, respectively, compared to the default Spark Streaming scheduler.", "citation": "Citations (2)", "departments": ["University of North Carolina at Charlotte", "Hewlett-Packard", "University of Colorado Colorado Springs", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Dazhao Cheng.....http://dblp.org/pers/hd/c/Cheng:Dazhao", "Yuan Chen.....http://dblp.org/pers/hd/c/Chen:Yuan", "Xiaobo Zhou.....http://dblp.org/pers/hd/z/Zhou_0002:Xiaobo", "Daniel Gmach.....http://dblp.org/pers/hd/g/Gmach:Daniel", "Dejan S. Milojicic.....http://dblp.org/pers/hd/m/Milojicic:Dejan_S="], "conf": "infocom", "year": "2017", "pages": 9}