{"title": "Differential Angular Imaging for Material Recognition.", "fields": ["autonomous agent", "terrain", "reflectivity", "network architecture", "machine learning"], "abstract": "Material recognition for real-world outdoor surfaces has become increasingly important for computer vision to support its operation in the wild. Computational surface modeling that underlies material recognition has transitioned from reflectance modeling using in-lab controlled radiometric measurements to image-based representations based on internet-mined images of materials captured in the scene. We propose to take a middle-ground approach for material recognition that takes advantage of both rich radiometric cues and flexible image capture. We realize this by developing a framework for differential angular imaging, where small angular variations in image capture provide an enhanced appearance representation and significant recognition improvement. We build a large-scale material database, Ground Terrain in Outdoor Scenes (GTOS) database, geared towards real use for autonomous agents. The database consists of over 30,000 images covering 40 classes of outdoor ground terrain under varying weather and lighting conditions. We develop a novel approach for material recognition called a Differential Angular Imaging Network (DAIN) to fully leverage this large dataset. With this novel network architecture, we extract characteristics of materials encoded in the angular and spatial gradients of their appearance. Our results show that DAIN achieves recognition performance that surpasses single view or coarsely quantized multiview images. These results demonstrate the effectiveness of differential angular imaging as a means for flexible, in-place material recognition.", "citation": "Citations (10)", "year": "2017", "departments": ["Rutgers University", "Rutgers University", "Rutgers University", "National Institute of Informatics"], "conf": "cvpr", "authors": ["Jia Xue.....http://dblp.org/pers/hd/x/Xue:Jia", "Hang Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Hang", "Kristin J. Dana.....http://dblp.org/pers/hd/d/Dana:Kristin_J=", "Ko Nishino.....http://dblp.org/pers/hd/n/Nishino:Ko"], "pages": 10}