{"title": "LEAF: Latent Extended Attribute Features Discovery for Visual Classification.", "fields": ["graph", "discriminative model", "classifier", "embedding", "feature selection"], "abstract": "To improve the discrimination of attribute representation, in this paper, we propose to extend the traditional attribute representations via embedding the latent high-order structure between attributes. Specifically, our aim is to construct the Latent Extended Attribute Features (LEAF) for visual classification. Since there only exist weak label for each attribute, we firstly propose a feature selection method to explore the common feature structures across categories. After that, the attribute classifiers are trained based on the selected features. Then, the category specific graph is introduced, which is composed of single attributes and their co-occurrence attribute pairs. This attribute graph is used as the initialized representation of each image. Considering our aim, we should discover the discriminative latent structure between attributes and train the robust category classifiers. To that end, we develop a joint learning objective function which is composed of the high-order representation mining term and the classifier training term. The mining term can both preserve category-specific information and discover the common structure between categories. Based on the discovery representation, the robust visual classifiers could be trained by the classifier term. Finally, an alternating optimization method is designed to seek the optimal solution of our objective function. Experimental results on the challenging datasets demonstrate the advantages of our proposed model over existing work.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Tianjin University", "Chinese Academy of Sciences"], "authors": ["Hua Zhang.....http://dblp.org/pers/hd/z/Zhang_0008:Hua", "Rui Wang.....http://dblp.org/pers/hd/w/Wang_0032:Rui", "Changqing Zhang.....http://dblp.org/pers/hd/z/Zhang:Changqing", "Xiaochun Cao.....http://dblp.org/pers/hd/c/Cao:Xiaochun"], "conf": "mm", "year": "2017", "pages": 9}