{"title": "Bit-pragmatic deep neural network computing.", "fields": ["multiplication", "deep learning", "convolutional neural network", "degree of parallelism", "inefficiency"], "abstract": "Deep Neural Networks expose a high degree of parallelism, making them amenable to highly data parallel architectures. However, data-parallel architectures often accept inefficiency in individual computations for the sake of overall efficiency. We show that on average, activation values of convolutional layers during inference in modern Deep Convolutional Neural Networks (CNNs) contain 92% zero bits. Processing these zero bits entails ineffectual computations that could be skipped. We propose  Pragmatic  ( PRA ), a massively data-parallel architecture that eliminates most of the ineffectual computations on-the-fly, improving performance and energy efficiency compared to state-of-the-art high-performance accelerators [5]. The idea behind  PRA  is deceptively simple: use serial-parallel shift-and-add multiplication while skipping the zero bits of the serial input. However, a straightforward implementation based on shift-and-add multiplication yields unacceptable area, power and memory access overheads compared to a conventional bit-parallel design.  PRA  incorporates a set of design decisions to yield a practical, area and energy efficient design.   Measurements demonstrate that for convolutional layers,  PRA  is 4.31X faster than  DaDianNao  [5] ( DaDN ) using a 16-bit fixed-point representation. While  PRA  requires 1.68X more area than  DaDN , the performance gains yield a 1.70X increase in energy efficiency in a 65nm technology. With 8-bit quantized activations,  PRA  is 2.25X faster and 1.31X more energy efficient than an 8-bit version of  DaDN.", "citation": "Citations (8)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Jorge Albericio.....http://dblp.org/pers/hd/a/Albericio:Jorge", "Alberto Delmas.....http://dblp.org/pers/hd/d/Delmas:Alberto", "Patrick Judd.....http://dblp.org/pers/hd/j/Judd:Patrick", "Sayeh Sharify.....http://dblp.org/pers/hd/s/Sharify:Sayeh", "Gerard O'Leary.....http://dblp.org/pers/hd/o/O=Leary:Gerard", "Roman Genov.....http://dblp.org/pers/hd/g/Genov:Roman", "Andreas Moshovos.....http://dblp.org/pers/hd/m/Moshovos:Andreas"], "conf": "micro", "year": "2017", "pages": 13}