{"title": "Disarmament Games.", "fields": ["negotiation", "disarmament", "stag hunt", "mathematical economics", "management science", "arms control", "game mechanics", "harassment", "treaty", "social media", "nash equilibrium", "chemical weapons convention", "repeated game", "artificial intelligence", "computer science", "normal form game", "stochastic game", "political scandal", "coordination game", "foreign policy", "public diplomacy", "obligation", "audit", "wish", "machine learning", "extensive form game", "game theory", "data verification", "economic model", "economic equilibrium"], "abstract": "During the height of the Cold War, between 1965 and 1968, Robert Aumann, Michael Maschler, and Richard Stearns collaborated on research on the dynamics of arms control negotiations that has since become foundational to work on repeated games. These five seminal papers are collected here for the first time, with the addition of \"postscripts\" describing many of the developments since the papers were written. The basic model studied throughout the book is one in which players ignorant about the game being played must learn what they can from the actions of the others. The original work, done under contract to the United States Arms Control and Disarmament Agency, was intended to tackle the gradual disarmament problem, in which neither player knew what his own payoff would be for any given agreement, because of uncertainty about the other side's arsenal and weapons production technology. But the research soon became much more generalized, covering information concealment and revelation, signaling and learning, and related ideas in any repeated competitive situation. The first four chapters of the book treat the competitive zero-sum side of the theory of repeated games. Chapter five takes up cooperative phenomena where one player may want to signal information to another. An extensive bibliography covers all items mentioned in the main text, in the postscripts, and in the introduction. The bibliography also includes a compilation of published papers and books that refer to the original reports.", "citation": "Not cited", "departments": ["Hebrew University of Jerusalem", "Duke University", "Duke University", "Wilfrid Laurier University", "Hebrew University of Jerusalem", "London School of Economics and Political Science", "Hebrew University of Jerusalem", "Tilburg University", "University of t ... biberg, Germany", "Research Center ... Jülich, Germany", "University of t ... biberg, Germany", "Universität der ... ibw‐muenchen.de", "Universität der ... ehr München, UK", "Portland, USA"], "authors": ["Yuan Deng.....http://dblp.org/pers/hd/d/Deng:Yuan", "Vincent Conitzer.....http://dblp.org/pers/hd/c/Conitzer:Vincent"], "conf": "aaai", "year": "2017", "pages": 7}