{"title": "Crowdsourcing spectrum data decoding.", "fields": ["multiplexing", "spectral density", "base station", "radio frequency", "architecture"], "abstract": "Crowdsourced signal monitoring systems are gaining attention for capturing the wireless spectrum at large geographical scale. Yet, most of the current systems are still limited to simple power spectrum measurements reported by each sensor. Our objective is to enhance such systems with signal decoding capabilities performed in the backend while retaining the original vision of a low-cost and crowdsourced setup. We propose a distributed system architecture for collaborative radio signal monitoring and decoding that builds on $12 low-cost radio frequency (RF) frontends and embedded boards and that takes into consideration the limited network bandwidth from the sensors to the backend. We present a distributed time multiplexing mechanism to sample the spectrum in a coordinated fashion that exploits the similarity of the radio signal received by more than one RF frontend in the same radio coverage. We address the strict time synchronization required among sensors to reconstruct the signal from the samples they receive when in the same radio coverage. We study and implement techniques to identify and overcome errors in the timing information in the presence of noise sources and decode the data in the backend. We provide an evaluation based on simulations and on real signals transmitted by Long-Term Evolution (LTE) base stations. Our results show that we can reliably reconstruct and decode radio signals received by low-cost crowdsourced sensors.", "citation": "Citations (3)", "departments": ["IMDEA", "IMDEA", "armasuisse", "IMDEA"], "authors": ["Roberto Calvo-Palomino.....http://dblp.org/pers/hd/c/Calvo=Palomino:Roberto", "Domenico Giustiniano.....http://dblp.org/pers/hd/g/Giustiniano:Domenico", "Vincent Lenders.....http://dblp.org/pers/hd/l/Lenders:Vincent", "Aymen Fakhreddine.....http://dblp.org/pers/hd/f/Fakhreddine:Aymen"], "conf": "infocom", "year": "2017", "pages": 9}