{"title": "Learning Affinity via Spatial Propagation Networks.", "fields": ["filter", "parsing", "pairwise comparison", "feature", "transformation matrix"], "abstract": "In this paper, we propose a spatial propagation networks for learning affinity matrix. We show that by constructing a row/column linear propagation model, the spatially variant transformation matrix constitutes an affinity matrix that models dense, global pairwise similarities of an image. Specifically, we develop a three-way connection for the linear propagation model, which (a) formulates a sparse transformation matrix where all elements can be the output from a deep CNN, but (b) results in a dense affinity matrix that is effective to model any task-specific pairwise similarity. Instead of designing the similarity kernels according to image features of two points, we can directly output all similarities in a pure data-driven manner. The spatial propagation network is a generic framework that can be applied to numerous tasks, which traditionally benefit from designed affinity, e.g., image matting, colorization, and guided filtering, to name a few. Furthermore, the model can also learn semantic-aware affinity for high-level vision tasks due to the learning capability of the deep model. We validate the proposed framework by refinement of object segmentation. Experiments on the HELEN face parsing and PASCAL VOC-2012 semantic segmentation tasks show that the spatial propagation network provides general, effective and efficient solutions for generating high-quality segmentation results.", "citation": "Citations (5)", "year": "2017", "departments": ["Nvidia", "Dalian University of Technology", "University of California, Merced", "Nvidia", "Nvidia"], "conf": "nips", "authors": ["Sifei Liu.....http://dblp.org/pers/hd/l/Liu:Sifei", "Shalini De Mello.....http://dblp.org/pers/hd/m/Mello:Shalini_De", "Jinwei Gu.....http://dblp.org/pers/hd/g/Gu:Jinwei", "Guangyu Zhong.....http://dblp.org/pers/hd/z/Zhong:Guangyu", "Ming-Hsuan Yang.....http://dblp.org/pers/hd/y/Yang_0001:Ming=Hsuan", "Jan Kautz.....http://dblp.org/pers/hd/k/Kautz:Jan"], "pages": 11}