{"title": "SCNN: An Accelerator for Compressed-sparse Convolutional Neural Networks.", "fields": ["dataflow", "operator", "convolutional neural network", "architecture", "artificial neural network"], "abstract": "Convolutional Neural Networks (CNNs) have emerged as a fundamental technology for machine learning. High performance and extreme energy efficiency are critical for deployments of CNNs, especially in mobile platforms such as autonomous vehicles, cameras, and electronic personal assistants. This paper introduces the Sparse CNN (SCNN) accelerator architecture, which improves performance and energy efficiency by exploiting the zero-valued weights that stem from network pruning during training and zero-valued activations that arise from the common ReLU operator. Specifically, SCNN employs a novel dataflow that enables maintaining the sparse weights and activations in a compressed encoding, which eliminates unnecessary data transfers and reduces storage requirements. Furthermore, the SCNN dataflow facilitates efficient delivery of those weights and activations to a multiplier array, where they are extensively reused; product accumulation is performed in a novel accumulator array. On contemporary neural networks, SCNN can improve both performance and energy by a factor of 2.7x and 2.3x, respectively, over a comparably provisioned dense CNN accelerator.", "citation": "Citations (94)", "departments": ["Nvidia", "Nvidia", "Massachusetts Institute of Technology", "University of California, Berkeley", "Nvidia"], "authors": ["Angshuman Parashar.....http://dblp.org/pers/hd/p/Parashar:Angshuman", "Minsoo Rhu.....http://dblp.org/pers/hd/r/Rhu:Minsoo", "Anurag Mukkara.....http://dblp.org/pers/hd/m/Mukkara:Anurag", "Antonio Puglielli.....http://dblp.org/pers/hd/p/Puglielli:Antonio", "Rangharajan Venkatesan.....http://dblp.org/pers/hd/v/Venkatesan:Rangharajan", "Brucek Khailany.....http://dblp.org/pers/hd/k/Khailany:Brucek", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S=", "Stephen W. Keckler.....http://dblp.org/pers/hd/k/Keckler:Stephen_W=", "William J. Dally.....http://dblp.org/pers/hd/d/Dally:William_J="], "conf": "isca", "year": "2017", "pages": 14}