{"title": "AlphaRead: Support Unambiguous Referencing in Remote Collaboration with Readable Object Annotation.", "fields": ["expression", "deixis", "readability", "workspace", "video tracking"], "abstract": "As experts and expertise are increasingly distributed across distance, remote collaboration on physical tasks also becomes popular. Physical collaboration requires collaborators to produce and resolve references to physical objects unambiguously. We present a novel annotation system called AlphaRead that enables users to add and see readable annotations of physical objects, such as labels in letter, in a dynamic video-mediated workspace. Explicit support for object readability can help people coordinate language and vision for collaboration, and allow them to directly read out object labels as a way to make unambiguous references. Object readability as a resource of linguistic references can reduce the ambiguity and complexity associated with traditional methods of referential expressions such as deictic pronouns (\"this\" or \"that\") or descriptions of object attributes. In a video-mediated collaboration study, by making objects referable with readable labels, we improved the communication efficiency over the alternative options of using raw video or video with non-readable annotations to collaborate. We also identified patterns of language behaviors that people exhibited with readable labels and discussed the implications to the design of collaboration support tools.", "citation": "Citations (1)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Yuan-Chia Chang.....http://dblp.org/pers/hd/c/Chang:Yuan=Chia", "Hao-Chuan Wang.....http://dblp.org/pers/hd/w/Wang:Hao=Chuan", "Hung-kuo Chu.....http://dblp.org/pers/hd/c/Chu:Hung=kuo", "Shung-Ying Lin.....http://dblp.org/pers/hd/l/Lin:Shung=Ying", "Shuo-Ping Wang.....http://dblp.org/pers/hd/w/Wang:Shuo=Ping"], "conf": "cscw", "year": "2017", "pages": 14}