{"title": "Knowing Yourself: Improving Video Caption via In-depth Recap.", "fields": ["speech recognition", "wisdom of the crowd", "closed captioning", "multimedia", "natural language"], "abstract": "Generating natural language descriptions for videos (a.k.a video captioning) has attracted much research attention in recent years, and a lot of models have been proposed to improve the caption performance. However, due to the rapid progress in dataset expansion and feature representation, newly proposed caption models have been evaluated on different settings, which makes it unclear about the contributions from either features or models. Therefore, in this work we aim to gain a deep understanding about \"where are we\" for the current development of video captioning. First, we carry out extensive experiments to identify the contribution from different components in video captioning task and make fair comparison among several state-of-the-art video caption models. Second, we discover that these state-of-the-art models are complementary so that we could benefit from \"wisdom of the crowd\" through ensembling and reranking. Finally, we give a preliminary answer to the question \"how far are we from the human-level performance in general'' via a series of carefully designed experiments. In summary, our caption models achieve the state-of-the-art performance on the MSR-VTT 2017 challenge, and it is comparable with the average human-level performance on current caption metrics. However, our analysis also shows that we still have a long way to go, such as further improving the generalization ability of current caption models.", "citation": "Citations (1)", "departments": ["Renmin University of China", "Renmin University of China", "Carnegie Mellon University", "University of Pittsburgh"], "authors": ["Qin Jin.....http://dblp.org/pers/hd/j/Jin:Qin", "Shizhe Chen.....http://dblp.org/pers/hd/c/Chen:Shizhe", "Jia Chen.....http://dblp.org/pers/hd/c/Chen:Jia", "Alexander G. Hauptmann.....http://dblp.org/pers/hd/h/Hauptmann:Alexander_G="], "conf": "mm", "year": "2017", "pages": 6}