{"title": "Rapid one-shot acquisition of dynamic VR avatars.", "fields": ["image warping", "facial motion capture", "computer facial animation", "match moving", "rgb color model"], "abstract": "We present a system for rapid acquisition of bespoke, animatable, full-body avatars including face texture and shape. A blendshape rig with a skeleton is used as a template for customization. Identity blendshapes are used to customize the body and face shape at the fitting stage, while animation blendshapes allow the face to be animated. The subject assumes a T-pose and a single snapshot is captured using a stereo RGB plus depth sensor rig. Our system automatically aligns a photo texture and fits the 3D shape of the face. The body shape is stylized according to body dimensions estimated from segmented depth. The face identity blendweights are optimised according to image-based facial landmarks, while a custom texture map for the face is generated by warping the input images to a reference texture according to the facial landmarks. The total capture and processing time is under 10 seconds and the output is a light-weight, game-engine-ready avatar which is recognizable as the subject. We demonstrate our system in a VR environment in which each user sees the other users' animated avatars through a VR headset with real-time audio-based facial animation and live body motion tracking, affording an enhanced level of presence and social engagement compared to generic avatars.", "citation": "Citations (2)", "departments": ["Disney Research", "Disney Research", "Disney Research", "Disney Research", "Disney Research"], "authors": ["Charles Malleson.....http://dblp.org/pers/hd/m/Malleson:Charles", "Maggie Kosek.....http://dblp.org/pers/hd/k/Kosek:Maggie", "Martin Klaudiny.....http://dblp.org/pers/hd/k/Klaudiny:Martin", "Iván Huerta.....http://dblp.org/pers/hd/h/Huerta:Iv=aacute=n", "Jean Charles Bazin.....http://dblp.org/pers/hd/b/Bazin:Jean_Charles", "Alexander Sorkine-Hornung.....http://dblp.org/pers/hd/s/Sorkine=Hornung:Alexander", "Mark Mine.....http://dblp.org/pers/hd/m/Mine:Mark", "Kenny Mitchell.....http://dblp.org/pers/hd/m/Mitchell:Kenny"], "conf": "vr", "year": "2017", "pages": 10}