{"title": "Popularity Meter: An Influence- and Aesthetics-aware Social Media Popularity Predictor.", "fields": ["ensemble learning", "user profile", "popularity", "affective computing", "metadata"], "abstract": "Social media websites have become an important channel for content sharing and communication between users on social networks. The shared images on the websites, even the ones from the same user, tend to receive a quite diverse distribution of views. This raises the problem of image popularity prediction on social media. To address this important research topic, we explore three essential components that have considerable impact of the image popularity, which are user profile, post metadata, and photo aesthetics. Moreover, we make use of state-of-the-art predictive modeling approaches to demonstrate the effectiveness of our proposed features in predicting image popularity. We then evaluate the proposed method through a large number of real image posts from Flickr. The experimental results show significant statistical evidence that incorporating the proposed features with ensemble learning method that combines predictions from support vector regression (SVR) and classification and regression tree (CART) models offers a satisfactory popularity prediction. By understanding the social behavior and the underlying structure of content popularity, our research results can also contribute to designing better algorithms for important applications like content recommendation and advertisement placement.", "citation": "Not cited", "departments": ["Academia Sinica", "National Taiwan University of Science and Technology", "National Taiwan University of Science and Technology", "National Taiwan University of Science and Technology"], "authors": ["Shintami Chusnul Hidayati.....http://dblp.org/pers/hd/h/Hidayati:Shintami_Chusnul", "Yi-Ling Chen.....http://dblp.org/pers/hd/c/Chen:Yi=Ling", "Chao-Lung Yang.....http://dblp.org/pers/hd/y/Yang:Chao=Lung", "Kai-Lung Hua.....http://dblp.org/pers/hd/h/Hua:Kai=Lung"], "conf": "mm", "year": "2017", "pages": 6}