{"title": "Every pixel counts: Fine-grained UI rendering analysis for mobile applications.", "fields": ["rendering", "android", "humanoid robot", "alternate frame rendering", "performance studies"], "abstract": "For mobile apps, user-perceived delays are critical for user satisfaction. According to our measurement, long delays are commonly caused by network and storage I/O operations while short delays are mainly caused by UI rendering. Short delays are not uncommon, which account for 55.3% in our measurement cases. Previous app performance studies have largely focused on I/O operations but the understanding of UI rendering impact is limited. In this work, we propose DRAW, a system that performs two UI rendering analyses to help app developers pinpoint rendering problems and resolve short delays. The first analysis outlines the wasted rendering time on invisible or covered UI components, namely the overdraw problem. The second analysis is to identify the responsible UI components and rendering operations that cause overall low rendering efficiency. We implement DRAW on Android and apply it to study 1,158 real-world Android apps. Results show that DRAW is helpful as it can pinpoint the responsible UI components and specific rendering operations. Four concrete case studies of real-world apps are further presented to show how DRAW can help developers improve the UI rendering performance of their apps.", "citation": "Not cited", "departments": ["Zhejiang University", "Zhejiang University", "China Mobile", "Zhejiang University", "Zhejiang University"], "authors": ["Yi Gao.....http://dblp.org/pers/hd/g/Gao:Yi", "Yang Luo.....http://dblp.org/pers/hd/l/Luo:Yang", "Daqing Chen.....http://dblp.org/pers/hd/c/Chen:Daqing", "Haocheng Huang.....http://dblp.org/pers/hd/h/Huang:Haocheng", "Wei Dong.....http://dblp.org/pers/hd/d/Dong_0001:Wei", "Mingyuan Xia.....http://dblp.org/pers/hd/x/Xia:Mingyuan", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Jiajun Bu.....http://dblp.org/pers/hd/b/Bu:Jiajun"], "conf": "infocom", "year": "2017", "pages": 9}