{"title": "Algorithmic and optimization aspects of Brascamp-Lieb inequalities, via operator scaling.", "fields": ["convex geometry", "operator", "scaling", "commutative property", "combinatorial optimization"], "abstract": "The celebrated Brascamp-Lieb (BL) inequalities [BL76, Lie90], and their reverse form of Barthe [Bar98], are an important mathematical tool, unifying and generalizing numerous in- equalities in analysis, convex geometry and information theory, with many used in computer science. While their structural theory is very well understood, far less is known about computing their main parameters below (which we later define). Prior to this work, the best known algorithms for any of these optimization tasks required at least exponential time. In this work, we give polynomial time algorithms to compute:     (1) Feasibility of BL-datum,     (2) Optimal BL- constant,     (3) Weak separation oracle for BL-polytopes.     What is particularly exciting about this progress, beyond the better understanding of BL- inequalities, is that the objects above naturally encode rich families of optimization problems which had no prior efficient algorithms. In particular, the BL-constants (which we efficiently compute) are solutions to non-convex optimization problems, and the BL-polytopes (for which we provide efficient membership and separation oracles) are linear programs with exponentially many facets. Thus we hope that new combinatorial optimization problems can be solved via reductions to the ones above, and make modest initial steps in exploring this possibility.     Our algorithms are obtained by a simple efficient reduction of a given BL-datum to an instance of the Operator Scaling problem defined by [Gur04]. To obtain the results above, we utilize the two (very recent and different) algorithms for the operator scaling problem [GGOW16, IQS15a]. Our reduction implies algorithmic versions of many of the known structural results on BL-inequalities, and in some cases provide proofs that are different or simpler than existing ones. Further, the analytic properties of the [GGOW16] algorithm provide new, effective bounds on the magnitude and continuity of BL-constants, with applications to non-linear versions of BL-inequalities; prior work relied on compactness, and thus provided no bounds.     On a higher level, our application of operator scaling algorithm to BL-inequalities further connects analysis and optimization with the diverse mathematical areas used so far to mo- tivate and solve the operator scaling problem, which include commutative invariant theory, non-commutative algebra, computational complexity and quantum information theory.", "citation": "Citations (11)", "year": "2017", "departments": ["Microsoft", "City College of New York", "Princeton University", "Microsoft", "City College of New York", "Princeton University", "IAS, USA", "Institute for Advanced Study"], "conf": "stoc", "authors": ["Ankit Garg.....http://dblp.org/pers/hd/g/Garg:Ankit", "Leonid Gurvits.....http://dblp.org/pers/hd/g/Gurvits:Leonid", "Rafael Mendes de Oliveira.....http://dblp.org/pers/hd/o/Oliveira:Rafael_Mendes_de", "Avi Wigderson.....http://dblp.org/pers/hd/w/Wigderson:Avi"], "pages": 13}