{"title": "RFlow", "fields": ["geotechnical engineering", "real time computing", "testbed", "telecommunications", "geography", "openflow", "breakup", "geology", "accuracy and precision", "distributed computing", "workflow", "mac flooding", "geophysics", "time of flight", "training set", "sflow", "radio frequency", "activity recognition", "robustness", "limiting", "nuclear magnetic resonance", "chemistry", "coalescence", "gesture"], "abstract": "In this work, we propose an SDN-based WLAN monitoring and management framework called RFlow +  to address WiFi service dissatisfaction caused by the limited view (lack of scalability) of network traffic monitoring and absence of intelligent and timely network treatments. Existing solutions (e.g., OpenFlow and sFlow) have limited view, no generic flow description, and poor trade-off between measurement accuracy and network overhead depending on the selection of the sampling rate. To resolve these issues, we devise a two-level counting mechanism, namely a distributed local counter (on-site and real-time) and central collector (a summation of local counters). With this, we proposed a highly scalable monitoring and management framework to handle immediate actions based on short-term (e.g., 50 ms) monitoring and eventual actions based on long-term (e.g., 1 month) monitoring. The former uses the local view of each access point (AP), and the latter uses the global view of the collector. Experimental results verify that RFlow +  can achieve high accuracy (less than 5% standard error for short-term and less than 1% for long-term) and fast detection of flows of interest (within 23 ms) with manageable network overhead. We prove the practicality of RFlow +  by showing the effectiveness of a MAC flooding attacker quarantine in a real-world testbed.", "citation": "Not cited", "departments": ["Inha University", "Inha University", "Inha University", "Inha University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Michigan Statue ... ansing, MI, USA"], "authors": ["RhongHo Jang.....http://dblp.org/pers/hd/j/Jang:RhongHo", "DongGyu Cho.....http://dblp.org/pers/hd/c/Cho:DongGyu", "Youngtae Noh.....http://dblp.org/pers/hd/n/Noh:Youngtae", "DaeHun Nyang.....http://dblp.org/pers/hd/n/Nyang:DaeHun"], "conf": "infocom", "year": "2017", "pages": 9}