{"title": "Feedback-Aware Social Event-Participant Arrangement.", "fields": ["login", "linear combination", "social network", "thompson sampling", "machine learning"], "abstract": "Online event-based social networks (EBSNs) and studies on global event-participant arrangement strategies for EBSNs are becoming popular recently. Existing works measure satisfaction of an arrangement by a linear combination of few factors, weights of which are predefined and fixed, and do not allow users to provide feedbacks on whether accepting the arrangement or not. Besides, most of them only consider offline scenarios, where full information of users is known in advance. However, on real-world EBSN platforms, users can dynamically log in the platform and register for events on a first come, first served basis. In other words, online scenarios of event-participant arrangement strategies should be considered. In this work, we study a new event-participant arrangement strategy for online scenarios, the Feedback-Aware Social Event-participant Arrangement (FASEA) problem, where satisfaction scores of an arrangement are learned adaptively and users can choose to accept or reject the arranged events. Particularly, we model the problem as a contextual combinatorial bandit setting and use efficient and effective algorithms to solve the problem. The effectiveness and efficiency of the solutions are evaluated with extensive experimental studies and our findings indicate that the state-of-the-art Thompson Sampling that is reported to work well under basic multi-armed bandit does not perform well under FASEA.", "citation": "Citations (3)", "year": "2017", "departments": ["Hong Kong University of Science and Technology", "Beihang University", "Hong Kong University of Science and Technology", "Beihang University"], "conf": "sigmod", "authors": ["Jieying She.....http://dblp.org/pers/hd/s/She:Jieying", "Yongxin Tong.....http://dblp.org/pers/hd/t/Tong:Yongxin", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Tianshu Song.....http://dblp.org/pers/hd/s/Song:Tianshu"], "pages": 15}