{"title": "Acoustic VR in the mouth: A real-time speech-driven visual tongue system.", "fields": ["tongue", "animation", "language production", "frame rate", "electromagnetic articulography"], "abstract": "We propose an acoustic-VR system that converts acoustic signals of human language (Chinese) to realistic 3D tongue animation sequences in real time. It is known that directly capturing the 3D geometry of the tongue at a frame rate that matches the tongue's swift movement during the language production is challenging. This difficulty is handled by utilizing the electromagnetic articulography (EMA) sensor as the intermediate medium linking the acoustic data to the simulated virtual reality. We leverage Deep Neural Networks to train a model that maps the input acoustic signals to the positional information of pre-defined EMA sensors based on 1,108 utterances. Afterwards, we develop a novel reduced physics-based dynamics model for simulating the tongue's motion. Unlike the existing methods, our deformable model is nonlinear, volume-preserving, and accommodates collision between the tongue and the oral cavity (mostly with the jaw). The tongue's deformation could be highly localized which imposes extra difficulties for existing spectral model reduction methods. Alternatively, we adopt a spatial reduction method that allows an expressive subspace representation of the tongue's deformation. We systematically evaluate the simulated tongue shapes with real-world shapes acquired by MRI/CT. Our experiment demonstrates that the proposed system is able to deliver a realistic visual tongue animation corresponding to a user's speech signal.", "citation": "Not cited", "departments": ["University of New Mexico", "Chinese Academy of Social Sciences", "Tianjin University", "Tianjin University", "Zhejiang University"], "authors": ["Ran Luo.....http://dblp.org/pers/hd/l/Luo:Ran", "Qiang Fang.....http://dblp.org/pers/hd/f/Fang:Qiang", "Jianguo Wei.....http://dblp.org/pers/hd/w/Wei:Jianguo", "Wenhuan Lu.....http://dblp.org/pers/hd/l/Lu:Wenhuan", "Weiwei Xu.....http://dblp.org/pers/hd/x/Xu:Weiwei", "Yin Yang.....http://dblp.org/pers/hd/y/Yang:Yin"], "conf": "vr", "year": "2017", "pages": 10}