{"title": "The TypTop System: Personalized Typo-Tolerant Password Checking.", "fields": ["world wide web", "zero knowledge password proof", "password strength", "microsoft office password protection", "computer science", "password", "salt", "cognitive password"], "abstract": "Password checking systems traditionally allow login only if the correct password is submitted. Recent work on typo-tolerant password checking suggests that usability can be improved, with negligible security loss, by allowing a small number of typographical errors. Existing systems, however, can only correct a handful of errors, such as accidentally leaving caps lock on or incorrect capitalization of the first letter in a password. This leaves out numerous kinds of typos made by users, such as transposition errors, substitutions, or capitalization errors elsewhere in a password. Some users therefore receive no benefit from existing typo-tolerance mechanisms.   We introduce personalized typo-tolerant password checking. In our approach, the authentication system learns over time the typos made by a specific user. In experiments using Mechanical Turk, we show that 45% of users would benefit from personalization. Therefore, we design a system, called TypTop, that securely implements personalized typo-tolerance. Underlying TypTop is a new stateful password-based encryption scheme that can be used to store recent failed login attempts. Our formal analysis shows that security in the face of an attacker that obtains the state of the system reduces to the difficulty of a brute-force dictionary attack against the real password. We implement TypTop for Linux and Mac OS login and report on a proof-of-concept deployment.", "citation": "Not cited", "year": "2017", "departments": ["Cornell University", "Royal Holloway, University of London", "Technion – Israel Institute of Technology", "Cornell University", "Cornell University"], "conf": "ccs", "authors": ["Rahul Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Rahul", "Joanne Woodage.....http://dblp.org/pers/hd/w/Woodage:Joanne", "Yuval Pnueli.....http://dblp.org/pers/hd/p/Pnueli:Yuval", "Anusha Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Anusha", "Thomas Ristenpart.....http://dblp.org/pers/hd/r/Ristenpart:Thomas"], "pages": 18}