{"title": "Understanding error propagation in deep learning neural network (DNN) accelerators and applications.", "fields": ["soft error", "deep learning", "triple modular redundancy", "data type", "propagation of uncertainty"], "abstract": "Deep learning neural networks (DNNs) have been successful in solving a wide range of machine learning problems. Specialized hardware accelerators have been proposed to accelerate the execution of DNN algorithms for high-performance and energy efficiency. Recently, they have been deployed in datacenters (potentially for business-critical or industrial applications) and safety-critical systems such as self-driving cars. Soft errors caused by high-energy particles have been increasing in hardware systems, and these can lead to catastrophic failures in DNN systems. Traditional methods for building resilient systems, e.g., Triple Modular Redundancy (TMR), are agnostic of the DNN algorithm and the DNN accelerator's architecture. Hence, these traditional resilience approaches incur high overheads, which makes them challenging to deploy. In this paper, we experimentally evaluate the resilience characteristics of DNN systems (i.e., DNN software running on specialized accelerators). We find that the error resilience of a DNN system depends on the data types, values, data reuses, and types of layers in the design. Based on our observations, we propose two efficient protection techniques for DNN systems.", "citation": "Citations (3)", "year": "2017", "departments": ["University of British Columbia", "Nvidia", "Nvidia", "Nvidia", "University of British Columbia"], "conf": "sc", "authors": ["Guanpeng Li.....http://dblp.org/pers/hd/l/Li:Guanpeng", "Siva Kumar Sastry Hari.....http://dblp.org/pers/hd/h/Hari:Siva_Kumar_Sastry", "Michael B. Sullivan.....http://dblp.org/pers/hd/s/Sullivan:Michael_B=", "Timothy Tsai.....http://dblp.org/pers/hd/t/Tsai:Timothy", "Karthik Pattabiraman.....http://dblp.org/pers/hd/p/Pattabiraman:Karthik", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S=", "Stephen W. Keckler.....http://dblp.org/pers/hd/k/Keckler:Stephen_W="], "pages": 12}