{"title": "Multi-Modal Localization and Enhancement of Multiple Sound Sources from a Micro Aerial Vehicle.", "fields": ["camera resectioning", "direction of arrival", "video camera", "sound recording and reproduction", "microphone array"], "abstract": "The ego-noise generated by the motors and propellers of a micro aerial vehicle (MAV) masks the environmental sounds and considerably degrades the quality of the on-board sound recording. Sound enhancement approaches generally require knowledge of the direction of arrival of the target sound sources, which are difficult to estimate due to the low signal-to-noise-ratio (SNR) caused by the ego-noise and the interferences between multiple sources. To address this problem, we propose a multi-modal analysis approach that jointly exploits audio and video to enhance the sounds of multiple targets captured from an MAV equipped with a microphone array and a video camera. We first address audio-visual calibration via camera resectioning, audio-visual temporal alignment and geometrical alignment to jointly use the features in the audio and video streams, which are independently generated. The spatial information from the video is used to assist sound enhancement by tracking multiple potential sound sources with a particle filter. Then we infer the directions of arrival of the target sources from the video tracking results and extract the sound from the desired direction with a time-frequency spatial filter, which suppresses the ego-noise by exploiting its time-frequency sparsity. Experimental demonstration results with real outdoor data verify the robustness of the proposed multi-modal approach for multiple speakers in extremely low-SNR scenarios.", "citation": "Not cited", "departments": ["Queen Mary University of London", "Queen Mary University of London", "Queen Mary University of London"], "authors": ["Ricardo Sanchez-Matilla.....http://dblp.org/pers/hd/s/Sanchez=Matilla:Ricardo", "Lin Wang.....http://dblp.org/pers/hd/w/Wang_0009:Lin", "Andrea Cavallaro.....http://dblp.org/pers/hd/c/Cavallaro:Andrea"], "conf": "mm", "year": "2017", "pages": 9}