{"title": "XSearch: a domain-specific cross-language relevant question retrieval tool.", "fields": ["computer science", "information retrieval", "stack overflow", "knowledge base", "software development process"], "abstract": "During software development process, Chinese developers often seek solutions to the technical problems they encounter by searching relevant questions on Q&A sites. When developers fail to find solutions on Q&A sites in Chinese, they could translate their query and search on the English Q&A sites. However, Chinese developers who are non-native English speakers often are not comfortable to ask or search questions in English, as they do not know the proper translation of the Chinese technical words into the English technical words. Furthermore, the process of manually formulating cross-language queries and determining the importance of query words is a tedious and time-consuming process. For the purpose of helping Chinese developers take advantages of the rich knowledge base of the English version of Stack Overflow and simplify the retrieval process, we propose an automated cross-language relevant question retrieval tool (XSearch) to retrieve relevant English questions on Stack Overflow for a given Chinese question. This tool can address the increasing need for developer to solve technical problems by retrieving cross-language relevant Q&A resources. Demo Tool Website: http://172.93.36.10:8080/XSearch Demo Video: https://goo.gl/h57sed", "citation": "Citations (3)", "departments": ["Zhejiang University", "Australian National University", "University of British Columbia", "Singapore Management University", "Singapore Management University"], "authors": ["Bowen Xu.....http://dblp.org/pers/hd/x/Xu:Bowen", "Zhenchang Xing.....http://dblp.org/pers/hd/x/Xing:Zhenchang", "Xin Xia.....http://dblp.org/pers/hd/x/Xia:Xin", "David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David", "Xuan-Bach D. Le.....http://dblp.org/pers/hd/l/Le:Xuan=Bach_D="], "conf": "sigsoft", "year": "2017", "pages": 5}