{"title": "A Unified Game-Theoretic Approach to Multiagent Reinforcement Learning.", "fields": ["overfitting", "oracle", "best response", "fictitious play", "generality"], "abstract": "There has been a resurgence of interest in multiagent reinforcement learning (MARL), due partly to the recent success of deep neural networks. The simplest form of MARL is independent reinforcement learning (InRL), where each agent treats all of its experience as part of its (non stationary) environment. In this paper, we first observe that policies learned using InRL can overfit to the other agents' policies during training, failing to sufficiently generalize during execution. We introduce a new metric, joint-policy correlation, to quantify this effect. We describe a meta-algorithm for general MARL, based on approximate best responses to mixtures of policies generated using deep reinforcement learning, and empirical game theoretic analysis to compute meta-strategies for policy selection. The meta-algorithm generalizes previous algorithms such as InRL, iterated best response, double oracle, and fictitious play. Then, we propose a scalable implementation which reduces the memory requirement using decoupled meta-solvers. Finally, we demonstrate the generality of the resulting policies in three partially observable settings: gridworld coordination problems, emergent language games, and poker.", "citation": "Citations (7)", "year": "2017", "departments": ["Google", "Google", "DeepMind", "DeepMind", "DeepMind"], "conf": "nips", "authors": ["Marc Lanctot.....http://dblp.org/pers/hd/l/Lanctot:Marc", "Vinícius Flores Zambaldi.....http://dblp.org/pers/hd/z/Zambaldi:Vin=iacute=cius_Flores", "Audrunas Gruslys.....http://dblp.org/pers/hd/g/Gruslys:Audrunas", "Angeliki Lazaridou.....http://dblp.org/pers/hd/l/Lazaridou:Angeliki", "Karl Tuyls.....http://dblp.org/pers/hd/t/Tuyls:Karl", "Julien Pérolat.....http://dblp.org/pers/hd/p/P=eacute=rolat:Julien", "David Silver.....http://dblp.org/pers/hd/s/Silver:David", "Thore Graepel.....http://dblp.org/pers/hd/g/Graepel:Thore"], "pages": 14}