{"title": "BProVe: a formal verification framework for business process models.", "fields": ["business process management", "artifact centric business process model", "software verification", "business process model and notation", "functional verification"], "abstract": "Business Process Modelling has acquired increasing relevance in software development. Available notations, such as BPMN, permit to describe activities of complex organisations. On the one hand, this shortens the communication gap between domain experts and IT specialists. On the other hand, this permits to clarify the characteristics of software systems introduced to provide automatic support for such activities. Nevertheless, the lack of formal semantics hinders the automatic verification of relevant properties. This paper presents a novel verification framework for BPMN 2.0, called BProVe. It is based on an operational semantics, implemented using MAUDE, devised to make the verification general and effective. A complete tool chain, based on the Eclipse modelling environment, allows for rigorous modelling and analysis of Business Processes. The approach has been validated using more than one thousand models available on a publicly accessible repository. Besides showing the performance of BProVe, this validation demonstrates its practical benefits in identifying correctness issues in real models.", "citation": "Citations (5)", "departments": ["University of Camerino", "University of Camerino", "University of Camerino", "University of Camerino", "University of Camerino"], "authors": ["Flavio Corradini.....http://dblp.org/pers/hd/c/Corradini:Flavio", "Fabrizio Fornari.....http://dblp.org/pers/hd/f/Fornari:Fabrizio", "Andrea Polini.....http://dblp.org/pers/hd/p/Polini:Andrea", "Barbara Re.....http://dblp.org/pers/hd/r/Re_0001:Barbara", "Francesco Tiezzi.....http://dblp.org/pers/hd/t/Tiezzi:Francesco", "Andrea Vandin.....http://dblp.org/pers/hd/v/Vandin:Andrea"], "conf": "kbse", "year": "2017", "pages": 12}