{"title": "Enriching Complex Networks with Word Embeddings for Detecting Mild Cognitive Impairment from Speech Transcripts.", "fields": ["binary classification", "transcription", "parsing", "bag of words model", "word embedding"], "abstract": "Mild Cognitive Impairment (MCI) is a mental disorder difficult to diagnose. Linguistic features, mainly from parsers, have been used to detect MCI, but this is not suitable for large-scale assessments. MCI disfluencies produce non-grammatical speech that requires manual or high precision automatic correction of transcripts. In this paper, we modeled transcripts into complex networks and enriched them with word embedding (CNE) to better represent short texts produced in neuropsychological assessments. The network measurements were applied with well-known classifiers to automatically identify MCI in transcripts, in a binary classification task. A comparison was made with the performance of traditional approaches using Bag of Words (BoW) and linguistic features for three datasets: DementiaBank in English, and Cinderella and Arizona-Battery in Portuguese. Overall, CNE provided higher accuracy than using only complex networks, while Support Vector Machine was superior to other classifiers. CNE provided the highest accuracies for DementiaBank and Cinderella, but BoW was more efficient for the Arizona-Battery dataset probably owing to its short narratives. The approach using linguistic features yielded higher accuracy if the transcriptions of the Cinderella dataset were manually revised. Taken together, the results indicate that complex networks enriched with embedding is promising for detecting MCI in large-scale assessments", "citation": "Citations (1)", "year": "2017", "departments": ["University of São Paulo", "University of São Paulo", "University of São Paulo", "University of São Paulo"], "conf": "acl", "authors": ["Leandro Borges dos Santos.....http://dblp.org/pers/hd/s/Santos:Leandro_Borges_dos", "Edilson Anselmo Corrêa Júnior.....http://dblp.org/pers/hd/j/J=uacute=nior:Edilson_Anselmo_Corr=ecirc=a", "Osvaldo N. Oliveira Jr......http://dblp.org/pers/hd/o/Oliveira_Jr=:Osvaldo_N=", "Diego R. Amancio.....http://dblp.org/pers/hd/a/Amancio:Diego_R=", "Leticia Lessa Mansur.....http://dblp.org/pers/hd/m/Mansur:Leticia_Lessa", "Sandra M. Aluísio.....http://dblp.org/pers/hd/a/Alu=iacute=sio:Sandra_M="], "pages": 13}