{"title": "Modeling and analyzing the influence of chunk size variation on bitrate adaptation in DASH.", "fields": ["dash", "average bitrate", "variable bitrate", "dynamic adaptive streaming over http", "constant bitrate"], "abstract": "Recently, HTTP-based adaptive video streaming has been widely adopted in the Internet. Up to now, HTTP-based adaptive video streaming is standardized as Dynamic Adaptive Streaming over HTTP (DASH), where a client-side video player can dynamically pick the bitrate level according to the perceived network conditions. Actually, not only the available bandwidth is varying, but also the chunk sizes in the same bitrate level significantly fluctuate, which also influences the bitrate adaptation. However, existing bitrate adaptation algorithms do not accurately involve the chunk size variation, leading to performance losses. In this paper, we theoretically analyze the influence of chunk size variation on bitrate adaptation performance. Based on DASH system features, we build a general model describing the playback buffer evolution. Applying stochastic theories, we respectively analyze the influence of the chunk size variation on rebuffering probability and average bitrate level. Furthermore, based on theoretical insights, we provide several recommendations for algorithm designing and rate encoding, and also propose a simple bitrate adaptation algorithm. Extensive simulations verify our insights as well as the efficiency of the proposed recommendations and algorithm.", "citation": "Citations (1)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Tong Zhang.....http://dblp.org/pers/hd/z/Zhang_0018:Tong", "Fengyuan Ren.....http://dblp.org/pers/hd/r/Ren:Fengyuan", "Wenxue Cheng.....http://dblp.org/pers/hd/c/Cheng:Wenxue", "Xiaohui Luo.....http://dblp.org/pers/hd/l/Luo:Xiaohui", "Ran Shu.....http://dblp.org/pers/hd/s/Shu:Ran", "Xiaolan Liu.....http://dblp.org/pers/hd/l/Liu:Xiaolan"], "conf": "infocom", "year": "2017", "pages": 9}