{"title": "POISED: Spotting Twitter Spam Off the Beaten Paths.", "fields": ["spambot", "sping", "forum spam", "adversarial machine learning", "social spam"], "abstract": "Cybercriminals have found in online social networks a propitious medium to spread spam and malicious content. Existing techniques for detecting spam include predicting the trustworthiness of accounts and analyzing the content of these messages. However, advanced attackers can still successfully evade these defenses.   Online social networks bring people who have personal connections or share common interests to form communities. In this paper, we first show that users within a networked community share some topics of interest. Moreover, content shared on these social network tend to propagate according to the interests of people. Dissemination paths may emerge where some communities post similar messages, based on the interests of those communities. Spam and other malicious content, on the other hand, follow different spreading patterns.   In this paper, we follow this insight and present POISED, a system that leverages the differences in propagation between benign and malicious messages on social networks to identify spam and other unwanted content. We test our system on a dataset of 1.3M tweets collected from 64K users, and we show that our approach is effective in detecting malicious messages, reaching 91% precision and 93% recall. We also show that POISED's detection is more comprehensive than previous systems, by comparing it to three state-of-the-art spam detection systems that have been proposed by the research community in the past. POISED significantly outperforms each of these systems. Moreover, through simulations, we show how POISED is effective in the early detection of spam messages and how it is resilient against two well-known adversarial machine learning attacks.", "citation": "Citations (1)", "year": "2017", "departments": ["University of California, Santa Barbara", "École Polytechnique de Montréal", "École Polytechnique de Montréal", "University of California, Santa Barbara", "École Polytechnique de Montréal"], "conf": "ccs", "authors": ["Shirin Nilizadeh.....http://dblp.org/pers/hd/n/Nilizadeh:Shirin", "Francois Labreche.....http://dblp.org/pers/hd/l/Labreche:Francois", "Alireza Sedighian.....http://dblp.org/pers/hd/s/Sedighian:Alireza", "Ali Zand.....http://dblp.org/pers/hd/z/Zand:Ali", "José M. Fernandez.....http://dblp.org/pers/hd/f/Fernandez:Jos=eacute=_M=", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Gianluca Stringhini.....http://dblp.org/pers/hd/s/Stringhini:Gianluca", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "pages": 16}