{"title": "Adaptive stimulus selection for optimizing neural population responses.", "fields": ["stimulus", "visual processing", "neuron", "convolutional neural network", "sensory system"], "abstract": "Adaptive stimulus selection methods in neuroscience have primarily focused on maximizing the firing rate of a single recorded neuron. When recording from a population of neurons, it is usually not possible to find a single stimulus that maximizes the firing rates of all neurons. This motivates optimizing an objective function that takes into account the responses of all recorded neurons together. We propose “Adept,” an adaptive stimulus selection method that can optimize population objective functions. In simulations, we first confirmed that population objective functions elicited more diverse stimulus responses than single-neuron objective functions. Then, we tested Adept in a closed-loop electrophysiological experiment in which population activity was recorded from macaque V4, a cortical area known for mid-level visual processing. To predict neural responses, we used the outputs of a deep convolutional neural network model as feature embeddings. Images chosen by Adept elicited mean neural responses that were 20% larger than those for randomly-chosen natural images, and also evoked a larger diversity of neural responses. Such adaptive stimulus selection methods can facilitate experiments that involve neurons far from the sensory periphery, for which it is often unclear which stimuli to present.", "citation": "Not cited", "year": "2017", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "University of Pittsburgh", "University of Pittsburgh", "Carnegie Mellon University"], "conf": "nips", "authors": ["Benjamin R. Cowley.....http://dblp.org/pers/hd/c/Cowley:Benjamin_R=", "Ryan C. Williamson.....http://dblp.org/pers/hd/w/Williamson:Ryan_C=", "Katerina Clemens.....http://dblp.org/pers/hd/c/Clemens:Katerina", "Matthew A. Smith.....http://dblp.org/pers/hd/s/Smith:Matthew_A=", "Byron M. Yu.....http://dblp.org/pers/hd/y/Yu:Byron_M="], "pages": 11}