{"title": "Predicting Human Intentions from Motion Cues Only: A 2D+3D Fusion Approach.", "fields": ["motion capture", "multimodal therapy", "kinematics", "fusion", "video processing"], "abstract": "In this paper, we address the new problem of the prediction of human intentions. There is neuro-psychological evidence that actions performed by humans are anticipated by peculiar motor acts which are discriminant of the type of action going to be performed afterwards. In other words, an actual intention can be forecast by looking at the kinematics of the immediately preceding movement. To prove it in a computational and quantitative manner, we devise a new experimental setup where, without using contextual information, we predict human intentions all originating from the same motor act. We posit the problem as a classification task and we introduce a new multi-modal dataset consisting of a set of motion capture marker 3D data and 2D video sequences, where, by only analysing very similar movements in both training and test phases, we are able to predict the underlying intention, i.e., the future, never observed action. We also present an extensive experimental evaluation as a baseline, customizing state-of-the-art techniques for either 3D and 2D data analysis. Realizing that video processing methods lead to inferior performance but show complementary information with respect to 3D data sequences, we developed a 2D+3D fusion analysis where we achieve better classification accuracies, attesting the superiority of the multimodal approach for the context-free prediction of human intentions.", "citation": "Not cited", "departments": ["University of Genoa", "University of Genoa", "Istituto Italiano di Tecnologia", "Istituto Italiano di Tecnologia", "Istituto Italiano di Tecnologia"], "authors": ["Andrea Zunino.....http://dblp.org/pers/hd/z/Zunino:Andrea", "Jacopo Cavazza.....http://dblp.org/pers/hd/c/Cavazza:Jacopo", "Atesh Koul.....http://dblp.org/pers/hd/k/Koul:Atesh", "Andrea Cavallo.....http://dblp.org/pers/hd/c/Cavallo:Andrea", "Cristina Becchio.....http://dblp.org/pers/hd/b/Becchio:Cristina", "Vittorio Murino.....http://dblp.org/pers/hd/m/Murino:Vittorio"], "conf": "mm", "year": "2017", "pages": 9}