{"title": "A resource-aware and time-critical IoT framework.", "fields": ["cloud computing", "streams", "scalability", "data stream mining", "low latency"], "abstract": "Internet of Things (IoT) systems produce great amount of data, but usually have insufficient resources to process them in the edge. Several time-critical IoT scenarios have emerged and created a challenge of supporting low latency applications. At the same time cloud computing became a success in delivering computing as a service at affordable price with great scalability and high reliability. We propose an intelligent resource allocation system that optimally selects the important IoT data streams to transfer to the cloud for processing. The optimization runs on utility functions computed by predictor algorithms that forecast future events with some probabilistic confidence based on a dynamically recalculated data model. We investigate ways of reducing specifically the upload bandwidth of IoT video streams and propose techniques to compute the corresponding utility functions. We built a prototype for a smart squash court and simulated multiple courts to measure the efficiency of dynamic allocation of network and cloud resources for event detection during squash games. By continuously adapting to the observed system state and maximizing the expected quality of detection within the resource constraints our system can save up to 70% of the resources compared to the naive solution.", "citation": "Not cited", "departments": ["Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Ericsson", "Ericsson"], "authors": ["László Toka.....http://dblp.org/pers/hd/t/Toka:L=aacute=szl=oacute=", "Balázs Lajtha.....http://dblp.org/pers/hd/l/Lajtha:Bal=aacute=zs", "Éva Hosszu.....http://dblp.org/pers/hd/h/Hosszu:=Eacute=va", "Bence Formanek.....http://dblp.org/pers/hd/f/Formanek:Bence", "Daniel Gehberger.....http://dblp.org/pers/hd/g/Gehberger:Daniel", "János Tapolcai.....http://dblp.org/pers/hd/t/Tapolcai:J=aacute=nos"], "conf": "infocom", "year": "2017", "pages": 9}