{"title": "Post-Quantum Zero-Knowledge and Signatures from Symmetric-Key Primitives.", "fields": ["random oracle", "symmetric key algorithm", "quantum", "ring signature", "zero knowledge proof", "discrete mathematics", "post quantum cryptography", "mathematics"], "abstract": "We propose a new class of  post-quantum  digital signature schemes that: (a) derive their security entirely from the security of symmetric-key primitives, believed to be quantum-secure, and (b) have extremely small keypairs, and, (c) are highly parameterizable.   In our signature constructions, the public key is an image  y = f ( x ) of a one-way function  f  and secret key  x . A signature is a non-interactive zero-knowledge proof of  x , that incorporates a message to be signed. For this proof, we leverage recent progress of Giacomelli et al. (USENIX'16) in constructing an efficient Σ-protocol for statements over general circuits. We improve this Σ-protocol to reduce proof sizes by a factor of two, at no additional computational cost. While this is of independent interest as it yields more compact proofs for any circuit, it also decreases our signature sizes.   We consider two possibilities to make the proof non-interactive: the Fiat-Shamir transform and Unruh's transform (EUROCRYPT'12, '15,'16). The former has smaller signatures, while the latter has a security analysis in the quantum-accessible random oracle model. By customizing Unruh's transform to our application, the overhead is reduced to 1.6x when compared to the Fiat-Shamir transform, which does not have a rigorous post-quantum security analysis.   We implement and benchmark both approaches and explore the possible choice of  f , taking advantage of the recent trend to strive for practical symmetric ciphers with a particularly low number of multiplications and end up using Low MC (EUROCRYPT'15).", "citation": "Not cited", "year": "2017", "departments": ["Microsoft", "Graz University of Technology", "Princeton University", "Aarhus University", "Graz University of Technology"], "conf": "ccs", "authors": ["Melissa Chase.....http://dblp.org/pers/hd/c/Chase:Melissa", "David Derler.....http://dblp.org/pers/hd/d/Derler:David", "Steven Goldfeder.....http://dblp.org/pers/hd/g/Goldfeder:Steven", "Claudio Orlandi.....http://dblp.org/pers/hd/o/Orlandi:Claudio", "Sebastian Ramacher.....http://dblp.org/pers/hd/r/Ramacher:Sebastian", "Christian Rechberger.....http://dblp.org/pers/hd/r/Rechberger:Christian", "Daniel Slamanig.....http://dblp.org/pers/hd/s/Slamanig:Daniel", "Greg Zaverucha.....http://dblp.org/pers/hd/z/Zaverucha:Greg"], "pages": 18}