{"title": "WOLoc: WiFi-only outdoor localization using crowdsensed hotspot labels.", "fields": ["computer network", "distributed computing", "crowdsensing", "nonlinear dimensionality reduction", "hotspot"], "abstract": "Given the ever-expanding scale of WiFi deployments in metropolitan areas, we have reached the point where accurate GPS-free outdoor localization becomes possible by relying solely on the WiFi infrastructure. Nevertheless, the existing industrial practices do not seem to have the right implementation to achieve an adequate accuracy, while the academic researches that are mostly attracted by indoor localization have largely neglected this outdoor aspect. In this paper, we propose WOLoc (WiFi-only Outdoor Localization) as a solution that offers meter-level accuracy, by holistically treating the large number of WiFi hotspot labels gather by crowdsensing. On one hand, we do not take these labels as fingerprints as it is almost impossible to extend indoor localization mechanisms by fingerprinting metropolitan areas. On the other hand, we avoid the over-simplified local synthesis methods (e.g., centroid) that significantly lose the information contained in the labels. Instead, we accommodate all the labeled and unlabeled data for a given area using a semi-supervised manifold learning technique, and the output concerning the unlabeled part will become the estimated locations for both users and WiFi hotspots. We conduct extensive experiments with WOLoc in several outdoor areas, and the results have strongly indicated the efficacy of our solution.", "citation": "Citations (6)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Jin Wang.....http://dblp.org/pers/hd/w/Wang:Jin", "Nicholas Tan.....http://dblp.org/pers/hd/t/Tan:Nicholas", "Jun Luo.....http://dblp.org/pers/hd/l/Luo:Jun", "Sinno Jialin Pan.....http://dblp.org/pers/hd/p/Pan:Sinno_Jialin"], "conf": "infocom", "year": "2017", "pages": 9}