{"title": "A study on the use of an immersive virtual reality store to investigate consumer perceptions and purchase behavior toward non-standard fruits and vegetables.", "fields": ["immersion", "market research", "virtual reality", "hypermarket", "simulation"], "abstract": "In this paper we present an immersive virtual reality user study aimed at investigating how customers perceive and if they would purchase non-standard (i.e. misshaped) fruits and vegetables (FaVs) in supermarkets and hypermarkets. Indeed, food waste is a major issue for the retail sector and a recent trend is to reduce it by selling non-standard goods. An important question for retailers relates to the FaVs' “level of abnormality” that consumers would agree to buy. However, this question cannot be tackled using “classical” marketing techniques that perform user studies within real shops since fresh produce such as FaVs tend to rot rapidly preventing studies to be repeatable or to be run for a long time. In order to overcome those limitations, we created a virtual grocery store with a fresh FaVs section where 142 participants were immersed using an Oculus Rift DK2 HMD. Participants were presented either “normal”, “slightly misshaped”, “misshaped” or “severely misshaped” FaVs. Results show that participants tend to purchase a similar number of FaVs whatever their deformity. Nevertheless participants' perceptions of the quality of the FaV depend on the level of abnormality.", "citation": "Citations (3)", "departments": ["École centrale de Nantes", "École centrale de Nantes", "École centrale de Nantes", "Audencia Busine ...  Nantes, France"], "authors": ["Adrien Verhulst.....http://dblp.org/pers/hd/v/Verhulst:Adrien", "Jean-Marie Normand.....http://dblp.org/pers/hd/n/Normand:Jean=Marie", "Cindy Lombard.....http://dblp.org/pers/hd/l/Lombard:Cindy", "Guillaume Moreau.....http://dblp.org/pers/hd/m/Moreau:Guillaume"], "conf": "vr", "year": "2017", "pages": 9}