{"title": "Locality Preserving Projections for Grassmann manifold.", "fields": ["discriminative model", "manifold alignment", "grassmannian", "dimensionality reduction", "locality"], "abstract": "Learning on Grassmann manifold has become popular in many computer vision tasks, with the strong capability to extract discriminative information for imagesets and videos. However, such learning algorithms particularly on high-dimensional Grassmann manifold always involve with significantly high computational cost, which seriously limits the applicability of learning on Grassmann manifold in more wide areas. In this research, we propose an unsupervised dimensionality reduction algorithm on Grassmann manifold based on the Locality Preserving Projections (LPP) criterion. LPP is a commonly used dimensionality reduction algorithm for vector-valued data, aiming to preserve local structure of data in the dimension-reduced space. The strategy is to construct a mapping from higher dimensional Grassmann manifold into the one in a relative low-dimensional with more discriminative capability. The proposed method can be optimized as a basic eigenvalue problem. The performance of our proposed method is assessed on several classification and clustering tasks and the experimental results show its clear advantages over other Grassmann based algorithms.", "citation": "Citations (1)", "departments": ["Beijing University of Technology", "University of Sydney", "Beijing University of Technology", "Beijing University of Technology", "Computing and Math"], "authors": ["Boyue Wang.....http://dblp.org/pers/hd/w/Wang:Boyue", "Yongli Hu.....http://dblp.org/pers/hd/h/Hu:Yongli", "Junbin Gao.....http://dblp.org/pers/hd/g/Gao:Junbin", "Yanfeng Sun.....http://dblp.org/pers/hd/s/Sun:Yanfeng", "Haoran Chen.....http://dblp.org/pers/hd/c/Chen:Haoran", "Muhammad Ali.....http://dblp.org/pers/hd/a/Ali:Muhammad", "Baocai Yin.....http://dblp.org/pers/hd/y/Yin:Baocai"], "conf": "ijcai", "year": "2017", "pages": 8}