{"title": "Data Generation for Improving Person Re-identification.", "fields": ["training set", "test data generation", "feature", "artificial neural network", "machine learning"], "abstract": "In this paper, we explore ways to address the challenges such as data bias caused by the lack of data on person re-identification problem. We propose a data generation framework from both intra- and inter-view aspects for data augmentation to advance the performance of the existing person re-identification algorithms. Specifically, for intra-view data generation, the proposed method generates useful predicted sequences within a camera view for certain person data expansion. The generated sequences well preserve the movement information of the camera and objects, which expands the original data with longer sequence length to tackle the problem caused by insufficient data from the root. For more challenging datasets which suffer from background clutters, we propose an inter-view image generation with automatic end-to-end background substitution to eliminate the influence by the background and increase the diversity of the training data as well, which makes the recognition system learn to focus on the regions of objects and image features related to identity. We then propose a flexible data augmentation method based on our data generation approaches to improve the performance of the person re-identification and analyze the advantages and applicability of these approaches respectively. Evaluated on the challenging re-id datasets, our method outperforms existing state-of-the-art approaches without any network structure modification on the baseline neural network. Cross-datasets evaluation results show that our method has favorable generalization ability and is potentially helpful for solving similar recognition tasks due to the common issue of insufficient data.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Lin Chen.....http://dblp.org/pers/hd/c/Chen:Lin", "Hua Yang.....http://dblp.org/pers/hd/y/Yang_0001:Hua", "Shuang Wu.....http://dblp.org/pers/hd/w/Wu:Shuang", "Zhiyong Gao.....http://dblp.org/pers/hd/g/Gao:Zhiyong"], "conf": "mm", "year": "2017", "pages": 9}