{"title": "Learning Efficient Object Detection Models with Knowledge Distillation.", "fields": ["bounded function", "distillation", "object detection", "convolutional neural network", "floating point"], "abstract": "Despite significant accuracy improvement in convolutional neural networks (CNN) based object detectors, they often require prohibitive runtimes to process an image for real-time applications. State-of-the-art models often use very deep networks with a large number of floating point operations. Efforts such as model compression learn compact models with fewer number of parameters, but with much reduced accuracy. In this work, we propose a new framework to learn compact and fast ob- ject detection networks with improved accuracy using knowledge distillation [20] and hint learning [34]. Although knowledge distillation has demonstrated excellent improvements for simpler classification setups, the complexity of detection poses new challenges in the form of regression, region proposals and less voluminous la- bels. We address this through several innovations such as a weighted cross-entropy loss to address class imbalance, a teacher bounded loss to handle the regression component and adaptation layers to better learn from intermediate teacher distribu- tions. We conduct comprehensive empirical evaluation with different distillation configurations over multiple datasets including PASCAL, KITTI, ILSVRC and MS-COCO. Our results show consistent improvement in accuracy-speed trade-offs for modern multi-class detection models.", "citation": "Citations (1)", "year": "2017", "departments": ["University of Missouri", "University of Missouri", "University of California, San Diego", "NEC Laboratories", "NEC Laboratories America"], "conf": "nips", "authors": ["Guobin Chen.....http://dblp.org/pers/hd/c/Chen:Guobin", "Wongun Choi.....http://dblp.org/pers/hd/c/Choi:Wongun", "Xiang Yu.....http://dblp.org/pers/hd/y/Yu_0002:Xiang", "Tony X. Han.....http://dblp.org/pers/hd/h/Han:Tony_X=", "Manmohan Chandraker.....http://dblp.org/pers/hd/c/Chandraker:Manmohan"], "pages": 10}