{"title": "A control theoretic approach to ABR video streaming: A fresh look at PID-based rate adaptation.", "fields": ["average bitrate", "the internet", "adaptive bitrate streaming", "cellular network", "pid controller"], "abstract": "Adaptive bitrate streaming (ABR) has become the de facto technique for video streaming over the Internet. Despite a flurry of techniques, achieving high quality ABR streaming over cellular networks remains a tremendous challenge. ABR streaming can be naturally modeled as a feedback control problem. There has been some initial work on using PID, a widely used feedback control technique, for ABR streaming. Existing studies, however, either use PID control directly without fully considering the special requirements of ABR streaming, leading to suboptimal results, or conclude that PID is not a suitable approach. In this paper, we take a fresh look at PID-based control for ABR streaming. We design a framework called PIA that strategically leverages PID control concepts and incorporates several novel strategies to account for the various requirements of ABR streaming. We evaluate PIA using simulation based on real LTE network traces, as well as using real DASH implementation. The results demonstrate that PIA outperforms state-of-the-art schemes in providing high average bitrate with significantly lower bitrate changes (reduction up to 40%) and stalls (reduction up to 85%), while incurring very small runtime overhead.", "citation": "Citations (1)", "departments": ["University of Connecticut", "University of Connecticut", "AT&T Labs", "University of Connecticut", "Indiana University"], "authors": ["Yanyuan Qin.....http://dblp.org/pers/hd/q/Qin:Yanyuan", "Ruofan Jin.....http://dblp.org/pers/hd/j/Jin:Ruofan", "Shuai Hao.....http://dblp.org/pers/hd/h/Hao:Shuai", "Krishna R. Pattipati.....http://dblp.org/pers/hd/p/Pattipati:Krishna_R=", "Feng Qian.....http://dblp.org/pers/hd/q/Qian_0001:Feng", "Subhabrata Sen.....http://dblp.org/pers/hd/s/Sen:Subhabrata", "Bing Wang.....http://dblp.org/pers/hd/w/Wang_0001:Bing", "Chaoqun Yue.....http://dblp.org/pers/hd/y/Yue:Chaoqun"], "conf": "infocom", "year": "2017", "pages": 9}