{"title": "Mechanism design games for thwarting malicious behavior in crowdsourcing applications.", "fields": ["algorithmic game theory", "exploit", "simulations and games in economics education", "screening game", "non cooperative game"], "abstract": "Crowdsourcing applications are vulnerable to malicious behaviors, posing serious threats to their adoption and large deployment. Based on the notion that the requestor (i.e., the crowdsourcer) can block malicious behaviors via leveraging the market power through task allocation and pricing, we propose two novel frameworks based on the mechanism design game theory (i.e., the reverse game theory). To the best of our knowledge, we are the first to exploit the market power and to apply the mechanism design game theory in thwarting malicious behaviors in crowdsourcing. The first proposed framework is built on a requestor-dominant mechanism design game (Rd-MDG), where the game rule is determined solely by the requestor. The second proposed framework is based on the worker-assisted mechanism design game (WaMDG), where the worker (i.e., the contributor) can assist the requestor to determine the game rules by offering advices. These two frameworks have the following salient features: i) neither of them requires the workers to reveal their private information; ii) the game rules of each framework are designed to be able to force the workers to calculate their best strategies based on their actual private information; iii) our theoretical analysis shows that equilibriums exist for both frameworks; and iv) our extensive simulation results demonstrate that these two frameworks can thwart malicious behaviors by driving the workers with a higher attack intent into obtaining lower utilities.", "citation": "Not cited", "departments": ["Beijing Normal University", "Beijing Normal University", "Texas Christian University", "George Washington University", "Beijing Normal University"], "authors": ["Chun-Chi Liu.....http://dblp.org/pers/hd/l/Liu:Chun=Chi", "Shengling Wang.....http://dblp.org/pers/hd/w/Wang_0001:Shengling", "Liran Ma.....http://dblp.org/pers/hd/m/Ma:Liran", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen", "Rongfang Bie.....http://dblp.org/pers/hd/b/Bie:Rongfang", "Jiguo Yu.....http://dblp.org/pers/hd/y/Yu:Jiguo"], "conf": "infocom", "year": "2017", "pages": 9}