{"title": "Handling Environments in a Nested Relational Algebra with Combinators and an Implementation in a Verified Query Compiler.", "fields": ["query optimization", "correctness", "sargable", "variable shadowing", "relational algebra"], "abstract": "Algebras based on combinators, i.e., variable-free, have been proposed as a better representation for query compilation and optimization. A key benefit of combinators is that they avoid the need to handle variable shadowing or accidental capture during rewrites. This simplifies both the optimizer specification and its correctness analysis, but the environment from the source language has to be reified as records, which can lead to more complex query plans.   This paper proposes  NRA e  , an extension of a combinators-based nested relational algebra  (NRA)  with built-in support for environments. We show that it can naturally encode an equivalent  NRA  with lambda terms and that all optimizations on  NRA  carry over to  NRA e  . This extension provides an elegant way to represent views in query plans, and can radically simplify compilation and optimization for source languages with rich environment manipulations.   We have specified a query compiler using the Coq proof assistant with  NRA e   at its heart. Most of the compiler, including the query optimizer, is accompanied by a (machine-checked) correctness proof. The implementation is automatically extracted from the specification, resulting in a query compiler with a verified core.", "citation": "Citations (3)", "year": "2017", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "sigmod", "authors": ["Joshua S. Auerbach.....http://dblp.org/pers/hd/a/Auerbach:Joshua_S=", "Martin Hirzel.....http://dblp.org/pers/hd/h/Hirzel:Martin", "Louis Mandel.....http://dblp.org/pers/hd/m/Mandel:Louis", "Avraham Shinnar.....http://dblp.org/pers/hd/s/Shinnar:Avraham", "Jérôme Siméon.....http://dblp.org/pers/hd/s/Sim=eacute=on:J=eacute=r=ocirc=me"], "pages": 15}