{"title": "Incentivizing strategic users for social diffusion: Quantity or quality?", "fields": ["topological graph theory", "combinatorial optimization", "maximization", "incentive", "new product development"], "abstract": "We consider a problem of how to effectively diffuse a new product over social networks by incentivizing selfish users. Traditionally, this problem has been studied in the form of influence maximization via seeding, where most prior work assumes that seeded users unconditionally and immediately start by adopting the new product and they stay at the new product throughout their lifetime. However, in practice, seeded users often adjust the degree of their willingness to diffuse, depending on how much incentive is given. To address such diffusion willingness, we propose a new incentive model and characterize the speed of diffusion as the value of a combinatorial optimization. Then, we apply the characterization to popular network graph topologies (Erdos-Renyi, planted partition and power law graphs) as well as general ones, for asymptotically computing the diffusion time for those graphs. Our analysis shows that the diffusion time undergoes two levels of order-wise reduction, where the first and second one are solely contributed by the number of seeded users, i.e., quantity, and the amount of incentives, i.e., quality, respectively. In other words, it implies that the best strategy given budget is (a) first identify the minimum seed set depending on the underlying graph topology, and (b) then assign largest possible incentives to users in the set. We believe that our theoretical results provide useful implications and guidelines for designing successful advertising strategies in various practical applications.", "citation": "Not cited", "departments": ["KAIST", "KAIST", "KAIST"], "authors": ["Jungseul Ok.....http://dblp.org/pers/hd/o/Ok:Jungseul", "Jinwoo Shin.....http://dblp.org/pers/hd/s/Shin:Jinwoo", "Yung Yi.....http://dblp.org/pers/hd/y/Yi:Yung"], "conf": "infocom", "year": "2017", "pages": 9}