{"title": "Towards Accurate Multi-person Pose Estimation in the Wild.", "fields": ["coco", "labeled data", "resnet", "minimum bounding box", "pose"], "abstract": "We propose a method for multi-person detection and 2-D pose estimation that achieves state-of-art results on the challenging COCO keypoints task. It is a simple, yet powerful, top-down approach consisting of two stages. In the first stage, we predict the location and scale of boxes which are likely to contain people, for this we use the Faster RCNN detector. In the second stage, we estimate the keypoints of the person potentially contained in each proposed bounding box. For each keypoint type we predict dense heatmaps and offsets using a fully convolutional ResNet. To combine these outputs we introduce a novel aggregation procedure to obtain highly localized keypoint predictions. We also use a novel form of keypoint-based Non-Maximum-Suppression (NMS), instead of the cruder box-level NMS, and a novel form of keypoint-based confidence score estimation, instead of box-level scoring. Trained on COCO data alone, our final system achieves average precision of 0.649 on the COCO test-dev set and the 0.643 test-standard sets, outperforming the winner of the 2016 COCO keypoints challenge and other recent state-of-art. Further, by using additional in-house labeled data we obtain an even higher average precision of 0.685 on the test-dev set and 0.673 on the test-standard set, more than 5% absolute improvement compared to the previous best performing method on the same dataset.", "citation": "Citations (67)", "year": "2017", "departments": ["Google", "Google", "Google"], "conf": "cvpr", "authors": ["George Papandreou.....http://dblp.org/pers/hd/p/Papandreou:George", "Tyler Zhu.....http://dblp.org/pers/hd/z/Zhu:Tyler", "Nori Kanazawa.....http://dblp.org/pers/hd/k/Kanazawa:Nori", "Alexander Toshev.....http://dblp.org/pers/hd/t/Toshev:Alexander", "Jonathan Tompson.....http://dblp.org/pers/hd/t/Tompson:Jonathan", "Chris Bregler.....http://dblp.org/pers/hd/b/Bregler:Chris", "Kevin Murphy.....http://dblp.org/pers/hd/m/Murphy_0002:Kevin"], "pages": 9}