{"title": "SubUNets: End-to-End Hand Shape and Continuous Sign Language Recognition.", "fields": ["transfer of learning", "gesture recognition", "deep learning", "sign language", "feature", "computer vision", "exploit", "end to end principle", "artificial intelligence", "computer science"], "abstract": "We propose a novel deep learning approach to solve simultaneous alignment and recognition problems (referred to as “Sequence-to-sequence” learning). We decompose the problem into a series of specialised expert systems referred to as SubUNets. The spatio-temporal relationships between these SubUNets are then modelled to solve the task, while remaining trainable end-to-end. The approach mimics human learning and educational techniques, and has a number of significant advantages. SubUNets allow us to inject domain-specific expert knowledge into the system regarding suitable intermediate representations. They also allow us to implicitly perform transfer learning between different interrelated tasks, which also allows us to exploit a wider range of more varied data sources. In our experiments we demonstrate that each of these properties serves to significantly improve the performance of the overarching recognition system, by better constraining the learning problem. The proposed techniques are demonstrated in the challenging domain of sign language recognition. We demonstrate state-of-the-art performance on hand-shape recognition (outperforming previous techniques by more than 30%). Furthermore, we are able to obtain comparable sign recognition rates to previous research, without the need for an alignment step to segment out the signs for recognition.", "citation": "Not cited", "year": "2017", "departments": ["University of Surrey", "University of Surrey", "RWTH Aachen University", "University of Surrey", "University of Surrey", "University of Surrey", "RWTH Aachen University", "University of Surrey"], "conf": "iccv", "authors": ["Necati Cihan Camgöz.....http://dblp.org/pers/hd/c/Camg=ouml=z:Necati_Cihan", "Simon Hadfield.....http://dblp.org/pers/hd/h/Hadfield:Simon", "Oscar Koller.....http://dblp.org/pers/hd/k/Koller:Oscar", "Richard Bowden.....http://dblp.org/pers/hd/b/Bowden:Richard"], "pages": 10}