{"title": "Submodular Optimization Over Sliding Windows.", "fields": ["cardinality", "streaming algorithm", "maximum coverage problem", "data stream mining", "submodular set function"], "abstract": "Maximizing submodular functions under cardinality constraints lies at the core of numerous data mining and machine learning applications, including data diversification, data summarization, and coverage problems. In this work, we study this question in the context of data streams, where elements arrive one at a time, and we want to design low-memory and fast update-time algorithms that maintain a good solution. Specifically, we focus on the sliding window model, where we are asked to maintain a solution that considers only the last W items.\n\nIn this context, we provide the first non-trivial algorithm that maintains a provable approximation of the optimum using space sublinear in the size of the window. In particular we give a 1/3 - e approximation algorithm that uses space polylogarithmic in the spread of the values of the elements, δ, and linear in the solution size k for any constant e > 0. At the same time, processing each element only requires a polylogarithmic number of evaluations of the function itself. When a better approximation is desired, we show a different algorithm that, at the cost of using more memory, provides a 1/2 - e approximation, and allows a tunable trade-off between average update time and space. This algorithm matches the best known approximation guarantees for submodular optimization in insertion-only streams, a less general formulation of the problem.\n\nWe demonstrate the efficacy of the algorithms on a number of real world datasets, showing that their practical performance far exceeds the theoretical bounds. The algorithms preserve high quality solutions in streams with millions of items, while storing a negligible fraction of them.", "citation": "Citations (4)", "departments": ["Google", "Google", "Google", "Google"], "authors": ["Alessandro Epasto.....http://dblp.org/pers/hd/e/Epasto:Alessandro", "Silvio Lattanzi.....http://dblp.org/pers/hd/l/Lattanzi:Silvio", "Sergei Vassilvitskii.....http://dblp.org/pers/hd/v/Vassilvitskii:Sergei", "Morteza Zadimoghaddam.....http://dblp.org/pers/hd/z/Zadimoghaddam:Morteza"], "conf": "www", "year": "2017", "pages": 10}