{"title": "Fast and Accurate Pedestrian Detection using Dual-Stage Group Cost-Sensitive RealBoost with Vector Form Filters.", "fields": ["deep learning", "pedestrian detection", "pyramid", "boosting", "bottleneck"], "abstract": "Despite significant research efforts in pedestrian detection over the past decade, there is still a ten-fold performance gap between the state-of-the-art methods and human perception. Deep learning methods can provide good performance but suffers from high computational complexity which prohibits their deployment on affordable systems with limited computational resources. In this paper, we propose a pedestrian detection framework that provides a major fillip to the robustness and run-time efficiency of the recent top performing non-deep learning Filtered Channel Feature (FCF) approach. The proposed framework overcomes the computational bottleneck of existing FCF methods by exploiting vector form filters to efficiently extract more discriminative channel features for pedestrian detection. A novel dual-stage group cost-sensitive RealBoost algorithm is used to explore different costs among different types of misclassification in the boosting process in order to improve detection performance. In addition, we propose two strategies, selective classification and selective scale processing, to further accelerate the detection process at the channel feature level and image pyramid level respectively. Experiments on the Caltech and INRIA datasets show that the proposed method achieves the highest detection performance among all the state-of-the-art non-CNN methods and is about 148X faster than the existing best performing FCF method on the Caltech dataset.", "citation": "Not cited", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Chengju Zhou.....http://dblp.org/pers/hd/z/Zhou:Chengju", "Meiqing Wu.....http://dblp.org/pers/hd/w/Wu:Meiqing", "Siew Kei Lam.....http://dblp.org/pers/hd/l/Lam:Siew_Kei"], "conf": "mm", "year": "2017", "pages": 9}