{"title": "Computing A Near-Maximum Independent Set in Linear Time by Reducing-Peeling.", "fields": ["iterated local search", "power graph analysis", "speedup", "maximal independent set", "vertex cover"], "abstract": "This paper studies the problem of efficiently computing a maximum independent set from a large graph, a fundamental problem in graph analysis. Due to the hardness results of computing an exact maximum independent set or an approximate maximum independent set with accuracy guarantee, the existing algorithms resort to heuristic techniques for approximately computing a maximum independent set with good performance in practice but no accuracy guarantee theoretically. Observing that the existing techniques have various limits, in this paper, we aim to develop efficient algorithms (with linear or near-linear time complexity) that can generate a high-quality (large-size) independent set from a graph in practice. In particular, firstly we develop a  Reducing-Peeling  framework which iteratively reduces the graph size by applying reduction rules on vertices with very low degrees ( Reducing ) and temporarily removing the vertex with the highest degree ( Peeling ) if the reduction rules cannot be applied. Secondly, based on our framework we design two baseline algorithms,  BDOne  and  BDTwo , by utilizing the existing reduction rules for handling degree-one and degree-two vertices, respectively. Both algorithms can generate higher-quality (larger-size) independent sets than the existing algorithms. Thirdly, we propose a linear-time algorithm, LinearTime, and a near-linear time algorithm, NearLinear, by designing new reduction rules and developing techniques for efficiently and incrementally applying reduction rules. In practice, LinearTime takes similar time and space to BDOne but computes a higher quality independent set, similar in size to that of an independent set generated by  BDTwo . Moreover, in practice  NearLinear  has a good chance to generate a maximum independent set and it often generates near-maximum independent sets. Fourthly, we extend our techniques to accelerate the existing iterated local search algorithms. Extensive empirical studies show that all our algorithms output much larger independent sets than the existing linear-time algorithms while having a similar running time, as well as achieve significant speedup against the existing iterated local search algorithms.", "citation": "Citations (2)", "year": "2017", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales"], "conf": "sigmod", "authors": ["Lijun Chang.....http://dblp.org/pers/hd/c/Chang:Lijun", "Wei Li.....http://dblp.org/pers/hd/l/Li:Wei", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie"], "pages": 16}