{"title": "Efficient, Constant-Round and Actively Secure MPC: Beyond the Three-Party Case.", "fields": ["secure two party computation", "symmetric key algorithm", "oblivious transfer", "implementation", "communication source"], "abstract": "While the feasibility of constant-round and actively secure MPC has been known for over two decades, the last few years have witnessed a flurry of designs and implementations that make its deployment a palpable reality. To our knowledge, however, existing concretely efficient MPC constructions are only for up to three parties.   In this paper we design and implement a new actively secure 5PC protocol tolerating two corruptions that requires 8 rounds of interaction, only uses fast symmetric-key operations, and incurs 60% less communication than the passively secure state-of-the-art solution from the work of Ben-Efraim, Lindell, and Omri [CCS 2016]. For example, securely evaluating the AES circuit when the parties are in different regions of the U.S. and Europe only takes 1.8s which is 2.6x faster than the passively secure 5PC in the same environment.   Instrumental for our efficiency gains (less interaction, only symmetric key primitives) is a new 4-party primitive we call Attested OT, which in addition to Sender and Receiver involves two additional \"assistant parties\" who will attest to the respective inputs of both parties, and which might be of broader applicability in practically relevant MPC scenarios. Finally, we also show how to generalize our construction to n parties with similar efficiency properties where the corruption threshold is  t  ≈ √ n , and propose a combinatorial problem which, if solved optimally, can yield even better corruption thresholds for the same cost.", "citation": "Not cited", "year": "2017", "departments": ["Microsoft", "Texas A&M University", "Microsoft", "Visa Research, Palo Alto, USA"], "conf": "ccs", "authors": ["Nishanth Chandran.....http://dblp.org/pers/hd/c/Chandran:Nishanth", "Juan A. Garay.....http://dblp.org/pers/hd/g/Garay:Juan_A=", "Payman Mohassel.....http://dblp.org/pers/hd/m/Mohassel:Payman", "Satyanarayana Vusirikala.....http://dblp.org/pers/hd/v/Vusirikala:Satyanarayana"], "pages": 18}