{"title": "Service chain embedding with maximum flow in software defined network and application to the next-generation cellular network architecture.", "fields": ["approximation algorithm", "server", "software defined networking", "embedding", "maximum flow problem"], "abstract": "With software-defined network (SDN) and network function virtualization (NFV) techniques, we can embed the service chain consisting of a sequence of virtualized network functions (VNFs), i.e., we can determine the flow path and deploy the VNFs contained in the service chain at any place on the path. In the literature, the methods of service chain embedding bound the number of VNFs at a node, whereas the link capacities are disregarded and the amount of flows is not considered, which could cause serious congestion. In addition, according to our experiment, the process overhead on a computation node is linear to the total amount of flows processed. In this paper, we propose a method of service chain embedding to maximize the total amount of flows while bounding the process overhead of the flows on a node by its computation capability and the total amount of flows on an link by its bandwidth capacity. To our knowledge, our method is the first approximation algorithm of service chain embedding with considering flow in the literature. Simulations show our algorithm has good performance in terms of the total amount of flows.", "citation": "Citations (2)", "departments": ["Academia Sinica", "National Taiwan University of Science and Technology", "National Tsing Hua University", "Academia Sinica", "National Tsing Hua University"], "authors": ["Jian-Jhih Kuo.....http://dblp.org/pers/hd/k/Kuo:Jian=Jhih", "Shan-Hsiang Shen.....http://dblp.org/pers/hd/s/Shen:Shan=Hsiang", "Hongyu Kang.....http://dblp.org/pers/hd/k/Kang:Hongyu", "De-Nian Yang.....http://dblp.org/pers/hd/y/Yang:De=Nian", "Ming-Jer Tsai.....http://dblp.org/pers/hd/t/Tsai:Ming=Jer", "Wen-Tsuen Chen.....http://dblp.org/pers/hd/c/Chen:Wen=Tsuen"], "conf": "infocom", "year": "2017", "pages": 9}