{"title": "Sketch-guided GUI test generation for mobile applications.", "fields": ["test case", "sketch", "android", "graphical user interface testing", "scripting language"], "abstract": "Mobile applications with complex GUIs are very popular today. However, generating test cases for these applications is often tedious professional work. On the one hand, manually designing and writing elaborate GUI scripts requires expertise. On the other hand, generating GUI scripts with record and playback techniques usually depends on repetitive work that testers need to interact with the application over and over again, because only one path is recorded in an execution. Automatic GUI testing focuses on exploring combinations of GUI events. As the number of combinations is huge, it is still necessary to introduce a test interface for testers to reduce its search space. This paper presents a sketch-guided GUI test generation approach for testing mobile applications, which provides a simple but expressive interface for testers to specify their testing purposes. Testers just need to draw a few simple strokes on the screenshots. Then our approach translates the strokes to a testing model and initiates a model-based automatic GUI testing. We evaluate our sketch-guided approach on a few real-world Android applications collected from the literature. The results show that our approach can achieve higher coverage than existing automatic GUI testing techniques with just 10-minute sketching for an application.", "citation": "Not cited", "departments": ["Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Chucheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Chucheng", "Haoliang Cheng.....http://dblp.org/pers/hd/c/Cheng:Haoliang", "Enyi Tang.....http://dblp.org/pers/hd/t/Tang:Enyi", "Xin Chen.....http://dblp.org/pers/hd/c/Chen:Xin", "Lei Bu.....http://dblp.org/pers/hd/b/Bu:Lei", "Xuandong Li.....http://dblp.org/pers/hd/l/Li:Xuandong"], "conf": "kbse", "year": "2017", "pages": 6}