{"title": "Optimal multicast in virtualized datacenter networks with software switches.", "fields": ["packet processing", "network management", "load balancing", "profiling", "multicast"], "abstract": "Virtualized datacenter networks have been deployed in production platforms, e.g., Amazon VPC and VMware's NVP, to offer the flexibility of network management to enterprise-level clients. A common characteristic of these platforms is that they adopt software switches, such as Open vSwitch (OvS), instead of hardware switches to transfer data between VMs. Although group communication is common in enterprise applications, the unique characteristics of software switches have posed new challenges to the design of multicast protocols. How logical multicast can be optimally performed with software switches is still not well understood. In this paper, we observe that unlike hardware switches, the per-stream output rate in a software switch critically depends on the packet processing overhead of flow cloning. We study the optimal OvS multicast topology with or without the help of additional dedicated software switches called service nodes, and formulate the throughput maximization as a new class of degree-supervised combinatorial graph problems due to the presence of flow cloning costs. We propose a lineartime optimal solution that translates into simple forwarding rules installed at each software switch. Through emulation-based OvS profiling and extensive simulation results, we demonstrate that our proposed logical multicast solutions can significantly improve session throughput with the ability to handle load balancing and latency issues, as compared to the state-of-the-art in the literature.", "citation": "Citations (1)", "departments": ["University of Alberta", "University of Alberta", "University of Toronto", "University of Calgary"], "authors": ["Rui Zhu.....http://dblp.org/pers/hd/z/Zhu_0007:Rui", "Di Niu.....http://dblp.org/pers/hd/n/Niu:Di", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng"], "conf": "infocom", "year": "2017", "pages": 9}