{"title": "Interactive message transmission over adversarial wiretap channel II.", "fields": ["information theoretic security", "public key infrastructure", "alice and bob", "adversary", "models of communication"], "abstract": "In Wyner wiretap II model of communication, Alice and Bob are connected by a channel that can be eavesdropped by an adversary with unlimited computation who can select a fraction of communication to view, and the goal is to provide perfect information theoretic security. Information theoretic security is increasingly important because of the threat of quantum computers that can effectively break algorithms and protocols that are used in today's public key infrastructure. We consider interactive protocols for wiretap II channel with active adversary who can eavesdrop and add adversarial noise to the eavesdropped part of the codeword. These channels capture wireless setting where malicious eavesdroppers at reception distance of the transmitter can eavesdrop the communication and introduce jamming signal to the channel. We derive a new upperbound R ≤ 1 − ρ for the rate of interactive protocols over two-way wiretap II channel with active adversaries, and construct a perfectly secure protocol family with achievable rate 1 — 2ρ + ρ 2 . This is strictly higher than the rate of the best one round protocol which is 1 — 2ρ, hence showing that interaction improves rate. We also prove that even with interaction, reliable communication is possible only if ρ < 1/2. An interesting aspect of this work is that our bounds will also hold in network setting when two nodes are connected by n paths, a ρ of which is corrupted by the adversary. We discuss our results, give their relations to the other works, and propose directions for future work.", "citation": "Not cited", "departments": ["University of Calgary", "University of Calgary"], "authors": ["Pengwei Wang.....http://dblp.org/pers/hd/w/Wang:Pengwei", "Reihaneh Safavi-Naini.....http://dblp.org/pers/hd/s/Safavi=Naini:Reihaneh"], "conf": "infocom", "year": "2017", "pages": 9}