{"title": "DUPLO: Unifying Cut-and-Choose for Garbled Circuits.", "fields": ["divide and choose", "electronic circuit", "cryptographic protocol", "computation", "discrete mathematics", "mathematics", "compiler"], "abstract": "Cut-and-choose (CC) is the standard approach to making Yao's garbled circuit two-party computation (2PC) protocol secure against malicious adversaries. Traditional cut-and-choose operates at the level of entire circuits, whereas the LEGO paradigm (Nielsen & Orlandi, TCC 2009) achieves asymptotic improvements by performing cut-and-choose at the level of individual gates. In this work we propose a unified approach called DUPLO that spans the entire continuum between these two extremes. The cut-and-choose step in our protocol operates on the level of arbitrary circuit \"components,\" which can range in size from a single gate to the entire circuit itself.   With this entire continuum of parameter values at our disposal, we find that the best way to scale 2PC to computations of realistic size is to use CC components of intermediate size, and not at the extremes. On computations requiring several millions of gates or more, our more general approach to CC gives between 4-7x improvement over existing approaches.   In addition to our technical contributions of modifying and optimizing previous protocol techniques to work with general CC components, we also provide an extension of the recent Frigate circuit compiler (Mood et al, Euro S&P 2016) to effectively express any C-style program in terms of components which can be processed efficiently using our protocol.", "citation": "Not cited", "year": "2017", "departments": ["Bell Labs", "Aarhus University", "Oregon State University", "Oregon State University", "Aarhus University"], "conf": "ccs", "authors": ["Vladimir Kolesnikov.....http://dblp.org/pers/hd/k/Kolesnikov:Vladimir", "Jesper Buus Nielsen.....http://dblp.org/pers/hd/n/Nielsen:Jesper_Buus", "Mike Rosulek.....http://dblp.org/pers/hd/r/Rosulek:Mike", "Ni Trieu.....http://dblp.org/pers/hd/t/Trieu:Ni", "Roberto Trifiletti.....http://dblp.org/pers/hd/t/Trifiletti:Roberto"], "pages": 18}