{"title": "KillingFusion: Non-rigid 3D Reconstruction without Correspondences.", "fields": ["killing vector field", "magnitude", "displacement", "3d reconstruction", "signed distance function"], "abstract": "We introduce a geometry-driven approach for real-time 3D reconstruction of deforming surfaces from a single RGB-D stream without any templates or shape priors. To this end, we tackle the problem of non-rigid registration by level set evolution without explicit correspondence search. Given a pair of signed distance fields (SDFs) representing the shapes of interest, we estimate a dense deformation field that aligns them. It is defined as a displacement vector field of the same resolution as the SDFs and is determined iteratively via variational minimization. To ensure it generates plausible shapes, we propose a novel regularizer that imposes local rigidity by requiring the deformation to be a smooth and approximately Killing vector field, i.e. generating nearly isometric motions. Moreover, we enforce that the level set property of unity gradient magnitude is preserved over iterations. As a result, KillingFusion reliably reconstructs objects that are undergoing topological changes and fast inter-frame motion. In addition to incrementally building a model from scratch, our system can also deform complete surfaces. We demonstrate these capabilities on several public datasets and introduce our own sequences that permit both qualitative and quantitative comparison to related approaches.", "citation": "Citations (8)", "year": "2017", "departments": ["Siemens", "Technische Universität München", "Technische Universität München", "Technische Universität München"], "conf": "cvpr", "authors": ["Miroslava Slavcheva.....http://dblp.org/pers/hd/s/Slavcheva:Miroslava", "Maximilian Baust.....http://dblp.org/pers/hd/b/Baust:Maximilian", "Daniel Cremers.....http://dblp.org/pers/hd/c/Cremers:Daniel", "Slobodan Ilic.....http://dblp.org/pers/hd/i/Ilic:Slobodan"], "pages": 10}