{"title": "Efficient Computation of Top-k Frequent Terms over Spatio-temporal Ranges.", "fields": ["geolocation", "region of interest", "range query", "spatial analysis", "analytics"], "abstract": "The wide availability of tracking devices has drastically increased the role of geolocation in social networks, resulting in new commercial applications; for example, marketers can identify current trending topics within a region of interest and focus their products accordingly. In this paper we study a basic analytics query on geotagged data, namely:  given a spatiotemporal region, find the most frequent terms among the social posts in that region . While there has been prior work on keyword search on spatial data (find the objects nearest to the query point that contain the query keywords), and on group keyword search on spatial data (retrieving groups of objects), our problem is different in that it returns keywords and aggregated frequencies as output, instead of having the keyword as input. Moreover, we differ from works addressing the streamed version of this query in that we operate on large, disk resident data and we provide exact answers. We propose an index structure and algorithms to efficiently answer such top-k spatiotemporal range queries, which we refer as  Top-k Frequent Spatiotemporal Terms (kFST)  queries. Our index structure employs an R-tree augmented by top-k sorted term lists (STLs), where a key challenge is to balance the size of the index to achieve faster execution and smaller space requirements. We theoretically study and experimentally validate the ideal length of the stored term lists, and perform detailed experiments to evaluate the performance of the proposed methods compared to baselines on real datasets.", "citation": "Not cited", "year": "2017", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "conf": "sigmod", "authors": ["Pritom Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Pritom", "Mahbub Hasan.....http://dblp.org/pers/hd/h/Hasan:Mahbub", "Abhijith Kashyap.....http://dblp.org/pers/hd/k/Kashyap:Abhijith", "Vagelis Hristidis.....http://dblp.org/pers/hd/h/Hristidis:Vagelis", "Vassilis J. Tsotras.....http://dblp.org/pers/hd/t/Tsotras:Vassilis_J="], "pages": 15}