{"title": "When Good Components Go Bad: Formally Secure Compilation Despite Dynamic Compromise.", "fields": ["undefined behavior", "compromise", "component based software engineering", "reference monitor", "principle of least privilege"], "abstract": "We propose a new formal criterion for secure compilation, giving strong end-to-end security guarantees for software components written in unsafe, low-level languages with C-style undefined behavior. Our criterion is the first to model_dynamic_ compromise in a system of mutually distrustful components running with least privilege. Each component is protected from all the others---in particular, from components that have encountered undefined behavior and become compromised. Each component receives secure compilation guarantees up to the point when it becomes compromised, after which an attacker can take complete control over the component and use any of its privileges to attack the remaining uncompromised components. More precisely, we ensure that dynamically compromised components cannot break the safety properties of the system at the target level any more than equally privileged components without undefined behavior already could in the source language. \nTo illustrate this model, we build a secure compilation chain for an unsafe language with buffers, procedures, and components. We compile it to a simple RISC abstract machine with built-in compartmentalization and provide thorough proofs, many of them machine-checked in Coq, showing that the compiler satisfies our secure compilation criterion. Finally, we show that the protection guarantees offered by the compartmentalized abstract machine can be achieved at the machine-code level using either software fault isolation or a tag-based reference monitor.", "citation": "Citations (1)", "year": "2018", "departments": ["University of Trento", "Carnegie Mellon University", "French Institute for Research in Computer Science and Automation", "University of Virginia", "French Institute for Research in Computer Science and Automation"], "conf": "ccs", "authors": ["Carmine Abate.....http://dblp.org/pers/hd/a/Abate:Carmine", "Arthur Azevedo de Amorim.....http://dblp.org/pers/hd/a/Amorim:Arthur_Azevedo_de", "Roberto Blanco.....http://dblp.org/pers/hd/b/Blanco:Roberto", "Ana Nora Evans.....http://dblp.org/pers/hd/e/Evans:Ana_Nora", "Guglielmo Fachini.....http://dblp.org/pers/hd/f/Fachini:Guglielmo", "Catalin Hritcu.....http://dblp.org/pers/hd/h/Hritcu:Catalin", "Théo Laurent.....http://dblp.org/pers/hd/l/Laurent:Th=eacute=o", "Benjamin C. Pierce.....http://dblp.org/pers/hd/p/Pierce:Benjamin_C=", "Marco Stronati.....http://dblp.org/pers/hd/s/Stronati:Marco", "Andrew Tolmach.....http://dblp.org/pers/hd/t/Tolmach:Andrew"], "pages": 18}