{"title": "Optimal Joint Routing and Scheduling in Millimeter-Wave Cellular Networks.", "fields": ["job shop scheduling", "approximation algorithm", "backhaul", "cellular network", "throughput"], "abstract": "Millimeter-wave (mmWave) communication is a promising technology to cope with the expected exponential increase in data traffic in 5G networks. mmWave networks typically require a very dense deployment of mmWave base stations (mmBS). To reduce cost and increase flexibility, wireless backhauling is needed to connect the mmBSs. The characteristics of mmWave communication, and specifically its high directionality, imply new requirements for efficient routing and scheduling paradigms. We propose an efficient scheduling method, so-called schedule-oriented optimization, based on matching theory that optimizes QoS metrics jointly with routing. It is capable of solving any scheduling problem that can be formulated as a linear program whose variables are link times and QoS metrics. As an example of the schedule-oriented optimization, we show the optimal solution of the maximum throughput fair scheduling (MTFS). Practically, the optimal scheduling can be obtained even for networks with over 200 mmBSs. To further increase the runtime performance, we propose an efficient edge coloring based approximation algorithm with provable performance bound. It achieves over 80% of the optimal max-min throughput and runs 5 to 100 times faster than the optimal algorithm in practice. Finally, we extend the optimal and approximation algorithms for the cases of multi-RF-chain mmBSs and integrated backhaul and access networks.", "citation": "Citations (1)", "departments": ["Technische Universität Darmstadt", "Simula Research Laboratory", "IMDEA", "Technische Universität Darmstadt"], "authors": ["Dingwen Yuan.....http://dblp.org/pers/hd/y/Yuan:Dingwen", "Hsuan-Yin Lin.....http://dblp.org/pers/hd/l/Lin:Hsuan=Yin", "Jörg Widmer.....http://dblp.org/pers/hd/w/Widmer:J=ouml=rg", "Matthias Hollick.....http://dblp.org/pers/hd/h/Hollick:Matthias"], "conf": "infocom", "year": "2018", "pages": 9}