{"title": "Camel: Content-Aware and Meta-path Augmented Metric Learning for Author Identification.", "fields": ["feature learning", "heterogeneous network", "integrative learning", "recurrent neural network", "deep learning"], "abstract": "In this paper, we study the problem of author identification in big scholarly data, which is to effectively rank potential authors for each anonymous paper by using historical data. Most of the existing de-anonymization approaches predict relevance score of paper-author pair via feature engineering, which is not only time and storage consuming, but also introduces irrelevant and redundant features or miss important attributes. Representation learning can automate the feature generation process by learning nodes’ embeddings in academic network to infer the correlation of paper-author pair. However, the learned embeddings are often for general purpose (independent of the specific task), or based on network structure only (without considering the node content). To address these issues and make a further progress in solving the author identification problem, we propose a content-aware and meta-path augmented metric learning model. Specifically, first, the directly correlated paper-author pairs are modeled based on distance metric learning by introducing a push loss function. Next, the paper’s content embedding encoded by the gated recurrent neural network is integrated into the distance loss. Moreover, the historical bibliographic data of papers is utilized to construct an academic heterogeneous network, wherein a meta-path guided walk integrative learning module based on the task-dependent and content-aware Skipgram model is designed to formulate the correlations between each paper and its indirect author neighbors, and further augments the model. The results of extensive evaluations and analytical experiments on the well known AMiner dataset demonstrate that the proposed model achieves better performance, comparing to the state-of-the-art baselines. It achieves an average improvement of 8.3\\% over the best baseline method.", "citation": "Not cited", "departments": ["University of Notre Dame", "University of Notre Dame", "King Abdullah University of Science and Technology", "King Abdullah University of Science and Technology", "University of Notre Dame"], "authors": ["Chuxu Zhang.....http://dblp.org/pers/hd/z/Zhang:Chuxu", "Chao Huang.....http://dblp.org/pers/hd/h/Huang:Chao", "Lu Yu.....http://dblp.org/pers/hd/y/Yu:Lu", "Xiangliang Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiangliang", "Nitesh V. Chawla.....http://dblp.org/pers/hd/c/Chawla:Nitesh_V="], "conf": "www", "year": "2018", "pages": 10}