{"title": "Griffin: uniting CPU and GPU in information retrieval systems for intra-query parallelism.", "fields": ["data set", "merge", "parallel algorithm", "latency", "response time"], "abstract": "Interactive information retrieval services, such as enterprise search and document search, must provide relevant results with consistent, low response times in the face of rapidly growing data sets and query loads. These growing demands have led researchers to consider a wide range of optimizations to reduce response latency, including query processing parallelization and acceleration with co-processors such as GPUs. However, previous work runs queries either on GPU or CPU, ignoring the fact that the best processor for a given query depends on the query's characteristics, which may change as the processing proceeds.   We present Griffin, an IR systems that dynamically combines GPU- and CPU-based algorithms to process individual queries according to their characteristics. Griffin uses state-of-the-art CPU-based query processing techniques and incorporates a novel approach to GPU-based query evaluation. Our GPU-based approach, as far as we know, achieves the best available GPU search performance by leveraging a new compression scheme and exploiting an advanced merge-based intersection algorithm. We evaluate Griffin with real world queries and datasets, and show that it improves query performance by 10x compared to a highly optimized CPU-only implementation, and 1.5x compared to our GPU-approach running alone. We also find that Griffin helps reduce the 95th-, 99th-, and 99.9th-percentile query response time by 10.4x, 16.1x, and 26.8x, respectively.", "citation": "Not cited", "year": "2018", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "ppopp", "authors": ["Yang Liu.....http://dblp.org/pers/hd/l/Liu_0044:Yang", "Jianguo Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianguo", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "pages": 11}