{"title": "Game of Sketches: Deep Recurrent Models of Pictionary-Style Word Guessing.", "fields": ["progress in artificial intelligence", "sketch", "question answering", "turing test", "intelligent agent"], "abstract": "The ability of intelligent agents to play games in human-like fashion is popularly considered a benchmark of progress in Artificial Intelligence. Similarly, performance on multi-disciplinary tasks such as Visual Question Answering (VQA) is considered a marker for gauging progress in Computer Vision. In our work, we bring games and VQA together. Specifically, we introduce the first computational model aimed at Pictionary, the popular word-guessing social game. We first introduce Sketch-QA, an elementary version of Visual Question Answering task. Styled after Pictionary, Sketch-QA uses incrementally accumulated sketch stroke sequences as visual data. Notably, Sketch-QA involves asking a fixed question (\"What object is being drawn?\") and gathering open-ended guess-words from human guessers. We analyze the resulting dataset and present many interesting findings therein. To mimic Pictionary-style guessing, we subsequently propose a deep neural model which generates guess-words in response to temporally evolving human-drawn sketches. Our model even makes human-like mistakes while guessing, thus amplifying the human mimicry factor. We evaluate our model on the large-scale guess-word dataset generated via Sketch-QA task and compare with various baselines. We also conduct a Visual Turing Test to obtain human impressions of the guess-words generated by humans and our model. Experimental results demonstrate the promise of our approach for Pictionary and similarly themed games.", "citation": "Not cited", "departments": ["Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science"], "authors": ["Ravi Kiran Sarvadevabhatla.....http://dblp.org/pers/hd/s/Sarvadevabhatla:Ravi_Kiran", "Shiv Surya.....http://dblp.org/pers/hd/s/Surya:Shiv", "Trisha Mittal.....http://dblp.org/pers/hd/m/Mittal:Trisha", "R. Venkatesh Babu.....http://dblp.org/pers/hd/b/Babu:R=_Venkatesh"], "conf": "aaai", "year": "2018", "pages": 8}