{"title": "To distribute or not to distribute?: why licensing bugs matter.", "fields": ["confusion", "bittorrent tracker", "software bug", "license", "source code"], "abstract": "Software licenses dictate how source code or binaries can be modified, reused, and redistributed. In the case of open source projects, software licenses generally fit into two main categories, permissive and restrictive, depending on the degree to which they allow redistribution or modification under licenses different from the original one(s). Developers and organizations can also modify existing licenses, creating custom licenses with specific permissive/restrictive terms. Having such a variety of software licenses can create confusion among software developers, and can easily result in the introduction of  licensing bugs,  not necessarily limited to well-known license incompatibilities. In this work, we report a study aimed at characterizing licensing bugs by (i) building a catalog categorizing the types of licensing bugs developers and other stakeholders face, and (ii) understanding the implications licensing bugs have on the software projects they affect. The presented study is the result of the manual analysis of 1,200 discussions related to licensing bugs carried out in issue trackers and in five legal mailing lists of open source communities. Our findings uncover new types of licensing bugs not addressed in prior literature, and a detailed assessment of their implications.", "citation": "Not cited", "departments": ["College of William & Mary", "University of Victoria", "University of Sannio", "University of Lugano", "University of Los Andes"], "authors": ["Christopher Vendome.....http://dblp.org/pers/hd/v/Vendome:Christopher", "Daniel M. Germán.....http://dblp.org/pers/hd/g/Germ=aacute=n:Daniel_M=", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Mario Linares Vásquez.....http://dblp.org/pers/hd/v/V=aacute=squez:Mario_Linares", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "conf": "icse", "year": "2018", "pages": 12}