{"title": "Learning Collaborative Generation Correction Modules for Blind Image Deblurring and Beyond.", "fields": ["heuristic", "kernel density estimation", "image scaling", "deblurring", "collaborative learning"], "abstract": "Blind image deblurring plays a very important role in many vision and multimedia applications. Most existing works tend to introduce complex priors to estimate the sharp image structures for blur kernel estimation. However, it has been verified that directly optimizing these models is challenging and easy to fall into degenerate solutions. Although several experience-based heuristic inference strategies, including trained networks and designed iterations, have been developed, it is still hard to obtain theoretically guaranteed accurate solutions. In this work, a collaborative learning framework is established to address the above issues. Specifically, we first design two modules, named Generator and Corrector, to extract the intrinsic image structures from the data-driven and knowledge-based perspectives, respectively. By introducing a collaborative methodology to cascade these modules, we can strictly prove the convergence of our image propagations to a deblurring-related optimal solution. As a nontrivial byproduct, we also apply the proposed method to address other related tasks, such as image interpolation and edge-preserved smoothing. Plenty of experiments demonstrate that our method can outperform the state-of-the-art approaches on both synthetic and real datasets.", "citation": "Not cited", "year": "2018", "departments": ["Dalian University of Technology", "Dalian University of Technology", "Dalian University of Technology", "Dalian University of Technology", "Guilin University of Electronic Technology"], "conf": "mm", "authors": ["Risheng Liu.....http://dblp.org/pers/hd/l/Liu:Risheng", "Yi He.....http://dblp.org/pers/hd/h/He:Yi", "Shichao Cheng.....http://dblp.org/pers/hd/c/Cheng:Shichao", "Xin Fan.....http://dblp.org/pers/hd/f/Fan:Xin", "Zhongxuan Luo.....http://dblp.org/pers/hd/l/Luo:Zhongxuan"], "pages": 9}