{"title": "Latent Relational Metric Learning via Memory-based Attention for Collaborative Ranking.", "fields": ["recommender system", "deep learning", "memory module", "collaborative filtering", "ranking"], "abstract": "This paper proposes a new neural architecture for collaborative ranking with implicit feedback. Our model, LRML (Latent Relational Metric Learning) is a novel extension of metric learning approaches for recommendation. More specifically, instead of simple push pull mechanisms between user and item pairs, we propose to learn latent relations for each user item interaction. This helps to alleviate the potential geometric inflexibility of existing metric learning approaches. This not only enables better performance but also a greater extent of modeling capability, allowing our model to scale to larger number of interactions. In order to do so, we employ a augmented memory module and learn to attend over these memory blocks to construct latent relations. The attention module is controlled by the user-item interaction, making the learned relation vector specific to each user-item pair. Hence, this can be interpreted as learning an exclusive and optimal relational translation for each user-item interaction. The proposed architecture not only demonstrates the state-of-the-art performance across multiple recommendation benchmarks. LRML outperforms other metric learning models by 6%-7.5% in terms of Hits@10 and nDCG@10 on large datasets such as Netflix and MovieLens20M. Moreover, qualitative studies also demonstrate evidence that our proposed model is able to infer and encode explicit sentiment, temporal and attribute information despite being only trained on implicit feedback. As such, this ascertains the ability of LRML to uncover hidden relational structure within implicit datasets.", "citation": "Citations (4)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Agency for Scie ... ore, Singapore"], "authors": ["Yi Tay.....http://dblp.org/pers/hd/t/Tay:Yi", "Luu Anh Tuan.....http://dblp.org/pers/hd/t/Tuan:Luu_Anh", "Siu Cheung Hui.....http://dblp.org/pers/hd/h/Hui:Siu_Cheung"], "conf": "www", "year": "2018", "pages": 11}