{"title": "Query-based Workload Forecasting for Self-Driving Database Management Systems.", "fields": ["physical design", "rendering", "controller", "workload", "autonomic computing"], "abstract": "The first step towards an autonomous database management system (DBMS) is the ability to model the target application's workload. This is necessary to allow the system to anticipate future workload needs and select the proper optimizations in a timely manner. Previous forecasting techniques model the resource utilization of the queries. Such metrics, however, change whenever the physical design of the database and the hardware resources change, thereby rendering previous forecasting models useless.   We present a robust forecasting framework called QueryBot 5000 that allows a DBMS to predict the expected arrival rate of queries in the future based on historical data. To better support highly dynamic environments, our approach uses the logical composition of queries in the workload rather than the amount of physical resources used for query execution. It provides multiple horizons (short- vs. long-term) with different aggregation intervals. We also present a clustering-based technique for reducing the total number of forecasting models to maintain. To evaluate our approach, we compare our forecasting models against other state-of-the-art models on three real-world database traces. We implemented our models in an external controller for PostgreSQL and MySQL and demonstrate their effectiveness in selecting indexes.", "citation": "Citations (2)", "year": "2018", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "sigmod", "authors": ["Lin Ma.....http://dblp.org/pers/hd/m/Ma:Lin", "Dana Van Aken.....http://dblp.org/pers/hd/a/Aken:Dana_Van", "Ahmed Hefny.....http://dblp.org/pers/hd/h/Hefny:Ahmed", "Gustavo Mezerhane.....http://dblp.org/pers/hd/m/Mezerhane:Gustavo", "Andrew Pavlo.....http://dblp.org/pers/hd/p/Pavlo:Andrew", "Geoffrey J. Gordon.....http://dblp.org/pers/hd/g/Gordon:Geoffrey_J="], "pages": 15}