{"title": "Predicting the effect of home Wi-Fi quality on QoE.", "fields": ["service provider", "computer network", "quality of experience", "the internet", "business"], "abstract": "Poor Wi-Fi quality can disrupt home users' internet experience, or the Quality of Experience (QoE). Detecting when Wi-Fi degrades QoE is extremely valuable for residential Internet Service Providers (ISPs) as home users often hold the ISP responsible whenever QoE degrades. Yet, ISPs have little visibility within the home to assist users. Our goal is to develop a system that runs on commodity access points (APs) to assist ISPs in detecting when Wi-Fi degrades QoE. Our first contribution is to develop a method to detect instances of poor QoE based on the passive observation of Wi-Fi quality metrics available in commodity APs (e.g., PHY rate). We use support vector regression to build predictors of QoE given Wi-Fi quality for popular internet applications. We then use K-means clustering to combine per-application predictors to identify regions of Wi-Fi quality where QoE is poor across applications. We call samples in these regions as poor QoE samples. Our second contribution is to apply our predictors to Wi-Fi metrics collected over one month from 3479 APs of customers of a large residential ISP. Our results show that QoE is good most of the time, still we find 11.6% of poor QoE samples. Worse, approximately 21% of stations have more than 25% poor QoE samples. In some cases, we estimate that Wi-Fi quality causes poor QoE for many hours, though in most cases poor QoE events are short.", "citation": "Not cited", "departments": ["Télécom ParisTech", "French Institute for Research in Computer Science and Automation", "Technicolor", "Technicolor"], "authors": ["Diego N. da Hora.....http://dblp.org/pers/hd/h/Hora:Diego_N=_da", "Karel Van Doorselaer.....http://dblp.org/pers/hd/d/Doorselaer:Karel_Van", "Koen Van Oost.....http://dblp.org/pers/hd/o/Oost:Koen_Van", "Renata Teixeira.....http://dblp.org/pers/hd/t/Teixeira:Renata"], "conf": "infocom", "year": "2018", "pages": 9}