{"title": "Causally Regularized Learning with Agnostic Data Selection Bias.", "fields": ["selection bias", "confounding", "interpretability", "test data", "transfer of learning"], "abstract": "Most of previous machine learning algorithms are proposed based on the i.i.d. hypothesis. However, this ideal assumption is often violated in real applications, where selection bias may arise between training and testing process. Moreover, in many scenarios, the testing data is not even available during the training process, which makes the traditional methods like transfer learning infeasible due to their need on prior of test distribution. Therefore, how to address the agnostic selection bias for robust model learning is of paramount importance for both academic research and real applications. In this paper, under the assumption that causal relationships among variables are robust across domains, we incorporate causal technique into predictive modeling and propose a novel Causally Regularized Logistic Regression (CRLR) algorithm by jointly optimize global confounder balancing and weighted logistic regression. Global confounder balancing helps to identify causal features, whose causal effect on outcome are stable across domains, then performing logistic regression on those causal features constructs a robust predictive model against the agnostic bias. To validate the effectiveness of our CRLR algorithm, we conduct comprehensive experiments on both synthetic and real world datasets. Experimental results clearly demonstrate that our CRLR algorithm outperforms the state-of-the-art methods, and the interpretability of our method can be fully depicted by the feature visualization.", "citation": "Not cited", "year": "2018", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tencent"], "conf": "mm", "authors": ["Zheyan Shen.....http://dblp.org/pers/hd/s/Shen:Zheyan", "Peng Cui.....http://dblp.org/pers/hd/c/Cui_0001:Peng", "Kun Kuang.....http://dblp.org/pers/hd/k/Kuang:Kun", "Bo Li.....http://dblp.org/pers/hd/l/Li:Bo", "Peixuan Chen.....http://dblp.org/pers/hd/c/Chen:Peixuan"], "pages": 9}