{"title": "Impact of Channel State Misreporting on Multi-user Massive MIMO Scheduling Performance.", "fields": ["power control", "multi user", "throughput", "mimo", "physical layer"], "abstract": "The robustness of system throughput with scheduling is a critical issue. In this paper, we analyze the sensitivity of multi-user scheduling performance to channel misreporting in systems with massive antennas. The main result is that for the round-robin scheduler combined with max-min power control, the channel magnitude misreporting is harmful to the scheduling performance and has a different impact from the purely physical layer analysis. Specifically, for the homogeneous users that have equal average signal-to-noise ratios (SNRs), underreporting is harmful, while overreporting is beneficial to others. In underreporting, the asymptotic rate loss on others is derived, which is tight when the number of antennas is huge. One interesting observation in our research is that the rate loss \"periodically\" increases and decreases as the number of misreporters grows. For the heterogeneous users that have various SNRs, both underreporting and overreporting can degrade the scheduler performance. We observe that strong misreporting changes the user grouping decision and hence greatly decreases some users' rates regardless of others gaining rate improvements, while with carefully designed weak misreporting, the scheduling decision keeps fixed and the rate loss on others is shown to grow nearly linearly with the number of misreporters.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Auburn University", "Rice University", "Shanghai Jiao Tong University"], "authors": ["Zhanzhan Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhanzhan", "Yin Sun.....http://dblp.org/pers/hd/s/Sun:Yin", "Ashutosh Sabharwal.....http://dblp.org/pers/hd/s/Sabharwal:Ashutosh", "Zhiyong Chen.....http://dblp.org/pers/hd/c/Chen_0002:Zhiyong"], "conf": "infocom", "year": "2018", "pages": 9}