{"title": "Context-Aware Visual Policy Network for Sequence-Level Image Captioning.", "fields": ["natural language", "machine learning", "closed captioning", "reinforcement learning", "language policy"], "abstract": "Many vision-language tasks can be reduced to the problem of sequence prediction for natural language output. In particular, recent advances in image captioning use deep reinforcement learning (RL) to alleviate the \"exposure bias\" during training: ground-truth subsequence is exposed in every step prediction, which introduces bias in test when only predicted subsequence is seen. However, existing RL-based image captioning methods only focus on the language policy while not the visual policy (e.g., visual attention), and thus fail to capture the visual context that are crucial for compositional reasoning such as visual relationships (e.g., \"man riding horse\") and comparisons (e.g., \"smaller cat\"). To fill the gap, we propose a Context-Aware Visual Policy network (CAVP) for sequence-level image captioning. At every time step, CAVP explicitly accounts for the previous visual attentions as the context, and then decides whether the context is helpful for the current word generation given the current visual attention. Compared against traditional visual attention that only fixes a single image region at every step, CAVP can attend to complex visual compositions over time. The whole image captioning model --- CAVP and its subsequent language policy network --- can be efficiently optimized end-to-end by using an actor-critic policy gradient method with respect to any caption evaluation metric. We demonstrate the effectiveness of CAVP by state-of-the-art performances on MS-COCO offline split and online server, using various metrics and sensible visualizations of qualitative visual context. The code is available at this https URL", "citation": "Citations (3)", "year": "2018", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "Nanyang Technological University", "University of Science and Technology of China", "University of Science and Technology of China"], "conf": "mm", "authors": ["Daqing Liu.....http://dblp.org/pers/hd/l/Liu:Daqing", "Zheng-Jun Zha.....http://dblp.org/pers/hd/z/Zha:Zheng=Jun", "Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Yongdong Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongdong", "Feng Wu.....http://dblp.org/pers/hd/w/Wu:Feng"], "pages": 9}