{"title": "High-order Proximity Preserving Information Network Hashing.", "fields": ["binary code", "subspace topology", "hamming code", "recurrent neural network", "analytics"], "abstract": "Information network embedding is an effective way for efficient graph analytics. However, it still faces with computational challenges in problems such as link prediction and node recommendation, particularly with increasing scale of networks. Hashing is a promising approach for accelerating these problems by orders of magnitude. However, no prior studies have been focused on seeking binary codes for information networks to preserve high-order proximity. Since matrix factorization (MF) unifies and outperforms several well-known embedding methods with high-order proximity preserved, we propose a MF-based \\underlineI nformation \\underlineN etwork \\underlineH ashing (INH-MF) algorithm, to learn binary codes which can preserve high-order proximity. We also suggest Hamming subspace learning, which only updates partial binary codes each time, to scale up INH-MF. We finally evaluate INH-MF on four real-world information network datasets with respect to the tasks of node classification and node recommendation. The results demonstrate that INH-MF can perform significantly better than competing learning to hash baselines in both tasks, and surprisingly outperforms network embedding methods, including DeepWalk, LINE and NetMF, in the task of node recommendation. The source code of INH-MF is available online\\footnote\\urlhttps://github.com/DefuLian/network .", "citation": "Not cited", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "Agency for Science, Technology and Research", "University of Arizona", "University of Technology, Sydney"], "authors": ["Defu Lian.....http://dblp.org/pers/hd/l/Lian:Defu", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Vincent W. Zheng.....http://dblp.org/pers/hd/z/Zheng:Vincent_W=", "Yong Ge.....http://dblp.org/pers/hd/g/Ge:Yong", "Longbing Cao.....http://dblp.org/pers/hd/c/Cao:Longbing", "Ivor W. Tsang.....http://dblp.org/pers/hd/t/Tsang:Ivor_W=", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing"], "conf": "kdd", "year": "2018", "pages": 10}