{"title": "Tell them apart: distilling technology differences from crowd-scale comparison discussions.", "fields": ["software development", "cluster analysis", "exploit", "stack overflow", "trial and error"], "abstract": "Developers can use different technologies for many software development tasks in their work. However, when faced with several technologies with comparable functionalities, it is not easy for developers to select the most appropriate one, as comparisons among technologies are time-consuming by trial and error. Instead, developers can resort to expert articles, read official documents or ask questions in QA sites for technology comparison, but it is opportunistic to get a comprehensive comparison as online information is often fragmented or contradictory. To overcome these limitations, we propose the  diffTech  system that exploits the crowdsourced discussions from Stack Overflow, and assists technology comparison with an informative summary of different comparison aspects. We first build a large database of comparable technologies in software engineering by mining tags in Stack Overflow, and then locate comparative sentences about comparable technologies with natural language processing methods. We further mine prominent comparison aspects by clustering similar comparative sentences and representing each cluster with its keywords. The evaluation demonstrates both the accuracy and usefulness of our model and we implement our approach into a practical website for public use.", "citation": "Citations (1)", "departments": ["Australian National University", "Monash University", "Australian National University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Yi Huang.....http://dblp.org/pers/hd/h/Huang:Yi", "Chunyang Chen.....http://dblp.org/pers/hd/c/Chen:Chunyang", "Zhenchang Xing.....http://dblp.org/pers/hd/x/Xing:Zhenchang", "Tian Lin.....http://dblp.org/pers/hd/l/Lin:Tian", "Yang Liu.....http://dblp.org/pers/hd/l/Liu:Yang"], "conf": "kbse", "year": "2018", "pages": 11}