{"title": "The Cloud that Runs the Mobile Internet: A Measurement Study of Mobile Cloud Services.", "fields": ["software deployment", "roaming", "peering", "testbed", "mobile broadband"], "abstract": "Mobile applications outsource their cloud infrastructure\ndeployment and content delivery to cloud computing services and content delivery networks. Studying how these services, which we collectively denote Cloud Service Providers (CSPs), perform over Mobile Network Operators (MNOs) is crucial to understanding some of the performance limitations of today’s mobile apps. To that end, we perform the first empirical study of the complex dynamics between applications, MNOs and CSPs. First, we use real mobile app traffic traces that we gathered through a global crowdsourcing campaign to identify the most prevalent CSPs supporting today’s mobile Internet. Then, we investigate how well these services interconnect with major European MNOs at a topological level, and measure their performance over European MNO networks through a monthlong measurement campaign on the MONROE mobile broadband testbed. We discover that the top 6 most prevalent CSPs are used by 85% of apps, and observe significant differences in their performance across different MNOs due to the nature of their services, peering relationships with MNOs, and deployment strategies. We also find that CSP performance in MNOs is affected by inflated path length, roaming, and presence of middleboxes, but not influenced by the choice of DNS resolver.", "citation": "Not cited", "departments": ["IMDEA", "Charles III University of Madrid", "Stony Brook University", "Simula Research Laboratory", "University of California, Berkeley"], "authors": ["Foivos Michelinakis.....http://dblp.org/pers/hd/m/Michelinakis:Foivos", "Hossein Doroud.....http://dblp.org/pers/hd/d/Doroud:Hossein", "Abbas Razaghpanah.....http://dblp.org/pers/hd/r/Razaghpanah:Abbas", "Andra Lutu.....http://dblp.org/pers/hd/l/Lutu:Andra", "Narseo Vallina-Rodriguez.....http://dblp.org/pers/hd/v/Vallina=Rodriguez:Narseo", "Phillipa Gill.....http://dblp.org/pers/hd/g/Gill:Phillipa", "Joerg Widmer.....http://dblp.org/pers/hd/w/Widmer:Joerg"], "conf": "infocom", "year": "2018", "pages": 9}