{"title": "PROMISE: An End-to-End Design of a Programmable Mixed-Signal Accelerator for Machine-Learning Algorithms.", "fields": ["mixed signal integrated circuit", "exploit", "compiler", "optimizing compiler", "instruction set"], "abstract": "Analog/mixed-signal machine learning (ML) accelerators exploit the unique computing capability of analog/mixed-signal circuits and inherent error tolerance of ML algorithms to obtain higher energy efficiencies than digital ML accelerators. Unfortunately, these analog/mixed-signal ML accelerators lack programmability, and even instruction set interfaces, to support diverse ML algorithms or to enable essential software control over the energy-vs-accuracy tradeoffs. We propose PROMISE, the first end-to-end design of a PROgrammable MIxed-Signal accElerator from Instruction Set Architecture (ISA) to high-level language compiler for acceleration of diverse ML algorithms. We first identify prevalent operations in widely-used ML algorithms and key constraints in supporting these operations for a programmable mixed-signal accelerator. Second, based on that analysis, we propose an ISA with a PROMISE architecture built with silicon-validated components for mixed-signal operations. Third, we develop a compiler that can take a ML algorithm described in a high-level programming language (Julia) and generate PROMISE code, with an IR design that is both language-neutral and abstracts away unnecessary hardware details. Fourth, we show how the compiler can map an application-level error tolerance specification for neural network applications down to low-level hardware parameters (swing voltages for each application Task) to minimize energy consumption. Our experiments show that PROMISE can accelerate diverse ML algorithms with energy efficiency competitive even with fixed-function digital ASICs for specific ML algorithms, and the compiler optimization achieves significant additional energy savings even for only 1% extra errors.", "citation": "Not cited", "departments": ["University of Illinois at Urbana–Champaign", "IBM", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "IBM"], "authors": ["Prakalp Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Prakalp", "Mingu Kang.....http://dblp.org/pers/hd/k/Kang:Mingu", "Sujan K. Gonugondla.....http://dblp.org/pers/hd/g/Gonugondla:Sujan_K=", "Sungmin Lim.....http://dblp.org/pers/hd/l/Lim:Sungmin", "Jungwook Choi.....http://dblp.org/pers/hd/c/Choi:Jungwook", "Vikram S. Adve.....http://dblp.org/pers/hd/a/Adve:Vikram_S=", "Nam Sung Kim.....http://dblp.org/pers/hd/k/Kim:Nam_Sung", "Naresh Shanbhag.....http://dblp.org/pers/hd/s/Shanbhag:Naresh"], "conf": "isca", "year": "2018", "pages": 14}