{"title": "Studying the Sense of Embodiment in VR Shared Experiences.", "fields": ["virtual machine", "virtual representation", "virtual reality", "task analysis", "embodied cognition"], "abstract": "In this paper, we explore the influence of sharing a virtual environment with another user on the sense of embodiment in virtual reality. For this aim, we conducted an experiment where users were immersed in a virtual environment while being embodied in an anthropomorphic virtual representation of themselves. To evaluate the influence of the presence of another user, two situations were studied: either users were immersed alone, or in the company of another user. During the experiment, participants performed a virtual version of the well-known whac-a-mole game, therefore interacting with the virtual environment, while sitting at a virtual table. Our results show that users were significantly more “efficient” (i.e., faster reaction times), and accordingly more engaged, in performing the task when sharing the virtual environment, in particular for the more competitive tasks. Also, users experienced comparable levels of embodiment both when immersed alone or with another user. These results are supported by subjective questionnaires but also through behavioural responses, e.g. users reacting to the introduction of a threat towards their virtual body. Taken together, our results show that competition and shared experiences involving an avatar do not influence the sense of embodiment, but can increase user engagement. Such insights can be used by designers of virtual environments and virtual reality applications to develop more engaging applications.", "citation": "Not cited", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Rebecca Fribourg.....http://dblp.org/pers/hd/f/Fribourg:Rebecca", "Ferran Argelaguet.....http://dblp.org/pers/hd/a/Argelaguet:Ferran", "Ludovic Hoyet.....http://dblp.org/pers/hd/h/Hoyet:Ludovic", "Anatole Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Anatole"], "conf": "vr", "year": "2018", "pages": 8}