{"title": "A Margin-based MLE for Crowdsourced Partial Ranking.", "fields": ["crowdsourcing", "ranking", "pairwise comparison", "generalized linear model", "probabilistic logic"], "abstract": "A preference order or ranking aggregated from pairwise comparison data is commonly understood as a strict total order. However, in real-world scenarios, some items are intrinsically ambiguous in comparisons, which may very well be an inherent uncertainty of the data. In this case, the conventional total order ranking can not capture such uncertainty with mere global ranking or utility scores. In this paper, we are specifically interested in the recent surge in crowdsourcing applications to predict partial but more accurate (i.e., making less incorrect statements) orders rather than complete ones. To do so, we propose a novel framework to learn some probabilistic models of partial orders as a \\emph{margin-based Maximum Likelihood Estimate} (MLE) method. We prove that the induced MLE is a joint convex optimization problem with respect to all the parameters, including the global ranking scores and margin parameter. Moreover, three kinds of generalized linear models are studied, including the basic uniform model, Bradley-Terry model, and Thurstone-Mosteller model, equipped with some theoretical analysis on FDR and Power control for the proposed methods. The validity of these models are supported by experiments with both simulated and real-world datasets, which shows that the proposed models exhibit improvements compared with traditional state-of-the-art algorithms.", "citation": "Not cited", "year": "2018", "departments": ["Chinese Academy of Sciences", "Tencent", "Peking University", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "mm", "authors": ["Qianqian Xu.....http://dblp.org/pers/hd/x/Xu:Qianqian", "Jiechao Xiong.....http://dblp.org/pers/hd/x/Xiong:Jiechao", "Xinwei Sun.....http://dblp.org/pers/hd/s/Sun_0001:Xinwei", "Zhiyong Yang.....http://dblp.org/pers/hd/y/Yang:Zhiyong", "Xiaochun Cao.....http://dblp.org/pers/hd/c/Cao:Xiaochun", "Qingming Huang.....http://dblp.org/pers/hd/h/Huang:Qingming", "Yuan Yao.....http://dblp.org/pers/hd/y/Yao:Yuan"], "pages": 9}