{"title": "Path-Level Network Transformation for Efficient Architecture Search.", "fields": ["contextual image classification", "machine learning", "reinforcement learning", "network topology", "architecture"], "abstract": "We introduce a new function-preserving transformation for efficient neural architecture search. This network transformation allows reusing previously trained networks and existing successful architectures that improves sample efficiency. We aim to address the limitation of current network transformation operations that can only perform layer-level architecture modifications, such as adding (pruning) filters or inserting (removing) a layer, which fails to change the topology of connection paths. Our proposed path-level transformation operations enable the meta-controller to modify the path topology of the given network while keeping the merits of reusing weights, and thus allow efficiently designing effective structures with complex path topologies like Inception models. We further propose a bidirectional tree-structured reinforcement learning meta-controller to explore a simple yet highly expressive tree-structured architecture space that can be viewed as a generalization of multi-branch architectures. We experimented on the image classification datasets with limited computational resources (about 200 GPU-hours), where we observed improved parameter efficiency and better test results (97.70% test accuracy on CIFAR-10 with 14.3M parameters and 74.6% top-1 accuracy on ImageNet in the mobile setting), demonstrating the effectiveness and transferability of our designed architectures.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Massachusetts Institute of Technology", "Shanghai Jiao Tong University"], "authors": ["Han Cai.....http://dblp.org/pers/hd/c/Cai:Han", "Jiacheng Yang.....http://dblp.org/pers/hd/y/Yang:Jiacheng", "Weinan Zhang.....http://dblp.org/pers/hd/z/Zhang:Weinan", "Song Han.....http://dblp.org/pers/hd/h/Han:Song", "Yong Yu.....http://dblp.org/pers/hd/y/Yu:Yong"], "conf": "icml", "year": "2018", "pages": 10}