{"title": "BrightView: Increasing Perceived Brightness of Optical See-Through Head-Mounted Displays Through Unnoticeable Incident Light Reduction.", "fields": ["opacity", "luminance", "visibility", "magnitude", "ray"], "abstract": "Optical See-Through Head-Mounted Displays (OST-HMDs) lose the visibility of virtual contents under bright environment illumination due to their see-through nature. We demonstrate how a liquid crystal (LC) filter attached to an OST-HMD can be used to dynamically increase the perceived brightness of virtual content without impacting the perceived brightness of the real scene. We present a prototype OST-HMD that continuously adjusts the opacity of the LC filter to attenuate the environment light without users becoming aware of the change. Consequently, virtual content appears to be brighter. The proposed approach is evaluated in psychophysical experiments in three scenes, with 16, 31, and 31 participants, respectively. The participants were asked to compare the magnitude of brightness changes of both real and virtual objects, before and after dimming the LC filter over a period of 5, 10, and 20 seconds. The results showed that the participants felt increases in the brightness of virtual objects while they were less conscious of reductions of the real scene luminance. These results provide evidence for the effectiveness of our display design. Our design can be applied to a wide range of OST-HMDs to improve the brightness and hence realism of virtual content in augmented reality applications.", "citation": "Not cited", "departments": ["Keio University", "Ritsumeikan University", "Nara Institute of Science and Technology", "Nara Institute of Science and Technology"], "authors": ["Shohei Mori.....http://dblp.org/pers/hd/m/Mori:Shohei", "Sei Ikeda.....http://dblp.org/pers/hd/i/Ikeda:Sei", "Alexander Plopski.....http://dblp.org/pers/hd/p/Plopski:Alexander", "Christian Sandor.....http://dblp.org/pers/hd/s/Sandor:Christian"], "conf": "vr", "year": "2018", "pages": 8}