{"title": "QARC: Video Quality Aware Rate Control for Real-Time Video Streaming based on Deep Reinforcement Learning.", "fields": ["latency", "video quality", "throughput", "reinforcement learning", "artificial neural network"], "abstract": "Real-time video streaming is now one of the main applications in all network environments. Due to the fluctuation of throughput under various network conditions, how to choose a proper bitrate adaptively has become an upcoming and interestingly issue. To tackle this problem, most adaptive bitrate control methods have been proposed to provide high video bitrates instead of video qualities. Nevertheless, we notice that there exists a trade-off between sending bitrate and video quality, which motivates us to focus on how to get a balance between them. In this paper, we propose QARC (video Quality Awareness Rate Control), a rate control algorithm that aims to have a higher perceptual video quality with possibly lower sending rate and transmission latency. Starting from scratch, QARC uses deep reinforcement learning(DRL) algorithm to train a neural network to select future bitrates based on previously observed network status and past video frames. To overcome the \"state explosion problem\", we design a neural network to predict future perceptual video quality as a vector for taking the place of the raw picture in the DRL's inputs. We evaluate QARC over a trace-driven emulation, outperforming existing approach with improvements in average video quality of 18\\% - 25\\% and decreases in average latency with 23% -45%. Meanwhile, Comparing QARC with offline optimal high bitrate method on various network conditions also yields a solid result.", "citation": "Not cited", "year": "2018", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Beijing Kuaisho ...  Beijing, China"], "conf": "mm", "authors": ["Tianchi Huang.....http://dblp.org/pers/hd/h/Huang:Tianchi", "Rui-Xiao Zhang.....http://dblp.org/pers/hd/z/Zhang:Rui=Xiao", "Chao Zhou.....http://dblp.org/pers/hd/z/Zhou:Chao", "Lifeng Sun.....http://dblp.org/pers/hd/s/Sun:Lifeng"], "pages": 9}