{"title": "Accurate and Fast Asymmetric Locality-Sensitive Hashing Scheme for Maximum Inner Product Search.", "fields": ["locality sensitive hashing", "partition", "normalization", "hypersphere", "nearest neighbor search"], "abstract": "The problem of Approximate Maximum Inner Product (AMIP) search has received increasing attention due to its wide applications. Interestingly, based on asymmetric transformation, the problem can be reduced to the Approximate Nearest Neighbor (ANN) search, and hence leverage Locality-Sensitive Hashing (LSH) to find solution. However, existing asymmetric transformations such as L2-ALSH and XBOX, suffer from large distortion error in reducing AMIP search to ANN search, such that the results of AMIP search can be arbitrarily bad. In this paper, we propose a novel Asymmetric LSH scheme based on Homocentric Hypersphere partition (H2-ALSH) for high-dimensional AMIP search. On the one hand, we propose a novel Query Normalized First (QNF) transformation to significantly reduce the distortion error. On the other hand, by adopting the homocentric hypersphere partition strategy, we can not only improve the search efficiency with early stop pruning, but also get higher search accuracy by further reducing the distortion error with limited data range. Our theoretical studies show that H2-ALSH enjoys a guarantee on search accuracy. Experimental results over four real datasets demonstrate that H2-ALSH significantly outperforms the state-of-the-art schemes.", "citation": "Not cited", "departments": ["Sun Yat-sen University", "Sun Yat-sen University", "Sun Yat-sen University", "South China University of Technology", "National University of Singapore"], "authors": ["Qiang Huang.....http://dblp.org/pers/hd/h/Huang:Qiang", "Guihong Ma.....http://dblp.org/pers/hd/m/Ma:Guihong", "Jianlin Feng.....http://dblp.org/pers/hd/f/Feng:Jianlin", "Qiong Fang.....http://dblp.org/pers/hd/f/Fang:Qiong", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H="], "conf": "kdd", "year": "2018", "pages": 10}