{"title": "Inapproximability of the independent set polynomial in the complex plane.", "fields": ["reciprocal polynomial", "real number", "complex plane", "degree", "critical point"], "abstract": "We study the complexity of approximating the value of the independent set polynomial  Z   G  (λ) of a graph  G  with maximum degree Δ when the activity λ is a complex number.    When λ is real, the complexity picture is well-understood, and is captured by two real-valued thresholds λ *  and λ  c  , which depend on Δ and satisfy 0 *   c  . It is known that if λ is a real number in the interval (−λ * ,λ  c  ) then there is an FPTAS for approximating  Z   G  (λ) on graphs  G  with maximum degree at most Δ. On the other hand, if λ is a real number outside of the (closed) interval, then approximation is NP-hard. The key to establishing this picture was the interpretation of the thresholds λ *  and λ  c   on the Δ-regular tree. The ”occupation ratio” of a Δ-regular tree  T  is the contribution to  Z   T  (λ) from independent sets containing the root of the tree, divided by  Z   T  (λ) itself. This occupation ratio converges to a limit, as the height of the tree grows, if and only if λ∈ [−λ * ,λ  c  ].    Unsurprisingly, the case where λ is complex is more challenging. It is known that there is an FPTAS when λ is a complex number with norm at most λ *  and also when λ is in a small strip surrounding the real interval [0,λ  c  ). However, neither of these results is believed to fully capture the truth about when approximation is possible. Peters and Regts identified the values of λ for which the occupation ratio of the Δ-regular tree converges. These values carve a cardioid-shaped region Λ Δ  in the complex plane, whose boundary includes the critical points −λ *  and λ  c  . Motivated by the picture in the real case, they asked whether Λ Δ  marks the true approximability threshold for general complex values λ.    Our main result shows that for every λ outside of Λ Δ , the problem of approximating  Z   G  (λ) on graphs  G  with maximum degree at most Δ is indeed NP-hard. In fact, when λ is outside of Λ Δ  and is not a positive real number, we give the stronger result that approximating  Z   G  (λ) is actually #P-hard. Further, on the negative real axis, when λ * , we show that it is #P-hard to even decide whether  Z   G  (λ)>0, resolving in the affirmative a conjecture of Harvey, Srivastava and Vondrak.    Our proof techniques are based around tools from complex analysis — specifically the study of iterative multivariate rational maps.", "citation": "Citations (2)", "year": "2018", "departments": ["Rochester Institute of Technology", "University of Oxford", "University of Oxford", "University of Rochester"], "conf": "stoc", "authors": ["Ivona Bezáková.....http://dblp.org/pers/hd/b/Bez=aacute=kov=aacute=:Ivona", "Andreas Galanis.....http://dblp.org/pers/hd/g/Galanis:Andreas", "Leslie Ann Goldberg.....http://dblp.org/pers/hd/g/Goldberg:Leslie_Ann", "Daniel Stefankovic.....http://dblp.org/pers/hd/s/Stefankovic:Daniel"], "pages": 7}