{"title": "SHIELD: Fast, Practical Defense and Vaccination for Deep Learning using JPEG Compression.", "fields": ["deep learning", "adversary", "adversarial machine learning", "jpeg", "compression"], "abstract": "The rapidly growing body of research in adversarial machine learning has demonstrated that deep neural networks (DNNs) are highly vulnerable to adversarially generated images. This underscores the urgent need for practical defense techniques that can be readily deployed to combat attacks in real-time. Observing that many attack strategies aim to perturb image pixels in ways that are visually imperceptible, we place JPEG compression at the core of our proposed SHIELD defense framework, utilizing its capability to effectively \"compress away\" such pixel manipulation. To immunize a DNN model from artifacts introduced by compression, SHIELD \"vaccinates\" the model by retraining it with compressed images, where different compression levels are applied to generate multiple vaccinated models that are ultimately used together in an ensemble defense. On top of that, SHIELD adds an additional layer of protection by employing randomization at test time that compresses different regions of an image using random compression levels, making it harder for an adversary to estimate the transformation performed. This novel combination of vaccination, ensembling, and randomization makes SHIELD a fortified multi-pronged defense. We conducted extensive, large-scale experiments using the ImageNet dataset, and show that our approaches eliminate up to 98% of gray-box attacks delivered by strong adversarial techniques such as Carlini-Wagner's L2 attack and DeepFool. Our approaches are fast and work without requiring knowledge about the model.", "citation": "Citations (2)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Nilaksh Das.....http://dblp.org/pers/hd/d/Das:Nilaksh", "Madhuri Shanbhogue.....http://dblp.org/pers/hd/s/Shanbhogue:Madhuri", "Shang-Tse Chen.....http://dblp.org/pers/hd/c/Chen:Shang=Tse", "Fred Hohman.....http://dblp.org/pers/hd/h/Hohman:Fred", "Siwei Li.....http://dblp.org/pers/hd/l/Li:Siwei", "Li Chen.....http://dblp.org/pers/hd/c/Chen:Li", "Michael E. Kounavis.....http://dblp.org/pers/hd/k/Kounavis:Michael_E=", "Duen Horng Chau.....http://dblp.org/pers/hd/c/Chau:Duen_Horng"], "conf": "kdd", "year": "2018", "pages": 9}