{"title": "Fast Beeping Protocols for Deterministic MIS and (Δ + 1)-Coloring in Sparse Graphs.", "fields": ["arboricity", "binary logarithm", "planar graph", "degree", "maximal independent set"], "abstract": "The beeping model is an extremely restrictive broadcast communication model that relies only on carrier sensing. We consider two problems in this model: (Δ+l)-vertex coloring and maximal independent set (MIS), for a network of unknown size  $n$  and unknown maximum degree Δ. Solving these problems allows to overcome communication interferences, and to break symmetry, a core component of many distributed protocols. The presented results apply to general graphs, but are efficient in graphs with low edge density (sparse graphs), such as bounded degree graphs, planar graphs and graphs of bounded arboricity. We present O(Δ 2  log n + Δ 3 ) time deterministic uniform MIS and coloring protocols, which are asymptotically time optimal for bounded degree graphs. Furthermore, we devise O(a 2  log2 n+a 3 log n) time MIS and coloring protocols, as well as O(a 2  Δ  2  log 2  n + a 3  Δ  3  log n) time 2-hop MIS and 2-hop coloring protocols, where  $a$  is the arboricity of the communication graph. Building upon the 2-hop coloring protocols, we show how the strong CONGEST model can be simulated and by using this simulation we obtain an O ( $a$ ) -coloring protocol. No results about coloring with less than Δ + 1 colors were known up to now in the beeping model.", "citation": "Not cited", "year": "2018", "departments": ["Université Paris-Saclay", "Université Paris-Saclay", "Université Paris-Saclay", "Technion – Israel Institute of Technology"], "conf": "infocom", "authors": ["Joffroy Beauquier.....http://dblp.org/pers/hd/b/Beauquier:Joffroy", "Janna Burman.....http://dblp.org/pers/hd/b/Burman:Janna", "Fabien Dufoulon.....http://dblp.org/pers/hd/d/Dufoulon:Fabien", "Shay Kutten.....http://dblp.org/pers/hd/k/Kutten:Shay"], "pages": 9}