{"title": "Generating Adversarial Examples with Adversarial Networks.", "fields": ["machine learning", "mnist database", "artificial intelligence", "artificial neural network", "adversarial system"], "abstract": "Deep neural networks (DNNs) have been found to be vulnerable to adversarial examples resulting from adding small-magnitude perturbations to inputs. Such adversarial examples can mislead DNNs to produce adversary-selected results. Different attack strategies have been proposed to generate adversarial examples, but how to produce them with high perceptual quality and more efficiently requires more research efforts. In this paper, we propose AdvGAN to generate adversarial examples with generative adversarial networks (GANs), which can learn and approximate the distribution of original instances. For AdvGAN, once the generator is trained, it can generate adversarial perturbations efficiently for any instance, so as to potentially accelerate adversarial training as defenses. We apply AdvGAN in both semi-whitebox and black-box attack settings. In semi-whitebox attacks, there is no need to access the original target model after the generator is trained, in contrast to traditional white-box attacks. In black-box attacks, we dynamically train a distilled model for the black-box model and optimize the generator accordingly. Adversarial examples generated by AdvGAN on different target models have high attack success rate under state-of-the-art defenses compared to other attacks. Our attack has placed the first with 92.76% accuracy on a public MNIST black-box attack challenge.", "citation": "Citations (4)", "departments": ["University of Michigan", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of Michigan"], "authors": ["Chaowei Xiao.....http://dblp.org/pers/hd/x/Xiao:Chaowei", "Bo Li.....http://dblp.org/pers/hd/l/Li_0044:Bo", "Jun-Yan Zhu.....http://dblp.org/pers/hd/z/Zhu:Jun=Yan", "Warren He.....http://dblp.org/pers/hd/h/He:Warren", "Mingyan Liu.....http://dblp.org/pers/hd/l/Liu:Mingyan", "Dawn Song.....http://dblp.org/pers/hd/s/Song:Dawn"], "conf": "ijcai", "year": "2018", "pages": 7}