{"title": "Adversarial Metric Learning.", "fields": ["generative grammar", "test set", "test data", "cross entropy", "confusion", "adversarial system", "grasp", "discriminator", "adversarial process"], "abstract": "In the past decades, intensive efforts have been put to design various loss functions and metric forms for metric learning problem. These improvements have shown promising results when the test data is similar to the training data. However, the trained models often fail to produce reliable distances on the ambiguous test pairs due to the distribution bias between training set and test set. To address this problem, the Adversarial Metric Learning (AML) is proposed in this paper, which automatically generates adversarial pairs to remedy the distribution bias and facilitate robust metric learning. Specifically, AML consists of two adversarial stages, i.e. confusion and distinguishment. In confusion stage, the ambiguous but critical adversarial data pairs are adaptively generated to mislead the learned metric. In distinguishment stage, a metric is exhaustively learned to try its best to distinguish both the adversarial pairs and the original training pairs. Thanks to the challenges posed by the confusion stage in such competing process, the AML model is able to grasp plentiful difficult knowledge that has not been contained by the original training pairs, so the discriminability of AML can be significantly improved. The entire model is formulated into optimization framework, of which the global convergence is theoretically proved. The experimental results on toy data and practical datasets clearly demonstrate the superiority of AML to the representative state-of-the-art metric learning methodologies.", "citation": "Not cited", "departments": ["Nanjing University of Science and Technology", "Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Shuo Chen.....http://dblp.org/pers/hd/c/Chen_0003:Shuo", "Chen Gong.....http://dblp.org/pers/hd/g/Gong_0002:Chen", "Jian Yang.....http://dblp.org/pers/hd/y/Yang_0003:Jian", "Xiang Li.....http://dblp.org/pers/hd/l/Li:Xiang", "Yang Wei.....http://dblp.org/pers/hd/w/Wei:Yang", "Jun Li.....http://dblp.org/pers/hd/l/Li:Jun"], "conf": "ijcai", "year": "2018", "pages": 7}