{"title": "Aesthetic-based Clothing Recommendation.", "fields": ["clothing", "visual appearance", "convolutional neural network", "scale invariant feature transform", "feature"], "abstract": "Recently, product images gain increasing concern in clothing recommendation since the visual appearance of the items have a significant impact on consumers’ decision. Existing models usually extract conventional features, such as convolutional neural network (CNN) features, scale-invariant feature transform (SIFT) features, and color histograms, to represent item image characters and capture user visual preferences. However, one important feature, aesthetic feature, is typically ignored. It is vital in recommendation since users’ decision depends largely on if the clothing is in line with their aesthetic while the conventional image features cannot portray this directly. To bridge this gap, we propose to introduce aesthetic information which is more related with users’ preference into the field of clothing recommender system. To do so, we first present the aesthetic features extracted by an pre-trained neural network, which is a brain inspired deep structure trained for aesthetic assessment task. Considering the aesthetic preference shows diversity with different people and time, we propose a novel tensor factorization model as a basic model and then incorporate the aesthetic features into it. Finally, extensive experiments on real-world datasets demonstrate that our approach can capture the aesthetic preference of consumers and outperform several state-of-the-art models significantly.", "citation": "Citations (2)", "departments": ["Tsinghua University", "Tsinghua University", "National University of Singapore", "Tsinghua University", "Emory University"], "authors": ["Wenhui Yu.....http://dblp.org/pers/hd/y/Yu:Wenhui", "Huidi Zhang.....http://dblp.org/pers/hd/z/Zhang:Huidi", "Xiangnan He.....http://dblp.org/pers/hd/h/He_0001:Xiangnan", "Xu Chen.....http://dblp.org/pers/hd/c/Chen:Xu", "Li Xiong.....http://dblp.org/pers/hd/x/Xiong_0001:Li", "Zheng Qin.....http://dblp.org/pers/hd/q/Qin:Zheng"], "conf": "www", "year": "2018", "pages": 10}