{"title": "Racing in Hyperspace: Closing Hyper-Threading Side Channels on SGX with Contrived Data Races.", "fields": ["interrupt", "open research", "instruction set", "hyper threading", "side channel attack"], "abstract": "In this paper, we present HYPERRACE, an LLVM-based tool for instrumenting SGX enclave programs to eradicate all side-channel threats due to Hyper-Threading. HYPERRACE creates a shadow thread for each enclave thread and asks the underlying untrusted operating system to schedule both threads on the same physical core whenever enclave code is invoked, so that Hyper-Threading side channels are closed completely. Without placing additional trust in the operating system's CPU scheduler, HYPERRACE conducts a physical-core co-location test: it first constructs a communication channel between the threads using a shared variable inside the enclave and then measures the communication speed to verify that the communication indeed takes place in the shared L1 data cache—a strong indicator of physical-core co-location. The key novelty of the work is the measurement of communication speed without a trustworthy clock; instead, relative time measurements are taken via contrived data races on the shared variable. It is worth noting that the emphasis of HYPERRACE's defense against Hyper-Threading side channels is because they are open research problems. In fact, HYPERRACE also detects the occurrence of exception-or interrupt-based side channels, the solutions of which have been studied by several prior works.", "citation": "Not cited", "departments": ["Ohio State University", "Chinese Academy of Sciences", "Indiana University Bloomington", "Ohio State University", "Ohio State University"], "authors": ["Guoxing Chen.....http://dblp.org/pers/hd/c/Chen:Guoxing", "Wenhao Wang.....http://dblp.org/pers/hd/w/Wang:Wenhao", "Tianyu Chen.....http://dblp.org/pers/hd/c/Chen:Tianyu", "Sanchuan Chen.....http://dblp.org/pers/hd/c/Chen:Sanchuan", "Yinqian Zhang.....http://dblp.org/pers/hd/z/Zhang:Yinqian", "XiaoFeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:XiaoFeng", "Ten-Hwang Lai.....http://dblp.org/pers/hd/l/Lai:Ten=Hwang", "Dongdai Lin.....http://dblp.org/pers/hd/l/Lin:Dongdai"], "conf": "sp", "year": "2018", "pages": 17}