{"title": "I Can See on My Feet While Walking: Sensitivity to Translation Gains with Visible Feet.", "fields": ["immersion", "virtual machine", "simulation", "redirected walking", "visualization"], "abstract": "Redirected walking allows users to explore immersive virtual environments by real walking even when the physical tracking space is limited. Redirected walking is usually implemented via translation gains, rotation gains, and curvature gains, while previous research was focused on identifying detection thresholds for such manipulations. To our knowledge, all previous experiments were conducted without a visual self-representation of the user in the virtual environment, in particular, without showing the user's feet. In this paper, we address the question if the virtual self-representation of the user's feet changes the detection thresholds for translation gains. Furthermore, we consider the influence of the holisticness of the visual stimulus, i. e., the type of virtual environment. Therefore, we conducted an experiment to identify detection thresholds for translation gains under three different conditions: (i) without visible virtual feet and (ii) with visible virtual feet both in a high fidelity visually rich virtual environment, and (iii) with visible virtual feet in a low cue virtual environment. The results revealed the range of detection thresholds for translations gains, which cannot be detected by the user when the feet are visible. Furthermore, the results show a significant difference between the two types of environment. Our findings suggest that the virtual environment is more important for manipulation detection than the visual self-representation of the user's feet.", "citation": "Not cited", "departments": ["University of Hamburg", "University of Hamburg", "University of Hamburg"], "authors": ["Lucie Kruse.....http://dblp.org/pers/hd/k/Kruse:Lucie", "Eike Langbehn.....http://dblp.org/pers/hd/l/Langbehn:Eike", "Frank Stelnlcke.....http://dblp.org/pers/hd/s/Stelnlcke:Frank"], "conf": "vr", "year": "2018", "pages": 8}