{"title": "Wi-Fi Teeter-Totter: Overclocking OFDM for Internet of Things.", "fields": ["spectral efficiency", "phy", "orthogonal frequency division multiplexing", "physical layer", "telecommunications link"], "abstract": "The conventional high-speed Wi-Fi has recently become a contender for low-power Internet-of-Things (IoT) communications. OFDM continues its adoption in the new IoT Wi-Fi standard due to its spectrum efficiency that can support the demand of massive IoT connectivity. While the IoT Wi-Fi standard offers many new features to improve power and spectrum efficiency, the basic physical layer (PHY) structure of transceiver design still conforms to its conventional design rationale where access points (AP) and clients employ the same OFDM PHY. In this paper, we argue that current Wi-Fi PHY design does not take full advantage of the inherent asymmetry between AP and IoT. To fill the gap, we propose an asymmetric design where IoT devices transmit uplink packets using the lowest power while pushing all the decoding burdens to the AP side. Such a design utilizes the sufficient power and computational resources at AP to trade for the transmission (TX) power of IoT devices. The core technique enabling this asymmetric design is that the AP takes full power of its high clock rate to boost the decoding ability. We provide an implementation of our design and show that it can reduce the IoT's TX power by boosting the decoding capability at the receivers.", "citation": "Not cited", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Wei Wang.....http://dblp.org/pers/hd/w/Wang:Wei", "Shiyue He.....http://dblp.org/pers/hd/h/He:Shiyue", "Lin Yang.....http://dblp.org/pers/hd/y/Yang:Lin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang:Qian", "Tao Jian.....http://dblp.org/pers/hd/j/Jian:Tao"], "conf": "infocom", "year": "2018", "pages": 9}