{"title": "Why Reinvent the Wheel: Let's Build Question Answering Systems Together.", "fields": ["component based software engineering", "entity linking", "question answering", "relationship extraction", "semantic search"], "abstract": "Modern question answering (QA) systems need to flexibly integrate a number of components specialised to fulfil specific tasks in a QA pipeline. Key QA tasks include Named Entity Recognition and Disambiguation, Relation Extraction, and Query Building. Since a number of different software components exist, implementing different strategies for each of these tasks, a major challenge when building QA systems, is how to select and combine the most suitable components into a QA system, given the characteristics of a question. We study this optimisation problem and train Classifiers, which take features of a question as input and have the goal of optimising the selection of QA components based on those features. We then devise a greedy algorithm to identify the pipelines that include the suitable components and can effectively answer the given question. We implement this model within Frankenstein, a QA framework able to select QA components and compose QA pipelines. We evaluate the effectiveness of the pipelines generated by Frankenstein using the QALD and LC-QuAD benchmarks. These results not only suggest that Frankenstein precisely solves the QA optimisation problem, but also enables the automatic composition of optimised QA pipelines, which outperform the static Baseline QA pipeline.  Thanks to this flexible and fully automated pipeline generation process, new QA components can be easily included in Frankenstein, thus improving the performance of the generated pipelines.", "citation": "Citations (2)", "departments": ["University of Bonn", "University of Minnesota", "DATEV", "University of Dayton", "University of Bonn"], "authors": ["Kuldeep Singh.....http://dblp.org/pers/hd/s/Singh:Kuldeep", "Arun Sethupat Radhakrishna.....http://dblp.org/pers/hd/r/Radhakrishna:Arun_Sethupat", "Andreas Both.....http://dblp.org/pers/hd/b/Both:Andreas", "Saeedeh Shekarpour.....http://dblp.org/pers/hd/s/Shekarpour:Saeedeh", "Ioanna Lytra.....http://dblp.org/pers/hd/l/Lytra:Ioanna", "Ricardo Usbeck.....http://dblp.org/pers/hd/u/Usbeck:Ricardo", "Akhilesh Vyas.....http://dblp.org/pers/hd/v/Vyas:Akhilesh", "Akmal Khikmatullaev.....http://dblp.org/pers/hd/k/Khikmatullaev:Akmal", "Dharmen Punjani.....http://dblp.org/pers/hd/p/Punjani:Dharmen", "Christoph Lange.....http://dblp.org/pers/hd/l/Lange_0002:Christoph", "Maria-Esther Vidal.....http://dblp.org/pers/hd/v/Vidal:Maria=Esther", "Jens Lehmann.....http://dblp.org/pers/hd/l/Lehmann:Jens", "Sören Auer.....http://dblp.org/pers/hd/a/Auer:S=ouml=ren"], "conf": "www", "year": "2018", "pages": 10}