{"title": "Controller Synthesis Made Real: Reach-Avoid Specifications and Linear Dynamics.", "fields": ["control theory", "controller", "linear system", "satisfiability", "theoretical computer science"], "abstract": "We address the problem of synthesizing provably correct controllers for linear systems with reach-avoid specifications. Our solution uses a combination of an open-loop controller and a tracking controller, thereby reducing the problem to smaller tractable problems. We show that, once a tracking controller is fixed, the reachable states from an initial neighborhood, subject to any disturbance, can be over-approximated by a sequence of ellipsoids, with sizes that are independent of the open-loop controller. Hence, the open-loop controller can be synthesized independently to meet the reach-avoid specification for an initial neighborhood. Exploiting several techniques for tightening the over-approximations, we reduce the open-loop controller synthesis problem to satisfiability over quantifier-free linear real arithmetic. The overall synthesis algorithm, computes a tracking controller, and then iteratively covers the entire initial set to find open-loop controllers for initial neighborhoods. The algorithm is sound and, for a class of robust systems, is also complete. We present RealSyn, a tool implementing this synthesis algorithm, and we show that it scales to several high-dimensional systems with complex reach-avoid specifications.", "citation": "Citations (1)", "year": "2018", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "cav", "authors": ["Chuchu Fan.....http://dblp.org/pers/hd/f/Fan:Chuchu", "Umang Mathur.....http://dblp.org/pers/hd/m/Mathur:Umang", "Sayan Mitra.....http://dblp.org/pers/hd/m/Mitra:Sayan", "Mahesh Viswanathan.....http://dblp.org/pers/hd/v/Viswanathan_0001:Mahesh"], "pages": 20}