{"title": "Reachable Set Over-Approximation for Nonlinear Systems Using Piecewise Barrier Tubes.", "fields": ["numerical integration", "small number", "taylor series", "interval arithmetic", "piecewise"], "abstract": "We address the problem of analyzing the reachable set of a polynomial nonlinear continuous system by over-approximating the flowpipe of its dynamics. The common approach to tackle this problem is to perform a numerical integration over a given time horizon based on Taylor expansion and interval arithmetic. However, this method results to be very conservative when there is a large difference in speed between trajectories as time progresses. In this paper, we propose to use combinations of barrier functions, which we call piecewise barrier tube (PBT), to over-approximate flowpipe. The basic idea of PBT is that for each segment of a flowpipe, a coarse box which is big enough to contain the segment is constructed using sampled simulation and then in the box we compute by linear programming a set of barrier functions (called barrier tube or BT for short) which work together to form a tube surrounding the flowpipe. The benefit of using PBT is that (1) BT is independent of time and hence can avoid being stretched and deformed by time; and (2) a small number of BTs can form a tight over-approximation for the flowpipe, which means that the computation required to decide whether the BTs intersect the unsafe set can be reduced significantly. We implemented a prototype called PBTS in C++. Experiments on some benchmark systems show that our approach is effective.", "citation": "Not cited", "year": "2018", "departments": ["Institute of Science and Technology Austria", "Vienna University of Technology", "Institute of Science and Technology Austria"], "conf": "cav", "authors": ["Hui Kong.....http://dblp.org/pers/hd/k/Kong:Hui", "Ezio Bartocci.....http://dblp.org/pers/hd/b/Bartocci:Ezio", "Thomas A. Henzinger.....http://dblp.org/pers/hd/h/Henzinger:Thomas_A="], "pages": 19}