{"title": "Contextual Outlier Interpretation.", "fields": ["anomaly detection", "interpretability", "feature selection", "outlier", "abnormality"], "abstract": "Outlier detection plays an essential role in many data-driven applications to identify isolated instances that are different from the majority. While many statistical learning and data mining techniques have been used for developing more effective outlier detection algorithms, the interpretation of detected outliers does not receive much attention. Interpretation is becoming increasingly important to help people trust and evaluate the developed models through providing intrinsic reasons why the certain outliers are chosen. It is difficult, if not impossible, to simply apply feature selection for explaining outliers due to the distinct characteristics of various detection models, complicated structures of data in certain applications, and imbalanced distribution of outliers and normal instances. In addition, the role of contrastive contexts where outliers locate, as well as the relation between outliers and contexts, are usually overlooked in interpretation. To tackle the issues above, in this paper, we propose a novel Contextual Outlier INterpretation (COIN) method to explain the abnormality of existing outliers spotted by detectors. The interpretability for an outlier is achieved from three aspects: outlierness score, attributes that contribute to the abnormality, and contextual description of its neighborhoods. Experimental results on various types of datasets demonstrate the flexibility and effectiveness of the proposed framework compared with existing interpretation approaches.", "citation": "Not cited", "departments": ["Texas A&M University", "Texas A&M University", "Texas A&M University"], "authors": ["Ninghao Liu.....http://dblp.org/pers/hd/l/Liu:Ninghao", "Donghwa Shin.....http://dblp.org/pers/hd/s/Shin:Donghwa", "Xia Hu.....http://dblp.org/pers/hd/h/Hu:Xia"], "conf": "ijcai", "year": "2018", "pages": 7}