{"title": "Human Perceptions of Fairness in Algorithmic Decision Making: A Case Study of Criminal Risk Prediction.", "fields": ["heuristic", "computer science", "perception", "ranging", "data mining"], "abstract": "Algorithms are increasingly used to make important decisions about human lives, ranging from social benefit assignment to predicting risk of criminal recidivism. The sensitivity of these decisions has raised important questions about ensuring fairness in algorithmic decision making. Recent work has focused on addressing two aspects of fairness: distributional fairness, concerning the fairness of the outcomes of decision making, and procedural fairness, concerning the fairness of the decision-making process. Assessment of procedural fairness relies on human judgments, for example, about the fairness of using certain features in the algorithm making the decision. Yet to our knowledge, almost no prior work examines people’s perceptions of fairness in algorithmic decision making. We propose a framework for understanding why people perceive certain features as fair to be used in algorithms. We define a framework of eight underlying properties of features, such as relevance, volitionality and reliability, and hypothesize that people use these properties to form a heuristic for making moral judgments about the fairness of feature use in decision-making algorithms. We evaluate our framework through a series of scenario-based surveys with 576 people. We find that, based on a person’s assessment of the eight underlying properties in our exemplar scenario, we can predict if they will perceive a feature as fair to be used with at least 87% accuracy.", "citation": "Citations (1)", "departments": ["Max Planck Society", "University of Maryland, College Park", "Max Planck Society", "University of Cambridge"], "authors": ["Nina Grgic-Hlaca.....http://dblp.org/pers/hd/g/Grgic=Hlaca:Nina", "Elissa M. Redmiles.....http://dblp.org/pers/hd/r/Redmiles:Elissa_M=", "Krishna P. Gummadi.....http://dblp.org/pers/hd/g/Gummadi:Krishna_P=", "Adrian Weller.....http://dblp.org/pers/hd/w/Weller:Adrian"], "conf": "www", "year": "2018", "pages": 10}