{"title": "Operator scaling with specified marginals.", "fields": ["operator", "hermitian matrix", "invariant theory", "noncommutative geometry", "tuple"], "abstract": "The completely positive maps, a generalization of the nonnegative matrices, are a well-studied class of maps from  n ×  n  matrices to  m ×  m  matrices. The existence of the operator analogues of doubly stochastic scalings of matrices, the study of which is known as  operator scaling , is equivalent to a multitude of problems in computer science and mathematics such rational identity testing in non-commuting variables, noncommutative rank of symbolic matrices, and a basic problem in invariant theory (Garg et. al., 2016). We study  operator scaling with specified marginals , which is the operator analogue of scaling matrices to specified row and column sums (or marginals). We characterize the operators which can be scaled to given marginals, much in the spirit of the Gurvits’ algorithmic characterization of the operators that can be scaled to doubly stochastic (Gurvits, 2004). Our algorithm, which is a modified version of Gurvits’ algorithm, produces approximate scalings in time poly( n , m ) whenever scalings exist. A central ingredient in our analysis is a reduction from operator scaling with specified marginals to operator scaling in the doubly stochastic setting. Instances of operator scaling with specified marginals arise in diverse areas of study such as the Brascamp-Lieb inequalities, communication complexity, eigenvalues of sums of Hermitian matrices, and quantum information theory. Some of the known theorems in these areas, several of which had no algorithmic proof, are straightforward consequences of our characterization theorem. For instance, we obtain a simple algorithm to find, when it exists, a tuple of Hermitian matrices with given spectra whose sum has a given spectrum. We also prove new theorems such as a generalization of Forster’s theorem (Forster, 2002) concerning radial isotropic position.", "citation": "Not cited", "departments": ["Rutgers University"], "authors": ["Cole Franks.....http://dblp.org/pers/hd/f/Franks:Cole"], "conf": "stoc", "year": "2018", "pages": 14}