{"title": "Space-Time Interpolants.", "fields": ["bounded function", "reachability", "soundness", "interval arithmetic", "piecewise"], "abstract": "Reachability analysis is difficult for hybrid automata with affine differential equations, because the reach set needs to be approximated. Promising abstraction techniques usually employ interval methods or template polyhedra. Interval methods account for dense time and guarantee soundness, and there are interval-based tools that overapproximate affine flowpipes. But interval methods impose bounded and rigid shapes, which make refinement expensive and fixpoint detection difficult. Template polyhedra, on the other hand, can be adapted flexibly and can be unbounded, but sound template refinement for unbounded reachability analysis has been implemented only for systems with piecewise constant dynamics. We capitalize on the advantages of both techniques, combining interval arithmetic and template polyhedra, using the former to abstract time and the latter to abstract space. During a CEGAR loop, whenever a spurious error trajectory is found, we compute additional space constraints and split time intervals, and use these space-time interpolants to eliminate the counterexample. Space-time interpolation offers a lazy, flexible framework for increasing precision while guaranteeing soundness, both for error avoidance and fixpoint detection. To the best of out knowledge, this is the first abstraction refinement scheme for the reachability analysis over unbounded and dense time of affine hybrid systems, which is both sound and automatic. We demonstrate the effectiveness of our algorithm with several benchmark examples, which cannot be handled by other tools.", "citation": "Not cited", "year": "2018", "departments": ["Centre national de la recherche scientifique", "Institute of Science and Technology Austria", "Institute of Science and Technology Austria"], "conf": "cav", "authors": ["Goran Frehse.....http://dblp.org/pers/hd/f/Frehse:Goran", "Mirco Giacobbe.....http://dblp.org/pers/hd/g/Giacobbe:Mirco", "Thomas A. Henzinger.....http://dblp.org/pers/hd/h/Henzinger:Thomas_A="], "pages": 19}