{"title": "DetReduce: minimizing Android GUI test suites for regression testing.", "fields": ["code coverage", "test suite", "regression testing", "software bug", "graphical user interface testing"], "abstract": "In recent years, several automated GUI testing techniques for Android apps have been proposed. These tools have been shown to be effective in achieving good test coverage and in finding bugs without human intervention. Being automated, these tools typically run for a long time (say, for several hours), either until they saturate test coverage or until a testing time budget expires. Thus, these automated tools are not good at generating concise regression test suites that could be used for testing in incremental development of the apps and in regression testing.   We propose a heuristic technique that helps create a small regression test suite for an Android app from a large test suite generated by an automated Android GUI testing tool. The key insight behind our technique is that if we can identify and remove some common forms of redundancies introduced by existing automated GUI testing tools, then we can drastically lower the time required to minimize a GUI test suite. We have implemented our algorithm in a prototype tool called D et R educe.  We applied D et R educe  to several Android apps and found that D et R educe  reduces a test-suite by an average factor of 16.9× in size and 14.7× in running time. We also found that for a test suite generated by running S wift H and  and a randomized test generation algorithm for 8 hours, D et R educe  minimizes the test suite in an average of 14.6 hours.", "citation": "Not cited", "departments": ["University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "University of Illinois at Urbana–Champaign"], "authors": ["Wontae Choi.....http://dblp.org/pers/hd/c/Choi:Wontae", "Koushik Sen.....http://dblp.org/pers/hd/s/Sen:Koushik", "George C. Necula.....http://dblp.org/pers/hd/n/Necula:George_C=", "Wenyu Wang.....http://dblp.org/pers/hd/w/Wang:Wenyu"], "conf": "icse", "year": "2018", "pages": 11}