{"title": "Social Presence and Cooperation in Large-Scale Multi-User Virtual Reality - The Relevance of Social Interdependence for Location-Based Environments.", "fields": ["immersion", "entertainment", "adventure", "task analysis", "illusion"], "abstract": "Introduction. An increasing number of location-based entertainment centers offers the possibility of entering multi-user virtual reality (VR) scenarios. Until now, neither cognition and emotions of users nor team experience have been scientifically evaluated in such an application. The present study investigated the gain of positive social interdependence while experiencing an adventure on the Immersive Deck of Illusion Walk (Berlin, Germany). Method. The preliminary version of a VR group adventure of the company was enriched by a task establishing social interdependence (IDP condition). The impact of IDP on social presence and cooperation (i.e., mutual importance) was evaluated relative to a control task without interdependence (nIDP condition). Results. Social IDP increased social presence and cooperation among participants. Additionally, behavioral involvement (part of presence), certain aspects of the adventure experience, and the affective evaluation during the experience were positively influenced by IDP. Discussion. The present study showed that interdependence can substantially enhance social presence and cooperation (i.e., mutual importance) in a VR setting already characterized by social co-experience. Thus, it revealed one design option (social IDP) to improve the experience, particularly the social experience, of location-based entertainment. Conclusion. The present research addressed one goal of location-based VR hosts to scientifically established design principles for social and collective adventures by supporting the impact of “collectively mastering an adventurous challenge”. In addition, our evaluation demonstrated that the multi-modal tracking, the free movement, as well as the multi-user features enabled natural interaction with other users and the environment, and thereby engendered a comfortable social experience.", "citation": "Not cited", "departments": ["University of Würzburg", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin"], "authors": ["Carolin Wienrich.....http://dblp.org/pers/hd/w/Wienrich:Carolin", "Kristina Schindler.....http://dblp.org/pers/hd/s/Schindler:Kristina", "Nina Döllinqer.....http://dblp.org/pers/hd/d/D=ouml=llinqer:Nina", "Simon Kock.....http://dblp.org/pers/hd/k/Kock:Simon", "Ole Traupe.....http://dblp.org/pers/hd/t/Traupe:Ole"], "conf": "vr", "year": "2018", "pages": 8}