{"title": "Neurophysiology of Visual-Motor Learning During a Simulated Marksmanship Task in Immersive Virtual Reality.", "fields": ["immersion", "controller", "motor skill", "motor learning", "task analysis"], "abstract": "Immersive virtual reality (VR) systems offer flexible control of an interactive environment, along with precise position and orientation tracking of realistic movements. Immersive VR can also be used in conjunction with neurophysiological monitoring techniques, such as electroencephalography (EEG), to record neural activity as users perform complex tasks. As such, the fusion of VR, kinematic tracking, and EEG offers a powerful testbed for naturalistic neuroscience research. In this study, we combine these elements to investigate the cognitive and neural mechanisms that underlie motor skill learning during a multi-day simulated marksmanship training regimen conducted with 20 participants. On each of 3 days, participants performed 8 blocks of 60 trials in which a simulated clay pigeon was launched from behind a trap house. Participants attempted to shoot the moving target with a firearm game controller, receiving immediate positional feedback and running scores after each shot. Over the course of the 3 days that individuals practiced this protocol, shot accuracy and precision improved significantly while reaction times got significantly faster. Furthermore, results demonstrate that more negative EEG amplitudes produced over the visual cortices correlate with better shooting performance measured by accuracy, reaction times, and response times, indicating that early visual system plasticity underlies behavioral learning in this task. These findings point towards a naturalistic neuroscience approach that can be used to identify neural markers of marksmanship performance.", "citation": "Not cited", "departments": ["Duke University", "Duke University", "Duke University", "Duke University", "Electrical and  ... ter Engigeering"], "authors": ["Jillian M. Clements.....http://dblp.org/pers/hd/c/Clements:Jillian_M=", "Regis Kopper.....http://dblp.org/pers/hd/k/Kopper:Regis", "David J. Zielinski.....http://dblp.org/pers/hd/z/Zielinski:David_J=", "Hrishikesh Rao.....http://dblp.org/pers/hd/r/Rao:Hrishikesh", "Marc A. Sommer.....http://dblp.org/pers/hd/s/Sommer:Marc_A=", "Elayna Kirsch.....http://dblp.org/pers/hd/k/Kirsch:Elayna", "Boyla O. Mainsah.....http://dblp.org/pers/hd/m/Mainsah:Boyla_O=", "Leslie M. Collins.....http://dblp.org/pers/hd/c/Collins:Leslie_M=", "Lawrence G. Appelbaum.....http://dblp.org/pers/hd/a/Appelbaum:Lawrence_G="], "conf": "vr", "year": "2018", "pages": 8}