{"title": "Towards optimal concolic testing.", "fields": ["markov decision process", "symbolic execution", "graphical user interface testing", "concolic testing", "random testing"], "abstract": "Concolic testing integrates concrete execution (e.g., random testing) and symbolic execution for test case generation. It is shown to be more cost-effective than random testing or symbolic execution sometimes. A concolic testing strategy is a function which decides when to apply random testing or symbolic execution, and if it is the latter case, which program path to symbolically execute. Many heuristics-based strategies have been proposed. It is still an open problem what is the optimal concolic testing strategy. In this work, we make two contributions towards solving this problem. First, we show the optimal strategy can be defined based on the probability of program paths and the cost of constraint solving. The problem of identifying the optimal strategy is then reduced to a model checking problem of Markov Decision Processes with Costs. Secondly, in view of the complexity in identifying the optimal strategy, we design a greedy algorithm for approximating the optimal strategy. We conduct two sets of experiments. One is based on randomly generated models and the other is based on a set of C programs. The results show that existing heuristics have much room to improve and our greedy algorithm often outperforms existing heuristics.", "citation": "Citations (1)", "departments": ["Zhejiang University", "Zhejiang University", "Singapore U. of ... ech. and Design", "National U. of  ... ense Technology", "Singapore U. of ... ech. and Design"], "authors": ["Xinyu Wang.....http://dblp.org/pers/hd/w/Wang_0001:Xinyu", "Jun Sun.....http://dblp.org/pers/hd/s/Sun_0001:Jun", "Zhenbang Chen.....http://dblp.org/pers/hd/c/Chen:Zhenbang", "Peixin Zhang.....http://dblp.org/pers/hd/z/Zhang:Peixin", "Jingyi Wang.....http://dblp.org/pers/hd/w/Wang:Jingyi", "Yun Lin.....http://dblp.org/pers/hd/l/Lin_0001:Yun"], "conf": "icse", "year": "2018", "pages": 12}