{"title": "Online Compact Convexified Factorization Machine.", "fields": ["binary classification", "feature engineering", "supervised learning", "regret", "factorization"], "abstract": "Factorization Machine (FM) is a supervised learning approach with a powerful capability of feature engineering. It yields state-of-the-art performance in various batch learning tasks where all the training data is available before training. However, due to the unavoidable expensive re-training cost, it is clearly impractical for many real-world applications where the data arrives sequentially in a streaming manner. We address this limitation by developing an online learning algorithm for Factorization Machine. The primal challenge of this problem stems from the requirements in Online Convex Optimization, the paramount framework for online learning algorithm design. As no previous formulations for FM meet the requirements in OCO, we first invent a new convexification scheme and the resulting Compact Convexified FM (CCFM)  seamlessly meets the requirements. For learning Compact Convexified FM in the online learning setting, most existing algorithms suffer from the expensive projection operation, which is another challenge of the problem. To tackle this challenge, we follow the general projection-free algorithmic framework of Online Conditional Gradient and propose an Online Compact Convex Factorization Machine (OCCFM) algorithm that eschews the projection operation with efficient linear optimization steps. We prove that the proposed algorithm achieves a sub-linear regret bound, which provides theoretical guarantee for its usefulness. To evaluate the empirical performance of OCCFM, we conduct extensive experiments on 6 real-world datasets for recommendation and binary classification tasks. The experimental results show that OCCFM outperforms the state-of-art online  learning algorithms.", "citation": "Citations (1)", "departments": ["Tsinghua University", "Tsinghua University", "South China University of Technology", "Tsinghua University", "Tsignhua Univer ... Beijing, China"], "authors": ["Xiao Lin.....http://dblp.org/pers/hd/l/Lin_0002:Xiao", "Wenpeng Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Wenpeng", "Min Zhang.....http://dblp.org/pers/hd/z/Zhang:Min", "Wenwu Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Wenwu", "Jian Pei.....http://dblp.org/pers/hd/p/Pei:Jian", "Peilin Zhao.....http://dblp.org/pers/hd/z/Zhao:Peilin", "Junzhou Huang.....http://dblp.org/pers/hd/h/Huang:Junzhou"], "conf": "www", "year": "2018", "pages": 10}