{"title": "Automatically finding bugs in a commercial cyber-physical system development tool chain with SLforge.", "fields": ["cyber physical system", "computer engineering", "hardening", "object oriented modeling", "software bug"], "abstract": "Cyber-physical system (CPS) development tool chains are widely used in the design, simulation, and verification of CPS data-flow models. Commercial CPS tool chains such as MathWorks' Simulink generate artifacts such as code binaries that are widely deployed in embedded systems. Hardening such tool chains by testing is crucial since formally verifying them is currently infeasible. Existing differential testing frameworks such as CyFuzz can not generate models rich in language features, partly because these tool chains do not leverage the available informal Simulink specifications. Furthermore, no study of existing Simulink models is available, which could guide CyFuzz to generate realistic models.   To address these shortcomings, we created the first large collection of public Simulink models and used the collected models' properties to guide random model generation. To further guide model generation we systematically collected semi-formal Simulink specifications. In our experiments on several hundred models, the resulting SLforge generator was more effective and efficient than the state-of-the-art tool CyFuzz. SLforge also found 8 new confirmed bugs in Simulink.", "citation": "Citations (3)", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "Vanderbilt University"], "authors": ["Shafiul Azam Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Shafiul_Azam", "Soumik Mohian.....http://dblp.org/pers/hd/m/Mohian:Soumik", "Sidharth Mehra.....http://dblp.org/pers/hd/m/Mehra:Sidharth", "Siddhant Gawsane.....http://dblp.org/pers/hd/g/Gawsane:Siddhant", "Taylor T. Johnson.....http://dblp.org/pers/hd/j/Johnson:Taylor_T=", "Christoph Csallner.....http://dblp.org/pers/hd/c/Csallner:Christoph"], "conf": "icse", "year": "2018", "pages": 12}