{"title": "Aladdin: Automating Release of Deep-Link APIs on Android.", "fields": ["program analysis", "landing page", "software deployment", "android", "uniform resource identifier"], "abstract": "Compared to the Web where each web page has a global URL for external access, a specific “page” inside a mobile app cannot be easily accessed unless the user performs several steps from the landing page of this app. Recently, the concept of “deep link” is expected to be a promising solution and has been advocated by major service providers to enable targeting and opening a specific page of an app externally with an accessible uniform resource identifier. This paper makes a large-scale empirical study to investigate how deep links are really adopted, over 25,000 Android apps. To our surprise, we find that deep links have quite low coverage, e.g., more than 70% and 90% of the apps do not have deep links on Wandoujia and Google Play, respectively. One underlying reason is the mandatory and non-trivial manual efforts of app developers to provide APIs for deep links. We then propose the Aladdin approach along with its supporting tool to help developers practically automate the release of deep-link APIs to access locations inside their apps. Aladdin includes a novel cooperative framework by synthesizing the static analysis and the dynamic analysis while minimally engaging developers’ inputs and configurations, without requiring any coding efforts or additional deployment efforts. We evaluate Aladdin with 579 popular apps and demonstrate its effectiveness and performance.", "citation": "Not cited", "departments": ["Tsinghua University", "Peking University", "Microsoft", "University of Illinois at Urbana–Champaign", "Peking University"], "authors": ["Yun Ma.....http://dblp.org/pers/hd/m/Ma:Yun", "Ziniu Hu.....http://dblp.org/pers/hd/h/Hu:Ziniu", "Yunxin Liu.....http://dblp.org/pers/hd/l/Liu:Yunxin", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "Xuanzhe Liu.....http://dblp.org/pers/hd/l/Liu:Xuanzhe"], "conf": "www", "year": "2018", "pages": 10}