{"title": "Facet Annotation Using Reference Knowledge Bases.", "fields": ["faceted search", "monad", "predicate", "semantic similarity", "facet"], "abstract": "Faceted interfaces are omnipresent on the web to support data exploration and filtering. A facet is a triple: a domain (e.g., book), a property (e.g., author, language), and a set of values (e.g., {Austen, Beauvoir, Coelho, Dostoevsky, Eco, Kerouac, Su?skind,. . .}, {French, English, German, Italian, Portuguese, Russian,. . .}). Given a property, a set of homogeneous values can be used to select those domain entities whose property values match the given set of values (e.g., given English and Italian, the book entities that have authors Austen, Eco, Kerouac,…, are selected). Multiple properties and respective values can be considered at the same time or applied successively. To implement faceted interfaces in a way that is scalable to very large datasets, it is necessary to automate the process of extracting facets. Prior work considers the problem of associating a set of homogeneous values with a facet domain, but does not annotate a facet property. In this paper, we annotate a facet property with a predicate from a reference Knowledge Base (KB) so as to maximize the semantic similarity between the property and the predicate. We define semantic similarity in terms of three new metrics: specificity, coverage, and frequency. Our experimental evaluation uses the DBpedia and YAGO KBs and shows that for the facet annotation problem, we obtain better results than a state-of-the-art approach for the annotation of web tables as modified to annotate a set of values.", "citation": "Not cited", "departments": ["University of Milan", "University of Illinois at Chicago", "Mia-platform, Milan, Italy"], "authors": ["Riccardo Porrini.....http://dblp.org/pers/hd/p/Porrini:Riccardo", "Matteo Palmonari.....http://dblp.org/pers/hd/p/Palmonari:Matteo", "Isabel F. Cruz.....http://dblp.org/pers/hd/c/Cruz:Isabel_F="], "conf": "www", "year": "2018", "pages": 10}