{"title": "Never-Ending Learning for Open-Domain Question Answering over Knowledge Bases.", "fields": ["semantic similarity", "software deployment", "small number", "sparql", "template"], "abstract": "Translating natural language questions to semantic representations such as SPARQL is a core challenge in open-domain question answering over knowledge bases (KB-QA). Existing methods rely on a clear separation between an offline training phase, where a model is learned, and an online phase where this model is deployed to answer users’ questions. Two major shortcomings are that such methods require access to a large training set, which is not always readily available, and that they fail on questions from domains not seen during training. To overcome these limitations, this paper presents a continuous learning paradigm for KB-QA, called NEQA. Offline, NEQA automatically learns templates from a small number of training question-answer pairs. Once deployed, continuous learning is triggered on cases where templates are insufficient. Using a semantic similarity function between questions and by judicious invocation of non-expert user feedback, NEQA learns new templates that capture previously-unseen syntactic structures. This way, NEQA gradually extends and improves its template repository. NEQA periodically re-trains its underlying models, allowing it to adapt to the language used after deployment. Our experiments demonstrate NEQA’s practical viability, with steady improvement in answering quality over time, and the gains on questions from previously-unobserved domains.", "citation": "Citations (1)", "departments": ["Max Planck Society", "Max Planck Society", "Bloomberg L.P.", "Max Planck Society"], "authors": ["Abdalghani Abujabal.....http://dblp.org/pers/hd/a/Abujabal:Abdalghani", "Rishiraj Saha Roy.....http://dblp.org/pers/hd/r/Roy:Rishiraj_Saha", "Mohamed Yahya.....http://dblp.org/pers/hd/y/Yahya:Mohamed", "Gerhard Weikum.....http://dblp.org/pers/hd/w/Weikum:Gerhard"], "conf": "www", "year": "2018", "pages": 10}