{"title": "Average-Case Approximation Ratio of Scheduling Without Payments.", "fields": ["optimal mechanism", "bounded function", "scheduling", "game theory", "algorithmic mechanism design"], "abstract": "Apart from the principles and methodologies inherited from Economics and Game Theory, the studies in Algorithmic Mechanism Design typically employ the \\emph{worst-case analysis} and \\emph{approximation schemes} of Theoretical Computer Science. For instance, the \\emph{approximation ratio}, which is the canonical measure of evaluating how well an incentive-compatible mechanism approximately optimizes the objective, is defined in the worst-case sense. It compares the performance of the optimal mechanism against the performance of a truthful mechanism, for all possible inputs.    In this paper, we take the \\emph{average-case analysis} approach, and tackle one of the primary motivating problems in Algorithmic Mechanism Design -- the scheduling problem~\\cite{NR99}. One version of this problem which includes a verification component is studied by~\\citet{DBLP:journals/mst/Koutsoupias14}. It was shown that the problem has a tight approximation ratio bound of $(n+1)/2$ for the single-task setting, where $n$ is the number of machines. We show, however, when the costs of the machines to executing the task follow \\emph{any} independent and identical distribution, the \\emph{average-case approximation ratio} of the mechanism given in ~\\cite{DBLP:journals/mst/Koutsoupias14} is upper bounded by a constant. This positive result asymptotically separates the average-case ratio from the worst-case ratio, and indicates that the optimal mechanism for the problem actually works well on average, although in the worst-case the expected cost of the mechanism is $\\Theta{(n)}$ times that of the optimal cost.", "citation": "Not cited", "departments": ["University of Southampton"], "authors": ["Jie Zhang.....http://dblp.org/pers/hd/z/Zhang_0008:Jie"], "conf": "aaai", "year": "2018", "pages": 8}