{"title": "A framework for ETH-tight algorithms and lower bounds in geometric intersection graphs.", "fields": ["exponential time hypothesis", "steiner tree problem", "dominating set", "treewidth", "embedding"], "abstract": "We give an algorithmic and lower-bound framework that facilitates the construction of subexponential algorithms and matching conditional complexity bounds. It can be applied to a wide range of geometric intersection graphs (intersections of similarly sized fat objects), yielding algorithms with running time 2  O ( n  1−1/ d  )  for any fixed dimension  d ≥ 2 for many well known graph problems, including Independent Set,  r -Dominating Set for constant  r , and Steiner Tree. For most problems, we get improved running times compared to prior work; in some cases, we give the first known subexponential algorithm in geometric intersection graphs. Additionally, most of the obtained algorithms work on the graph itself, i.e., do not require any geometric information. Our algorithmic framework is based on a weighted separator theorem and various treewidth techniques.    The lower-bound framework is based on a constructive embedding of graphs into  d -dimensional grids, and it allows us to derive matching 2 Ω( n  1−1/ d  )  lower bounds under the Exponential Time Hypothesis even in the much more restricted class of  d -dimensional induced grid graphs.", "citation": "Not cited", "year": "2018", "departments": ["Eindhoven University of Technology", "Eindhoven University of Technology", "Eindhoven University of Technology", "Hungarian Academy of Sciences", "Utrecht University"], "conf": "stoc", "authors": ["Mark de Berg.....http://dblp.org/pers/hd/b/Berg:Mark_de", "Hans L. Bodlaender.....http://dblp.org/pers/hd/b/Bodlaender:Hans_L=", "Sándor Kisfaludi-Bak.....http://dblp.org/pers/hd/k/Kisfaludi=Bak:S=aacute=ndor", "Dániel Marx.....http://dblp.org/pers/hd/m/Marx:D=aacute=niel", "Tom C. van der Zanden.....http://dblp.org/pers/hd/z/Zanden:Tom_C=_van_der"], "pages": 13}