{"title": "Simulation beats richness: new data-structure lower bounds.", "fields": ["data structure", "mathematics", "combinatorics", "orthogonality", "species richness", "existential quantification", "communication complexity", "discrete mathematics", "boolean function", "alice and bob"], "abstract": "We develop a new technique for proving lower bounds in the setting of asymmetric communication, a model that was introduced in the famous works of Miltersen (STOC’94) and Miltersen, Nisan, Safra and Wigderson (STOC’95). At the core of our technique is the first simulation theorem in the asymmetric setting, where Alice gets a  p  ×  n  matrix  x  over F 2  and Bob gets a vector  y  ∈ F 2   n  . Alice and Bob need to evaluate  f ( x ·  y ) for a Boolean function  f : {0,1}  p   → {0,1}. Our simulation theorems show that a deterministic/randomized communication protocol exists for this problem, with cost  C ·  n  for Alice and  C  for Bob, if and only if there exists a deterministic/randomized *parity decision tree* of cost Θ( C ) for evaluating  f .    As applications of this technique, we obtain the following results:    1. The first strong lower-bounds against randomized data-structure schemes for the Vector-Matrix-Vector product problem over F 2 . Moreover, our method yields strong lower bounds even when the data-structure scheme has tiny advantage over random guessing.    2. The first lower bounds against randomized data-structures schemes for two natural Boolean variants of Orthogonal Vector Counting.    3. We construct an asymmetric communication problem and obtain a deterministic lower-bound for it which is provably better than any lower-bound that may be obtained by the classical Richness Method of Miltersen et al. (STOC ’95). This seems to be the first known limitation of the Richness Method in the context of proving deterministic lower bounds.", "citation": "Not cited", "year": "2018", "departments": ["Tata Institute of Fundamental Research", "Charles University in Prague", "University of Porto", "Royal Institute of Technology"], "conf": "stoc", "authors": ["Arkadev Chattopadhyay.....http://dblp.org/pers/hd/c/Chattopadhyay:Arkadev", "Michal Koucký.....http://dblp.org/pers/hd/k/Kouck=yacute=:Michal", "Bruno Loff.....http://dblp.org/pers/hd/l/Loff:Bruno", "Sagnik Mukhopadhyay.....http://dblp.org/pers/hd/m/Mukhopadhyay:Sagnik"], "pages": 8}