{"title": "Variational Autoencoders for Collaborative Filtering.", "fields": ["recommender system", "principle of maximum entropy", "generative model", "collaborative filtering", "language model"], "abstract": "We extend variational autoencoders (VAEs) to collaborative filtering for implicit feedback. This non-linear probabilistic model enables us to go beyond the limited modeling capacity of linear factor models which still largely dominate collaborative filtering research. We introduce a generative model with multinomial likelihood and use Bayesian inference to learn this powerful generative model. Despite widespread use in language modeling and economics, the multinomial likelihood receives less attention in the recommender systems literature. We introduce a different regularization parameter for the learning objective, which proves to be crucial for achieving competitive performance. Remarkably, there is an efficient way to tune the parameter using annealing. The resulting model and learning algorithm has information-theoretic connections to maximum entropy discrimination and the information bottleneck principle. Empirically, we show that the proposed approach significantly outperforms several state-of-the-art baselines, including two recently-proposed neural network approaches, on several real-world datasets. We also provide extended experiments comparing the multinomial likelihood with other commonly used likelihood functions in the latent factor collaborative filtering literature and show favorable results. Finally, we identify the pros and cons of employing a principled Bayesian inference approach and characterize settings where it provides the most significant improvements.", "citation": "Citations (3)", "departments": ["Netflix", "Massachusetts Institute of Technology", "Google", "Netflix"], "authors": ["Dawen Liang.....http://dblp.org/pers/hd/l/Liang:Dawen", "Rahul G. Krishnan.....http://dblp.org/pers/hd/k/Krishnan:Rahul_G=", "Matthew D. Hoffman.....http://dblp.org/pers/hd/h/Hoffman:Matthew_D=", "Tony Jebara.....http://dblp.org/pers/hd/j/Jebara:Tony"], "conf": "www", "year": "2018", "pages": 10}