{"title": "EVA", "fields": ["angioplasty", "montmorillonite", "endarterectomy", "copolymer", "stroke", "tertiary sector of the economy", "asymptomatic", "solar cell", "carotid endarterectomy", "carotid stenting", "risk factor", "internal medicine", "adhesive", "economic value added", "return on investment", "nanocomposite", "clinical endpoint", "cost of capital", "stenosis", "breast cancer", "mammography", "shareholder value", "nopat", "earnings", "accrual", "generally accepted accounting principles", "breast disease", "ultraviolet", "composite material", "financial management", "enterprise value", "cash flow", "silicate", "operating cash flow", "humidity", "vinyl acetate", "earnings per share"], "abstract": "Summary  Background  Carotid stenting is a potential alternative to carotid endarterectomy but whether this technique is as safe as surgery and whether the long-term protection against stroke is similar to that of surgery are unclear. We previously reported that in patients in the Endarterectomy Versus Angioplasty in Patients with Symptomatic Severe Carotid Stenosis (EVA-3S) trial, the rate of any stroke or death within 30 days after the procedure was higher with stenting than with endarterectomy. We now report the results up to 4 years.  Methods  In this follow-up study of a multicentre, randomised, open, assessor-blinded, non-inferiority trial, we compared outcome after stenting with outcome after endarterectomy in 527 patients who had carotid stenosis of at least 60% that had recently become symptomatic. The primary endpoint of the EVA-3S trial was the rate of any periprocedural stroke or death (ie, within 30 days after the procedure). The prespecified main secondary endpoint was a composite of any periprocedural stroke or death and any non-procedural ipsilateral stroke during up to 4 years of follow-up. Other trial outcomes were any stroke or periprocedural death, any stroke or death, and the above endpoints restricted to disabling or fatal strokes. This trial is registered with ClinicalTrials.gov, number NCT00190398.  Findings  262 patients were randomly assigned to endarterectomy and 265 to stenting. The cumulative probability of periprocedural stroke or death and non-procedural ipsilateral stroke after 4 years of follow-up was higher with stenting than with endarterectomy (11·1%  vs  6·2%, hazard ratio [HR] 1·97, 95% CI 1·06–3·67; p=0·03). The HR for periprocedural disabling stroke or death and non-procedural fatal or disabling ipsilateral stroke was 2·00 (0·75–5·33; p=0·17). A hazard function analysis showed the 4-year differences in the cumulative probabilities of outcomes between stenting and endarterectomy were largely accounted for by the higher periprocedural (within 30 days of the procedure) risk of stenting compared with endarterectomy. After the periprocedural period, the risk of ipsilateral stroke was low and similar in both treatment groups. For any stroke or periprocedural death, the HR was 1·77 (1·03–3·02; p=0·04). For any stroke or death, the HR was 1·39 (0·96–2·00; p=0·08).  Interpretation  The results of this study suggest that carotid stenting is as effective as carotid endarterectomy for middle-term prevention of ipsilateral stroke, but the safety of carotid stenting needs to be improved before it can be used as an alternative to carotid endarterectomy in patients with symptomatic carotid stenosis.  Funding  French Ministry of Health.", "citation": "Citations (598)", "departments": ["Paris Descartes University", "Paris Descartes University", "Paul Sabatier University", "Paul Sabatier University", "Hong Kong University of Science and Technology", "University of Washington", "University of San Diego", "University of California, Irvine", "University of Bonn", "Hôpital Roger S ... , Lille, France", "Dipartimento do ... 5 Torino, Italy", "Dipartimento do ... 5 Torino, Italy", "Freiburger Mate ... i. Br., Germany", "Freiburger Mate ... i. Br., Germany"], "authors": ["Mark Buckler.....http://dblp.org/pers/hd/b/Buckler:Mark", "Philip Bedoukian.....http://dblp.org/pers/hd/b/Bedoukian:Philip", "Suren Jayasuriya.....http://dblp.org/pers/hd/j/Jayasuriya:Suren", "Adrian Sampson.....http://dblp.org/pers/hd/s/Sampson:Adrian"], "conf": "isca", "year": "2018", "pages": 14}