{"title": "Mining Tours and Paths in Activity Networks.", "fields": ["connected space", "integer", "machine learning", "mobile device", "social network"], "abstract": "The proliferation of online social networks and the spread of smart mobile devices enable the collection of information related to a multitude of users’ activities. These networks, where every node is associated with a type of action and a frequency, are usually referred to as activity networks. Examples of such networks include city road networks, where the nodes are intersections and the edges are road segments. Each node is associated with a number of geolocated actions that users of an online platform took in its vicinity. In these networks, we define a prize-collecting subgraph to be a connected set of nodes, which is compact, i.e., the nodes are close to each other, and exhibits high levels of activity. The k-PCSubgraphs problem we address in this paper is defined as follows: given an activity network and an integer k, identify k non-overlapping and connected subgraphs of the network such that the nodes of each subgraph are close to each other, and the number of actions that they are associated with is high. Here, we define and study two new variants of the k-PCSubgraphs problem, where the subgraphs of interest are tours and paths. Since both these problems are NP-hard, we provide approximate algorithms that solve them in time almost linear to the number of edges. In our experiments, we use real activity networks obtained by combining actual city road networks and projecting on them user activity from Twitter and Flickr. Our experimental results demonstrate both the efficiency and the practical utility of our methods.", "citation": "Not cited", "departments": ["Boston University", "Boston University", "Boston University", "Boston University"], "authors": ["Sofia Maria Nikolakaki.....http://dblp.org/pers/hd/n/Nikolakaki:Sofia_Maria", "Charalampos Mavroforakis.....http://dblp.org/pers/hd/m/Mavroforakis:Charalampos", "Alina Ene.....http://dblp.org/pers/hd/e/Ene:Alina", "Evimaria Terzi.....http://dblp.org/pers/hd/t/Terzi:Evimaria"], "conf": "www", "year": "2018", "pages": 10}