{"title": "Fine-grained Concept Linking using Neural Networks in Healthcare.", "fields": ["snippet", "empirical research", "architecture", "artificial neural network", "data mining"], "abstract": "To unlock the wealth of the healthcare data, we often need to link the real-world text snippets to the referred medical concepts described by the canonical descriptions. However, existing healthcare concept linking methods, such as dictionary-based and simple machine learning methods, are not effective due to the word discrepancy between the text snippet and the canonical concept description, and the overlapping concept meaning among the fine-grained concepts. To address these challenges, we propose a Neural Concept Linking (NCL) approach for accurate concept linking using systematically integrated neural networks. We call the novel neural network architecture as the COMposite AttentIonal encode-Decode neural network (COM-AID). COM-AID performs an encode-decode process that encodes a concept into a vector and decodes the vector into a text snippet with the help of two devised contexts. On the one hand, it injects the textual context into the neural network through the attention mechanism, so that the word discrepancy can be overcome from the semantic perspective. On the other hand, it incorporates the structural context into the neural network through the attention mechanism, so that minor concept meaning differences can be enlarged and effectively differentiated. Empirical studies on two real-world datasets confirm that the NCL produces accurate concept linking results and significantly outperforms state-of-the-art techniques.", "citation": "Not cited", "year": "2018", "departments": ["National University of Singapore", "Beijing Institute of Technology", "Zhejiang University", "Renmin University of China", "University Health System"], "conf": "sigmod", "authors": ["Jian Dai.....http://dblp.org/pers/hd/d/Dai:Jian", "Meihui Zhang.....http://dblp.org/pers/hd/z/Zhang:Meihui", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Ju Fan.....http://dblp.org/pers/hd/f/Fan:Ju", "Kee Yuan Ngiam.....http://dblp.org/pers/hd/n/Ngiam:Kee_Yuan", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin"], "pages": 16}