{"title": "Hiding Intermittent Information Leakage with Architectural Support for Blinking.", "fields": ["exploit", "information leakage", "mutual information", "system on a chip", "side channel attack"], "abstract": "As demonstrated by numerous practical attacks, the physical act of computation emits unintended and damaging information through infinitesimal variations in timing, power, and resource contention. While there are many techniques for preventing the leakage of information through power channels for specific cryptographic units, they are typically either built directly into the hardware logic or exploit intricate mathematical properties of the algorithm itself. However, such leaks are not uniform in time but, as we show, rather occur in specific bursts. Exploiting this observation we propose a set of software-controlled techniques allowing for the seamless disconnection and reconnection of general purpose programmable components in a system-on-chip. Such a system is capable of providing brief moments of electrical isolation during which the most critical computations can be performed free from both timing and power measurement. Of course, disconnection comes at a cost. To balance the resulting trade-off between overhead and security effectively, we describe a new analysis technique to uncover the \"leakiest\" intervals of time, we provide an algorithm to co-optimize the covering of these intervals and the performance/energy costs under a set of architecture imposed constraints, and explore the architectural and software ramifications of such intermittent disconnection. In the end we find that by hiding only between 15% and 30% of the trace, at a performance cost of between 15% and 50%, we are able to reduce the mutual information between the leakage model and key bits by 75% on average, and to nearly zero in specific cases.", "citation": "Not cited", "departments": ["University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "University of Washington", "University of Washington", "University of California, Berkeley", "University of California"], "authors": ["Alric Althoff.....http://dblp.org/pers/hd/a/Althoff:Alric", "Joseph McMahan.....http://dblp.org/pers/hd/m/McMahan:Joseph", "Luis Vega Gutierrez.....http://dblp.org/pers/hd/g/Gutierrez:Luis_Vega", "Scott Davidson.....http://dblp.org/pers/hd/d/Davidson:Scott", "Timothy Sherwood.....http://dblp.org/pers/hd/s/Sherwood:Timothy", "Michael Bedford Taylor.....http://dblp.org/pers/hd/t/Taylor:Michael_Bedford", "Ryan Kastner.....http://dblp.org/pers/hd/k/Kastner:Ryan"], "conf": "isca", "year": "2018", "pages": 12}