{"title": "CD-CNN: A Partially Supervised Cross-Domain Deep Learning Model for Urban Resident Recognition.", "fields": ["deep learning", "questionnaire", "mobile broadband", "convolutional neural network", "mobile phone"], "abstract": "Driven by the wave of urbanization in recent decades, the research topic about migrant behavior analysis draws great attention from both academia and the government. Nevertheless, subject to the cost of data collection and the lack of modeling methods, most of existing studies use only questionnaire surveys with sparse samples and non-individual level statistical data to achieve coarse-grained studies of migrant behaviors. In this paper, a partially supervised cross-domain deep learning model named CD-CNN is proposed for migrant/native recognition using mobile phone signaling data as behavioral features and questionnaire survey data as incomplete labels. Specifically, CD-CNN features in decomposing the mobile data into location domain and communication domain, and adopts a joint learning framework that combines two convolutional neural networks with a feature balancing scheme. Moreover, CD-CNN employs a three-step algorithm for training, in which the co-training step is of great value to partially supervised cross-domain learning. Comparative experiments on the city Wuxi demonstrate the high predictive power of CD-CNN. Two interesting applications further highlight the ability of CD-CNN for in-depth migrant behavioral analysis.", "citation": "Citations (3)", "departments": ["Beihang University", "Beihang University", "Beihang University", "Microsoft"], "authors": ["Jingyuan Wang.....http://dblp.org/pers/hd/w/Wang:Jingyuan", "Xu He.....http://dblp.org/pers/hd/h/He:Xu", "Ze Wang.....http://dblp.org/pers/hd/w/Wang:Ze", "Junjie Wu.....http://dblp.org/pers/hd/w/Wu:Junjie", "Nicholas Jing Yuan.....http://dblp.org/pers/hd/y/Yuan:Nicholas_Jing", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Zhang Xiong.....http://dblp.org/pers/hd/x/Xiong:Zhang"], "conf": "aaai", "year": "2018", "pages": 8}