{"title": "Semi-supervised Deep Generative Modelling of Incomplete Multi-Modality Emotional Data.", "fields": ["generative grammar", "emotion recognition", "gaussian", "imputation", "modalities"], "abstract": "There are threefold challenges in emotion recognition. First, it is difficult to recognize human's emotional states only considering a single modality. Second, it is expensive to manually annotate the emotional data. Third, emotional data often suffers from missing modalities due to unforeseeable sensor malfunction or configuration issues. In this paper, we address all these problems under a novel multi-view deep generative framework. Specifically, we propose to model the statistical relationships of multi-modality emotional data using multiple modality-specific generative networks with a shared latent space. By imposing a Gaussian mixture assumption on the posterior approximation of the shared latent variables, our framework can learn the joint deep representation from multiple modalities and evaluate the importance of each modality simultaneously. To solve the labeled-data-scarcity problem, we extend our multi-view model to semi-supervised learning scenario by casting the semi-supervised classification problem as a specialized missing data imputation task. To address the missing-modality problem, we further extend our semi-supervised multi-view model to deal with incomplete data, where a missing view is treated as a latent variable and integrated out during inference. This way, the proposed overall framework can utilize all available (both labeled and unlabeled, as well as both complete and incomplete) data to improve its generalization ability. The experiments conducted on two real multi-modal emotion datasets demonstrated the superiority of our framework.", "citation": "Not cited", "year": "2018", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Shanghai Jiao Tong University", "360 Search Lab, Beijing, China", "360 Search Lab, Beijing, China"], "conf": "mm", "authors": ["Changde Du.....http://dblp.org/pers/hd/d/Du:Changde", "Changying Du.....http://dblp.org/pers/hd/d/Du:Changying", "Hao Wang.....http://dblp.org/pers/hd/w/Wang:Hao", "Jinpeng Li.....http://dblp.org/pers/hd/l/Li:Jinpeng", "Wei-Long Zheng.....http://dblp.org/pers/hd/z/Zheng:Wei=Long", "Bao-Liang Lu.....http://dblp.org/pers/hd/l/Lu:Bao=Liang", "Huiguang He.....http://dblp.org/pers/hd/h/He:Huiguang"], "pages": 9}