{"title": "Spatio-temporal context reduction: a pointer-analysis-based static approach for detecting use-after-free vulnerabilities.", "fields": ["test case", "test suite", "program analysis", "software bug", "pointer analysis"], "abstract": "Zero-day Use-After-Free (UAF) vulnerabilities are increasingly popular and highly dangerous, but few mitigations exist. We introduce a new pointer-analysis-based static analysis, CR ed , for finding UAF bugs in multi-MLOC C source code efficiently and effectively. CR ed  achieves this by making three advances: (i) a spatio-temporal context reduction technique for scaling down soundly and precisely the exponential number of contexts that would otherwise be considered at a pair of free and use sites, (ii) a multi-stage analysis for filtering out false alarms efficiently, and (iii) a path-sensitive demand-driven approach for finding the points-to information required.   We have implemented CR ed  in LLVM-3.8.0 and compared it with four different state-of-the-art static tools: CBMC (model checking), C lang  (abstract interpretation), C occinelle  (pattern matching), and S upa  (pointer analysis) using all the C test cases in Juliet Test Suite (JTS) and 10 open-source C applications. For the ground-truth validated with JTS, CR ed  detects all the 138 known UAF bugs as CBMC and S upa  do while C lang  and C occinelle  miss some bugs, with no false alarms from any tool. For practicality validated with the 10 applications (totaling 3+ MLOC), CR ed  reports 132 warnings including 85 bugs in 7.6 hours while the existing tools are either unscalable by terminating within 3 days only for one application (CBMC) or impractical by finding virtually no bugs (C lang  and C occinelle ) or issuing an excessive number of false alarms (S upa ).", "citation": "Not cited", "departments": ["University of New South Wales", "University of Technology, Sydney", "Commonwealth Scientific and Industrial Research Organisation", "University of New South Wales"], "authors": ["Hua Yan.....http://dblp.org/pers/hd/y/Yan:Hua", "Yulei Sui.....http://dblp.org/pers/hd/s/Sui:Yulei", "Shiping Chen.....http://dblp.org/pers/hd/c/Chen:Shiping", "Jingling Xue.....http://dblp.org/pers/hd/x/Xue:Jingling"], "conf": "icse", "year": "2018", "pages": 11}