{"title": "Compiler-Assisted Code Randomization.", "fields": ["address space layout randomization", "software deployment", "toolchain", "basic block", "software distribution"], "abstract": "Despite decades of research on software diversification, only address space layout randomization has seen widespread adoption. Code randomization, an effective defense against return-oriented programming exploits, has remained an academic exercise mainly due to i) the lack of a transparent and streamlined deployment model that does not disrupt existing software distribution norms, and ii) the inherent incompatibility of program variants with error reporting, whitelisting, patching, and other operations that rely on code uniformity. In this work we present compiler-assisted code randomization (CCR), a hybrid approach that relies on compiler–rewriter cooperation to enable fast and robust fine-grained code randomization on end-user systems, while maintaining compatibility with existing software distribution models. The main concept behind CCR is to augment binaries with a minimal set of transformation-assisting metadata, which i) facilitate rapid fine-grained code transformation at installation or load time, and ii) form the basis for reversing any applied code transformation when needed, to maintain compatibility with existing mechanisms that rely on referencing the original code. We have implemented a prototype of this approach by extending the LLVM compiler toolchain, and developing a simple binary rewriter that leverages the embedded metadata to generate randomized variants using basic block reordering. The results of our experimental evaluation demonstrate the feasibility and practicality of CCR, as on average it incurs a modest file size increase of 11.46% and a negligible runtime overhead of 0.28%, while it is compatible with link-time optimization and control flow integrity.", "citation": "Citations (1)", "departments": ["Stony Brook University", "Northeastern University", "Northeastern University", "Brown University", "Stony Brook University"], "authors": ["Hyungjoon Koo.....http://dblp.org/pers/hd/k/Koo:Hyungjoon", "Yaohui Chen.....http://dblp.org/pers/hd/c/Chen:Yaohui", "Long Lu.....http://dblp.org/pers/hd/l/Lu:Long", "Vasileios P. Kemerlis.....http://dblp.org/pers/hd/k/Kemerlis:Vasileios_P=", "Michalis Polychronakis.....http://dblp.org/pers/hd/p/Polychronakis:Michalis"], "conf": "sp", "year": "2018", "pages": 17}