{"title": "Exploiting Automatic Vectorization to Employ SPMD on SIMD Registers.", "fields": ["spmd", "instruction set", "hardware architecture", "execution model", "simd"], "abstract": "Over the last years, vectorized instructions have been successfully applied to accelerate database algorithms. However, these instructions are typically only available as intrinsics and specialized for a particular hardware architecture or CPU model. As a result, today's database systems require a manual tailoring of database algorithms to the underlying CPU architecture to fully utilize all vectorization capabilities. In practice, this leads to hard-to-maintain code, which cannot be deployed on arbitrary hardware platforms. In this paper, we utilize ispc as a novel compiler that employs the Single Program Multiple Data (SPMD) execution model, which is usually found on GPUs, on the SIMD lanes of modern CPUs. ispc enables database developers to exploit vectorization without requiring low-level details or hardware-specific knowledge. To enable ispc for database developers, we study whether ispc's SPMD-on-SIMD approach can compete with manually-tuned intrinsics code. To this end, we investigate the performance of a scalar, a SIMD-based, and a SPMD-based implementation of a column scan, a database operator widely used in main-memory database systems. Our experimental results reveal that, although the manually-tuned intrinsics code slightly outperforms the SPMD-based column scan, the performance differences are small. Hence, developers may benefit from the advantages of SIMD parallelism through ispc, while supporting arbitrary hardware architectures without hard-to-maintain code.", "citation": "Not cited", "departments": ["Humboldt University of Berlin", "Humboldt University of Berlin", "Humboldt University of Berlin"], "authors": ["Stefan Sprenger.....http://dblp.org/pers/hd/s/Sprenger_0001:Stefan", "Steffen Zeuch.....http://dblp.org/pers/hd/z/Zeuch:Steffen", "Ulf Leser.....http://dblp.org/pers/hd/l/Leser:Ulf"], "conf": "icde", "year": "2018", "pages": 6}