{"title": "Learning on Partial-Order Hypergraphs.", "fields": ["vertex", "hypergraph", "constraint graph", "generalization", "ranking"], "abstract": "Graph-based learning methods explicitly consider the relations between two entities (i.e., vertices) for learning the prediction function. They have been widely used in semi-supervised learning, manifold ranking, and clustering, among other tasks. Enhancing the expressiveness of simple graphs, hypergraphs formulate an edge as a link to multiple vertices, so as to model the higher-order relations among entities. Typically, hyperedges in a hypergraph are used to encode certain kinds of similarity among vertices. To the best of our knowledge, all existing hypergraph structures represent the hyperedge as an unordered set of vertices, without considering the possible ordering relationship among vertices. In real-world data, the ordering relationships commonly exist, such as in graded categorical features (e.g., users’ ratings on movies) and numerical features (e.g., monthly income of customers). When constructing a hypergraph, ignoring such ordering relationships among entities will lead to severe information loss, resulting in suboptimal performance of the subsequent learning algorithms. In this work, we address the inherent limitation of existing hypergraphs by proposing a new data structure named Partial-Order Hypergraph, which specifically injects the partially ordering relationships of vertices into a hyperedge. We develop regularization-based learning theories for partial-order hypergraphs, generalizing conventional hypergraph learning by incorporating logical rules that encode the partial-order relations. We apply our proposed method to two applications: university ranking from Web data and popularity prediction of online content. Extensive experiments demonstrate the superiority of our proposed partial-order hypergraphs, which consistently improve over conventional hypergraphs.", "citation": "Citations (6)", "departments": ["National University of Singapore", "National University of Singapore", "Tsinghua University", "Shandong University", "National University of Singapore"], "authors": ["Fuli Feng.....http://dblp.org/pers/hd/f/Feng:Fuli", "Xiangnan He.....http://dblp.org/pers/hd/h/He_0001:Xiangnan", "Yiqun Liu.....http://dblp.org/pers/hd/l/Liu:Yiqun", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "www", "year": "2018", "pages": 10}