{"title": "Stash in a Flash.", "fields": ["encryption", "supervised learning", "adversary", "throughput", "encoding"], "abstract": "Encryption is a useful tool to protect data confidentiality. Yet it is still challenging to hide the very presence of encrypted, secret data from a powerful adversary. This paper presents a new technique to hide data in flash by manipulating the voltage level of pseudo-randomlyselected flash cells to encode two bits (rather than one) in the cell. In this model, we have one “public” bit interpreted using an SLC-style encoding, and extract a private bit using an MLC-style encoding. The locations of cells that encode hidden data is based on a secret key known only to the hiding user.\n\nIntuitively, this technique requires that the voltage level in a cell encoding data must be (1) not statistically distinguishable from a cell only storing public data, and (2) the user must be able to reliably read the hidden data from this cell. Our key insight is that there is a wide enough variation in the range of voltage levels in a typical flash device to obscure the presence of fine-grained changes to a small fraction of the cells, and that the variation is wide enough to support reliably re-reading hidden data. We demonstrate that our hidden data and underlying voltage manipulations go undetected by support vector machine based supervised learning which performs similarly to a random guess. The error rates of our scheme are low enough that the data is recoverable months after being stored. Compared to prior work, our technique provides 24x and 50x higher encoding and decoding throughput and doubles the capacity, while being 37x more power efficient.", "citation": "Not cited", "departments": ["Technion – Israel Institute of Technology", "California Institute of Technology", "California Institute of Technology", "University of North Carolina at Chapel Hill", "Technion – Israel Institute of Technology"], "authors": ["Aviad Zuck.....http://dblp.org/pers/hd/z/Zuck:Aviad", "Yue Li.....http://dblp.org/pers/hd/l/Li_0001:Yue", "Jehoshua Bruck.....http://dblp.org/pers/hd/b/Bruck:Jehoshua", "Donald E. Porter.....http://dblp.org/pers/hd/p/Porter:Donald_E=", "Dan Tsafrir.....http://dblp.org/pers/hd/t/Tsafrir:Dan"], "conf": "fast", "year": "2018", "pages": 20}