{"title": "RC-NVM: Enabling Symmetric Row and Column Memory Accesses for In-memory Databases.", "fields": ["memory architecture", "online analytical processing", "transaction processing", "cache", "online transaction processing"], "abstract": "Ever increasing DRAM capacity has fostered the development of in-memory databases (IMDB). The massive performance improvements provided by IMDBs have enabled transactions and analytics on the same database. In other words, the integration of OLTP (on-line transactional processing) and OLAP (on-line analytical processing) systems is becoming a general trend. However, conventional DRAM-based main memory is optimized for row-oriented accesses generated by OLTP workloads in row-based databases. OLAP queries scanning on specified columns cause so-called strided accesses and result in poor memory performance. Since memory access latency dominates in IMDB processing time, it can degrade overall performance significantly. To overcome this problem, we propose a dual-addressable memory architecture based on non-volatile memory, called RC-NVM, to support both row-oriented and column-oriented accesses. We first present circuit-level analysis to prove that such a dual-addressable architecture is only practical with RC-NVM rather than DRAM technology. Then, we rethink the addressing schemes, data layouts, cache synonym, and coherence issues of RC-NVM in architectural level to make it applicable for IMDBs. Finally, we propose a group caching technique that combines the IMDB knowledge with the memory architecture to further optimize the system. Experimental results show that the memory access performance can be improved up to 14.5X with only 15% area overhead.", "citation": "Not cited", "departments": ["Peking University", "National University of Defense Technology", "Peking University", "Duke University"], "authors": ["Peng Wang.....http://dblp.org/pers/hd/w/Wang_0025:Peng", "Shuo Li.....http://dblp.org/pers/hd/l/Li:Shuo", "Guangyu Sun.....http://dblp.org/pers/hd/s/Sun:Guangyu", "Xiaoyang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoyang", "Yiran Chen.....http://dblp.org/pers/hd/c/Chen:Yiran", "Hai Li.....http://dblp.org/pers/hd/l/Li:Hai", "Jason Cong.....http://dblp.org/pers/hd/c/Cong:Jason", "Nong Xiao.....http://dblp.org/pers/hd/x/Xiao:Nong", "Tao Zhang.....http://dblp.org/pers/hd/z/Zhang_0032:Tao"], "conf": "hpca", "year": "2018", "pages": 13}