{"title": "Sequence-to-Point Learning With Neural Networks for Non-Intrusive Load Monitoring.", "fields": ["domain knowledge", "mains electricity", "convolutional neural network", "nonintrusive load monitoring", "identifiability"], "abstract": "Energy disaggregation (a.k.a nonintrusive load monitoring, NILM), a single-channel blind source separation problem, aims to decompose the mains which records the whole house electricity consumption into appliance-wise readings. This problem is difficult because it is inherently unidentifiable. Recent approaches have shown that the identifiability problem could be reduced by introducing domain knowledge into the model. Deep neural networks have been shown to be a promising approach for these problems, but sliding windows are necessary to handle the long sequences which arise in signal processing problems, which raises issues about how to\ncombine predictions from different sliding windows. In this paper, we propose sequence-to-point learning, where the input is a window of the mains and the output is a single point of the target appliance. We use convolutional neural networks to train the model. Interestingly, we systematically show that the convolutional neural networks can inherently learn the signatures of the target appliances, which are automatically added into the model to reduce the identifiability problem. We applied\nthe proposed neural network approaches to real-world household energy data, and show that the methods achieve state-of-the-art performance, improving two standard error measures by 84% and 92%.", "citation": "Citations (5)", "departments": ["University of Edinburgh", "University of Edinburgh", "University of Edinburgh", "University of Edinburgh"], "authors": ["Chaoyun Zhang.....http://dblp.org/pers/hd/z/Zhang:Chaoyun", "Mingjun Zhong.....http://dblp.org/pers/hd/z/Zhong:Mingjun", "Zongzuo Wang.....http://dblp.org/pers/hd/w/Wang:Zongzuo", "Nigel H. Goddard.....http://dblp.org/pers/hd/g/Goddard:Nigel_H=", "Charles A. Sutton.....http://dblp.org/pers/hd/s/Sutton:Charles_A="], "conf": "aaai", "year": "2018", "pages": 8}