{"title": "Attentive Crowd Flow Machines.", "fields": ["traffic flow", "inference", "flow", "artificial neural network", "architecture"], "abstract": "Traffic flow prediction is crucial for urban traffic management and public safety. Its key challenges lie in how to adaptively integrate the various factors that affect the flow changes. In this paper, we propose a unified neural network module to address this problem, called Attentive Crowd Flow Machine~(ACFM), which is able to infer the evolution of the crowd flow by learning dynamic representations of temporally-varying data with an attention mechanism. Specifically, the ACFM is composed of two progressive ConvLSTM units connected with a convolutional layer for spatial weight prediction. The first LSTM takes the sequential flow density representation as input and generates a hidden state at each time-step for attention map inference, while the second LSTM aims at learning the effective spatial-temporal feature expression from attentionally weighted crowd flow features. Based on the ACFM, we further build a deep architecture with the application to citywide crowd flow prediction, which naturally incorporates the sequential and periodic data as well as other external influences. Extensive experiments on two standard benchmarks (i.e., crowd flow in Beijing and New York City) show that the proposed method achieves significant improvements over the state-of-the-art methods.", "citation": "Not cited", "year": "2018", "departments": ["Sun Yat-sen University", "The Chinese University of Hong Kong", "Sun Yat-sen University", "Sun Yat-sen University", "Beihang University"], "conf": "mm", "authors": ["Lingbo Liu.....http://dblp.org/pers/hd/l/Liu:Lingbo", "Ruimao Zhang.....http://dblp.org/pers/hd/z/Zhang:Ruimao", "Jiefeng Peng.....http://dblp.org/pers/hd/p/Peng:Jiefeng", "Guanbin Li.....http://dblp.org/pers/hd/l/Li:Guanbin", "Bowen Du.....http://dblp.org/pers/hd/d/Du:Bowen", "Liang Lin.....http://dblp.org/pers/hd/l/Lin:Liang"], "pages": 9}