{"title": "Lazygraph: lazy data coherency for replicas in distributed graph-parallel computation.", "fields": ["exploit", "atomicity", "execution model", "speedup", "ranging"], "abstract": "Replicas  1  of a vertex play an important role in existing distributed graph processing systems which make a single vertex to be parallel processed by multiple machines and access remote neighbors locally without any remote access. However, replicas of vertices introduce data coherency problem. Existing distributed graph systems treat replicas of a vertex v as an atomic and indivisible vertex, and use an eager data coherency approach to guarantee replicas atomicity. In eager data coherency approach, any changes to vertex data must be immediately communicated to all replicas of v, thus leading to frequent global synchronizations and communications.   In this paper, we propose a lazy data coherency approach, called LazyAsync, which treats replicas of a vertex as independent vertices and maintains the data coherency by computations, rather than communications in existing eager approach. Our approach automatically selects some data coherency points from the graph algorithm, and maintains all replicas to share the same global view only at such points, which means the replicas are enabled to maintain different local views between any two adjacent data coherency points. Based on PowerGraph, we develop a distributed graph processing system LazyGraph to implement the LazyAsync approach and exploit graph-aware optimizations. On a 48-node EC2-like cluster, LazyGraph outperforms PowerGraph on four widely used graph algorithms across a variety of real-world graphs, with a speedup ranging from 1.25x to 10.69x.", "citation": "Citations (1)", "year": "2018", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "ppopp", "authors": ["Lei Wang.....http://dblp.org/pers/hd/w/Wang:Lei", "Liangji Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Liangji", "Junhang Chen.....http://dblp.org/pers/hd/c/Chen:Junhang", "Huimin Cui.....http://dblp.org/pers/hd/c/Cui:Huimin", "Fang Lv.....http://dblp.org/pers/hd/l/Lv:Fang", "Ying Liu.....http://dblp.org/pers/hd/l/Liu:Ying", "Xiaobing Feng.....http://dblp.org/pers/hd/f/Feng_0002:Xiaobing"], "pages": 14}