{"title": "SWOOP: software-hardware co-design for non-speculative, execute-ahead, in-order cores.", "fields": ["microarchitecture", "memory level parallelism", "very long instruction word", "software pipelining", "instruction level parallelism"], "abstract": "Increasing demands for energy efficiency constrain emerging hardware. These new hardware trends challenge the established assumptions in code generation and force us to rethink existing software optimization techniques. We propose a cross-layer redesign of the way compilers and the underlying microarchitecture are built and interact, to achieve both performance and high energy efficiency.    In this paper, we address one of the main performance bottlenecks — last-level cache misses — through a software-hardware co-design. Our approach is able to hide memory latency and attain increased memory and instruction level parallelism by orchestrating  a non-speculative, execute-ahead paradigm in software  (SWOOP). While out-of-order (OoO) architectures attempt to hide memory latency by dynamically reordering instructions, they do so through expensive, power-hungry, speculative mechanisms.We aim to shift this complexity into software, and we build upon compilation techniques inherited from VLIW, software pipelining, modulo scheduling, decoupled access-execution, and software prefetching. In contrast to previous approaches we do not rely on either software or hardware speculation that can be detrimental to efficiency. Our SWOOP compiler is enhanced with lightweight architectural support, thus being able to transform applications that include highly complex control-flow and indirect memory accesses.", "citation": "Not cited", "departments": ["Uppsala University", "Uppsala University", "National University of Singapore", "Uppsala University", "Norwegian University of Science and Technology"], "authors": ["Kim-Anh Tran.....http://dblp.org/pers/hd/t/Tran:Kim=Anh", "Alexandra Jimborean.....http://dblp.org/pers/hd/j/Jimborean:Alexandra", "Trevor E. Carlson.....http://dblp.org/pers/hd/c/Carlson:Trevor_E=", "Konstantinos Koukos.....http://dblp.org/pers/hd/k/Koukos:Konstantinos", "Magnus Själander.....http://dblp.org/pers/hd/s/Sj=auml=lander:Magnus", "Stefanos Kaxiras.....http://dblp.org/pers/hd/k/Kaxiras:Stefanos"], "conf": "pldi", "year": "2018", "pages": 16}