{"title": "The Cards Aren't Alright: Detecting Counterfeit Gift Cards Using Encoding Jitter.", "fields": ["gift card", "payment", "card reader", "phenomenon", "counterfeit"], "abstract": "Gift cards are an increasingly popular payment platform. Much like credit cards, gift cards rely on a magnetic stripe to encode account information. Unlike credit cards, however, the EMV standard is entirely infeasible for gift cards due to compatibility and cost. As such, much of the fraud that has plagued credit cards has started to move towards gift cards, resulting in billions of dollars of loss annually. In this paper, we present a system for detecting counterfeit magnetic stripe gift cards that does not require the original card to be measured at the time of manufacture. Our system relies on a phenomenon known as jitter, which is present on all ISO/IEC-standard magnetic stripe cards. Variances in bit length are induced by the card encoding hardware and are difficult and expensive to reduce. We verify this hypothesis with a high-resolution magneto-optical microscope, then build our detector using inexpensive, commodity card readers. We then partnered with Walmart to evaluate their gift cards and distinguished legitimate gift cards from our clones with up to 99.3% accuracy. Our results show that measurement and detection of jitter increases the difficulty for adversaries to produce undetectable counterfeits, thereby creating significant opportunity to reduce gift card fraud.", "citation": "Not cited", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "University of Florida"], "authors": ["Nolen Scaife.....http://dblp.org/pers/hd/s/Scaife:Nolen", "Christian Peeters.....http://dblp.org/pers/hd/p/Peeters:Christian", "Camilo Velez.....http://dblp.org/pers/hd/v/Velez:Camilo", "Hanqing Zhao.....http://dblp.org/pers/hd/z/Zhao:Hanqing", "Patrick Traynor.....http://dblp.org/pers/hd/t/Traynor:Patrick", "David P. Arnold.....http://dblp.org/pers/hd/a/Arnold:David_P="], "conf": "sp", "year": "2018", "pages": 14}