{"title": "Restructuring endpoint congestion control.", "fields": ["network packet", "datapath", "network monitoring", "restructuring", "linux kernel", "quic"], "abstract": "This paper describes the implementation and evaluation of a system to implement complex congestion control functions by placing them in a separate agent outside the datapath. Each datapath---such as the Linux kernel TCP, UDP-based QUIC, or kernel-bypass transports like mTCP-on-DPDK---summarizes information about packet round-trip times, receptions, losses, and ECN via a well-defined interface to algorithms running in the off-datapath Congestion Control Plane (CCP). The algorithms use this information to control the datapath's congestion window or pacing rate. Algorithms written in CCP can run on multiple datapaths. CCP improves both the pace of development and ease of maintenance of congestion control algorithms by providing better, modular abstractions, and supports aggregation capabilities of the Congestion Manager, all with one-time changes to datapaths. CCP also enables new capabilities, such as Copa in Linux TCP, several algorithms running on QUIC and mTCP/DPDK, and the use of signal processing algorithms to detect whether cross-traffic is ACK-clocked. Experiments with our user-level Linux CCP implementation show that CCP algorithms behave similarly to kernel algorithms, and incur modest CPU overhead of a few percent.", "citation": "Not cited", "year": "2018", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "sigcomm", "authors": ["Akshay Narayan.....http://dblp.org/pers/hd/n/Narayan:Akshay", "Frank Cangialosi.....http://dblp.org/pers/hd/c/Cangialosi:Frank", "Deepti Raghavan.....http://dblp.org/pers/hd/r/Raghavan:Deepti", "Prateesh Goyal.....http://dblp.org/pers/hd/g/Goyal:Prateesh", "Srinivas Narayana.....http://dblp.org/pers/hd/n/Narayana:Srinivas", "Radhika Mittal.....http://dblp.org/pers/hd/m/Mittal:Radhika", "Mohammad Alizadeh.....http://dblp.org/pers/hd/a/Alizadeh:Mohammad", "Hari Balakrishnan.....http://dblp.org/pers/hd/b/Balakrishnan:Hari"], "pages": 14}