{"title": "Data-dependent hashing via nonlinear spectral gaps.", "fields": ["locality sensitive hashing", "search problem", "sublinear function", "norm", "nearest neighbor search"], "abstract": "We establish a generic reduction from _nonlinear spectral gaps_ of metric spaces to data-dependent Locality-Sensitive Hashing, yielding a new approach to the high-dimensional Approximate Near Neighbor Search problem (ANN) under various distance functions. Using this reduction, we obtain the following results:    * For _general_  d -dimensional normed spaces and  n -point datasets, we obtain a _cell-probe_ ANN data structure with approximation  O (log d /e 2 ), space  d   O (1)   n  1+e , and  d   O (1)  n  e  cell probes per query, for any e>0. No non-trivial approximation was known before in this generality other than the  O (√ d ) bound which follows from embedding a general norm into l 2 . * For l  p   and Schatten- p  norms, we improve the data structure further, to obtain approximation  O ( p ) and sublinear query _time_. For l  p  , this improves upon the previous best approximation 2  O ( p )  (which required polynomial as opposed to near-linear in  n  space). For the Schatten- p  norm, no non-trivial ANN data structure was known before this work.    Previous approaches to the ANN problem either exploit the low dimensionality of a metric, requiring space exponential in the dimension, or circumvent the curse of dimensionality by embedding a metric into a ”tractable” space, such as l 1 . Our new generic reduction proceeds differently from both of these approaches using a novel partitioning method.", "citation": "Not cited", "year": "2018", "departments": ["Columbia University", "Princeton University", "University of Toronto", "Microsoft", "Columbia University"], "conf": "stoc", "authors": ["Alexandr Andoni.....http://dblp.org/pers/hd/a/Andoni:Alexandr", "Assaf Naor.....http://dblp.org/pers/hd/n/Naor:Assaf", "Aleksandar Nikolov.....http://dblp.org/pers/hd/n/Nikolov:Aleksandar", "Ilya P. Razenshteyn.....http://dblp.org/pers/hd/r/Razenshteyn:Ilya_P=", "Erik Waingarten.....http://dblp.org/pers/hd/w/Waingarten:Erik"], "pages": 14}