{"title": "Immersive Visualization of Abstract Information: An Evaluation on Dimensionally-Reduced Data Scatterplots.", "fields": ["immersion", "information visualization", "analytic reasoning", "dimensionality reduction", "data visualization"], "abstract": "The use of novel displays and interaction resources to support immersive data visualization and improve analytical reasoning is a research trend in the information visualization community. In this work, we evaluate the use of an HMD-based environment for the exploration of multidimensional data, represented in 3D scatterplots as a result of dimensionality reduction (DR). We present a new modeling for this problem, accounting for the two factors whose interplay determine the impact on the overall task performance: the difference in errors introduced by performing dimensionality reduction to 2D or 3D, and the difference in human perception errors under different visualization conditions. This two-step framework offers a simple approach to estimate the benefits of using an immersive 3D setup for a particular dataset. Here, the DR errors for a series of roll call voting datasets when using two or three dimensions are evaluated through an empirical task-based approach. The perception error and overall task performance, on the other hand, are assessed through a comparative user study with 30 participants. Results indicated that perception errors were low and similar in all approaches, resulting in overall performance benefits in both desktop and HMD-based 3D techniques. The immersive condition, however, was found to require less effort to find information and less navigation, besides providing much larger subjective perception of accuracy and engagement.", "citation": "Not cited", "departments": ["Universidade Federal do Rio Grande do Sul", "Universidade Federal do Rio Grande do Sul", "Universidade Federal do Rio Grande do Sul", "Universidade Federal do Rio Grande do Sul"], "authors": ["Jorge A. Wagner Filho.....http://dblp.org/pers/hd/f/Filho:Jorge_A=_Wagner", "Marina Fortes Rey.....http://dblp.org/pers/hd/r/Rey:Marina_Fortes", "Carla M. D. S. Freitas.....http://dblp.org/pers/hd/f/Freitas:Carla_M=_D=_S=", "Luciana Porcher Nedel.....http://dblp.org/pers/hd/n/Nedel:Luciana_Porcher"], "conf": "vr", "year": "2018", "pages": 8}