{"title": "When Sheep Shop: Measuring Herding Effects in Product Ratings with Natural Experiments.", "fields": ["herding", "natural experiment", "counterfactual conditional", "exploit", "observational study"], "abstract": "As online shopping becomes ever more prevalent, customers rely increasingly on product rating websites for making purchase decisions. The reliability of online ratings, however, is potentially compromised by the so-called herding effect: when rating a product, customers may be biased to follow other customers’ previous ratings of the same product. This is problematic because it skews long-term customer perception through haphazard early ratings. The study of herding poses important methodological challenges. Observational studies are impeded by the lack of counterfactuals: simply correlating early with subsequent ratings is insufficient because we cannot know what the subsequent ratings would have looked like had the first ratings been different. Experimental studies are rarely an option because either they manipulate real customers’ attitudes toward real products, or they examine lab settings that might differ fundamentally from real settings. The methodology introduced here exploits a situation that comes close to an experiment, although it is purely observational – a natural experiment. Our key methodological device consists in studying the same product on two separate rating sites, focusing on products that received a high first rating on one site, and a low first rating on the other. This largely controls for confounds such as a product’s inherent quality, advertising, and producer identity, and lets us isolate the effect of the first rating on subsequent ratings. In a case study, we focus on beers as products and jointly study two beer rating sites, but our method applies to any pair of sites across which products can be matched. We find clear evidence of herding in beer ratings. For instance, if a beer receives a very high first rating, its second rating is on average half a standard deviation higher, compared to a situation where the identical beer receives a very low first rating. Moreover, herding effects tend to last a long time and are noticeable even after 20 or more ratings. Our results have important implications for the design of better rating systems.", "citation": "Not cited", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Gael Lederrey.....http://dblp.org/pers/hd/l/Lederrey:Gael", "Robert West.....http://dblp.org/pers/hd/w/West_0001:Robert"], "conf": "www", "year": "2018", "pages": 10}