{"title": "Fair and Diverse DPP-Based Data Summarization.", "fields": ["machine learning", "sampling", "pattern recognition", "feature vector", "automatic summarization"], "abstract": "Sampling methods that choose a subset of the data proportional to its diversity in the feature space are popular for data summarization. However, recent studies have noted the occurrence of bias (under- or over-representation of a certain gender or race) in such data summarization methods. In this paper we initiate a study of the problem of outputting a diverse and fair summary of a given dataset. We work with a well-studied determinantal measure of diversity and corresponding distributions (DPPs) and present a framework that allows us to incorporate a general class of fairness constraints into such distributions. Coming up with efficient algorithms to sample from these constrained determinantal distributions, however, suffers from a complexity barrier and we present a fast sampler that is provably good when the input vectors satisfy a natural property. Our experimental results on a real-world and an image dataset show that the diversity of the samples produced by adding fairness constraints is not too far from the unconstrained case, and we also provide a theoretical explanation of it.", "citation": "Not cited", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Microsoft", "University of California, Berkeley"], "authors": ["L. Elisa Celis.....http://dblp.org/pers/hd/c/Celis:L=_Elisa", "Vijay Keswani.....http://dblp.org/pers/hd/k/Keswani:Vijay", "Damian Straszak.....http://dblp.org/pers/hd/s/Straszak:Damian", "Amit Deshpande.....http://dblp.org/pers/hd/d/Deshpande_0001:Amit", "Tarun Kathuria.....http://dblp.org/pers/hd/k/Kathuria:Tarun", "Nisheeth K. Vishnoi.....http://dblp.org/pers/hd/v/Vishnoi:Nisheeth_K="], "conf": "icml", "year": "2018", "pages": 10}