{"title": "Superneurons: dynamic GPU memory management for training deep neural networks.", "fields": ["deep learning", "network planning and design", "liveness", "cuda", "memory management"], "abstract": "Going deeper and wider in neural architectures improves their accuracy, while the limited GPU DRAM places an undesired restriction on the network design domain. Deep Learning (DL) practitioners either need to change to less desired network architectures, or nontrivially dissect a network across multiGPUs. These distract DL practitioners from concentrating on their original machine learning tasks. We present SuperNeurons: a dynamic GPU memory scheduling runtime to enable the network training far beyond the GPU DRAM capacity. SuperNeurons features 3 memory optimizations,  Liveness Analysis, Unified Tensor Pool , and  Cost-Aware Recomputation ; together they effectively reduce the network-wide peak memory usage down to the maximal memory usage among layers. We also address the performance issues in these memory-saving techniques. Given the limited GPU DRAM, SuperNeurons not only provisions the necessary memory for the training, but also dynamically allocates the memory for convolution workspaces to achieve the high performance. Evaluations against Caffe, Torch, MXNet and TensorFlow have demonstrated that SuperNeurons trains at least 3.2432 deeper network than current ones with the leading performance. Particularly, SuperNeurons can train ResNet2500 that has 10 4  basic network layers on a 12GB K40c.", "citation": "Citations (4)", "year": "2018", "departments": ["Brown University", "Los Alamos National Laboratory", "Pacific Northwest National Laboratory", "Univ. of Electr ...  Tech. of China", "Univ. of Electr ...  Tech. of China"], "conf": "ppopp", "authors": ["Linnan Wang.....http://dblp.org/pers/hd/w/Wang:Linnan", "Jinmian Ye.....http://dblp.org/pers/hd/y/Ye:Jinmian", "Yiyang Zhao.....http://dblp.org/pers/hd/z/Zhao:Yiyang", "Wei Wu.....http://dblp.org/pers/hd/w/Wu:Wei", "Ang Li.....http://dblp.org/pers/hd/l/Li:Ang", "Shuaiwen Leon Song.....http://dblp.org/pers/hd/s/Song:Shuaiwen_Leon", "Zenglin Xu.....http://dblp.org/pers/hd/x/Xu:Zenglin", "Tim Kraska.....http://dblp.org/pers/hd/k/Kraska:Tim"], "pages": 13}