{"title": "Safe privatization in transactional memory.", "fields": ["software transactional memory", "transactional memory", "wait", "atomicity", "legacy code"], "abstract": "Transactional memory  (TM) facilitates the development of concurrent applications by letting the programmer designate certain code blocks as atomic. Programmers using a TM often would like to access the same data both inside and outside transactions, e.g., to improve performance or to support legacy code. In this case, programmers would ideally like the TM to guarantee  strong atomicity , where transactions can be viewed as executing atomically also with respect to non-transactional accesses. Since guaranteeing strong atomicity for arbitrary programs is prohibitively expensive, researchers have suggested guaranteeing it only for certain  data-race free (DRF)  programs, particularly those that follow the  privatization  idiom: from some point on, threads agree that a given object can be accessed non-transactionally. Supporting privatization safely in a TM is nontrivial, because this often requires correctly inserting  transactional fences , which wait until all active transactions complete.   Unfortunately, there is currently no consensus on a single definition of transactional DRF, in particular, because no existing notion of DRF takes into account transactional fences. In this paper we propose such a notion and prove that, if a TM satisfies a certain condition generalizing opacity and a program using it is DRF  assuming  strong atomicity, then the program indeed has strongly atomic semantics. We show that our DRF notion allows the programmer to use privatization idioms. We also propose a method for proving our generalization of opacity and apply it to the TL2 TM.", "citation": "Not cited", "year": "2018", "departments": ["Technical University of Madrid", "Technion – Israel Institute of Technology", "IMDEA", "Tel Aviv University"], "conf": "ppopp", "authors": ["Artem Khyzha.....http://dblp.org/pers/hd/k/Khyzha:Artem", "Hagit Attiya.....http://dblp.org/pers/hd/a/Attiya:Hagit", "Alexey Gotsman.....http://dblp.org/pers/hd/g/Gotsman:Alexey", "Noam Rinetzky.....http://dblp.org/pers/hd/r/Rinetzky:Noam"], "pages": 13}