{"title": "GraFBoost: Using Accelerated Flash Storage for External Graph Analytics.", "fields": ["analytics", "hardware acceleration", "xeon", "software analytics", "external sorting"], "abstract": "We describe GraFBoost, a flash-based architecture with hardware acceleration for external analytics of multi-terabyte graphs. We compare the performance of GraFBoost with 1 GB of DRAM against various state-of-the-art graph analytics software including FlashGraph, running on a 32-thread Xeon server with 128 GB of DRAM. We demonstrate that despite the relatively small amount of DRAM, GraFBoost achieves high performance with very large graphs no other system can handle, and rivals the performance of the fastest software platforms on sizes of graphs that existing platforms can handle. Unlike in-memory and semi-external systems, GraFBoost uses a constant amount of memory for all problems, and its performance decreases very slowly as graph sizes increase, allowing GraFBoost to scale to much larger problems than possible with existing systems while using much less resources on a single-node system.   The key component of GraFBoost is the  sort-reduce  accelerator, which implements a novel method to sequentialize fine-grained random accesses to flash storage. The sort-reduce accelerator logs random update requests and then uses hardware-accelerated external sorting with interleaved reduction functions. GraFBoost also stores newly updated vertex values generated in each  superstep  of the algorithm lazily with the old vertex values to further reduce I/O traffic.   We evaluate the performance of GraFBoost for PageRank, breadth-first search and betweenness centrality on our FPGA-based prototype (Xilinx VC707 with 1 GB DRAM and 1 TB flash) and compare it to other graph processing systems including a pure software implementation of GrapFBoost.", "citation": "Not cited", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Sang Woo Jun.....http://dblp.org/pers/hd/j/Jun:Sang_Woo", "Andy Wright.....http://dblp.org/pers/hd/w/Wright:Andy", "Sizhuo Zhang.....http://dblp.org/pers/hd/z/Zhang:Sizhuo", "Shuotao Xu.....http://dblp.org/pers/hd/x/Xu:Shuotao", "Arvind.....http://dblp.org/pers/hd/a/Arvind:"], "conf": "isca", "year": "2018", "pages": 14}