{"title": "Random Oracles and Non-uniformity.", "fields": ["random oracle", "unruh effect", "special case", "cryptographic primitive", "multiplicative function"], "abstract": "We revisit security proofs for various cryptographic primitives in the auxiliary-input random-oracle model (AI-ROM), in which an attacker \\(\\mathcal A\\) can compute arbitrary S bits of leakage about the random oracle \\(\\mathcal O\\) before attacking the system and then use additional T oracle queries to \\(\\mathcal O\\) during the attack. This model has natural applications in settings where traditional random-oracle proofs are not useful: (a) security against non-uniform attackers; (b) security against preprocessing. We obtain a number of new results about the AI-ROM:\n\n\nUnruh (CRYPTO’07) introduced the pre-sampling technique, which generically reduces security proofs in the AI-ROM to a much simpler P-bit-fixing random-oracle model (BF-ROM), where the attacker can arbitrarily fix the values of \\(\\mathcal O\\) on some P coordinates, but then the remaining coordinates are chosen at random. Unruh’s security loss for this transformation is \\(\\sqrt{ST/P}\\). We improve this loss to the optimal value O(ST / P), obtaining nearly tight bounds for a variety of indistinguishability applications in the AI-ROM.\n\n\nWhile the basic pre-sampling technique cannot give tight bounds for unpredictability applications, we introduce a novel “multiplicative version” of pre-sampling, which allows to dramatically reduce the size of P of the pre-sampled set to \\(P=O(ST)\\) and yields nearly tight security bounds for a variety of unpredictability applications in the AI-ROM. Qualitatively, it validates Unruh’s “polynomial pre-sampling conjecture”—disproved in general by Dodis et al. (EUROCRYPT’17)—for the special case of unpredictability applications.\n\n\nUsing our techniques, we reprove nearly all AI-ROM bounds obtained by Dodis et al. (using a much more laborious compression technique), but we also apply it to many settings where the compression technique is either inapplicable (e.g., computational reductions) or appears intractable (e.g., Merkle-Damgard hashing).\n\n\nWe show that for any salted Merkle-Damgard hash function with m-bit output there exists a collision-finding circuit of size \\(\\varTheta (2^{m/3})\\) (taking salt as the input), which is significantly below the \\(2^{m/2}\\) birthday security conjectured against uniform attackers.\n\n\nWe build two compilers to generically extend the security of applications proven in the traditional ROM to the AI-ROM. One compiler simply prepends a public salt to the random oracle, showing that salting generically provably defeats preprocessing.", "citation": "Not cited", "year": "2018", "departments": ["New York University", "New York University", "Northeastern University", "Geneva, Switzerland"], "conf": "eurocrypt", "authors": ["Sandro Coretti.....http://dblp.org/pers/hd/c/Coretti:Sandro", "Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Siyao Guo.....http://dblp.org/pers/hd/g/Guo:Siyao", "John P. Steinberger.....http://dblp.org/pers/hd/s/Steinberger:John_P="], "pages": 32}