{"title": "A Spot Capacity Market to Increase Power Infrastructure Utilization in Multi-tenant Data Centers.", "fields": ["data center", "marginal cost", "market price", "price elasticity of demand", "testbed"], "abstract": "Despite the common practice of oversubscription, power capacity is largely under-utilized in data centers. A significant factor driving this under-utilization is fluctuation of the aggregate power demand, resulting in unused “spot (power) capacity”. In this paper, we tap into spot capacity for improving power infrastructure utilization in multi-tenant data centers, an important but under-explored type of data center where multiple tenants house their own physical servers. We propose a novel market, called SpotDC, to allocate spot capacity to tenants on demand. Specifically, SpotDC extracts tenants’ racklevel spot capacity demand through an elastic demand function, based on which the operator sets the market price for spot capacity allocation. We evaluate SpotDC using both testbed experiments and simulations, demonstrating that SpotDC improves power infrastructure utilization and creates a “win-win” situation: the data center operator increases its profit (by nearly 10%), while tenants improve their performance (by 1.2–1.8x on average compared to the no spot capacity case, yet at a marginal cost).", "citation": "Not cited", "departments": ["University of California, Riverside", "California Institute of Technology", "University of California, Riverside", "California Institute of Technology", "University of California, Riverside", "California Institute of Technology", "University of California, Riverside", "California Institute of Technology"], "authors": ["Mohammad A. Islam.....http://dblp.org/pers/hd/i/Islam:Mohammad_A=", "Xiaoqi Ren.....http://dblp.org/pers/hd/r/Ren:Xiaoqi", "Shaolei Ren.....http://dblp.org/pers/hd/r/Ren:Shaolei", "Adam Wierman.....http://dblp.org/pers/hd/w/Wierman:Adam"], "conf": "hpca", "year": "2018", "pages": 13}