{"title": "The Wonderful World of Global Random Oracles.", "fields": ["random oracle", "security analysis", "encryption", "cryptographic primitive", "commitment scheme"], "abstract": "The random-oracle model by Bellare and Rogaway (CCS’93) is an indispensable tool for the security analysis of practical cryptographic protocols. However, the traditional random-oracle model fails to guarantee security when a protocol is composed with arbitrary protocols that use the same random oracle. Canetti, Jain, and Scafuro (CCS’14) put forth a global but non-programmable random oracle in the Generalized UC framework and showed that some basic cryptographic primitives with composable security can be efficiently realized in their model. Because their random-oracle functionality is non-programmable, there are many practical protocols that have no hope of being proved secure using it. In this paper, we study alternative definitions of a global random oracle and, perhaps surprisingly, show that these allow one to prove GUC-secure existing, very practical realizations of a number of essential cryptographic primitives including public-key encryption, non-committing encryption, commitments, Schnorr signatures, and hash-and-invert signatures. Some of our results hold generically for any suitable scheme proven secure in the traditional ROM, some hold for specific constructions only. Our results include many highly practical protocols, for example, the folklore commitment scheme \\(\\mathcal {H}(m\\Vert r)\\) (where m is a message and r is the random opening information) which is far more efficient than the construction of Canetti et al.", "citation": "Not cited", "year": "2018", "departments": ["IBM", "ETH Zurich", "IBM", "IBM", "IBM", "IBM"], "conf": "eurocrypt", "authors": ["Jan Camenisch.....http://dblp.org/pers/hd/c/Camenisch:Jan", "Manu Drijvers.....http://dblp.org/pers/hd/d/Drijvers:Manu", "Tommaso Gagliardoni.....http://dblp.org/pers/hd/g/Gagliardoni:Tommaso", "Anja Lehmann.....http://dblp.org/pers/hd/l/Lehmann:Anja", "Gregory Neven.....http://dblp.org/pers/hd/n/Neven:Gregory"], "pages": 33}