{"title": "Hybrid Approach of Relation Network and Localized Graph Convolutional Filtering for Breast Cancer Subtype Classification.", "fields": ["deep learning", "biological network", "convolutional neural network", "personalized medicine", "breast cancer"], "abstract": "Network biology has been successfully used to help reveal complex mechanisms of disease, especially cancer. On the other hand, network biology requires in-depth knowledge to construct disease-specific networks, but our current knowledge is very limited even with the recent advances in human cancer biology. Deep learning has shown a great potential to address the difficult situation like this. However, deep learning technologies conventionally use grid-like structured data, thus application of deep learning technologies to the classification of human disease subtypes is yet to be explored. Recently, graph based deep learning techniques have emerged, which becomes an opportunity to leverage analyses in network biology. In this paper, we proposed a hybrid model, which integrates two key components 1) graph convolution neural network (graph CNN) and 2) relation network (RN). We utilize graph CNN as a component to learn expression patterns of cooperative gene community, and RN as a component to learn associations between learned patterns. The proposed model is applied to the PAM50 breast cancer subtype classification task, the standard breast cancer subtype classification of clinical utility. In experiments of both subtype classification and patient survival analysis, our proposed method achieved significantly better performances than existing methods. We believe that this work is an important starting point to realize the upcoming personalized medicine.", "citation": "Not cited", "departments": ["Seoul National University", "Seoul National University", "Seoul National University"], "authors": ["SungMin Rhee.....http://dblp.org/pers/hd/r/Rhee:SungMin", "Seokjun Seo.....http://dblp.org/pers/hd/s/Seo:Seokjun", "Sun Kim.....http://dblp.org/pers/hd/k/Kim:Sun"], "conf": "ijcai", "year": "2018", "pages": 8}