{"title": "Developing and Proving a Framework for Reaction Time Experiments in VR to Objectively Measure Social Interaction with Virtual Agents.", "fields": ["immersion", "social inhibition", "mixed reality", "phenomenon", "task analysis"], "abstract": "Which features and characteristics must virtual agents have to elicit social presence in humans? In order to investigate this objectively, experimental paradigms relying on implicit cognitive phenomena can be employed. In the present study, two aims were reached: First, we built a mixed reality apparatus using affordable consumer VR hardware and other off-the-shelf components to detect implicit cognitive phenomena on the basis of small reaction times with a precision of several milliseconds. Secondly, using this apparatus, we showed that a virtual agent can indeed elicit an implicit phenomenon which was hitherto assumed to be restricted to human participants: social Inhibition of Return (sIOR). sIOR is indicated by an increase in reaction time of about 20 ms that occurs when one subject reaches to the same target to which a co-actor had just responded to [19]. Skarratt, Cole and Kingstone [17] found that only a real co-actor, but not an animated one could induce this inhibitory effect. However, their virtual agent was displayed as a video on a 2D-TV-screen, which was only weakly immersive. In contrast, we found in two experiments that an animated agent presented via a more immersive VR headset could elicit the sIOR phenomenon. Further research has to be done to identify the reasons why this agent - or why VR per se - evokes an sIOR phenomenon. Moreover, the underlying mechanism of why sIOR occurs are not fully understood yet. The current findings open the way to further investigate these questions in experimental settings relying on VR.", "citation": "Citations (1)", "departments": ["Technical University of Berlin", "Technical University of Berlin", "Technical University of Berlin", "Julius-Maximili ... rsität Würzburg"], "authors": ["Carolin Wienrich.....http://dblp.org/pers/hd/w/Wienrich:Carolin", "Richard Gross.....http://dblp.org/pers/hd/g/Gross:Richard", "Felix Kretschmer.....http://dblp.org/pers/hd/k/Kretschmer:Felix", "Gisela Müller-Plath.....http://dblp.org/pers/hd/m/M=uuml=ller=Plath:Gisela"], "conf": "vr", "year": "2018", "pages": 8}