{"title": "Approximating the Spectrum of a Graph.", "fields": ["spectral graph theory", "laplace operator", "adjacency matrix", "normalization", "sublinear function"], "abstract": "The spectrum of a network or graph $G=(V,E)$ with adjacency matrix A , consists of the eigenvalues of the normalized Laplacian $L= I - D^-1/2 A D^-1/2 $. This set of eigenvalues encapsulates many aspects of the structure of the graph, including the extent to which the graph posses community structures at multiple scales. We study the problem of approximating the spectrum, $lambda = (lambda_1,\\dots,lambda_|V| )$, of G in the regime where the graph is too large to explicitly calculate the spectrum. We present a sublinear time algorithm that, given the ability to query a random node in the graph and select a random neighbor of a given node, computes a succinct representation of an approximation $\\widetilde lambda = (\\widetilde lambda_1,\\dots,\\widetilde lambda_|V| )$, such that $\\|\\widetilde lambda - lambda\\|_1 le e |V|$. Our algorithm has query complexity and running time $exp(O(1/\\eps))$, which is independent of the size of the graph, $|V|$. We demonstrate the practical viability of our algorithm on synthetically generated graphs, and on 15 different real-world graphs from the Stanford Large Network Dataset Collection, including social networks, academic collaboration graphs, and road networks. For the smallest of these graphs, we are able to validate the accuracy of our algorithm by explicitly calculating the true spectrum; for the larger graphs, such a calculation is computationally prohibitive. The spectra of these real-world networks reveal insights into the structural similarities and differences between them, illustrating the potential value of our algorithm for efficiently approximating the spectrum of large large networks.", "citation": "Not cited", "departments": ["French Institute for Research in Computer Science and Automation", "Stanford University", "Technical University of Dortmund", "Stanford University"], "authors": ["David Cohen-Steiner.....http://dblp.org/pers/hd/c/Cohen=Steiner:David", "Weihao Kong.....http://dblp.org/pers/hd/k/Kong:Weihao", "Christian Sohler.....http://dblp.org/pers/hd/s/Sohler:Christian", "Gregory Valiant.....http://dblp.org/pers/hd/v/Valiant:Gregory"], "conf": "kdd", "year": "2018", "pages": 9}