{"title": "Efficient Selection of Geospatial Data on Maps for Interactive and Visualized Exploration.", "fields": ["panning", "rendering", "end user", "zoom", "geospatial analysis"], "abstract": "With the proliferation of mobile devices, large collections of geospatial data are becoming available, such as geo-tagged photos. Map rendering systems play an important role in presenting such large geospatial datasets to end users. We propose that such systems should support the following desirable features: representativeness, visibility constraint, zooming consistency, and panning consistency. The first two constraints are fundamental challenges to a map exploration system, which aims to efficiently select a small set of representative objects from the current region of user's interest, and any two selected objects should not be too close to each other for users to distinguish in the limited space of a screen. We formalize it as the Spatial Object Selection (SOS) problem, prove that it is an NP-hard problem, and develop a novel approximation algorithm with performance guarantees. % To further support interactive exploration of geospatial data on maps, we propose the Interactive SOS (ISOS) problem, in which we enrich the SOS problem with the zooming consistency and panning consistency constraints. The objective of ISOS is to provide seamless experience for end-users to interactively explore the data by navigating the map. We extend our algorithm for the SOS problem to solve the ISOS problem, and propose a new strategy based on pre-fetching to significantly enhance the efficiency. Finally we have conducted extensive experiments to show the efficiency and scalability of our approach.", "citation": "Citations (2)", "year": "2018", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "RMIT University"], "conf": "sigmod", "authors": ["Tao Guo.....http://dblp.org/pers/hd/g/Guo:Tao", "Kaiyu Feng.....http://dblp.org/pers/hd/f/Feng:Kaiyu", "Gao Cong.....http://dblp.org/pers/hd/c/Cong:Gao", "Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng"], "pages": 16}