{"title": "Continuous-Time Flows for Efficient Inference and Density Estimation.", "fields": ["generative grammar", "finite set", "inference", "density estimation", "unsupervised learning"], "abstract": "Two fundamental problems in unsupervised learning are efficient inference for latent-variable models and robust density estimation based on large amounts of unlabeled data. For efficient inference, normalizing flows have been recently developed to approximate a target distribution arbitrarily well. In practice, however, normalizing flows only consist of a finite number of deterministic transformations, and thus they possess no guarantee on the approximation accuracy. For density estimation, the generative adversarial network (GAN) has been advanced as an appealing model, due to its often excellent performance in generating samples. In this paper, we propose the concept of {\\em continuous-time flows} (CTFs), a family of diffusion-based methods that are able to asymptotically approach a target distribution. Distinct from normalizing flows and GANs, CTFs can be adopted to achieve the above two goals in one framework, with theoretical guarantees. Our framework includes distilling knowledge from a CTF for efficient inference, and learning an explicit energy-based distribution with CTFs for density estimation. Experiments on various tasks demonstrate promising performance of the proposed CTF framework, compared to related techniques.", "citation": "Not cited", "departments": ["University at Buffalo", "Duke University", "Duke University", "Duke University", "Duke University"], "authors": ["Changyou Chen.....http://dblp.org/pers/hd/c/Chen:Changyou", "Chunyuan Li.....http://dblp.org/pers/hd/l/Li:Chunyuan", "Liquan Chen.....http://dblp.org/pers/hd/c/Chen:Liquan", "Wenlin Wang.....http://dblp.org/pers/hd/w/Wang:Wenlin", "Yunchen Pu.....http://dblp.org/pers/hd/p/Pu:Yunchen", "Lawrence Carin.....http://dblp.org/pers/hd/c/Carin:Lawrence"], "conf": "icml", "year": "2018", "pages": 10}