{"title": "To Stay or to Leave: Churn Prediction for Urban Migrants in the Initial Period.", "fields": ["urbanization", "visitor pattern", "china", "classifier", "metadata"], "abstract": "In China, 2.6 billion people migrate to cities to realize their urban dreams every year. Despite the fact that these migrants play an important role in the rapid urbanization process, many of them fail to settle down and eventually leave the city. The integration process of migrants is thus an important issue both for scholars and policymakers. In this paper, we use Shanghai as an example to investigate migrants’ behavior in their first weeks and in particular, how their behavior relates to early departure. We employ a one-month complete dataset of telecommunication metadata in Shanghai with 54 million users and 698 million call logs, plus a novel housing price dataset for 20K real estates in Shanghai. This dataset allows us to identify new migrants to Shanghai because it is uncommon for a temporary visitor to apply for a local number in China. We find that migrants who end up leaving early tend to neither develop diverse connections in their first weeks nor move around the city. Their active areas also have higher housing prices than that of staying migrants. We formulate classification tasks to predict whether a migrant is going to leave based on her behavior in the first few days. The prediction performance improves as we include data from more days. Interestingly, when using the same features, the classifier trained from only the first few days is already as good as the classifier trained using full data, suggesting that the performance difference mainly lies in the difference between features.", "citation": "Not cited", "departments": ["Zhejiang University", "Zhejiang University", "University of Colorado Boulder", "Zhejiang University", "Zhejiang University"], "authors": ["Yang Yang.....http://dblp.org/pers/hd/y/Yang_0009:Yang", "Zongtao Liu.....http://dblp.org/pers/hd/l/Liu:Zongtao", "Chenhao Tan.....http://dblp.org/pers/hd/t/Tan:Chenhao", "Fei Wu.....http://dblp.org/pers/hd/w/Wu_0001:Fei", "Yueting Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yueting", "Yafeng Li.....http://dblp.org/pers/hd/l/Li:Yafeng"], "conf": "www", "year": "2018", "pages": 10}