{"title": "Cybersickness-Provoking Virtual Reality Alters Brain Signals of Persons with Multiple Sclerosis.", "fields": ["brain activity and meditation", "virtual reality", "multiple sclerosis", "motion sickness", "nausea"], "abstract": "This study investigates and compares brain signals between persons with and without Multiple Sclerosis (MS) when exposed to cybersickness-provoking Virtual Reality (VR). Cybersickness is a set of discomforts and commonly triggered by VR exposure. It has symptoms similar to motion sickness, such as dizziness, nausea, and disorientation etc. Although cybersickness has been studied for decades, populations with neurological disabilities, such as MS, have remained minimally studied. Cybersickness could have negative impact on effectiveness of VR-based rehabilitation systems and limit the accessibility of VR for persons with disabilities. MS can disrupt communication between neurons (signal carrying nerve cells) from different areas of the brain. Cybersickness also can affect brain signals, for example, frequency powers may change due to cybersickness. This study investigates the combination of MS and cybersickness in terms of brain signals. To investigate the effect of cybersickness on participants' brain signals, electroencephalogram (EEG) data were recorded before, during and after exposure to a cybersickness-provoking VR driving simulation. The EEG data suggests that in response to cybersickness-provoking VR exposure, participants with MS have mostly shown similar changes in brain activity with different magnitudes than participants without MS. Also, for at least one scalp location we have found completely opposite brain signals in MS-Group when compared to Non-MS-Group. Difference in magnitude or completely different trend in brain signals can imply that cybersickness affects persons with MS differently than persons without MS and may be different cybersickness reduction techniques are required for different populations.", "citation": "Not cited", "departments": ["University of Texas at San Antonio", "University of Texas at San Antonio", "University of Texas at San Antonio"], "authors": ["Imtiaz Muhammad Arafat.....http://dblp.org/pers/hd/a/Arafat:Imtiaz_Muhammad", "Sharif Mohammad Shahnewaz Ferdous.....http://dblp.org/pers/hd/f/Ferdous:Sharif_Mohammad_Shahnewaz", "John Quarles.....http://dblp.org/pers/hd/q/Quarles:John"], "conf": "vr", "year": "2018", "pages": 8}