{"title": "Did You Really Just Have a Heart Attack?: Towards Robust Detection of Personal Health Mentions in Social Media.", "fields": ["deep learning", "syntax", "population health", "inventive spelling", "social media"], "abstract": "Millions of users share their experiences on social media sites, such as Twitter, which in turn generates potentially valuable data for public health monitoring, digital epidemiology, and other analyses of population health at global scale. The first, basic, task for any of these applications is classifying whether a personal health event was mentioned. Thus, identifying actual personal health mentions (PHM) is critical. This task is challenging for many reasons, including typically short length of posts, inventive spelling and lexicons, and figurative language, including hyperbole using diseases like “heart attack” or “cancer” for emphasis and not as a health self-report. This problem is even more challenging for rarely reported, or frequent but ambiguously expressed conditions, such as “stroke”. To address this problem, we propose a general, robust method for detecting PHMs in social media, which we call WESPAD, that combines lexical, syntactic, word embedding-based, and context-based features. WESPAD is able to generalize from few examples by automatically distorting the word embeddings to most effectively detect the true health mentions. Unlike previously proposed state-of-the-art supervised and deep learning techniques, WESPAD requires relatively little training data–which makes it possible to adapt with minimal effort to each new disease and condition. We evaluate WESPAD on both an established publicly available Flu detection benchmark, and on a new dataset that we have constructed with mentions of multiple health conditions, which we plan to share with the research community. Our experiments show that WESPAD consistently and significantly improves upon baseline methods in a variety of settings, and consistently outperforms all state-of-the-art deep neural network methods. Most importantly, we show that WESPAD outperforms the lexical baseline by a large margin when the number and proportion of true health mentions in the training data is small. These properties make our method particularly valuable for extending online public health methods to an ever expanding set of diseases and conditions.", "citation": "Citations (1)", "departments": ["Emory University", "Emory University"], "authors": ["Payam Karisani.....http://dblp.org/pers/hd/k/Karisani:Payam", "Eugene Agichtein.....http://dblp.org/pers/hd/a/Agichtein:Eugene"], "conf": "www", "year": "2018", "pages": 10}