{"title": "An Efficient, Generalized Bellman Update For Cooperative Inverse Reinforcement Learning.", "fields": ["exploit", "inverse", "partially observable markov decision process", "rationality", "exponential function"], "abstract": "Our goal is for AI systems to correctly identify and act according to their human user's objectives. Cooperative Inverse Reinforcement Learning (CIRL) formalizes this value alignment problem as a two-player game between a human and robot, in which only the human knows the parameters of the reward function: the robot needs to learn them as the interaction unfolds. Previous work showed that CIRL can be solved as a POMDP, but with an action space size exponential in the size of the reward parameter space. In this work, we exploit a specific property of CIRL---the human is a full information agent---to derive an optimality-preserving modification to the standard Bellman update; this reduces the complexity of the problem by an exponential factor and allows us to relax CIRL's assumption of human rationality. We apply this update to a variety of POMDP solvers and find that it enables us to scale CIRL to non-trivial problems, with larger reward parameter spaces, and larger action spaces for both robot and human. In solutions to these larger problems, the human exhibits pedagogic (teaching) behavior, while the robot interprets it as such and attains higher value for the human.", "citation": "Not cited", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["Dhruv Malik.....http://dblp.org/pers/hd/m/Malik:Dhruv", "Malayandi Palaniappan.....http://dblp.org/pers/hd/p/Palaniappan:Malayandi", "Jaime F. Fisac.....http://dblp.org/pers/hd/f/Fisac:Jaime_F=", "Dylan Hadfield-Menell.....http://dblp.org/pers/hd/h/Hadfield=Menell:Dylan", "Stuart J. Russell.....http://dblp.org/pers/hd/r/Russell:Stuart_J=", "Anca D. Dragan.....http://dblp.org/pers/hd/d/Dragan:Anca_D="], "conf": "icml", "year": "2018", "pages": 9}