{"title": "An Evaluation of Bimanual Gestures on the Microsoft HoloLens.", "fields": ["scaling", "augmented reality", "task analysis", "gesture", "spite"], "abstract": "We developed and evaluated two-handed gestures on the Microsoft HoloLens to manipulate augmented reality annotations through rotation and scale operations. We explore the design space of bimanual interactions on head-worn AR platforms, with the intention of dedicating two-handed gestures to rotation and scaling manipulations while reserving one-handed interactions to drawing annotations. In total, we implemented five techniques for rotation and scale manipulation gestures on the Microsoft HoloLens: three two-handed techniques, one technique for one-handed rotation and two-handed scale, and one baseline one-handed technique that represents standard HoloLens UI recommendations. Two of the bimanual interaction techniques involve axis separation for rotation whereas the third technique is fully 6DOF and modeled after the successful “spindle” approach from 3DUI literature. To evaluate our techniques, we conducted a study with 48 users. We recorded multiple performance metrics for each user on each technique, as well as user preferences. Results indicate that in spite of problems due to field-of-view limitations, certain two-handed techniques perform comparatively to the one-handed baseline technique in terms of accuracy and time. Furthermore, the best-performing two-handed technique outdid all other techniques in terms of overall user preference, demonstrating that bimanual gesture interactions can serve a valuable role in the UI toolbox on head-worn AR devices such as the HoloLens.", "citation": "Not cited", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Nikolas Chaconas.....http://dblp.org/pers/hd/c/Chaconas:Nikolas", "Tobias Höllerer.....http://dblp.org/pers/hd/h/H=ouml=llerer:Tobias"], "conf": "vr", "year": "2018", "pages": 8}