{"title": "Mobilizing the Micro-Ops: Exploiting Context Sensitive Decoding for Security and Energy Efficiency.", "fields": ["power gating", "microcode", "instruction set", "cache", "side channel attack"], "abstract": "Modern instruction set decoders feature translation of native instructions into internal micro-ops to simplify CPU design and improve instruction-level parallelism. However, this translation is static in most known instances. This work proposes  context-sensitive decoding , a technique that enables customization of the micro-op translation at the microsecond or faster granularity, based on the current execution context and/or preset hardware events. While there are many potential applications, this work demonstrates its effectiveness with two use cases: 1) as a novel security defense to thwart instruction/data cache-based side-channel attacks, as demonstrated on commercial implementations of RSA and AES and 2) as a power management technique that performs selective devectorization to enable efficient unit-level power gating.   This architecture, first by allowing execution to transition between different translation modes rapidly, defends against a variety of attacks, completely obfuscating code-dependent cache access, only sacrificing 5% in steady-state performance - orders of magnitude less than prior art. By selectively disabling the vector units without disabling vector arithmetic, context-sensitive decoding reduces energy by 12.9% with minimal loss in performance. Both optimizations work with no significant changes to the pipeline or the external ISA.", "citation": "Not cited", "departments": ["University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California", "University of California, Berkeley", "University of California"], "authors": ["Mohammadkazem Taram.....http://dblp.org/pers/hd/t/Taram:Mohammadkazem", "Ashish Venkat.....http://dblp.org/pers/hd/v/Venkat:Ashish", "Dean M. Tullsen.....http://dblp.org/pers/hd/t/Tullsen:Dean_M="], "conf": "isca", "year": "2018", "pages": 14}