{"title": "IMPALA: Scalable Distributed Deep-RL with Importance Weighted Actor-Learner Architectures.", "fields": ["reinforcement learning", "throughput", "frame rate", "scalability", "learning environment"], "abstract": "In this work we aim to solve a large collection of tasks using a single reinforcement learning agent with a single set of parameters. A key challenge is to handle the increased amount of data and extended training time, which is already a problem in single task learning. We have developed a new distributed agent IMPALA (Importance-Weighted Actor Learner Architecture) that can scale to thousands of machines and achieve a throughput rate of 250,000 frames per second. We achieve stable learning at high throughput by combining decoupled acting and learning with a novel off-policy correction method called V-trace, which was critical for achieving learning stability. We demonstrate the effectiveness of IMPALA for multi-task reinforcement learning on DMLab-30 (a set of 30 tasks from the DeepMind Lab environment (Beattie et al., 2016)) and Atari-57 (all available Atari games in Arcade Learning Environment (Bellemare et al., 2013a)). Our results show that IMPALA is able to achieve better performance than previous agents, use less data and crucially exhibits positive transfer between tasks as a result of its multi-task approach.", "citation": "Citations (13)", "departments": ["Google", "DeepMind", "DeepMind", "DeepMind", "DeepMind"], "authors": ["Lasse Espeholt.....http://dblp.org/pers/hd/e/Espeholt:Lasse", "Hubert Soyer.....http://dblp.org/pers/hd/s/Soyer:Hubert", "Rémi Munos.....http://dblp.org/pers/hd/m/Munos:R=eacute=mi", "Karen Simonyan.....http://dblp.org/pers/hd/s/Simonyan:Karen", "Volodymyr Mnih.....http://dblp.org/pers/hd/m/Mnih:Volodymyr", "Tom Ward.....http://dblp.org/pers/hd/w/Ward:Tom", "Yotam Doron.....http://dblp.org/pers/hd/d/Doron:Yotam", "Vlad Firoiu.....http://dblp.org/pers/hd/f/Firoiu:Vlad", "Tim Harley.....http://dblp.org/pers/hd/h/Harley:Tim", "Iain Dunning.....http://dblp.org/pers/hd/d/Dunning:Iain", "Shane Legg.....http://dblp.org/pers/hd/l/Legg:Shane", "Koray Kavukcuoglu.....http://dblp.org/pers/hd/k/Kavukcuoglu:Koray"], "conf": "icml", "year": "2018", "pages": 10}