{"title": "An Empirical Study of Branching Heuristics through the Lens of Global Learning Rate.", "fields": ["branching", "heuristics", "heuristic", "stochastic gradient descent", "solver", "maximization", "machine learning", "empirical research", "overhead", "artificial intelligence"], "abstract": "In this paper, we analyze a suite of 7 well-known branching heuristics proposed by the SAT community and show that the better heuristics tend to generate more learnt clauses per decision, a metric we define as the global learning rate (GLR). Like our previous work on the LRB branching heuristic, we once again view these heuristics as techniques to solve the learning rate optimization problem. First, we show that there is a strong positive correlation between GLR and solver efficiency for a variety of branching heuristics. Second, we test our hypothesis further by developing a new branching heuristic that maximizes GLR greedily. We show empirically that this heuristic achieves very high GLR and interestingly very low literal block distance (LBD) over the learnt clauses. In our experiments this greedy branching heuristic enables the solver to solve instances faster than VSIDS, when the branching time is taken out of the equation. This experiment is a good proof of concept that a branching heuristic maximizing GLR will lead to good solver performance modulo the computational overhead. Third, we propose that machine learning algorithms are a good way to cheaply approximate the greedy GLR maximization heuristic as already witnessed by LRB. In addition, we design a new branching heuristic, called SGDB, that uses a stochastic gradient descent online learning method to dynamically order branching variables in order to maximize GLR. We show experimentally that SGDB performs on par with the VSIDS branching heuristic.", "citation": "Not cited", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo", "College Of Engi ... thapuram, India"], "authors": ["Jia Liang.....http://dblp.org/pers/hd/l/Liang:Jia", "Hari Govind V. K......http://dblp.org/pers/hd/k/K=:Hari_Govind_V=", "Pascal Poupart.....http://dblp.org/pers/hd/p/Poupart:Pascal", "Krzysztof Czarnecki.....http://dblp.org/pers/hd/c/Czarnecki:Krzysztof", "Vijay Ganesh.....http://dblp.org/pers/hd/g/Ganesh:Vijay"], "conf": "ijcai", "year": "2018", "pages": 5}