{"title": "StaQC: A Systematically Mined Question-Code Dataset from Stack Overflow.", "fields": ["snippet", "python", "code", "question answering", "sql"], "abstract": "Stack Overflow has been a great source of natural language questions and their code solutions (i.e., question-code pairs), which are critical for many tasks including retrieving code snippets based on a keyword query and code annotation using natural language. In most existing research, question-code pairs were collected heuristically and tend to have low quality: For example, given a question post and its answer post, one simply pairs the question title with every code snippet (if any) in the answer post, which is problematic since a code snippet may not serve as a solution to the question. In this paper, we investigate a new problem of systematically mining question-code pairs from Stack Overflow (in contrast to heuristically collecting them). The task is formulated as predicting whether or not a code snippet is a standalone solution to a question. We propose a novel Bi-view Hierarchical Neural Network which can capture both the programming content and the textual context of a code snippet (i.e., two views) to make a prediction. On two manually annotated datasets in Python and SQL domain, our framework substantially outperforms heuristic methods with at least 15% higher F1 and accuracy. Furthermore, we obtain StaQC (Stack Overflow Question-Code pairs), the largest dataset to date of 148K Python and 120K SQL question-code pairs, automatically mined from SO using our framework. Under various case studies, we demonstrate that StaQC can greatly help develop data-hungry models for associating natural language with programming language.", "citation": "Citations (2)", "departments": ["Ohio State University", "University of Washington", "Fujitsu", "Ohio State University"], "authors": ["Ziyu Yao.....http://dblp.org/pers/hd/y/Yao:Ziyu", "Daniel S. Weld.....http://dblp.org/pers/hd/w/Weld:Daniel_S=", "Wei-Peng Chen.....http://dblp.org/pers/hd/c/Chen:Wei=Peng", "Huan Sun.....http://dblp.org/pers/hd/s/Sun:Huan"], "conf": "www", "year": "2018", "pages": 11}