{"title": "On non-optimally expanding sets in Grassmann graphs.", "fields": ["conjecture", "isomorphism", "completeness", "small set", "graph", "combinatorics", "discrete mathematics", "mathematics", "fourier analysis"], "abstract": "We study the structure of non-expanding sets in the Grassmann graph. We put forth a hypothesis stating that every small set whose expansion is smaller than 1−δ must be correlated with one of a specified list of sets which are isomorphic to smaller Grassmann graphs. We develop a framework of Fourier analysis for analyzing functions over the Grassmann graph, and prove that our hypothesis holds for all sets whose expansion is below 7/8.    In the companion submitted paper [Dinur, Khot, Kindler, Minzer and Safra, STOC 2018], the authors show that a linearity agreement hypothesis implies an NP-hardness gap of 1/2− vs for unique games and other inapproximability results. In [Barak, Kothari and Steurer, ECCC TR18-077], the authors show that the hypothesis in this work  implies  the linearity agreement hypothesis of [Dinur, Khot, Kindler, Minzer and Safra, STOC 2018]. Combined with our main theorem here this proves a version of the linearity agreement hypothesis with certain specific parameters. Short of proving the entire hypothesis, this nevertheless suffices for getting new unconditional NP hardness gaps for label cover with 2-to-1 and unique constraints.    Our Expansion Hypothesis has been subsequently proved in its full form [Khot, Minzer and Safra, ECCC TR18-006] thereby proving the agreement hypothesis of [Dinur, Khot, Kindler, Minzer and Safra, STOC 2018] and completing the proof of the 2-to-1 Games Conjecture (albeit with imperfect completeness).", "citation": "Not cited", "year": "2018", "departments": ["Weizmann Institute of Science", "New York University", "Hebrew University of Jerusalem", "Tel Aviv University", "Tel Aviv University"], "conf": "stoc", "authors": ["Irit Dinur.....http://dblp.org/pers/hd/d/Dinur:Irit", "Subhash Khot.....http://dblp.org/pers/hd/k/Khot:Subhash", "Guy Kindler.....http://dblp.org/pers/hd/k/Kindler:Guy", "Dor Minzer.....http://dblp.org/pers/hd/m/Minzer:Dor", "Muli Safra.....http://dblp.org/pers/hd/s/Safra:Muli"], "pages": 12}