{"title": "Step-by-step Erasion, One-by-one Collection: A Weakly Supervised Temporal Action Detector.", "fields": ["snippet", "clips", "discriminative model", "conditional random field", "classifier"], "abstract": "Weakly supervised temporal action detection is a Herculean task in understanding untrimmed videos, since no supervisory signal except the video-level category label is available on training data. Under the supervision of category labels, weakly supervised detectors are usually built upon classifiers. However, there is an inherent contradiction between classifier and detector; i.e., a classifier in pursuit of high classification performance prefers top-level discriminative video clips that are extremely fragmentary, whereas a detector is obliged to discover the whole action instance without missing any relevant snippet. To reconcile this contradiction, we train a detector by driving a series of classifiers to find new actionness clips progressively, via step-by-step erasion from a complete video. During the test phase, all we need to do is to collect detection results from the one-by-one trained classifiers at various erasing steps. To assist in the collection process, a fully connected conditional random field is established to refine the temporal localization outputs. We evaluate our approach on two prevailing datasets, THUMOS'14 and ActivityNet. The experiments show that our detector advances state-of-the-art weakly supervised temporal action detection results, and even compares with quite a few strongly supervised methods.", "citation": "Not cited", "year": "2018", "departments": ["Peking University", "Peking University", "Peking University", "Peking University", "Peking University"], "conf": "mm", "authors": ["Jia-Xing Zhong.....http://dblp.org/pers/hd/z/Zhong:Jia=Xing", "Nannan Li.....http://dblp.org/pers/hd/l/Li:Nannan", "Weijie Kong.....http://dblp.org/pers/hd/k/Kong:Weijie", "Tao Zhang.....http://dblp.org/pers/hd/z/Zhang:Tao", "Thomas H. Li.....http://dblp.org/pers/hd/l/Li:Thomas_H=", "Ge Li.....http://dblp.org/pers/hd/l/Li:Ge"], "pages": 10}