{"title": "Google Workloads for Consumer Devices: Mitigating Data Movement Bottlenecks.", "fields": ["efficient energy use", "video capture", "workload", "computation", "wearable technology"], "abstract": "We are experiencing an explosive growth in the number of consumer devices, including smartphones, tablets, web-based computers such as Chromebooks, and wearable devices. For this class of devices, energy efficiency is a first-class concern due to the limited battery capacity and thermal power budget. We find that data movement is a major contributor to the total system energy and execution time in consumer devices. The energy and performance costs of moving data between the memory system and the compute units are significantly higher than the costs of computation. As a result, addressing data movement is crucial for consumer devices. In this work, we comprehensively analyze the energy and performance impact of data movement for several widely-used Google consumer workloads: (1) the Chrome web browser; (2) TensorFlow Mobile, Google's machine learning framework; (3) video playback, and (4) video capture, both of which are used in many video services such as YouTube and Google Hangouts. We find that processing-in-memory (PIM) can significantly reduce data movement for all of these workloads, by performing part of the computation close to memory. Each workload contains simple primitives and functions that contribute to a significant amount of the overall data movement. We investigate whether these primitives and functions are feasible to implement using PIM, given the limited area and power constraints of consumer devices. Our analysis shows that offloading these primitives to PIM logic, consisting of either simple cores or specialized accelerators, eliminates a large amount of data movement, and significantly reduces total system energy (by an average of 55.4% across the workloads) and execution time (by an average of 54.2%).", "citation": "Citations (4)", "year": "2018", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Seoul National University", "Carnegie Mellon University", "Google"], "conf": "asplos", "authors": ["Amirali Boroumand.....http://dblp.org/pers/hd/b/Boroumand:Amirali", "Saugata Ghose.....http://dblp.org/pers/hd/g/Ghose:Saugata", "Youngsok Kim.....http://dblp.org/pers/hd/k/Kim:Youngsok", "Rachata Ausavarungnirun.....http://dblp.org/pers/hd/a/Ausavarungnirun:Rachata", "Eric Shiu.....http://dblp.org/pers/hd/s/Shiu:Eric", "Rahul Thakur.....http://dblp.org/pers/hd/t/Thakur:Rahul", "Daehyun Kim.....http://dblp.org/pers/hd/k/Kim:Daehyun", "Aki Kuusela.....http://dblp.org/pers/hd/k/Kuusela:Aki", "Allan Knies.....http://dblp.org/pers/hd/k/Knies:Allan", "Parthasarathy Ranganathan.....http://dblp.org/pers/hd/r/Ranganathan:Parthasarathy", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur"], "pages": 16}