{"title": "Fast Exact CoSimRank Search on Evolving and Static Graphs.", "fields": ["simrank", "dot product", "pagerank", "polytree", "nearest neighbor search"], "abstract": "In real Web applications, CoSimRank has been proposed as a powerful measure of node-pair similarity based on graph topologies. It recursively captures the notion that “two nodes are considered as similar if their in-neighbours are similar”, but the similarity of each node with itself is not constantly 1, which is different from SimRank. However, existing work on CoSimRank is restricted to static graphs, where each node-pair CoSimRank score is retrieved from the sum of the dot product of two Personalised PageRank vectors. When the graph is updated with new edges arriving over time, this approach becomes impractical, due to its cost-inhibitive overheads for recomputing CoSimRank scores from scratch. In this study, we propose a fast dynamic scheme, D-CoSim, for accurate CoSimRank search over evolving graph streams. Based on D-CoSim, we also propose a fast scheme, F-CoSim, that greatly accelerates CoSimRank search over static graphs. Our theoretical analysis shows that D-CoSim and F-CoSim guarantee the exactness of CoSimRank scores. On the static graph G, to efficiently retrieve CoSimRank scores S, F-CoSim is based on three ideas: (i) It first finds a “spanning polytree” T over G. (ii) On T, a fast algorithm is designed to compute the CoSimRank scores ST over the “spanning polytree”. (iii) On G, D-CoSim is employed to compute the changes of S(T) in response to the delta graph (G-T). Experimental evaluations verify the superiority of D-CoSim over evolving graphs, and the fast speedup of F-CoSim on large-scale static graphs against its competitors, without any loss of accuracy.", "citation": "Not cited", "departments": ["Aston University", "Aston University"], "authors": ["Weiren Yu.....http://dblp.org/pers/hd/y/Yu:Weiren", "Fan Wang.....http://dblp.org/pers/hd/w/Wang:Fan"], "conf": "www", "year": "2018", "pages": 10}