{"title": "RGCNN: Regularized Graph CNN for Point Cloud Segmentation.", "fields": ["deep learning", "spectral graph theory", "convolutional neural network", "point cloud", "laplacian matrix"], "abstract": "Point cloud, an efficient 3D object representation, has become popular with the development of depth sensing and 3D laser scanning techniques. It has attracted attention in various applications such as 3D tele-presence, navigation for unmanned vehicles and heritage reconstruction. The understanding of point clouds, such as point cloud segmentation, is crucial in exploiting the informative value of point clouds for such applications. Due to the irregularity of the data format, previous deep learning works often convert point clouds to regular 3D voxel grids or collections of images before feeding them into neural networks, which leads to voluminous data and quantization artifacts. In this paper, we instead propose a regularized graph convolutional neural network (RGCNN) that directly consumes point clouds. Leveraging on spectral graph theory, we treat features of points in a point cloud as signals on graph, and define the convolution over graph by Chebyshev polynomial approximation. In particular, we update the graph Laplacian matrix that describes the connectivity of features in each layer according to the corresponding learned features, which adaptively captures the structure of dynamic graphs. Further, we deploy a graph-signal smoothness prior in the loss function, thus regularizing the learning process. Experimental results on the ShapeNet part dataset show that the proposed approach significantly reduces the computational complexity while achieving competitive performance with the state of the art. Also, experiments show RGCNN is much more robust to both noise and point cloud density in comparison with other methods. We further apply RGCNN to point cloud classification and achieve competitive results on ModelNet40 dataset.", "citation": "Not cited", "year": "2018", "departments": ["Peking University", "Peking University", "Peking University", "MTlab, Meitu In ...  Beijing, China"], "conf": "mm", "authors": ["Gusi Te.....http://dblp.org/pers/hd/t/Te:Gusi", "Wei Hu.....http://dblp.org/pers/hd/h/Hu:Wei", "Amin Zheng.....http://dblp.org/pers/hd/z/Zheng:Amin", "Zongming Guo.....http://dblp.org/pers/hd/g/Guo:Zongming"], "pages": 9}