{"title": "Retrieving and Classifying Affective Images via Deep Metric Learning.", "fields": ["image retrieval", "affect", "exploit", "convolutional neural network", "machine learning"], "abstract": "Affective image understanding has been extensively studied\nin the last decade since more and more users express emotion\nvia visual contents. While current algorithms based on convolutional\nneural networks aim to distinguish emotional categories\nin a discrete label space, the task is inherently ambiguous.\nThis is mainly because emotional labels with the same\npolarity (i.e., positive or negative) are highly related, which is\ndifferent from concrete object concepts such as cat, dog and\nbird. To the best of our knowledge, few methods focus on\nleveraging such characteristic of emotions for affective image\nunderstanding. In this work, we address the problem of understanding\naffective images via deep metric learning and propose\na multi-task deep framework to optimize both retrieval\nand classification goals. We propose the sentiment constraints\nadapted from the triplet constraints, which are able to explore\nthe hierarchical relation of emotion labels. We further\nexploit the sentiment vector as an effective representation to\ndistinguish affective images utilizing the texture representation\nderived from convolutional layers. Extensive evaluations\non four widely-used affective datasets, i.e., Flickr and Instagram,\nIAPSa, Art Photo, and Abstract Paintings, demonstrate\nthat the proposed algorithm performs favorably against the\nstate-of-the-art methods on both affective image retrieval and\nclassification tasks", "citation": "Not cited", "departments": ["Nankai University", "Nankai University", "Cardiff University", "University of California, Merced"], "authors": ["Jufeng Yang.....http://dblp.org/pers/hd/y/Yang:Jufeng", "Dongyu She.....http://dblp.org/pers/hd/s/She:Dongyu", "Yu-Kun Lai.....http://dblp.org/pers/hd/l/Lai:Yu=Kun", "Ming-Hsuan Yang.....http://dblp.org/pers/hd/y/Yang_0001:Ming=Hsuan"], "conf": "aaai", "year": "2018", "pages": 8}