{"title": "An Encoder-Decoder Framework Translating Natural Language to Database Queries.", "fields": ["recurrent neural network", "deep learning", "convolutional neural network", "graph database", "database schema"], "abstract": "Machine translation is going through a radical revolution, driven by the explosive development of deep learning techniques using Convolutional Neural Network (CNN) and Recurrent Neural Network (RNN). In this paper, we consider a special case in machine translation problems, targeting to translate natural language into Structural Query Language (SQL) for data retrieval over relational database. Although generic CNN and RNN learn the grammar structure of SQL when trained with sufficient samples, the accuracy and training efficiency of the model could be dramatically improved, when the translation model is deeply integrated with the grammar rules of SQL. We present a new encoder-decoder framework, with a suite of new approaches, including new semantic features fed into the encoder as well as new grammar-aware states injected into the memory of decoder. These techniques help the neural network focus on understanding semantics of the operations in natural language and save the efforts on SQL grammar learning. The empirical evaluation on real world database and queries show that our approach outperform state-of-the-art solution by a significant margin.", "citation": "Citations (1)", "departments": ["Guangdong University of Technology", "Guangdong University of Technology", "Guangdong University of Technology", "Singapore R&D,  ... Technology Ltd.", "Singapore R&D,  ... Technology Ltd."], "authors": ["Ruichu Cai.....http://dblp.org/pers/hd/c/Cai:Ruichu", "Boyan Xu.....http://dblp.org/pers/hd/x/Xu:Boyan", "Zhenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenjie", "Xiaoyan Yang.....http://dblp.org/pers/hd/y/Yang:Xiaoyan", "Zijian Li.....http://dblp.org/pers/hd/l/Li:Zijian", "Zhihao Liang.....http://dblp.org/pers/hd/l/Liang:Zhihao"], "conf": "ijcai", "year": "2018", "pages": 7}