{"title": "Learning a Deep Listwise Context Model for Ranking Refinement.", "fields": ["relevance feedback", "learning to rank", "labeled data", "recurrent neural network", "ranking"], "abstract": "Learning to rank has been intensively studied and widely applied in information retrieval. Typically, a global ranking function is learned from a set of labeled data, which can achieve good performance on average but may be suboptimal for individual queries by ignoring the fact that relevant documents for different queries may have different distributions in the feature space. Inspired by the idea of pseudo relevance feedback where top ranked documents, which we refer as the local ranking context, can provide important information about the query's characteristics, we propose to use the inherent feature distributions of the top results to learn a Deep Listwise Context Model that helps us fine tune the initial ranked list. Specifically, we employ a recurrent neural network to sequentially encode the top results using their feature vectors, learn a local context model and use it to re-rank the top results. There are three merits with our model: (1) Our model can capture the local ranking context based on the complex interactions between top results using a deep neural network; (2) Our model can be built upon existing learning-to-rank methods by directly using their extracted feature vectors; (3) Our model is trained with an attention-based loss function, which is more effective and efficient than many existing listwise methods. Experimental results show that the proposed model can significantly improve the state-of-the-art learning to rank methods on benchmark retrieval corpora.", "citation": "Citations (1)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "Chinese Academy of Sciences", "University of Massachusetts Amherst"], "authors": ["Qingyao Ai.....http://dblp.org/pers/hd/a/Ai:Qingyao", "Keping Bi.....http://dblp.org/pers/hd/b/Bi:Keping", "Jiafeng Guo.....http://dblp.org/pers/hd/g/Guo:Jiafeng", "W. Bruce Croft.....http://dblp.org/pers/hd/c/Croft:W=_Bruce"], "conf": "sigir", "year": "2018", "pages": 10}