{"title": "FluidRAN: Optimized vRAN/MEC Orchestration.", "fields": ["upgrade", "radio access network", "relocation", "orchestration", "edge computing"], "abstract": "Virtualized Radio Access Network (vRAN) architectures constitute a promising solution for the densification needs of 5G networks, as they decouple Base Stations (BUs) functions from Radio Units (RUs) allowing the processing power to be pooled at cost-efficient Central Units (CUs). vRAN facilitates the flexible function relocation (split selection), and therefore enables splits with less stringent network requirements compared to state-of-the-art fully Centralized (C-RAN) systems. In this paper, we study the important and challenging vRAN design problem. We propose a novel modeling approach and a rigorous analytical framework, FluidRAN, that minimizes RAN costs by jointly selecting the splits and the RUs-CUs routing paths. We also consider the increasingly relevant scenario where the RAN needs to support multi-access edge computing (MEC) services, that naturally favor distributed RAN (D-RAN) architectures. Our framework provides a joint vRAN/MEC solution that minimizes operational costs while satisfying the MEC needs. We follow a data-driven evaluation method, using topologies of 3 operational networks. Our results reveal that (i) pure C-RAN is rarely a feasible upgrade solution for existing infrastructure, (ii) FluidRAN achieves significant cost savings compared to D-RAN systems, and (iii) MEC can increase substantially the operator's cost as it pushes vRAN function placement back to RUs.", "citation": "Not cited", "year": "2018", "departments": ["Trinity College", "Trinity College", "NEC Laboratorie ... elberg, Germany", "NEC Laboratorie ... elberg, Germany"], "conf": "infocom", "authors": ["Andres Garcia-Saavedra.....http://dblp.org/pers/hd/g/Garcia=Saavedra:Andres", "Xavier Costa-Pérez.....http://dblp.org/pers/hd/c/Costa=P=eacute=rez:Xavier", "Douglas J. Leith.....http://dblp.org/pers/hd/l/Leith:Douglas_J=", "George Iosifidis.....http://dblp.org/pers/hd/i/Iosifidis:George"], "pages": 9}