{"title": "Deep Collective Classification in Heterogeneous Information Networks.", "fields": ["hierarchy", "deep learning", "computer science", "artificial intelligence", "machine learning"], "abstract": "Collective classification has attracted considerable attention in the last decade, where the labels within a group of instances are correlated and should be inferred collectively, instead of independently. Conventional approaches on collective classification mainly focus on exploiting simple relational features (such as count and exists aggregators on neighboring nodes). However, many real-world applications involve complex dependencies among the instances, which are obscure/hidden in the networks. To capture these dependencies in collective classification, we need to go beyond simple relational features and extract deep dependencies between the instances. In this paper, we study the problem of deep collective classification in Heterogeneous Information Networks (HINs), which involves different types of autocorrelations, from simple to complex relations, among the instances. Different from conventional autocorrelations, which are given explicitly by the links in the network, complex autocorrelations are obscure/hidden in HINs, and should be inferred from existing links in a hierarchical order. This problem is highly challenging due to the multiple types of dependencies among the nodes and the complexity of the relational features. In this study, we proposed a deep convolutional collective classification method, called GraphInception, to learn the deep relational features in HINs. The proposed method can automatically generate a hierarchy of relational features with different complexities. Extensive experiments on four real world networks demonstrate that our approach can improve the collective classification performance by considering deep relational features in HINs.", "citation": "Not cited", "departments": ["Fudan University", "Fudan University", "Worcester Polytechnic Institute", "Fudan University"], "authors": ["Yizhou Zhang.....http://dblp.org/pers/hd/z/Zhang:Yizhou", "Yun Xiong.....http://dblp.org/pers/hd/x/Xiong:Yun", "Xiangnan Kong.....http://dblp.org/pers/hd/k/Kong:Xiangnan", "Shanshan Li.....http://dblp.org/pers/hd/l/Li:Shanshan", "Jinhong Mi.....http://dblp.org/pers/hd/m/Mi:Jinhong", "Yangyong Zhu.....http://dblp.org/pers/hd/z/Zhu:Yangyong"], "conf": "www", "year": "2018", "pages": 10}