{"title": "A Sparse Topic Model for Extracting Aspect-Specific Summaries from Online Reviews.", "fields": ["approximate inference", "generative grammar", "automatic summarization", "generative model", "topic model"], "abstract": "Online reviews have become an inevitable part of a consumer’s decision making process, where the likelihood of purchase not only depends on the product’s overall rating, but also on the description of it’s aspects. Therefore, websites such as Amazon, Walmart, and Netflix constantly encourage users to write good quality reviews and categorically summa- rize different facets of the product. However, despite such efforts, it takes a significant effort to skim through thousands of reviews and look for answers that addresses the query of consumers. For example, a gamer might be interested in buying a monitor with fast refresh rates, support for Gsync and Freesync technologies etc., while a photographer might be interested in aspects such as color reproduction and Delta-e scores. Therefore, in this paper, we propose a generative aspect summarization model called APSUM that is capable of providing fine-grained summaries of on- line reviews. To overcome the inherent problem of aspect sparsity, we jointly constraint both the document-topic and the word-topic distribution by introducing a semi-supervised variation of the spike-and-slab prior. Using rigorous set of experiments, we show that the proposed model is capable of outperforming other state-of-the-art aspect-topic models over a variety of datasets and deliver intuitive fine-grained summaries that could simplify the purchase decisions of customers.", "citation": "Not cited", "departments": ["Arizona State University", "Amazon.com", "Virginia Tech", "Amazon.com", "Technicolor"], "authors": ["Vineeth Rakesh.....http://dblp.org/pers/hd/r/Rakesh:Vineeth", "Weicong Ding.....http://dblp.org/pers/hd/d/Ding:Weicong", "Aman Ahuja.....http://dblp.org/pers/hd/a/Ahuja:Aman", "Nikhil Rao.....http://dblp.org/pers/hd/r/Rao:Nikhil", "Yifan Sun.....http://dblp.org/pers/hd/s/Sun:Yifan", "Chandan K. Reddy.....http://dblp.org/pers/hd/r/Reddy:Chandan_K="], "conf": "www", "year": "2018", "pages": 10}