{"title": "Enabling Quality-Driven Scalable Video Transmission over Multi-User NOMA System.", "fields": ["spectral efficiency", "throughput", "multi user", "physical layer", "scalability"], "abstract": "Recently, non-orthogonal multiple access (NOMA) has been proposed to achieve higher spectral efficiency over conventional orthogonal multiple access. Although it has the potential to meet increasing demands of video services, it is still challenging to provide high performance video streaming. In this research, we investigate, for the first time, a multi-user NOMA system design for video transmission. Various NOMA systems have been proposed for data transmission in terms of throughput or reliability. However, the perceived quality, or the quality-of-experience of users, is more critical for video transmission. Based on this observation, we design a quality-driven scalable video transmission framework with cross-layer support for multi-user NOMA. To enable low complexity multi-user NOMA operations, a novel user grouping strategy is proposed. The key features in the proposed framework include the integration of the quality model for encoded video with the physical layer model for NOMA transmission, and the formulation of multi-user NOMA-based video transmission as a quality-driven power allocation problem. As the problem is non-concave, a global optimal algorithm based on the hidden monotonic property and a suboptimal algorithm with polynomial time complexity are developed. Simulation results show that the proposed multi-user NOMA system outperforms existing schemes in various video delivery scenarios.", "citation": "Not cited", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University at Buffalo"], "authors": ["Xiaoda Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaoda", "Hancheng Lu.....http://dblp.org/pers/hd/l/Lu:Hancheng", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "conf": "infocom", "year": "2018", "pages": 9}