{"title": "One-Hop Out-of-Band Control Planes for Low-Power Multi-Hop Wireless Networks.", "fields": ["collection tree protocol", "media access control", "lpwan", "hop", "out of band management"], "abstract": "Separation of control and data planes (SCDP) is a desirable paradigm for low-power multi-hop wireless networks requiring high network performance and manageability. Existing SCDP networks generally adopt an in-band control plane scheme in that the control-plane messages are delivered by their data-plane networks. The physical coupling of the two planes may lead to undesirable consequences. To advance the network architecture design, we propose to leverage on the long-range communication capability of the increasingly available low-power wide-area network (LPWAN) radios to form one-hop out-of-band control planes. We choose LoRaWAN, an open, inexpensive, and ISM band based LPWAN radio to prototype our out-of-band control plane called LoRaCP. Several characteristics of LoRaWAN such as downlink-uplink asymmetry and primitive ALOHA media access control (MAC) present challenges to achieving reliability and efficiency. To address these challenges, we design a TDMA-based multi-channel MAC featuring an urgent channel and negative acknowledgment. On a testbed of 16 nodes, we demonstrate applying LoRaCP to physically separate the control-plane network of the Collection Tree Protocol (CTP) from its ZigBee-based data-plane network. Extensive experiments show that LoRaCP increases CTP's packet delivery ratio from 65% to 80% in the presence of external interference, while consuming a per-node average radio power of 2.97mW only.", "citation": "Not cited", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Advanced Digita ... ntre, Singapore"], "authors": ["Chaojie Gu.....http://dblp.org/pers/hd/g/Gu:Chaojie", "Rui Tan.....http://dblp.org/pers/hd/t/Tan:Rui", "Xin Lou.....http://dblp.org/pers/hd/l/Lou:Xin", "Dusit Niyato.....http://dblp.org/pers/hd/n/Niyato:Dusit"], "conf": "infocom", "year": "2018", "pages": 9}