{"title": "In-body backscatter communication and localization.", "fields": ["wireless", "electronic engineering", "bandwidth", "interference", "backscatter"], "abstract": "Backscatter requires zero transmission power, making it a compelling technology for in-body communication and localization. It can significantly reduce the battery requirements (and hence the size) of micro-implants and smart capsules, and enable them to be located on-the-move inside the body. The problem however is that the electrical properties of human tissues are very different from air and vacuum. This creates new challenges for both communication and localization. For example, signals no longer travel along straight lines, which destroys the geometric principles underlying many localization algorithms. Furthermore, the human skin backscatters the signal creating strong interference to the weak in-body backscatter transmission. These challenges make deep-tissue backscatter intrinsically different from backscatter in air or vacuum. This paper introduces ReMix, a new backscatter design that is particularly customized for deep tissue devices. It overcomes interference from the body surface, and localizes the in-body backscatter devices even though the signal travels along crooked paths. We have implemented our design and evaluated it in animal tissues and human phantoms. Our results demonstrate that ReMix delivers efficient communication at an average SNR of 15.2 dB at 1 MHz bandwidth, and has an average localization accuracy of 1.4 cm  in animal tissues.", "citation": "Not cited", "year": "2018", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "University of Waterloo", "Harvard University", "Harvard University"], "conf": "sigcomm", "authors": ["Deepak Vasisht.....http://dblp.org/pers/hd/v/Vasisht:Deepak", "Guo Zhang.....http://dblp.org/pers/hd/z/Zhang:Guo", "Omid Abari.....http://dblp.org/pers/hd/a/Abari:Omid", "Hsiao-Ming Lu.....http://dblp.org/pers/hd/l/Lu:Hsiao=Ming", "Jacob Flanz.....http://dblp.org/pers/hd/f/Flanz:Jacob", "Dina Katabi.....http://dblp.org/pers/hd/k/Katabi:Dina"], "pages": 15}