{"title": "Energy-efficient Amortized Inference with Cascaded Deep Classifiers.", "fields": ["contextual image classification", "efficient energy use", "inference", "resnet", "computation"], "abstract": "Deep neural networks have been remarkable successful in various AI tasks but often cast high computation and energy cost for energy-constrained applications such as mobile sensing. We address this problem by proposing a novel framework that optimizes the prediction accuracy and energy cost simultaneously, thus enabling effective cost-accuracy trade-off at test time. In our framework, each data instance is pushed into a cascade of deep neural networks with increasing sizes, and a selection module is used to sequentially determine when a sufficiently accurate classifier can be used for this data instance. The cascade of neural networks and the selection module are jointly trained in an end-to-end fashion by the REINFORCE algorithm to optimize a trade-off between the computational cost and the predictive accuracy. Our method is able to simultaneously improve the accuracy and efficiency by learning to assign easy instances to fast yet sufficiently accurate classifiers to save computation and energy cost, while assigning harder instances to deeper and more powerful classifiers to ensure satisfiable accuracy. With extensive experiments on several image classification datasets using cascaded ResNet classifiers, we demonstrate that our method outperforms the standard well-trained ResNets in accuracy but only requires less than 20% and 50% FLOPs cost on the CIFAR-10/100 datasets and 66% on the ImageNet dataset, respectively.", "citation": "Citations (1)", "departments": ["Tsinghua University", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Texas at Austin", "University of Illinois at Urbana–Champaign"], "authors": ["Jiaqi Guan.....http://dblp.org/pers/hd/g/Guan:Jiaqi", "Yang Liu.....http://dblp.org/pers/hd/l/Liu_0097:Yang", "Qiang Liu.....http://dblp.org/pers/hd/l/Liu:Qiang", "Jian Peng.....http://dblp.org/pers/hd/p/Peng_0001:Jian"], "conf": "ijcai", "year": "2018", "pages": 7}