{"title": "Predictive Pre-allocation for Low-latency Uplink Access in Industrial Wireless Networks.", "fields": ["scheduling", "process automation system", "communications system", "telecommunications link", "low latency"], "abstract": "Driven by mission-critical applications in modern industrial systems, the 5th generation (5G) communication system is expected to provide ultra-reliable low-latency communications (URLLC) services to meet the quality of service (QoS) demands of industrial applications. However, these stringent requirements cannot be guaranteed by its conventional dynamic access scheme due to the complex signaling procedure. A promising solution to reduce the access delay is the pre-allocation scheme based on the semi-persistent scheduling (SPS) technique, which however may lead to low spectrum utilization if the allocated resource blocks (RBs) are not used. In this paper, we aim to address this issue by developing DPre, a predictive pre-allocation framework for uplink access scheduling of delay-sensitive applications in industrial process automation. The basic idea of DPre is to explore and exploit the correlation of data acquisition and access behavior between nodes through static and dynamic learning mechanisms in order to make judicious resource per-allocation decisions. We evaluate the effectiveness of DPre based on several monitoring applications in a steel rolling production process. Simulation results demonstrate that DPre achieves better performance in terms of the prediction accuracy, which can effectively increase the rewards of those reserved resources.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Mingyan Li.....http://dblp.org/pers/hd/l/Li:Mingyan", "Xinping Guan.....http://dblp.org/pers/hd/g/Guan:Xinping", "Cunqing Hua.....http://dblp.org/pers/hd/h/Hua:Cunqing", "Cailian Chen.....http://dblp.org/pers/hd/c/Chen:Cailian", "Ling Lyu.....http://dblp.org/pers/hd/l/Lyu:Ling"], "conf": "infocom", "year": "2018", "pages": 9}