{"title": "Multi-Label Image Classification via Knowledge Distillation from Weakly-Supervised Detection.", "fields": ["contextual image classification", "minimum bounding box", "distillation", "pattern recognition", "machine learning"], "abstract": "Multi-label image classification is a fundamental but challenging task towards general visual understanding. Existing methods found the region-level cues (e.g., features from RoIs) can facilitate multi-label classification. Nevertheless, such methods usually require laborious object-level annotations (i.e., object labels and bounding boxes) for effective learning of the object-level visual features. In this paper, we propose a novel and efficient deep framework to boost multi-label classification by distilling knowledge from weakly-supervised detection task without bounding box annotations. Specifically, given the image-level annotations, (1) we first develop a weakly-supervised detection (WSD) model, and then (2) construct an end-to-end multi-label image classification framework augmented by a knowledge distillation module that guides the classification model by the WSD model according to the class-level predictions for the whole image and the object-level visual features for object RoIs. The WSD model is the teacher model and the classification model is the student model. After this cross-task knowledge distillation, the performance of the classification model is significantly improved and the efficiency is maintained since the WSD model can be safely discarded in the test phase. Extensive experiments on two large-scale datasets (MS-COCO and NUS-WIDE) show that our framework achieves superior performances over the state-of-the-art methods on both performance and efficiency.", "citation": "Not cited", "year": "2018", "departments": ["Chinese Academy of Sciences", "The Chinese University of Hong Kong", "Chinese Academy of Sciences", "SenseTime Resea ...  Beijing, China", "SenseTime Resea ...  Beijing, China"], "conf": "mm", "authors": ["Yongcheng Liu.....http://dblp.org/pers/hd/l/Liu:Yongcheng", "Lu Sheng.....http://dblp.org/pers/hd/s/Sheng:Lu", "Jing Shao.....http://dblp.org/pers/hd/s/Shao:Jing", "Junjie Yan.....http://dblp.org/pers/hd/y/Yan:Junjie", "Shiming Xiang.....http://dblp.org/pers/hd/x/Xiang:Shiming", "Chunhong Pan.....http://dblp.org/pers/hd/p/Pan:Chunhong"], "pages": 9}