{"title": "Discovering the roots: uniform closure results for algebraic classes under factoring.", "fields": ["algebraic number", "multiple", "combinatorics", "multiplicity", "factoring", "formal power series", "discrete mathematics", "mathematics", "factorization of polynomials"], "abstract": "Newton iteration (NI) is an almost 350 years old recursive formula that approximates a simple root of a polynomial quite rapidly. We generalize it to a matrix recurrence (allRootsNI) that approximates  all  the roots simultaneously. In this form, the process yields a better circuit complexity in the case when the number of roots  r  is small but the multiplicities are exponentially large. Our method sets up a linear system in  r  unknowns and iteratively builds the roots as formal power series. For an algebraic circuit  f ( x  1 ,…, x   n  ) of size  s  we prove that  each  factor has size at most a polynomial in:  s  and the degree of the squarefree part of  f . Consequently, if  f  1  is a 2 Ω( n ) -hard polynomial then any nonzero multiple ∏  i    f   i    e   i    is equally hard for  arbitrary  positive  e   i  ’s, assuming that ∑  i  deg( f   i  ) is at most 2  O ( n ) .    It is an old open question whether the class of poly( n )-sized formulas (resp. algebraic branching programs) is closed under factoring. We show that given a polynomial  f  of degree  n   O (1)  and formula (resp. ABP) size  n   O (log n )  we can find a similar size formula (resp. ABP) factor in randomized poly( n  log n  )-time. Consequently, if determinant requires  n  Ω(log n )  size formula, then the same can be said about any of its nonzero multiples.    As part of our proofs, we identify a new property of multivariate polynomial factorization. We show that under a random linear transformation τ,  f (τ x )  completely  factors via power series roots. Moreover, the factorization adapts well to circuit complexity analysis. This with allRootsNI are the techniques that help us make progress towards the old open problems; supplementing the large body of classical results and concepts in algebraic circuit factorization (eg. Zassenhaus, J.NT 1969; Kaltofen, STOC 1985-7 & B'urgisser, FOCS 2001).", "citation": "Not cited", "year": "2018", "departments": ["Chennai Mathematical Institute", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur"], "conf": "stoc", "authors": ["Pranjal Dutta.....http://dblp.org/pers/hd/d/Dutta:Pranjal", "Nitin Saxena.....http://dblp.org/pers/hd/s/Saxena_0001:Nitin", "Amit Sinhababu.....http://dblp.org/pers/hd/s/Sinhababu:Amit"], "pages": 14}