{"title": "Flutes vs. Cellos: Analyzing Mobility-Traffic Correlations in Large WLAN Traces.", "fields": ["multidimensional analysis", "mobility model", "cellular network", "scenario testing", "granularity"], "abstract": "Two major factors affecting mobile network performance are mobility and traffic patterns. Simulations and analytical-based performance evaluations rely on models to approximate factors affecting the network. Hence, the understanding of mobility and traffic is imperative to the effective evaluation and efficient design of future mobile networks. Current models target either mobility or traffic, but do not capture their interplay. Many trace-based mobility models have largely used pre-smartphone datasets (e.g., AP-logs), or much coarser granularity (e.g., cell-towers) traces. This raises questions regarding the relevance of existing models, and motivates our study to revisit this area. In this study, we conduct a multidimensional analysis, to quantitatively characterize mobility and traffic spatio-temporal patterns, for laptops and smartphones, leading to a detailed integrated mobility-traffic analysis. Our study is data-driven, as we collect and mine capacious datasets (with 30TB, 300k devices) that capture all of these dimensions. The investigation is performed using our systematic (FLAMeS) framework. Overall, dozens of mobility and traffic features have been analyzed. The insights and lessons learnt serve as guidelines and a first step towards future integrated mobility-traffic models. In addition, our work acts as a stepping-stone towards a richer, more-realistic suite of mobile test scenarios and benchmarks.", "citation": "Not cited", "departments": ["University of Florida", "Technische Universität München", "Technische Universität München", "University of Florida", "TUM, Germany"], "authors": ["Babak Alipour.....http://dblp.org/pers/hd/a/Alipour:Babak", "Leonardo Tonetto.....http://dblp.org/pers/hd/t/Tonetto:Leonardo", "Aaron Yi Ding.....http://dblp.org/pers/hd/d/Ding:Aaron_Yi", "Roozbeh Ketabi.....http://dblp.org/pers/hd/k/Ketabi:Roozbeh", "Jörg Ott.....http://dblp.org/pers/hd/o/Ott:J=ouml=rg", "Ahmed Helmy.....http://dblp.org/pers/hd/h/Helmy:Ahmed"], "conf": "infocom", "year": "2018", "pages": 9}