{"title": "Any \"Body\" There? Avatar Visibility Effects in a Virtual Reality Game.", "fields": ["immersion", "virtual reality", "flow", "visibility", "game developer"], "abstract": "This article presents an experiment exploring the possible impact of avatar's body part visibility on players' experience and performance using current Virtual Reality (VR) gaming platform capacities. In an action-based VR game, a player sees an avatar in first person perspective which is replicating his/her hand, head and body motion. In contrast to the expected outcome from non-game VR contexts, our results did not reveal significant differences with an avatar presenting an increasing number of visible body parts. The body ownership, immersion, emotional and cognitive involvements as well as the perceived control and difficulty were not improved with a more coherent virtual body. This tends to confirm the strong performance aspect of action-based games, whereby control efficiency and enemy awareness is paramount, and could overcome the perceptual, behavioural or emotional effects of avatar embodiment. Digital games are indeed prone to create an intense flow state typically reducing self-awareness, and focusing on the game completion and high performance achievements. However, further experiments with full-body tracking and different game types are necessary to confirm this trend. This research outcome motivates further analysis of the mutual influence of bottom-up and top-down factors of avatar embodiment causing psychophysical effects. In addition, it provides useful indications for VR game developers and researchers on possible effects and evaluation methods.", "citation": "Citations (1)", "departments": ["University of Würzburg", "University of Würzburg", "University of Würzburg", "University of Würzburg", "University of Würzburg"], "authors": ["Jean-Luc Lugrin.....http://dblp.org/pers/hd/l/Lugrin:Jean=Luc", "Maximilian Ertl.....http://dblp.org/pers/hd/e/Ertl:Maximilian", "Philipp Krop.....http://dblp.org/pers/hd/k/Krop:Philipp", "Richard Klupfel.....http://dblp.org/pers/hd/k/Klupfel:Richard", "Sebastian Stierstorfer.....http://dblp.org/pers/hd/s/Stierstorfer:Sebastian", "Bianka Weisz.....http://dblp.org/pers/hd/w/Weisz:Bianka", "Maximilian Ruck.....http://dblp.org/pers/hd/r/Ruck:Maximilian", "Johann Schmitt.....http://dblp.org/pers/hd/s/Schmitt:Johann", "Nina Schmidt.....http://dblp.org/pers/hd/s/Schmidt:Nina", "Marc Erich Latoschik.....http://dblp.org/pers/hd/l/Latoschik:Marc_Erich"], "conf": "vr", "year": "2018", "pages": 8}