{"title": "Tracking Ransomware End-to-end.", "fields": ["payment", "malware", "financial transaction", "end to end principle", "ransomware"], "abstract": "Ransomware is a type of malware that encrypts the files of infected hosts and demands payment, often in a crypto-currency like Bitcoin. In this paper, we create a measurement framework that we use to perform a large-scale, two-year, end-to-end measurement of ransomware payments, victims, and operators. By combining an array of data sources, including ransomware binaries, seed ransom payments, victim telemetry from infections, and a large database of bitcoin addresses annotated with their owners, we sketch the outlines of this burgeoning ecosystem and associated third-party infrastructure. In particular, we are able to trace the financial transactions, from the acquisition of bitcoins by victims, through the payment of ransoms, to the cash out of bitcoins by the ransomware operators. We find that many ransomware operators cashed out using BTC-e, a now-defunct Bitcoin exchange. In total we are able to track over $16 million USD in likely ransom payments made by 19,750 potential victims during a two-year period. While our study focuses on ransomware, our methods are potentially applicable to other cybercriminal operations that have similarly adopted Bitcoin as their payment channel.", "citation": "Citations (2)", "departments": ["Princeton University", "New York University", "University of California, San Diego", "Google", "Google"], "authors": ["Danny Yuxing Huang.....http://dblp.org/pers/hd/h/Huang:Danny_Yuxing", "Maxwell Matthaios Aliapoulios.....http://dblp.org/pers/hd/a/Aliapoulios:Maxwell_Matthaios", "Vector Guo Li.....http://dblp.org/pers/hd/l/Li:Vector_Guo", "Luca Invernizzi.....http://dblp.org/pers/hd/i/Invernizzi:Luca", "Elie Bursztein.....http://dblp.org/pers/hd/b/Bursztein:Elie", "Kylie McRoberts.....http://dblp.org/pers/hd/m/McRoberts:Kylie", "Jonathan Levin.....http://dblp.org/pers/hd/l/Levin:Jonathan", "Kirill Levchenko.....http://dblp.org/pers/hd/l/Levchenko:Kirill", "Alex C. Snoeren.....http://dblp.org/pers/hd/s/Snoeren:Alex_C=", "Damon McCoy.....http://dblp.org/pers/hd/m/McCoy:Damon"], "conf": "sp", "year": "2018", "pages": 14}