{"title": "DAO", "fields": ["irrigation", "geostrophic wind", "vorticity", "glycine", "meter", "polytrauma", "surgery", "carboxylic acid", "orthopedic surgery", "geography", "psychology", "buddhism", "enzyme inhibitor", "upland rice", "d amino acid oxidase", "happiness", "medicine", "matrix decomposition", "alternative splicing", "serine", "serine racemase", "water use", "germplasm", "acetabular fracture", "political science", "neuroscience", "normalization", "variational analysis", "potency", "hydrology", "water scarcity", "data assimilation", "unconscious mind", "single nucleotide polymorphism"], "abstract": "Conventional optimal interpolation (OI) analysis systems solve the standard statistical analysis equations approximately, by invoking a local approximation and a data selection procedure. Although solution of the analysis equations is essentially exact in the recent generation of global spectral variational analysis systems, these new systems also include substantial changes in error covariance modeling, making it difficult to discern whether improvements in analysis and forecast quality are due to exact, global solution of the analysis equations, or to changes in error covariance modeling. The formulation and implementation of a new type of global analysis system at the Data Assimilation Office, termed the Physical-space Statistical Analysis System (PSAS), is described in this article. Since this system operates directly in physical space, it is capable of employing error covariance models identical to those of the predecessor OI system, as well as more advanced models. To focus strictly on the effect of global versus local solution of the analysis equations, a comparison between PSAS and OI analyses is carried out with both systems using identical error covariance models and identical data. Spectral decomposition of the analysis increments reveals that, relative to the PSAS increments, the OI increments have too little power at large horizontal scales and excessive power at small horizontal scales. The OI increments also display an unrealistically large ratio of divergence to vorticity. Dynamical imbalances in the OI-analyzed state can therefore be attributed in part to the approximate local method of solution, and are not entirely due to the simple geostrophic constraint built into the forecast error covariance model. Root-mean-square observation minus 6-h forecast errors in the zonal wind component are substantially smaller for the PSAS system than for the OI system.", "citation": "Citations (385)", "year": "2018", "departments": ["Goddard Space Flight Center", "Goddard Space Flight Center", "Goddard Space Flight Center", "Goddard Space Flight Center", "Goddard Space Flight Center", "CGIAR", "University of Tübingen", "University of Jena", "University of Jena", "University of Tübingen", "Itron", "RIKEN Brain Science Institute", "RIKEN Brain Science Institute", "Chiba University", "RIKEN Brain Science Institute", "RIKEN Brain Science Institute", "Merck & Co.", "Merck & Co.", "Merck & Co.", "Merck & Co.", "Merck & Co.", "University Hosp ... g/Saar, Germany"], "conf": "infocom", "authors": ["Bin Tang.....http://dblp.org/pers/hd/t/Tang:Bin"], "pages": 9}