{"title": "Juggler: a dependence-aware task-based execution framework for GPUs.", "fields": ["source code", "computation", "speedup", "thread", "simd"], "abstract": "Scientific applications with single instruction, multiple data (SIMD) computations show considerable performance improvements when run on today's graphics processing units (GPUs). However, the existence of data dependences across thread blocks may significantly impact the speedup by requiring global synchronization across multiprocessors (SMs) inside the GPU. To efficiently run applications with interblock data dependences, we need fine-granular task-based execution models that will treat SMs inside a GPU as stand-alone parallel processing units. Such a scheme will enable faster execution by utilizing all internal computation elements inside the GPU and eliminating unnecessary waits during device-wide global barriers.   In this paper, we propose  Juggler , a task-based execution scheme for GPU workloads with data dependences. The Juggler framework takes applications embedding OpenMP 4.5 tasks as input and executes them on the GPU via an efficient in-device runtime, hence eliminating the need for kernel-wide global synchronization. Juggler requires no or little modification to the source code, and once launched, the runtime entirely runs on the GPU without relying on the host through the entire execution. We have evaluated Juggler on an NVIDIA Tesla P100 GPU and obtained up to 31% performance improvement against global barrier based implementation, with minimal runtime overhead.", "citation": "Not cited", "year": "2018", "departments": ["Oak Ridge National Laboratory", "Oak Ridge National Laboratory", "Oak Ridge National Laboratory", "University of California, Berkeley", "University of California"], "conf": "ppopp", "authors": ["Mehmet E. Belviranli.....http://dblp.org/pers/hd/b/Belviranli:Mehmet_E=", "Seyong Lee.....http://dblp.org/pers/hd/l/Lee:Seyong", "Jeffrey S. Vetter.....http://dblp.org/pers/hd/v/Vetter:Jeffrey_S=", "Laxmi N. Bhuyan.....http://dblp.org/pers/hd/b/Bhuyan:Laxmi_N="], "pages": 14}