{"title": "Spatially Perturbed Collision Sounds Attenuate Perceived Causality in 3D Launching Events.", "fields": ["immersion", "collision", "virtual reality", "visual capture", "causality"], "abstract": "When a moving object collides with an object at rest, people immediately perceive a causal event: i.e., the first object has launched the second object forwards. However, when the second object's motion is delayed, or is accompanied by a collision sound, causal impressions attenuate and strengthen. Despite a rich literature on causal perception, researchers have exclusively utilized 2D visual displays to examine the launching effect. It remains unclear whether people are equally sensitive to the spatiotemporal properties of observed collisions in the real world. The present study first examined whether previous findings in causal perception with audiovisual inputs can be extended to immersive 3D virtual environments. We then investigated whether perceived causality is influenced by variations in the spatial position of an auditory collision indicator. We found that people are able to localize sound positions based on auditory inputs in VR environments, and spatial discrepancy between the estimated position of the collision sound and the visually observed impact location attenuates perceived causality.", "citation": "Not cited", "departments": ["Beijing Institute of Technology", "University of California, Los Angeles", "University of California, Los Angeles", "Beijing Institute of Technology", "University of California, Los Angeles"], "authors": ["Duotun Wang.....http://dblp.org/pers/hd/w/Wang:Duotun", "James Kubricht.....http://dblp.org/pers/hd/k/Kubricht:James", "Yixin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yixin", "Wei Liang.....http://dblp.org/pers/hd/l/Liang:Wei", "Song-Chun Zhu.....http://dblp.org/pers/hd/z/Zhu:Song=Chun", "Chenfanfu Jiang.....http://dblp.org/pers/hd/j/Jiang:Chenfanfu", "Hongjing Lu.....http://dblp.org/pers/hd/l/Lu:Hongjing"], "conf": "vr", "year": "2018", "pages": 8}