{"title": "Deception Detection in Videos.", "fields": ["covert", "training set", "deception", "mel frequency cepstrum", "machine learning"], "abstract": "We present a system for covert automated deception detection in real-life courtroom trial videos. We study the importance of different modalities like vision, audio and text for this task. On the vision side, our system uses classifiers trained on low level video features which predict human micro-expressions. We show that predictions of high-level micro-expressions can be used as features for deception prediction. Surprisingly, IDT (Improved Dense Trajectory) features which have been widely used for action recognition, are also very good at predicting deception in videos. We fuse the score of classifiers trained on IDT features and high-level micro-expressions to improve performance. MFCC (Mel-frequency Cepstral Coefficients) features from the audio domain also provide a significant boost in performance, while information from transcripts is not very beneficial for our system. Using various classifiers, our automated system obtains an AUC of 0.877 (10-fold cross-validation) when evaluated on subjects which were not part of the training set. Even though state-of-the-art methods use human annotations of micro-expressions for deception detection, our fully automated approach outperforms them by 5%. When combined with human annotations of micro-expressions, our AUC improves to 0.922. We also present results of a user-study to analyze how well do average humans perform on this task, what modalities they use for deception detection and how they perform if only one modality is accessible. Our project page can be found at \\url{this https URL}.", "citation": "Citations (1)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Zhe Wu.....http://dblp.org/pers/hd/w/Wu:Zhe", "Bharat Singh.....http://dblp.org/pers/hd/s/Singh:Bharat", "Larry S. Davis.....http://dblp.org/pers/hd/d/Davis:Larry_S=", "V. S. Subrahmanian.....http://dblp.org/pers/hd/s/Subrahmanian:V=_S="], "conf": "aaai", "year": "2018", "pages": 8}