{"title": "Efficient Algorithms for Asymptotic Bounds on Termination Time in VASS.", "fields": ["integer", "quadratic equation", "abstract interpretation", "parameterized complexity", "of the form"], "abstract": "Vector Addition Systems with States (VASS) provide a well-known and fundamental model for the analysis of concurrent processes, parameterized systems, and are also used as abstract models of programs in resource bound analysis. In this paper we study the problem of obtaining asymptotic bounds on the termination time of a given VASS. In particular, we focus on the practically important case of obtaining polynomial bounds on termination time. Our main contributions are as follows: First, we present a polynomial-time algorithm for deciding whether a given VASS has a linear asymptotic complexity. We also show that if the complexity of a VASS is not linear, it is at least quadratic. Second, we classify VASS according to quantitative properties of their cycles. We show that certain singularities in these properties are the key reason for non-polynomial asymptotic complexity of VASS. In absence of singularities, we show that the asymptotic complexity is always polynomial and of the form Θ(nk), for some integer k ≤ d, where d is the dimension of the VASS. We present a polynomial-time algorithm computing the optimal k. For general VASS, the same algorithm, which is based on a complete technique for the construction of ranking functions in VASS, produces a valid lower bound, i.e., a k such that the termination complexity is Ω(nk). Our results are based on new insights into the geometry of VASS dynamics, which hold the potential for further applicability to VASS analysis.", "citation": "Not cited", "departments": ["Masaryk University", "Institute of Science and Technology Austria", "Masaryk University", "Institute of Science and Technology Austria", "Masaryk University"], "authors": ["Tomás Brázdil.....http://dblp.org/pers/hd/b/Br=aacute=zdil:Tom=aacute=s", "Krishnendu Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Krishnendu", "Antonín Kucera.....http://dblp.org/pers/hd/k/Kucera:Anton=iacute=n", "Petr Novotný.....http://dblp.org/pers/hd/n/Novotn=yacute=_0001:Petr", "Dominik Velan.....http://dblp.org/pers/hd/v/Velan:Dominik", "Florian Zuleger.....http://dblp.org/pers/hd/z/Zuleger:Florian"], "conf": "lics", "year": "2018", "pages": 10}