{"title": "Social VR: How Personal Space is Affected by Virtual Agents' Emotions.", "fields": ["arousal", "interpersonal communication", "personal space", "phenomenon", "embodied cognition"], "abstract": "Personal space (PS), the flexible protective zone maintained around oneself, is a key element of everyday social interactions. It, e.g., affects people's interpersonal distance and is thus largely involved when navigating through social environments. However, the PS is regulated dynamically, its size depends on numerous social and personal characteristics and its violation evokes different levels of discomfort and physiological arousal. Thus, gaining more insight into this phenomenon is important. We contribute to the PS investigations by presenting the results of a controlled experiment in a CAVE, focusing on German males in the age of 18 to 30 years. The PS preferences of 27 participants have been sampled while they were approached by either a single embodied, computer-controlled virtual agent (VA) or by a group of three VAs. In order to investigate the influence of a VA's emotions, we altered their facial expression between angry and happy. Our results indicate that the emotion as well as the number of VAs approaching influence the PS: larger distances are chosen to angry VAs compared to happy ones; single VAs are allowed closer compared to the group. Thus, our study is a foundation for social and behavioral studies investigating PS preferences.", "citation": "Not cited", "departments": ["RWTH Aachen University", "RWTH Aachen University", "RWTH Aachen University", "RWTH Aachen University", "RWTH Aachen University"], "authors": ["Andrea Bönsch.....http://dblp.org/pers/hd/b/B=ouml=nsch:Andrea", "Sina Radke.....http://dblp.org/pers/hd/r/Radke:Sina", "Heiko Overath.....http://dblp.org/pers/hd/o/Overath:Heiko", "Laura M. Asche.....http://dblp.org/pers/hd/a/Asche:Laura_M=", "Jonathan Wendt.....http://dblp.org/pers/hd/w/Wendt:Jonathan", "Tom Vierjahn.....http://dblp.org/pers/hd/v/Vierjahn:Tom", "Ute Habel.....http://dblp.org/pers/hd/h/Habel:Ute", "Torsten W. Kuhlen.....http://dblp.org/pers/hd/k/Kuhlen:Torsten_W="], "conf": "vr", "year": "2018", "pages": 8}