{"title": "A Dynamic Pipeline for Spatio-Temporal Fire Risk Prediction.", "fields": ["data mining", "computer science", "safeguard", "dashboard", "risk management framework"], "abstract": "Recent high-profile fire incidents in cities around the world have highlighted gaps in fire risk reduction efforts, as cities grapple with fewer resources and more properties to safeguard. To address this resource gap, prior work has developed machine learning frameworks to predict fire risk and prioritize fire inspections. However, existing approaches were limited by not including time-varying data, never deploying in real-time, and only predicting risk for a small subset of commercial properties in their city. Here, we have developed a predictive risk framework for all 20,636 commercial properties in Pittsburgh, based on time-varying data from a variety of municipal agencies. We have deployed our fire risk model on Pittsburgh Bureau of Fire's (PBF), and we have developed preliminary risk models for residential property fire risk prediction. Our commercial risk model outperforms the prior state of the art with a kappa of 0.33 compared to their 0.17, and is able to be applied to nearly 4 times as many properties as the prior model. In the 5 weeks since our model was first deployed, 58% of our predicted high-risk properties had a fire incident of any kind, while 23% of the building fire incidents that occurred took place in our predicted high or medium risk properties. The risk scores from our commercial model are visualized on an interactive dashboard and map to assist the PBF with planning their fire risk reduction initiatives. This work is already helping to improve fire risk reduction in Pittsburgh and is beginning to be adopted by other cities.", "citation": "Not cited", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Bhavkaran Singh Walia.....http://dblp.org/pers/hd/w/Walia:Bhavkaran_Singh", "Qianyi Hu.....http://dblp.org/pers/hd/h/Hu:Qianyi", "Jeffrey Chen.....http://dblp.org/pers/hd/c/Chen:Jeffrey", "Fangyan Chen.....http://dblp.org/pers/hd/c/Chen:Fangyan", "Jessica Lee.....http://dblp.org/pers/hd/l/Lee:Jessica", "Nathan Kuo.....http://dblp.org/pers/hd/k/Kuo:Nathan", "Palak Narang.....http://dblp.org/pers/hd/n/Narang:Palak", "Jason Batts.....http://dblp.org/pers/hd/b/Batts:Jason", "Geoffrey Arnold.....http://dblp.org/pers/hd/a/Arnold:Geoffrey", "Michael Madaio.....http://dblp.org/pers/hd/m/Madaio:Michael"], "conf": "kdd", "year": "2018", "pages": 10}