{"title": "Ex-post IR Dynamic Auctions with Cost-per-Action Payments.", "fields": ["incentive compatibility", "common value auction", "machine learning", "rationality", "microeconomics", "common knowledge", "payment", "artificial intelligence"], "abstract": "Consider a repeated auction between one seller and many buyers, where each buyer only has an estimation of her value in each period until she actually receives the item in that period. The seller is allowed to conduct a dynamic auction to sell the items but must guarantee ex-post individual rationality. In other words, if the buyer realized that her value of the item she just received was zero, she did not need to pay anything. Unlike the clicks on the ads, these actions are private information only observable by the buyers (advertisers). Hence they may have incentives to misreport the user actions, because they can pay less under cost-per-action payment schemes with ex-post individual rationality guarantees. In this paper, we use a structure that we call credit accounts to enable a general reduction from any incentive compatible and ex-ante individual rational dynamic auction to an approximate incentive compatible and ex-post individually rational dynamic auction with credit accounts. Our reduction can obtain stronger individual rationality guarantees at of the cost of weaker incentive compatibility. Surprisingly, our reduction works without making any common knowledge assumptions. Finally, as a complement to our reduction, we prove that there is no non-trivial auction that is exactly incentive compatible and ex-post individually rational under this setting.", "citation": "Not cited", "departments": ["Tsinghua University", "Shanghai University", "Tsinghua University", "Tsinghua University", "Shanghai University of Finance and Economics", "Tsinghua University"], "authors": ["Weiran Shen.....http://dblp.org/pers/hd/s/Shen:Weiran", "Zihe Wang.....http://dblp.org/pers/hd/w/Wang:Zihe", "Song Zuo.....http://dblp.org/pers/hd/z/Zuo:Song"], "conf": "ijcai", "year": "2018", "pages": 7}