{"title": "PlinyCompute: A Platform for High-Performance, Distributed, Data-Intensive Tool Development.", "fields": ["programmer", "memory management", "object model", "big data", "virtual function"], "abstract": "This paper describes PlinyCompute, a system for development of high-performance, data-intensive, distributed computing tools and libraries. \\emphIn the large, PlinyCompute presents the programmer with a very high-level, declarative interface, relying on automatic, relational-database style optimization to figure out how to stage distributed computations. However, in the small, PlinyCompute presents the capable systems programmer with a persistent object data model and API (the \"PC object model'') and associated memory management system that has been designed from the ground-up for high performance, distributed, data-intensive computing. This contrasts with most other Big Data systems, which are constructed on top of the Java Virtual Machine (JVM), and hence must at least partially cede performance-critical concerns such as memory management (including layout and de/allocation) and virtual method/function dispatch to the JVM. This hybrid approach---declarative in the large, trusting the programmer's ability to utilize PC object model efficiently in the small---results in a system that is ideal for the development of reusable, data-intensive tools and libraries.", "citation": "Not cited", "year": "2018", "departments": ["Rice University", "Rice University", "Rice University", "Rice University", "Rice University"], "conf": "sigmod", "authors": ["Jia Zou.....http://dblp.org/pers/hd/z/Zou_0001:Jia", "R. Matthew Barnett.....http://dblp.org/pers/hd/b/Barnett:R=_Matthew", "Tania Lorido-Botran.....http://dblp.org/pers/hd/l/Lorido=Botran:Tania", "Shangyu Luo.....http://dblp.org/pers/hd/l/Luo:Shangyu", "Carlos Monroy.....http://dblp.org/pers/hd/m/Monroy:Carlos", "Sourav Sikdar.....http://dblp.org/pers/hd/s/Sikdar:Sourav", "Kia Teymourian.....http://dblp.org/pers/hd/t/Teymourian:Kia", "Binhang Yuan.....http://dblp.org/pers/hd/y/Yuan:Binhang", "Chris Jermaine.....http://dblp.org/pers/hd/j/Jermaine:Chris"], "pages": 16}