{"title": "On Interpretation of Network Embedding via Taxonomy Induction.", "fields": ["analytics", "computer science", "artificial intelligence", "embedding", "machine learning"], "abstract": "Network embedding has been increasingly used in many network analytics applications to generate low-dimensional vector representations, so that many off-the-shelf models can be applied to solve a wide variety of data mining tasks. However, similar to many other machine learning methods, network embedding results remain hard to be understood by users. Each dimension in the embedding space usually does not have any specific meaning, thus it is difficult to comprehend how the embedding instances are distributed in the reconstructed space. In addition, heterogeneous content information may be incorporated into network embedding, so it is challenging to specify which source of information is effective in generating the embedding results. In this paper, we investigate the interpretation of network embedding, aiming to understand how instances are distributed in embedding space, as well as explore the factors that lead to the embedding results. We resort to the post-hoc interpretation scheme, so that our approach can be applied to different types of embedding methods. Specifically, the interpretation of network embedding is presented in the form of a taxonomy. Effective objectives and corresponding algorithms are developed towards building the taxonomy. We also design several metrics to evaluate interpretation results. Experiments on real-world datasets from different domains demonstrate that, by comparing with the state-of-the-art alternatives, our approach produces effective and meaningful interpretation to embedding results.", "citation": "Citations (2)", "departments": ["Texas A&M University", "Texas A&M University", "Arizona State University", "Texas A&M University"], "authors": ["Ninghao Liu.....http://dblp.org/pers/hd/l/Liu:Ninghao", "Xiao Huang.....http://dblp.org/pers/hd/h/Huang:Xiao", "Jundong Li.....http://dblp.org/pers/hd/l/Li:Jundong", "Xia Hu.....http://dblp.org/pers/hd/h/Hu:Xia"], "conf": "kdd", "year": "2018", "pages": 9}