{"title": "Effect of Virtual Human Gaze Behaviour During an Orthogonal Collision Avoidance Walking Task.", "fields": ["immersion", "simulation", "computer vision", "gait", "treadmill"], "abstract": "Understanding the sensorimotor control mechanisms that mediate gait compensation during environmental perturbation is a crucial step in developing tailored rehabilitative therapies to restore ambulation in patient populations. Current methods to evaluate the effects of environmental perturbations involve costly systems that physically perturb patients to elicit a compensatory response. Studies have shown that visual feedback alone can elicit dramatic changes in gait; however, the impact of fully immersive visual feedback is not well studied. Here we examined whether a low cost immersive virtual reality (VR) system can elicit perturbation responses similar to a physical disruption. We examined the responses of 11 subjects as they walked through a VR environment consisting of a bridge spanning a lake. While subjects walked on a treadmill mounted to a 6 degree-of-freedom motion base, pseudorandom roll perturbations (3, 6, 11 deg.) were applied visually to the bridge with (VP trials) and without (V trials) the corresponding physical displacement of the motion base. Significant differences were found between normal (unperturbed) walking and normal walking in the VR environment (p .05). The results demonstrate that visual perturbations provided in an immersive virtual environment can induce compensatory changes in gait during treadmill walking that are consistent with a physical perturbation. The application of environmental perturbations in VR systems could provide a cost-effective approach for gait rehabilitation in patient populations.", "citation": "Not cited", "departments": ["Marquette University", "Marquette University", "Marquette University", "Marquette University"], "authors": ["Sean Dean Lynch.....http://dblp.org/pers/hd/l/Lynch:Sean_Dean", "Julien Pettré.....http://dblp.org/pers/hd/p/Pettr=eacute=:Julien", "Julien Bruneau.....http://dblp.org/pers/hd/b/Bruneau_0002:Julien", "Richard Kulpa.....http://dblp.org/pers/hd/k/Kulpa:Richard", "Armel Crétual.....http://dblp.org/pers/hd/c/Cr=eacute=tual:Armel", "Anne-Hélène Olivier.....http://dblp.org/pers/hd/o/Olivier:Anne=H=eacute=l=egrave=ne"], "conf": "vr", "year": "2018", "pages": 7}