{"title": "Combating Bufferbloat in Multi-Bottleneck Networks: Equilibrium, Stability, and Algorithms.", "fields": ["phenomenon", "active queue management", "codel", "exponential stability", "bufferbloat"], "abstract": "Bufferbloat is a phenomenon where router buffers are constantly being filled, resulting in high queueing delay and delay variation. Larger buffer size and more delay-sensitive applications on the Internet have made this phenomenon a pressing issue. Active queue management (AQM) algorithms, which play an important role in combating bufferbloat, have not been widely deployed due to complicated manual parameter tuning. Moreover, AQM algorithms are often designed and analyzed based on models with a single bottleneck link, rendering their performance and stability unclear in multi-bottleneck networks. In this paper, we propose a general framework to combat bufferbloat in multi-bottleneck networks. We first conduct an equilibrium analysis for a general multi-bottleneck TCP/ AQM system and develop an algorithm to compute the equilibrium point. We then decompose the system into single-bottleneck subsystems and derive sufficient conditions for the local asymptotic stability of the subsystems. Using the proposed framework, we present a case study to analyze the stability of the recently proposed Controlled Delay (CoDel) in multi-bottleneck networks and devise Self-tuning CoDel to improve the system stability and performance. Extensive simulation results show that Self-tuning CoDel effectively stabilizes queueing delay in multi-bottleneck scenarios, and thus contributes to combating bufferbloat.", "citation": "Not cited", "year": "2018", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "California Institute of Technology"], "conf": "infocom", "authors": ["Jiancheng Ye.....http://dblp.org/pers/hd/y/Ye:Jiancheng", "Ka-Cheong Leung.....http://dblp.org/pers/hd/l/Leung:Ka=Cheong", "Victor O. K. Li.....http://dblp.org/pers/hd/l/Li:Victor_O=_K=", "Steven H. Low.....http://dblp.org/pers/hd/l/Low:Steven_H="], "pages": 9}