{"title": "Hierarchical Variational Memory Network for Dialogue Generation.", "fields": ["artificial intelligence", "utterance", "decoding methods", "artificial neural network", "machine learning"], "abstract": "Dialogue systems, also known as interactive conversational agents, are widely used in applications aiming to interact naturally and intelligently with humans. Dialogue generation is about generating utterance given previous utterances as contexts. Among di?erent spectrums of dialogue generation approaches, end-to-end neural generation models surge in recent researches. Unlike other methods, those end-to-end neural generation models are capable of generating natural sounding sentences with a unifed neural network encoder-decoder structure. The end-to-end structure sequentially encodes each word in an input context and generate the response word-by-word deterministically when decoding. However, the lack of variation and the limited ability in capturing long-term dependencies between utterances still make the dialogue generation a challenging research problem. In this paper, we propose a novel neural network encoder-decoder based model—the hierarchical variational memory network (HVMN), to take advantage of both the hierarchical structure and the variational memory network, which not only emulates human-to-human dialogues, but also latently captures the high-level abstract variations and long-term memories during dialogue tracking. Extensive experiments conducted on two benchmark datasets in English and Chinese, and an e-commerce customer service dataset show the effectiveness of our proposed method. Moreover, we fnd that HVMN outperforms state-of-the-art baselines in all three datasets signifcantly", "citation": "Citations (1)", "departments": ["Michigan State University", "JD.com, Beijing, China", "JD.com, Beijing, China", "JD.com, Beijing, CA, China", "JD.com, Beijing, China"], "authors": ["Hongshen Chen.....http://dblp.org/pers/hd/c/Chen:Hongshen", "Zhaochun Ren.....http://dblp.org/pers/hd/r/Ren:Zhaochun", "Jiliang Tang.....http://dblp.org/pers/hd/t/Tang:Jiliang", "Yihong Eric Zhao.....http://dblp.org/pers/hd/z/Zhao:Yihong_Eric", "Dawei Yin.....http://dblp.org/pers/hd/y/Yin:Dawei"], "conf": "www", "year": "2018", "pages": 10}