{"title": "Towards Repeatable Wireless Network Simulation Using Performance Aware Markov Model.", "fields": ["network packet", "anycast", "mobile technology", "testbed", "markov model"], "abstract": "Wireless network simulation is a fundamental service aiming at providing controlled and repeatable environment for protocol design, performance testing, etc. The existing simulators focus on reproducing the packet behaviors on individual links. However, as observed in some recent works, individual link behaviors alone are not enough to characterize the protocol performance. As a result, while the existing\nworks can mimic the link behaviors very closely, they often fail to simulate protocol level performance. In this paper, we propose a novel performance-aware simulation approach which can preserve not only the link-level behaviors but also\nthe performance-level behaviors. We first devise an accurate performance model by combining link quality and the spatialtemporal\nlink correlation. Based on the performance modeling, we then propose a Performance Aware Hidden Markov Model (PA-HMM), where the protocol performance is directly fed into the Markov state transitions. PA-HMM is able to simulate both link-level behaviors and high-level protocol performance. We conduct extensive testbed and simulation experiments with broadcast and anycast protocols. The results show that compared to the state-of-the-art work, 1) the performance model is able to accurately characterize wireless communication performance and 2) the protocol performance is closely simulated as compared to the empirical results.", "citation": "Not cited", "departments": ["University of Electronic Science and Technology of China", "Zhejiang University", "University of Exeter", "Zhejiang University", "RMIT University"], "authors": ["Zhiwei Zhao.....http://dblp.org/pers/hd/z/Zhao:Zhiwei", "Wei Dong.....http://dblp.org/pers/hd/d/Dong_0001:Wei", "Geyong Min.....http://dblp.org/pers/hd/m/Min:Geyong", "Gonglong Chen.....http://dblp.org/pers/hd/c/Chen:Gonglong", "Tao Gu.....http://dblp.org/pers/hd/g/Gu:Tao", "Jiajun Bu.....http://dblp.org/pers/hd/b/Bu:Jiajun"], "conf": "infocom", "year": "2018", "pages": 9}