{"title": "Synthesizing Robust Adversarial Examples.", "fields": ["image noise", "distortion", "affine transformation", "artificial neural network", "adversarial system"], "abstract": "Neural network-based classifiers parallel or exceed human-level accuracy on many common tasks and are used in practical systems. Yet, neural networks are susceptible to adversarial examples, carefully perturbed inputs that cause networks to misbehave in arbitrarily chosen ways. When generated with standard methods, these examples do not consistently fool a classifier in the physical world due to a combination of viewpoint shifts, camera noise, and other natural transformations. Adversarial examples generated using standard techniques require complete control over direct input to the classifier, which is impossible in many real-world systems. We introduce the first method for constructing real-world 3D objects that consistently fool a neural network across a wide distribution of angles and viewpoints. We present a general-purpose algorithm for generating adversarial examples that are robust across any chosen distribution of transformations. We demonstrate its application in two dimensions, producing adversarial images that are robust to noise, distortion, and affine transformation. Finally, we apply the algorithm to produce arbitrary physical 3D-printed adversarial objects, demonstrating that our approach works end-to-end in the real world. Our results show that adversarial examples are a practical concern for real-world systems.", "citation": "Citations (68)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "LabSix"], "authors": ["Anish Athalye.....http://dblp.org/pers/hd/a/Athalye:Anish", "Logan Engstrom.....http://dblp.org/pers/hd/e/Engstrom:Logan", "Andrew Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Andrew", "Kevin Kwok.....http://dblp.org/pers/hd/k/Kwok:Kevin"], "conf": "icml", "year": "2018", "pages": 10}