{"title": "Statistical learning of API fully qualified names in code snippets of online forums.", "fields": ["snippet", "machine translation", "code", "ambiguity", "declaration"], "abstract": "Software developers often make use of the online forums such as StackOverflow (SO) to learn how to use software libraries and their APIs. However, the code snippets in such a forum often contain undeclared, ambiguous, or largely unqualified external references. Such declaration ambiguity and external reference ambiguity present challenges for developers in learning to correctly use the APIs. In this paper, we propose S tat T ype,  a statistical approach to resolve the fully qualified names (FQNs) for the API elements in such code snippets. Unlike existing approaches that are based on heuristics, S tat T ype  has two well-integrated factors. We first learn from a large training code corpus the FQNs that often co-occur. Then, to derive the FQN for an API name in a code snippet, we use that knowledge and also leverage the context consisting of neighboring API names. To realize those factors, we treat the problem as statistical machine translation from source code with partially qualified names to source code with FQNs of the APIs. Our empirical evaluation on real-world code and StackOverflow posts shows that S tat T ype  achieves very high accuracy with 97.6% precision and 96.7% recall, which is 16.5% relatively higher than the state-of-the-art approach.", "citation": "Not cited", "departments": ["Iowa State University", "Iowa State University", "University of Texas at Dallas", "University of Texas at Dallas", "Independent Researcher"], "authors": ["Hung Phan.....http://dblp.org/pers/hd/p/Phan:Hung", "Hoan Anh Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Hoan_Anh", "Ngoc M. Tran.....http://dblp.org/pers/hd/t/Tran:Ngoc_M=", "Linh H. Truong.....http://dblp.org/pers/hd/t/Truong:Linh_H=", "Anh Tuan Nguyen.....http://dblp.org/pers/hd/n/Nguyen_0001:Anh_Tuan", "Tien N. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Tien_N="], "conf": "icse", "year": "2018", "pages": 11}