{"title": "αDiff: cross-version binary code similarity detection with DNN.", "fields": ["binary code", "binary function", "plagiarism detection", "byte", "binary number"], "abstract": "Binary code similarity detection (BCSD) has many applications, including patch analysis, plagiarism detection, malware detection, and vulnerability search etc. Existing solutions usually perform comparisons over specific syntactic features extracted from binary code, based on expert knowledge. They have either high performance overheads or low detection accuracy. Moreover, few solutions are suitable for detecting similarities between cross-version binaries, which may not only diverge in syntactic structures but also diverge slightly in semantics.    In this paper, we propose a solution αDiff, employing three semantic features, to address the cross-version BCSD challenge. It first extracts the intra-function feature of each binary function using a deep neural network (DNN). The DNN works directly on raw bytes of each function, rather than features (e.g., syntactic structures) provided by experts. αDiff further analyzes the function call graph of each binary, which are relatively stable in cross-version binaries, and extracts the inter-function and inter-module features. Then, a distance is computed based on these three features and used for BCSD. We have implemented a prototype of αDiff, and evaluated it on a dataset with about 2.5 million samples. The result shows that αDiff outperforms state-of-the-art static solutions by over 10 percentages on average in different BCSD settings.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Tsinghua University", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Bingchang Liu.....http://dblp.org/pers/hd/l/Liu:Bingchang", "Wei Huo.....http://dblp.org/pers/hd/h/Huo:Wei", "Chao Zhang.....http://dblp.org/pers/hd/z/Zhang_0008:Chao", "Wenchao Li.....http://dblp.org/pers/hd/l/Li:Wenchao", "Feng Li.....http://dblp.org/pers/hd/l/Li:Feng", "Aihua Piao.....http://dblp.org/pers/hd/p/Piao:Aihua", "Wei Zou.....http://dblp.org/pers/hd/z/Zou:Wei"], "conf": "kbse", "year": "2018", "pages": 12}