{"title": "On the parameterized complexity of approximating dominating set.", "fields": ["combinatorics", "hardness of approximation", "dominating set", "exponential time hypothesis", "computable function", "discrete mathematics", "mathematics", "parameterized complexity"], "abstract": "We study the parameterized complexity of approximating the  k -Dominating Set (domset) problem where an integer  k  and a graph  G  on  n  vertices are given as input, and the goal is to find a dominating set of size at most  F ( k ) ·  k  whenever the graph  G  has a dominating set of size  k . When such an algorithm runs in time  T ( k )poly( n ) (i.e., FPT-time) for some computable function  T , it is said to be an  F ( k )-FPT-approximation algorithm for  k -domset. Whether such an algorithm exists is listed in the seminal book of Downey and Fellows (2013) as one of the ”most infamous” open problems in Parameterized Complexity. This work gives an almost complete answer to this question by showing the non-existence of such an algorithm under W[1]≠FPT and further providing tighter running time lower bounds under stronger hypotheses. Specifically, we prove the following for every computable functions  T ,  F  and every constant e > 0:    (i) Assuming W[1]≠FPT, there is no  F ( k )-FPT-approximation algorithm for  k -domset, (ii) Assuming the Exponential Time Hypothesis (ETH), there is no  F ( k )-approximation algorithm for  k -domset that runs in  T ( k ) n   o ( k )  time, (iii) Assuming the Strong Exponential Time Hypothesis (SETH), for every integer  k  ≥ 2, there is no  F ( k )-approximation algorithm for  k -domset that runs in  T ( k ) n   k  − e  time, (iv) Assuming the  k -sum Hypothesis, for every integer  k  ≥ 3, there is no  F ( k )-approximation algorithm for  k -domset that runs in  T ( k )  n  ⌈  k /2 ⌉ − e  time.    Previously, only constant ratio FPT-approximation algorithms were ruled out under W[1]≠FPT and (log 1/4 − e   k )-FPT-approximation algorithms were ruled out under ETH [Chen and Lin, FOCS 2016]. Recently, the non-existence of an  F ( k )-FPT-approximation algorithm for any function  F  was shown under gapETH [Chalermsook et al., FOCS 2017]. Note that, to the best of our knowledge, no running time lower bound of the form  n  δ  k   for any absolute constant δ > 0 was known before even for any constant factor inapproximation ratio.    Our results are obtained by establishing a connection between communication complexity and hardness of approximation, generalizing the ideas from a recent breakthrough work of Abboud et al. [FOCS 2017]. Specifically, we show that to prove hardness of approximation of a certain parameterized variant of the label cover problem, it suffices to devise a specific protocol for a communication problem that depends on which hypothesis we rely on. Each of these communication problems turns out to be either a well studied problem or a variant of one; this allows us to easily apply known techniques to solve them.", "citation": "Citations (4)", "year": "2018", "departments": ["Weizmann Institute of Science", "Shanghai University of Finance and Economics", "University of California, Berkeley"], "conf": "stoc", "authors": ["Karthik C. S......http://dblp.org/pers/hd/s/S=:Karthik_C=", "Bundit Laekhanukit.....http://dblp.org/pers/hd/l/Laekhanukit:Bundit", "Pasin Manurangsi.....http://dblp.org/pers/hd/m/Manurangsi:Pasin"], "pages": 14}