{"title": "A Brand-level Ranking System with the Customized Attention-GRU Model.", "fields": ["feature engineering", "ranking", "exploit", "data mining", "machine learning"], "abstract": "In e-commerce websites like Taobao, brand is playing a more important role in influencing users' decision of click/purchase, partly because users are now attaching more importance to the quality of products and brand is an indicator of quality. However, existing ranking systems are not specifically designed to satisfy this kind of demand. Some design tricks may partially alleviate this problem, but still cannot provide satisfactory results or may create additional interaction cost. In this paper, we design the first brand-level ranking system to address this problem. The key challenge of this system is how to sufficiently exploit users' rich behavior in e-commerce websites to rank the brands. In our solution, we firstly conduct the feature engineering specifically tailored for the personalized brand ranking problem and then rank the brands by an adapted Attention-GRU model containing three important modifications. Note that our proposed modifications can also apply to many other machine learning models on various tasks. We conduct a series of experiments to evaluate the effectiveness of our proposed ranking model and test the response to the brand-level ranking system from real users on a large-scale e-commerce platform, i.e. Taobao.", "citation": "Not cited", "departments": ["Zhejiang University", "Alibaba Group", "Alibaba Group", "Alibaba Group", "Zhejiang University"], "authors": ["Yu Zhu.....http://dblp.org/pers/hd/z/Zhu:Yu", "Junxiong Zhu.....http://dblp.org/pers/hd/z/Zhu:Junxiong", "Jie Hou.....http://dblp.org/pers/hd/h/Hou:Jie", "Yongliang Li.....http://dblp.org/pers/hd/l/Li:Yongliang", "Beidou Wang.....http://dblp.org/pers/hd/w/Wang:Beidou", "Ziyu Guan.....http://dblp.org/pers/hd/g/Guan:Ziyu", "Deng Cai.....http://dblp.org/pers/hd/c/Cai:Deng"], "conf": "ijcai", "year": "2018", "pages": 7}