{"title": "On the Distortion of Voting With Multiple Representative Candidates.", "fields": ["bullet voting", "approval voting", "preferential block voting", "anti plurality voting", "positional voting system"], "abstract": "We study positional voting rules when candidates and voters are embedded in a common metric space, and cardinal preferences are naturally given by distances in the metric space. In a positional voting rule, each candidate receives a score from each ballot based on the ballot's rank order; the candidate with the highest total score wins the election. The cost of a candidate is his sum of distances to all voters, and the distortion of an election is the ratio between the cost of the elected candidate and the cost of the optimum candidate. We consider the case when candidates are representative of the population, in the sense that they are drawn i.i.d. from the population of the voters, and analyze the expected distortion of positional voting rules. \nOur main result is a clean and tight characterization of positional voting rules that have constant expected distortion (independent of the number of candidates and the metric space). Our characterization result immediately implies constant expected distortion for Borda Count and elections in which each voter approves a constant fraction of all candidates. On the other hand, we obtain super-constant expected distortion for Plurality, Veto, and approving a constant number of candidates. These results contrast with previous results on voting with metric preferences: When the candidates are chosen adversarially, all of the preceding voting rules have distortion linear in the number of candidates or voters. Thus, the model of representative candidates allows us to distinguish voting rules which seem equally bad in the worst case.", "citation": "Not cited", "departments": ["Duke University", "University of Southern California", "University of Southern California"], "authors": ["Yu Cheng.....http://dblp.org/pers/hd/c/Cheng_0002:Yu", "Shaddin Dughmi.....http://dblp.org/pers/hd/d/Dughmi:Shaddin", "David Kempe.....http://dblp.org/pers/hd/k/Kempe_0001:David"], "conf": "aaai", "year": "2018", "pages": 8}