{"title": "Enlightened debugging.", "fields": ["dependence analysis", "oracle", "correctness", "task analysis", "debugging"], "abstract": "Numerous automated techniques have been proposed to reduce the cost of software debugging, a notoriously time-consuming and human-intensive activity. Among these techniques, Statistical Fault Localization (SFL) is particularly popular. One issue with SFL is that it is based on strong, often unrealistic assumptions on how developers behave when debugging. To address this problem, we propose E nlighten , an interactive, feedback-driven fault localization technique. Given a failing test, E nlighten  (1) leverages SFL and dynamic dependence analysis to identify suspicious method invocations and corresponding data values, (2) presents the developer with a query about the most suspicious invocation expressed in terms of inputs and outputs, (3) encodes the developer feedback on the correctness of individual data values as extra program specifications, and (4) repeats these steps until the fault is found. We evaluated E nlighten  in two ways. First, we applied E nlighten  to 1,807 real and seeded faults in 3 open source programs using an automated oracle as a simulated user; for over 96% of these faults, E nlighten  required less than 10 interactions with the simulated user to localize the fault, and a sensitivity analysis showed that the results were robust to erroneous responses. Second, we performed an actual user study on 4 faults with 24 participants and found that participants who used E nlighten  performed significantly better than those not using our tool, in terms of both number of faults localized and time needed to localize the faults.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Federal Univesi ... ife, PE, Brazil"], "authors": ["Xiangyu Li.....http://dblp.org/pers/hd/l/Li:Xiangyu", "Shaowei Zhu.....http://dblp.org/pers/hd/z/Zhu:Shaowei", "Marcelo d'Amorim.....http://dblp.org/pers/hd/d/d=Amorim:Marcelo", "Alessandro Orso.....http://dblp.org/pers/hd/o/Orso:Alessandro"], "conf": "icse", "year": "2018", "pages": 11}