{"title": "TIMES: Temporal Information Maximally Extracted from Structures.", "fields": ["probabilistic logic", "preferential attachment", "linear extension", "dynamic network analysis", "ranging"], "abstract": "Inferring the node arrival sequence from a snapshot of a dynamic network is an important problem, with applications ranging from identifying sources of contagion to flow of capital in financial transaction networks. Variants of this problem have received significant recent research attention, including results on infeasibility of solution for prior formulations. We present a new formulation of the problem that admits probabilistic solutions for broad classes of dynamic network models. Instantiating our framework for a preferential attachment model, we present effectively computable and practically tight bounds on the tradeoff curve between optimal achievable precision and density/recall. We also present efficient algorithms for partial recovery of node arrival orders and derive theoretical and empirical performance bounds on the precision and density/recall of our methods in comparison to the best possible. We validate our methods through experiments on both synthetic and real networks to show that their performance is robust to model changes, and that they yield excellent results in practice. We also demonstrate their utility in the context of a novel application in analysis of the human brain connectome to draw new insights into the functional and structural organization and evolution of the human brain.", "citation": "Not cited", "departments": ["University of Illinois at Urbana–Champaign", "Purdue University", "Purdue University", "Purdue University"], "authors": ["Abram N. Magner.....http://dblp.org/pers/hd/m/Magner:Abram_N=", "Jithin K. Sreedharan.....http://dblp.org/pers/hd/s/Sreedharan:Jithin_K=", "Ananth Y. Grama.....http://dblp.org/pers/hd/g/Grama:Ananth_Y=", "Wojciech Szpankowski.....http://dblp.org/pers/hd/s/Szpankowski:Wojciech"], "conf": "www", "year": "2018", "pages": 10}