{"title": "USAR: An Interactive User-specific Aesthetic Ranking Framework for Images.", "fields": ["ranking", "machine learning", "artificial intelligence", "artificial neural network", "subjectivity"], "abstract": "When assessing whether an image of high or low quality, it is indispensable to take personal preference into account. Existing aesthetic model lays emphasis on setting hand-crafted feature or deep feature commonly shared by high quality images with limited consideration for personal preference and interaction missing. To that end, we propose a novel and user-friendly aesthetic ranking framework via powerful deep neural network and small amount of interaction to automatically estimate and rank the aesthetic characteristics of images in accordance with users' preference. Our proposed framework takes as input a series of photos that users prefer, and produces as output a reliable, user-specific aesthetic ranking model matching with users' preference. Considering the subjectivity of personal preference and the uncertainty of user's choice one time, an unique and exclusive dataset will be constructed interactively to describe the preference of diverse individuals by retrieving the most visually-similar images with regard to those specified by users. Based on this unique user-specific dataset and sufficient well-designed aesthetic attributes, a customized aesthetic distribution model can be learned, which concatenates both personalized preference and photography rules. We conduct extensive experiments and user studies on two large-scale public datasets, and demonstrate that our framework outperforms those work based on conventional aesthetic assessment or ranking model.", "citation": "Not cited", "departments": ["Zhengzhou University", "Zhengzhou University", "Zhengzhou University", "Zhengzhou University", "Zhengzhou University"], "authors": ["Pei Lv.....http://dblp.org/pers/hd/l/Lv:Pei", "Meng Wang.....http://dblp.org/pers/hd/w/Wang:Meng", "Yongbo Xu.....http://dblp.org/pers/hd/x/Xu:Yongbo", "Ze Peng.....http://dblp.org/pers/hd/p/Peng:Ze", "Junyi Sun.....http://dblp.org/pers/hd/s/Sun:Junyi", "Shi-Mei Su.....http://dblp.org/pers/hd/s/Su:Shi=Mei", "Bing Zhou.....http://dblp.org/pers/hd/z/Zhou:Bing", "Mingliang Xu.....http://dblp.org/pers/hd/x/Xu:Mingliang"], "conf": "mm", "year": "2018", "pages": 9}