{"title": "Stable and Consistent Membership at Scale with Rapid.", "fields": ["firewall", "reachability", "complex network", "packet loss", "strong consistency"], "abstract": "We present the design and evaluation of Rapid, a distributed membership service. At Rapid's core is a scheme for multi-process cut detection (CD) that revolves around two key insights: (i) it suspects a failure of a process only after alerts arrive from multiple sources, and (ii) when a group of processes experience problems, it detects failures of the entire group, rather than conclude about each process individually. Implementing these insights translates into a simple membership algorithm with low communication overhead. \nWe present evidence that our strategy suffices to drive unanimous detection almost-everywhere, even when complex network conditions arise, such as one-way reachability problems, firewall misconfigurations, and high packet loss. Furthermore, we present both empirical evidence and analyses that proves that the almost-everywhere detection happens with high probability. To complete the design, Rapid contains a leaderless consensus protocol that converts multi-process cut detections into a view-change decision. The resulting membership service works both in fully decentralized as well as logically centralized modes. \nWe present an evaluation of Rapid in moderately scalable cloud settings. Rapid bootstraps 2000 node clusters 2-5.8x faster than prevailing tools such as Memberlist and ZooKeeper, remains stable in face of complex failure scenarios, and provides strong consistency guarantees. It is easy to integrate Rapid into existing distributed applications, of which we demonstrate two.", "citation": "Not cited", "departments": ["VMware", "Hebrew University of Jerusalem", "Princeton University"], "authors": ["Lalith Suresh.....http://dblp.org/pers/hd/s/Suresh:Lalith", "Dahlia Malkhi.....http://dblp.org/pers/hd/m/Malkhi:Dahlia", "Parikshit Gopalan.....http://dblp.org/pers/hd/g/Gopalan:Parikshit", "Ivan Porto Carreiro.....http://dblp.org/pers/hd/c/Carreiro:Ivan_Porto", "Zeeshan Lokhandwala.....http://dblp.org/pers/hd/l/Lokhandwala:Zeeshan"], "conf": "usenix", "year": "2018", "pages": 14}