{"title": "An Iterative Refinement Approach for Social Media Headline Prediction.", "fields": ["headline", "iterative refinement", "popularity", "random forest", "extreme value theory"], "abstract": "In this study, we propose a novel iterative refinement approach to predict the popularity score of the social media meta-data effectively. With the rapid growth of the social media on the Internet, how to adequately forecast the view count or popularity becomes more important. Conventionally, the ensemble approach such as random forest regression achieves high and stable performance on various prediction tasks. However, most of the regression methods may not precisely predict the extreme high or low values. To address this issue, we first predict the initial popularity score and retrieve their residues. In order to correctly compensate those extreme values, we adopt an ensemble regressor to compensate the residues to further improve the prediction performance. Comprehensive experiments are conducted to demonstrate the proposed iterative refinement approach outperforms the state-of-the-art regression approach.", "citation": "Not cited", "year": "2018", "departments": ["National Pingtung University of Science and Technology", "National United University", "National United University", "National Pingtung University of Science and Technology", "National Pingtung University of Science and Technology"], "conf": "mm", "authors": ["Chih-Chung Hsu.....http://dblp.org/pers/hd/h/Hsu:Chih=Chung", "Chia-Yen Lee.....http://dblp.org/pers/hd/l/Lee:Chia=Yen", "Ting-Xuan Liao.....http://dblp.org/pers/hd/l/Liao:Ting=Xuan", "Jun-Yi Lee.....http://dblp.org/pers/hd/l/Lee:Jun=Yi", "Tsai-Yne Hou.....http://dblp.org/pers/hd/h/Hou:Tsai=Yne", "Ying-Chu Kuo.....http://dblp.org/pers/hd/k/Kuo:Ying=Chu", "Jing-Wen Lin.....http://dblp.org/pers/hd/l/Lin:Jing=Wen", "Ching-Yi Hsueh.....http://dblp.org/pers/hd/h/Hsueh:Ching=Yi", "Zhong-Xuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhong=Xuan", "Hsiang-Chin Chien.....http://dblp.org/pers/hd/c/Chien:Hsiang=Chin"], "pages": 5}