{"title": "Panning for gold.com: Understanding the Dynamics of Domain Dropcatching.", "fields": ["panning", "web content", "network security", "ranging", "expiration"], "abstract": "An event that is rarely considered by technical users and laymen alike is that of a domain name expiration. The massive growth in the registration of domain names is followed by daily, equally massive, expirations where domains are allowed to expire and are made again available for registration. While the vast majority of expiring domains are of no value, among the hundreds of thousands of daily expirations, there exist domains that are clearly valuable, either because of their lexical composition, or because of their residual trust. In this paper, we investigate the dynamics of domain dropcatching where companies, on behalf of users, compete to register the most desirable domains as soon as they are made available and then auction them off to the highest bidder. Using a data-driven approach, we monitor the expiration of 28 million domains over the period of ten months, collecting domain features, WHOIS records, and crawling the registered domains on a regular basis to uncover the purpose for which they were re-registered. Among others, we find that, on average only 10% of the expired (dropped) domains are re-registered (caught) with the vast majority of the reregistrations happening on the day of their expiration. We investigate the reasons that make some domains more likely to be registered than others and discover that a domain that was malicious at the time of its expiration is twice as likely to be registered than the average domain. Moreover, previously-malicious domains are significantly more likely to be reused for malicious purposes than previously benign domains. We identify three types of users who are interested in purchasing dropped domains, ranging from freelancers that purchase one or two domains to professionals who invested more than $660K purchasing expired domains in only three months. Finally, content-wise, we observe that less than 11\\% were used to host web content with the remaining content used either for speculatory/malicious purposes.", "citation": "Not cited", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Najmeh Miramirkhani.....http://dblp.org/pers/hd/m/Miramirkhani:Najmeh", "Timothy Barron.....http://dblp.org/pers/hd/b/Barron:Timothy", "Michael Ferdman.....http://dblp.org/pers/hd/f/Ferdman:Michael", "Nick Nikiforakis.....http://dblp.org/pers/hd/n/Nikiforakis:Nick"], "conf": "www", "year": "2018", "pages": 10}