{"title": "Polymorphic radios: a new design paradigm for ultra-low power communication.", "fields": ["wearable computer", "protocol stack", "overhead", "extremely high frequency", "cloud computing"], "abstract": "Duty-cycling has emerged as the predominant method for optimizing power consumption of low-power radios, particularly for sensors that transmit sporadically in small bursts. But duty-cycling is a poor fit for applications involving high-rate sensor data from wearable sensors such as IMUs, microphones, and imagers that need to stream data to the cloud to execute sophisticated machine learning models.   We argue that there is significant room to optimize low-power radios if we can take advantage of channel dynamics in short-range settings. However, we face challenges in designing radios that are efficient at power levels between  μ Ws and mWs to take advantage of periods of good signal strength and nimble to deal with highly dynamic channels resulting from body movements. To achieve this, we propose radio polymorphism, a radio architecture with tightly integrated passive and active components that allows us to turn high channel dynamics to our advantage. We leverage passive modes in myriad ways within the network stack, from minimizing data transfer and control overheads to improving rate selection and enabling channel-aware opportunistic transmission. We instantiate our design in a full hardware-software prototype, Morpho, and demonstrate up to an order of improvement in efficiency across diverse scenarios and applications.", "citation": "Not cited", "year": "2018", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "conf": "sigcomm", "authors": ["Mohammad Rostami.....http://dblp.org/pers/hd/r/Rostami:Mohammad", "Jeremy Gummeson.....http://dblp.org/pers/hd/g/Gummeson:Jeremy", "Ali Kiaghadi.....http://dblp.org/pers/hd/k/Kiaghadi:Ali", "Deepak Ganesan.....http://dblp.org/pers/hd/g/Ganesan:Deepak"], "pages": 15}