{"title": "Inferring persistent interdomain congestion.", "fields": ["broadband", "latency", "internet topology", "the internet", "interconnection"], "abstract": "There is significant interest in the technical and policy communities regarding the extent, scope, and consumer harm of persistent interdomain congestion. We provide empirical grounding for discussions of interdomain congestion by developing a system and method to measure congestion on thousands of interdomain links without direct access to them. We implement a system based on the Time Series Latency Probes (TSLP) technique that identifies links with evidence of recurring congestion suggestive of an under-provisioned link. We deploy our system at 86 vantage points worldwide and show that congestion inferred using our lightweight TSLP method correlates with other metrics of interconnection performance impairment. We use our method to study interdomain links of eight large U.S. broadband access providers from March 2016 to December 2017, and validate our inferences against ground-truth traffic statistics from two of the providers. For the period of time over which we gathered measurements, we did not find evidence of widespread endemic congestion on interdomain links between access ISPs and directly connected transit and content providers, although some such links exhibited recurring congestion patterns. We describe limitations, open challenges, and a path toward the use of this method for large-scale third-party monitoring of the Internet interconnection ecosystem.", "citation": "Not cited", "year": "2018", "departments": ["University of California, San Diego", "Massachusetts Institute of Technology", "University of California, San Diego", "University of Waikato", "University of California, San Diego"], "conf": "sigcomm", "authors": ["Amogh Dhamdhere.....http://dblp.org/pers/hd/d/Dhamdhere:Amogh", "David D. Clark.....http://dblp.org/pers/hd/c/Clark:David_D=", "Alexander Gamero-Garrido.....http://dblp.org/pers/hd/g/Gamero=Garrido:Alexander", "Matthew J. Luckie.....http://dblp.org/pers/hd/l/Luckie:Matthew_J=", "Ricky K. P. Mok.....http://dblp.org/pers/hd/m/Mok:Ricky_K=_P=", "Gautam Akiwate.....http://dblp.org/pers/hd/a/Akiwate:Gautam", "Kabir Gogia.....http://dblp.org/pers/hd/g/Gogia:Kabir", "Vaibhav Bajpai.....http://dblp.org/pers/hd/b/Bajpai:Vaibhav", "Alex C. Snoeren.....http://dblp.org/pers/hd/s/Snoeren:Alex_C=", "kc claffy.....http://dblp.org/pers/hd/c/claffy:kc"], "pages": 15}