{"title": "Provably Efficient Algorithms for Placement of Service Function Chains with Ordering Constraints.", "fields": ["operator", "virtual network", "software deployment", "network service", "set cover problem"], "abstract": "A Service Function Chain (SFC) is an ordered sequence of network functions, such as load balancing, content filtering, and firewall. With the Network Function Virtualization (NFV) paradigm, network functions can be deployed as pieces of software on generic hardware, leading to a flexibility of network service composition. Along with its benefits, NFV brings several challenges to network operators, such as the placement of virtual network functions. \nIn this paper, we study the problem of how to optimally place the network functions within the network in order to satisfy all the SFC requirements of the flows. Our optimization task is to minimize the total deployment cost.\n\nWe show that the problem can be seen as an instance of the Set Cover Problem, even in the case of ordered sequences of network functions. It allows us to propose two logarithmic factor approximation algorithms which have the best possible asymptotic factor.  \nFurther, we devise an optimal algorithm for tree topologies. Finally, we evaluate the performances of our proposed algorithms through extensive simulations. We demonstrate that near-optimal solutions can be found with our approach.", "citation": "Not cited", "departments": ["French Institute for Research in Computer Science and Automation", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "French Institute for Research in Computer Science and Automation"], "authors": ["Andrea Tomassilli.....http://dblp.org/pers/hd/t/Tomassilli:Andrea", "Frédéric Giroire.....http://dblp.org/pers/hd/g/Giroire:Fr=eacute=d=eacute=ric", "Nicolas Huin.....http://dblp.org/pers/hd/h/Huin:Nicolas", "Stéphane Pérennes.....http://dblp.org/pers/hd/p/P=eacute=rennes:St=eacute=phane"], "conf": "infocom", "year": "2018", "pages": 9}