{"title": "Optimizing Ad Refresh In Mobile App Advertising.", "fields": ["impression", "web banner", "user modeling", "refresh rate", "monetization"], "abstract": "In-app advertising is a complex market worth billions of dollars per year, yet it has been studied significantly less than traditional web display ads. In this paper we investigate an important but often overlooked feature of ads in mobile apps (mostly absent in traditional web ads), that of ad refreshes: A user is shown a stream of banner ads during the app session, in which each ad is displayed in the ad slot for a certain amount of time (known as the refresh rate) before the ad-slot is refreshed to the next ad. Data analysis on our large-scale experiments that vary refresh rates reveals a surprising result, that cannot be explained by existing user click models: The total number of clicks is almost independent of the refresh rate. We propose a new, natural, two-phase click model for this setting that explains this independence, as well as our measurements of the click-through rate as a function of the impression’s time-on-screen and of ad-repeat counts. The new click model leads to a clean formulation of the problem of auctioning the entire user-session: i.e., determining online, both the sequence of winning ads as well as the amount of time to display each one. We complement the theoretical auction design with results from a live-traffic experiment with its implementation. Our experiments and analysis provide the theoretical foundation for Admob’s “”Google-optimized refresh rate”” feature, used by thousands of mobile apps for better monetization of ads shown to millions of users.", "citation": "Not cited", "departments": ["Google", "Google", "Google", "Google", "Google"], "authors": ["Florin Constantin.....http://dblp.org/pers/hd/c/Constantin:Florin", "Christopher Harris.....http://dblp.org/pers/hd/h/Harris:Christopher", "Samuel Ieong.....http://dblp.org/pers/hd/i/Ieong:Samuel", "Aranyak Mehta.....http://dblp.org/pers/hd/m/Mehta:Aranyak", "Xi Tan.....http://dblp.org/pers/hd/t/Tan:Xi"], "conf": "www", "year": "2018", "pages": 10}