{"title": "TruePIE: Discovering Reliable Patterns in Pattern-Based Information Extraction.", "fields": ["machine learning", "information extraction", "correctness", "artificial intelligence", "tuple"], "abstract": "Pattern-based methods have been successful in information extraction and NLP research. Previous approaches learn the quality of a textual pattern as relatedness to a certain task based on statistics of its individual content (e.g., length, frequency) and hundreds of carefully-annotated labels. However, patterns of good content-quality may generate heavily conflicting information due to the big gap between relatedness and correctness. Evaluating the correctness of information is critical in (entity, attribute, value)-tuple extraction. In this work, we propose a novel method, called TruePIE, that finds reliable patterns which can extract not only related but also correct information. TruePIE adopts the self-training framework and repeats the training-predicting-extracting process to gradually discover more and more reliable patterns. To better represent the textual patterns, pattern embeddings are formulated so that patterns with similar semantic meanings are embedded closely to each other. The embeddings jointly consider the local pattern information and the distributional information of the extractions. To conquer the challenge of lacking supervision on patterns' reliability, TruePIE can automatically generate high quality training patterns based on a couple of seed patterns by applying the arity-constraints to distinguish highly reliable patterns (i.e., positive patterns) and highly unreliable patterns (i.e., negative patterns). Experiments on a huge news dataset (over 25GB) demonstrate that the proposed TruePIE significantly outperforms baseline methods on each of the three tasks: reliable tuple extraction, reliable pattern extraction, and negative pattern extraction.", "citation": "Citations (1)", "departments": ["University of Illinois at Urbana–Champaign", "University of Notre Dame", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "United States Army Research Laboratory"], "authors": ["Qi Li.....http://dblp.org/pers/hd/l/Li_0012:Qi", "Meng Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Meng", "Xikun Zhang.....http://dblp.org/pers/hd/z/Zhang:Xikun", "Meng Qu.....http://dblp.org/pers/hd/q/Qu:Meng", "Timothy P. Hanratty.....http://dblp.org/pers/hd/h/Hanratty:Timothy_P=", "Jing Gao.....http://dblp.org/pers/hd/g/Gao:Jing", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "kdd", "year": "2018", "pages": 10}