{"title": "Support Neighbor Loss for Person Re-Identification.", "fields": ["sample", "convergence", "convolutional neural network", "scalability", "machine learning"], "abstract": "Person re-identification (re-ID) has recently been tremendously boosted due to the advancement of deep convolutional neural networks (CNN). The majority of deep re-ID methods focus on designing new CNN architectures, while less attention is paid on investigating the loss functions. Verification loss and identification loss are two types of losses widely used to train various deep re-ID models, both of which however have limitations. Verification loss guides the networks to generate feature embeddings of which the intra-class variance is decreased while the inter-class ones is enlarged. However, training networks with verification loss tends to be of slow convergence and unstable performance when the number of training samples is large. On the other hand, identification loss has good separating and scalable property. But its neglect to explicitly reduce the intra-class variance limits its performance on re-ID, because the same person may have significant appearance disparity across different camera views. To avoid the limitations of the two types of losses, we propose a new loss, called support neighbor (SN) loss. Rather than being derived from data sample pairs or triplets, SN loss is calculated based on the positive and negative support neighbor sets of each anchor sample, which contain more valuable contextual information and neighborhood structure that are beneficial for more stable performance. To ensure scalability and separability, a softmax-like function is formulated to push apart the positive and negative support sets. To reduce intra-class variance, the distance between the anchor's nearest positive neighbor and furthest positive sample is penalized. Integrating SN loss on top of Resnet50, superior re-ID results to the state-of-the-art ones are obtained on several widely used datasets.", "citation": "Not cited", "year": "2018", "departments": ["Northeastern University", "Indiana University – Purdue University Indianapolis", "Northeastern University", "Northeastern University", "Northeastern University"], "conf": "mm", "authors": ["Kai Li.....http://dblp.org/pers/hd/l/Li:Kai", "Zhengming Ding.....http://dblp.org/pers/hd/d/Ding:Zhengming", "Kunpeng Li.....http://dblp.org/pers/hd/l/Li:Kunpeng", "Yulun Zhang.....http://dblp.org/pers/hd/z/Zhang:Yulun", "Yun Fu.....http://dblp.org/pers/hd/f/Fu:Yun"], "pages": 9}