{"title": "Parallel repetition in projection games and a concentration bound.", "fields": ["information set", "bell s theorem", "combinatorics", "hardness of approximation", "discrete mathematics", "existential quantification", "repeated game", "example of a game without a value", "combinatorial game theory", "bondareva shapley theorem", "omega", "quantum pseudo telepathy", "alphabet"], "abstract": "In a two player game, a referee asks two cooperating players (who are not allowed to communicate) questions sampled from some distribution and decides whether they win or not based on some predicate of the questions and their answers. The parallel repetition of the game is the game in which the referee samples n independent pairs of questions and sends corresponding questions to the players simultaneously. The players may now answer each question in a way that depends on the other questions they are asked.   If the players cannot win the original game with probability better than (1-e), what's the best they can do in the repeated game? We improve earlier results of Raz and Holenstein, which showed that the players cannot win all copies in the repeated game with probability better than (1-e 3 ) Ω(n/c)  (here c is the length of the answers in the game), in the following ways: We prove the bound (1-e 2 ) Ω (n) as long as the game is a \"projection game\", the type of game most commonly used in hardness of approximation results. Our bound is independent of the answer length and has a better dependence on e. By the recent work of Raz, this bound is essentially tight. A consequence of this bound is to the Unique Games Conjecture of Khot. Many tight or almost tight hardness of approximation results have been proved using the Unique Games Conjecture, so it would be very interesting to prove this conjecture. We make progress towards this goal by showing that it suffices to prove the following easier statement: {Unique Games Conjecture} For every δ,e> 0, there exists an alphabet size M(e) such that it is NP-hard to distinguish a Unique Game with alphabet size M for which a 1-e 2  fraction of the constraints can be satisfied from one in which a 1-e 1-δ  fraction of the constraints can be satisfied. We also prove a concentration bound for parallel repetition (of general games) showing that for any constant 0 4  n/c)). An application of this is in testing Bell Inequalities. Our result implies that the parallel repetition of the CHSH game can be used to get an experiment that has a very large classical versus quantum gap.", "citation": "Citations (97)", "year": "2008", "departments": ["Institute for Advanced Study", "anuprao@cs.washington.edu", "Institute for Advanced Study"], "conf": "stoc", "authors": ["Anup Rao.....http://dblp.org/pers/hd/r/Rao:Anup"], "pages": 10}