{"title": "Joint Scheduling and Congestion Control in Mobile Ad-Hoc Networks.", "fields": ["mobile ad hoc network", "network congestion", "wireless application protocol", "network utility", "greedy algorithm"], "abstract": "In this paper we study the problem of jointly performing scheduling and congestion control in mobile ad-hoc networks so that network queues remain bounded and the resulting flow rates satisfy an associated network utility maximization problem. In recent years a number of papers have presented theoretical solutions to this problem that are based on combining differential-backlog scheduling algorithms with utility-based congestion control. However, this work typically does not address a number of issues such as how signaling should be performed and how the new algorithms interact with other wireless protocols. In this paper we address such issues. In particular: ldr We define a specific network utility maximization problem that we believe is appropriate for mobile adhoc networks. ldr We describe a wireless greedy primal dual (wGPD) algorithm for combined congestion control and scheduling that aims to solve this problem. ldr We show how the wGPD algorithm and its associated signaling can be implemented in practice with minimal disruption to existing wireless protocols. ldr We show via OPNET simulation that wGPD significantly outperforms standard protocols such as 802.11 operating in conjunction with TCP. This work was supported by the DARPA CBMANET program.", "citation": "Citations (183)", "departments": ["Rutgers University", "Alcatel-Lucent", "Alcatel-Lucent", "Alcatel-Lucent", "Alcatel-Lucent"], "authors": ["Umut Akyol.....http://dblp.org/pers/hd/a/Akyol:Umut", "Matthew Andrews.....http://dblp.org/pers/hd/a/Andrews:Matthew", "Piyush Gupta.....http://dblp.org/pers/hd/g/Gupta:Piyush", "John D. Hobby.....http://dblp.org/pers/hd/h/Hobby:John_D=", "Iraj Saniee.....http://dblp.org/pers/hd/s/Saniee:Iraj", "Alexander L. Stolyar.....http://dblp.org/pers/hd/s/Stolyar:Alexander_L="], "conf": "infocom", "year": "2008", "pages": 9}