{"title": "Detection of Algebraic Manipulation with Applications to Robust Secret Sharing and Fuzzy Extractors.", "fields": ["random oracle", "verifiable secret sharing", "algebraic number", "message authentication code", "secret sharing", "homomorphic secret sharing", "computer science", "adversary", "fuzzy logic", "theoretical computer science"], "abstract": "Consider an abstract storage device Σ(G) that can hold a single element x from a fixed, publicly known finite group G. Storage is private in the sense that an adversary does not have read access to Σ(G) at all. However, Σ(G) is non-robust in the sense that the adversary can modify its contents by adding some offset Δ ∈ G. Due to the privacy of the storage device, the value Δ can only depend on an adversary's a priori knowledge of x. We introduce a new primitive called an algebraic manipulation detection (AMD) code, which encodes a source s into a value x stored on Σ(G) so that any tampering by an adversary will be detected. We give a nearly optimal construction of AMD codes, which can flexibly accommodate arbitrary choices for the length of the source s and security level. We use this construction in two applications: - We show how to efficiently convert any linear secret sharing scheme into a robust secret sharing scheme, which ensures that no unqualified subset of players can modify their shares and cause the reconstruction of some value s′ ≠ s. - We show how to build nearly optimal robust fuzzy extractors for several natural metrics. Robust fuzzy extractors enable one to reliably extract and later recover random keys from noisy and non-uniform secrets, such as biometrics, by relying only on non-robust public storage. In the past, such constructions were known only in the random oracle model, or required the entropy rate of the secret to be greater than half. Our construction relies on a randomly chosen common reference string (CRS) available to all parties.", "citation": "Not cited", "year": "2008", "departments": ["Leiden University", "New York University", "Polytechnic University of Catalonia", "New York University", "CWI, Amsterdam, ... he Netherlands"], "conf": "eurocrypt", "authors": ["Ronald Cramer.....http://dblp.org/pers/hd/c/Cramer:Ronald", "Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Serge Fehr.....http://dblp.org/pers/hd/f/Fehr:Serge", "Carles Padró.....http://dblp.org/pers/hd/p/Padr=oacute=:Carles", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "pages": 18}