{"title": "Building Community Wikipedias: A Machine-Human Partnership Approach.", "fields": ["web community", "general partnership", "electronic publishing", "information privacy", "multitude"], "abstract": "The rapid growth of Web communities has motivated many solutions for building community data portals. These solutions follow roughly two approaches. The first approach (e.g., Libra, Citeseer, Cimple) employs semi-automatic methods to extract and integrate data from a multitude of data sources. The second approach (e.g., Wikipedia, Intellipedia) deploys an initial portal in wiki format, then invites community members to revise and add material. In this paper we consider combining the above two approaches to building community portals. The new hybrid machine-human approach brings significant benefits. It can achieve broader and deeper coverage, provide more incentives for users to contribute, and keep the portal more up-to-date with less user effort. In a sense, it enables building \"community wikipedias\", backed by an underlying structured database that is continuously updated using automatic techniques. We outline our ideas for the new approach, describe its challenges and opportunities, and provide initial solutions. Finally, we describe a real-world implementation and preliminary experiments that demonstrate the utility of the new approach.", "citation": "Citations (22)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Pedro DeRose.....http://dblp.org/pers/hd/d/DeRose:Pedro", "Xiaoyong Chai.....http://dblp.org/pers/hd/c/Chai:Xiaoyong", "Byron J. Gao.....http://dblp.org/pers/hd/g/Gao:Byron_J=", "Warren Shen.....http://dblp.org/pers/hd/s/Shen:Warren", "AnHai Doan.....http://dblp.org/pers/hd/d/Doan:AnHai", "Philip Bohannon.....http://dblp.org/pers/hd/b/Bohannon:Philip", "Xiaojin Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Xiaojin"], "conf": "icde", "year": "2008", "pages": 10}