{"title": "On large-scale peer-to-peer streaming systems with network coding.", "fields": ["peer to peer", "server", "linear network coding", "upload", "design elements and principles"], "abstract": "Live peer-to-peer (P2P) streaming has recently received much research attention, with successful commercial systems showing its viability in the Internet. Nevertheless, existing analytical studies of P2P streaming systems have failed to mathematically investigate and understand their critical properties, especially with a large scale and under extreme dynamics such as a flash crowd scenario. Even more importantly, there exists no prior analytical work that focuses on an entirely new way of designing streaming protocols, with the help of network coding. In this paper, we seek to show an in-depth analytical understanding of fundamental properties of P2P streaming systems, with a particular spotlight on the benefits of network coding. We show that, if network coding is used according to certain design principles, provably good performance can be guaranteed, with respect to high playback qualities, short initial buffering delays, resilience to peer dynamics, as well as minimal bandwidth costs on dedicated streaming servers. Our results are obtained with mathematical rigor, but without sacrificing realistic assumptions of system scale, peer dynamics, and upload capacities. For further insights, streaming systems using network coding are compared with traditional pull-based streaming in large-scale simulations, with a focus on fundamentals, rather than protocol details. The scale of our simulations throughout this paper exceeds 200,000 peers at times, which is in sharp contrast with existing empirical studies, typically with a few hundred peers involved.", "citation": "Citations (102)", "departments": ["University of Toronto", "University of Toronto"], "authors": ["Chen Feng.....http://dblp.org/pers/hd/f/Feng:Chen", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun"], "conf": "mm", "year": "2008", "pages": 10}