{"title": "Index Policies for Real-Time Multicast Scheduling for Wireless Broadcast Systems.", "fields": ["network packet", "multicast", "wireless access point", "source specific multicast", "binary erasure channel"], "abstract": "Motivated by the increasing usage of wireless broadcast networks for multicast real-time applications like video, this paper considers a canonical real-time multicast scheduling problem for a wireless broadcast LAN. A wireless access point (AP) has N latency-sensitive flows, each associated with a deadline and a multicast group of receivers that desire to receive all the packets successfully by their corresponding deadlines. We consider periodic and one-shot models of real-time arrivals. The channel from the AP to each receiver is a wireless erasure channel, independent across users and slots. We wish to find a communication strategy that minimizes the total deadlines missed across all receivers, where a receiver counts a miss if it does not receive a packet by its deadline. We cast this problem as a restless bandit in stochastic control. We use Whittle's relaxation framework for restless bandits to establish Whittle-indexability for multicast realtime scheduling under the assumption of complete feedback from all receivers in every slot. For the Whittle relaxation, we show that for each flow, the AP's decision between transmitting in a slot and idling has a threshold structure. For the homogeneous case where the erasure channel to each receiver is identically distributed with parameter p, the Whittle index of a flow is x i (1 - p) , where x i  is the number of receivers who have yet to receive the current packet of flow i. For the general heterogeneous case in which the erasure channel to receiver j has loss probability p j , the Whittle index corresponding to each flow is Sigma j  (1- p j ), where the sum is over all multicast receivers who are yet to receive the packet. We bound the performance of the optimal Whittle relaxation with respect to the optimal wireless multicast real-time scheduler. The heuristic index policy that schedules the flow with the maximum Whittle index in each slot is simple. To relax the complete feedback assumption, we design a scalable mechanism based on statistical estimation theory that obtains the required feedback from all the receivers using a single ACK per packet transmission. The resultant policy is amenable to low-complexity implementation.", "citation": "Citations (59)", "departments": ["University of Illinois at Urbana–Champaign", "Tata Institute of Fundamental Research", "University of Illinois at Urbana–Champaign"], "authors": ["Vivek Raghunathan.....http://dblp.org/pers/hd/r/Raghunathan:Vivek", "Vivek S. Borkar.....http://dblp.org/pers/hd/b/Borkar:Vivek_S=", "Min Cao.....http://dblp.org/pers/hd/c/Cao:Min", "P. R. Kumar.....http://dblp.org/pers/hd/k/Kumar:P=_R="], "conf": "infocom", "year": "2008", "pages": 9}