{"title": "On the Capacity of Multi-Channel Wireless Networks Using Directional Antennas.", "fields": ["mobile ad hoc network", "omnidirectional antenna", "network architecture", "directional antenna", "hidden node problem"], "abstract": "The capacity of wireless ad hoc networks is affected by two key factors: the interference among concurrent transmissions and the number of simultaneous transmissions on a single interface. Recent studies found that using multiple channels can separate concurrent transmissions and greatly improve network throughput. However, those studies only consider that wireless nodes are equipped with only omnidirectional antennas, which cause high collisions. On the other hand, some researchers found that directional antennas bring more benefits such as reduced interference and increased spatial reuse compared with omnidirectional antennas. But, they only focused on a single-channel network which only allows finite concurrent transmissions. Thus, combining the two technologies of multiple channels and directional antennas together potentially brings more benefits. In this paper, we propose a multi-channel network architecture (called MC-MDA) that equips each wireless node with multiple directional antennas. We derive the capacity bounds of MC-MDA networks under arbitrary and random placements. We will show that deploying directional antennas to multi-channel networks can greatly improve the network capacity due to increased network connectivity and reduced interference. We have also found that even a multi-channel network with a single directional antenna only at each node can give a significant improvement on the throughput capacity. Besides, using multiple channels mitigates interference caused by directional antennas. MC-MDA networks integrate benefits from multi-channel and directional antennas and thus have significant performance improvement.", "citation": "Citations (106)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Shanghai Jiao Tong University"], "authors": ["Hongning Dai.....http://dblp.org/pers/hd/d/Dai:Hongning", "Kam-Wing Ng.....http://dblp.org/pers/hd/n/Ng:Kam=Wing", "Raymond Chi-Wing Wong.....http://dblp.org/pers/hd/w/Wong:Raymond_Chi=Wing", "Min-You Wu.....http://dblp.org/pers/hd/w/Wu:Min=You"], "conf": "infocom", "year": "2008", "pages": 9}