{"title": "Rate allocation for transform domain Wyner-Ziv video coding without feedback.", "fields": ["harmonic vector excitation coding", "shannon fano coding", "context adaptive binary arithmetic coding", "coding tree unit", "distributed source coding"], "abstract": "In this paper, we propose a new rate allocation algorithm for transform domain Wyner-Ziv video coding (WZVC) without feedback. In contrast to conventional video coding, Wyner-Ziv video coding aims to design simple intra-frame encoding and complex inter-frame decoding based on the Slepian-Wolf and Wyner-Ziv distributed source coding theorems. To allocate proper number of bits to each frame, most existing Wyner-Ziv video coding solutions need a feedback channel (FC) at the decoder. However, in many video coding applications, the FC is not allowed. Moreover, the FC will introduce latency and an increase of decoder complexity because several iterative decoding operations may be needed to decode the data to achieve target video quality. The proposed algorithm predicts the number of bits for each Wyner-Ziv frame at the encoder as a function of the coding mode and the quantization parameters. Such predictions will not significantly increase the complexity at the encoder. However, the prediction will be able to properly select the best mode and quantization parameter for encoding each Wyner-Ziv frame. Experimental results show that the proposed algorithms is able to achieve good encoder rate allocation while still maintains consistent coding efficiency. Comparing to the WZVC coder with FC, this new WZVC coder without FC induces only a small loss in Rate-Distortion performance.", "citation": "Citations (19)", "departments": ["Huazhong University of Science and Technology", "Qualcomm", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "State University of New York System"], "authors": ["Tao Sheng.....http://dblp.org/pers/hd/s/Sheng:Tao", "Guogang Hua.....http://dblp.org/pers/hd/h/Hua:Guogang", "Hongxing Guo.....http://dblp.org/pers/hd/g/Guo:Hongxing", "Jingli Zhou.....http://dblp.org/pers/hd/z/Zhou:Jingli", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "conf": "mm", "year": "2008", "pages": 4}