{"title": "Cross-Layer Rate Control in Wireless Networks with Lossy Links: Leaky-Pipe Flow, Effective Network Utility Maximization and Hop-by-Hop Algorithms.", "fields": ["lossy compression", "multipath propagation", "cross layer optimization", "network utility", "hop", "fading", "code rate"], "abstract": "We take a cross-layer design approach to study rate control in multihop wireless networks. Due to the lossy nature of wireless links, the data rate of a given flow becomes smaller and smaller along its routing path. As a result, the data rate received successfully at the destination node (the effective rate) is typically lower than the transmission rate at the source node (the injection rate). In light of this observation, we treat each flow as a \"leaky-pipe\" flow and introduce the notion of \"effective utility\" associated with the effective rate (not the injection rate) of each flow. We then explore rate control through effective network utility maximization (ENUM) in this study. Two network models are studied in this paper: (1) ENUM with link outage constraints with a maximum error rate at each link; (2) ENUM with path outage constraints where there exists an end-to-end outage requirement for each flow. For both models, we explicitly take into account the \"thinning\" feature of data flows and devise distributed hop-by-hop rate control algorithms accordingly. Our numerical examples corroborate that higher effective network utility and better fairness can be achieved by the ENUM algorithms than the standard NUM.", "citation": "Citations (32)", "year": "2008", "departments": ["Arizona State University", "University of Melbourne", "Arizona State University", "Arizona State University", "University of Melbourne", "Atheros Commun. ...  Clara, CA, USA"], "conf": "infocom", "authors": ["Qinghai Gao.....http://dblp.org/pers/hd/g/Gao:Qinghai", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan", "Stephen V. Hanly.....http://dblp.org/pers/hd/h/Hanly:Stephen_V="], "pages": 9}