{"title": "On Reducing Mesh Delay for Peer-to-Peer Live Streaming.", "fields": ["peer to peer", "network delay", "processing delay", "elmore delay", "scalability"], "abstract": "Peer-to-peer (P2P) technology has emerged as a promising scalable solution for live streaming to large group. In this paper, we address the design of overlay which achieves low source-to-peer delay, is robust to user churn, accommodates of asymmetric and diverse uplink bandwidth, and continuously improves based on existing user pool. A natural choice is the use of mesh, where each peer is served by multiple parents. Since the peer delay in a mesh depends on its longest path through its parents, we study how to optimize such delay while meeting a certain streaming rate requirement. We first formulate the minimum delay mesh problem and show that it is NP-hard. Then we propose a centralized heuristic based on complete knowledge which serves as our benchmark and optimal solution for all the other schemes under comparison. Our heuristic makes use of the concept of power in network given by the ratio of throughput and delay. By maximizing the network power, our heuristic achieves very low delay. We then propose a simple distributed algorithm where peers select their parents based on the power concept. The algorithm makes continuous improvement on delay until some minimum delay is reached. Simulation results show that our distributed protocol performs close to the centralized one, and substantially outperforms traditional and state-of-the-art approaches.", "citation": "Citations (110)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Dongni Ren.....http://dblp.org/pers/hd/r/Ren:Dongni", "Yui Tung Hillman Li.....http://dblp.org/pers/hd/l/Li:Yui_Tung_Hillman", "Shueng-Han Gary Chan.....http://dblp.org/pers/hd/c/Chan:Shueng=Han_Gary"], "conf": "infocom", "year": "2008", "pages": 9}