{"title": "Read-once polynomial identity testing.", "fields": ["partial derivative", "deterministic algorithm", "randomized algorithm", "combinatorics", "polynomial identity testing", "mathematics", "discrete mathematics", "bounded function", "binary logarithm", "pi", "univariate", "multilinear map"], "abstract": "In this paper we study the problems of polynomial identity testing (PIT) and reconstruction of read-once formulas. The following are some deterministic algorithms that we obtain. An n O(k 2 )  algorithm for checking whether given k ROFs sum to zero or not. An n O(d+k 2 )  time algorithm for checking whether a black box holding the sum of k depth d ROFs computes the zero polynomial. In other words, we provide a hitting set of size n O(d+k 2 )  for the sum of k depth d ROFs. This implies an n O(d)  deterministic algorithm for the reconstruction of depth d ROFs. A hitting set of size exp(~O(√n+k 2 )) for the sum of k ROFs (without depth restrictions). This implies a sub-exponential time deterministic algorithm for black-box identity testing and reconstructing of ROFs. To the best of our knowledge our results give the first polynomial time (non black-box) and sub-exponential time (black-box) identity testing algorithms for the sum of (a constant number of) ROFs. In addition, we introduce and study the  read-once testing problem  (ROT for short): Given an arithmetic circuit computing a polynomial P(x), decide whether there is a ROF computing P(x). If there is such a formula then output it. Otherwise output \"No\". We show that most previous algorithms for polynomial identity testing can be strengthen to yield algorithms for the ROT problem. In particular we give ROT algorithms for: Depth-2 circuits (circuits computing sparse polynomials), Depth-3 circuits with bounded top fan-in (both in the black-box and non black-box settings, where the running time depends on the model), non-commutative formulas and sum of k ROFs. The running time of the ROT algorithm is essentially the same running time as the corresponding PIT algorithm for the class. The main tool in most of our results is a new connection between polynomial identity testing and reconstruction of read-once formulas. Namely, we show that in any model that is closed under partial derivatives (that is, a partial derivative of a polynomial computed by a circuit in the model, can also be computed by a circuit in the model) and that has an efficient deterministic polynomial identity testing algorithm, we can also answer the read-once testing problem.", "citation": "Citations (68)", "year": "2008", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Tel Aviv University", "Technion – Israel Institute of Technology"], "conf": "stoc", "authors": ["Amir Shpilka.....http://dblp.org/pers/hd/s/Shpilka:Amir", "Ilya Volkovich.....http://dblp.org/pers/hd/v/Volkovich:Ilya"], "pages": 10}