{"title": "POIROT - Integrated Learning of Web Service Procedures.", "fields": ["small set", "workflow", "multiple criteria decision analysis", "generalization", "database transaction"], "abstract": "POIROT is an integration framework for combining machine learning mechanisms to learn hierarchical models of web services procedures from a single or very small set of demonstration examples. The system is organized around a shared representation language for communications with a central hypothesis blackboard. Component learning systems share semantic representations of their hypotheses (generalizations) and inferences about demonstration traces. To further the process, components may generate learning goals for other learning components. POIROT's learners or hypothesis formers develop workflows that include order dependencies, subgoals, and decision criteria for selecting or prioritizing subtasks and service parameters. Hypothesis evaluators, guided by POIROT's meta-control component, plan experiments to confirm or disconfirm hypotheses extracted from these learning products. Collectively, they create methods that POIROT can use to reproduce the demonstration and solve similar problems. After its first phase of development, POIROT has demonstrated it can learn some moderately complex hierarchical task models from semantic traces of user-generated service transaction sequences at a level that is approaching human performance on the same learning task.", "citation": "Citations (19)", "departments": ["BBN Technologies", "BBN Technologies", "BBN Technologies", "BBN Technologies", "BBN Technologies"], "authors": ["Mark H. Burstein.....http://dblp.org/pers/hd/b/Burstein:Mark_H=", "Robert Laddaga.....http://dblp.org/pers/hd/l/Laddaga:Robert", "David D. McDonald.....http://dblp.org/pers/hd/m/McDonald:David_D=", "Michael T. Cox.....http://dblp.org/pers/hd/c/Cox:Michael_T=", "Brett Benyo.....http://dblp.org/pers/hd/b/Benyo:Brett", "Paul Robertson.....http://dblp.org/pers/hd/r/Robertson:Paul", "Talib S. Hussain.....http://dblp.org/pers/hd/h/Hussain:Talib_S=", "Marshall Brinn.....http://dblp.org/pers/hd/b/Brinn:Marshall", "Drew V. McDermott.....http://dblp.org/pers/hd/m/McDermott:Drew_V="], "conf": "aaai", "year": "2008", "pages": 6}