{"title": "Integration of Server, Storage and Database Stack: Moving Processing Towards Data.", "fields": ["power5", "workload", "file server", "gigabyte", "converged storage"], "abstract": "Storage architecture includes more and more processing power for increasing requirement of reliability, managibility and scalability. For example, an IBM storage server is equipped with 4 or 8 state-of-the-art processors and gigabytes of memories. This trend enables analyzing data locally inside a storage server. Processing data locally is appealing under the following circumstances: (1) huge reduction of data flowing to the host, (2) reduction of CPU consumption on host. Accordingly, the benefits are (1) less data traffic through IO channel to the host, (2) better utilization of host bufferpool, and (3) enabling more workload on the host. One crucial task is to understand how DBMS can benefit from such hardware. That is to identify which database operations are beneficial to be offloaded given a query workload in a particular setting. For certain operations, we establish value proposition via various approaches and show the analytical and experimental results. In particular, starjoin queries are commonly used in business warehouses. We propose to offload a portion of a starjoin query from host to the POWER5 P processors on a storage server, which dramatically reduces the amount of channel IO and host CPU consumption. Moreover, the query elapsed time is improved via the exploitation of the state-of-the-art P processors on a storage server.", "citation": "Citations (3)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Lin Qiao.....http://dblp.org/pers/hd/q/Qiao:Lin", "Vijayshankar Raman.....http://dblp.org/pers/hd/r/Raman:Vijayshankar", "Inderpal Narang.....http://dblp.org/pers/hd/n/Narang:Inderpal", "Prashant Pandey.....http://dblp.org/pers/hd/p/Pandey:Prashant", "David D. Chambliss.....http://dblp.org/pers/hd/c/Chambliss:David_D=", "Gene Fuh.....http://dblp.org/pers/hd/f/Fuh:Gene", "James A. Ruddy.....http://dblp.org/pers/hd/r/Ruddy:James_A=", "Ying-Lin Chen.....http://dblp.org/pers/hd/c/Chen:Ying=Lin", "Kou-Horng Yang.....http://dblp.org/pers/hd/y/Yang:Kou=Horng", "Fen-Ling Ling.....http://dblp.org/pers/hd/l/Ling:Fen=Ling"], "conf": "icde", "year": "2008", "pages": 9}