{"title": "A New Channel Assignment Mechanism for Rural Wireless Mesh Networks.", "fields": ["edge coloring", "wireless mesh network", "fractional coloring", "vertex", "channel allocation schemes"], "abstract": "In this paper we present a new channel allocation scheme for IEEE 802.11 based mesh networks with point-to- point links, designed for rural areas. Our channel allocation scheme allows continuous full-duplex data transfer on every link in the network. Moreover, we do not require any synchronization across the links as the channel assignment prevents cross link interference. Our approach is simple. We consider any link in the network as made up of two directed edges. To each directed edge at a node, we assign a non-interfering IEEE 802.11 channel so that the set of channels assigned to the outgoing edges is disjoint from channels assigned to the incoming edges. Evaluation of this scheme in a testbed demonstrate throughput gains of between 50 - 100%, and significantly less end-to-end delays, over existing link scheduling/channel allocation protocols (such as 2P [11]) designed for point-to-point mesh networks. Formally speaking, this channel allocation scheme is equivalent to an edge-coloring problem, that we call the directed edge coloring (DEC) problem. We establish a relationship between this coloring problem and the classical vertex coloring problem, and thus, show that this problem is NP-hard. More precisely, we give an algorithm that, given k vertex coloring of a graph can directed edge color it using xi(k) colors, where xi(k) is the smallest integer n such that (lfloorn/2rfloor/n ) ges k.", "citation": "Citations (56)", "departments": ["IBM", "Bell Labs", "Bell Labs"], "authors": ["Partha Dutta.....http://dblp.org/pers/hd/d/Dutta:Partha", "Sharad Jaiswal.....http://dblp.org/pers/hd/j/Jaiswal:Sharad", "Debmalya Panigrahi.....http://dblp.org/pers/hd/p/Panigrahi:Debmalya", "Rajeev Rastogi.....http://dblp.org/pers/hd/r/Rastogi:Rajeev"], "conf": "infocom", "year": "2008", "pages": 9}