{"title": "A Counterexample to Strong Parallel Repetition.", "fields": ["counterexample", "conjecture", "m 2", "maximum cut", "physical constant", "combinatorics", "discrete mathematics", "mathematics", "pi", "omega"], "abstract": "The parallel repetition theorem states that for any two-prover game, with value 1 - isin (for, say, isin les 1/2), the value of the game repeated in parallel n times is at most (1 - isin c ) Omega(n/s) , where s is the answers' length (of the original game) and c is a universal constant. Several researchers asked wether this bound could be improved to (1 - isin) Omega(n/s) ; this question is usually referred to as the strong parallel repetition problem. We show that the answer for this question is negative. More precisely, we consider the odd cycle game of size m; a two-prover game with value 1 - 1/2 m. We show that the value of the odd cycle game repeated in parallel n times is at least 1 - (1/m) ldr O(radicn). This implies that for large enough n (say, n ges Omega(m 2 )), the value of the odd cycle game repeated in parallel n times is at least (1 - 1/4 m 2 ) O(n) . Thus: 1. For parallel repetition of general games: the bounds of (1 - isin c ) Omega(n/s)  given in are of the right form, up to determining the exact value of the constant c ges 2. 2. For parallel repetition of XOR games, unique games and projection games: the bounds of (1 - isin 2 ) Omega(n)  given in (for XOR games) and in (for unique and projection games) are tight. 3. For parallel repetition of the odd cycle game: the bound of 1 - (1/m) ldr Omegatilde(radicn) given in is almost tight. A major motivation for the recent interest in the strong parallel repetition problem is that a strong parallel repetition theorem would have implied that the unique game conjecture is equivalent to the NP hardness of distinguishing between instances of Max-Cut that are at least 1 - isin 2  satisfiable from instances that are at most 1 - (2/pi) ldr isin satisfiable. Our results suggest that this cannot be proved just by improving the known bounds on parallel repetition.", "citation": "Citations (69)", "departments": ["Weizmann Institute of Science", "Weizmann Institute of Science"], "authors": ["Ran Raz.....http://dblp.org/pers/hd/r/Raz:Ran"], "conf": "focs", "year": "2008", "pages": 5}