{"title": "Cell Selection in 4G Cellular Networks.", "fields": ["frequency division multiple access", "mobile station", "timing advance", "wimax", "cellular network", "approximation algorithm"], "abstract": "Cell selection is the process of determining the cells that provide service to each mobile station. Optimizing these processes is an important step towards maximizing the utilization of current and future cellular networks. In this paper we study the potential benefit of global cell selection versus the current local mobile SNR-based decision protocol. In particular, we study the new possibility that is feasible in OFDMA-based systems, of satisfying the minimal demand of a mobile station simultaneously by more than one base station. We formalize the problem as an optimization problem, called the all-or-nothing demand maximization problem, and show that when the demand of a single mobile station can exceed the capacity of a base station, this problem is not only NP-hard but also cannot be approximated within any reasonable factor. In contrast, under the very practical assumption that the maximum required bandwidth of a single mobile station is at most an r-fraction of the capacity of a base station, we present two different algorithms for cell selection. The first algorithm guarantees a satisfaction of at least a 1- r r fraction of an optimal assignment, where a mobile station can be covered simultaneously by more than one base station. The second algorithm guarantees a satisfaction of at least a 1-r/1-r fraction of an optimal assignment, while every mobile station is covered by at most one base station. Using an extensive simulation study we show that the cell selections determined by our algorithms achieve a better utilization of high-loaded capacity-constrained future 4G networks than the current SNR- based scheme. Specifically, our algorithms are shown to obtain up to 20% better usage of the network's capacity, in comparison with the current cell selection algorithms.", "citation": "Citations (65)", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Tel Aviv University", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Ben-Gurion University of the Negev", "British Telecom ... plc, Chelmsford", "Amdocs Ltd., Ra ... at Efal, Israel"], "authors": ["David Amzallag.....http://dblp.org/pers/hd/a/Amzallag:David", "Reuven Bar-Yehuda.....http://dblp.org/pers/hd/b/Bar=Yehuda:Reuven", "Danny Raz.....http://dblp.org/pers/hd/r/Raz:Danny", "Gabriel Scalosub.....http://dblp.org/pers/hd/s/Scalosub:Gabriel"], "conf": "infocom", "year": "2008", "pages": 9}