{"title": "A general framework for investigating how far the decoding process in the brain can be simplified.", "fields": ["principle of maximum entropy", "probabilistic logic", "decoding methods", "artificial intelligence", "machine learning"], "abstract": "\"How is information decoded in the brain?\" is one of the most difficult and important questions in neuroscience. Whether neural correlation is important or not in decoding neural activities is of special interest. We have developed a general framework for investigating how far the decoding process in the brain can be simplified. First, we hierarchically construct simplified probabilistic models of neural responses that ignore more than Kth-order correlations by using a maximum entropy principle. Then, we compute how much information is lost when information is decoded using the simplified models, i.e., \"mismatched decoders\". We introduce an information theoretically correct quantity for evaluating the information obtained by mismatched decoders. We applied our proposed framework to spike data for vertebrate retina. We used 100-ms natural movies as stimuli and computed the information contained in neural activities about these movies. We found that the information loss is negligibly small in population activities of ganglion cells even if all orders of correlation are ignored in decoding. We also found that if we assume stationarity for long durations in the information analysis of dynamically changing stimuli like natural movies, pseudo correlations seem to carry a large portion of the information.", "citation": "Citations (6)", "year": "2008", "departments": ["University of Tokyo", "RIKEN Brain Science Institute", "University of Tokyo", "RIKEN Brain Science Institute", "RIKEN Brain Science Institute"], "conf": "nips", "authors": ["Masafumi Oizumi.....http://dblp.org/pers/hd/o/Oizumi:Masafumi", "Toshiyuki Ishii.....http://dblp.org/pers/hd/i/Ishii:Toshiyuki", "Kazuya Ishibashi.....http://dblp.org/pers/hd/i/Ishibashi:Kazuya", "Toshihiko Hosoya.....http://dblp.org/pers/hd/h/Hosoya:Toshihiko", "Masato Okada.....http://dblp.org/pers/hd/o/Okada:Masato"], "pages": 8}