{"title": "Dynamic Bandwidth Request-Allocation Algorithm for Real-Time Services in IEEE 802.16 Broadband Wireless Access Networks.", "fields": ["broadband networks", "bandwidth allocation", "wireless broadband", "dynamic bandwidth allocation", "channel allocation schemes"], "abstract": "The emerging broadband wireless access (BWA) technology based on IEEE 802.16 is one of the most promising solutions to provide ubiquitous wireless access to the broadband service at low cost. This paper proposes an efficient uplink bandwidth request-allocation algorithm for variable-rate realtime services in IEEE 802.16 BWA networks. In order to minimize bandwidth wastage without degrading quality of service (QoS), we introduce a notion of target delay and propose dual feedback architecture. The proposed algorithm calculates the amount of bandwidth request such that the delay is regulated around the desired level to minimize delay violation and delay jitter for real-time services. Also, it can maximize utilization of wireless channel by making use of dual feedback, where the bandwidth request is adjusted based on the information about the backlogged amount of traffic in the queue and the rate mismatch between packet arrival and service rates. Due to the dual feedback architecture, the proposed scheme responds quickly to the variation of traffic load and is robust to the change of network condition. We analyze the stability of the proposed algorithm from a control-theoretic viewpoint and derive a simple design guideline based on the analysis. By implementing the algorithm in OPNET simulator, we evaluate its performance in terms of queue regulation, optimal bandwidth allocation, delay controllability, and robustness to traffic characteristics.", "citation": "Citations (26)", "departments": ["Samsung", "Samsung", "Samsung", "School of Elect ... cal Engineering"], "authors": ["Eun-Chan Park.....http://dblp.org/pers/hd/p/Park:Eun=Chan", "Hwangnam Kim.....http://dblp.org/pers/hd/k/Kim:Hwangnam", "Jae-Young Kim.....http://dblp.org/pers/hd/k/Kim:Jae=Young", "Han Seok Kim.....http://dblp.org/pers/hd/k/Kim:Han_Seok"], "conf": "infocom", "year": "2008", "pages": 9}