{"title": "Query-aware partitioning for monitoring massive network data streams.", "fields": ["network packet", "query optimization", "data stream mining", "data stream", "data stream management system", "distributed database"], "abstract": "Data Stream Management Systems (DSMS) are gaining acceptance for applications that need to process very large volumes of data in real time. The load generated by such applications frequently exceeds by far the computation capabilities of a single centralized server. In particular, a single-server instance of our DSMS, Gigascope, cannot keep up with the processing demands of the new OC-786 networks, which can generate more than 100 million packets per second. In this paper, we explore a mechanism for the distributed processing of very high speed data streams.   Existing distributed DSMSs employ two mechanisms for distributing the load across the participating machines: partitioning of the query execution plans and partitioning of the input data stream in a query-independent fashion. However, for a large class of queries, both approaches fail to reduce the load as compared to centralized system, and can even lead to an increase in the load. In this paper we present an alternative approach - query-aware data stream partitioning that allows for more efficient scaling. We present methods for analyzing any given query set and choose the optimal partitioning scheme, and show how to reconcile potentially conflicting requirements that different queries might place on partitioning. We conclude with experiments on a small cluster of processing nodes on high-rate network traffic feed that demonstrates with different query sets that our methods effectively distribute the load across all processing nodes and facilitate efficient scaling whenever more processing nodes becomes available.", "citation": "Citations (27)", "year": "2008", "departments": ["AT&T Labs", "Rutgers University", "AT&T Labs", "AT&T Labs", "AT&T Labs", "Rutgers University", "AT&T", "AT&T"], "conf": "sigmod", "authors": ["Theodore Johnson.....http://dblp.org/pers/hd/j/Johnson:Theodore", "S. Muthu Muthukrishnan.....http://dblp.org/pers/hd/m/Muthukrishnan:S=_Muthu", "Vladislav Shkapenyuk.....http://dblp.org/pers/hd/s/Shkapenyuk:Vladislav", "Oliver Spatscheck.....http://dblp.org/pers/hd/s/Spatscheck:Oliver"], "pages": 12}