{"title": "Latent social structure in open source projects.", "fields": ["software development", "organizational structure", "commercial software", "software project management", "phenomenon"], "abstract": "Commercial software project managers design project organizational structure carefully, mindful of available skills, division of labour, geographical boundaries, etc. These organizational \"cathedrals\" are to be contrasted with the \"bazaar-like\" nature of Open Source Software (OSS) Projects, which have no pre-designed organizational structure. Any structure that exists is dynamic, self-organizing, latent, and usually not explicitly stated. Still, in large, complex, successful, OSS projects, we do expect that subcommunities will form spontaneously within the developer teams. Studying these subcommunities, and their behavior can shed light on how successful OSS projects self-organize. This phenomenon could well hold important lessons for how commercial software teams might be organized. Building on known well-established techniques for detecting  community structure  in complex networks, we extract and study latent subcommunities from the email social network of several projects: Apache HTTPD, Python, PostgresSQL, Perl, and Apache ANT. We then validate them with software development activity history. Our results show that subcommunities do indeed spontaneously arise within these projects as the projects evolve. These subcommunities manifest most strongly in technical discussions, and are significantly connected with collaboration behaviour.", "citation": "Citations (287)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["Christian Bird.....http://dblp.org/pers/hd/b/Bird:Christian", "David S. Pattison.....http://dblp.org/pers/hd/p/Pattison:David_S=", "Raissa M. D'Souza.....http://dblp.org/pers/hd/d/D=Souza:Raissa_M=", "Vladimir Filkov.....http://dblp.org/pers/hd/f/Filkov:Vladimir", "Premkumar T. Devanbu.....http://dblp.org/pers/hd/d/Devanbu:Premkumar_T="], "conf": "sigsoft", "year": "2008", "pages": 12}