{"title": "XML Index Recommendation with Tight Optimizer Coupling.", "fields": ["database index", "xml validation", "workload", "xml database", "query optimization"], "abstract": "XML database systems are expected to handle increasingly complex queries over increasingly large and highly structured XML databases. An important problem that needs to be solved for these systems is how to choose the best set of indexes for a given workload. In this paper, we present an XML Index Advisor that solves this XML index recommendation problem and has the key characteristic of being tightly coupled with the query optimizer. We rely on the optimizer to enumerate index candidates and to estimate the benefit gained from potential index configurations. We expand the set of candidate indexes obtained from the query optimizer to include more general indexes that can be useful for queries other than those in the training workload. To recommend an index configuration, we introduce two new search algorithms. The first algorithm finds the best set of indexes for the specific training workload, and the second algorithm finds a general set of indexes that can benefit the training workload as well as other similar workloads. We have implemented our XML Index Advisor in a prototype version of IBM reg  DB2 reg  9, which supports both relational and XML data, and we experimentally demonstrate the effectiveness of our advisor using this implementation.", "citation": "Citations (5)", "departments": ["University of Waterloo", "University of Waterloo", "IBM", "University of Toronto", "IBM"], "authors": ["Iman Elghandour.....http://dblp.org/pers/hd/e/Elghandour:Iman", "Ashraf Aboulnaga.....http://dblp.org/pers/hd/a/Aboulnaga:Ashraf", "Daniel C. Zilio.....http://dblp.org/pers/hd/z/Zilio:Daniel_C=", "Fei Chiang.....http://dblp.org/pers/hd/c/Chiang:Fei", "Andrey Balmin.....http://dblp.org/pers/hd/b/Balmin:Andrey", "Kevin S. Beyer.....http://dblp.org/pers/hd/b/Beyer:Kevin_S=", "Calisto Zuzarte.....http://dblp.org/pers/hd/z/Zuzarte:Calisto"], "conf": "icde", "year": "2008", "pages": 10}