{"title": "Distribution-based similarity measures for multi-dimensional point set retrieval applications.", "fields": ["nonparametric statistics", "ranking", "gesture recognition", "pairwise comparison", "nearest neighbor search"], "abstract": "Effective and efficient method of similarity assessment continues to be one of the most fundamental problems in multimedia data analysis. In case of retrieving relevant items from a collection of objects based on series of multivariate observations (e.g., searching the similar video clips in a repository to a query example), satisfactory performance cannot be expected using many conventional similarity measures based on the aggregation of element pairwise comparisons. Some correlation information among the individual elements has also been investigated to characterize each set of multi-dimensional points for ranked retrieval, by making use of an unwarranted assumption that the underlying data distribution has a particular parametric form. Motivated by this observation, this paper introduces a novel collective gauge of relevance ranking by evaluating the probabilities that point sets are consistent with the same distribution of the query. Two non-parametric hypothesis tests in statistics are justified to exploit the distributional discrepancy of samples for assessing the similarity between two ensembles of points. While our methodology is mainly presented in the context of video similarity search, it enjoys great flexibility and can be easily adapted to other applications involving generic multi-dimensional point set representation for each object such as human gesture recognition.", "citation": "Citations (7)", "departments": ["University of Queensland", "University of Queensland", "University of Queensland", "Singapore Management University", "University of Queensland"], "authors": ["Jie Shao.....http://dblp.org/pers/hd/s/Shao:Jie", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Jialie Shen.....http://dblp.org/pers/hd/s/Shen:Jialie", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "mm", "year": "2008", "pages": 10}