{"title": "Hardness-randomness tradeoffs for bounded depth arithmetic circuits.", "fields": ["randomness", "deterministic algorithm", "arbitrary precision arithmetic", "nexptime", "polynomial identity testing", "existential quantification", "arithmetic circuit complexity", "saturation arithmetic", "bounded function", "factorization of polynomials"], "abstract": "In this paper we show that lower bounds for bounded depth arithmetic circuits imply derandomization of polynomial identity testing for bounded depth arithmetic circuits. More formally, if there exists an explicit polynomial $f$ that cannot be computed by a depth $d$ arithmetic circuit of small size, then there exists an efficient deterministic black-box algorithm to test whether a given depth $d-5$ circuit that computes a polynomial of relatively small individual degrees is identically zero or not. In particular, if we are guaranteed that the tested circuit computes a multilinear polynomial, then we can perform the identity test efficiently. To the best of our knowledge this is the first hardness-randomness tradeoff for bounded depth arithmetic circuits. The above results are obtained using the arithmetic Nisan-Wigderson generator of Kabanets and Impagliazzo together with a new theorem on bounded depth circuits, which is the main technical contribution of our work. This theorem deals with polynomial equations of the form $P(x_1,\\dots,x_n,y)\\equiv0$ and shows that if $P$ has a circuit of depth $d$ and size $s$ and if the polynomial $f(x_1,\\dots,x_n)$ satisfies $P(x_1,\\dots,x_n,f)\\equiv0$, then $f$ has a circuit of depth $d+3$ and size $\\mathrm{poly}(s,m^r)$, where $m$ is the total degree of $f$ and $r$ is the degree of $y$ in $P$. This circuit for $f$ can be found probabilistically in time $\\mathrm{poly}(s,m^r)$. In the other direction we observe that the methods of Kabanets and Impagliazzo can be used to show that derandomizing identity testing for bounded depth circuits implies lower bounds for the same class of circuits. More formally, if we can derandomize polynomial identity testing for bounded depth circuits, then NEXP does not have bounded depth arithmetic circuits. That is, either $\\mathrm{NEXP}\\not\\subseteq P/\\mathrm{poly}$ or the Permanent is not computable by polynomial size bounded depth arithmetic circuits.", "citation": "Not cited", "year": "2008", "departments": ["Weizmann Institute of Science", "Technion – Israel Institute of Technology", "Weizmann Institute of Science", "Technion – Israel Institute of Technology", "Weizmann Institute of Science"], "conf": "stoc", "authors": ["Zeev Dvir.....http://dblp.org/pers/hd/d/Dvir:Zeev", "Amir Shpilka.....http://dblp.org/pers/hd/s/Shpilka:Amir", "Amir Yehudayoff.....http://dblp.org/pers/hd/y/Yehudayoff:Amir"], "pages": 8}