{"title": "A distributed processor state management architecture for large-window processors.", "fields": ["microarchitecture", "register allocation", "processor register", "instruction level parallelism", "register renaming"], "abstract": "Processor architectures with large instruction windows have been proposed to expose more instruction-level parallelism (ILP) and increase performance. Some of the proposed architectures replace a re-order buffer (ROB) with a check-pointing mechanism and an out-of-order release of processor resources. Check-pointing, however, leads to an imprecise processor state recovery on mis-predicted branches and exceptions and re-execution of correct-path instructions after state recovery. It also requires large register files complicating renaming, allocation and release of physical registers. This paper proposes a new processor architecture called a Multi-State Processor (MSP). The MSP does not use check-pointing, avoids the above-mentioned problems, and has a fast, distributed state recovery mechanism. The MSP uses a novel register management architecture allowing implementation of large register files with simpler and more scalable register allocation, renaming, and release. It is also key to precise processor state recovery mechanism. The MSP is shown to improve IPC by 14%, on average, for integer SPEC CPU2000 benchmarks compared to a check-pointing based mechanism ([2]) when a fast and simple branch predictor is used. With a very aggressive branch predictor the IPC improvement is 1%, on average, and 3% if some of the programs are optimized for the MSP. The MSP also reduces the average number of executed instructions by 16.5% (12% for the aggressive branch predictor), mostly due to precise state recovery. This improves the MSP processor energy efficiency even though it uses a larger register file.", "citation": "Citations (6)", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "University of California, Irvine", "Center for Comp ... co City, México", "Department of C ... arcelona, Spain"], "authors": ["Isidro Gonzalez.....http://dblp.org/pers/hd/g/Gonzalez:Isidro", "Marco Galluzzi.....http://dblp.org/pers/hd/g/Galluzzi:Marco", "Alexander V. Veidenbaum.....http://dblp.org/pers/hd/v/Veidenbaum:Alexander_V=", "Marco A. Ramírez.....http://dblp.org/pers/hd/r/Ram=iacute=rez:Marco_A=", "Adrián Cristal.....http://dblp.org/pers/hd/c/Cristal:Adri=aacute=n", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "conf": "micro", "year": "2008", "pages": 12}