{"title": "On fast and accurate detection of unauthorized wireless access points using clock skews.", "fields": ["digital clock manager", "timestamp", "clock skew", "wi fi", "ieee 802 11", "clock synchronization", "ip address spoofing"], "abstract": "We explore the use of clock skew of a wireless local area network access point (AP) as its fingerprint to detect unauthorized APs quickly and accurately. The main goal behind using clock skews is to overcome one of the major limitations of existing solutions - the inability to effectively detect Medium Access Control (MAC) address spoofing. We calculate the clock skew of an AP from the IEEE 802.11 Time Synchronization Function (TSF) timestamps sent out in the beacon/probe response frames. We use two different methods for this purpose - one based on linear programming and the other based on least square fit. We supplement these methods with a heuristic for differentiating original packets from those sent by the fake APs. We collect TSF timestamp data from several APs in two different residential settings. Using our measurement data as well as data obtained from a large conference setting, we find that clock skews remain consistent over time for the same AP but vary significantly across APs. Furthermore, we improve the resolution of received timestamp of the frames and show that with this enhancement our methodology can find clock skews very quickly, using 50-100 packets in most of the cases. We also discuss and quantify the impact of various external factors including temperature variation, virtualization, and NTP synchronization on clock skews. Our results indicate that the use of clock skews appears to be an efficient and robust method for detecting fake APs in wireless local area networks.", "citation": "Citations (214)", "departments": ["University of Utah", "University of Utah", "University of Utah", "University of Utah"], "authors": ["Suman Jana.....http://dblp.org/pers/hd/j/Jana:Suman", "Sneha Kumar Kasera.....http://dblp.org/pers/hd/k/Kasera:Sneha_Kumar"], "conf": "mobicom", "year": "2008", "pages": 12}