{"title": "Shedding light on the glue logic of the internet routing architecture.", "fields": ["glue", "static routing", "glue logic", "link state routing protocol", "ip forwarding"], "abstract": "Recent studies reveal that the routing structures of operational networks are much more complex than a simple BGP/IGP hierarchy, highlighted by the presence of many distinct instances of routing protocols. However, the glue (how routing protocol instances interact and exchange routes among themselves) is still little understood or studied. For example, although Route Redistribution (RR), the implementation of the glue in router software, has been used in the Internet for more than a decade, it was only recently shown that RR is extremely vulnerable to anomalies similar to the permanent route oscillations in BGP. This paper takes an important step toward understanding how RR is used and how fundamental the role RR plays in practice. We developed a complete model and associated tools for characterizing interconnections between routing instances based on analysis of router configuration data. We analyzed and characterized the RR usage in more than 1600 operational networks. The findings are: (i) RR is indeed widely used; (ii) operators use RR to achieve important design objectives not realizable with existing routing protocols alone; (iii) RR configurations can be very diverse and complex. These empirical discoveries not only confirm that the RR glue constitutes a critical component of the current Internet routing architecture, but also emphasize the urgent need for more research to improve its safety and flexibility to support important design objectives.", "citation": "Citations (64)", "departments": ["Carnegie Mellon University", "Naval Postgraduate School", "AT&T Labs", "AT&T Labs", "Carnegie Mellon University"], "authors": ["Franck Le.....http://dblp.org/pers/hd/l/Le:Franck", "Geoffrey G. Xie.....http://dblp.org/pers/hd/x/Xie:Geoffrey_G=", "Dan Pei.....http://dblp.org/pers/hd/p/Pei:Dan", "Jia Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jia", "Hui Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Hui"], "conf": "sigcomm", "year": "2008", "pages": 12}