{"title": "Semantic texton forests for image categorization and segmentation.", "fields": ["segmentation based object categorization", "contextual image classification", "k means clustering", "scale space segmentation", "visual word"], "abstract": "We propose semantic texton forests, efficient and powerful new low-level features. These are ensembles of decision trees that act directly on image pixels, and therefore do not need the expensive computation of filter-bank responses or local descriptors. They are extremely fast to both train and test, especially compared with k-means clustering and nearest-neighbor assignment of feature descriptors. The nodes in the trees provide (i) an implicit hierarchical clustering into semantic textons, and (ii) an explicit local classification estimate. Our second contribution, the bag of semantic textons, combines a histogram of semantic textons over an image region with a region prior category distribution. The bag of semantic textons is computed over the whole image for categorization, and over local rectangular regions for segmentation. Including both histogram and region prior allows our segmentation algorithm to exploit both textural and semantic context. Our third contribution is an image-level prior for segmentation that emphasizes those categories that the automatic categorization believes to be present. We evaluate on two datasets including the very challenging VOC 2007 segmentation dataset. Our results significantly advance the state-of-the-art in segmentation accuracy, and furthermore, our use of efficient decision forests gives at least a five-fold increase in execution speed.", "citation": "Citations (1,047)", "year": "2008", "departments": ["Toshiba", "University of Cambridge", "University of Cambridge"], "conf": "cvpr", "authors": ["Jamie Shotton.....http://dblp.org/pers/hd/s/Shotton:Jamie", "Matthew Johnson.....http://dblp.org/pers/hd/j/Johnson_0003:Matthew", "Roberto Cipolla.....http://dblp.org/pers/hd/c/Cipolla:Roberto"], "pages": -1}