{"title": "A Unifying Perspective on the Capacity of Wireless Ad Hoc Networks.", "fields": ["unicast", "time complexity", "multicast", "throughput", "mimo"], "abstract": "We present the first unified modeling framework for the computation of the throughput capacity of random wireless ad hoc networks in which information is disseminated by means of unicast routing, multicast routing, broadcasting, or different forms of anycasting. We introduce (n,m, k)-casting as a generalization of all forms of one-to-one, one-to-many and many-to-many information dissemination in wireless networks. In this context, n, m, and k denote the total number of nodes in the network, the number of destinations for each communication group, and the actual number of communication-group members that receive information (i.e., k lesm), respectively. We compute upper and lower bounds for the (n, m, k)- cast throughput capacity in random wireless networks. When m = k = ominus(1), the resulting capacity equals the well-known capacity result for multi-pair unicasting by Gupta and Kumar. We demonstrate that ominus(1/radic(mnlogn)) bits per second constitutes a tight bound for the capacity of multicasting (i.e., m = k < n) when m les ominus (n/(log n)). We show that the multicast capacity of a wireless network equals its capacity for multi-pair unicasting when the number of destinations per multicast source is not a function of n. We also show that the multicast capacity of a random wireless ad hoc network is ominus (1/n), which is the broadcast capacity of the network, when m ges ominus(n/ log n). Furthermore, we show that ominus (radicm/(kradic(n log n))),ominus(1/(k log n)) and ominus(1/n) bits per second constitutes a tight bound for the throughput capacity of multicasting (i.e., k < m < n) when ominus(1) les m les ominus (n/ log n), k les ominus(n / log n) les m les n and ominus (n/ log n) les k les m les n respectively.", "citation": "Citations (109)", "departments": ["University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz"], "authors": ["Zheng Wang.....http://dblp.org/pers/hd/w/Wang_0006:Zheng", "Hamid R. Sadjadpour.....http://dblp.org/pers/hd/s/Sadjadpour:Hamid_R=", "J. J. Garcia-Luna-Aceves.....http://dblp.org/pers/hd/g/Garcia=Luna=Aceves:J=_J="], "conf": "infocom", "year": "2008", "pages": 5}