{"title": "Approximate embedding-based subsequence matching of time series.", "fields": ["longest increasing subsequence", "dynamic time warping", "subsequence", "blossom algorithm", "order of magnitude"], "abstract": "A method for approximate subsequence matching is introduced, that significantly improves the efficiency of subsequence matching in large time series data sets under the dynamic time warping (DTW) distance measure. Our method is called EBSM, shorthand for Embedding-Based Subsequence Matching. The key idea is to convert subsequence matching to vector matching using an embedding. This embedding maps each database time series into a sequence of vectors, so that every step of every time series in the database is mapped to a vector. The embedding is computed by applying full dynamic time warping between reference objects and each database time series. At runtime, given a query object, an embedding of that object is computed in the same manner, by running dynamic time warping between the reference objects and the query. Comparing the embedding of the query with the database vectors is used to efficiently identify relatively few areas of interest in the database sequences. Those areas of interest are then fully explored using the exact DTW-based subsequence matching algorithm. Experiments on a large, public time series data set produce speedups of over one order of magnitude compared to brute-force search, with very small losses (", "citation": "Citations (78)", "year": "2008", "departments": ["University of Texas at Arlington", "Boston University", "Boston University", "Boston University", "National and Kapodistrian University of Athens"], "conf": "sigmod", "authors": ["Vassilis Athitsos.....http://dblp.org/pers/hd/a/Athitsos:Vassilis", "Panagiotis Papapetrou.....http://dblp.org/pers/hd/p/Papapetrou:Panagiotis", "Michalis Potamias.....http://dblp.org/pers/hd/p/Potamias:Michalis", "George Kollios.....http://dblp.org/pers/hd/k/Kollios:George", "Dimitrios Gunopulos.....http://dblp.org/pers/hd/g/Gunopulos:Dimitrios"], "pages": 14}