{"title": "Multi-tenant databases for software as a service: schema-mapping techniques.", "fields": ["software as a service", "multitenancy", "database schema", "physical data model", "physical schema"], "abstract": "In the implementation of hosted business services, multiple tenants are often consolidated into the same database to reduce total cost of ownership. Common practice is to map multiple single-tenant logical schemas in the application to one multi-tenant physical schema in the database. Such mappings are challenging to create because enterprise applications allow tenants to extend the base schema, e.g., for vertical industries or geographic regions. Assuming the workload stays within bounds, the fundamental limitation on scalability for this approach is the number of tables the database can handle. To get good consolidation, certain tables must be shared among tenants and certain tables must be mapped into fixed generic structures such as Universal and Pivot Tables, which can degrade performance.   This paper describes a new schema-mapping technique for multi-tenancy called  Chunk Folding , where the logical tables are vertically partitioned into chunks that are folded together into different physical multi-tenant tables and joined as needed. The database's \"meta-data budget\" is divided between application-specific conventional tables and a large fixed set of generic structures called  Chunk Tables . Good performance is obtained by mapping the most heavily-utilized parts of the logical schemas into the conventional tables and the remaining parts into Chunk Tables that match their structure as closely as possible. We present the re sults of several experiments designed to measure the efficacy of Chunk Folding and describe the multi-tenant database testbed in which these experiments were performed.", "citation": "Citations (349)", "year": "2008", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "Technische Universität München", "SAP AG, Walldorf, Germany"], "conf": "sigmod", "authors": ["Stefan Aulbach.....http://dblp.org/pers/hd/a/Aulbach:Stefan", "Torsten Grust.....http://dblp.org/pers/hd/g/Grust:Torsten", "Dean Jacobs.....http://dblp.org/pers/hd/j/Jacobs:Dean", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons", "Jan Rittinger.....http://dblp.org/pers/hd/r/Rittinger:Jan"], "pages": 12}