{"title": "Mining Gene Expression Database for Primary Human Disease Tissues.", "fields": ["microarray analysis techniques", "biological pathway", "gene expression", "survival rate", "biomarker"], "abstract": "Studies of gene expression in primary human disease tissue often span several years in order to achieve reasonably large sample sizes and to collect patient clinical information making this data particularly valuable. Due to the lack of a central repository, this data has only been available through disparate and non-publicly accessible sources following publication. We developed disease-to-gene expression mapper (D-GEM) as a publically accessible database and data mining toolbox for microarray data of human primary disease tissue. A statistical pipeline has also been implemented to identify genes over-expressed in disease tissue samples in comparison with normal control samples, or genes whose expression values are associated with clinical parameters such as patient survival rate. One potential application of this data is the identification of pathway specific cancer prognosis markers. By applying a novel, gene signatures for cancer prognosis in the context of known biological pathways in cancer development were identified and confirmed.", "citation": "Not cited", "departments": ["Indiana University – Purdue University Indianapolis", "Indiana University – Purdue University Indianapolis", "Indiana University – Purdue University Indianapolis", "Indiana University – Purdue University Indianapolis", "Eli Lilly and Company"], "authors": ["Andrew Campen.....http://dblp.org/pers/hd/c/Campen:Andrew", "Yuni Xia.....http://dblp.org/pers/hd/x/Xia:Yuni", "Dan Rigsby.....http://dblp.org/pers/hd/r/Rigsby:Dan", "Ying Guo.....http://dblp.org/pers/hd/g/Guo:Ying", "Xingdong Feng.....http://dblp.org/pers/hd/f/Feng:Xingdong", "Eric W. Su.....http://dblp.org/pers/hd/s/Su:Eric_W=", "Mathew Palakal.....http://dblp.org/pers/hd/p/Palakal:Mathew", "Shuyu Li.....http://dblp.org/pers/hd/l/Li:Shuyu"], "conf": "icde", "year": "2008", "pages": 4}