{"title": "Efficient Broadcast in MANETs Using Network Coding and Directional Antennas.", "fields": ["packet forwarding", "mobile ad hoc network", "omnidirectional antenna", "linear network coding", "directional antenna"], "abstract": "In this paper, we consider the issue of efficient broadcasting in mobile ad hoc networks (MANETs) using network coding and directional antennas. Network coding-based broadcasting focuses on reducing the number of transmissions each forwarding node performs in the multiple source/multiple message broadcast application, where each forwarding node combines some of the received messages for transmission. With the help of network coding, the total number of transmissions can be reduced compared to broadcasting using the same forwarding nodes without coding. We exploit the usage of directional antennas to network coding-based broadcasting to further reduce energy consumption. A node equipped with directional antennas can divide the omnidirectional transmission range into several sectors and turns some of them on for transmission. In the proposed scheme using a directional antenna, forwarding nodes selected locally only need to transmit broadcast messages, original or coded, to restricted sectors. We also study two extensions. The first extension applies network coding to both dynamic and static forwarding node selection approaches. In the second extension, we design two approaches for the single source/single message issue in the network coding-based broadcast application. Performance analysis via simulations on the proposed algorithms using a custom simulator is presented.", "citation": "Citations (9)", "departments": ["Rensselaer Polytechnic Institute", "Florida Atlantic University", "Florida Atlantic University"], "authors": ["Shuhui Yang.....http://dblp.org/pers/hd/y/Yang:Shuhui", "Jie Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jie", "Mihaela Cardei.....http://dblp.org/pers/hd/c/Cardei:Mihaela"], "conf": "infocom", "year": "2008", "pages": 9}