{"title": "A graph method for keyword-based selection of the top-K databases.", "fields": ["query by example", "probabilistic database", "view", "sargable", "database testing"], "abstract": "While database management systems offer a comprehensive solution to data storage, they require deep knowledge of the schema, as well as the data manipulation language, in order to perform effective retrieval. Since these requirements pose a problem to lay or occasional users, several methods incorporate  keyword search  (KS) into relational databases. However, most of the existing techniques focus on querying a single DBMS. On the other hand, the proliferation of distributed databases in several conventional and emerging applications necessitates the support for keyword-based data sharing and querying over multiple DMBSs. In order to avoid the high cost of searching in numerous, potentially irrelevant, databases in such systems, we propose  G-KS , a novel method for selecting the top- K  candidates based on their potential to contain results for a given query.  G-KS summarizes each database by a  keyword relationship graph , where nodes represent terms and edges describe relationships between them. Keyword relationship graphs are utilized for computing the similarity between each database and a KS query, so that, during query processing, only the most promising databases are searched. An extensive experimental evaluation demonstrates that  G-KS  outperforms the current state-of-the-art technique on all aspects, including precision, recall, efficiency, space overhead and flexibility of accommodating different semantics.", "citation": "Citations (78)", "year": "2008", "departments": ["National University of Singapore", "National University of Singapore", "Hong Kong University of Science and Technology", "National University of Singapore"], "conf": "sigmod", "authors": ["Quang Hieu Vu.....http://dblp.org/pers/hd/v/Vu:Quang_Hieu", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Dimitris Papadias.....http://dblp.org/pers/hd/p/Papadias:Dimitris", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H="], "pages": 12}