{"title": "Parity Lost and Parity Regained.", "fields": ["checksum", "data protection act 1998", "model checking", "data loss", "raid"], "abstract": "RAID storage systems protect data from storage errors, such as data corruption, using a set of one or more integrity techniques, such as checksums. The exact protection offered by certain techniques or a combination of techniques is sometimes unclear. We introduce and apply a formal method of analyzing the design of data protection strategies. Specifically, we use model checking to evaluate whether common protection techniques used in parity-based RAID systems are sufficient in light of the increasingly complex failure modes of modern disk drives. We evaluate the approaches taken by a number of real systems under single-error conditions, and find flaws in every scheme. In particular, we identify a parity pollution problem that spreads corrupt data (the result of a single error) across multiple disks, thus leading to data loss or corruption. We further identify which protection measures must be used to avoid such problems. Finally, we show how to combine real-world failure data with the results from the model checker to estimate the actual likelihood of data loss of different protection strategies.", "citation": "Citations (102)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "Network Appliance, Inc.", "Network Appliance, Inc.", "Network Appliance, Inc."], "authors": ["Andrew Krioukov.....http://dblp.org/pers/hd/k/Krioukov:Andrew", "Lakshmi N. Bairavasundaram.....http://dblp.org/pers/hd/b/Bairavasundaram:Lakshmi_N=", "Garth R. Goodson.....http://dblp.org/pers/hd/g/Goodson:Garth_R=", "Kiran Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Kiran", "Randy Thelen.....http://dblp.org/pers/hd/t/Thelen:Randy", "Andrea C. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Andrea_C=", "Remzi H. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Remzi_H="], "conf": "fast", "year": "2008", "pages": 15}