{"title": "Power reduction of CMP communication networks via RF-interconnects.", "fields": ["latency", "bandwidth allocation", "system on a chip", "multicast", "network on a chip"], "abstract": "As chip multiprocessors scale to a greater number of processing cores, on-chip interconnection networks will experience dramatic increases in both bandwidth demand and power dissipation. Fortunately, promising gains can be realized via integration of radio frequency interconnect (RF-I) through on-chip transmission lines with traditional interconnects implemented with RC wires. While prior work has considered the latency advantage of RF-I, we demonstrate three further advantages of RF-I: (1) RF-I bandwidth can be flexibly allocated to provide an adaptive NoC, (2) RF-I can enable a dramatic power and area reduction by simplification of NoC topology, and (3) RF-I provides natural and efficient support for multicast. In this paper, we propose a novel interconnect design, exploiting dynamic RF-I bandwidth allocation to realize a reconfigurable network-on-chip architecture. We find that our adaptive RF-I architecture on top of a mesh with 4B links can even outperform the baseline with 16B mesh links by about 1%, and reduces NoC power by approximately 65% including the overhead incurred for supporting RF-I.", "citation": "Citations (77)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["M.-C. Frank Chang.....http://dblp.org/pers/hd/c/Chang:M==C=_Frank", "Jason Cong.....http://dblp.org/pers/hd/c/Cong:Jason", "Adam Kaplan.....http://dblp.org/pers/hd/k/Kaplan:Adam", "Chunyue Liu.....http://dblp.org/pers/hd/l/Liu:Chunyue", "Mishali Naik.....http://dblp.org/pers/hd/n/Naik:Mishali", "Jagannath Premkumar.....http://dblp.org/pers/hd/p/Premkumar:Jagannath", "Glenn Reinman.....http://dblp.org/pers/hd/r/Reinman:Glenn", "Eran Socher.....http://dblp.org/pers/hd/s/Socher:Eran", "Sai-Wang Tam.....http://dblp.org/pers/hd/t/Tam:Sai=Wang"], "conf": "micro", "year": "2008", "pages": 12}