{"title": "Validating Multi-column Schema Matchings by Type.", "fields": ["conceptual schema", "star schema", "information schema", "schema matching", "database schema"], "abstract": "Validation of multi-column schema matchings is essential for successful database integration. This task is especially difficult when the databases to be integrated contain little overlapping data, as is often the case in practice (e.g., customer bases of different companies). Based on the intuition that values present in different columns related by a schema matching will have similar \";semantic type\";, and that this can be captured using distributions over values (\";statistical types\";), we develop a method for validating 1-1 and compositional schema matchings. Our technique is based on three key technical ideas. First, we propose a generic measure for comparing two columns matched by a schema matching, based on a notion of information-theoretic discrepancy that generalizes the standard geometric discrepancy; this provides the basis for 1:1 matching. Second, we present an algorithm for \";splitting\"; the string values in a column to identify substrings that are likely to match with the values in another column; this enables (multi-column) l:m schema matching. Third, our technique provides an invalidation certificate if it fails to validate a schema matching. We complement our conceptual and algorithmic contributions with an experimental study that demonstrates the effectiveness and efficiency of our technique on a variety of database schemas and data sets.", "citation": "Citations (23)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Bing Tian Dai.....http://dblp.org/pers/hd/d/Dai:Bing_Tian", "Nick Koudas.....http://dblp.org/pers/hd/k/Koudas:Nick", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H=", "Suresh Venkatasubramanian.....http://dblp.org/pers/hd/v/Venkatasubramanian:Suresh"], "conf": "icde", "year": "2008", "pages": 10}