{"title": "Toward best-effort information extraction.", "fields": ["declarative programming", "rendering", "information extraction", "semantics", "debugging"], "abstract": "Current approaches to develop information extraction (IE) programs have largely focused on producing  precise IE results . As such, they suffer from three major limitations. First, it is often difficult to execute partially specified IE programs and obtain meaningful results, thereby producing a long \"debug loop\". Second, it often takes a long time before we can obtain the first meaningful result (by finishing and running a precise IE program), thereby rendering these approaches impractical for time-sensitive IE applications. Finally, by trying to write precise IE programs we may also waste a significant amount of effort, because an approximate result -- one that can be produced quickly -- may already be satisfactory in many IE settings.   To address these limitations, we propose iFlex, an IE approach that relaxes the precise IE requirement to enable  best-effort IE . In iFlex, a developer  U  uses a declarative language to quickly write an initial  approximate IE program P  with a possible-worlds semantics. Then iFlex evaluates  P  using an  approximate query processor  to quickly extract an approximate result. Next,  U  examines the result, and further refines  P  if necessary, to obtain increasingly more precise results. To refine  P ,  U  can enlist a  next-effort assistant , which suggests refinements based on the data and the current version of  P . Extensive experiments on real-world domains demonstrate the utility of the iFlex approach.", "citation": "Citations (69)", "year": "2008", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "Microsoft", "University of Wisconsin-Madison", "Yahoo!"], "conf": "sigmod", "authors": ["Warren Shen.....http://dblp.org/pers/hd/s/Shen:Warren", "Pedro DeRose.....http://dblp.org/pers/hd/d/DeRose:Pedro", "Robert McCann.....http://dblp.org/pers/hd/m/McCann:Robert", "AnHai Doan.....http://dblp.org/pers/hd/d/Doan:AnHai", "Raghu Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Raghu"], "pages": 12}