{"title": "Finding programming errors earlier by evaluating runtime monitors ahead-of-time.", "fields": ["runtime verification", "alias", "dacapo", "false positive paradox", "static analysis"], "abstract": "Runtime monitoring allows programmers to validate, for instance, the proper use of application interfaces. Given a property specification, a runtime monitor tracks appropriate runtime events to detect violations and possibly execute recovery code. Although powerful, runtime monitoring inspects only one program run at a time and so may require many program runs to find errors. Therefore, in this paper, we present ahead-of-time techniques that can (1) prove the absence of property violations on all program runs, or (2) flag locations where violations are likely to occur. Our work focuses on tracematches, an expressive runtime monitoring notation for reasoning about groups of correlated objects. We describe a novel flow-sensitive static analysis for analyzing monitor states. Our abstraction captures both positive information (a set of objects could be in a particular monitor state) and negative information (the set is known not to be in a state). The analysis resolves heap references by combining the results of three points-to and alias analyses. We also propose a machine learning phase to filter out likely false positives. We applied a set of 13 tracematches to the DaCapo benchmark suite and SciMark2. Our static analysis rules out all potential points of failure in 50% of the cases, and 75% of false positives on average. Our machine learning algorithm correctly classifies the remaining potential points of failure in all but three of 461 cases. The approach revealed defects and suspicious code in three benchmark programs.", "citation": "Citations (92)", "departments": ["McGill University", "University of Waterloo", "McGill University"], "authors": ["Eric Bodden.....http://dblp.org/pers/hd/b/Bodden:Eric", "Patrick Lam.....http://dblp.org/pers/hd/l/Lam_0001:Patrick", "Laurie J. Hendren.....http://dblp.org/pers/hd/h/Hendren:Laurie_J="], "conf": "sigsoft", "year": "2008", "pages": 12}