{"title": "Threshold devices: looking out from the home.", "fields": ["ubiquitous computing", "impression", "multimedia", "human computer interaction", "locality"], "abstract": "Threshold devices present information gathered from the home's surroundings to give new views on the domestic situation. We built two prototypes of different threshold devices and studied them in field trials with participant households. The Local Barometer displays online text and images related to the home's locality depending on the local wind conditions to give an impression of the sociocultural surroundings. The Plane Tracker tracks aircraft passing overhead and imagines their flights onscreen to resource an understanding of the home's global links. Our studies indicated that the experiences they provided were compelling, that participants could and did interpret the devices in various ways, that their form designs were appropriate for domestic environments, that using ready-made information contributed to the richness of the experiences, and that situating the information they provided with respect to the home and its locality was important for the ways people engaged with them.", "citation": "Citations (68)", "year": "2008", "departments": ["Goldsmiths, University of London", "Goldsmiths, University of London", "Goldsmiths, University of London", "Goldsmiths, University of London", "Goldsmiths, University of London"], "conf": "chi", "authors": ["William W. Gaver.....http://dblp.org/pers/hd/g/Gaver:William_W=", "Andy Boucher.....http://dblp.org/pers/hd/b/Boucher:Andy", "Andy Law.....http://dblp.org/pers/hd/l/Law:Andy", "Sarah Pennington.....http://dblp.org/pers/hd/p/Pennington:Sarah", "John Bowers.....http://dblp.org/pers/hd/b/Bowers:John", "Jacob Beaver.....http://dblp.org/pers/hd/b/Beaver:Jacob", "Jan Humble.....http://dblp.org/pers/hd/h/Humble:Jan", "Tobie Kerridge.....http://dblp.org/pers/hd/k/Kerridge:Tobie", "Nicolas Villar.....http://dblp.org/pers/hd/v/Villar:Nicolas", "Alex Wilkie.....http://dblp.org/pers/hd/w/Wilkie:Alex"], "pages": 10}