{"title": "Mixing Time of Exponential Random Graphs.", "fields": ["metropolis hastings algorithm", "exponentially modified gaussian distribution", "markov chain monte carlo", "erdős renyi model", "exponential random graph models", "exponential growth", "conductance", "random geometric graph"], "abstract": "A variety of random graph models have been developed in recent years to study a range of problems on networks, driven by the wide availability of data from many social, telecommunication, biochemical and other networks. A key model, extensively used in the sociology literature, is the exponential random graph model. This model seeks to incorporate in random graphs the notion of reciprocity, that is, the larger than expected number of triangles and other small subgraphs. Sampling from these distributions is crucial for parameter estimation hypothesis testing, and more generally for understanding basic features of the network model itself. In practice sampling is typically carried out using Markov chain Monte Carlo, in particular either the Glauber dynamics or the Metropolis-Hasting procedure.In this paper we characterize the high and low temperature regimes of the exponential random graph model. We establish that in the high temperature regime the mixing time of the Glauber dynamics is Theta(n 2  log n), where n is the number of vertices in the graph; in contrast, we show that in the low temperature regime the mixing is exponentially slow for any local Markov chain. Our results, moreover, give a rigorous basis for criticisms made of such models. In the high temperature regime, where sampling with MCMC is possible, we show that any finite collection of edges are asymptotically independent; thus, the model does not possess the desired reciprocity property, and is not appreciably different from the Erdos-Renyi random graph.", "citation": "Citations (91)", "departments": ["University of California, Berkeley", "Microsoft", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Statistics and  ... ations Research"], "authors": ["Shankar Bhamidi.....http://dblp.org/pers/hd/b/Bhamidi:Shankar", "Guy Bresler.....http://dblp.org/pers/hd/b/Bresler:Guy", "Allan Sly.....http://dblp.org/pers/hd/s/Sly:Allan"], "conf": "focs", "year": "2008", "pages": 10}