{"title": "On the Performance of Primal/Dual Schemes for Congestion Control in Networks with Dynamic Flows.", "fields": ["penalty method", "maximization", "multipath routing", "fifo", "network congestion"], "abstract": "Stability and fairness are two design objectives of congestion control mechanisms; they have traditionally been analyzed for long-lived flows (or elephants). It is only recently that short-lived flows (or mice) have received attention. Whereas stability has been established for the existing primal-dual based control mechanisms, the performance issue has been largely overlooked. In this paper, we study utility maximization problems for networks with dynamic flows. In particular, we consider the case where sessions of each class results in flows that arrive according to a Poisson process and have a length given by a general distribution. The goal is to maximize the long-term expected system utility that is a function of the number of flows and the rate (identical within a given class) allocated to each flow. Our results show that, as long as the average amount of work brought by the flows is strictly within the network stability region, the rate allocation and stability issues are decoupled. While stability can be guaranteed by, for example, a FIFO policy, utility maximization becomes an unconstrained optimization that results in a static rate allocation for flows. We also provide a queueing interpretation of this seemingly surprising result and show that not all utility functions make sense for dynamic flows. Finally, we use simulation results to show that indeed the open-loop algorithm maximizes the expected system utility.", "citation": "Citations (21)", "departments": ["Qualcomm", "University of Waterloo", "University of Waterloo"], "authors": ["Kexin Ma.....http://dblp.org/pers/hd/m/Ma:Kexin", "Ravi Mazumdar.....http://dblp.org/pers/hd/m/Mazumdar:Ravi", "Jun Luo.....http://dblp.org/pers/hd/l/Luo:Jun"], "conf": "infocom", "year": "2008", "pages": 5}