{"title": "Providing a Wide Field of View for Effective Interaction in Desktop Tangible Augmented Reality.", "fields": ["optical head mounted display", "augmented reality", "visual artifact", "field of view", "usability"], "abstract": "This paper proposes to generate and provide wide field of view (FOV) augmented reality (AR) imagery by mosaicing images from smaller fields of moving views in \"desktop\" tangible AR (DTAR) environments. AR systems usually offer a limited FOV into the interaction space, constrained by the FOV of the camera and/or the display, which causes serious usability problems especially when the interaction space is large and many tangible props/markers are used. This problem is more apparent in DTAR environments in which an upright frontal display is used, instead of a head mounted display. This can be solved partly by placing the camera at a relatively far location or by using multiple cameras and increasing the working FOV. However, as for the former solution, the large distance between the interaction space and the fixed camera decreases the tracking and recognition reliability of the tangible markers, and the latter solution introduces significant additional set-up, cost, and computational load. Thus, we propose to use a mosaiced image to provide wide FOV AR imagery. We experimentally compare our solution, i.e. to offer the entire view of the interaction space at once, to other nominal AR set-ups. The experimental results show that, despite some amounts of visual artifacts due to the imperfect mosaicing, the proposed solution can improve task performance and usability for a typical DTAR system. Our findings should contribute to making AR systems more practical and usable for the mass.", "citation": "Citations (9)", "departments": ["Pohang University of Science and Technology", "Korea University"], "authors": ["Seokhee Jeon.....http://dblp.org/pers/hd/j/Jeon:Seokhee", "Gerard Jounghyun Kim.....http://dblp.org/pers/hd/k/Kim:Gerard_Jounghyun"], "conf": "vr", "year": "2008", "pages": 8}