{"title": "Discovering topical structures of databases.", "fields": ["database theory", "database schema", "data integration", "foreign key", "database testing"], "abstract": "The increasing complexity of enterprise databases and the prevalent lack of documentation incur significant cost in both understanding and integrating the databases. Existing solutions addressed mining for keys and foreign keys, but paid little attention to more high-level structures of databases. In this paper, we consider the problem of discovering topical structures of databases to support semantic browsing and large-scale data integration. We describe iDisc, a novel discovery system based on a multi-strategy learning framework. iDisc exploits varied evidence in database schema and instance values to construct multiple kinds of database representations. It employs a set of base clusterers to discover preliminary topical clusters of tables from database representations, and then aggregate them into final clusters via meta-clustering. To further improve the accuracy, we extend iDisc with novel multiple-level aggregation and clusterer boosting techniques. We introduce a new measure on table importance and propose an approach to discovering cluster representatives to facilitate semantic browsing. An important feature of our framework is that it is highly extensible, where additional database representations and base clusterers may be easily incorporated into the framework. We have extensively evaluated iDisc using large real-world databases and results show that it discovers topical structures with a high degree of accuracy.", "citation": "Citations (32)", "year": "2008", "departments": ["IBM", "IBM", "IBM", "IBM"], "conf": "sigmod", "authors": ["Wensheng Wu.....http://dblp.org/pers/hd/w/Wu:Wensheng", "Berthold Reinwald.....http://dblp.org/pers/hd/r/Reinwald:Berthold", "Yannis Sismanis.....http://dblp.org/pers/hd/s/Sismanis:Yannis", "Rajesh Manjrekar.....http://dblp.org/pers/hd/m/Manjrekar:Rajesh"], "pages": 12}