{"title": "Second Preimage Attacks on Dithered Hash Functions.", "fields": ["dither", "double hashing", "hash buster", "image", "preimage attack", "sha 2", "md2", "collision attack", "md4"], "abstract": "We develop a new generic long-message second preimage attack, based on combining the techniques in the second preimage attacks of Dean [8] and Kelsey and Schneier [16] with the herding attack of Kelsey and Kohno [15]. We show that these generic attacks apply to hash functions using the Merkle-Damgard construction with only slightly more work than the previously known attack, but allow enormously more control of the contents of the second preimage found. Additionally, we show that our new attack applies to several hash function constructions which are not vulnerable to the previously known attack, including the dithered hash proposal of Rivest [25], Shoup's UOWHF[26] and the ROX hash construction [2].We analyze the properties of the dithering sequence used in [25], and develop a time-memory tradeoff which allows us to apply our second preimage attack to a wide range of dithering sequences, including sequences which are much stronger than those in Rivest's proposals. Finally, we show that both the existing second preimage attacks [8,16] and our new attack can be applied even more efficiently to multiple target messages; in general, given a set of many target messages with a total of 2R message blocks, these second preimage attacks can find a second preimage for one of those target messages with no more work than would be necessary to find a second preimage for a single target message of 2R message blocks.", "citation": "Not cited", "year": "2008", "departments": ["Katholieke Universiteit Leuven", "École Normale Supérieure", "École Normale Supérieure", "Weizmann Institute of Science", "National Institute of Standards and Technology"], "conf": "eurocrypt", "authors": ["Elena Andreeva.....http://dblp.org/pers/hd/a/Andreeva_0001:Elena", "Charles Bouillaguet.....http://dblp.org/pers/hd/b/Bouillaguet:Charles", "Pierre-Alain Fouque.....http://dblp.org/pers/hd/f/Fouque:Pierre=Alain", "Jonathan J. Hoch.....http://dblp.org/pers/hd/h/Hoch:Jonathan_J=", "John Kelsey.....http://dblp.org/pers/hd/k/Kelsey:John", "Adi Shamir.....http://dblp.org/pers/hd/s/Shamir:Adi", "Sébastien Zimmer.....http://dblp.org/pers/hd/z/Zimmer:S=eacute=bastien"], "pages": 19}