{"title": "Evaluation of video browser features and user interaction with VAST MM.", "fields": ["subjective video quality", "video library", "indexation", "pevq", "engineering design process"], "abstract": "In this paper, we present extensive user studies on browsing and information retrieval in the domain of unstructured videos using the VAST MM video library browser. Our studies were performed over a 3-year period with more than 1,000 participants in the university setting. The majority of students use the video library for retrieval of student presentations in a large engineering design course. Through iterative analysis of context-specific audio, visual, and textual cues, we are able to measure significant improvements on typical retrieval tasks, such as searching for unfamiliar content in a large database with over 300 hours of video. We also present user studies conducted in two videotaped core computer science courses to measure the usefulness of the VAST MM (Video Audio Structure Text MultiMedia) resource for final exam preparation. We find that students who use the lecture video library experience significant improvement in final exam scores.   To better compare video browsers featuring rich content cues to standard video players without cues, we have performed a large experiment to collect measurable data on search tasks. In general, the lack of index cues can be described by an inverse relationship between amount of matching video content and time required to find it. When index cues are available, the relationship is constant, that is, rare content is found in the same time as common content. We evaluate this data and provide additional insight into two common user interaction techniques: audio-visual browsing and visual-only browsing. We show that user preference is uniform, but that audio-visual browsing is significantly more effective for search and retrieval of video data.", "citation": "Citations (6)", "departments": ["Columbia University", "Columbia University", "Columbia University"], "authors": ["Alexander Haubold.....http://dblp.org/pers/hd/h/Haubold:Alexander", "Promiti Dutta.....http://dblp.org/pers/hd/d/Dutta:Promiti", "John R. Kender.....http://dblp.org/pers/hd/k/Kender:John_R="], "conf": "mm", "year": "2008", "pages": 10}