{"title": "Hierarchical movie affective content analysis based on arousal and valence features.", "fields": ["anger", "arousal", "content analysis", "fuzzy clustering", "affect"], "abstract": "Emotional factors directly reflect audiences' attention, evaluation and memory. Affective contents analysis not only create an index for users to access their interested movie segments, but also provide feasible entry for video highlights. Most of the work focus on emotion type detection. Besides emotion type, emotion intensity is also a significant clue for users to find their interested content. For some film genres (Horror, Action, etc), the segments with high emotion intensity have the most possibilities to be video highlights. In this paper, we propose a hierarchical structure for emotion categories and analyze emotion intensity and emotion type by using arousal and valence related features hierarchically. Firstly, High, Medium and Low are detected as emotion intensity levels by using fuzzy c-mean clustering on arousal features. Fuzzy clustering provides a mathematical model to represent vagueness, which is close to human perception. After that, valence related features are used to detect emotion types (Anger, Sad, Fear, Happy and Neutral). Considering video is continuous time series data and the occurrence of a certain emotion is affected by recent emotional history, Hidden Markov Models (HMMs) are used to capture the context information. Experimental results shows the movie segments with high emotion intensity cover over 80% of the movie highlights in Horror and Action movies and the hierarchical method outperforms the one-step method on emotion type detection. Meanwhile, it is flexible for user to pick up their favorite affective content by choosing both emotion intensity levels and emotion types.", "citation": "Citations (96)", "departments": ["University of Newcastle", "University of Newcastle", "University of Newcastle", "Peking University"], "authors": ["Min Xu.....http://dblp.org/pers/hd/x/Xu_0001:Min", "Jesse S. Jin.....http://dblp.org/pers/hd/j/Jin:Jesse_S=", "Suhuai Luo.....http://dblp.org/pers/hd/l/Luo:Suhuai", "Lingyu Duan.....http://dblp.org/pers/hd/d/Duan:Lingyu"], "conf": "mm", "year": "2008", "pages": 4}