{"title": "Understanding the implications of social translucence for systems supporting communication at work.", "fields": ["social responsibility", "mediated communication", "ambiguity", "operationalization", "accountability"], "abstract": "In this paper we describe a study that explored the implications of the  Social Translucence  framework for designing systems that support communications at work. Two systems designed for communicating availability status were empirically evaluated to understand what constitutes a successful way to achieve  Visibility  of people's communicative state. Some aspects of the  Social Translucence  constructs:  Visibility, Awareness  and  Accountability  were further operationalized into a questionnaire and tested relationships between these constructs through path modeling techniques. We found that to improve  Visibility  systems should support people in presenting their status in a contextualized yet abstract manner.  Visibility  was also found to have an impact on  Awareness  and  Accountability  but no significant relationship was seen between  Awareness  and  Accountability . We argue that to design  socially translucent  systems it is insufficient to visualize people's availability status. It is also necessary to introduce mechanisms stimulating mutual  Awareness  that allow for maintaining shared, reciprocical knowledge about communicators' availability state, which then can encourage them to act in a socially responsible way.", "citation": "Citations (10)", "departments": ["Eindhoven University of Technology", "Eindhoven University of Technology", "Eindhoven University of Technology", "Eindhoven University of Technology"], "authors": ["Agnieszka Matysiak Szóstek.....http://dblp.org/pers/hd/s/Sz=oacute=stek:Agnieszka_Matysiak", "Evangelos Karapanos.....http://dblp.org/pers/hd/k/Karapanos:Evangelos", "Berry Eggen.....http://dblp.org/pers/hd/e/Eggen:Berry", "Mike Holenderski.....http://dblp.org/pers/hd/h/Holenderski:Mike"], "conf": "cscw", "year": "2008", "pages": 10}