{"title": "Inapproximability of pure nash equilibria.", "fields": ["trembling hand perfect equilibrium", "epsilon equilibrium", "congestion game", "symmetric equilibrium", "correlated equilibrium"], "abstract": "The complexity of computing pure Nash equilibria in congestion games was recently shown to be PLS-complete. In this paper, we therefore study the complexity of computing approximate equilibria in congestion games. An alpha-approximate equilibrium, for α > 1, is a state of the game in which none of the players can make an α-greedy step, i.e., an unilateral strategy change that decreases the player's cost by a factor of at least α. Our main result shows that finding an α-approximate equilibrium of a given congestion game is sc PLS-complete, for any polynomial-time computable α > 1. Our analysis is based on a gap introducing PLS-reduction from FLIP, i.e., the problem of finding a local optimum of a function encoded by an arbitrary circuit. As this reduction is tight it additionally implies that computing an α-approximate equilibrium reachable from a given initial state by a sequence of α-greedy steps is PSPACE-complete. Our results are in sharp contrast to a recent result showing that every local search problem in PLS admits a fully polynomial time approximation scheme.   In addition, we show that there exist congestion games with states such that any sequence of α-greedy steps leading from one of these states to an α-approximate Nash equilibrium has exponential length, even if the delay functions satisfy a bounded-jump condition. This result shows that a recent result about polynomial time convergence for α-greedy steps in congestion games satisfying the bounded-jump condition is restricted to symmetric games only.", "citation": "Citations (111)", "year": "2008", "departments": ["RWTH Aachen University", "RWTH Aachen University"], "conf": "stoc", "authors": ["Alexander Skopalik.....http://dblp.org/pers/hd/s/Skopalik:Alexander", "Berthold Vöcking.....http://dblp.org/pers/hd/v/V=ouml=cking:Berthold"], "pages": 10}