{"title": "Additive guarantees for degree bounded directed network design.", "fields": ["linear programming relaxation", "arborescence", "connectivity", "supermodular function", "minimum spanning tree", "spanning tree", "special case"], "abstract": "We present polynomial-time approximation algorithms for some degree-bounded directed network design problems. Our main result is for intersecting supermodular connectivity with degree bounds: given a directed graph G=(V,E) with non-negative edge-costs, a connectivity requirement specified by an intersecting supermodular function f, and upper bounds a v , b v  v∈ V  on in-degrees and out-degrees of vertices, find a minimum-cost f-connected subgraph of G that satisfies the degree bounds. We give a bicriteria approximation algorithm that for any 0 ≤ e ≤ 1/2, computes an f-connected subgraph with in-degrees at most ⌈ a v /1-e ⌉ + 4, out-degrees at most ⌈ b v /1-e ⌉ + 4, and cost at most 1/e times the optimum. This includes, as a special case, the minimum-cost degree-bounded arborescence problem. We also obtain similar results for the (more general) class of crossing supermodular requirements. Our result extends and improves the (3a v +4, 3b v +4, 3)-approximation of Lau et al. Setting e=0, our result gives the first purely additive guarantee for the unweighted versions of these problems. Our algorithm is based on rounding an LP relaxation for the problem. We also prove that the above cost-degree trade-off (even for the degree-bounded arborescence problem) is optimal relative to the natural LP relaxation. For every 0 v /1-e + O(1) has cost at least 1-o(1)/e times the optimal LP value. For the special case of finding a minimum degree arborescence (without costs), we give a stronger +2 additive approximation. This improves on a result of Lau et al. [13] that gives a 2Δ*+2 guarantee, and Klein et al. [11] that gives a (1+e)Δ*+O(log 1+e  n) bound, where Δ* is the degree of the optimal arborescence. As a corollary of our result, we (almost) settle a conjecture of Bang-Jensen et al. [1] on low-degree arborescences. Our algorithms use the iterative rounding technique of Jain, which was used by Lau et al. and Singh and Lau in the context of degree-bounded network design. It is however non-trivial to extend these techniques to the directed setting without incurring a multiplicative violation in the degree bounds. This is due to the fact that known polyhedral characterization of arborescences has the cut-constraints which, along with degree-constraints, are unsuitable for arguing the existence of integral variables in a basic feasible solution. We overcome this difficulty by enhancing the iterative rounding steps and by means of stronger counting arguments. Our counting technique is quite general, and it also simplifies the proofs of many previous results. We also apply the technique to undirected graphs. We consider the minimum crossing spanning tree problem: given an undirected edge-weighted graph G, edge-subsets E i  i=1  k , and non-negative integers b i  i=1  k , find a minimum-cost spanning tree (if it exists) in G that contains at most b i  edges from each set E i . We obtain a +(r-1) additive approximation for this problem, when each edge lies in at most r sets; this considerably improves the result of Bilo et al. A special case of this problem is degree-bounded minimum spanning tree, and our result gives a substantially easier proof of the recent +1 approximation of Singh and Lau.", "citation": "Citations (79)", "year": "2008", "departments": ["IBM", "IBM", "Carnegie Mellon University", "IBM", "IBM", "IBM"], "conf": "stoc", "authors": ["Nikhil Bansal.....http://dblp.org/pers/hd/b/Bansal:Nikhil", "Rohit Khandekar.....http://dblp.org/pers/hd/k/Khandekar:Rohit", "Viswanath Nagarajan.....http://dblp.org/pers/hd/n/Nagarajan:Viswanath"], "pages": 10}