{"title": "A Security Punctuation Framework for Enforcing Access Control on Streaming Data.", "fields": ["data security", "data access", "data stream management system", "data stream mining", "query plan"], "abstract": "The management of privacy and security in the context of data stream management systems (DSMS) remains largely an unaddressed problem to date. Unlike in traditional DBMSs where access control policies are persistently stored on the server and tend to remain stable, in streaming applications the contexts and with them the access control policies on the real-time data may rapidly change. A person entering a casino may want to immediately block others from knowing his current whereabouts. We thus propose a novel \";stream-centric\"; approach, where security restrictions are not persistently stored on the DSMS server, but rather streamed together with the data. Here, the access control policies are expressed via security constraints (called security punctuations, or short, sps) and are embedded into data streams. The advantages of the sp model include flexibility, dynamicity and speed of enforcement. DSMSs can adapt to not only data-related but also security-related selectivities, which helps reduce the waste of resources, when few subjects have access to data. We propose a security-aware query algebra and new equivalence rules together with cost estimations to guide the security-aware query plan optimization. We have implemented the sp framework in a real DSMS. Our experimental results show the validity and the performance advantages of our sp model as compared to alternative access control enforcement solutions for DSMSs.", "citation": "Citations (73)", "departments": ["Purdue University", "Worcester Polytechnic Institute", "Purdue University"], "authors": ["Rimma V. Nehme.....http://dblp.org/pers/hd/n/Nehme:Rimma_V=", "Elke A. Rundensteiner.....http://dblp.org/pers/hd/r/Rundensteiner:Elke_A=", "Elisa Bertino.....http://dblp.org/pers/hd/b/Bertino:Elisa"], "conf": "icde", "year": "2008", "pages": 10}