{"title": "Spot Pricing of Secondary Spectrum Usage in Wireless Cellular Networks.", "fields": ["rational pricing", "demand curve", "stochastic programming", "average cost pricing", "global optimization"], "abstract": "Recent deregulation initiatives enable cellular providers to sell excess spectrum for secondary usage. In this paper, we investigate the problem of optimal spot pricing of spectrum by a provider in the presence of both non-elastic primary users, with long-term commitments, and opportunistic, elastic secondary users. We first show that optimal pricing can be formulated as an infinite horizon average reward problem and solved using stochastic dynamic programming. Next, we investigate the design of efficient single pricing policies. We provide numerical and analytical evidences that static pricing policies do not perform well in such settings (in sharp contrast to settings where all the users are elastic). On the other hand, we prove that deterministic threshold pricing achieves optimal profit amongst all single-price policies and performs close to global optimal pricing. We characterize the profit regions of static and threshold pricing, as a function of the arrival rate of primary users. Under certain reasonable assumptions on the demand function, we show that the profit region of threshold pricing can be far larger than that of static pricing. Moreover, we also show that these profit regions critically depend on the support of the demand function rather than specific form of it. We prove that the profit function of threshold pricing is unimodal in price and determine a restricted interval in which the optimal threshold lies. These two properties enable very efficient computation of the optimal threshold policy that is far faster than that of the global optimal policy.", "citation": "Citations (72)", "departments": ["Boston University", "Boston University", "Boston University"], "authors": ["Huseyin Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Huseyin", "Murat Alanyali.....http://dblp.org/pers/hd/a/Alanyali:Murat", "David Starobinski.....http://dblp.org/pers/hd/s/Starobinski:David"], "conf": "infocom", "year": "2008", "pages": 9}