{"title": "David and Goliath Commitments: UC Computation for Asymmetric Parties Using Tamper-Proof Hardware.", "fields": ["oblivious transfer", "computer security", "one way function", "pseudorandom function family", "tamper resistance", "computer science", "computation", "telecommunications", "universal composability"], "abstract": "Designing secure protocols in the Universal Composability (UC) framework confers many advantages. In particular, it allows the protocols to be securely used as building blocks in more complex protocols, and assists in understanding their security properties. Unfortunately, most existing models in which universally composable computation is possible (for useful functionalities) require a trusted setup stage. Recently, Katz [Eurocrypt '07] proposed an alternative to the trusted setup assumption: tamper-proof hardware. Instead of trusting a third party to correctly generate the setup information, each party can create its own hardware tokens, which it sends to the other parties. Each party is only required to trust that its own tokens are tamper-proof.\n\nKatz designed a UC commitment protocol that requires both parties to generate hardware tokens. In addition, his protocol relies on a specific number-theoretic assumption. In this paper, we construct UC commitment protocols for \"David\" and \"Goliath\": we only require a single party (Goliath) to be capable of generating tokens. We construct a version of the protocol that is secure for computationally unbounded parties, and a more efficient version that makes computational assumptions only about David (we require only the existence of a one-way function). Our protocols are simple enough to be performed by hand on David's side.\n\nThese properties may allow such protocols to be used in situations which are inherently asymmetric in real-life, especially those involving individuals versus large organizations. Classic examples include voting protocols (voters versus \"the government\") and protocols involving private medical data (patients versus insurance-agencies or hospitals).", "citation": "Not cited", "year": "2008", "departments": ["Weizmann Institute of Science", "Weizmann Institute of Science"], "conf": "eurocrypt", "authors": ["Tal Moran.....http://dblp.org/pers/hd/m/Moran:Tal", "Gil Segev.....http://dblp.org/pers/hd/s/Segev:Gil"], "pages": 18}