{"title": "Stateless distributed gradient descent for positive linear programs.", "fields": ["bipartite graph", "dominating set", "row and column spaces", "stateless protocol", "exponential function", "multiplicative function"], "abstract": "We develop a framework of distributed and stateless solutions for packing and covering linear programs, which are solved by multiple agents operating in a cooperative but uncoordinated manner. Our model has a separate \"agent\" controlling each variable and an agent is allowed to read-off the current values only of those constraints in which it has non-zero coefficients. This is a natural model for many distributed applications like flow control, maximum bipartite matching, and dominating sets.   The most appealing feature of our algorithms is their simplicity and polylogarithmic convergence. For the packing LP max{cx | Ax  = 0}, the algorithm associates a dual variable y i  = exp[1e * (A i x/b i -1 )] for each constraint i and each agent j iteratively increases (resp. decreases) x j  multiplicatively if A j  T  y is too small (resp. large) as compared to c j . Our algorithm starting from a feasible solution, always maintains feasibility, and computes a (1+epsilon) approximation in poly((ln (mn A_max))e) rounds. Here m and n are number of rows and columns of A and A_max, also known as the \"width\" of the LP, is the ratio of maximum and minimum non-zero entries A i j/(b i c j ). Similar algorithm works for the covering LP min{by | A T  y >= c, y >= 0} as well.   While exponential dual variables are used in several packing/ covering LP algorithms before [25, 9, 13, 12, 26, 16], this is the first algorithm which is both stateless and has polylogarithmic convergence. Our algorithms can be thought of as applying distributed gradient descent/ascent on a carefully chosen potential. Our analysis differs from those of previous multiplicative update based algorithms and argues that while the current solution is far away from optimality, the potential function decreases/increases by a significant factor.", "citation": "Citations (18)", "year": "2008", "departments": ["Johns Hopkins University", "IBM", "IBM", "baruch@cs.jhu.edu"], "conf": "stoc", "authors": ["Baruch Awerbuch.....http://dblp.org/pers/hd/a/Awerbuch:Baruch", "Rohit Khandekar.....http://dblp.org/pers/hd/k/Khandekar:Rohit"], "pages": 10}