{"title": "Optimizing SQL Queries over Text Databases.", "fields": ["data definition language", "spatial query", "stored procedure", "null", "in memory processing"], "abstract": "Text documents often embed data that is structured in nature, and we can expose this structured data using information extraction technology. By processing a text database with information extraction systems, we can materialize a variety of structured \"relations,\" over which we can then issue regular SQL queries. A key challenge to process SQL queries in this text-based scenario is efficiency: information extraction is time-consuming, so query processing strategies should minimize the number of documents that they process. Another key challenge is result quality: in the traditional relational world, all correct execution strategies for a SQL query produce the same (correct) result; in contrast, a SQL query execution over a text database might produce answers that are not fully accurate or complete, for a number of reasons. To address these challenges, we study a family of select-project-join SQL queries over text databases, and characterize query processing strategies on their efficiency and - critically - on their result quality as well. We optimize the execution of SQL queries over text databases in a principled, cost-based manner, incorporating this tradeoff between efficiency and result quality in a user-specific fashion. Our large-scale experiments- over real data sets and multiple information extraction systems - show that our SQL query processing approach consistently picks appropriate execution strategies for the desired balance between efficiency and result quality.", "citation": "Citations (67)", "departments": ["Columbia University", "University of Wisconsin-Madison", "Columbia University"], "authors": ["Alpa Jain.....http://dblp.org/pers/hd/j/Jain:Alpa", "AnHai Doan.....http://dblp.org/pers/hd/d/Doan:AnHai", "Luis Gravano.....http://dblp.org/pers/hd/g/Gravano:Luis"], "conf": "icde", "year": "2008", "pages": 10}