{"title": "iBubble: Multi-Keyword Routing Protocol for Heterogeneous Wireless Sensor Networks.", "fields": ["mobile wireless sensor network", "heterogeneous network", "cellular network", "key distribution in wireless sensor networks", "routing protocol"], "abstract": "Many tasks require multiple sensing capabilities; in wireless sensor networks (WSNs), it is expensive to deploy a homogeneous network wherein every sensor has the same functionality. Instead, it is economical to deploy a heterogeneous network wherein sensors differ in their capabilities; in such a network, efficient data querying is essential. We propose a multi-keyword routing protocol, iBubble, for heterogeneous wireless sensor networks (HWSNs) where keywords describe sensor functionalities. iBubble provides an efficient query interface for locating data; queries are routed only along paths with nodes matching the query. iBubble utilizes an intelligent bubbling mechanism to propagate keywords to the base-station (BS). The keywords are aggregated via a novel use of lattices to reduce network cost. We show that iBubble can emulate diffusion and generally produce less traffic by restricting the query dissemination based upon both application type and data value. Our study analytically compares iBubble and diffusion, and formally characterizes the conditions required for iBubble to outperform diffusion in both static (fixed) and dynamic (mobile) networks. We did extensive simulations, our results match our theory and show that iBubble can outperform diffusion in many heterogeneous deployments when keyword distributions are \"clustered\" enough to satisfy the fraction of the network involved in a query/update defined by our analytical bound. Additionally, iBubble handles mobility, fault-tolerance, and provides network diagnosis via keyword bubbling. By utilizing keywords, iBubble bridges many routing and energy problems prevalent in WSNs, and provides a simple, uniform solution.", "citation": "Citations (5)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["Xiaoming Lu.....http://dblp.org/pers/hd/l/Lu:Xiaoming", "Matt Spear.....http://dblp.org/pers/hd/s/Spear:Matt", "Karl N. Levitt.....http://dblp.org/pers/hd/l/Levitt:Karl_N=", "Shyhtsun Felix Wu.....http://dblp.org/pers/hd/w/Wu:Shyhtsun_Felix"], "conf": "infocom", "year": "2008", "pages": 9}