{"title": "Queueing Analysis of Loss Systems with Variable Optical Delay Lines.", "fields": ["network packet", "finite set", "greedy algorithm", "packet loss", "product form solution"], "abstract": "A new optical device called variable optical delay line (VODL) has been proposed in the literature. As suggested by its name, the delay of a VODL can be dynamically set within a certain range. Once set, a VODL behaves like a traditional fiber delay line and can admit packets requiring the same delay as that set by the VODL. As in the queueing context, a VODL can thus be viewed as a server that serves packets with the service times equal to the required delays. In this paper, we consider loss systems with parallel VODLs subject to various classes of packet arrivals. Such loss systems are different from the classical loss systems as a VODL, even when occupied, can still admit new packets with the same delay. For the case with an infinite number of VODLs, we show that the number of VODLs occupied by different classes of packets still has a product form solution. However, the analysis for the case with a finite number of VODLs is much more difficult. For this, we propose an approximation method based on state truncation. We show that the packet loss probabilities derived from our approximation are very close to those generated from simulations. In order to minimize the packet loss probabilities in such loss systems, we also consider the problem of assigning dedicated VODLS to various classes of packets. We show under the light traffic condition, the complete sharing policy, i.e., the policy that does not assign any dedicated VODLs, is optimal. For the general traffic condition, we propose a greedy search algorithm to find a suboptimal assignment of dedicated VODLS. Simulation results show that our greedy algorithm yields very good assignments when comparing with the optimal ones.", "citation": "Citations (7)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Duan-Shin Lee.....http://dblp.org/pers/hd/l/Lee:Duan=Shin", "Cheng-Shang Chang.....http://dblp.org/pers/hd/c/Chang:Cheng=Shang", "Jay Cheng.....http://dblp.org/pers/hd/c/Cheng:Jay", "Horng-Sheng Yan.....http://dblp.org/pers/hd/y/Yan:Horng=Sheng"], "conf": "infocom", "year": "2008", "pages": 9}