{"title": "HyperCBR: Large-Scale Content-Based Routing in a Multidimensional Space.", "fields": ["underpinning", "dynamic source routing", "topological property", "overlay network", "middleware"], "abstract": "Content-based routing (CBR) is becoming increasingly popular as a building block for distributed applications. CBR differs from classical routing paradigms as messages are routed based on their content rather than their destination address, which fosters decoupling and flexibility in the application's distributed architecture. However, most available systems realize CBR by relying on a tree-shaped overlay network and adopt a routing strategy based on broadcasting subscription requests, thus hampering applicability in very large-scale networks. In this paper, we observe that a fundamental underpinning of any CBR protocol is for messages and subscriptions to \"meet\" at some points in the network. In the approach we propose here, called HyperCBR 1 , we enforce this topological property in a multidimensional space, by routing messages and subscriptions on different, albeit intersecting, partitions. We derive an analytical model of HyperCBR, validated through simulation, and use it to evaluate our approach in two relevant CBR contexts - content-based searches in peer-to-peer networks, and content- based publish-subscribe. The results show that our protocol achieves efficient CBR even in very large scale settings (e.g., millions of nodes) while at the same time opening up intriguing opportunities for deployment-time tuning based on the expected traffic profiles. The analytical evaluation is complemented by simulation results relying on a CAN-based implementation, showing that HyperCBR generates a small forwarding and matching load, and that it is able to tolerate high churn with low overhead.", "citation": "Citations (30)", "departments": ["University of Trento", "VU University Amsterdam", "University of Trento"], "authors": ["Stefano Castelli.....http://dblp.org/pers/hd/c/Castelli:Stefano", "Paolo Costa.....http://dblp.org/pers/hd/c/Costa:Paolo", "Gian Pietro Picco.....http://dblp.org/pers/hd/p/Picco:Gian_Pietro"], "conf": "infocom", "year": "2008", "pages": 9}