{"title": "Weighted Proportional Fairness Capacity of Gaussian MIMO Broadcast Channels.", "fields": ["conjugate gradient method", "combinatorial optimization", "optimization problem", "mimo", "channel capacity"], "abstract": "Recently, there has been tremendous interest in exploring the capacity region of multiple-input multiple-output broadcast channels (MIMO-BC). However, fairness, a very important performance measure of multi-user communications systems and networks, has not been addressed for MIMO-BC in the literature. In this paper, we study how to determine the weighted proportional fairness (WPF) capacity of MIMO-BC. The difficulty of finding the WPF capacity of MIMO-BC lies in that it contains two difficult subproblems: 1) a complex combinatorial optimization problem to determine the optimal decoding order in the dual MIMO multiple access channel (MEMO-MAC) and 2) a nonconvex optimization problem in computing the optimal input covariance matrices to achieve WPF capacity. To circumvent the difficulty in the first subproblem, we derive a set of optimality conditions that the optimal decoding order must satisfy. Based on these optimality conditions, we design an efficient algorithm called iterative gradient sorting (IGS) to determine the optimal decoding order by iteratively sorting the gradient entries and moving across corner points. We also show that this method can be geometrically interpreted as sequential gradient projections. For the second subproblem, we propose an efficient algorithm based on conjugate gradient projection (CGP) technique, which employs the concept of Hessian conjugate. We also develop a polynomial time algorithm to solve the projection subproblem.", "citation": "Citations (7)", "departments": ["Virginia Polyte ... iv., Blacksburg", "Virginia Polyte ... iv., Blacksburg"], "authors": ["Jia Liu.....http://dblp.org/pers/hd/l/Liu:Jia", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas"], "conf": "infocom", "year": "2008", "pages": 9}