{"title": "Beyond Novelty Detection: Incongruent Events, when General and Specific Classifiers Disagree.", "fields": ["cognitive neuroscience of visual object recognition", "vocabulary", "hierarchy", "novelty detection", "probabilistic logic", "data type", "unexpected events"], "abstract": "Unexpected stimuli are a challenge to any machine learning algorithm. Here, we identify distinct types of unexpected events when general-level and specific-level classifiers give conflicting predictions. We define a formal framework for the representation and processing of incongruent events: Starting from the notion of label hierarchy, we show how partial order on labels can be deduced from such hierarchies. For each event, we compute its probability in different ways, based on adjacent levels in the label hierarchy. An incongruent event is an event where the probability computed based on some more specific level is much smaller than the probability computed based on some more general level, leading to conflicting predictions. Algorithms are derived to detect incongruent events from different types of hierarchies, different applications, and a variety of data types. We present promising results for the detection of novel visual and audio objects, and new patterns of motion in video. We also discuss the detection of Out-Of-Vocabulary words in speech recognition, and the detection of incongruent events in a multimodal audiovisual scenario.", "citation": "Citations (21)", "year": "2008", "departments": ["Hebrew University of Jerusalem", "Hebrew University of Jerusalem", "Brno University of Technology", "Brno University of Technology", "Leibniz Institute for Neurobiology", "Hebrew University of Jerusalem", "Johns Hopkins University", "Hebrew University of Jerusalem", "Oregon Health & Science University", "IDIAP"], "conf": "nips", "authors": ["Daphna Weinshall.....http://dblp.org/pers/hd/w/Weinshall:Daphna", "Hynek Hermansky.....http://dblp.org/pers/hd/h/Hermansky:Hynek", "Alon Zweig.....http://dblp.org/pers/hd/z/Zweig:Alon", "Jie Luo.....http://dblp.org/pers/hd/l/Luo:Jie", "Holly Brügge Jimison.....http://dblp.org/pers/hd/j/Jimison:Holly_Br=uuml=gge", "Frank W. Ohl.....http://dblp.org/pers/hd/o/Ohl:Frank_W=", "Misha Pavel.....http://dblp.org/pers/hd/p/Pavel:Misha"], "pages": 8}