{"title": "Efficiently matching sets of features with random histograms.", "fields": ["histogram matching", "similarity measure", "randomized algorithm", "locality sensitive hashing", "caltech 101"], "abstract": "As the commonly used representation of a feature-rich data object has evolved from a single feature vector to a set of feature vectors, a key challenge in building a content-based search engine for feature-rich data is to match feature-sets efficiently. Although substantial progress has been made during the past few years, existing approaches are still inefficient and inflexible for building a search engine for massive datasets. This paper presents a randomized algorithm to embed a set of features into a single high-dimensional vector to simplify the feature-set matching problem. The main idea is to project feature vectors into an auxiliary space using locality sensitive hashing and to represent a set of features as a histogram in the auxiliary space. A histogram is simply a high dimensional vector, and efficient similarity measures like L 1  and L 2  distances can be employed to approximate feature-set distance measures.   We evaluated the proposed approach under three different task settings, i.e. content-based image search, image object recognition and near-duplicate video clip detection. The experimental results show that the proposed approach is indeed effective and flexible. It can achieve accuracy comparable to the feature-set matching methods, while requiring significantly less space and time. For object recognition with Caltech 101 dataset, our method runs 25 times faster to achieve the same precision as Pyramid Matching Kernel, the state-of-the-art feature-set matching method.", "citation": "Citations (74)", "departments": ["Princeton University", "Princeton University", "Princeton University", "Princeton University"], "authors": ["Wei Dong.....http://dblp.org/pers/hd/d/Dong_0003:Wei", "Zhe Wang.....http://dblp.org/pers/hd/w/Wang:Zhe", "Moses Charikar.....http://dblp.org/pers/hd/c/Charikar:Moses", "Kai Li.....http://dblp.org/pers/hd/l/Li_0001:Kai"], "conf": "mm", "year": "2008", "pages": 10}