{"title": "Minimum Cost Topology Construction for Rural Wireless Mesh Networks.", "fields": ["wireless mesh network", "default gateway", "mesh networking", "point to point", "internetworking"], "abstract": "IEEE 802.11 WiFi equipment based wireless mesh networks have recently been proposed as an inexpensive approach to connect far-flung rural areas. Such networks are built using high-gain directional antennas that can establish long-distance wireless point-to-point links. Some nodes in the network (called gateway nodes) are directly connected to the wired internet, and the remaining nodes connect to the gateway(s) using one or more hops. The dominant cost of constructing such a mesh network is the cost of constructing antenna towers at nodes. The cost of a tower depends on its height, which in turn depends on the length of its links and the physical obstructions along those links. We investigate the problem of selecting which links should be established such that all nodes are connected, while the cost of constructing the antenna towers required to establish the selected links is minimized. We show that this problem is NP-hard and that a better than O(log n) approximation cannot be expected, where n is the number of vertices in the graph. We then present the first algorithm in the literature, for this problem, with provable performance bounds. More precisely, we present a greedy algorithm that is an O(log n) approximation algorithm for this problem. Finally, through simulations, we compare our approximation algorithm with both the optimal solution, and a naive heuristic.", "citation": "Citations (18)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Bell Labs", "Bell Labs"], "authors": ["Debmalya Panigrahi.....http://dblp.org/pers/hd/p/Panigrahi:Debmalya", "Partha Dutta.....http://dblp.org/pers/hd/d/Dutta:Partha", "Sharad Jaiswal.....http://dblp.org/pers/hd/j/Jaiswal:Sharad", "K. V. M. Naidu.....http://dblp.org/pers/hd/n/Naidu:K=_V=_M=", "Rajeev Rastogi.....http://dblp.org/pers/hd/r/Rastogi:Rajeev"], "conf": "infocom", "year": "2008", "pages": 9}