{"title": "Are fit tables really talking?: a series of experiments to understand whether fit tables are useful during evolution tasks.", "fields": ["software development", "test case", "executable", "glue code", "acceptance testing"], "abstract": "Test-driven software development tackles the problem of operationally defining the features to be implemented by means of test cases. This approach was recently ported to the early development phase, when requirements are gathered and clarified. Among the existing proposals, Fit (Framework for Integrated Testing) supports the precise specification of requirements by means of so called Fit tables, which express relevant usage scenarios in a tabular format, easily understood also by the customer. Fit tables can be turned into executable test cases through the creation of pieces of glue code, called fixtures.   In this paper, we test the claimed benefits of Fit through a series of three controlled experiments in which Fit tables and related fixtures are used to clarify a set of change requirements, in a software evolution scenario. Results indicate improved correctness achieved with no significant impact on time, however benefits of Fit vary in a substantial way depending on the developers' experience. Preliminary results on the usage of Fit in combination with pair programming revealed another relevant source of variation.", "citation": "Citations (30)", "departments": ["University of Genoa", "University of Sannio", "fondazione bruno kessler", "fondazione bruno kessler", "Politec. di Torino, Torino"], "authors": ["Filippo Ricca.....http://dblp.org/pers/hd/r/Ricca:Filippo", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Marco Torchiano.....http://dblp.org/pers/hd/t/Torchiano:Marco", "Paolo Tonella.....http://dblp.org/pers/hd/t/Tonella:Paolo", "Mariano Ceccato.....http://dblp.org/pers/hd/c/Ceccato:Mariano", "Corrado Aaron Visaggio.....http://dblp.org/pers/hd/v/Visaggio:Corrado_Aaron"], "conf": "icse", "year": "2008", "pages": 10}