{"title": "ZOID: I/O-forwarding infrastructure for petascale architectures.", "fields": ["thread", "daemon", "massively parallel", "zoid", "petascale computing"], "abstract": "The ZeptoOS project is developing an open-source alternative to the proprietary software stacks available on contemporary massively parallel architectures. The aim is to enable computer science research on these architectures, enhance community collaboration, and foster innovation. In this paper, we introduce a component of ZeptoOS called ZOID---an I/O-forwarding infrastructure for architectures such as IBM Blue Gene that decouple file and socket I/O from the compute nodes, shipping those functions to dedicated I/O nodes. Through the use of optimized network protocols and data paths, as well as a multithreaded daemon running on I/O nodes, ZOID provides greater performance than does the stock infrastructure. We present a set of benchmark results that highlight the improvements. Crucially, the flexibility of our infrastructure is a vast improvement over the stock infrastructure, allowing users to forward data using custom-designed application interfaces, through an easy-to-use plug-in mechanism. This capability is used for real-time telescope data transfers, extensively discussed in the paper. Plug-in--specific threads implement prefetching of data obtained over sockets from an input cluster and merge results from individual compute nodes before sending them out, significantly reducing required network bandwidth. This approach allows a ZOID version of the application to handle a larger number of subbands per I/O node, or even to bypass the input cluster altogether, plugging the input from remote receiver stations directly into the I/O nodes. Using the resources more efficiently can result in considerable savings.", "citation": "Citations (125)", "year": "2008", "departments": ["Argonne National Laboratory", "ASTRON", "Argonne National Laboratory", "Argonne National Laboratory"], "conf": "ppopp", "authors": ["Kamil Iskra.....http://dblp.org/pers/hd/i/Iskra:Kamil", "John W. Romein.....http://dblp.org/pers/hd/r/Romein:John_W=", "Kazutomo Yoshii.....http://dblp.org/pers/hd/y/Yoshii:Kazutomo", "Peter H. Beckman.....http://dblp.org/pers/hd/b/Beckman:Peter_H="], "pages": 10}