{"title": "Measurement Based Analysis and Modeling of the Error Process in IEEE 802.15.4 LR-WPANs.", "fields": ["bit error rate", "channel state information", "received signal strength indication", "binary erasure channel", "ieee 802 15"], "abstract": "Knowledge of the error process and related channel parameters in wireless networks is invaluable and highly instrumental in a broad range of applications. Under the IEEE 802.15.4 Low Rate-Wireless Personal Area Networks (LR- WPAN) standard, compliant devices are capable of providing two pieces of information about the channel conditions along with each received packet, the Link Quality Indication (LQI) and Received Signal Strength Indication (RSSI). Together they constitute a form of Channel State Information (CSI). This work is based on statistical and information theoretic analysis of a very extensive data set of wireless channel traffic between a transmitter and receiver, called packet traces. Data is collected in a variety of documented environments. To our knowledge, this is the first detailed trace collection effort for this type of network. The traces distinguish themselves from data sets of other studies in that they record individual bit errors as well as packets that are never detected by receivers. First, we provide a detailed analysis of the IEEE 802.15.4 wireless channel. More specifically, we provide a detailed analysis of the Bit Error Rate (BER) process at individual bit and on a packet-by-packet basis. We explore the relationship between the packet-level BER process and the LQI and RSSI processes (also observable on a packet-by- packet). The analysis shows that measurements of both LQI and RSSI provide information that allows us to reduce uncertainty about the BER. Secondly, we develop a model of the BER process that is driven by observable CSI parameters. Thirdly, we continue our analysis with measurements of channel memory at the packet and bit level. We determine that the wireless channel 2 bits memory. At the packet level we observe that the amount of channel memory is more varied.", "citation": "Citations (18)", "departments": ["Michigan State University", "Michigan State University"], "authors": ["Muhammad Usman Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Muhammad_Usman", "Hayder Radha.....http://dblp.org/pers/hd/r/Radha:Hayder"], "conf": "infocom", "year": "2008", "pages": 9}