{"title": "A Theory of Expressiveness in Mechanisms.", "fields": ["private information retrieval", "web commerce", "combinatorial auction", "computational learning theory", "arbitrarily large"], "abstract": "A key trend in (electronic) commerce is a demand for higher levels of expressiveness in the mechanisms that mediate interactions. We develop a theory that ties the expressiveness of mechanisms to their efficiency in a domain-independent manner. We introduce two new expressiveness measures, 1) maximum impact dimension, which captures the number of ways that an agent can impact the outcome, and 2) shatterable outcome dimension, which is based on the concept of shattering from computational learning theory. We derive an upper bound on the expected efficiency of any mechanism under its most efficient Nash equilibrium. Remarkably, it depends only on the mechanism's expressiveness. We prove that the bound increases strictly as we allow more expressiveness. We also show that in some cases a small increase in expressiveness yields an arbitrarily large increase in the bound. Finally, we study channel-based mechanisms, which subsume most combinatorial auctions, multi-attribute mechanisms, and the Vickrey-Clarke-Groves scheme. We show that our domain-independent measures of expressiveness appropriately relate to the natural measure of expressiveness of channel-based mechanisms: the number of channels allowed. Using this bridge, our general results yield interesting implications. For example, any (channel-based) multi-item auction that does not allow rich combinatorial bids can be arbitrarily inefficient--unless agents have no private information.", "citation": "Citations (29)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Michael Benisch.....http://dblp.org/pers/hd/b/Benisch:Michael", "Norman M. Sadeh.....http://dblp.org/pers/hd/s/Sadeh:Norman_M=", "Tuomas Sandholm.....http://dblp.org/pers/hd/s/Sandholm:Tuomas"], "conf": "aaai", "year": "2008", "pages": 7}