{"title": "Virtual routers on the move: live router migration as a network-management primitive.", "fields": ["virtual router redundancy protocol", "one armed router", "bridge router", "routing domain", "core router", "logical topology", "network management", "forwarding plane", "router", "software deployment"], "abstract": "The complexity of network management is widely recognized as one of the biggest challenges facing the Internet today. Point solutions for individual problems further increase system complexity while not addressing the underlying causes. In this paper, we argue that many network-management problems stem from the same root cause---the need to maintain consistency between the physical and logical configuration of the routers. Hence, we propose VROOM (Virtual ROuters On the Move), a new network-management primitive that avoids unnecessary changes to the logical topology by allowing (virtual) routers to freely move from one physical node to another. In addition to simplifying existing network-management tasks like planned maintenance and service deployment, VROOM can also help tackle emerging challenges such as reducing energy consumption. We present the design, implementation, and evaluation of novel migration techniques for virtual routers with either hardware or software data planes. Our evaluation shows that VROOM is transparent to routing protocols and results in no performance impact on the data traffic when a hardware-based data plane is used.", "citation": "Citations (470)", "departments": ["Princeton University", "Princeton University", "Princeton University", "AT&T Labs", "Princeton University", "Princeton University", "Princeton University", "Princeton University", "AT&T", "Princeton University"], "authors": ["Yi Wang.....http://dblp.org/pers/hd/w/Wang:Yi", "Eric Keller.....http://dblp.org/pers/hd/k/Keller:Eric", "Brian Biskeborn.....http://dblp.org/pers/hd/b/Biskeborn:Brian", "Jacobus E. van der Merwe.....http://dblp.org/pers/hd/m/Merwe:Jacobus_E=_van_der", "Jennifer Rexford.....http://dblp.org/pers/hd/r/Rexford:Jennifer"], "conf": "sigcomm", "year": "2008", "pages": 12}