{"title": "Diagnosing Wireless Packet Losses in 802.11: Separating Collision from Weak Signal.", "fields": ["link adaptation", "collie", "retransmission", "packet loss", "ranging"], "abstract": "It is well known that a packet loss in 802.11 can happen either due to collision or an insufficiently strong signal. However, discerning the exact cause of a packet loss, once it occurs, is known to be quite difficult. In this paper we take a fresh look at this problem of wireless packet loss diagnosis for 802.11-based communication and propose a promising technique called COLLIE. COLLIE performs loss diagnosis by using newly designed metrics that examine error patterns within a physical-layer  symbol  in order to expose statistical differences between collision and weak signal based losses. We implement COLLIE through custom driver-level modifications in Linux and evaluate its performance experimentally. Our results demonstrate that it has an accuracy ranging between 60-95% while allowing a false positive rate of up to 2%. We also demonstrate the use of COLLIE in subsequent link adaptations in both static and mobile wireless usage scenarios through measurements on regular laptops and the Netgear SPH101 Voice-over-WiFi phone. In these experiments, COLLIE led to throughput improvements of 20- 60% and reduced retransmission related costs by 40% depending upon the channel conditions.", "citation": "Citations (226)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Shravan K. Rayanchu.....http://dblp.org/pers/hd/r/Rayanchu:Shravan_K=", "Arunesh Mishra.....http://dblp.org/pers/hd/m/Mishra:Arunesh", "Dheeraj Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Dheeraj", "Sharad Saha.....http://dblp.org/pers/hd/s/Saha:Sharad", "Suman Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Suman"], "conf": "infocom", "year": "2008", "pages": 9}