{"title": "Notary: Hardware techniques to enhance signatures.", "fields": ["xor gate", "programmer", "memory address", "transactional memory", "bloom filter"], "abstract": "Hardware signatures have been recently proposed as an efficient mechanism to detect conflicts amongst concurrently running transactions in transactional memory systems (e.g., bulk, LogTM-SE, and SigTM). Signatures use fixed hardware to represent an unbounded number of addresses, but may lead to false conflicts (detecting a conflict when none exists). Previous work recommends that signatures be implemented with parallel Bloom filters with two or four hash functions (e.g., H 3 ). Two problems exist with current signature designs. First, H 3  implementations use many XOR gates. This increases hardware area and power overheads. Second, signature false positives can result from conflicts with signature bits set by private memory addresses that do not require isolation. This paper develops Notary, a coupling of two signature enhancements to ameliorate these problems. First, we use address entropy analysis to develop page-block-XOR (PBX) hashing and show it performs similar to H 3  at lower hardware cost. Second, we introduce a privatization interface that explicitly allows the programmer to declare shared and private heap memory allocation. Privatization reduces false conflicts arising from private memory accesses and can lead to a reduction in the signature size used. Results from custom transistor-level layouts of H 3  and PBX, along with full-system simulation of a 16-core chip-multiprocessor implementing LogTM-SE, show (a) PBX hashing performs similar to H 3  hashing while requiring up to 24% less area and 4.7% less power overhead and (b) privatization can improve execution time by up to 86% (by reducing false conflicts by up to 96%).", "citation": "Citations (76)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Luke Yen.....http://dblp.org/pers/hd/y/Yen:Luke", "Stark C. Draper.....http://dblp.org/pers/hd/d/Draper:Stark_C=", "Mark D. Hill.....http://dblp.org/pers/hd/h/Hill:Mark_D="], "conf": "micro", "year": "2008", "pages": 12}