{"title": "Performance-aware speculation control using wrong path usefulness prediction.", "fields": ["benchmark", "byte", "speculation", "fetch", "instruction pipeline"], "abstract": "Fetch gating mechanisms have been proposed to gate the processor pipeline to reduce the wasted energy consumption due to wrong-path (i.e. mis-speculated) instructions. These schemes assume that all wrong-path instructions are useless for processor performance and try to eliminate the execution of all wrong-path instructions. However, wrong-path memory references can be useful for performance by providing prefetching benefits for later correct-path operations. Therefore, eliminating wrong-path instructions without considering the usefulness of wrong-path execution can significantly reduce performance as well as increase overall energy consumption. This paper proposes a comprehensive, low-cost speculation control mechanism that takes into account the usefulness of wrong-path execution, while effectively reducing the energy consumption due to useless wrong-path instructions. One component of the mechanism is a simple, novel wrong-path usefulness predictor (WPUP) that can accurately predict whether or not wrong-path execution will be beneficial for performance. The other component is a novel branch-count based fetch gating scheme that requires very little hardware cost to detect if the processor is on the wrong path. The key idea of our speculation control mechanism is to gate the processor pipeline only if (1) the number of outstanding branches is above a dynamically-determined threshold and (2) the WPUP predicts that wrong-path execution will not be beneficial for performance. Our results show that our proposal eliminates most of the performance loss incurred by fetch gating mechanisms that assume wrong-path execution is useless, thereby both improving performance and reducing energy consumption while requiring very little (51- byte) hardware cost.", "citation": "Citations (6)", "departments": ["University of Texas at Austin", "Georgia Institute of Technology", "Microsoft", "University of Texas at Austin"], "authors": ["Chang Joo Lee.....http://dblp.org/pers/hd/l/Lee:Chang_Joo", "Hyesoon Kim.....http://dblp.org/pers/hd/k/Kim:Hyesoon", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur", "Yale N. Patt.....http://dblp.org/pers/hd/p/Patt:Yale_N="], "conf": "hpca", "year": "2008", "pages": 11}