{"title": "EXCES: External caching in energy saving storage systems.", "fields": ["false sharing", "idle", "indirection", "data consistency", "control reconfiguration"], "abstract": "Power consumption within the disk-based storage subsystem forms a substantial portion of the overall energy footprint in commodity systems. Researchers have proposed external caching on a persistent, low-power storage device, which we term external caching device (ECD), to minimize disk activity and conserve energy. While recent simulation-based studies have argued in favor of this approach, the lack of an actual system implementation has precluded answering several key questions about external caching systems. We present the design and implementation of EXCES, an external caching system that employs prefetching, caching, and buffering of disk data for reducing disk activity. EXCES addresses important questions related to external caching, including the estimation of future data popularity, I/O indirection, continuous reconfiguration of the ECD contents, and data consistency. We evaluated EXCES with both micro- and macro-benchmarks that address idle, I/O intensive, and real-world workloads. Overall system energy savings was found to lie in the modest 2-14% range, depending on the workload, in somewhat of a contrast to the higher values predicted by earlier studies. Furthermore, while the CPU and memory overheads of EXCES were well within acceptable limits, we found that flash-based external caching can substantially degrade I/O performance. We believe that external caching systems hold promise. Further improvements in ECD technology, both in terms of their power consumption and performance characteristics can help realize the full potential of such systems.", "citation": "Citations (26)", "departments": ["University of Miami", "University of Miami", "University of Miami", "University of Miami", "University of Miami"], "authors": ["Luis Useche.....http://dblp.org/pers/hd/u/Useche:Luis", "Jorge Guerra.....http://dblp.org/pers/hd/g/Guerra:Jorge", "Medha Bhadkamkar.....http://dblp.org/pers/hd/b/Bhadkamkar:Medha", "Mauricio Alarcon.....http://dblp.org/pers/hd/a/Alarcon:Mauricio", "Raju Rangaswami.....http://dblp.org/pers/hd/r/Rangaswami:Raju"], "conf": "hpca", "year": "2008", "pages": 12}