{"title": "Online multi-label active annotation: towards large-scale content-based video search.", "fields": ["active learning", "trecvid", "video tracking", "video content analysis", "annotation"], "abstract": "Existing video search engines have not taken the advantages of video content analysis and semantic understanding. Video search in academia uses semantic annotation to approach content-based indexing. We argue this is a promising direction to enable real content-based video search. However, due to the complexity of both video data and semantic concepts, existing techniques on automatic video annotation are still not able to handle large-scale video set and large-scale concept set, in terms of both annotation accuracy and computation cost. To address this problem, in this paper, we propose a scalable framework for annotation-based video search, as well as a novel approach to enable large-scale semantic concept annotation, that is, online multi-label active learning. This framework is scalable to both the video sample dimension and concept label dimension. Large-scale unlabeled video samples are assumed to arrive consecutively in batches with an initial pre-labeled training set, based on which a preliminary multi-label classifier is built. For each arrived batch, a multi-label active learning engine is applied, which automatically selects and manually annotates a set of unlabeled sample-label pairs. And then an online learner updates the original classifier by taking the newly labeled sample-label pairs into consideration. This process repeats until all data are arrived. During the process, new labels, even without any pre-labeled training samples, can be incorporated into the process anytime. Experiments on TRECVID dataset demonstrate the effectiveness and efficiency of the proposed framework.", "citation": "Citations (27)", "departments": ["Microsoft", "University of Science and Technology of China"], "authors": ["Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Guo-Jun Qi.....http://dblp.org/pers/hd/q/Qi:Guo=Jun"], "conf": "mm", "year": "2008", "pages": 10}