{"title": "A posteriori multi-probe locality sensitive hashing.", "fields": ["locality sensitive hashing", "a priori and a posteriori", "probabilistic logic", "hash table", "nearest neighbor search"], "abstract": "Efficient high-dimensional similarity search structures are essential for building scalable content-based search systems on feature-rich multimedia data. In the last decade, Locality Sensitive Hashing (LSH) has been proposed as indexing technique for approximate similarity search. Among the most recent variations of LSH, multi-probe LSH techniques have been proved to overcome the overlinear space cost drawback of common LSH. Multi-probe LSH is built on the well-known LSH technique, but it intelligently probes multiple buckets that are likely to contain query results in a hash table. Our method is inspired by previous work on probabilistic similarity search structures and improves upon recent theoretical work on multi-probe and query adaptive LSH. Whereas these methods are based on likelihood criteria that a given bucket contains query results, we define a more reliable a posteriori model taking account some prior about the queries and the searched objects. This prior knowledge allows a better quality control of the search and a more accurate selection of the most probable buckets. We implemented a nearest neighbors search based on this paradigm and performed experiments on different real visual features datasets. We show that our a posteriori scheme outperforms other multi-probe LSH while offering a better quality control. Comparisons to the basic LSH technique show that our method allows consistent improvements both in space and time efficiency.", "citation": "Citations (171)", "departments": ["French Institute for Research in Computer Science and Automation", "INA, Bry sur Marne, France"], "authors": ["Alexis Joly.....http://dblp.org/pers/hd/j/Joly:Alexis", "Olivier Buisson.....http://dblp.org/pers/hd/b/Buisson:Olivier"], "conf": "mm", "year": "2008", "pages": 10}