{"title": "An Explanation for Unexpected 802.11 Outdoor Link-level Measurement Results.", "fields": ["link level", "unicast", "homogeneous", "broadcasting", "antenna diversity"], "abstract": "This paper provides experimental evidence that \"weird'/poor outdoor link-level performance measurements may be caused by driver/card-specific antenna diversity algorithms unexpectedly supported/activated at the WLAN transmitter side. We focus our analysis on the Atheros/MADWiFi card/driver case, and we observe that the transmit antenna diversity mechanisms remain by default enabled when the available antennas are not homogeneous in terms of gain or, even worse, when only a single antenna is connected. This may cause considerable performance impairments (large frame loss ratio), in conditions frequently encountered in outdoor link deployments. The negative impact of transmit antenna diversity is not limited to the transmission of broadcast frames (where a cyclic shift between the \"two\" assumed antennas is performed), but under certain circumstances it can severely affect the delivery of unicast frames as well, and despite the fact that in this case the ACK receptions may provide a feedback about the best receiving antenna. While, as obvious, driver developers are expectedly fully aware of the existence of such mechanisms, we believe that the scientific research community has very limited awareness of the implications these mechanisms have on the measured link-level performance. Indeed, to the best of our knowledge, ours is the first research paper which explicitly raises this issue.", "citation": "Citations (27)", "departments": ["Univ. degli Stu ... r Vergata, Rome", "Univ. degli Stu ... r Vergata, Rome", "Universitdegli  ... o di Ingegneria", "Universitdegli  ... o di Ingegneria"], "authors": ["Domenico Giustiniano.....http://dblp.org/pers/hd/g/Giustiniano:Domenico", "Giuseppe Bianchi.....http://dblp.org/pers/hd/b/Bianchi_0001:Giuseppe", "Luca Scalia.....http://dblp.org/pers/hd/s/Scalia:Luca", "Ilenia Tinnirello.....http://dblp.org/pers/hd/t/Tinnirello:Ilenia"], "conf": "infocom", "year": "2008", "pages": 9}