{"title": "Capacity of Hybrid Cellular-Ad Hoc Data Networks.", "fields": ["max min fairness", "throughput", "cellular network", "reuse", "telecommunications link"], "abstract": "In this paper, towards improving spatial reuse in a cellular network, we consider augmenting it with wireless ad hoc connectivity. The coverage area of each base-station is reduced and the users that are within the area relay traffic to nodes outside the area; these users further relay data to more distant users within the cell. The resulting network is referred to as a hybrid network. While this approach can result in shorter range higher-rate links and improved spatial reuse which, together favor a capacity increase, it relies on multi-hop forwarding which is detrimental to the overall capacity. Our objective in this work is to evaluate the impact of these conflicting factors on the capacity of the hybrid network and determine if this capacity is higher than that of the original cellular network. We formally define the capacity of the network as the maximum possible downlink throughput under the conditions of max-min fairness. We analytically compute the capacity of a two-dimensional hybrid network with  regular  placements of base-stations (BSs) and users. We validate our analytical results via simulations. Our studies demonstrate that capacity improvements are possible in certain parametric regimes in which the penalty due to multi-hop relaying does not outweigh the gains due to spatial reuse and shorter higher-rate links. Our simulations also demonstrate that if the users are placed randomly, the behavioral results are similar to that with regular placements of users.", "citation": "Citations (64)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "authors": ["Lap Kong Law.....http://dblp.org/pers/hd/l/Law:Lap_Kong", "Srikanth V. Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Srikanth_V=", "Michalis Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Michalis"], "conf": "infocom", "year": "2008", "pages": 9}