{"title": "Sampling cube: a framework for statistical olap over sampling data.", "fields": ["online analytical processing", "clustering high dimensional data", "cluster sampling", "sample size determination", "oversampling"], "abstract": "Sampling is a popular method of data collection when it is impossible or too costly to reach the entire population. For example, television show ratings in the United States are gathered from a sample of roughly 5,000 households. To use the results effectively, the samples are further partitioned in a multidimensional space based on multiple attribute values. This naturally leads to the desirability of OLAP (Online Analytical Processing) over sampling data. However, unlike traditional data, sampling data is inherently uncertain, i.e., not representing the full data in the population. Thus, it is desirable to return not only query results but also the confidence intervals indicating the reliability of the results. Moreover, a certain segment in a multidimensional space may contain none or too few samples. This requires some additional analysis to return trustable results.   In this paper we propose a  Sampling Cube  framework, which efficiently calculates confidence intervals for any multidimensional query and uses the OLAP structure to group similar segments to increase sampling size when needed. Further, to handle high dimensional data, a  Sampling Cube Shell  method is proposed to effectively reduce the storage requirement while still preserving query result quality.", "citation": "Citations (26)", "year": "2008", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "sigmod", "authors": ["Xiaolei Li.....http://dblp.org/pers/hd/l/Li:Xiaolei", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Zhijun Yin.....http://dblp.org/pers/hd/y/Yin:Zhijun", "Jae-Gil Lee.....http://dblp.org/pers/hd/l/Lee_0001:Jae=Gil", "Yizhou Sun.....http://dblp.org/pers/hd/s/Sun:Yizhou"], "pages": 12}