{"title": "XRPC: distributed XQuery and update processing with heterogeneous XQuery engines.", "fields": ["distributed transaction", "ajax", "web application", "xquery update facility", "xquery", "communications protocol", "remote procedure call", "soap"], "abstract": "We demonstrate XRPC, a minimal XQuery extension that enables distributed querying between heterogeneous XQuery engines. The XRPC language extension enhances the existing concept of XQuery functions with the Remote Procedure Call (RPC) paradigm. XRPC is orthogonal to all XQuery features, including the XQuery Update Facility (XQUF). Note that executing xquf updating functions over XRPC leads to the phenomenon of distributed transactions. XRPC achieves heterogeneity by an open SOAP-based network protocol, that can be implemented by any engine, and an XRPC Wrapper that allows even XRPC-oblivious XQuery engines to handle XRPC requests efficiently. XRPC is fully implemented in the open-source MonetDB/XQuery engine, and is demonstrated here to co-operate with Saxon, Galax and X-Hive through the XRPC wrapper.   This demonstration will focus on the following features of XRPC: ( i ) glue-less interaction between AJAX style webbased applications with XQuery databases thanks to the SOAP-based nature of the XRPC network protocol, ( ii ) the efficiency of XRPC communication also for voluminous interserver communication thanks to the  Bulk RPC  feature that optimizes network communication and exposes set-at-a-time opportunities to the underlying XQuery engines, ( iii ) the interoperability between  different  XQuery engines that can handle both distributed transactions (both read-only requests and updates) ( iv ) support and performance trade-offs of two different isolation levels for distributed transactions among different XQuery engines.", "citation": "Not cited", "year": "2008", "departments": ["CWI, Amsterdam, Netherlands", "CWI, Amsterdam, Netherlands"], "conf": "sigmod", "authors": ["Ying Zhang.....http://dblp.org/pers/hd/z/Zhang:Ying", "Peter A. Boncz.....http://dblp.org/pers/hd/b/Boncz:Peter_A="], "pages": 6}