{"title": "Task Scheduling and Lightpath Establishment in Optical Grids.", "fields": ["heuristics", "application software", "directed acyclic graph", "grid computing", "bandwidth allocation", "grid", "optimization problem", "telecommunications network"], "abstract": "Data-intensive Grid applications require huge data transferring between multiple geographically separated computing nodes where computing tasks are executed. For a future WDM network to efficiently support this type of emerging applications, traditional approaches to establishing lightpaths between given source destination pairs are not sufficient because a computing task may be executed on any one of several computing nodes having the necessary resources. Therefore, lightpath establishment has to be considered jointly with task scheduling to achieve best performance. In this paper, we study the optimization problems of jointly scheduling both computing resources and network resources. We first present the formulation of two optimization problems with the objectives being the minimization of the completion time of a job and minimization of the resource usage/cost to satisfy a job with a deadline respectively. When the objective is to minimize the completion time, we devise an optimal algorithm for a special type of applications. Furthermore, we propose efficient heuristics to deal with general applications with either optimization objective and demonstrate their good performances via simulation.", "citation": "Citations (32)", "departments": ["University at Buffalo", "University at Buffalo", "University at Buffalo", "Princeton University", "Shanghai Jiao Tong University", "State University of New York System", "State University of New York System", "State University of New York System"], "authors": ["Xin Liu.....http://dblp.org/pers/hd/l/Liu:Xin", "Wei Wei.....http://dblp.org/pers/hd/w/Wei:Wei", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming", "Ting Wang.....http://dblp.org/pers/hd/w/Wang:Ting", "Weisheng Hu.....http://dblp.org/pers/hd/h/Hu:Weisheng", "Wei Guo.....http://dblp.org/pers/hd/g/Guo_0003:Wei", "Min-You Wu.....http://dblp.org/pers/hd/w/Wu:Min=You"], "conf": "infocom", "year": "2008", "pages": 9}