{"title": "Runtime Semantic Query Optimization for Event Stream Processing.", "fields": ["event condition action", "semantic query", "sargable", "event stream processing", "complex event processing"], "abstract": "Detecting complex patterns in event streams, i.e., complex event processing (CEP), has become increasingly important for modern enterprises to react quickly to critical situations. In many practical cases business events are generated based on pre-defined business logics. Hence constraints, such as occurrence and order constraints, often hold among events. Reasoning using these known constraints enables us to predict the non-occurrences of certain future events, thereby helping us to identify and then terminate the long running query processes that are guaranteed to not lead to successful matches. In this work, we focus on exploiting event constraints to optimize CEP over large volumes of business transaction streams. Since the optimization opportunities arise at runtime, we develop a runtime query unsatisfiability (RunSAT) checking technique that detects optimal points for terminating query evaluation. To assure efficiency of RunSAT checking, we propose mechanisms to precompute the query failure conditions to be checked at runtime. This guarantees a constant-time RunSAT reasoning cost, making our technique highly scalable. We realize our optimal query termination strategies by augmenting the query with Event-Condition-Action rules encoding the pre-computed failure conditions. This results in an event processing solution compatible with state-of-the-art CEP architectures. Extensive experimental results demonstrate that significant performance gains are achieved, while the optimization overhead is small.", "citation": "Citations (159)", "departments": ["Worcester Polytechnic Institute", "Worcester Polyt ... , Worcester, MA", "NEC Laboratorie ... sv.nec-labs.com", "NEC Laboratorie ... sv.nec-labs.com", "NEC Laboratorie ... sv.nec-labs.com"], "authors": ["Luping Ding.....http://dblp.org/pers/hd/d/Ding:Luping", "Songting Chen.....http://dblp.org/pers/hd/c/Chen:Songting", "Elke A. Rundensteiner.....http://dblp.org/pers/hd/r/Rundensteiner:Elke_A=", "Jun'ichi Tatemura.....http://dblp.org/pers/hd/t/Tatemura:Jun=ichi", "Wang-Pin Hsiung.....http://dblp.org/pers/hd/h/Hsiung:Wang=Pin", "K. Selçuk Candan.....http://dblp.org/pers/hd/c/Candan:K=_Sel=ccedil=uk"], "conf": "icde", "year": "2008", "pages": 10}