{"title": "Mobile Data Gathering with Space-Division Multiple Access in Wireless Sensor Networks.", "fields": ["optimization problem", "heuristic", "space division multiple access", "base station", "mobile broadband"], "abstract": "Recent years have witnessed a surge of interest in efficient data gathering schemes in wireless sensor networks (WSNs). In this paper, we address this important issue in WSNs by adopting mobility and space-division multiple access (SDMA) technique to optimize system performance. Specifically, a mobile data collector, for convenience, called SenCar in this paper, is deployed in a WSN. It works like a mobile base station and polls each sensor while traversing its transmission range. Each sensor directly sends data to the SenCar without any relay so that the lifetime of sensors can be prolonged. We also consider applying SDMA technique to data gathering by equipping the SenCar with two antennas. With SDMA, two distinct compatible sensors may successfully make concurrent data uploading to the SenCar. Intuitively, if the SenCar can always simultaneously communicate with two compatible sensors, data uploading time can be cut into half in the ideal case. We focus on the problem of minimizing the total time of a data gathering tour which consists of two parts: data uploading time and moving time. To better enjoy the benefit of SDMA, the SenCar may have to visit some specific locations where more sensors are compatible, which may adversely prolong the moving path. Hence, an optimum solution should be a tradeoff between the shortest moving path and full utilization of SDMA. We refer to this optimization problem as mobile data gathering problem with SDMA, or MDG-SDMA for short. We formalize the MDG-SDMA problem into an integer program (IP) and then propose three heuristic algorithms that provide practically good solutions to the problem. Our simulation results demonstrate that the proposed algorithms can greatly reduce the total data gathering time compared to the non-SDMA algorithm with only minimum overhead.", "citation": "Citations (72)", "departments": ["State University of New York System", "State University of New York System", "State University of New York System"], "authors": ["Miao Zhao.....http://dblp.org/pers/hd/z/Zhao:Miao", "Ming Ma.....http://dblp.org/pers/hd/m/Ma:Ming", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2008", "pages": 9}