{"title": "ContextSeer: context search and recommendation at query time for shared consumer photos.", "fields": ["pooling", "representativeness heuristic", "semantic search", "trecvid", "visual word"], "abstract": "The advent of media-sharing sites like Flickr has drastically increased the volume of community-contributed multimedia resources on the web. However, due to their magnitudes, these collections are increasingly difficult to understand, search and navigate. To tackle these issues, a novel search system, ContextSeer, is developed to improve search quality (by reranking) and recommend supplementary information (i.e., search-related tags and canonical images) by leveraging the rich context cues, including the visual content, high-level concept scores, time and location metadata. First, we propose an ordinal reranking algorithm to enhance the semantic coherence of text-based search result by mining contextual patterns in an unsupervised fashion. A novel feature selection method, wc-tf-idf is also developed to select informative context cues. Second, to represent the diversity of search result, we propose an efficient algorithm cannoG to select multiple canonical images without clustering. Finally, ContextSeer enhances the search experience by further recommending relevant tags. Besides being effective and unsupervised, the proposed methods are efficient and can be finished at query time, which is vital for practical online applications. To evaluate ContextSeer, we have collected 0.5 million consumer photos from Flickr and manually annotated a number of queries by pooling to form a new benchmark, Flickr550. Ordinal reranking achieves significant performance gains both in Flcikr550 and TRECVID search benchmarks. Through a subjective test, cannoG expresses its representativeness and excellence for recommending multiple canonical images.", "citation": "Citations (73)", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University"], "authors": ["Yi-Hsuan Yang.....http://dblp.org/pers/hd/y/Yang:Yi=Hsuan", "Po Tun Wu.....http://dblp.org/pers/hd/w/Wu:Po_Tun", "Ching-Wei Lee.....http://dblp.org/pers/hd/l/Lee:Ching=Wei", "Kuan Hung Lin.....http://dblp.org/pers/hd/l/Lin:Kuan_Hung", "Winston H. Hsu.....http://dblp.org/pers/hd/h/Hsu:Winston_H=", "Homer H. Chen.....http://dblp.org/pers/hd/c/Chen:Homer_H="], "conf": "mm", "year": "2008", "pages": 10}