{"title": "Outlier-robust clustering using independent components.", "fields": ["k medians clustering", "complete linkage clustering", "determining the number of clusters in a data set", "cure data clustering algorithm", "single linkage clustering"], "abstract": "How can we efficiently find a clustering, i.e. a concise description of the cluster structure, of a given data set which contains an unknown number of clusters of different shape and distribution and is contaminated by noise? Most existing clustering methods are restricted to the Gaussian cluster model and are very sensitive to noise. If the cluster content follows a non-Gaussian distribution and/or the data set contains a few outliers belonging to no cluster, then the computed data distribution does not match well the true data distribution, or an unnaturally high number of clusters is required to represent the true data distribution of the data set. In this paper we propose OCI (Outlier-robust Clustering using Independent Components), a clustering method which overcomes these problems by (1) applying the exponential power distribution (EPD) as cluster model which is a generalization of Gaussian, uniform, Laplacian and many other distribution functions, (2) applying the Independent Component Analysis (ICA) for both determining the main directions inside a cluster as well as finding split planes in a top-down clustering approach, and (3) defining an efficient and effective filter for outliers, based on EPD and ICA. Our method is parameter-free and as a top-down clustering approach very efficient. An extensive experimental evaluation shows both the accuracy of the obtained clustering result as well as the efficiency of our method.", "citation": "Citations (60)", "year": "2008", "departments": ["Ludwig Maximilian University of Munich", "Carnegie Mellon University", "Technische Universität München"], "conf": "sigmod", "authors": ["Christian Böhm.....http://dblp.org/pers/hd/b/B=ouml=hm:Christian", "Christos Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Christos", "Claudia Plant.....http://dblp.org/pers/hd/p/Plant:Claudia"], "pages": 14}