{"title": "Quasi-Output-Buffered Switches.", "fields": ["crossover switch", "load balanced switch", "banyan switch", "head of line blocking", "analogue switch", "number one crossbar switching system"], "abstract": "It is well known that output-buffered switches have better performance than other switch architectures. However, output buffered switches also suffer from the notorious scalability problem, and direct constructions of large output-buffered switches are difficult. In this paper, we study the problem of constructing scalable switches that have comparable performance (in the sense of 100 percent throughput and first-in first-out (FIFO) delivery of packets from the same flow) to output-buffered switches. For this, we propose a new concept, called quasi-output-buffered switch. Like an output-buffered switch, a quasi-output-buffered switch is a deterministic switch that achieves 100 percent throughput and delivers packets from the same flow in the FIFO order. Using the three stage Clos network, we show that one can recursively construct a larger quasi-output-buffered switch with a set of smaller quasi output-buffered switches. By recursively expanding the three-stage Clos network, we obtain a quasi-output-buffered switch with only 2 × 2 switches. Such a switch is called a packet-pair switch in this paper as it always transmits packets in pairs. By computer simulations, we show that packet-pair switches have better delay performance than most load-balanced switches with comparable construction complexity.", "citation": "Not cited", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Cheng-Shang Chang.....http://dblp.org/pers/hd/c/Chang:Cheng=Shang", "Jay Cheng.....http://dblp.org/pers/hd/c/Cheng:Jay", "Duan-Shin Lee.....http://dblp.org/pers/hd/l/Lee:Duan=Shin", "Chi-Feung Wu.....http://dblp.org/pers/hd/w/Wu:Chi=Feung"], "conf": "infocom", "year": "2008", "pages": 5}