{"title": "Automatic data movement and computation mapping for multi-level parallel architectures with explicitly managed memories.", "fields": ["code generation", "data access", "optimizing compiler", "cuda", "scratchpad memory"], "abstract": "Several parallel architectures such as GPUs and the Cell processor have fast explicitly managed on-chip memories, in addition to slow off-chip memory. They also have very high computational power with multiple levels of parallelism. A significant challenge in programming these architectures is to effectively exploit the parallelism available in the architecture and manage the fast memories to maximize performance.   In this paper we develop an approach to effective automatic data management for on-chip memories, including creation of buffers in on-chip (local) memories for holding portions of data accessed in a computational block, automatic determination of array access functions of local buffer references, and generation of code that moves data between slow off-chip memory and fast local memories. We also address the problem of mapping computation in regular programs to multi-level parallel architectures using a multi-level tiling approach, and study the impact of on-chip memory availability on the selection of tile sizes at various levels. Experimental results on a GPU demonstrate the effectiveness of the proposed approach.", "citation": "Citations (148)", "year": "2008", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Louisiana State University", "Ohio State University"], "conf": "ppopp", "authors": ["Muthu Manikandan Baskaran.....http://dblp.org/pers/hd/b/Baskaran:Muthu_Manikandan", "Uday Bondhugula.....http://dblp.org/pers/hd/b/Bondhugula:Uday", "Sriram Krishnamoorthy.....http://dblp.org/pers/hd/k/Krishnamoorthy:Sriram", "J. Ramanujam.....http://dblp.org/pers/hd/r/Ramanujam:J=", "Atanas Rountev.....http://dblp.org/pers/hd/r/Rountev:Atanas", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P="], "pages": 10}