{"title": "Bounds on the Benefit of Network Coding: Throughput and Energy Saving in Wireless Networks.", "fields": ["unicast", "throughput", "pi", "linear network coding", "channel capacity"], "abstract": "In this paper we establish fundamental limitations to the benefit of network coding in terms of energy and throughput in multihop wireless networks. Thereby we adopt two well accepted scenarios in the field: single multicast session and multiple unicast sessions. Most of our results apply to arbitrary wireless network and are, in particular, not asymptotic in kind. In terms of throughput and energy saving we prove that the gain of network coding of a single multicast session is at most a constant factor. Also, we present a lower bound on the expected number of transmissions of multiple unicast sessions under an arbitrary network coding. We identify scenarios for which the network coding gain for energy saving becomes surprisingly close to 1, in some cases even exactly 1, corresponding to no benefit at all. Interestingly, we prove that the gain of network coding in terms of transport capacity is bounded by a constant factor pi in any arbitrary wireless network and for all traditional channel models. This shows that the traditional bounds on the transport capacity [1]-[4] do not change more than constant factor pi if we employ network coding. As a corollary, we find that the gain of network coding on the throughput of large scale homogeneous wireless networks is asymptotically bounded by a constant. Note that our result is more general than the previous work [5] and it is obtained by a different technique. In conclusion, we show that in contrast to wired networks, the network coding gain in wireless networks is constraint by fundamental limitations.", "citation": "Citations (77)", "departments": ["Rice University"], "authors": ["Alireza Keshavarz-Haddad.....http://dblp.org/pers/hd/k/Keshavarz=Haddad:Alireza", "Rudolf H. Riedi.....http://dblp.org/pers/hd/r/Riedi:Rudolf_H="], "conf": "infocom", "year": "2008", "pages": 9}