{"title": "Distance Education System for Teaching Manual Skills in Endoscopic Paranasal Sinus Surgery Using \"HyperMirror\" Telecommunication Interface.", "fields": ["paranasal sinuses", "distance education", "maxillary sinus", "user interface", "visualization"], "abstract": "We have developed a distance education system for developing skills in endoscopic paranasal sinus surgery, to enable efficient remote training of novices in manual skills such as their standing position and posture, and the insertion angle/depth and holding of surgical instruments. The system uses a precise model of human paranasal sinuses and the \"HyperMirror\" (HM) telecommunication interface. HM is a virtual mirror allowing clear visualization of differences in manual operation between the trainee and remote expert. This paper outlines the proposed system and describes remote training experiments between two locations 200 miles apart. In the experiments, two expert surgeons trained 17 novices for 40 to 60 min on probing of the nasofrontal duct and aspiration of the maxillary sinus, and subjectively evaluated their manual skills. The results showed that most of the novices improved their manual skills and were able to complete each procedure.", "citation": "Citations (12)", "departments": ["National Institute of Advanced Industrial Science and Technology", "National Institute of Advanced Industrial Science and Technology", "National Institute of Advanced Industrial Science and Technology", "National Institute of Advanced Industrial Science and Technology", "National Institute of Advanced Industrial Science and Technology"], "authors": ["Toru Kumagai.....http://dblp.org/pers/hd/k/Kumagai:Toru", "Juli Yamashita.....http://dblp.org/pers/hd/y/Yamashita:Juli", "Osamu Morikawa.....http://dblp.org/pers/hd/m/Morikawa:Osamu", "Kazunori Yokoyama.....http://dblp.org/pers/hd/y/Yokoyama:Kazunori", "Shin'ichi Fujimaki.....http://dblp.org/pers/hd/f/Fujimaki:Shin=ichi", "Taku Konishi.....http://dblp.org/pers/hd/k/Konishi:Taku", "Hiroshi Ishimasa.....http://dblp.org/pers/hd/i/Ishimasa:Hiroshi", "Hideyuki Murata.....http://dblp.org/pers/hd/m/Murata:Hideyuki", "Koichi Tomoda.....http://dblp.org/pers/hd/t/Tomoda:Koichi"], "conf": "vr", "year": "2008", "pages": 4}