{"title": "Active post-refined multimodality video semantic concept detection with tensor representation.", "fields": ["data point", "dimensionality reduction", "submanifold", "video tracking", "modalities"], "abstract": "In this paper, we resolve the problem of multi-modality video representation and semantic concept detection. Interaction and integration of multi-modality media types such as visual, audio and textual data in video are essential to video semantic analysis. Traditionally, videos are represented as vectors in the Euclidean space. Many learning algorithms are then taken to these vectors in a high dimensional space for dimension reduction, classification, clustering and so on. However, the multiple modalities in video not only have their own properties, but also have correlations among them; whereas the simple vector representation weakens the power of these relatively independent modalities and even ignores their relations to some extent. In this paper, we introduce a higher-order tensor framework for video analysis, in which we represent image, video and text three modalities in video shots as data points by the 3rd-order tensor called tensorshots. We propose a novel dimension reduction method that explicitly considers the manifold structure of the tensor space from multimodal media data which is temporal associated co-occurrence and then detect video semantic concepts through powerful classifiers which take tensor as input. Our algorithm preserves the intrinsic structure of the submanifold where tensorshots are sampled, and is also able to map out-of-sample data points directly. Moreover we apply an active learning based contextual and temporal post-refining strategy to enhance detection accuracy. Experiment results show that our method improves the performance of video semantic concept detection.", "citation": "Citations (16)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University"], "authors": ["Yanan Liu.....http://dblp.org/pers/hd/l/Liu:Yanan", "Fei Wu.....http://dblp.org/pers/hd/w/Wu_0001:Fei", "Yueting Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yueting", "Jun Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Jun"], "conf": "mm", "year": "2008", "pages": 10}