{"title": "Locality condensation: a new dimensionality reduction method for image retrieval.", "fields": ["subspace topology", "dimensionality reduction", "curse of dimensionality", "hypersphere", "nearest neighbor search"], "abstract": "Content-based image similarity search plays a key role in multimedia retrieval. Each image is usually represented as a point in a high-dimensional feature space. The key challenge of searching similar images from a large database is the high computational overhead due to the \"curse of dimensionality\". Reducing the dimensionality is an important means to tackle the problem. In this paper, we study dimensionality reduction for top-k image retrieval. Intuitively, an effective dimensionality reduction method should not only preserve the close locations of similar images (or points), but also separate those dissimilar ones far apart in the reduced subspace. Existing dimensionality reduction methods mainly focused on the former. We propose a novel idea called Locality Condensation (LC) to not only preserve localities determined by neighborhood information and their global similarity relationship, but also ensure that different localities will not invade each other in the low-dimensional subspace. To generate non-overlapping localities in the subspace, LC first performs an elliptical condensation, which condenses each locality with an elliptical shape into a more compact hypersphere to enlarge the margins among different localities and estimate the projection in the subspace for overlap analysis. Through a convex optimization, LC further performs a scaling condensation on the obtained hyperspheres based on their projections in the subspace with minimal condensation degrees. By condensing the localities effectively, the potential overlaps among different localities in the low-dimensional subspace are prevented. Consequently, for similarity search in the subspace, the number of false hits (i.e., distant points that are falsely retrieved) will be reduced. Extensive experimental comparisons with existing methods demonstrate the superiority of our proposal.", "citation": "Citations (11)", "departments": ["University of Queensland", "University of Queensland", "University of Queensland", "Open University", "University of Queensland"], "authors": ["Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Jie Shao.....http://dblp.org/pers/hd/s/Shao:Jie", "Stefan M. Rüger.....http://dblp.org/pers/hd/r/R=uuml=ger:Stefan_M=", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "mm", "year": "2008", "pages": 10}