{"title": "System level analysis of fast, per-core DVFS using on-chip switching regulators.", "fields": ["frequency scaling", "regulator", "voltage regulator", "multithreading", "overhead"], "abstract": "Portable, embedded systems place ever-increasing demands on high-performance, low-power microprocessor design. Dynamic voltage and frequency scaling (DVFS) is a well-known technique to reduce energy in digital systems, but the effectiveness of DVFS is hampered by slow voltage transitions that occur on the order of tens of microseconds. In addition, the recent trend towards chip-multiprocessors (CMP) executing multi-threaded workloads with heterogeneous behavior motivates the need for per-core DVFS control mechanisms. Voltage regulators that are integrated onto the same chip as the microprocessor core provide the benefit of both nanosecond-scale voltage switching and per-core voltage control. We show that these characteristics provide significant energy-saving opportunities compared to traditional off-chip regulators. However, the implementation of on-chip regulators presents many challenges including regulator efficiency and output voltage transient characteristics, which are significantly impacted by the system-level application of the regulator. In this paper, we describe and model these costs, and perform a comprehensive analysis of a CMP system with on-chip integrated regulators. We conclude that on-chip regulators can significantly improve DVFS effectiveness and lead to overall system energy savings in a CMP, but architects must carefully account for overheads and costs when designing next-generation DVFS systems and algorithms.", "citation": "Citations (737)", "departments": ["Harvard University", "Harvard University", "Harvard University", "Harvard University"], "authors": ["Wonyoung Kim.....http://dblp.org/pers/hd/k/Kim:Wonyoung", "Meeta Sharma Gupta.....http://dblp.org/pers/hd/g/Gupta:Meeta_Sharma", "Gu-Yeon Wei.....http://dblp.org/pers/hd/w/Wei:Gu=Yeon", "David M. Brooks.....http://dblp.org/pers/hd/b/Brooks:David_M="], "conf": "hpca", "year": "2008", "pages": 12}