{"title": "TODO or to bug: exploring how task annotations play a role in the work practices of software developers.", "fields": ["software development", "software development process", "team software process", "personal software process", "software documentation"], "abstract": "Software development is a highly collaborative activity that requires teams of developers to continually manage and coordinate their programming tasks. In this paper, we describe an empirical study that explored how task annotations embedded within the source code play a role in how software developers manage personal and team tasks. We present findings gathered by combining results from a survey of professional software developers, an analysis of code from open source projects, and interviews with software developers. Our findings help us describe how task annotations can be used to support a variety of activities fundamental to articulation work within software development. We describe how task management is negotiated between the more formal issue tracking systems and the informal annotations that programmers write within their source code. We report that annotations have different meanings and are dependent on individual, team and community use. We also present a number of issues related to managing annotations, which may have negative implications for maintenance. We conclude with insights into how these findings could be used to improve tool support and software process.", "citation": "Citations (98)", "departments": ["University of Victoria", "University of Victoria", "University of Victoria", "University of Victoria", "National Research Council"], "authors": ["Margaret-Anne D. Storey.....http://dblp.org/pers/hd/s/Storey:Margaret=Anne_D=", "Jody Ryall.....http://dblp.org/pers/hd/r/Ryall:Jody", "R. Ian Bull.....http://dblp.org/pers/hd/b/Bull:R=_Ian", "Del Myers.....http://dblp.org/pers/hd/m/Myers:Del", "Janice Singer.....http://dblp.org/pers/hd/s/Singer:Janice"], "conf": "icse", "year": "2008", "pages": 10}