{"title": "Combination of audio and lyrics features for genre classification in digital audio collections.", "fields": ["digital audio", "rhyme", "lyrics", "words per minute", "modalities"], "abstract": "In many areas multimedia technology has made its way into mainstream. In the case of digital audio this is manifested in numerous online music stores having turned into profitable businesses. The widespread user adaption of digital audio both on home computers and mobile players show the size of this market. Thus, ways to automatically process and handle the growing size of private and commercial collections become increasingly important; along goes a need to make music interpretable by computers. The most obvious representation of audio files is their sound - there are, however, more ways of describing a song, for instance its lyrics, which describe songs in terms of content words. Lyrics of music may be orthogonal to its sound, and differ greatly from other texts regarding their (rhyme) structure. Consequently, the exploitation of these properties has potential for typical music information retrieval tasks such as musical genre classification; so far, there is a lack of means to efficiently combine these modalities. In this paper, we present findings from investigating advanced lyrics features such as the frequency of certain rhyme patterns, several parts-of-speech features, and statistic features such as words per minute (WPM). We further analyse in how far a combination of these features with existing acoustic feature sets can be exploited for genre classification and provide experiments on two test collections.", "citation": "Citations (52)", "departments": ["Vienna University of Technology", "Norwegian University of Science and Technology", "Vienna University of Technology"], "authors": ["Rudolf Mayer.....http://dblp.org/pers/hd/m/Mayer:Rudolf", "Robert Neumayer.....http://dblp.org/pers/hd/n/Neumayer:Robert", "Andreas Rauber.....http://dblp.org/pers/hd/r/Rauber:Andreas"], "conf": "mm", "year": "2008", "pages": 10}