{"title": "Efficient Two Party and Multi Party Computation Against Covert Adversaries.", "fields": ["secure two party computation", "adversary model", "cryptographic primitive", "divide and choose", "security parameter"], "abstract": "Recently, Aumann and Lindell introduced a new realistic security model for secure computation, namely, security against covert adversaries. The main motivation was to obtain secure computation protocols which are efficient enough to be usable in practice. Aumann and Lindell presented an efficient two party computation protocol secure against covert adversaries. They were able to utilize cut and choose techniques rather than relying on expensive zero knowledge proofs.\n\nIn this paper, we design an efficient multi-party computation protocol in the covert adversary model which remains secure even if a majority of the parties are dishonest. We also substantially improve the two-party protocol of Aumann and Lindell. Our protocols avoid general NP-reductions and only make a black box use of efficiently implementable cryptographic primitives. Our two-party protocol is constant-round while the multi-party one requires a logarithmic (in number of parties) number of rounds of interaction between the parties. Our protocols are secure as per the standard simulation-based definitions of security.\n\nAlthough our main focus is on designing efficient protocols in the covert adversary model, the techniques used in our two party case directly generalize to improve the efficiency of two party computation protocols secure against standard malicious adversaries.", "citation": "Citations (90)", "year": "2008", "departments": ["University of California, Los Angeles", "University of California, Davis", "Department of C ... r Science, PSU"], "conf": "eurocrypt", "authors": ["Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Payman Mohassel.....http://dblp.org/pers/hd/m/Mohassel:Payman", "Adam D. Smith.....http://dblp.org/pers/hd/s/Smith:Adam_D="], "pages": 18}