{"title": "Fast and Distributed Computation of Schedules in Wireless Networks.", "fields": ["approximation algorithm", "throughput", "small number", "distributed algorithm", "schedule"], "abstract": "In a wireless network with  node   exclusive   spectrum   sharing , two popular schedules are maximum weight matching (MWM) schedule and maximum size matching (MSM) schedule. The former has been proved to be throughput optimal and has superior delay properties, and the latter schedules as many links, with packets to transmit, as possible. However, it is challenging to design algorithms for computing these schedules that (i) are distributed, (i.e., only local message exchanges between neighboring nodes are permitted) (ii) have low running times (iii) exchanges a small number of messages. In this paper, we develop algorithms that satisfy these properties and also provide good approximations to MWM and MSM schedules. We also note that constant approximation to MWM leads to improved delay properties. We refer to a round as a length of time over which every node in the network can make at most one message-transmission attempt. We propose distributed algorithms for computing (i) 1/2 - epsi e approximation to MWM schedule in O(log(1/epsi) log 2  n) rounds, and (ii) 2/3 - epsi approximation to MSM schedule in O((1/epsi) log 2  n) rounds, where n is the network size. Simulation results with a popular model for wireless ad-hoc networks demonstrate that (i) our algorithms perform within 85% - 95% of the optimal in many scenarios, and (ii) the time-complexity of the algorithms can be reduced considerably in practice. The number of message transmissions for both our algorithms scale as O(n log 2  n). In summary, ours is the first work to (i) provide half (two-third) approximate distribute algorithms for computing MWM (MSM) schedule with logarithmic time- complexity and quasi-linear message exchanges (ii) demonstrate that the algorithms are close to optimal for realistic topologies.", "citation": "Citations (2)", "departments": ["Bell Labs", "Stanford University", "Stanford University"], "authors": ["Supratim Deb.....http://dblp.org/pers/hd/d/Deb:Supratim", "Karan Mangla.....http://dblp.org/pers/hd/m/Mangla:Karan", "K. V. M. Naidu.....http://dblp.org/pers/hd/n/Naidu:K=_V=_M="], "conf": "infocom", "year": "2008", "pages": 9}