{"title": "Optimization principles and application performance evaluation of a multithreaded GPU using CUDA.", "fields": ["memory bandwidth", "multithreading", "cuda pinned memory", "cuda", "speedup"], "abstract": "GPUs have recently attracted the attention of many application developers as commodity data-parallel coprocessors. The newest generations of GPU architecture provide easier programmability and increased generality while maintaining the tremendous memory bandwidth and computational power of traditional GPUs. This opportunity should redirect efforts in GPGPU research from ad hoc porting of applications to establishing principles and strategies that allow efficient mapping of computation to graphics hardware. In this work we discuss the GeForce 8800 GTX processor's organization, features, and generalized optimization strategies. Key to performance on this platform is using massive multithreading to utilize the large number of cores and hide global memory latency. To achieve this, developers face the challenge of striking the right balance between each thread's resource usage and the number of simultaneously active threads. The resources to manage include the number of registers and the amount of on-chip memory used per thread, number of threads per multiprocessor, and global memory bandwidth. We also obtain increased performance by reordering accesses to off-chip memory to combine requests to the same or contiguous memory locations and apply classical optimizations to reduce the number of executed operations. We apply these strategies across a variety of applications and domains and achieve between a 10.5X to 457X speedup in kernel codes and between 1.16X to 431X total application speedup.", "citation": "Citations (1,061)", "year": "2008", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Nvidia"], "conf": "ppopp", "authors": ["Shane Ryoo.....http://dblp.org/pers/hd/r/Ryoo:Shane", "Christopher I. Rodrigues.....http://dblp.org/pers/hd/r/Rodrigues:Christopher_I=", "Sara S. Baghsorkhi.....http://dblp.org/pers/hd/b/Baghsorkhi:Sara_S=", "Sam S. Stone.....http://dblp.org/pers/hd/s/Stone:Sam_S=", "David Blair Kirk.....http://dblp.org/pers/hd/k/Kirk:David_Blair", "Wen-mei W. Hwu.....http://dblp.org/pers/hd/h/Hwu:Wen=mei_W="], "pages": 10}