{"title": "AutoMOTGen: Automatic Model Oriented Test Generator for Embedded Control Systems.", "fields": ["net framework", "test suite", "test data generation", "test data", "stateflow"], "abstract": "We present AutoMOTGen, a tool for automatic test case generation (ATG) from MATLAB Simulink/Stateflow (SL/SF) models [6] for testing automotive controllers. Our methodology is based on model checking [2]. The main highlights of the tool are:    1 Enhanced coverage of the model elements as well as high-level requirements.\n   1 A modular design for  plug-and-play of different model checkers, test data generators and coverage analysis tools for enhancing the test suite quality.\n   1 Implements sampling time abstraction to generate tests with  lesser number of (discrete) steps in the intermediate model.\n   1 Implements coverage dependent instrumentation of the model for the structural coverage criteria.\n   1 Capability to handle SL/SF blocks commonly used in automotive controllers (including blocks such as integrator, delay, multiplication/division, look-up tables, triggered subsystems and hierarchical and parallel charts).\n  \n\nThe current implementation of AutoMOTGen uses SAL [8] as an intermediate representation and uses associated tools such as  sal-atg ,  sal-bmc and  sal-smc for generation of test data and proving the unreachability of some of the coverage goals. AutoMOTGen is implemented in Java and C++ (.NET framework) and uses MATLAB scripting language for extracting the relevant information from SL/SF models required for the purpose of test generation.", "citation": "Citations (31)", "year": "2008", "departments": ["General Motors", "General Motors", "General Motors", "General Motors", "General Motors"], "conf": "cav", "authors": ["Ambar A. Gadkari.....http://dblp.org/pers/hd/g/Gadkari:Ambar_A=", "Anand Yeolekar.....http://dblp.org/pers/hd/y/Yeolekar:Anand", "J. Suresh.....http://dblp.org/pers/hd/s/Suresh:J=", "S. Ramesh.....http://dblp.org/pers/hd/r/Ramesh:S=", "Swarup Mohalik.....http://dblp.org/pers/hd/m/Mohalik:Swarup", "K. C. Shashidhar.....http://dblp.org/pers/hd/s/Shashidhar:K=_C="], "pages": 5}