{"title": "Improved Bounds on Security Reductions for Discrete Log Based Signatures.", "fields": ["random oracle", "provable security", "algebraic number", "schnorr signature", "baby step giant step"], "abstract": "Despite considerable research efforts, no efficient reduction from the discrete log problem to forging a discrete log based signature (e.g. Schnorr) is currently known. In fact, negative results are known. Paillier and Vergnaud [PV05] show that the forgeability of several discrete log based signatures  cannot be equivalent to solving the discrete log problem in the standard model,  assuming the so-called one-more discrete log assumption and algebraic reductions. They also show, under the same assumptions, that, any security reduction in the Random Oracle Model (ROM) from discrete log to forging a Schnorr signature must lose a factor of at least $\\sqrt{q_h}$ in the success probability. Here  q   h  is the number of queries the forger makes to the random oracle. The best known positive result, due to Pointcheval and Stern [PS00], also in the ROM, gives a reduction that loses a factor of  q   h  . In this paper, we improve the negative result from [PV05]. In particular, we show that any algebraic reduction in the ROM from discrete log to forging a Schnorr signature must lose a factor of at least $q_h^{2/3}$, assuming the one-more discrete log assumption. We also hint at certain circumstances (by way of restrictions on the forger) under which this lower bound may be tight. These negative results indicate that huge loss factors may be inevitable in reductions from discrete log to discrete log based signatures.", "citation": "Citations (29)", "departments": ["Indian Institute of Technology Delhi", "Microsoft", "Microsoft"], "authors": ["Sanjam Garg.....http://dblp.org/pers/hd/g/Garg:Sanjam", "Raghav Bhaskar.....http://dblp.org/pers/hd/b/Bhaskar:Raghav", "Satyanarayana V. Lokam.....http://dblp.org/pers/hd/l/Lokam:Satyanarayana_V="], "conf": "crypto", "year": "2008", "pages": 15}