{"title": "CSV: visualizing and mining cohesive subgraphs.", "fields": ["strength of a graph", "dense graph", "complement graph", "null graph", "clique width"], "abstract": "Extracting dense sub-components from graphs efficiently is an important objective in a wide range of application domains ranging from social network analysis to biological network analysis, from the World Wide Web to stock market analysis. Motivated by this need recently we have seen several new algorithms to tackle this problem based on the (frequent) pattern mining paradigm. A limitation of most of these methods is that they are highly sensitive to parameter settings, rely on exhaustive enumeration with exponential time complexity, and often fail to help the users understand the underlying distribution of components embedded within the host graph.   In this article we propose an approximate algorithm, to mine and visualize cohesive subgraphs (dense sub components) within a large graph. The approach, refereed to as Cohesive Subgraph Visualization (CSV) relies on a novel mapping strategy that maps edges and nodes to a multi-dimensional space wherein dense areas in the mapped space correspond to cohesive subgraphs. The algorithm then walks through the dense regions in the mapped space to output a visual plot that effectively captures the overall dense sub-component distribution of the graph. Unlike extant algorithms with exponential complexity, CSV has a complexity of O( V  2  logV ) when fixing the parameter mapping dimension, where  V  corresponds to the number of vertices in the graph, although for many real datasets the performance is typically sub-quadratic.   We demonstrate the utility of CSV as a stand-alone tool for visual graph exploration and as a pre-filtering step to significantly scale up exact subgraph mining algorithms such as CLAN.", "citation": "Citations (77)", "year": "2008", "departments": ["National University of Singapore", "Ohio State University", "National University of Singapore", "National University of Singapore"], "conf": "sigmod", "authors": ["Nan Wang.....http://dblp.org/pers/hd/w/Wang:Nan", "Srinivasan Parthasarathy.....http://dblp.org/pers/hd/p/Parthasarathy_0001:Srinivasan", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H="], "pages": 14}