{"title": "Near-duplicate keyframe retrieval by nonrigid image matching.", "fields": ["image retrieval", "ranking", "semi supervised learning", "coherence", "noisy data"], "abstract": "Near-duplicate image retrieval plays an important role in many real-world multimedia applications. Most previous approaches have some limitations. For example, conventional appearance-based methods may suffer from the illumination variations and occlusion issue, and local feature correspondence-based methods often do not consider local deformations and the spatial coherence between two point sets. In this paper, we propose a novel and effective Nonrigid Image Matching (NIM) approach to tackle the task of near-duplicate keyframe retrieval from real-world video corpora. In contrast to previous approaches, the NIM technique can recover an explicit mapping between two near-duplicate images with a few deformation parameters and find out the correct correspondences from noisy data effectively. To make our technique applicable to large-scale applications, we suggest an effective multi-level ranking scheme that filters out the irrelevant results in a coarse-to-fine manner. In our ranking scheme, to overcome the extremely small training size challenge, we employ a semi-supervised learning method for improving the performance using unlabeled data. To evaluate the effectiveness of our solution, we have conducted extensive experiments on two benchmark testbeds extracted from the TRECVID2003 and TRECVID2004 corpora. The promising results show that our proposed method is more effective than other state-of-the-art approaches for near-duplicate keyframe retrieval.", "citation": "Citations (111)", "departments": ["The Chinese University of Hong Kong", "Nanyang Technological University", "The Chinese University of Hong Kong", "National University of Singapore"], "authors": ["Jianke Zhu.....http://dblp.org/pers/hd/z/Zhu:Jianke", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Michael R. Lyu.....http://dblp.org/pers/hd/l/Lyu:Michael_R=", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2008", "pages": 10}