{"title": "Communication Complexity in Algebraic Two-Party Protocols.", "fields": ["homomorphic encryption", "communication complexity", "homomorphic secret sharing", "special case", "semantic security"], "abstract": "In cryptography, there has been tremendous success in building various two-party protocols with small communication complexity out of homomorphic semantically-secure encryption schemes, using their homomorphic properties in a black-box way. A few notable examples of such primitives include items like single database Private Information Retrieval (PIR) schemes (introduced in [15]) and private database update with small communication (introduced in [5]). In this paper, we illustrate a general methodology for determining what types of protocols can and cannot be implemented with small communication by using homomorphic encryption in a black-box way.\n\nWe hope that this work will provide a simple \"litmus test\" of feasibility for black-box use of known homomorphic encryption schemes by other cryptographic researchers attempting to develop new protocols with low communication. Additionally, a precise mathematical language for reasoning about such problems is developed in this work, which may be of independent interest. We stress that the class of algebraic structures for which we prove communication complexity lower bounds is large, and covers practically all known semantically-secure homomorphic cryptosystems (including those based upon bilinear maps).\n\nFinally, we show the following equivalence which relates group homomorphic encryption and a major open question of designing a so-called fully-homomorphic cryptosystem: a fully homomorphic encryption scheme (over a non-zero ring) exists if and only if there exists homomorphic encryption over any finite non-abelian simple group. This result somewhat generalizes results of Barrington [1] (to any group containing a finite non-abelian simple subgroup) and of Maurer and Rhodes [18], and in fact gives a  constructive proof of the 1974 result Werner [28]. (This also answers an open question posed by Rappe in [23], who in 2004 proved a special case of this result.)", "citation": "Citations (8)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Rafail Ostrovsky.....http://dblp.org/pers/hd/o/Ostrovsky:Rafail", "William E. Skeith III.....http://dblp.org/pers/hd/s/Skeith_III:William_E="], "conf": "crypto", "year": "2008", "pages": 18}