{"title": "Stop Chasing Trends: Discovering High Order Models in Evolving Data.", "fields": ["predictive modelling", "group method of data handling", "data stream", "web traffic", "statistical classification"], "abstract": "Many applications are driven by evolving data - patterns in Web traffic, program execution traces, network event logs, etc., are often non-stationary. Building prediction models for evolving data becomes an important and challenging task. Currently, most approaches work by \"chasing trends\", that is, they keep learning or updating models from the evolving data, and use these impromptu models for online prediction. In many cases, this proves to be both costly and ineffective - much time is wasted on re-learning recurring concepts, yet the classifier may remain one step behind the current trend all the time. In this paper, we propose to mine high-order models in evolving data. More often than not, there are a limited number of concepts, or stable distributions, in the data stream, and concepts switch between each other constantly. We mine all such concepts offline from a historical stream, and build high quality models for each of them. At run time, combining historical concept change patterns and cues provided by an online training stream, we find the most likely current concept and use its corresponding models to classify data in an unlabeled stream. The primary advantage of the high-order model approach is its high accuracy. Experiments show that in benchmark datasets, classification error of the high-order model is only a small fraction of that of the current best approaches. Another important benefit is that, unlike state-of-the-art approaches, our approach does not require users to tune any parameters to achieve a satisfying result on streams of different characteristics.", "citation": "Citations (69)", "departments": ["Fudan University", "IBM", "Fudan University", "IBM"], "authors": ["Shixi Chen.....http://dblp.org/pers/hd/c/Chen:Shixi", "Haixun Wang.....http://dblp.org/pers/hd/w/Wang:Haixun", "Shuigeng Zhou.....http://dblp.org/pers/hd/z/Zhou:Shuigeng", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "conf": "icde", "year": "2008", "pages": 10}