{"title": "Topology Control for Maintaining Network Connectivity and Maximizing Network Capacity under the Physical Model.", "fields": ["topology control", "power control", "bridging", "spanning tree", "topology optimization"], "abstract": "In this paper we study the issue of topology control under the physical signal-to-interference-noise-ratio (SINR) model, with the objective of maximizing network capacity. We show that existing graph-model-based topology control captures interference inadequately under the physical SINR model, and as a result, the interference in the topology thus induced is high and the network capacity attained is low. Towards bridging this gap, we propose a centralized approach, called spatial reuse maximizer (MaxSR), that combines a power control algorithm T2P with a topology control algorithm P2T. T2P optimizes the assignment of transmit power given a fixed topology, where by optimality we mean that the transmit power is so assigned that it minimizes the average interference degree (defined as the number of interfering nodes that may interfere with the ongoing transmission on a link) in the topology. P2T, on the other hand, constructs, based on the power assignment made in T2P, a new topology by deriving a spanning tree that gives the minimal interference degree. By alternately invoking the two algorithms, the power assignment quickly converges to an operational point that maximizes the network capacity. We formally prove the convergence of MaxSR. We also show via simulation that the topology induced by MaxSR outperforms that derived from existing topology control algorithms by 50%-110% in terms of maximizing the network capacity.", "citation": "Citations (93)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Yan Gao.....http://dblp.org/pers/hd/g/Gao:Yan", "Jennifer C. Hou.....http://dblp.org/pers/hd/h/Hou:Jennifer_C=", "Hoang Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Hoang"], "conf": "infocom", "year": "2008", "pages": 9}