{"title": "Branch-mispredict level parallelism (BLP) for control independence.", "fields": ["branch misprediction", "multithreading", "microarchitecture", "task parallelism", "data parallelism"], "abstract": "A microprocessorpsilas performance is fundamentally limited by the rate at which it can resolve branch mispredictions. Control independence (CI) architectures look for useful control and data independent instructions to fetch and execute in the shadow of a branch misprediction. This paper demonstrates that CI architectures can be guided to exploit substantial branch-mispredict level parallelism (BLP) in existing control intensive applications. A program has branch-mispredict level parallelism when its dynamic execution trace contains hard-to-predict branches that are both control and data independent, and thus could, potentially, be resolved in parallel. Although applications have a high degree of inherent BLP, we find that the amount of BLP exploited by naive CI architectures tends to be quite small. We show that spawn selection and data dependence handling policies in a CI architecture should make choices that explicitly aim to maximize branch-mispredict level parallelism. We demonstrate that with BLP-focussed policies, CI architectures can expose high amounts of branch-mispredict level parallelism and achieve 50% to 90% improvements in IPC on several of the SPEC 2000 Integer benchmarks.", "citation": "Citations (3)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Kshitiz Malik.....http://dblp.org/pers/hd/m/Malik:Kshitiz", "Mayank Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Mayank", "Sam S. Stone.....http://dblp.org/pers/hd/s/Stone:Sam_S=", "Kevin M. Woley.....http://dblp.org/pers/hd/w/Woley:Kevin_M=", "Matthew I. Frank.....http://dblp.org/pers/hd/f/Frank:Matthew_I="], "conf": "hpca", "year": "2008", "pages": 12}