{"title": "BibNetMiner: mining bibliographic information networks.", "fields": ["citation", "ranking", "link analysis", "bibliographic database", "profiling"], "abstract": "Online bibliographic databases, such as DBLP in computer science and PubMed in medical sciences, contain abundant information about research publications in different fields. Each such database forms a gigantic information network (hence called  BibNet ), connecting in complex ways research papers, authors, conferences/journals, and possibly citation information as well, and provides a fertile land for information network analysis. Our  BibNetMiner  is designed for sophisticated information network mining on such bibliographic databases. In this demo, we will take the DBLP database as an example, demonstrate several attractive functions of  BibNetMiner , including clustering, ranking and profiling of conferences and authors based on the research subfields. A user-friendly, visualization-enhanced interface will be provided to facilitate interactive exploration of a bibliographic database. This project will serve as an example to demonstrate the power of links in information network mining. Since the dataset is large and the network is heterogeneous, such a study will benefit the research on the analysis of massive heterogeneous information networks.", "citation": "Citations (21)", "year": "2008", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "sigmod", "authors": ["Yizhou Sun.....http://dblp.org/pers/hd/s/Sun:Yizhou", "Tianyi Wu.....http://dblp.org/pers/hd/w/Wu:Tianyi", "Zhijun Yin.....http://dblp.org/pers/hd/y/Yin:Zhijun", "Hong Cheng.....http://dblp.org/pers/hd/c/Cheng:Hong", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Xiaoxin Yin.....http://dblp.org/pers/hd/y/Yin:Xiaoxin", "Peixiang Zhao.....http://dblp.org/pers/hd/z/Zhao:Peixiang"], "pages": 4}