{"title": "A Two-Level Load/Store Queue Based on Execution Locality.", "fields": ["amdahl s law", "microarchitecture", "cpu cache", "processor design", "task parallelism"], "abstract": "Multicore processors have emerged as a powerful platform on which to efficiently exploit thread-level parallelism (TLP). However, due to Amdahl’s Law, such designs will be increasingly limited by the remaining sequential components of applications. To overcome this limitation it is necessary to design processors with many lower–performance cores for TLP and some high-performance cores designed to execute sequential algorithms. Such cores will need to address the memory-wall by implementing kilo-instruction windows. Large window processors require large Load/Store Queues that would be too slow if implemented using current CAMbased designs. This paper proposes an Epoch-based Load Store Queue (ELSQ), a new design based on Execution Locality. It is integrated into a large-window processor that has a fast, out-of-order core operating only on L1/L2 cache hits and N slower cores that process L2 misses and their dependent instructions. The large LSQ is coupled with the slow cores and is partitioned into N small and local LSQs, one per core. We evaluate ELSQ in a large-window environment, finding that it enables high performance at low power. By exploiting locality among loads and stores, ELSQ outperforms even an idealized central LSQ when implemented on top of a decoupled processor design.", "citation": "Citations (8)", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Univ. Politec.  ... unya, Barcelona"], "authors": ["Miquel Pericàs.....http://dblp.org/pers/hd/p/Peric=agrave=s:Miquel", "Adrián Cristal.....http://dblp.org/pers/hd/c/Cristal:Adri=aacute=n", "Francisco J. Cazorla.....http://dblp.org/pers/hd/c/Cazorla:Francisco_J=", "Rubén González.....http://dblp.org/pers/hd/g/Gonz=aacute=lez:Rub=eacute=n", "Alexander V. Veidenbaum.....http://dblp.org/pers/hd/v/Veidenbaum:Alexander_V=", "Daniel A. Jiménez.....http://dblp.org/pers/hd/j/Jim=eacute=nez:Daniel_A=", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "conf": "isca", "year": "2008", "pages": 12}