{"title": "On-line Recognition of Surgical Activity for Monitoring in the Operating Room.", "fields": ["user interface", "laparoscopic surgery", "hidden markov model", "spite", "workflow"], "abstract": "Surgery rooms are complex environments where many interactions take place between staff members and the electronic and mechanical systems. In spite of their inherent complexity, surgeries of the same kind bear numerous similarities and are usually performed with similar workftows. This gives the possibility to design support systems in the Operating Room (OR), whose applicability range from easy tasks such as the activation of OR lights and calling the next patient, to more complex ones such as context-sensitive user interfaces or automatic reporting. An essential feature when designing such systems, is the ability for on-line recognition of what is happening inside the OR, based on recorded signals.\n\nIn this paper, we present an approach using signals from the OR and Hidden Markov Models to recognize on-line the surgical steps performed by the surgeon during a laparoscopic surgery. We also explain how the system can be deployed in the OR. Experiments are presented using 11 real surgeries performed by different surgeons in several ORs, recorded at our partner hospital.\n\nWe believe that similar systems will quickly develop in the near future in order to efficiently support surgeons, trainees and the medical staff in general, as well as to improve administrative tasks like scheduling within hospitals.", "citation": "Citations (79)", "departments": ["Technische Universität München", "Technische Universität München", "French Institute for Research in Computer Science and Automation", "Technische Universität München", "Klinikum Rechts ... nchen, Germany"], "authors": ["Nicolas Padoy.....http://dblp.org/pers/hd/p/Padoy:Nicolas", "Tobias Blum.....http://dblp.org/pers/hd/b/Blum:Tobias", "Hubertus Feußner.....http://dblp.org/pers/hd/f/Feu=szlig=ner:Hubertus", "Marie-Odile Berger.....http://dblp.org/pers/hd/b/Berger:Marie=Odile", "Nassir Navab.....http://dblp.org/pers/hd/n/Navab:Nassir"], "conf": "aaai", "year": "2008", "pages": 7}