{"title": "Doloto: code splitting for network-bound web 2.0 applications.", "fields": ["client side scripting", "comet", "code mobility", "web api", "web modeling"], "abstract": "Modern Web 2.0 applications, such as GMail, Live Maps, Face-book and many others, use a combination of Dynamic HTML, JavaScript and other Web browser technologies commonly referred to as AJAX to push application execution to the client web browser. This improves the responsiveness of these network-bound applications, but the shift of application execution from a back-end server to the client also often dramatically increases the amount of code that must first be downloaded to the browser. This creates an unfortunate Catch-22: to create responsive distributed Web 2.0 applications developers move code to the client, but for an application to be responsive, the code must first be transferred there, which takes time.   In this paper, we present Doloto, an optimization tool for Web 2.0 applications. Doloto analyzes application workloads and  automatically  rewrites the existing application code to introduce dynamic code loading. After being processed by Doloto, an application will initially transfer only the portion of code necessary for application initialization. The rest of the application's code is replaced by short stubs---their actual implementations are transfered lazily in the background or, at the latest, on-demand on first execution of a particular application feature. Moreover, code that is rarely executed is rarely downloaded to the user browser. Because Doloto significantly speeds up the application startup and since subsequent code download is interleaved with application execution, applications rewritten with Doloto appear much more responsive to the end-user.   To demonstrate the effectiveness of Doloto in practice, we have performed experiments on five large widely-used Web 2.0 applications. Doloto reduces the size of application code download by hundreds of kilobytes or as much as 50% of the original download size. The time to download and begin interacting with large applications is reduced by 20--40% depending on the application and wide-area network conditions. Doloto especially shines on wireless and mobile connections, which are becoming increasingly important in today's computing environments.", "citation": "Citations (27)", "departments": ["Microsoft", "Microsoft"], "authors": ["V. Benjamin Livshits.....http://dblp.org/pers/hd/l/Livshits:V=_Benjamin", "Emre Kiciman.....http://dblp.org/pers/hd/k/Kiciman:Emre"], "conf": "sigsoft", "year": "2008", "pages": 11}