{"title": "Incorporating flexibility in Anton, a specialized machine for molecular dynamics simulation.", "fields": ["supercomputer", "electronic data interchange", "molecular biophysics", "computation", "multiprocessing"], "abstract": "An effective special-purpose supercomputer for molecular dynamics (MD) requires much more than high-performance acceleration of computational kernels: such accelerators must be balanced with general-purpose computation and communication resources. Achieving this balance was a significant challenge in the design of Anton, a parallel machine that will accelerate MD simulations by several orders of magnitude. Anton executes its most computationally demanding calculations on a highly specialized, enormously parallel, but largely non-programmable high-throughput interaction subsystem (HTIS). Other elements of the simulation have a less uniform algorithmic structure, and may also change in response to future advances in physical models and simulation techniques. Such calculations are executed on Antonpsilas flexible subsystem, which combines programmability with the computational power required to avoid ldquoAmdahlpsilas Lawrdquo bottlenecks arising from the extremely high throughput of the HTIS. Antonpsilas flexible subsystem is a heterogeneous multiprocessor with 12 cores, each organized around a 128-bit data path. This subsystem includes hardware support for synchronization, data transfer and certain types of particle interactions, along with specialized instructions for geometric operations. All aspects of the flexible subsystem were designed specifically to accelerate MD simulations, and although it relies primarily on what may be regarded as ldquogeneral-purposerdquo processors, even this subsystem contains more application-specific features than many recently proposed ldquospecializedrdquo architectures.", "citation": "Citations (21)", "departments": ["D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research"], "authors": ["Jeffrey Kuskin.....http://dblp.org/pers/hd/k/Kuskin:Jeffrey", "Cliff Young.....http://dblp.org/pers/hd/y/Young:Cliff", "J. P. Grossman.....http://dblp.org/pers/hd/g/Grossman:J=_P=", "Brannon Batson.....http://dblp.org/pers/hd/b/Batson:Brannon", "Martin M. Deneroff.....http://dblp.org/pers/hd/d/Deneroff:Martin_M=", "Ron O. Dror.....http://dblp.org/pers/hd/d/Dror:Ron_O=", "David E. Shaw.....http://dblp.org/pers/hd/s/Shaw:David_E="], "conf": "hpca", "year": "2008", "pages": 12}