{"title": "On Notions of Security for Deterministic Encryption, and Efficient Constructions without Random Oracles.", "fields": ["probabilistic encryption", "deterministic encryption", "plaintext aware encryption", "multiple encryption", "optimal asymmetric encryption padding", "attribute based encryption", "computer science", "theoretical computer science"], "abstract": "The study of deterministic public-key encryption was initiated by Bellare et al. (CRYPTO '07), who provided the \"strongest possible\" notion of security for this primitive (called PRIV) and constructions in the random oracle (RO) model. We focus on constructing efficient deterministic encryption schemes  without random oracles. To do so, we propose a slightly weaker notion of security, saying that no partial information about encrypted messages should be leaked as long as each message is a-priori hard-to-guess  given the others (while PRIV did not have the latter restriction). Nevertheless, we argue that this version seems adequate for many practical applications. We show equivalence of this definition to single-message and indistinguishability-based ones, which are easier to work with. Then we give general constructions of both chosen-plaintext (CPA) and chosen-ciphertext-attack (CCA) secure deterministic encryption schemes, as well as efficient instantiations of them under standard number-theoretic assumptions. Our constructions build on the recently-introduced framework of Peikert and Waters (STOC '08) for constructing CCA-secure  probabilistic encryption schemes, extending it to the deterministic-encryption setting as well.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "CWI, Amsterdam, Netherlands"], "authors": ["Alexandra Boldyreva.....http://dblp.org/pers/hd/b/Boldyreva:Alexandra", "Serge Fehr.....http://dblp.org/pers/hd/f/Fehr:Serge", "Adam O'Neill.....http://dblp.org/pers/hd/o/O=Neill:Adam"], "conf": "crypto", "year": "2008", "pages": 25}