{"title": "Enhancing Storage System Availability on Multi-Core Architectures with Recovery-Conscious Scheduling.", "fields": ["fair share scheduling", "multi core processor", "software system", "serializability", "legacy code"], "abstract": "In this paper we develop a recovery conscious framework for multi-core architectures and a suite of techniques for improving the resiliency and recovery efficiency of highly concurrent embedded storage software systems. Our techniques aim at providing continuous availability and performance during recovery while minimizing the time to recovery and the need for rearchitecting the system (legacy code). The main contributions of our recovery conscious framework include (1) a task-level recovery model, which consists of mechanisms for classifying storage tasks into recovery groups and dividing the overall system resources into recovery-oriented resource pools, and (2) the development of recovery-conscious scheduling, which enforces some serializability of failure-dependent tasks in order to reduce the ripple effect of software failure and improve the availability of the system. We present three alternative recovery-conscious scheduling algorithms; each represents one way to trade-off between recovery time and system performance. We have implemented and evaluated these recovery-conscious scheduling algorithms on a real industry-standard storage system. Our experimental evaluation results show that the proposed recovery conscious scheduling algorithms are non-intrusive and can significantly improve (throughput by 16.3% and response time by 22.9%) the performance of the system during failure recovery.", "citation": "Citations (5)", "departments": ["Georgia Institute of Technology", "IBM", "IBM", "IBM", "IBM"], "authors": ["Sangeetha Seshadri.....http://dblp.org/pers/hd/s/Seshadri:Sangeetha", "Lawrence Chiu.....http://dblp.org/pers/hd/c/Chiu:Lawrence", "Cornel Constantinescu.....http://dblp.org/pers/hd/c/Constantinescu:Cornel", "Subashini Balachandran.....http://dblp.org/pers/hd/b/Balachandran:Subashini", "Clem Dickey.....http://dblp.org/pers/hd/d/Dickey:Clem", "Ling Liu.....http://dblp.org/pers/hd/l/Liu:Ling", "Paul Muench.....http://dblp.org/pers/hd/m/Muench:Paul"], "conf": "fast", "year": "2008", "pages": 16}