{"title": "Making Large Scale Deployment of RCP Practical for Real Networks.", "fields": ["download", "processor sharing", "software deployment", "queue", "communication source"], "abstract": "We recently proposed the rate control protocol (RCP) as a way to minimize download times (or flow-completion times). Simulations suggest that if RCP were widely deployed, downloads would frequently finish an order of magnitude faster than with TCP. This is because RCP involves explicit feedback from the routers along the path, allowing a sender to pick a fast starting rate, and adapt quickly to network conditions. RCP is particularly appealing because it can be shown to be stable under broad operating conditions, and its performance is independent of the flow-size distribution and the RTT. Although it requires changes to the routers, the changes are small: The routers keep no per-flow state or per-flow queues, and the per-packet processing is minimal. However, the bar is high for a new congestion control mechanism - introducing a new scheme requires enormous change, and the argument needs to be compelling. And so, to enable incremental deployment of RCP, we have built and tested an open and public implementation of RCP, and proposed solutions for deployments that require no fork-lift network upgrades. In this paper we describe our end-host and router implementation of RCP in Linux, and solutions to how RCP can coexist in a network carrying predominantly non-RCP traffic, and coordinate with routers that don't implement RCP. We hope that these solutions will take us closer to having an impact in real networks, not just for RCP but also for many other explicit congestion control protocols proposed in literature.", "citation": "Citations (26)", "departments": ["Stanford University", "Stanford University", "Stanford University"], "authors": ["Chia-Hui Tai.....http://dblp.org/pers/hd/t/Tai:Chia=Hui", "Jiang Zhu.....http://dblp.org/pers/hd/z/Zhu:Jiang", "Nandita Dukkipati.....http://dblp.org/pers/hd/d/Dukkipati:Nandita"], "conf": "infocom", "year": "2008", "pages": 9}