{"title": "Dynamic Jamming Mitigation for Wireless Broadcast Networks.", "fields": ["unicast", "false alarm", "jamming", "network simulation", "constant false alarm rate"], "abstract": "Wireless communications are inherently symmetric; that is, it takes an attacker the same amount of power to modulate a signal as it does for a legitimate node to modulate the same signal. As a result, wireless communications are often susceptible to the jamming attack in which the attacker injects a high level of noise into the system. Spread spectrum has long been used to resist jamming attacks in unicast environments, or when the jammer has less information than the other receivers. Recently, we proposed a scheme for broadcast jamming mitigation based on spread spectrum and a binary key tree and showed some improvements over a multiple-unicast system. In this paper, we extend our previous work in five ways. First, we provide a theoretical result that under our scheme, jammers can cause only a limited number of losses. Second, we develop a dynamic tree-remerging scheme that achieves higher power efficiency than previously proposed schemes, and scales to an arbitrary number of receivers without increasing the number of codes in use; in particular, we send each transmission on at most 2j + 1 codes, where j is the number of jammers. Third, we show that our scheme is close to optimal, demonstrating that under certain realistic restrictions, the system cannot escape jamming without using at least j +1 codes. Fourth, we provide a detailed analysis of false alarm rates, showing both experimental and theoretical results. Finally, we perform a more extensive analysis of our system using both a chip-accurate MATLAB simulation and a bit-accurate event-driven simulation in the ns-2 network simulator; these simulations demonstrate that our scheme approaches the best possible performance.", "citation": "Citations (92)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Jerry T. Chiang.....http://dblp.org/pers/hd/c/Chiang:Jerry_T=", "Yih-Chun Hu.....http://dblp.org/pers/hd/h/Hu:Yih=Chun"], "conf": "infocom", "year": "2008", "pages": 9}