{"title": "Temporal instruction fetch streaming.", "fields": ["cache algorithms", "branch misprediction", "cache", "branch predictor", "cpu cache"], "abstract": "L1 instruction-cache misses pose a critical performance bottleneck in commercial server workloads. Cache access latency constraints preclude L1 instruction caches large enough to capture the application, library, and OS instruction working sets of these workloads. To cope with capacity constraints, researchers have proposed instruction prefetchers that use branch predictors to explore future control flow. However, such prefetchers suffer from several fundamental flaws: their lookahead is limited by branch prediction bandwidth, their accuracy suffers from geometrically-compounding branch misprediction probability, and they are ignorant of the cache contents, frequently predicting blocks already present in L1. Hence, L1 instruction misses remain a bottleneck. We propose temporal instruction fetch streaming (TIFS)-a mechanism for prefetching temporally-correlated instruction streams from lower-level caches. Rather than explore a programpsilas control flow graph, TIFS predicts future instruction-cache misses directly, through recording and replaying recurring L1 instruction miss sequences. In this paper, we first present an information-theoretic offline trace analysis of instruction-miss repetition to show that 94% of L1 instruction misses occur in long, recurring sequences. Then, we describe a practical mechanism to record these recurring sequences in the L2 cache and leverage them for instruction-cache prefetching. Our TIFS design requires less than 5% storage overhead over the baseline L2 cache and improves performance by 11% on average and 24% at best in a suite of commercial server workloads.", "citation": "Citations (34)", "departments": ["Carnegie Mellon University", "University of Michigan", "Carnegie Mellon University", "École Polytechnique Fédérale de Lausanne", "University of Toronto"], "authors": ["Michael Ferdman.....http://dblp.org/pers/hd/f/Ferdman:Michael", "Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F=", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia", "Babak Falsafi.....http://dblp.org/pers/hd/f/Falsafi:Babak", "Andreas Moshovos.....http://dblp.org/pers/hd/m/Moshovos:Andreas"], "conf": "micro", "year": "2008", "pages": 10}