{"title": "On the Reliability of Clustering Stability in the Large Sample Regime.", "fields": ["k medians clustering", "cure data clustering algorithm", "determining the number of clusters in a data set", "constrained clustering", "correlation clustering"], "abstract": "Clustering stability is an increasingly popular family of methods for performing model selection in data clustering. The basic idea is that the chosen model should be stable under perturbation or resampling of the data. Despite being reasonably effective in practice, these methods are not well understood theoretically, and present some difficulties. In particular, when the data is assumed to be sampled from an underlying distribution, the solutions returned by the clustering algorithm will usually become more and more stable as the sample size increases. This raises a potentially serious practical difficulty with these methods, because it means there might be some hard-to-compute sample size, beyond which clustering stability estimators 'break down' and become unreliable in detecting the most stable model. Namely, all models will be relatively stable, with differences in their stability measures depending mostly on random and meaningless sampling artifacts. In this paper, we provide a set of general sufficient conditions, which ensure the reliability of clustering stability estimators in the large sample regime. In contrast to previous work, which concentrated on specific toy distributions or specific idealized clustering frameworks, here we make no such assumptions. We then exemplify how these conditions apply to several important families of clustering algorithms, such as maximum likelihood clustering, certain types of kernel clustering, and centroid-based clustering with any Bregman divergence. In addition, we explicitly derive the non-trivial asymptotic behavior of these estimators, for any framework satisfying our conditions. This can help us understand what is considered a 'stable' model by these estimators, at least for large enough samples.", "citation": "Citations (16)", "year": "2008", "departments": ["Interdisciplinary Center for Neural Computation", "Interdisciplinary Center for Neural Computation"], "conf": "nips", "authors": ["Ohad Shamir.....http://dblp.org/pers/hd/s/Shamir:Ohad", "Naftali Tishby.....http://dblp.org/pers/hd/t/Tishby:Naftali"], "pages": 8}