{"title": "Gaussian-process factor analysis for low-dimensional single-trial analysis of neural population activity.", "fields": ["dimensional reduction", "goodness of fit", "gaussian process", "data science", "neuron", "smoothing", "probabilistic logic", "artificial intelligence", "machine learning", "dimensionality reduction", "computer science"], "abstract": "We consider the problem of extracting smooth, low-dimensional neural trajectories that summarize the activity recorded simultaneously from tens to hundreds of neurons on individual experimental trials. Current methods for extracting neural trajectories involve a two-stage process: the data are first \"denoised\" by smoothing over time, then a static dimensionality reduction technique is applied. We first describe extensions of the two-stage methods that allow the degree of smoothing to be chosen in a principled way, and account for spiking variability that may vary both across neurons and across time. We then present a novel method for extracting neural trajectories, Gaussian-process factor analysis (GPFA), which unifies the smoothing and dimensionality reduction operations in a common probabilistic framework. We applied these methods to the activity of 61 neurons recorded simultaneously in macaque premotor and motor cortices during reach planning and execution. By adopting a goodness-of-fit metric that measures how well the activity of each neuron can be predicted by all other recorded neurons, we found that GPFA provided a better characterization of the population activity than the two-stage methods.", "citation": "Not cited", "year": "2008", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "conf": "nips", "authors": ["Byron M. Yu.....http://dblp.org/pers/hd/y/Yu:Byron_M=", "John P. Cunningham.....http://dblp.org/pers/hd/c/Cunningham:John_P=", "Gopal Santhanam.....http://dblp.org/pers/hd/s/Santhanam:Gopal", "Stephen I. Ryu.....http://dblp.org/pers/hd/r/Ryu:Stephen_I=", "Krishna V. Shenoy.....http://dblp.org/pers/hd/s/Shenoy:Krishna_V=", "Maneesh Sahani.....http://dblp.org/pers/hd/s/Sahani:Maneesh"], "pages": 8}