{"title": "Link Positions Matter: A Noncommutative Routing Metric for Wireless Mesh Network.", "fields": ["wireless mesh network", "metrics", "network packet", "mesh networking", "link layer"], "abstract": "We revisit the problem of computing the path with the minimum cost in terms of the expected number of link layer transmissions (including retransmissions) in wireless mesh networks. Unlike previous efforts, such as the popular ETX, we account for the fact that MAC protocols (including the IEEE 802.11 MAC) incorporate a finite number of transmission attempts per packet. This in turn leads to our key observation: the performance of a path depends not only on the number of the links on the path and the quality of its links, but also, on the relative positions of the links on the path. Based on this observation, we propose ETOP, a path metric that accurately captures the expected number of link layer transmissions required for reliable end-to-end packet delivery. We analytically compute ETOP, which is not trivial, since ETOP is a noncommutative function of the link success probabilities. Although ETOP is a more involved metric, we show that the problem of computing paths with the minimum ETOP cost can be solved by a greedy algorithm. We implement and evaluate a routing approach based on ETOP on a 25-node indoor mesh network. Our experiments show that the path selection with ETOP consistently results in superior TCP goodput (by over 50% in many cases) compared to path selection based on ETX. We also perform an in-depth analysis of the measurements to better understand why the paths selected by ETOP improve the TCP performance.", "citation": "Citations (55)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of California, Riverside"], "authors": ["Gentian Jakllari.....http://dblp.org/pers/hd/j/Jakllari:Gentian", "Stephan Eidenbenz.....http://dblp.org/pers/hd/e/Eidenbenz:Stephan", "Nicolas W. Hengartner.....http://dblp.org/pers/hd/h/Hengartner:Nicolas_W=", "Srikanth V. Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Srikanth_V=", "Michalis Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Michalis"], "conf": "infocom", "year": "2008", "pages": 9}