{"title": "A Novel Quantitative Approach For Measuring Network Security.", "fields": ["national vulnerability database", "security convergence", "countermeasure", "asset", "security through obscurity"], "abstract": "Evaluation of network security is an essential step in securing any network. This evaluation can help security professionals in making optimal decisions about how to design security countermeasures, to choose between alternative security architectures, and to systematically modify security configurations in order to improve security. However, the security of a network depends on a number of dynamically changing factors such as emergence of new vulnerabilities and threats, policy structure and network traffic. Identifying, quantifying and validating these factors using security metrics is a major challenge in this area. In this paper, we propose a novel security metric framework that identifies and quantifies objectively the most significant security risk factors, which include existing vulnerabilities, historical trend of vulnerability of the remotely accessible services, prediction of potential vulnerabilities for any general network service and their estimated severity and finally policy resistance to attack propagation within the network. We then describe our rigorous validation experiments using real- life vulnerability data of the past 6 years from National Vulnerability Database (NVD) [10] to show the high accuracy and confidence of the proposed metrics. Some previous works have considered vulnerabilities using code analysis. However, as far as we know, this is the first work to study and analyze these metrics for network security evaluation using publicly available vulnerability information and security policy configuration.", "citation": "Citations (109)", "departments": ["University of Texas at Dallas", "DePaul University", "University of Texas at Austin"], "authors": ["Mohammad Salim Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Mohammad_Salim", "Ehab Al-Shaer.....http://dblp.org/pers/hd/a/Al=Shaer:Ehab", "Latifur Khan.....http://dblp.org/pers/hd/k/Khan:Latifur"], "conf": "infocom", "year": "2008", "pages": 9}