{"title": "Toward a multicore architecture for real-time ray-tracing.", "fields": ["hardware architecture", "reference architecture", "real time rendering", "software architecture", "applications architecture"], "abstract": "Significant improvement to visual quality for real-time 3D graphics requires modeling of complex illumination effects like soft-shadows, reflections, and diffuse lighting interactions. The conventional Z-buffer algorithm driven GPU model does not provide sufficient support for this improvement. This paper targets the entire graphics system stack and demonstrates algorithms, a software architecture, and a hardware architecture for real-time rendering with a paradigm shift to ray-tracing. The three unique features of our system called Copernicus are support for dynamic scenes, high image quality, and execution on programmable multicore architectures. The focus of this paper is the synergy and interaction between applications, architecture, and evaluation. First, we describe the ray-tracing algorithms which are designed to use redundancy and partitioning to achieve locality. Second, we describe the architecture which uses ISA specialization, multi-threading to hide memory delays and supports only local coherence. Finally, we develop an analytical performance model for our 128-core system, using measurements from simulation and a scaled-down prototype system. More generally, this paper addresses an important issue of mechanisms and evaluation for challenging workloads for future processors. Our results show that a single 8-core tile (each core 4-way multithreaded) can be almost 100% utilized and sustain 10 million rays/second. Sixteen such tiles, which can fit on a 240 mm 2  chip in 22 nm technology, make up the system and with our anticipated improvements in algorithms, can sustain real-time rendering. The mechanisms and the architecture can potentially support other domains like irregular scientific computations and physics computations.", "citation": "Citations (69)", "departments": ["University of Wisconsin-Madison", "University of Texas at Austin", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Texas at Austin"], "authors": ["Venkatraman Govindaraju.....http://dblp.org/pers/hd/g/Govindaraju:Venkatraman", "Peter Djeu.....http://dblp.org/pers/hd/d/Djeu:Peter", "Karthikeyan Sankaralingam.....http://dblp.org/pers/hd/s/Sankaralingam:Karthikeyan", "Mary K. Vernon.....http://dblp.org/pers/hd/v/Vernon:Mary_K=", "William R. Mark.....http://dblp.org/pers/hd/m/Mark:William_R="], "conf": "micro", "year": "2008", "pages": 12}