{"title": "Native Web Browser Enabled SVG-based Collaborative Multimedia Annotation for Medical Images.", "fields": ["scalable vector graphics", "metadata", "animation", "annotation", "automatic image annotation"], "abstract": "Image annotation becomes increasingly important for clinical applications and medical research. In particular, collaborative image annotations can harness the collective intelligence from distributed experts. There are several challenges to support collaborative medical image annotations: i) Medical image annotation includes not only metadata annotation but also multimedia annotation, such as graphical annotation. The latter often requires a heavy-duty tool, which can be difficult to realize in a distributed environment; ii) Annotations need to be well modeled for easy exchange and support of queries, i.e., there is a gap between image annotation and content retrieval; and iii) An annotation platform is needed to provide authoring tools and the collaborative infrastructure. Meanwhile, the Web is evolving quickly on supporting interaction, participation and collaboration enabled by Web 2.0 technologies. Among them, scalable vector graphics (SVG) now becomes a standard language for vector graphics on the Web natively supported by latest Web browsers. In our work, we develop a collaborative image annotation platform, which provides: i) a flexible data model to support both metadata and multimedia annotations on 2-D medical images; ii) SVG based implementation of the data model that can support complex textual, spatial, and collaborative queries on annotations with XQuery; iii) a lightweight native Web browser enabled annotation authoring tool without any plugin needed; and iv) an architecture that provides authoring, storing, querying, and exchanging of annotations, and supports Web-based collaboration.", "citation": "Citations (8)", "departments": ["Princeton University", "University of Mannheim", "Princeton University"], "authors": ["Fusheng Wang.....http://dblp.org/pers/hd/w/Wang:Fusheng", "Cornelius Rabsch.....http://dblp.org/pers/hd/r/Rabsch:Cornelius", "Peiya Liu.....http://dblp.org/pers/hd/l/Liu:Peiya"], "conf": "icde", "year": "2008", "pages": 10}