{"title": "Saner: Composing Static and Dynamic Analysis to Validate Sanitization in Web Applications.", "fields": ["software quality", "cross site scripting", "vulnerability assessment", "correctness", "data validation"], "abstract": "Web applications are ubiquitous, perform mission- critical tasks, and handle sensitive user data. Unfortunately, web applications are often implemented by developers with limited security skills, and, as a result, they contain vulnerabilities. Most of these vulnerabilities stem from the lack of input validation. That is, web applications use malicious input as part of a sensitive operation, without having properly checked or sanitized the input values prior to their use. Past research on vulnerability analysis has mostly focused on identifying cases in which a web application directly uses external input in critical operations. However, little research has been performed to analyze the correctness of the sanitization process. Thus, whenever a web application applies some sanitization routine to potentially malicious input, the vulnerability analysis assumes that the result is innocuous. Unfortunately, this might not be the case, as the sanitization process itself could be incorrect or incomplete. In this paper, we present a novel approach to the analysis of the sanitization process. More precisely, we combine static and dynamic analysis techniques to identify faulty sanitization procedures that can be bypassed by an attacker. We implemented our approach in a tool, called Saner, and we applied it to a number of real-world applications. Our results demonstrate that we were able to identify several novel vulnerabilities that stem from erroneous sanitization procedures.", "citation": "Citations (404)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Davide Balzarotti.....http://dblp.org/pers/hd/b/Balzarotti:Davide", "Marco Cova.....http://dblp.org/pers/hd/c/Cova:Marco", "Viktoria Felmetsger.....http://dblp.org/pers/hd/f/Felmetsger:Viktoria", "Nenad Jovanovic.....http://dblp.org/pers/hd/j/Jovanovic:Nenad", "Engin Kirda.....http://dblp.org/pers/hd/k/Kirda:Engin", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "conf": "sp", "year": "2008", "pages": 15}