{"title": "Private queries in location based services: anonymizers are not necessary.", "fields": ["correlation attack", "location based service", "snapshot", "trusted third party", "exact algorithm"], "abstract": "Mobile devices equipped with positioning capabilities (e.g., GPS) can ask location-dependent queries to Location Based Services ( LBS ). To protect privacy, the user location must not be disclosed. Existing solutions utilize a trusted anonymizer between the users and the LBS. This approach has several drawbacks: ( i ) All users must trust the third party anonymizer, which is a single point of attack. ( ii ) A large number of cooperating, trustworthy users is needed. ( iii ) Privacy is guaranteed only for a single snapshot of user locations; users are not protected against correlation attacks (e.g., history of user movement).   We propose a novel framework to support private location-dependent queries, based on the theoretical work on Private Information Retrieval ( PIR ). Our framework does not require a trusted third party, since privacy is achieved via cryptographic techniques. Compared to existing work, our approach achieves stronger privacy for snapshots of user locations; moreover, it is the first to provide provable privacy guarantees against correlation attacks. We use our framework to implement approximate and exact algorithms for nearest-neighbor search. We optimize query execution by employing data mining techniques, which identify redundant computations. Contrary to common belief, the experimental results suggest that PIR approaches incur reasonable overhead and are applicable in practice.", "citation": "Citations (813)", "year": "2008", "departments": ["National University of Singapore", "National University of Singapore", "University of Southern California", "University of Southern California", "National University of Singapore"], "conf": "sigmod", "authors": ["Gabriel Ghinita.....http://dblp.org/pers/hd/g/Ghinita:Gabriel", "Panos Kalnis.....http://dblp.org/pers/hd/k/Kalnis:Panos", "Ali Khoshgozaran.....http://dblp.org/pers/hd/k/Khoshgozaran:Ali", "Cyrus Shahabi.....http://dblp.org/pers/hd/s/Shahabi:Cyrus", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee"], "pages": 12}