{"title": "Symbolic mining of temporal specifications.", "fields": ["specification pattern", "binary decision diagram", "software system", "formal specification", "software development process"], "abstract": "Program specifications are important in many phases of the software development process, but they are often omitted or incomplete. An important class of specifications takes the form of temporal properties that prescribe proper usage of components of a software system. Recent work has focused on the automated inference of temporal specifications from the static or runtime behavior of programs. Many techniques match a specification pattern (represented by a finite state automaton) to all possible combinations of program components and enumerate the possible matches. Such approaches suffer from high space complexity and have not scaled beyond simple, two-letter alternating patterns ( e.g. (ab)* ). In this paper, we precisely define this form of specification mining and show that its general form is NP-complete.   We observe a great deal of regularity in the representation and tracking of all possible combinations of system components. This motivates us to introduce a symbolic algorithm, based on binary decision diagrams (BDDs), that exploits this regularity. Our results show that this symbolic approach expands the tractability of this problem by orders of magnitude in both time and space. It enables us to mine more complex specifications, such as the common three-letter resource acquisition, usage, and release pattern ( (ab  +  c) *). We have implemented our algorithm in a practical tool and used it to find significant specifications in real systems, including Apache Ant and Hibernate. We then used these specifications to find previously unknown bugs.", "citation": "Citations (86)", "departments": ["University of California, Davis", "University of California, Davis"], "authors": ["Mark Gabel.....http://dblp.org/pers/hd/g/Gabel:Mark", "Zhendong Su.....http://dblp.org/pers/hd/s/Su:Zhendong"], "conf": "icse", "year": "2008", "pages": 10}