{"title": "Personal location based services on place-enhanced blog.", "fields": ["digital media", "personally identifiable information", "location based service", "navigation system", "user generated content"], "abstract": "This paper proposes personal location based services on blog to make users recall past memories and things to do by displaying their personal records like diary, schedule and to-do list depending on the positions of the users. A lot of Internet users are recording their personal experiences and knowledge as texts and other digital media on the network. These users' created content is called \"User Generated Content\" (UGC). One of the reasons that users record their experiences and knowledge is not only informing other users about author's opinions but also retrieving them as needed. Although users can retrieve these records easily through their personal computer, it is difficult to retrieve them at the right place because most UGC systems do not have features to deal with some place attributes, on the other hand current commercial LBS do not support to deal with personal records. Our proposed tool provides users with an environment to store personal records with related place attributes, and to retrieve these personal records at the right place. There are two applications on this tool, a place enhanced blog and a place reminder on a mobile phone. A place enhanced blog provide users with blog interfaces for inputting place information. The place reminder is a browser for spatial data on the place enhanced blog. Users can generate place information by writing personal records on their blog. Furthermore, using the place reminder, other users can retrieve all users' permitted personal records on the spots. Also, the place reminder can serve as a simple navigation system using both GPS and non-GPS navigation methods", "citation": "Citations (2)", "departments": ["University of Tokyo", "University of Tokyo"], "authors": ["Hideki Kaji.....http://dblp.org/pers/hd/k/Kaji:Hideki", "Masatoshi Arikawa.....http://dblp.org/pers/hd/a/Arikawa:Masatoshi"], "conf": "mm", "year": "2008", "pages": 4}