{"title": "Directly optimizing evaluation measures in learning to rank.", "fields": ["normalization", "learning to rank", "ranking svm", "discounted cumulative gain", "ranking"], "abstract": "One of the central issues in learning to rank for information retrieval is to develop algorithms that construct ranking models by directly optimizing evaluation measures used in information retrieval such as Mean Average Precision (MAP) and Normalized Discounted Cumulative Gain (NDCG). Several such algorithms including SVM  map   and AdaRank have been proposed and their effectiveness has been verified. However, the relationships between the algorithms are not clear, and furthermore no comparisons have been conducted between them. In this paper, we conduct a study on the approach of directly optimizing evaluation measures in learning to rank for Information Retrieval (IR). We focus on the methods that minimize loss functions upper bounding the basic loss function defined on the IR measures. We first provide a general framework for the study and analyze the existing algorithms of SVM  map   and AdaRank within the framework. The framework is based on upper bound analysis and two types of upper bounds are discussed. Moreover, we show that we can derive new algorithms on the basis of this analysis and create one example algorithm called PermuRank. We have also conducted comparisons between SVM  map  , AdaRank, PermuRank, and conventional methods of Ranking SVM and RankBoost, using benchmark datasets. Experimental results show that the methods based on direct optimization of evaluation measures can always outperform conventional methods of Ranking SVM and RankBoost. However, no significant difference exists among the performances of the direct optimization methods themselves.", "citation": "Citations (125)", "departments": ["Microsoft", "Microsoft", "Nankai University", "Microsoft", "Microsoft"], "authors": ["Jun Xu.....http://dblp.org/pers/hd/x/Xu_0001:Jun", "Tie-Yan Liu.....http://dblp.org/pers/hd/l/Liu:Tie=Yan", "Min Lu.....http://dblp.org/pers/hd/l/Lu:Min", "Hang Li.....http://dblp.org/pers/hd/l/Li_0001:Hang", "Wei-Ying Ma.....http://dblp.org/pers/hd/m/Ma:Wei=Ying"], "conf": "sigir", "year": "2008", "pages": 8}