{"title": "Adaptive Frame Concatenation Mechanisms for QoS in Multi-Rate Wireless Ad Hoc Networks.", "fields": ["service provider", "adaptive quality of service multi hop routing", "concatenation", "data flow diagram", "channel"], "abstract": "Providing quality of service (QoS) to users in a wireless ad-hoc network is a key concern for service providers. With the availability of multiple rates in IEEE 802.11a/b/g wireless LANs, it is desirable to improve the network capacity and temporal fairness by sending multiple consecutive frames (also referred as frame concatenation mechanism) over high rate links, as proposed in opportunistic auto rate (OAR). However, OAR does not consider the effect of frame sizes and may yield unsatisfactory performance for high priority multimedia flows transmitting over low rate links. Therefore, a more appropriate frame concatenation strategy and a corresponding service differentiation scheme should be devised to provide better performance for high priority voice/video flows than low priority data flows, under various channel rate scenarios. In this paper, we first analyze the effect of frame size on the performance of OAR. Then, we propose a general concatenation mechanism (GCM), a more accurate frame concatenation mechanism for multi-rate MAC with better fairness. Finally, we propose two mechanisms: adaptive weighted fair frame concatenation mechanism (AWFCM) and adaptive QoS aware frame concatenation mechanism (AQCM), for supporting service differentiation and QoS in multi-rate wireless ad hoc networks. The primary idea is to adjust the number of concatenated frames based on flow weights/priorities, frame sizes, link rates, and network traffic. Simulation results show that the proposed mechanisms achieve desirable performance on supporting multimedia applications in multi-rate wireless ad-hoc networks.", "citation": "Citations (8)", "departments": ["California State University, Fresno", "University of Alabama", "United States Navy", "Center for REse ... ked communities", "Telecommunications"], "authors": ["Ming Li.....http://dblp.org/pers/hd/l/Li_0007:Ming", "Hua Zhu.....http://dblp.org/pers/hd/z/Zhu:Hua", "Yang Xiao.....http://dblp.org/pers/hd/x/Xiao:Yang", "Imrich Chlamtac.....http://dblp.org/pers/hd/c/Chlamtac:Imrich", "Balakrishnan Prabhakaran.....http://dblp.org/pers/hd/p/Prabhakaran:Balakrishnan"], "conf": "infocom", "year": "2008", "pages": 9}