{"title": "Towards Optimal Resource Allocation in Partial-Fault Tolerant Applications.", "fields": ["cluster analysis", "high availability", "data flow analysis", "network topology", "fault tolerance"], "abstract": "We introduce Zen, a new resource allocation framework that assigns application components to node clusters to achieve high availability for partial-fault tolerant (PFT) applications. These applications have the characteristic that under partial failures, they can still produce useful output though the output quality may be reduced. Thus, the primary goal of resource allocation for PFT applications is to prevent, delay, or minimize the impact of failures on the application output quality. This paper is the first to approach this resource allocation problem from a theoretical perspective, and obtains a series of results regarding component assignments that provide the highest service availability under the constraints imposed by the application data flow graph and the hosting clusters. We show that (1) even simple versions of this resource allocation problem are NP-Hard, (2) a 2-approximate polynomial-time algorithm works for tree topologies, and (3) a simple greedy component placement performs well in practice for general application topologies. We implement a system prototype to study the application availability achieved by Zen compared to failure-oblivious placement, replication, and Zen+replication. Our experimental results show that three PFT applications achieve significant data output quality and availability benefits using Zen.", "citation": "Citations (20)", "departments": ["IBM", "IBM", "IBM", "IBM", "Microsoft"], "authors": ["Nikhil Bansal.....http://dblp.org/pers/hd/b/Bansal:Nikhil", "Ranjita Bhagwan.....http://dblp.org/pers/hd/b/Bhagwan:Ranjita", "Navendu Jain.....http://dblp.org/pers/hd/j/Jain:Navendu", "Yoonho Park.....http://dblp.org/pers/hd/p/Park:Yoonho", "Deepak S. Turaga.....http://dblp.org/pers/hd/t/Turaga:Deepak_S=", "Chitra Venkatramani.....http://dblp.org/pers/hd/v/Venkatramani:Chitra"], "conf": "infocom", "year": "2008", "pages": 9}