{"title": "Automated microprocessor stressmark generation.", "fields": ["thermal management of electronic devices and systems", "control flow", "instruction level parallelism", "maximum power principle", "microprocessor"], "abstract": "Estimating the maximum power and thermal characteristics of a processor is essential for designing its power delivery system, packaging, cooling, and power/thermal management schemes. Typical benchmark suites used in performance evaluation do not stress the processor to its limit though, and current practice in industry is to develop artificial benchmarks that are specifically written to generate maximum processor (component) activity. However, manually developing and tuning so called stressmarks is extremely tedious and time-consuming while requiring an intimate understanding of the processor. A synthetic program that can be tuned to produce a variety of benchmark characteristics would significantly help in addressing this problem by enabling the automatic exploration of the large temperature and power design space. This paper demonstrates that with a suitable choice of only 40 hardware-independent program characteristics related to the instruction mix, instruction-level parallelism, control flow behavior, and memory access patterns, it is possible to generate a synthetic benchmark whose performance relates to that of general-purpose and commercial applications. Leveraging this abstract workload modeling approach, we propose StressMaker, a framework that uses machine learning for the automated generation of stressmarks. A comparison with an exhaustive exploration of a large power design space demonstrates that StressMaker is very effective in automatically generating stressmarks in a limited amount of time.", "citation": "Citations (81)", "departments": ["University of Texas at Austin", "Ghent University", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Ajay M. Joshi.....http://dblp.org/pers/hd/j/Joshi:Ajay_M=", "Lieven Eeckhout.....http://dblp.org/pers/hd/e/Eeckhout:Lieven", "Lizy Kurian John.....http://dblp.org/pers/hd/j/John:Lizy_Kurian", "Ciji Isen.....http://dblp.org/pers/hd/i/Isen:Ciji"], "conf": "hpca", "year": "2008", "pages": 11}