{"title": "Using an Eye-Tracking System to Improve Camera Motions and Depth-of-Field Blur Effects in Virtual Environments.", "fields": ["depth of field", "rendering", "eye tracking", "image sensor", "user centered design"], "abstract": "This paper describes the use of user's focus point to improve some visual effects in virtual environments (VE). First, we describe how to retrieve user's focus point in the 3D VE using an eye-tracking system. Then, we propose the adaptation of two rendering techniques which aim at improving users' sensations during first-person navigation in VE using his/her focus point: (1) a camera motion which simulates eyes movement when walking, i.e., corresponding to vestibulo-ocular and vestibulocollic reflexes when the eyes compensate body and head movements in order to maintain gaze on a specific target, and (2) a depth-of-field (DoF) blur effect which simulates the fact that humans perceive sharp objects only within some range of distances around the focal distance. Second, we describe the results of an experiment conducted to study users' subjective preferences concerning these visual effects during first-person navigation in VE. It showed that participants globally preferred the use of these effects when they are dynamically adapted to the focus point in the VE. Taken together, our results suggest that the use of visual effects exploiting users' focus point could be used in several VR applications involving first- person navigation such as the visit of architectural site, training simulations, video games, etc.", "citation": "Citations (108)", "departments": ["French Institute for Research in Computer Science and Automation", "University of Rennes", "university of lille", "Rennes 1 Univ., Rennes"], "authors": ["Sébastien Hillaire.....http://dblp.org/pers/hd/h/Hillaire:S=eacute=bastien", "Anatole Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Anatole", "Rémi Cozot.....http://dblp.org/pers/hd/c/Cozot:R=eacute=mi", "Géry Casiez.....http://dblp.org/pers/hd/c/Casiez:G=eacute=ry"], "conf": "vr", "year": "2008", "pages": 4}