{"title": "What Can We Learn Privately?", "fields": ["instance based learning", "algorithmic learning theory", "computational learning theory", "statistical classification", "information sensitivity", "ask price", "stability", "probably approximately correct learning", "information privacy", "differential privacy"], "abstract": "Learning problems form an important category of computational tasks that generalizes many of the computations researchers apply to large real-life data sets. We ask, What concept classes can be learned privately, namely, by an algorithm whose output does not depend too heavily on any one input or specific training example? More precisely, we investigate learning algorithms that satisfy differential privacy, a notion that provides strong confidentiality guarantees in contexts where aggregate information is released about a database containing sensitive information about individuals. Our goal is a broad understanding of the resources required for private learning in terms of samples, computation time, and interaction. We demonstrate that, ignoring computational constraints, it is possible to privately agnostically learn any concept class using a sample size approximately logarithmic in the cardinality of the concept class. Therefore, almost anything learnable is learnable privately: specifically, if a concept class is learnable by a (nonprivate) algorithm with polynomial sample complexity and output size, then it can be learned privately using a polynomial number of samples. We also present a computationally efficient private probabilistically approximately correct learner for the class of parity functions. This result dispels the similarity between learning with noise and private learning (both must be robust to small changes in inputs), since parity is thought to be very hard to learn given random classification noise. Local (or randomized response) algorithms are a practical class of private algorithms that have received extensive investigation. We provide a precise characterization of local private learning algorithms. We show that a concept class is learnable by a local algorithm if and only if it is learnable in the statistical query (SQ) model. Therefore, for local private learning algorithms, the similarity to learning with noise is stronger: local learning is equivalent to SQ learning, and SQ algorithms include most known noise-tolerant learning algorithms. Finally, we present a separation between the power of interactive and noninteractive local learning algorithms. Because of the equivalence to SQ learning, this result also separates adaptive and nonadaptive SQ learning.", "citation": "Citations (310)", "departments": ["Pennsylvania State University", "Columbia University", "Ben-Gurion University of the Negev", "Pennsylvania State University", "Pennsylvania State University", "kasivisw@gmail.com", "hk17@columbia.edu", "kobbi@cs.bgu.ac.il", "sofya@cse.psu.e ... th@cse.psu.edu"], "authors": ["Shiva Prasad Kasiviswanathan.....http://dblp.org/pers/hd/k/Kasiviswanathan:Shiva_Prasad", "Homin K. Lee.....http://dblp.org/pers/hd/l/Lee:Homin_K=", "Kobbi Nissim.....http://dblp.org/pers/hd/n/Nissim:Kobbi", "Sofya Raskhodnikova.....http://dblp.org/pers/hd/r/Raskhodnikova:Sofya", "Adam D. Smith.....http://dblp.org/pers/hd/s/Smith:Adam_D="], "conf": "focs", "year": "2008", "pages": 10}