{"title": "Optimizing Star Join Queries for Data Warehousing in Microsoft SQL Server.", "fields": ["language integrated query", "spatial query", "sargable", "query by example", "query plan"], "abstract": "As mainstream data warehouses are growing into the multi-terabyte range, adequate performance for decision support queries remains challenging for database query processors. Proper choice of query plan is essential in data warehouses where fact tables often store billions of rows. This paper discusses query optimization and execution strategies that Microsoft SQL Server employs for decision support queries in dimensionally modeled relational data warehouses. Our approach is based on pattern matching to detect typical star query patterns. When matching the pattern, the optimizer generates additional query plan alternatives specifically optimized for data warehouse performance. For high selectivity queries, the plans use nested loops joins and seeks. Medium selectivity queries in turn rely on right-deep hash joins with bitmap filters. Bitmap filters perform semi-join reductions to efficiently prune out non-qualifying rows early. Final plan choice is left for cost-based optimization which also compares the data warehouse specific plans against conventional query plans. We conducted an extensive experimental investigation using both synthetic workloads and several customer workloads. As our results show, the new plan shapes and execution strategies yield significant performance improvements across the targeted workloads as compared to earlier versions of Microsoft SQL Server.", "citation": "Citations (7)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["César A. Galindo-Legaria.....http://dblp.org/pers/hd/g/Galindo=Legaria:C=eacute=sar_A=", "Torsten Grabs.....http://dblp.org/pers/hd/g/Grabs:Torsten", "Sreenivas Gukal.....http://dblp.org/pers/hd/g/Gukal:Sreenivas", "Steve Herbert.....http://dblp.org/pers/hd/h/Herbert:Steve", "Aleksandras Surna.....http://dblp.org/pers/hd/s/Surna:Aleksandras", "Shirley Wang.....http://dblp.org/pers/hd/w/Wang:Shirley", "Wei Yu.....http://dblp.org/pers/hd/y/Yu:Wei", "Peter Zabback.....http://dblp.org/pers/hd/z/Zabback:Peter", "Shin Zhang.....http://dblp.org/pers/hd/z/Zhang:Shin"], "conf": "icde", "year": "2008", "pages": 10}