{"title": "Infeasibility of instance compression and succinct PCPs for NP.", "fields": ["polynomial hierarchy", "kernelization", "compression", "cryptography", "one way function", "combinatorics", "dominating set", "mathematics", "discrete mathematics", "np", "bounded function", "parameterized complexity", "integer programming", "theoretical computer science"], "abstract": "The OR-SAT problem asks, given Boolean formulae @f\"1,...,@f\"m each of size at most n, whether at least one of the @f\"i's is satisfiable. We show that there is no reduction from OR-SAT to any set A where the length of the output is bounded by a polynomial in n, unless NP@?coNP/poly, and the Polynomial-Time Hierarchy collapses. This result settles an open problem proposed by Bodlaender et al. (2008) [6] and Harnik and Naor (2006) [20] and has a number of implications. (i) A number of parametric NP problems, including Satisfiability, Clique, Dominating Set and Integer Programming, are not instance compressible or polynomially kernelizable unless NP@?coNP/poly. (ii) Satisfiability does not have PCPs of size polynomial in the number of variables unless NP@?coNP/poly. (iii) An approach of Harnik and Naor to constructing collision-resistant hash functions from one-way functions is unlikely to be viable in its present form. (iv) (Buhrman-Hitchcock) There are no subexponential-size hard sets for NP unless NP is in co-NP/poly. We also study probabilistic variants of compression, and show various results about and connections between these variants. To this end, we introduce a new strong derandomization hypothesis, the Oracle Derandomization Hypothesis, and discuss how it relates to traditional derandomization assumptions.", "citation": "Not cited", "year": "2008", "departments": ["Northwestern University", "Northwestern University", "Northwestern University", "University of Toronto", "School of Informatics", "School of Informatics"], "conf": "stoc", "authors": ["Lance Fortnow.....http://dblp.org/pers/hd/f/Fortnow:Lance", "Rahul Santhanam.....http://dblp.org/pers/hd/s/Santhanam:Rahul"], "pages": 10}