{"title": "A small cache of large ranges: Hardware methods for efficiently searching, storing, and updating big dataflow tags.", "fields": ["dataflow", "byte", "cache", "auxiliary memory", "granularity"], "abstract": "Dynamically tracking the flow of data within a microprocessor creates many new opportunities to detect and track malicious or erroneous behavior, but these schemes all rely on the ability to associate tags with all of virtual or physical memory. If one wishes to store large 32-bit tags, multiple tags per data element, or tags at the granularity of bytes rather than words, then directly storing one tag on chip to cover one byte or word (in a cache or otherwise) can be an expensive proposition. We show that dataflow tags in fact naturally exhibit a very high degree of spatial-value locality, an observation we can exploit by storing metadata on ranges of addresses (which cover a non-aligned contiguous span of memory) rather than on individual elements. In fact, a small 128 entry on-chip range cache (with area equivalent to 4 KB of SRAM) hits more than 98% of the time on average. The key to this approach is our proposed method by which ranges of tags are kept in cache in an optimally RLE-compressed form, queried at high speed, swapped in and out with secondary memory storage, and (most important for dataflow tracking) rapidly stitched together into the largest possible ranges as new tags are written on every store, all the while correctly handling the cases of unaligned and overlapping ranges. We examine the effectiveness of this approach by simulating its use in definedness tracking (covering both the stack and the heap), in tracking network-derived dataflow through a multi-language web application, and through a synthesizable prototype implementation.", "citation": "Citations (21)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Mohit Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Mohit", "Banit Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Banit", "Shashidhar Mysore.....http://dblp.org/pers/hd/m/Mysore:Shashidhar", "Jonathan Valamehr.....http://dblp.org/pers/hd/v/Valamehr:Jonathan", "Timothy Sherwood.....http://dblp.org/pers/hd/s/Sherwood:Timothy"], "conf": "micro", "year": "2008", "pages": 12}