{"title": "Adding Capacity Points to a Wireless Mesh Network Using Local Search.", "fields": ["order one network protocol", "gateway address", "wireless mesh network", "switched mesh", "shared mesh"], "abstract": "Wireless mesh network deployments are popular as a cost-effective means to provide broadband connectivity to large user populations. As the network usage grows, network planners need to evolve an existing mesh network to provide additional capacity. In this paper, we study the problem of adding new capacity points (e.g., gateway nodes) to an existing mesh network. We first present a new technique for calculating gateway-limited fair capacity as a function of the contention at each gateway. Then, we present two online gateway placement algorithms that use local search operations to maximize the capacity gain on an existing network. A key challenge is that each gateway's capacity depends on the locations of other gateways and cannot be known in advance of determining a gateway placement. We address this challenge with two placement algorithms with different approaches to estimating the unknown gateway capacities. Our first placement algorithm, MinHopCount, is adapted from a solution to the facility location problem. MinHopCount minimizes path lengths and iteratively estimates the wireless capacity of each gateway location. Our second algorithm, MinContention, is adapted from a solution to the uncapacitated k-median problem and minimizes average contention on mesh nodes, i.e. the number of links in contention range of a mesh node and the number of routes using each link. We show that our gateway placement algorithms outperform a greedy heuristic by up to 64% on realistic topologies. For an example topology, we study the set of all possible gateway placements and find that there is large capacity gain between near-optimal and optimal placements, but the near-optimal placements found by local search are similar in configuration to the optimal.", "citation": "Citations (32)", "departments": ["Rice University", "Hewlett-Packard", "Hewlett-Packard", "Rice University"], "authors": ["Joshua Robinson.....http://dblp.org/pers/hd/r/Robinson:Joshua", "Mustafa Uysal.....http://dblp.org/pers/hd/u/Uysal:Mustafa", "Ram Swaminathan.....http://dblp.org/pers/hd/s/Swaminathan:Ram", "Edward W. Knightly.....http://dblp.org/pers/hd/k/Knightly:Edward_W="], "conf": "infocom", "year": "2008", "pages": 9}