{"title": "Supporting requirements engineering for medical products: early consideration of user-perceived quality.", "fields": ["requirement prioritization", "line of business", "software measurement", "product innovation", "innovation management"], "abstract": "The usability and, more generally, the overall user-perceived quality of medical devices is an important aspect, which is often insufficiently addressed in the corresponding system development activities. Fortunately, the development of new standards like IEC/DIN EN 60601-1-6 is strengthening the focus on usability / user acceptance issues. This paper argues for the need to consider usability and user acceptance issues in early system development phases like the requirements engineering phase. In this paper, an empirically validated new quality model for user satisfaction is described first. The importance of the quality aspects included in this quality model for the medical domain is outlined. Then, the new quality model is used to develop a systematic methodology called Appraisal and Measurement of User Satisfaction (AMUSE), which allows gathering user acceptance information early in system development. The key activities of the AMUSE methodology and typical application scenarios are shown. Further on, the application of AMUSE, which was developed in close cooperation with Siemens Corporate Technology, is demonstrated in a real-world scenario at Siemens Audiologische Technik, a line of business of Siemens Medical Solutions. At the end, the first lessons learned from the application of the AMUSE methodology in this medical domain are discussed.", "citation": "Citations (7)", "departments": ["Fraunhofer Society", "Fraunhofer Society", "Fraunhofer Society", "University of Hamburg", "Fraunhofer Society"], "authors": ["Jörg Dörr.....http://dblp.org/pers/hd/d/D=ouml=rr:J=ouml=rg", "Daniel Kerkow.....http://dblp.org/pers/hd/k/Kerkow:Daniel", "Dennis Landmann.....http://dblp.org/pers/hd/l/Landmann:Dennis", "Christian Graf.....http://dblp.org/pers/hd/g/Graf_0001:Christian", "Christian Denger.....http://dblp.org/pers/hd/d/Denger:Christian", "Anne Hoffmann.....http://dblp.org/pers/hd/h/Hoffmann:Anne"], "conf": "icse", "year": "2008", "pages": 10}