{"title": "On Data-Centric Trust Establishment in Ephemeral Ad Hoc Networks.", "fields": ["mobile ad hoc network", "ephemeral key", "vehicular ad hoc network", "database centric architecture", "computational trust"], "abstract": "We argue that the traditional notion of trust as a relation among entities, while useful, becomes insufficient for emerging data-centric mobile ad hoc networks. In these systems, setting the data trust level equal to the trust level of the data- providing entity would ignore system salient features, rendering applications ineffective and systems inflexible. This would be even more so if their operation is ephemeral, i.e., characterized by short-lived associations in volatile environments. In this paper, we address this challenge by extending the traditional notion of trust to data-centric trust: trustworthiness attributed to node-reported data per se. We propose a framework for data-centric trust establishment: First, trust in each individual piece of data is computed; then multiple, related but possibly contradictory, data are combined; finally, their validity is inferred by a decision component based on one of several evidence evaluation techniques. We consider and evaluate an instantiation of our framework in vehicular networks as a case study. Our simulation results show that our scheme is highly resilient to attackers and converges stably to the correct decision.", "citation": "Citations (355)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Carnegie Mellon University"], "authors": ["Maxim Raya.....http://dblp.org/pers/hd/r/Raya:Maxim", "Panagiotis Papadimitratos.....http://dblp.org/pers/hd/p/Papadimitratos:Panagiotis", "Virgil D. Gligor.....http://dblp.org/pers/hd/g/Gligor:Virgil_D=", "Jean-Pierre Hubaux.....http://dblp.org/pers/hd/h/Hubaux:Jean=Pierre"], "conf": "infocom", "year": "2008", "pages": 9}