{"title": "Leakage-Resilient Cryptography.", "fields": ["stream cipher attack", "homomorphic secret sharing", "side channel attack", "forward secrecy", "fluhrer mantin and shamir attack", "triple des", "information leakage", "stream cipher", "bounded function", "adversary"], "abstract": "We construct a stream-cipher S whose implementation is secure even if a bounded amount of arbitrary (adversarially chosen) information on the internal state ofS is leaked during computation. This captures all possible side-channel attacks on S where the amount of information leaked in a given period is bounded, but overall can be arbitrary large. The only other assumption we make on the implementation of S is that only data that is accessed during computation leaks information. The stream-cipher S generates its output in chunks K 1 , K 2 , . . . and arbitrary but bounded information leakage is modeled by allowing the adversary to adaptively chose a function f l  : {0,1}* rarr {0, 1} lambda  before K l  is computed, she then gets f l (tau l ) where tau l  is the internal state ofS that is accessed during the computation of Kg. One notion of security we prove for S is that Kg is indistinguishable from random when given K 1 ,..., K 1-1 ,f 1 (tau 1  ),..., f l -1(tau l-1 ) and also the complete internal state of S after Kg has been computed (i.e. S is forward-secure). The construction is based on alternating extraction (used in the intrusion-resilient secret-sharing scheme from FOCS'07). We move this concept to the computational setting by proving a lemma that states that the output of any PRG has high HILLpseudoentropy (i.e. is indistinguishable from some distribution with high min-entropy) even if arbitrary information about the seed is leaked. The amount of leakage lambda that we can tolerate in each step depends on the strength of the underlying PRG, it is at least logarithmic, but can be as large as a constant fraction of the internal state of S if the PRG is exponentially hard.", "citation": "Not cited", "departments": ["Sapienza University of Rome", "Centrum Wiskunde & Informatica"], "authors": ["Stefan Dziembowski.....http://dblp.org/pers/hd/d/Dziembowski:Stefan", "Krzysztof Pietrzak.....http://dblp.org/pers/hd/p/Pietrzak:Krzysztof"], "conf": "focs", "year": "2008", "pages": 10}