{"title": "Javert: fully automatic mining of general temporal properties from dynamic traces.", "fields": ["software design", "source code", "correctness", "formal specification", "scalability"], "abstract": "Program specifications are important for many tasks during software design, development, and maintenance. Among these, temporal specifications are particularly useful. They express formal correctness requirements of an application's ordering of specific actions and events during execution, such as the strict alternation of acquisition and release of locks. Despite their importance, temporal specifications are often missing, incomplete, or described only informally. Many techniques have been proposed that  mine  such specifications from execution traces or program source code. However, existing techniques mine only simple patterns, or they mine a single complex pattern that is restricted to a particular set of manually selected events. There is no practical, automatic technique that can mine general temporal properties from execution traces.   In this paper, we present Javert, the first general specification mining framework that can learn, fully automatically, complex temporal properties from execution traces. The key insight behind Javert is that real, complex specifications can be formed by composing instances of small generic patterns, such as the alternating pattern (( ab )) and the resource usage pattern (( ab c) ). In particular, Javert learns simple generic patterns and composes them using  sound  rules to construct large, complex specifications. We have implemented the algorithm in a practical tool and conducted an extensive empirical evaluation on several open source software projects. Our results are promising; they show that Javert is scalable, general, and precise. It discovered many interesting, nontrivial specifications in real-world code that are beyond the reach of existing automatic techniques.", "citation": "Citations (167)", "departments": ["University of California, Davis", "University of California, Davis"], "authors": ["Mark Gabel.....http://dblp.org/pers/hd/g/Gabel:Mark", "Zhendong Su.....http://dblp.org/pers/hd/s/Su:Zhendong"], "conf": "sigsoft", "year": "2008", "pages": 11}