{"title": "Delivering online advertisements inside images.", "fields": ["online advertising", "client side", "idle", "thumbnail", "ranging"], "abstract": "We present in this paper a new channel to deliver online advertisements along with Web images and show a new business model to monetize billions of Web images. The idea is intuitively inspired by image displaying processes on the Web, which typically require people to wait a few seconds before they see full resolution images. This is due to large file sizes and limited network bandwidth. To utilize idle time and the display area, we propose an innovative method for non-intrusively embedding ads into images in a visually pleasant manner. To maintain a smooth user experience, we utilize the thumbnail of the full-resolution image because it is small and visually similar to the full-resolution image. At the client side, a rendering engine first enlarges and blurs the thumbnail, and then blends the pre-chosen ads information into the enlarged image. Based on this idea, we propose three typical scenarios that can adopt the proposed image-advertising mode. More importantly, we can encourage providers of images or other users to participate in our online image ads service by tagging or annotating images. We envision revenue sharing with the providers participating in our service, and we expect that a large number of users will actively submit, tag and annotate images using the system. We have implemented a prototype image ads system, and conducted a series of experiments and user studies to evaluate such a new advertisement channel. The experimental results and user studies show that the proposed online image ad delivery is a non-intrusive ads mode, and the proposed solution is practical. This work also opens multiple new research directions ranging from multimedia to web data mining", "citation": "Citations (12)", "departments": ["Microsoft", "Microsoft", "Microsoft"], "authors": ["Zhiwei Li.....http://dblp.org/pers/hd/l/Li:Zhiwei", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Lei", "Wei-Ying Ma.....http://dblp.org/pers/hd/m/Ma:Wei=Ying"], "conf": "mm", "year": "2008", "pages": 10}