{"title": "WS-AMUSE - web service architecture for multimedia services.", "fields": ["business process execution language", "services computing", "service orientation", "service oriented architecture", "modeling language"], "abstract": "Recently, a move from traditional, network specific multimedia services to IP-based solutions could be observed. Although many of these applications have similar requirements and address the same issues, individual solutions based on specialized protocols are commonly used. This specialization prohibits the extraction and reuse of common services and hinders the interoperability between services and the integration with external components.   A promising approach to overcome these disadvantages is the adoption of the service-oriented paradigm in communication protocols and a modularization into cooperating services. In this paper, we present a generic framework for multimedia applications consisting of a set of reusable Web service components, a modeling language based on finite state automata and a compiler. The results of a BPEL based prototypical implementation of a Voice-over-IP application show that the service oriented approach and the automaton based modeling language can satisfy the above mentioned criteria and ease application development through a higher level of abstraction. On the other hand our benchmarks indicate that current Web service technologies can lead to an insufficient performance, depending on the application scenario. Possible solutions to circumvent these deficiencies are presented at the end of the paper.", "citation": "Citations (8)", "departments": ["Information Technology University", "Information Technology University", "Information Technology University", "Information Technology University", "Siemens"], "authors": ["Andreas Scholz.....http://dblp.org/pers/hd/s/Scholz:Andreas", "Christian Buckl.....http://dblp.org/pers/hd/b/Buckl:Christian", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons", "Alois Knoll.....http://dblp.org/pers/hd/k/Knoll:Alois", "Jörg Heuer.....http://dblp.org/pers/hd/h/Heuer:J=ouml=rg", "Martin Winter.....http://dblp.org/pers/hd/w/Winter:Martin"], "conf": "icse", "year": "2008", "pages": 10}