{"title": "Firewall Compressor: An Algorithm for Minimizing Firewall Policies.", "fields": ["reverse connection", "dmz", "internet security", "context based access control", "application firewall"], "abstract": "A firewall is a security guard placed between a private network and the outside Internet that monitors all incoming and outgoing packets. The function of a firewall is to examine every packet and decide whether to accept or discard it based upon the firewall's policy. This policy is specified as a sequence of (possibly conflicting) rules. When a packet comes to a firewall, the firewall searches for the first rule that the packet matches, and executes the decision of that rule. With the explosive growth of Internet-based applications and malicious attacks, the number of rules in firewalls have been increasing rapidly, which consequently degrades network performance and throughput. In this paper, we propose Firewall Compressor, a framework that can significantly reduce the number of rules in a firewall while keeping the semantics of the firewall unchanged. We make three major contributions in this paper. First, we propose an optimal solution using dynamic programming techniques for compressing one-dimensional firewalls. Second, we present a systematic approach to compressing multi-dimensional firewalls. Last, we conducted extensive experiments to evaluate Firewall Compressor. In terms of effectiveness, Firewall Compressor achieves an average compression ratio of 52.3% on real- life rule sets. In terms of efficiency, Firewall Compressor runs in seconds even for a large firewall with thousands of rules. Moreover, the algorithms and techniques proposed in this paper are not limited to firewalls. Rather, they can be applied to other rule-based systems such as packet filters on Internet routers.", "citation": "Citations (104)", "departments": ["Michigan State University", "Michigan State University", "Michigan State University"], "authors": ["Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Eric Torng.....http://dblp.org/pers/hd/t/Torng:Eric", "Chad R. Meiners.....http://dblp.org/pers/hd/m/Meiners:Chad_R="], "conf": "infocom", "year": "2008", "pages": 5}