{"title": "FlexVol: Flexible, Efficient File Volume Virtualization in WAFL.", "fields": ["virtualization", "snapshot", "storage virtualization", "thin provisioning", "converged storage"], "abstract": "Virtualization is a well-known method of abstracting physical resources and of separating the manipulation and use of logical resources from their underlying implementation. We have used this technique to virtualize file volumes in the WAFL® file system, adding a level of indirection between client-visible volumes and the underlying physical storage. The resulting virtual file volumes, or FlexVol® volumes, are managed independent of lower storage layers. Multiple volumes can be dynamically created, deleted, resized, and reconfigured within the same physical storage container.\n\nWe also exploit this new virtualization layer to provide several powerful new capabilities. We have enhanced SnapMirror®, a tool for replicating volumes between storage systems, to remap storage allocation during transfer, thus optimizing disk layout for the destination storage system. FlexClone® volumes provide writable Snapshot® copies, using a FlexVol volume backed by a Snapshot copy of a different volume. FlexVol volumes also support thin provisioning; a FlexVol volume can have a logical size that exceeds the available physical storage. FlexClone volumes and thin provisioning are a powerful combination, as they allow the creation of light-weight copies of live data sets while consuming minimal storage resources.\n\nWe present the basic architecture of FlexVol volumes, including performance optimizations that decrease the overhead of our new virtualization layer. We also describe the new features enabled by this architecture. Our evaluation of FlexVol performance shows that it incurs only a minor performance degradation compared with traditional, nonvirtualized WAFL volumes. On the industry-standard SPEC SFS benchmark, FlexVol volumes exhibit less than 4% performance overhead, while providing all the benefits of virtualization.", "citation": "Citations (59)", "departments": ["NetApp", "NetApp", "NetApp", "NetApp", "NetApp"], "authors": ["John K. Edwards.....http://dblp.org/pers/hd/e/Edwards:John_K=", "Daniel Ellard.....http://dblp.org/pers/hd/e/Ellard:Daniel", "Craig Everhart.....http://dblp.org/pers/hd/e/Everhart:Craig", "Robert Fair.....http://dblp.org/pers/hd/f/Fair:Robert", "Eric Hamilton.....http://dblp.org/pers/hd/h/Hamilton:Eric", "Andy Kahn.....http://dblp.org/pers/hd/k/Kahn:Andy", "Arkady Kanevsky.....http://dblp.org/pers/hd/k/Kanevsky:Arkady", "James Lentini.....http://dblp.org/pers/hd/l/Lentini:James", "Ashish Prakash.....http://dblp.org/pers/hd/p/Prakash:Ashish", "Keith A. Smith.....http://dblp.org/pers/hd/s/Smith:Keith_A=", "Edward R. Zayas.....http://dblp.org/pers/hd/z/Zayas:Edward_R="], "conf": "usenix", "year": "2008", "pages": 14}