{"title": "seL4: formal verification of an OS kernel.", "fields": ["microkernel", "formal proof", "correctness", "kernel preemption", "compiler"], "abstract": "Complete formal verification is the only known way to guarantee that a system is free of programming errors.   We present our experience in performing the formal, machine-checked verification of the seL4 microkernel from an abstract specification down to its C implementation. We assume correctness of compiler, assembly code, and hardware, and we used a unique design approach that fuses formal and operating systems techniques. To our knowledge, this is the first formal proof of functional correctness of a complete, general-purpose operating-system kernel. Functional correctness means here that the implementation always strictly follows our high-level abstract specification of kernel behaviour. This encompasses traditional design and implementation safety properties such as the kernel will never crash, and it will never perform an unsafe operation. It also proves much more: we can predict precisely how the kernel will behave in every possible situation.   seL4, a third-generation microkernel of L4 provenance, comprises 8,700 lines of C code and 600 lines of assembler. Its performance is comparable to other high-performance L4 kernels.", "citation": "Citations (1,585)", "departments": ["NICTA", "NICTA", "Open Kernel Labs", "NICTA", "NICTA"], "authors": ["Gerwin Klein.....http://dblp.org/pers/hd/k/Klein:Gerwin", "Kevin Elphinstone.....http://dblp.org/pers/hd/e/Elphinstone:Kevin", "Gernot Heiser.....http://dblp.org/pers/hd/h/Heiser:Gernot", "June Andronick.....http://dblp.org/pers/hd/a/Andronick:June", "David Cock.....http://dblp.org/pers/hd/c/Cock:David", "Philip Derrin.....http://dblp.org/pers/hd/d/Derrin:Philip", "Dhammika Elkaduwe.....http://dblp.org/pers/hd/e/Elkaduwe:Dhammika", "Kai Engelhardt.....http://dblp.org/pers/hd/e/Engelhardt:Kai", "Rafal Kolanski.....http://dblp.org/pers/hd/k/Kolanski:Rafal", "Michael Norrish.....http://dblp.org/pers/hd/n/Norrish:Michael", "Thomas Sewell.....http://dblp.org/pers/hd/s/Sewell:Thomas", "Harvey Tuch.....http://dblp.org/pers/hd/t/Tuch:Harvey", "Simon Winwood.....http://dblp.org/pers/hd/w/Winwood:Simon"], "conf": "sosp", "year": "2009", "pages": 14}