{"title": "Capacity of Multi-Hop Wireless Networks with Incomplete Traffic Specification.", "fields": ["job shop scheduling", "traffic generation model", "traffic equations", "network traffic control", "channel capacity"], "abstract": "The capacity of wireless channels has been studied extensively by the information theory community over the years. There have been several efforts to extend this theory to multi-hop wireless networks. One approach to estimating the capacity of multihop wireless networks is to determine asymptotically how the capacity scales as the number of nodes in the network increases. In these models, the traffic is typically assumed to be uniform. Another approach assumes that node locations and channel conditions are known and the question is to determine whether a given traffic matrix can be routed on the wireless network. This usually involves solving jointly, routing, scheduling and power control problems to achieve the given traffic matrix. In practice, it is quite difficult to estimate the traffic matrix and further, the traffic matrix typically changes over time. In this paper, we are given the location of the nodes and the inter-node channel parameters. Instead of being provided a traffic matrix, we are provided with only the total amount of traffic that can originate and terminate at each node in the network. The objective is to determine if there exists a joint routing and scheduling policy that can handle any traffic matrix that satisfies these ingress/egress constraints. We derive necessary and sufficiency conditions for the problem for both the directional and omni-directional antenna cases. We solve the joint routing and scheduling problem for all traffic matrices that satisfy the ingress-egress constraints.", "citation": "Citations (1)", "departments": ["Bell Labs", "Bell Labs", "Microsoft"], "authors": ["Murali S. Kodialam.....http://dblp.org/pers/hd/k/Kodialam:Murali_S=", "T. V. Lakshman.....http://dblp.org/pers/hd/l/Lakshman:T=_V=", "Sudipta Sengupta.....http://dblp.org/pers/hd/s/Sengupta:Sudipta"], "conf": "infocom", "year": "2009", "pages": 5}