{"title": "Distilling Superior Peers in Large-Scale P2P Streaming Systems.", "fields": ["ranking", "popularity", "upload", "server", "peer to peer"], "abstract": "In large-scale peer-to-peer (P2P) live streaming systems with a limited supply of server bandwidth, increasing the amount of upload bandwidth supplied by peers becomes critically important to the \"well being\" of streaming sessions in live channels. Intuitively, two types of peers are preferred to be kept up in a live session: peers that contribute a higher percentage of their upload capacities, and peers that are stable for a long period of time. The fundamental challenge is to identify, and satisfy the needs of, these types of \"superior\" peers in a live session, and to achieve this goal with minimum disruption to the traditional pull-based protocols that real-world live streaming protocols use. In this paper, we conduct a comprehensive and in-depth statistical analysis based on more than 130 GB worth of runtime traces from hundreds of streaming channels in a large- scale real-world live streaming system, UUSee (among the top three commercial systems in popularity in mainland China). Our objective is to discover critical factors that may influence the longevity and bandwidth contribution ratio of peers, using survival analysis techniques such as the Cox proportional hazards model and the Mantel-Haenszel test. Once these influential factors are found, they can be used to form a superiority index to distill superior peers from the general peer population. The index can be used in any way to favor superior peers, and we simulate the use of a simple ranking mechanism in a natural selection algorithm to show the effectiveness of the index, based on a replay of real-world traces from UUSee.", "citation": "Citations (62)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Zimu Liu.....http://dblp.org/pers/hd/l/Liu:Zimu", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Shuqiao Zhao.....http://dblp.org/pers/hd/z/Zhao:Shuqiao"], "conf": "infocom", "year": "2009", "pages": 9}