{"title": "Greed.", "fields": ["grievance", "common good", "insurgency", "financial econometrics", "matching pursuit", "sparse approximation", "horizontal inequality", "investment banking", "income inequality metrics", "ingenuity", "repeated game", "development economics", "social psychology", "military operations other than war", "financial modeling", "business", "greed and fear", "restricted isometry property", "psychological research", "basis pursuit", "elite", "internal conflict", "commodity", "spanish civil war", "sanctions", "cognition", "political repression", "collective action", "diaspora", "resource curse", "sparse matrix", "economic sanctions"], "abstract": "This article presents new results on using a greedy algorithm, orthogonal matching pursuit (OMP), to solve the sparse approximation problem over redundant dictionaries. It provides a sufficient condition under which both OMP and Donoho's basis pursuit (BP) paradigm can recover the optimal representation of an exactly sparse signal. It leverages this theory to show that both OMP and BP succeed for every sparse input signal from a wide class of dictionaries. These quasi-incoherent dictionaries offer a natural generalization of incoherent dictionaries, and the cumulative coherence function is introduced to quantify the level of incoherence. This analysis unifies all the recent results on BP and extends them to OMP. Furthermore, the paper develops a sufficient condition under which OMP can identify atoms from an optimal approximation of a nonsparse signal. From there, it argues that OMP is an approximation algorithm for the sparse problem over a quasi-incoherent dictionary. That is, for every input signal, OMP calculates a sparse approximant whose error is only a small factor worse than the minimal error that can be attained with the same number of terms.", "citation": "Citations (3,313)", "departments": ["University of Texas at Austin", "University of Oxford", "University of Oxford", "University of Oxford", "University of Oxford", "University of Cambridge", "Santa Clara University", "War Studies"], "authors": ["Alli Sadegiani.....http://dblp.org/pers/hd/s/Sadegiani:Alli"], "conf": "siggraph", "year": "2009", "pages": 1}