{"title": "Layered Interval Codes for TCAM-Based Classification.", "fields": ["network packet", "redundancy", "disjoint sets", "ternary operation", "content addressable memory", "content addressable storage"], "abstract": "Ternary content-addressable memories (TCAMs) are increasingly used for high-speed packet classification. TCAMs compare packet headers against all rules in a classification database in parallel and thus provide high throughput. TCAMs are not well-suited, however, for representing rules that contain range fields and prior art algorithms typically represent each such rule by multiple TCAM entries. The resulting range expansion can dramatically reduce TCAM utilization because it introduces a large number of redundant TCAM entries. This redundancy can be mitigated by making use of extra bits, available in each TCAM entry. We present a scheme for constructing efficient representations of range rules, based on the simple observation that sets of disjoint ranges may be encoded much more efficiently than sets of overlapping ranges. Since the ranges in real-world classification databases are, in general, non-disjoint, the algorithms we present split ranges between multiple layers each of which consists of mutually disjoint ranges. Each layer is then coded independently and assigned its own set of extra bits. Our layering algorithms are based on approximations for specific variants of interval-graph coloring. We evaluate these algorithms by performing extensive comparative analysis on real-life classification databases. Our analysis establishes that our algorithms reduce the number of redundant TCAM entries caused by range rules by more than 60% as compared with best range-encoding prior art.", "citation": "Citations (53)", "departments": ["Technion – Israel Institute of Technology", "Ben-Gurion University of the Negev", "Interdisciplinary Center Herzliya", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Interdisciplinary Center Herzliya", "Interdisciplinary Center Herzliya", "Hebrew University of Jerusalem", "Ben-Gurion University of the Negev", "Sch. of Comput. ... enter, Herzliya"], "authors": ["Anat Bremler-Barr.....http://dblp.org/pers/hd/b/Bremler=Barr:Anat", "David Hay.....http://dblp.org/pers/hd/h/Hay:David", "Danny Hendler.....http://dblp.org/pers/hd/h/Hendler:Danny"], "conf": "infocom", "year": "2009", "pages": 9}