{"title": "Noncooperative Load Balancing in the Continuum Limit of a Dense Network.", "fields": ["nash equilibrium", "bus network", "distributed computing", "shortest path problem", "flow network", "mathematics", "mathematical optimization", "total cost", "load balancing"], "abstract": "In transportation network research, the main ap- proach for predicting traffic distribution due to noncooperative vehicle choices has been through fluid type models. The ba- sic model considers a continuum of infinitesimal \"non-atomic\" vehicles, each seeking the shortest path to its destination. The resulting equilibrium turns out to be much simpler to character- ize in comparison to the finite-vehicle case, yet provides a good approximation to the latter. A less familiar fluid-type model uses a continuum limit for the network topology. The limit network is a continuum plane which inherits its cost structure from the original network, and the corresponding equilibrium is identified as the continuum traffic equilibrium. This paper considers a similar equilibrium notion in a frame- work of a load balancing problem involving two processors, each requiring non-negligible workload (or \"flow\") to be handled by network resources. Besides a congestion cost at each resource (which is identical to both processors), each resource induces a processor-dependent connection cost, which is a function of its geographic location. The processors autonomously route their flow onto the different resources, with the objective of minimizing (non-cooperatively) their total cost. Assuming that the number of resources is relatively large, we apply the continuum approximation within a line (or bus) topology and study the Nash equilibria of the processor interaction. This approximation enables us to explicitly characterize the equilibrium in several cases and to obtain insights on its structure, including tight bounds on the efficiency loss due to noncooperation.", "citation": "Not cited", "departments": ["French Institute for Research in Computer Science and Automation", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan", "Ishai Menache.....http://dblp.org/pers/hd/m/Menache:Ishai", "Asuman E. Ozdaglar.....http://dblp.org/pers/hd/o/Ozdaglar:Asuman_E="], "conf": "infocom", "year": "2009", "pages": 5}