{"title": "Max Regional Aggregate over Sensor Networks.", "fields": ["sampling", "efficient energy use", "energy consumption", "data modeling", "wireless sensor network"], "abstract": "Nowadays, wireless sensor networks are widely used in many environmental monitoring applications. However, due to the limitation of the current hardware technology, sensors are often battery powered and it is very difficult to change batteries. Therefore, for applications over wireless sensor networks, it is a critical issue to save the energy of sensors. Many attempts have been made to answer various types of queries energy-efficiently, such as max, top-k, and skylines. However, all of them return the readings of individual sensors that satisfy the query constraint. In practice, query results based on individual sensor readings are unreliable because sensor readings are often noisy. Thus, in this paper, we present a new type of query, max aggregate query over a region (i.e. max regional aggregate), which aims to find a fixed-size region whose regional aggregate is the maximum among all the possible regions with the same size. Compared to traditional max queries, max regional aggregate is more reliable in detecting events. Designing an energy-efficient approach to answer max regional aggregate is non-trivial because a huge number of regions need to be investigated. Thus, in this paper, we propose a novel two-level sampling approach, with region and sensor sampling, to collect the sensor readings intelligently and compute the approximate max regional aggregate based on the collected results. Specifically, region sampling is used to select regions and sensor sampling isused to choose the sensors within a selected region. Our extensive simulation results demonstrate that the proposed two-level sampling approach can answer the max regional aggregate energy-efficiently with a desirable accuracy.", "citation": "Citations (4)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Yongzhen Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yongzhen", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei"], "conf": "icde", "year": "2009", "pages": 4}