{"title": "DMP: deterministic shared memory multiprocessing.", "fields": ["software development", "debugging", "deterministic system", "nondeterministic algorithm", "multithreading", "multi core processor", "multiprocessing", "code coverage"], "abstract": "Current shared memory multicore and multiprocessor systems are nondeterministic. Each time these systems execute a multithreaded application, even if supplied with the same input, they can produce a different output. This frustrates debugging and limits the ability to properly test multithreaded code, becoming a major stumbling block to the much-needed widespread adoption of parallel programming.   In this paper we make the case for fully deterministic shared memory multiprocessing (DMP). The behavior of an arbitrary multithreaded program on a DMP system is only a function of its inputs. The core idea is to make inter-thread communication fully deterministic. Previous approaches to coping with nondeterminism in multithreaded programs have focused on replay, a technique useful only for debugging. In contrast, while DMP systems are directly useful for debugging by offering repeatability by default, we argue that parallel programs should execute deterministically in the field as well. This has the potential to make testing more assuring and increase the reliability of deployed multithreaded software. We propose a range of approaches to enforcing determinism and discuss their implementation trade-offs. We show that determinism can be provided with little performance cost using our architecture proposals on future hardware, and that software-only approaches can be utilized on existing systems.", "citation": "Citations (339)", "year": "2009", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "conf": "asplos", "authors": ["Joseph Devietti.....http://dblp.org/pers/hd/d/Devietti:Joseph", "Brandon Lucia.....http://dblp.org/pers/hd/l/Lucia:Brandon", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Mark Oskin.....http://dblp.org/pers/hd/o/Oskin:Mark"], "pages": 12}