{"title": "Who's viewed you?: the impact of feedback in a mobile location-sharing application.", "fields": ["human computer interaction", "world wide web", "file sharing", "access control", "ubiquitous computing", "knowledge management", "internet privacy", "social network", "usability", "context awareness"], "abstract": "Feedback is viewed as an essential element of ubiquitous computing systems in the HCI literature for helping people manage their privacy. However, the success of online social networks and existing commercial systems for mobile location sharing which do not incorporate feedback would seem to call the importance of feedback into question. We investigated this issue in the context of a mobile location sharing system. Specifically, we report on the findings of a field de-ployment of Locyoution, a mobile location sharing system. In our study of 56 users, one group was given feedback in the form of a history of location requests, and a second group was given no feedback at all. Our major contribution has been to show that feedback is an important contributing factor towards improving user comfort levels and allaying privacy concerns. Participants' privacy concerns were reduced after using the mobile location sharing system. Additionally,our study suggests that peer opinion and technical savviness contribute most to whether or not participants thought they would continue to use a mobile location technology.", "citation": "Citations (206)", "year": "2009", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "chi", "authors": ["Janice Y. Tsai.....http://dblp.org/pers/hd/t/Tsai:Janice_Y=", "Patrick Gage Kelley.....http://dblp.org/pers/hd/k/Kelley:Patrick_Gage", "Paul Hankes Drielsma.....http://dblp.org/pers/hd/d/Drielsma:Paul_Hankes", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith", "Jason I. Hong.....http://dblp.org/pers/hd/h/Hong:Jason_I=", "Norman M. Sadeh.....http://dblp.org/pers/hd/s/Sadeh:Norman_M="], "pages": 10}