{"title": "Design and deployment of a hybrid CDN-P2P system for live video streaming: experiences with LiveSky.", "fields": ["live streaming", "latency", "software deployment", "upload", "content delivery network"], "abstract": "We present our design and deployment experiences with LiveSky, a commercially deployed hybrid CDN-P2P live streaming system. CDNs and P2P systems are the common techniques used for live streaming, each having its own set of advantages and disadvantages. LiveSky inherits the best of both worlds: the quality control and reliability of a CDN and the inherent scalability of a P2P system. We address several key challenges in the system design and implementation including (a) dynamic resource scaling while guaranteeing stream quality, (b) providing low startup latency, (c) ease of integration with existing CDN infrastructure, and (d) ensuring network-friendliness and upload fairness in the P2P operation. LiveSky has been commercially deployed and used for several large-scale live streaming events serving more than ten million users in China. We evaluate the performance of LiveSky using data from these real-world deployments. Our results indicate that such a hybrid CDN-P2P system provides quality and user performance comparable to a CDN and effectively scales the system capacity when the user volume exceeds the CDN capacity.", "citation": "Citations (301)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Carnegie Mellon University", "ChinaCache Co., ...  Beijing, China"], "authors": ["Hao Yin.....http://dblp.org/pers/hd/y/Yin:Hao", "Xuening Liu.....http://dblp.org/pers/hd/l/Liu:Xuening", "Tongyu Zhan.....http://dblp.org/pers/hd/z/Zhan:Tongyu", "Vyas Sekar.....http://dblp.org/pers/hd/s/Sekar:Vyas", "Feng Qiu.....http://dblp.org/pers/hd/q/Qiu:Feng", "Chuang Lin.....http://dblp.org/pers/hd/l/Lin:Chuang", "Hui Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Hui", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "mm", "year": "2009", "pages": 10}