{"title": "Database research in computer games.", "fields": ["video game design", "turns rounds and time keeping systems in games", "game programming", "emergent gameplay", "game developer"], "abstract": "This tutorial presents an overview of the data management issues faced by computer games today. While many games do not use databases directly, they still have to process large amounts of data, and could benefit from the application of database technology. Other games, such as massively multiplayer online games (MMOs), must communicate with commercial databases and have their own unique challenges. In this tutorial we will present the state-of-the-art of data management in games that we learned from our interaction with various game studios. We will show how the issues involved motivate current research, and illustrate several possibilities for future work.   Our tutorial will start with a description of data-driven design, which is the source of many of the data management issues that games face. We will show some of the tools that game developers use to create and manage content. We will discuss how this type of design can affect performance, and the data structures and techniques that developers use to ensure that the game is responsive. We will discuss the problem of consistency in games, and how games ensure that players all share the same view of the world. Finally, we will examine some of the engineering issues that game developers have to deal with when interacting with traditional databases. This tutorial is intended to be self-contained, and provides the background necessary for understanding how databases and database technology are relevant to computer games.   This tutorial is accessible to students and researchers who, while perhaps not hardcore gamers themselves, are interested in ways in which they can use their expertise to solve problems in computer games.", "citation": "Citations (7)", "year": "2009", "departments": ["Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University"], "conf": "sigmod", "authors": ["Alan J. Demers.....http://dblp.org/pers/hd/d/Demers:Alan_J=", "Johannes Gehrke.....http://dblp.org/pers/hd/g/Gehrke:Johannes", "Christoph Koch.....http://dblp.org/pers/hd/k/Koch_0001:Christoph", "Ben Sowell.....http://dblp.org/pers/hd/s/Sowell:Ben", "Walker M. White.....http://dblp.org/pers/hd/w/White:Walker_M="], "pages": 4}