{"title": "Fast complete memory consistency verification.", "fields": ["memory architecture", "consistency model", "cache coherence", "atomicity", "sequential consistency"], "abstract": "The verification of an execution against memory consistency is known to be NP-hard. This paper proposes a novel fast memory consistency verification method by identifying a new natural partial order: time order. In multiprocessor systems with store atomicity, a time order restriction exists between two operations whose pending periods are disjoint: the former operation in time order must be observed by the latter operation. Based on the time order restriction, memory consistency verification is localized: for any operation, both inferring related orders and checking related cycles need to take into account only a bounded number of operations. Our method has been implemented in a memory consistency verification tool for CMP (Chip Multi Processor), named LCHECK. The time complexity of the algorithm in LCHECK is O(C p p 2 n 2 ) (where C is a constant, p is the number of processors and n is the number of operations) for soundly and completely checking, and O(p 3 n) for soundly but incompletely checking. LCHECK has been integrated into both pre and post silicon verification platforms of the Godson-3 microprocessor, and many bugs of memory consistency and cache coherence were found with the help of LCHECK.", "citation": "Citations (29)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "University of Science and Technology of China", "Chinese Academy of Sciences"], "authors": ["Yunji Chen.....http://dblp.org/pers/hd/c/Chen:Yunji", "Yi Lv.....http://dblp.org/pers/hd/l/Lv:Yi", "Weiwu Hu.....http://dblp.org/pers/hd/h/Hu:Weiwu", "Tianshi Chen.....http://dblp.org/pers/hd/c/Chen:Tianshi", "Haihua Shen.....http://dblp.org/pers/hd/s/Shen:Haihua", "Pengyu Wang.....http://dblp.org/pers/hd/w/Wang:Pengyu", "Hong Pan.....http://dblp.org/pers/hd/p/Pan:Hong"], "conf": "hpca", "year": "2009", "pages": 12}