{"title": "Fair Routing in Delay Tolerant Networks.", "fields": ["reality mining", "assortativity", "small number", "hop", "delay tolerant networking"], "abstract": "The typical state-of-the-art routing algorithms for delay tolerant networks are based on best next hop hill-climbing heuristics in order to achieve throughput and efficiency. The combination of these heuristics and the social network structure leads the routing to direct most of the traffic through a small subset of good users. For instance, in the SimBet algorithm, the top 10% of users carry out 54% of all the forwards and 85% of all the handovers. This unfair load distribution is not sustainable as it can quickly deplete constraint resources in heavily utilized mobile devices (e.g. storage, battery, budget, etc.). Moreover, because a small number of users carry a significant amount of the traffic, the system is not robust to random failures and attacks. To overcome these inefficiencies, this paper introduces Fair-Route, a routing algorithm for delay tolerant networks inspired by the social processes of perceived interaction strength, where messages are preferably forwarded to users that have a stronger social relation with the target of the message; and assortativity, that limits the exchange of messages to those users with similar \"social status\". We compare the performance of FairRoute to the state-of-the-art algorithms by extensive simulations on the MIT reality mining dataset. The results show that our algorithm outperforms existing algorithms in the de facto benchmark of throughput vs. forwards. Furthermore, it distributes better the load; the top 10% carry out 26% of the forwards and 28% of the handovers without any loss in performance.", "citation": "Citations (131)", "departments": ["Telefónica", "Telefónica", "Telefónica"], "authors": ["Josep M. Pujol.....http://dblp.org/pers/hd/p/Pujol:Josep_M=", "Alberto López Toledo.....http://dblp.org/pers/hd/t/Toledo:Alberto_L=oacute=pez", "Pablo Rodriguez.....http://dblp.org/pers/hd/r/Rodriguez:Pablo"], "conf": "infocom", "year": "2009", "pages": 9}