{"title": "Model evolution by run-time parameter adaptation.", "fields": ["web service", "data modeling", "discrete time and continuous time", "markov chain", "software quality"], "abstract": "Models can help software engineers to reason about design-time decisions before implementing a system. This paper focuses on models that deal with non-functional properties, such as reliability and performance. To build such models, one must rely on numerical estimates of various parameters provided by domain experts or extracted by other similar systems. Unfortunately, estimates are seldom correct. In addition, in dynamic environments, the value of parameters may change over time. We discuss an approach that addresses these issues by keeping models alive at run time and feeding a Bayesian estimator with data collected from the running system, which produces updated parameters. The updated model provides an increasingly better representation of the system. By analyzing the updated model at run time, it is possible to detect or predict if a desired property is, or will be, violated by the running implementation. Requirement violations may trigger automatic reconfigurations or recovery actions aimed at guaranteeing the desired goals. We illustrate a working framework supporting our methodology and apply it to an example in which a Web service orchestrated composition is modeled through a Discrete Time Markov Chain. Numerical simulations show the effectiveness of the approach.", "citation": "Citations (270)", "departments": ["Polytechnic University of Milan", "Polytechnic University of Milan", "Polytechnic University of Milan", "Polytechnic University of Milan"], "authors": ["Ilenia Epifani.....http://dblp.org/pers/hd/e/Epifani:Ilenia", "Carlo Ghezzi.....http://dblp.org/pers/hd/g/Ghezzi:Carlo", "Raffaela Mirandola.....http://dblp.org/pers/hd/m/Mirandola:Raffaela", "Giordano Tamburrelli.....http://dblp.org/pers/hd/t/Tamburrelli:Giordano"], "conf": "icse", "year": "2009", "pages": 11}