{"title": "Cross-tier, label-based security enforcement for web applications.", "fields": ["language integrated query", "enforcement", "computer security model", "security policy", "web application"], "abstract": "This paper presents SELinks, a programming language focused on building secure multi-tier web applications. SELinks provides a uniform programming model, in the style of LINQ and Ruby on Rails, with language syntax for accessing objects residing either in the database or at the server. Object-level security policies are expressed as fully-customizable, first-class  labels  which may themselves be subject to security policies. Access to labeled data is mediated via trusted, user-provided  policy enforcement  functions.   SELinks has two novel features that ensure security policies are enforced correctly and efficiently. First, SELinks implements a type system called Fable that allows a protected object's type to refer to its protecting label. The type system can check that labeled data is never accessed directly by the program without first consulting the appropriate policy enforcement function. Second, SELinks compiles policy enforcement code to database-resident user-defined functions that can be called directly during query processing. Database-side checking avoids transferring data to the server needlessly, while still allowing policies to be expressed in a customizable and portable manner.   Our experience with two sizable web applications, a modelhealth-care database and a secure wiki with fine-grained security policies, indicates that cross-tier policy enforcement in SELinks is flexible, relatively easy to use, and, when compared to a single-tier approach, improves throughput by nearly an order of magnitude. SELinks is freely available.", "citation": "Citations (67)", "year": "2009", "departments": ["University of Maryland, College Park", "Microsoft", "University of Maryland, College Park"], "conf": "sigmod", "authors": ["Brian J. Corcoran.....http://dblp.org/pers/hd/c/Corcoran:Brian_J=", "Nikhil Swamy.....http://dblp.org/pers/hd/s/Swamy:Nikhil", "Michael W. Hicks.....http://dblp.org/pers/hd/h/Hicks:Michael_W="], "pages": 14}