{"title": "CENTAUR: realizing the full potential of centralized wlans through a hybrid data path.", "fields": ["wireless", "scheduling", "software deployment", "random access", "granularity"], "abstract": "Enterprise WLANs have made a dramatic shift towards centralized architectures in the recent past. The reasons for such a change have been ease of management and better design of various control and security functions. The data path of WLANs, however, continues to use the distributed, random-access model, as defined by the popular DCF mechanism of the 802.11 standard. While theoretical results indicate that a centrally scheduled data path can achieve higher efficiency than its distributed counterpart, the likely complexity of such a solution has inhibited practical consideration. In this paper, we take a fresh, implementation and deployment oriented, view in understanding data path choices in enterprise WLANs. We perform extensive measurements to characterize the impact of various design choices, like scheduling granularity on the performance of a centralized scheduler, and identify regions where such a centralized scheduler can provide the best gains.   Our detailed evaluation with scheduling prototypes deployed on two different wireless testbeds indicates that DCF is quite robust in many scenarios, but centralization can play a unique role in 1) mitigating hidden terminals - scenarios which may occur infrequently, but become pain points when they do and 2) exploiting exposed terminals - scenarios which occur more frequently, and limit the potential of successful concurrent transmissions. Motivated by these results, we design and implement CENTAUR - a hybrid data path for enterprise WLANs, that combines the simplicity and ease of DCF with a limited amount of centralized scheduling from a unique vantage point. Our mechanisms do not require client cooperation and can support legacy 802.11 clients.", "citation": "Citations (182)", "departments": ["University of Wisconsin-Madison", "University of Waterloo", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Waterloo"], "authors": ["Vivek Shrivastava.....http://dblp.org/pers/hd/s/Shrivastava:Vivek", "Nabeel Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Nabeel", "Shravan K. Rayanchu.....http://dblp.org/pers/hd/r/Rayanchu:Shravan_K=", "Suman Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Suman", "Srinivasan Keshav.....http://dblp.org/pers/hd/k/Keshav:Srinivasan", "Konstantina Papagiannaki.....http://dblp.org/pers/hd/p/Papagiannaki:Konstantina", "Arunesh Mishra.....http://dblp.org/pers/hd/m/Mishra:Arunesh"], "conf": "mobicom", "year": "2009", "pages": 12}