{"title": "Cube Attacks on Tweakable Black Box Polynomials.", "fields": ["stream cipher attack", "combinatorics", "black box", "side channel attack", "polynomial", "cube", "block cipher", "cube attack", "discrete mathematics", "stream cipher"], "abstract": "Almost any cryptographic scheme can be described by  tweakable polynomials  over  GF  (2), which contain both secret variables (e.g., key bits) and public variables (e.g., plaintext bits or IV bits). The cryptanalyst is allowed to tweak the polynomials by choosing arbitrary values for the public variables, and his goal is to solve the resultant system of polynomial equations in terms of their common secret variables. In this paper we develop a new technique (called a  cube attack  ) for solving such tweakable polynomials, which is a major improvement over several previously published attacks of the same type. For example, on the stream cipher Trivium with a reduced number of initialization rounds, the best previous attack (due to Fischer, Khazaei, and Meier) requires a barely practical complexity of 255 to attack 672 initialization rounds, whereas a cube attack can find the complete key of the same variant in 219 bit operations (which take less than a second on a single PC). Trivium with 735 initialization rounds (which could not be attacked by any previous technique) can now be broken with 230 bit operations. Trivium with 767 initialization rounds can now be broken with 245 bit operations, and the complexity of the attack can almost certainly be further reduced to about 236 bit operations. Whereas previous attacks were heuristic, had to be adapted to each cryptosystem, had no general complexity bounds, and were not expected to succeed on random looking polynomials, cube attacks are provably successful when applied to random polynomials of degree  d  over  n  secret variables whenever the number  m  of public variables exceeds  d  +  log   d   n  . Their complexity is 2  d  *** 1  n  +  n  2 bit operations, which is polynomial in  n  and amazingly low when  d  is small. Cube attacks can be applied to any block cipher, stream cipher, or MAC which is provided as a black box (even when nothing is known about its internal structure) as long as at least one output bit can be represented by (an unknown) polynomial of relatively low degree in the secret and public variables.", "citation": "Citations (370)", "year": "2009", "departments": ["Weizmann Institute of Science", "Weizmann Institute of Science"], "conf": "eurocrypt", "authors": ["Itai Dinur.....http://dblp.org/pers/hd/d/Dinur:Itai", "Adi Shamir.....http://dblp.org/pers/hd/s/Shamir:Adi"], "pages": 22}