{"title": "Learning your identity and disease from research papers: information leaks in genome wide association study.", "fields": ["single nucleotide polymorphism", "genome wide association study", "test statistic", "allele frequency", "genetic association"], "abstract": "Genome-wide association studies (GWAS) aim at discovering the association between genetic variations, particularly single-nucleotide polymorphism (SNP), and common diseases, which is well recognized to be one of the most important and active areas in biomedical research. Also renowned is the privacy implication of such studies, which has been brought into the limelight by the recent attack proposed by Homer et al. Homer's attack demonstrates that it is possible to identify a GWAS participant from the allele frequencies of a large number of SNPs. Such a threat, unfortunately, was found in our research to be significantly understated. In this paper, we show that individuals can actually be identified from even a relatively small set of statistics, as those routinely published in GWAS papers. We present two attacks. The first one extends Homer's attack with a much more powerful test statistic, based on the correlations among different SNPs described by coefficient of determination ( r  2 ). This attack can determine the presence of an individual from the statistics related to a couple of hundred SNPs. The second attack can lead to complete disclosure of hundreds of participants' SNPs, through analyzing the information derived from published statistics. We also found that those attacks can succeed even when the precisions of the statistics are low and part of data is missing. We evaluated our attacks on the real human genomes and concluded that such threats are completely realistic.", "citation": "Citations (159)", "year": "2009", "departments": ["Indiana University Bloomington", "Indiana University Bloomington", "Indiana University Bloomington", "Indiana University Bloomington", "Indiana University Bloomington"], "conf": "ccs", "authors": ["Rui Wang.....http://dblp.org/pers/hd/w/Wang_0010:Rui", "Yong Fuga Li.....http://dblp.org/pers/hd/l/Li:Yong_Fuga", "XiaoFeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:XiaoFeng", "Haixu Tang.....http://dblp.org/pers/hd/t/Tang:Haixu", "Xiao-yong Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiao=yong"], "pages": 11}