{"title": "Quality and efficiency in high dimensional nearest neighbor search.", "fields": ["fixed radius near neighbors", "locality sensitive hashing", "linear space", "best bin first", "nearest neighbor search"], "abstract": "Nearest neighbor (NN) search in high dimensional space is an important problem in many applications. Ideally, a practical solution (i) should be implementable in a relational database, and (ii) its query cost should grow  sub-linearly  with the dataset size, regardless of the data and query distributions. Despite the bulk of NN literature, no solution fulfills both requirements, except  locality sensitive hashing  (LSH). The existing LSH implementations are either rigorous or adhoc.  Rigorous-LSH  ensures good quality of query results, but requires expensive space and query cost. Although  adhoc-LSH  is more efficient, it abandons quality control, i.e., the neighbor it outputs can be  arbitrarily  bad. As a result, currently no method is able to ensure both quality and efficiency simultaneously in practice.   Motivated by this, we propose a new access method called the  locality sensitive B-tree  (LSB-tree) that enables fast high-dimensional NN search with excellent quality. The combination of several LSB-trees leads to a structure called the  LSB-forest  that ensures the same result quality as  rigorous-LSH , but reduces its space and query cost dramatically. The LSB-forest also outperforms  adhoc-LSH , even though the latter has no quality guarantee. Besides its appealing theoretical properties, the LSB-tree itself also serves as an effective index that consumes linear space, and supports efficient updates. Our extensive experiments confirm that the LSB-tree is faster than (i) the state of the art of exact NN search by  two orders of magnitude , and (ii) the best (linear-space) method of approximate retrieval by  an order of magnitude , and at the same time, returns neighbors with much better quality.", "citation": "Citations (197)", "year": "2009", "departments": ["The Chinese University of Hong Kong", "Hong Kong University of Science and Technology", "The Chinese University of Hong Kong", "King Abdullah University of Science and Technology"], "conf": "sigmod", "authors": ["Yufei Tao.....http://dblp.org/pers/hd/t/Tao:Yufei", "Ke Yi.....http://dblp.org/pers/hd/y/Yi:Ke", "Cheng Sheng.....http://dblp.org/pers/hd/s/Sheng_0001:Cheng", "Panos Kalnis.....http://dblp.org/pers/hd/k/Kalnis:Panos"], "pages": 14}