{"title": "Network Pricing and Rate Allocation with Content Provider Participation.", "fields": ["subsidy", "maximization", "activity based costing", "net neutrality", "monopoly"], "abstract": "Pricing content-providers for connectivity to end- users and setting connection parameters based on the price is an evolving model on the Internet. The implications are heavily debated in telecom policy circles, and some advocates of \"Network Neutrality\" have opposed price based differentiation in connectivity. However, pricing content providers can possibly subsidize the end-user's cost of connectivity, and the consequent increase in end-user demand can benefit ISPs and content providers. This paper provides a framework to quantify the precise trade-off in the distribution of benefits among ISPs, content-providers, and end-users. The framework generalizes the well-known utility maximization based rate allocation model, which has been extensively studied as an interplay between the ISP and the end-users, to incorporate pricing of content-providers. We derive the resulting equilibrium prices and data rates in two different ISP market conditions: competition and monopoly. Network neutrality based restriction on content-provider pricing is then modeled as a constraint on the maximum price that can be charged to content-providers. We demonstrate that, in addition to gains in total and end- user surplus, content-provider experiences a net surplus from participation in rate allocation under low cost of connectivity. The surplus gains are, however, limited under monopoly conditions in comparison to competition in the ISP market.", "citation": "Citations (117)", "departments": ["Princeton University", "Princeton University", "Princeton University", "Qualcomm"], "authors": ["Prashanth Hande.....http://dblp.org/pers/hd/h/Hande:Prashanth", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung", "A. Robert Calderbank.....http://dblp.org/pers/hd/c/Calderbank:A=_Robert", "Sundeep Rangan.....http://dblp.org/pers/hd/r/Rangan:Sundeep"], "conf": "infocom", "year": "2009", "pages": 9}