{"title": "On Allocating Goods to Maximize Fairness.", "fields": ["hardness of approximation", "special case", "approximation theory", "log log plot", "approximation algorithm"], "abstract": "We consider the Max-Min Allocation problem: given a set of m agents and a set of n items, where agent A has utility u(A, i) for item i, our goal is to allocate items to agents so as to maximize fairness. Specifically, the utility of an agent is the sum of its utilities for the items it receives, and we seek to maximize the minimum utility of any agent. While this problem has received much attention recently, its approximability has not been well-understood thus far. The best known approximation algorithm achieves a roughly O(\\sqrt m}-approximation, and in contrast, the best known hardness of approximation stands at 2. Our main result is an algorithm that achieves a \\tilde{O}(n^{\\eps})-approximation in time n^{O(1/\\eps)} for any \\eps=\\Omega(log log n/log n). In particular, we obtain a poly-logarithmic approximation in quasi-polynomial time, and for every constant \\eps ≫ 0, we obtain an n^{\\eps}-approximation in polynomial time. Our algorithm also yields a quasi-polynomial time m^{\\eps}-approximation algorithm for any constant \\eps ≫ 0. An interesting technical aspect of our algorithm is that we use as a building block a linear program whose integrality gap is \\Omega(\\sqrt m). We bypass this obstacle by iteratively using the solutions produced by the LP to construct new instances with significantly smaller integrality gaps, eventually obtaining the desired approximation. We also investigate a special case of the problem, where every item has a non-zero utility for at most two agents. This problem is hard to approximate to within any factor better than 2. We give a factor 2-approximation algorithm.", "citation": "Citations (80)", "departments": ["University of Waterloo", "Toyota", "University of Pennsylvania"], "authors": ["Deeparnab Chakrabarty.....http://dblp.org/pers/hd/c/Chakrabarty:Deeparnab", "Julia Chuzhoy.....http://dblp.org/pers/hd/c/Chuzhoy:Julia", "Sanjeev Khanna.....http://dblp.org/pers/hd/k/Khanna:Sanjeev"], "conf": "focs", "year": "2009", "pages": 10}