{"title": "Secure kNN computation on encrypted databases.", "fields": ["secure two party computation", "secure multi party computation", "bus encryption", "software as a service", "performance studies"], "abstract": "Service providers like Google and Amazon are moving into the SaaS (Software as a Service) business. They turn their huge infrastructure into a cloud-computing environment and aggressively recruit businesses to run applications on their platforms. To enforce security and privacy on such a service model, we need to protect the data running on the platform. Unfortunately, traditional encryption methods that aim at providing \"unbreakable\" protection are often not adequate because they do not support the execution of applications such as database queries on the encrypted data. In this paper we discuss the general problem of secure computation on an encrypted database and propose a SCONEDB Secure Computation ON an Encrypted DataBase) model, which captures the execution and security requirements. As a case study, we focus on the problem of k-nearest neighbor (kNN) computation on an encrypted database. We develop a new asymmetric scalar-product-preserving encryption (ASPE) that preserves a special type of scalar product. We use APSE to construct two secure schemes that support kNN computation on encrypted data; each of these schemes is shown to resist practical attacks of a different background knowledge level, at a different overhead cost. Extensive performance studies are carried out to evaluate the overhead and the efficiency of the schemes.", "citation": "Citations (538)", "year": "2009", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong"], "conf": "sigmod", "authors": ["Wai Kit Wong.....http://dblp.org/pers/hd/w/Wong:Wai_Kit", "David Wai-Lok Cheung.....http://dblp.org/pers/hd/c/Cheung:David_Wai=Lok", "Ben Kao.....http://dblp.org/pers/hd/k/Kao:Ben", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos"], "pages": 14}