{"title": "Automatic facial expression recognition on a single 3D face by exploring shape deformation.", "fields": ["data acquisition", "face hallucination", "expression", "three dimensional face recognition", "facial expression"], "abstract": "Facial expression recognition has many applications in multimedia processing and the development of 3D data acquisition techniques makes it possible to identify expressions using 3D shape information. In this paper, we propose an automatic facial expression recognition approach based on a single 3D face. The shape of an expressional 3D face is approximated as the sum of two parts, a basic facial shape component (BFSC) and an expressional shape component (ESC). The BFSC represents the basic face structure and neutral-style shape and the ESC contains shape changes caused by facial expressions. To separate the BFSC and ESC, our method firstly builds a reference face for each input 3D non-neutral face by a learning method, which well represents the basic facial shape. Then, based on the BFSC and the original expressional face, a facial expression descriptor is designed. The surface depth changes are considered in the descriptor. Finally, the descriptor is input into an SVM to recognize the expression. Unlike previous methods which recognize a facial expression with the help of manually labeled key points and/or a neutral face, our method works on a single 3D face without any manual assistance. Extensive experiments are carried out on the BU-3DFE database and comparisons with existing methods are conducted. The experimental results show the effectiveness of our method.", "citation": "Citations (76)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Boqing Gong.....http://dblp.org/pers/hd/g/Gong:Boqing", "Yueming Wang.....http://dblp.org/pers/hd/w/Wang:Yueming", "Jianzhuang Liu.....http://dblp.org/pers/hd/l/Liu:Jianzhuang", "Xiaoou Tang.....http://dblp.org/pers/hd/t/Tang:Xiaoou"], "conf": "mm", "year": "2009", "pages": 4}