{"title": "Portable compiler optimisation across embedded programs and microarchitectures using machine learning.", "fields": ["compiler correctness", "intrinsic function", "interprocedural optimization", "loop optimization", "microarchitecture"], "abstract": "Building an optimising compiler is a difficult and time consuming task which must be repeated for each generation of a microprocessor. As the underlying microarchitecture changes from one generation to the next, the compiler must be retuned to optimise specifically for that new system. It may take several releases of the compiler to effectively exploit a processor's performance potential, by which time a new generation has appeared and the process starts again.   We address this challenge by developing a portable optimising compiler. Our approach employs machine learning to automatically learn the best optimisations to apply for any new program on a new microarchitectural configuration. It achieves this by learning a model off-line which maps a microarchitecture description plus the hardware counters from a single run of the program to the best compiler optimisation passes. Our compiler gains 67% of the maximum speedup obtainable by an iterative compiler search using 1000 evaluations. We obtain, on average, a 1.16x speedup over the highest default optimisation level across an entire microarchitecture configuration space, achieving a 4.3x speedup in the best case. We demonstrate the robustness of this technique by applying it to an extended microarchitectural space where we achieve comparable performance.", "citation": "Citations (103)", "departments": ["University of Edinburgh", "University of Edinburgh", "University of Edinburgh", "French Institute for Research in Computer Science and Automation", "University of Edinburgh"], "authors": ["Christophe Dubach.....http://dblp.org/pers/hd/d/Dubach:Christophe", "Timothy M. Jones.....http://dblp.org/pers/hd/j/Jones_0001:Timothy_M=", "Edwin V. Bonilla.....http://dblp.org/pers/hd/b/Bonilla:Edwin_V=", "Grigori Fursin.....http://dblp.org/pers/hd/f/Fursin:Grigori", "Michael F. P. O'Boyle.....http://dblp.org/pers/hd/o/O=Boyle:Michael_F=_P="], "conf": "micro", "year": "2009", "pages": 11}