{"title": "Quality of experience in distributed interactive multimedia environments: toward a theoretical framework.", "fields": ["interactive media", "quality of experience", "user experience design", "conceptual framework", "modalities"], "abstract": "The past decades have witnessed a rapid growth of Distributed Interactive Multimedia Environments (DIMEs). Despite their intensity of user-involved interaction, the existing evaluation frameworks remain very much system-centric. As a step toward the human-centric paradigm, we present a conceptual framework of Quality of Experience (QoE) in DIMEs, to model, measure, and understand user experience and its relationship with the traditional Quality of Service (QoS) metrics. A multi-displinary approach is taken to build up the framework based on the theoretical results from various fields including psychology, cognitive sciences, sociology, and information technology. We introduce a mapping methodology to quantify the correlations between QoS and QoE, and describe our controlled and uncontrolled studies as illustrating examples. The results present the first deep study to model the multi-facet QoE construct, map the QoS-QoE relationship, and capture the human-centric quality modalities in the context of DIMEs.", "citation": "Citations (205)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Wanmin Wu.....http://dblp.org/pers/hd/w/Wu:Wanmin", "Md. Ahsan Arefin.....http://dblp.org/pers/hd/a/Arefin:Md=_Ahsan", "Raoul Rivas.....http://dblp.org/pers/hd/r/Rivas:Raoul", "Klara Nahrstedt.....http://dblp.org/pers/hd/n/Nahrstedt:Klara", "Renata M. Sheppard.....http://dblp.org/pers/hd/s/Sheppard:Renata_M=", "Zhenyu Yang.....http://dblp.org/pers/hd/y/Yang:Zhenyu"], "conf": "mm", "year": "2009", "pages": 10}