{"title": "An Efficient Algorithm for Measuring Medium- to Large-Sized Flows in Network Traffic.", "fields": ["network packet", "anomaly detection", "static random access memory", "ranging", "traffic engineering"], "abstract": "It has been well recognized that identifying very large flows (i.e., elephants) in a network traffic stream is important for a variety of network applications ranging from traffic engineering to anomaly detection. However, we found that many of these applications have an increasing need to monitor not only the few largest flows (say top 20), but also all of the medium-sized flows (say top 20,000). Unfortunately, existing techniques for identifying elephant flows at high link speeds are not suitable and cannot be trivially extended for identifying the medium-sized flows. In this work, we propose a hybrid SRAM/DRAM algorithm for monitoring all elephant and medium-sized flows with strong accuracy guarantees. We employ a synopsis data structure (sketch) in SRAM to filter out small flows and preferentially sample medium and large flows to a flow table in DRAM. Our key contribution is to show how to maximize the use of SRAM and DRAM available to us by using a SRAM/DRAM hybrid data structure that can achieve more than an order of magnitude higher SRAM efficiency than previous methods. We design a quantization scheme that allows our algorithm to \"read just enough\" from the sketch at SRAM speed, without sacrificing much estimation accuracy. We provide analytical guarantees on the accuracy of the estimation and validate these by means of trace-driven evaluation using real- world packet traces..", "citation": "Citations (4)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Inst, Atlanta, GA"], "authors": ["Ashwin Lall.....http://dblp.org/pers/hd/l/Lall:Ashwin", "Mitsunori Ogihara.....http://dblp.org/pers/hd/o/Ogihara:Mitsunori", "Jun (Jim) Xu.....http://dblp.org/pers/hd/x/Xu:Jun_=Jim="], "conf": "infocom", "year": "2009", "pages": 5}