{"title": "Scheduling in Mobile Ad Hoc Networks with Topology and Channel-State Uncertainty.", "fields": ["mobile ad hoc network", "channel state information", "fair share scheduling", "round robin scheduling", "vehicular ad hoc network", "optimized link state routing protocol", "global network", "network topology", "maximum throughput scheduling"], "abstract": "We study throughput-optimal scheduling/routing over mobile ad-hoc networks with time-varying (fading) channels. Traditional back-pressure algorithms (based on the work by Tassiulas and Ephremides) require instantaneous network state (topology, queues-lengths, and fading channel-state) in order to make scheduling/routing decisions. However, such instantaneous network-wide (global) information is hard to come by in practice, especially when mobility induces a time-varying topology. With information delays and a lack of global network state, different mobile nodes have differing \"views\" of the network, thus inducing uncertainty and inconsistency across mobile nodes in their topology knowledge and network state information. In such a setting, we first characterize the through-optimal rate region and develop a back-pressure-like scheduling algorithm, which we show is throughput-optimal. Then, by partitioning the geographic region spatially into disjoint tiles, and sharing delayed topology and network state information only among mobile nodes currently within each tile, we develop a localized low-complexity scheduling algorithm. The algorithm uses instantaneous local information (the queue length, channel state and current position at a mobile node) along with delayed network state information from nodes that were within its tile (i.e., from nodes that were within a nearby geographic region as opposed to network-wide information). The proposed algorithm is shown to be near- optimal, where the geographic distance over which delayed network-state information is shared determines the provable lower bound on the achievable throughput.", "citation": "Citations (21)", "departments": ["Iowa State University", "University of Texas at Austin", "Iowa State University", "University of Texas at Austin"], "authors": ["Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei", "Sanjay Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Sanjay"], "conf": "infocom", "year": "2009", "pages": 9}