{"title": "Personalized movie recommendation.", "fields": ["ranking", "collaborative filtering", "mean absolute error", "multimedia information retrieval", "information retrieval", "recommender system", "information access", "personalization", "remainder", "trailer"], "abstract": "Facing the vast amount of novel production in the movie industry, people are in favor of choosing their favorite candidates quickly and previewing movie contents conveniently so as to decide whether they appeal to their personal taste. To meet this growing need, researchers are paying more attention on Personalization and Recommendation, the new trends of multimedia information retrieval, by integrating content and contextual information. In this paper, we propose a hierarchical framework for personalized movie recommendation. First, movie weekly ranking information is utilized for movie association and recommendation. Then, an integrated graph with both movie content and user preference is constructed to generate dynamic movie synopsis for personalized navigation. The superiorities of the proposed method have two aspects: 1) The prior knowledge independent recommendation scheme is implemented to replace the traditional ranking method for novel information access; 2) Personalized movie synopsis is interactively produced to replace the current movie trailer for preview. The promising results of subjective evaluation indicate that the proposed framework can discover the latent relationship between movies as well as movie highlights and therefore provide personalized movie recommendation to effectively lead movie access in an individualized manner.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Athens University of Economics and Business", "Athens University of Economics and Business", "Athens University of Economics and Business"], "authors": ["Anan Liu.....http://dblp.org/pers/hd/l/Liu:Anan", "Yongdong Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongdong", "Jintao Li.....http://dblp.org/pers/hd/l/Li:Jintao"], "conf": "mm", "year": "2009", "pages": 4}