{"title": "Capacity of large-scale CSMA wireless networks.", "fields": ["time division multiple access", "schedule", "channel access method", "scalability", "throughput", "distributed coordination function"], "abstract": "In the literature, asymptotic studies of multi-hop wireless network capacity often consider only centralized and deterministic TDMA (time-division multi-access) coordination schemes. There have been fewer studies of the asymptotic capacity of large-scale wireless networks based on CSMA (carrier-sensing multi-access), which schedules transmissions in a distributed and random manner. With the rapid and widespread adoption of CSMA technology, a critical question is that whether CSMA networks can be as scalable as TDMA networks. To answer this question and explore the capacity of CSMA networks, we first formulate the models of CSMA protocols to take into account the unique CSMA characteristics, not captured by existing interference models in the literature. These CSMA models determine the feasible states, and consequently the capacity of CSMA networks. %and are functions of various CSMA parameters. We then study the throughput efficiency of CSMA scheduling as compared to TDMA. Finally, we tune the CSMA parameters so as to maximize the throughput to the optimal order. As a result, we show that CSMA can achieve throughput as Ω(1/√ n ), the same order as optimal centralized TDMA, on uniform random networks. Our CSMA scheme makes use of an efficient backbone-peripheral routing scheme and a careful design of dual carrier-sensing and dual channel scheme. We also address practical implementation issues of our capacity-optimal CSMA scheme.", "citation": "Citations (79)", "departments": ["University College London", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "University of Cambridge", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Chi-Kin Chau.....http://dblp.org/pers/hd/c/Chau:Chi=Kin", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Soung Chang Liew.....http://dblp.org/pers/hd/l/Liew:Soung_Chang"], "conf": "mobicom", "year": "2009", "pages": 12}