{"title": "Transactional memory with strong atomicity using off-the-shelf memory protection hardware.", "fields": ["implementation", "transactional memory", "memory protection", "atomicity", "transaction processing"], "abstract": "This paper introduces a new way to provide strong atomicity in an implementation of transactional memory. Strong atomicity lets us offer clear semantics to programs, even if they access the same locations inside and outside transactions. It also avoids differences between hardware-implemented transactions and software-implemented ones. Our approach is to use off-the-shelf page-level memory protection hardware to detect conflicts between normal memory accesses and transactional ones. This page-level mechanism ensures correctness but gives poor performance because of the costs of manipulating memory protection settings and receiving notifications of access violations. However, in practice, we show how a combination of careful object placement and dynamic code update allows us to eliminate almost all of the protection changes. Existing implementations of strong atomicity in software rely on detecting conflicts by conservatively treating some non-transactional accesses as short transactions. In contrast, our page-level mechanism lets us be less conservative about how non-transactional accesses are treated; we avoid changes to non-transactional code until a possible conflict is detected dynamically, and we can respond to phase changes where a given instruction sometimes generates conflicts and sometimes does not. We evaluate our implementation with C# versions of many of the STAMP benchmarks, and show how it performs within 25% of an implementation with weak atomicity on all the benchmarks we have studied. It avoids pathological cases in which other implementations of strong atomicity perform poorly.", "citation": "Citations (148)", "year": "2009", "departments": ["University of California, Santa Cruz", "Microsoft", "University of Michigan"], "conf": "ppopp", "authors": ["Martín Abadi.....http://dblp.org/pers/hd/a/Abadi:Mart=iacute=n", "Tim Harris.....http://dblp.org/pers/hd/h/Harris_0001:Tim", "Mojtaba Mehrara.....http://dblp.org/pers/hd/m/Mehrara:Mojtaba"], "pages": 12}