{"title": "A Provenance-Based Approach to Resource Discovery in Distributed Molecular Dynamics Workflows.", "fields": ["provenance", "metadata", "distributed computing environment", "in silico", "workflow"], "abstract": "The major challenge of in silico experiments consists in exploiting the amount of data generated by scientific apparatus. Scientific data, programs and workflows are resources to be exchanged among scientists but difficult to be efficiently used due to their heterogeneous and distributed nature. Provenance metadata can ease the discovery of these resources. However, keeping track of the execution of experiments and capturing provenance among distributed resources are not simple tasks. Thus, discovering scientific resources in distributed environments is still a challenge. This work presents an architecture to help the execution of scientific experiments in distributed environments. Additionally, it captures and stores provenance of the workflow execution in a repository. To validate the proposed architecture, a bioinformatics workflow has been defined for the execution of a real molecular dynamics simulation experiment, called GromDFlow. The experiment highlights the advantages of this architecture, which is available and is being used for several simulations.", "citation": "Citations (3)", "departments": ["Federal University of Rio de Janeiro", "Federal University of Rio de Janeiro", "Federal University of Rio de Janeiro", "Federal University of Rio de Janeiro", "Federal University of Rio de Janeiro"], "authors": ["Sérgio Manuel Serra da Cruz.....http://dblp.org/pers/hd/c/Cruz:S=eacute=rgio_Manuel_Serra_da", "Patrícia M. Barros.....http://dblp.org/pers/hd/b/Barros:Patr=iacute=cia_M=", "Paulo Mascarello Bisch.....http://dblp.org/pers/hd/b/Bisch:Paulo_Mascarello", "Maria Luiza Machado Campos.....http://dblp.org/pers/hd/c/Campos:Maria_Luiza_Machado", "Marta Mattoso.....http://dblp.org/pers/hd/m/Mattoso:Marta"], "conf": "vldb", "year": "2009", "pages": 15}