{"title": "Hardware-software integrated approaches to defend against software cache-based side channel attacks.", "fields": ["cache invalidation", "pipeline burst cache", "bus sniffing", "smart cache", "cache pollution"], "abstract": "Software cache-based side channel attacks present serious threats to modern computer systems. Using caches as a side channel, these attacks are able to derive secret keys used in cryptographic operations through legitimate activities. Among existing countermeasures, software solutions are typically application specific and incur substantial performance overhead. Recent hardware proposals including the Partition-Locked cache (PLcache) and Random-Permutation cache (RPcache) [23], although very effective in reducing performance overhead while enhancing the security level, may still be vulnerable to advanced cache attacks. In this paper, we propose three hardware-software approaches to defend against software cache-based attacks - they present different tradeoffs between hardware complexity and performance overhead. First, we propose to use preloading to secure the PLcache. Second, we leverage informing loads, which is a lightweight architectural support originally proposed to improve memory performance, to protect the RPcache. Third, we propose novel software permutation to replace the random permutation hardware in the RPcache. This way, regular caches can be protected with hardware support for informing loads. In our experiments, we analyze various processor models for their vulnerability to cache attacks and demonstrate that even to the processor model that is most vulnerable to cache attacks, our proposed software-hardware integrated schemes provide strong security protection.", "citation": "Citations (83)", "departments": ["University of Central Florida", "Samsung", "Deutsche Telekom", "University of Central Florida"], "authors": ["Jingfei Kong.....http://dblp.org/pers/hd/k/Kong:Jingfei", "Onur Aciiçmez.....http://dblp.org/pers/hd/a/Acii=ccedil=mez:Onur", "Jean-Pierre Seifert.....http://dblp.org/pers/hd/s/Seifert:Jean=Pierre", "Huiyang Zhou.....http://dblp.org/pers/hd/z/Zhou:Huiyang"], "conf": "hpca", "year": "2009", "pages": 12}