{"title": "Approximation Algorithms for Multicommodity-Type Problems with Guarantees Independent of the Graph Size.", "fields": ["distance hereditary graph", "factor critical graph", "generalization", "feedback arc set", "graph bandwidth", "zero sum game", "multi commodity flow problem", "approximation algorithm", "binary logarithm", "clique width"], "abstract": "Linial, London and Rabinovich and Aumann and Rabani proved that the min-cut max-flow ratio for general maximum concurrent flow problems (when there are $k$ commodities) is $O(\\log k)$. Here we attempt to derive a more general theory of Steiner cut and flow problems, and we prove bounds that are poly-logarithmic in $k$ for a much broader class of multicommodity flow and cut problems. Our structural results are motivated by the meta question: Suppose we are given a $poly(\\log n)$ approximation algorithm for a flow or cut problem - when can we give a $poly(\\log k)$ approximation algorithm for a generalization of this problem to a Steiner cut or flow problem? Thus we require that these approximation guarantees be independent of the size of the graph, and only depend on the number of commodities (or the number of terminal nodes in a Steiner cut problem). For many natural applications (when $k = n^{o(1)}$) this yields much stronger guarantees. We construct vertex-sparsifiers that approximately preserve the value of all terminal min-cuts. We prove such sparsifiers exist through zero-sum games and metric geometry, and we construct such sparsifiers through oblivious routing guarantees. These results let us reduce a broad class of multicommodity-type problems to a uniform case (on $k$ nodes) at the cost of a loss of a $poly(\\log k)$ in the approximation guarantee. We then give $poly(\\log k)$ approximation algorithms for a number of problems for which such results were previously unknown, such as requirement cut, l-multicut, oblivious $0$-extension, and natural Steiner generalizations of oblivious routing, min-cut linear arrangement and minimum linear arrangement.", "citation": "Not cited", "departments": ["Massachusetts Institute of Technology"], "authors": ["Ankur Moitra.....http://dblp.org/pers/hd/m/Moitra:Ankur"], "conf": "focs", "year": "2009", "pages": 10}