{"title": "Recursive Computation of Regions and Connectivity in Networks.", "fields": ["operator", "distributed database", "data access", "dynamic network analysis", "tuple"], "abstract": "In recent years, the data management community has begun to consider situations in which data access is closely tied to network routing and distributed acquisition: examples include, sensor networks that execute queries about reachable nodes or contiguous regions, declarative networks that maintain information about shortest paths and reachable endpoints, and distributed and peer-to-peer stream systems that detect associations (e.g., transitive relationships) among data at the distributed sources. In each case, the fundamental operation is to maintain a view over dynamic network state. This view is typically distributed, recursive, and may contain aggregation, e.g., describing transitive connectivity, shortest paths, least costly paths, or region membership.Surprisingly, solutions to computing such views are often domain-specific, expensive, and incomplete. In this paper, we recast the problem as one of incremental recursive view maintenance in the presence of distributed streams of updates to tuples: new stream data becomes insert operations and tuple expirations become deletions. We develop a set of techniques that maintain compact information about tuple derivability or data provenance. We complement this with techniques to reduce communication: aggregate selections to prune irrelevant aggregation tuples, provenance-aware operators that can determine when tuples are no longer derivable and remove them from their state, and shipping operators that greatly reduce the tuple and provenance information being propagated while still maintaining correct answers. We validate our work in a distributed setting with sensor and network router queries, showing significant gains in communication overhead without sacrificing performance.", "citation": "Citations (36)", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania"], "authors": ["Mengmeng Liu.....http://dblp.org/pers/hd/l/Liu:Mengmeng", "Nicholas E. Taylor.....http://dblp.org/pers/hd/t/Taylor:Nicholas_E=", "Wenchao Zhou.....http://dblp.org/pers/hd/z/Zhou:Wenchao", "Zachary G. Ives.....http://dblp.org/pers/hd/i/Ives:Zachary_G=", "Boon Thau Loo.....http://dblp.org/pers/hd/l/Loo:Boon_Thau"], "conf": "icde", "year": "2009", "pages": 12}