{"title": "Capturing propagation of infected program states.", "fields": ["ranking", "computer science", "control flow", "basic block", "theoretical computer science"], "abstract": "Coverage-based fault-localization techniques find the fault-related positions in programs by comparing the execution statistics of passed executions and failed executions. They assess the fault suspiciousness of individual program entities and rank the statements in descending order of their suspiciousness scores to help identify faults in programs. However, many such techniques focus on assessing the suspiciousness of individual program entities but ignore the propagation of infected program states among them. In this paper, we use edge profiles to represent passed executions and failed executions, contrast them to model how each basic block contributes to failures by abstractly propagating infected program states to its adjacent basic blocks through control flow edges. We assess the suspiciousness of the infected program states propagated through each edge, associate basic blocks with edges via such propagation of infected program states, calculate suspiciousness scores for each basic block, and finally synthesize a ranked list of statements to facilitate the identification of program faults. We conduct a controlled experiment to compare the effectiveness of existing representative techniques with ours using standard bench-marks. The results are promising.", "citation": "Citations (121)", "departments": ["University of Hong Kong", "City University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "Hong Kong University of Science and Technology"], "authors": ["Zhenyu Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Zhenyu", "Wing Kwong Chan.....http://dblp.org/pers/hd/c/Chan:Wing_Kwong", "T. H. Tse.....http://dblp.org/pers/hd/t/Tse:T=_H=", "Bo Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Bo", "Xinming Wang.....http://dblp.org/pers/hd/w/Wang:Xinming"], "conf": "sigsoft", "year": "2009", "pages": 10}