{"title": "Distributed Strategies for Channel Allocation and Scheduling in Software-Defined Radio Networks.", "fields": ["radio resource management", "software defined radio", "distributed algorithm", "hash function", "channel allocation schemes"], "abstract": "Equipping wireless nodes with multiple radios can significantly increase the capacity of wireless networks, by making these radios simultaneously transmit over multiple non-overlapping channels. However, due to the limited number of radios and available orthogonal channels, designing efficient channel assignment and scheduling algorithms in such networks is a major challenge. In this paper, we present provably-good distributed algorithms for simultaneous channel allocation of individual links and packet-scheduling, in software-defined radio (SDR) wireless networks. Our distributed algorithms are very simple to implement, and do not require any coordination even among neighboring nodes. A novel access hash function or random oracle methodology is one of the key drivers of our results. With this access hash function, each radio can know the transmitters' decisions for links in its interference set for each time slot without introducing any extra communication overhead between them. Further, by utilizing the inductive-scheduling technique, each radio can also backoff appropriately to avoid collisions. Extensive simulations demonstrate that our bounds are valid in practice.", "citation": "Citations (57)", "departments": ["University of Maryland, College Park", "Virginia Tech", "IBM", "University of Maryland, College Park"], "authors": ["Bo Han.....http://dblp.org/pers/hd/h/Han:Bo", "V. S. Anil Kumar.....http://dblp.org/pers/hd/k/Kumar:V=_S=_Anil", "Madhav V. Marathe.....http://dblp.org/pers/hd/m/Marathe:Madhav_V=", "Srinivasan Parthasarathy.....http://dblp.org/pers/hd/p/Parthasarathy_0002:Srinivasan", "Aravind Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Aravind"], "conf": "infocom", "year": "2009", "pages": 9}