{"title": "Measurement Protocols for Medium-Field Distance Perception in Large-Screen Immersive Displays.", "fields": ["face detection", "immersion", "peripheral", "depth perception", "virtual machine"], "abstract": "How do users of virtual environments perceive virtual space? Many experiments have explored this question, but most of these have used head-mounted immersive displays. This paper reports an experiment that studied large-screen immersive displays at medium-field distances of 2 to 15 meters. The experiment measured ego-centric depth judgments in a CAVE, a tiled display wall, and a real-world outdoor field as a control condition. We carefully modeled the outdoor field to make the three environments as similar as possible. Measuring egocentric depth judgments in large-screen immersive displays requires adapting new measurement protocols; the experiment used timed imagined walking, verbal estimation, and triangulated blind walking. We found that depth judgments from timed imagined walking and verbal estimation were very similar in all three environments. However, triangulated blind walking was accurate only in the out-door field; in the large-screen immersive displays it showed under-estimation effects that were likely caused by insufficient physical space to perform the technique. These results suggest using timed imagined walking as a primary protocol for assessing depth perception in large-screen immersive displays. We also found that depth judgments in the CAVE were more accurate than in the tiled display wall, which suggests that the peripheral scenery offered by the CAVE is helpful when perceiving virtual space.", "citation": "Citations (36)", "departments": ["University of California, Berkeley", "Mississippi State University", "United States Naval Research Laboratory", "United States Naval Research Laboratory", "University of California, Berkeley"], "authors": ["Eric Klein.....http://dblp.org/pers/hd/k/Klein:Eric", "J. Edward Swan II.....http://dblp.org/pers/hd/s/Swan_II:J=_Edward", "Greg S. Schmidt.....http://dblp.org/pers/hd/s/Schmidt:Greg_S=", "Mark A. Livingston.....http://dblp.org/pers/hd/l/Livingston:Mark_A=", "Oliver G. Staadt.....http://dblp.org/pers/hd/s/Staadt:Oliver_G="], "conf": "vr", "year": "2009", "pages": 7}