{"title": "Domain Adaptation via Transfer Component Analysis.", "fields": ["kernel", "multi task learning", "subspace topology", "reproducing kernel hilbert space", "parametric statistics", "semi supervised learning", "kernel method", "dimensionality reduction"], "abstract": "Domain adaptation allows knowledge from a source domain to be transferred to a different but related target domain. Intuitively, discovering a good feature representation across domains is crucial. In this paper, we first propose to find such a representation through a new learning method, transfer component analysis (TCA), for domain adaptation. TCA tries to learn some transfer components across domains in a reproducing kernel Hilbert space using maximum mean miscrepancy. In the subspace spanned by these transfer components, data properties are preserved and data distributions in different domains are close to each other. As a result, with the new representations in this subspace, we can apply standard machine learning methods to train classifiers or regression models in the source domain for use in the target domain. Furthermore, in order to uncover the knowledge hidden in the relations between the data labels from the source and target domains, we extend TCA in a semisupervised learning setting, which encodes label information into transfer components learning. We call this extension semisupervised TCA. The main contribution of our work is that we propose a novel dimensionality reduction framework for reducing the distance between domains in a latent space for domain adaptation. We propose both unsupervised and semisupervised feature extraction approaches, which can dramatically reduce the distance between domain distributions by projecting data onto the learned transfer components. Finally, our approach can handle large datasets and naturally lead to out-of-sample generalization. The effectiveness and efficiency of our approach are verified by experiments on five toy datasets and two real-world applications: cross-domain indoor WiFi localization and cross-domain text classification.", "citation": "Citations (915)", "departments": ["Nanyang Technological University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Nanyang Technological University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Inst. of Infoco ... pore, Singapore"], "authors": ["Sinno Jialin Pan.....http://dblp.org/pers/hd/p/Pan:Sinno_Jialin", "Ivor W. Tsang.....http://dblp.org/pers/hd/t/Tsang:Ivor_W=", "James T. Kwok.....http://dblp.org/pers/hd/k/Kwok:James_T=", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "ijcai", "year": "2009", "pages": 6}