{"title": "Jelly: A Language for Building Community-Centric Information Exploration Applications.", "fields": ["information discovery", "exploit", "data modeling", "leverage", "community structure"], "abstract": "Social content sites [3], which integrate traditional content sites (e.g., Yahoo! Travel) with social network features, have recently emerged as a significant new trend on the Web. Users on those sites share content and form various communities based on explicit friendships or shared interests. However, the existing information exploration mechanisms rarely leverage the rich community structure. In this work, we aim to unlock the value of social content sites by helping developers specify community-based information exploration strategies in a flexible and declarative way. Our solution makes use of two key notions, topics and communities, in order to identify socially and semantically relevant information for users. Specifically, we propose JELLY as a language for developing community-centric information exploration applications. JELLY provides several primitives which exploit both content and user behavior in social content sites in order to help users explore relevant content. The topic generation primitive is used to extract topics from tags. The community extraction primitive enables building different user communities. The information discovery primitive helps customize content relevance by combining a user’s query and profile, as well as insights from related communities. Finally, the information explanation primitive offers valuable social provenance to help users better understand the returned content. We describe JELLY’s data model and language, and its application to building a system for finding socially relevant travel destinations in Yahoo! Travel.", "citation": "Citations (10)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Sihem Amer-Yahia.....http://dblp.org/pers/hd/a/Amer=Yahia:Sihem", "Jian Huang.....http://dblp.org/pers/hd/h/Huang:Jian", "Cong Yu.....http://dblp.org/pers/hd/y/Yu_0001:Cong"], "conf": "icde", "year": "2009", "pages": 7}