{"title": "Soft error vulnerability aware process variation mitigation.", "fields": ["soft error", "threshold voltage", "microarchitecture", "process variation", "biasing"], "abstract": "As transistor process technology approaches the nanometer scale, process variation significantly affects the design and optimization of high performance microprocessors. Prior studies have shown that chip operating frequency and leakage power can have large variations due to fluctuations in transistor gate length and sub-threshold voltage. In this work, we study the impact of process variation on microarchitecture soft error robustness, an increasing reliability design challenge in the billion-transistor chip era. We explore two techniques that can effectively mitigate the effect of design parameter variation while significantly enhancing microarchitecture soft error reliability. Our first technique is entry-based. It tolerates the deleterious impact of variable latency techniques on soft error reliability by reducing the quantity and residency cycle of vulnerable bits in the microarchitecture structure at a fine granularity. Our second technique is structure-based. It applies body biasing schemes to dynamically adapt transistor sub-threshold voltage (and hence device-level soft error robustness) to the program reliability characteristics at a coarse granularity. We also combine the two techniques which further produces improved results. Compared to existing process variation tolerant schemes, our proposed techniques achieve optimal trade-offs between reliability, performance, and power. To our knowledge, this paper presents the first study on characterizing and optimizing processor microarchitecture resilience to soft errors in light of process variation.", "citation": "Citations (17)", "departments": ["University of Florida", "University of Florida", "University of Florida"], "authors": ["Xin Fu.....http://dblp.org/pers/hd/f/Fu:Xin", "Tao Li.....http://dblp.org/pers/hd/l/Li:Tao", "José A. B. Fortes.....http://dblp.org/pers/hd/f/Fortes:Jos=eacute=_A=_B="], "conf": "hpca", "year": "2009", "pages": 12}