{"title": "FDAC: Toward Fine-Grained Distributed Data Access Control in Wireless Sensor Networks.", "fields": ["visual sensor network", "key distribution in wireless sensor networks", "mobile wireless sensor network", "compromise", "data security", "cryptographic primitive"], "abstract": "Distributed sensor data storage and retrieval have gained increasing popularity in recent years for supporting various applications. While distributed architecture enjoys a more robust and fault-tolerant wireless sensor network (WSN), such architecture also poses a number of security challenges especially when applied in mission-critical applications such as battlefield and e-healthcare. First, as sensor data are stored and maintained by individual sensors and unattended sensors are easily subject to strong attacks such as physical compromise, it is significantly harder to ensure data security. Second, in many mission-critical applications, fine-grained data access control is a must as illegal access to the sensitive data may cause disastrous results and/or be prohibited by the law. Last but not least, sensor nodes usually are resource-constrained, which limits the direct adoption of expensive cryptographic primitives. To address the above challenges, we propose, in this paper, a distributed data access control scheme that is able to enforce fine-grained access control over sensor data and is resilient against strong attacks such as sensor compromise and user colluding. The proposed scheme exploits a novel cryptographic primitive called attribute-based encryption (ABE), tailors, and adapts it for WSNs with respect to both performance and security requirements. The feasibility of the scheme is demonstrated by experiments on real sensor platforms. To our best knowledge, this paper is the first to realize distributed fine-grained data access control for WSNs.", "citation": "Citations (175)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Dept. of Electr ... cester, MA, USA", "Dept. of Electr ... cester, MA, USA", "Dept. of ECE, W ... , Worcester, MA", "Dept. of ECE, W ... , Worcester, MA"], "authors": ["Shucheng Yu.....http://dblp.org/pers/hd/y/Yu:Shucheng", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing"], "conf": "infocom", "year": "2009", "pages": 9}