{"title": "FS2You: Peer-Assisted Semi-Persistent Online Storage at a Large Scale.", "fields": ["download", "file sharing", "internet hosting service", "upload", "design objective"], "abstract": "It has been widely acknowledged that online storage systems within the \"cloud\" of the Internet provide services of a substantial value to end users who wish to share files of any sizes within a group. Such online storage services are typically provided by dedicated servers, either in content distribution networks (CDNs) or large data centers. Server bandwidth costs, however, are prohibitive in these cases, especially when serving large volumes of files to a large number of users. Though it seems intuitive to take advantage of peer upload bandwidth to mitigate such server bandwidth costs in a complementary fashion, it is not trivial to design and fine-tune important aspects of such peer- assisted online storage in a real-world large-scale deployment. This paper presents FS2You, a large-scale and real-world online storage system with peer assistance and semi-persistent file availability, in order to dramatically mitigate server bandwidth costs. In this paper, we show a number of challenges involved in such a design objective, our architectural and protocol design in response to these challenges, as well as an extensive measurement study at a large scale to demonstrate the effectiveness of our design, using real-world traces that we have collected. To our knowledge, this paper represents the first attempt to design, implement, and evaluate a new peer-assisted semi-persistent online storage system at a realistic scale. Since the launch of FS2You, it has quickly become one of the most popular online storage systems in mainland China, and a favorite in many online forums across the country. the most well-known one-click hosting systems, deployed a total of 1500 terabytes of online storage in its data centers, in Asia alone. Skyrocketing bandwidth costs from server- based architectures have made it necessary for all online storage systems that remain free of charge to impose certain restrictions, including download bandwidth limits per day, file size limitations, as well as maximum file online available time. Though it may seem intuitive to take advantage of peer bandwidth contributions to mitigate server bandwidth costs, the architectural and protocol design of such a peer-assisted online storage system should not be taken lightly. It is nev- ertheless non-trivial to design and fine-tune a new system that utilizes peer bandwidth contributions in a complementary fashion, without sacrificing the ease of use, reliability, and performance of one-click hosting. Further, peer bandwidth contributions should be used in a completely transparent manner, while still minimizing server bandwidth costs for serving more popular files. The architectural design should be able to scale to a large number of users, and withstand the test of real-world usage over a long period of time. In this paper, we present FS2You (1), a real-world online storage system that we have designed, implemented, and deployed to provide one-click hosting services with peer bandwidth assistance. FS2You is designed to dramatically mitigate server bandwidth costs, while maintaining the ease of use and performance comparable to the best server-based solutions. In response to a number of fundamental challenges, we present the architectural and protocol design in our system, and carry out an extensive measurement study to evaluate its performance, based on real-world traces involving millions of users over a long period of time. Since the launch of FS2You, it has quickly become one of most popular online storage systems in mainland China. We describe detailed design elements in this system, and analyze the reasons motivating its performance benefits and popularity. To the best of our knowledge, this paper represents a first attempt in the literature to design, implement, deploy, and evaluate a real-world peer-assisted online storage system, supported by large volumes of measurement traces. We are convinced that this work is of substantial value to obtain an in-depth understanding of how peer bandwidth contributions may be utilized in a complementary manner.", "citation": "Citations (55)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Ye Sun.....http://dblp.org/pers/hd/s/Sun:Ye", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Xinyan Zhang.....http://dblp.org/pers/hd/z/Zhang:Xinyan"], "conf": "infocom", "year": "2009", "pages": 9}