{"title": "A Sybilproof Indirect Reciprocity Mechanism for Peer-to-Peer Networks.", "fields": ["reputation system", "reputation", "reciprocity", "peer to peer"], "abstract": "Although direct reciprocity (Tit-for-Tat )c ontribu- tion systems have been successful in reducing freeloading in peer- to-peer overlays, it has been shown that, unless the contribution network is dense, they tend to be slow (or may even fail) to converge (1). On the other hand, current indirect reciprocity mechanisms based on reputation systems tend to be susceptible to sybil attacks, peer slander and whitewashing. In this paper we present PledgeRoute, an accounting mech- anism for peer contributions that is based on social capital. This mechanism allows peers to contribute resources to one set of peers and use this contribution to obtain services from a different set of peers, at a different time. PledgeRoute is completely decentralised, can be implemented in both structured and unstructured peer-to-peer systems, and it is resistant to the three kinds of attacks mentioned above. To achieve this, we model contribution transitivity as a routing problem in the contribution network of the peer-to-peer overlay, and we present arguments for the routing behaviour and the sybilproofness of our contribution transfer procedures on this basis. Additionally, we present mechanisms for the seeding of the contribution network, and a combination of incentive mechanisms and reciprocation policies that motivate peers to adhere to the protocol and maximise their service contributions to the overlay.", "citation": "Citations (62)", "departments": ["University College London", "University College London", "University College London", "University College London", "University College London"], "authors": ["Raul Landa.....http://dblp.org/pers/hd/l/Landa:Raul", "David Griffin.....http://dblp.org/pers/hd/g/Griffin_0001:David", "Richard G. Clegg.....http://dblp.org/pers/hd/c/Clegg:Richard_G=", "Eleni Mykoniati.....http://dblp.org/pers/hd/m/Mykoniati:Eleni", "Miguel Rio.....http://dblp.org/pers/hd/r/Rio:Miguel"], "conf": "infocom", "year": "2009", "pages": 9}