{"title": "Learning to detect unseen object classes by between-class attribute transfer.", "fields": ["face detection", "contextual image classification", "training set", "learning object", "disjoint sets"], "abstract": "We study the problem of object classification when training and test classes are disjoint, i.e. no training examples of the target classes are available. This setup has hardly been studied in computer vision research, but it is the rule rather than the exception, because the world contains tens of thousands of different object classes and for only a very few of them image, collections have been formed and annotated with suitable class labels. In this paper, we tackle the problem by introducing attribute-based classification. It performs object detection based on a human-specified high-level description of the target objects instead of training images. The description consists of arbitrary semantic attributes, like shape, color or even geographic information. Because such properties transcend the specific learning task at hand, they can be pre-learned, e.g. from image datasets unrelated to the current task. Afterwards, new classes can be detected based on their attribute representation, without the need for a new training phase. In order to evaluate our method and to facilitate research in this area, we have assembled a new large-scale dataset, “Animals with Attributes”, of over 30,000 animal images that match the 50 classes in Osherson's classic table of how strongly humans associate 85 semantic attributes with animal classes. Our experiments show that by using an attribute layer it is indeed possible to build a learning object detection system that does not require any training images of the target classes.", "citation": "Citations (1,314)", "year": "2009", "departments": ["Max Planck Society", "Max Planck Society", "Max Planck Society"], "conf": "cvpr", "authors": ["Christoph H. Lampert.....http://dblp.org/pers/hd/l/Lampert:Christoph_H=", "Hannes Nickisch.....http://dblp.org/pers/hd/n/Nickisch:Hannes", "Stefan Harmeling.....http://dblp.org/pers/hd/h/Harmeling:Stefan"], "pages": 8}