{"title": "Using NEMO to Support the Global Reachability of MANET Nodes.", "fields": ["mobile ad hoc network", "routing protocol", "optimized link state routing protocol", "testbed", "architecture"], "abstract": "Mobile ad hoc network (MANET) routing protocols have been the focus of an accomplished research effort for many years within the networking community and now the results of this effort are beginning to show. With protocol development maturing (and now typically concentrating on a smaller number of standardised routing protocols), increasing numbers of deployment successes are materialising. However, despite these successes and the relative stability of the protocol implementations, seamlessly incorporating MANETs into the Internet still presents many challenges that have hindered their deployment in important mobile scenarios. In this paper we discuss the inherent properties that have affected the adoption of MANET solutions and present an innovative new protocol which has been designed to comprehensively address these challenges. Using performance results acquired from our experimental testbed, we demonstrate how our approach can be used to produce MANET solutions that are highly suited to use in synergy with the current Internet architecture. Our protocol is based on the concept of integrating MANET routing protocols with network mobility (NEMO) technologies to produce what is termed a MANEMO solution. This has meant that by utilising the properties of both of these technologies we have been able to realise a solution that provides mobile networks with the efficient localised communication and robustness of MANETs, as well as the global reachability and the ability to provide structured AAA that a NEMO approach can support.", "citation": "Citations (14)", "departments": ["Lancaster University", "Lancaster University", "Lancaster University"], "authors": ["Ben McCarthy.....http://dblp.org/pers/hd/m/McCarthy:Ben", "Christopher Edwards.....http://dblp.org/pers/hd/e/Edwards:Christopher", "Martin Dunmore.....http://dblp.org/pers/hd/d/Dunmore:Martin"], "conf": "infocom", "year": "2009", "pages": 9}