{"title": "An Information-Theoretic Characterization of Weighted alpha-Proportional Fairness.", "fields": ["proportionally fair", "kullback leibler divergence", "max min fairness", "optimization problem", "fairness measure"], "abstract": "This paper provides a novel characterization of fairness concepts in network resource allocation problems from the viewpoint of information theory. The fundamental idea adopted in this paper is to characterize the utility functions used in optimization problems, which motivate fairness concepts, based on a trade-off between user and system satisfaction. Here, user satisfaction is evaluated using information divergence measures that were originally used in information theory to evaluate the difference between two probability distributions. In this paper, information divergence measures are applied to evaluate the difference between the implemented resource allocation and a requested resource allocation. The requested resource allocation is assumed to be ideal in some sense from the user's point of view. Also, system satisfaction is evaluated based on the efficiency of the implemented resource utilization, which is defined as the total amount of resources allocated to each user. The results discussed in this paper indicate that the well-known fairness concept called weighted alpha-proportional fairness can be characterized using the alpha-divergence measure, which is a general class of information divergence measures, as an equilibrium of the trade-off described above. In the process of obtaining these results, we also obtained a new utility function that has a parameter to control the trade-off. This new function is then applied to typical examples to solve resource allocation problems in simple network models such as those for two-link networks and wireless LANs.", "citation": "Citations (26)", "departments": ["Kyushu Institute of Technology", "University of Massachusetts Amherst"], "authors": ["Masato Uchida.....http://dblp.org/pers/hd/u/Uchida:Masato", "Jim Kurose.....http://dblp.org/pers/hd/k/Kurose:Jim"], "conf": "infocom", "year": "2009", "pages": 9}