{"title": "Beyond homogeneous decomposition: scaling long-range forces on Massively Parallel Systems.", "fields": ["partitioned global address space", "global arrays", "massively parallel", "ranging", "work stealing"], "abstract": "With supercomputers anticipated to expand from thousands to millions of cores, one of the challenges facing scientists is how to effectively utilize this ever-increasing number. We report here an approach that creates a heterogeneous decomposition by partitioning effort according to the scaling properties of the component algorithms. We demonstrate our strategy by developing a capability to model hot dense plasma. We have performed benchmark calculations ranging from millions to billions of charged particles, including a 2.8 billion particle simulation that achieved 259.9 TFlop/s (26% of peak performance) on the 294,912 cpu JUGENE computer at the Julich Supercomputing Centre in Germany. With this unprecedented simulation capability we have begun an investigation of plasma fusion physics under conditions where both theory and experiment are lacking--in the strongly-coupled regime as the plasma begins to burn.   Our strategy is applicable to other problems involving long-range forces (i.e., biological or astrophysical simulations). We believe that the flexible heterogeneous decomposition approach demonstrated here will allow many problems to scale across current and next-generation machines.", "citation": "Citations (22)", "year": "2009", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory"], "conf": "sc", "authors": ["David F. Richards.....http://dblp.org/pers/hd/r/Richards:David_F=", "James N. Glosli.....http://dblp.org/pers/hd/g/Glosli:James_N=", "Bor Chan.....http://dblp.org/pers/hd/c/Chan:Bor", "Milo R. Dorr.....http://dblp.org/pers/hd/d/Dorr:Milo_R=", "Erik W. Draeger.....http://dblp.org/pers/hd/d/Draeger:Erik_W=", "Jean-Luc Fattebert.....http://dblp.org/pers/hd/f/Fattebert:Jean=Luc", "William D. Krauss.....http://dblp.org/pers/hd/k/Krauss:William_D=", "Thomas E. Spelce.....http://dblp.org/pers/hd/s/Spelce:Thomas_E=", "Frederick H. Streitz.....http://dblp.org/pers/hd/s/Streitz:Frederick_H=", "M. P. Surh.....http://dblp.org/pers/hd/s/Surh:M=_P=", "John A. Gunnels.....http://dblp.org/pers/hd/g/Gunnels:John_A="], "pages": -1}