{"title": "Polynomial Hierarchy, Betti Numbers and a Real Analogue of Toda's Theorem.", "fields": ["fp", "pp", "polynomial time reduction", "toda s theorem", "up", "complexity class", "polynomial hierarchy", "ph", "np easy"], "abstract": "Toda (in SIAM J. Comput. 20(5):865–877, 1991) proved in 1989 that the (discrete) polynomial time hierarchy, PH, is contained in the class P #P , namely the class of languages that can be decided by a Turing machine in polynomial time given access to an oracle with the power to compute a function in the counting complexity class #P. This result, which illustrates the power of counting, is considered to be a seminal result in computational complexity theory. An analogous result in the complexity theory over the reals (in the sense of Blum–Shub–Smale real machines in Bull. Am. Math. Soc. (NS) 21(1): 1–46, 1989) has been missing so far. In this paper we formulate and prove a real analogue of Toda’s theorem. Unlike Toda’s proof in the discrete case, which relied on sophisticated combinatorial arguments, our proof is topological in nature. As a consequence of our techniques, we are also able to relate the computational hardness of two extremely well-studied problems in algorithmic semi-algebraic geometry: the problem of deciding sentences in the first-order theory of the reals with a constant number of quantifier alternations, and that of computing Betti numbers of semi-algebraic sets. We obtain a polynomial time reduction of the compact version of the first problem to the second. This latter result may be of independent interest to researchers in algorithmic semi-algebraic geometry.", "citation": "Citations (14)", "departments": ["Purdue University", "Lenoir–Rhyne University", "Purdue University", "Lenoir–Rhyne University"], "authors": ["Saugata Basu.....http://dblp.org/pers/hd/b/Basu:Saugata", "Thierry Zell.....http://dblp.org/pers/hd/z/Zell:Thierry"], "conf": "focs", "year": "2009", "pages": 10}