{"title": "Routing Questions to the Right Users in Online Communities.", "fields": ["wait", "question answering", "online community", "thread", "user generated content"], "abstract": "Online forums contain huge amounts of valuable user-generated content. In current forum systems, users have to passively wait for other users to visit the forum systems and read/answer their questions. The user experience for question answering suffers from this arrangement. In this paper, we address the problem of \"pushing\" the right questions to the right persons, the objective being to obtain quick, high-quality answers, thus improving user satisfaction. We propose a framework for the efficient and effective routing of a given question to the top-k potential experts (users) in a forum, by utilizing both the content and structures of the forum system. First, we compute the expertise of users according to the content of the forum system—-this is to estimate the probability of a user being an expert for a given question based on the previous question answering of the user. Specifically, we design three models for this task, including a profile-based model, a thread-based model, and a cluster-based model. Second, we re-rank the user expertise measured in probability by utilizing the structural relations among users in a forum system. The results of the two steps can be integrated naturally in a probabilistic model that computes a final ranking score for each user. Experimental results show that the proposals are very promising.", "citation": "Citations (120)", "departments": ["Peking University", "Aalborg University", "Peking University", "Aalborg University", "Peking University"], "authors": ["Yanhong Zhou.....http://dblp.org/pers/hd/z/Zhou:Yanhong", "Gao Cong.....http://dblp.org/pers/hd/c/Cong:Gao", "Bin Cui.....http://dblp.org/pers/hd/c/Cui_0001:Bin", "Christian S. Jensen.....http://dblp.org/pers/hd/j/Jensen:Christian_S=", "Junjie Yao.....http://dblp.org/pers/hd/y/Yao:Junjie"], "conf": "icde", "year": "2009", "pages": 12}