{"title": "Every microsecond counts: tracking fine-grain latencies with a lossy difference aggregator.", "fields": ["lossy compression", "netflow", "microsecond", "simple network management protocol", "latency"], "abstract": "Many network applications have stringent end-to-end latency requirements, including VoIP and interactive video conferencing, automated trading, and high-performance computing---where even microsecond variations may be intolerable. The resulting fine-grain measurement demands cannot be met effectively by existing technologies, such as SNMP, NetFlow, or active probing. We propose instrumenting routers with a hash-based primitive that we call a Lossy Difference Aggregator (LDA) to measure latencies down to tens of microseconds and losses as infrequent as one in a million.   Such measurement can be viewed abstractly as what we refer to as a coordinated streaming problem, which is fundamentally harder than standard streaming problems due to the need to coordinate values between nodes. We describe a compact data structure that efficiently computes the average and standard deviation of latency and loss rate in a coordinated streaming environment. Our theoretical results translate to an efficient hardware implementation at 40 Gbps using less than 1% of a typical 65-nm 400-MHz networking ASIC. When compared to Poisson-spaced active probing with similar overheads, our LDA mechanism delivers orders of magnitude smaller relative error; active probing requires 50--60 times as much bandwidth to deliver similar levels of accuracy.", "citation": "Citations (92)", "year": "2009", "departments": ["Purdue University", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "sigcomm", "authors": ["Ramana Rao Kompella.....http://dblp.org/pers/hd/k/Kompella:Ramana_Rao", "Kirill Levchenko.....http://dblp.org/pers/hd/l/Levchenko:Kirill", "Alex C. Snoeren.....http://dblp.org/pers/hd/s/Snoeren:Alex_C=", "George Varghese.....http://dblp.org/pers/hd/v/Varghese:George"], "pages": 12}