{"title": "Network Coding Meets TCP.", "fields": ["tcp vegas", "tcp westwood plus", "computer network", "tcp acceleration", "computer science", "packet loss", "transmission control protocol", "linear network coding", "zeta tcp"], "abstract": "We propose a mechanism that incorporates network coding into TCP with only minor changes to the protocol stack, thereby allowing incremental deployment. In our scheme, the source transmits random linear combinations of packets currently in the congestion window. At the heart of our scheme is a new interpretation of ACKs - the sink acknowledges every degree of freedom (i.e., a linear combination that reveals one unit of new information) even if it does not reveal an original packet immediately. Such ACKs enable a TCP-compatible sliding-window approach to network coding. Our scheme has the nice property that packet losses are essentially masked from the congestion control algorithm. Our algorithm therefore reacts to packet drops in a smooth manner, resulting in a novel and effective approach for congestion control over networks involving lossy links such as wireless links. Our scheme also allows intermediate nodes to perform re-encoding of the data packets. Our simulations show that our algorithm, with or without re-encoding inside the network, achieves much higher throughput compared to TCP over lossy wireless links. We also establish the soundness and fairness properties of our algorithm. Finally, we present queuing analysis for the case of intermediate node re-encoding.", "citation": "Citations (267)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Harvard University", "University of Porto"], "authors": ["Jay Kumar Sundararajan.....http://dblp.org/pers/hd/s/Sundararajan:Jay_Kumar", "Devavrat Shah.....http://dblp.org/pers/hd/s/Shah:Devavrat", "Muriel Médard.....http://dblp.org/pers/hd/m/M=eacute=dard:Muriel", "Michael Mitzenmacher.....http://dblp.org/pers/hd/m/Mitzenmacher:Michael", "João Barros.....http://dblp.org/pers/hd/b/Barros:Jo=atilde=o"], "conf": "infocom", "year": "2009", "pages": 9}