{"title": "Tensor completion for estimating missing values in visual data.", "fields": ["tensor", "trace", "smoothing", "coordinate descent", "matrix completion", "approximation algorithm"], "abstract": "In this paper, we propose an algorithm to estimate missing values in tensors of visual data. The values can be missing due to problems in the acquisition process or because the user manually identified unwanted outliers. Our algorithm works even with a small amount of samples and it can propagate structure to fill larger missing regions. Our methodology is built on recent studies about matrix completion using the matrix trace norm. The contribution of our paper is to extend the matrix case to the tensor case by proposing the first definition of the trace norm for tensors and then by building a working algorithm. First, we propose a definition for the tensor trace norm that generalizes the established definition of the matrix trace norm. Second, similarly to matrix completion, the tensor completion is formulated as a convex optimization problem. Unfortunately, the straightforward problem extension is significantly harder to solve than the matrix case because of the dependency among multiple constraints. To tackle this problem, we developed three algorithms: simple low rank tensor completion (SiLRTC), fast low rank tensor completion (FaLRTC), and high accuracy low rank tensor completion (HaLRTC). The SiLRTC algorithm is simple to implement and employs a relaxation technique to separate the dependant relationships and uses the block coordinate descent (BCD) method to achieve a globally optimal solution; the FaLRTC algorithm utilizes a smoothing scheme to transform the original nonsmooth problem into a smooth one and can be used to solve a general tensor trace norm minimization problem; the HaLRTC algorithm applies the alternating direction method of multipliers (ADMMs) to our problem. Our experiments show potential applications of our algorithms and the quantitative evaluation indicates that our methods are more accurate and robust than heuristic approaches. The efficiency comparison indicates that FaLTRC and HaLRTC are more efficient than SiLRTC and between FaLRTC and HaLRTC the former is more efficient to obtain a low accuracy solution and the latter is preferred if a high-accuracy solution is desired.", "citation": "Citations (655)", "year": "2009", "departments": ["University of Wisconsin-Madison", "VRVis", "Arizona State University", "Arizona State University", "Arizona State University", "VRVis", "Arizona State University", "Arizona State University"], "conf": "iccv", "authors": ["Ji Liu.....http://dblp.org/pers/hd/l/Liu_0002:Ji", "Przemyslaw Musialski.....http://dblp.org/pers/hd/m/Musialski:Przemyslaw", "Peter Wonka.....http://dblp.org/pers/hd/w/Wonka:Peter", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping"], "pages": 8}