{"title": "Convergent Temporal-Difference Learning with Arbitrary Smooth Function Approximation.", "fields": ["function approximation", "temporal difference learning", "stochastic gradient descent", "linear function", "smoothness", "markov decision process"], "abstract": "We introduce the first temporal-difference learning algorithms that converge with smooth value function approximators, such as neural networks. Conventional temporal-difference (TD) methods, such as TD(λ), Q-learning and Sarsa have been used successfully with function approximation in many applications. However, it is well known that off-policy sampling, as well as nonlinear function approximation, can cause these algorithms to become unstable (i.e., the parameters of the approximator may diverge). Sutton et al. (2009a, 2009b) solved the problem of off-policy learning with linear TD algorithms by introducing a new objective function, related to the Bellman error, and algorithms that perform stochastic gradient-descent on this function. These methods can be viewed as natural generalizations to previous TD methods, as they converge to the same limit points when used with linear function approximation methods. We generalize this work to nonlinear function approximation. We present a Bellman error objective function and two gradient-descent TD algorithms that optimize it. We prove the asymptotic almost-sure convergence of both algorithms, for any finite Markov decision process and any smooth value function approximator, to a locally optimal solution. The algorithms are incremental and the computational complexity per time step scales linearly with the number of parameters of the approximator. Empirical results obtained in the game of Go demonstrate the algorithms' effectiveness.", "citation": "Not cited", "year": "2009", "departments": ["Indian Institute of Science", "McGill University", "University of Alberta", "University of Alberta", "University of Alberta"], "conf": "nips", "authors": ["Hamid Reza Maei.....http://dblp.org/pers/hd/m/Maei:Hamid_Reza", "Csaba Szepesvári.....http://dblp.org/pers/hd/s/Szepesv=aacute=ri:Csaba", "Shalabh Bhatnagar.....http://dblp.org/pers/hd/b/Bhatnagar:Shalabh", "Doina Precup.....http://dblp.org/pers/hd/p/Precup:Doina", "David Silver.....http://dblp.org/pers/hd/s/Silver:David", "Richard S. Sutton.....http://dblp.org/pers/hd/s/Sutton:Richard_S="], "pages": 9}