{"title": "Nuclei: GPU-Accelerated Many-Core Network Coding.", "fields": ["simd", "altivec", "linear network coding", "gpu cluster", "sse2"], "abstract": "While it is a well known result that network coding achieves optimal flow rates in multicast sessions, its potential for practical use has remained to be a question, due to its high computational complexity. Our previous work has attempted to design a hardware-accelerated and multi-threaded implementation of network coding to fully utilize multi-core CPUs, as well as SSE2 and AltiVec SIMD vector instructions on X86 and PowerPC processors. This paper represents another step forward, and presents the first attempt in the literature to maximize the performance of network coding by taking advantage of not only multi-core CPUs, but also potentially hundreds of computing cores in commodity off-the-shelf graphics processing units (GPU). With GPU computing gaining momentum as a result of increased hardware capabilities and improved programmability, our work shows how the GPU, with a design involving thousands of lightweight threads, can boost network coding performance significantly. Many-core GPUs can be deployed as an attractive alternative and complementary solution to multi-core servers, by offering a better price/performance advantage. In fact, multi-core CPUs and many-core GPUs can be deployed and used to perform network coding simultaneously, potentially useful in media streaming servers where hundreds of peers are served concurrently by these dedicated servers. In this paper, we present Nuclei, the design and implementation of GPU-based network coding. With Nuclei, only one mainstream NVidia 8800 GT GPU outperforms an 8-core Intel Xeon server in most test cases. A combined CPU-GPU encoding scenario achieves coding rates of up to 116 MB/second for a variety of coding settings, which is sufficient to saturate a Gigabit Ethernet interface.", "citation": "Citations (67)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Hassan Shojania.....http://dblp.org/pers/hd/s/Shojania:Hassan", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Xin Wang.....http://dblp.org/pers/hd/w/Wang_0002:Xin"], "conf": "infocom", "year": "2009", "pages": 9}