{"title": "Monotonic Optimization for Non-Concave Power Control in Multiuser Multicarrier Network Systems.", "fields": ["approximation algorithm", "heuristic", "feasible region", "global optimization", "signal to interference plus noise ratio"], "abstract": "Maximizing system utility corresponding to different performance measures through power control has been a long standing open problem in interference-limited multiuser multicarrier wireless networks. The complicated coupling between the mutual interference of links on each subcarrier gives rise to a series of non-convex power control optimization problems, for which the global optimal solution is hard to obtain. This paper proposes a novel algorithm, MARL, to efficiently solve the non-convex power control problem in multiuser multicarrier wireless networks. The algorithm is guaranteed to converge to a global optimal solution, as long as the utility function of each link is monotonically increasing with its data rate. The MARL algorithm is designed based on three key observations of the power control problems considered in this paper: (1) the objective function is increasing in (1+SINR) (SINR: signal to interference- plus-noise ratio); (2) the feasible set of the corresponding equivalent reformulated problem is always \"normal\", although not necessarily convex; and (3) the two former observations imply that the power control problem can be transformed into a monotonic optimization (MO) problem, where the optimal solution always occurs at the upper boundary of the feasible (1+SINR) region. The MARL algorithm finds the desired optimal power control solution by constructing a series of polyblocks that approximate the feasible (1+SINR) region with an increasing precision. Furthermore, by tuning the error tolerance in MARL, we could engineer a desirable tradeoff between optimality and convergence time. MARL provides an important benchmark for performance evaluation of other heuristic algorithms targeting the same problem. With the help of MARL, we evaluate the performance of a state-of-the-art algorithm through extensive simulations.", "citation": "Citations (27)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Liping (Mani) Qian.....http://dblp.org/pers/hd/q/Qian:Liping_=Mani=", "Ying Jun.....http://dblp.org/pers/hd/j/Jun:Ying"], "conf": "infocom", "year": "2009", "pages": 9}