{"title": "End-to-end register data-flow continuous self-test.", "fields": ["rename", "and gate", "control logic", "free list", "microarchitecture"], "abstract": "While Moore's Law predicts the ability of semi-conductor industry to engineer smaller and more efficient transistors and circuits, there are serious issues not contemplated in that law. One concern is the verification effort of modern computing systems, which has grown to dominate the cost of system design. On the other hand, technology scaling leads to burn-in phase out. As a result, in-the-field error rate may increase due to both actual errors and latent defects. Whereas data can be protected with arithmetic codes (like parity or ECC), there is a lack of cost-effective mechanisms for control logic.   This paper presents a light-weight microarchitectural mechanism that ensures that data consumed through registers are correct. Microarchitecture presents a new way to manage reliability and testing without significantly sacrificing cost and performance, offering a unique opportunity to detect errors in the field at low cost. Our results show a coverage around 90% for the targeted structures with a cost in power and area of about 4%. The structures protected include the issue queue logic and the data associated (i.e., tags, control signals), input multiplexors, rename data, replay logic, register free list, bypasses data and logic, MOB data and addresses, register file logic, register file storage and functional units.", "citation": "Citations (16)", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia"], "authors": ["Javier Carretero.....http://dblp.org/pers/hd/c/Carretero:Javier", "Pedro Chaparro.....http://dblp.org/pers/hd/c/Chaparro:Pedro", "Xavier Vera.....http://dblp.org/pers/hd/v/Vera:Xavier", "Jaume Abella.....http://dblp.org/pers/hd/a/Abella:Jaume", "Antonio González.....http://dblp.org/pers/hd/g/Gonz=aacute=lez_0001:Antonio"], "conf": "isca", "year": "2009", "pages": 11}