{"title": "JanusVF: Accurate Navigation Using SCAAT and Virtual Fiducials.", "fields": ["latency", "virtual reality", "rendering", "fiducial marker", "software rendering", "kalman filter", "software system"], "abstract": "Several critical limitations exist in the currently available tracking technologies for fully enclosed virtual reality (VR) systems. While several 6DOF tracking projects such as Hedgehog have successfully demonstrated excellent accuracy, precision, and robustness within moderate budgets, these projects still include elements of hardware that can interfere with the user's visual experience. The objective of this project is to design a tracking solution for fully enclosed VR displays that achieves comparable performance to available commercial solutions but without any artifacts that can obscure the user's view. JanusVF is a tracking solution involving a cooperation of both the hardware sensors and the software rendering system. A small, high-resolution camera is worn on the user's head, but faces backward (180 degree rotation about vertical from the user's perspective). After acquisition of the initial state, the VR rendering software draws specific fiducial markers with known size and absolute position inside the VR scene. These virtual markers are only drawn behind the user and in view of the camera. These fiducials are tracked by ARToolkitPlus and integrated by a single-constraint-at-a-time (SCAAT) filter algorithm to update the head pose. Experiments analyzing accuracy, precision, and latency in a six-sided CAVE-like system show performance that is comparable to alternative commercial technologies.", "citation": "Citations (5)", "departments": ["University of Louisiana at Lafayette", "University of Louisiana at Lafayette", "University of Louisiana at Lafayette", "University of Louisiana at Lafayette", "University of Louisiana at Lafayette"], "authors": ["Malcolm Hutson.....http://dblp.org/pers/hd/h/Hutson:Malcolm", "Steven A. White.....http://dblp.org/pers/hd/w/White:Steven_A=", "Dirk Reiners.....http://dblp.org/pers/hd/r/Reiners:Dirk"], "conf": "vr", "year": "2009", "pages": 8}