{"title": "Assessing the Fidelity of COTS 802.11 Sniffers.", "fields": ["anechoic chamber", "packet analyzer", "shadow", "fidelity", "network packet"], "abstract": "Recent measurement studies have analyzed WLAN performance by means of wireless sniffers that passively cap- ture transmitted frames. Also, for relatively large (enterprise) WLAN scenarios, previous work has investigated multi-sniffer deployments with devices placed far apart in order to capture all traffic in the network (even frames transmitted simultaneously by different nodes at non-interfering locations). However, for both these single- and multi-sniffer scenarios, little attention has been given to the fidelity of an individual device, i.e., the ability of a given sniffer to capture all frames that could have been captured by a more faithful device. We assess this fidelity (a term we make precise in this paper) by running controlled experiments inside an anechoic chamber and analyzing the similarities and differences between the trace file from the device under study and those of additional \"shadow\" devices placed in its close proximity. Our results show that fidelity varies significantly across sniffers, both quantitatively and qualitatively, and that performance may also depend on the nature of the experiment under study and on slight changes of the sniffer position. investigate the variability of the missed frame rate within each receiver, the effect of frame transmission rate and frame type (RTS/CTS, DATA, ACK) on frame miss events at the sniffers, and the extent to which this rate is location-dependent. We find that there can be considerable variation in the average rate of missed frames among the diverse capture devices, and show (via hypothesis testing) that missed packet events among receivers are essentially independent. Together, these results provide valuable insights into the accuracy of frame capture and loss measurements reported by wireless packet sniffers. The use of the anechoic chamber enables the assessment of fidelity in four ways: i) It provides an interference-free environment in which to run highly controlled experiments. In an anechoic chamber we can guarantee that only one station is transmitting at each time, preventing capture effects that could introduce significant bias in the measurements 1 . ii) It also prevents interference from sources far away or in neighboring channels that could be received only by some devices (e.g., due to different antennae sensitivity) or that could affect some sniffer's performance by reducing the SINR level. iii) It supports the repeatability of the measurements made, unlike many wireless measurement studies that, for example, run experiments during nighttime in the hope that interference will have a negligible impact. iv) Lastly, these \"ideal conditions\" provide quantitative values for fidelity that can be considered as \"best case\" scenarios. We expect that, in non-interference-free scenarios, the performance of the same device under the same experiments will be at most as good as the provided by our assessment. The reminder of this paper is structured as follows. In Section II, we present our definition for fidelity and describe the measurement process, that is validated by means of extensive experimental measurements. We next analyze the statistical characteristics of the loss processes in Section III. In Section IV, we analyze the extent to which fidelity is affected by the physical placement of devices and the experiment under study. Related work in the area of wireless network measurements is presented in Section V. Finally, a summary of the results with the main conclusions from our study is given in Section VI.", "citation": "Citations (10)", "departments": ["Carlos III Health Institute", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Pablo Serrano.....http://dblp.org/pers/hd/s/Serrano_0001:Pablo", "Michael Zink.....http://dblp.org/pers/hd/z/Zink:Michael", "Jim Kurose.....http://dblp.org/pers/hd/k/Kurose:Jim"], "conf": "infocom", "year": "2009", "pages": 9}