{"title": "Composition of Low-Error 2-Query PCPs Using Decodable PCPs.", "fields": ["combinatorics", "hardness of approximation", "probabilistic logic", "discrete mathematics", "polynomial", "mathematics", "mathematical proof", "composition", "witness"], "abstract": "The main result of this paper is a generic composition theorem for low error two-query probabilistically checkable proofs (PCPs). Prior to this work, composition of PCPs was well-understood only in the constant error regime. Existing composition methods in the low error regime were non-modular (i.e., very much tailored to the specific PCPs that were being composed), resulting in complicated constructions of PCPs. Furthermore, until recently, composition in the low error regime suffered from incurring an extra 'consistency' query, resulting in PCPs that are not 'two-query' and hence, much less useful for hardness-of-approximation reductions. In a recent breakthrough, Moshkovitz and Raz [In Proc. 49th IEEE Symp. on Foundations of Comp. Science (FOCS), 2008] constructed almost linear-sized low-error 2-query PCPs for every language in NP. Indeed, the main technical component of their construction is a novel composition of certain specific PCPs. We give a modular and simpler proof of their result by repeatedly applying the new composition theorem to known PCP components. To facilitate the new modular composition, we introduce a new variant of PCP, which we call a \"decodable PCP (dPCP)\". A dPCP is an encoding of an NP witness that is both locally checkable and locally decodable. The dPCP verifier in addition to verifying the validity of the given proof like a standard PCP verifier, also locally decodes the original NP witness. Our composition is generic in the sense that it works regardless of the way the component PCPs are constructed.", "citation": "Citations (24)", "departments": ["Weizmann Institute of Science", "Tata Institute of Fundamental Research"], "authors": ["Irit Dinur.....http://dblp.org/pers/hd/d/Dinur:Irit", "Prahladh Harsha.....http://dblp.org/pers/hd/h/Harsha:Prahladh"], "conf": "focs", "year": "2009", "pages": 10}