{"title": "Fair and Efficient User-Network Association Algorithm for Multi-Technology Wireless Networks.", "fields": ["network packet", "heuristics", "vertical handover", "wimax", "distributed algorithm"], "abstract": "Recent mobile equipment (as well as the norm IEEE 802.21) offers the possibility for users to switch from one technology to another (vertical handover). This allows flexibility in resource assignments and, consequently, increases the potential throughput allocated to each user. In this paper, we design a fully distributed algorithm based on trial and error mechanisms that exploits the benefits of vertical handover by finding fair and efficient assignment schemes. On the one hand, mobiles gradually update the fraction of data packets they send to each network based on the rewards they receive from the stations. On the other hand, network stations send rewards to each mobile that represent the impact each mobile has on the cell throughput. This reward function is closely related to the concept of marginal cost in the pricing literature. Both the station and the mobile algorithms are simple enough to be implemented in current standard equipment. Based on tools from evolutionary games, potential games and replicator dynamics, we analytically show the convergence of the algorithm to fair and efficient solutions. Moreover, we show that after convergence, each user is connected to a single network cell which avoids costly repeated vertical handovers. To achieve fast convergence, several simple heuristics based on this algorithm are proposed and tested. Indeed, for implementation purposes, the number of iterations should remain in the order of a few tens.", "citation": "Citations (72)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Pierre Coucheney.....http://dblp.org/pers/hd/c/Coucheney:Pierre", "Corinne Touati.....http://dblp.org/pers/hd/t/Touati:Corinne", "Bruno Gaujal.....http://dblp.org/pers/hd/g/Gaujal:Bruno"], "conf": "infocom", "year": "2009", "pages": 5}