{"title": "To move or not to move: a comparison between steerable versus fixed focus region paradigms in multi-resolution tabletop display systems.", "fields": ["region of interest", "visualization", "saccadic masking", "spatial contextual awareness", "phenomenon"], "abstract": "Previous studies have outlined the advantages of multi-resolution large-area displays over their fixed-resolution counterparts, however the mobility of the focus region has up until the present time received little attention. To study this phenomenon further, we have developed a multi-resolution tabletop display system with a steerable high resolution focus region to compare the performance between steerable and fixed focus region systems under different working scenarios. We have classified these scenarios according to region of interest (ROI) with analogies to different eye movement types (fixed, saccadic, and pursuit ROI). Empirical data gathered during the course of a multi-faceted user study demonstrates that the steerable focus region system significantly outperforms the fixed focus region system. The former is shown to provide enhanced display manipulation and proves especially advantageous in cases where the user must maintain spatial awareness of the display content as is the case in which, within a single session, several regions of the display are to be visited.", "citation": "Citations (7)", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University", "Universidade da ... nchal, Portugal"], "authors": ["Chuan-Heng Hsiao.....http://dblp.org/pers/hd/h/Hsiao:Chuan=Heng", "Li-Wei Chan.....http://dblp.org/pers/hd/c/Chan:Li=Wei", "Ting-Ting Hu.....http://dblp.org/pers/hd/h/Hu:Ting=Ting", "Mon-Chu Chen.....http://dblp.org/pers/hd/c/Chen:Mon=Chu", "Jane Yung-jen Hsu.....http://dblp.org/pers/hd/h/Hsu:Jane_Yung=jen", "Yi-Ping Hung.....http://dblp.org/pers/hd/h/Hung:Yi=Ping"], "conf": "chi", "year": "2009", "pages": 10}