{"title": "A case for dynamic frequency tuning in on-chip networks.", "fields": ["frequency scaling", "router", "power management", "latency", "network on a chip"], "abstract": "Performance and power are the first order design metrics for Network-on-Chips (NoCs) that have become the de-facto standard in providing scalable communication backbones for multicores/CMPs. However, NoCs can be plagued by higher power consumption and degraded throughput if the network and router are not designed properly. Towards this end, this paper proposes a novel router architecture, where we tune the frequency of a router in response to network load to manage both performance and power. We propose three dynamic frequency tuning techniques,  FreqBoost, FreqThrtl  and  FreqTune , targeted at congestion and power management in NoCs. As enablers for these techniques, we exploit Dynamic Voltage and Frequency Scaling (DVFS) and the imbalance in a generic router pipeline through time stealing. Experiments using synthetic workloads on a 8x8 wormhole-switched mesh interconnect show that  FreqBoost  is a better choice for reducing average latency (maximum 40%) while,  FreqThrtl  provides the maximum benefits in terms of power saving and energy delay product (EDP). The  FreqTune  scheme is a better candidate for optimizing both performance and power, achieving on an average 36% reduction in latency, 13% savings in power (up to 24% at high load), and 40% savings (up to 70% at high load) in EDP. With application benchmarks, we observe IPC improvement up to 23% using our design. The performance and power benefits also scale for larger NoCs.", "citation": "Citations (111)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Intel", "Pennsylvania State University"], "authors": ["Asit K. Mishra.....http://dblp.org/pers/hd/m/Mishra:Asit_K=", "Reetuparna Das.....http://dblp.org/pers/hd/d/Das:Reetuparna", "Soumya Eachempati.....http://dblp.org/pers/hd/e/Eachempati:Soumya", "Ravishankar R. Iyer.....http://dblp.org/pers/hd/i/Iyer:Ravishankar_R=", "Narayanan Vijaykrishnan.....http://dblp.org/pers/hd/v/Vijaykrishnan:Narayanan", "Chita R. Das.....http://dblp.org/pers/hd/d/Das:Chita_R="], "conf": "micro", "year": "2009", "pages": 12}