{"title": "McPAT: an integrated power, area, and timing modeling framework for multicore and manycore architectures.", "fields": ["dennard scaling", "manycore processor", "hybrid memory cube", "thermal design power", "dark silicon"], "abstract": "This paper introduces McPAT, an integrated power, area, and timing modeling framework that supports comprehensive design space exploration for multicore and manycore processor configurations ranging from 90nm to 22nm and beyond. At the microarchitectural level, McPAT includes models for the fundamental components of a chip multiprocessor, including in-order and out-of-order processor cores, networks-on-chip, shared caches, integrated memory controllers, and multiple-domain clocking. At the circuit and technology levels, McPAT supports critical-path timing modeling, area modeling, and dynamic, short-circuit, and leakage power modeling for each of the device types forecast in the ITRS roadmap including bulk CMOS, SOI, and doublegate transistors. McPAT has a flexible XML interface to facilitate its use with many performance simulators.   Combined with a performance simulator, McPAT enables architects to consistently quantify the cost of new ideas and assess tradeoffs of different architectures using new metrics like energy-delay-area 2  product (EDA 2 P) and energy-delay-area product (EDAP). This paper explores the interconnect options of future manycore processors by varying the degree of clustering over generations of process technologies. Clustering will bring interesting tradeoffs between area and performance because the interconnects needed to group cores into clusters incur area overhead, but many applications can make good use of them due to synergies of cache sharing. Combining power, area, and timing results of McPAT with performance simulation of PARSEC benchmarks at the 22nm technology node for both common in-order and out-of-order manycore designs shows that when die cost is not taken into account clustering 8 cores together gives the best energy-delay product, whereas when cost is taken into account configuring clusters with 4 cores gives the best EDA 2 P and EDAP.", "citation": "Citations (1,980)", "departments": ["University of Notre Dame", "Seoul National University", "University of California, San Diego", "University of Notre Dame", "University of California, San Diego"], "authors": ["Sheng Li.....http://dblp.org/pers/hd/l/Li_0007:Sheng", "Jung Ho Ahn.....http://dblp.org/pers/hd/a/Ahn:Jung_Ho", "Richard D. Strong.....http://dblp.org/pers/hd/s/Strong:Richard_D=", "Jay B. Brockman.....http://dblp.org/pers/hd/b/Brockman:Jay_B=", "Dean M. Tullsen.....http://dblp.org/pers/hd/t/Tullsen:Dean_M=", "Norman P. Jouppi.....http://dblp.org/pers/hd/j/Jouppi:Norman_P="], "conf": "micro", "year": "2009", "pages": 12}