{"title": "Quantification of Contrast Sensitivity and Color Perception using Head-worn Augmented Reality Displays.", "fields": ["display contrast", "brightness", "augmented reality", "color space", "color vision"], "abstract": "Augmented reality (AR) displays often reduce the visual capabilities of the user. This reduction can be measured both objectively and through user studies. We acquired objective measurements with a color meter and conducted two user studies for each of two key measurements. First was the combined effect of resolution and display contrast, which equate to the visual acuity and apparent brightness. The combined effect may be captured by the contrast sensitivity function and measured through analogs of optometric exams. We expanded the number of commercial devices tested in previous studies, including higher resolution and video-overlay AR displays. We found patterns of reduced contrast sensitivity similar to previous work; however, we saw that all displays enabled users to achieve the maximum possible acuity with at least moderate levels of contrast. The second measurement was the perception of color. Objective measurements showed a distortion of color, notably in the blue region of color space. We devised a color matching task to quantify the distortion of color perception, finding that the displays themselves were poor at showing colors in the blue region of color space and that the perceptual distortion of such colors was even greater than the objective distortion. We noted significantly different distortions and variability between displays.", "citation": "Citations (15)", "departments": ["United States Naval Research Laboratory", "United States Naval Research Laboratory", "United States Naval Research Laboratory"], "authors": ["Mark A. Livingston.....http://dblp.org/pers/hd/l/Livingston:Mark_A=", "Jane H. Barrow.....http://dblp.org/pers/hd/b/Barrow:Jane_H=", "Ciara M. Sibley.....http://dblp.org/pers/hd/s/Sibley:Ciara_M="], "conf": "vr", "year": "2009", "pages": 8}