{"title": "FACT: fast communication trace collection for parallel applications through program slicing.", "fields": ["message passing", "program slicing", "parallel computing", "computation", "static analysis"], "abstract": "A proper understanding of communication patterns of parallel applications is important to optimize application performance and design better communication subsystems. Communication patterns can be obtained by analyzing communication traces. However, existing approaches to generate communication traces need to execute the entire parallel applications on full-scale systems that are time-consuming and expensive.   In this paper, we propose a novel technique, called Fact, which can perform   FAst Communication Trace collection   for large-scale parallel applications on  small-scale systems . Our idea is to reduce the original program to obtain a program slice through static analysis, and to execute the program slice to acquire the communication traces. The program slice preserves all the variables and statements in the original program relevant to spatial and volume communication attributes. Our idea is based on an observation that most computation and message contents in message-passing parallel applications are independent of these attributes, and therefore can be removed from the programs for the purpose of communication trace collection.   We have implemented Fact and evaluated it with NPB programs and Sweep3D. The results show that Fact can preserve the spatial and volume communication attributes of original programs and reduce resource consumptions by two orders of magnitude in most cases. For example, Fact collects the communication traces of the Sweep3D for 512 processes on a 4-node (32 cores) platform in just 6.79 seconds, consuming 1.25 GB memory, while the original program takes 256.63 seconds and consumes 213.83 GB memory on a 32-node (512 cores) platform. Finally, we present an application of Fact.", "citation": "Citations (25)", "year": "2009", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "conf": "sc", "authors": ["Jidong Zhai.....http://dblp.org/pers/hd/z/Zhai:Jidong", "Tianwei Sheng.....http://dblp.org/pers/hd/s/Sheng:Tianwei", "Jiangzhou He.....http://dblp.org/pers/hd/h/He:Jiangzhou", "Wenguang Chen.....http://dblp.org/pers/hd/c/Chen:Wenguang", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin"], "pages": -1}