{"title": "Polymorphic pipeline array: a flexible multicore accelerator with virtualized execution for mobile multimedia applications.", "fields": ["intel high definition audio", "multi core processor", "software pipelining", "exploit", "virtualization"], "abstract": "Mobile computing in the form of smart phones, netbooks, and personal digital assistants has become an integral part of our everyday lives. Moving ahead to the next generation of mobile devices, we believe that multimedia will become a more critical and product-differentiating feature. High definition audio and video as well as 3D graphics provide richer interfaces and compelling capabilities. However, these algorithms also bring different computational challenges than wireless signal processing. Multimedia algorithms are more complex featuring more control flow and variable computational requirements where execution time is not dominated by innermost vector loops. Further, data access is more complex where media applications typically operate on multi-dimensional vectors of data rather than single-dimensional vectors with simple strides. Thus, the design of current mobile platforms requires re-examination to account for these new application domains. In this work, we focus on the design of a programmable, low-power accelerator for multimedia algorithms referred to as a  Polymorphic Pipeline Array , or PPA. The PPA is designed with flexibility and programmability as first-order requirements to enable the hardware to be dynamically customizable to the application. PPAs exploit pipeline parallelism found in streaming applications to create a coarse-grain hardware pipeline to execute streaming media applications. PPA resources are allocated to each stage depending on its size and ability to exploit fine-grain parallelism. Experimental results show that real-time media applications can take advantage of the static and dynamic configurability for increased power efficiency.", "citation": "Citations (100)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Hyunchul Park.....http://dblp.org/pers/hd/p/Park_0001:Hyunchul", "Yongjun Park.....http://dblp.org/pers/hd/p/Park:Yongjun", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A="], "conf": "micro", "year": "2009", "pages": 11}