{"title": "Requirements Validation for Hybrid Systems.", "fields": ["hybrid automaton", "satisfiability modulo theories", "formal methods", "linear temporal logic", "discrete system"], "abstract": "The importance of requirements for the whole development flow calls for strong validation techniques based on formal methods. In the case of discrete systems, some approaches based on temporal logic satisfiability are gaining increasing momentum. However, in many real-world domains (e.g. railways signaling), the requirements constrain the temporal evolution of both discrete and continuous variables. These hybrid domains pose substantial problems: on one side, a continuous domain requires very expressive formal languages; on the other side, the resulting expressiveness results in highly intractable problems.\n\nIn this paper, we address the problem of requirements validation for real-world hybrid domains, and present two main contributions. First, we propose the HRELTL logic, that extends the Linear-time Temporal Logic with Regular Expressions (RELTL) with hybrid aspects. Second, we show that the satisfiability problem for the linear fragment can be reduced to an equi-satisfiable problem for RELTL. This makes it possible to use automatic (albeit incomplete) techniques based on Bounded Model Checking and on Satisfiability Modulo Theory.\n\nThe choice of the language is inspired by and validated within a project funded by the European Railway Agency, on the formalization and validation of the European Train Control System specifications. The activity showed that most of requirements can be formalized into HRELTL, and an experimental evaluation confirmed the practicality of the analyses.", "citation": "Citations (52)", "year": "2009", "departments": ["fondazione bruno kessler", "fondazione bruno kessler", "fondazione bruno kessler"], "conf": "cav", "authors": ["Alessandro Cimatti.....http://dblp.org/pers/hd/c/Cimatti:Alessandro", "Marco Roveri.....http://dblp.org/pers/hd/r/Roveri:Marco", "Stefano Tonetta.....http://dblp.org/pers/hd/t/Tonetta:Stefano"], "pages": 16}