{"title": "A design methodology for domain-optimized power-efficient supercomputing.", "fields": ["electrical efficiency", "supercomputer", "general purpose computing on graphics processing units", "cuda", "sparse matrix"], "abstract": "As power has become the pre-eminent design constraint for future HPC systems, computational efficiency is being emphasized over simply peak performance. Recently, static benchmark codes have been used to find a power efficient architecture. Unfortunately, because compilers generate sub-optimal code, benchmark performance can be a poor indicator of the performance potential of architecture design points. Therefore, we present hardware/software cotuning as a novel approach for system design, in which traditional architecture space exploration is tightly coupled with software auto-tuning for delivering substantial improvements in area and power efficiency. We demonstrate the proposed methodology by exploring the parameter space of a Tensilica-based multi-processor running three of the most heavily used kernels in scientific computing, each with widely varying micro-architectural requirements: sparse matrix vector multiplication, stencil-based computations, and general matrix-matrix multiplication. Results demonstrate that co-tuning significantly improves hardware area and energy efficiency -- a key driver for next generation of HPC system design.", "citation": "Citations (17)", "year": "2009", "departments": ["University of California, Berkeley", "University of California, Berkeley", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "University of California, Berkeley"], "conf": "sc", "authors": ["Marghoob Mohiyuddin.....http://dblp.org/pers/hd/m/Mohiyuddin:Marghoob", "Mark Murphy.....http://dblp.org/pers/hd/m/Murphy:Mark", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid", "John Shalf.....http://dblp.org/pers/hd/s/Shalf:John", "John Wawrzynek.....http://dblp.org/pers/hd/w/Wawrzynek:John", "Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel"], "pages": -1}