{"title": "ACTION: Breaking the Privacy Barrier for RFID Systems.", "fields": ["message authentication code", "internet privacy", "key management", "computer science", "computer security", "authentication protocol", "small number", "radio frequency identification"], "abstract": "In order to protect privacy, Radio Frequency Identification (RFID) systems employ Privacy-Preserving Authentication (PPA) to allow valid readers to explicitly authenticate their dominated tags without leaking private information. Typically, an RF tag sends an encrypted message to the reader, then the reader searches for the key that can decrypt the cipher to identify the tag. Due to the large-scale deployment of today's RFID systems, the key search scheme for any PPA requires a short response time. Previous designs construct balance-tree based key management structures to accelerate the search speed to O(logN), where N is the number of tags. Being efficient, such approaches are vulnerable to compromising attacks. By capturing a small number of tags, compromising attackers are able to identify other tags that have not been corrupted. To address this issue, we propose an Anti- Compromising authenticaTION protocol, ACTION, which employs a novel sparse tree architecture, such that the key of every tag is independent from one another. The advantages of this design include: 1) resilience to the compromising attack, 2) reduction of key storage for tags from O(logN) to O(1), which is significant for resource critical tag devices, and 3) high search efficiency, which is O(logN), as good as the best in the previous designs.", "citation": "Citations (56)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Li Lu.....http://dblp.org/pers/hd/l/Lu_0001:Li", "Jinsong Han.....http://dblp.org/pers/hd/h/Han:Jinsong", "Renyi Xiao.....http://dblp.org/pers/hd/x/Xiao:Renyi", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2009", "pages": 9}