{"title": "A Virtual Iraq System for the Treatment of Combat-Related Posttraumatic Stress Disorder.", "fields": ["exposure therapy", "terrorism", "combat stress reaction", "active duty", "user centered design"], "abstract": "Posttraumatic Stress Disorder (PTSD) is reported to be caused by traumatic events that are outside the range of usual human experience including (but not limited to) military combat, violent personal assault, being kidnapped or taken hostage and terrorist attacks. Initial data suggests that at least 1 out of 5 Iraq War veterans are exhibiting symptoms of depression, anxiety and PTSD. Virtual Reality (VR) delivered exposure therapy for PTSD has been previously used with reports of positive outcomes. The current paper is a follow-up to a paper presented at IEEE VR2006 and will present the rationale and description of a VR PTSD therapy application (Virtual Iraq) and present the findings from its use with active duty service members since the VR2006 presentation. Virtual Iraq consists of a series of customizable virtual scenarios designed to represent relevant Middle Eastern VR contexts for exposure therapy, including a city and desert road convoy environment. User-centered design feedback needed to iteratively evolve the system was gathered from returning Iraq War veterans in the USA and from a system deployed in Iraq and tested by an Army Combat Stress Control Team. Results from an open clinical trial using Virtual Iraq at the Naval Medical Center-San Diego with 20 treatment completers indicate that 16 no longer met PTSD diagnostic criteria at post-treatment, with only one not maintaining treatment gains at 3 month follow-up.", "citation": "Citations (10)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California"], "authors": ["Shih-Ching Yeh.....http://dblp.org/pers/hd/y/Yeh:Shih=Ching", "Brad Newman.....http://dblp.org/pers/hd/n/Newman:Brad", "Matt Liewer.....http://dblp.org/pers/hd/l/Liewer:Matt", "Jarrell Pair.....http://dblp.org/pers/hd/p/Pair:Jarrell", "Anton Treskunov.....http://dblp.org/pers/hd/t/Treskunov:Anton", "Greg Reger.....http://dblp.org/pers/hd/r/Reger:Greg", "Barbara O. Rothbaum.....http://dblp.org/pers/hd/r/Rothbaum:Barbara_O=", "JoAnn Difede.....http://dblp.org/pers/hd/d/Difede:JoAnn", "Josh Spitalnick.....http://dblp.org/pers/hd/s/Spitalnick:Josh", "Robert N. McLay.....http://dblp.org/pers/hd/m/McLay:Robert_N=", "Thomas D. Parsons.....http://dblp.org/pers/hd/p/Parsons:Thomas_D=", "Albert A. Rizzo.....http://dblp.org/pers/hd/r/Rizzo:Albert_A="], "conf": "vr", "year": "2009", "pages": 8}