{"title": "Early performance evaluation of a \"Nehalem\" cluster using scientific and engineering applications.", "fields": ["intel hub architecture", "single chip cloud computer", "xeon", "hyper threading", "non uniform memory access"], "abstract": "In this paper, we present an early performance evaluation of a 624-core cluster based on the Intel® Xeon® Processor 5560 (code named \"Nehalem-EP\", and referred to as Xeon 5560 in this paper)---the third-generation quad-core architecture from Intel. This is the first processor from Intel with a non-uniform memory access (NUMA) architecture managed by on-chip integrated memory controller. It employs a point-to-point interconnect called the Intel® QuickPath Interconnect (QPI) between processors and to the input/output (I/O) hub. It also introduces to a quad-core architecture both Intel's hyper-threading technology (or simultaneous multi-threading, \"SMT\") and Intel® Turbo Boost Technology (\"Turbo mode\") that automatically allow processor cores to run faster than the base operating frequency if the processor is operating below rated power, temperature, and current specification limits. It can be engaged with any number of cores or logical processors enabled and active. We critically evaluate these features using the High Performance Computing Challenge (HPCC) benchmarks, NAS Parallel Benchmarks (NPB), and four full-scale scientific applications. We compare and contrast the results of a cluster based on the Xeon 5560 with an SGI® Altix® ICE 8200EX cluster of quad-core Intel® Xeon® 5472 Processor (\"Xeon 5472\" from here on) and another cluster of Intel® Xeon® 5462 Processor (\"Xeon 5462\"; the Xeon 5400 Series Processors are previous generation quad-core Intel processors and were code named Harpertown).", "citation": "Citations (15)", "year": "2009", "departments": ["Intel", "Intel", "NASA Ames Resea ... ffett Field, CA", "NASA Ames Resea ... ffett Field, CA", "NASA Ames Resea ... ffett Field, CA"], "conf": "sc", "authors": ["Subhash Saini.....http://dblp.org/pers/hd/s/Saini:Subhash", "Andrey Naraikin.....http://dblp.org/pers/hd/n/Naraikin:Andrey", "Rupak Biswas.....http://dblp.org/pers/hd/b/Biswas:Rupak", "David Barkai.....http://dblp.org/pers/hd/b/Barkai:David", "Timothy Sandstrom.....http://dblp.org/pers/hd/s/Sandstrom:Timothy"], "pages": -1}