{"title": "Location sensitive indexing for image-based advertising.", "fields": ["attractiveness", "search engine indexing", "popularity", "logos bible software", "architecture"], "abstract": "This paper introduces the architecture of our location sensitive indexing model which is used in a platform designed to deliver advertisements to users who primarily utilize images as queries instead of textual keywords. The indexing model facilitates an advertiser's ability to bid on images, such as billboards or logos, in order to obtain user feedback in judging image attractiveness. Additionally, the model enables automatic evaluation of advertisement popularity by mining users' query logs, which is critical for generating advertisement recommendations. The location sensitive architecture of this model enables effective and efficient functionality in large-scale scenarios. In the model's structure, our Location Sensitive Visual Indexing model (LSVI) incorporates location information that subdivides geographical regions for precise and localized image matching. By collecting feedback from mobile users, location-based mining can also help discover popular advertisements as well as their representative images. We have deployed our platform into a real-world advertising system in Beijing, China, which demonstrates effective results in comparative studies with both alternative and state-of-the-art approaches.", "citation": "Citations (12)", "departments": ["Harbin Institute of Technology", "Microsoft", "Harbin Institute of Technology", "Tsinghua University", "Harbin Institute of Technology"], "authors": ["Dechao Liu.....http://dblp.org/pers/hd/l/Liu:Dechao", "Matthew R. Scott.....http://dblp.org/pers/hd/s/Scott:Matthew_R=", "Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Wei Jiang.....http://dblp.org/pers/hd/j/Jiang:Wei", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing"], "conf": "mm", "year": "2009", "pages": 4}