{"title": "Exploiting Domain Knowledge to Improve Biological Significance of Biclusters with Key Missing Genes.", "fields": ["gene cluster", "microarray analysis techniques", "gene regulatory network", "biclustering", "ontology"], "abstract": "In an era of increasingly complex biological datasets, one of the key steps in gene functional analysis comes from clustering genes based on co-expression. Biclustering algorithms can identify gene clusters with local co-expressed patterns, which are more likely to define genes functioning together than global clustering methods. However, these algorithms are not effective in uncovering gene regulatory networks because the mined biclusters lack genes that may be critical in the function but may not be co-expressed with the clustered genes. In this paper, we introduce a biclustering method called SKeleton Biclustering (SKB), which builds high quality biclusters from microarray data, creates relationships among the biclustered genes based on Gene Ontology annotations, and identifies genes that are missing in the biclusters. SKB thus defines inter-bicluster and intra-bicluster functional relationships. The delineation of functional relationships and incorporation of such missing genes may help biologists to discover biological processes that are important in a given study and provides clues for how the processes may be functioning together. Experimental results show that, with SKB, the biological significance of the biclusters is considerably improved.", "citation": "Not cited", "departments": ["Carnegie Learning", "Carnegie Learning", "National University of Singapore", "National University of Singapore", "Carnegie Learning"], "authors": ["Jin Chen.....http://dblp.org/pers/hd/c/Chen:Jin", "Liping Ji.....http://dblp.org/pers/hd/j/Ji:Liping", "Wynne Hsu.....http://dblp.org/pers/hd/h/Hsu:Wynne", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Seung Y. Rhee.....http://dblp.org/pers/hd/r/Rhee:Seung_Y="], "conf": "icde", "year": "2009", "pages": 4}