{"title": "Seven Years and One Day: Sketching the Evolution of Internet Traffic.", "fields": ["network packet", "random projection", "internet traffic", "internet protocol suite", "traffic analysis"], "abstract": "This contribution aims at performing a longitudinal study of the evolution of the traffic collected every day for seven years on a trans-Pacific backbone link (the MAWI dataset). Long term characteristics are investigated both at TCP/IP layers (packet and flow attributes) and application usages. The analysis of this unique dataset provides new insights into changes in traffic statistics, notably on the persistence of Long Range Dependence, induced by the on-going increase in link bandwidth. Traffic in the MAWI dataset is subject to bandwidth changes, to congestions, and to a variety of anomalies. This allows the comparison of their impacts on the traffic statistics but at the same time significantly impairs long term evolution characterizations. To account for this difficulty, we show and explain how and why random projection (sketch) based analysis procedures provide practitioners with an efficient and robust tool to disentangle actual long term evolutions from time localized events such as anomalies and link congestions. Our central results consist in showing a strong and persistent long range dependence controlling jointly byte and packet counts. An additional study of a 24-hour trace complements the long-term results with the analysis of intraday variabilities.", "citation": "Citations (211)", "departments": ["Lyon College", "Lyon College", "National Institute of Informatics", "Lyon College", "National Institute of Informatics"], "authors": ["Pierre Borgnat.....http://dblp.org/pers/hd/b/Borgnat:Pierre", "Guillaume Dewaele.....http://dblp.org/pers/hd/d/Dewaele:Guillaume", "Kensuke Fukuda.....http://dblp.org/pers/hd/f/Fukuda:Kensuke", "Patrice Abry.....http://dblp.org/pers/hd/a/Abry:Patrice", "Kenjiro Cho.....http://dblp.org/pers/hd/c/Cho:Kenjiro"], "conf": "infocom", "year": "2009", "pages": 9}