{"title": "On Leveraging Partial Paths in Partially-Connected Networks.", "fields": ["mobile ad hoc network", "network model", "stochastic dominance", "retransmission", "delay tolerant networking"], "abstract": "Mobile wireless network research focuses on scenar- ios at the extremes of the network connectivity continuum where the probability of all nodes being connected is either close to unity, assuming connected paths between all nodes (mobile ad hoc networks), or it is close to zero, assuming no multi-hop paths exist at all (delay-tolerant networks). In this paper, we argue that a sizable fraction of networks lies between these extremes and is characterized by the existence of partial paths, i.e., multi-hop path segments that allow forwarding data closer to the destination even when no end-to-end path is available. A fundamental issue in such networks is dealing with disruptions of end-to-end paths. Under a stochastic model, we compare the performance of the established end-to-end retransmission (ignoring partial paths), against a forwarding mechanism that leverages partial paths to forward data closer to the destination even during disruption periods. Perhaps surprisingly, the alternative mechanism is not necessarily superior. However, under a stochastic monotonicity condition between current vs. future path length, which we demonstrate to hold in typical network models, we manage to prove superiority of the alternative mechanism in stochastic dominance terms. We believe that this study could serve as a foundation to design more efficient data transfer protocols for partially-connected networks, which could potentially help reducing the gap between applications that can be supported over disconnected networks and those requiring full connectivity.", "citation": "Citations (15)", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich"], "authors": ["Simon Heimlicher.....http://dblp.org/pers/hd/h/Heimlicher:Simon", "Merkourios Karaliopoulos.....http://dblp.org/pers/hd/k/Karaliopoulos:Merkourios", "Hanoch Levy.....http://dblp.org/pers/hd/l/Levy:Hanoch", "Thrasyvoulos Spyropoulos.....http://dblp.org/pers/hd/s/Spyropoulos:Thrasyvoulos"], "conf": "infocom", "year": "2009", "pages": 9}