{"title": "i-m-Tube: an interactive multi-resolution tubular display.", "fields": ["interactivity", "interactive media", "painting", "projector", "digital signage"], "abstract": "In this paper we introduce a tubular interface, the i-m-Tube, which provides convenient user interaction with multimedia content by multi-touch input and multi-resolution display. With its tubular surface, the i-m-Tube is suitable for displaying panoramic image content like the Chinese scroll painting \"Along the River During the Ch'ingming Festival\" which has been regarded as a national treasure and widely known by its extraordinary width and its various details. The strength of our system is that it is not just suitable for displaying panoramic content, but also possible to create an intuitive and natural context for user interaction with multimedia content displayed on the i-m-Tube by multi-finger touch. It also provides a high resolution area on demand, which is projected by a steerable projector in a Full-HD resolution. We have developed our system as an interface which can be applied adaptively to different applications, having the features of multi-touch and multi-resolution interactivity on a tubular display. In this work, we have implemented several prototypes designed for different applications, like \"Tetris360\" aiming on co-op arcade gaming, and \"Panoramic Cover Flow\" for interactive digital signage, to show the capabilities and opportunities of the i-m-Tube display system. With our preliminary experiments on the i-m-Tube, it is exciting to see the potential of the i-m-Tube as a new interface for people to meet the interactive multimedia touch in this generation.", "citation": "Citations (10)", "departments": ["National Taiwan University", "Graduate Instit ... pei, Taiwan Roc", "Graduate Instit ... pei, Taiwan Roc", "Graduate Instit ... pei, Taiwan Roc", "Graduate Instit ... pei, Taiwan Roc"], "authors": ["Jin-Yao Lin.....http://dblp.org/pers/hd/l/Lin:Jin=Yao", "Yen-Yu Chen.....http://dblp.org/pers/hd/c/Chen:Yen=Yu", "Ju-Chun Ko.....http://dblp.org/pers/hd/k/Ko:Ju=Chun", "HuiShan Kao.....http://dblp.org/pers/hd/k/Kao:HuiShan", "Wei-Han Chen.....http://dblp.org/pers/hd/c/Chen:Wei=Han", "Tsun-Hung Tsai.....http://dblp.org/pers/hd/t/Tsai:Tsun=Hung", "Su-Chu Hsu.....http://dblp.org/pers/hd/h/Hsu:Su=Chu", "Yi-Ping Hung.....http://dblp.org/pers/hd/h/Hung:Yi=Ping"], "conf": "mm", "year": "2009", "pages": 8}