{"title": "Multiprocessor Extensions to Real-Time Calculus.", "fields": ["expression", "residual", "uniprocessor system", "multiprocessor scheduling", "multi core processor", "process calculus"], "abstract": "Many embedded platforms consist of a heterogeneous collection of processing elements, memory modules, and communication subsystems. These components often implement different scheduling/arbitration policies, have different interfaces, and are supplied by different vendors. Hence, compositional techniques for modeling and analyzing such platforms are of interest. In prior work, the real-time calculus framework has proven to be very effective in this regard. However, real-time calculus has heretofore been limited to systems with uniprocessor processing elements, which is a serious impediment given the advent of multicore technologies. In this paper, a two-step approach is proposed that allows the power of real-time calculus to be applied in globally-scheduled multiprocessor systems: first, assuming that job response-time bounds are given, determine whether these bounds are met; second, using these bounds, determine the resulting residual processor supply and streams of job completion events using formalisms from real-time calculus. For this methodology to be applied in settings where response-time bounds are not specified, such bounds must be determined. Though this is an issue that warrants further investigation, a method is discussed for calculating such bounds that is applicable to a large family of fixed job-priority schedulers. The utility of the proposed analysis framework is demonstrated using a case study.", "citation": "Citations (11)", "year": "2009", "departments": ["University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "Technische Universität München", "University of North Carolina at Chapel Hill", "Inst. for Real- ... Munich, Germany"], "conf": "rtss", "authors": ["Hennadiy Leontyev.....http://dblp.org/pers/hd/l/Leontyev:Hennadiy", "Samarjit Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Samarjit", "James H. Anderson.....http://dblp.org/pers/hd/a/Anderson:James_H="], "pages": 12}