{"title": "CFP: Cooperative Fast Protection.", "fields": ["wavelength division multiplexing", "spare part", "mesh networking", "optical switch", "integer programming", "backup", "optical performance monitoring"], "abstract": "We introduce a novel protection scheme, called coop- erative fast protection (CFP), to fight against a single link failure in survivable(wavelength division multiplexing (WDM) mesh networks. CFP achieves capacity-efficient fast protection with features of node-autonomy and failure-independency. Though CFP organizes spare capacity into pre-cross-connected cycles, it differs from -cycle by reusing the released working capacity of the disrupted lightpaths (i.e., stubs) in a cooperative manner, and utilizing both the released stubs and the spare capacity on the cycles to set up backup paths. This is achieved by allowing all failure-aware nodes to switch traffic upon a link failure, such that the disrupted lightpaths can be restored even if the end nodes of the failed link are not on the cycles. CFP also differs from FIPP (Failure Independent Path Protecting) -cycle by reducing optical recovery time, and not requiring the cycles to pass through the source nodes of the protected lightpaths. By jointly optimizing both working and spare capacity placement, we formulate an ILP (Integer Linear Program) for CFP design without candidate cycle enumeration. Theoretical analysis and numerical results show that CFP significantly outperforms -cycle based schemes by achieving faster optical recovery speed with much higher capacity efficiency. The performance gain is achieved at the expense of higher compu- tation complexity, but without involving any additional signaling mechanism in the optical domain.", "citation": "Citations (7)", "departments": ["University of Waterloo", "University of Waterloo", "University of Hong Kong", "University of Ottawa", "University of Waterloo", "University of Waterloo", "University of Hong Kong", "Budapest University of Technology and Economics", "University of Ottawa", "Budapesti Műsza ... dományi Egyetem"], "authors": ["Bin Wu.....http://dblp.org/pers/hd/w/Wu_0002:Bin", "Pin-Han Ho.....http://dblp.org/pers/hd/h/Ho:Pin=Han", "Kwan L. Yeung.....http://dblp.org/pers/hd/y/Yeung:Kwan_L=", "János Tapolcai.....http://dblp.org/pers/hd/t/Tapolcai:J=aacute=nos", "Hussein T. Mouftah.....http://dblp.org/pers/hd/m/Mouftah:Hussein_T="], "conf": "infocom", "year": "2009", "pages": 5}