{"title": "Dynamic Power Allocation Under Arbitrary Varying Channels - An Online Approach.", "fields": ["heuristic", "channel allocation schemes", "competitive analysis", "dynamic demand", "power budget", "computer science", "online algorithm", "channel", "theoretical computer science"], "abstract": "A major problem in wireless networks is coping with limited resources, such as bandwidth and energy. These issues become a major algorithmic challenge in view of the dynamic nature of the wireless domain. We consider in this paper the single-transmitter power assignment problem under time-varying channels, with the objective of maximizing the data throughput. It is assumed that the transmitter has a limited power budget, to be sequentially divided during the lifetime of the battery. We deviate from the classic work in this area, which leads to explicit \"water-filling\" solutions, by considering a realistic scenario where the channel state quality changes arbitrarily from one transmission to the other. The problem is accordingly tackled within the framework of competitive analysis, which allows for worst-case performance guarantees in setups with arbitrarily varying channel conditions. We address both a \"discrete\" case, where the transmitter can transmit only at a fixed power level, and a \"continuous\" case, where the transmitter can choose any power level out of a bounded interval. For both cases, we propose online power-allocation algorithms with proven worst-case performance bounds. In addition, we establish lower bounds on the worst-case performance of any online algorithm and show that our proposed algorithms are optimal.", "citation": "Not cited", "departments": ["Open University", "IBM", "Microsoft", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Microsoft", "IBM", "Microsoft", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Niv Buchbinder.....http://dblp.org/pers/hd/b/Buchbinder:Niv", "Liane Lewin-Eytan.....http://dblp.org/pers/hd/l/Lewin=Eytan:Liane", "Ishai Menache.....http://dblp.org/pers/hd/m/Menache:Ishai", "Joseph Naor.....http://dblp.org/pers/hd/n/Naor:Joseph", "Ariel Orda.....http://dblp.org/pers/hd/o/Orda:Ariel"], "conf": "infocom", "year": "2009", "pages": 9}