{"title": "Secure Data Collection in Wireless Sensor Networks Using Randomized Dispersive Routes.", "fields": ["network packet", "multipath propagation", "wireless routing protocol", "mechanical index", "dynamic source routing", "multipath routing", "routing table", "static routing", "administrative distance", "data security", "adversary"], "abstract": "Compromised node and denial of service are two key attacks in wireless sensor networks (WSNs). In this paper, we study data delivery mechanisms that can with high probability circumvent black holes formed by these attacks. We argue that classic multipath routing approaches are vulnerable to such attacks, mainly due to their deterministic nature. So once the adversary acquires the routing algorithm, it can compute the same routes known to the source, hence, making all information sent over these routes vulnerable to its attacks. In this paper, we develop mechanisms that generate randomized multipath routes. Under our designs, the routes taken by the ? shares? of different packets change over time. So even if the routing algorithm becomes known to the adversary, the adversary still cannot pinpoint the routes traversed by each packet. Besides randomness, the generated routes are also highly dispersive and energy efficient, making them quite capable of circumventing black holes. We analytically investigate the security and energy performance of the proposed schemes. We also formulate an optimization problem to minimize the end-to-end energy consumption under given security constraints. Extensive simulations are conducted to verify the validity of our mechanisms.", "citation": "Not cited", "departments": ["University of Arizona", "University of Arizona", "University of Arizona", "University of Arizona", "University of Arizona", "University of Arizona"], "authors": ["Tao Shu.....http://dblp.org/pers/hd/s/Shu:Tao", "Sisi Liu.....http://dblp.org/pers/hd/l/Liu:Sisi", "Marwan Krunz.....http://dblp.org/pers/hd/k/Krunz:Marwan"], "conf": "infocom", "year": "2009", "pages": 5}