{"title": "Does a Gradual Transition to the Virtual World increase Presence?", "fields": ["latency", "virtual reality", "simulation", "virtual machine", "metaverse"], "abstract": "In order to increase a user's sense of presence in an artificial environment some researchers propose a gradual transition from reality to the virtual world instead of immersing users into the virtual world directly. One approach is to start the VR experience in a virtual replica of the physical space to accustom users to the characteristics of VR, e.g., latency, reduced field of view or tracking errors, in a known environment. Although this procedure is already applied in VR demonstrations, until now it has not been verified whether the usage of such a transitional environment ? as transition between real and virtual environment ? increases someone's sense of presence. We have observed subjective, physiological and behavioral reactions of subjects during a fully-immersive flight phobia experiment under two different conditions: the virtual flight environment was displayed immediately, or subjects visited a transitional environment before entering the virtual flight environment. We have quantified to what extent a gradual transition to the VE via a transitional environment increases the level of presence. We have found that subjective responses show significantly higher scores for the user's sense of presence, and that subjects' behavioral reactions change when a transitional environment is shown first. Considering physiological reactions, no significant difference could be found.", "citation": "Citations (26)", "departments": ["University of Münster", "University of Münster", "University of Münster", "University College London", "University of Münster"], "authors": ["Frank Steinicke.....http://dblp.org/pers/hd/s/Steinicke:Frank", "Gerd Bruder.....http://dblp.org/pers/hd/b/Bruder:Gerd", "Klaus H. Hinrichs.....http://dblp.org/pers/hd/h/Hinrichs:Klaus_H=", "Anthony Steed.....http://dblp.org/pers/hd/s/Steed:Anthony", "Alexander L. Gerlach.....http://dblp.org/pers/hd/g/Gerlach:Alexander_L="], "conf": "vr", "year": "2009", "pages": 8}