{"title": "Immersive environments for rehabilitation activities.", "fields": ["immersion", "rendering", "wheelchair", "virtual reality", "immersive technology"], "abstract": "This paper presents (a) new technologies for real-time immersion of humans into virtual reality (VR) environments with non-invasive real-time three-dimensional (3D) imaging, (b) a new methodology for evaluating immersive VR spaces in rehabilitation applications, and (c) experimental results documenting the benefits of Immersive VR (IVR) spaces for regaining proprioception. Our work focuses on designing immersive VR spaces with non-invasive multimedia sensory inputs where real time digital clones of humans are fused with virtual scenes for rehabilitation purposes. We hypothesize that humans with proprioceptive impairments can use their other senses as the proprioceptive feedback from real-time 3D+color reconstructions of their bodies in space. The objective is to investigate this hypothesis and quantify any benefits of immersive environments for regaining proprioception as one example of a rehabilitation application. The paper describes (a) the portable immersive VR system for real time 3D imaging, reconstruction and rendering, (b) a new methodology for quantitative evaluations of rehabilitation experiments in immersive VR spaces, and (c) the experimental results obtained for validating the above hypothesis with wheelchair basketball athletes. The novelty of the work lies in the first of its kind evaluation of the benefits of immersive VR spaces with multimedia cues for regaining proprioception.", "citation": "Citations (12)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Peter Bajcsy.....http://dblp.org/pers/hd/b/Bajcsy:Peter", "Kenton McHenry.....http://dblp.org/pers/hd/m/McHenry:Kenton", "Hye-Jung Na.....http://dblp.org/pers/hd/n/Na:Hye=Jung", "Rahul Malik.....http://dblp.org/pers/hd/m/Malik:Rahul", "Andrew Spencer.....http://dblp.org/pers/hd/s/Spencer:Andrew", "Suk-Kyu Lee.....http://dblp.org/pers/hd/l/Lee:Suk=Kyu", "Rob Kooper.....http://dblp.org/pers/hd/k/Kooper:Rob", "Mike Frogley.....http://dblp.org/pers/hd/f/Frogley:Mike"], "conf": "mm", "year": "2009", "pages": 4}