{"title": "AnySP: anytime anywhere anyway signal processing.", "fields": ["digital signal processor", "power management", "digital signal processing", "datapath", "software defined radio", "throughput", "multi core processor", "adaptability"], "abstract": "In the past decade, the proliferation of mobile devices has increased at a spectacular rate. There are now more than 3.3 billion active cell phones in the world-a device that we now all depend on in our daily lives. The current generation of devices employs a combination of general-purpose processors, digital signal processors, and hardwired accelerators to provide giga-operations-per-second performance on milliWatt power budgets. Such heterogeneous organizations are inefficient to build and maintain, as well as waste silicon area and power. Looking forward to the next generation of mobile computing, computation requirements will increase by one to three orders of magnitude due to higher data rates, increased complexity algorithms, and greater computation diversity but the power requirements will be just as stringent. Scaling of existing approaches will not suffice instead the inherent computational efficiency, programmability, and adaptability of the hardware must change. To overcome these challenges, this paper proposes an example architecture, referred to as AnySP, for the next generation mobile signal processing. AnySP uses a co-design approach where the next generation wireless signal processing and high-definition video algorithms are analyzed to create a domain specific programmable architecture. At the heart of AnySP is a configurable single-instruction multiple-data datapath that is capable of processing wide vectors or multiple narrow vectors simultaneously. In addition, deeper computation subgraphs can be pipelined across the single-instruction multiple-data lanes. These three operating modes provide high throughput across varying application types. Results show that AnySP is capable of sustaining 4G wireless processing and high-definition video throughput rates, and will approach the 1000 Mops/mW efficiency barrier when scaled to 45nm.", "citation": "Citations (104)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "Arizona State University", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "Arizona State University"], "authors": ["Mark Woh.....http://dblp.org/pers/hd/w/Woh:Mark", "Sangwon Seo.....http://dblp.org/pers/hd/s/Seo:Sangwon", "Scott A. Mahlke.....http://dblp.org/pers/hd/m/Mahlke:Scott_A=", "Trevor N. Mudge.....http://dblp.org/pers/hd/m/Mudge:Trevor_N=", "Chaitali Chakrabarti.....http://dblp.org/pers/hd/c/Chakrabarti:Chaitali", "Krisztián Flautner.....http://dblp.org/pers/hd/f/Flautner:Kriszti=aacute=n"], "conf": "isca", "year": "2009", "pages": 12}