{"title": "On Monitoring and Failure Localization in Mesh All-Optical Networks.", "fields": ["mesh networking", "bandwidth allocation", "communication complexity", "fault management", "condition monitoring"], "abstract": "Achieving fast and precise failure localization has long been a highly desired feature in all-optical mesh networks. M-trail (monitoring trail) has been proposed as the most general monitoring structure for achieving unambiguous failure localization (UFL) of any single link failure while effectively reducing the amount of alarm signals flooded in the networks. However, it is critical to come up with a fast and intelligent m-trail design approach for minimizing the number of m-trails and the totally consumed bandwidth, which ubiquitously determines the length of alarm code and bandwidth overhead for the M-trail deployment, respectively. In this paper, the m-trail design problem is investigated. To gain deeper understanding of the problem, we firstly conduct a bound analysis on the minimum length of alarm code required for UFL. Then, a novel algorithm based on random code assignment (RCA) and random code swapping (RCS) is developed for solving the m-trail design problem. The algorithm prototype can be found in. The algorithm is verified by comparing with an integer linear program (ILP), and the results demonstrate its superiority in minimizing the fault management cost and bandwidth consumption while achieving significant reduction in computation time. To investigate the impact of topology diversity, extensive simulation is conducted on thousands of random network topologies with systematically increased network connectivity. Lastly, we provide abundant discussions and interesting conclusive remarks that position our discoveries.", "citation": "Citations (119)", "departments": ["University of Waterloo", "University of Waterloo", "Dept. of Teleco ... hnol., Budapest"], "authors": ["János Tapolcai.....http://dblp.org/pers/hd/t/Tapolcai:J=aacute=nos", "Bin Wu.....http://dblp.org/pers/hd/w/Wu_0002:Bin", "Pin-Han Ho.....http://dblp.org/pers/hd/h/Ho:Pin=Han"], "conf": "infocom", "year": "2009", "pages": 9}