{"title": "SLAW: A New Mobility Model for Human Walks.", "fields": ["mobility model", "individual mobility", "mobile device", "scalability", "delay tolerant networking"], "abstract": "Simulating human mobility is important in mobile networks because many mobile devices are either attached to or controlled by humans and it is very hard to deploy real mobile networks whose size is controllably scalable for performance evaluation. Lately various measurement studies of human walk traces have discovered several significant statistical patterns of human mobility. Namely these include truncated power-law distributions of flights, pause-times and inter-contact times, fractal way-points, and heterogeneously defined areas of individual mobility. Unfortunately, none of existing mobility models effectively captures all of these features. This paper presents a new mobility model called SLAW (self-similar least action walk) that can produce synthetic walk traces containing all these features. This is by far the first such model. Our performance study using using SLAW generated traces indicates that SLAW is effective in representing social contexts present among people sharing common interests or those in a single community such as university campus, companies and theme parks. The social contexts are typically common gathering places where most people visit during their daily lives such as student unions, dormitory, street malls and restaurants. SLAW expresses the mobility patterns involving these contexts by fractal way points and heavy-tail flights on top of the way points. We verify through simulation that SLAW brings out the unique performance features of various mobile network routing protocols.", "citation": "Citations (589)", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University", "North Carolina State University", "KAIST"], "authors": ["Kyunghan Lee.....http://dblp.org/pers/hd/l/Lee:Kyunghan", "Seongik Hong.....http://dblp.org/pers/hd/h/Hong:Seongik", "Seong Joon Kim.....http://dblp.org/pers/hd/k/Kim:Seong_Joon", "Injong Rhee.....http://dblp.org/pers/hd/r/Rhee:Injong", "Song Chong.....http://dblp.org/pers/hd/c/Chong:Song"], "conf": "infocom", "year": "2009", "pages": 9}