{"title": "Ranking Measures and Loss Functions in Learning to Rank.", "fields": ["ranking", "maximization", "correctness", "ranking svm", "learning to rank"], "abstract": "Learning to rank has become an important research topic in machine learning. While most learning-to-rank methods learn the ranking functions by minimizing loss functions, it is the ranking measures (such as NDCG and MAP) that are used to evaluate the performance of the learned ranking functions. In this work, we reveal the relationship between ranking measures and loss functions in learning-to-rank methods, such as Ranking SVM, RankBoost, RankNet, and ListMLE. We show that the loss functions of these methods are upper bounds of the measure-based ranking errors. As a result, the minimization of these loss functions will lead to the maximization of the ranking measures. The key to obtaining this result is to model ranking as a sequence of classification tasks, and define a so-called essential loss for ranking as the weighted sum of the classification errors of individual tasks in the sequence. We have proved that the essential loss is both an upper bound of the measure-based ranking errors, and a lower bound of the loss functions in the aforementioned methods. Our proof technique also suggests a way to modify existing loss functions to make them tighter bounds of the measure-based ranking errors. Experimental results on benchmark datasets show that the modifications can lead to better ranking performances, demonstrating the correctness of our theoretical analysis.", "citation": "Citations (71)", "year": "2009", "departments": ["Chinese Academy of Sciences", "Microsoft", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Microsoft"], "conf": "nips", "authors": ["Wei Chen.....http://dblp.org/pers/hd/c/Chen_0034:Wei", "Tie-Yan Liu.....http://dblp.org/pers/hd/l/Liu:Tie=Yan", "Yanyan Lan.....http://dblp.org/pers/hd/l/Lan:Yanyan", "Zhiming Ma.....http://dblp.org/pers/hd/m/Ma:Zhiming", "Hang Li.....http://dblp.org/pers/hd/l/Li_0001:Hang"], "pages": 9}