{"title": "Hum.", "fields": ["psychophysiological interaction", "coordinate system", "statistical parametric mapping", "gastrointestinal stromal tumors gists", "neuroanatomy", "alternative medicine", "connectome", "fmrib software library", "dynamic functional connectivity", "unit sphere", "human brain", "genetics", "medicine", "stromal tumor", "dna", "hum", "global warming", "climate sensitivity", "bioinformatics", "functional analysis", "neuroscience", "brain mapping", "brodmann area", "atmospheric sciences", "traditional medicine", "cd117", "nomenclature", "data set", "sma", "climatology"], "abstract": "Abstract   An anatomical parcellation of the spatially normalized single-subject high-resolution T1 volume provided by the Montreal Neurological Institute (MNI) (D. L. Collins  et al.,  1998,  Trans. Med. Imag.  17, 463–468) was performed. The MNI single-subject main sulci were first delineated and further used as landmarks for the 3D definition of 45 anatomical volumes of interest (AVOI) in each hemisphere. This procedure was performed using a dedicated software which allowed a 3D following of the sulci course on the edited brain. Regions of interest were then drawn manually with the same software every 2 mm on the axial slices of the high-resolution MNI single subject. The 90 AVOI were reconstructed and assigned a label. Using this parcellation method, three procedures to perform the automated anatomical labeling of functional studies are proposed: (1) labeling of an extremum defined by a set of coordinates, (2) percentage of voxels belonging to each of the AVOI intersected by a sphere centered by a set of coordinates, and (3) percentage of voxels belonging to each of the AVOI intersected by an activated cluster. An interface with the Statistical Parametric Mapping package (SPM, J. Ashburner and K. J. Friston, 1999,  Hum. Brain Mapp.  7, 254–266) is provided as a freeware to researchers of the neuroimaging community. We believe that this tool is an improvement for the macroscopical labeling of activated area compared to labeling assessed using the Talairach atlas brain in which deformations are well known. However, this tool does not alleviate the need for more sophisticated labeling strategies based on anatomical or cytoarchitectonic probabilistic maps.", "citation": "Citations (9,134)", "departments": ["University of Paris", "University of Paris", "University of Paris", "University of Paris", "John Radcliffe Hospital", "Emory University", "Emory University", "Cancer Institute", "Emory University", "Emory University", "Yale University", "University of Texas Health Science Center at San Antonio", "University of Texas Health Science Center at San Antonio", "University of Texas Health Science Center at San Antonio", "University of Texas Health Science Center at San Antonio", "Leiden University Medical Center", "Harvard University", "University of California, San Diego", "Harvard University", "Harvard University", "1 and 2", "1 and 2", "1 and 2", "Univ. Sheffield", "Research Imaging Institute", "Division de Gén ... ve, Switzerland"], "authors": ["Jody Ghani.....http://dblp.org/pers/hd/g/Ghani:Jody"], "conf": "siggraph", "year": "2009", "pages": 1}