{"title": "Studying brain morphometry using conformal equivalence class.", "fields": ["poincare disk model", "brain morphometry", "conformal map", "yamabe flow", "teichmuller space"], "abstract": "Two surfaces are conformally equivalent if there exists a bijective angle-preserving map between them. The Teichmuller space for surfaces with the same topology is a finite-dimensional manifold, where each point represents a conformal equivalence class, and the conformal map is homotopic to the identity map. In this paper, we propose a novel method to apply conformal equivalence based shape index to study brain morphometry. The shape index is defined based on Teichmuller space coordinates. It is intrinsic, and invariant under conformal transformations, rigid motions and scaling. It is also simple to compute; no registration of surfaces is needed. Using the Yamabe flow method, we can conformally map a genus-zero open boundary surface to the Poincare disk. The shape indices that we compute are the lengths of a special set of geodesics under hyperbolic metric. By computing and studying this shape index and its statistical behavior, we can analyze differences in anatomical morphometry due to disease or development. Study on twin lateral ventricular surface data shows it may help detect generic influence on lateral ventricular shapes. In leave-one-out validation tests, we achieved 100% accurate classification (versus only 68% accuracy for volume measures) in distinguishing 11 HIV/AIDS individuals from 8 healthy control subjects, based on Teichmuller coordinates for lateral ventricular surfaces extracted from their 3D MRI scans.Our conformal invariants, the Teichmuller coordinates, successfully classified all lateral ventricular surfaces, showing their promise for analyzing anatomical surface morphometry.", "citation": "Citations (4)", "year": "2009", "departments": ["University of California, Los Angeles", "Zhejiang University", "University of California, Los Angeles", "Stony Brook University", "University of California, Los Angeles"], "conf": "iccv", "authors": ["Yalin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Yalin", "Wei Dai.....http://dblp.org/pers/hd/d/Dai:Wei", "Yi-Yu Chou.....http://dblp.org/pers/hd/c/Chou:Yi=Yu", "Xianfeng Gu.....http://dblp.org/pers/hd/g/Gu:Xianfeng", "Tony F. Chan.....http://dblp.org/pers/hd/c/Chan:Tony_F=", "Arthur W. Toga.....http://dblp.org/pers/hd/t/Toga:Arthur_W=", "Paul M. Thompson.....http://dblp.org/pers/hd/t/Thompson:Paul_M="], "pages": 8}