{"title": "Random vs. Deterministic Deployment of Sensors in the Presence of Failures and Placement Errors.", "fields": ["wireless sensor network", "randomness", "software deployment", "probability density function", "algorithm design"], "abstract": "Although random deployment is widely used in theoretical analysis of coverage and connectivity, and evaluation of various algorithms (e.g., sleep-wakeup), it has often been considered too expensive as compared to optimal deterministic deployment patterns when deploying sensors in real-life. Roughly speaking, a factor of log n additional sensors are needed in random deployment as compared to optimal deterministic deployment if n sensors are needed in a random deployment. This may be an illusion however, since all real-life large-scale deployments strategies result in some randomness, two prime sources being placement errors and sensor failures, either at the time of deployment or afterwards. In this paper, we consider the effects of placement errors and random failures on the density needed to achieve full coverage when sensors are deployed randomly versus deterministically. We compare three popular strategies for deployment. In the first strategy, sensors are deployed in an optimal lattice but enough sensors are colocated at each lattice point to compensate for failure and placement errors. In the second, only one sensor is deployed at each lattice point but lattice spacing is sufficiently shrunk to achieve a desired quality of coverage in the presence of failure and placement errors. In the third, a random deployment is used with appropriate density. We derive explicit expressions for the density needed for each of the three strategies to achieve a given quality of coverage, which are of independent interest. In comparing the three deployments, we find that if errors in placement are half the sensing range and failure probability is 50%, random deployment needs only around 10% higher density to provide a similar quality of coverage as the other two. We provide a comprehensive comparison to help a practitioner decide the lowest cost deployment strategy in real-life.", "citation": "Citations (54)", "departments": ["University of Memphis", "University of Memphis"], "authors": ["Paul Balister.....http://dblp.org/pers/hd/b/Balister:Paul", "Santosh Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Santosh"], "conf": "infocom", "year": "2009", "pages": 5}