{"title": "MRR: Enabling fully adaptive multicast routing for CMP interconnection networks.", "fields": ["link state packet", "distance vector multicast routing protocol", "one armed router", "pragmatic general multicast", "xcast"], "abstract": "On-network hardware support for multi-destination traffic is a desirable feature in most multiprocessor machines. Multicast hardware capabilities enable much more effective bandwidth utilization as multi-destination packets do not need to repeatedly use the same resources, as occurs when multicast traffic must be decomposed in unicast packets. Although Chip Multiprocessors are not an exception in this interest, up to date, few fitting proposals exist. The combination of the scarcity of available resources and the common idea that multicast support requires a substantial amount of extra resources is responsible for this situation. In this work, we propose a new approach suitable for on-chip networks capable of managing multi-destination traffic via hardware in an efficient way with negligible complexity. We introduce the Multicast Rotary Router (MRR), a router able to: (1) perform on-network multicast support with almost zero cost over the Rotary Router, (2) use a fully adaptive tree to distribute multicast traffic, (3) perform on-network congestion control extending network utilization range. The performance results, using a state-of-the-art full system simulation framework, show that it improves average full system performance of a CMP using a unicast Rotary Router in its interconnection network by 25%, and an input buffered router with multicast support by 20%.", "citation": "Citations (66)", "departments": ["University of Cantabria", "University of Cantabria", "University of Cantabria"], "authors": ["Pablo Abad Fidalgo.....http://dblp.org/pers/hd/f/Fidalgo:Pablo_Abad", "Valentin Puente.....http://dblp.org/pers/hd/p/Puente:Valentin", "José-Ángel Gregorio.....http://dblp.org/pers/hd/g/Gregorio:Jos=eacute===Aacute=ngel"], "conf": "hpca", "year": "2009", "pages": 12}