{"title": "Minimizing End-to-End Delay: A Novel Routing Metric for Multi-Radio Wireless Mesh Networks.", "fields": ["queuing delay", "wireless mesh network", "transmission delay", "processing delay", "elmore delay"], "abstract": "This paper studies how to select a path with the minimum cost in terms of expected end-to-end delay (EED) in a multi-radio wireless mesh network. Different from the previous efforts, the new EED metric takes the queuing delay into account, since the end-to-end delay consists of not only the transmission delay over the wireless links but also the queuing delay in the buffer. In addition to minimizing the end-to-end delay, the EED metric implies the concept of load balancing. We develop EED- based routing protocols for both single-channel and multi-channel wireless mesh networks. In particular for the multi-radio multi- channel case, we develop a generic iterative approach to calculate a multi-radio achievable bandwidth (MRAB) for a path, taking the impacts of inter/intra-flow interference and space/channel diversity into account. The MRAB is then integrated with EED to form the metric of weighted end-to-end delay (WEED). As a byproduct of MRAB, a channel diversity coefficient can be defined to quantitatively represent the channel diversity along a given path. Both numerical analysis and simulation studies are presented to validate the performance of the routing protocol based on the EED/WEED metric, with comparison to some well- known routing metrics. I. INTRODUCTION Routing in wireless mesh networks has been a hot re- search area in recent years, with the objective to achieve as high throughput as possible over the network. The main methodology adopted by most of the existing work is selecting path based on interference-aware or load-balancing routing metrics to reduce network-wide channel contentions. It has been revealed that the capacity of a single-radio multi-hop wireless network can not scale up with the network size, due to the co-channel interference (1)-(3). The multi-radio multi-channel connection has been widely considered as an efficient approach to increase the wireless network capacity (8). Design of efficient routing schemes for multi-radio multi- channel wireless mesh network is much more challenging compared to the single-channel case. Many popular multimedia applications, e.g., voice over IP, IPTV, and on-line gaming, have strict delay requirement. In this paper, we aim at designing a routing metric to minimize the end-to-end delay, considering not only the transmission delay at the medium access control (MAC) layer, but also the queuing delay at the network layer. Most of the previous studies focus only on the transmission delay of the packet", "citation": "Citations (129)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology", "University of Waterloo"], "authors": ["Hongkun Li.....http://dblp.org/pers/hd/l/Li:Hongkun", "Yu Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Yu", "Chi Zhou.....http://dblp.org/pers/hd/z/Zhou:Chi", "Weihua Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Weihua"], "conf": "infocom", "year": "2009", "pages": 9}