{"title": "Reverse Furthest Neighbors in Spatial Databases.", "fields": ["data set", "chemical plant", "r tree", "convex hull", "spatial database"], "abstract": "Given a set of points $P$ and a query point $q$, the {\\em reverse furthest neighbor} (\\trfn) query fetches the set of points $p \\in P$ such that $q$ is their furthest neighbor among all points in $P\\cup\\{q\\}$. This is the monochromatic \\trfn (\\mrfn) query. Another interesting version of \\trfn query is the {\\em bichromatic reverse furthest neighbor} (\\brfn) query. Given a set of points $P$, a query set $Q$ and a query point $q\\in Q$, a \\brfn query fetches the set of points $p\\in P$ such that $q$ is the furthest neighbor of $p$ among all points in $Q$. The \\trfn query has many interesting applications in spatial databases and beyond. For instance, given a large residential database (as $P$) and a set of potential sites (as $Q$) for building a chemical plant complex, the construction site should be selected as the one that has the maximum number of reverse furthest neighbors. This is an instance of the \\brfn query. This paper presents the challenges associated with such queries and proposes efficient, R-tree based algorithms for both monochromatic and bichromatic versions of the \\trfn queries. We analyze properties of the \\trfn query that differentiate it from the widely studied reverse nearest neighbor queries and enable the design of novel algorithms. Our approach takes advantage of the furthest Voronoi diagrams as well asthe convex hulls of either the data set $P$ (in the \\mrfn case) or the query set $Q$ (in the \\brfn case). For the \\brfn queries, we also extend the analysis to the situation when $Q$ is large in size and becomes disk-resident. Experiments on both synthetic and real data sets confirm the efficiency and scalability of proposed algorithmsover the brute-force search based approach.", "citation": "Citations (52)", "departments": ["Florida State University", "Florida State University", "Florida State University"], "authors": ["Bin Yao.....http://dblp.org/pers/hd/y/Yao_0002:Bin", "Feifei Li.....http://dblp.org/pers/hd/l/Li_0001:Feifei", "Piyush Kumar.....http://dblp.org/pers/hd/k/Kumar:Piyush"], "conf": "icde", "year": "2009", "pages": 12}