{"title": "A Learning-based Multiuser Opportunistic Spectrum Access Approach in Unslotted Primary Networks.", "fields": ["primary channel", "cognitive radio", "spite", "idle", "dynamic spectrum management"], "abstract": "Opportunistic spectrum access presents a new ap- proach to wireless spectrum utilization and management. In this paper, we propose a non-cooperative based OSA approach: learning-based approach to allow multiple secondary users to achieve maximal throughput in an unslotted opportunistic spec- trum access (OSA) network. In this approach, collisions among secondary users are taken into consideration while making channel sensing decisions. Spectrum maps for secondary users are estimated based on occurrence of collisions. Our approach allows secondary users to achieve maximal throughput by seeking independent spectrum opportunities without exchanging any control information among secondary users. Numerical results show that the learning-based approach obtains near-optimal performance in most of the scenarios. The proliferation of a wide range of wireless devices has resulted in an overly crowded radio spectrum. In contrast to this scarcity in spectrum availability is the pervasive existence of spectrum opportunities. Real measurements show that, at any given time and location, a large portion of licensed spectrum lies unused (1). To exploit the abundant spectrum opportunities, cognitive radio networks have been proposed as a novel approach to improve spectrum utilization. Op- portunistic spectrum access (OSA) is one of the approaches envisioned for dynamic spectrum management in cognitive radio networks (2). The basic idea of OSA is to allow secondary users to identify and exploit spectrum opportunities under the constraint that they do not cause harmful interference to primary users. Most of the existing works on OSA strategies assume the presence of a slotted primary network (2)-(9). These OSA strategies maximize the throughput of an individual secondary user in a multi-channel slotted primary network. In presence of multiple channels, a key decision for every secondary user is to determine which channel to sense. With multiple secondary users contending for spectrum opportunities, the sensing decision must take into account the possibility that the good channels may be desired by other users. At the beginning of every slot, every secondary user senses an idle primary channel to potentially transmit over. Based on the sensing decision in the beginning of the slot, secondary users decide if the channel will be idle for the remaining of the slot. However, if the primary users adopt an unslotted transmission scheme, the channel can switch between idle and busy state at any time. This leads to potential collisions with the primary users or missed opportunities in spite of perfect sensing during the sensing period. The secondary users need to make a decision to transmit based on its sensing decision. The secondary users should minimize missed opportunities due to inaccurate detection outcomes and limit collisions with the primary users. In this paper, we design a learning-based OSA approach to enable secondary users maximize their spectrum opportunities in unslotted primary networks. Our learning-based approach explores the interaction between secondary users to make the channel sensing decision. Specifically, each secondary user takes into consideration a partial spectrum map of colliding secondary users. The partial spectrum map is obtained by estimating colliding secondary user's channel belief vector. The belief vectors are implicitly learned and updated based on the occurrence of collisions. The is an important property as secondary users cannot completely ignore the presence of", "citation": "Citations (22)", "departments": ["Rowan University", "Old Dominion University", "Norfolk State University", "City University of New York"], "authors": ["Sachin Shetty.....http://dblp.org/pers/hd/s/Shetty:Sachin", "Min Song.....http://dblp.org/pers/hd/s/Song_0002:Min", "Chunsheng Xin.....http://dblp.org/pers/hd/x/Xin:Chunsheng", "E. K. Park.....http://dblp.org/pers/hd/p/Park:E=_K="], "conf": "infocom", "year": "2009", "pages": 5}