{"title": "MPIWiz: subgroup reproducible replay of mpi applications.", "fields": ["message passing interface", "debugging", "exploit", "distributed memory", "concurrency"], "abstract": "Message Passing Interface (MPI) is a widely used standard for managing coarse-grained concurrency on distributed computers. Debugging parallel MPI applications, however, has always been a particularly challenging task due to their high degree of concurrent execution and non-deterministic behavior. Deterministic replay is a potentially powerful technique for addressing these challenges, with existing MPI replay tools adopting either data-replay or order-replay approaches. Unfortunately, each approach has its tradeoffs. Data-replay generates substantial log sizes by recording every communication message. Order-replay generates small logs, but requires all processes to be replayed together. We believe that these drawbacks are the primary reasons that inhibit the wide adoption of deterministic replay as the critical enabler of cyclic debugging of MPI applications.   This paper describes  subgroup reproducible replay  (SRR), a hybrid deterministic replay method that provides the benefits of both data-replay and order-replay while balancing their trade-offs. SRR divides all processes into disjoint groups. It records the contents of messages crossing group boundaries as in data-replay, but records just message orderings for communication within a group as in order-replay. In this way, SRR can exploit the communication locality of traffic patterns in MPI applications. During replay, developers can then replay each group individually. SRR reduces recording overhead by not recording intra-group communication, and reduces replay overhead by limiting the size of each replay group. Exposing these tradeoffs gives the user the necessary control for making deterministic replay practical for MPI applications.   We have implemented a prototype, MPIWiz, to demonstrate and evaluate SRR. MPIWiz employs a replay framework that allows transparent binary instrumentation of both library and system calls. As a result, MPIWiz replays MPI applications with no source code modification and relinking, and handles non-determinism in both MPI and OS system calls. Our preliminary results show that MPIWiz can reduce recording overhead by over a factor of four relative to data-replay, yet without requiring the entire application to be replayed as in order-replay. Recording increases execution time by 27% while the application can be replayed in just 53% of its base execution time.", "citation": "Citations (60)", "year": "2009", "departments": ["Tsinghua University", "Microsoft", "Microsoft", "Microsoft", "Tsinghua University"], "conf": "ppopp", "authors": ["Ruini Xue.....http://dblp.org/pers/hd/x/Xue:Ruini", "Xuezheng Liu.....http://dblp.org/pers/hd/l/Liu:Xuezheng", "Ming Wu.....http://dblp.org/pers/hd/w/Wu:Ming", "Zhenyu Guo.....http://dblp.org/pers/hd/g/Guo:Zhenyu", "Wenguang Chen.....http://dblp.org/pers/hd/c/Chen:Wenguang", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin", "Zheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Zheng", "Geoffrey M. Voelker.....http://dblp.org/pers/hd/v/Voelker:Geoffrey_M="], "pages": 10}