{"title": "A Social Network Based Patching Scheme for Worm Containment in Cellular Networks.", "fields": ["download", "cellular network", "android", "multimedia messaging service", "mobile phone"], "abstract": "Recently, cellular phone networks have begun allowing third-party applications to run over certain open-API phone operating systems such as Windows Mobile, Iphone and Google’s Android platform. However, with this increased openness, the fear of rogue programs written to propagate from one phone to another becomes ever more real. This chapter proposes a counter-mechanism to contain the propagation of a mobile worm at the earliest stage by patching an optimal set of selected phones. The counter-mechanism continually extracts a social relationship graph between mobile phones via an analysis of the network traffic. As people are more likely to open and download content that they receive from friends, this social relationship graph is representative of the most likely propagation path of a mobile worm. The counter-mechanism partitions the social relationship graph via two different algorithms, balanced and clustered partitioning and selects an optimal set of phones to be patched first as those have the capability to infect the most number of other phones. The performance of these partitioning algorithms is compared against a benchmark random partitioning scheme. Through extensive trace-driven experiments using real IP packet traces from one of the largest cellular networks in the US, we demonstrate the efficacy of our proposed counter-mechanism in containing a mobile worm.", "citation": "Citations (152)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Narus", "Narus"], "authors": ["Zhichao Zhu.....http://dblp.org/pers/hd/z/Zhu:Zhichao", "Guohong Cao.....http://dblp.org/pers/hd/c/Cao:Guohong", "Sencun Zhu.....http://dblp.org/pers/hd/z/Zhu:Sencun", "Supranamaya Ranjan.....http://dblp.org/pers/hd/r/Ranjan:Supranamaya", "Antonio Nucci.....http://dblp.org/pers/hd/n/Nucci:Antonio"], "conf": "infocom", "year": "2009", "pages": 9}