{"title": "Cooperative Relay for Cognitive Radio Networks.", "fields": ["spectral efficiency", "cognitive radio", "frequency allocation", "orthogonal frequency division multiplexing", "software defined radio"], "abstract": "Cognitive radio has been proposed in recent years to promote the spectrum utilization by exploiting the existence of spectrum holes. The heterogeneity of both spectrum availability and traffic demand in secondary users has brought significant challenge for efficient spectrum allocation in cognitive radio networks. Observing that spectrum resource can be better matched to traffic demand of secondary users with the help of relay node that has rich spectrum resource, in this paper we exploit a new research direction for cognitive radio networks by utilizing cooperative relay to assist the transmission and improve spectrum efficiency. An infrastructure-based secondary network architecture has been proposed to leverage relay-assisted discontiguous OFDM (D-OFDM) for data transmission. In this architecture, relay node will be selected which can bridge the source and the destination using its common channels between those two nodes. With the introduction of cooperative relay, many unique problems should be considered, especially the issue for relay selection and spectrum allocation. We propose a central- ized heuristic solution to address the new resource allocation problem. To demonstrate the feasibility and performance of cooperative relay for cognitive radio, a new MAC protocol has been proposed and implemented in a Universal Software Radio Peripheral (USRP)-based testbed. Experimental results show that the throughput of the whole system is greatly increased by exploiting the benefit of cooperative relay.", "citation": "Citations (267)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Juncheng Jia.....http://dblp.org/pers/hd/j/Jia:Juncheng", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "conf": "infocom", "year": "2009", "pages": 9}