{"title": "Daydreamer.", "fields": ["intertextuality", "alliance", "art", "big five personality traits", "mindfulness", "clinical psychology", "social anxiety", "effector", "imagination", "biological process", "attentional control", "paratext", "valorisation", "stat protein", "introspection", "empirical research", "self help", "psychotherapist", "openness to experience", "personal development", "bracketing", "literature", "morality", "phenomenology", "performance art", "psychological intervention", "night owl", "pi3k akt mtor pathway", "hermeneutics", "psychology", "signal transducing adaptor protein", "consciousness", "adventure"], "abstract": "How independent signaling pathways are integrated to holistically control a biological process is not well understood. We have identified Daydreamer (DydA), a new member of the Mig10/RIAM/lamellipodin (MRL) family of adaptor proteins that localizes to the leading edge of the cell. DydA is a putative Ras effector that is required for cell polarization and directional movement during chemotaxis. dydA− cells exhibit elevated F-actin and assembled myosin II (MyoII), increased and extended phosphoinositide-3-kinase (PI3K) activity, and extended phosphorylation of the activation loop of PKB and PKBR1, suggesting that DydA is involved in the negative regulation of these pathways. DydA is phosphorylated by glycogen synthase kinase-3 (GSK-3), which is required for some, but not all, of DydA's functions, including the proper regulation of PKB and PKBR1 and MyoII assembly. gskA− cells exhibit very strong chemotactic phenotypes, as previously described, but exhibit an increased rate of random motility. gskA− cells have a reduced MyoII response and a reduced level of phosphatidylinositol (3,4,5)-triphosphate production, but a highly extended recruitment of PI3K to the plasma membrane and highly extended kinetics of PKB and PKBR1 activation. Our results demonstrate that GSK-3 function is essential for chemotaxis, regulating multiple substrates, and that one of these effectors, DydA, plays a key function in the dynamic regulation of chemotaxis.", "citation": "Not cited", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of Groningen", "University of California, San Diego", "Carleton University", "Carleton University", "University of Pisa"], "authors": ["Roland Womack.....http://dblp.org/pers/hd/w/Womack:Roland"], "conf": "siggraph", "year": "2009", "pages": 1}