{"title": "Computational Indistinguishability Amplification: Tight Product Theorems for System Composition.", "fields": ["cryptographic primitive", "pseudorandom generator", "block cipher", "mathematics", "computational indistinguishability", "special case", "composition", "theoretical computer science"], "abstract": "Computational indistinguishability amplification is the problem of strengthening cryptographic primitives whose security is defined by bounding the distinguishing advantage of an efficient distinguisher. Examples include pseudorandom generators (PRGs), pseudorandom functions (PRFs), and pseudorandom permutations (PRPs).\n\nThe literature on computational indistinguishability amplification consists only of few isolated results. Yao's XOR-lemma implies, by a hybrid argument, that no efficient distinguisher has advantage better than (roughly) n2 m ? 1 ? m in distinguishing the XOR of m independent n-bit PRG outputs S 1,...,S m from uniform randomness if no efficient distinguisher has advantage more than ? in distinguishing S i from a uniform n-bit string. The factor 2 m ? 1 allows for security amplification only if $\\delta<\\frac{1}{2}$: For the case of PRFs, a random-offset XOR-construction of Myers was the first result to achieve strong security amplification, i.e., also for $\\frac{1}{2} \\le \\delta < 1$.\n\nThis paper proposes a systematic treatment of computational indistinguishability amplification. We generalize and improve the above product theorem for the XOR of PRGs along five axes. First, we prove the tight information-theoretic bound 2 m ? 1 ? m (without factor n) also for the computational setting. Second, we prove results for interactive systems (e.g. PRFs or PRPs). Third, we consider the general class of neutralizing combination constructions, not just XOR. As an application, this yields the first indistinguishability amplification results for the cascade of PRPs (i.e., block ciphers) converting a weak PRP into an arbitrarily strong PRP, both for single-sided and two-sided queries. Fourth, strong security amplification is achieved for a subclass of neutralizing constructions which includes as a special case the construction of Myers. As an application we obtain highly practical optimal security amplification for block ciphers, simply by adding random offsets at the input and output of the cascade. Fifth, we show strong security amplification also for weakened assumptions like security against random-input (as opposed to chosen-input) attacks.\n\nA key technique is a generalization of Yao's XOR-lemma to (interactive) systems which is of independent interest.", "citation": "Not cited", "departments": ["ETH Zurich", "ETH Zurich"], "authors": ["Ueli M. Maurer.....http://dblp.org/pers/hd/m/Maurer:Ueli_M=", "Stefano Tessaro.....http://dblp.org/pers/hd/t/Tessaro:Stefano"], "conf": "crypto", "year": "2009", "pages": 19}