{"title": "STAR: Steiner-Tree Approximation in Relationship Graphs.", "fields": ["approximation algorithm", "ranking", "steiner tree problem", "biological network", "entity relationship model"], "abstract": "Large graphs and networks are abundant in modern information systems: entity-relationship graphs over relational data or Web-extracted entities, biological networks, social online communities, knowledge bases, and many more. Often such data comes with expressive node and edge labels that allow an interpretation as a semantic graph, and edge weights that reflect the strengths of semantic relations between entities. Finding close relationships between a given set of two, three, or more entities is an important building block for many search, ranking, and analysis tasks. From an algorithmic point of view, this translates into computing the best Steiner trees between the given nodes, a classical NP-hard problem. In this paper, we present a new approximation algorithm, coined STAR, for relationship queries over large relationship graphs. We prove that for n query entities, STAR yields an O(log(n))-approximation of the optimal Steiner tree in pseudopolynomial run-time, and show that in practical cases the results returned by STAR are qualitatively comparable to or even better than the results returned by a classical 2-approximation algorithm. We then describe an extension to our algorithm to return the top-k Steiner trees. Finally, we evaluate our algorithm over both main-memory as well as completely diskresident graphs containing millions of nodes. Our experiments show that in terms of efficiency STAR outperforms the best state-of-the-art database methods by a large margin, and also returns qualitatively better results.", "citation": "Citations (136)", "departments": ["Max Planck Society", "Max Planck Society", "Max Planck Society", "Max Planck Society", "Max Planck Society"], "authors": ["Gjergji Kasneci.....http://dblp.org/pers/hd/k/Kasneci:Gjergji", "Maya Ramanath.....http://dblp.org/pers/hd/r/Ramanath:Maya", "Mauro Sozio.....http://dblp.org/pers/hd/s/Sozio:Mauro", "Fabian M. Suchanek.....http://dblp.org/pers/hd/s/Suchanek:Fabian_M=", "Gerhard Weikum.....http://dblp.org/pers/hd/w/Weikum:Gerhard"], "conf": "icde", "year": "2009", "pages": 12}