{"title": "CAMP: A technique to estimate per-structure power at run-time using a few simple parameters.", "fields": ["frequency scaling", "power gating", "dynamic demand", "clock gating", "out of order execution"], "abstract": "Microprocessor power has become a first-order constraint at run-time. Designers must employ aggressive power-management techniques at run-time to keep a processor's ballooning power requirements under control. Effective power management benefits from knowledge of run-time microprocessor power consumption in both the core and individual microarchitectural structures, such as caches, queues, and execution units. Increasingly feasible per-structure power-control techniques, such as fine-grain clock gating, power gating, and dynamic voltage/frequency scaling (DVFS), become more effective from run-time estimates of per-structure power. However, run-time computation of per-structure power estimates based on utilization requires daunting numbers of input statistics, which makes per-structure monitoring of run-time power a challenging problem. To address the challenges of estimating per-structure power in hardware, we propose a new technique, called Common Activity-based Model for Power (CAMP), to estimate activity factors and power for microarchitectural structures. Despite using a relatively few input parameters-specifically nine-based on general microprocessor utilization statistics (e.g., IPC and load rate), our linear-regression-based model estimates activity and dynamic power for over 100 structures in an out-of-order x86 pipeline and core power with an average error of 8%. Because the computations utilize few inputs, CAMP is simple enough to implement in hardware, providing run-time structure and core power estimates for dynamic power management. Because the input statistics are generic in nature and the model remains accurate across incremental microarchitectural refinements, CAMP provides simple intuitive equations relating global microarchitectural statistics to structure activity and power. These equations provide a simple technique that can equate changes in one structure's activity to power variations in other structures across the pipeline.", "citation": "Citations (99)", "departments": ["Intel", "Intel", "Intel", "Intel", "Cornell University"], "authors": ["Michael D. Powell.....http://dblp.org/pers/hd/p/Powell:Michael_D=", "Arijit Biswas.....http://dblp.org/pers/hd/b/Biswas:Arijit", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S=", "Shubhendu S. Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Shubhendu_S=", "Basit R. Sheikh.....http://dblp.org/pers/hd/s/Sheikh:Basit_R=", "Shrirang M. Yardi.....http://dblp.org/pers/hd/y/Yardi:Shrirang_M="], "conf": "hpca", "year": "2009", "pages": 12}