{"title": "Multi-focal learning and its application to customer service support.", "fields": ["stability", "synchronous learning", "proactive learning", "multi task learning", "online machine learning"], "abstract": "In this study, we formalize a multi-focal learning problem, where training data are partitioned into several different focal groups and the prediction model will be learned within each focal group. The multi-focal learning problem is motivated by numerous real-world learning applications. For instance, for the same type of problems encountered in a customer service center, the problem descriptions from different customers can be quite different. The experienced customers usually give more precise and focused descriptions about the problem. In contrast, the inexperienced customers usually provide more diverse descriptions. In this case, the examples from the same class in the training data can be naturally in different focal groups. As a result, it is necessary to identify those natural focal groups and exploit them for learning at different focuses. The key developmental challenge is how to identify those focal groups in the training data. As a case study, we exploit multi-focal learning for profiling problems in customer service centers. The results show that multifocal learning can significantly boost the learning accuracies of existing learning algorithms, such as Support Vector Machines (SVMs), for classifying customer problems.", "citation": "Citations (2)", "departments": ["Rutgers University", "Rutgers University", "Rutgers University", "IBM", "University of Texas at Dallas"], "authors": ["Yong Ge.....http://dblp.org/pers/hd/g/Ge:Yong", "Hui Xiong.....http://dblp.org/pers/hd/x/Xiong:Hui", "Wenjun Zhou.....http://dblp.org/pers/hd/z/Zhou:Wenjun", "Ramendra K. Sahoo.....http://dblp.org/pers/hd/s/Sahoo:Ramendra_K=", "Xiaofeng Gao.....http://dblp.org/pers/hd/g/Gao:Xiaofeng", "Weili Wu.....http://dblp.org/pers/hd/w/Wu:Weili"], "conf": "kdd", "year": "2009", "pages": 10}