{"title": "Self-Organizing Dynamic Fractional Frequency Reuse for Best-Effort Traffic through Distributed Inter-Cell Coordination.", "fields": ["maximization", "orthogonal frequency division multiplexing", "orthogonal frequency division multiple access", "frequency allocation", "network utility"], "abstract": "Self-optimization of the network, for the purposes of improving overall capacity and/or cell edge data rates, is an important objective for next generation cellular systems. We propose algorithms that automatically create efficient, soft fractional frequency reuse (FFR) patterns for enhancing performance of orthogonal frequency division multiple access (OFDMA) based cellular systems for forward link best effort traffic. The Multi- sector Gradient (MGR) algorithm adjusts the transmit powers of the different sub-bands by systematically pursuing maximization of the overall network utility. We show that the maximization can be done by sectors operating in a semi-autonomous way, with only some gradient information exchanged periodically by neighboring sectors. The Sector Autonomous (SA) algorithm adjusts its transmit powers in each sub-band independently in each sector using a non-trivial heuristic to achieve out- of-cell interference mitigation. This algorithm is completely autonomous and requires no exchange of information between sectors. Through extensive simulations, we demonstrate that both algorithms provide substantial performance improvements. In particular, they can improve the cell edge data throughputs significantly, by up to 66% in some cases for the MGR, while maintaining the overall sector throughput at the same level as that achieved by the traditional approach. The simulations also show that both algorithms lead the system to \"self-organize\" into efficient, soft FFR patterns with no a priori frequency planning.", "citation": "Citations (216)", "departments": ["Bell Labs", "Bell Labs"], "authors": ["Alexander L. Stolyar.....http://dblp.org/pers/hd/s/Stolyar:Alexander_L=", "Harish Viswanathan.....http://dblp.org/pers/hd/v/Viswanathan:Harish"], "conf": "infocom", "year": "2009", "pages": 9}