{"title": "Continuous Subgraph Pattern Search over Graph Streams.", "fields": ["graph factorization", "maximum common subgraph isomorphism problem", "universal graph", "factor critical graph", "forbidden graph characterization"], "abstract": "Search over graph databases has attracted much attention recently due to its usefulness in many fields, such as the analysis of chemical compounds, intrusion detection in network traffic data, and pattern matching over users' visiting logs. However, most of the existing work focuses on search over static graph databases while in many real applications graphs are changing over time. In this paper we investigate a new problem on continuous subgraph pattern search under the situation where multiple target graphs are constantly changing in a stream style, namely the subgraph pattern search over graph streams. Obviously the proposed problem is a continuous join between query patterns and graph streams where the join predicate is the existence of subgraph isomorphism. Due to the NP-completeness of subgraph isomorphism checking, to achieve the real time monitoring of the existence of certain subgraph patterns, we would like to avoid using subgraph isomorphism verification to find the exact query-stream subgraph isomorphic pairs but to offer an approximate answer that could report all probable pairs without missing any of the actual answer pairs. In this paper we propose a light-weight yet effective feature structure called Node-Neighbor Tree to filter false candidate query-stream pairs. To reduce the computational cost, we further project the feature structures into a numerical vector space and conduct dominant relationship checking in the projected space. We propose two methods to efficiently check dominant relationships and substantiate our methods with extensive experiments.", "citation": "Citations (24)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Changliang Wang.....http://dblp.org/pers/hd/w/Wang:Changliang", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei"], "conf": "icde", "year": "2009", "pages": 12}