{"title": "A scalable micro wireless interconnect structure for CMPs.", "fields": ["wireless router", "latency", "deadlock", "architecture", "scalability"], "abstract": "This paper describes an unconventional way to apply wireless networking in emerging technologies. It makes the case for using a two-tier hybrid wireless/wired architecture to interconnect hundreds to thousands of cores in chip multiprocessors (CMPs), where current interconnect technologies face severe scaling limitations in excessive latency, long wiring, and complex layout. We propose a recursive wireless interconnect structure called the WCube that features a single transmit antenna and multiple receive antennas at each micro wireless router and offers scalable performance in terms of latency and connectivity. We show the feasibility to build miniature on-chip antennas, and simple transmitters and receivers that operate at 100-500 GHz sub-terahertz frequency bands. We also devise new two-tier wormhole based routing algorithms that are deadlock free and ensure a minimum-latency route on a 1000-core on-chip interconnect network. Our simulations show that our protocol suite can reduce the observed latency by 20% to 45%, and consumes power that is comparable to or less than current 2-D wired mesh designs.", "citation": "Citations (190)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Suk-Bok Lee.....http://dblp.org/pers/hd/l/Lee:Suk=Bok", "Sai-Wang Tam.....http://dblp.org/pers/hd/t/Tam:Sai=Wang", "Ioannis Pefkianakis.....http://dblp.org/pers/hd/p/Pefkianakis:Ioannis", "Songwu Lu.....http://dblp.org/pers/hd/l/Lu:Songwu", "M. Frank Chang.....http://dblp.org/pers/hd/c/Chang:M=_Frank", "Chuanxiong Guo.....http://dblp.org/pers/hd/g/Guo:Chuanxiong", "Glenn Reinman.....http://dblp.org/pers/hd/r/Reinman:Glenn", "Chunyi Peng.....http://dblp.org/pers/hd/p/Peng:Chunyi", "Mishali Naik.....http://dblp.org/pers/hd/n/Naik:Mishali", "Lixia Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Lixia", "Jason Cong.....http://dblp.org/pers/hd/c/Cong:Jason"], "conf": "mobicom", "year": "2009", "pages": 12}