{"title": "Data fusion improves the coverage of wireless sensor networks.", "fields": ["scaling", "software deployment", "synthetic data", "sensor fusion", "path loss"], "abstract": "Wireless sensor networks (WSNs) have been increasingly available for critical applications such as security surveillance and environmental monitoring. An important performance measure of such applications is sensing coverage that characterizes how well a sensing field is monitored by a network. Although advanced collaborative signal processing algorithms have been adopted by many existing WSNs, most previous analytical studies on sensing coverage are conducted based on overly simplistic sensing models (e.g., the disc model) that do not capture the stochastic nature of sensing. In this paper, we attempt to bridge this gap by exploring the fundamental limits of coverage based on stochastic data fusion models that fuse noisy measurements of multiple sensors. We derive the scaling laws between coverage, network density, and signal-to-noise ratio (SNR). We show that data fusion can significantly improve sensing coverage by exploiting the collaboration among sensors. In particular, for signal path loss exponent of k (typically between 2.0 and 5.0), rho_f=O(rho_d^(1-1/k)), where rho_f and rho_d are the densities of uniformly deployed sensors that achieve full coverage under the fusion and disc models, respectively. Our results help understand the limitations of the previous analytical results based on the disc model and provide key insights into the design of WSNs that adopt data fusion algorithms. Our analyses are verified through extensive simulations based on both synthetic data sets and data traces collected in a real deployment for vehicle detection.", "citation": "Citations (152)", "departments": ["Michigan State University", "City University of Hong Kong", "University of Massachusetts Lowell", "City University of Hong Kong", "City University of Hong Kong"], "authors": ["Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Rui Tan.....http://dblp.org/pers/hd/t/Tan:Rui", "Benyuan Liu.....http://dblp.org/pers/hd/l/Liu:Benyuan", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Xiaohua Jia.....http://dblp.org/pers/hd/j/Jia:Xiaohua", "Chih-Wei Yi.....http://dblp.org/pers/hd/y/Yi:Chih=Wei"], "conf": "mobicom", "year": "2009", "pages": 12}