{"title": "Extreme visualisation of query optimizer search space.", "fields": ["query by example", "query optimization", "sql", "sargable", "tracing"], "abstract": "This demonstration showcases a system for visualizing and analyzing search spaces generated by the SQL Anywhere optimizer during the optimization process of a SQL statement. SQL Anywhere dynamically optimizes each statement every time it is executed. The decisions made by the optimizer during the optimization process are both cost-based and heuristics adapted to the current state of the server and the database instance. Many performance issues can be understood and resolved by analyzing the search space generated when optimizing a certain request. In our experience, there are two main classes of performance issues related to the decisions made by a query optimizer:(1) a request is very slow due to a suboptimal access plan; and (2) a request has a different, less optimal access plan than a previous execution. We have enhanced SQL Anywhere to log, in a very compact format, its search space during the optimization process when tracing mode is on. These search space logs can be used for performance analysis in the absence of the database instances or of extra information about the SQL Anywhere server state at the time the logs were generated. This demonstration introduces the SearchSpaceAnalyzer System, a research prototype used to analyze the search spaces of the SQL Anywhere optimizer. The system visualizes and analyzes (1) a single search space and (2) the differences between two search spaces generated for the same query by two different optimization processes. The SearchSpaceAnalyze System can be used for the analysis of any query optimizer search spaces as long as the logged data is recorded using the syntax understood by the system.", "citation": "Citations (6)", "year": "2009", "departments": ["Sybase", "University of Waterloo", "University of Waterloo"], "conf": "sigmod", "authors": ["Anisoara Nica.....http://dblp.org/pers/hd/n/Nica:Anisoara", "Daniel Scott Brotherston.....http://dblp.org/pers/hd/b/Brotherston:Daniel_Scott", "David William Hillis.....http://dblp.org/pers/hd/h/Hillis:David_William"], "pages": 4}