{"title": "Location Cloaking for Safety Protection of Ad Hoc Networks.", "fields": ["mobile ad hoc network", "cloaking", "wireless ad hoc network", "adversary", "scalability"], "abstract": "Location information is crucial to design efficient and scalable ad hoc networks, yet the exposure of such in- formation presents them significant safety threats. This paper investigates the problem of preventing an adversary from locating (and thus destroying) nodes based on their location information revealed explicitly in communications. Our idea is to reduce location resolution to achieve a desired level of safety protection. We define the safety level of a geographic region to be the ratio of its area and the number of nodes inside it. The higher safety level a region has, the less attractive for an adversary to search over it for the nodes. Thus, when a node has to disclose its location, it can compute a cloaking box that meets a desired level of safety requirement and report that as its current location information. Although the basic idea is simple, there are several challenges to implement it. First, each cloaking box must be as small as possible in order to minimize the impact of reduced location resolution on the efficiency of network operating and applications. Second, nodes must be able to compute their cloaking boxes without having to reveal their accurate position. Finally, given a sequence of cloaking boxes, they must not be correlated to refine an area whose safety level is less than the required. This paper addresses these challenges with cost-effective solutions in the context of both stationary and mobile ad hoc networks. Our extensive performance evaluation indicates that our proposed technique is efficient in node safety protection, and does not have a significant impact on the performance of networks and applications. Index Terms—Location safety, Location cloaking, Ad hoc networks.", "citation": "Citations (18)", "departments": ["Iowa State University", "Iowa State University"], "authors": ["Toby Xu.....http://dblp.org/pers/hd/x/Xu:Toby", "Ying Cai.....http://dblp.org/pers/hd/c/Cai:Ying"], "conf": "infocom", "year": "2009", "pages": 9}