{"title": "Cinetique.", "fields": ["art", "physical chemistry", "nitrite", "mathematical physics", "entropy", "pivalamide", "propanamide", "phenothiazine", "partial differential equation", "medicine", "order of reaction", "pi", "molar absorptivity", "calculus", "convection diffusion equation", "least squares", "solvent", "molecular biology", "performance art", "philosophy", "mathematical analysis", "kinetic energy", "standard enthalpy of reaction", "organic chemistry", "cauchy problem", "immunology", "inorganic chemistry", "kinesitherapy", "physics"], "abstract": "Dans cette these, nous avons etudie trois sujets differents: gaz sur reseaux unidimensionnels, la theorie cinetique en reseaux et un modele de l'equation de boltzmann discrete. A l'aide des modeles de gaz sur reseaux, nous nous sommes interesses a la divergence de la viscosite en dimension un pour la methode du groupe de renormalisation et au probleme des ondes de choc et de detente (le chapitre ii). Le chapitre iii est consacre a la theorie cinetique sur reseaux en vue de surmonter des difficultes des gaz sur reseaux. Cette theorie est une combinaison de la theorie cinetique discrete avec celle des gaz sur reseaux. L'algorithmgase de cette theorie est stable, precis, rapide et simple en simulant l'equation de navier-stokes. On peut aussi facilement incorporer de divers effets physiques en utilisant cette theorie: diffusion, mhd bidimensionnelle forces de volumes etc. . . Nous pouvons eventuellement simuler des ecoulements a des grands nombres de reynolds car la viscosite peut etre tres faible. Il se trouve aussi dans cette these une etude detaillee sur un modele de 4 vitesses de boltzmann discretisee unidimensionnel satisfaisant a toutes les lois de conservation. Des solutions exactes sont obtenues: solutions de similarite, de choc, periodique en espace se propageant ou non. Il nous permet de definir une temperature non triviale. L'effet d'une basse de la temperature est observe a travers un choc sous certaines conditions initiales", "citation": "Citations (3)", "departments": ["Université catholique de Louvain", "Université catholique de Louvain", "Université libre de Bruxelles", "Université libre de Bruxelles", "Université libre de Bruxelles", "Faculté polytechnique de Mons", "Faculté polytechnique de Mons", "Faculté polytechnique de Mons", "Nancy-Université", "Nancy-Université", "Nancy-Université", "Nancy-Université", "Nancy-Université"], "authors": ["Maxime Causeret.....http://dblp.org/pers/hd/c/Causeret:Maxime"], "conf": "siggraph", "year": "2009", "pages": 1}