{"title": "Enabling Content Dissemination Using Efficient and Scalable Multicast.", "fields": ["distance vector multicast routing protocol", "xcast", "inter domain", "ip multicast", "pragmatic general multicast"], "abstract": "Multicast is an approach that uses network and server resources efficiently to distribute information to groups. As networks evolve to become information-centric, users will increasingly demand publish-subscribe based access to fine-grained information, and multicast will need to evolve to (i) manage an increasing number of groups, with a distinct group for each piece of distributable content; (ii) support persistent group membership, as group activity can vary over time, with intense activity at some times, and infrequent (but still critical) activity at others. These requirements raise scalability challenges that are not met by today's multicast techniques. In this paper, we propose the MAD (multicast with adaptive dual-state) architecture to provide efficient multicast service at massive scale. MAD can scalably support a vast number of multicast groups, with varying activity over time, based on two key novel ideas: (i) decouple group membership from forwarding information, and (ii) apply an adaptive dual-state approach to optimize for the different objectives of active and inactive groups. We focus on the scalability characteristics of MAD and demonstrate through analysis, simulation and implementation that the architecture achieves high performance and efficiency.", "citation": "Citations (18)", "departments": ["University of Texas at Austin", "Case Western Reserve University", "AT&T", "AT&T", "University of Texas at Austin"], "authors": ["Tae Won Cho.....http://dblp.org/pers/hd/c/Cho:Tae_Won", "Michael Rabinovich.....http://dblp.org/pers/hd/r/Rabinovich:Michael", "K. K. Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:K=_K=", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh", "Yin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Yin"], "conf": "infocom", "year": "2009", "pages": 9}