{"title": "Duty-Cycle-Aware Broadcast in Wireless Sensor Networks.", "fields": ["atomic broadcast", "terminating reliable broadcast", "key distribution in wireless sensor networks", "multimedia broadcast multicast service", "broadcast radiation"], "abstract": "Broadcast is one of the most fundamental services in wireless sensor networks (WSNs). It facilitates sensor nodes to propagate messages across the whole network, serving a wide range of higher-level operations and thus being critical to the overall network design. A distinct feature of WSNs is that many nodes alternate between active and dormant states, so as to conserve energy and extend the network lifetime. Unfortunately, the impact of such cycles has been largely ignored in existing broadcast implementations that adopt the common assumption of all nodes being active all over the time. In this paper, we revisit the broadcast problem with active/dormant cycles. We show strong evidence that conventional broadcast approaches will suffer from severe performance degradation, and, under low duty-cycles, they could easily fail to cover the whole network in an acceptable timeframe. To this end, we remodel the broadcast problem in this new context, seeking a balance between efficiency and latency with coverage guarantees. We demonstrate that this problem can be translated into a graph equivalence, and develop a centralized optimal solution. It provides a valuable benchmark for assessing diverse duty-cycle-aware broadcast strategies. We then extend it to an efficient and scalable distributed implementation, which relies on local information and operations only, with built-in loss compensation mechanisms. The performance of our solution is evaluated under diverse network configurations. The results suggest that our distributed solution is close to the lower bounds of both time and forwarding costs, and it well resists to the network size and wireless loss increases. In addition, it enables flexible control toward the quality of broadcast coverage.", "citation": "Citations (131)", "departments": ["Simon Fraser University", "Simon Fraser University"], "authors": ["Feng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Feng", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan"], "conf": "infocom", "year": "2009", "pages": 9}