{"title": "Techniques for bandwidth-efficient prefetching of linked data structures in hybrid prefetching systems.", "fields": ["spectral efficiency", "instruction prefetch", "memory bandwidth", "linked data structure", "bandwidth throttling"], "abstract": "Linked data structure (LDS) accesses are critical to the performance of many large scale applications. Techniques have been proposed to prefetch such accesses. Unfortunately, many LDS prefetching techniques 1) generate a large number of useless prefetches, thereby degrading performance and bandwidth efficiency, 2) require significant hardware or storage cost, or 3) when employed together with stream-based prefetchers, cause significant resource contention in the memory system. As a result, existing processors do not employ LDS prefetchers even though they commonly employ stream-based prefetchers. This paper proposes a low-cost hardware/software cooperative technique that enables bandwidth-efficient prefetching of linked data structures. Our solution has two new components: 1) a compiler-guided prefetch filtering mechanism that informs the hardware about which pointer addresses to prefetch, 2) a coordinated prefetcher throttling mechanism that uses run-time feedback to manage the interference between multiple prefetchers (LDS and stream-based) in a hybrid prefetching system. Evaluations show that the proposed solution improves average performance by 22.5% while decreasing memory bandwidth consumption by 25% over a baseline system that employs an effective stream prefetcher on a set of memory- and pointer-intensive applications. We compare our proposal to three different LDS/correlation prefetching techniques and find that it provides significantly better performance on both single-core and multi-core systems, while requiring less hardware cost.", "citation": "Citations (111)", "departments": ["University of Texas at Austin", "Carnegie Mellon University", "University of Texas at Austin"], "authors": ["Eiman Ebrahimi.....http://dblp.org/pers/hd/e/Ebrahimi:Eiman", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur", "Yale N. Patt.....http://dblp.org/pers/hd/p/Patt:Yale_N="], "conf": "hpca", "year": "2009", "pages": 11}