{"title": "Multirate Anypath Routing in Wireless Mesh Networks.", "fields": ["dsrflow", "hazy sighted link state routing protocol", "destination sequenced distance vector routing", "geographic routing", "equal cost multi path routing"], "abstract": "In this paper, we present a new routing paradigm that generalizes opportunistic routing in wireless mesh networks. In multirate anypath routing, each node uses both a set of next hops and a selected transmission rate to reach a destination. Using this rate, a packet is broadcast to the nodes in the set and one of them forwards the packet on to the destination. To date, there is no theory capable of jointly optimizing both the set of next hops and the transmission rate used by each node. We bridge this gap by introducing a polynomial-time algorithm to this problem and provide the proof of its optimality. The proposed algorithm runs in the same running time as regular shortest-path algorithms and is therefore suitable for deployment in link-state routing protocols. We conducted experiments in a 802.11b testbed network, and our results show that multirate anypath routing performs on average 80% and up to 6.4 times better than anypath routing with a fixed rate of 11 Mbps. If the rate is fixed at 1 Mbps instead, performance improves by up to one order of magnitude. I. INTRODUCTION The high loss rate and dynamic quality of links make routing in wireless mesh networks extremely challenging (1). Anypath routing 1 has been recently proposed as a way to circumvent these shortcomings by using multiple next hops for each destination (3)-(6). Each packet is broadcast to a forwarding set composed of several neighbors, and the packet must be retransmitted only if none of the neighbors in the set receive it. Therefore, while the link to a given neighbor is down or performing poorly, another nearby neighbor may receive the packet and forward it on. This is in contrast to single-path routing where only one neighbor is assigned as the next hop for each destination. In this case, if the link to this neighbor is not performing well, a packet may be lost even though other neighbors may have overheard it. Existing work on anypath routing has focused on wireless networks that use a single transmission rate. This approach, albeit straightforward, presents two major drawbacks. First, using a single rate over the entire network underutilizes available bandwidth resources. Some links may perform well at a higher rate, while others may only work at a lower rate. Secondly and most importantly, the network may become disconnected at a higher bit rate. We provide experimental measurements from a 802.11b testbed which show that this phenomenon is not uncommon in practice. The key problem is that higher transmission rates have a shorter radio range, which reduces network density and connectivity. As the bit rate in- creases, links becomes lossier and the network eventually gets disconnected. Therefore, in order to guarantee connectivity, single-rate anypath routing must be limited to low rates. In multirate anypath routing, these problems do not exist; however, we face different challenges. First, we must find 1 We use the term anypath rather than opportunistic routing, since oppor- tunistic routing is an overloaded term also used for opportunistic contacts (2).", "citation": "Citations (136)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Rafael P. Laufer.....http://dblp.org/pers/hd/l/Laufer:Rafael_P=", "Henri Dubois-Ferrière.....http://dblp.org/pers/hd/d/Dubois=Ferri=egrave=re:Henri", "Leonard Kleinrock.....http://dblp.org/pers/hd/k/Kleinrock:Leonard"], "conf": "infocom", "year": "2009", "pages": 9}