{"title": "AURA: Enabling Attribute-Based Spatial Search in RFID Rich Environments.", "fields": ["distributed data store", "erasure", "short term memory", "aura", "dissemination"], "abstract": "In this paper, we introduce AURA, a novel framework for enriching the physical environment with information about objects and activities in order to support searches in the physical world. The goal is to enable individuals to use the environment in which they function as a living (short-term) memory of their activities and of the objects with which they interact in this environment. In order to act as a memory, the physical environment must be transparently embedded with relevant information and made accessible by in-situ search mechanisms. We achieve this embedding through innovative algorithms that leverage a collection of parasitic RFID tags distributed in the environment to act as a distributed storage cloud. Information about the activities of the users and objects with which they interact are encoded and stored, in a decentralized way, on these RFID tags to support attribute-based search. A novel auraProp algorithm disseminates information in the environment and a complementary auraSearch algorithm implements spatial searches for physical objects in the environment. Parasitic RFID tags are not self-powered and thus cannot communicate among each other. AURA leverages human movement in the environment to propagate information: as they move in the environment, users not only leave traces (or auras) of their own activities, but also help further disseminate auras of prior activities in the same space. AURA relies on a novel signature based information dissemination mechanism and a randomized information erasure scheme to ensure that the extremely limited storage spaces available on the RFID tags are used effectively. The erasure scheme also helps create an information gradient in the physical environment, which the auraSearch algorithm uses to direct the user towards the object of interest.", "citation": "Citations (1)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Tejas A. Bapat.....http://dblp.org/pers/hd/b/Bapat:Tejas_A=", "K. Selçuk Candan.....http://dblp.org/pers/hd/c/Candan:K=_Sel=ccedil=uk", "Venkata Snehith Cherukuri.....http://dblp.org/pers/hd/c/Cherukuri:Venkata_Snehith", "Hari Sundaram.....http://dblp.org/pers/hd/s/Sundaram:Hari"], "conf": "icde", "year": "2009", "pages": 4}