{"title": "\"Not All At Once!\" - A Generic Scheme for Estimating the Number of Affected Nodes While Avoiding Feedback Implosion.", "fields": ["estimation theory", "default gateway", "small number", "access network", "wireless network"], "abstract": "We present a generic scheme for estimating the size of a group of nodes affected by the same event in a large- scale network, such as a grid, a sensor network or a wireless broadband access network, while receiving only a small number of feedback messages from this group. Using the proposed scheme, a centralized gateway analyzes the transmission times of these feedback messages, defines a likelihood function for them, and then uses the Newton-Raphson method to find the number of affected nodes for which this function is maximized. We present complete mathematical analysis for the precision of the proposed algorithm and provide tight upper and lower bounds for the estimation error. These bounds allow us to improve the precision of our estimation, and to bring the error very close to 0. Index Terms—feedback implosion, management of big clusters, group size estimation I. INTRODUCTION In this paper we address a problem that arises in many modern networks, such as Grid networks, satellite networks, sensor networks and broadband access wireless networks. Such networks consist of thousands of end devices (nodes) that are controlled or managed by a single centralized gate- way. From time to time the end nodes must send feedback messages to the gateway concerning local events about which the gateway has to be aware. While some events are only detected by a single node or a few nodes, some important events are likely to affect many nodes. The scheme proposed in this paper is useful when it is crucial that the gateway not only be informed about such events but also have a rough estimation of the number of affected nodes, without having each node send a message to the gateway. The proposed scheme is called NATO! (Not All aT Once!), The main idea is that after the event takes place, every affected node waits a random amount of time before sending a feedback RPRT (report) message. When the gateway receives enough RPRTs to estimate the number of affected nodes with good precision, it broadcasts a STOP message, telling the nodes that have not reported yet not to send their RPRTs. The most important part of this paper is the development of a statistical analysis algorithm, to be employed by the gateway, for estimating the number of affected nodes. The estimation is based on the times at which the RPRTs are sent. This algorithm defines the likelihood function for the received RPRTs, and then uses the Newton-Raphson method to find the number of nodes for which this function is maximized. Using mathematical analysis, we provide tight upper and lower bounds on the estimation error. We show that this error is approximately 1/(N − 1), where N is the number of sent RPRTs, and it is always positive. We use this property to bring the estimation error very close to 0. The rest of this paper is organized as follows. In Section II we present more detailed application scenarios along with related work. In Section III we present the estimation algo- rithm, which is the core of the proposed NATO! scheme. In Section IV we analyze the precision of this algorithm and find tight upper and lower bounds for the error. This analysis allows the error introduced by our estimation to be reduced and brought very close to 0 even if N is very small compared to r. In Section V we conclude the paper.", "citation": "Citations (8)", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Reuven Cohen.....http://dblp.org/pers/hd/c/Cohen:Reuven", "Alexander Landau.....http://dblp.org/pers/hd/l/Landau:Alexander"], "conf": "infocom", "year": "2009", "pages": 5}