{"title": "CASE: Connectivity-Based Skeleton Extraction in Wireless Sensor Networks.", "fields": ["graph", "motion planning", "graph theory", "skeleton", "topological skeleton"], "abstract": "Many sensor network applications are tightly cou- pled with the geometric environment where the sensor nodes are deployed. The topological skeleton extraction has shown great impact on the performance of such services as location, routing, and path planning in sensor networks. Nonetheless, current studies focus on using skeleton extraction for various applications in sensor networks. How to achieve a better skeleton extraction has not been thoroughly investigated. There are studies on skeleton extraction from the computer vision community; their centralized algorithms for continuous space, however, is not immediately applicable for the discrete and distributed sensor networks. In this paper we present CASE: a novel Connectivity-bAsed Skeleton Extraction algorithm to compute skeleton graph that is robust to noise, and accurate in preservation of the original topology. In addition, no central- ized operation is required. The skeleton graph is extracted by partitioning the boundary of the sensor network to identify the skeleton points, then generating the skeleton arcs, connecting these arcs, and finally refining the coarse skeleton graph. Our evaluation shows that CASE is able to extract a well-connected skeleton graph in the presence of significant noise and shape variations, and outperforms state-of-the-art algorithms.", "citation": "Citations (21)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Hong Kong Polytechnic University", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Hongbo Jiang.....http://dblp.org/pers/hd/j/Jiang:Hongbo", "Wenping Liu.....http://dblp.org/pers/hd/l/Liu_0001:Wenping", "Dan Wang.....http://dblp.org/pers/hd/w/Wang_0002:Dan", "Chen Tian.....http://dblp.org/pers/hd/t/Tian:Chen", "Xiang Bai.....http://dblp.org/pers/hd/b/Bai:Xiang", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Ying Wu.....http://dblp.org/pers/hd/w/Wu:Ying", "Wenyu Liu.....http://dblp.org/pers/hd/l/Liu:Wenyu"], "conf": "infocom", "year": "2009", "pages": 5}