{"title": "Discriminative Semi-Supervised Feature Selection via Manifold Regularization.", "fields": ["data set", "saddle point", "feature", "minimum redundancy feature selection", "kernel method", "discriminative model", "feature selection", "multiple kernel learning", "small number"], "abstract": "Feature selection has attracted a huge amount of interest in both research and application communities of data mining. We consider the problem of semi-supervised feature selection, where we are given a small amount of labeled examples and a large amount of unlabeled examples. Since a small number of labeled samples are usually insufficient for identifying the relevant features, the critical problem arising from semi-supervised feature selection is how to take advantage of the information underneath the unlabeled data. To address this problem, we propose a novel discriminative semi-supervised feature selection method based on the idea of manifold regularization. The proposed approach selects features through maximizing the classification margin between different classes and simultaneously exploiting the geometry of the probability distribution that generates both labeled and unlabeled data. In comparison with previous semi-supervised feature selection algorithms, our proposed semi-supervised feature selection method is an embedded feature selection method and is able to find more discriminative features. We formulate the proposed feature selection method into a convex-concave optimization problem, where the saddle point corresponds to the optimal solution. To find the optimal solution, the level method, a fairly recent optimization method, is employed. We also present a theoretic proof of the convergence rate for the application of the level method to our problem. Empirical evaluation on several benchmark data sets demonstrates the effectiveness of the proposed semi-supervised feature selection method.", "citation": "Citations (229)", "departments": ["Max Planck Society", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Michigan State University", "The Chinese University of Hong Kong", "Michigan State University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Zenglin Xu.....http://dblp.org/pers/hd/x/Xu:Zenglin", "Rong Jin.....http://dblp.org/pers/hd/j/Jin:Rong", "Michael R. Lyu.....http://dblp.org/pers/hd/l/Lyu:Michael_R=", "Irwin King.....http://dblp.org/pers/hd/k/King:Irwin"], "conf": "ijcai", "year": "2009", "pages": 6}