{"title": "Identifying High Cardinality Internet Hosts.", "fields": ["peer to peer", "cardinality", "internet hosting service", "profiling", "memory management"], "abstract": "The Internet host cardinality, defined as the number of distinct peers that an Internet host communicates with, is an important metric for profiling Internet hosts. Some example applications include behavior based network intrusion detection, p2p hosts identification, and server identification. However, due to the tremendous number of hosts in the Internet and high speed links, tracking the exact cardinality of each host is not feasible due to the limited memory and computation resource. Existing approaches on host cardinality counting have primarily focused on hosts of extremely high cardinalities. These methods do not work well with hosts of moderately large cardinalities that are needed for certain host behavior profiling such as detection of p2p hosts or port scanners. In this paper, we propose an online sampling approach for identifying hosts whose cardinality exceeds some moderate prescribed threshold, e.g. 50, or within specific ranges. The main advantage of our approach is that it can filter out the majority of low cardinality hosts while preserving the hosts of interest, and hence minimize the memory resources wasted by tracking irrelevant hosts. Our approach consists of three components: 1) two-phase filtering for eliminating low cardinality hosts, 2) thresholded bitmap for counting cardinalities, and 3) bias correction. Through both theoretical analysis and experiments using real Internet traces, we demonstrate that our approach requires much less memory than existing approaches do whereas yields more accurate estimates.", "citation": "Citations (54)", "departments": ["Bell Labs", "University of Minnesota", "Bell Labs", "Bell Labs", "Computer Scienc ... and Engineering"], "authors": ["Jing Cao.....http://dblp.org/pers/hd/c/Cao:Jing", "Yu Jin.....http://dblp.org/pers/hd/j/Jin_0001:Yu", "Aiyou Chen.....http://dblp.org/pers/hd/c/Chen:Aiyou", "Tian Bu.....http://dblp.org/pers/hd/b/Bu:Tian", "Zhi-Li Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhi=Li"], "conf": "infocom", "year": "2009", "pages": 9}