{"title": "Efficient Mining of Closed Repetitive Gapped Subsequences from a Sequence Database.", "fields": ["result set", "subsequence", "algorithm design", "sequential pattern mining", "sequence database"], "abstract": "There is a huge wealth of sequence data available, for example, customer purchase histories, program execution traces, DNA, and protein sequences. Analyzing this wealth of data to mine important knowledge is certainly a worthwhile goal.In this paper, as a step forward to analyzing patterns in sequences, we introduce the problem of mining closed repetitive gapped subsequences and propose efficient solutions. Given a database of sequences where each sequence is an ordered list of events, the pattern we would like to mine is called repetitive gapped subsequence, which is a subsequence (possibly with gaps between two successive events within it) of some sequences in the database. We introduce the concept of repetitive support to measure how frequently a pattern repeats in the database. Different from the sequential pattern mining problem, repetitive support captures not only repetitions of a pattern in different sequences but also the repetitions within a sequence. Given a userspecified support threshold min_sup, we study finding the set of all patterns with repetitive support no less than min_sup. To obtain a compact yet complete result set and improve the efficiency, we also study finding closed patterns. Efficient mining algorithms to find the complete set of desired patterns are proposed based on the idea of instance growth. Our performance study on various datasets shows the efficiency of our approach. A case study is also performed to show the utility of our approach.", "citation": "Citations (117)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "National University of Singapore", "Sch. of Inf. Sy ... niv., Singapore"], "authors": ["Bolin Ding.....http://dblp.org/pers/hd/d/Ding:Bolin", "David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Siau-Cheng Khoo.....http://dblp.org/pers/hd/k/Khoo:Siau=Cheng"], "conf": "icde", "year": "2009", "pages": 12}