{"title": "Load Balancing in Wireless Sensor Networks using Kirchhoff's Voltage Law.", "fields": ["network packet", "kirchhoff s circuit laws", "load balancing", "key distribution in wireless sensor networks", "network congestion"], "abstract": "We study load balancing in wireless networks with a single class of traffic, focusing our attention on an important example, i.e., Wireless Sensor Networks. The analysis is based on the Wireless Minimum Cost Problem, an optimization problem that implicitly captures the effects of interference through the novel use of an arc cost function that depends on the amount of traffic flowing through nearby links. We present an algorithm that optimizes the flow by modifying the traffic along cycles constructed during an initialization phase. Its operation may be viewed as trying to satisfy Kirchhoff's Voltage Law on an electric circuit containing interferistors. It is robust, distributed, with minimal communication overhead, and converges quickly. Furthermore, when the traffic is elastic, the algorithm can be easily modified to also perform congestion control. Index Terms—Congestion Control, Kirchhoff's Voltage Law, Load Balancing, Network Optimization, Network Utility Maxi- mization, Single Commodity, Wireless Sensor Networks. I. INTRODUCTION We study wireless multihop networks, i.e., networks of nodes communicating with each other exclusively over a shared wireless medium, with data typically being relayed over multiple hops. Some of the nodes (the sources) are creating data traffic that must be delivered to some other nodes (the sinks). All data belong to a single class, in the sense that each created packet can be delivered to any of the sinks. As is common in network optimization, we approximate traffic as a continuous data flow. Each wireless link is as- sociated with a cost (which could correspond to the energy dissipated, the delay incurred, etc.) that depends on the flow on this and nearby links, due to the interference exhibited by the wireless channel. The problem is to find the overall traffic flow that minimizes the total cost over all links subject to all data being delivered to the sinks. Our work is especially useful in the context of wireless sensor networks, which are characterized by a large number of nodes, limited node computing and communicating capa- bilities, and small packet sizes; these aspects were taken into account in the design of the model and algorithm we propose. In Section II we present related research. In Section III we present our network model, motivated by the limitations of previous works and the particular application in mind. In Sec- tion IV we develop necessary and sufficient conditions for a flow to be optimal, for two very broad classes of cost functions. The conditions can be interpreted as Kirchhoff's Voltage Law in a properly defined electric circuit with interferistors. Based on these conditions, we develop in Section V an algorithm for performing load balancing which modifies suboptimal flows by inserting corrective flows around loops. We conclude in Section VI.", "citation": "Citations (16)", "departments": ["University of Cyprus"], "authors": ["Stavros Toumpis.....http://dblp.org/pers/hd/t/Toumpis:Stavros", "Savvas Gitzenis.....http://dblp.org/pers/hd/g/Gitzenis:Savvas"], "conf": "infocom", "year": "2009", "pages": 9}