{"title": "Resettably Secure Computation.", "fields": ["secure multi party computation", "adversary", "pseudorandom function family", "zero knowledge proof", "commitment scheme"], "abstract": "The notion of resettable zero-knowledge (rZK) was introduced by Canetti, Goldreich, Goldwasser and Micali (FOCS'01) as a strengthening of the classical notion of zero-knowledge. A rZK protocol remains zero-knowledge even if the verifier can reset the prover back to its initial state anytime during the protocol execution and force it to use the same random tape again and again. Following this work, various extensions of this notion were considered for the zero-knowledge and witness indistinguishability functionalities.\n\nIn this paper, we initiate the study of resettability for more general functionalities. We first consider the setting of resettable two-party computation where a party (called the user) can reset the other party (called the smartcard) anytime during the protocol execution. After being reset, the smartcard comes back to its original state and thus the user has the opportunity to start interacting with it again (knowing that the smartcard will use the same set of random coins). In this setting, we show that it is possible to secure realize  all PPT computable functionalities  under the most natural (simulation based) definition. Thus our results show that in cryptographic protocols, the reliance on randomness and the ability to keep state can be made significantly weaker. Our simulator for the aforementioned resettable two-party computation protocol (inherently) makes use of non-black box techniques. Second, we provide a construction of  simultaneous  resettable multi-party computation with an honest majority (where the adversary not only controls a minority of parties but is also allowed to reset any number of parties at any point). Interestingly, all our results are in the plain model.", "citation": "Citations (54)", "year": "2009", "departments": ["University of California, Los Angeles", "University of California, Los Angeles"], "conf": "eurocrypt", "authors": ["Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Amit Sahai.....http://dblp.org/pers/hd/s/Sahai:Amit"], "pages": 18}