{"title": "Atomic quake: using transactional memory in an interactive multiplayer game server.", "fields": ["multi core processor", "system call", "transactional memory", "shared memory", "transaction processing"], "abstract": "Transactional Memory (TM) is being studied widely as a new technique for synchronizing concurrent accesses to shared memory data structures for use in multi-core systems. Much of the initial work on TM has been evaluated using microbenchmarks and application kernels; it is not clear whether conclusions drawn from these workloads will apply to larger systems. In this work we make the first attempt to develop a large, complex, application that uses TM for all of its synchronization. We describe how we have taken an existing parallel implementation of the Quake game server and restructured it to use transactions. In doing so we have encountered examples where transactions simplify the structure of the program. We have also encountered cases where using transactions occludes the structure of the existing code. Compared with existing TM benchmarks, our workload exhibits non-block-structured transactions within which there are I/Ooperations and system call invocations. There are long and short running transactions (200-1.3M cycles) with small and large read and write sets (a few bytes to 1.5MB). There are nested transactions reaching up to 9 levels at runtime. There are examples where error handling and recovery occurs inside transactions. There are also examples where data changes between being accessed transactionally and accessed non-transactionally. However, we did not see examples where the kind of access to one piece of data depended on the value of another.", "citation": "Citations (92)", "year": "2009", "departments": ["Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center"], "conf": "ppopp", "authors": ["Ferad Zyulkyarov.....http://dblp.org/pers/hd/z/Zyulkyarov:Ferad", "Vladimir Gajinov.....http://dblp.org/pers/hd/g/Gajinov:Vladimir", "Osman S. Unsal.....http://dblp.org/pers/hd/u/Unsal:Osman_S=", "Adrián Cristal.....http://dblp.org/pers/hd/c/Cristal:Adri=aacute=n", "Eduard Ayguadé.....http://dblp.org/pers/hd/a/Ayguad=eacute=:Eduard", "Tim Harris.....http://dblp.org/pers/hd/h/Harris_0001:Tim", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "pages": 10}