{"title": "Dual System Encryption: Realizing Fully Secure IBE and HIBE under Simple Assumptions.", "fields": ["functional encryption", "56 bit encryption", "ciphertext indistinguishability", "plaintext aware encryption", "attribute based encryption", "computer science", "encryption", "theoretical computer science"], "abstract": "We present a new methodology for proving security of encryption systems using what we call Dual System Encryption. Our techniques result in fully secure Identity-Based Encryption (IBE) and Hierarchical Identity-Based Encryption (HIBE) systems under the simple and established decisional Bilinear Diffie-Hellman and decisional Linear assumptions. Our IBE system has ciphertexts, private keys, and public parameters each consisting of a constant number of group elements. These results are the first HIBE system and the first IBE system with short parameters under simple assumptions.\n\nIn a Dual System Encryption system both ciphertexts and private keys can take on one of two indistinguishable forms. A private key or ciphertext will be normal if they are generated respectively from the system's key generation or encryption algorithm. These keys and ciphertexts will behave as one expects in an IBE system. In addition, we define semi-functional keys and ciphertexts. A semi-functional private key will be able to decrypt all normally generated ciphertexts; however, decryption will fail if one attempts to decrypt a semi-functional ciphertext with a semi-functional private key. Analogously, semi-functional ciphertexts will be decryptable only by normal private keys.\n\nDual System Encryption opens up a new way to prove security of IBE and related encryption systems. We define a sequence of games where we change first the challenge ciphertext and then the private keys one by one to be semi-functional. We finally end up in a game where the challenge ciphertext and all private keys are semi-functional at which point proving security is straightforward.", "citation": "Not cited", "departments": ["University of Texas at Austin"], "authors": ["Brent Waters.....http://dblp.org/pers/hd/w/Waters:Brent"], "conf": "crypto", "year": "2009", "pages": 18}