{"title": "Automatic steering of behavioral model inference.", "fields": ["behavioral modeling", "verification and validation", "compromise", "software system", "spurious relationship"], "abstract": "Many testing and analysis techniques use finite state models to validate and verify the quality of software systems. Since the specification of such models is complex and time-consuming, researchers defined several techniques to extract finite state models from code and traces. Automatically generating models requires much less effort than designing them, and thus eases the verification and validation of large software systems. However, when models are inferred automatically, the precision of the mining process is critical. Behavioral models mined with imprecise processes can include many spurious behaviors, and can thus compromise the results of testing and analysis techniques that use those models.   In this paper, we increase the precision of automata inferred from execution traces, by leveraging two learning techniques. We first mine execution traces to infer statistically significant temporal properties that capture relations between non consecutive and possibly distant events. We then incrementally refine a simple initial automaton by merging likely equivalent states. We identify equivalent states by analyzing set of consecutive events, and we use the inferred temporal properties to evaluate whether two equivalent states can be merged or not. We merge equivalent states only if the merging does violate any temporal property, since a merging that violates temporal properties is likely to introduce an imprecise generalization. Our generalization process that preserves temporal properties while merging states avoids breaking non-local relations, and thus solves one of the major cause of overgeneralized models. Thus, mined properties  steer  the learning of behavioral models. The technique is completely automated and generates an automaton that both accepts the input traces and satisfies the mined temporal properties.   We evaluated our solution by comparing models inferred with and without checking mined temporal properties. Results show that our steering process can significantly improve precision without noticeable loss of recall.", "citation": "Citations (97)", "departments": ["Singapore Management University", "University of Milano-Bicocca", "University of Milano-Bicocca"], "authors": ["David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David", "Leonardo Mariani.....http://dblp.org/pers/hd/m/Mariani:Leonardo", "Mauro Pezzè.....http://dblp.org/pers/hd/p/Pezz=egrave=:Mauro"], "conf": "sigsoft", "year": "2009", "pages": 10}