{"title": "On Fast Optimal STDMA Scheduling over Fading Wireless Channels.", "fields": ["job shop scheduling", "channel state information", "time division multiple access", "fading", "schedule"], "abstract": "Most prior studies on wireless spatial-reuse TDMA (STDMA) link scheduling for throughput optimization deal with the situation where instantaneous channel state information (CSI) is available. Under fast fading, however, the channel may change too quickly for the scheduler to track the instantaneous CSI. In this paper, instead of the instantaneous CSI, the scheduler performs its task according to the stochastic behavior of the channel state. A basic schedule consists of a set of simultaneously transmitting links. The essence of the scheduling problem is to determine a mixed schedule consisting of a weighted sum (TDMA mixture) of a number of basic schedules to optimize a certain utility objective. A key to reducing scheduling complexity is to identify the Pareto-efficient basic schedules, referred to as the extreme-point schedules, so that the construction of the optimal mixed schedule can be based on the extreme-point schedules rather than all the basic schedules. The precise identification of the extreme-point schedules, however, is intractable computation- ally. We show in this paper that identifying a slightly larger super- set of the extreme-point schedules can be highly efficient using a Perron-Frobenius condition: simulation experiments indicate that oftentimes there are only very few extraneous non-extreme-point schedules in the superset. Building on the effective identification method, we propose a fast scheduling algorithm. This algorithm beats the algorithm without using the identification method by a complexity-reduction factor of 166 in a 15-link network. In addition, numerical results suggest that our algorithm is robust to variations of system parameters. Index Terms—STDMA scheduling; Perron-Frobenius Theorem", "citation": "Citations (5)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["JiaLiang Zhang.....http://dblp.org/pers/hd/z/Zhang:JiaLiang", "Soung Chang Liew.....http://dblp.org/pers/hd/l/Liew:Soung_Chang", "Liqun Fu.....http://dblp.org/pers/hd/f/Fu:Liqun"], "conf": "infocom", "year": "2009", "pages": 9}