{"title": "A Systematic Approach to System State Restoration during Storage Controller Micro-Recovery.", "fields": ["lock", "execution model", "downtime", "thread", "legacy code"], "abstract": "Micro-recovery, or failure recovery at a fine granularity, is a promising approach to improve the recovery time of software for modern storage systems. Instead of stalling the whole system during failure recovery, micro-recovery can facilitate recovery by a single thread while the system continues to run. A key challenge in performing micro-recovery is to be able to perform efficient and effective state restoration while accounting for dynamic dependencies between multiple threads in a highly concurrent environment. We present Log(Lock), a practical and flexible architecture for performing state restoration without re-architecting legacy code. We formally model thread dependencies based on accesses to both shared state and resources. The Log(Lock) execution model tracks dependencies at runtime and captures the failure context through the restoration level. We develop restoration protocols based on recovery points and restoration levels that identify when micro-recovery is possible and the recovery actions that need to be performed for a given failure context. We have implemented Log(Lock) in a real enterprise storage controller. Our experimental evaluation shows that Log(Lock)-enabled micro-recovery is efficient. It imposes < 10% overhead on normal performance and < 35% overhead during actual recovery. However, the 35% performance overhead observed during recovery lasts only six seconds and replaces the four seconds of downtime that would result from a system restart.", "citation": "Citations (1)", "departments": ["Georgia Institute of Technology", "IBM", "Georgia Institute of Technology"], "authors": ["Sangeetha Seshadri.....http://dblp.org/pers/hd/s/Seshadri:Sangeetha", "Lawrence Chiu.....http://dblp.org/pers/hd/c/Chiu:Lawrence", "Ling Liu.....http://dblp.org/pers/hd/l/Liu:Ling"], "conf": "fast", "year": "2009", "pages": 14}