{"title": "Effective performance measurement and analysis of multithreaded applications.", "fields": ["posix threads", "program analysis", "cilk", "ranging", "thread"], "abstract": "Understanding why the performance of a multithreaded program does not improve linearly with the number of cores in a shared-memory node populated with one or more multicore processors is a problem of growing practical importance. This paper makes three contributions to performance analysis of multithreaded programs. First, we describe how to measure and attribute  parallel idleness , namely, where threads are stalled and unable to work. This technique applies broadly to programming models ranging from explicit threading ( e.g. , Pthreads) to higher-level models such as Cilk and OpenMP. Second, we describe how to measure and attribute  parallel overhead  -- when a thread is performing miscellaneous work other than executing the user's computation. By employing a combination of compiler support and post-mortem analysis, we incur no measurement cost beyond normal profiling to glean this information. Using  idleness  and  overhead  metrics enables one to pinpoint areas of an application where concurrency should be increased (to reduce idleness), decreased (to reduce overhead), or where the present parallelization is hopeless (where idleness and overhead are both high). Third, we describe how to measure and attribute arbitrary performance metrics for high-level multithreaded programming models, such as Cilk. This requires bridging the gap between the expression of logical concurrency in programs and its realization at run-time as it is adaptively partitioned and scheduled onto a pool of threads. We have prototyped these ideas in the context of Rice University's HPCToolkit performance tools. We describe our approach, implementation, and experiences applying this approach to measure and attribute work, idleness, and overhead in executions of Cilk programs.", "citation": "Citations (107)", "year": "2009", "departments": ["Rice University", "Rice University"], "conf": "ppopp", "authors": ["Nathan R. Tallent.....http://dblp.org/pers/hd/t/Tallent:Nathan_R=", "John M. Mellor-Crummey.....http://dblp.org/pers/hd/m/Mellor=Crummey:John_M="], "pages": 12}