{"title": "Business Intelligence from Voice of Customer.", "fields": ["unstructured data", "voice of the customer", "artifact centric business process model", "business activity monitoring", "customer to customer"], "abstract": "In this paper, we present a first of a kind system, called Business Intelligence from Voice of Customer (BIVoC), that can: 1) combine unstructured information and structured information in an information intensive enterprise and 2) derive richer business insights from the combined data. Unstructured information, in this paper, refers to Voice of Customer (VoC) obtained from interaction of customer with enterprise namely, conversation with call-center agents, email, and sms. Structured database reflect only those business variables that are static over (a longer window of) time such as, educational qualification, age group, and employment details. In contrast, a combination of unstructured and structured data provide access to business variables that reflect upto date dynamic requirements of the customers and more importantly indicate trends that are difficult to derive from a larger population of customers through any other means. For example, some of the variables reflected in unstructured data are problem/interest in a certain product, expression of dissatisfaction with the business provided, and some unexplored category of people showing certain interest/problem. This gives the BIVoC system the ability to derive business insights that are richer, more valuable and crucial to the enterprises than the traditional business intelligence systems which utilize onlystructured information. We demostrate the effectiveness of BIVoC system through one of our real-life engagements where the problem is to determine how to improve agent productivity in a call center scenario. We also highlight major challenges faced while dealing with unstructured information such as handling noise and linking with structured data.", "citation": "Citations (24)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["L. Venkata Subramaniam.....http://dblp.org/pers/hd/s/Subramaniam:L=_Venkata", "Tanveer A. Faruquie.....http://dblp.org/pers/hd/f/Faruquie:Tanveer_A=", "Shajith Ikbal.....http://dblp.org/pers/hd/i/Ikbal:Shajith", "Shantanu Godbole.....http://dblp.org/pers/hd/g/Godbole:Shantanu", "Mukesh K. Mohania.....http://dblp.org/pers/hd/m/Mohania:Mukesh_K="], "conf": "icde", "year": "2009", "pages": 12}