{"title": "Distance Oracles for Spatial Networks.", "fields": ["oracle", "as the crow flies", "spatial network", "hash table", "shortest path problem"], "abstract": "The popularity of location-based services and the need to do real-time processing on them has led to an interest in performing queries on transportation networks, such as finding shortest paths and finding nearest neighbors. The challenge is that these operations involve the computation of distance along a spatial network rather than \"as the crow flies.\" In many applications an estimate of the distance is sufficient, which can be achieved by use of an oracle. An approximate distance oracle is proposed for spatial networks that exploits the coherence between the spatial position of vertices and the network distance between them. Using this observation, a distance oracle is introduced that is able to obtain the epsilon-approximate network distance between two vertices of the spatial network. The network distance between every pair of vertices in the spatial network is efficiently represented by adapting the well-separated pair technique to spatial networks. Initially, use is made of an epsilon-approximate distance oracle of size O( n / epsilon^d ) that is capable of retrieving the approximate network distance in O(logn) time using a B-tree. The retrieval time can be theoretically reduced further to O(1) time by proposing another e-approximate distance oracle of size O(n log n / epsilon^d) that uses a hash table. Experimental results indicate that the proposed technique is scalable and can be applied to sufficiently large road networks. A 10%-approximate oracle (epsilon = 0.1) on a large network yielded an average error of 0.9% with 90% of the answers making an error of 2% or less and an average retrieval timeof 68µ seconds. Finally, a strategy for the integration of the distance oracle into any relational database system as well as using it to perform a variety of spatial queries such as region search, k-nearest neighbor search, and spatial joins on spatial networks is discussed.", "citation": "Citations (62)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Jagan Sankaranarayanan.....http://dblp.org/pers/hd/s/Sankaranarayanan:Jagan", "Hanan Samet.....http://dblp.org/pers/hd/s/Samet:Hanan"], "conf": "icde", "year": "2009", "pages": 12}