{"title": "Another Outlier Bites the Dust: Computing Meaningful Aggregates in Sensor Networks.", "fields": ["wireless sensor network", "bandwidth", "outlier", "real time computing", "spurious relationship"], "abstract": "Recent work has demonstrated that readings provided by commodity sensor nodes are often of poor quality. In order to provide a valuable sensory infrastructure for monitoring applications, we first need to devise techniques that can withstand \"dirty\" and unreliable data during query processing. In this paper we present a novel aggregation framework that detects suspicious measurements by outlier nodes and refrains from incorporating such measurements in the computed aggregate values. We consider different definitions of an outlier node, based on the notion of a user-specified minimum support, and discuss techniques for properly routing messages in the networkin order to reduce the bandwidth consumption and the energy drain during the query evaluation. In our experiments using real and synthetic traces we demonstrate that: (i) a straightforward evaluation of a user aggregate query leads to practically meaningless results due to the existence of outliers; (ii) our techniques can detect and eliminate spurious readings without any application specific knowledge of what constitutes normal behavior; (iii) the identification of outliers, when performed inside the network, significantly reduces bandwidth and energy drain compared to alternative methods that centrally collect and analyze all sensory data; and (iv) we can significantly reduce the cost of the aggregation process by utilizing simple statistics on outlier nodes and reorganizing accordingly the collection tree.", "citation": "Citations (25)", "departments": ["National and Kapodistrian University of Athens", "National and Kapodistrian University of Athens", "National and Kapodistrian University of Athens", "National and Kapodistrian University of Athens", "National and Kapodistrian University of Athens"], "authors": ["Antonios Deligiannakis.....http://dblp.org/pers/hd/d/Deligiannakis:Antonios", "Yannis Kotidis.....http://dblp.org/pers/hd/k/Kotidis:Yannis", "Vasilis Vassalos.....http://dblp.org/pers/hd/v/Vassalos:Vasilis", "Vassilis Stoumpos.....http://dblp.org/pers/hd/s/Stoumpos:Vassilis", "Alex Delis.....http://dblp.org/pers/hd/d/Delis:Alex"], "conf": "icde", "year": "2009", "pages": 12}