{"title": "Efficient, portable implementation of asynchronous multi-place programs.", "fields": ["partitioned global address space", "runtime system", "power5", "spmd", "compiler"], "abstract": "The X10 programming language is organized around the notion of places (an encapsulation of data and activities operating on the data), partitioned global address space (PGAS), and asynchronous computation and communication.   This paper introduces an expressive subset of X10, Flat X10, designed to permit efficient execution across multiple single-threaded places with a simple runtime and without compromising on the productivity of X10. We present the design, implementation and evaluation of a compiler and runtime system for Flat X10. The Flat X10 compiler translates programs into C++ SPMD programs communicating using an active messaging infrastructure. It uses novel techniques to transform explicitly parallel programs into SPMD programs. The runtime system is based on IBM's LAPI (Low-level API) and is easily portable to other libraries such as GASNet and ARMCI.   Our implementation realizes performance comparable to hand-written MPI programs for well-known HPC benchmarks such as Random Access, Stream, and FFT, on a Federation-based cluster of Power5 SMPs (with hundreds of processors) and the Blue Gene (with thousands of processors). Submissions based on the work presented in this paper were co-winners of the 2007 and 2008 HPC Challenge Type II Awards.", "citation": "Citations (21)", "year": "2009", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "ppopp", "authors": ["Ganesh Bikshandi.....http://dblp.org/pers/hd/b/Bikshandi:Ganesh", "José G. Castaños.....http://dblp.org/pers/hd/c/Casta=ntilde=os:Jos=eacute=_G=", "Sreedhar B. Kodali.....http://dblp.org/pers/hd/k/Kodali:Sreedhar_B=", "V. Krishna Nandivada.....http://dblp.org/pers/hd/n/Nandivada:V=_Krishna", "Igor Peshansky.....http://dblp.org/pers/hd/p/Peshansky:Igor", "Vijay A. Saraswat.....http://dblp.org/pers/hd/s/Saraswat:Vijay_A=", "Sayantan Sur.....http://dblp.org/pers/hd/s/Sur:Sayantan", "Pradeep Varma.....http://dblp.org/pers/hd/v/Varma:Pradeep", "Tong Wen.....http://dblp.org/pers/hd/w/Wen:Tong"], "pages": 12}