{"title": "ECM on Graphics Cards.", "fields": ["edwards curve", "modular arithmetic", "scalar multiplication", "integer factorization", "computer science", "graphics", "computer hardware", "computer graphics images", "cuda"], "abstract": "This paper reports record-setting performance for the elliptic-curve method of integer factorization: for example, 926.11 curves/second for ECM stage 1 with  B  1 = 8192 for 280-bit integers on a single PC. The state-of-the-art GMP-ECM software handles 124.71 curves/second for ECM stage 1 with  B  1 = 8192 for 280-bit integers using all four cores of a 2.4 GHz Core 2 Quad Q6600.\n\nThe extra speed takes advantage of extra hardware, specifically two NVIDIA GTX 295 graphics cards, using a new ECM implementation introduced in this paper. Our implementation uses Edwards curves, relies on new parallel addition formulas, and is carefully tuned for the highly parallel GPU architecture. On a single GTX 295 the implementation performs 41.88 million modular multiplications per second for a general 280-bit modulus. GMP-ECM, using all four cores of a Q6600, performs 13.03 million modular multiplications per second.\n\nThis paper also reports speeds on other graphics processors: for example, 2414 280-bit elliptic-curve scalar multiplications per second on an older NVIDIA 8800 GTS (G80), again for a general 280-bit modulus. For comparison, the CHES 2008 paper \"Exploiting the Power of GPUs for Asymmetric Cryptography\" reported 1412 elliptic-curve scalar multiplications per second on the same graphics processor despite having fewer bits in the scalar (224 instead of 280), fewer bits in the modulus (224 instead of 280), and a  special  modulus (2224 *** 296 + 1).", "citation": "Citations (77)", "year": "2009", "departments": ["University of Illinois at Chicago", "Academia Sinica", "National Taiwan University", "Eindhoven University of Technology", "Academia Sinica"], "conf": "eurocrypt", "authors": ["Daniel J. Bernstein.....http://dblp.org/pers/hd/b/Bernstein:Daniel_J=", "Tien-Ren Chen.....http://dblp.org/pers/hd/c/Chen:Tien=Ren", "Chen-Mou Cheng.....http://dblp.org/pers/hd/c/Cheng:Chen=Mou", "Tanja Lange.....http://dblp.org/pers/hd/l/Lange_0001:Tanja", "Bo-Yin Yang.....http://dblp.org/pers/hd/y/Yang:Bo=Yin"], "pages": 19}