{"title": "A Localized Multi-Hop Desynchronization Algorithm for Wireless Sensor Networks.", "fields": ["throughput", "correctness", "hop", "hidden node problem", "network topology"], "abstract": "This paper presents a new desynchronization algo- rithm aimed at providing collision-free transmission scheduling for single-hop and acyclic multi-hop wireless sensor networks. The desynchronization approach is resilient to the hidden ter- minal problem and topology changes. Each node distributively converges upon a single collision-free transmission slot, utilizing only minimal neighbor information. In addition, we propose two strategies which facilitate increased convergence time. We evaluate the proposed algorithm via simulations over a range of network densities on both single-hop and acyclic multi- hop networks. Convergence and throughput comparison are performed against two previously proposed desynchronization algorithms. Finally, using an experimental tested of TelosB motes we verify the performance, practicality, and correctness of the desynchronization algorithm on varying network topologies. I. INTRODUCTION However, intersecting nodes of several neighborhoods must avoid collision. In many WSN deployments, network topologies are subject to node failure, and in some cases node entry. Therefore, it is desirable for nodes to maintain the state of desynchronization under changing topological conditions. Herein lies the second challenge. Desynchronization should be responsive to any changes while incurring minimal communication overhead. Therefore, the required number of communication rounds to convergence and the required number of time slots, ie. throughput per node, are two important metrics for determin- ing the performance of any desynchronization algorithm. In this paper, we present a localized multi-hop desynchro- nization algorithm (M-DESYNC) to address the link schedul- ing problem on acyclic multi-hop and single-hop WSNs. The goal is to allocate individual time slots in communication period T to each node in a distributed manner, such that no interfering nodes transmit simultaneously. The proposed algorithm is designed to address the hidden terminal problem while maximizing slot utilization (i.e., throughput). No global clock or infrastructure is required to maintain desynchroniza- tion, and minimal communication overhead is required for establishing the local neighborhood. The algorithm requires constant memory cost regardless of the network size or density.", "citation": "Citations (15)", "departments": ["Stony Brook University", "Stony Brook University"], "authors": ["Hui Kang.....http://dblp.org/pers/hd/k/Kang:Hui", "Jennifer L. Wong.....http://dblp.org/pers/hd/w/Wong:Jennifer_L="], "conf": "infocom", "year": "2009", "pages": 5}