{"title": "DIRC: increasing indoor wireless capacity using directional antennas.", "fields": ["directional antenna", "fixed wireless", "wireless site survey", "wireless wan", "wi fi array"], "abstract": "The demand for wireless bandwidth in indoor environments such as homes and offices continues to increase rapidly. Although wireless technologies such as MIMO can reach link throughputs of 100s of Mbps (802.11n) for a single link, the question of how we can deliver high throughput to a large number of densely-packed devices remains an open problem. Directional antennas have been shown to be an effective way to increase spatial reuse, but past work has focused largely on outdoor environments where the interactions between wireless links can usually be ignored. This assumption is not acceptable in dense indoor wireless networks since indoor deployments need to deal with rich scattering and multipath effects. In this paper we introduce DIRC, a wireless network design whose access points use phased array antennas to achieve high throughput in dense, indoor environments. The core of DIRC is an algorithm that increases spatial reuse and maximizes overall network capacity by optimizing the orientations of a network of directional antennas. We implemented DIRC and evaluated it on a nine node network in an enterprise setting. Our results show that DIRC improves overall network capacity in indoor environments, while being flexible enough to adapt to node mobility and changing traffic workloads.", "citation": "Citations (134)", "year": "2009", "departments": ["Carnegie Mellon University", "Intel", "Intel", "Intel", "Carnegie Mellon University"], "conf": "sigcomm", "authors": ["Xi Liu.....http://dblp.org/pers/hd/l/Liu:Xi", "Anmol Sheth.....http://dblp.org/pers/hd/s/Sheth:Anmol", "Michael Kaminsky.....http://dblp.org/pers/hd/k/Kaminsky:Michael", "Konstantina Papagiannaki.....http://dblp.org/pers/hd/p/Papagiannaki:Konstantina", "Srinivasan Seshan.....http://dblp.org/pers/hd/s/Seshan:Srinivasan", "Peter Steenkiste.....http://dblp.org/pers/hd/s/Steenkiste:Peter"], "pages": 12}