{"title": "An Evaluation of Weak State Mechanism Design for Indirection in Dynamic Networks.", "fields": ["network packet", "indirection", "probabilistic logic", "soft state", "mechanism design"], "abstract": "State signaling and maintenance mechanisms play crucial roles in communication network protocols. State is used to facilitate indirections in protocols such as routing. Design approaches for traditional state signaling mechanisms have been categorized into soft and hard state. In both approaches, the state is deterministic. Hence, we call both as having strong state semantics, or more crisply, refer to them as strong state. If the state tracks entities with dynamic nature, strong state rapidly becomes invalidated and needs to be refreshed explicitly through control packets. In this paper, we evaluate the recently proposed weak state. Weak state is a generalization of soft state that is characterized by probabilistic semantics and local updates. It is interpreted as a probabilistic hint and not absolute truth. Weak state also contains the confidence in the state value, which is a measure of the probability that the state remains valid. The confidence or the state semantics is decayed locally without the need for explicit state update traffic traversing the network. The local updates also help the protocol use better estimates for the state value. We define two metrics, pure distortion and informed distortion, to evaluate the consistency of the weak state paradigm and compare it against strong state. Pure distortion measures the average gap between the actual value of the state and the value maintained at a remote node. On the other hand, the use of confidence increases the protocol's ability to cope with even large pure distortion. The resulting effective distortion is captured by the informed distortion metric. Using mathematical analysis, we compare weak with strong state. Local updates reduce the pure distortion because the protocol uses the best estimate of state value. The informed distortion is also significantly less because the probabilistic confidence value hints the protocol if the state is invalid. The weak state mechanism can be used to build protocols (-\neg: WSR [1]), which systematically interpret the state information. The state itself can be mostly updated locally, with less frequent explicit update messages over the network (i.e. leading to dramatic reductions in control traffic).", "citation": "Citations (5)", "departments": ["Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "IBM"], "authors": ["Utku Günay Acer.....http://dblp.org/pers/hd/a/Acer:Utku_G=uuml=nay", "Alhussein A. Abouzeid.....http://dblp.org/pers/hd/a/Abouzeid:Alhussein_A=", "Shivkumar Kalyanaraman.....http://dblp.org/pers/hd/k/Kalyanaraman:Shivkumar"], "conf": "infocom", "year": "2009", "pages": 9}