{"title": "Psi-calculi: Mobile Processes, Nominal Data, and Logic.", "fields": ["lambda calculus", "predicate logic", "mathematical proof", "operational semantics", "bisimulation"], "abstract": "A psi-calculus is an extension of the pi-calculus with nominal data types for data structures and for logical assertions representing facts about data. These can be transmitted between processes and their names can be statically scoped using the standard pi-calculus mechanism to allow for scope migrations. Other proposed extensions of the pi-calculus can be formulated as psi-calculi; examples include the applied pi-calculus, the spi-calculus, the fusion calculus, the concurrent constraint pi-calculus, and calculi with polyadic communication channels or pattern matching. Psi-calculi can be even more general, for example by allowing structured channels, higher-order formalisms such as the lambda calculus for data structures, and a predicate logic for assertions. Our labelled operational semantics and definition of bisimulation is straightforward, without a structural congruence. We establish minimal requirements on the nominal data and logic in order to prove general algebraic properties of psi-calculi. The proofs have been checked in the interactive proof checker Isabelle. We are the first to formulate a truly compositional labelled operational semantics for calculi of this calibre. Expressiveness and therefore modelling convenience significantly exceeds that of other formalisms, while the purity of the semantics is on par with the original pi-calculus.", "citation": "Citations (78)", "departments": ["Uppsala University", "Uppsala University", "Uppsala University", "Uppsala University"], "authors": ["Jesper Bengtson.....http://dblp.org/pers/hd/b/Bengtson:Jesper", "Magnus Johansson.....http://dblp.org/pers/hd/j/Johansson:Magnus", "Joachim Parrow.....http://dblp.org/pers/hd/p/Parrow:Joachim", "Björn Victor.....http://dblp.org/pers/hd/v/Victor:Bj=ouml=rn"], "conf": "lics", "year": "2009", "pages": 10}