{"title": "Towards an Efficient Service Level Agreement Assessment.", "fields": ["service level agreement", "kullback leibler divergence", "scalability", "testbed", "quality of service"], "abstract": "On-line end-to-end Service Level Agreement (SLA) monitoring is of key importance nowadays. For this purpose, past recent researches focused on measuring (when possible) or estimating (most of the times) network QoS or performance parameters. Up to now, attempts to provide accurate techniques\nfor estimating such parameters have failed. In addition, live reporting of the estimated network status requires a huge amount of resources, and lead to unscalable systems.\nThe originality of the contribution presented in this paper, relies on the statement that the accurate estimation of network QoS parameters is absolutely not required in most cases: specifically it is sufficient to be aware of service disruptions, i.e. when the QoS provided by the network collapses. For this purpose,\nwe propose an algorithm for disruption detection of network services. The proposed solution is based on the use of the wellknown\nKullback-Leibler Divergence algorithm. More specifically, we work on simple to measure time series, i.e. received interpacket\narrival times. In addition of efficiently detecting network QoS disruptions, the algorithm, also drastically reduces the\nrequired resources, and the overhead produced by the traffic collection for scalable SLA monitoring systems. The validity of the proposal is verified both in terms of accuracy and consumed resources in a real testbed, using different traffic profiles.", "citation": "Citations (5)", "departments": ["Polytechnic University of Catalonia", "Centre national de la recherche scientifique", "Polytechnic University of Catalonia", "Centre national de la recherche scientifique"], "authors": ["René Serral-Gracià.....http://dblp.org/pers/hd/s/Serral=Graci=agrave=:Ren=eacute=", "Yann Labit.....http://dblp.org/pers/hd/l/Labit:Yann", "Jordi Domingo-Pascual.....http://dblp.org/pers/hd/d/Domingo=Pascual:Jordi", "Philippe Owezarski.....http://dblp.org/pers/hd/o/Owezarski:Philippe"], "conf": "infocom", "year": "2009", "pages": 5}