{"title": "A Virtual Peer for Investigating Social Influences on Children's Bicycling.", "fields": ["virtual reality", "computer animation", "social influence", "animation", "gesture"], "abstract": "The goal of our work is to develop a programmatically controlled peer to ride with a human subject for the purpose of studying how social interactions influence riding behavior. The peer is controlled through a combination of reactive controllers that determine the gross motion of the virtual bicycle, action-based controllers that animate the virtual bicyclist and generate verbal behaviors, and a keyboard interface that allows an experimenter to initiate the virtual bicyclist's actions during the course of an experiment. The virtual bicyclist's repertoire of behaviors includes road following, riding alongside the human rider, stopping at intersections, and crossing intersections through specified gaps. The virtual cyclist engages the human subject through gaze, gesture, and verbal interactions. We describe the structure of the behavior code and report the results of a pilot study examining how 10- and 12-year-old children interact with a peer cyclist. Results of the pilot study showed that the presence of the peer had a significant influence on the size of the gaps taken as well as time left to spare between the participant and the trailing car in the crossed gap.", "citation": "Citations (8)", "departments": ["University of Iowa", "University of Iowa", "University of Iowa", "University of Iowa", "University of Iowa"], "authors": ["Sabarish V. Babu.....http://dblp.org/pers/hd/b/Babu:Sabarish_V=", "Timofey Grechkin.....http://dblp.org/pers/hd/g/Grechkin:Timofey", "Benjamin Chihak.....http://dblp.org/pers/hd/c/Chihak:Benjamin", "Christine Ziemer.....http://dblp.org/pers/hd/z/Ziemer:Christine", "Joseph K. Kearney.....http://dblp.org/pers/hd/k/Kearney:Joseph_K=", "James F. Cremer.....http://dblp.org/pers/hd/c/Cremer:James_F=", "Jodie M. Plumert.....http://dblp.org/pers/hd/p/Plumert:Jodie_M="], "conf": "vr", "year": "2009", "pages": 8}