{"title": "KSpot: Effectively Monitoring the K Most Important Events in a Wireless Sensor Network.", "fields": ["graphical user interface", "user interface", "server", "snapshot", "sql"], "abstract": "This demo presents a graphical user interface and ranking system, coined KSpot, for effectively monitoring the K highest-ranked answers to a query Q in a Wireless Sensor Network. KSpot deploys state-of-the-art distributed Top-k query processing algorithms in order to realize both snapshot queries and historic queries minimizing the consumption of system resources and prolonging the lifetime of the deployed sensor network. Additionally, KSpot is user-friendly and customizable featuring an intuitive user interface that enables a user to express declarative SQL-like queries over any ad-hoc scenario and to display the results graphically as opposed to the traditional tabular representation. To demonstrate the applicability of our system during the conference, we will continuously identify the K conference rooms with the highest sound level and display them such that conference attendees will be able to quickly determine the rooms with the most active discussions. The demo will also allow attendees to customize the system by changing the target scenario (e.g., by adapting the K value, the sensed parameter, etc.) Finally, we will present KSpot's system panel which continuously displays the savings in energy and messages that our system yields.", "citation": "Citations (13)", "departments": ["University of Cyprus", "Open University of Cyprus", "University of Cyprus", "University of Pittsburgh", "University of Cyprus"], "authors": ["Panayiotis Andreou.....http://dblp.org/pers/hd/a/Andreou:Panayiotis", "Demetrios Zeinalipour-Yazti.....http://dblp.org/pers/hd/z/Zeinalipour=Yazti:Demetrios", "Martha Vassiliadou.....http://dblp.org/pers/hd/v/Vassiliadou:Martha", "Panos K. Chrysanthis.....http://dblp.org/pers/hd/c/Chrysanthis:Panos_K=", "George Samaras.....http://dblp.org/pers/hd/s/Samaras:George"], "conf": "icde", "year": "2009", "pages": 4}