{"title": "Encountering SenseCam: personal recording technologies in everyday life.", "fields": ["locale", "everyday life", "experience sampling method", "situated", "permission"], "abstract": "In this paper, we present a study of responses to the idea of being recorded by a ubicomp recording technology called SenseCam. This study focused on real-life situations in two North American and two European locations. We present the findings of this study and their implications, specifically how those who might be recorded perceive and react to SenseCam. We describe what system parameters, social processes, and policies are required to meet the needs of both the primary users and these secondary stakeholders and how being situated within a particular locale can influence responses. Our results indicate that people would tolerate potential incursions from SenseCam for particular purposes. Furthermore, they would typically prefer to be informed about and to consent to recording as well as to grant permission before any data is shared. These preferences, however, are unlikely to instigate a request for deletion or other action on their part. These results inform future design of recording technologies like SenseCam and provide a broader understanding of how ubicomp technologies might be taken up across different cultural and political regions.", "citation": "Citations (91)", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Irvine", "University of Toronto", "Microsoft"], "authors": ["David H. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:David_H=", "Gabriela Marcu.....http://dblp.org/pers/hd/m/Marcu:Gabriela", "Gillian R. Hayes.....http://dblp.org/pers/hd/h/Hayes:Gillian_R=", "Khai N. Truong.....http://dblp.org/pers/hd/t/Truong:Khai_N=", "James Scott.....http://dblp.org/pers/hd/s/Scott:James", "Marc Langheinrich.....http://dblp.org/pers/hd/l/Langheinrich:Marc", "Christof Roduner.....http://dblp.org/pers/hd/r/Roduner:Christof"], "conf": "huc", "year": "2009", "pages": 10}