{"title": "Web image mining towards universal age estimator.", "fields": ["face detection", "image quality", "kernel regression", "outlier", "estimator"], "abstract": "In this paper, we present an  automatic  web image mining system towards building a  universal  human age estimator based on facial information, which is applicable to all ethnic groups and various image qualities. First, a large ( Flickr  and  Google  image search engine based on a set of human age related text queries. Then, within each image, several human face detectors of different implementations are used for robust face detection, and all the detected faces with multiple responses are considered as the multiple instances of a bag (image). An outlier removal step with Principal Component Analysis further refines the image set to about 220k faces, and then a robust multi-instance regressor learning algorithm is proposed to learn the kernel-regression based human age estimator under the scenarios with possibly noisy bags. The proposed system has the following characteristics: 1) no manual human age labeling process is required, and the age information is automatically obtained from the age related queries, 2) the derived human age estimator is universal owing to the diversity and richness of Internet images and thus has good generalization capability, and 3) the age estimator learning process is robust to the noises existing in both Internet images and corresponding age labels. This automatically derived human age estimator is extensively evaluated on three popular benchmark human aging databases, and without taking any images from these benchmark databases as training samples, comparable age estimation accuracies with the state-of-the-art results are achieved.", "citation": "Citations (105)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Bingbing Ni.....http://dblp.org/pers/hd/n/Ni:Bingbing", "Zheng Song.....http://dblp.org/pers/hd/s/Song:Zheng", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2009", "pages": 10}