{"title": "Blackbox Polynomial Identity Testing for Depth 3 Circuits.", "fields": ["incidence geometry", "mathematics", "conjecture", "discrete mathematics", "polynomial identity testing", "electronic circuit", "sylvester gallai theorem", "bounded function", "theoretical computer science"], "abstract": "We study depth three arithmetic circuits with bounded top fanin. We give the first deterministic polynomial time blackbox identity test for depth three circuits with bounded top fanin over the field of rational numbers, thus resolving a question posed by Klivans and Spielman (STOC 2001). Our main technical result is a structural theorem for depth three circuits with bounded top fanin that compute the zero polynomial. In particular we show that if a circuit C with real coefficients is simple, minimal and computes the zero polynomial, then the rank of C can be upper bounded by a function only of the top fanin. This proves a weak form of a conjecture of Dvir and Shpilka (STOC 2005) on the structure of identically zero depth three arithmetic circuits. Our blackbox identity test follows from this structural theorem by combining it with a construction of Karnin and Shpilka (CCC 2008). Our proof of the structure theorem exploits the geometry of finite point sets in R^n. We identify the linear forms appearing in the circuit C with points in R^n. We then show how to apply high dimensional versions of the Sylvester--Gallai Theorem, a theorem from incidence-geometry, to identify a special linear form appearing in C, such that on the subspace where the linear form vanishes, C restricts to a simpler circuit computing the zero polynomial. This allows us to build an inductive argument bounding the rank of our circuit. While the utility of such theorems from incidence geometry for identity testing has been hinted at before, our proof is the first to develop the connection fully and utilize it effectively.", "citation": "Not cited", "departments": ["Microsoft", "Massachusetts Institute of Technology"], "authors": ["Neeraj Kayal.....http://dblp.org/pers/hd/k/Kayal:Neeraj", "Shubhangi Saraf.....http://dblp.org/pers/hd/s/Saraf:Shubhangi"], "conf": "focs", "year": "2009", "pages": 10}