{"title": "Mining Health Models for Performance Monitoring of Services.", "fields": ["web server", "database server", "system monitoring", "stateless protocol", "sql"], "abstract": "Online services such as search and live applications rely on large infrastructures in data centers, consisting of both stateless servers (e.g., web servers) and stateful servers (e.g., database servers). Acceptable performance of such infrastructures, and hence the availability of online services, rely on a very large number of parameters such as per-process resources and configurable system/application parameters. These parameters are available for collection as performance counters distributed across various machines, but services have had a hard time determining which performance counters to monitor and what thresholds to use for performance alarms in a production environment. In this paper, we present a novel framework called PerfAnalyzer, a storage-efficient and pro-active performance monitoring framework for correlating service health with performance counters. PerfAnalyzer automatically infers and builds health models for any service by running the standard suite of predeployment tests for the service and data mining the resulting performance counter data-set. A filtered set of performance counters and thresholds of alarms are produced by our framework. The health model inferred by our framework can then be used to detect performance degradation and collect detailed data for root-cause analysis in a production environment. We have applied PerfAnalyzer on five simple stress scenarios – CPU, memory, I/O, disk, and network, and two real system – Microsoft’s SQL Server 2005 and IIS 7.0 Web Server, with promising results.", "citation": "Citations (8)", "departments": ["North Carolina State University", "Microsoft"], "authors": ["Mithun Acharya.....http://dblp.org/pers/hd/a/Acharya:Mithun", "Vamshidhar Kommineni.....http://dblp.org/pers/hd/k/Kommineni:Vamshidhar"], "conf": "kbse", "year": "2009", "pages": 12}