{"title": "An architecture for recycling intermediates in a column-store.", "fields": ["materialized view", "retention period", "tuple", "decision support system", "self organization", "cache", "query plan", "architecture", "cpu cache", "theoretical computer science"], "abstract": "Automatically recycling (intermediate) results is a grand challenge for state-of-the-art databases to improve both query response time and throughput. Tuples are loaded and streamed through a tuple-at-a-time processing pipeline avoiding materialization of intermediates as much as possible. This limits the opportunities for reuse of overlapping computations to DBA-defined materialized views and function/result cache tuning.   In contrast, the operator-at-a-time execution paradigm produces fully materialized results in each step of the query plan. To avoid resource contention, these intermediates are evicted as soon as possible.   In this paper we study an architecture that harvests the by-products of the operator-at-a-time paradigm in a column store system using a lightweight mechanism, the  recycler . The key challenge then becomes selection of the policies to admit intermediates to the resource pool, their retention period, and the eviction strategy when facing resource limitations.   The proposed recycling architecture has been implemented in an open-source system. An experimental analysis against the TPC-H ad-hoc decision support benchmark and a complex, real-world application (SkyServer) demonstrates its effectiveness in terms of self-organizing behavior and its significant performance gains. The results indicate the potentials of recycling intermediates and charters a route for further development of database kernels.", "citation": "Not cited", "year": "2009", "departments": ["Centrum Wiskunde & Informatica", "Centrum Wiskunde & Informatica", "Centrum Wiskunde & Informatica", "Centrum Wiskunde & Informatica", "Centrum Wiskund ... am, Netherlands", "Centrum Wiskund ... am, Netherlands", "Centrum Wiskund ... am, Netherlands", "Centrum Wiskund ... am, Netherlands", "Centrum Wiskund ...  en Informatica", "Centrum Wiskund ...  en Informatica", "Centrum Wiskund ...  en Informatica", "Centrum Wiskund ...  en Informatica"], "conf": "sigmod", "authors": ["Milena Ivanova.....http://dblp.org/pers/hd/i/Ivanova:Milena", "Martin L. Kersten.....http://dblp.org/pers/hd/k/Kersten:Martin_L=", "Niels J. Nes.....http://dblp.org/pers/hd/n/Nes:Niels_J=", "Romulo Goncalves.....http://dblp.org/pers/hd/g/Goncalves:Romulo"], "pages": 12}