{"title": "Probabilistic Inference over RFID Streams in Mobile Environments.", "fields": ["streams", "mobile rfid", "inference", "scalability", "spatial database"], "abstract": "Recent innovations in RFID technology are enabling large-scale cost-effective deployments in retail, healthcare, pharmaceuticals and supply chain management. The advent of mobile or handheld readers adds significant new challenges to RFID stream processing due to the inherent reader mobility, increased noise, and incomplete data. In this paper, we address the problem of translating noisy, incomplete raw streams from mobile RFID readers into clean, precise event streams with location information. Specifically we propose a probabilistic model to capture the mobility of the reader, object dynamics, and noisy readings. Our model can self-calibrate by automatically estimating key parameters from observed data. Based on this model, we employ a sampling-based technique called particle filtering to infer clean, precise information about object locations from raw streams from mobile RFID readers. Since inference based on standard particle filtering is neither scalable nor efficient in our settings, we propose three enhancements---particle factorization, spatial indexing, and belief compression---for scalable inference over large numbers of objects and high-volume streams. Our experiments show that our approach can offer 49\\% error reduction over a state-of-the-art data cleaning approach such as SMURF while also being scalable and efficient.", "citation": "Citations (142)", "departments": ["University of Massachusetts Amherst", "University of California, Berkeley", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Thanh T. L. Tran.....http://dblp.org/pers/hd/t/Tran:Thanh_T=_L=", "Charles A. Sutton.....http://dblp.org/pers/hd/s/Sutton:Charles_A=", "Richard Cocci.....http://dblp.org/pers/hd/c/Cocci:Richard", "Yanming Nie.....http://dblp.org/pers/hd/n/Nie:Yanming", "Yanlei Diao.....http://dblp.org/pers/hd/d/Diao:Yanlei", "Prashant J. Shenoy.....http://dblp.org/pers/hd/s/Shenoy:Prashant_J="], "conf": "icde", "year": "2009", "pages": 12}