{"title": "An Economically-Principled Generative Model of AS Graph Connectivity.", "fields": ["connectivity", "parameterized complexity", "autonomous system", "business relationship management", "generative model"], "abstract": "End-to-end packet delivery in the Internet is achieved through a system of interconnections between the network domains of independent entities called Autonomous Systems (ASes). Inter-domain connections are the result of a complex, dynamic process of negotiated business relationships between pairs of ASes. We present an economically-principled generative model for Autonomous System graph connectivity. While there is already a large literature devoted to understanding Internet connectivity at the AS level, many of these models are either static or based on generalized stochastics. In a thoughtful critique of such models, Li, Alderson, Doyle and Willinger [10] show that while many generative models reproduce certain statistical features of the AS graph, they fail to capture the good performance of realistic networks [10]. In a study of the AS’s intra-domain graph, Li, Alderson, Willinger and Doyle [11] define performance instead in terms of network throughput and show that it is very unlikely that randomized generative models will yield graphs that have the highly-optimized structure of real-world networks. The goal of this paper is to provide insight into the economic drivers that yield, over time, the rich and complex AS interconnection patterns that constitute today’s Internet. Notable features of our model include the assignment of AS business models with an asymmetric gravity model of interdomain traffic demand [3], an explicit representation of AS utility that incorporates benefits for traffic routed, congestion costs, and payments between ASes, and a deterministic process for link revision that can cascade throughout the network. This is the first attempt at AS graph modeling that incorporates a diffusion process to capture how ASes respond to direct and indirect externalities from changes in the network structure, which brings it closer to an equilibrium model. We validate our model against other generative models. To do this, we define the social planner’s problem which is parameterized by the business models of the graph and provide a method to compare earlier generative models with our model by optimizing the placement of business models on the network. We find that our model yields graphs that are better performing as compared to other dynamic generative models. We also show that our model yields a structured placement of nodes endogenously, where this placement of nodes generally reflects ASes’ business models. This is some of the first evidence of the significance of the business competitive landscape in determining the structure of the AS graph.", "citation": "Citations (18)", "departments": ["University of Pennsylvania", "Harvard University", "Harvard University", "Harvard University"], "authors": ["Jacomo Corbo.....http://dblp.org/pers/hd/c/Corbo:Jacomo", "Shaili Jain.....http://dblp.org/pers/hd/j/Jain:Shaili", "Michael Mitzenmacher.....http://dblp.org/pers/hd/m/Mitzenmacher:Michael", "David C. Parkes.....http://dblp.org/pers/hd/p/Parkes:David_C="], "conf": "infocom", "year": "2009", "pages": 5}