{"title": "A linear formulation of shape from specular flow.", "fields": ["specular highlight", "trajectory", "surface reconstruction", "image plane", "specular reflection"], "abstract": "When a curved mirror-like surface moves relative to its environment, it induces a motion field—or specular flow— on the image plane that observes it. This specular flow is related to the mirror's shape through a non-linear partial differential equation, and there is interest in understanding when and how this equation can be solved for surface shape. Existing analyses of this ‘shape from specular flow equation’ have focused on closed-form solutions, and while they have yielded insight, their critical reliance on externally-provided initial conditions and/or specific motions makes them difficult to apply in practice. This paper resolves these issues. We show that a suitable reparameterization leads to a linear formulation of the shape from specular flow equation. This formulation radically simplifies the reconstruction process and allows, for example, both motion and shape to be recovered from as few as two specular flows even when no externally-provided initial conditions are available. Our analysis moves us closer to a practical method for recovering shape from specular flow that operates under arbitrary, unknown motions in unknown illumination environments and does not require additional shape information from other sources.", "citation": "Citations (23)", "year": "2009", "departments": ["Harvard University", "Harvard University", "Ben-Gurion University of the Negev", "Harvard University", "Harvard University"], "conf": "iccv", "authors": ["Guillermo D. Cañas.....http://dblp.org/pers/hd/c/Ca=ntilde=as:Guillermo_D=", "Yuriy Vasilyev.....http://dblp.org/pers/hd/v/Vasilyev:Yuriy", "Yair Adato.....http://dblp.org/pers/hd/a/Adato:Yair", "Todd E. Zickler.....http://dblp.org/pers/hd/z/Zickler:Todd_E=", "Steven J. Gortler.....http://dblp.org/pers/hd/g/Gortler:Steven_J=", "Ohad Ben-Shahar.....http://dblp.org/pers/hd/b/Ben=Shahar:Ohad"], "pages": 8}