{"title": "Towards Adaptive Beamforming in Indoor Wireless Networks: An Experimental Approach.", "fields": ["precoding", "wsdma", "beamforming", "spectral efficiency", "adaptive beamformer"], "abstract": "Several research works have argued that adaptive beamforming has the potential to realize the high spectral efficiency requirements of next-generation wireless standards, and is especially well-suited for multipath-rich environments such as indoors. Most works have been limited to theory; few works in literature address the practical benefits and realizability of adaptive beamforming. In this paper, we design and implement the first indoor WLAN beamforming system with multi-element array antennas and software radio platforms, that forms a testbed for exploration of practical benefits of beamforming, and evaluation of algorithms for efficient beamforming in diverse environments. In the process of building the system, we identify and address several challenges with practical beamforming that are often ignored in theoretical works. Most importantly, channel estimation for forming the best beam to a user is hindered by oscillator drifts on the transmitter and receiver side that introduce hard-to-isolate phase and frequency offsets from the estimated channel coefficients. We describe these issues and incorporate novel solutions in our system to address them without requiring hardware modifications. We use the system to demonstrate the realizable benefits of adaptive beamforming in a typical indoor office environment.", "citation": "Citations (21)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Sriram Lakshmanan.....http://dblp.org/pers/hd/l/Lakshmanan:Sriram", "Karthikeyan Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Karthikeyan", "Ravi Kokku.....http://dblp.org/pers/hd/k/Kokku:Ravi", "A. Khojestepour.....http://dblp.org/pers/hd/k/Khojestepour:A=", "Sampath Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan:Sampath"], "conf": "infocom", "year": "2009", "pages": 5}