{"title": "Fundamental Limits on Secure Clock Synchronization and Man-In-The-Middle Detection in Fixed Wireless Networks.", "fields": ["network packet", "special case", "man in the middle attack", "channel", "clock synchronization"], "abstract": "In this paper we present fundamental results on se- cure clock synchronization and man-in-the-middle detection using only timing information. Under the assumption of affine clocks, we present a clock synchronization protocol that can operate on any channel on which data can be sent. We present a clock synchronization protocol from the literature and add verification steps on top of this protocol. These verification steps force man- in-the-middle attackers, who want to delay traffic between the endpoints and yet remain undetected, to impose only constant delays on packets. In a special case, we show that it is possible to identify and ignore attacker-delayed packets. We then show three different types of attackers: a half-duplex attacker that can always be caught using timing information alone, a double full-duplex attacker that can never be caught using only timing information, and a full-duplex attacker whose capability to perform man-in-the- middle attacks depends on its location relative to the endpoints and on the turnaround times of the endpoints. In particular, we prove that certain attackers are impossible to detect using only timing, and we construct defensive protocols that prevent all other man-in- the-middle delay attacks. A particularly noteworthy result is that a single attacker using the same radio technology as the endpoints can never successfully perform a man-in-the-middle attack to delay traffic. These results form a lightweight man-in-the-middle attack detection protocol, on top of which a wide variety of protocols can be built, including routing protocols and more sophisticated heavyweight protocols.", "citation": "Citations (15)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Jerry T. Chiang.....http://dblp.org/pers/hd/c/Chiang:Jerry_T=", "Jason J. Haas.....http://dblp.org/pers/hd/h/Haas:Jason_J=", "Yih-Chun Hu.....http://dblp.org/pers/hd/h/Hu:Yih=Chun", "P. R. Kumar.....http://dblp.org/pers/hd/k/Kumar:P=_R=", "Jihyuk Choi.....http://dblp.org/pers/hd/c/Choi:Jihyuk"], "conf": "infocom", "year": "2009", "pages": 9}