{"title": "Enabling Transactional File Access via Lightweight Kernel Extensions.", "fields": ["posix", "sysfs", "distributed transaction", "linux kernel", "epoll"], "abstract": "Transactions offer a powerful data-access method used in many databases today trough a specialized query API. User applications, however, use a different file-access API (POSIX) which does not offer transactional guarantees. Applications using transactions can become simpler, smaller, easier to develop and maintain, more reliable, and more secure. We explored several techniques how to provide transactional file access with minimal impact on existing programs. Our first prototype was a standalone kernel component within the Linux kernel, but it complicated the kernel considerably and duplicated some of Linux's existing facilities. Our second prototype was all in user level, and while it was easier to develop, it suffered from high overheads. In this paper we describe our latest prototype and the evolution that led to it. We implemented a transactional file API inside the Linux kernel which integrates easily and seamlessly with existing kernel facilities. This design is easier to maintain, simpler to integrate into existing OSs, and efficient. We evaluated our prototype and other systems under a variety of workloads. We demonstrate that our prototype's performance is better than comparable systems and comes close to the theoretical lower bound for a log-based transaction manager.", "citation": "Citations (95)", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University", "IBM"], "authors": ["Richard P. Spillane.....http://dblp.org/pers/hd/s/Spillane:Richard_P=", "Sachin Gaikwad.....http://dblp.org/pers/hd/g/Gaikwad:Sachin", "Manjunath Chinni.....http://dblp.org/pers/hd/c/Chinni:Manjunath", "Erez Zadok.....http://dblp.org/pers/hd/z/Zadok:Erez", "Charles P. Wright.....http://dblp.org/pers/hd/w/Wright:Charles_P="], "conf": "fast", "year": "2009", "pages": 14}