{"title": "Random Linear Network Coding For Time Division Duplexing: When To Stop Talking And Start Listening.", "fields": ["automatic repeat request", "duplex", "selective repeat arq", "binary erasure channel", "telecommunications", "computer science", "packet erasure channel", "linear network coding", "active listening", "go back n arq"], "abstract": "A new random linear network coding scheme for reliable communications for time division duplexing channels is proposed. The setup assumes a packet erasure channel and that nodes cannot transmit and receive information simultaneously. The sender transmits coded data packets back-to-back before stopping to wait for the receiver to acknowledge (ACK) the number of degrees of freedom, if any, that are required to decode correctly the information. We provide an analysis of this problem to show that there is an optimal number of coded data packets, in terms of mean completion time, to be sent before stopping to listen. This number depends on the latency, probabilities of packet erasure and ACK erasure, and the number of degrees of freedom that the receiver requires to decode the data. This scheme is optimal in terms of the mean time to complete the transmission of a fixed number of data packets. We show that its performance is very close to that of a full duplex system, while transmitting a different number of coded packets can cause large degradation in performance, especially if latency is high. Also, we study the throughput performance of our scheme and compare it to existing half-duplex Go-back-N and Selective Repeat ARQ schemes. Numerical results, obtained for different latencies, show that our scheme has similar performance to the Selective Repeat in most cases and considerable performance gain when latency and packet error probability is high.", "citation": "Citations (127)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Daniel Enrique Lucani.....http://dblp.org/pers/hd/l/Lucani:Daniel_Enrique", "Milica Stojanovic.....http://dblp.org/pers/hd/s/Stojanovic:Milica", "Muriel Médard.....http://dblp.org/pers/hd/m/M=eacute=dard:Muriel"], "conf": "infocom", "year": "2009", "pages": 9}