{"title": "Self-Tuning, Bandwidth-Aware Monitoring for Dynamic Data Streams.", "fields": ["self tuning", "bandwidth allocation", "data stream mining", "dynamic bandwidth allocation", "network monitoring"], "abstract": "We present SMART, a self-tuning, bandwidth-aware monitoring system that maximizes result precision of continuous aggregate queries over dynamic data streams. While prior approaches minimize bandwidth cost under fixed precision constraints, they may still overload a monitoring system during traffic bursts. To facilitate practical deployment of monitoring systems, SMART therefore bounds the worst-case bandwidth cost for overload resilience. The primary challenge for SMART is how to dynamically select updates at each node to maximize query precision while keeping per-node monitoring bandwidth below a specified budget. To address this challenge, SMART’s hierarchical algorithm (1) allocates bandwidth budgets in an ear-optimal manner to maximize global precision and (2) selftunes bandwidth settings to improve precision under dynamic workloads. Our prototype implementation of SMART provides key solutions to (a) prioritize pending updates for multi-attribute queries, (b) build bounded fan-in, load-aware aggregation trees to improve accuracy, and (c) combine temporal batching with arithmetic filtering to reduce load and to quantify result staleness. Our evaluation using simulations and a network monitoring application shows that SMART incurs low overheads, improves accuracy by up to an order of magnitude compared to uniform bandwidth allocation, and performs close to the optimal algorithm under modest bandwidth budgets.", "citation": "Citations (8)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Navendu Jain.....http://dblp.org/pers/hd/j/Jain:Navendu", "Praveen Yalagandula.....http://dblp.org/pers/hd/y/Yalagandula:Praveen", "Michael Dahlin.....http://dblp.org/pers/hd/d/Dahlin:Michael", "Yin Zhang.....http://dblp.org/pers/hd/z/Zhang:Yin"], "conf": "icde", "year": "2009", "pages": 12}