{"title": "Alarm.", "fields": ["constant false alarm rate", "lock", "systems architecture", "embedded java", "motion detector", "personally identifiable information", "radio spectrum", "overlay", "false alarm", "security alarm", "computer vision", "assisted gps", "compromise", "medicine", "artificial intelligence", "business", "computer hardware", "remote control", "computer security", "java", "nuisance", "embedded system", "tracking system", "component based software engineering", "alarm management", "interlocking", "standardization", "alarm", "injury prevention", "idle", "alarm device", "orthogonal frequency division multiplexing", "data transmission", "extensibility"], "abstract": "A signaling system comprises a portable signaling unit, a remote alarm switch device, a central dispatch station, and a wireless communication system such as a cellular or telephone system, etc., and a GPS or alike system. The portable signaling unit and the remote alarm switch may be adapted to be worn at different locations on the person's body. The remote alarm switch may be concealed in the form of a wristband or in the form of any other object such as a broach, pendant, or keychain. When the person in distress activates the remote alarm switch or when the remote alarm switch is removed from the individual by a forceful or unauthorized action or when the signaling unit is removed from the proximity of the remote alarm switch, the portable signaling unit sends a data transmission which includes its location to the central dispatch station. The portable signaling unit also has manual alarm trigger capabilities so it can be used without the remote alarm switch unit. The central dispatch station receives the data transmission and accurately displays the user identification, stored personal information, nature of the alarm; in addition the location of the portable signaling unit is superimposed on a digitized map at a position corresponding to the location of the person wearing the portable signaling unit. The portable signaling unit can be remotely activated from a central dispatch station to determine and monitor the location of the portable signaling unit.", "citation": "Citations (70)", "year": "2009", "departments": ["Daimler AG", "Mitsubishi", "Pragmatus Mobil ... andria, VA, US)", "Pragmatus Mobil ... andria, VA, US)", "Pragmatus Mobil ... andria, VA, US)", "Pragmatus Mobil ... andria, VA, US)", "SCRIPT MICHAEL  ... SCRIPT HENRY J.", "SCRIPT MICHAEL  ... SCRIPT HENRY J."], "conf": "siggraph", "authors": ["Moo Hyun Jang.....http://dblp.org/pers/hd/j/Jang:Moo_Hyun"], "pages": 1}