{"title": "Understanding Customer Problem Troubleshooting from Storage System Logs.", "fields": ["real time computing", "software", "root cause", "troubleshooting", "computer data storage"], "abstract": "Customer problem troubleshooting has been a critically important issue for both customers and system providers. This paper makes two major contributions to better understand this topic.\n\nFirst, it provides one of the first characteristic studies of customer problem troubleshooting using a large set (636,108) of real world customer cases reported from 100,000 commercially deployed storage systems in the last two years. We study the characteristics of customer problem troubleshooting from various dimensions as well as correlation among them. Our results show that while some failures are either benign, or resolved automatically, many others can take hours or days of manual diagnosis to fix. For modern storage systems, hard-ware failures and misconfigurations dominate customer cases, but software failures take longer time to resolve. Interestingly, a relatively significant percentage of cases are because customers lack sufficient knowledge about the system. We observe that customer problems with attached system logs are invariably resolved much faster than those without logs.\n\nSecond, we evaluate the potential of using storage system logs to resolve these problems. Our analysis shows that a failure message alone is a poor indicator of root cause, and that combining failure messages with multiple log events can improve low-level root cause prediction by a factor of three. We then discuss the challenges in log analysis and possible solutions.", "citation": "Citations (64)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "NetApp", "NetApp", "Pattern Insight, Inc."], "authors": ["Weihang Jiang.....http://dblp.org/pers/hd/j/Jiang:Weihang", "Chongfeng Hu.....http://dblp.org/pers/hd/h/Hu:Chongfeng", "Shankar Pasupathy.....http://dblp.org/pers/hd/p/Pasupathy:Shankar", "Arkady Kanevsky.....http://dblp.org/pers/hd/k/Kanevsky:Arkady", "Zhenmin Li.....http://dblp.org/pers/hd/l/Li:Zhenmin", "Yuanyuan Zhou.....http://dblp.org/pers/hd/z/Zhou_0001:Yuanyuan"], "conf": "fast", "year": "2009", "pages": 14}