{"title": "Visual event recognition in videos by learning from web data.", "fields": ["contextual image classification", "multiple kernel learning", "small number", "scale invariant feature transform", "earth mover s distance"], "abstract": "We propose a visual event recognition framework for consumer videos by leveraging a large amount of loosely labeled web videos (e.g., from YouTube). Observing that consumer videos generally contain large intraclass variations within the same type of events, we first propose a new method, called Aligned Space-Time Pyramid Matching (ASTPM), to measure the distance between any two video clips. Second, we propose a new transfer learning method, referred to as Adaptive Multiple Kernel Learning (A-MKL), in order to 1) fuse the information from multiple pyramid levels and features (i.e., space-time features and static SIFT features) and 2) cope with the considerable variation in feature distributions between videos from two domains (i.e., web video domain and consumer video domain). For each pyramid level and each type of local features, we first train a set of SVM classifiers based on the combined training set from two domains by using multiple base kernels from different kernel types and parameters, which are then fused with equal weights to obtain a prelearned average classifier. In A-MKL, for each event class we learn an adapted target classifier based on multiple base kernels and the prelearned average classifiers from this event class or all the event classes by minimizing both the structural risk functional and the mismatch between data distributions of two domains. Extensive experiments demonstrate the effectiveness of our proposed framework that requires only a small number of labeled consumer videos by leveraging web data. We also conduct an in-depth investigation on various aspects of the proposed method A-MKL, such as the analysis on the combination coefficients on the prelearned classifiers, the convergence of the learning algorithm, and the performance variation by using different proportions of labeled consumer videos. Moreover, we show that A-MKL using the prelearned classifiers from all the event classes leads to better performance when compared with A-MKL using the prelearned classifiers only from each individual event class.", "citation": "Citations (423)", "year": "2010", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "University of Rochester"], "conf": "cvpr", "authors": ["Lixin Duan.....http://dblp.org/pers/hd/d/Duan:Lixin", "Dong Xu.....http://dblp.org/pers/hd/x/Xu_0001:Dong", "Ivor Wai-Hung Tsang.....http://dblp.org/pers/hd/t/Tsang:Ivor_Wai=Hung", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo"], "pages": 8}