{"title": "The contribution of real-time mirror reflections of motor actions on virtual body ownership in an immersive virtual environment.", "fields": ["immersion", "virtual machine", "elevation", "illusion", "asynchronous communication"], "abstract": "This paper reports an experiment that investigated people's body ownership of an avatar that was observed in a virtual mirror. Twenty subjects were recruited in a within-groups study where 10 first experienced a virtual character that synchronously reflected their upper-body movements as seen in a virtual mirror, and then an asynchronous condition where the mirror avatar displayed prerecorded actions, unrelated to those of the participant. The other 10 subjects experienced the conditions in the opposite order. In both conditions the participant could carry out actions that led to elevation above ground level, as seen from their first person perspective and correspondingly in the mirror. A rotating virtual fan eventually descended to 2m above the ground. The hypothesis was that synchronous mirror reflection would result in higher subjective sense of ownership. A questionnaire analysis showed that the body ownership illusion was significantly greater for the synchronous than asynchronous condition. Additionally participants in the synchronous condition avoided collision with the descending fan significantly more often than those in the asynchronous condition. The results of this experiment are put into context within similar experiments on multisensory correlation and body ownership within cognitive neuroscience.", "citation": "Citations (84)", "departments": ["University of Barcelona", "University of Barcelona", "University of Barcelona", "University of Barcelona"], "authors": ["Mar González-Franco.....http://dblp.org/pers/hd/g/Gonz=aacute=lez=Franco:Mar", "Daniel Pérez-Marcos.....http://dblp.org/pers/hd/p/P=eacute=rez=Marcos:Daniel", "Bernhard Spanlang.....http://dblp.org/pers/hd/s/Spanlang:Bernhard", "Mel Slater.....http://dblp.org/pers/hd/s/Slater:Mel"], "conf": "vr", "year": "2010", "pages": 4}