{"title": "Free-shape subwindow search for object localization.", "fields": ["graph", "search algorithm", "object detection", "pixel", "bag of words model in computer vision"], "abstract": "Object localization in an image is usually handled by searching for an optimal subwindow that tightly covers the object of interest. However, the subwindows considered in previous work are limited to rectangles or other specified, simple shapes. With such specified shapes, no subwindow can cover the object of interest tightly. As a result, the desired subwindow around the object of interest may not be optimal in terms of the localization objective function, and cannot be detected by a subwindow search algorithm. In this paper, we propose a new graph-theoretic approach for object localization by searching for an optimal subwindow without pre-specifying its shape. Instead, we require the resulting subwindow to be well aligned with edge pixels that are detected from the image. This requirement is quantified and integrated into the localization objective function based on the widely-used bag of visual words technique. We show that the ratio-contour graph algorithm can be adapted to find the optimal free-shape subwindow in terms of the new localization objective function. In the experiment, we test the proposed approach on the PASCAL VOC 2006 and VOC 2007 databases for localizing several categories of animals. We find that its performance is better than the previous efficient subwindow search algorithm.", "citation": "Citations (25)", "year": "2010", "departments": ["University of South Carolina", "University of South Carolina", "University of South Carolina", "University of South Carolina", "University of South Carolina"], "conf": "cvpr", "authors": ["Zhiqi Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhiqi", "Yu Cao.....http://dblp.org/pers/hd/c/Cao:Yu", "Dhaval Salvi.....http://dblp.org/pers/hd/s/Salvi:Dhaval", "Kenton Oliver.....http://dblp.org/pers/hd/o/Oliver:Kenton", "Jarrell W. Waggoner.....http://dblp.org/pers/hd/w/Waggoner:Jarrell_W=", "Song Wang.....http://dblp.org/pers/hd/w/Wang_0002:Song"], "pages": 8}