{"title": "SparseTrack: Enhancing Indoor Pedestrian Tracking with Sparse Infrastructure Support.", "fields": ["tracking error", "probabilistic logic", "ranging", "dead reckoning", "trilateration"], "abstract": "Accurate indoor pedestrian tracking has wide applications in the healthcare, retail, and entertainment industries. However, existing approaches to indoor tracking have various limitations. For example, location-fingerprinting approaches are labor-intensive and vulnerable to environmental changes. Trilateration approaches require at least three Line-of-Sight (LoS) beacons to cover any point in the service area, which results in heavy infrastructure cost. Dead Reckoning (DR) approaches rely on knowledge of the initial user location and suffer from tracking error accumulation. Despite this, we adopt DR for location tracking because of the recent emergence of affordable hand-held devices equipped with low cost DR-enabling sensors. In this paper, we propose an indoor pedestrian tracking system which comprises a DR sub-system implemented on a mobile phone, and a ranging sub-system with a sparse infrastructure. A probabilistic fusion scheme is applied to bound the accumulated tracking error of DR when new range measurements are available from sparsely deployed beacons. Experimental results show that the proposed system is able to track users much better than DR alone, with reductions in average error by up to 71.9%. The system is robust and works well even when the initial user location is not available and range updates are intermittent. This highlights the potential of using sparse but reasonably accurate partial information to limit location tracking errors.", "citation": "Citations (59)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Yunye Jin.....http://dblp.org/pers/hd/j/Jin:Yunye", "Mehul Motani.....http://dblp.org/pers/hd/m/Motani:Mehul", "Wee-Seng Soh.....http://dblp.org/pers/hd/s/Soh:Wee=Seng", "Juanjuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Juanjuan"], "conf": "infocom", "year": "2010", "pages": 9}