{"title": "Intrusion-Resilience in Mobile Unattended WSNs.", "fields": ["key distribution in wireless sensor networks", "wireless wan", "sensor node", "mobile wireless sensor network", "transceiver", "compromise", "sink", "adversary"], "abstract": "Wireless Sensor Networks (WSNs) are susceptible to a wide range of attacks due to their distributed nature, limited sensor resources and lack of tamper-resistance. Once a sensor is corrupted, the adversary learns all secrets and (even if the sensor is later released) it is very difficult for the sensor to regain security, i.e., to obtain intrusion-resilience. Existing solutions rely on the presence of an on-line trusted third party, such as a sink, or on the availability of secure hardware on sensors. Neither assumption is realistic in large-scale Unattended WSNs (UWSNs), characterized by long periods of disconnected operation and periodic visits by the sink. In such settings, a mobile adversary can gradually corrupt the entire network during the intervals between sink visits. As shown in some recent work, intrusionresilience in UWSNs can be attained (to a degree) via cooperative self-healing techniques. In this paper, we focus on intrusion-resilience in Mobile Unattended Wireless Sensor Networks (μUWSNs) where sensors move according to some mobility model. We argue that sensor mobility motivates a specific type of adversary and defending against it requires new security techniques. Concretely, we propose a cooperative protocol that - by leveraging sensor mobility - allows compromised sensors to recover secure state after compromise. This is obtained with very low overhead and in a fully distributed fashion. We provide a thorough analysis of the proposed protocol and support it by extensive simulation results.", "citation": "Not cited", "departments": ["University of California, Irvine", "University of California, Irvine", "UNESCO Chair in ... e, Rome, Italy", "Universidad Pol ...  Madrid, Spain", "School of Mathe ... u 211171,China)"], "authors": ["Roberto Di Pietro.....http://dblp.org/pers/hd/p/Pietro:Roberto_Di", "Gabriele Oligeri.....http://dblp.org/pers/hd/o/Oligeri:Gabriele", "Claudio Soriente.....http://dblp.org/pers/hd/s/Soriente:Claudio", "Gene Tsudik.....http://dblp.org/pers/hd/t/Tsudik:Gene"], "conf": "infocom", "year": "2010", "pages": 9}