{"title": "Security and Privacy Vulnerabilities of In-Car Wireless Networks: A Tire Pressure Monitoring System Case Study.", "fields": ["tire pressure monitoring system", "pressure sensor", "spoofing attack", "authentication", "data validation"], "abstract": "Wireless networks are being integrated into the modern automobile. The security and privacy implications of such in-car networks, however, have are not well understood as their transmissions propagate beyond the confines of a car's body. To understand the risks associated with these wireless systems, this paper presents a privacy and security evaluation of wireless Tire Pressure Monitoring Systems using both laboratory experiments with isolated tire pressure sensor modules and experiments with a complete vehicle system. We show that eavesdropping is easily possible at a distance of roughly 40m from a passing vehicle. Further, reverse-engineering of the underlying protocols revealed static 32 bit identifiers and that messages can be easily triggered remotely, which raises privacy concerns as vehicles can be tracked through these identifiers. Further, current protocols do not employ authentication and vehicle implementations do not perform basic input validation, thereby allowing for remote spoofing of sensor messages. We validated this experimentally by triggering tire pressure warning messages in a moving vehicle from a customized software radio attack platform located in a nearby vehicle. Finally, the paper concludes with a set of recommendations for improving the privacy and security of tire pressure monitoring systems and other forthcoming in-car wireless sensor networks.", "citation": "Citations (303)", "year": "2010", "departments": ["University of South Carolina", "Rutgers University", "University of South Carolina", "University of South Carolina", "Rutgers University"], "conf": "uss", "authors": ["Ishtiaq Rouf.....http://dblp.org/pers/hd/r/Rouf:Ishtiaq", "Robert D. Miller.....http://dblp.org/pers/hd/m/Miller:Robert_D=", "Hossen A. Mustafa.....http://dblp.org/pers/hd/m/Mustafa:Hossen_A=", "Travis Taylor.....http://dblp.org/pers/hd/t/Taylor:Travis", "Sangho Oh.....http://dblp.org/pers/hd/o/Oh:Sangho", "Wenyuan Xu.....http://dblp.org/pers/hd/x/Xu:Wenyuan", "Marco Gruteser.....http://dblp.org/pers/hd/g/Gruteser:Marco", "Wade Trappe.....http://dblp.org/pers/hd/t/Trappe:Wade", "Ivan Seskar.....http://dblp.org/pers/hd/s/Seskar:Ivan"], "pages": 16}