{"title": "Locating mapped resources in Web 2.0.", "fields": ["search engine indexing", "mashup", "context model", "web resource", "web 2 0"], "abstract": "Mapping mashups are emerging Web 2.0 applications in which data objects such as blogs, photos and videos from different sources are combined and marked in a map using APIs that are released by online mapping solutions such as Google and Yahoo Maps. These objects are typically associated with a set of tags capturing the embedded semantic and a set of coordinates indicating their geographical locations. Traditional web resource searching strategies are not effective in such an environment due to the lack of the gazetteer context in the tags. Instead, a better alternative approach is to locate an object by tag matching. However, the number of tags associated with each object is typically small, making it difficult for an object to capture the complete semantics in the query objects. In this paper, we focus on the fundamental application of locating geographical resources and propose an efficient tag-centric query processing strategy. In particular, we aim to find a set of nearest co-located objects which together match the query tags. Given the fact that there could be large number of data objects and tags, we develop an efficient search algorithm that can scale up in terms of the number of objects and tags. Further, to ensure that the results are relevant, we also propose a geographical context sensitive geo-tf-idf ranking mechanism. Our experiments on synthetic data sets demonstrate its scalability while the experiments using the real life data set confirm its practicality.", "citation": "Citations (136)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Dongxiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Dongxiang", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H="], "conf": "icde", "year": "2010", "pages": 12}