{"title": "Scalable NIDS via Negative Pattern Matching and Exclusive Pattern Matching.", "fields": ["concurrent computing", "content addressable memory", "pattern matching", "speedup", "scalable parallelism"], "abstract": "In this paper, we identify the unique challenges in deploying parallelism on TCAM-based pattern matching for Network Intrusion Detection Systems (NIDSes). We resolve two critical issues when designing scalable parallelism specifically for pattern matching modules: 1) how to enable fine-grained parallelism in pursuit of effective load balancing and desirable speedup simultaneously; and 2) how to reconcile the tension between parallel processing speedup and prohibitive TCAM power consumption. To this end, we first propose the novel concept of Negative Pattern Matching to partition flows, by which the number of TCAM lookups can be significantly reduced, and the resulting (fine-grained) flow segments can be inspected in parallel without incurring false negatives. Then we propose the notion of Exclusive Pattern Matching to divide the entire pattern set into multiple subsets which can later be matched against selectively and independently without affecting the correctness. We show that Exclusive Pattern Matching enables the adoption of smaller and faster TCAM blocks and improves both the pattern matching speed and scalability. Finally, our theoretical and experimental results validate that the above two concepts are inherently complementary, enabling our integrated scheme to provide performance gain in any scenario (with either clean or dirty traffic).", "citation": "Citations (4)", "departments": ["IBM", "Carnegie Mellon University", "National University of Defense Technology", "Hong Kong Polytechnic University", "IBM"], "authors": ["Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0003:Kai", "Xin Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Xin", "Zhiping Cai.....http://dblp.org/pers/hd/c/Cai:Zhiping", "Zhijun Wang.....http://dblp.org/pers/hd/w/Wang_0001:Zhijun", "Baohua Yang.....http://dblp.org/pers/hd/y/Yang:Baohua"], "conf": "infocom", "year": "2010", "pages": 9}