{"title": "Geotagging with local lexicons to build indexes for textually-specified spatial data.", "fields": ["lexicon", "spatial database", "ambiguity", "geotagging", "domain of discourse"], "abstract": "The successful execution of location-based and feature-based queries on spatial databases requires the construction of spatial indexes on the spatial attributes. This is not simple when the data is unstructured as is the case when the data is a collection of documents such as news articles, which is the domain of discourse, where the spatial attribute consists of text that can be (but is not required to be) interpreted as the names of locations. In other words, spatial data is specified using text (known as a toponym) instead of geometry, which means that there is some ambiguity involved. The process of identifying and disambiguating references to geographic locations is known as geotagging and involves using a combination of internal document structure and external knowledge, including a document-independent model of the audience's vocabulary of geographic locations, termed its spatial lexicon. In contrast to previous work, a new spatial lexicon model is presented that distinguishes between a global lexicon of locations known to all audiences, and an audience-specific local lexicon. Generic methods for inferring audiences' local lexicons are described. Evaluations of this inference method and the overall geotagging procedure indicate that establishing local lexicons cannot be overlooked, especially given the increasing prevalence of highly local data sources on the Internet, and will enable the construction of more accurate spatial indexes.", "citation": "Citations (118)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Michael D. Lieberman.....http://dblp.org/pers/hd/l/Lieberman:Michael_D=", "Hanan Samet.....http://dblp.org/pers/hd/s/Samet:Hanan", "Jagan Sankaranarayanan.....http://dblp.org/pers/hd/s/Sankaranarayanan:Jagan"], "conf": "icde", "year": "2010", "pages": 12}