{"title": "Routing and Scheduling for Energy and Delay Minimization in the Powerdown Model.", "fields": ["network packet", "maximum power principle", "network delay", "end to end delay", "job shop scheduling", "network element", "static routing"], "abstract": "Energy conservation is drawing increasing attention in data networking. As networks are designed for peak traffic, network elements typically operate at full speed and consume maximum power even when carrying low traffic. One school of thought believes that a dominant amount of power saving comes from turning off network elements. The difficulty is that transitioning between the active and sleeping modes consumes considerable energy and time. This results in an obvious trade-off between saving energy and provisioning performance guarantees such as end-to-end delays. We study the following routing and scheduling problem in a network in which each network element either operates in the full-rate active mode or the zero-rate sleeping mode. For a given network and traffic matrix, routing determines the path that each traffic stream traverses. For frame-based periodic scheduling, a schedule determines the active period per element within each frame and prioritizes packets within each active period. For a line topology, we present a schedule with close-to-minimum delay for a minimum active period per element. For an arbitrary topology, we partition the network into a collection of lines and use the near-optimal schedule along each line. Additional delay is incurred only when a path switches from one line to another. By minimizing the number of switchings via routing, we show a logarithmic approximation for both power consumption and end-to-end delays. If routing is given as input, we present two schedules one of which has active period proportional to the traffic load per network element, and the other has active period proportional to the maximum load over all elements. The end-to-end delay of the latter is much improved compared to the delay for the former. This demonstrates the trade-off between power and delay. Finally, we provide simulation results to validate our algorithmic approaches. © 2012 Wiley Periodicals, Inc. NETWORKS, 2013", "citation": "Citations (54)", "departments": ["Bell Labs", "IMDEA Networks", "Bell Labs", "University of California, San Diego", "Bell Labs", "Bell Labs", "University of California, San Diego", "U. Rey Juan Car ...  Madrid, Spain"], "authors": ["Matthew Andrews.....http://dblp.org/pers/hd/a/Andrews:Matthew", "Antonio Fernández.....http://dblp.org/pers/hd/f/Fern=aacute=ndez_0001:Antonio", "Lisa Zhang.....http://dblp.org/pers/hd/z/Zhang:Lisa", "Wenbo Zhao.....http://dblp.org/pers/hd/z/Zhao:Wenbo"], "conf": "infocom", "year": "2010", "pages": 5}