{"title": "A 3d data intensive tele-immersive grid.", "fields": ["immersion", "3d modeling", "terrain rendering", "grid", "body language"], "abstract": "Networked virtual environments like Second Life enable distant people to meet for leisure as well as work. But users are represented through avatars controlled by keyboards and mouses, leading to a low sense of presence especially regarding body language. Multi-camera real-time 3D modeling offers a way to ensure a significantly higher sense of presence. But producing quality geometries, well textured, and to enable distant user tele-presence in non trivial virtual environments is still a challenge today.   In this paper we present a tele-immersive system based on multi-camera 3D modeling. Users from distant sites are immersed in a rich virtual environment served by a parallel terrain rendering engine. Distant users, present through their 3D model, can perform some local interactions while having a strong visual presence. We experimented our system between three large cities a few hundreds kilometers apart from each other. This work demonstrate the feasibility of a rich 3D multimedia environment ensuring users a strong sense of presence.", "citation": "Citations (6)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "University of Orléans", "French Institute for Research in Computer Science and Automation"], "authors": ["Benjamin Petit.....http://dblp.org/pers/hd/p/Petit:Benjamin", "Thomas Dupeux.....http://dblp.org/pers/hd/d/Dupeux:Thomas", "Benoît Bossavit.....http://dblp.org/pers/hd/b/Bossavit:Beno=icirc=t", "Joeffrey Legaux.....http://dblp.org/pers/hd/l/Legaux:Joeffrey", "Bruno Raffin.....http://dblp.org/pers/hd/r/Raffin:Bruno", "Emmanuel Melin.....http://dblp.org/pers/hd/m/Melin:Emmanuel", "Jean-Sébastien Franco.....http://dblp.org/pers/hd/f/Franco:Jean=S=eacute=bastien", "Ingo Assenmacher.....http://dblp.org/pers/hd/a/Assenmacher:Ingo", "Edmond Boyer.....http://dblp.org/pers/hd/b/Boyer:Edmond"], "conf": "mm", "year": "2010", "pages": 4}