{"title": "ARISTA - image search to annotation on billions of web photos.", "fields": ["search engine indexing", "image retrieval", "ground truth", "annotation", "automatic image annotation"], "abstract": "Though it has cost great research efforts for decades, object recognition is still a challenging problem. Traditional methods based on machine learning or computer vision are still in the stage of tackling hundreds of object categories. In recent years, non-parametric approaches have demonstrated great success, which understand the content of an image by propagating labels of its similar images in a large-scale dataset. However, due to the limited dataset size and imperfect image crawling strategy, previous work can only address a biased small subset of image concepts. Here we introduce the Arista project, which aims to build a practical image annotation engine targeting at popular concepts in the real world. In this project, we are particularly interested in understanding how many image concepts can be addressed by the data-driven annotation approach (coverage) and how good the performance is (precision). This paper reports the first stage of the work. Two billions web images were indexed, and based on simple yet effective near-duplicate detection, the system is capable of automatically generating accurate tags for popular web images having near-duplicates in the database. We found that about 8.1% web images have more than ten near duplicate and the number increases to 28.5% for top images in search results. Further, based on random samples in the latter case, we observed the precision of 57.9% at the point of the highest recall of 28% on ground truth tags.", "citation": "Citations (120)", "year": "2010", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "cvpr", "authors": ["Xin-Jing Wang.....http://dblp.org/pers/hd/w/Wang:Xin=Jing", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Lei", "Ming Liu.....http://dblp.org/pers/hd/l/Liu:Ming", "Yi Li.....http://dblp.org/pers/hd/l/Li:Yi", "Wei-Ying Ma.....http://dblp.org/pers/hd/m/Ma:Wei=Ying"], "pages": 8}