{"title": "Panache: A Parallel File System Cache for Global File Access.", "fields": ["clustered file system", "file system fragmentation", "unix file types", "self certifying file system", "ssh file transfer protocol"], "abstract": "Cloud computing promises large-scale and seamless access to vast quantities of data across the globe. Applications will demand the reliability, consistency, and performance of a traditional cluster file system regardless of the physical distance between data centers.\n\nPanache is a scalable, high-performance, clustered file system cache for parallel data-intensive applications that require wide area file access. Panache is the first file system cache to exploit parallelism in every aspect of its design--parallel applications can access and update the cache from multiple nodes while data and metadata is pulled into and pushed out of the cache in parallel. Data is cached and updated using pNFS, which performs parallel I/O between clients and servers, eliminating the single-server bottleneck of vanilla client-server file access protocols. Furthermore, Panache shields applications from fluctuating WAN latencies and outages and is easy to deploy as it relies on open standards for high-performance file serving and does not require any proprietary hardware or software to be installed at the remote cluster.\n\nIn this paper, we present the overall design and implementation of Panache and evaluate its key features with multiple workloads across local and wide area networks.", "citation": "Citations (41)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Marc Eshel.....http://dblp.org/pers/hd/e/Eshel:Marc", "Roger L. Haskin.....http://dblp.org/pers/hd/h/Haskin:Roger_L=", "Dean Hildebrand.....http://dblp.org/pers/hd/h/Hildebrand:Dean", "Manoj Naik.....http://dblp.org/pers/hd/n/Naik:Manoj", "Frank B. Schmuck.....http://dblp.org/pers/hd/s/Schmuck:Frank_B=", "Renu Tewari.....http://dblp.org/pers/hd/t/Tewari:Renu"], "conf": "fast", "year": "2010", "pages": 14}