{"title": "Accelerating Parallel Analysis of Scientific Simulation Data via Zazen.", "fields": ["computer cluster", "bottleneck", "cache", "disk buffer", "gigabyte"], "abstract": "As a new generation of parallel supercomputers enables researchers to conduct scientific simulations of unprecedented scale and resolution, terabyte-scale simulation output has become increasingly commonplace. Analysis of such massive data sets is typically I/O-bound: many parallel analysis programs spend most of their execution time reading data from disk rather than performing useful computation. To overcome this I/O bottleneck, we have developed a new data access method. Our main idea is to cache a copy of simulation output files on the local disks of an analysis cluster's compute nodes, and to use a novel task-assignment protocol to co-locate data access with computation. We have implemented our methodology in a parallel disk cache system called Zazen. By avoiding the overhead associated with querying metadata servers and by reading data in parallel from local disks, Zazen is able to deliver a sustained read bandwidth of over 20 gigabytes per second on a commodity Linux cluster with 100 nodes, approaching the optimal aggregated I/O bandwidth attainable on these nodes. Compared with conventional NFS, PVFS2, and Hadoop/HDFS, respectively, Zazen is 75, 18, and 6 times faster for accessing large (1-GB) files, and 25, 13, and 85 times faster for accessing small (2-MB) files. We have deployed Zazen in conjunction with Anton--a special-purpose supercomputer that dramatically accelerates molecular dynamics (MD) simulations-- and have been able to accelerate the parallel analysis of terabyte-scale MD trajectories by about an order of magnitude.", "citation": "Citations (18)", "departments": ["D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research", "D. E. Shaw Research"], "authors": ["Tiankai Tu.....http://dblp.org/pers/hd/t/Tu:Tiankai", "Charles A. Rendleman.....http://dblp.org/pers/hd/r/Rendleman:Charles_A=", "Patrick J. Miller.....http://dblp.org/pers/hd/m/Miller:Patrick_J=", "Federico D. Sacerdoti.....http://dblp.org/pers/hd/s/Sacerdoti:Federico_D=", "Ron O. Dror.....http://dblp.org/pers/hd/d/Dror:Ron_O=", "David E. Shaw.....http://dblp.org/pers/hd/s/Shaw:David_E="], "conf": "fast", "year": "2010", "pages": 14}