{"title": "Session Based Click Features for Recency Ranking.", "fields": ["ranking", "online search", "marketing buzz", "web search query", "click through rate"], "abstract": "Recency ranking refers to the ranking of web results by accounting for both relevance and freshness. This is particularly important for \"recency sensitive\" queries such as breaking news queries. In this study, we propose a set of novel click features to improve machine learned recency ranking. Rather than computing simple aggregate click through rates, we derive these features using the temporal click through data and query reformulation chains. One of the features that we use is click buzz that captures the spiking interest of a url for a query. We also propose time weighted click through rates which treat recent observations as being exponentially more important. The promotion of fresh content is typically determined by the query intent which can change dynamically over time. Quite often users query reformulations convey clues about the query's intent. Hence we enrich our click features by following query reformulations which typically benefit the first query in the chain of reformulations. Our experiments show these novel features can improve the NDCG5 of a major online search engine's ranking for \"recency sensitive\" queries by up to 1.57%. This is one of the very few studies that exploits temporal click through data and query reformulations for recency ranking.", "citation": "Citations (38)", "departments": ["Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!"], "authors": ["Yoshiyuki Inagaki.....http://dblp.org/pers/hd/i/Inagaki:Yoshiyuki", "Narayanan Sadagopan.....http://dblp.org/pers/hd/s/Sadagopan:Narayanan", "Georges Dupret.....http://dblp.org/pers/hd/d/Dupret:Georges", "Anlei Dong.....http://dblp.org/pers/hd/d/Dong:Anlei", "Ciya Liao.....http://dblp.org/pers/hd/l/Liao:Ciya", "Yi Chang.....http://dblp.org/pers/hd/c/Chang:Yi", "Zhaohui Zheng.....http://dblp.org/pers/hd/z/Zheng:Zhaohui"], "conf": "aaai", "year": "2010", "pages": -1}