{"title": "Reverse top-k queries.", "fields": ["online aggregation", "web query classification", "sargable", "web search query", "spatial query"], "abstract": "Rank-aware query processing has become essential for many applications that return to the user only the top-k objects based on the individual user's preferences. Top-k queries have been mainly studied from the perspective of the user, focusing primarily on efficient query processing. In this work, for the first time, we study top-k queries from the perspective of the product manufacturer. Given a potential product, which are the user preferences for which this product is in the top-k query result set? We identify a novel query type, namely reverse top-k query, that is essential for manufacturers to assess the potential market and impact of their products based on the competition. We formally define reverse top-k queries and introduce two versions of the query, namely monochromatic and bichromatic. We first provide a geometric interpretation of the monochromatic reverse top-k query in the solution space that helps to understand the reverse top-k query conceptually. Then, we study in more details the case of bichromatic reverse top-k query, which is more interesting for practical applications. Such a query, if computed in a straightforward manner, requires evaluating a top-k query for each user preference in the database, which is prohibitively expensive even for moderate datasets. In this paper, we present an efficient threshold-based algorithm that eliminates candidate user preferences, without processing the respective top-k queries. Furthermore, we introduce an indexing structure based on materialized reverse top-k views in order to speed up the computation of reverse top-k queries. Materialized reverse top-k views trade preprocessing cost for query speed up in a controllable manner. Our experimental evaluation demonstrates the efficiency of our techniques, which reduce the required number of top-k computations by 1 to 3 orders of magnitude.", "citation": "Citations (137)", "departments": ["Norwegian University of Science and Technology", "Norwegian University of Science and Technology", "Norwegian University of Science and Technology", "Department of I ...  Athens, Greece"], "authors": ["Akrivi Vlachou.....http://dblp.org/pers/hd/v/Vlachou:Akrivi", "Christos Doulkeridis.....http://dblp.org/pers/hd/d/Doulkeridis:Christos", "Yannis Kotidis.....http://dblp.org/pers/hd/k/Kotidis:Yannis", "Kjetil Nørvåg.....http://dblp.org/pers/hd/n/N=oslash=rv=aring=g:Kjetil"], "conf": "icde", "year": "2010", "pages": 12}