{"title": "Visual tracking via weakly supervised learning from multiple imperfect oracles.", "fields": ["heuristic", "ground truth", "bittorrent tracker", "probabilistic logic", "eye tracking"], "abstract": "Long-term persistent tracking in ever-changing environments is a challenging task, which often requires addressing difficult object appearance update problems. To solve them, most top-performing methods rely on online learning-based algorithms. Unfortunately, one inherent problem of online learning-based trackers is drift, a gradual adaptation of the tracker to non-targets. To alleviate this problem, we consider visual tracking in a novel weakly supervised learning scenario where (possibly noisy) labels but no ground truth are provided by multiple imperfect oracles (i.e., trackers), some of which may be mediocre. A probabilistic approach is proposed to simultaneously infer the most likely object position and the accuracy of each tracker. Moreover, an online evaluation strategy of trackers and a heuristic training data selection scheme are adopted to make the inference more effective and fast. Consequently, the proposed method can avoid the pitfalls of purely single tracking approaches and get reliable labeled samples to incrementally update each tracker (if it is an appearance-adaptive tracker) to capture the appearance changes. Extensive comparing experiments on challenging video sequences demonstrate the robustness and effectiveness of the proposed method.", "citation": "Citations (88)", "year": "2010", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "National University of Singapore"], "conf": "cvpr", "authors": ["Bineng Zhong.....http://dblp.org/pers/hd/z/Zhong:Bineng", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Sheng Chen.....http://dblp.org/pers/hd/c/Chen_0007:Sheng", "Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Xiaotong Yuan.....http://dblp.org/pers/hd/y/Yuan:Xiaotong", "Shaohui Liu.....http://dblp.org/pers/hd/l/Liu:Shaohui", "Wen Gao.....http://dblp.org/pers/hd/g/Gao_0001:Wen"], "pages": 8}