{"title": "Improving QoS in BitTorrent-like VoD Systems.", "fields": ["load balancing", "load management", "server", "queueing theory", "bittorrent"], "abstract": "In recent years a number of research efforts have focused on effective use of P2P-based systems in providing large scale video streaming services. In particular, live streaming and Video-on-Demand (VoD) systems have attracted much interest. While previous efforts mainly focused on the common challenges faced by both types of applications, there are still a number of fundamental open questions in designing P2P-based VoD systems, which is the focus of our effort. Specifically, in this paper, we consider a BitTorrent-like VoD system and focus on the following questions: (1) how the lack of load balance, which typically exists in a P2P- based VoD system, affects the performance and what steps can be taken to remedy that, and (2) is a FCFS approach to serving requests at a peer sufficient or whether a Deadline-Aware Scheduling (DAS) approach can lead to performance improvements. Given the deadline considerations that exist in VoD systems, we also investigate approaches to avoiding unnecessary queueing time. For each of these questions, we first illustrate deficiencies of current approaches in adequately meeting streaming quality of service requirements. Motivated by this, we propose several practical schemes aimed at addressing these questions. To illustrate the benefits of our approach, we present an extensive simulation-based performance study.", "citation": "Citations (98)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "Harvard University"], "authors": ["Yan Yang.....http://dblp.org/pers/hd/y/Yang:Yan", "Alix L. H. Chow.....http://dblp.org/pers/hd/c/Chow:Alix_L=_H=", "Leana Golubchik.....http://dblp.org/pers/hd/g/Golubchik:Leana", "Danielle Bragg.....http://dblp.org/pers/hd/b/Bragg:Danielle"], "conf": "infocom", "year": "2010", "pages": 9}