{"title": "Markov Approximation for Combinatorial Network Optimization.", "fields": ["variable order markov model", "approximation algorithm", "markov algorithm", "randomized rounding", "markov model"], "abstract": "Many important network design problems can be formulated as a combinatorial optimization problem. A large number of such problems, however, cannot readily be tackled by distributed algorithms. The Markov approximation framework studied in this paper is a general technique for synthesizing distributed algorithms. We show that when using the log-sum-exp function to approximate the optimal value of any combinatorial problem, we end up with a solution that can be interpreted as the stationary probability distribution of a class of time- reversible Markov chains. Certain carefully designed Markov chains among this class yield distributed algorithms that solve the log-sum-exp approximated combinatorial network optimization problem. By three case studies, we illustrate that Markov approximation technique not only can provide fresh perspective to existing distributed solutions, but also can help us generate new distributed algorithms in various domains with provable performance. We believe the Markov approximation framework will find applications in many network optimization problems, and this paper serves as a call for participation.", "citation": "Citations (139)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Soung Chang Liew.....http://dblp.org/pers/hd/l/Liew:Soung_Chang", "Ziyu Shao.....http://dblp.org/pers/hd/s/Shao:Ziyu", "Caihong Kai.....http://dblp.org/pers/hd/k/Kai:Caihong"], "conf": "infocom", "year": "2010", "pages": 9}