{"title": "ZKPDL: A Language-Based System for Efficient Zero-Knowledge Proofs and Electronic Cash.", "fields": ["proof of knowledge", "electronic cash", "information retrieval", "zero knowledge proof", "computer science", "interpreter", "ecash", "programmer", "mathematical proof"], "abstract": "In recent years, many advances have been made in cryptography, as well as in the performance of communication networks and processors. As a result, many advanced cryptographic protocols are now efficient enough to be considered practical, yet research in the area remains largely theoretical and little work has been done to use these protocols in practice, despite a wealth of potential applications.\n\nThis paper introduces a simple description language, ZKPDL, and an interpreter for this language. ZKPDL implements non-interactive zero-knowledge proofs of knowledge, a primitive which has received much attention in recent years. Using our language, a single program may specify the computation required by both the prover and verifier of a zero-knowledge protocol, while our interpreter performs a number of optimizations to lower both computational and space overhead.\n\nOur motivating application for ZKPDL has been the efficient implementation of electronic cash. As such, we have used our language to develop a cryptographic library, Cashlib, that provides an interface for using ecash and fair exchange protocols without requiring expert knowledge from the programmer.", "citation": "Not cited", "year": "2010", "departments": ["University of California, San Diego", "Brown University", "Brown University", "University of Wisconsin-Madison", "Brown University"], "conf": "uss", "authors": ["Sarah Meiklejohn.....http://dblp.org/pers/hd/m/Meiklejohn:Sarah", "C. Christopher Erway.....http://dblp.org/pers/hd/e/Erway:C=_Christopher", "Alptekin Küpçü.....http://dblp.org/pers/hd/k/K=uuml=p=ccedil==uuml=:Alptekin", "Theodora Hinkle.....http://dblp.org/pers/hd/h/Hinkle:Theodora", "Anna Lysyanskaya.....http://dblp.org/pers/hd/l/Lysyanskaya:Anna"], "pages": 14}