{"title": "Requirements and design space for interactive public displays.", "fields": ["digital content", "interactive media", "user experience design", "immersion", "modalities"], "abstract": "Digital immersion is moving into public space. Interactive screens and public displays are deployed in urban environments, malls, and shop windows. Inner city areas, airports, train stations and stadiums are experiencing a transformation from traditional to digital displays enabling new forms of multimedia presentation and new user experiences. Imagine a walkway with digital displays that allows a user to immerse herself in her favorite content while moving through public space. In this paper we discuss the fundamentals for creating exciting public displays and multimedia experiences enabling new forms of engagement with digital content. Interaction in public space and with public displays can be categorized in phases, each having specific requirements. Attracting, engaging and motivating the user are central design issues that are addressed in this paper. We provide a comprehensive analysis of the design space explaining mental models and interaction modalities and we conclude a taxonomy for interactive public display from this analysis. Our analysis and the taxonomy are grounded in a large number of research projects, art installations and experience. With our contribution we aim at providing a comprehensive guide for designers and developers of interactive multimedia on public displays.", "citation": "Citations (329)", "departments": ["Deutsche Telekom", "University of Duisburg-Essen", "University of Duisburg-Essen", "Anhalt Universi ... rnburg, Germany"], "authors": ["Jörg Müller.....http://dblp.org/pers/hd/m/M=uuml=ller_0001:J=ouml=rg", "Florian Alt.....http://dblp.org/pers/hd/a/Alt:Florian", "Daniel Michelis.....http://dblp.org/pers/hd/m/Michelis:Daniel", "Albrecht Schmidt.....http://dblp.org/pers/hd/s/Schmidt_0001:Albrecht"], "conf": "mm", "year": "2010", "pages": 10}