{"title": "Estimating optical properties of layered surfaces using the spider model.", "fields": ["nonlinear optics", "rgb color space", "light scattering", "color space", "real image"], "abstract": "Many object surfaces are composed of layers of different physical substances, known as layered surfaces. These surfaces, such as patinas, water colors, and wall paintings, have more complex optical properties than diffuse surfaces. Although the characteristics of layered surfaces, like layer opacity, mixture of colors, and color gradations, are significant, they are usually ignored in the analysis of many methods in computer vision, causing inaccurate or even erroneous results. Therefore, the main goals of this paper are twofold: to solve problems of layered surfaces by focusing mainly on surfaces with two layers (i.e., top and bottom layers), and to introduce a decomposition method based on a novel representation of a nonlinear correlation in the color space that we call the “spider” model. When we plot a mixture of colors of one bottom layer and n different top layers into the RGB color space, then we will have n different curves intersecting at one point, resembling the shape of a spider. Hence, given a single input image containing one bottom layer and at least one top layer, we can fit their color distributions by using the spider model and then decompose those layered surfaces. The last step is equivalent to extracting the approximated optical properties of the two layers: the top layer's opacity, and the top and bottom layers' reflections. Experiments with real images, which include the photographs of ancient wall paintings, show the effectiveness of our method.", "citation": "Citations (5)", "year": "2010", "departments": ["Utrecht University", "University of Tokyo", "University of Tokyo", "Information Tec ... inting Co., Ltd"], "conf": "cvpr", "authors": ["Tetsuro Morimoto.....http://dblp.org/pers/hd/m/Morimoto:Tetsuro", "Robby T. Tan.....http://dblp.org/pers/hd/t/Tan:Robby_T=", "Rei Kawakami.....http://dblp.org/pers/hd/k/Kawakami:Rei", "Katsushi Ikeuchi.....http://dblp.org/pers/hd/i/Ikeuchi:Katsushi"], "pages": 8}