{"title": "Cooperative Boundary Detection for Spectrum Sensing Using Dedicated Wireless Sensor Networks.", "fields": ["cognitive radio", "algorithm design", "detection theory", "transmitter", "sensor fusion"], "abstract": "Spectrum sensing is one of the key enabling technologies in Cognitive Radio Networks (CRNs). In CRNs, secondary users (SUs) are allowed to exploit the spectrum opportunities by sensing and accessing the spectrum, which exhibit many critical limitations in practical environments. In this paper, we propose a new sensing service model that uses dedicated wireless spectrum sensor networks (WSSN) for spectrum sensing. The major challenge in WSSN is the design of data fusion, for which the traditional fusion scheme will produce a large amount of errors. We formulate the problem as a boundary detection problem with notable unknown erroneous inputs. To solve the problem, we propose a novel cooperative boundary detection scheme that intelligently incorporates the cooperative spectrum sensing concept and the recent advances in support vector machine (SVM). Cooperative boundary detection consists of two major components, a declaration calibration algorithm and a boundary derivation algorithm. We prove that cooperative spectrum sensing can asymptotically approach the optimal solution. A prototype system as well as simulation experiments show that compared with the traditional approaches, cooperative boundary detection can reduce the errors by up to 95% with an average reduction about 85%.", "citation": "Citations (24)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Yanyan Yang.....http://dblp.org/pers/hd/y/Yang:Yanyan", "Yunhuai Liu.....http://dblp.org/pers/hd/l/Liu:Yunhuai", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "infocom", "year": "2010", "pages": 9}