{"title": "Joint Power and Secret Key Queue Management for Delay Limited Secure Communication.", "fields": ["queue", "information theoretic security", "secure communication", "fading", "queue management system"], "abstract": "In recent years, the famous wiretap channel has been revisited by many researchers and information theoretic secrecy has become an active area of research in this setting. In this paper, we design a wireless communication system that achieves constant bit rate data transmission over a block fading channel, securely from an eavesdropper that listens to the transmitter over another independent block fading channel. It is well known that, the method of sending secure information using the binning techniques inspired by the wiretap channel fails to secure the information at times when the eavesdropper channel has favorable conditions over the main channel. This phenomenon is called secrecy outage. In our system, however, we exploit the times at which the main channel is favorable over the eavesdropper channel for us to be able to transmit some random secret key bits along with the data bits. These key bits are stored in a separate key queue at the transmitter as well as the receiver, and are utilized to secure data bits, whenever the channel conditions favor the eavesdropper. We show that, our system achieves a high performance at any given desired outage probability by jointly controlling the key queue and the transmit power. We show that the optimal power control involves a time sharing between secure waterfilling and channel inversion strategies and the key queue operates in the heavy traffic regime to achieve the maximum delay limited rate possible, under a small outage constraint. This work can be viewed as a first step in providing a framework that combines both information theory and queueing analysis for the study of information theoretic security.", "citation": "Citations (17)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Onur Güngör.....http://dblp.org/pers/hd/g/G=uuml=ng=ouml=r_0002:Onur", "Jian Tan.....http://dblp.org/pers/hd/t/Tan:Jian", "Can Emre Koksal.....http://dblp.org/pers/hd/k/Koksal:Can_Emre", "Hesham El Gamal.....http://dblp.org/pers/hd/g/Gamal:Hesham_El", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2010", "pages": 9}