{"title": "Pressure Routing for Underwater Sensor Networks.", "fields": ["underwater", "swarm behaviour", "anycast", "fading", "co channel interference"], "abstract": "A SEA Swarm (Sensor Equipped Aquatic Swarm) is a sensor \"cloud\" that drifts with water currents and enables 4D (space and time) monitoring of local underwater events such as contaminants, marine life and intruders. The swarm is escorted at the surface by drifting sonobuoys that collect the data from underwater sensors via acoustic modems and report it in real-time via radio to a monitoring center. The goal of this study is to design an efficient anycast routing algorithm for reliable underwater sensor event reporting to any one of the surface sonobuoys. Major challenges are the ocean current and the limited resources (bandwidth and energy). In this paper, we address these challenges and propose HydroCast, a hydraulic pressure based anycast routing protocol that exploits the measured pressure levels to route data to surface buoys. The paper makes the following contributions: a novel opportunistic routing mechanism to select the subset of forwarders that maximizes greedy progress yet limiting co-channel interference; and an efficient underwater \"dead end\" recovery method that outperforms recently proposed approaches. The proposed routing protocols are validated via extensive simulations.", "citation": "Citations (230)", "departments": ["Bell Labs", "University of California, Los Angeles", "University of California, Los Angeles", "Universidade Federal de Minas Gerais", "University of California, Los Angeles"], "authors": ["Uichin Lee.....http://dblp.org/pers/hd/l/Lee:Uichin", "Paul Wang.....http://dblp.org/pers/hd/w/Wang:Paul", "Youngtae Noh.....http://dblp.org/pers/hd/n/Noh:Youngtae", "Luiz Filipe M. Vieira.....http://dblp.org/pers/hd/v/Vieira:Luiz_Filipe_M=", "Mario Gerla.....http://dblp.org/pers/hd/g/Gerla:Mario", "Jun-Hong Cui.....http://dblp.org/pers/hd/c/Cui:Jun=Hong"], "conf": "infocom", "year": "2010", "pages": 9}