{"title": "Multicast Scheduling with Cooperation and Network Coding in Cognitive Radio Networks.", "fields": ["distance vector multicast routing protocol", "xcast", "inter domain", "pragmatic general multicast", "reliable multicast"], "abstract": "Cognitive Radio Networks (CRNs) have recently emerged as a promising technology to improve spectrum utilization by allowing secondary users to dynamically access idle primary channels. As progress are made and computationally powerful wireless devices are proliferated, there is a compelling need of enabling multicast services for secondary users. Thus, it is crucial to design an efficient multicast scheduling protocol in CRNs. However, state-of-the-art multicast scheduling protocols are not well designed for CRNs. First, due to primary channel dynamics and user mobility, there may not exist commonly available channels for secondary users, which inevitably makes the multicast scheduling infeasible. Second, the potential benefits provided by user and channel diversities are overlooked, which leads to under-utilization of the scarce wireless bandwidth. In this paper, we present an optimization framework for multicast scheduling in CRNs, by fully embracing its characteristics. In this framework, base station multicasts data to a subset of secondary users first by carefully tuning the power. Concurrently, secondary users opportunistically perform cooperative transmissions using locally idle primary channels, in order to mitigate multicast loss and delay effects. Network coding is adopted during the transmissions to reduce overhead and perform error control and recovery. We jointly consider important design factors in our scheduling protocols, including power control, relay assignment, buffer management, dynamic spectrum access, primary user protection, and fairness. We also incorporate user, channel, and cooperative diversities. Two forms of multicast scheduling protocols in CRNs are proposed accordingly: (i) a greedy protocol based on centralized optimization; (ii) an online protocol based on stochastic optimization in both centralized and decentralized manners. With rigorous analysis based on Lyapunov optimization, we provide closed-form bounds to characterize the performance of our protocols, in terms of the interference to primary users and throughput utility of secondary users. With extensive simulations, we show that our proposed protocols can significantly improve the multicast performance in CRNs.", "citation": "Citations (61)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Jin Jin.....http://dblp.org/pers/hd/j/Jin_0001:Jin", "Hong Xu.....http://dblp.org/pers/hd/x/Xu_0001:Hong", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun"], "conf": "infocom", "year": "2010", "pages": 9}