{"title": "Fast feature selection and training for AdaBoost-based concept detection with large scale datasets.", "fields": ["locality sensitive hashing", "feasible region", "random projection", "adaboost", "nearest neighbor search"], "abstract": "AdaBoost has been proved a successful statistical learning method for concept detection with high performance of discrimination and generalization. However, it is computationally expensive to train a concept detector using boosting, especially on large scale datasets. The bottleneck of training phase is to select the best learner among massive learners. Traditional approaches for selecting a weak classifier usually run in O(NT), with N examples and T learners. In this paper, we treat the best learner selection as a Nearest Neighbor Search problem in the function space instead of feature space. With the help of Locality Sensitive Hashing (LSH) algorithm, the best learner searching procedure can be speeded up in the time of O(NL), where L is the number of buckets in LSH. Compared with the T (~500,000), the L (~600) is much smaller in our experiments. In addition, through studying the distribution of weak learners and candidate query points, we present an efficient method to try to partition the weak learner points and the feasible region of query points uniformly as much as possible, which can achieve significant improvement in both recall and precision compared with the random projection in traditional LSH algorithm. Experimental results reveal our method can significantly reduce the training time. And still the performance of our method is comparable with the state-of-art methods.", "citation": "Citations (6)", "departments": ["National Lab of ...  Beijing, China", "National Lab of ...  Beijing, China", "National Lab of ...  Beijing, China", "National Lab of ...  Beijing, China", "National Lab of ...  Beijing, China"], "authors": ["Shi Chen.....http://dblp.org/pers/hd/c/Chen:Shi", "Jinqiao Wang.....http://dblp.org/pers/hd/w/Wang:Jinqiao", "Yang Liu.....http://dblp.org/pers/hd/l/Liu_0021:Yang", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng", "Hanqing Lu.....http://dblp.org/pers/hd/l/Lu:Hanqing"], "conf": "mm", "year": "2010", "pages": 4}