{"title": "Source-Location Privacy through Dynamic Routing in Wireless Sensor Networks.", "fields": ["information privacy", "sink", "geographic routing", "event monitoring", "key distribution in wireless sensor networks"], "abstract": "Wireless sensor networks (WSNs) have the potential to be widely used in many areas for unattended event monitoring. Mainly due to lack of a protected physical boundary, wireless communications are vulnerable to unauthorized interception and detection. Privacy is becoming one of the major issues that jeopardize the successful deployment of wireless sensor networks. While confidentiality of the message can be ensured through content encryption, it is much more difficult to adequately address the source-location privacy. For WSNs, source-location privacy service is further complicated by the fact that the sensor nodes consist of low-cost and low-power radio devices, computationally intensive cryptographic algorithms and large scale broadcasting-based protocols are not suitable for WSNs. In this paper, we propose source-location privacy schemes through routing to randomly selected intermediate node(s) before the message is transmitted to the SINK node. We first describe routing through a single a single randomly selected intermediate node away from the source node. Our analysis shows that this scheme can provide great local source-location privacy. We also present routing through multiple randomly selected intermediate nodes based on angle and quadrant to further improve the global source location privacy. While providing source-location privacy for WSNs, our simulation results also demonstrate that the proposed schemes are very efficient in energy consumption, and have very low transmission latency and high message delivery ratio. Our protocols can be used for many practical applications.", "citation": "Citations (126)", "departments": ["Michigan State University", "Michigan State University"], "authors": ["Yun Li.....http://dblp.org/pers/hd/l/Li:Yun", "Jian Ren.....http://dblp.org/pers/hd/r/Ren_0001:Jian"], "conf": "infocom", "year": "2010", "pages": 9}