{"title": "Distributed Coordination with Deaf Neighbors: Efficient Medium Access for 60 GHz Mesh Networks.", "fields": ["multiplexing", "network packet", "time division multiplexing", "antenna array", "path loss"], "abstract": "Multi-gigabit outdoor mesh networks operating in the unlicensed 60 GHz ``millimeter (mm) wave'' band, offer the possibility of a quickly deployable broadband extension of the Internet. We consider mesh nodes with electronically steerable antenna arrays, with both the transmitter and receiver synthesizing narrow beams that compensate for the higher path loss at mm-wave frequencies, achieving ranges on the order of 100 meters using the relatively low transmit powers attainable with low-cost silicon implementations. Such highly directional networking differs from WiFi networks at lower carrier frequencies in two ways that have a crucial impact on protocol design: (1) directionality drastically reduces spatial interference, so that pseudowired link abstractions form an excellent basis for protocol design; (2) directionality induces deafness, which makes medium access control (MAC) based on carrier sensing infeasible. Interference analysis in our prior work shows that, in such a setting, coordination between transmitters and receivers, rather than interference management, becomes the key MAC performance bottleneck. However, the question of whether such coordination can be achieved in a distributed fashion while achieving high medium utilization, was left open. In this paper, we answer this question in the affirmative, presenting a distributed MAC protocol that employs memory to achieve approximate time division multiplexed (TDM) schedules without explicit coordination or resource allocation. The efficacy of the protocol is demonstrated via packet level simulations, while a Markov chain fixed-point analysis provides insight into the effect of parameter choices.", "citation": "Citations (98)", "departments": ["University of California, Santa Barbara", "University of Iowa", "University of California, Santa Barbara"], "authors": ["Sumit Singh.....http://dblp.org/pers/hd/s/Singh_0001:Sumit", "Raghuraman Mudumbai.....http://dblp.org/pers/hd/m/Mudumbai:Raghuraman", "Upamanyu Madhow.....http://dblp.org/pers/hd/m/Madhow:Upamanyu"], "conf": "infocom", "year": "2010", "pages": 9}