{"title": "Leakage-Resilient Pseudorandom Functions and Side-Channel Attacks on Feistel Networks.", "fields": ["random oracle", "hamming weight", "pseudorandom function family", "cryptographic primitive", "pseudorandom number generator", "side channel attack", "discrete mathematics", "mathematics", "leakage"], "abstract": "A cryptographic primitive is leakage-resilient, if it remains secure even if an adversary can learn a bounded amount of arbitrary information about the computation with every invocation. As a consequence, the physical implementation of a leakage-resilient primitive is secure against every side-channel as long as the amount of information leaked per invocation is bounded.\n\nIn this paper we prove positive and negative results about the feasibility of constructing leakage-resilient pseudorandom functions and permutations (i.e. block-ciphers). Our results are three fold: 1. We construct (from any standard PRF) a PRF which satisfies a relaxed notion of leakage-resilience where (1) the leakage function is fixed (and not adaptively chosen with each query.) and (2) the computation is split into several steps which leak individually (a \"step\" will be the invocation of the underlying PRF.) 2. We prove that a Feistel network with a super-logarithmic number of rounds, each instantiated with a leakage-resilient PRF, is a leakage resilient PRP. This reduction also holds for the non-adaptive notion just discussed, we thus get a block-cipher which is leakage-resilient (against non-adaptive leakage). 3. We propose generic side-channel attacks against Feistel networks. The attacks are generic in the sense that they work for any round functions (e.g. uniformly random functions) and only require some simple leakage from the inputs to the round functions. For example we show how to invert an r round Feistel network over 2n bits making 4ċ(n+1)r-2 forward queries, if with each query we are also given as leakage the Hamming weight of the inputs to the r round functions. This complements the result from the previous item showing that a super-constant number of rounds is necessary.", "citation": "Not cited", "departments": ["New York University", "New York University"], "authors": ["Yevgeniy Dodis.....http://dblp.org/pers/hd/d/Dodis:Yevgeniy", "Krzysztof Pietrzak.....http://dblp.org/pers/hd/p/Pietrzak:Krzysztof"], "conf": "crypto", "year": "2010", "pages": 20}