{"title": "Managing Variability in the IO Performance of Petascale Storage Systems.", "fields": ["workload", "supercomputer", "limiting", "computer data storage", "petascale computing"], "abstract": "Significant challenges exist for achieving peak or even consistent levels of performance when using IO systems at scale. They stem from sharing IO system resources across the processes of single largescale applications and/or multiple simultaneous programs causing internal and external interference, which in turn, causes substantial reductions in IO performance. This paper presents interference effects measurements for two different file systems at multiple supercomputing sites. These measurements motivate developing a 'managed' IO approach using adaptive algorithms varying the IO system workload based on current levels and use areas. An implementation of these methods deployed for the shared, general scratch storage system on Oak Ridge National Laboratory machines achieves higher overall performance and less variability in both a typical usage environment and with artificially introduced levels of 'noise'. The latter serving to clearly delineate and illustrate potential problems arising from shared system usage and the advantages derived from actively managing it.", "citation": "Citations (147)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Oak Ridge National Laboratory", "Oak Ridge National Laboratory", "Oak Ridge National Laboratory"], "authors": ["Jay F. Lofstead.....http://dblp.org/pers/hd/l/Lofstead:Jay_F=", "Fang Zheng.....http://dblp.org/pers/hd/z/Zheng:Fang", "Qing Liu.....http://dblp.org/pers/hd/l/Liu_0002:Qing", "Scott Klasky.....http://dblp.org/pers/hd/k/Klasky:Scott", "Ron Oldfield.....http://dblp.org/pers/hd/o/Oldfield:Ron", "Todd Kordenbrock.....http://dblp.org/pers/hd/k/Kordenbrock:Todd", "Karsten Schwan.....http://dblp.org/pers/hd/s/Schwan:Karsten", "Matthew Wolf.....http://dblp.org/pers/hd/w/Wolf:Matthew"], "conf": "sc", "year": "2010", "pages": 12}