{"title": "Deploying Mesh Nodes under Non-Uniform Propagation.", "fields": ["order one network protocol", "wireless mesh network", "switched mesh", "shared mesh", "optical mesh network"], "abstract": "Wireless mesh networks are popular as a cost- effective means to provide broadband connectivity to large user populations. A mesh network placement provides coverage, such that each target client location has a link to a deployed mesh node, and connectivity, such that each mesh node wirelessly connects directly to a gateway or via intermediate mesh nodes. Prior work on placement assumes wireless propagation to be uniform in all directions, i.e., an unrealistic assumption of circular communication regions. In this paper, we present approximation algorithms to solve the NP- hard mesh node placement problem for non-uniform propagation settings. The first key challenge is incorporating non-uniform propagation, which we address by formulating the problem input as a connectivity graph consisting of discrete target coverage locations and potential mesh node locations. This graph incorporates non-uniform propagation by specifying the estimated signal quality per link. Secondly, our algorithms are the first to minimize the number of deployed mesh nodes with constant-factor approximation ratio in the non-uniform propagation setting. To achieve this, we formulate the Degree-Constrained Terminal Steiner tree problem and present approximation algorithms which leverage prior results on the Steiner tree problem. Third, it is impractical to measure all possible potential mesh links, and therefore deployment planning must rely on estimations. To address this challenge, we extend our algorithm to iteratively measure the links in the solution Steiner tree, refining the graph input on a per-link basis in order to ensure the deployed network is not disconnected. Finally, we use propagation measurements at 35,000 locations in the deployed GoogleWiFi network to investigate placement in a realistic, non-uniform propagation environment. Under this measured propagation setting, our algorithms result in up to 80% fewer mesh nodes than current algorithms and only require an average of 3 measurements per deployed mesh node to ensure backhaul connectivity.", "citation": "Citations (22)", "departments": ["Narus", "Microsoft", "Hewlett-Packard", "Rice University"], "authors": ["Joshua Robinson.....http://dblp.org/pers/hd/r/Robinson:Joshua", "Mohit Singh.....http://dblp.org/pers/hd/s/Singh:Mohit", "Ram Swaminathan.....http://dblp.org/pers/hd/s/Swaminathan:Ram", "Edward W. Knightly.....http://dblp.org/pers/hd/k/Knightly:Edward_W="], "conf": "infocom", "year": "2010", "pages": 9}