{"title": "Efficient Learning with Partially Observed Attributes.", "fields": ["training set", "baseline", "linear prediction", "numerical digit", "machine learning", "existential quantification", "small number", "pixel"], "abstract": "We investigate three variants of budgeted learning, a setting in which the learner is allowed to access a limited number of attributes from training or test examples. In the \"local budget\" setting, where a constraint is imposed on the number of available attributes per training example, we design and analyze an efficient algorithm for learning linear predictors that actively samples the attributes of each training instance. Our analysis bounds the number of additional examples sufficient to compensate for the lack of full information on the training set. This result is complemented by a general lower bound for the easier \"global budget\" setting, where it is only the overall number of accessible training attributes that is being constrained. In the third, \"prediction on a budget\" setting, when the constraint is on the number of available attributes per test example, we show that there are cases in which there exists a linear predictor with zero error but it is statistically impossible to achieve arbitrary accuracy without full information on test examples. Finally, we run simple experiments on a digit recognition problem that reveal that our algorithm has a good performance against both partial information and full information baselines.", "citation": "Citations (71)", "departments": ["University of Milan", "Hebrew University of Jerusalem", "Hebrew University of Jerusalem", "University of Milan", "Hebrew University of Jerusalem", "Hebrew University of Jerusalem"], "authors": ["Nicolò Cesa-Bianchi.....http://dblp.org/pers/hd/c/Cesa=Bianchi:Nicol=ograve=", "Shai Shalev-Shwartz.....http://dblp.org/pers/hd/s/Shalev=Shwartz:Shai", "Ohad Shamir.....http://dblp.org/pers/hd/s/Shamir:Ohad"], "conf": "icml", "year": "2010", "pages": 8}