{"title": "Scalable communication protocols for dynamic sparse data exchange.", "fields": ["tree traversal", "sparse approximation", "supercomputer", "bulk synchronous parallel", "sparse matrix"], "abstract": "Many large-scale parallel programs follow a bulk synchronous parallel (BSP) structure with distinct computation and communication phases. Although the communication phase in such programs may involve all (or large numbers) of the participating processes, the actual communication operations are usually sparse in nature. As a result, communication phases are typically expressed explicitly using point-to-point communication operations or collective operations. We define the dynamic sparse data-exchange (DSDE) problem and derive bounds in the well known LogGP model. While current approaches work well with static applications, they run into limitations as modern applications grow in scale, and as the problems that are being solved become increasingly irregular and dynamic.   To enable the compact and efficient expression of the communication phase, we develop suitable sparse communication protocols for irregular applications at large scale. We discuss different irregular applications and show the sparsity in the communication for real-world input data. We discuss the time and memory complexity of commonly used protocols for the DSDE problem and develop  NBX --a novel fast algorithm with constant memory overhead for solving it. Algorithm  NBX  improves the runtime of a sparse data-exchange among 8,192 processors on BlueGene/P by a factor of 5.6. In an application study, we show improvements of up to a factor of 28.9 for a parallel breadth first search on 8,192 BlueGene/P processors.", "citation": "Citations (56)", "year": "2010", "departments": ["Indiana University Bloomington", "Indiana University Bloomington", "NEC Laboratorie ... gustin, Germany"], "conf": "ppopp", "authors": ["Torsten Hoefler.....http://dblp.org/pers/hd/h/Hoefler:Torsten", "Christian Siebert.....http://dblp.org/pers/hd/s/Siebert:Christian", "Andrew Lumsdaine.....http://dblp.org/pers/hd/l/Lumsdaine:Andrew"], "pages": 10}