{"title": "Active learning for ranking through expected loss optimization.", "fields": ["ranking", "active learning", "ranking svm", "stability", "discounted cumulative gain", "learning to rank"], "abstract": "Learning to rank arises in many information retrieval applications, ranging from Web search engine, online advertising to recommendation system. In learning to rank, the performance of a ranking model is strongly affected by the number of labeled examples in the training set; on the other hand, obtaining labeled examples for training data is very expensive and time-consuming. This presents a great need for the active learning approaches to select most informative examples for ranking learning; however, in the literature there is still very limited work to address active learning for ranking. In this paper, we propose a general active learning framework, Expected Loss Optimization (ELO), for ranking. The ELO framework is applicable to a wide range of ranking functions. Under this framework, we derive a novel algorithm, Expected DCG Loss Optimization (ELO-DCG), to select most informative examples. Furthermore, we investigate both query and document level active learning for raking and propose a two-stage ELO-DCG algorithm which incorporate both query and document selection into active learning. Extensive experiments on real-world Web search data sets have demonstrated great potential and effective-ness of the proposed framework and algorithms.", "citation": "Citations (86)", "departments": ["Yahoo!", "Yahoo!", "Shanghai Jiao Tong University", "Yahoo!", "Yahoo!", "LinkedIn", "Microsoft", "Shanghai Jiao Tong University", "Yahoo!", "Criteo, Palo Alto, CA"], "authors": ["Bo Long.....http://dblp.org/pers/hd/l/Long:Bo", "Olivier Chapelle.....http://dblp.org/pers/hd/c/Chapelle:Olivier", "Ya Zhang.....http://dblp.org/pers/hd/z/Zhang:Ya", "Yi Chang.....http://dblp.org/pers/hd/c/Chang:Yi", "Zhaohui Zheng.....http://dblp.org/pers/hd/z/Zheng:Zhaohui", "Belle L. Tseng.....http://dblp.org/pers/hd/t/Tseng:Belle_L="], "conf": "sigir", "year": "2010", "pages": 8}