{"title": "Butterfly analysis: adapting dataflow analysis to dynamic parallel monitoring.", "fields": ["dataflow", "correctness", "strong consistency", "data flow analysis", "sequential consistency"], "abstract": "Online program monitoring is an effective technique for detecting bugs and security attacks in running applications. Extending these tools to monitor parallel programs is challenging because the tools must account for inter-thread dependences and relaxed memory consistency models. Existing tools assume sequential consistency and often slow down the monitored program by orders of magnitude. In this paper, we present a novel approach that avoids these pitfalls by not relying on strong consistency models or detailed inter-thread dependence tracking. Instead, we only assume that events in the distant past on all threads have become visible; we make no assumptions on (and avoid the overheads of tracking) the relative ordering of more recent events on other threads. To overcome the potential state explosion of considering all the possible orderings among recent events, we adapt two techniques from static dataflow analysis, reaching definitions and reaching expressions, to this new domain of dynamic parallel monitoring. Significant modifications to these techniques are proposed to ensure the correctness and efficiency of our approach. We show how our adapted analysis can be used in two popular memory and security tools. We prove that our approach does not miss errors, and sacrifices precision only due to the lack of a relative ordering among recent events. Moreover, our simulation study on a collection of Splash-2 and Parsec 2.0 benchmarks running a memory-checking tool on a hardware-assisted logging platform demonstrates the potential benefits in trading off a very low false positive rate for (i) reduced overhead and (ii) the ability to run on relaxed consistency models.", "citation": "Citations (17)", "year": "2010", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Intel", "Intel", "Intel"], "conf": "asplos", "authors": ["Michelle L. Goodstein.....http://dblp.org/pers/hd/g/Goodstein:Michelle_L=", "Evangelos Vlachos.....http://dblp.org/pers/hd/v/Vlachos:Evangelos", "Shimin Chen.....http://dblp.org/pers/hd/c/Chen:Shimin", "Phillip B. Gibbons.....http://dblp.org/pers/hd/g/Gibbons:Phillip_B=", "Michael A. Kozuch.....http://dblp.org/pers/hd/k/Kozuch:Michael_A=", "Todd C. Mowry.....http://dblp.org/pers/hd/m/Mowry:Todd_C="], "pages": 14}