{"title": "Feeding frenzy: selectively materializing users' event feeds.", "fields": ["feeding frenzy", "underlying event", "web application", "web page", "rss"], "abstract": "Near real-time event streams are becoming a key feature of many popular web applications. Many web sites allow users to create a personalized  feed  by selecting one or more event streams they wish to  follow . Examples include Twitter and Facebook, which a user to follow other users' activity, and iGoogle and My Yahoo, which allow users to follow selected RSS streams. How can we efficiently construct a web page showing the latest events from a user's feed? Constructing such a feed must be fast so the page loads quickly, yet reflects recent updates to the underlying event streams. The wide fanout of popular streams (those with many followers) and high skew (fanout and update rates vary widely) make it difficult to scale such applications.   We associate feeds with  consumers  and event streams with  producers . We demonstrate that the best performance results from selectively materializing each consumer's feed: events from high-rate producers are retrieved at query time, while events from lower-rate producers are materialized in advance. A formal analysis of the problem shows the surprising result that we can minimize global cost by making local decisions about each producer/consumer pair, based on the ratio between a given producer's update rate (how often an event is added to the stream) and a given consumer's view rate (how often the feed is viewed). Our experimental results, using Yahoo!'s web-scale database PNUTS, shows that this hybrid strategy results in the lowest system load (and hence improves scalability) under a variety of workloads.", "citation": "Citations (94)", "year": "2010", "departments": ["Yahoo!", "Princeton University", "Yahoo!", "Yahoo!"], "conf": "sigmod", "authors": ["Adam Silberstein.....http://dblp.org/pers/hd/s/Silberstein:Adam", "Jeff Terrace.....http://dblp.org/pers/hd/t/Terrace:Jeff", "Brian F. Cooper.....http://dblp.org/pers/hd/c/Cooper:Brian_F=", "Raghu Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Raghu"], "pages": 12}