{"title": "Negotiating multimedia advertising with attention owners.", "fields": ["negotiation", "subsidy", "the internet", "intermediary", "server"], "abstract": "Advertising is increasingly an integral part of multimedia delivery over the Internet. Traditionally, brokers -- intermediaries between content providers, advertisers, and viewers -- have determined the fine balance between the content de- sired by viewers and the advertising embedded in the content. Parameters of this balance are informed by fields of psychology and marketing, which help target viewer segments identified by their viewing habits. Oddly, mechanisms available to individual viewers to inform this balance are coarse grained: one can change the channel.   We take an  owned attention  view of the problem with an explicit treatment of both attention and its ownership. This approach specializes the CyberOrgs model for encapsulating computations with owned resources available for their execution. Particularly, we treat a multimedia consumer's attention space as a precious resource owned by the viewer. Viewers pay for the content they wish to view in dollars, as well as in terms of their attention. Advertisers pay for viewers' attention by subsidizing the cost of their content.   This paper presents the rationale, design, implementation, and evaluation of our solution, FlexAdSense. Our approach affords finer grained control capability to viewers than what is offered by existing approaches. Pluggable customizable policies specify negotiation positions of different parties, scalably automating typical negotiations. Experimental work demonstrates that the approach scales well, and informs decisions about allocating resources to servers.", "citation": "Citations (1)", "departments": ["University of Saskatchewan", "cfactor Works,  ... oon, SK, Canada"], "authors": ["Yue Zhang.....http://dblp.org/pers/hd/z/Zhang:Yue", "Nadeem Jamali.....http://dblp.org/pers/hd/j/Jamali:Nadeem"], "conf": "mm", "year": "2010", "pages": 4}