{"title": "Side channel: bits over interference.", "fields": ["zero forcing precoding", "key distribution in wireless sensor networks", "multi user mimo", "side channel attack", "throughput", "radio resource management", "channel", "wi fi array"], "abstract": "Interference is a critical issue in wireless communications. In a typical multiple-user environment, different users may severely interfere with each other. Coordination among users therefore is an indispensable part for interference management in wireless networks. It is known that coordination among multiple nodes is a costly operation taking a significant amount of valuable communication resource. In this paper, we have an interesting observation that by generating intended patterns, some simultaneous transmissions, i.e., \"interference,” can be successfully decoded without degrading the effective throughput in original transmission. As such, an extra and \"free” coordination channel can be built. Based on this idea, we propose a DC-MAC to leverage this \"free” channel for efficient medium access in a multiple-user wireless network. We theoretically analyze the capacity of this channel under different environments with various modulation schemes. USRP2-based implementation experiments show that compared with the widely adopted CSMA, DC-MAC can improve the channel utilization efficiency by up to 250 percent.", "citation": "Citations (105)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Chinese Academy of Sciences", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Chinese Academy of Sciences", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Haoyu Tan.....http://dblp.org/pers/hd/t/Tan:Haoyu", "Yunhuai Liu.....http://dblp.org/pers/hd/l/Liu:Yunhuai", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "mobicom", "year": "2010", "pages": 12}