{"title": "Neighbor Discovery with Reception Status Feedback to Transmitters.", "fields": ["network packet", "collision", "channel", "physical layer", "neighbor discovery protocol"], "abstract": "Neighbor discovery is essential for the process of self-organization of a wireless network, where almost all routing and medium access protocols need knowledge of one-hop neighbors. In this paper we study the problem of neighbor discovery in a static and synchronous network, where time is divided into slots, each of duration equal to the time required to transmit a hello message, and potentially, some sort of feedback message. Our main contributions lie in detailing the physical layer mechanism for how nodes in receive mode detect the channel status, describing algorithms at higher layers that exploit such a knowledge, and characterizing the significant gain obtained. In particular, we describe one possible physical layer architecture that allows receivers to detect collisions, and then introduce a feedback mechanism that makes the collision information available to the transmitters. This allows nodes to stop transmitting packets as soon as they learn about the successful reception of their discovery messages by the other nodes in the network. Hence, the number of nodes that need to transmit packets decreases over time. These nodes transmit with a probability that is inversely proportional to the number of active nodes in their neighborhood, which is estimated using the collision information available at the nodes. We show through analysis and simulations that our algorithm allows nodes to discover their neighbors in a significantly smaller amount of time compared to the case where reception status feedback is not available to the transmitters.", "citation": "Citations (60)", "departments": ["École Polytechnique Fédérale de Lausanne", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "United States Army Research Laboratory"], "authors": ["Ramin Khalili.....http://dblp.org/pers/hd/k/Khalili:Ramin", "Dennis Goeckel.....http://dblp.org/pers/hd/g/Goeckel:Dennis", "Donald F. Towsley.....http://dblp.org/pers/hd/t/Towsley:Donald_F=", "Ananthram Swami.....http://dblp.org/pers/hd/s/Swami:Ananthram"], "conf": "infocom", "year": "2010", "pages": 9}