{"title": "Equip tourists with knowledge mined from travelogues.", "fields": ["tourism", "prosperity", "probabilistic logic", "topic model", "automatic summarization"], "abstract": "With the prosperity of tourism and Web 2.0 technologies, more and more people have willingness to share their travel experiences on the Web (e.g., weblogs, forums, or Web 2.0 communities). These so-called travelogues contain rich information, particularly including location-representative knowledge such as attractions (e.g., Golden Gate Bridge), styles (e.g., beach, history), and activities (e.g., diving, surfing). The location-representative information in travelogues can greatly facilitate other tourists' trip planning, if it can be correctly extracted and summarized. However, since most travelogues are unstructured and contain much noise, it is difficult for common users to utilize such knowledge effectively. In this paper, to mine location-representative knowledge from a large collection of travelogues, we propose a probabilistic topic model, named as Location-Topic model. This model has the advantages of (1) differentiability between two kinds of topics, i.e., local topics which characterize locations and global topics which represent other common themes shared by various locations, and (2) representation of locations in the local topic space to encode both location-representative knowledge and similarities between locations. Some novel applications are developed based on the proposed model, including (1) destination recommendation for on flexible queries, (2) characteristic summarization for a given destination with representative tags and snippets, and (3) identification of informative parts of a travelogue and enriching such highlights with related images. Based on a large collection of travelogues, the proposed framework is evaluated using both objective and subjective evaluation methods and shows promising results.", "citation": "Citations (169)", "departments": ["Tianjin University", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Qiang Hao.....http://dblp.org/pers/hd/h/Hao:Qiang", "Rui Cai.....http://dblp.org/pers/hd/c/Cai:Rui", "Changhu Wang.....http://dblp.org/pers/hd/w/Wang:Changhu", "Rong Xiao.....http://dblp.org/pers/hd/x/Xiao:Rong", "Jiang-Ming Yang.....http://dblp.org/pers/hd/y/Yang:Jiang=Ming", "Yanwei Pang.....http://dblp.org/pers/hd/p/Pang:Yanwei", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Lei"], "conf": "www", "year": "2010", "pages": 10}