{"title": "Efficiently evaluating complex boolean expressions.", "fields": ["boolean expression", "conjunctive normal form", "expression", "online advertising", "normalization"], "abstract": "The problem of efficiently evaluating a large collection of complex Boolean expressions - beyond simple conjunctions and Disjunctive/Conjunctive Normal Forms (DNF/CNF) - occurs in many emerging online advertising applications such as advertising exchanges and automatic targeting. The simple solution of normalizing complex Boolean expressions to DNF or CNF form, and then using existing methods for evaluating such expressions is not always effective because of the exponential blow-up in the size of expressions due to normalization. We thus propose a novel method for evaluating complex expressions, which leverages existing techniques for evaluating leaf-level conjunctions, and then uses a bottom-up evaluation technique to only process the relevant parts of the complex expressions that contain the matching conjunctions. We develop two such bottom-up evaluation techniques, one based on Dewey IDs and another based on mapping Boolean expressions to one-dimensional intervals. Our experimental evaluation based on data obtained from an online advertising exchange shows that the proposed techniques are efficient and scalable, both with respect to space usage as well as evaluation time.", "citation": "Citations (25)", "year": "2010", "departments": ["Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!"], "conf": "sigmod", "authors": ["Marcus Fontoura.....http://dblp.org/pers/hd/f/Fontoura:Marcus", "Suhas Sadanandan.....http://dblp.org/pers/hd/s/Sadanandan:Suhas", "Jayavel Shanmugasundaram.....http://dblp.org/pers/hd/s/Shanmugasundaram:Jayavel", "Sergei Vassilvitskii.....http://dblp.org/pers/hd/v/Vassilvitskii:Sergei", "Erik Vee.....http://dblp.org/pers/hd/v/Vee:Erik", "Srihari Venkatesan.....http://dblp.org/pers/hd/v/Venkatesan:Srihari", "Jason Y. Zien.....http://dblp.org/pers/hd/z/Zien:Jason_Y="], "pages": 12}