{"title": "Managing uncertainty of XML schema matching.", "fields": ["biconnected component", "document structure description", "schema matching", "xml schema", "database schema"], "abstract": "Despite of advances in machine learning technologies, a schema matching result between two database schemas (e.g., those derived from COMA++) is likely to be imprecise. In particular, numerous instances of “possible mappings” between the schemas may be derived from the matching result. In this paper, we study the problem of managing possible mappings between two heterogeneous XML schemas. We observe that for XML schemas, their possible mappings have a high degree of overlap. We hence propose a novel data structure, called the block tree, to capture the commonalities among possible mappings. The block tree is useful for representing the possible mappings in a compact manner, and can be generated efficiently. Moreover, it supports the evaluation of probabilistic twig query (PTQ), which returns the probability of portions of an XML document that match the query pattern. For users who are interested only in answers with k-highest probabilities, we also propose the top-k PTQ, and present an efficient solution for it. The second challenge we have tackled is to efficiently generate possible mappings for a given schema matching. While this problem can be solved by existing algorithms, we show how to improve the performance of the solution by using a divide-and-conquer approach. An extensive evaluation on realistic datasets show that our approaches significantly improve the efficiency of generating, storing, and querying possible mappings.", "citation": "Citations (17)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong"], "authors": ["Reynold Cheng.....http://dblp.org/pers/hd/c/Cheng:Reynold", "Jian Gong.....http://dblp.org/pers/hd/g/Gong:Jian", "David W. Cheung.....http://dblp.org/pers/hd/c/Cheung:David_W="], "conf": "icde", "year": "2010", "pages": 12}