{"title": "Using data mining techniques to address critical information exchange needs in disaster affected public-private networks.", "fields": ["crisis management", "multi document summarization", "automatic summarization", "disaster recovery", "business continuity"], "abstract": "Crisis Management and Disaster Recovery have gained immense importance in the wake of recent man and nature inflicted calamities. A critical problem in a crisis situation is how to efficiently discover, collect, organize, search and disseminate real-time disaster information. In this paper, we address several key problems which inhibit better information sharing and collaboration between both private and public sector participants for disaster management and recovery. We design and implement a web based prototype implementation of a Business Continuity Information Network (BCIN) system utilizing the latest advances in data mining technologies to create a user-friendly, Internet-based, information-rich service and acting as a vital part of a company's business continuity process. Specifically, information extraction is used to integrate the input data from different sources; the content recommendation engine and the report summarization module provide users personalized and brief views of the disaster information; the community generation module develops spatial clustering techniques to help users build dynamic community in disasters. Currently, BCIN has been exercised at Miami-Dade County Emergency Management.", "citation": "Citations (21)", "departments": ["Florida International University", "Florida International University", "Florida International University", "Florida International University", "Florida International University"], "authors": ["Li Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Li", "Chao Shen.....http://dblp.org/pers/hd/s/Shen:Chao", "Liang Tang.....http://dblp.org/pers/hd/t/Tang:Liang", "Tao Li.....http://dblp.org/pers/hd/l/Li_0001:Tao", "Steven Luis.....http://dblp.org/pers/hd/l/Luis:Steven", "Shu-Ching Chen.....http://dblp.org/pers/hd/c/Chen:Shu=Ching", "Vagelis Hristidis.....http://dblp.org/pers/hd/h/Hristidis:Vagelis"], "conf": "kdd", "year": "2010", "pages": 10}