{"title": "Circular and Leakage Resilient Public-Key Encryption under Subgroup Indistinguishability - (or: Quadratic Residuosity Strikes Back).", "fields": ["probabilistic encryption", "deterministic encryption", "public key cryptography", "encryption", "quadratic equation", "discrete mathematics", "multiple encryption", "key size", "affine transformation", "ciphertext indistinguishability", "adversary", "leakage", "theoretical computer science"], "abstract": "The main results of this work are new public-key encryp- tion schemes that, under the quadratic residuosity (QR) assumption (or Paillier's decisional composite residuosity (DCR) assumption), achieve key-dependent message security as well as high resilience to secret key leakage and high resilience to the presence of auxiliary input information. In particular, under what we call the subgroup indistinguishability as- sumption, of which the QR and DCR are special cases, we can construct as cheme that has: - Key-dependent message (circular) security. Achieves security even when encrypting affine functions of its own secret key (in fact, w.r.t. affine \"key-cycles\" of predefined length). Our scheme also meets the requirements for extending key-dependent message secu- rity to broader classes of functions beyond affine functions using previous techniques of Brakerski et al. or Barak et al. - Leakage resiliency. Remains secure even if any adversarial low- entropy (efficiently computable) function of the secret key is given to the adversary. A proper selection of parameters allows for a \"leakage rate\" of (1 − o(1)) of the length of the secret key. - Auxiliary-input security. Remains secure even if any sufficiently hard to invert(efficiently computable) function of the secret key is given to the adversary. Our scheme is the first to achieve key-dependent security and auxiliary- input security based on the DCR and QR assumptions. Previous schemes that achieved these properties relied either on the DDH or LWE assump- tions. The proposed scheme is also the first to achieve leakage resiliency for leakage rate (1−o(1)) of the secret key length, under the QR assump- tion. We note that leakage resilient schemes under the DCR and the QR assumptions, for the restricted case of composite modulus product of safe primes, were implied by the work of Naor and Segev, using hash proof systems. However, under the QR assumption, known constructions of hash proof systems only yield a leakage rate of o(1) of the secret key length.", "citation": "Not cited", "departments": ["Weizmann Institute of Science", "Massachusetts Institute of Technology", "Weizmann Institute of Science", "Massachusetts Institute of Technology"], "authors": ["Zvika Brakerski.....http://dblp.org/pers/hd/b/Brakerski:Zvika", "Shafi Goldwasser.....http://dblp.org/pers/hd/g/Goldwasser:Shafi"], "conf": "crypto", "year": "2010", "pages": 20}