{"title": "@spam: the underground on 140 characters or less.", "fields": ["spam and open relay blocking system", "spam blog", "sping", "forum spam", "social spam"], "abstract": "In this work we present a characterization of spam on Twitter. We find that 8% of 25 million URLs posted to the site point to phishing, malware, and scams listed on popular blacklists. We analyze the accounts that send spam and find evidence that it originates from previously legitimate accounts that have been compromised and are now being puppeteered by spammers. Using clickthrough data, we analyze spammers' use of features unique to Twitter and the degree that they affect the success of spam. We find that Twitter is a highly successful platform for coercing users to visit spam pages, with a clickthrough rate of 0.13%, compared to much lower rates previously reported for email spam. We group spam URLs into campaigns and identify trends that uniquely distinguish phishing, malware, and spam, to gain an insight into the underlying techniques used to attract users.   Given the absence of spam filtering on Twitter, we examine whether the use of URL blacklists would help to significantly stem the spread of Twitter spam. Our results indicate that blacklists are too slow at identifying new threats, allowing more than 90% of visitors to view a page before it becomes blacklisted. We also find that even if blacklist delays were reduced, the use by spammers of URL shortening services for obfuscation negates the potential gains unless tools that use blacklists develop more sophisticated spam filtering.", "citation": "Citations (542)", "year": "2010", "departments": ["University of California, Berkeley", "University of Illinois at Urbana–Champaign", "University of California, Berkeley", "University of California, Berkeley"], "conf": "ccs", "authors": ["Chris Grier.....http://dblp.org/pers/hd/g/Grier:Chris", "Kurt Thomas.....http://dblp.org/pers/hd/t/Thomas:Kurt", "Vern Paxson.....http://dblp.org/pers/hd/p/Paxson:Vern", "Chao Michael Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao_Michael"], "pages": 11}