{"title": "Ranked queries over sources with Boolean query interfaces without ranking support.", "fields": ["ranking", "web query classification", "range query", "ranking svm", "spatial query"], "abstract": "Many online or local data sources provide powerful querying mechanisms but limited ranking capabilities. For instance, PubMed allows users to submit highly expressive Boolean keyword queries, but ranks the query results by date only. However, a user would typically prefer a ranking by relevance, measured by an Information Retrieval (IR) ranking function. The naive approach would be to submit a disjunctive query with all query keywords, retrieve the returned documents, and then re-rank them. Unfortunately, such an operation would be very expensive due to the large number of results returned by disjunctive queries. In this paper we present algorithms that return the top results for a query, ranked according to an IR-style ranking function, while operating on top of a source with a Boolean query interface with no ranking capabilities (or a ranking capability of no interest to the end user). The algorithms generate a series of conjunctive queries that return only documents that are candidates for being highly ranked according to a relevance metric. Our approach can also be applied to other settings where the ranking is monotonic on a set of factors (query keywords in IR) and the source query interface is a Boolean expression of these factors. Our comprehensive experimental evaluation on the PubMed database and TREC dataset show that we achieve order of magnitude improvement compared to the current baseline approaches.", "citation": "Citations (9)", "departments": ["Florida International University", "Florida International University", "New York University"], "authors": ["Vagelis Hristidis.....http://dblp.org/pers/hd/h/Hristidis:Vagelis", "Yuheng Hu.....http://dblp.org/pers/hd/h/Hu:Yuheng", "Panagiotis G. Ipeirotis.....http://dblp.org/pers/hd/i/Ipeirotis:Panagiotis_G="], "conf": "icde", "year": "2010", "pages": 4}