{"title": "An invariance principle for polytopes.", "fields": ["polytope", "pseudorandom generator", "combinatorics", "pseudorandomness", "gaussian", "invariance principle", "mathematics", "binary logarithm", "covering problems"], "abstract": "Let X be randomly chosen from {-1,1} n , and let Y be randomly chosen from the standard spherical Gaussian on R n . For any (possibly unbounded) polytope P formed by the intersection of k halfspaces, we prove that |Pr[X ∈ P] - Pr[Y ∈ P]| ≤ log 8/5 k • Δ, where Δ is a parameter that is small for polytopes formed by the intersection of \"regular\" halfspaces (i.e., halfspaces with low influence). The novelty of our invariance principle is the polylogarithmic dependence on k. Previously, only bounds that were at least linear in k were known.   We give two important applications of our main result: A bound of log O(1) k • e 1/6  on the Boolean noise sensitivity of intersections of k \"regular\" halfspaces (previous work gave bounds linear in k). This gives a corresponding agnostic learning algorithm for intersections of regular halfspaces. A pseudorandom generator (PRG) with seed length O(log n, poly(log k,1/Δ)) that Δ-fools  all  polytopes with k faces with respect to the Gaussian distribution.   We also obtain PRGs with similar parameters that fool polytopes formed by intersection of regular halfspaces over the hypercube. Using our PRG constructions, we obtain the first deterministic quasi-polynomial time algorithms for approximately counting the number of solutions to a broad class of integer programs, including dense covering problems and contingency tables.", "citation": "Not cited", "year": "2010", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "Tata Institute  ... , Mumbai, India"], "conf": "stoc", "authors": ["Prahladh Harsha.....http://dblp.org/pers/hd/h/Harsha:Prahladh", "Adam R. Klivans.....http://dblp.org/pers/hd/k/Klivans:Adam_R=", "Raghu Meka.....http://dblp.org/pers/hd/m/Meka:Raghu"], "pages": 10}