{"title": "Improving online gaming quality using detour paths.", "fields": ["overhead", "planetlab", "game client", "cable modem", "overlay network"], "abstract": "We study the problem of improving the user perceived quality of online games in which multiple players form a game session and exchange game-state updates over an overlay network. We propose an Indirect Relay System (IRS) to forward game-state updates over detour paths in order to reduce the round-trip time (RTT) among players. The IRS system efficiently identifies and ranks potential detour paths between any two players, and dynamically selects the most suitable one based on network and client conditions. To the best of our knowledge, this is the first system that directly reduced RTTs among players in online games, while previous works in the literature mitigate the network latency issue by either hiding it from players or preventing players with high RTTs from being in the same game session. We implement the proposed IRS system and deploy it on 500 PlanetLab nodes. The results from real experiments show that the IRS system improves the online gaming quality from several aspects, while incurring negligible network and processing overheads. We also deploy the IRS system on a number of residential computers with DSL and cable modem access links and we successfully found several detour paths among them. To evaluate the IRS system with wider ranges of system parameters we conduct extensive trace-driven simulations using a large number of real game client IPs. The experimental and simulation results show that the proposed IRS system: (i) significantly reduces RTTs among players, (ii) increases number of peers a player can connect to and maintain good gaming quality, (iii) imposes negligible network and processing overheads, and (iv) improves gaming quality and player performance.", "citation": "Citations (14)", "departments": ["Simon Fraser University", "Deutsche Telekom", "Simon Fraser University"], "authors": ["Cong Ly.....http://dblp.org/pers/hd/l/Ly:Cong", "Cheng-Hsin Hsu.....http://dblp.org/pers/hd/h/Hsu:Cheng=Hsin", "Mohamed Hefeeda.....http://dblp.org/pers/hd/h/Hefeeda:Mohamed"], "conf": "mm", "year": "2010", "pages": 10}