{"title": "Power routing: dynamic power provisioning in the data center.", "fields": ["power distribution unit", "bandwidth throttling", "high availability", "dynamic demand", "power budget"], "abstract": "Data center power infrastructure incurs massive capital costs, which typically exceed energy costs over the life of the facility. To squeeze maximum value from the infrastructure, researchers have proposed over-subscribing power circuits, relying on the observation that peak loads are rare. To ensure availability, these proposals employ power capping, which throttles server performance during utilization spikes to enforce safe power budgets. However, because budgets must be enforced locally -- at each power distribution unit (PDU) -- local utilization spikes may force throttling even when power delivery capacity is available elsewhere. Moreover, the need to maintain reserve capacity for fault tolerance on power delivery paths magnifies the impact of utilization spikes.   In this paper, we develop mechanisms to better utilize installed power infrastructure, reducing reserve capacity margins and avoiding performance throttling. Unlike conventional high-availability data centers, where collocated servers share identical primary and secondary power feeds, we reorganize power feeds to create shuffled power distribution topologies. Shuffled topologies spread secondary power feeds over numerous PDUs, reducing reserve capacity requirements to tolerate a single PDU failure. Second, we propose Power Routing, which schedules IT load dynamically across redundant power feeds to: (1) shift slack to servers with growing power demands, and (2) balance power draw across AC phases to reduce heating and improve electrical stability. We describe efficient heuristics for scheduling servers to PDUs (an NP-complete problem). Using data collected from nearly 1000 servers in three production facilities, we demonstrate that these mechanisms can reduce the required power infrastructure capacity relative to conventional high-availability data centers by 32% without performance degradation.", "citation": "Citations (134)", "year": "2010", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "conf": "asplos", "authors": ["Steven Pelley.....http://dblp.org/pers/hd/p/Pelley:Steven", "David Meisner.....http://dblp.org/pers/hd/m/Meisner:David", "Pooya Zandevakili.....http://dblp.org/pers/hd/z/Zandevakili:Pooya", "Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F=", "Jack Underwood.....http://dblp.org/pers/hd/u/Underwood:Jack"], "pages": 12}