{"title": "Classification and clustering via dictionary learning with structured incoherence and shared features.", "fields": ["spectral clustering", "initialization", "k svd", "fuzzy clustering", "k means clustering"], "abstract": "A clustering framework within the sparse modeling and dictionary learning setting is introduced in this work. Instead of searching for the set of centroid that best fit the data, as in k-means type of approaches that model the data as distributions around discrete points, we optimize for a set of dictionaries, one for each cluster, for which the signals are best reconstructed in a sparse coding manner. Thereby, we are modeling the data as a union of learned low dimensional subspaces, and data points associated to subspaces spanned by just a few atoms of the same learned dictionary are clustered together. An incoherence promoting term encourages dictionaries associated to different classes to be as independent as possible, while still allowing for different classes to share features. This term directly acts on the dictionaries, thereby being applicable both in the supervised and unsupervised settings. Using learned dictionaries for classification and clustering makes this method robust and well suited to handle large datasets. The proposed framework uses a novel measurement for the quality of the sparse representation, inspired by the robustness of the l 1  regularization term in sparse coding. In the case of unsupervised classification and/or clustering, a new initialization based on combining sparse coding with spectral clustering is proposed. This initialization clusters the dictionary atoms, and therefore is based on solving a low dimensional eigen-decomposition problem, being applicable to large datasets. We first illustrate the proposed framework with examples on standard image and speech datasets in the supervised classification setting, obtaining results comparable to the state-of-the-art with this simple approach. We then present experiments for fully unsupervised clustering on extended standard datasets and texture images, obtaining excellent performance.", "citation": "Citations (638)", "year": "2010", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota"], "conf": "cvpr", "authors": ["Ignacio Ramírez.....http://dblp.org/pers/hd/r/Ram=iacute=rez:Ignacio", "Pablo Sprechmann.....http://dblp.org/pers/hd/s/Sprechmann:Pablo", "Guillermo Sapiro.....http://dblp.org/pers/hd/s/Sapiro:Guillermo"], "pages": 8}