{"title": "Walking in Facebook: A Case Study of Unbiased Sampling of OSNs.", "fields": ["metropolis hastings algorithm", "random walk", "cons", "breadth first search", "social graph"], "abstract": "With more than 250 million active users, Facebook (FB) is currently one of the most important online social networks. Our goal in this paper is to obtain a representative (unbiased) sample of Facebook users by crawling its social graph. In this quest, we consider and implement several candidate techniques. Two approaches that are found to perform well are the Metropolis-Hasting random walk (MHRW) and a re-weighted random walk (RWRW). Both have pros and cons, which we demonstrate through a comparison to each other as well as to the \"ground-truth\" (UNI - obtained through true uniform sampling of FB userIDs). In contrast, the traditional Breadth-First-Search (BFS) and Random Walk (RW) perform quite poorly, producing substantially biased results. In addition to offline performance assessment, we introduce online formal convergence diagnostics to assess sample quality during the data collection process. We show how these can be used to effectively determine when a random walk sample is of adequate size and quality for subsequent use (i.e., when it is safe to cease sampling). Using these methods, we collect the first, to the best of our knowledge, unbiased sample of Facebook. Finally, we use one of our representative datasets, collected through MHRW, to characterize several key properties of Facebook.", "citation": "Citations (657)", "departments": ["University of California, Irvine", "École Polytechnique Fédérale de Lausanne", "University of California, Irvine", "University of California, Irvine"], "authors": ["Minas Gjoka.....http://dblp.org/pers/hd/g/Gjoka:Minas", "Maciej Kurant.....http://dblp.org/pers/hd/k/Kurant:Maciej", "Carter T. Butts.....http://dblp.org/pers/hd/b/Butts:Carter_T=", "Athina Markopoulou.....http://dblp.org/pers/hd/m/Markopoulou:Athina"], "conf": "infocom", "year": "2010", "pages": 9}