{"title": "Fairness via source throttling: a configurable and high-performance fairness substrate for multi-core memory systems.", "fields": ["bandwidth throttling", "max min fairness", "cpu cache", "thread", "fairness measure"], "abstract": "Cores in a chip-multiprocessor (CMP) system share multiple hardware resources in the memory subsystem. If resource sharing is unfair, some applications can be delayed significantly while others are unfairly prioritized. Previous research proposed separate fairness mechanisms in each individual resource. Such resource-based fairness mechanisms implemented independently in each resource can make contradictory decisions, leading to low fairness and loss of performance. Therefore, a coordinated mechanism that provides fairness in the entire shared memory system is desirable.   This paper proposes a new approach that provides fairness in the  entire shared memory system , thereby eliminating the need for and complexity of developing fairness mechanisms for each individual resource. Our technique, Fairness via Source Throttling (FST), estimates the unfairness in the entire shared memory system. If the estimated unfairness is above a threshold set by system software, FST throttles down cores causing unfairness by limiting the number of requests they can inject into the system and the frequency at which they do. As such, our  source-based  fairness control ensures fairness decisions are made in tandem in the entire memory system. FST also enforces thread priorities/weights, and enables system software to enforce different fairness objectives and fairness-performance tradeoffs in the memory system.   Our evaluations show that FST provides the best system fairness and performance compared to four systems with no fairness control and with state-of-the-art fairness mechanisms implemented in both shared caches and memory controllers.", "citation": "Citations (320)", "year": "2010", "departments": ["University of Texas at Austin", "University of Texas at Austin", "Carnegie Mellon University", "University of Texas at Austin"], "conf": "asplos", "authors": ["Eiman Ebrahimi.....http://dblp.org/pers/hd/e/Ebrahimi:Eiman", "Chang Joo Lee.....http://dblp.org/pers/hd/l/Lee:Chang_Joo", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur", "Yale N. Patt.....http://dblp.org/pers/hd/p/Patt:Yale_N="], "pages": 12}