{"title": "Recognizing Exponential Inter-Contact Time in VANETs.", "fields": ["exponential distribution", "vehicular ad hoc network", "end to end delay", "mobility model", "mobile computing"], "abstract": "Inter-contact time between moving vehicles is one of the key metrics in vehicular ad hoc networks (VANETs) and central to forwarding algorithms and the end-to-end delay. Due to prohibitive costs, little work has conducted experimental study on inter-contact time in urban vehicular environments. In this paper, we carry out an extensive experiment involving thousands of operational taxies in Shanghai city. Studying the taxi trace data on the frequency and duration of transfer opportunities between taxies, we observe that the tail distribution of the inter-contact time, that is the time gap separating two contacts of the same pair of taxies, exhibits a light tail such as one of an exponential distribution, over a large range of timescale. This observation is in sharp contrast to recent empirical data studies based on human mobility, in which the distribution of the inter-contact time obeys a power law. By performing a least squares fit, we establish an exponential model that can accurately depict the tail behavior of the inter-contact time in VANETs. Our results thus provide fundamental guidelines on design of new vehicular mobility models in urban scenarios, new data forwarding protocols and their performance analysis.", "citation": "Citations (237)", "departments": ["Hong Kong University of Science and Technology", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Hongzi Zhu.....http://dblp.org/pers/hd/z/Zhu:Hongzi", "Luoyi Fu.....http://dblp.org/pers/hd/f/Fu:Luoyi", "Guangtao Xue.....http://dblp.org/pers/hd/x/Xue:Guangtao", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "infocom", "year": "2010", "pages": 5}