{"title": "FlexPref: A framework for extensible preference evaluation in database systems.", "fields": ["extensibility", "skyline", "sword", "strengths and weaknesses", "view"], "abstract": "Personalized database systems give users answers tailored to their personal preferences. While numerous preference evaluation methods for databases have been proposed (e.g., skyline, top-k, k-dominance, k-frequency), the implementation of these methods at the core of a database system is a double-edged sword. Core implementation provides efficient query processing for arbitrary database queries, however this approach is not practical as each existing (and future) preference method requires a custom query processor implementation. To solve this problem, this paper introduces FlexPref, a framework for extensible preference evaluation in database systems. FlexPref, implemented in the query processor, aims to support a wide-array of preference evaluation methods in a single extensible code base. Integration with FlexPref is simple, involving the registration of only three functions that capture the essence of the preference method. Once integrated, the preference method “lives” at the core of the database, enabling the efficient execution of preference queries involving common database operations. To demonstrate the extensibility of FlexPref, we provide case studies showing the implementation of three database operations (single table access, join, and sorted list access) and five state-of-the-art preference evaluation methods (top-k, skyline, k-dominance, top-k dominance, and k-frequency). We also experimentally study the strengths and weaknesses of an implementation of FlexPef in PostgreSQL over a range of single-table and multi-table preference queries.", "citation": "Citations (36)", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota"], "authors": ["Justin J. Levandoski.....http://dblp.org/pers/hd/l/Levandoski:Justin_J=", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F=", "Mohamed E. Khalefa.....http://dblp.org/pers/hd/k/Khalefa:Mohamed_E="], "conf": "icde", "year": "2010", "pages": 12}