{"title": "A Decentralised Coordination Algorithm for Mobile Sensors.", "fields": ["cluster analysis", "travelling salesman problem", "machine learning", "patrolling", "greedy algorithm"], "abstract": "We present an on-line decentralised algorithm for coordinating mobile sensors for a broad class of information gathering tasks. These sensors can be deployed in unknown and possibly hostile environments, where uncertainty and dynamism are endemic. Such environments are common in the areas of disaster response and military surveillance. Our coordination approach itself is based on work by Stranders et al. (2009), that uses the max-sum algorithm to coordinate mobile sensors for monitoring spatial phenomena. In particular, we generalise and extend their approach to any domain where measurements can be valued. Also, we introduce a clustering approach that allows sensors to negotiate over paths to the most relevant locations, as opposed to a set of fixed directions, which results in a significantly improved performance. We demonstrate our algorithm by applying it to two challenging and distinct information gathering tasks. In the first-pursuit-evasion (PE)-sensors need to capture a target whose movement might be unknown. In the second- patrolling (P)-sensors need to minimise loss from intrusions that occur within their environment. In doing so, we obtain the first decentralised coordination algorithms for these domains. Finally, in each domain, we empirically evaluate our approach in a simulated environment, and show that it outperforms two state of the art greedy algorithms by 30% (PE) and 44% (P), and an existing approach based on the Travelling Salesman Problem by 52% (PE) and 30% (P).", "citation": "Citations (17)", "departments": ["University of Southampton", "University of Southampton", "University of Southampton", "University of Southampton"], "authors": ["Ruben Stranders.....http://dblp.org/pers/hd/s/Stranders:Ruben", "Francesco Maria Delle Fave.....http://dblp.org/pers/hd/f/Fave:Francesco_Maria_Delle", "Alex Rogers.....http://dblp.org/pers/hd/r/Rogers:Alex", "Nicholas R. Jennings.....http://dblp.org/pers/hd/j/Jennings:Nicholas_R="], "conf": "aaai", "year": "2010", "pages": -1}