{"title": "Instantiability of RSA-OAEP under Chosen-Plaintext Attack.", "fields": ["random oracle", "pkcs", "public key cryptography", "hash chain", "optimal asymmetric encryption padding", "trapdoor function", "sha 2", "chosen plaintext attack"], "abstract": "We show that the widely deployed RSA-OAEP encryption scheme of Bellare and Rogaway (Eurocrypt 1994), which combines RSA with two rounds of an underlying Feistel network whose hash (i.e., round) functions are modeled as random oracles, meets indistinguishability under chosen-plaintext attack (IND-CPA) in the standard model based on simple, non-interactive, and non-interdependent assumptions on RSA and the hash functions. To prove this, we first give a result on a more general notion called \"padding-based\" encryption, saying that such a scheme is IND-CPA if (1) its underlying padding transform satisfies a \"fooling\" condition against small-range distinguishers on a class of high-entropy input distributions, and (2) its trapdoor permutation is sufficiently lossy as defined by Peikert and Waters (STOC 2008). We then show that the first round of OAEP satifies condition (1) if its hash function is t-wise independent for appopriate t and that RSA satisfies condition (2) under the φ-Hiding Assumption of Cachin et al. (Eurocrypt 1999).\n\nThis appears to be the first non-trivial positive result about the instantiability of RSA-OAEP. In particular, it increases our confidence that chosen-plaintext attacks are unlikely to be found against the scheme. In contrast, RSA-OAEP's predecessor in PKCS #1 v1.5 was shown to be vulnerable to such attacks by Coron et al. (Eurocrypt 2000).", "citation": "Citations (84)", "departments": ["Centrum Wiskunde & Informatica", "Georgia Institute of Technology", "Pennsylvania State University", "Ruhr University Bochum", "Georgetown University", "Pennsylvania State University"], "authors": ["Eike Kiltz.....http://dblp.org/pers/hd/k/Kiltz:Eike", "Adam O'Neill.....http://dblp.org/pers/hd/o/O=Neill:Adam", "Adam D. Smith.....http://dblp.org/pers/hd/s/Smith:Adam_D="], "conf": "crypto", "year": "2010", "pages": 19}