{"title": "CSMA-Based Distributed Scheduling in Multi-hop MIMO Networks under SINR Model.", "fields": ["fair share scheduling", "throughput", "dynamic priority scheduling", "mimo", "signal to interference plus noise ratio"], "abstract": "We study the problem of distributed scheduling in multi-hop MIMO networks. We first develop a ``MIMO-pipe\" model that provides the upper layers a set of rates and SINR requirements, which capture the rate-reliability tradeoff in MIMO communications. The main thrust of this study is then dedicated to developing CSMA-based MIMO-pipe scheduling under the SINR model. We choose the SINR model over the extensively studied matching or protocol-based interference models because it more naturally captures the impact of interference in wireless networks. The coupling among the links caused by the interference makes the problem of devising distributed scheduling algorithms particularly challenging. To that end, we explore CSMA-based MIMO-pipe scheduling, from two perspectives. First, we consider an idealized continuous time CSMA network. We propose a dual-band approach in which control messages are exchanged instantaneously over a channel separate from the data channel, and show that CSMA-based scheduling can achieve throughput optimality under the SINR model. Next, we consider a discrete time CSMA network. To tackle the challenge due to the coupling caused by interference, we propose a ``conservative\" scheduling algorithm in which more stringent SINR constraints are imposed based on the MIMO-pipe model. We show that this suboptimal distributed scheduling can achieve an efficiency ratio bounded from below.", "citation": "Citations (37)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Ohio State University"], "authors": ["Dajun Qian.....http://dblp.org/pers/hd/q/Qian:Dajun", "Dong Zheng.....http://dblp.org/pers/hd/z/Zheng:Dong", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2010", "pages": 9}