{"title": "P2P Trading in Social Networks: The Value of Staying Connected.", "fields": ["bilateral trade", "exploit", "asynchronous communication", "intermediary", "tit for tat"], "abstract": "The success of future P2P applications ultimately depends on whether users will contribute their bandwidth, CPU and storage resources to a larger community. In this paper, we propose a new incentive paradigm, Networked Asynchronous Bilateral Trading (NABT), which can be applied to a broad range of P2P applications. In NABT, peers belong to an underlying social network, and each pair of friends keeps track of a credit balance between them. When user Alice provides a service (a file, storage space, computation and so on) to her friend Bob, she charges Bob credits. Thus, in NABT, there is no global currency; instead, there are only credit balances maintained between pairs of friends. NABT allows peers to supply each other asynchronously and further allows peers to trade with remote peers through intermediaries. We theoretically show that NABT is perfectly efficient with balanced demands and supports \"networked tit-for-tat\". The efficiency of NABT with unbalanced demands is determined by the min-cut of credit limits of the underlying social network. Using simulations driven by MySpace traces, we demonstrate that a simple two-hop NABT design can have high trading efficiency, provide service differentiation, exploit trading intermediaries, and discourage free-riders.", "citation": "Citations (68)", "departments": ["New York University", "New York University", "New York University", "New York University", "New York University"], "authors": ["Zhengye Liu.....http://dblp.org/pers/hd/l/Liu:Zhengye", "Hao Hu.....http://dblp.org/pers/hd/h/Hu:Hao", "Yong Liu.....http://dblp.org/pers/hd/l/Liu_0013:Yong", "Keith W. Ross.....http://dblp.org/pers/hd/r/Ross:Keith_W=", "Yao Wang.....http://dblp.org/pers/hd/w/Wang_0001:Yao", "Markus Mobius.....http://dblp.org/pers/hd/m/Mobius:Markus"], "conf": "infocom", "year": "2010", "pages": 9}