{"title": "More than meets the eye: An engineering study to empirically examine the blending of real and virtual color spaces.", "fields": ["rendering", "user interface design", "color space", "augmented reality", "color vision"], "abstract": "It is well-documented that natural lighting conditions and real-world backgrounds affect the usability of optical see-through augmented reality (AR) displays in outdoor environments. In many cases, outdoor environmental conditions can dramatically alter users' color perception of user interface elements, by for example, washing out text or icon colors. As a result, users' semantic interpretation of interface elements can be compromised, rendering interface designs useless or counter-productive — an especially critical problem in application domains where color encoding is critical, such as military or medical visualization. In this paper, we present our experiences designing and constructing an optical AR testbed that emulates outdoor lighting conditions and allows us to measure the combined color of real-world backgrounds and virtual colors as projected through an optical see-through display. We present a formalization of color blending in AR, which supports further research on perceived color in AR displays. We describe an engineering study where we measure the color of light that reaches an optical see-through display user's eye under systematically varied virtual and real-world conditions. Our results further quantify the effect of lighting and background color on the color of virtual graphics, and specifically quantify how virtual colors change based on different real-world backgrounds.", "citation": "Citations (24)", "departments": ["Virginia Tech", "Mississippi State University", "Virginia Tech", "Virginia Tech"], "authors": ["Joseph L. Gabbard.....http://dblp.org/pers/hd/g/Gabbard:Joseph_L=", "J. Edward Swan II.....http://dblp.org/pers/hd/s/Swan_II:J=_Edward", "Jason Zedlitz.....http://dblp.org/pers/hd/z/Zedlitz:Jason", "Woodrow W. Winchester III.....http://dblp.org/pers/hd/w/Winchester_III:Woodrow_W="], "conf": "vr", "year": "2010", "pages": 8}