{"title": "A Novel Xcast-based Caching Architecture for Inter-gateway Handoffs in Infrastructure Wireless Mesh Networks.", "fields": ["xcast", "wireless mesh network", "multicast", "packet loss", "handover"], "abstract": "Handoff management plays an important role in wireless mesh networks (WMNs) in delivering Quality of Service to mobile users. Inter-gateway (across subnets) movement in WMNs usually requires the handoff support from multilayers and thus causes nonnegligible delays and packet loss. Previous solutions on handoff management in infrastructure WMNs mainly focus on intra-gateway mobility (e.g., single gateway is assumed in IEEE 802.11s WMNs) and exert the reduction of handoff delay so as to reduce packet loss. Furthermore, some handoff issues involved in inter-gateway mobility in WMNs (e.g., the network-layer handoff detection issue) have not been properly addressed. In this paper, we present a novel architectural design, namely Explicit multicast-based (Xcast-based) WMNs (XMesh), to facilitate inter-gateway handoff management. The proposed XMesh architecture enables parallel executions of handoffs from multilayers, in conjunction with a Xcast-based caching mechanism which builds on top of mesh routing protocols to guarantee minimum packet loss during handoffs in WMNs. The required number and optimal placement of special mesh routers that form the XMesh architecture are modeled as a set covering problem which is solved based on a greedy algorithm. A comprehensive simulation study shows that the XMesh architecture enables fast handoffs and re-establishment of session communications in the inter-gateway mobility environment. With both the parallel handoff execution and data caching mechanism, our architecture offers a seamless handoff for supporting real-time applications.", "citation": "Citations (13)", "departments": ["University of North Carolina at Charlotte", "University of North Carolina at Charlotte"], "authors": ["Weiyi Zhao.....http://dblp.org/pers/hd/z/Zhao:Weiyi", "Jiang Xie.....http://dblp.org/pers/hd/x/Xie:Jiang"], "conf": "infocom", "year": "2010", "pages": 9}