{"title": "Adaptive Transfer Learning.", "fields": ["inductive transfer", "instance based learning", "robot learning", "negative transfer", "multi task learning"], "abstract": "Transfer learning aims at reusing the knowledge in some source tasks to improve the learning of a target task. Many transfer learning methods assume that the source tasks and the target task be related, even though many tasks are not related in reality. However, when two tasks are unrelated, the knowledge extracted from a source task may not help, and even hurt, the performance of a target task. Thus, how to avoid negative transfer and then ensure a \"safe transfer\" of knowledge is crucial in transfer learning. In this paper, we propose an Adaptive Transfer learning algorithm based on Gaussian Processes (AT-GP), which can be used to adapt the transfer learning schemes by automatically estimating the similarity between a source and a target task. The main contribution of our work is that we propose a new semi-parametric transfer kernel for transfer learning from a Bayesian perspective, and propose to learn the model with respect to the target task, rather than all tasks as in multi-task learning. We can formulate the transfer learning problem as a unified Gaussian Process (GP) model. The adaptive transfer ability of our approach is verified on both synthetic and real-world datasets.", "citation": "Citations (55)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Bin Cao.....http://dblp.org/pers/hd/c/Cao_0001:Bin", "Sinno Jialin Pan.....http://dblp.org/pers/hd/p/Pan:Sinno_Jialin", "Yu Zhang.....http://dblp.org/pers/hd/z/Zhang_0006:Yu", "Dit-Yan Yeung.....http://dblp.org/pers/hd/y/Yeung:Dit=Yan", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "aaai", "year": "2010", "pages": -1}