{"title": "MoveMine: mining moving object databases.", "fields": ["data set", "global positioning system", "scalability", "data stream mining", "mobile device"], "abstract": "With the maturity of GPS, wireless, and Web technologies, increasing amounts of movement data collected from various moving objects, such as animals, vehicles, mobile devices, and climate radars, have become widely available. Analyzing such data has broad applications, e.g., in ecological study, vehicle control, mobile communication management, and climatological forecast. However, few data mining tools are available for flexible and scalable analysis of massive-scale moving object data. Our system, MoveMine, is designed for sophisticated moving object data mining by integrating several attractive functions including moving object pattern mining and trajectory mining. We explore the state-of-the-art and novel techniques at implementation of the selected functions. A user-friendly interface is provided to facilitate interactive exploration of mining results and flexible tuning of the underlying methods. Since MoveMine is tested on multiple kinds of real data sets, it will benefit users to carry out versatile analysis on these kinds of data. At the same time, it will benefit researchers to realize the importance and limitations of current techniques as well as the potential future studies in moving object data mining.", "citation": "Citations (119)", "year": "2010", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "IBM", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "sigmod", "authors": ["Zhenhui Li.....http://dblp.org/pers/hd/l/Li:Zhenhui", "Ming Ji.....http://dblp.org/pers/hd/j/Ji:Ming", "Jae-Gil Lee.....http://dblp.org/pers/hd/l/Lee_0001:Jae=Gil", "Lu An Tang.....http://dblp.org/pers/hd/t/Tang:Lu_An", "Yintao Yu.....http://dblp.org/pers/hd/y/Yu:Yintao", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Roland Kays.....http://dblp.org/pers/hd/k/Kays:Roland"], "pages": 4}