{"title": "Encryption Schemes Secure against Chosen-Ciphertext Selective Opening Attacks.", "fields": ["probabilistic encryption", "lossy compression", "ciphertext", "56 bit encryption", "public key cryptography", "multiple encryption", "attribute based encryption", "deterministic encryption", "soa security", "key wrap"], "abstract": "Imagine many small devices send data to a single receiver, encrypted using the receiver’s public key. Assume an adversary that has the power to adaptively corrupt a subset of these devices. Given the information obtained from these corruptions, do the ciphertexts from uncorrupted devices remain secure?\n\nRecent results suggest that conventional security notions for encryption schemes (like IND-CCA security) do not suffice in this setting. To fill this gap, the notion of security against selective-opening attacks (SOA security) has been introduced. It has been shown that lossy encryption implies SOA security against a passive, i.e., only eavesdropping and corrupting, adversary (SO-CPA). However, the known results on SOA security against an active adversary (SO-CCA) are rather limited. Namely, while there exist feasibility results, the (time and space) complexity of currently known SO-CCA secure schemes depends on the number of devices in the setting above.\n\nIn this contribution, we devise a new solution to the selective opening problem that does not build on lossy encryption. Instead, we combine techniques from non-committing encryption and hash proof systems with a new technique (dubbed “cross-authentication codes”) to glue several ciphertext parts together. The result is a rather practical SO-CCA secure public-key encryption scheme that does not suffer from the efficiency drawbacks of known schemes. Since we build upon hash proof systems, our scheme can be instantiated using standard number-theoretic assumptions such as decisional Diffie-Hellman DDH), decisional composite residuosity (DCR), and quadratic residuosity (QR). Besides, we construct a conceptually very simple and comparatively efficient SO-CPA secure scheme from (slightly enhanced) trapdoor one-way permutations.\n\nWe stress that our schemes are completely independent of the number of challenge ciphertexts, and we do not make assumptions about the underlying message distribution (beyond being efficiently samplable). In particular, we do not assume efficient conditional re-samplability of the message distribution. Hence, our schemes are secure in arbitrary settings, even if it is not known in advance how many ciphertexts might be considered for corruptions.", "citation": "Citations (69)", "year": "2010", "departments": ["Karlsruhe Institute of Technology", "Queens College", "Karlsruhe Institute of Technology", "Queens College", "CWI, Amsterdam", "CWI, Amsterdam", "CWI Amsterdam", "CWI Amsterdam"], "conf": "eurocrypt", "authors": ["Serge Fehr.....http://dblp.org/pers/hd/f/Fehr:Serge", "Dennis Hofheinz.....http://dblp.org/pers/hd/h/Hofheinz:Dennis", "Eike Kiltz.....http://dblp.org/pers/hd/k/Kiltz:Eike", "Hoeteck Wee.....http://dblp.org/pers/hd/w/Wee:Hoeteck"], "pages": 22}