{"title": "Ratio threshold queries over distributed data sources.", "fields": ["network packet", "subnet", "denial of service attack", "competitive intelligence", "news aggregator", "order of magnitude", "false positive paradox", "dynamic data", "data mining", "distributed database"], "abstract": "Continuous aggregation queries over dynamic data are used for real time decision making and timely business intelligence. In this paper we consider queries where a client wants to be notified if the ratio of two aggregates over distributed data crosses a specified threshold. Consider these scenarios: a mechanism designed to defend against distributed denial of service attacks may be triggered when the fraction of packets arriving to a subnet is more than 5% of the total packets; or a distributed store chain withdraws its discount on luxury goods when sales of luxury goods constitute more than 20% of the overall sales. The challenge in executing such ratio threshold queries (RTQs) lies in incurring the minimal amount of communication necessary for propagation of updates from data sources to the aggregator node where the client query is executed. We address this challenge by proposing schemes for converting the client ratio threshold condition into conditions on individual distributed data sources. Whenever the condition associated with a source is violated, the source pushes its data values to the aggregator, which in turn pulls data values from other sources to determine whether the client threshold condition is indeed violated. We present algorithms to minimize the number of source condition violations (i.e., the number of pushes) while ensuring that no violation of the client threshold condition is missed. Further, in case of a source condition violation, we propose efficient selective pulling algorithms for intelligently choosing additional sources whose data should be pulled by the aggregator. Using performance evaluation on synthetic and real traces of data updates we show that our algorithms result in up to an order of magnitude less number of messages compared to existing approaches in the literature.", "citation": "Citations (13)", "departments": ["IBM", "Indian Institutes of Technology", "IBM", "IBM", "Indian Institutes of Technology", "IBM"], "authors": ["Rajeev Gupta.....http://dblp.org/pers/hd/g/Gupta:Rajeev", "Krithi Ramamritham.....http://dblp.org/pers/hd/r/Ramamritham:Krithi", "Mukesh K. Mohania.....http://dblp.org/pers/hd/m/Mohania:Mukesh_K="], "conf": "icde", "year": "2010", "pages": 4}