{"title": "Adaptive Calibration for Fusion-based Wireless Sensor Networks.", "fields": ["sensor fusion", "phenomenon", "key distribution in wireless sensor networks", "adaptive system", "system deployment"], "abstract": "Wireless sensor networks (WSNs) are typically composed of low-cost sensors that are deeply integrated with physical environments. As a result, the sensing performance of a WSN is inevitably undermined by various physical uncertainties, which include stochastic sensor noises, unpredictable environment changes and dynamics of the monitored phenomenon. Traditional solutions (e.g., sensor calibration and collaborative signal processing) work in an open-loop fashion and hence fail to adapt to these uncertainties after system deployment. In this paper, we propose an adaptive system-level calibration approach for a class of sensor networks that employ data fusion to improve system sensing performance. Our approach features a feedback control loop that exploits sensor heterogeneity to deal with the aforementioned uncertainties in calibrating system performance. In contrast to existing heuristic based solutions, our control-theoretical calibration algorithm can ensure provable system stability and convergence. We also systematically analyze the impacts of communication reliability and delay, and propose an optimal routing algorithm that minimizes the impact of packet loss on system stability. Our approach is evaluated by both experiments on a testbed of Tmotes as well as extensive simulations based on data traces gathered from a real vehicle detection experiment. The results demonstrate that our calibration algorithm enables a network to maintain the optimal detection performance in the presence of various system and environmental dynamics.", "citation": "Citations (25)", "departments": ["City University of Hong Kong", "Michigan State University", "McGill University", "McGill University", "Wuhan University"], "authors": ["Rui Tan.....http://dblp.org/pers/hd/t/Tan:Rui", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Jianguo Yao.....http://dblp.org/pers/hd/y/Yao:Jianguo", "Zhaohui Yuan.....http://dblp.org/pers/hd/y/Yuan:Zhaohui"], "conf": "infocom", "year": "2010", "pages": 9}