{"title": "Transfer Learning in Collaborative Filtering for Sparsity Reduction.", "fields": ["recommender system", "coordinate system", "transfer of learning", "collaborative filtering", "matrix"], "abstract": "Data sparsity is a major problem for collaborative filtering (CF) techniques in recommender systems, especially for new users and items. We observe that, while our target data are sparse for CF systems, related and relatively dense auxiliary data may already exist in some other more mature application domains. In this paper, we address the data sparsity problem in a target domain by transferring knowledge about both users and items from auxiliary data sources. We observe that in different domains the user feedbacks are often heterogeneous such as ratings vs. clicks. Our solution is to integrate both user and item knowledge in auxiliary data sources through a principled matrix-based transfer learning framework that takes into account the data heterogeneity. In particular, we discover the principle coordinates of both users and items in the auxiliary data matrices, and transfer them to the target domain in order to reduce the effect of data sparsity. We describe our method, which is known as coordinate system transfer or CST, and demonstrate its effectiveness in alleviating the data sparsity problem in collaborative filtering. We show that our proposed method can significantly outperform several state-of-the-art solutions for this problem.", "citation": "Citations (208)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Weike Pan.....http://dblp.org/pers/hd/p/Pan:Weike", "Evan Wei Xiang.....http://dblp.org/pers/hd/x/Xiang:Evan_Wei", "Nathan Nan Liu.....http://dblp.org/pers/hd/l/Liu:Nathan_Nan", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "aaai", "year": "2010", "pages": -1}