{"title": "The third eye: mining the visual cognition across multi-language communities.", "fields": ["ranking", "representativeness heuristic", "specification language", "third eye", "annotation"], "abstract": "Existing research work in the multimedia domain mainly focuses on image/video indexing, retrieval, annotation, tagging, re-ranking, etc. However, little work has been contributed to people's visual cognition. In this paper, we propose a novel framework to mine people's visual cognition across multi-language communities. Two challenges are addressed: the visual cognition representation for a specific language community, and the visual cognition comparison between different language communities. We call it \"the third eye\", which means that through this way people with different backgrounds can better understand the cognition of each other, and can view the concept more objectively to avoid culture conflict. In this study, we utilize the image search engine to mine the visual cognition of the different communities. The assumption is that the image semantic distribution over the search results can reflect the visual cognition of the community. When a user submits a text query, it is first translated into different languages, and fed into the corresponding image search engine ports to retrieve images from these communities. After retrieval, the obtained images are categorized into different semantic clusters automatically. Finally, inter semantic cluster ranking is employed to rank the semantic clusters according to their relationship to the query, and intra cluster ranking is used to rank the images according to their representativeness. The visual cognition difference among these language communities is achieved by comparing the different community image distributions over these semantic clusters. The experimental results are promising and show that the proposed visual cognition mining approach is effective.", "citation": "Citations (3)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Chunxi Liu.....http://dblp.org/pers/hd/l/Liu:Chunxi", "Qingming Huang.....http://dblp.org/pers/hd/h/Huang:Qingming", "Shuqiang Jiang.....http://dblp.org/pers/hd/j/Jiang:Shuqiang", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng"], "conf": "mm", "year": "2010", "pages": 10}