{"title": "Video genetics: a case study from YouTube.", "fields": ["clips", "mashup", "query expansion", "analogy", "copying"], "abstract": "We explore in a single but large case study how videos within YouTube, competing for view counts, are like organisms within an ecology, competing for survival. We develop this analogy, whose core idea shows that short video clips, best detected across videos as near-duplicate keyframes, behave similarly to genes. We report work in progress, on a dataset of 5.4K videos with 210K keyframes on a single topic, which traces  sequences , not bags, of \"near-dups\" over time, both within videos and across them. We demonstrate their utility to: cleanse responses to queries contaminated by over-eager YouTube query expansion; separate videos temporally according to their responses to external events; track the evolution and lifespan of continuing video \"stories\"; automatically locate video summaries already present within a video ecology; quickly verify video copying via a direct application of the Smith-Waterman algorithm used in genetics - which also provides useful feedback for tuning the near-dup detection and clustering process; and quickly classify videos via a kind of Lempel-Ziv encoding into the categories of news, monologue, dialogue, and slideshow. We demonstrate a number of novel visualizations of this large dataset, including a direct use of the Matlab black-body \"hot\" false-color map, together with the GraphViz package, to display the gene-like inheritance of viral properties of keyframes. We further speculate that, as with genes, there are \"functional roles\" for semantic categories of clips, and, as with species, there are differing rates of \"genetic drift\" for each video genre.", "citation": "Citations (21)", "departments": ["Columbia University", "IBM", "IBM", "IBM", "IBM"], "authors": ["John R. Kender.....http://dblp.org/pers/hd/k/Kender:John_R=", "Matthew L. Hill.....http://dblp.org/pers/hd/h/Hill:Matthew_L=", "Apostol Natsev.....http://dblp.org/pers/hd/n/Natsev:Apostol", "John R. Smith.....http://dblp.org/pers/hd/s/Smith:John_R=", "Lexing Xie.....http://dblp.org/pers/hd/x/Xie:Lexing"], "conf": "mm", "year": "2010", "pages": 6}