{"title": "Reliable Adaptive Multipath Provisioning with Bandwidth and Differential Delay Constraints.", "fields": ["network element", "special case", "reliability", "multipath propagation", "maximum flow problem"], "abstract": "Robustness and reliability are critical issues in network management. To provide resiliency against network failures, a popular protection scheme against network failures is the simultaneous routing along multiple disjoint paths. Most previous protection and restoration schemes were designed for all-ornothing protection and thus, an overkill for data traffic. In this work, we study the Reliable Adaptive Multipath Provisioning (RAMP) problem with reliability and differential delay constraints. We aim to route the connections in a manner such that link failure does not shut down the entire stream but allows a continuing flow for a significant portion of the traffic along multiple (not necessary disjoint) paths, allowing the whole network to carry sufficient traffic even when link/node failure occurs. The flexibility enabled by a multipath scheme has the tradeoff of differential delay among the diversely routed paths. This requires increased memory in the destination node in order to buffer the traffic until the data arrives on all the paths. Increased buffer size will raise the network element cost and could cause buffer overflow and data corruption. Therefore, differential delay between the multiple paths should be bounded by containing the delay of a path in a range from dmin to dmax. We first prove that RAMP is a NP-hard problem. Then we present a pseudo-polynomial time solution to solve a special case of RAMP, representing edge delays as integers. Next, a (1 + \\epsilon)-approximation is proposed to solve the optimization version of the RAMP problem. We also present numerical results confirming the advantage of our scheme over the current state of art.", "citation": "Citations (479)", "departments": ["North Dakota State University", "Montana State University", "Princeton University", "North Dakota State University"], "authors": ["Weiyi Zhang.....http://dblp.org/pers/hd/z/Zhang:Weiyi", "Jian Tang.....http://dblp.org/pers/hd/t/Tang_0008:Jian", "Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang", "Shanaka de Soysa.....http://dblp.org/pers/hd/s/Soysa:Shanaka_de"], "conf": "infocom", "year": "2010", "pages": 9}