{"title": "Learning shift-invariant sparse representation of actions.", "fields": ["linear combination", "motion analysis", "basis function", "invariant", "sparse approximation"], "abstract": "A central problem in the analysis of motion capture (Mo-Cap) data is how to decompose motion sequences into primitives. Ideally, a description in terms of primitives should facilitate the recognition, synthesis, and characterization of actions. We propose an unsupervised learning algorithm for automatically decomposing joint movements in human motion capture (MoCap) sequences into shift-invariant basis functions. Our formulation models the time series data of joint movements in actions as a sparse linear combination of short basis functions (snippets), which are executed (or “activated”) at different positions in time. Given a set of MoCap sequences of different actions, our algorithm finds the decomposition of MoCap sequences in terms of basis functions and their activations in time. Using the tools of L 1  minimization, the procedure alternately solves two large convex minimizations: Given the basis functions, a variant of Orthogonal Matching Pursuit solves for the activations, and given the activations, the Split Bregman Algorithm solves for the basis functions. Experiments demonstrate the power of the decomposition in a number of applications, including action recognition, retrieval, MoCap data compression, and as a tool for classification in the diagnosis of Parkinson (a motion disorder disease).", "citation": "Citations (54)", "year": "2010", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "National University of Singapore"], "conf": "cvpr", "authors": ["Yi Li.....http://dblp.org/pers/hd/l/Li:Yi", "Cornelia Fermüller.....http://dblp.org/pers/hd/f/Ferm=uuml=ller:Cornelia", "Yiannis Aloimonos.....http://dblp.org/pers/hd/a/Aloimonos:Yiannis", "Hui Ji.....http://dblp.org/pers/hd/j/Ji:Hui"], "pages": 8}