{"title": "Photo2Trip: an interactive trip planning system based on geo-tagged photos.", "fields": ["beijing", "trips architecture", "user requirements document", "travel behavior", "destinations"], "abstract": "In this technical demonstration, we present a novel interactive trip planning system, i.e. Photo2Trip, by leveraging existing travel clues recovered from 20 million geo-tagged photos. Compared with the most common ways of trip planning, such as surveying travelogues and resorting to travel forums, Photo2Trip enables users to plan their trips in a more effective way. To meet users' diverse travel requirements, the system considers the following preferences: travel location (e.g. Beijing, Paris, or New York), travel duration (e.g. a two-day trip or a five-day trip), visiting time (e.g. summer, winter, March, or October), and travel style preference (e.g. prefer historic or prefer scenery sites). According to user requirements, Photo2Trip can automatically recommend popular travel routes among multiple destinations (attractions/ landmarks), and suggest typical internal paths within each destination. Moreover, users are allowed to interactively adjust the suggested plans by adding or removing destinations to get more customized travel routes from the system. Owning to 20 million geo-tagged photos and 200,000 travelogues, Photo2Trip is capable of supporting users plan travel routes for over 30,000 attractions/landmarks in more than 100 countries and territories.", "citation": "Citations (18)", "departments": ["University of Science and Technology of China", "Microsoft", "University of Science and Technology of China", "Microsoft", "Tianjing Univer ... Tianjing, China"], "authors": ["Huagang Yin.....http://dblp.org/pers/hd/y/Yin:Huagang", "Xin Lu.....http://dblp.org/pers/hd/l/Lu:Xin", "Changhu Wang.....http://dblp.org/pers/hd/w/Wang:Changhu", "Nenghai Yu.....http://dblp.org/pers/hd/y/Yu:Nenghai", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Lei"], "conf": "mm", "year": "2010", "pages": 4}