{"title": "Avatar self-embodiment enhances distance perception accuracy in non-photorealistic immersive virtual environments.", "fields": ["immersion", "rendering", "full scale", "replica", "non photorealistic rendering"], "abstract": "Non-photorealistically rendered (NPR) immersive virtual environments (IVEs) can facilitate conceptual design in architecture by enabling preliminary design sketches to be previewed and experienced at full scale, from a first-person perspective. However, it is critical to ensure the accurate spatial perception of the represented information, and many studies have shown that people typically underestimate distances in most IVEs, regardless of rendering style. In previous work we have found that while people tend to judge distances more accurately in an IVE that is a high-fidelity replica of their concurrently occupied real environment than in an IVE that it is a photorealistic representation of a real place that they've never been to, significant distance estimation errors re-emerge when the replica environment is represented in a NPR style. We have also previously found that distance estimation accuracy can be improved, in photo-realistically rendered novel virtual environments, when people are given a fully tracked, high fidelity first person avatar self-embodiment. In this paper we report the results of an experiment that seeks to determine whether providing users with a high-fidelity avatar self-embodiment in a NPR virtual replica environment will enable them to perceive the 3D spatial layout of that environment more accurately. We find that users who are given a first person avatar in an NPR replica environment judge distances more accurately than do users who experience the NPR replica room without an embodiment, but not as accurately as users whose distance judgments are made in a photorealistically rendered virtual replica room. Our results provide a partial solution to the problem of facilitating accurate distance perception in NPR virtual environments, while supporting and expanding the scope of previous findings that giving people a realistic avatar self-embodiment in an IVE can help them to interpret what they see through an HMD in a way that is more similar to how they would interpret a corresponding visual stimulus in the real world.", "citation": "Citations (15)", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "University of Minnesota"], "authors": ["Lane Phillips.....http://dblp.org/pers/hd/p/Phillips:Lane", "Brian Ries.....http://dblp.org/pers/hd/r/Ries:Brian", "Michael Kaeding.....http://dblp.org/pers/hd/k/Kaeding:Michael", "Victoria Interrante.....http://dblp.org/pers/hd/i/Interrante:Victoria"], "conf": "vr", "year": "2010", "pages": 1034}