{"title": "Multi-guarded safe zone: An effective technique to monitor moving circular range queries.", "fields": ["guard", "euclidean distance", "range query", "expected value", "order of magnitude"], "abstract": "Given a positive value r, a circular range query returns the objects that lie within the distance r of the query location. In this paper, we study the circular range queries that continuously change their locations. We present an efficient and effective technique to monitor such moving range queries by utilising the concept of a safe zone. The safe zone of a query is the area with a property that while the query remains inside it, the results of the query remain unchanged. Hence, the query does not need to be re-evaluated unless it leaves the safe zone. The shape of the safe zone is defined by the so-called guard objects. The cost of checking whether a query lies in the safe zone takes k distance computations, where k is the number of the guard objects. Our contributions are as follows. 1) We propose a technique based on powerful pruning rules and a unique access order which efficiently computes the safe zone and minimizes the I/O cost. 2) To show the effectiveness of the safe zone, we theoretically evaluate the probability that a query leaves the safe zone within one time unit and the expected distance a query moves before it leaves the safe zone. Additionally, for the queries that have diameter of the safe zone less than its expected value multiplied by a constant, we also give an upper bound on the expected number of guard objects. This upper bound turns out to be a constant, that is, it does not depend either on the radius r of the query or the density of the objects. The theoretical analysis is verified by extensive experiments. 3) Our thorough experimental study demonstrates that our proposed approach is close to optimal and is an order of magnitude faster than a naive algorithm.", "citation": "Citations (57)", "departments": ["University of New South Wales", "University of Newcastle", "University of New South Wales", "University of New South Wales", "University of New South Wales"], "authors": ["Muhammad Aamir Cheema.....http://dblp.org/pers/hd/c/Cheema:Muhammad_Aamir", "Ljiljana Brankovic.....http://dblp.org/pers/hd/b/Brankovic:Ljiljana", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0011:Wei"], "conf": "icde", "year": "2010", "pages": 12}