{"title": "BGP Churn Evolution: a Perspective from the Core.", "fields": ["scalability", "routing table", "exploratory data analysis", "churn rate", "routing protocol", "limiting", "internetworking"], "abstract": "The scalability limitations of BGP have been a major concern lately. An important aspect of this issue is the rate of routing updates (churn) that BGP routers must process. This paper presents an analysis of the evolution of churn in four networks at the backbone of the Internet over a period of seven years and eight months, using BGP update traces from the RouteViews project. The churn rate varies widely over time and between networks. Instead of descriptive \"black-box\" statistical analysis, we take an exploratory data analysis approach attempting to understand the reasons behind major observed characteristics of the churn time series. We find that duplicate announcements are a major churn contributor, responsible for most large spikes. Remaining spikes are mostly caused by routing incidents that affect a large number of prefixes simultaneously. More long-term intense periods of churn, on the other hand, are caused by misconfigurations or other special events at or close to the monitored autonomous system (AS). After filtering pathologies and effects that are not related to the long-term evolution of churn, we analyze the remaining \"baseline\" churn and find that it is increasing at a rate that is similar to the growth of the number of ASs.", "citation": "Citations (71)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Simula Res. Lab ... Fornebu, Norway", "Simula Res. Lab ... Fornebu, Norway", "Simula Reserach Laboratory", "Simula Reserach Laboratory"], "authors": ["Ahmed Elmokashfi.....http://dblp.org/pers/hd/e/Elmokashfi:Ahmed", "Amund Kvalbein.....http://dblp.org/pers/hd/k/Kvalbein:Amund", "Constantine Dovrolis.....http://dblp.org/pers/hd/d/Dovrolis:Constantine"], "conf": "infocom", "year": "2010", "pages": 9}