{"title": "Enabling a Bufferless Core Network Using Edge-to-Edge Packet-Level FEC.", "fields": ["network packet", "core network", "single core", "forward error correction", "internet traffic"], "abstract": "Internet traffic is expected to grow phenomenally over the next five to ten years, and to cope with such large traffic volumes, core networks are expected to scale to capacities of terabits-per-second and beyond. Increasing the role of optics for switching and transmission inside the core network seems to be the most promising way forward to accomplish this capacity scaling. Unfortunately, unlike electronic memory, it remains a formidable challenge to build even a few packets of integrated all-optical buffers. In the context of envisioning a bufferless (or near-zero buffer) core network, our contributions are threefold: First, we propose a novel edge-to-edge based packet-level forward error correction (FEC) framework as a means of combating high core losses, and investigate via analysis and simulation the appropriate FEC strength for a single core link. Second, we consider a realistic multi-hop network and develop an optimisation framework that adjusts the FEC strength on a per-flow basis to ensure fairness between singleand multi-hop flows. Third, we study the efficacy of FEC for various system parameters such as relative mixes of short-lived and long-lived TCP flows, and average offered link loads. Our study is the first to show that packet-level FEC, when tuned properly, can be very effective in mitigating high core losses, thus opening the doors to a bufferless core network in the future.", "citation": "Citations (14)", "departments": ["University of New South Wales", "University of New South Wales", "Bell Labs", "Georgia Institute of Technology"], "authors": ["Arun Vishwanath.....http://dblp.org/pers/hd/v/Vishwanath:Arun", "Vijay Sivaraman.....http://dblp.org/pers/hd/s/Sivaraman:Vijay", "Marina Thottan.....http://dblp.org/pers/hd/t/Thottan:Marina", "Constantine Dovrolis.....http://dblp.org/pers/hd/d/Dovrolis:Constantine"], "conf": "infocom", "year": "2010", "pages": 9}