{"title": "Abstracting the Differential Semantics of Rule-Based Models: Exact and Automated Model Reduction.", "fields": ["interaction network", "abstract interpretation", "linear combination", "combinatorial explosion", "rule based system"], "abstract": "Rule-based approaches (as in our own Kappa, or the BNG language, or many other propositions allowing the consideration of \"reaction classes'') offer new and more powerful ways to capture the combinatorial interactions that are typical of molecular biological systems. They afford relatively compact and faithful descriptions of cellular interaction networks despite the combination of two broad types of interaction: the formation of complexes (a biological term for the ubiquitous non-covalent binding of bio-molecules), and the chemical modifications of macromolecules (aka post-translational modifications). However, all is not perfect. This same combinatorial explosion that pervades biological systems also seems to prevent the simulation of molecular networks using systems of differential equations. In all but the simplest cases the generation (and even more the integration) of the explicit system of differential equations which is canonically associated to a rule set is unfeasible. So there seems to be a price to pay for this increase in clarity and precision of the description, namely that one can only execute such rule-based systems using their stochastic semantics as continuous time Markov chains, which means a slower if more accurate simulation. In this paper, we take a fresh look at this question, and, using techniques from the abstract interpretation framework, we construct a reduction method which generates (typically) far smaller systems of differential equations than the concrete/canonical one. We show that the abstract/reduced differential system has solutions which are linear combinations of the canonical ones. Importantly, our method: 1) does not require the concrete system to be explicitly computed, so it is intensional, 2) nor does it rely on the choice of a specific set of rate constants for the system to be reduced, so it is symbolic, and 3) achieves good compression when tested on rule-based models of significant size, so it is also realistic.", "citation": "Citations (89)", "departments": ["University of Edinburgh", "Centre national de la recherche scientifique", "Harvard University", "Harvard University", "Centre national de la recherche scientifique"], "authors": ["Vincent Danos.....http://dblp.org/pers/hd/d/Danos:Vincent", "Jérôme Feret.....http://dblp.org/pers/hd/f/Feret:J=eacute=r=ocirc=me", "Walter Fontana.....http://dblp.org/pers/hd/f/Fontana:Walter", "Russell Harmer.....http://dblp.org/pers/hd/h/Harmer:Russell", "Jean Krivine.....http://dblp.org/pers/hd/k/Krivine:Jean"], "conf": "lics", "year": "2010", "pages": 20}