{"title": "Image retagging.", "fields": ["search engine indexing", "semantic similarity", "synonym", "annotation", "versa"], "abstract": "Online social media repositories such as Flickr and Zooomr allow users to manually annotate their images with freely-chosen tags, which are then used as indexing keywords to facilitate image search and other applications. However, these tags are frequently imprecise and incomplete, though they are provided by human beings, and many of them are almost only meaningful for the image owners (such as the name of a dog). Thus there is still a gap between these tags and the actual content of the images, and this significantly limits tag-based applications, such as search and browsing. To tackle this issue, this paper proposes a social image \"retagging\" scheme that aims at assigning images with better content descriptors. The refining process, including denoising and enriching, is formulated as an optimization framework based on the consistency between \"visual similarity\" and \"semantic similarity\" in social images, that is, the visually similar images tend to have similar semantic descriptors, and vice versa. An effective iterative bound optimization algorithm is applied to learn the improved tag assignment. In addition, as many tags are intrinsically not closely-related to the visual content of the images, we employ knowledge based method to differentiate visual content related tags from unrelated ones and then constrain the tagging vocabulary of our automatic algorithm within the content related tags. Finally, to improve the coverage of the tags, we further enrich the tag set with appropriate synonyms and hypernyms based on an external knowledge base. Experimental results on a Flickr image collection demonstrate the effectiveness of this approach. We will also show the remarkable performance improvements brought by retagging via two applications, i.e., tag-based search and automatic annotation.", "citation": "Citations (120)", "departments": ["Harbin Institute of Technology", "Microsoft", "Microsoft", "Advanced Technology Center"], "authors": ["Dong Liu.....http://dblp.org/pers/hd/l/Liu_0001:Dong", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Hong-Jiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hong=Jiang"], "conf": "mm", "year": "2010", "pages": 10}