{"title": "Fast sort on CPUs and GPUs: a case for bandwidth oblivious SIMD sort.", "fields": ["selection sort", "counting sort", "adaptive sort", "merge algorithm", "insertion sort"], "abstract": "Sort is a fundamental kernel used in many database operations. In-memory sorts are now feasible; sort performance is limited by compute flops and main memory bandwidth rather than I/O. In this paper, we present a competitive analysis of comparison and non-comparison based sorting algorithms on two modern architectures - the latest CPU and GPU architectures. We propose novel CPU radix sort and GPU merge sort implementations which are 2X faster than previously published results. We perform a fair comparison of the algorithms using these best performing implementations on both architectures. While radix sort is faster on current architectures, the gap narrows from CPU to GPU architectures. Merge sort performs better than radix sort for sorting keys of large sizes - such keys will be required to accommodate the increasing cardinality of future databases. We present analytical models for analyzing the performance of our implementations in terms of architectural features such as core count, SIMD and bandwidth. Our obtained performance results are successfully predicted by our models. Our analysis points to merge sort winning over radix sort on future architectures due to its efficient utilization of SIMD and low bandwidth utilization. We simulate a 64-core platform with varying SIMD widths under constant bandwidth per core constraints, and show that large data sizes of 2 40  (one trillion records), merge sort performance on large key sizes is up to 3X better than radix sort for large SIMD widths on future architectures. Therefore, merge sort should be the sorting method of choice for future databases.", "citation": "Citations (218)", "year": "2010", "departments": ["Intel", "Intel", "Intel", "Intel", "Intel"], "conf": "sigmod", "authors": ["Nadathur Satish.....http://dblp.org/pers/hd/s/Satish:Nadathur", "Changkyu Kim.....http://dblp.org/pers/hd/k/Kim:Changkyu", "Jatin Chhugani.....http://dblp.org/pers/hd/c/Chhugani:Jatin", "Anthony D. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Anthony_D=", "Victor W. Lee.....http://dblp.org/pers/hd/l/Lee:Victor_W=", "Daehyun Kim.....http://dblp.org/pers/hd/k/Kim:Daehyun", "Pradeep Dubey.....http://dblp.org/pers/hd/d/Dubey:Pradeep"], "pages": 12}