{"title": "TaintDroid: An Information-Flow Tracking System for Realtime Privacy Monitoring on Smartphones.", "fields": ["tracking system", "security service", "mobile malware", "information flow", "android", "private information retrieval"], "abstract": "Today's smartphone operating systems frequently fail to provide users with adequate control over and visibility into how third-party applications use their private data. We address these shortcomings with TaintDroid, an efficient, system-wide dynamic taint tracking and analysis system capable of simultaneously tracking multiple sources of sensitive data. TaintDroid provides realtime analysis by leveraging Android's virtualized execution environment. TaintDroid incurs only 14% performance overhead on a CPU-bound micro-benchmark and imposes negligible overhead on interactive third-party applications. Using TaintDroid to monitor the behavior of 30 popular third-party Android applications, we found 68 instances of potential misuse of users' private information across 20 applications. Monitoring sensitive data with TaintDroid provides informed use of third-party applications for phone users and valuable input for smartphone security service firms seeking to identify misbehaving applications.", "citation": "Citations (2,267)", "year": "2010", "departments": ["Pennsylvania State University", "Duke University", "Intel", "Duke University", "Intel", "North Carolina State University", "Duke University", "University of Washington", "North Carolina State University", "Seoul National University"], "conf": "osdi", "authors": ["William Enck.....http://dblp.org/pers/hd/e/Enck:William", "Peter Gilbert.....http://dblp.org/pers/hd/g/Gilbert:Peter", "Byung-Gon Chun.....http://dblp.org/pers/hd/c/Chun:Byung=Gon", "Landon P. Cox.....http://dblp.org/pers/hd/c/Cox:Landon_P=", "Jaeyeon Jung.....http://dblp.org/pers/hd/j/Jung:Jaeyeon", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D=", "Anmol Sheth.....http://dblp.org/pers/hd/s/Sheth:Anmol"], "pages": 15}