{"title": "Efficient additive kernels via explicit feature maps.", "fields": ["kernel", "tree kernel", "closed form expression", "group method of data handling", "approximation theory", "kernel method", "variable kernel density estimation", "fourier analysis", "histogram"], "abstract": "Large scale nonlinear support vector machines (SVMs) can be approximated by linear ones using a suitable feature map. The linear SVMs are in general much faster to learn and evaluate (test) than the original nonlinear SVMs. This work introduces explicit feature maps for the additive class of kernels, such as the intersection, Hellinger's, and χ 2  kernels, commonly used in computer vision, and enables their use in large scale problems. In particular, we: 1) provide explicit feature maps for all additive homogeneous kernels along with closed form expression for all common kernels; 2) derive corresponding approximate finite-dimensional feature maps based on a spectral analysis; and 3) quantify the error of the approximation, showing that the error is independent of the data dimension and decays exponentially fast with the approximation order for selected kernels such as χ 2 . We demonstrate that the approximations have indistinguishable performance from the full kernels yet greatly reduce the train/test times of SVMs. We also compare with two other approximation methods: Nystrom's approximation of Perronnin et al. [1], which is data dependent, and the explicit map of Maji and Berg [2] for the intersection kernel, which, as in the case of our approximations, is data independent. The approximations are evaluated on a number of standard data sets, including Caltech-101 [3], Daimler-Chrysler pedestrians [4], and INRIA pedestrians [5].", "citation": "Citations (1,011)", "year": "2010", "departments": ["University of Oxford", "University of Oxford", "University of Oxford", "University of Oxford"], "conf": "cvpr", "authors": ["Andrea Vedaldi.....http://dblp.org/pers/hd/v/Vedaldi:Andrea", "Andrew Zisserman.....http://dblp.org/pers/hd/z/Zisserman:Andrew"], "pages": 8}