{"title": "Indexing multi-dimensional data in a cloud system.", "fields": ["search engine indexing", "can bus", "overlay", "scalability", "online transaction processing"], "abstract": "Providing scalable database services is an essential requirement for extending many existing applications of the Cloud platform. Due to the diversity of applications, database services on the Cloud must support large-scale data analytical jobs and high concurrent OLTP queries. Most existing work focuses on some specific type of applications. To provide an integrated framework, we are designing a new system, epiC, as our solution to next-generation database systems. In epiC, indexes play an important role in improving overall performance. Different types of indexes are built to provide efficient query processing for different applications.   In this paper, we propose RT-CAN, a multi-dimensional indexing scheme in epiC. RT-CAN integrates CAN [23] based routing protocol and the R-tree based indexing scheme to support efficient multi-dimensional query processing in a Cloud system. RT-CAN organizes storage and compute nodes into an overlay structure based on an extended CAN protocol. In our proposal, we make a simple assumption that each compute node uses an R-tree like indexing structure to index the data that are locally stored. We propose a query-conscious cost model that selects beneficial local R-tree nodes for publishing. By keeping the number of persistently connected nodes small and maintaining a global multi-dimensional search index, we can locate the compute nodes that may contain the answer with a few hops, making the scheme scalable in terms of data volume and number of compute nodes. Experiments on Amazon's EC2 show that our proposed routing protocol and indexing scheme are robust, efficient and scalable.", "citation": "Citations (211)", "year": "2010", "departments": ["Harbin Institute of Technology", "National University of Singapore", "Harbin Institute of Technology", "Harbin Institute of Technology", "National University of Singapore"], "conf": "sigmod", "authors": ["Jinbao Wang.....http://dblp.org/pers/hd/w/Wang:Jinbao", "Sai Wu.....http://dblp.org/pers/hd/w/Wu:Sai", "Hong Gao.....http://dblp.org/pers/hd/g/Gao:Hong", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin"], "pages": 12}