{"title": "XBRL repository - an industrial approach of management of XBRL documents.", "fields": ["data modeling", "document management system", "data exchange", "xbrl", "business reporting"], "abstract": "XBRL (extensible Business Reporting Language) is an XML based standard for electronic data exchange and communication of business financial documents and reports among government bodies, regulators, financial institutions and reporting entities. In this paper, we analyze the XBRL model from a perspective of data management to show why XBRL has created a new emerging vertical domain of database applications that offer opportunities and technical challenges for the database community. We outline the concept of an XBRL repository as a data hub to store and process collections of XBRL documents while maintaining document integrity based on XBRL semantics, providing document manageability, operational completeness and XBRL dictionary, query and business intelligence services. We then share our experiences of building the main components of the XBRL repository using the Oracle XML enabled RDBMS that leverages both XML and relational technologies as a backbone to host industrial strength XBRL applications. We also highlight technical challenges and potential solutions to each of the components. Finally we propose the potential of leveraging the XBRL data model concept for providing XML data normalization and XML having multi-hierarchy.", "citation": "Citations (1)", "departments": ["Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation"], "authors": ["Zhen Hua Liu.....http://dblp.org/pers/hd/l/Liu:Zhen_Hua", "Thomas Baby.....http://dblp.org/pers/hd/b/Baby:Thomas", "Sriram Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Sriram", "Ying Lu.....http://dblp.org/pers/hd/l/Lu:Ying", "Qin Yu.....http://dblp.org/pers/hd/y/Yu:Qin", "Anguel Novoselsky.....http://dblp.org/pers/hd/n/Novoselsky:Anguel", "Vikas Arora.....http://dblp.org/pers/hd/a/Arora:Vikas"], "conf": "icde", "year": "2010", "pages": 11}