{"title": "FENCE: Continuous access control enforcement in dynamic data stream environments.", "fields": ["enforcement", "computer security model", "xacml", "data stream mining", "security service", "dynamic data", "data security", "metadata"], "abstract": "In this paper, we address the problem of continuous access control enforcement in dynamic data stream environments, where both data and query security restrictions may potentially change in real-time. We present FENCE framework that ffectively addresses this problem. The distinguishing characteristics of FENCE include: (1) the stream-centric approach to security, (2) the symmetric model for security settings of both continuous queries and streaming data, and (3) two alternative security-aware query processing approaches that can optimize query execution based on regular and security-related selectivities. In FENCE, both data and query security restrictions are modeled symmetrically in the form of security metadata, called \"security punctuations\" embedded inside data streams. We distinguish between two types of security punctuations, namely, the data security punctuations (or short, dsps) which represent the access control policies of the streaming data, and the query security punctuations (or short, qsps) which describe the access authorizations of the continuous queries. We also present our encoding method to support XACML(eXtensible Access Control Markup Language) standard. We have implemented FENCE in a prototype DSMS and present our performance evaluation. The results of our experimental study show that FENCE's approach has low overhead and can give great performance benefits compared to the alternative security solutions for streaming environments.", "citation": "Citations (19)", "departments": ["Microsoft", "Yonsei University", "Purdue University", "Microsoft", "Purdue University", "Purdue University"], "authors": ["Rimma V. Nehme.....http://dblp.org/pers/hd/n/Nehme:Rimma_V=", "Hyo-Sang Lim.....http://dblp.org/pers/hd/l/Lim:Hyo=Sang", "Elisa Bertino.....http://dblp.org/pers/hd/b/Bertino:Elisa"], "conf": "icde", "year": "2010", "pages": 4}