{"title": "Approximate Capacity Subregions of Uniform Multihop Wireless Networks.", "fields": ["polytope", "compromise", "optimization problem", "capacity optimization", "approximation algorithm"], "abstract": "The capacity region of multihop wireless network is involved in many capacity optimization problems. However, the membership of the capacity region is NP-complete in general, and hence the direct application of capacity region is quite limited. As a compromise, we often substitute the capacity region with a polynomial approximate capacity subregion. In this paper, we construct polynomial μ-approximate capacity subregions of multihop wireless network under either 802.11 interference model or protocol interference model in which all nodes have uniform communication radii normalized to one and uniform interference radii ρ≥1. The approximation factor μ decreases with ρ in general and is smaller than the best-known ones in the literature. For example, μ=3 when ρ≥2.2907 under the 802.11 interference model or when ρ≥4.2462 under the protocol interference model. Our construction exploits a nature of the wireless interference called strip-wise transitivity of independence discovered in this paper and utilize the independence polytopes of cocomparability graphs in a spatial-divide-conquer manner. We also apply these polynomial μ-approximate capacity subregions to compute μ-approximate solutions for maximum (concurrent) multiflows.", "citation": "Citations (4)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong"], "authors": ["Peng-Jun Wan.....http://dblp.org/pers/hd/w/Wan:Peng=Jun", "Lixin Wang.....http://dblp.org/pers/hd/w/Wang:Lixin", "Ai Huang.....http://dblp.org/pers/hd/h/Huang:Ai", "Minming Li.....http://dblp.org/pers/hd/l/Li:Minming", "F. Frances Yao.....http://dblp.org/pers/hd/y/Yao:F=_Frances"], "conf": "infocom", "year": "2010", "pages": 9}