{"title": "Universal One-Way Hash Functions via Inaccessible Entropy.", "fields": ["cryptographic primitive", "one way function", "pseudorandom number generator", "universal hashing", "prefix", "swifft", "perfect hash function", "cryptographic hash function", "collision resistance"], "abstract": "This paper revisits the construction of Universal One-Way Hash Functions (UOWHFs) from any one-way function due to Rompel (STOC 1990). We give a simpler construction of UOWHFs, which also obtains better efficiency and security. The construction exploits a strong connection to the recently introduced notion of inaccessible entropy (Haitner et al. STOC 2009). With this perspective, we observe that a small tweak of any one-way function f is already a weak form of a UOWHF: Consider F(x,i) that outputs the i-bit long prefix of f(x). If F were a UOWHF then given a random x and i it would be hard to come up with x′≠x such that F(x,i)=F(x′,i). While this may not be the case, we show (rather easily) that it is hard to sample x′ with almost full entropy among all the possible such values of x′. The rest of our construction simply amplifies and exploits this basic property.\n\nWith this and other recent works, we have that the constructions of three fundamental cryptographic primitives (Pseudorandom Generators, Statistically Hiding Commitments and UOWHFs) out of one-way functions are to a large extent unified. In particular, all three constructions rely on and manipulate computational notions of entropy in similar ways. Pseudorandom Generators rely on the well-established notion of pseudoentropy, whereas Statistically Hiding Commitments and UOWHFs rely on the newer notion of inaccessible entropy.", "citation": "Not cited", "year": "2010", "departments": ["Microsoft", "ETH Zurich", "Weizmann Institute of Science", "Harvard University", "Queens College"], "conf": "eurocrypt", "authors": ["Iftach Haitner.....http://dblp.org/pers/hd/h/Haitner:Iftach", "Thomas Holenstein.....http://dblp.org/pers/hd/h/Holenstein:Thomas", "Omer Reingold.....http://dblp.org/pers/hd/r/Reingold:Omer", "Salil P. Vadhan.....http://dblp.org/pers/hd/v/Vadhan:Salil_P=", "Hoeteck Wee.....http://dblp.org/pers/hd/w/Wee:Hoeteck"], "pages": 22}