{"title": "VRACK - virtual reality augmented cycling kit: Design and validation.", "fields": ["haptic technology", "virtual machine", "cycling", "modular design", "3d interaction"], "abstract": "In this paper the virtual reality augmented cycling kit (VRACK) a mechatronic rehabilitation system with an interactive virtual environment is presented. It was designed as a modular system that can convert most bicycles in virtual reality (VR) cycles. Novel hardware components embedded with sensors were implemented on a stationary exercise bicycle to monitor physiological and biomechanical parameters of participants while immersing them in a virtual reality simulation providing the user with visual, auditory and haptic feedback. This modular and adaptable system attaches to commercially-available stationary bicycle systems and interfaces with a personal computer for simulation and data acquisition processes. The bicycle system includes novel handle bars based on hydraulic pressure sensors and innovative pedals that monitor lower extremity kinetics and kinematics. Parameters monitored by these systems are communicated to a practitioner's interface screen and can be amplified before entering its virtual environment. The first prototype of the system was successful in demonstrating that a modular mechatronic kit can monitor and record kinetic, kinematic and physiologic parameters of riders.", "citation": "Citations (18)", "departments": ["Northeastern University", "Northeastern University", "University of Medicine and Dentistry of New Jersey", "VRehab LLC, Jer ... y City, NJ, USA", "VRehab LLC, Jer ... y City, NJ, USA"], "authors": ["Richard Ranky.....http://dblp.org/pers/hd/r/Ranky:Richard", "Mark Sivak.....http://dblp.org/pers/hd/s/Sivak:Mark", "Jeffrey A. Lewis.....http://dblp.org/pers/hd/l/Lewis:Jeffrey_A=", "Venkata Gade.....http://dblp.org/pers/hd/g/Gade:Venkata", "Judith E. Deutsch.....http://dblp.org/pers/hd/d/Deutsch:Judith_E=", "Constantinos Mavroidis.....http://dblp.org/pers/hd/m/Mavroidis:Constantinos"], "conf": "vr", "year": "2010", "pages": 4}