{"title": "Constructing and exploring composite items.", "fields": ["data set", "automatic summarization", "e commerce", "ranging", "usb"], "abstract": "Nowadays, online shopping has become a daily activity. Web users purchase a variety of items ranging from books to electronics. The large supply of online products calls for sophisticated techniques to help users explore available items. We propose to build  composite items  which associate a  central item  with  a set of packages , formed by  satellite items , and help users explore them. For example, a user shopping for an  iPhone  (i.e., the   central item) with a price budget can be presented with both the iPhone and a package of other items that match well with the iPhone (e.g., { Belkin case, Bose sounddock, Kroo USB cable} ) as a composite item, whose total price is within the user's budget. We define and study the problem of effective construction and exploration of large sets of packages associated with a central item, and design and implement efficient algorithms for solving the problem in two stages:  summarization , a technique which picks  k  representative packages for each central item; and  visual effect optimization , which helps the user find diverse composite items quickly by minimizing overlap between packages presented to the user in a ranked order. We conduct an extensive set of experiments on Yahoo! Shopping 1  data sets to demonstrate the efficiency and effectiveness of our algorithms.", "citation": "Citations (53)", "year": "2010", "departments": ["University of Texas at Arlington", "Yahoo!", "University of Texas at Arlington", "University of Texas at Arlington", "Yahoo!"], "conf": "sigmod", "authors": ["Senjuti Basu Roy.....http://dblp.org/pers/hd/r/Roy:Senjuti_Basu", "Sihem Amer-Yahia.....http://dblp.org/pers/hd/a/Amer=Yahia:Sihem", "Ashish Chawla.....http://dblp.org/pers/hd/c/Chawla:Ashish", "Gautam Das.....http://dblp.org/pers/hd/d/Das_0001:Gautam", "Cong Yu.....http://dblp.org/pers/hd/y/Yu_0001:Cong"], "pages": 12}