{"title": "Bridging low-level features and high-level semantics via fMRI brain imaging for video classification.", "fields": ["working memory", "functional magnetic resonance imaging", "content analysis", "trecvid", "semantics"], "abstract": "The multimedia content analysis community has made significant effort to bridge the gap between low-level features and high-level semantics perceived by human cognitive systems such as real-world objects and concepts. In the two fields of multimedia analysis and brain imaging, both topics of low-level features and high level semantics are extensively studied. For instance, in the multimedia analysis field, many algorithms are available for multimedia feature extraction, and benchmark datasets are available such as the TRECVID. In the brain imaging field, brain regions that are responsible for vision, auditory perception, language, and working memory are well studied via functional magnetic resonance imaging (fMRI). This paper presents our initial effort in marrying these two fields in order to bridge the gaps between low-level features and high-level semantics via fMRI brain imaging. Our experimental paradigm is that we performed fMRI brain imaging when university student subjects watched the video clips selected from the TRECVID datasets. At current stage, we focus on the three concepts of sports, weather, and commercial-/advertisement specified in the TRECVID 2005. Meanwhile, the brain regions in vision, auditory, language, and working memory networks are quantitatively localized and mapped via task-based paradigm fMRI, and the fMRI responses in these regions are used to extract features as the representation of the brain's comprehension of semantics. Our computational framework aims to learn the most relevant low-level feature sets that best correlate the fMRI-derived semantics based on the training videos with fMRI scans, and then the learned models are applied to larger scale test datasets without fMRI scans for category classifications. Our result shows that: 1) there are meaningful couplings between brain's fMRI responses and video stimuli, suggesting the validity of linking semantics and low-level features via fMRI; 2) The computationally learned low-level feature sets from fMRI-derived semantic features can significantly improve the classification of video categories in comparison with that based on original low-level features.", "citation": "Citations (20)", "departments": ["Northwestern Polytechnical University", "University of Georgia", "Northwestern Polytechnical University", "Northwestern Polytechnical University", "Northwestern Polytechnical University"], "authors": ["Xintao Hu.....http://dblp.org/pers/hd/h/Hu:Xintao", "Fan Deng.....http://dblp.org/pers/hd/d/Deng:Fan", "Kaiming Li.....http://dblp.org/pers/hd/l/Li:Kaiming", "Tuo Zhang.....http://dblp.org/pers/hd/z/Zhang:Tuo", "Hanbo Chen.....http://dblp.org/pers/hd/c/Chen:Hanbo", "Xi Jiang.....http://dblp.org/pers/hd/j/Jiang:Xi", "Jinglei Lv.....http://dblp.org/pers/hd/l/Lv:Jinglei", "Dajiang Zhu.....http://dblp.org/pers/hd/z/Zhu:Dajiang", "Carlos Faraco.....http://dblp.org/pers/hd/f/Faraco:Carlos", "Degang Zhang.....http://dblp.org/pers/hd/z/Zhang:Degang", "Arsham Mesbah.....http://dblp.org/pers/hd/m/Mesbah:Arsham", "Junwei Han.....http://dblp.org/pers/hd/h/Han:Junwei", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Li Xie.....http://dblp.org/pers/hd/x/Xie:Li", "L. Stephen Miller.....http://dblp.org/pers/hd/m/Miller:L=_Stephen", "Lei Guo.....http://dblp.org/pers/hd/g/Guo_0002:Lei", "Tianming Liu.....http://dblp.org/pers/hd/l/Liu:Tianming"], "conf": "mm", "year": "2010", "pages": 10}