{"title": "Helper locks for fork-join parallel programming.", "fields": ["lock", "cilk", "small number", "speedup", "work stealing"], "abstract": "Helper locks allow programs with large parallel critical sections, called parallel regions, to execute more efficiently by enlisting processors that might otherwise be waiting on the helper lock to aid in the execution of the parallel region. Suppose that a processor  p  is executing a parallel region  A  after having acquired the lock  L  protecting  A . If another processor  p ′ tries to acquire  L , then instead of blocking and waiting for  p  to complete  A , processor  p ′ joins  p  to help it complete  A . Additional processors not blocked on  L  may also help to execute  A .   The HELPER runtime system can execute fork-join computations augmented with helper locks and parallel regions. HELPER supports the unbounded nesting of parallel regions. We provide theoretical completion-time and space-usage bounds for a design of HELPER based on work stealing. Specifically, let  V  be the number of parallel regions in a computation, let  T  1  be its work, and let  T ∞ be its \"aggregate span\" --- the sum of the spans (critical-path lengths) of all its parallel regions. We prove that HELPER completes the computation in expected time  O ( T  1 / P P +  T ∞+  PV  on  P  processors. This bound indicates that programs with a small number of highly parallel critical sections can attain linear speedup. For the space bound, we prove that HELPER completes a program using only  O ( P S 1  stack space, where S 1  is the sum, over all regions, of the stack space used by each region in a serial execution. Finally, we describe a prototype of HELPER implemented by modifying the Cilk multithreaded runtime system. We used this prototype to implement a concurrent hash table with a resize operation protected by a helper lock.", "citation": "Citations (11)", "year": "2010", "departments": ["Washington University in St. Louis", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "ppopp", "authors": ["Kunal Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Kunal", "Charles E. Leiserson.....http://dblp.org/pers/hd/l/Leiserson:Charles_E=", "Jim Sukha.....http://dblp.org/pers/hd/s/Sukha:Jim"], "pages": 12}