{"title": "A game-theoretic approach to fine surface registration without initial motion estimation.", "fields": ["solid modeling", "metric", "image registration", "shape analysis", "compatibility"], "abstract": "Surface registration is a fundamental step in the reconstruction of three-dimensional objects. This is typically a two step process where an initial coarse motion estimation is followed by a refinement. Most coarse registration algorithms exploit some local point descriptor that is intrinsic to the shape and does not depend on the relative position of the surfaces. By contrast, refinement techniques iteratively minimize a distance function measured between pairs of selected neighboring points and are thus strongly dependent on initial alignment. In this paper we propose a novel technique that allows to obtain a fine surface registration in a single step, without the need of an initial motion estimation. The main idea of our approach is to cast the selection of correspondences between points on the surfaces in a game-theoretic framework, where a natural selection process allows mating points that satisfy a mutual rigidity constraint to thrive, eliminating all the other correspondences. This process yields a very robust inlier selection scheme that does not depend on any particular technique for selecting the initial strategies as it relies only on the global geometric compatibility between correspondences. The practical effectiveness of the proposed approach is confirmed by an extensive set of experiments and comparisons with state-of-the-art techniques.", "citation": "Citations (20)", "year": "2010", "departments": ["Ca' Foscari University of Venice", "Ca' Foscari University of Venice", "Ca' Foscari University of Venice"], "conf": "cvpr", "authors": ["Andrea Albarelli.....http://dblp.org/pers/hd/a/Albarelli:Andrea", "Emanuele Rodolà.....http://dblp.org/pers/hd/r/Rodol=agrave=:Emanuele", "Andrea Torsello.....http://dblp.org/pers/hd/t/Torsello:Andrea"], "pages": 8}