{"title": "Unified tag analysis with multi-edge graph.", "fields": ["vertex", "cutting plane method", "pairwise comparison", "thresholding", "multiple edges"], "abstract": "Image tags have become a key intermediate vehicle to organize, index and search the massive online image repositories. Extensive research has been conducted on different yet related tag analysis tasks, e.g., tag refinement, tag-to-region assignment, and automatic tagging. In this paper, we propose a new concept of multi-edge graph, through which a unified solution is derived for the different tag analysis tasks. Specifically, each vertex of the graph is first characterized by a unique image. Then each image is encoded as a region bag with multiple image segmentations, and the thresholding of the pairwise similarities between regions naturally constructs the multiple edges between each vertex pair. The unified tag analysis is then generally described as the tag propagation between a vertex and its edges, as well as between all edges cross the entire image repository. We develop a core vertex-vs-edge tag equation unique for multi-edge graph to unify the image/vertex tag(s) and region-pair/edge tag(s). Finally, unified tag analysis is formulated as a constrained optimization problem, where the objective function characterizing the cross-patch tag consistency is constrained by the core equations for all vertex pairs, and the cutting plane method is used for efficient optimization. Extensive experiments on various tag analysis tasks over three widely used benchmark datasets validate the effectiveness of our proposed unified solution.", "citation": "Citations (60)", "departments": ["Harbin Institute of Technology", "National University of Singapore", "Microsoft", "Advanced Technology Center"], "authors": ["Dong Liu.....http://dblp.org/pers/hd/l/Liu_0001:Dong", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Yong Rui.....http://dblp.org/pers/hd/r/Rui:Yong", "Hong-Jiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hong=Jiang"], "conf": "mm", "year": "2010", "pages": 10}