{"title": "Extracting temporal signatures for comprehending systems biology models.", "fields": ["network model", "complex systems", "biological network", "ordinal number", "comprehension"], "abstract": "Systems biology has made massive strides in recent years, with capabilities to model complex systems including cell division, stress response, energy metabolism, and signaling pathways. Concomitant with their improved modeling capabilities, however, such biochemical network models have also become notoriously complex for humans to comprehend. We propose network comprehension as a key problem for the KDD community, where the goal is to create explainable representations of complex biological networks. We formulate this problem as one of extracting temporal signatures from multi-variate time series data, where the signatures are composed of ordinal comparisons between time series components. We show how such signatures can be inferred by formulating the data mining problem as one of feature selection in rank-order space. We propose five new feature selection strategies for rank-order space and assess their selective superiorities. Experimental results on budding yeast cell cycle models demonstrate compelling results comparable to human interpretations of the cell cycle.", "citation": "Citations (1)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech", "Ateneo de Manila University"], "authors": ["Naren Sundaravaradan.....http://dblp.org/pers/hd/s/Sundaravaradan:Naren", "K. S. M. Tozammel Hossain.....http://dblp.org/pers/hd/h/Hossain:K=_S=_M=_Tozammel", "Vandana Sreedharan.....http://dblp.org/pers/hd/s/Sreedharan:Vandana", "Douglas J. Slotta.....http://dblp.org/pers/hd/s/Slotta:Douglas_J=", "John Paul C. Vergara.....http://dblp.org/pers/hd/v/Vergara:John_Paul_C=", "Lenwood S. Heath.....http://dblp.org/pers/hd/h/Heath:Lenwood_S=", "Naren Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Naren"], "conf": "kdd", "year": "2010", "pages": 10}