{"title": "Data warehousing and analytics infrastructure at facebook.", "fields": ["data discovery", "analytics", "data analysis", "shared resource", "use case"], "abstract": "Scalable analysis on large data sets has been core to the functions of a number of teams at Facebook - both engineering and non-engineering. Apart from ad hoc analysis of data and creation of business intelligence dashboards by analysts across the company, a number of Facebook's site features are also based on analyzing large data sets. These features range from simple reporting applications like Insights for the Facebook Advertisers, to more advanced kinds such as friend recommendations. In order to support this diversity of use cases on the ever increasing amount of data, a flexible infrastructure that scales up in a cost effective manner, is critical. We have leveraged, authored and contributed to a number of open source technologies in order to address these requirements at Facebook. These include Scribe, Hadoop and Hive which together form the cornerstones of the log collection, storage and analytics infrastructure at Facebook. In this paper we will present how these systems have come together and enabled us to implement a data warehouse that stores more than 15PB of data (2.5PB after compression) and loads more than 60TB of new data (10TB after compression) every day. We discuss the motivations behind our design choices, the capabilities of this solution, the challenges that we face in day today operations and future capabilities and improvements that we are working on.", "citation": "Citations (426)", "year": "2010", "departments": ["Facebook", "Facebook", "Facebook", "Facebook", "Facebook"], "conf": "sigmod", "authors": ["Ashish Thusoo.....http://dblp.org/pers/hd/t/Thusoo:Ashish", "Zheng Shao.....http://dblp.org/pers/hd/s/Shao:Zheng", "Suresh Anthony.....http://dblp.org/pers/hd/a/Anthony:Suresh", "Dhruba Borthakur.....http://dblp.org/pers/hd/b/Borthakur:Dhruba", "Namit Jain.....http://dblp.org/pers/hd/j/Jain:Namit", "Joydeep Sen Sarma.....http://dblp.org/pers/hd/s/Sarma:Joydeep_Sen", "Raghotham Murthy.....http://dblp.org/pers/hd/m/Murthy:Raghotham", "Hao Liu.....http://dblp.org/pers/hd/l/Liu_0018:Hao"], "pages": 8}