{"title": "On the Connectivity Analysis over Large-Scale Hybrid Wireless Networks.", "fields": ["wireless ad hoc network", "upper and lower bounds", "wireless network", "network architecture", "mesh networking"], "abstract": "Many real systems are hybrid networks which include infrastructure nodes in multi-hop wireless networks, such as sinks in sensor networks and mesh routers in mesh networks. However, we have very little understanding of network connectivity in such networks. Therefore, in this paper, we consider hybrid networks denoted by $H(\\alpha,\\beta)$ with ad hoc nodes and base stations and prove how base stations can improve the connectivity of ad hoc nodes in {\\em subcritical phase}, that is, the ad hoc node density, $\\lambda_{\\alpha}$ is lower than the critical density $\\lambda_{\\alpha}^c$. We find that with the existence of a positive density of base stations, i.e., the density of base stations $\\lambda_{\\beta}>0$ which have the same transmission range as ad hoc nodes, the number of connected ad hoc nodes is $\\Theta(n)$ with probability nearly $1$, where $n$ is the number of ad hoc nodes. However, the size of connected ad hoc component scales linearly with $\\lambda_{\\beta}$ when it is lower than $c_1(\\lambda_{\\alpha})$ with probability nearly $1$, which demonstrates a tremendous benefit of using base stations to enhance the connectivity of ad hoc nodes. Further, we study a hybrid network architecture that makes a significant connectivity improvement with transmission range $r_{\\beta}$ larger than $r_{\\alpha}$ for ad hoc nodes. Therefore, our results provide a theoretical understanding of to what extent ad hoc nodes can benefit from base stations in multi-hop wireless networks.", "citation": "Citations (6)", "departments": ["North Carolina State University", "North Carolina State University"], "authors": ["Chi Yi.....http://dblp.org/pers/hd/y/Yi:Chi", "Wenye Wang.....http://dblp.org/pers/hd/w/Wang:Wenye"], "conf": "infocom", "year": "2010", "pages": 9}