{"title": "Increasing depth resolution of electron microscopy of neural circuits using sparse tomographic reconstruction.", "fields": ["tomography", "architecture", "tomographic reconstruction", "compressed sensing", "biological neural network"], "abstract": "Future progress in neuroscience hinges on reconstruction of neuronal circuits to the level of individual synapses. Because of the specifics of neuronal architecture, imaging must be done with very high resolution and throughput. While Electron Microscopy (EM) achieves the required resolution in the transverse directions, its depth resolution is a severe limitation. Computed tomography (CT) may be used in conjunction with electron microscopy to improve the depth resolution, but this severely limits the throughput since several tens or hundreds of EM images need to be acquired. Here, we exploit recent advances in signal processing to obtain high depth resolution EM images computationally. First, we show that the brain tissue can be represented as sparse linear combination of local basis functions that are thin membrane-like structures oriented in various directions. We then develop reconstruction techniques inspired by compressive sensing that can reconstruct the brain tissue from very few (typically 5) tomographic views of each section. This enables tracing of neuronal connections across layers and, hence, high throughput reconstruction of neural circuits to the level of individual synapses.", "citation": "Citations (20)", "year": "2010", "departments": ["MERL, Cambridge MA", "HHMI, Ashburn, VA", "HHMI, Ashburn, VA", "HHMI, Ashburn, VA", "HHMI, Ashburn, VA"], "conf": "cvpr", "authors": ["Ashok Veeraraghavan.....http://dblp.org/pers/hd/v/Veeraraghavan:Ashok", "Alex V. Genkin.....http://dblp.org/pers/hd/g/Genkin:Alex_V=", "Shiv Naga Prasad Vitaladevuni.....http://dblp.org/pers/hd/v/Vitaladevuni:Shiv_Naga_Prasad", "Lou Scheffer.....http://dblp.org/pers/hd/s/Scheffer:Lou", "Shan Xu.....http://dblp.org/pers/hd/x/Xu:Shan", "Harald F. Hess.....http://dblp.org/pers/hd/h/Hess:Harald_F=", "Richard Fetter.....http://dblp.org/pers/hd/f/Fetter:Richard", "Marco Cantoni.....http://dblp.org/pers/hd/c/Cantoni:Marco", "Graham Knott.....http://dblp.org/pers/hd/k/Knott:Graham", "Dmitri B. Chklovskii.....http://dblp.org/pers/hd/c/Chklovskii:Dmitri_B="], "pages": 8}