{"title": "High Quality Sensor Placement for SHM Systems: Refocusing on Application Demands.", "fields": ["structural health monitoring", "systems design", "placement", "application software", "condition monitoring"], "abstract": "There are heavy studies recently on applying wireless sensor networks for structural health monitoring. These works usually focus on the computer science aspect, and the considerations include energy consumption, network connectivity, etc. It is commonly believed that for the current resource limited wireless sensors, system design could be more efficient if the application requirements are incorporated. Nevertheless, we often find that, rather than integration, assumptions have to be made due to lack of knowledge of civil engineering; for example, to evaluate routing algorithms, the sensor placement is assumed to be random or on grids/trees. These may not be practically meaningful to the respective application demands, and make the great efforts by the computer science community on developing efficient methods from the sensor network aspect less useful. In this paper, we study the very first problem of the SHM systems: the sensor placement and focus on the civil requirements. We first study the current general framework of structure health monitoring. We redevelop the framework that includes a new sensor placement module. This module implements the most widely accepted sensor placement scheme from civil engineering but focusing on its usefulness for computer science. It provides such interfaces that can rank the placement quality of the candidate locations in a step by step manner. We then optimize system performance by considering network connectivity and data routing issues; with the objective on energy efficiency. We evaluate our scheme using the data from the structural health monitoring system on the Ting Kau Bridge, Hong Kong. We show that a uniform and a state-of-the-art placement are not very meaningful in placement quality. Our scheme achieves almost the same sensor placement quality with that of the civil engineering with five-fold improvement in system lifetime. We conduct an experiment on the in-built Guangzhou New TV Tower, China; and the results validate the effectiveness of our scheme.", "citation": "Citations (72)", "departments": ["Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University"], "authors": ["Bo Li.....http://dblp.org/pers/hd/l/Li_0020:Bo", "Dan Wang.....http://dblp.org/pers/hd/w/Wang:Dan", "Feng Wang.....http://dblp.org/pers/hd/w/Wang:Feng", "Yi Qing Ni.....http://dblp.org/pers/hd/n/Ni:Yi_Qing"], "conf": "infocom", "year": "2010", "pages": 9}