{"title": "Combined Iterative and Model-driven Optimization in an Automatic Parallelization Framework.", "fields": ["instruction set", "optimizing compiler", "simd", "memory hierarchy", "automatic parallelization"], "abstract": "Today's multi-core era places significant demands on an optimizing compiler, which must parallelize programs, exploit memory hierarchy, and leverage the ever-increasing SIMD capabilities of modern processors. Existing model-based heuristics for performance optimization used in compilers are limited in their ability to identify profitable parallelism/locality trade-offs and usually lead to sub-optimal performance. To address this problem, we distinguish optimizations for which effective model-based heuristics and profitability estimates exist, from optimizations that require empirical search to achieve good performance in a portable fashion. We have developed a completely automatic framework in which we focus the empirical search on the set of valid possibilities to perform fusion/code motion, and rely on model-based mechanisms to perform tiling, vectorization and parallelization on the transformed program. We demonstrate the effectiveness of this approach in terms of strong performance improvements on a single target as well as performance portability across different target architectures.", "citation": "Citations (85)", "departments": ["Ohio State University", "IBM", "French Institute for Research in Computer Science and Automation", "Louisiana State University", "Paris-Sud 11 Un ... , Paris, France"], "authors": ["Louis-Noël Pouchet.....http://dblp.org/pers/hd/p/Pouchet:Louis=No=euml=l", "Uday Bondhugula.....http://dblp.org/pers/hd/b/Bondhugula:Uday", "Cédric Bastoul.....http://dblp.org/pers/hd/b/Bastoul:C=eacute=dric", "Albert Cohen.....http://dblp.org/pers/hd/c/Cohen_0001:Albert", "J. Ramanujam.....http://dblp.org/pers/hd/r/Ramanujam:J=", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P="], "conf": "sc", "year": "2010", "pages": 11}