{"title": "Bimodal Content Defined Chunking for Backup Streams.", "fields": ["data deduplication", "distributed data store", "backup", "duplicate content", "chunking"], "abstract": "Data deduplication has become a popular technology for reducing the amount of storage space necessary for backup and archival data. Content defined chunking (CDC) techniques are well established methods of separating a data stream into variable-size chunks such that duplicate content has a good chance of being discovered irrespective of its position in the data stream. Requirements for CDC include fast and scalable operation, as well as achieving good duplicate elimination. While the latter can be achieved by using chunks of small average size, this also increases the amount of metadata necessary to store the relatively more numerous chunks, and impacts negatively the system's performance. We propose a new approach that achieves comparable duplicate elimination while using chunks of larger average size. It involves using two chunk size targets, and mechanisms that dynamically switch between the two based on querying data already stored; we use small chunks in limited regions of transition from duplicate to nonduplicate data, and elsewhere we use large chunks. The algorithms rely on the block store's ability to quickly deliver a high-quality reply to existence queries for already-stored blocks. A chunking decision is made with limited lookahead and number of queries. We present results of running these algorithms on actual backup data, as well as four sets of source code archives. Our algorithms typically achieve similar duplicate elimination to standard algorithms while using chunks 2-4 times as large. Such approaches may be particularly interesting to distributed storage systems that use redundancy techniques (such as error-correcting codes) requiring multiple chunk fragments, for which metadata overheads per stored chunk are high. We find that algorithm variants with more flexibility in location and size of chunks yield better duplicate elimination, at a cost of a higher number of existence queries.", "citation": "Citations (150)", "departments": ["NEC Laboratories America", "NEC Laboratories America", "9LivesData, LLC"], "authors": ["Erik Kruus.....http://dblp.org/pers/hd/k/Kruus:Erik", "Cristian Ungureanu.....http://dblp.org/pers/hd/u/Ungureanu:Cristian", "Cezary Dubnicki.....http://dblp.org/pers/hd/d/Dubnicki:Cezary"], "conf": "fast", "year": "2010", "pages": 14}