{"title": "Analyzing lock contention in multithreaded applications.", "fields": ["lock", "lock convoy", "multithreading", "readers writer lock", "work stealing"], "abstract": "Many programs exploit shared-memory parallelism using multithreading. Threaded codes typically use locks to coordinate access to shared data. In many cases, contention for locks reduces parallel efficiency and hurts scalability. Being able to quantify and attribute lock contention is important for understanding where a multithreaded program needs improvement.   This paper proposes and evaluates three strategies for gaining insight into performance losses due to lock contention. First, we consider using a straightforward strategy based on call stack profiling to attribute idle time and show that it fails to yield insight into lock contention. Second, we consider an approach that builds on a strategy previously used for analyzing idleness in work-stealing computations; we show that this strategy does not yield insight into lock contention. Finally, we propose a new technique for measurement and analysis of lock contention that uses data associated with locks to blame lock holders for the idleness of spinning threads. Our approach incurs ≤ 5% overhead on a quantum chemistry application that makes extensive use of locking (65M distinct locks, a maximum of 340K live locks, and an average of 30K lock acquisitions per second per thread) and attributes lock contention to its full static and dynamic calling contexts. Our strategy, implemented in HPCToolkit, is fully distributed and should scale well to systems with large core counts.", "citation": "Citations (88)", "year": "2010", "departments": ["Rice University", "Rice University", "Renaissance Computing Institute"], "conf": "ppopp", "authors": ["Nathan R. Tallent.....http://dblp.org/pers/hd/t/Tallent:Nathan_R=", "John M. Mellor-Crummey.....http://dblp.org/pers/hd/m/Mellor=Crummey:John_M=", "Allan Porterfield.....http://dblp.org/pers/hd/p/Porterfield:Allan"], "pages": 12}