{"title": "W2Go: a travel guidance system by automatic landmark ranking.", "fields": ["landmark", "popularity", "geotagging", "impact factor", "guidance system"], "abstract": "In this paper, we present a travel guidance system W2Go (Where to Go), which can automatically recognize and rank the landmarks for travellers. In this system, a novel Automatic Landmark Ranking (ALR) method is proposed by utilizing the tag and geo-tag information of photos in Flickr and user knowledge from Yahoo Travel Guide. ALR selects the popular tourist attractions (landmarks) based on not only the subjective opinion of the travel editors as is currently done on sites like WikiTravel and Yahoo Travel Guide, but also the ranking derived from popularity among tourists. Our approach utilizes geo-tag information to locate the positions of the tag-indicated places, and computes the probability of a tag being a landmark/site name. For potential landmarks, impact factors are calculated from the frequency of tags, user numbers in Flickr, and user knowledge in Yahoo Travel Guide. These tags are then ranked based on the impact factors. Several representative views for popular landmarks are generated from the crawled images with geo-tags to describe and present them in context of information derived from several relevant reference sources. The experimental comparisons to the other systems are conducted on eight famous cities over the world. User-based evaluation demonstrates the effectiveness of the proposed ALR method and the W2Go system.", "citation": "Citations (117)", "departments": ["Tsinghua University", "National University of Singapore", "National University of Singapore", "Tsinghua University", "National University of Singapore"], "authors": ["Yue Gao.....http://dblp.org/pers/hd/g/Gao:Yue", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang", "Qionghai Dai.....http://dblp.org/pers/hd/d/Dai:Qionghai", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng", "Ramesh Jain.....http://dblp.org/pers/hd/j/Jain:Ramesh"], "conf": "mm", "year": "2010", "pages": 10}