{"title": "Myopic Policies for Budgeted Optimization with Constrained Experiments.", "fields": ["sampling", "constrained optimization", "optimization problem", "gaussian process", "experimental data"], "abstract": "Motivated by a real-world problem, we study a novel budgeted optimization problem where the goal is to optimize an unknown function f(x) given a budget. In our setting, it is not practical to request samples of f(x) at precise input values due to the formidable cost of precise experimental setup. Rather, we may request a constrained experiment, which is a subset r of the input space for which the experimenter returns x ∈ r and f(x). Importantly, as the constraints become looser, the experimental cost decreases, but the uncertainty about the location x of the next observation increases. Our goal is to manage this trade-off by selecting a sequence of constrained experiments to best optimize f within the budget. We introduce cost-sensitive policies for selecting constrained experiments using both model-free and model-based approaches, inspired by policies for unconstrained settings. Experiments on synthetic functions and functions derived from real-world experimental data indicate that our policies outperform random selection, that the model-based policies are superior to model-free ones, and give insights into which policies are preferable overall.", "citation": "Citations (4)", "departments": ["Oregon State University", "Oregon State University", "Oregon State University", "Oregon State University", "Oregon State University"], "authors": ["Javad Azimi.....http://dblp.org/pers/hd/a/Azimi:Javad", "Xiaoli Z. Fern.....http://dblp.org/pers/hd/f/Fern:Xiaoli_Z=", "Alan Fern.....http://dblp.org/pers/hd/f/Fern:Alan", "Elizabeth Burrows.....http://dblp.org/pers/hd/b/Burrows:Elizabeth", "Frank Chaplen.....http://dblp.org/pers/hd/c/Chaplen:Frank", "Yanzhen Fan.....http://dblp.org/pers/hd/f/Fan:Yanzhen", "Hong Liu.....http://dblp.org/pers/hd/l/Liu:Hong", "Jun Jaio.....http://dblp.org/pers/hd/j/Jaio:Jun", "Rebecca Schaller.....http://dblp.org/pers/hd/s/Schaller:Rebecca"], "conf": "aaai", "year": "2010", "pages": -1}