{"title": "CoTrack: A Framework for Tracking Dynamic Features with Static and Mobile Sensors.", "fields": ["adaptive sampling", "macro", "exploit", "next generation network", "tracking error"], "abstract": "Current feature tracking frameworks in sensor networks exploit advantages of either mobility, where mobile sensors can provide micro scale information of a small sensing area or numerical models that can provide macro scale information about the environment but not both. With the continual development of sensor networks, mobility becomes an important feature to integrate next generation sensing systems. In addition, recent advances in environmental modeling also allow us to better understand basic behavior of the environment. In order to further improve existing sensing systems, we need a new framework that can take advantages of existing fixed sensor networks, mobile sensors and numerical models. We develop CoTrack, a Collaborative Tracking framework, that allows mobile sensors to cooperate with fixed sensors and numerical models to accurately track dynamic features in an environment. The key innovation in CoTrack is the incorporation of numerical models at different scales and sensor measurements to guide mobile sensors for tracking. The framework includes three components: a macro model for large-scale estimation, a micro model for locale estimation of specific features based on sensor measurements, and an adaptive sampling scheme that guides mobile sensors to accurately track dynamic features. We apply our framework to track salinity intrusion in the Columbia River estuary in Oregon, United States. Our framework is fast and can reduce tracking error by more than half compared to existing data assimilation and state-of-the-art numerical models.", "citation": "Citations (1)", "departments": ["Portland State University", "Portland State University", "Portland State University", "Monterey Bay Aquarium Research Institute", "Oregon Health & Science University"], "authors": ["Thanh Dang.....http://dblp.org/pers/hd/d/Dang:Thanh", "Nirupama Bulusu.....http://dblp.org/pers/hd/b/Bulusu:Nirupama", "Wu-chi Feng.....http://dblp.org/pers/hd/f/Feng:Wu=chi", "Sergey Frolov.....http://dblp.org/pers/hd/f/Frolov:Sergey"], "conf": "infocom", "year": "2010", "pages": 5}