{"title": "Assessing the VANET's Local Information Storage Capability under Different Traffic Mobility.", "fields": ["traffic bottleneck", "mobility model", "mesh networking", "vehicular ad hoc network", "mobile telephony"], "abstract": "Wireless networking enabled vehicles can form vehicular ad hoc mesh networks (VMeshs). Using cooperative communication among VMeshs, a local transient information could be \"retained\" within a given geographic region for a certain period of time, without any infrastructure help. In this paper, we study this \"storage capability\" of VMeshs. We analyze the scenarios of highway traffic (both one-way and two-way highway free flow traffic) and vehicular traffic in a city environment. For highway traffic, we study different properties of the \"VMesh storage\", using a simulation tool that accurately models the freeway vehicular mobility. For city traffic, we first perform simulations based on real traffic trace of San Francisco Yellow Cabs. Then we compare the results with the scenario where a general Random Way Point (RWP) mobility model is used. Our results show that transmission range has high impact on the storage lifetime for one-way highway traffic, and the size of the region in which we want the information stored has high impact for two-way highway traffic. For city-wide traffic, the storage's lifetime generated using San Francisco Yellow Cab trace is shorter than that obtained using the RWP mobility model. This is due to the regular movement of the cabs as compared to the random vehicle movement in the RWP mobility model.", "citation": "Citations (54)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["Bojin Liu.....http://dblp.org/pers/hd/l/Liu:Bojin", "Behrooz Khorashadi.....http://dblp.org/pers/hd/k/Khorashadi:Behrooz", "Dipak Ghosal.....http://dblp.org/pers/hd/g/Ghosal:Dipak", "Chen-Nee Chuah.....http://dblp.org/pers/hd/c/Chuah:Chen=Nee", "H. Michael Zhang.....http://dblp.org/pers/hd/z/Zhang:H=_Michael"], "conf": "infocom", "year": "2010", "pages": 5}