{"title": "Opportunistic Routing with Congestion Diversity in Wireless Multi-hop Networks.", "fields": ["wireless routing protocol", "destination sequenced distance vector routing", "equal cost multi path routing", "backpressure routing", "multipath routing"], "abstract": "This paper considers the problem of routing packets across a multi-hop network consisting of multiple sources of traffic and wireless links with stochastic reliability while ensuring bounded expected delay. Each packet transmission can be overheard by a random subset of receiver nodes among which the next relay is selected opportunistically. The main challenge in the design of minimum-delay routing policies is balancing the trade-off between routing the packets along the shortest paths to the destination and distributing traffic across the network. Opportunistic variants of shortest path routing may, under heavy traffic scenarios, result in severe congestion and unbounded delay. While the opportunistic variants of backpressure, which ensure a bounded expected delay, are known to exhibit poor delay performance at low to medium traffic conditions. Combining important aspects of shortest path routing with those of backpressure routing, this paper provides an opportunistic routing policy with congestion diversity (ORCD). ORCD uses a measure of draining time to opportunistically identify and route packets along the paths with an expected low overall congestion. Previously, ORCD was proved to ensure a bounded expected delay for all networks and under any admissible traffic (without any knowledge of traffic statistics). This paper proposes practical implementations and discusses criticality of various aspects of the algorithm. Furthermore, the expected delay encountered by the packets in the network under ORCD is compared against known existing routing policies via simulations where substantial improvements are observed.", "citation": "Citations (30)", "departments": ["University of California, San Diego", "University of California, San Diego"], "authors": ["Mohammad Naghshvar.....http://dblp.org/pers/hd/n/Naghshvar:Mohammad", "Tara Javidi.....http://dblp.org/pers/hd/j/Javidi:Tara"], "conf": "infocom", "year": "2010", "pages": 5}