{"title": "MindFinder: interactive sketch-based image search on millions of images.", "fields": ["search engine indexing", "response time", "sketch", "novelty", "multimodal search"], "abstract": "In this paper, we showcase the MindFinder system, which is an interactive sketch-based image search engine. Different from existing work, most of which is limited to a small scale database or only enables single modality input, MindFinder is a sketch-based multimodal search engine for million-level database. It enables users to sketch major curves of the target image in their mind, and also supports tagging and coloring operations to better express their search intentions. Owning to a friendly interface, our system supports multiple actions, which help users to flexibly design their queries. After each operation, top returned images are updated in real time, based on which users could interactively refine their initial thoughts until ideal images are returned. The novelty of the MindFinder system includes the following two aspects: 1) A multimodal searching scheme is proposed to retrieve images which meet users' requirements not only in structure, but also in semantic meaning and color tone. 2) An indexing framework is designed to make MindFinder scalable in terms of database size, memory cost, and response time. By scaling up the database to more than two million images, MindFinder not only helps users to easily present whatever they are imagining, but also has the potential to retrieve the most desired images in their mind.", "citation": "Citations (121)", "departments": ["Shanghai Jiao Tong University", "University of Science and Technology of China", "Microsoft", "Microsoft", "Shanghai Jiao Tong University"], "authors": ["Yang Cao.....http://dblp.org/pers/hd/c/Cao_0008:Yang", "Hai Wang.....http://dblp.org/pers/hd/w/Wang:Hai", "Changhu Wang.....http://dblp.org/pers/hd/w/Wang:Changhu", "Zhiwei Li.....http://dblp.org/pers/hd/l/Li:Zhiwei", "Liqing Zhang.....http://dblp.org/pers/hd/z/Zhang:Liqing", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Lei"], "conf": "mm", "year": "2010", "pages": 4}