{"title": "GBLENDER: towards blending visual query formulation and query processing in graph databases.", "fields": ["rdf query language", "ranking", "web query classification", "sargable", "web search query"], "abstract": "Given a graph database  D  and a query graph  g , an exact subgraph matching query asks for the set  S  of graphs in  D  that contain  g  as a subgraph. This type of queries find important applications in several domains such as bioinformatics and chemoinformatics, where users are generally not familiar with complex graph query languages. Consequently, user-friendly visual interfaces which support query graph construction can reduce the burden of data retrieval for these users. Existing techniques for subgraph matching queries built on top of such visual framework are designed to optimize the time required in retrieving the result set  S  from  D , assuming that the whole query graph has been constructed. This leads to sub-optimal  system response time  as the query processing is initiated only  after  the user has finished drawing the query graph.   In this paper, we take the first step towards exploring a novel graph query processing paradigm, where instead of processing a query graph after its construction, it  interleaves  visual query construction and processing to improve system response time. To realize this, we present an algorithm called G BLENDER  that prunes false results and prefetches partial query results by exploiting the latency offered by the visual query formulation. It employs a novel  action-aware  indexing scheme that exploits users' interaction characteristics with visual interfaces to support efficient retrieval. Extensive experiments on both real and synthetic datasets demonstrate the effectiveness and efficiency of our solution.", "citation": "Citations (31)", "year": "2010", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Hong Kong Baptist University"], "conf": "sigmod", "authors": ["Changjiu Jin.....http://dblp.org/pers/hd/j/Jin:Changjiu", "Sourav S. Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick:Sourav_S=", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "James Cheng.....http://dblp.org/pers/hd/c/Cheng:James", "Byron Choi.....http://dblp.org/pers/hd/c/Choi:Byron"], "pages": 12}