{"title": "Conservation cores: reducing the energy of mature computations.", "fields": ["dennard scaling", "hardware acceleration", "reconfigurability", "toolchain", "dark silicon"], "abstract": "Growing transistor counts, limited power budgets, and the breakdown of voltage scaling are currently conspiring to create a  utilization wall  that limits the fraction of a chip that can run at full speed at one time. In this regime, specialized, energy-efficient processors can increase parallelism by reducing the per-computation power requirements and allowing more computations to execute under the same power budget. To pursue this goal, this paper introduces  conservation cores . Conservation cores, or  c-cores , are specialized processors that focus on reducing energy and energy-delay instead of increasing performance. This focus on energy makes c-cores an excellent match for many applications that would be poor candidates for hardware acceleration (e.g., irregular integer codes). We present a toolchain for automatically synthesizing c-cores from application source code and demonstrate that they can significantly reduce energy and energy-delay for a wide range of applications. The c-cores support patching, a form of targeted reconfigurability, that allows them to adapt to new versions of the software they target. Our results show that conservation cores can reduce energy consumption by up to 16.0x for functions and by up to 2.1x for whole applications, while patching can extend the useful lifetime of individual c-cores to match that of conventional processors.", "citation": "Citations (495)", "year": "2010", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "asplos", "authors": ["Ganesh Venkatesh.....http://dblp.org/pers/hd/v/Venkatesh:Ganesh", "Jack Sampson.....http://dblp.org/pers/hd/s/Sampson:Jack", "Nathan Goulding.....http://dblp.org/pers/hd/g/Goulding:Nathan", "Saturnino Garcia.....http://dblp.org/pers/hd/g/Garcia:Saturnino", "Vladyslav Bryksin.....http://dblp.org/pers/hd/b/Bryksin:Vladyslav", "Jose Lugo-Martinez.....http://dblp.org/pers/hd/l/Lugo=Martinez:Jose", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven", "Michael Bedford Taylor.....http://dblp.org/pers/hd/t/Taylor:Michael_Bedford"], "pages": 14}