{"title": "Pluggable personal data servers.", "fields": ["microcontroller", "database server", "security token", "storage model", "smart card"], "abstract": "An increasing amount of personal data is automatically gathered on servers by administrations, hospitals and private companies while several security surveys highlight the failure of database servers to keep confidential data really private. The advent of powerful secure tokens, combining the security of smart card microcontrollers with the storage capacity of NAND Flash chips, introduces a credible alternative to the systematic centralization of personal data. By embedding a full-fledged database server in such device, an individual can now store her personal data in her own secure token, kept under her control, and never disclose in clear her private data to the outside untrusted world. This demonstration shows the benefit of the proposed approach in terms of privacy protection and pervasiveness through a healthcare scenario. This scenario is extracted from a field experiment where medical folders embedded in secure tokens are used to improve the coordination of medical care at home for elderly people. The demonstration also highlights interesting features of the embedded DBMS engine introduced to tackle the secure token's strong hardware constraints.", "citation": "Citations (12)", "year": "2010", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Gemalto"], "conf": "sigmod", "authors": ["Nicolas Anciaux.....http://dblp.org/pers/hd/a/Anciaux:Nicolas", "Luc Bouganim.....http://dblp.org/pers/hd/b/Bouganim:Luc", "Yanli Guo.....http://dblp.org/pers/hd/g/Guo:Yanli", "Philippe Pucheral.....http://dblp.org/pers/hd/p/Pucheral:Philippe", "Jean-Jacques Vandewalle.....http://dblp.org/pers/hd/v/Vandewalle:Jean=Jacques", "Shaoyi Yin.....http://dblp.org/pers/hd/y/Yin:Shaoyi"], "pages": 4}