{"title": "Schema clustering and retrieval for multi-domain pay-as-you-go data integration systems.", "fields": ["web query classification", "data integrity", "data model", "data integration", "schema"], "abstract": "A data integration system offers a single interface to multiple structured data sources. Many application contexts (e.g., searching structured data on the web) involve the integration of large numbers of structured data sources. At web scale, it is impractical to use manual or semi-automatic data integration methods, so a pay-as-you-go approach is more appropriate. A pay-as-you-go approach entails using a fully automatic approximate data integration technique to provide an initial data integration system (i.e., an initial mediated schema, and initial mappings from source schemas to the mediated schema), and then refining the system as it gets used. Previous research has investigated automatic approximate data integration techniques, but all existing techniques require the schemas being integrated to belong to the same conceptual domain. At web scale, it is impractical to classify schemas into domains manually or semi-automatically, which limits the applicability of these techniques. In this paper, we present an approach for clustering schemas into domains without any human intervention and based only on the names of attributes in the schemas. Our clustering approach deals with uncertainty in assigning schemas to domains using a probabilistic model. We also propose a query classifier that determines, for a given a keyword query, the most relevant domains to this query. We experimentally demonstrate the effectiveness of our schema clustering and query classification techniques.", "citation": "Citations (23)", "year": "2010", "departments": ["University of Waterloo", "University of Waterloo"], "conf": "sigmod", "authors": ["Hatem A. Mahmoud.....http://dblp.org/pers/hd/m/Mahmoud:Hatem_A=", "Ashraf Aboulnaga.....http://dblp.org/pers/hd/a/Aboulnaga:Ashraf"], "pages": 12}