{"title": "DASH: a Recipe for a Flash-based Data Intensive Supercomputer.", "fields": ["iops", "solid state drive", "data intensive computing", "speedup", "gigabyte"], "abstract": "Data intensive computing can be defined as computation involving large datasets and complicated I/O patterns. Data intensive computing is challenging because there is a five-orders-of-magnitude latency gap between main memory DRAM and spinning hard disks; the result is that an inordinate amount of time in data intensive computing is spent accessing data on disk. To address this problem we designed and built a prototype data intensive supercomputer named DASH that exploits flash-based Solid State Drive (SSD) technology and also virtually aggregated DRAM to fill the latency gap . DASH uses commodity parts including Intel® X25-E flash drives and distributed shared memory (DSM) software from ScaleMP®. The system is highly competitive with several commercial offerings by several metrics including achieved IOPS (input output operations per second), IOPS per dollar of system acquisition cost, IOPS per watt during operation, and IOPS per gigabyte (GB) of available storage. We present here an overview of the design of DASH, an analysis of its cost efficiency, then a detailed recipe for how we designed and tuned it for high data-performance, lastly show that running data-intensive scientific applications from graph theory, biology, and astronomy, we achieved as much as two orders-of- magnitude speedup compared to the same applications run on traditional architectures.", "citation": "Citations (57)", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Jiahua He.....http://dblp.org/pers/hd/h/He:Jiahua", "Arun Jagatheesan.....http://dblp.org/pers/hd/j/Jagatheesan:Arun", "Sandeep K. S. Gupta.....http://dblp.org/pers/hd/g/Gupta:Sandeep_K=_S=", "Jeffrey Bennett.....http://dblp.org/pers/hd/b/Bennett:Jeffrey", "Allan Snavely.....http://dblp.org/pers/hd/s/Snavely:Allan"], "conf": "sc", "year": "2010", "pages": 11}