{"title": "Understanding the Impact of Emerging Non-Volatile Memories on High-Performance, IO-Intensive Computing.", "fields": ["system software", "paging", "phase change memory", "solid state storage", "flash memory"], "abstract": "Emerging storage technologies such as flash memories, phase-change memories, and spin-transfer torque memories are poised to close the enormous performance gap between disk-based storage and main memory. We evaluate several approaches to integrating these memories into computer systems by measuring their impact on IO-intensive, database, and memory-intensive applications. We explore several options for connecting solid-state storage to the host system and find that the memories deliver large gains in sequential and random access performance, but that different system organizations lead to different performance trade-offs. The memories provide substantial application-level gains as well, but overheads in the OS, file system, and application can limit performance. As a result, fully exploiting these memories' potential will require substantial changes to application and system software. Finally, paging to fast non-volatile memories is a viable option for some applications, providing an alternative to expensive, powerhungry DRAM for supporting scientific applications with large memory footprints.", "citation": "Citations (126)", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Adrian M. Caulfield.....http://dblp.org/pers/hd/c/Caulfield:Adrian_M=", "Joel Coburn.....http://dblp.org/pers/hd/c/Coburn:Joel", "Todor I. Mollov.....http://dblp.org/pers/hd/m/Mollov:Todor_I=", "Arup De.....http://dblp.org/pers/hd/d/De:Arup", "Ameen Akel.....http://dblp.org/pers/hd/a/Akel:Ameen", "Jiahua He.....http://dblp.org/pers/hd/h/He:Jiahua", "Arun Jagatheesan.....http://dblp.org/pers/hd/j/Jagatheesan:Arun", "Rajesh K. Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Rajesh_K=", "Allan Snavely.....http://dblp.org/pers/hd/s/Snavely:Allan", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "conf": "sc", "year": "2010", "pages": 11}