{"title": "Harmony potentials for joint classification and segmentation.", "fields": ["random variable", "contextual image classification", "harmony", "optimization problem", "conditional random field"], "abstract": "Hierarchical conditional random fields have been successfully applied to object segmentation. One reason is their ability to incorporate contextual information at different scales. However, these models do not allow multiple labels to be assigned to a single node. At higher scales in the image, this yields an oversimplified model, since multiple classes can be reasonable expected to appear within one region. This simplified model especially limits the impact that observations at larger scales may have on the CRF model. Neglecting the information at larger scales is undesirable since class-label estimates based on these scales are more reliable than at smaller, noisier scales. To address this problem, we propose a new potential, called harmony potential, which can encode any possible combination of class labels. We propose an effective sampling strategy that renders tractable the underlying optimization problem. Results show that our approach obtains state-of-the-art results on two challenging datasets: Pascal VOC 2009 and MSRC-21.", "citation": "Citations (184)", "year": "2010", "departments": ["Centre de Visi´ ...  per Computador", "Centre de Visi´ ...  per Computador", "Centre de Visi´ ...  per Computador", "Centre de Visi´ ...  per Computador", "Centre de Visi´ ...  per Computador"], "conf": "cvpr", "authors": ["Josep M. Gonfaus.....http://dblp.org/pers/hd/g/Gonfaus:Josep_M=", "Xavier Boix Bosch.....http://dblp.org/pers/hd/b/Bosch:Xavier_Boix", "Joost van de Weijer.....http://dblp.org/pers/hd/w/Weijer:Joost_van_de", "Andrew D. Bagdanov.....http://dblp.org/pers/hd/b/Bagdanov:Andrew_D=", "Joan Serrat Gual.....http://dblp.org/pers/hd/g/Gual:Joan_Serrat", "Jordi Gonzàlez.....http://dblp.org/pers/hd/g/Gonz=agrave=lez_0001:Jordi"], "pages": 8}