{"title": "Latent hierarchical structural learning for object detection.", "fields": ["probabilistic latent semantic analysis", "pattern recognition", "hierarchy", "initialization", "convex optimization", "latent variable", "machine learning", "object detection", "artificial intelligence"], "abstract": "We present a latent hierarchical structural learning method for object detection. An object is represented by a mixture of hierarchical tree models where the nodes represent object parts. The nodes can move spatially to allow both local and global shape deformations. The models can be trained discriminatively using latent structural SVM learning, where the latent variables are the node positions and the mixture component. But current learning methods are slow, due to the large number of parameters and latent variables, and have been restricted to hierarchies with two layers. In this paper we describe an incremental concave-convex procedure (iCCCP) which allows us to learn both two and three layer models efficiently. We show that iCCCP leads to a simple training algorithm which avoids complex multi-stage layer-wise training, careful part selection, and achieves good performance without requiring elaborate initialization. We perform object detection using our learnt models and obtain performance comparable with state-of-the-art methods when evaluated on challenging public PASCAL datasets. We demonstrate the advantages of three layer hierarchies – outperforming Felzenszwalb et al.'s two layer models on all 20 classes.", "citation": "Citations (314)", "year": "2010", "departments": ["Massachusetts Institute of Technology", "University of California, Los Angeles", "University of California, Los Angeles", "Massachusetts Institute of Technology"], "conf": "cvpr", "authors": ["Long Zhu.....http://dblp.org/pers/hd/z/Zhu:Long", "Yuanhao Chen.....http://dblp.org/pers/hd/c/Chen:Yuanhao", "Alan L. Yuille.....http://dblp.org/pers/hd/y/Yuille:Alan_L=", "William T. Freeman.....http://dblp.org/pers/hd/f/Freeman:William_T="], "pages": 8}