{"title": "Bounded Key-Dependent Message Security.", "fields": ["random oracle", "probabilistic encryption", "distributed computing", "56 bit encryption", "homomorphic encryption", "40 bit encryption", "mathematics", "bounded function"], "abstract": "We construct the first public-key encryption scheme that is proven secure (in the standard model, under standard assumptions) even when the attacker gets access to encryptions of arbitrary efficient functions of the secret key. Specifically, under either the DDH or LWE assumption, and for arbitrary but fixed polynomials L and N, we obtain a public-key encryption scheme that resists key-dependent message (KDM) attacks for up to N(k) public keys and functions of circuit size up to L(k), where k denotes the size of the secret key. We call such a scheme bounded KDM secure. Moreover, we show that our scheme suffices for one of the important applications of KDM security: ability to securely instantiate symbolic protocols with axiomatic proofs of security.\n\nWe also observe that any fully homomorphic encryption scheme that additionally enjoys circular security and circuit privacy is fully KDM secure in the sense that its algorithms can be independent of the polynomials L and N as above. Thus, the recent fully homomorphic encryption scheme of Gentry (STOC 2009) is fully KDM secure under certain non-standard hardness assumptions.\n\nFinally, we extend an impossibility result of Haitner and Holenstein (TCC 2009), showing that it is impossible to prove KDM security against a family of query functions that contains exponentially hard pseudorandom functions if the proof makes only a black-box use of the query function and the adversary attacking the scheme. This shows that the non-black-box use of the query function in our proof of security is inherent.", "citation": "Not cited", "year": "2010", "departments": ["Princeton University", "Microsoft", "Karlsruhe Institute of Technology", "Technion – Israel Institute of Technology"], "conf": "eurocrypt", "authors": ["Boaz Barak.....http://dblp.org/pers/hd/b/Barak:Boaz", "Iftach Haitner.....http://dblp.org/pers/hd/h/Haitner:Iftach", "Dennis Hofheinz.....http://dblp.org/pers/hd/h/Hofheinz:Dennis", "Yuval Ishai.....http://dblp.org/pers/hd/i/Ishai:Yuval"], "pages": 22}