{"title": "Logging every footstep: quantile summaries for the entire history.", "fields": ["temporal database", "order statistic", "quantile", "snapshot", "query optimization"], "abstract": "Quantiles are a crucial type of order statistics in databases. Extensive research has been focused on maintaining a space-efficient structure for approximate quantile computation as the underlying dataset is updated. The existing solutions, however, are designed to support only the current, most-updated, snapshot of the dataset. Queries on the past versions of the data cannot be answered.   This paper studies the problem of  historical quantile search . The objective is to enable e-approximate quantile retrieval on  any  snapshot of the dataset in history. The problem is very important in analyzing the evolution of a distribution, monitoring the quality of services, query optimization in temporal databases, and so on. We present the first formal results in the literature. First, we prove a novel theoretical lower bound on the space cost of supporting e-approximate historical quantile queries. The bound reveals the fundamental difference between answering quantile queries about the past and those about the present time. Second, we propose a structure for finding e-approximate historical quantiles, and show that it consumes more space than the lower bound by only a square-logarithmic factor. Extensive experiments demonstrate that in practice our technique performs much better than predicted by theory. In particular, the quantiles it returns are remarkably more accurate than the theoretical precision guarantee.", "citation": "Citations (6)", "year": "2010", "departments": ["The Chinese University of Hong Kong", "Hong Kong University of Science and Technology", "The Chinese University of Hong Kong", "Simon Fraser University", "Florida State University"], "conf": "sigmod", "authors": ["Yufei Tao.....http://dblp.org/pers/hd/t/Tao:Yufei", "Ke Yi.....http://dblp.org/pers/hd/y/Yi:Ke", "Cheng Sheng.....http://dblp.org/pers/hd/s/Sheng_0001:Cheng", "Jian Pei.....http://dblp.org/pers/hd/p/Pei:Jian", "Feifei Li.....http://dblp.org/pers/hd/l/Li_0001:Feifei"], "pages": 12}