{"title": "Compressive Oversampling for Robust Data Transmission in Sensor Networks.", "fields": ["erasure code", "effective transmission rate", "erasure", "performance studies", "oversampling"], "abstract": "Data loss in wireless sensing applications is inevitable and while there have been many attempts at coping with this issue, recent developments in the area of Compressive Sensing (CS) provide a new and attractive perspective. Since many physical signals of interest are known to be sparse or compressible, employing CS, not only compresses the data and reduces effective transmission rate, but also improves the robustness of the system to channel erasures. This is possible because reconstruction algorithms for compressively sampled signals are not hampered by the stochastic nature of wireless link disturbances, which has traditionally plagued attempts at proactively handling the effects of these errors. In this paper, we propose that if CS is employed for source compression, then CS can further be exploited as an application layer erasure coding strategy for recovering missing data. We show that CS erasure encoding (CSEC) with random sampling is efficient for handling missing data in erasure channels, paralleling the performance of BCH codes, with the added benefit of graceful degradation of the reconstruction error even when the amount of missing data far exceeds the designed redundancy. Further, since CSEC is equivalent to nominal oversampling in the incoherent measurement basis, it is computationally cheaper than conventional erasure coding. We support our proposal through extensive performance studies.", "citation": "Citations (67)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Zainul Charbiwala.....http://dblp.org/pers/hd/c/Charbiwala:Zainul", "Supriyo Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Supriyo", "Sadaf Zahedi.....http://dblp.org/pers/hd/z/Zahedi:Sadaf", "Younghun Kim.....http://dblp.org/pers/hd/k/Kim:Younghun", "Ting He.....http://dblp.org/pers/hd/h/He_0001:Ting", "Chatschik Bisdikian.....http://dblp.org/pers/hd/b/Bisdikian:Chatschik", "Mani B. Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Mani_B="], "conf": "infocom", "year": "2010", "pages": 9}