{"title": "Tight Performance Bounds in the Worst-Case Analysis of Feed-Forward Networks.", "fields": ["multiplexing", "piecewise", "end to end delay", "fifo", "server", "network calculus"], "abstract": "Network Calculus theory aims at evaluating worst-case performances in communication networks. It provides methods to analyze models where the traffic and the services are constrained by some minimum and/or maximum envelopes (service/arrival curves). While new applications come forward, a challenging and inescapable issue remains open: achieving tight analyzes of networks with aggregate multiplexing. The theory offers efficient methods to bound maximum end-to-end delays or local backlogs. However as shown recently, those bounds can be arbitrarily far from the exact worst-case values, even in seemingly simple feed-forward networks (two flows and two servers), under blind multiplexing (i.e. no information about the scheduling policies, except FIFO per flow). For now, only a network with three flows and three servers, as well as a tandem network called sink tree, have been analyzed tightly. We describe the first algorithm which computes the maximum end-to-end delay for a given flow, as well as the maximum backlog at a server, for any feed-forward network under blind multiplexing, with concave arrival curves and convex service curves. Its computational complexity may look expensive (possibly super-exponential), but we show that the problem is intrinsically difficult (NP-hard). Fortunately we show that in some cases, like tandem networks with cross-traffic interfering along intervals of servers, the complexity becomes polynomial. We also compare ourselves to the previous approaches and discuss the problems left open.", "citation": "Citations (71)", "departments": ["École normale supérieure de Cachan", "École normale supérieure de Lyon", "École normale supérieure de Lyon", "French Institute for Research in Computer Science and Automation", "École normale supérieure de Lyon"], "authors": ["Anne Bouillard.....http://dblp.org/pers/hd/b/Bouillard:Anne", "Laurent Jouhet.....http://dblp.org/pers/hd/j/Jouhet:Laurent", "Eric Thierry.....http://dblp.org/pers/hd/t/Thierry:Eric"], "conf": "infocom", "year": "2010", "pages": 9}