{"title": "Mining people's trips from large scale geo-tagged photos.", "fields": ["web service", "categorization", "pattern detection", "trips architecture", "geotagging"], "abstract": "Photo sharing is one of the most popular Web services. Photo sharing sites provide functions to add tags and geo-tags to photos to make photo organization easy. Considering that people take photos to record something that attracts them, geo-tagged photos are a rich data source that reflects people's memorable events associated with locations. In this paper, we focus on geo-tagged photos and propose a method to detect people's frequent trip patterns, i.e., typical sequences of visited cities and durations of stay as well as descriptive tags that characterize the trip patterns. Our method first segments photo collections into trips and categorizes them based on their trip themes, such as visiting landmarks or communing with nature. Our method mines frequent trip patterns for each trip theme category. We crawled 5.7 million geo-tagged photos and performed photo trip pattern mining. The experimental result shows that our method outperforms other baseline methods and can correctly segment photo collections into photo trips with an accuracy of 78%. For trip categorization, our method can categorize about 80% of trips using tags and titles of photos and visited cities as features. Finally, we illustrate interesting examples of trip patterns detected from our dataset and show an application with which users can search frequent trip patterns by querying a destination, visit duration, and trip theme on the trip.", "citation": "Citations (142)", "departments": ["Microsoft", "Microsoft", "Osaka University", "Osaka University"], "authors": ["Yuki Arase.....http://dblp.org/pers/hd/a/Arase:Yuki", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Takahiro Hara.....http://dblp.org/pers/hd/h/Hara:Takahiro", "Shojiro Nishio.....http://dblp.org/pers/hd/n/Nishio:Shojiro"], "conf": "mm", "year": "2010", "pages": 10}