{"title": "Score distribution models: assumptions, intuition, and robustness to score manipulation.", "fields": ["normal gamma distribution", "categorical distribution", "gamma distribution", "inverse chi squared distribution", "ranking"], "abstract": "Inferring the score distribution of relevant and non-relevant documents is an essential task for many IR applications (e.g. information filtering, recall-oriented IR, meta-search, distributed IR). Modeling score distributions in an accurate manner is the basis of any inference. Thus, numerous score distribution models have been proposed in the literature. Most of the models were proposed on the basis of empirical evidence and goodness-of-fit. In this work, we model score distributions in a rather different, systematic manner. We start with a basic assumption on the distribution of terms in a document. Following the transformations applied on term frequencies by two basic ranking functions, BM25 and Language Models, we derive the distribution of the produced scores for all documents. Then we focus on the relevant documents. We detach our analysis from particular ranking functions. Instead, we consider a model for precision-recall curves, and given this model, we present a general mathematical framework which, given any score distribution for all retrieved documents, produces an analytical formula for the score distribution of relevant documents that is consistent with the precision-recall curves that follow the aforementioned model. In particular, assuming a Gamma distribution for all retrieved documents, we show that the derived distribution for the relevant documents resembles a Gaussian distribution with a heavy right tail.", "citation": "Citations (22)", "departments": ["University of Sheffield", "Northeastern University", "Northeastern University", "Northeastern University"], "authors": ["Evangelos Kanoulas.....http://dblp.org/pers/hd/k/Kanoulas:Evangelos", "Keshi Dai.....http://dblp.org/pers/hd/d/Dai:Keshi", "Virgiliu Pavlu.....http://dblp.org/pers/hd/p/Pavlu:Virgiliu", "Javed A. Aslam.....http://dblp.org/pers/hd/a/Aslam:Javed_A="], "conf": "sigir", "year": "2010", "pages": 8}