{"title": "Reliable Broadcasting in Random Networks and the Effect of Density.", "fields": ["broadcasting", "random variable", "complete graph", "infinity", "message passing"], "abstract": "Broadcasting algorithms are of fundamental importance for distributed systems engineering. In this paper we revisit the classical and well-studied push protocol for message broadcasting and we investigate a faulty version of it. Assuming that initially only one node has some piece of information, at each stage every one of the informed nodes chooses randomly and independently one of its neighbors and passes the message to it with some probability q that is, it fails to do so with probability 1-q. The performance of the push protocol on a fully connected network, where each node is joined by a link to every other node, with q=1 is very well understood. In particular, Frieze and Grimmett proved that with probability 1-o(1) the push protocol completes the broadcasting of the message within (1±e) (log_2 n + ln n) stages, where n is the number of nodes in the network. However, there are no tight bounds for the broadcast time on networks that are significantly sparser than the complete graph. In this work we consider random networks on n nodes, where every edge is present with probability p, independently of every other edge. We show that if p≥ α(n)ln n/n, where α(n) is any function that tends to infinity as n grows, then the push protocol with faulty transmissions broadcasts the message within (1±±ε)(log_{1+q} n + 1/q ln n) stages with probability 1-o(1). In other words, in almost every network of density d such that d ≥ α(n) ln n, the push protocol broadcasts a message as fast as in a fully connected network and the speed is only affected by the success probability q. This is quite surprising in the sense that the time needed remains essentially unaffected by the fact that most of the links are missing. Our results are accompanied by experimental evaluation.", "citation": "Citations (69)", "departments": ["Max Planck Society", "Max Planck Society", "Max Planck Society"], "authors": ["Nikolaos Fountoulakis.....http://dblp.org/pers/hd/f/Fountoulakis:Nikolaos", "Anna Huber.....http://dblp.org/pers/hd/h/Huber:Anna", "Konstantinos Panagiotou.....http://dblp.org/pers/hd/p/Panagiotou:Konstantinos"], "conf": "infocom", "year": "2010", "pages": 9}