{"title": "Socially-Aware Network Design Games.", "fields": ["network administrator", "network formation", "network planning and design", "price of anarchy", "overlay network"], "abstract": "In many scenarios network design is not enforced by a central authority, but arises from the interactions of several self-interested agents. This is the case of the Internet, where connectivity is due to Autonomous Systems' choices, but also of overlay networks, where each user client can decide the set of connections to establish. Recent works have used game theory, and in particular the concept of Nash Equilibrium, to characterize stable networks created by a set of selfish agents. The majority of these works assume that users are completely non-cooperative, leading, in most cases, to inefficient equilibria. To improve efficiency, in this paper we propose two novel socially-aware network design games. In the first game we incorporate a socially-aware component in the users' utility functions, while in the second game we use additionally a Stackelberg (leader-follower) approach, where a leader (e.g., the network administrator) architects the desired network buying an appropriate subset of network's links, driving in this way the users to overall efficient Nash equilibria. We provide bounds on the Price of Anarchy and other efficiency measures, and study the performance of the proposed schemes in several network scenarios, including realistic topologies where players build an overlay on top of real Internet Service Provider networks. Numerical results demonstrate that (1) introducing some incentives to make users more socially-aware is an effective solution to achieve stable and efficient networks in a distributed way, and (2) the proposed Stackelberg approach permits to achieve dramatic performance improvements, designing almost always the socially optimal network.", "citation": "Citations (15)", "departments": ["University of Bergamo", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Politec. di Mil ... o, Milan, Italy"], "authors": ["Jocelyne Elias.....http://dblp.org/pers/hd/e/Elias:Jocelyne", "Fabio Martignon.....http://dblp.org/pers/hd/m/Martignon:Fabio", "Konstantin Avrachenkov.....http://dblp.org/pers/hd/a/Avrachenkov:Konstantin", "Giovanni Neglia.....http://dblp.org/pers/hd/n/Neglia:Giovanni"], "conf": "infocom", "year": "2010", "pages": 5}