{"title": "Discriminant Laplacian Embedding.", "fields": ["data point", "ranking", "manifold", "scale invariant feature transform", "discriminant", "face hallucination", "laplace operator", "subspace topology", "embedding", "semi supervised learning", "pairwise comparison", "external data representation"], "abstract": "This article describes a system for participation in the Facial Expression Recognition and Analysis (FERA2015) sub-challenge for spontaneous action unit occurrence detection. The problem of AU detection is a multi-label classification problem by its nature, which is a fact overseen by most existing work. The correlation information between AUs has the potential of increasing the detection accuracy. We investigate the multi-label AU detection problem by embedding the data on low dimensional manifolds which preserve multi-label correlation. For this, we apply the multi-label Discriminant Laplacian Embedding (DLE) method as an extension to our base system. The system uses SIFT features around a set of facial landmarks that is enhanced with the use of additional non-salient points around transient facial features. Both the base system and the DLE extension show better performance than the challenge baseline results for the two databases in the challenge, and achieve close to 50% as F1-measure on the testing partition in average (9.9% higher than the baseline, in the best case). The DLE extension proves useful for certain AUs, but also shows the need for more analysis to assess the benefits in general.", "citation": "Citations (17)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "Colorado School of Mines", "University of Texas at Arlington", "University of Texas at Arlington"], "authors": ["Hua Wang.....http://dblp.org/pers/hd/w/Wang:Hua", "Heng Huang.....http://dblp.org/pers/hd/h/Huang:Heng", "Chris H. Q. Ding.....http://dblp.org/pers/hd/d/Ding:Chris_H=_Q="], "conf": "aaai", "year": "2010", "pages": -1}