{"title": "Social gravity: a virtual elastic tether for casual, privacy-preserving pedestrian rendezvous.", "fields": ["interaction design", "metaverse", "virtual image", "haptic technology", "rendezvous"], "abstract": "We describe a virtual \"tether\" for mobile devices that allows groups to have quick, simple and privacy-preserving meetups. Our design provides cues which allow dynamic coordination of rendezvous without revealing users' positions. Using accelerometers and magnetometers, combined with GPS positioning and non-visual feedback, users can probe and sense a dynamic virtual object representing the nearest meeting point. The Social Gravity system makes social bonds tangible in a virtual world which is geographically grounded, using haptic feedback to help users rendezvous. We show dynamic navigation using this physical model-based system to be efficient and robust in significant field trials, even in the presence of low-quality positioning. The use of simulators to build models of mobile geolocated systems for pre-validation purposes is discussed, and results compared with those from our trials. Our results show interesting behaviours in the social coordination task, which lead to guidelines for geosocial interaction design. The Social Gravity system proved to be very successful in allowing groups to rendezvous efficiently and simply and can be implemented using only commercially available hardware.", "citation": "Citations (39)", "departments": ["University of Glasgow", "Swansea University", "University of Glasgow", "University of Glasgow", "Swansea University"], "authors": ["John Williamson.....http://dblp.org/pers/hd/w/Williamson:John", "Simon Robinson.....http://dblp.org/pers/hd/r/Robinson:Simon", "Craig D. Stewart.....http://dblp.org/pers/hd/s/Stewart:Craig_D=", "Roderick Murray-Smith.....http://dblp.org/pers/hd/m/Murray=Smith:Roderick", "Matt Jones.....http://dblp.org/pers/hd/j/Jones_0001:Matt", "Stephen A. Brewster.....http://dblp.org/pers/hd/b/Brewster:Stephen_A="], "conf": "chi", "year": "2010", "pages": 10}