{"title": "Overhearing-aware Joint Routing and Rate Selection in Multi-hop Multi-rate UWB-based WPANs.", "fields": ["ultra wideband", "broadcast communication network", "network packet", "overhead", "hop"], "abstract": "Ultra-wideband (UWB) communications has emerged as a promising technology for high data rate wireless personal area networks (WPANs). In this paper, we address a key issue that impacts the performance of multi-hop, multi-rate UWB-based WPANs, namely joint routing and rate selection. Arbitrary selection of routes (including direct links) and transmission rates along these routes results in unnecessarily long channel reservation time and high blocking rate for prospective reservations, and leads to low network throughput. To remedy this situation, we propose a novel overhearing-aware joint routing and rate selection (ORRS) scheme, which improves the network throughput by exploiting the dependence between the channel reservation time and the multi-rate capability of an UWB system. At the same time, ORRS takes advantage of packet overhearing, a typical characteristic of broadcast communications. For a given source-destination pair, ORRS aims at selecting a path and its transmission rates that achieve the minimum reservation time, leading to low blocking rate for prospective reservations and high network throughput. We show that achieving this goal while simultaneously exploiting packet overhearing and satisfying a target packet delivery probability over the selected route leads to an NP-hard problem. Accordingly, ORRS resorts to approximate solutions (proactive and reactive) to find a near-optimal result with reasonable computational/communication overhead. We further propose other variants that exploit packet overhearing in different ways to improve ORRS performance.", "citation": "Citations (5)", "departments": ["University of Arizona", "University of Arizona"], "authors": ["Raed T. Al-Zubi.....http://dblp.org/pers/hd/a/Al=Zubi:Raed_T=", "Marwan Krunz.....http://dblp.org/pers/hd/k/Krunz:Marwan"], "conf": "infocom", "year": "2010", "pages": 9}