{"title": "Castor: Scalable Secure Routing for Ad Hoc Networks.", "fields": ["mobile ad hoc network", "ad hoc wireless distribution service", "optimized link state routing protocol", "adaptability", "wireless routing protocol"], "abstract": "Wireless ad hoc networks are inherently vulnerable, as any node can disrupt the communication of potentially any other node in the network. Many solutions to this problem have been proposed. In this paper, we take a fresh and comprehensive approach that addresses simultaneously three aspects: security, scalability and adaptability to changing network conditions. Our communication protocol, Castor, occupies a unique point in the design space: it does not use any control messages except simple packet acknowledgments, and each node makes routing decisions locally and independently without exchanging any routing state with other nodes. Its novel design makes Castor resilient to a wide range of attacks and allows the protocol to scale to large network sizes and to remain efficient under high mobility. We compare Castor against four representative protocols from the literature. Our protocol achieves up to two times higher packet delivery rates, particularly in large and highly volatile networks, while incurring no or only limited additional overhead. At the same time, Castor is able to survive more severe attacks and recovers from them faster.", "citation": "Citations (98)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "NTT DoCoMo"], "authors": ["Wojciech Galuba.....http://dblp.org/pers/hd/g/Galuba:Wojciech", "Panos Papadimitratos.....http://dblp.org/pers/hd/p/Papadimitratos:Panos", "Marcin Poturalski.....http://dblp.org/pers/hd/p/Poturalski:Marcin", "Karl Aberer.....http://dblp.org/pers/hd/a/Aberer:Karl", "Zoran Despotovic.....http://dblp.org/pers/hd/d/Despotovic:Zoran", "Wolfgang Kellerer.....http://dblp.org/pers/hd/k/Kellerer:Wolfgang"], "conf": "infocom", "year": "2010", "pages": 9}