{"title": "Approximate Coalition Structure Generation.", "fields": ["core", "characteristic function", "mathematical optimization", "computational complexity theory", "computer science"], "abstract": "Coalition formation is a fundamental problem in multi-agent systems. In characteristic function games (CFGs), each coalition C of agents is assigned a value indicating the joint utility those agents will receive if C is formed. CFGs are an important class of cooperative games; however, determining the optimal coalition structure, partitioning of the agents into a set of coalitions that maximizes the social welfare, currently requires O(3n) time for n agents.\n\nIn light of the high computational complexity of the coalition structure generation problem, a natural approach is to relax the optimality requirement and attempt to find an approximate solution that is guaranteed to be close to optimal. Unfortunately, it has been shown that guaranteeing a solution within any factor of the optimal requires Ω(2n) time. Thus, the best that can be hoped for is to find an algorithm that returns solutions that are guaranteed to be as close to the optimal as possible, in as close to O(2n) time as possible.\n\nThis paper contributes to the state-of-the-art by presenting an algorithm that achieves better quality guarantees with lower worst case running times than all currently existing algorithms. For example, our algorithm improves the previous best approximation ratio of ½ obtainable in O(√n2.83n) time to ⅔ and obtains a ½ approximation in O(√n2.59n). Our approach is also the first algorithm to guarantee a constant factor approximation ratio, ⅛, in the optimal time of O(2n). The previous best ratio obtainable in O(2n) was 2/n.", "citation": "Citations (14)", "departments": ["Vanderbilt University"], "authors": ["Travis C. Service.....http://dblp.org/pers/hd/s/Service:Travis_C=", "Julie A. Adams.....http://dblp.org/pers/hd/a/Adams:Julie_A="], "conf": "aaai", "year": "2010", "pages": -1}