{"title": "Top-K aggregation queries over large networks.", "fields": ["graph", "exploit", "ranging", "joins", "relational database"], "abstract": "Searching and mining large graphs today is critical to a variety of application domains, ranging from personalized recommendation in social networks, to searches for functional associations in biological pathways. In these domains, there is a need to perform aggregation operations on large-scale networks. Unfortunately the existing implementation of aggregation operations on relational databases does not guarantee superior performance in network space, especially when it involves edge traversals and joins of gigantic tables. In this paper, we investigate the neighborhood aggregation queries: Find nodes that have top-k highest aggregate values over their h-hop neighbors. While these basic queries are common in a wide range of search and recommendation tasks, surprisingly they have not been studied systematically. We developed a Local Neighborhood Aggregation framework, called LONA, to answer them efficiently. LONA exploits two properties unique in network space: First, the aggregate value for the neighboring nodes should be similar in most cases; Second, given the distribution of attribute values, it is possible to estimate the upper-bound value of aggregates. These two properties inspire the development of novel pruning techniques, forward pruning using differential index and backward pruning using partial distribution. Empirical results show that LONA could outperform the baseline algorithm up to 10 times in real-life large networks.", "citation": "Citations (22)", "departments": ["University of California, Santa Barbara", "IBM", "Singapore Management University", "University of Illinois at Urbana–Champaign"], "authors": ["Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Bin He.....http://dblp.org/pers/hd/h/He_0001:Bin", "Feida Zhu.....http://dblp.org/pers/hd/z/Zhu:Feida", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "icde", "year": "2010", "pages": 4}