{"title": "On Space-Time Capacity Limits in Mobile and Delay Tolerant Networks.", "fields": ["stochastic modelling", "mobile radio", "mobile computing", "mobile telephony", "delay tolerant networking"], "abstract": "We investigate the fundamental capacity limits of space-time journeys of information in mobile and Delay Tolerant Networks (DTNs), where information is either transmitted or carried by mobile nodes, using store-carry-forward routing. We define the capacity of a journey (i.e., a path in space and time, from a source to a destination) as the maximum amount of data that can be transferred from the source to the destination in the given journey. Combining a stochastic model (conveying all possible journeys) and an analysis of the durations of the nodes' encounters, we study the properties of journeys that maximize the space-time information propagation capacity, in bit-meters per second. More specifically, we provide theoretical lower and upper bounds on the information propagation speed, as a function of the journey capacity. In the particular case of random way-point-like models (i.e., when nodes move for a distance of the order of the network domain size before changing direction), we show that, for relatively large journey capacities, the information propagation speed is of the same order as the mobile node speed. This implies that, surprisingly, in sparse but large-scale mobile DTNs, the space-time information propagation capacity in bit-meters per second remains proportional to the mobile node speed and to the size of the transported data bundles, when the bundles are relatively large. We also verify that all our analytical bounds are accurate in several simulation scenarios.", "citation": "Citations (10)", "departments": ["French Institute for Research in Computer Science and Automation", "Macquarie University", "Macquarie University"], "authors": ["Philippe Jacquet.....http://dblp.org/pers/hd/j/Jacquet:Philippe", "Bernard Mans.....http://dblp.org/pers/hd/m/Mans:Bernard", "Georgios Rodolakis.....http://dblp.org/pers/hd/r/Rodolakis:Georgios"], "conf": "infocom", "year": "2010", "pages": 9}