{"title": "An adaptive performance modeling tool for GPU architectures.", "fields": ["memory bank", "control flow graph", "microarchitecture", "cuda", "kernel method"], "abstract": "This paper presents an analytical model to predict the performance of   general-purpose applications on a GPU architecture. The model is designed to provide performance information to an auto-tuning compiler and assist it in narrowing down the search to the more promising implementations. It can also be incorporated into a tool to help programmers better assess the performance bottlenecks in their code. We analyze each GPU kernel and identify how the kernel exercises major GPU microarchitecture features. To identify the performance bottlenecks accurately, we introduce an abstract interpretation of a GPU kernel,  work flow graph , based on which we estimate the execution time of a GPU kernel. We validated our performance model on the NVIDIA GPUs using CUDA (Compute Unified Device Architecture). For this purpose, we used data parallel benchmarks that stress different GPU microarchitecture events such as uncoalesced memory accesses, scratch-pad memory bank conflicts, and control flow divergence, which must be accurately modeled but represent challenges to the analytical performance models. The proposed model captures full system complexity and shows high accuracy in predicting the performance trends of different optimized kernel implementations. We also describe our approach to extracting the performance model automatically from a kernel code.", "citation": "Citations (301)", "year": "2010", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "ppopp", "authors": ["Sara S. Baghsorkhi.....http://dblp.org/pers/hd/b/Baghsorkhi:Sara_S=", "Matthieu Delahaye.....http://dblp.org/pers/hd/d/Delahaye:Matthieu", "Sanjay J. Patel.....http://dblp.org/pers/hd/p/Patel:Sanjay_J=", "William D. Gropp.....http://dblp.org/pers/hd/g/Gropp:William_D=", "Wen-mei W. Hwu.....http://dblp.org/pers/hd/h/Hwu:Wen=mei_W="], "pages": 10}