{"title": "Green Wave: Latency and Capacity-Efficient Sleep Scheduling for Wireless Networks.", "fields": ["latency", "throughput", "tree network", "grid network", "shortest path problem"], "abstract": "While scheduling the nodes in a wireless network to sleep periodically can save energy, it also incurs higher latency and lower throughput. We consider the problem of designing optimal sleep schedules in wireless networks, and show that finding sleep schedules that can minimize the latency over a given subset of source-destination pairs is NP-hard. We also derive a latency lower bound given by d + O(1/p) for any sleep schedule with a required active rate (i.e., the fraction of active slots of each node) p, and the shortest path length d. We offer a novel solution to optimal sleep scheduling using green-wave sleep scheduling (GWSS), inspired by coordinated traffic lights, which is shown to meet our latency lower bound (hence is latency-optimal) for topologies such as the line, grid, ring, torus and tree networks, under light traffic. For high traffic loads, we propose non-interfering GWSS, which can achieve the maximum throughput scaling law given by T(n,p) = Ω(p/√n) bits/sec on a grid network of size n, with a latency scaling law D(n,p) = O(√n) + O(1/p). Finally, we extend GWSS to a random network with n Poisson-distributed nodes, for which we show an achievable throughput scaling law of T(n,p) = Ω(p/√(nlog n)) bits/sec and a corresponding latency scaling law D(n,p) = O(√(nlog n)) + O(1/p); hence meeting the well-known Gupta-Kumar achievable throughput rate Ω(1/√(nlog n)) as p approaches 1.", "citation": "Citations (25)", "departments": ["BBN Technologies", "University of Cambridge", "BBN Technologies"], "authors": ["Saikat Guha.....http://dblp.org/pers/hd/g/Guha:Saikat", "Chi-Kin Chau.....http://dblp.org/pers/hd/c/Chau:Chi=Kin", "Prithwish Basu.....http://dblp.org/pers/hd/b/Basu:Prithwish"], "conf": "infocom", "year": "2010", "pages": 9}