{"title": "On the Scope of the Universal-Algebraic Approach to Constraint Satisfaction.", "fields": ["algebraic number", "constraint satisfaction problem", "if and only if", "constraint satisfaction", "generalization", "galois connection", "template", "model theory", "process calculus"], "abstract": "The universal-algebraic approach has proved a powerful tool in the study of the computational complexity of constraint satisfaction problems (CSPs). This approach has previously been applied to the study of CSPs with finite or (infinite) omega-categorical templates. Our first result is an exact characterization of those CSPs that can be formulated with (a finite or) an omega-categorical template. The universal-algebraic approach relies on the fact that in finite or omega-categorical structures A, a relation is primitive positive definable if and only if it is preserved by the polymorphisms of A. In this paper, we present results that can be used to study the computational complexity of CSPs with arbitrary infinite templates. Specifically, we prove that every CSP can be formulated with a template A such that a relation is primitive positive definable in A if and only if it is first-order definable on A and preserved by the infinitary polymorphisms of A. We present applications of our general results to the description and analysis of the computational complexity of CSPs. In particular, we present a polymorphism-based description of those CSPs that are first-order definable (and therefore can be solved in polynomial-time), and give general hardness criteria based on the absence of polymorphisms that depend on more than one argument.", "citation": "Citations (17)", "departments": ["École Normale Supérieure", "Durham University", "Equipe de Logiq ... , Paris, France"], "authors": ["Manuel Bodirsky.....http://dblp.org/pers/hd/b/Bodirsky:Manuel", "Martin Hils.....http://dblp.org/pers/hd/h/Hils:Martin", "Barnaby Martin.....http://dblp.org/pers/hd/m/Martin:Barnaby"], "conf": "lics", "year": "2010", "pages": 10}