{"title": "Accurate 3D face reconstruction from weakly calibrated wide baseline images with profile contours.", "fields": ["bundle adjustment", "initialization", "solid modeling", "motion estimation", "global optimization"], "abstract": "We propose a method to generate a highly accurate 3D face model from a set of wide-baseline images in a weakly calibrated setup. Our approach is purely data driven, and produces faithful 3D models without any pre-defined models, unlike other statistical model-based approaches. Our results do not rely upon a critical initialization step nor parameters for optimization steps. We process 5 images (including profile views), infer the accurate poses of cameras in all views, and then infer a dense 3D face model. The quality of 3D face models depends on the accuracy of estimated head-camera motion. First, we propose to use an iterative bundle adjustment approach to remove outliers in corresponding points. Contours in the profile views are matched to provide reliable correspondences that link two opposite side of views together. For dense reconstruction, we propose to use a face-specific cylindrical representation which allows us to solve a global optimization problem for N-view dense aggregation. Profile contours are used once again to provide constraints in the optimization step. Experimental results using synthetic and real images show that our method provides accurate and stable reconstruction results on wide-baseline images. We compare our method with state of the art methods, and show that it provides significantly better results in terms of both accuracy and efficiency.", "citation": "Citations (24)", "year": "2010", "departments": ["University of Southern California", "University of Southern California", "University of Southern California"], "conf": "cvpr", "authors": ["Yuping Lin.....http://dblp.org/pers/hd/l/Lin:Yuping", "Gérard G. Medioni.....http://dblp.org/pers/hd/m/Medioni:G=eacute=rard_G=", "Jongmoo Choi.....http://dblp.org/pers/hd/c/Choi:Jongmoo"], "pages": 8}