{"title": "A discriminative model approach for accurate duplicate bug report retrieval.", "fields": ["web service", "software regression", "bug tracking system", "discriminative model", "software bug"], "abstract": "Bug repositories are usually maintained in software projects. Testers or users submit bug reports to identify various issues with systems. Sometimes two or more bug reports correspond to the same defect. To address the problem with duplicate bug reports, a person called a triager needs to manually label these bug reports as duplicates, and link them to their \"master\" reports for subsequent maintenance work. However, in practice there are considerable duplicate bug reports sent daily; requesting triagers to manually label these bugs could be highly time consuming.   To address this issue, recently, several techniques have be proposed using various similarity based metrics to detect candidate duplicate bug reports for manual verification. Automating triaging has been proved challenging as two reports of the same bug could be written in various ways. There is still much room for improvement in terms of accuracy of duplicate detection process. In this paper, we leverage recent advances on using discriminative models for information retrieval to detect duplicate bug reports more accurately. We have validated our approach on three large software bug repositories from Firefox, Eclipse, and OpenOffice. We show that our technique could result in 17--31%, 22--26%, and 35--43% relative improvement over state-of-the-art techniques in OpenOffice, Firefox, and Eclipse datasets respectively using commonly available natural language information only.", "citation": "Citations (213)", "departments": ["National University of Singapore", "Singapore Management University", "Peking University", "Singapore Management University", "National University of Singapore"], "authors": ["Chengnian Sun.....http://dblp.org/pers/hd/s/Sun:Chengnian", "David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David", "Xiaoyin Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoyin", "Jing Jiang.....http://dblp.org/pers/hd/j/Jiang:Jing", "Siau-Cheng Khoo.....http://dblp.org/pers/hd/k/Khoo:Siau=Cheng"], "conf": "icse", "year": "2010", "pages": 10}