{"title": "BitTorrent Darknets.", "fields": ["hacker", "enforcement", "cultural invention", "popularity", "the internet", "phenomenon", "internet privacy", "bittorrent", "darknet", "bittorrent tracker", "upload", "incentive", "reflexivity", "computer security", "information exchange", "leech"], "abstract": "A private BitTorrent site (also known as a \"Bit Torrent darknet\") is a collection of torrents that can only be accessed by members of the darknet community. The private BitTorrent sites also have incentive policies which encourage users to continue to seed files after completing downloading. Although there are at least 800 independent BitTorrent darknets in the Internet, they have received little attention in the research community to date. We examine BitTorrent darknets from macroscopic, medium-scopic and microscopic perspectives. For the macroscopic analysis, we consider 800+ private sites to obtain a broad picture of the darknet landscape, and obtain a rough estimate of the total number of files, accounts, and simultaneous peers within the entire darknet landscape. Although the size of each private site is relatively small, we find the aggregate size of the darknet landscape to be surprisingly large. For the medium-scopic analysis, we investigate content overlap between four private sites and the public BitTorrent ecosystem. For the microscopic analysis, we explore in-depth one private site and examine its user behavior. We observe that the seed-to-leecher ratios and upload-to-download ratios are much higher than in the public ecosystem. The macroscopic, medium-scopic and microscopic analyses when combined provide a vivid picture of the darknet landscape, and provide insight into how the darknet landscape differs from the public BitTorrent ecosystem.", "citation": "Not cited", "departments": ["New York University", "New York University", "Sun Yat-sen University", "New York University", "New York University", "Hong Kong Baptist University", "Hong Kong Baptist University", "Simon Fraser University", "Hong Kong Baptist University", "Hong Kong Baptist University", "Simon Fraser University", "Hong Kong Baptist University", "Hong Kong Baptist University", "Delft University of Technology", "Delft University of Technology", "Delft University of Technology", "Hong Kong Baptist University", "Hong Kong Baptist University", "University of Calgary"], "authors": ["Chao Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao", "Prithula Dhungel.....http://dblp.org/pers/hd/d/Dhungel:Prithula", "Di Wu.....http://dblp.org/pers/hd/w/Wu_0001:Di", "Zhengye Liu.....http://dblp.org/pers/hd/l/Liu:Zhengye", "Keith W. Ross.....http://dblp.org/pers/hd/r/Ross:Keith_W="], "conf": "infocom", "year": "2010", "pages": 9}