{"title": "Memory matrix: a novel user experience for home video.", "fields": ["clips", "automatic summarization", "salience", "video quality", "visual word"], "abstract": "Nowadays, various efforts have sprung up aiming to automatically analyze home videos and provide users satisfactory experiences. In this paper, we present a novel user experience for home video called Memory Matrix, which could facilitate users to re-experience the joy of their memories, travelling along not only the time axis but also the space axis. In other words, the video clips (sub-shots) are organized both by taken times and taken locations, which further allows the user to browse home videos taken at similar locations. Moreover, given a specific query in Memory Matrix (row, column), it can also provide the user optional summaries along the time axis or space axis. The summarization scheme in this paper is based on a top-down interest score generation algorithm which automatically propagates the pre-labeled video level interest scores to sub-shot level interest scores. Firstly, the user is asked to provide interest scores to all the video sequences in the home video collection. Then, the video sequences are decomposed into sub-shots which are represented by keyframes. Consequently, we employ multi-scale spatial saliency analysis to remove the foregrounds and model the background scenes based on histogram of visual words. Finally, the interest scores are propagated from video level to sub-shot level by using gradient descent algorithm. Experimental results demonstrate the effectiveness, efficiency, and robustness of our framework.", "citation": "Citations (4)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Qianqian Xu.....http://dblp.org/pers/hd/x/Xu:Qianqian", "Zhipeng Wu.....http://dblp.org/pers/hd/w/Wu:Zhipeng", "Guorong Li.....http://dblp.org/pers/hd/l/Li:Guorong", "Lei Qin.....http://dblp.org/pers/hd/q/Qin:Lei", "Shuqiang Jiang.....http://dblp.org/pers/hd/j/Jiang:Shuqiang", "Qingming Huang.....http://dblp.org/pers/hd/h/Huang:Qingming"], "conf": "mm", "year": "2010", "pages": 4}