{"title": "Low overhead concurrency control for partitioned main memory databases.", "fields": ["timestamp based concurrency control", "isolation", "optimistic concurrency control", "non lock concurrency control", "multiversion concurrency control"], "abstract": "Database partitioning is a technique for improving the performance of distributed OLTP databases, since \"single partition\" transactions that access data on one partition do not need coordination with other partitions. For workloads that are amenable to partitioning, some argue that transactions should be executed serially on each partition without any concurrency at all. This strategy makes sense for a main memory database where there are no disk or user stalls, since the CPU can be fully utilized and the overhead of traditional concurrency control, such as two-phase locking, can be avoided. Unfortunately, many OLTP applications have some transactions which access multiple partitions. This introduces network stalls in order to coordinate distributed transactions, which will limit the performance of a database that does not allow concurrency.   In this paper, we compare two low overhead concurrency control schemes that allow partitions to work on other transactions during network stalls, yet have little cost in the common case when concurrency is not needed. The first is a light-weight locking scheme, and the second is an even lighter-weight type of speculative concurrency control that avoids the overhead of tracking reads and writes, but sometimes performs work that eventually must be undone. We quantify the range of workloads over which each technique is beneficial, showing that speculative concurrency control generally outperforms locking as long as there are few aborts or few distributed transactions that involve multiple rounds of communication. On a modified TPC-C benchmark, speculative concurrency control can improve throughput relative to the other schemes by up to a factor of two.", "citation": "Citations (133)", "year": "2010", "departments": ["Yale University", "Massachusettes  ... bridge, MA, USA", "Massachusettes  ... bridge, MA, USA"], "conf": "sigmod", "authors": ["Evan P. C. Jones.....http://dblp.org/pers/hd/j/Jones:Evan_P=_C=", "Daniel J. Abadi.....http://dblp.org/pers/hd/a/Abadi:Daniel_J=", "Samuel Madden.....http://dblp.org/pers/hd/m/Madden:Samuel"], "pages": 12}