{"title": "An improved LP-based approximation for steiner tree.", "fields": ["prim s algorithm", "distributed minimum spanning tree", "k minimum spanning tree", "gomory hu tree", "tree rotation"], "abstract": "The  Steiner tree  problem is one of the most fundamental NP-hard problems: given a weighted undirected graph and a subset of terminal nodes, find a minimum-cost tree spanning the terminals. In a sequence of papers, the approximation ratio for this problem was improved from 2 to the current best 1.55 [Robins,Zelikovsky-SIDMA'05]. All these algorithms are purely combinatorial. A long-standing open problem is whether there is an LP-relaxation for Steiner tree with integrality gap smaller than 2 [Vazirani,Rajagopalan-SODA'99]. In this paper we improve the approximation factor for Steiner tree, developing an LP-based approximation algorithm. Our algorithm is based on a, seemingly novel,  iterative randomized rounding  technique. We consider a directed-component cut relaxation for the k-restricted Steiner tree problem. We sample one of these components with probability proportional to the value of the associated variable in the optimal fractional solution and contract it. We iterate this process for a proper number of times and finally output the sampled components together with a minimum-cost terminal spanning tree in the remaining graph. Our algorithm delivers a solution of cost at most ln(4) times the cost of an optimal k-restricted Steiner tree. This directly implies a ln(4)+e", "citation": "Citations (252)", "year": "2010", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Universita di R ... ta, Rome, Italy"], "conf": "stoc", "authors": ["Jaroslaw Byrka.....http://dblp.org/pers/hd/b/Byrka:Jaroslaw", "Fabrizio Grandoni.....http://dblp.org/pers/hd/g/Grandoni_0001:Fabrizio", "Thomas Rothvoß.....http://dblp.org/pers/hd/r/Rothvo=szlig=:Thomas", "Laura Sanità.....http://dblp.org/pers/hd/s/Sanit=agrave=:Laura"], "pages": 10}