{"title": "Multi-class object localization by combining local contextual interactions.", "fields": ["face detection", "contextual image classification", "image segmentation", "conditional random field", "context model"], "abstract": "Recent work in object localization has shown that the use of contextual cues can greatly improve accuracy over models that use appearance features alone. Although many of these models have successfully explored different types of contextual sources, they only consider one type of contextual interaction (e.g., pixel, region or object level interactions), leaving open questions about the true potential contribution of context. Furthermore, contributions across object classes and over appearance features still remain unknown. In this work, we introduce a novel model for multi-class object localization that incorporates different levels of contextual interactions. We study contextual interactions at pixel, region and object level by using three different sources of context: semantic, boundary support and contextual neighborhoods. Our framework learns a single similarity metric from multiple kernels, combining pixel and region interactions with appearance features, and then uses a conditional random field to incorporate object level interactions. We perform experiments on two challenging image databases: MSRC and PASCAL VOC 2007. Experimental results show that our model outperforms current state-of-the-art contextual frameworks and reveals individual contributions for each contextual interaction level, as well as the importance of each type of feature in object localization.", "citation": "Citations (106)", "year": "2010", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "cvpr", "authors": ["Carolina Galleguillos.....http://dblp.org/pers/hd/g/Galleguillos:Carolina", "Brian McFee.....http://dblp.org/pers/hd/m/McFee:Brian", "Serge J. Belongie.....http://dblp.org/pers/hd/b/Belongie:Serge_J=", "Gert R. G. Lanckriet.....http://dblp.org/pers/hd/l/Lanckriet:Gert_R=_G="], "pages": 8}