{"title": "Locating need-to-translate constant strings in web applications.", "fields": ["usable", "web application", "java", "goto", "strings"], "abstract": "Software internationalization aims to make software accessible and usable by users all over the world. For a Java application that does not consider internationalization at the beginning of its develop- ment stage, our previous work proposed an approach to locating need-to-translate constant strings in the Java code. However, when being applied on web applications, it can identify only constant strings that may go to the generated HTML texts, but cannot further distinguish constant strings visible at the browser side (need-to-translate) from other constant strings (not need-to-translate). In this paper, to address significant challenges in internationalizing web applications, we propose a novel approach to locating need-to-translate constant strings in web applications. Among those constant strings that may go to the generated HTML texts, our approach further distinguishes strings visible at the browser side from non-visible strings via a novel technique called flag propagation. We evaluated our approach on three real-world open source PHP-based web applications (in total near 17 KLOC): Squirrel Mail, Lime Survey, and Mrbs. The empirical results demonstrate that our approach accurately distinguishes visible strings from non-visible strings among all the constant strings that may go to the generated HTML texts, and is effective for locating need-to-translate constant strings in web applications.", "citation": "Citations (19)", "departments": ["Peking University", "Peking University", "North Carolina State University", "Peking University", "Peking University"], "authors": ["Xiaoyin Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoyin", "Lu Zhang.....http://dblp.org/pers/hd/z/Zhang_0023:Lu", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "Hong Mei.....http://dblp.org/pers/hd/m/Mei:Hong", "Jiasu Sun.....http://dblp.org/pers/hd/s/Sun:Jiasu"], "conf": "sigsoft", "year": "2010", "pages": 10}