{"title": "Multimodal semi-supervised learning for image classification.", "fields": ["binary classification", "contextual image classification", "semi supervised learning", "multiple kernel learning", "classifier"], "abstract": "In image categorization the goal is to decide if an image belongs to a certain category or not. A binary classifier can be learned from manually labeled images; while using more labeled examples improves performance, obtaining the image labels is a time consuming process. We are interested in how other sources of information can aid the learning process given a fixed amount of labeled images. In particular, we consider a scenario where keywords are associated with the training images, e.g. as found on photo sharing websites. The goal is to learn a classifier for images alone, but we will use the keywords associated with labeled and unlabeled images to improve the classifier using semi-supervised learning. We first learn a strong Multiple Kernel Learning (MKL) classifier using both the image content and keywords, and use it to score unlabeled images. We then learn classifiers on visual features only, either support vector machines (SVM) or least-squares regression (LSR), from the MKL output values on both the labeled and unlabeled images. In our experiments on 20 classes from the PASCAL VOC'07 set and 38 from the MIR Flickr set, we demonstrate the benefit of our semi-supervised approach over only using the labeled images. We also present results for a scenario where we do not use any manual labeling but directly learn classifiers from the image tags. The semi-supervised approach also improves classification accuracy in this case.", "citation": "Citations (368)", "year": "2010", "departments": ["French Institute for Research in Computer Science and Automation", "Laboratoire Jean Kuntzmann", "Laboratoire Jean Kuntzmann"], "conf": "cvpr", "authors": ["Matthieu Guillaumin.....http://dblp.org/pers/hd/g/Guillaumin:Matthieu", "Jakob J. Verbeek.....http://dblp.org/pers/hd/v/Verbeek:Jakob_J=", "Cordelia Schmid.....http://dblp.org/pers/hd/s/Schmid:Cordelia"], "pages": 8}