{"title": "Strong Fault-Tolerance for Self-Assembly with Fuzzy Temperature.", "fields": ["binary logarithm", "self assembly", "fuzzy set", "fault tolerance", "fuzzy logic"], "abstract": "We consider the problem of fault-tolerance in nanoscale algorithmic self-assembly. We employ a standard variant of Winfree’s abstract Tile Assembly Model (aTAM), the two-handed aTAM, in which square “tiles” – a model of molecules constructed from DNA for the purpose of engineering self-assembled nanostructures – aggregate according to specific binding sites of varying strengths, and in which large aggregations of tiles may attach to each other, in contrast to the seeded aTAM, in which tiles aggregate one at a time to a single specially designated “seed” assembly. We focus on a major cause of errors in tile-based self-assembly: that of unintended growth due to “weak” strength-1 bonds, which if allowed to persist, may be stabilized by subsequent attachment of neighboring tiles in the sense that at least energy 2 is now required to break apart the resulting assembly, i.e., the errant assembly is stable at temperature 2. We study a common self-assembly benchmark problem, that of assembling an n×n square using O(log n) unique tile types, under the two-handed model of self-assembly. Our main result achieves a much stronger notion of fault-tolerance than those achieved previously. Arbitrary strength-1 growth is allowed, however, any assembly that grows sufficiently to become stable at temperature 2 is guaranteed to assemble into the correct final assembly of an n×n square. In other words, errors due to insufficient attachment, which is the cause of errors studied in earlier papers on fault-tolerance, are prevented absolutely in our main construction, rather than only with high probability and for sufficiently small structures, as in previous fault tolerance studies.", "citation": "Citations (36)", "year": "2010", "departments": ["University of Western Ontario", "University of Texas–Pan American", "University of Southern California", "University of Texas–Pan American", "University of Wisconsin–Platteville"], "conf": "focs", "authors": ["David Doty.....http://dblp.org/pers/hd/d/Doty:David", "Matthew J. Patitz.....http://dblp.org/pers/hd/p/Patitz:Matthew_J=", "Dustin Reishus.....http://dblp.org/pers/hd/r/Reishus:Dustin", "Robert T. Schweller.....http://dblp.org/pers/hd/s/Schweller:Robert_T=", "Scott M. Summers.....http://dblp.org/pers/hd/s/Summers:Scott_M="], "pages": 10}