{"title": "Bartendr: a practical approach to energy-aware cellular data scheduling.", "fields": ["high speed downlink packet access", "signal strength", "efficient energy use", "scheduling", "cellular network"], "abstract": "Cellular radios consume more power and suffer reduced data rate when the signal is weak. According to our measurements, the communication energy per bit can be as much as 6x higher when the signal is weak than when it is strong. To realize energy savings, applications must preferentially communicate when the signal is strong, either by deferring non-urgent communication or by advancing anticipated communication to coincide with periods of strong signal. Allowing applications to perform such scheduling requires predicting signal strength, so that opportunities for energy-efficient communication can be anticipated. Furthermore, such prediction must be performed at little energy cost.   In this paper, we make several contributions towards a practical system for energy-aware cellular data scheduling called Bartendr. First, we establish, via measurements, the relationship between signal strength and power consumption. Second, we show that location alone is not sufficient to predict signal strength and motivate the use of tracks to enable effective prediction. Finally, we develop energy-aware scheduling algorithms for different workloads - syncing and streaming - and evaluate these via simulation driven by traces obtained during actual drives, demonstrating energy savings of up to 60%. Our experiments have been performed on four cellular networks across two large metropolitan areas, one in India and the other in the U.S.", "citation": "Citations (284)", "departments": ["University of Maryland, College Park", "Microsoft", "University of Maryland, College Park", "Stony Brook University", "University of Maryland, College Park"], "authors": ["Aaron Schulman.....http://dblp.org/pers/hd/s/Schulman:Aaron", "Vishnu Navda.....http://dblp.org/pers/hd/n/Navda:Vishnu", "Ramachandran Ramjee.....http://dblp.org/pers/hd/r/Ramjee:Ramachandran", "Neil Spring.....http://dblp.org/pers/hd/s/Spring:Neil", "Pralhad Deshpande.....http://dblp.org/pers/hd/d/Deshpande:Pralhad", "Calvin Grunewald.....http://dblp.org/pers/hd/g/Grunewald:Calvin", "Kamal Jain.....http://dblp.org/pers/hd/j/Jain:Kamal", "Venkata N. Padmanabhan.....http://dblp.org/pers/hd/p/Padmanabhan:Venkata_N="], "conf": "mobicom", "year": "2010", "pages": 12}