{"title": "Time Space Tradeoffs for Attacks against One-Way Functions and PRGs.", "fields": ["permutation", "special case", "pseudorandom number generator", "a search algorithm", "one way function"], "abstract": "We study time space tradeoffs in the complexity of attacks against one-way functions and pseudorandom generators.\n\nFiat and Naor [7] show that for every function f: [N] → [N], there is an algorithm that inverts f everywhere using (ignoring lower order factors) time, space and advice at most N3/4.\n\nWe show that an algorithm using time, space and advice at most max{e 5/4 N 3/4, √eN} exists that inverts f on at least an e fraction of inputs. A lower bound of Ω(√eN) also holds, making our result tight in the \"low end\" of e ≤ 3√1/N.\n\nBoth the results of Fiat and Naor and ours are formulated as more general trade-offs between the time and the space and advice length of the algorithm. The results quoted above correspond to the interesting special case in which time equals space and advice length.)\n\nWe also show that for every length-increasing generator G: [N] → [2N] there is a algorithm that achieves distinguishing probability e between the output of G and the uniform distribution and that can be implemented in polynomial (in log N) time and with advice and space O(e2 ċ N log N). We prove a lower bound of S ċ T ≥ Ω(e2N) where T is the time used by the algorithm and S is the amount of advice. This lower bound applies even when the distinguisher has oracle access to G.\n\nWe prove stronger lower bounds in the common random string model, for families of one-way permutations and of pseudorandom generators.", "citation": "Citations (20)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "Institute for Advanced Study"], "authors": ["Anindya De.....http://dblp.org/pers/hd/d/De:Anindya", "Luca Trevisan.....http://dblp.org/pers/hd/t/Trevisan:Luca", "Madhur Tulsiani.....http://dblp.org/pers/hd/t/Tulsiani:Madhur"], "conf": "crypto", "year": "2010", "pages": 17}