{"title": "Increasing Threshold Search for Best-Valued Agents.", "fields": ["best first search", "incremental heuristic search", "iterative deepening depth first search", "interpolation search", "backtracking line search", "state space search", "guided local search"], "abstract": "Abstract   This paper investigates agent search for the agent with the best value in a multi-agent system, according to some value assignment. In the type of setting considered, agent values are independent of one another. Under this condition, classic state-space search methods are not very suitable solutions since they must probe the values of all agents in order to determine who the best-valued agent is. The method considered in this paper refines the number of agents that need to be probed by iteratively publishing thresholds on acceptable agent values. This kind of agent search is applicable to various domains, including auctions, first responders, and sensor networks. In the model considered, there is a fixed cost for publishing the thresholds and a variable cost for obtaining agent values that increases with the number of values obtained. By transforming the threshold-based sequence to a probability-based one, the sequence with minimum expected cost is proven to consist of either a single search round or an infinite sequence of increasing thresholds. This leads to a simplified characterization of the optimal thresholds sequence from which the sequence can be derived. The analysis is extended to the case of search for multiple agents. One important implication of this method is that it improves the performance of legacy economic-search methods that are commonly used in “search theory”. Within this context, we show how a threshold-based search can be used to augment existing economic search techniques or as an economic search technique itself. The effectiveness of the methods for both best-value search and economic-search is demonstrated numerically using a synthetic environment.", "citation": "Citations (4)", "departments": ["Bar-Ilan University", "Bar-Ilan University", "Bar-Ilan University", "The Graduate Center, CUNY", "Bar-Ilan University"], "authors": ["David Sarne.....http://dblp.org/pers/hd/s/Sarne:David", "Simon Shamoun.....http://dblp.org/pers/hd/s/Shamoun:Simon", "Eli Rata.....http://dblp.org/pers/hd/r/Rata:Eli"], "conf": "aaai", "year": "2010", "pages": -1}