{"title": "Nonnegative shared subspace learning and its application to social media retrieval.", "fields": ["non negative matrix factorization", "secondary source", "exploit", "labelme", "social web"], "abstract": "Although tagging has become increasingly popular in online image and video sharing systems, tags are known to be noisy, ambiguous, incomplete and subjective. These factors can seriously affect the precision of a social tag-based web retrieval system. Therefore improving the precision performance of these social tag-based web retrieval systems has become an increasingly important research topic. To this end, we propose a shared subspace learning framework to leverage a secondary source to improve retrieval performance from a primary dataset. This is achieved by learning a shared subspace between the two sources under a joint Nonnegative Matrix Factorization in which the level of subspace sharing can be explicitly controlled. We derive an efficient algorithm for learning the factorization, analyze its complexity, and provide proof of convergence. We validate the framework on image and video retrieval tasks in which tags from the LabelMe dataset are used to improve image retrieval performance from a Flickr dataset and video retrieval performance from a YouTube dataset. This has implications for how to exploit and transfer knowledge from readily available auxiliary tagging resources to improve another social web retrieval system. Our shared subspace learning framework is applicable to a range of problems where one needs to exploit the strengths existing among multiple and heterogeneous datasets.", "citation": "Citations (67)", "departments": ["Curtin University", "Curtin University", "Curtin University", "Curtin University", "Curtin University"], "authors": ["Sunil Kumar Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Sunil_Kumar", "Dinh Q. Phung.....http://dblp.org/pers/hd/p/Phung:Dinh_Q=", "Brett Adams.....http://dblp.org/pers/hd/a/Adams:Brett", "Truyen Tran.....http://dblp.org/pers/hd/t/Tran_0001:Truyen", "Svetha Venkatesh.....http://dblp.org/pers/hd/v/Venkatesh:Svetha"], "conf": "kdd", "year": "2010", "pages": 10}