{"title": "Link Homophily in the Application Layer and its Usage in Traffic Classification.", "fields": ["homophily", "precision and recall", "application layer", "statistical relational learning", "traffic classification"], "abstract": "We address the following questions. Is there link homophily in the application layer traffic? If so, can it be used to accurately classify traffic in network trace data without relying on payloads or properties at the flow level? Our research shows that the answers to both of these questions are affirmative in real network trace data. Specifically, we define link homophily to be the tendency for flows with common IP hosts to have the same application (P2P, Web, etc.) compared to randomly selected flows. The presence of link homophily in trace data provides us with statistical dependencies between flows that share common IP hosts. We utilize these dependencies to classify application layer traffic without relying on payloads or properties at the flow level. In particular, we introduce a new statistical relational learning algorithm, called Neighboring Link Classifier with Relaxation Labeling (NLC+RL). Our algorithm has no training phase and does not require features to be constructed. All that it needs to start the classification process is traffic information on a small portion of the initial flows, which we refer to as seeds. In all our traces, NLC+RL achieves above 90% accuracy with less than 5% seed size; it is robust to errors in the seeds and various seed-selection biases; and it is able to accurately classify challenging traffic such as P2P with over 90% Precision and Recall.", "citation": "Citations (14)", "departments": ["Lawrence Livermore National Laboratory", "University of California, Riverside", "Lawrence Livermore National Laboratory", "University of California, Riverside"], "authors": ["Brian Gallagher.....http://dblp.org/pers/hd/g/Gallagher:Brian", "Marios Iliofotou.....http://dblp.org/pers/hd/i/Iliofotou:Marios", "Tina Eliassi-Rad.....http://dblp.org/pers/hd/e/Eliassi=Rad:Tina", "Michalis Faloutsos.....http://dblp.org/pers/hd/f/Faloutsos:Michalis"], "conf": "infocom", "year": "2010", "pages": 5}