{"title": "Automatically incorporating new sources in keyword search-based data integration.", "fields": ["data architecture", "data exchange", "schema matching", "data integration", "experimental data"], "abstract": "Scientific data offers some of the most interesting challenges in data integration today. Scientific fields evolve rapidly and accumulate masses of observational and experimental data that needs to be annotated, revised, interlinked, and made available to other scientists. From the perspective of the user, this can be a major headache as the data they seek may initially be spread across many databases in need of integration. Worse, even if users are given a solution that integrates the current state of the source databases,  new  data sources appear with new data items of interest to the user.   Here we build upon recent ideas for creating integrated views over data sources using keyword search techniques, ranked answers, and user feedback [32] to investigate how to  automatically discover  when a new data source has content relevant to a user's view - in essence, performing  automatic data integration  for incoming data sets. The new architecture accommodates a variety of methods to discover related attributes, including  label propagation  algorithms from the machine learning community [2] and existing schema matchers [11]. The user may provide  feedback  on the suggested new results, helping the system  repair  any bad alignments or  increase the cost  of including a new source that is not useful. We evaluate our approach on actual bioinformatics schemas and data, using state-of-the-art schema matchers as components. We also discuss how our architecture can be adapted to more traditional settings with a mediated schema.", "citation": "Citations (66)", "year": "2010", "departments": ["University of Pennsylvania", "University of Pennsylvania", "Google"], "conf": "sigmod", "authors": ["Partha Pratim Talukdar.....http://dblp.org/pers/hd/t/Talukdar:Partha_Pratim", "Zachary G. Ives.....http://dblp.org/pers/hd/i/Ives:Zachary_G=", "Fernando C. N. Pereira.....http://dblp.org/pers/hd/p/Pereira:Fernando_C=_N="], "pages": 12}