{"title": "Dynamic captioning: video accessibility enhancement for hearing impairment.", "fields": ["face detection", "clips", "closed captioning", "salience", "scripting language"], "abstract": "There are more than 66 million people su®ering from hearing impairment and this disability brings them di±culty in the video content understanding due to the loss of audio information. If scripts are available, captioning technology can help them in a certain degree by synchronously illustrating the scripts during the playing of videos. However, we show that the existing captioning techniques are far from satisfactory in assisting hearing impaired audience to enjoy videos.   In this paper, we introduce a video accessibility enhancement scheme with a Dynamic Captioning approach, which explores a rich set of technologies including face detection and recognition, visual saliency analysis, text-speech alignment, etc. Different from the existing methods that are categorized as static captioning here, dynamic captioning puts scripts at suitable positions to help hearing impaired audience better recognize the speaking characters. In addition, it progressively highlights the scripts word-by-word via aligning them with the speech signal and illustrates the variation of voice volume. In this way, the special audience can better track the scripts and perceive the moods that are conveyed by the variation of volume. We implement the technology on 20 video clips and conduct an in-depth study with 60 real hearing impaired users, and results have demonstrated the effectiveness and usefulness of the video accessibility enhancement scheme.", "citation": "Citations (93)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Mengdi Xu.....http://dblp.org/pers/hd/x/Xu:Mengdi", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2010", "pages": 10}