{"title": "Outdoor human motion capture using inverse kinematics and von mises-fisher sampling.", "fields": ["inverse kinematics", "inertial frame of reference", "curse of dimensionality", "particle", "image sensor"], "abstract": "Human motion capturing (HMC) from multiview image sequences is an extremely difficult problem due to depth and orientation ambiguities and the high dimensionality of the state space. In this paper, we introduce a novel hybrid HMC system that combines video input with sparse inertial sensor input. Employing an annealing particle-based optimization scheme, our idea is to use orientation cues derived from the inertial input to sample particles from the manifold of valid poses. Then, visual cues derived from the video input are used to weight these particles and to iteratively derive the final pose. As our main contribution, we propose an efficient sampling procedure where the particles are derived analytically using inverse kinematics on the orientation cues. Additionally, we introduce a novel sensor noise model to account for uncertainties based on the von Mises-Fisher distribution. Doing so, orientation constraints are naturally fulfilled and the number of needed particles can be kept very small. More generally, our method can be used to sample poses that fulfill arbitrary orientation or positional kinematic constraints. In the experiments, we show that our system can track even highly dynamic motions in an outdoor environment with changing illumination, background clutter, and shadows.", "citation": "Citations (61)", "year": "2011", "departments": ["Saarland University", "ETH Zurich", "Saarland University", "Saarland University", "Leibniz Univers ... nnover, Germany"], "conf": "iccv", "authors": ["Gerard Pons-Moll.....http://dblp.org/pers/hd/p/Pons=Moll:Gerard", "Andreas Baak.....http://dblp.org/pers/hd/b/Baak:Andreas", "Juergen Gall.....http://dblp.org/pers/hd/g/Gall:Juergen", "Laura Leal-Taixé.....http://dblp.org/pers/hd/l/Leal=Taix=eacute=:Laura", "Meinard Müller.....http://dblp.org/pers/hd/m/M=uuml=ller:Meinard", "Hans-Peter Seidel.....http://dblp.org/pers/hd/s/Seidel:Hans=Peter", "Bodo Rosenhahn.....http://dblp.org/pers/hd/r/Rosenhahn:Bodo"], "pages": 8}