{"title": "Spatio-temporal joins on symbolic indoor tracking data.", "fields": ["positioning system", "probabilistic logic", "hash function", "joins", "bluetooth"], "abstract": "To facilitate a variety of applications, positioning systems are deployed in indoor settings. For example, Bluetooth and RFID positioning are deployed in airports to support real-time monitoring of delays as well as off-line flow and space usage analyses. Such deployments generate large collections of tracking data. Like in other data management applications, joins are indispensable in this setting. However, joins on indoor tracking data call for novel techniques that take into account the limited capabilities of the positioning systems as well as the specifics of indoor spaces. This paper proposes and studies probabilistic, spatio-temporal joins on historical indoor tracking data. Two meaningful types of join are defined. They return object pairs that satisfy spatial join predicates either at a time point or during a time interval. The predicates considered include “same X,” where X is a semantic region such as a room or hallway. Based on an analysis on the uncertainty inherent to indoor tracking data, effective join probabilities are formalized and evaluated for object pairs. Efficient two-phase hash-based algorithms are proposed for the point and interval joins. In a filter-and-refine framework, an R-tree variant is proposed that facilitates the retrieval of join candidates, and pruning rules are supplied that eliminate candidate pairs that do not qualify. An empirical study on both synthetic and real data shows that the proposed techniques are efficient and scalable.", "citation": "Citations (20)", "departments": ["Aalborg University", "Max Planck Society", "Aarhus University"], "authors": ["Hua Lu.....http://dblp.org/pers/hd/l/Lu_0001:Hua", "Bin Yang.....http://dblp.org/pers/hd/y/Yang_0002:Bin", "Christian S. Jensen.....http://dblp.org/pers/hd/j/Jensen:Christian_S="], "conf": "icde", "year": "2011", "pages": 12}