{"title": "Interaction between record matching and data repairing.", "fields": ["heuristic", "ranging", "master data", "versa", "tuple"], "abstract": "Central to a data cleaning system are record matching and data repairing. Matching aims to identify tuples that refer to the same real-world object, and repairing is to make a database consistent by fixing errors in the data by using constraints. These are treated as separate processes in current data cleaning systems, based on heuristic solutions. This paper studies a new problem, namely, the interaction between record matching and data repairing. We show that repairing can effectively help us identify matches, and vice versa. To capture the interaction, we propose a uniform framework that seamlessly unifies repairing and matching operations, to clean a database based on integrity constraints, matching rules and master data. We give a full treatment of fundamental problems associated with data cleaning via matching and repairing, including the static analyses of constraints and rules taken together, and the complexity, termination and determinism analyses of data cleaning. We show that these problems are hard, ranging from NP- or coNP-complete, to PSPACE-complete. Nevertheless, we propose efficient algorithms to clean data via both matching and repairing. The algorithms find deterministic fixes and reliable fixes based on confidence and entropy analysis, respectively, which are more accurate than possible fixes generated by heuristics. We experimentally verify that our techniques significantly improve the accuracy of record matching and data repairing taken as separate processes, using real-life data.", "citation": "Citations (123)", "year": "2011", "departments": ["University of Edinburgh", "Harbin Institute of Technology", "Beihang University", "University of Edinburgh", "University of Edinburgh", "University of Edinburgh", "Beihang University", "University of Edinburgh", "QCRI"], "conf": "sigmod", "authors": ["Wenfei Fan.....http://dblp.org/pers/hd/f/Fan:Wenfei", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Shuai Ma.....http://dblp.org/pers/hd/m/Ma:Shuai", "Nan Tang.....http://dblp.org/pers/hd/t/Tang_0001:Nan", "Wenyuan Yu.....http://dblp.org/pers/hd/y/Yu:Wenyuan"], "pages": 12}