{"title": "The generalized trace-norm and its application to structure-from-motion problems.", "fields": ["optimization problem", "regularization", "structure from motion", "norm", "compressed sensing"], "abstract": "In geometric computer vision, the structure from motion (SfM) problem can be formulated as a optimization problem with a rank constraint. It is well known that the trace norm of a matrix can act as a convex proxy for a low rank constraint. Hence, in recent work [7], the trace-norm relaxation has been applied to the SfM problem. However, SfM problems often exhibit a certain structure, for example a smooth camera path. Unfortunately, the trace norm relaxation can not make use of this additional structure. This observation motivates the main contribution of this paper. We present the so-called generalized trace norm which allows to encode prior knowledge about a specific problem into a convex regularization term which enforces a low rank solution while at the same time taking the problem structure into account. While deriving the generalized trace norm and stating its different formulations, we draw interesting connections to other fields, most importantly to the field of compressive sensing. Even though the generalized trace norm is a very general concept with a wide area of potential applications we are ultimately interested in applying it to SfM problems. Therefore, we also present an efficient algorithm to optimize the resulting generalized trace norm regularized optimization problems. Results show that the generalized trace norm indeed achieves its goals in providing a problem-dependent regularization.", "citation": "Citations (32)", "year": "2011", "departments": ["Technische Hochschule", "Technische Hochschule", "Technische Hochschule"], "conf": "iccv", "authors": ["Roland Angst.....http://dblp.org/pers/hd/a/Angst:Roland", "Christopher Zach.....http://dblp.org/pers/hd/z/Zach:Christopher", "Marc Pollefeys.....http://dblp.org/pers/hd/p/Pollefeys:Marc"], "pages": 8}