{"title": "Real-time quantification and classification of consistency anomalies in multi-tier architectures.", "fields": ["isolation", "database transaction", "transaction processing", "serializability", "online transaction processing"], "abstract": "While online transaction processing applications heavily rely on the transactional properties provided by the underlying infrastructure, they often choose to not use the highest isolation level, i.e., serializability, because of the potential performance implications of costly strict two-phase locking concurrency control. Instead, modern transaction systems, consisting of an application server tier and a database tier, offer several levels of isolation providing a trade-off between performance and consistency. While it is fairly well known how to identify the anomalies that are possible under a certain level of isolation, it is much more difficult to quantify the amount of anomalies that occur during run-time of a given application. In this paper, we address this issue and present a new approach to detect, in realtime, consistency anomalies for arbitrary multi-tier applications. As the application is running, our tool detect anomalies online indicating exactly the transactions and data items involved. Furthermore, we classify the detected anomalies into patterns showing the business methods involved as well as their occurrence frequency. We use the RUBiS benchmark to show how the introduction of a new transaction type can have a dramatic effect on the number of anomalies for certain isolation levels, and how our tool can quickly detect such problem transactions. Therefore, our system can help designers to either choose an isolation level where the anomalies do not occur or to change the transaction design to avoid the anomalies.", "citation": "Citations (7)", "departments": ["McGill University", "McGill University"], "authors": ["Kamal Zellag.....http://dblp.org/pers/hd/z/Zellag:Kamal", "Bettina Kemme.....http://dblp.org/pers/hd/k/Kemme:Bettina"], "conf": "icde", "year": "2011", "pages": 12}