{"title": "TimeGraph: GPU Scheduling for Real-Time Multi-Tasking Environments.", "fields": ["user space", "asynchronous communication", "central processing unit", "graphics processing unit", "opengl"], "abstract": "The Graphics Processing Unit (GPU) is now commonly used for graphics and data-parallel computing. As more and more applications tend to accelerate on the GPU in multi-tasking environments where multiple tasks access the GPU concurrently, operating systems must provide prioritization and isolation capabilities in GPU resource management, particularly in real-time setups.\n\nWe present TimeGraph, a real-time GPU scheduler at the device-driver level for protecting important GPU workloads from performance interference. TimeGraph adopts a new event-driven model that synchronizes the GPU with the CPU to monitor GPU commands issued from the user space and control GPU resource usage in a responsive manner. TimeGraph supports two priority-based scheduling policies in order to address the tradeoff between response times and throughput introduced by the asynchronous and non-preemptive nature of GPU processing. Resource reservation mechanisms are also employed to account and enforce GPU resource usage, which prevent misbehaving tasks from exhausting GPU resources. Prediction of GPU command execution costs is further provided to enhance isolation.\n\nOur experiments using OpenGL graphics benchmarks demonstrate that TimeGraph maintains the frame-rates of primary GPU tasks at the desired level even in the face of extreme GPU workloads, whereas these tasks become nearly unresponsive without TimeGraph support. Our findings also include that the performance overhead imposed on TimeGraph can be limited to 4-10%, and its event-driven scheduler improves throughput by about 30 times over the existing tick-driven scheduler.", "citation": "Citations (236)", "departments": ["University of Tokyo", "Carnegie Mellon University", "Carnegie Mellon University", "University of Tokyo"], "authors": ["Shinpei Kato.....http://dblp.org/pers/hd/k/Kato:Shinpei", "Karthik Lakshmanan.....http://dblp.org/pers/hd/l/Lakshmanan:Karthik", "Ragunathan Rajkumar.....http://dblp.org/pers/hd/r/Rajkumar:Ragunathan", "Yutaka Ishikawa.....http://dblp.org/pers/hd/i/Ishikawa:Yutaka"], "conf": "usenix", "year": "2011", "pages": -1}