{"title": "Learning Compact Visual Descriptor for Low Bit Rate Mobile Landmark Search.", "fields": ["codebook", "offline learning", "discriminative model", "ranking", "boosting"], "abstract": "In this paper, we propose to extract a compact yet discriminative visual descriptor directly on the mobile device, which tackles the wireless query transmission latency in mobile landmark search. This descriptor originates from offline learning the location contexts of geo-tagged Web photos from both Flickr and Panoramio with two phrases: First, we segment the landmark photo collections into discrete geographical regions using a Gaussian Mixture Model [Stauffer et al., 2000]. Second, a ranking sensitive vocabulary boosting is introduced to learn a compact codebook within each region. To tackle the locally optimal descriptor learning caused by imprecise geographical segmentation, we further iterate above phrases incorporating the feedback of an \"entropy\" based descriptor compactness into a prior distribution to constrain the Gaussian mixture modeling. Consequently, when entering a specific geographical region, the codebook in the mobile device is downstream adapted, which ensures efficient extraction of compact descriptors, its low bit rate transmission, as well as promising discrimination ability. We descriptors to both HTC and iPhone mobile phones, testing landmark search over one million images in typical areas like Beijing, New York, and Barcelona, etc. Our descriptor outperforms alternative compact descriptors [Chen et al., 2009][Chen et al., 2010][Chandrasekhar et al., 2009a][Chandrasekhar et al., 2009b] with a large margin.", "citation": "Citations (25)", "year": "2011", "departments": ["Harbin Institute of Technology", "Peking University", "Peking University", "Harbin Institute of Technology", "Peking University"], "conf": "ijcai", "authors": ["Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Ling-Yu Duan.....http://dblp.org/pers/hd/d/Duan:Ling=Yu", "Jie Chen.....http://dblp.org/pers/hd/c/Chen_0006:Jie", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Tiejun Huang.....http://dblp.org/pers/hd/h/Huang:Tiejun", "Wen Gao.....http://dblp.org/pers/hd/g/Gao_0001:Wen"], "pages": 8}