{"title": "OpenFlow based flow level bandwidth provisioning for CICQ switches.", "fields": ["virtual network", "openflow", "provisioning", "job shop scheduling", "bandwidth allocation", "virtualization", "fair queuing"], "abstract": "Flow-level bandwidth provisioning (FBP) achieves fine-grained bandwidth assurance for individual flows. It is especially important for virtualization-based computing environments such as data centers. However, existing flow-level bandwidth provisioning solutions suffer from a number of drawbacks, including high implementation complexity, poor performance guarantees, and inefficiency to process variable length packets. In this paper, we study flow-level bandwidth provisioning for Combined Input Crosspoint Queued (CICQ) switches in the OpenFlow context. First, we propose the Flow-level Bandwidth Provisioning algorithm for CICQ switches, which reduces the switch scheduling problem to multiple instances of fair queuing problems, each utilizing a well-studied fair queuing algorithm. We theoretically prove that FBP can closely emulate the ideal Generalized Processing Sharing model, and accurately guarantee the provisioned bandwidth. Furthermore, we implement FBP in the OpenFlow software switch to obtain realistic performance data by a prototype. Leveraging the capability of OpenFlow to define and manipulate flows, we experimentally demonstrate a practical flow-level bandwidth provisioning solution. Finally, we conduct extensive simulations and experiments to evaluate the design. The simulation data verify the correctness of the analytical results, and show that FBP achieves tight performance guarantees. The experiment results demonstrate that our OpenFlow-based prototype can conveniently and accurately provision bandwidth at the flow level.", "citation": "Citations (13)", "departments": ["University of Miami", "University of Miami", "University of Miami", "University of Miami", "Florida International University", "Florida International University", "Florida International University", "Florida International University"], "authors": ["Hao Jin.....http://dblp.org/pers/hd/j/Jin:Hao", "Deng Pan.....http://dblp.org/pers/hd/p/Pan:Deng", "Jason Liu.....http://dblp.org/pers/hd/l/Liu:Jason", "Niki Pissinou.....http://dblp.org/pers/hd/p/Pissinou:Niki"], "conf": "infocom", "year": "2011", "pages": 5}