{"title": "Extensibility and Data Sharing in evolving multi-tenant databases.", "fields": ["information repository", "data independence", "master data", "extensibility", "database schema"], "abstract": "Software-as-a-Service applications commonly consolidate multiple businesses into the same database to reduce costs. This practice makes it harder to implement several essential features of enterprise applications. The first is support for master data, which should be shared rather than replicated for each tenant. The second is application modification and extension, which applies both to the database schema and master data it contains. The third is evolution of the schema and master data, which occurs as the application and its extensions are upgraded. These features cannot be easily implemented in a traditional DBMS and, to the extent that they are currently offered at all, they are generally implemented within the application layer. This approach reduces the DBMS to a ‘dumb data repository’ that only stores data rather than managing it. In addition, it complicates development of the application since many DBMS features have to be re-implemented. Instead, a next-generation multi-tenant DBMS should provide explicit support for Extensibility, Data Sharing and Evolution. As these three features are strongly related, they cannot be implemented independently from each other. Therefore, we propose FLEXSCHEME which captures all three aspects in one integrated model. In this paper, we focus on efficient storage mechanisms for this model and present a novel versioning mechanism, called XOR Delta, which is based on XOR encoding and is optimized for main-memory DBMSs.", "citation": "Citations (27)", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "SAP AG, Dietmar ... lldorf, Germany"], "authors": ["Stefan Aulbach.....http://dblp.org/pers/hd/a/Aulbach:Stefan", "Michael Seibold.....http://dblp.org/pers/hd/s/Seibold:Michael", "Dean Jacobs.....http://dblp.org/pers/hd/j/Jacobs:Dean", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons"], "conf": "icde", "year": "2011", "pages": 12}