{"title": "Looking back on the language and hardware revolutions: measured power, performance, and scaling.", "fields": ["software development", "simultaneous multithreading", "microarchitecture", "cpu cache", "ranging"], "abstract": "This paper reports and analyzes measured chip power and performance on five process technology generations executing 61 diverse benchmarks with a rigorous methodology. We measure representative Intel IA32 processors with technologies ranging from 130nm to 32nm while they execute sequential and parallel benchmarks written in native and managed languages. During this period, hardware and software changed substantially: (1) hardware vendors delivered chip multiprocessors instead of uniprocessors, and independently (2) software developers increasingly chose managed languages instead of native languages. This quantitative data reveals the extent of some known and previously unobserved hardware and software trends. Two themes emerge.   (I) Workload: The power, performance, and energy trends of native workloads do not approximate managed workloads. For example, (a) the SPEC CPU2006 native benchmarks on the i7 (45) and i5 (32) draw significantly less power than managed or scalable native benchmarks; and (b) managed runtimes exploit parallelism even when running single-threaded applications. The results recommend architects always include native and managed workloads when designing and evaluating energy efficient hardware.   (II) Architecture: Clock scaling, microarchitecture, simultaneous multithreading, and chip multiprocessors each elicit a huge variety of power, performance, and energy responses. This variety and the difficulty of obtaining power measurements recommends exposing on-chip power meters and when possible structure specific power meters for cores, caches, and other structures. Just as hardware event counters provide a quantitative grounding for performance innovations, power meters are necessary for optimizing energy.", "citation": "Citations (88)", "year": "2011", "departments": ["University of Washington", "Australian National University", "Australian National University", "Australian National University", "University of Texas at Austin"], "conf": "asplos", "authors": ["Hadi Esmaeilzadeh.....http://dblp.org/pers/hd/e/Esmaeilzadeh:Hadi", "Ting Cao.....http://dblp.org/pers/hd/c/Cao:Ting", "Xi Yang.....http://dblp.org/pers/hd/y/Yang:Xi", "Stephen M. Blackburn.....http://dblp.org/pers/hd/b/Blackburn:Stephen_M=", "Kathryn S. McKinley.....http://dblp.org/pers/hd/m/McKinley:Kathryn_S="], "pages": 14}