{"title": "A new computational paradigm in multiscale simulations: application to brain blood flow.", "fields": ["cerebral blood flow", "molecular dynamics", "navier stokes equations", "dissipative particle dynamics", "solver"], "abstract": "Interfacing atomistic-based with continuum-based simulation codes is now required in many multiscale physical and biological systems. We present the computational advances that have enabled the first multiscale simulation on 190,740 processors by coupling a high-order (spectral element) Navier-Stokes solver with a stochastic (coarse-grained) Molecular Dynamics solver based on Dissipative Particle Dynamics (DPD). The key contributions are proper interface conditions for overlapped domains, topology-aware communication, SIMDization, multiscale visualization and a new domain partitioning for atomistic solvers. We study blood flow in a patient-specific cerebrovasculature with a brain aneurysm, and analyze the interaction of blood cells with the arterial walls endowed with a glycocalyx causing thrombus formation and eventual aneurysm rupture. The macro-scale dynamics (about 3 billion unknowns) are resolved by   NeκTαr   - a spectral element solver; the micro-scale flow and cell dynamics within the aneurysm are resolved by an in-house version of DPD-LAMMPS (for an equivalent of about 100 billions molecules).", "citation": "Citations (25)", "departments": ["Brown University", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Brown University"], "authors": ["Leopold Grinberg.....http://dblp.org/pers/hd/g/Grinberg:Leopold", "Joseph A. Insley.....http://dblp.org/pers/hd/i/Insley:Joseph_A=", "Vitali A. Morozov.....http://dblp.org/pers/hd/m/Morozov:Vitali_A=", "Michael E. Papka.....http://dblp.org/pers/hd/p/Papka:Michael_E=", "George E. Karniadakis.....http://dblp.org/pers/hd/k/Karniadakis:George_E=", "Dmitry A. Fedosov.....http://dblp.org/pers/hd/f/Fedosov:Dmitry_A=", "Kalyan Kumaran.....http://dblp.org/pers/hd/k/Kumaran:Kalyan"], "conf": "sc", "year": "2011", "pages": 5}