{"title": "Comprehensive Experimental Analyses of Automotive Attack Surfaces.", "fields": ["automotive industry", "attack surface", "compromise", "channel", "bluetooth"], "abstract": "Modern automobiles are pervasively computerized, and hence potentially vulnerable to attack. However, while previous research has shown that the internal networks within some modern cars are insecure, the associated threat model--requiring prior physical access--has justifiably been viewed as unrealistic. Thus, it remains an open question if automobiles can also be susceptible to remote compromise. Our work seeks to put this question to rest by systematically analyzing the external attack surface of a modern automobile. We discover that remote exploitation is feasible via a broad range of attack vectors (including mechanics tools, CD players, Bluetooth and cellular radio), and further, that wireless communications channels allow long distance vehicle control, location tracking, in-cabin audio exfiltration and theft. Finally, we discuss the structural characteristics of the automotive ecosystem that give rise to such problems and highlight the practical challenges in mitigating them.", "citation": "Citations (871)", "year": "2011", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "uss", "authors": ["Stephen Checkoway.....http://dblp.org/pers/hd/c/Checkoway:Stephen", "Damon McCoy.....http://dblp.org/pers/hd/m/McCoy:Damon", "Brian Kantor.....http://dblp.org/pers/hd/k/Kantor:Brian", "Danny Anderson.....http://dblp.org/pers/hd/a/Anderson:Danny", "Hovav Shacham.....http://dblp.org/pers/hd/s/Shacham:Hovav", "Stefan Savage.....http://dblp.org/pers/hd/s/Savage:Stefan", "Karl Koscher.....http://dblp.org/pers/hd/k/Koscher:Karl", "Alexei Czeskis.....http://dblp.org/pers/hd/c/Czeskis:Alexei", "Franziska Roesner.....http://dblp.org/pers/hd/r/Roesner:Franziska", "Tadayoshi Kohno.....http://dblp.org/pers/hd/k/Kohno:Tadayoshi"], "pages": -1}