{"title": "Bayesian Policy Search with Policy Priors.", "fields": ["prior probability", "nonparametric statistics", "markov chain monte carlo", "unsupervised learning", "latent variable"], "abstract": "We consider the problem of learning to act in partially observable, continuous-state-and-action worlds where we have abstract prior knowledge about the structure of the optimal policy in the form of a distribution over policies. Using ideas from planning-as-inference reductions and Bayesian unsupervised learning, we cast Markov Chain Monte Carlo as a stochastic, hill-climbing policy search algorithm. Importantly, this algorithm's search bias is directly tied to the prior and its MCMC proposal kernels, which means we can draw on the full Bayesian toolbox to express the search bias, including nonparametric priors and structured, recursive processes like grammars over action sequences. Furthermore, we can reason about uncertainty in the search bias itself by constructing a hierarchical prior and reasoning about latent variables that determine the abstract structure of the policy. This yields an adaptive search algorithm--our algorithm learns to learn a structured policy efficiently. We show how inference over the latent variables in these policy priors enables intra- and intertask transfer of abstract knowledge. We demonstrate the flexibility of this approach by learning meta search biases, by constructing a nonparametric finite state controller to model memory, by discovering motor primitives using a simple grammar over primitive actions, and by combining all three.", "citation": "Citations (18)", "year": "2011", "departments": ["Massachusetts Institute of Technology", "Stanford University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "ijcai", "authors": ["David Wingate.....http://dblp.org/pers/hd/w/Wingate:David", "Noah D. Goodman.....http://dblp.org/pers/hd/g/Goodman:Noah_D=", "Daniel M. Roy.....http://dblp.org/pers/hd/r/Roy_0001:Daniel_M=", "Leslie Pack Kaelbling.....http://dblp.org/pers/hd/k/Kaelbling:Leslie_Pack", "Joshua B. Tenenbaum.....http://dblp.org/pers/hd/t/Tenenbaum:Joshua_B="], "pages": 6}