{"title": "Sharing multiple messages over mobile networks.", "fields": ["random geometric graph", "unicast", "complete graph", "dissemination", "communication source"], "abstract": "Information dissemination in a large network is typically achieved when each user shares its own information or resources with each other user. Consider n users randomly located over a fixed region, and k of them wish to flood their individual messages among all other users, where each user only has knowledge of its own contents and state information. The goal is to disseminate all messages using a low-overhead strategy that is one-sided and distributed while achieving an order-optimal spreading rate over a random geometric graph. In this paper, we investigate the random-push gossip-based algorithm where message selection is based on the sender's own state in a random fashion. It is first shown that random-push is inefficient in static random geometric graphs. Specifically, it is Ω(√n) times slower than optimal spreading. This gap can be closed if each user is mobile, and at each time moves “locally” using a random walk with velocity v(n). We propose an efficient dissemination strategy that alternates between individual message flooding and random gossiping. We show that this scheme achieves the optimal spreading rate as long as the velocity satisfies v(n) = ω(√log n/k). The key insight is that the mixing introduced by this velocity-limited mobility approximately uniformizes the locations of all copies of each message within the optimal spreading time, which emulates a balanced geometry-free evolution over a complete graph.", "citation": "Citations (8)", "departments": ["Stanford University", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Yuxin Chen.....http://dblp.org/pers/hd/c/Chen:Yuxin", "Sanjay Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Sanjay", "Jeffrey G. Andrews.....http://dblp.org/pers/hd/a/Andrews:Jeffrey_G="], "conf": "infocom", "year": "2011", "pages": 9}