{"title": "Privacy-preserving multi-keyword ranked search over encrypted cloud data.", "fields": ["storage as a service", "data retrieval", "threat model", "semantics", "complex data type", "ranking", "similarity measure", "plaintext", "encryption", "cloud computing", "depth first search", "information retrieval", "information privacy", "web search query", "data recovery", "cloud computing security", "personally identifiable information", "vector space model", "computer science"], "abstract": "With the advent of cloud computing, data owners are motivated to outsource their complex data management systems from local sites to the commercial public cloud for great flexibility and economic savings. But for protecting data privacy, sensitive data has to be encrypted before outsourcing, which obsoletes traditional data utilization based on plaintext keyword search. Thus, enabling an encrypted cloud data search service is of paramount importance. Considering the large number of data users and documents in the cloud, it is necessary to allow multiple keywords in the search request and return documents in the order of their relevance to these keywords. Related works on searchable encryption focus on single keyword search or Boolean keyword search, and rarely sort the search results. In this paper, for the first time, we define and solve the challenging problem of privacy-preserving multi-keyword ranked search over encrypted cloud data (MRSE).We establish a set of strict privacy requirements for such a secure cloud data utilization system. Among various multi-keyword semantics, we choose the efficient similarity measure of “coordinate matching”, i.e., as many matches as possible, to capture the relevance of data documents to the search query. We further use “inner product similarity” to quantitatively evaluate such similarity measure. We first propose a basic idea for the MRSE based on secure inner product computation, and then give two significantly improved MRSE schemes to achieve various stringent privacy requirements in two different threat models. Thorough analysis investigating privacy and efficiency guarantees of proposed schemes is given. Experiments on the real-world dataset further show proposed schemes indeed introduce low overhead on computation and communication.", "citation": "Not cited", "departments": ["Worcester Polytechnic Institute", "Illinois Institute of Technology", "Worcester Polytechnic Institute", "Illinois Institute of Technology", "Worcester Polytechnic Institute", "Walmart Labs", "City University of Hong Kong", "Utah State University", "University at Buffalo", "Dept. of Comput ... Church, VA, USA"], "authors": ["Ning Cao.....http://dblp.org/pers/hd/c/Cao_0001:Ning", "Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong", "Ming Li.....http://dblp.org/pers/hd/l/Li_0003:Ming", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing"], "conf": "infocom", "year": "2011", "pages": 9}