{"title": "CosTriage: A Cost-Aware Triage Algorithm for Bug Reporting Systems.", "fields": ["optimization problem", "data mining", "triage", "collaborative filtering", "machine learning"], "abstract": "'Who can fix this bug?' is an important question in bug triage to \"accurately\" assign developers to bug reports. To address this question, recent research treats it as a optimizing recommendation accuracy problem and proposes a solution that is essentially an instance of content-based recommendation (CBR). However, CBR is well-known to cause over-specialization, recommending only the types of bugs that each developer has solved before. This problem is critical in practice, as some experienced developers could be overloaded, and this would slow the bug fixing process. In this paper, we take two directions to address this problem: First, we reformulate the problem as an optimization problem of both accuracy and cost. Second, we adopt a content-boosted collaborative filtering (CBCF), combining an existing CBR with a collaborative filtering recommender (CF), which enhances the recommendation quality of either approach alone. However, unlike general recommendation scenarios, bug fix history is extremely sparse. Due to the nature of bug fixes, one bug is fixed by only one developer, which makes it challenging to pursue the above two directions. To address this challenge, we develop a topic-model to reduce the sparseness and enhance the quality of CBCF. Our experimental evaluation shows that our solution reduces the cost efficiently by 30% without seriously compromising accuracy.", "citation": "Citations (75)", "departments": ["Pohang University of Science and Technology", "Pohang University of Science and Technology", "Pohang University of Science and Technology", "Pohang University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Jin-Woo Park.....http://dblp.org/pers/hd/p/Park:Jin=Woo", "Mu-Woong Lee.....http://dblp.org/pers/hd/l/Lee:Mu=Woong", "Jinhan Kim.....http://dblp.org/pers/hd/k/Kim:Jinhan", "Seung-won Hwang.....http://dblp.org/pers/hd/h/Hwang:Seung=won", "Sunghun Kim.....http://dblp.org/pers/hd/k/Kim_0001:Sunghun"], "conf": "aaai", "year": "2011", "pages": -1}