{"title": "Fg-STP: Fine-Grain Single Thread Partitioning on Multicores.", "fields": ["out of order execution", "profiling", "speedup", "thread", "granularity"], "abstract": "Power and complexity issues have led the microprocessor industry to shift to Chip Multiprocessors in order to be able to better utilize the additional transistors ensured by Moore's law. While parallel programs are going to be able to take most of the advantage of these CMPs, single thread applications are not equipped to benefit from them. In this paper we propose Fine-Grain Single-Thread Partitioning (Fg-STP), a hardware-only scheme that takes advantage of CMP designs to speedup single-threaded applications. Our proposal improves single thread performance by reconfiguring two cores with the aim of collaborating on the fetching and execution of the instructions. These cores are basically conventional out-of-order cores in which execution is orchestrated using a dedicated hardware that has minimum and localized impact on the original design of the cores. This approach partitions the code at instruction granularity and differs from previous proposals on the extensive use of dependence speculation, replication and communication. These features are combined with the ability to look for parallelism on large instruction windows without any software intervention (no re-compilation or profiling hints are needed). These characteristics allow Fg-STP to speedup single thread by 18% and 7% on average over similar hardware-only approaches like Core Fusion, on medium sized and small sized 2-core CMP respectively for Spec 2006 benchmarks.", "citation": "Citations (6)", "departments": ["Intel", "Intel", "Intel", "Intel"], "authors": ["Rakesh Ranjan.....http://dblp.org/pers/hd/r/Ranjan:Rakesh", "Fernando Latorre.....http://dblp.org/pers/hd/l/Latorre:Fernando", "Pedro Marcuello.....http://dblp.org/pers/hd/m/Marcuello:Pedro", "Antonio González.....http://dblp.org/pers/hd/g/Gonz=aacute=lez_0001:Antonio"], "conf": "hpca", "year": "2011", "pages": 10}