{"title": "Source-Selection-Free Transfer Learning.", "fields": ["inductive transfer", "stability", "synchronous learning", "multi task learning", "online machine learning"], "abstract": "Transfer learning addresses the problems that labeled training data are insufficient to produce a high-performance model. Typically, given a target learning task, most transfer learning approaches require to select one or more auxiliary tasks as sources by the designers. However, how to select the right source data to enable effective knowledge transfer automatically is still an unsolved problem, which limits the applicability of transfer learning. In this paper, we take one step ahead and propose a novel transfer learning framework, known as source-selection-free transfer learning (SSFTL), to free users from the need to select source domains. Instead of asking the users for source and target data pairs, as traditional transfer learning does, SSFTL turns to some online information sources such as World Wide Web or the Wikipedia for help. The source data for transfer learning can be hidden somewhere within this large online information source, but the users do not know where they are. Based on the online information sources, we train a large number of classifiers. Then, given a target task, a bridge is built for labels of the potential source candidates and the target domain data in SSFTL via some large online social media with tag cloud as a label translator. An added advantage of SSFTL is that, unlike many previous transfer learning approaches, which are difficult to scale up to the Web scale, SSFTL is highly scalable and can offset much of the training work to offline stage. We demonstrate the effectiveness and efficiency of SSFTL through extensive experiments on several real-world datasets in text classification.", "citation": "Citations (7)", "year": "2011", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Institute for I ... xis, Singapore", "Institute for I ... xis, Singapore"], "conf": "ijcai", "authors": ["Evan Wei Xiang.....http://dblp.org/pers/hd/x/Xiang:Evan_Wei", "Sinno Jialin Pan.....http://dblp.org/pers/hd/p/Pan:Sinno_Jialin", "Weike Pan.....http://dblp.org/pers/hd/p/Pan:Weike", "Jian Su.....http://dblp.org/pers/hd/s/Su:Jian", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "pages": 6}