{"title": "Exploiting Memory Device Wear-Out Dynamics to Improve NAND Flash Memory System Performance.", "fields": ["interleaved memory", "registered memory", "computer memory", "memory refresh", "redundant array of independent memory"], "abstract": "This paper advocates a device-aware design strategy to improve various NAND flash memory system performance metrics. It is well known that NAND flash memory program/erase (PE) cycling gradually degrades memory device raw storage reliability, and sufficiently strong error correction codes (ECC) must be used to ensure the PE cycling endurance. Hence, memory manufacturers must fabricate enough number of redundant memory cells geared to the worst-case device reliability at the end of memory lifetime. Given the memory device wear-out dynamics, the existing worst-case oriented ECC redundancy is largely under-utilized over the entire memory lifetime, which can be adaptively traded for improving certain NAND flash memory system performance metrics. This paper explores such device-aware adaptive system design space from two perspectives, including (1) how to improve memory program speed, and (2) how to improve memory defect tolerance and hence enable aggressive fabrication technology scaling. To enable quantitative evaluation, we for the first time develop a NAND flash memory device model to capture the effects of PE cycling from the system level. We carry out simulations using the DiskSim-based SSD simulator and a variety of traces, and the results demonstrate up to 32% SSD average response time reduction. We further demonstrate that the potential on achieving very good defect tolerance, and finally show that these two design approaches can be readily combined together to noticeably improve SSD average response time even in the presence of high memory defect rates.", "citation": "Citations (77)", "departments": ["Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute", "Rensselaer Polytechnic Institute"], "authors": ["Yangyang Pan.....http://dblp.org/pers/hd/p/Pan:Yangyang", "Guiqiang Dong.....http://dblp.org/pers/hd/d/Dong:Guiqiang", "Tong Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Tong"], "conf": "fast", "year": "2011", "pages": 14}