{"title": "Similarity invariant classification of events by KL divergence minimization.", "fields": ["optical flow", "contextual image classification", "kullback leibler divergence", "mixture distribution", "iterative closest point"], "abstract": "This paper proposes a novel method for recognition and classification of events represented by Mixture distributions of location and flow. The main idea is to classify observed events into semantically meaningful groups even when motion is observed from distinct viewpoints. Events in the proposed framework are modeled as motion patterns, which are represented by mixtures of multivariate Gaussians, and are obtained by hierarchical clustering of optical flow in the four dimensional space (x, y, u, v). Such motion patterns observed from varying viewpoints, and in distinct locations or datasets, can be compared using different families of divergences between statistical distributions, given that a transformation between the views is known. One of the major contributions of this paper is to compare and match two motion pattern mixture distributions by estimating the similarity transformation between them, that minimizes their Kullback-Leibler (KL) divergence. The KL divergence between Gaussian mixtures is approximated by Monte Carlo sampling, and the minimization is accomplished by employing an iterative nonlinear least squares estimation method, which bears close resemblance to the Iterative Closest Point (ICP) algorithm. We present a robust framework for matching of high-dimensional, sampled point sets representing statistical distributions, by defining similarity measures between them, for global energy minimization. The proposed approach is tested for classification of events observed across several datasets, captured from both static and moving cameras, involving real world pedestrian as well as vehicular motion. Encouraging results are obtained which demonstrate the feasibility and validity of the proposed approach.", "citation": "Citations (5)", "year": "2011", "departments": ["University of Central Florida", "University of Central Florida", "University of Central Florida"], "conf": "iccv", "authors": ["Salman Khokhar.....http://dblp.org/pers/hd/k/Khokhar:Salman", "Imran Saleemi.....http://dblp.org/pers/hd/s/Saleemi:Imran", "Mubarak Shah.....http://dblp.org/pers/hd/s/Shah:Mubarak"], "pages": 8}