{"title": "SMITE: A stochastic compressive data collection protocol for Mobile Wireless Sensor Networks.", "fields": ["mobile telephony", "network topology", "sink", "mobile phone", "mobile device"], "abstract": "Wireless sensors are attached to all kinds of mobile devices/entities such as mobile phones, PDAs, vehicles, robots and animals. This generates Mobile Wireless Sensor Networks (MWSNs) with very dynamic topologies and loose connectivity that depend on mobility of the mobile devices. Data collection from these mobile sensors has become a great challenge considering volatile topologies, loose connectivity and limited buffer storage. This paper proposes a stochastic compressive data collection protocol for MWSNs named SMITE. SMITE consists of three parts: random collector election, stochastic direct transmission from common nodes to collectors when common nodes are in the collectors' transmission range, and angle transmission from collectors to the mobile sink when collectors gather enough data using a predictive method. The collectors use bloom filters to compress the received data. The protocol's performance is theoretically analyzed. The analytic results show that data from the common nodes can be gathered to the collectors with a high probability and gathered data on the collectors can also be forwarded to the mobile sink with a high probability. Simulations are carried out for performance evaluation. The simulation results show that SMITE significantly outperforms the state-of-the-art solutions such as DFT-MSN, SCAR and Sidewinder on the aspects of delivery ratio, transmission overhead, and time delay.", "citation": "Citations (22)", "departments": ["Heilongjiang University", "Georgia State University", "Georgia State University"], "authors": ["Longjiang Guo.....http://dblp.org/pers/hd/g/Guo:Longjiang", "Raheem A. Beyah.....http://dblp.org/pers/hd/b/Beyah:Raheem_A=", "Yingshu Li.....http://dblp.org/pers/hd/l/Li:Yingshu"], "conf": "infocom", "year": "2011", "pages": 9}