{"title": "Parallel index and query for large scale data analysis.", "fields": ["search engine indexing", "software framework", "supercomputer", "scalability", "data mining", "data management"], "abstract": "Modern scientific datasets present numerous data management and analysis challenges. State-of-the-art index and query technologies are critical for facilitating interactive exploration of large datasets, but numerous challenges remain in terms of designing a system for processing general scientific datasets. The system needs to be able to run on distributed multi-core platforms, efficiently utilize underlying I/O infrastructure, and scale to massive datasets.   We present FastQuery, a novel software framework that address these challenges. FastQuery utilizes a state-of-the-art index and query technology (FastBit) and is designed to process massive datasets on modern supercomputing platforms. We apply FastQuery to processing of a massive 50TB dataset generated by a large scale accelerator modeling code. We demonstrate the scalability of the tool to 11,520 cores. Motivated by the scientific need to search for interesting particles in this dataset, we use our framework to reduce search time from hours to tens of seconds.", "citation": "Not cited", "departments": ["Brown University", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory"], "authors": ["Jerry Chi-Yuan Chou.....http://dblp.org/pers/hd/c/Chou:Jerry_Chi=Yuan", "Mark Howison.....http://dblp.org/pers/hd/h/Howison:Mark", "Brian Austin.....http://dblp.org/pers/hd/a/Austin:Brian", "Kesheng Wu.....http://dblp.org/pers/hd/w/Wu:Kesheng", "Ji Qiang.....http://dblp.org/pers/hd/q/Qiang:Ji", "E. Wes Bethel.....http://dblp.org/pers/hd/b/Bethel:E=_Wes", "Arie Shoshani.....http://dblp.org/pers/hd/s/Shoshani:Arie", "Oliver Rübel.....http://dblp.org/pers/hd/r/R=uuml=bel:Oliver", "Prabhat.....http://dblp.org/pers/hd/p/Prabhat:", "Robert D. Ryne.....http://dblp.org/pers/hd/r/Ryne:Robert_D="], "conf": "sc", "year": "2011", "pages": 11}