{"title": "HAQu: Hardware-accelerated queueing for fine-grained threading on a chip multiprocessor.", "fields": ["hardware acceleration", "instruction set", "multi core processor", "software pipelining", "virtualization"], "abstract": "Queues are commonly used in multithreaded programs for synchronization and communication. However, because software queues tend to be too expensive to support finegrained parallelism, hardware queues have been proposed to reduce overhead of communication between cores. Hardware queues require modifications to the processor core and need a custom interconnect. They also pose difficulties for the operating system because their state must be preserved across context switches. To solve these problems, we propose a hardware-accelerated queue, or HAQu. HAQu adds hardware to a CMP that accelerates operations on software queues. Our design implements fast queueing through an application's address space with operations that are compatible with a fully software queue. Our design provides accelerated and OS-transparent performance in three general ways: (1) it provides a single instruction for enqueueing and dequeueing which significantly reduces the overhead when used in fine-grained threading; (2) operations on the queue are designed to leverage low-level details of the coherence protocol; and (3) hardware ensures that the full state of the queue is stored in the application's address space, thereby ensuring virtualization. We have evaluated our design in the context of application domains: offloading fine-grained checks for improved software reliability, and automatic, fine-grained parallelization using decoupled software pipelining.", "citation": "Citations (10)", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University", "North Carolina State University"], "authors": ["Sanghoon Lee.....http://dblp.org/pers/hd/l/Lee_0006:Sanghoon", "Devesh Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Devesh", "Yan Solihin.....http://dblp.org/pers/hd/s/Solihin:Yan", "James Tuck.....http://dblp.org/pers/hd/t/Tuck:James"], "conf": "hpca", "year": "2011", "pages": 12}