{"title": "BodyT2: Throughput and time delay performance assurance for heterogeneous BSNs.", "fields": ["phy", "throughput", "system deployment", "resource management", "wireless sensor network"], "abstract": "Body sensor networks (BSNs) have been developed for a set of performance-critical applications, including smart healthcare, assisted living, emergency response, athletic performance evaluation, and interactive controls. Many of these applications require stringent performance assurance in terms of communication throughput and bounded time delay. While solutions exist in literature for providing joint throughput and time delay assurance by proposing specific MAC protocols or extensions, we provide this joint assurance in a novel radio-agnostic manner. In our approach, the underlying MAC and PHY layers can be heterogeneous and their details do not need to be known to upper layers like the resource management. Such a radio-agnostic performance assurance is critical because a range of radio platforms are adopted for practical body sensor usage. Our approach is based on a group-polling scheme that is essential for radio-agnostic BSN design. Through theoretical analysis, we prove that with the group-polling scheme, achieving joint throughput and time delay assurance is an NP-hard problem. For practical system deployment, we propose the BodyT2 framework that assures throughput and time delay performance in a heterogeneous BSN. Through both TelosB mote lab tests and real body experiments in an Android phone-centric BSN, we demonstrate that BodyT2 achieves superior performance over existing solutions.", "citation": "Citations (18)", "departments": ["College of William & Mary", "College of William & Mary", "College of William & Mary", "College of William & Mary", "College of William & Mary"], "authors": ["Zhen Ren.....http://dblp.org/pers/hd/r/Ren:Zhen", "Gang Zhou.....http://dblp.org/pers/hd/z/Zhou:Gang", "Andrew J. Pyles.....http://dblp.org/pers/hd/p/Pyles:Andrew_J=", "Matthew Keally.....http://dblp.org/pers/hd/k/Keally:Matthew", "Weizhen Mao.....http://dblp.org/pers/hd/m/Mao:Weizhen", "Haining Wang.....http://dblp.org/pers/hd/w/Wang:Haining"], "conf": "infocom", "year": "2011", "pages": 9}