{"title": "Distributed power control in the SINR model.", "fields": ["power control", "bounded function", "network topology", "rate of convergence", "signal to interference plus noise ratio"], "abstract": "The power control problem for wireless networks in the SINR model requires determining the optimal power assignment for a set of communication requests such that the SINR threshold is met for all receivers. If the network topology is known to all participants, then it is possible to compute an optimal power assignment in polynomial time. In realistic environments, however, such global knowledge is usually not available to every node. In addition, protocols that are based on global computation cannot support mobility and hardly adapt when participants dynamically join or leave the system. In this paper we present and analyze a fully distributed power control protocol that is based on local information. For a set of communication pairs, each consisting of a sender node and a designated receiver node, the algorithm enables the nodes to converge to the optimal power assignment (if there is one under the given constraints) quickly with high probability. Two types of bounded resources are considered, namely, the maximal transmission energy and the maximum distance between any sender and receiver. It is shown that the restriction to local computation increases the convergence rate by only a multiplicative factor of O(log n + log log Ψ max ), where Ψ max  is the maximal power constraint of the network. If the diameter of the network is bounded by L max  then the increase in convergence rate is given by O(log n + log log L max ).", "citation": "Citations (10)", "departments": ["Ben-Gurion University of the Negev", "Weizmann Institute of Science", "Weizmann Institute of Science", "ABB Corporate R ... il, Switzerland"], "authors": ["Zvi Lotker.....http://dblp.org/pers/hd/l/Lotker:Zvi", "Merav Parter.....http://dblp.org/pers/hd/p/Parter:Merav", "David Peleg.....http://dblp.org/pers/hd/p/Peleg:David", "Yvonne Anne Pignolet.....http://dblp.org/pers/hd/p/Pignolet:Yvonne_Anne"], "conf": "infocom", "year": "2011", "pages": 9}