{"title": "Localized principal component analysis based curve evolution: A divide and conquer approach.", "fields": ["parametric model", "divide and conquer algorithms", "level set", "market segmentation", "signed distance function"], "abstract": "We propose a novel localized principal component analysis (PCA) based curve evolution approach which evolves the segmenting curve semi-locally within various target regions (divisions) in an image and then combines these locally accurate segmentation curves to obtain a global segmentation. The training data for our approach consists of training shapes and associated auxiliary (target) masks. The masks indicate the various regions of the shape exhibiting highly correlated variations locally which may be rather independent of the variations in the distant parts of the global shape. Thus, in a sense, we are clustering the variations exhibited in the training data set. We then use a parametric model to implicitly represent each localized segmentation curve as a combination of the local shape priors obtained by representing the training shapes and the masks as a collection of signed distance functions. We also propose a parametric model to combine the locally evolved segmentation curves into a single hybrid (global) segmentation. Finally, we combine the evolution of these semi-local and global parameters to minimize an objective energy function. The resulting algorithm thus provides a globally accurate solution, which retains the local variations in shape. We present some results to illustrate how our approach performs better than the traditional approach with fully global PCA.", "citation": "Citations (8)", "year": "2011", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Emory University"], "conf": "iccv", "authors": ["Vikram V. Appia.....http://dblp.org/pers/hd/a/Appia:Vikram_V=", "Balaji Ganapathy.....http://dblp.org/pers/hd/g/Ganapathy:Balaji", "Anthony J. Yezzi.....http://dblp.org/pers/hd/y/Yezzi:Anthony_J=", "Tracy L. Faber.....http://dblp.org/pers/hd/f/Faber:Tracy_L="], "pages": 6}