{"title": "Synthesizing concurrent schedulers for irregular algorithms.", "fields": ["rate monotonic scheduling", "two level scheduling", "round robin scheduling", "fair share scheduling", "dynamic priority scheduling"], "abstract": "Scheduling is the assignment of tasks or activities to processors for execution, and it is an important concern in parallel programming. Most prior work on scheduling has focused either on static scheduling of applications in which the dependence graph is known at compile-time or on dynamic scheduling of independent loop iterations such as in OpenMP.   In irregular algorithms, dependences between activities are complex functions of runtime values so these algorithms are not amenable to compile-time analysis nor do they consist of independent activities. Moreover, the amount of work can vary dramatically with the scheduling policy. To handle these complexities, implementations of irregular algorithms employ carefully handcrafted, algorithm-specific schedulers but these schedulers are themselves parallel programs, complicating the parallel programming problem further.   In this paper, we present a flexible and efficient approach for specifying and synthesizing scheduling policies for irregular algorithms. We develop a simple compositional specification language and show how it can concisely encode scheduling policies in the literature. Then, we show how to synthesize efficient parallel schedulers from these specifications. We evaluate our approach for five irregular algorithms on three multicore architectures and show that (1) the performance of some algorithms can improve by orders of magnitude with the right scheduling policy, and (2) for the same policy, the overheads of our synthesized schedulers are comparable to those of fixed-function schedulers.", "citation": "Citations (20)", "year": "2011", "departments": ["University of Texas at Austin", "University of Texas at Austin"], "conf": "asplos", "authors": ["Donald Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Donald", "Keshav Pingali.....http://dblp.org/pers/hd/p/Pingali:Keshav"], "pages": 12}