{"title": "Inter-core prefetching for multicore processors using migrating helper threads.", "fields": ["instruction prefetch", "microcode", "microarchitecture", "thread", "instruction set"], "abstract": "Multicore processors have become ubiquitous in today's systems, but exploiting the parallelism they offer remains difficult, especially for legacy application and applications with large serial components. The challenge, then, is to develop techniques that allow multiple cores to work in concert to accelerate a single thread. This paper describes inter-core prefetching, a technique to exploit multiple cores to accelerate a single thread. Inter-core prefetching extends existing work on helper threads for SMT machines to multicore machines.   Inter-core prefetching uses one compute thread and one or more prefetching threads. The prefetching threads execute on cores that would otherwise be idle, prefetching the data that the compute thread will need. The compute thread then migrates between cores, following the path of the prefetch threads, and finds the data already waiting for it. Inter-core prefetching works with existing hardware and existing instruction set architectures. Using a range of state-of-the-art multiprocessors, this paper characterizes the potential benefits of the technique with microbenchmarks and then measures its impact on a range of memory intensive applications. The results show that inter-core prefetching improves performance by an average of 31 to 63%, depending on the architecture, and speeds up some applications by as much as 2.8×. It also demonstrates that inter-core prefetching reduces energy consumption by between 11 and 26% on average.", "citation": "Citations (75)", "year": "2011", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "asplos", "authors": ["Md Kamruzzaman.....http://dblp.org/pers/hd/k/Kamruzzaman:Md", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven", "Dean M. Tullsen.....http://dblp.org/pers/hd/t/Tullsen:Dean_M="], "pages": 12}