{"title": "Hardware/software co-design for energy-efficient seismic modeling.", "fields": ["system on a chip", "multi core processor", "cuda", "graphics processing unit", "integrated circuit design"], "abstract": "Reverse Time Migration (RTM) has become the standard for high-quality imaging in the seismic industry. RTM relies on PDE solutions using stencils that are 8  t   h  order or larger, which require large-scale HPC clusters to meet the computational demands. However, the rising power consumption of conventional cluster technology has prompted investigation of architectural alternatives that offer higher computational efficiency. In this work, we compare the performance and energy efficiency of three architectural alternatives -- the Intel Nehalem X5530 multicore processor, the NVIDIA Tesla C2050 GPU, and a general-purpose manycore chip design optimized for high-order wave equations called \"Green Wave.\" We have developed an FPGA-accelerated architectural simulation platform to accurately model the power and performance of the Green Wave design. Results show that across highly-tuned high-order RTM stencils, the Green Wave implementation can offer up to 8x and 3.5x energy efficiency improvement per node respectively, compared with the Nehalem and GPU platforms. These results point to the enormous potential energy advantages of our hardware/software co-design methodology.", "citation": "Citations (26)", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory"], "authors": ["Jens Krueger.....http://dblp.org/pers/hd/k/Krueger:Jens", "David Donofrio.....http://dblp.org/pers/hd/d/Donofrio:David", "John Shalf.....http://dblp.org/pers/hd/s/Shalf:John", "Marghoob Mohiyuddin.....http://dblp.org/pers/hd/m/Mohiyuddin:Marghoob", "Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid", "Franz-Josef Pfreund.....http://dblp.org/pers/hd/p/Pfreund:Franz=Josef"], "conf": "sc", "year": "2011", "pages": 12}