{"title": "Modeling the HTML DOM and browser API in static analysis of JavaScript web applications.", "fields": ["client side scripting", "xmlhttprequest", "server side scripting", "html scripting", "unobtrusive javascript"], "abstract": "Developers of JavaScript web applications have little tool support for catching errors early in development. In comparison, an abundance of tools exist for statically typed languages, including sophisticated integrated development environments and specialized static analyses. Transferring such technologies to the domain of JavaScript web applications is challenging. In this paper, we discuss the challenges, which include the dynamic aspects of JavaScript and the complex interactions between JavaScript, HTML, and the browser. From this, we present the first static analysis that is capable of reasoning about the flow of control and data in modern JavaScript applications that interact with the HTML DOM and browser API.   One application of such a static analysis is to detect type-related and dataflow-related programming errors. We report on experiments with a range of modern web applications, including Chrome Experiments and IE Test Drive applications, to measure the precision and performance of the technique. The experiments indicate that the analysis is able to show absence of errors related to missing object properties and to identify dead and unreachable code. By measuring the precision of the types inferred for object properties, the analysis is precise enough to show that most expressions have unique types. By also producing precise call graphs, the analysis additionally shows that most invocations in the programs are monomorphic. We furthermore study the usefulness of the analysis to detect spelling errors in the code. Despite the encouraging results, not all problems are solved and some of the experiments indicate a potential for improvement, which allows us to identify central remaining challenges and outline directions for future work.", "citation": "Citations (99)", "departments": ["Aarhus University", "Aarhus University", "Aarhus University"], "authors": ["Simon Holm Jensen.....http://dblp.org/pers/hd/j/Jensen:Simon_Holm", "Magnus Madsen.....http://dblp.org/pers/hd/m/Madsen:Magnus", "Anders Møller.....http://dblp.org/pers/hd/m/M=oslash=ller:Anders"], "conf": "sigsoft", "year": "2011", "pages": 11}