{"title": "Does wireless sensor network scale? A measurement study on GreenOrbs.", "fields": ["network management station", "key distribution in wireless sensor networks", "network operations center", "mobile wireless sensor network", "intelligent computer network", "spite", "sensor web"], "abstract": "In spite of the remarkable efforts the community put to build the sensor systems, an essential question still remains unclear at the system level, motivating us to explore the answer from a point of real-world deployment view. Does the wireless sensor network really scale? We present findings from a large scale operating sensor network system, GreenOrbs, with up to 330 nodes deployed in the forest. We instrument such an operating network throughout the protocol stack and present observations across layers in the network. Based on our findings from the system measurement, we propose and make initial efforts to validate three conjectures that give potential guidelines for future designs of large scale sensor networks. (1) A small portion of nodes bottlenecks the entire network, and most of the existing network indicators may not accurately capture them. (2) The network dynamics mainly come from the inherent concurrency of network operations instead of environment changes. (3) The environment, although the dynamics are not as significant as we assumed, has an unpredictable impact on the sensor network. We suggest that an event-based routing structure can be trained optimal and thus better adapt to the wild environment when building a large scale sensor network.", "citation": "Citations (377)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Nanyang Technological University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Tsinghua University", "Tsinghua University", "Nanyang Technological University", "Tsinghua University", "Tsinghua University"], "authors": ["Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Yuan He.....http://dblp.org/pers/hd/h/He_0004:Yuan", "Mo Li.....http://dblp.org/pers/hd/l/Li:Mo", "Jiliang Wang.....http://dblp.org/pers/hd/w/Wang:Jiliang", "Kebin Liu.....http://dblp.org/pers/hd/l/Liu:Kebin", "Lufeng Mo.....http://dblp.org/pers/hd/m/Mo:Lufeng", "Wei Dong.....http://dblp.org/pers/hd/d/Dong_0001:Wei", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng", "Min Xi.....http://dblp.org/pers/hd/x/Xi:Min", "Jizhong Zhao.....http://dblp.org/pers/hd/z/Zhao:Jizhong", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang"], "conf": "infocom", "year": "2011", "pages": 9}