{"title": "Making the Common Case the Only Case with Anticipatory Memory Allocation.", "fields": ["kernel", "static program analysis", "static analysis", "file system", "static memory allocation", "memory management"], "abstract": "We present  anticipatory memory allocation  (AMA), a new method to build kernel code that is robust to memory-allocation failures. AMA avoids the usual difficulties in handling allocation failures through a novel combination of static and dynamic techniques. Specifically, a developer, with assistance from AMA static analysis tools, determines how much memory a particular call into a kernel subsystem will need, and then preallocates said amount immediately upon entry to the kernel; subsequent allocation requests are serviced from the preallocated pool and thus guaranteed never to fail. We describe the static and runtime components of AMA, and then present a thorough evaluation of Linux ext2-mfr, a case study in which we transform the Linux ext2 file system into a memory-failure robust version of itself. Experiments reveal that ext2-mfr avoids memory-allocation failures successfully while incurring little space or time overhead.", "citation": "Citations (4)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Swaminathan Sundararaman.....http://dblp.org/pers/hd/s/Sundararaman:Swaminathan", "Yupu Zhang.....http://dblp.org/pers/hd/z/Zhang:Yupu", "Sriram Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Sriram", "Andrea C. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Andrea_C=", "Remzi H. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Remzi_H="], "conf": "fast", "year": "2011", "pages": 14}