{"title": "GRoundTram: An integrated framework for developing well-behaved bidirectional model transformations.", "fields": ["software development", "verification and validation", "software maintenance", "software construction", "computer science", "software evolution", "theoretical computer science"], "abstract": "Bidirectional model transformation is useful for maintaining consistency between two models, and has many potential applications in software development including model synchronization, round-trip engineering, and software evolution. Despite these attractive uses, the lack of a practical tool support for systematic development of well-behaved and efficient bidirectional model transformation prevents it from being widely used. In this paper, we solve this problem by proposing an integrated framework called GRoundTram, which is carefully designed and implemented for compositional development of well-behaved and efficient bidirectional model transformations. GRoundTram is built upon a well-founded bidirectional framework, and is equipped with a user-friendly language for coding bidirectional model transformation, a new tool for validating both models and bidirectional model transformations, an optimization mechanism for improving efficiency, and a powerful debugging environment for testing bidirectional behavior. GRoundTram has been used by people of other groups and their results show its usefulness in practice.", "citation": "Citations (59)", "departments": ["National Institute of Informatics", "National Institute of Informatics", "National Institute of Informatics", "National Institute of Informatics", "University of Electro-Communications"], "authors": ["Soichiro Hidaka.....http://dblp.org/pers/hd/h/Hidaka:Soichiro", "Zhenjiang Hu.....http://dblp.org/pers/hd/h/Hu:Zhenjiang", "Kazuhiro Inaba.....http://dblp.org/pers/hd/i/Inaba:Kazuhiro", "Hiroyuki Kato.....http://dblp.org/pers/hd/k/Kato:Hiroyuki", "Keisuke Nakano.....http://dblp.org/pers/hd/n/Nakano:Keisuke"], "conf": "kbse", "year": "2011", "pages": 4}