{"title": "Network selection for secondary users in cognitive radio systems.", "fields": ["collision", "cognitive radio", "throughput", "radio spectrum", "queueing theory"], "abstract": "Existing studies have demonstrated that uneven and dynamic usage patterns by the primary users of license-based wireless communication systems can often lead to temporal and spatial spectrum underutilization. This provides an opportunity for the secondary users (SUs) to tap into underutilized frequency bands provided that they are capable of cognitively accessing systems without colliding or impacting the performance of the primary users (PUs). When there are multiple networks with spare spectrum, secondary users can opportunistically choose the best network to access, subject to certain constraints. In cognitive radio systems, this is referred to as the network selection problem for secondary users. This paper develops a Markov queuing model to obtain the maximum allowable arrival rate of secondary users subject to a target collision probability for the primary users. Based on this model, we design a novel Collision-Constrained Network Selection (CCNS) method that maximizes secondary users' throughput subject to a given PU collision probability. Further, we propose two approaches, referred as CCNS-Greedy and CCNS-Energy, which target to reduce collision probability and to decrease energy consumption of secondary users when the system is underloaded. This, however, has one practical drawback in that the proposed CCNS method depends on PU and SU traffic characteristics such as inter-arrival time and service time, which might not be available in real scenario. We next illustrate that a MEAsurement-based Networks Selection (MEANS) scheme can be used to perform network selection for secondary users based on online measurement of PU collision probability of each network. We evaluated the performance based on extensive simulation, which conclusively shows that the proposed schemes achieve the best performance in terms of resulting PU collision probability, SU throughput, and SU energy consumption, when compared to both Random and Greedy strategies.", "citation": "Citations (10)", "departments": ["InterDigital, Inc.", "University of Arkansas", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "authors": ["Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang", "Kazem Sohraby.....http://dblp.org/pers/hd/s/Sohraby:Kazem", "Rittwik Jana.....http://dblp.org/pers/hd/j/Jana:Rittwik", "Lusheng Ji.....http://dblp.org/pers/hd/j/Ji:Lusheng", "Mahmoud Daneshmand.....http://dblp.org/pers/hd/d/Daneshmand:Mahmoud"], "conf": "infocom", "year": "2011", "pages": 9}