{"title": "PVA in VANETs: Stopped cars are not silent.", "fields": ["wireless", "wireless ad hoc network", "vehicular ad hoc network", "distributed computing", "computer network"], "abstract": "In Vehicular Ad Hoc Networks (VANETs), the major communication challenge lies in very poor connectivity, which can be caused by sparse or unbalanced traffic. Deploying supporting infrastructure could relieve this problem, but it often requires a large amount of investment and elaborate design, especially at the city scale. In this paper, we propose the idea of Parked Vehicle Assistance (PVA), which allows parked vehicles to join VANETs as static nodes. With wireless device and rechargable battery, parked vehicles can easily communicate with one another and their moving counterparts. Owing to the extensive parking in cities, parked vehicles are natural roadside nodes characterized by large number, long-time staying, wide distribution, and specific location. So parked vehicles can serve as static backbone and service infrastructure to improve connectivity. We investigate network connectivity in PVA through theoretic analysis and realistic survey and simulations. The results prove that even a small proportion of PVA vehicles could overcome sparse or unbalanced traffic, and promote network connectivity greatly. Thus, PVA enhances VANETs from down to top, and paves the way for new hybrid networks with static and mobile nodes.", "citation": "Citations (87)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "Hong Kong Polytechnic University", "Shanghai Jiao Tong University", "Hong Kong Polytechnic University"], "authors": ["Nianbo Liu.....http://dblp.org/pers/hd/l/Liu:Nianbo", "Ming Liu.....http://dblp.org/pers/hd/l/Liu_0002:Ming", "Wei Lou.....http://dblp.org/pers/hd/l/Lou:Wei", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai", "Jiannong Cao.....http://dblp.org/pers/hd/c/Cao:Jiannong"], "conf": "infocom", "year": "2011", "pages": 5}