{"title": "Converge-cast with MIMO.", "fields": ["mobile ad hoc network", "bounded function", "bottleneck", "throughput", "mimo"], "abstract": "This paper investigates throughput and delay based on a newly predominant traffic pattern, called converge-cast, where each of the n nodes in the network act as a destination with k randomly chosen sources corresponding to it. Adopting Multiple-Input-Multiple-Output (MIMO) technology, we devise two many-to-one cooperative schemes under converge-cast for both static and mobile ad hoc networks (MANETs), respectively. In a static network, our scheme highly utilizes hierarchical cooperation MIMO transmission. This feature overcomes the bottleneck which hinders converge-cast traffic from yielding ideal performance in traditional ad hoc network, by turning the originally interfering signals into interference-resistant ones. It helps to achieve an aggregate throughput up to Ω(n 1−e ) for any e > 0. In the mobile ad hoc case, our scheme characterizes on joint transmission from multiple nodes to multiple receivers. With optimal network division where the number of nodes per cell is constant bounded, the achievable per-node throughput can reach Θ(1) with the corresponding delay reduced to Θ(k). The gain comes from the strong and intelligent cooperation between nodes in our scheme, along with the maximum number of concurrent active cells and the shortest waiting time before transmission for each node within a cell. This, to a great extent, increases the chances for each destination to receive the data it needs with minimum overhead on extra transmission. Moreover, our converge-based analysis well unifies and generalizes previous work since the results derived from converge-cast in our schemes can also cover other traffic patterns. Last but not least, our cooperative schemes are of interest not only from a theoretical perspective but also shed light on future design of MIMO schemes in wireless networks.", "citation": "Citations (11)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Nebraska–Lincoln"], "authors": ["Luoyi Fu.....http://dblp.org/pers/hd/f/Fu:Luoyi", "Yi Qin.....http://dblp.org/pers/hd/q/Qin:Yi", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue"], "conf": "infocom", "year": "2011", "pages": 9}