{"title": "Robust point set registration using EM-ICP with information-theoretically optimal outlier handling.", "fields": ["iterative closest point", "point set registration", "outlier", "point cloud", "stanford dragon"], "abstract": "In this paper the problem of pairwise model-to-scene point set registration is considered. Three contributions are made. Firstly, the relations between correspondence-based and some information-theoretic point cloud registration algorithms are formalized. Starting from the observation that the outlier handling of existing methods relies on heuristically determined models, a second contribution is made exploiting aforementioned relations to derive a new robust point set registration algorithm. Representing model and scene point clouds by mixtures of Gaus-sians, the method minimizes their Kullback-Leibler divergence both w.r.t. the registration transformation parameters and w.r.t. the scene's mixture coefficients. This results in an Expectation-Maximization Iterative Closest Point (EM-ICP) approach with a parameter-free outlier model that is optimal in information-theoretical sense. While the current (CUDA) implementation is limited to the rigid registration case, the underlying theory applies to both rigid and non-rigid point set registration. As a by-product of the registration algorithm's theory, a third contribution is made by suggesting a new point cloud Kernel Density Estimation approach which relies on maximizing the resulting distribution's entropy w.r.t. the kernel weights. The rigid registration algorithm is applied to align different patches of the publicly available Stanford Dragon and Stanford Happy Budha range data. The results show good performance regarding accuracy, robustness and convergence range.", "citation": "Citations (17)", "year": "2011", "departments": ["Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven"], "conf": "cvpr", "authors": ["Jeroen Hermans.....http://dblp.org/pers/hd/h/Hermans:Jeroen", "Dirk Smeets.....http://dblp.org/pers/hd/s/Smeets:Dirk", "Dirk Vandermeulen.....http://dblp.org/pers/hd/v/Vandermeulen:Dirk", "Paul Suetens.....http://dblp.org/pers/hd/s/Suetens:Paul"], "pages": 8}