{"title": "Are spatial and global constraints really necessary for segmentation?", "fields": ["markov chain", "latent variable", "data model", "maximum a posteriori estimation", "conditional random field"], "abstract": "Many state-of-the-art segmentation algorithms rely on Markov or Conditional Random Field models designed to enforce spatial and global consistency constraints. This is often accomplished by introducing additional latent variables to the model, which can greatly increase its complexity. As a result, estimating the model parameters or computing the best maximum a posteriori (MAP) assignment becomes a computationally expensive task. In a series of experiments on the PASCAL and the MSRC datasets, we were unable to find evidence of a significant performance increase attributed to the introduction of such constraints. On the contrary, we found that similar levels of performance can be achieved using a much simpler design that essentially ignores these constraints. This more simple approach makes use of the same local and global features to leverage evidence from the image, but instead directly biases the preferences of individual pixels. While our investigation does not prove that spatial and consistency constraints are not useful in principle, it points to the conclusion that they should be validated in a larger context.", "citation": "Citations (67)", "year": "2011", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "ETH Zurich", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "conf": "iccv", "authors": ["Aurélien Lucchi.....http://dblp.org/pers/hd/l/Lucchi:Aur=eacute=lien", "Yunpeng Li.....http://dblp.org/pers/hd/l/Li:Yunpeng", "Xavier Boix Bosch.....http://dblp.org/pers/hd/b/Bosch:Xavier_Boix", "Kevin Smith.....http://dblp.org/pers/hd/s/Smith:Kevin", "Pascal Fua.....http://dblp.org/pers/hd/f/Fua:Pascal"], "pages": 8}