{"title": "Snap & play: auto-generate personalized find-the-difference mobile game.", "fields": ["snap", "image editing", "game design", "video game development", "game developer"], "abstract": "According to the year 2010 report of the Entertainment Software Association [5], 42% of USA heads of households reported playing games on mobile devices, rising quickly from the 20% in 2002 and bringing huge market for mobile games. In this paper, by taking the popular game, Find-the-Difference (FiDi), as a concrete example, we explore new mobile game design principles and techniques for enhancing player's gaming experience in personalized, automatic, and dynamic aspects. Unlike traditional FiDi game, where image pairs (source image vs. target image) with M different patches are manually produced by game developer and players may feel boring or cheat after practicing all image pairs, our proposed Personalized FiDi (P-FiDi) mobile game may be played under a new Snap & Play mode. The player may first take photos with one s mobile device (or select from one's own albums). Then, these photos serve as source images, and the P-FiDi system automatically generates the counterpart target images by sequential operations of aesthetic image quality enhancement, image patch and differentiating style joint selection, music adaptation, dynamic difficulty level determination, and ultimate automatic image editing with a rich set of popular differentiating styles used in traditional FiDi game. Finally, the player enjoys the unique gaming with one's own (instant) photos and music, and the freedom to have new gaming image pairs any time. The user studies show that the P-FiDi mobile game is satisfying in terms of player experience.", "citation": "Citations (3)", "departments": ["Chinese Academy of Sciences", "National University of Singapore", "National University of Singapore", "National University of Singapore", "Chinese Academy of Sciences"], "authors": ["Si Liu.....http://dblp.org/pers/hd/l/Liu_0001:Si", "Qiang Chen.....http://dblp.org/pers/hd/c/Chen_0007:Qiang", "Jian Dong.....http://dblp.org/pers/hd/d/Dong:Jian", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Changsheng Xu.....http://dblp.org/pers/hd/x/Xu:Changsheng", "Hanqing Lu.....http://dblp.org/pers/hd/l/Lu:Hanqing"], "conf": "mm", "year": "2011", "pages": 4}