{"title": "Sparse multi-task regression and feature selection to identify brain imaging predictors for memory performance.", "fields": ["sparse approximation", "performance prediction", "feature selection", "empirical research", "multi task learning"], "abstract": "Alzheimer's disease (AD) is a neurodegenerative disorder characterized by progressive impairment of memory and other cognitive functions, which makes regression analysis a suitable model to study whether neuroimaging measures can help predict memory performance and track the progression of AD. Existing memory performance prediction methods via regression, however, do not take into account either the interconnected structures within imaging data or those among memory scores, which inevitably restricts their predictive capabilities. To bridge this gap, we propose a novel Sparse Multi-tAsk Regression and feaTure selection (SMART) method to jointly analyze all the imaging and clinical data under a single regression framework and with shared underlying sparse representations. Two convex regularizations are combined and used in the model to enable sparsity as well as facilitate multi-task learning. The effectiveness of the proposed method is demonstrated by both clearly improved prediction performances in all empirical test cases and a compact set of selected RAVLT-relevant MRI predictors that accord with prior studies.", "citation": "Citations (82)", "year": "2011", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington"], "conf": "iccv", "authors": ["Hua Wang.....http://dblp.org/pers/hd/w/Wang:Hua", "Feiping Nie.....http://dblp.org/pers/hd/n/Nie:Feiping", "Heng Huang.....http://dblp.org/pers/hd/h/Huang:Heng", "Shannon L. Risacher.....http://dblp.org/pers/hd/r/Risacher:Shannon_L=", "Chris H. Q. Ding.....http://dblp.org/pers/hd/d/Ding:Chris_H=_Q=", "Andrew J. Saykin.....http://dblp.org/pers/hd/s/Saykin:Andrew_J=", "Li Shen.....http://dblp.org/pers/hd/s/Shen_0001:Li"], "pages": 6}