{"title": "A domain-specific approach to heterogeneous parallelism.", "fields": ["code generation", "domain specific language", "cuda", "high level programming language", "digital subscriber line"], "abstract": "Exploiting heterogeneous parallel hardware currently requires mapping application code to multiple disparate programming models. Unfortunately, general-purpose programming models available today can yield high performance but are too low-level to be accessible to the average programmer. We propose leveraging domain-specific languages (DSLs) to map high-level application code to heterogeneous devices. To demonstrate the potential of this approach we present OptiML, a DSL for machine learning. OptiML programs are implicitly parallel and can achieve high performance on heterogeneous hardware with no modification required to the source code. For such a DSL-based approach to be tractable at large scales, better tools are required for DSL authors to simplify language creation and parallelization. To address this concern, we introduce Delite, a system designed specifically for DSLs that is both a framework for creating an implicitly parallel DSL as well as a dynamic runtime providing automated targeting to heterogeneous parallel hardware. We show that OptiML running on Delite achieves single-threaded, parallel, and GPU performance superior to explicitly parallelized MATLAB code in nearly all cases.", "citation": "Citations (175)", "year": "2011", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "conf": "ppopp", "authors": ["Hassan Chafi.....http://dblp.org/pers/hd/c/Chafi:Hassan", "Arvind K. Sujeeth.....http://dblp.org/pers/hd/s/Sujeeth:Arvind_K=", "Kevin J. Brown.....http://dblp.org/pers/hd/b/Brown:Kevin_J=", "HyoukJoong Lee.....http://dblp.org/pers/hd/l/Lee:HyoukJoong", "Anand R. Atreya.....http://dblp.org/pers/hd/a/Atreya:Anand_R=", "Kunle Olukotun.....http://dblp.org/pers/hd/o/Olukotun:Kunle"], "pages": 12}