{"title": "Energy-efficient design and optimization of wireline access networks.", "fields": ["digital subscriber line access multiplexer", "network access point", "digital subscriber line", "last mile", "heuristic"], "abstract": "Access networks, in particular, Digital Subscriber Line (DSL) equipment, are a significant source of energy consumption for wireline operators. Replacing large monolithic DSLAMs with smaller remote DSLAM units closer to customers can reduce the energy consumption as well as increase the reach of the access network. This paper attempts to formalize the design and optimization of the “last mile” wireline access network with energy as one of the costs to be minimized. In particular, the placement of remote DSLAM units needs to be optimized. We propose solutions for two scenarios. For the scenario where an existing all-copper network from the central office to the customers is to be transformed into a fiber-copper network with remote DSLAM units, we present efficient polynomial-time solutions. For the green-field scenario, where both the access network layout and the placement of remote DSLAM units must be determined, we show that this problem is NP-complete. We present an optimal ILP formulation and also design an efficient heuristic-based approach to build a power and cost optimized access network. Our heuristic-based approach yields results that are very close to optimal. We show how the power consumption of the access network can be reduced by carefully planning the access network and introducing remote DSLAM units.", "citation": "Citations (7)", "departments": ["Bell Labs", "Iowa State University", "Bell Labs", "Bell Labs"], "authors": ["Sourjya Bhaumik.....http://dblp.org/pers/hd/b/Bhaumik:Sourjya", "David Chuck.....http://dblp.org/pers/hd/c/Chuck:David", "Girija J. Narlikar.....http://dblp.org/pers/hd/n/Narlikar:Girija_J=", "Gordon T. Wilfong.....http://dblp.org/pers/hd/w/Wilfong:Gordon_T="], "conf": "infocom", "year": "2011", "pages": 5}