{"title": "Concise Characteristic Function Representations in Coalitional Games Based on Agent Types.", "fields": ["machine learning", "exponential growth", "characteristic function", "computer science", "discrete mathematics", "time complexity", "artificial intelligence"], "abstract": "Forming effective coalitions is a major research challenge in AI and multi-agent systems (MAS). Thus, coalitional games, including Coalition Structure Generation (CSG), have been attracting considerable attention from the AI research community. Traditionally, the input of a coalitional game is a black-box function called a characteristic function. A range of previous studies have found that many problems in coalitional games tend to be computationally intractable when the input is a black-box function. Recently, several concise representation schemes for a characteristic function have been proposed. Although these schemes are effective for reducing the representation size, most problems remain computationally intractable.\n\nIn this paper, we develop a new concise representation scheme based on the idea of agent types. Intuitively, a type represents a set of agents, which are recognized as having the same contribution. This representation can be exponentially more concise than existing concise representation schemes. Furthermore, this idea can be used in conjunction with existing schemes to further reduce the representation size. Moreover, we show that most of the problems in coalitional games, including CSG, can be solved in polynomial time in the number of agents, assuming the number of possible types is fixed.", "citation": "Citations (23)", "year": "2011", "departments": ["Kyushu University", "Kyushu University", "Kyushu University", "Kyushu University", "Kyushu University", "Kyushu University", "Kyushu University", "Kyushu University"], "conf": "ijcai", "authors": ["Suguru Ueda.....http://dblp.org/pers/hd/u/Ueda:Suguru", "Makoto Kitaki.....http://dblp.org/pers/hd/k/Kitaki:Makoto", "Atsushi Iwasaki.....http://dblp.org/pers/hd/i/Iwasaki:Atsushi", "Makoto Yokoo.....http://dblp.org/pers/hd/y/Yokoo:Makoto"], "pages": 7}