{"title": "Prediction of the inter-observer visual congruency (IOVC) and application to image ranking.", "fields": ["depth of field", "ranking", "human visual system model", "visual perception", "ranging"], "abstract": "This paper proposes an automatic method for predicting the inter-observer visual congruency (IOVC). The IOVC reflects the congruence or the variability among different subjects looking at the same image. Predicting this congruence is of interest for image processing applications where the visual perception of a picture matters such as website design, advertisement, etc. This paper makes several new contributions. First, a computational model of the IOVC is proposed. This new model is a mixture of low-level visual features extracted from the input picture where model's parameters are learned by using a large eye-tracking database. Once the parameters have been learned, it can be used for any new picture. Second, regarding low-level visual feature extraction, we propose a new scheme to compute the depth of field of a picture. Finally, once the training and the feature extraction have been carried out, a score ranging from 0 (minimal congruency) to 1 (maximal congruency) is computed. A value of 1 indicates that observers would focus on the same locations and suggests that the picture presents strong locations of interest. A second database of eye movements is used to assess the performance of the proposed model. Results show that our IOVC criterion outperforms the Feature Congestion measure \\cite{Rosenholtz2007}. To illustrate the interest of the proposed model, we have used it to automatically rank personalized photograph.", "citation": "Citations (27)", "departments": ["University of Rennes", "Paris 8 University", "French Institute for Research in Computer Science and Automation"], "authors": ["Olivier Le Meur.....http://dblp.org/pers/hd/m/Meur:Olivier_Le", "Thierry Baccino.....http://dblp.org/pers/hd/b/Baccino:Thierry", "Aline Roumy.....http://dblp.org/pers/hd/r/Roumy:Aline"], "conf": "mm", "year": "2011", "pages": 10}