{"title": "A Neural-Symbolic Cognitive Agent for Online Learning and Reasoning.", "fields": ["model based reasoning", "reasoning system", "verbal reasoning", "psychology of reasoning", "active learning"], "abstract": "In real-world applications, the effective integration of learning and reasoning in a cognitive agent model is a difficult task. However, such integration may lead to a better understanding, use and construction of more realistic models. Unfortunately, existing models are either oversimplified or require much processing time, which is unsuitable for online learning and reasoning. Currently, controlled environments like training simulators do not effectively integrate learning and reasoning. In particular, higher-order concepts and cognitive abilities have many unknown temporal relations with the data, making it impossible to represent such relationships by hand. We introduce a novel cognitive agent model and architecture for online learning and reasoning that seeks to effectively represent, learn and reason in complex training environments. The agent architecture of the model combines neural learning with symbolic knowledge representation. It is capable of learning new hypotheses from observed data, and infer new beliefs based on these hypotheses. Furthermore, it deals with uncertainty and errors in the data using a Bayesian inference model. The validation of the model on real-time simulations and the results presented here indicate the promise of the approach when performing online learning and reasoning in real-world scenarios, with possible applications in a range of areas.", "citation": "Citations (15)", "year": "2011", "departments": ["City University London", "Universidade Federal do Rio Grande do Sul", "Utrecht University", "TNO Behaviour a ... he Netherlands"], "conf": "ijcai", "authors": ["Leo de Penning.....http://dblp.org/pers/hd/p/Penning:Leo_de", "Artur S. d'Avila Garcez.....http://dblp.org/pers/hd/g/Garcez:Artur_S=_d=Avila", "Luís C. Lamb.....http://dblp.org/pers/hd/l/Lamb:Lu=iacute=s_C=", "John-Jules Ch. Meyer.....http://dblp.org/pers/hd/m/Meyer:John=Jules_Ch="], "pages": 6}