{"title": "Hough-based tracking of non-rigid objects.", "fields": ["training set", "image segmentation", "grabcut", "foreground background", "minimum bounding box", "object detection", "video tracking", "granularity", "online algorithm"], "abstract": "Online learning has shown to be successful in tracking-by-detection of previously unknown objects. However, most approaches are limited to a bounding-box representation with fixed aspect ratio and cannot handle highly non-rigid and articulated objects. Moreover, they provide only a limited foreground/background separation, which in turn, increases the amount of noise introduced during online self-training. To overcome the limitations of a rigid bounding box, we present a novel tracking-by-detection approach based on the generalized Hough-transform. We extend the idea of Hough Forests to the online domain and couple the voting-based detection and back-projection with a rough GrabCut segmentation. Because of the increased granularity of the object description the amount of noisy training samples during online learning is reduced significantly which prevents drifting of the tracker. To show the benefits of our approach, we demonstrate it for a variety of previously unknown objects even under heavy non-rigid transformations, partial occlusions, scale changes, and rotations. Moreover, we compare our tracker to state-of-the-art methods (bounding-box-based as well as part-based) and show robust and accurate tracking results on various challenging sequences.", "citation": "Citations (349)", "year": "2011", "departments": ["Graz University of Technology", "Graz University of Technology", "Graz University of Technology", "Graz University of Technology", "Graz University of Technology", "Graz University of Technology"], "conf": "iccv", "authors": ["Martin Godec.....http://dblp.org/pers/hd/g/Godec:Martin", "Peter M. Roth.....http://dblp.org/pers/hd/r/Roth:Peter_M=", "Horst Bischof.....http://dblp.org/pers/hd/b/Bischof:Horst"], "pages": 8}