{"title": "Network-wide monitoring through self-configuring adaptive system.", "fields": ["software deployment", "architecture", "management accounting", "adaptive system", "anomaly detection"], "abstract": "The remarkable growth of the Internet infrastructure and the increasing heterogeneity of applications and users' behavior make more complex the manageability and monitoring of ISP networks and raises the cost of any new deployment. The main consequence of this trend is an inherent disagreement between existing monitoring solutions and the increasing needs of management applications. In this context, we present the design of an adaptive centralized architecture that provides visibility over the entire network through a network-wide cognitive monitoring system. Practically, given a measurement task and a constraint on the volume of collected information, the proposed architecture drives the sampling rates on the interfaces of network routers to achieve the maximum possible accuracy, while adapting itself to any change in network traffic conditions. We illustrate our work with an accounting application whose purpose is to estimate the volume of aggregate flows across a backbone transit network. The paper provides a global study of the functioning of the proposed system and the impact of the different parameters on its behavior. The performance of our system is validated in typical scenarios over an experimental platform we developed for the purpose of the study.", "citation": "Citations (2)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Imed Lassoued.....http://dblp.org/pers/hd/l/Lassoued:Imed", "Amir Krifa.....http://dblp.org/pers/hd/k/Krifa:Amir", "Chadi Barakat.....http://dblp.org/pers/hd/b/Barakat:Chadi", "Konstantin Avrachenkov.....http://dblp.org/pers/hd/a/Avrachenkov:Konstantin"], "conf": "infocom", "year": "2011", "pages": 9}