{"title": "High-rate codes with sublinear-time decoding.", "fields": ["low density parity check code", "berlekamp welch algorithm", "serial concatenated convolutional codes", "reed muller code", "online codes", "concatenated error correction code", "tornado code", "locally decodable code", "expander code"], "abstract": "Locally decodable codes are error-correcting codes that admit efficient decoding algorithms; any bit of the original message can be recovered by looking at only a small number of locations of a corrupted codeword. The tradeoff between the rate of a code and the locality/efficiency of its decoding algorithms has been well studied, and it has widely been suspected that nontrivial locality must come at the price of low rate. A particular setting of potential interest in practice is codes of constant rate. For such codes, decoding algorithms with locality O(k e ) were known only for codes of rate exp(1/e), where k is the length of the message. Furthermore, for codes of rate > 1/2, no nontrivial locality has been achieved.   In this paper we construct a new family of locally decodable codes that have very efficient local decoding algorithms, and at the same time have rate approaching 1. We show that for every e > 0 and α > 0, for infinitely many k, there exists a code C which encodes messages of length k with rate 1 - α, and is locally decodable from a constant fraction of errors using O(k e ) queries and time. The high rate and local decodability are evident even in concrete settings (and not just in asymptotic behavior), giving hope that local decoding techniques may have practical implications.   These codes, which we call multiplicity codes, are based on evaluating high degree multivariate polynomials and their derivatives. Multiplicity codes extend traditional multivariate polynomial based codes; they inherit the local-decodability of these codes, and at the same time achieve better tradeoffs and flexibility in their rate and distance.", "citation": "Citations (76)", "year": "2011", "departments": ["Institute for Advanced Study", "Massachusetts Institute of Technology", "Microsoft", "Massachusetts Institute of Technology", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Institute for Advanced Study"], "conf": "stoc", "authors": ["Swastik Kopparty.....http://dblp.org/pers/hd/k/Kopparty:Swastik", "Shubhangi Saraf.....http://dblp.org/pers/hd/s/Saraf:Shubhangi", "Sergey Yekhanin.....http://dblp.org/pers/hd/y/Yekhanin:Sergey"], "pages": 10}