{"title": "Semistructured merge: rethinking merge in revision control systems.", "fields": ["revision control", "python", "conflict resolution", "generality", "rule based machine translation"], "abstract": "An ongoing problem in revision control systems is how to resolve conflicts in a merge of independently developed revisions. Unstructured revision control systems are purely text-based and solve conflicts based on textual similarity. Structured revision control systems are tailored to specific languages and use language-specific knowledge for conflict resolution. We propose semistructured revision control systems that inherit the strengths of both: the generality of unstructured systems and the expressiveness of structured systems. The idea is to provide structural information of the underlying software artifacts --- declaratively, in the form of annotated grammars. This way, a wide variety of languages can be supported and the information provided can assist in the automatic resolution of two classes of conflicts: ordering conflicts and semantic conflicts. The former can be resolved independently of the language and the latter using specific conflict handlers. We have been developing a tool that supports semistructured merge and conducted an empirical study on 24 software projects developed in Java, C#, and Python comprising 180 merge scenarios. We found that semistructured merge reduces the number of conflicts in 60% of the sample merge scenarios by, on average, 34%, compared to unstructured merge. We found also that renaming is challenging in that it can increase the number of conflicts during semistructured merge, and that a combination of unstructured and semistructured merge is a pragmatic way to go.", "citation": "Citations (64)", "departments": ["University of Passau", "University of Passau", "University of Passau", "University of Passau", "Philipps Univer ... arburg, Germany"], "authors": ["Sven Apel.....http://dblp.org/pers/hd/a/Apel:Sven", "Jörg Liebig.....http://dblp.org/pers/hd/l/Liebig:J=ouml=rg", "Benjamin Brandl.....http://dblp.org/pers/hd/b/Brandl:Benjamin", "Christian Lengauer.....http://dblp.org/pers/hd/l/Lengauer:Christian", "Christian Kästner.....http://dblp.org/pers/hd/k/K=auml=stner:Christian"], "conf": "sigsoft", "year": "2011", "pages": 11}