{"title": "Exploiting Half-Wits: Smarter Storage for Low-Power Devices.", "fields": ["flash file system", "computer memory", "microcontroller", "central processing unit", "flash memory"], "abstract": "This work analyzes the stochastic behavior of writing to embedded flash memory at voltages lower than recommended by a microcontroller's specifications to reduce energy consumption. Flash memory integrated within a microcontroller typically requires the entire chip to operate on common supply voltage almost double what the CPU portion requires. Our approach tolerates a lower supply voltage so that the CPU may operate in a more energy efficient manner. Energy efficient coding algorithms then cope with flash memory that behaves unpredictably.\n\nOur software-only coding algorithms (in-place writes, multiple-place writes, RS-Berger codes) enable reliable storage at low voltages on unmodified hardware by exploiting the electrically cumulative nature of half-written data in write-once bits. For a sensor monitoring application using the MSP430, coding with in-place writes reduces the overall energy consumption by 34%. In-place writes are competitive when the time spent on computation is at least four times greater than the time spent on writes to flash memory. Our evaluation shows that tightly maintaining the digital abstraction for storage in embedded flash memory comes at a significant cost to energy consumption with minimal gain in reliability.", "citation": "Citations (18)", "departments": ["University of Massachusetts Amherst", "Texas A&M University", "University of Massachusetts Amherst", "Texas A&M University", "University of Massachusetts Amherst"], "authors": ["Mastooreh Salajegheh.....http://dblp.org/pers/hd/s/Salajegheh:Mastooreh", "Yue Wang.....http://dblp.org/pers/hd/w/Wang:Yue", "Kevin Fu.....http://dblp.org/pers/hd/f/Fu:Kevin", "Anxiao Jiang.....http://dblp.org/pers/hd/j/Jiang:Anxiao", "Erik G. Learned-Miller.....http://dblp.org/pers/hd/l/Learned=Miller:Erik_G="], "conf": "fast", "year": "2011", "pages": 14}