{"title": "Pricing-based spectrum access control in cognitive radio networks with random access.", "fields": ["budget constraint", "cognitive radio", "monopoly", "phenomenon", "stackelberg competition"], "abstract": "Market-based mechanisms offer promising approaches for spectrum access in cognitive radio networks. In this paper, we focus on two market models, one with a monopoly primary user (PU) market and the other with a multiple PU market, where each PU sells its temporarily unused spectrum to secondary users (SUs). We propose a pricing-based spectrum trading mechanism that enables SUs to contend for channel usage by random access, in a distributed manner, which naturally mitigates the complexity and time overhead associated with centralized scheduling. For the monopoly PU market model, we first consider SUs contending via slotted Aloha. The revenue maximization problems here are nonconvex. We first characterize the Pareto optimal region, and then obtain a Pareto optimal solution that maximizes the SUs' throughput subject to the SUs' budget constraints. To mitigate the spectrum underutilization due to the “price of contention,” we revisit the problem where SUs contend via CSMA, and show that spectrum utilization is enhanced, resulting in higher revenue. When the PU's unused spectrum is a control parameter, we study further the tradeoff between the PU's utility and its revenue. For the multiple PU market model, we cast the competition among PUs as a three-stage Stackelberg game, where each SU selects a PU's channel to maximize its throughput. We characterize the Nash equilibria, in terms of access prices and the spectrum offered to SUs. Our findings reveal that the number of equilibria exhibits a phase transition phenomenon, in the sense that when the number of PUs is greater than a threshold, there exist infinitely many equilibria; otherwise, there exists a unique Nash equilibrium, where the access prices and spectrum opportunities are determined by the budgets/elasticity of SUs and the utility level of PUs.", "citation": "Citations (60)", "departments": ["Arizona State University", "Bell Labs", "Arizona State University", "Princeton University", "City University of Hong Kong"], "authors": ["Lei Yang.....http://dblp.org/pers/hd/y/Yang_0001:Lei", "Hongseok Kim.....http://dblp.org/pers/hd/k/Kim:Hongseok", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung", "Chee-Wei Tan.....http://dblp.org/pers/hd/t/Tan_0001:Chee=Wei"], "conf": "infocom", "year": "2011", "pages": 9}