{"title": "Construction of directional virtual backbones with minimum routing cost in wireless networks.", "fields": ["approximation algorithm", "unit disk graph", "directed graph", "directional antenna", "shortest path problem"], "abstract": "It is well-known that the application of directional antennas can help conserve bandwidth and energy consumption in wireless networks. Thus, to achieve efficiency in wireless networks, we study a special virtual backbone (VB) using directional antennas, requiring that from one node to any other node in the network, there exists at least one directional shortest path all of whose intermediate directions should belong to the VB, named as Minimum rOuting Cost Directional VB (MOC-DVB). In addition, VB has been well studied in Unit Disk Graph (UDG). However, radio wave based communications in wireless networks may be interrupted by obstacles (e.g., buildings and mountains). Thus, in this paper, we model a network as a general directed graph. We prove that construction of a minimum MOC-DVB is an NP-hard problem in a general directed graph and in term of the size of MOC-DVB, there exists an unreachable lower bound of the polynomial-time selected MOC-DVB. Therefore, we propose a distributed approximation algorithm for constructing MOC-DVB with approximation ratio of 1 + lnK + 2lnδ D , where K is the number of antennas on each node and δ D  is the maximum direction degree in the network. Extensive simulations demonstrate that our constructed MOC-DVB is much more efficient in the sense of MOC-DVB size and routing cost compared to other VBs.", "citation": "Citations (14)", "departments": ["University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "University of Texas at Dallas", "Korea University"], "authors": ["Ling Ding.....http://dblp.org/pers/hd/d/Ding:Ling", "Weili Wu.....http://dblp.org/pers/hd/w/Wu:Weili", "James Willson.....http://dblp.org/pers/hd/w/Willson:James", "Hongjie Du.....http://dblp.org/pers/hd/d/Du:Hongjie", "Wonjun Lee.....http://dblp.org/pers/hd/l/Lee:Wonjun"], "conf": "infocom", "year": "2011", "pages": 9}