{"title": "Gyrokinetic toroidal simulations on leading multi- and manycore HPC systems.", "fields": ["instruction set", "speedup", "cuda", "graphics processing unit", "petascale computing"], "abstract": "The gyrokinetic Particle-in-Cell (PIC) method is a critical computational tool enabling petascale fusion simulation research. In this work, we present novel multi- and manycore-centric optimizations to enhance performance of GTC, a PIC-based production code for studying plasma microturbulence in tokamak devices. Our optimizations encompass all six GTC sub-routines and include multi-level particle and grid decompositions designed to improve multi-node parallel scaling, particle binning for improved load balance, GPU acceleration of key subroutines, and memory-centric optimizations to improve single-node scaling and reduce memory utilization. The new hybrid MPI-OpenMP and MPI-OpenMP-CUDA GTC versions achieve up to a 2x speedup over the production Fortran code on four parallel systems --- clusters based on the AMD Magny-Cours, Intel Nehalem-EP, IBM BlueGene/P, and NVIDIA Fermi architectures. Finally, strong scaling experiments provide insight into parallel scalability, memory utilization, and programmability trade-offs for large-scale gyrokinetic PIC simulations, while attaining a 1.6× speedup on 49,152 XE6 cores.", "citation": "Citations (31)", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Kookmin University", "Princeton Plasma Physics Laboratory"], "authors": ["Kamesh Madduri.....http://dblp.org/pers/hd/m/Madduri:Kamesh", "Khaled Z. Ibrahim.....http://dblp.org/pers/hd/i/Ibrahim:Khaled_Z=", "Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel", "Eun-Jin Im.....http://dblp.org/pers/hd/i/Im:Eun=Jin", "Stéphane Ethier.....http://dblp.org/pers/hd/e/Ethier:St=eacute=phane", "John Shalf.....http://dblp.org/pers/hd/s/Shalf:John", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid"], "conf": "sc", "year": "2011", "pages": 12}