{"title": "Cauchy Graph Embedding.", "fields": ["cauchy distribution", "test set", "image segmentation", "topological graph theory", "book embedding", "planar straight line graph", "laplacian matrix", "graph embedding", "pixel"], "abstract": "Laplacian embedding provides a low-dimensional representation for the nodes of a graph where the edge weights denote pair-wise similarity among the node objects. It is commonly assumed that the Laplacian embedding results preserve the local topology of the original data on the low-dimensional projected subspaces, i.e., for any pair of graph nodes with large similarity, they should be embedded closely in the embedded space. However, in this paper, we will show that the Laplacian embedding often cannot preserve local topology well as we expected. To enhance the local topology preserving property in graph embedding, we propose a novel Cauchy graph embedding which preserves the similarity relationships of the original data in the embedded space via a new objective. Consequentially the machine learning tasks (such as k Nearest Neighbor type classifications) can be easily conducted on the embedded data with better performance. The experimental results on both synthetic and real world benchmark data sets demonstrate the usefulness of this new type of embedding.", "citation": "Citations (28)", "year": "2011", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Key Laboratory  ...  Beijing, China"], "conf": "icml", "authors": ["Dijun Luo.....http://dblp.org/pers/hd/l/Luo:Dijun", "Chris H. Q. Ding.....http://dblp.org/pers/hd/d/Ding:Chris_H=_Q=", "Feiping Nie.....http://dblp.org/pers/hd/n/Nie:Feiping", "Heng Huang.....http://dblp.org/pers/hd/h/Huang:Heng"], "pages": 8}