{"title": "MOPED: Orchestrating interprocess message data on CMPs.", "fields": ["mpich", "message passing interface", "directory", "orchestration", "simics"], "abstract": "Future CMPs will combine many simple cores with deep cache hierarchies. With more cores, cache resources per core are fewer, and must be shared carefully to avoid poor utilization due to conflicts and pollution. Explicit motion of data in these architectures, such as message passing, can provide hints about program behavior that can be used to hide latency and improve cache behavior. However, to make these models attractive, synchronization overhead and data copying must also be offloaded from the processors. In this paper, we describe a Message Orchestration and Performance Enhancement Device (MOPED) that provides hardware mechanisms to support state-of-the-art message passing protocols such as MPI. MOPED extends the per-processor cache controllers and coherence protocol to support message synchronization and management in hardware, to transfer message data efficiently without intermediate buffer copies, and to place useful data in caches in a timely manner. MOPED thus allows full overlap between communication and computation on the cores. We extended a 16-core full-system simulator based on Simics and FeS2. MOPED interacts with the directory controllers to orchestrate message data. We evaluated benefits to performance and coherence traffic by integrating MOPED into the MPICH runtime. Relative to unmodified MPI execution, MOPED reduces execution time of real applications (NAS Parallel Benchmarks) by 17–45% and of communication microbenchmarks (Intel's IMB) by 76–94%. Off-chip memory misses are reduced by 43–88% for applications and by 75–100% for microbenchmarks.", "citation": "Citations (2)", "departments": ["Tsinghua University", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Tsinghua University"], "authors": ["Junli Gu.....http://dblp.org/pers/hd/g/Gu:Junli", "Steven S. Lumetta.....http://dblp.org/pers/hd/l/Lumetta:Steven_S=", "Rakesh Kumar.....http://dblp.org/pers/hd/k/Kumar_0002:Rakesh", "Yihe Sun.....http://dblp.org/pers/hd/s/Sun:Yihe"], "conf": "hpca", "year": "2011", "pages": 10}