{"title": "From affine to two-source extractors via approximate duality.", "fields": ["extractor", "conjecture", "duality", "combinatorics", "bipartite graph", "disperser", "affine combination", "affine transformation", "entropy rate", "affine hull", "special case"], "abstract": "Two-source and affine extractors and dispersers are fundamental objects studied in the context of derandomization. This paper shows how to construct two-source extractors and dispersers for arbitrarily small min-entropy rate in a black-box manner given affine extractors with sufficiently good parameters. Our analysis relies on the study of approximate duality, a concept related to the polynomial Freiman-Ruzsa conjecture (PFR) from additive combinatorics. Two black-box constructions of two-source extractors from affine ones are presented. Both constructions work for min-entropy rate ρ   Our results are obtained by first showing that each of our constructions yields a two-source disperser for a certain min-entropy rate ρ 0. We show that assuming the PFR conjecture, the error of this two-source extractor is exponentially small.   The extractor-to-disperser reduction arises from studying   approximate duality , a notion related to additive combinatorics. The  duality measure  of two sets A,B ⊆ F_2 n  aims to quantify how \"close\" these sets are to being dual and is defined as [u(A,B)=|E a ∈ A, b ∈ B [(-1) ∑ i=1  n  a i  b i  ]|] Notice that u(A,B)=1 implies that A is contained in an affine shift of B ⊥  --- the space dual to the F 2 span of B. We study what can be said of A,B when their duality measure is large but strictly smaller than 1 and show that A,B contain subsets A',B' of nontrivial size for which u(A',B')=1 and consequently A' is contained in an affine shift of (B') ⊥ . This implies that our constructions are two-source extractors with constant error. Surprisingly, the PFR implies that such A',B' exist exist when A,B are large, even if the duality measure is exponentially small in $n$, and this implication leads to two-source extractors with exponentially small error.", "citation": "Not cited", "year": "2011", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "conf": "stoc", "authors": ["Noga Zewi.....http://dblp.org/pers/hd/z/Zewi:Noga", "Eli Ben-Sasson.....http://dblp.org/pers/hd/b/Ben=Sasson:Eli"], "pages": 10}