{"title": "Personalized travel recommendation by mining people attributes from community-contributed photos.", "fields": ["user profile", "mobile device", "probabilistic logic", "demographics", "personalization"], "abstract": "Leveraging community-contributed data (e.g., blogs, GPS logs, and geo-tagged photos) for travel recommendation is one of the active researches since there are rich contexts and trip activities in such explosively growing data. In this work, we focus on personalized travel recommendation by leveraging the freely available community-contributed photos. We propose to conduct personalized travel recommendation by further considering specific user profiles or attributes (e.g., gender, age, race). In stead of mining photo logs only, we argue to leverage the automatically detected people attributes in the photo contents. By information-theoretic measures, we will demonstrate that such people attributes are informative and effective for travel recommendation -- especially providing a promising aspect for personalization. We effectively mine the demographics for different locations (or landmarks) and travel paths. A probabilistic Bayesian learning framework which further entails mobile recommendation on the spot is introduced. We experiment on four million photos collected for eight major worldwide cities. The experiments confirm that people attributes are promising and orthogonal to prior works using travel logs only and can further improve prior travel recommendation methods especially in difficult predictions by further leveraging user contexts in mobile devices.", "citation": "Citations (120)", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University", "Academia Sinica"], "authors": ["An-Jung Cheng.....http://dblp.org/pers/hd/c/Cheng:An=Jung", "Yan-Ying Chen.....http://dblp.org/pers/hd/c/Chen:Yan=Ying", "Yen-Ta Huang.....http://dblp.org/pers/hd/h/Huang:Yen=Ta", "Winston H. Hsu.....http://dblp.org/pers/hd/h/Hsu:Winston_H=", "Hong-Yuan Mark Liao.....http://dblp.org/pers/hd/l/Liao:Hong=Yuan_Mark"], "conf": "mm", "year": "2011", "pages": 10}