{"title": "Experiences with text mining large collections of unstructured systems development artifacts at jpl.", "fields": ["systems analysis", "risk analysis", "requirements analysis", "risk management", "information extraction"], "abstract": "Often repositories of systems engineering artifacts at NASA's Jet Propulsion Laboratory (JPL) are so large and poorly structured that they have outgrown our capability to effectively manually process their contents to extract useful information. Sophisticated text mining methods and tools seem a quick, low-effort approach to automating our limited manual efforts. Our experiences of exploring such methods mainly in three areas including historical risk analysis, defect identification based on requirements analysis, and over-time analysis of system anomalies at JPL, have shown that obtaining useful results requires substantial unanticipated efforts - from preprocessing the data to transforming the output for practical applications. We have not observed any quick 'wins' or realized benefit from short-term effort avoidance through automation in this area. Surprisingly we have realized a number of unexpected long-term benefits from the process of applying text mining to our repositories. This paper elaborates some of these benefits and our important lessons learned from the process of preparing and applying text mining to large unstructured system artifacts at JPL aiming to benefit future TM applications in similar problem domains and also in hope for being extended to broader areas of applications.", "citation": "Citations (5)", "departments": ["University of Hawaii", "California Institute of Technology", "California Institute of Technology", "Southern Methodist University"], "authors": ["Daniel Port.....http://dblp.org/pers/hd/p/Port:Daniel", "Allen P. Nikora.....http://dblp.org/pers/hd/n/Nikora:Allen_P=", "Jairus Hihn.....http://dblp.org/pers/hd/h/Hihn:Jairus", "LiGuo Huang.....http://dblp.org/pers/hd/h/Huang:LiGuo"], "conf": "icse", "year": "2011", "pages": 10}