{"title": "2ndStrike: toward manifesting hidden concurrency typestate bugs.", "fields": ["lock", "synchronization", "atomicity", "software bug", "thread"], "abstract": "Concurrency bugs are becoming increasingly prevalent in the multi-core era. Recently, much research has focused on data races and atomicity violation bugs, which are related to low-level memory accesses. However, a large number of concurrency typestate bugs such as \"invalid reads to a closed file from a different thread\" are under-studied. These concurrency typestate bugs are important yet challenging to study since they are mostly relevant to high-level program semantics.   This paper presents 2ndStrike, a method to manifest hidden concurrency typestate bugs in software testing. Given a state machine describing correct program behavior on certain object typestates, 2ndStrike profiles runtime events related to the typestates and thread synchronization. Based on the profiling results, 2ndStrike then identifies bug candidates, each of which is a pair of runtime events that would cause typestate violation if the event order is reversed. Finally, 2ndStrike re-executes the program with controlled thread interleaving to manifest bug candidates.   We have implemented a prototype of 2ndStrike on Linux and have illustrated our idea using three types of concurrency typestate bugs, including invalid file operation, invalid pointer dereference, and invalid lock operation. We have evaluated 2ndStrike with six real world bugs (including one previously unknown bug) from three open-source server and desktop programs (i.e., MySQL, Mozilla, pbzip2). Our experimental results show that 2ndStrike can effectively and efficiently manifest all six software bugs, most of which are difficult or impossible to manifest using stress testing or active testing techniques that are based on data race/atomicity violation. Additionally, 2ndStrike reports no false positives, provides detailed bug reports for each manifested bug, and can consistently reproduce the bug after manifesting it once.", "citation": "Citations (29)", "year": "2011", "departments": ["Facebook", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "conf": "asplos", "authors": ["Qi Gao.....http://dblp.org/pers/hd/g/Gao:Qi", "Wenbin Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenbin", "Zhezhe Chen.....http://dblp.org/pers/hd/c/Chen:Zhezhe", "Mai Zheng.....http://dblp.org/pers/hd/z/Zheng:Mai", "Feng Qin.....http://dblp.org/pers/hd/q/Qin:Feng"], "pages": 12}