{"title": "Optimal Cooperative Sensing Scheduling for energy-efficient Cognitive Radio Networks.", "fields": ["spectrum management", "cognitive radio", "partially observable markov decision process", "channel", "combinatorial optimization"], "abstract": "Due to the problem of spectrum scarcity and large energy consumption in wireless communications, designing energy-efficient Cognitive Radio Networks (CRNs) becomes important and necessary. In this paper, we consider the problem of optimal Cooperative Sensing Scheduling (CSS) and parameter design to achieve energy efficiency in CRNs using the framework of Partially Observable Markov Decision Process (POMDP). In particular, we consider the CSS problem for a CRN with M Secondary Users (SUs) and N primary channels to determine how many SUs should be assigned to sense each channel in order to maximize the objective function that is related to energy efficiency. By assigning more SUs to sense one channel, higher sensing accuracy can be gained; however, by spreading out the SUs to sense more channels, spectrum opportunities can be better exploited. The CSS problem is formulated as a combinatorial optimization problem. While such problem is generally hard and can only be solved by numerical methods with high computation complexity, in this paper we provide a detailed analysis and the analytical results provide useful and interesting insights. The optimality of the myopic CSS is proved for the case of two channels, and it is also conjectured for the general case. We also study the tradeoff between the sensing and transmission durations. In addition, the structure of the optimal sensing time that maximizes the energy efficiency objective is also analyzed, the condition for the optimality of the myopic sensing time is obtained, and the performance upper bound of the myopic policy is derived. Based on the numerical results, we show that by carefully tuning a punishment parameter, better energy efficiency can be achieved.", "citation": "Citations (72)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Tengyi Zhang.....http://dblp.org/pers/hd/z/Zhang:Tengyi", "Danny H. K. Tsang.....http://dblp.org/pers/hd/t/Tsang:Danny_H=_K="], "conf": "infocom", "year": "2011", "pages": 9}