{"title": "Min-max Graph Partitioning and Small Set Expansion.", "fields": ["graph partition", "quartic graph", "maximum cut", "small set", "vertex", "polynomial time approximation scheme", "butterfly graph", "factor critical graph", "minimax approximation algorithm", "simplex graph", "strength of a graph", "approximation algorithm", "binary logarithm"], "abstract": "We study graph partitioning problems from a min-max perspective, in which an input graph on n vertices should be partitioned into k parts, and the objective is to minimize the maximum number of edges leaving a single part. The two main versions we consider are: (i) the k parts need to be of equal size, and (ii) the parts must separate a set of k given terminals. We consider a common generalization of these two problems, and design for it an O(sqrt(log n log k))-approximation algorithm. This improves over an O(log^2 n) approximation for the second version due to Svitkina and Tardos, and roughly O(k log n) approximation for the first version that follows from other previous work. We also give an improved O(1)-approximation algorithm for graphs that exclude any fixed minor. Our algorithm uses a new procedure for solving the Small Set Expansion problem. In this problem, we are given a graph G and the goal is to find a non-empty subset S of V of size at most pn with minimum edge-expansion. We give an O(sqrt (log n log (1/p))) bicriteria approximation algorithm for the general case of Small Set Expansion and O(1) approximation algorithm for graphs that exclude any fixed minor.", "citation": "Citations (29)", "year": "2011", "departments": ["IBM", "Weizmann Institute of Science", "Weizmann Institute of Science", "IBM", "IBM", "Eindhoven University of Technology", "Weizmann Institute of Science", "Weizmann Institute of Science", "Microsoft", "IBM"], "conf": "focs", "authors": ["Nikhil Bansal.....http://dblp.org/pers/hd/b/Bansal:Nikhil", "Uriel Feige.....http://dblp.org/pers/hd/f/Feige:Uriel", "Robert Krauthgamer.....http://dblp.org/pers/hd/k/Krauthgamer:Robert", "Konstantin Makarychev.....http://dblp.org/pers/hd/m/Makarychev:Konstantin", "Viswanath Nagarajan.....http://dblp.org/pers/hd/n/Nagarajan:Viswanath", "Joseph Naor.....http://dblp.org/pers/hd/n/Naor:Joseph", "Roy Schwartz.....http://dblp.org/pers/hd/s/Schwartz:Roy"], "pages": 10}