{"title": "Experimental evaluation of optimal CSMA.", "fields": ["deadlock", "throughput", "network congestion", "physical layer", "message passing"], "abstract": "By ‘optimal CSMA’ we denote a promising approach to maximize throughput-based utility in wireless networks without message passing or synchronization among nodes. Despite the theoretical guarantees on the performance of these protocols, their evaluation in real networking scenarios has been preliminary. In this paper, we propose a methodical approach for the first comprehensive evaluation of optimal CSMA, via experimentation with a custom implementation. Example findings include; 1) hidden terminals with symmetric channels can drive the protocol to a state of extreme contention aggressiveness due to the low service received by flows. Since increasing aggressiveness does not mitigate collisions but actually aggravates them, optimal CSMA enters a positive-feedback loop eventually reaching a deadlock state of total flow starvation; 2) however, the use of RTS/CTS in such scenarios can reduce collisions to lower levels, restoring throughput and preventing an excessive contention aggressiveness by optimal CSMA flows; 3) in practical hidden terminal scenarios with physical layer capture optimal CSMA reduces the aggressiveness of dominant flows, but the contention window sizes used by such adaptation mechanism are not long enough to solve competing flows' starvation when carrier sensing fails; 4) topologies with a “flow-in-the-middle” yield starvation in traditional CSMA but fairness in optimal CSMA, because its contention aggressiveness adaptation creates frequent transmission opportunities for the central (otherwise starved) flow; 5) optimal CSMA excessively prioritizes links with low channel quality, due to queue-based control that does not otherwise incorporate channel conditions; 6) in its current design, optimal CSMA conflicts with window-based end-to-end congestion control, and leads to a efficiency-fairness tradeoff in TCP performance. This study deepens our understanding of optimal CSMA and the general adaptation philosophy behind its design, and the derived insights suggest enhancements to optimal CSMA theory.", "citation": "Citations (53)", "departments": ["Rice University", "KAIST", "KAIST", "KAIST", "KAIST"], "authors": ["Bruno Nardelli.....http://dblp.org/pers/hd/n/Nardelli:Bruno", "Jinsung Lee.....http://dblp.org/pers/hd/l/Lee:Jinsung", "Kangwook Lee.....http://dblp.org/pers/hd/l/Lee:Kangwook", "Yung Yi.....http://dblp.org/pers/hd/y/Yi:Yung", "Song Chong.....http://dblp.org/pers/hd/c/Chong:Song", "Edward W. Knightly.....http://dblp.org/pers/hd/k/Knightly:Edward_W=", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung"], "conf": "infocom", "year": "2011", "pages": 9}