{"title": "QoS support for end users of I/O-intensive applications using shared storage systems.", "fields": ["latency", "workload", "end user", "throughput", "server"], "abstract": "While the performance of compute-bound applications can be effectively guaranteed with techniques such as space sharing or QoS-aware process scheduling, it remains a challenge to meet QoS requirements for end users of I/O-intensive applications using shared storage systems because of the difficulty of differentiating I/O services for different applications with individual quality requirements. Furthermore, it is difficult for end users to accurately specify performance goals to the storage system using I/O-related metrics such as request latency or throughput. As access patterns, request rates, and the system workload change in time, a fixed I/O performance goal, such as bounds on throughput or latency, can be expensive to achieve and may not provide performance guarantees such as bounded program execution time.   We propose a scheme supporting end-users' QoS goals, specified in terms of program execution time, in shared storage environments. We automatically translate the users' performance goals into instantaneous I/O throughput bounds using a machine learning technique, and use dynamically determined service time windows to efficiently meet the throughput bounds. We have implemented this scheme in the PVFS2 parallel file system and have conducted an extensive evaluation. Our results show that this scheme can satisfy realistic end-user QoS requirements by making highly efficient use of the I/O resources. The scheme seeks to balance programs' attainment of QoS requirements, and saves as much of the remaining I/O capacity as possible for best-effort programs.", "citation": "Citations (51)", "departments": ["Wayne State University", "Los Alamos National Laboratory", "Wayne State University"], "authors": ["Xuechen Zhang.....http://dblp.org/pers/hd/z/Zhang:Xuechen", "Kei Davis.....http://dblp.org/pers/hd/d/Davis:Kei", "Song Jiang.....http://dblp.org/pers/hd/j/Jiang:Song"], "conf": "sc", "year": "2011", "pages": 12}