{"title": "On query result diversification.", "fields": ["approximation algorithm", "ranking", "diversification", "result set"], "abstract": "In this paper we describe a general framework for evaluation and optimization of methods for diversifying query results. In these methods, an initial ranking candidate set produced by a query is used to construct a result set, where elements are ranked with respect to relevance and diversity features, i.e., the retrieved elements should be as relevant as possible to the query, and, at the same time, the result set should be as diverse as possible. While addressing relevance is relatively simple and has been heavily studied, diversity is a harder problem to solve. One major contribution of this paper is that, using the above framework, we adapt, implement and evaluate several existing methods for diversifying query results. We also propose two new approaches, namely the Greedy with Marginal Contribution (GMC) and the Greedy Randomized with Neighborhood Expansion (GNE) methods. Another major contribution of this paper is that we present the first thorough experimental evaluation of the various diversification techniques implemented in a common framework. We examine the methods' performance with respect to precision, running time and quality of the result. Our experimental results show that while the proposed methods have higher running times, they achieve precision very close to the optimal, while also providing the best result quality. While GMC is deterministic, the randomized approach (GNE) can achieve better result quality if the user is willing to tradeoff running time.", "citation": "Citations (128)", "departments": ["University of California, Riverside", "AT&T Labs", "AT&T Labs", "Federal Univers ... dré, SP, Brazil", "Federal Univers ... dré, SP, Brazil"], "authors": ["Marcos R. Vieira.....http://dblp.org/pers/hd/v/Vieira:Marcos_R=", "Humberto Luiz Razente.....http://dblp.org/pers/hd/r/Razente:Humberto_Luiz", "Maria Camila Nardini Barioni.....http://dblp.org/pers/hd/b/Barioni:Maria_Camila_Nardini", "Marios Hadjieleftheriou.....http://dblp.org/pers/hd/h/Hadjieleftheriou:Marios", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh", "Caetano Traina Jr......http://dblp.org/pers/hd/t/Traina_Jr=:Caetano", "Vassilis J. Tsotras.....http://dblp.org/pers/hd/t/Tsotras:Vassilis_J="], "conf": "icde", "year": "2011", "pages": 12}