{"title": "Differential Slicing: Identifying Causal Execution Differences for Security Applications.", "fields": ["slicing", "vulnerability assessment", "malware", "program slicing", "graph"], "abstract": "A security analyst often needs to understand two runs of the same program that exhibit a difference in program state or output. This is important, for example, for vulnerability analysis, as well as for analyzing a malware program that features different behaviors when run in different environments. In this paper we propose a differential slicing approach that automates the analysis of such execution differences. Differential slicing outputs a causal difference graph that captures the input differences that triggered the observed difference and the causal path of differences that led from those input differences to the observed difference. The analyst uses the graph to quickly understand the observed difference. We implement differential slicing and evaluate it on the analysis of 11 real-world vulnerabilities and 2 malware samples with environment-dependent behaviors. We also evaluate it in an informal user study with two vulnerability analysts. Our results show that differential slicing successfully identifies the input differences that caused the observed difference and that the causal difference graph significantly reduces the amount of time and effort required for an analyst to understand the observed difference.", "citation": "Citations (67)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Carnegie Mellon University"], "authors": ["Noah M. Johnson.....http://dblp.org/pers/hd/j/Johnson:Noah_M=", "Juan Caballero.....http://dblp.org/pers/hd/c/Caballero:Juan", "Kevin Zhijie Chen.....http://dblp.org/pers/hd/c/Chen:Kevin_Zhijie", "Stephen McCamant.....http://dblp.org/pers/hd/m/McCamant:Stephen", "Pongsin Poosankam.....http://dblp.org/pers/hd/p/Poosankam:Pongsin", "Daniel Reynaud.....http://dblp.org/pers/hd/r/Reynaud:Daniel", "Dawn Song.....http://dblp.org/pers/hd/s/Song:Dawn"], "conf": "sp", "year": "2011", "pages": 16}