{"title": "People searching for people: analysis of a people search engine log.", "fields": ["classification scheme", "vertical search", "web search query", "search analytics", "sargable", "copying", "search engine", "web query classification", "pointer", "database search engine"], "abstract": "Recent years show an increasing interest in vertical search: searching within a particular type of information. Understanding what people search for in these \"verticals\" gives direction to research and provides pointers for the search engines themselves. In this paper we analyze the search logs of one particular vertical: people search engines. Based on an extensive analysis of the logs of a search engine geared towards finding people, we propose a classification scheme for people search at three levels: (a) queries, (b) sessions, and (c) users. For queries, we identify three types, (i) event-based high-profile queries (people that become \"popular\" because of an event happening), (ii) regular high-profile queries (celebrities), and (iii) low-profile queries (other, less-known people). We present experiments on automatic classification of queries. On the session level, we observe five types: (i) family sessions (users looking for relatives), (ii) event sessions (querying the main players of an event), (iii) spotting sessions (trying to \"spot\" different celebrities online), (iv) polymerous sessions (sessions without a clear relation between queries), and (v) repetitive sessions (query refinement and copying). Finally, for users we identify four types: (i) monitors, (ii) spotters, (iii) followers, and (iv) polymers.   Our findings not only offer insight into search behavior in people search engines, but they are also useful to identify future research directions and to provide pointers for search engine improvements.", "citation": "Not cited", "departments": ["University of Amsterdam", "University of Amsterdam", "University of Amsterdam", "University of Amsterdam", "Norwegian University of Science and Technology"], "authors": ["Wouter Weerkamp.....http://dblp.org/pers/hd/w/Weerkamp:Wouter", "Richard Berendsen.....http://dblp.org/pers/hd/b/Berendsen:Richard", "Bogomil Kovachev.....http://dblp.org/pers/hd/k/Kovachev:Bogomil", "Edgar Meij.....http://dblp.org/pers/hd/m/Meij:Edgar", "Krisztian Balog.....http://dblp.org/pers/hd/b/Balog:Krisztian", "Maarten de Rijke.....http://dblp.org/pers/hd/r/Rijke:Maarten_de"], "conf": "sigir", "year": "2011", "pages": 10}