{"title": "Location privacy protection from RSS localization system using antenna pattern synthesis.", "fields": ["positioning system", "mobile station", "path loss", "location based service", "smart antenna"], "abstract": "This paper studies the problem of location privacy protection in wireless LAN (WLAN) environment, where received signal strength (RSS) at access points (AP) can potentially be obtained by adversaries to obtain the location of a legitimate mobile station. We propose a two-step location privacy protection scheme using a linear smart antenna array on the mobile station. In the first step, the mobile station observes the arrangement of surrounding APs by moving around and estimating the path losses from itself to the APs. Based on the path loss information, in the second step, the mobile station optimizes the radiation pattern of its smart antenna so that its location privacy is protected while its communication quality is not affected. Two strategies are used in the radiation pattern optimization. The first strategy is to limit the number of APs in range of the mobile station to a safe level so that there are not enough measurements from the APs to make an estimation of the mobile station's location. If the first strategy is not possible, the mobile station falls to the second strategy, where its radiation pattern introduces maximum bias to any location estimation attempt so that the mobile station's true location is not revealed. Simulation results show that compared with traditional transmit power control (TPC) scheme, the first strategy significantly increases the probability of inadequate measurements for location computation. Simulation also demonstrates that the second strategy can significantly degenerate the precision of the positioning system. In many cases, the degenerated location precision is as low as the coverage range of the AP that the mobile station is associated with for communications. This essentially means that the second strategy can invalidate the use of RSS measurement for precise localization.", "citation": "Citations (12)", "departments": ["Virginia Tech", "Virginia Tech"], "authors": ["Ting Wang.....http://dblp.org/pers/hd/w/Wang:Ting", "Yaling Yang.....http://dblp.org/pers/hd/y/Yang:Yaling"], "conf": "infocom", "year": "2011", "pages": 9}