{"title": "Supporting air traffic control collaboration with a TableTop system.", "fields": ["multi touch", "usable", "air traffic control", "computer supported cooperative work", "multi user"], "abstract": "Collaboration is key to safety and efficiency in Air Traffic Control. Legacy paper-based systems enable seamless and non-verbal collaboration, but trends in new software and hardware for ATC tend to separate controllers more and more, which hinders collaboration. This paper presents a new interactive system designed to support collaboration in ATC. We ran a series of interviews and workshops to identify collaborative situations in ATC. From this analysis, we derived a set of requirements to support collaboration: support mutual awareness, communication and coordination, dynamic task allocation and simultaneous use with more than two people. We designed a set of new interactive tools to fulfill the requirements, by using a multi-user tabletop surface, appropriate feedthrough, and reified and partially-accomplishable actions. Preliminary evaluation shows that feedthrough is important, users benefit from a number of tools to communicate and coordinate their actions, and the tabletop is actually usable by three people both in tightly coupled tasks and parallel, individual activities. At a higher level, we also found that co-location is not enough to generate mutual awareness if users are not engaged in meaningful collaboration.", "citation": "Citations (23)", "departments": ["University of Toulouse", "University of Toulouse", "University of Toulouse", "IntuiLab, Toulouse, France", "IntuiLab, Toulouse, France"], "authors": ["Stéphane Conversy.....http://dblp.org/pers/hd/c/Conversy:St=eacute=phane", "Hélène Gaspard-Boulinc.....http://dblp.org/pers/hd/g/Gaspard=Boulinc:H=eacute=l=egrave=ne", "Stéphane Chatty.....http://dblp.org/pers/hd/c/Chatty:St=eacute=phane", "Stéphane Valès.....http://dblp.org/pers/hd/v/Val=egrave=s:St=eacute=phane", "Carole Dupré.....http://dblp.org/pers/hd/d/Dupr=eacute=:Carole", "Claire Ollagnon.....http://dblp.org/pers/hd/o/Ollagnon:Claire"], "conf": "cscw", "year": "2011", "pages": 10}