{"title": "Server-side I/O coordination for parallel file systems.", "fields": ["ssh file transfer protocol", "device file", "self certifying file system", "file control block", "file system fragmentation"], "abstract": "Parallel file systems have become a common component of modern high-end computers to mask the ever-increasing gap between disk data access speed and CPU computing power. However, while working well for certain applications, current parallel file systems lack the ability to effectively handle concurrent I/O requests with data synchronization needs, whereas concurrent I/O is the norm in data-intensive applications. Recognizing that an I/O request will not complete until all involved file servers in the parallel file system have completed their parts, in this paper we propose a server-side I/O coordination scheme for parallel file systems. The basic idea is to coordinate file servers to serve one application at a time in order to reduce the completion time, and in the meantime maintain the server utilization and fairness. A window-wide coordination concept is introduced to serve our purpose. We present the proposed I/O coordination algorithm and its corresponding analysis of average completion time in this study. We also implement a prototype of the proposed scheme under the PVFS2 file system and MPI-IO environment. Experimental results demonstrate that the proposed scheme can reduce average completion time by 8% to 46%, and provide higher I/O bandwidth than that of default data access strategies adopted by PVFS2 for heavy I/O workloads. Experimental results also show that the server-side I/O coordination scheme has good scalability.", "citation": "Citations (57)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology", "Argonne National Laboratory", "Argonne National Laboratory"], "authors": ["Huaiming Song.....http://dblp.org/pers/hd/s/Song:Huaiming", "Yanlong Yin.....http://dblp.org/pers/hd/y/Yin:Yanlong", "Xian-He Sun.....http://dblp.org/pers/hd/s/Sun:Xian=He", "Rajeev Thakur.....http://dblp.org/pers/hd/t/Thakur:Rajeev", "Samuel Lang.....http://dblp.org/pers/hd/l/Lang:Samuel"], "conf": "sc", "year": "2011", "pages": 11}