{"title": "Large scale debugging of parallel tasks with AutomaDeD.", "fields": ["fault injection", "debugging", "pointer", "lookup table", "software fault tolerance"], "abstract": "Developing correct HPC applications continues to be a challenge as the number of cores increases in today's largest systems. Most existing debugging techniques perform poorly at large scales and do not automatically locate the parts of the parallel application in which the error occurs. The overhead of collecting large amounts of runtime information and an absence of scalable error detection algorithms generally cause poor scalability. In this work, we present novel, highly efficient techniques that facilitate the process of debugging large scale parallel applications. Our approach extends our previous work, AutomaDeD, in three major areas to isolate anomalous tasks in a scalable manner: (i) we efficiently compare elements of graph models (used in AutomaDeD to model parallel tasks) using pre-computed lookup-tables and by pointer comparison; (ii) we compress per-task graph models before the error detection analysis so that comparison between models involves many fewer elements; (iii) we use scalable sampling-based clustering and nearest-neighbor techniques to isolate abnormal tasks when bugs and performance anomalies are manifested. Our evaluation with fault injections shows that AutomaDeD scales well to thousands of tasks and that it can find anomalous tasks in under 5 seconds in an online manner.", "citation": "Citations (21)", "departments": ["Purdue University", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Purdue University", "Lawrence Livermore National Laboratory"], "authors": ["Ignacio Laguna.....http://dblp.org/pers/hd/l/Laguna:Ignacio", "Todd Gamblin.....http://dblp.org/pers/hd/g/Gamblin:Todd", "Bronis R. de Supinski.....http://dblp.org/pers/hd/s/Supinski:Bronis_R=_de", "Saurabh Bagchi.....http://dblp.org/pers/hd/b/Bagchi:Saurabh", "Greg Bronevetsky.....http://dblp.org/pers/hd/b/Bronevetsky:Greg", "Dong H. Ahn.....http://dblp.org/pers/hd/a/Ahn:Dong_H=", "Martin Schulz.....http://dblp.org/pers/hd/s/Schulz_0001:Martin", "Barry Rountree.....http://dblp.org/pers/hd/r/Rountree:Barry"], "conf": "sc", "year": "2011", "pages": 10}