{"title": "ETP: Encounter Transfer Protocol for opportunistic vehicle communication.", "fields": ["network packet", "network congestion", "ieee 802 11p", "fading", "dedicated short range communications"], "abstract": "This paper studies the problem of bulk data transfer between a pair of moving vehicles as they encounter, using IEEE 802.11p (Dedicated Short Range Communication, or DSRC) radios. Comparing to the well-studied problem of “Drive-Through Internet”, enabling an efficient, reliable and fair data transfer between two fast-moving vehicles could be even more challenging because the effective link duration is halved, vehicle-to-vehicle channel is unpredictable and DSRC is a new technology. We design an Encounter Transfer Protocol (ETP) which is suitable for this vehicle encounter case. We introduce two new components which are able to improve the data transfer performance in such a challenging environment: (1) we advocate an enhanced window adjustment policy called BIBD(Bimodal Increase, Bimodal Decrease) which is able to quickly adapt to fast-changing channel conditions and stabilize afterwards. We experimentally demonstrate the BIBD policy outperforms other policies, including commonly used AIMD policy. (2) We also suggest a variety of enhancement techniques that not only fully utilize the precious link duration as vehicles encounter but also aggressively compensate packet drops caused by fading channel. Using a small fleet of DSRC-equipped vehicles, we experimentally demonstrate that ETP is able to at least double the throughput of TCP as both vehicles are moving, and improve performance by about 20–50% as only one vehicle is moving. Our experiments also show that ETP fairly allocates bandwidth resource under stressful network congestion scenarios.", "citation": "Citations (20)", "departments": ["General Motors", "General Motors"], "authors": ["Bo Yu.....http://dblp.org/pers/hd/y/Yu_0007:Bo", "Fan Bai.....http://dblp.org/pers/hd/b/Bai:Fan"], "conf": "infocom", "year": "2011", "pages": 9}