{"title": "On file-based content distribution over wireless networks via multiple paths: Coding and delay trade-off.", "fields": ["trade off", "transmission delay", "computer network", "coding", "file system fragmentation", "device file", "self certifying file system", "distributed computing", "wireless network", "code rate"], "abstract": "With the emergence of the adaptive bit rate (ABR) streaming technology, the video/content streaming technology is shifting toward a file-based content distribution. That is, video content is encoded into a set of smaller media files containing video of 2–10 seconds before transmission. This file-based content distribution, coupled with increasingly rapid adoption of smartphones, requires an efficient file-based distribution algorithm to satisfy the QoS demand in wireless networks. In this paper, we study the transmission of a finite-sized file over wireless networks using multipath routing, with the objective to minimize file transmission delay instead of average packet delay. The file transmission delay is defined as the time interval from the instant that a file is first transmitted to the time at which the file can be reconstructed in the destination node. We observe that file transmission delay depends not only on the mean of the packet delay but also on its distribution, especially the tail. This observation leads to a better understanding of the file transfer delay in wireless networks and a minimum delay file transmission strategy. In a wireless multipath communication scenario, we propose to use packet level erasure code (e.g., digital fountain code) to transmit data file with redundancy. Given that a file with k packets is encoded into n packets for transmission, the use of digital fountain code allows the file to be received when only k out of n packets are received. By adding redundant packets, the destination node does not have to wait for the packet to arrive late, hence reducing the delay of the file transmission. We characterize the tradeoff between the code rate (i.e., the ratio of the number of transmitted packets to the number of the original packets) and the file delay reduction. As a rule of thumb, we provide practical guidelines in determining an appropriate code rate for a fixed file to achieve a reasonable transmission delay. We show that only a few redundant packets are needed to achieve a significant reduction in file transmission delay.", "citation": "Not cited", "departments": ["Massachusetts Institute of Technology", "Nanyang Technological University", "Massachusetts Institute of Technology"], "authors": ["Jun Sun.....http://dblp.org/pers/hd/s/Sun_0007:Jun", "Yonggang Wen.....http://dblp.org/pers/hd/w/Wen:Yonggang", "Lizhong Zheng.....http://dblp.org/pers/hd/z/Zheng:Lizhong"], "conf": "infocom", "year": "2011", "pages": 5}