{"title": "Packet scheduling in a low-latency optical switch with wavelength division multiplexing and electronic buffer.", "fields": ["job shop scheduling", "network packet", "round robin scheduling", "optical switch", "approximation algorithm"], "abstract": "Optical switches are widely considered as the most promising candidate to provide ultra-high speed interconnections. Due to the difficulty in implementing all-optical buffer, optical switches with electronic buffers have been proposed recently [1] [4] [5]. Among these switches, the Optical Cut-Through (OpCut) switch has the capability to achieve low latency and minimize optical-electronic-optical (O/E/O) conversions. In this paper, we consider packet scheduling in this switch with wavelength division multiplexing (WDM). Our goal is to maximize throughput and maintain packet order at the same time. While we prove that such an optimal scheduling problem is NP-hard and inapproximable in polynomial time within any constant factor by reducing it to the set packing problem, we present an approximation algorithm that maintains packet order and approximates the optimal scheduling within a factor of √2Nk with regard to the number of packets transmitted, where N is the switch size and k is the number of wavelengths multiplexed on each fiber. This result is in line with the best known approximation algorithm for set packing. Based on the approximation algorithm, we also give practical schedulers that can be implemented in fast optical switches. Simulation results show that the schedulers achieve close performance to the ideal WDM output-queued switch in terms of packet delay under various traffic models.", "citation": "Citations (7)", "departments": ["Stony Brook University", "Florida State University", "Stony Brook University"], "authors": ["Lin Liu.....http://dblp.org/pers/hd/l/Liu_0004:Lin", "Zhenghao Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenghao", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2011", "pages": 9}