{"title": "Reliving on demand: a total viewer experience.", "fields": ["multimedia", "internet privacy", "flow", "semantics", "sss"], "abstract": "Billions of people worldwide use images and videos to capture various events in their lives. The primary purpose of the proposed media sharing application is digital re-living of those events by the photographers and their families and friends. The most popular tools for achieving this today are still static slide-shows (SSS) which primarily focus on visual effects rather than understanding the semantics of the media assets being used, or allowing different viewers (e.g. friends, family, who have different relationships, interests, time availabilities, and familiarities) any control over the flow of the show. We present a novel system that generates an aesthetically appealing and semantically drivable audio-visual media show based on several reliving dimensions of events, people, locations, and time. We allow each viewer to interact with the default presentation to 'on-the-fly' redirect the flow of reliving as desired from their individual perspectives. Moreover, each reliving session is logged and can be shared with other people over a wide array of platforms and devices, allowing sharing experience to go beyond the sharing of the media assets themselves. From a detailed analysis of the logged sessions across different user categories, we have obtained many interesting findings on the reliving needs, behaviors and patterns, which in turn validate our design motivations and principles.", "citation": "Citations (6)", "departments": ["University of California, Irvine", "Eastman Kodak Company", "Eastman Kodak Company", "Eastman Kodak Company", "Eastman Kodak Company"], "authors": ["Vivek K. Singh.....http://dblp.org/pers/hd/s/Singh:Vivek_K=", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo", "Dhiraj Joshi.....http://dblp.org/pers/hd/j/Joshi:Dhiraj", "Phoury Lei.....http://dblp.org/pers/hd/l/Lei:Phoury", "Madirakshi Das.....http://dblp.org/pers/hd/d/Das:Madirakshi", "Peter O. Stubler.....http://dblp.org/pers/hd/s/Stubler:Peter_O="], "conf": "mm", "year": "2011", "pages": 10}