{"title": "Modeling 3D articulated motions with conformal geometry videos (CGVs).", "fields": ["embedding", "conformal geometry", "mean curvature", "parameterized complexity", "video processing"], "abstract": "3D articulated motions are widely used in entertainment, sports, military, and medical applications. Among various techniques for modeling 3D motions, geometry videos (GVs) are a compact representation in that each frame is parameterized to a 2D domain, which captures the 3D geometry (x, y, z) to a pixel (r, g, b) in the image domain. As a result, the widely studied image/video processing techniques can be directly borrowed for 3D motion. This paper presents conformal geometry videos (CGVs), a novel extension of the traditional geometry videos by taking into the consideration of the isometric nature of 3D articulated motions. We prove that the 3D articulated motion can be uniquely (up to rigid motion) represented by (»,H), where » is the conformal factor characterizing the intrinsic property of the 3D motion, and H the mean curvature characterizing the extrinsic feature (i.e., embedding or appearance). Furthermore, the conformal factor » is pose-invariant. Thus, in sharp contrast to the GVs which capture 3D motion by three channels, CGVs take only one channel of mean curvature H and the first frame of the conformal factor », i.e., approximately 1/3 the storage of the GVs. In addition, CGVs have strong spatial and temporal coherence, which favors various well studied video compression techniques. Thus, CGVs can be highly compressed by using the state-of the-art video compression techniques, such as H.264/AVC. Our experimental results on real-world 3D motions show that CGVs are a highly compact representation for 3D articulated motions, i.e., given CGVs and GVs of the same file size, CGVs show much better visual quality than GVs.", "citation": "Citations (6)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "School of Compu ... pore, Singapore"], "authors": ["Dao Thi Phuong Quynh.....http://dblp.org/pers/hd/q/Quynh:Dao_Thi_Phuong", "Ying He.....http://dblp.org/pers/hd/h/He_0001:Ying", "Xiaoming Chen.....http://dblp.org/pers/hd/c/Chen:Xiaoming", "Jiazhi Xia.....http://dblp.org/pers/hd/x/Xia:Jiazhi", "Qian Sun.....http://dblp.org/pers/hd/s/Sun:Qian", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H="], "conf": "mm", "year": "2011", "pages": 10}