{"title": "Toward Online Testing of Federated and Heterogeneous Distributed Systems.", "fields": ["implementation", "operator", "mistake", "dice", "border gateway protocol"], "abstract": "Making distributed systems reliable is notoriously difficult. It is even more difficult to achieve high reliability for federated and heterogeneous systems, i.e., those that are operated by multiple administrative entities and have numerous inter-operable implementations. A prime example of such a system is the Internet's inter-domain routing, today based on BGP.\n\nWe argue that system reliability should be improved by proactively identifying potential faults using an online testing functionality. We propose DiCE, an approach that continuously and automatically explores the system behavior, to check whether the system deviates from its desired behavior. DiCE orchestrates the exploration of relevant system behaviors by subjecting system nodes to many possible inputs that exercise node actions. DiCE starts exploring from current, live system state, and operates in isolation from the deployed system. We describe our experience in integrating DiCE with an opensource BGP router. We evaluate the prototype's ability to quickly detect origin misconfiguration, a recurring operator mistake that causes Internet-wide outages. We also quantify DiCE's overhead and find it to have marginal impact on system performance.", "citation": "Citations (9)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Marco Canini.....http://dblp.org/pers/hd/c/Canini:Marco", "Vojin Jovanovic.....http://dblp.org/pers/hd/j/Jovanovic:Vojin", "Daniele Venzano.....http://dblp.org/pers/hd/v/Venzano:Daniele", "Boris Spasojevic.....http://dblp.org/pers/hd/s/Spasojevic:Boris", "Olivier Crameri.....http://dblp.org/pers/hd/c/Crameri:Olivier", "Dejan Kostic.....http://dblp.org/pers/hd/k/Kostic:Dejan"], "conf": "usenix", "year": "2011", "pages": -1}