{"title": "Practical and secure PCM systems by online detection of malicious write streams.", "fields": ["wear leveling", "byte", "phase change memory", "streams", "memory management"], "abstract": "Phase Change Memory (PCM) may become a viable alternative for the design of main memory systems in the next few years. However PCM suffers from limited write endurance. Therefore future adoption of PCM as a technology for main memory will depend on the availability of practical solutions for wear leveling that avoids uneven usage especially in the presence of potentially malicious users. First generation wear leveling algorithms were designed for typical workloads and have significantly reduced lifetime under malicious access patterns that try to write to the same line continuously. Secure wear leveling algorithms were recently proposed. They can handle such malicious attacks, but require that wear leveling is done at a rate that is orders of magnitude higher than what is sufficient for typical applications, thereby incurring significantly high write overhead, potentially impairing overall performance system. This paper proposes a practical wear-leveling framework that can provide years of lifetime under attacks while still incurring negligible (<1%) write overhead for typical applications. It uses a simple and novel Online Attack Detector circuit to adapt the rate of wear leveling depending on the properties of the memory reference stream, thereby obtaining the best of both worlds — low overhead for typical applications and years of lifetime under attacks. The proposed attack detector requires a storage overhead of 68 bytes, is effective at estimating the severity of attacks, is applicable to a wide variety of wear leveling algorithms, and reduces the write overhead of several recently proposed wear leveling algorithms by 16x–128x. The paradigm of online attack detection enables other preventive actions as well.", "citation": "Citations (78)", "departments": ["IBM", "French Institute for Research in Computer Science and Automation", "IBM", "IBM"], "authors": ["Moinuddin K. Qureshi.....http://dblp.org/pers/hd/q/Qureshi:Moinuddin_K=", "André Seznec.....http://dblp.org/pers/hd/s/Seznec:Andr=eacute=", "Luis Lastras.....http://dblp.org/pers/hd/l/Lastras:Luis", "Michele Franceschini.....http://dblp.org/pers/hd/f/Franceschini:Michele"], "conf": "hpca", "year": "2011", "pages": 12}