{"title": "Peer-assisted texture streaming in metaverses.", "fields": ["peer to peer", "user experience design", "end user", "dissemination", "latency"], "abstract": "User-extensible metaverses need an effective way to disseminate massive and dynamic 3D contents (i.e., meshes, textures, animations, etc.) to end users, and at the same time maintain a low consumption of server bandwidth. Peer-to-peer (or peer-assisted) technologies have been widely considered as a desirable complementary solution to efficaciously offload servers in large-scale media streaming applications. However, due to both the bandwidth constraints of heterogeneous users and unpredictable access patterns of latency-sensitive 3D contents, it is very challenging to cut the server bandwidth cost in metaverses. In this paper, we propose a peer-assisted texture streaming architecture to minimize the server bandwidth consumption without degrading the end-user satisfaction. We propose a game-theoretic peer selection strategy which achieves a good trade-off between performance and complexity. Our algorithm is light-weight, and can efficiently utilize the bandwidth of users in a fully decentralized manner by enabling each peer (i.e., user) to quickly select its content providers who can satisfy the requests of the peer within the latency constraint of the content. We evaluate our algorithm through an extensive comparison study based on simulations using realistic data (i.e., avatar mobility traces and textures) collected from Second Life. The simulation results show that the proposed algorithm can effectively reduce the server bandwidth consumption without degrading the user experience.", "citation": "Citations (4)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Ke Liang.....http://dblp.org/pers/hd/l/Liang:Ke", "Roger Zimmermann.....http://dblp.org/pers/hd/z/Zimmermann:Roger", "Wei Tsang Ooi.....http://dblp.org/pers/hd/o/Ooi:Wei_Tsang"], "conf": "mm", "year": "2011", "pages": 10}