{"title": "Learning heterogeneous data for hierarchical web video classification.", "fields": ["web community", "semantic web stack", "data web", "semantic integration", "social semantic web"], "abstract": "Web videos such as YouTube are hard to obtain sufficient precisely labeled training data and analyze due to the complex ontology. To deal with these problems, we present a hierarchical web video classification framework by learning heterogeneous web data, and construct a bottom-up semantic forest of video concepts by learning from meta-data. The main contributions are two-folds: firstly, analysis about middle-level concepts' distribution is taken based on data collected from web communities, and a concepts redistribution assumption is made to build effective transfer learning algorithm. Furthermore, an AdaBoost-Like transfer learning algorithm is proposed to transfer the knowledge learned from Flickr images to YouTube video domain and thus it facilitates video classification. Secondly, a group of hierarchical taxonomies named Semantic Forest are mined from YouTube and Flickr tags which reflect better user intention on the semantic level. A bottom-up semantic integration is also constructed with the help of semantic forest, in order to analyze video content hierarchically in a novel perspective. A group of experiments are performed on the dataset collected from Flickr and YouTube. Compared with state-of-the-arts, the proposed framework is more robust and tolerant to web noise.", "citation": "Citations (6)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology"], "authors": ["Xianming Liu.....http://dblp.org/pers/hd/l/Liu:Xianming", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Pengfei Xu.....http://dblp.org/pers/hd/x/Xu:Pengfei", "Xiaoshuai Sun.....http://dblp.org/pers/hd/s/Sun:Xiaoshuai", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi"], "conf": "mm", "year": "2011", "pages": 10}