{"title": "Efficient data race detection for distributed memory parallel programs.", "fields": ["shared memory", "distributed memory", "software bug", "thread", "instruction set"], "abstract": "In this paper we present a precise data race detection technique for distributed memory parallel programs. Our technique, which we call Active Testing, builds on our previous work on race detection for shared memory Java and C programs and it handles programs written using shared memory approaches as well as bulk communication. Active testing works in two phases: in the first phase, it performs an imprecise dynamic analysis of an execution of the program and finds potential data races that could happen if the program is executed with a different thread schedule. In the second phase, active testing re-executes the program by actively controlling the thread schedule so that the data races reported in the first phase can be confirmed. A key highlight of our technique is that it can scalably handle distributed programs with bulk communication and single- and split-phase barriers. Another key feature of our technique is that it is precise — a data race confirmed by active testing is an actual data race present in the program; however, being a testing approach, our technique can miss actual data races. We implement the framework for the UPC programming language and demonstrate scalability up to a thousand cores for programs with both fine-grained and bulk (MPI style) communication. The tool confirms previously known bugs and uncovers several unknown ones. Our extensions capture constructs proposed in several modern programming languages for High Performance Computing, most notably non-blocking barriers and collectives.", "citation": "Citations (29)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory"], "authors": ["Chang-Seo Park.....http://dblp.org/pers/hd/p/Park:Chang=Seo", "Koushik Sen.....http://dblp.org/pers/hd/s/Sen:Koushik", "Paul Hargrove.....http://dblp.org/pers/hd/h/Hargrove:Paul", "Costin Iancu.....http://dblp.org/pers/hd/i/Iancu:Costin"], "conf": "sc", "year": "2011", "pages": 12}