{"title": "Boosting the performance of flow-sensitive points-to analysis using value flow.", "fields": ["source lines of code", "escape analysis", "static analysis", "shape analysis", "pointer analysis"], "abstract": "Points-to analysis is a fundamental static analysis technique which computes the set of memory objects that a pointer may point to. Many different applications, such as security-related program analyses, bug checking, and analyses of multi-threaded programs, require precise points-to information to be effective. Recent work has focused on improving the precision of points-to analysis through flow-sensitivity and great progress has been made. However, even with all recent progress, flow-sensitive points-to analysis can still be much slower than a flow-insensitive analysis.   In this paper, we propose a novel method that simplifies flow-sensitive points-to analysis to a general graph reachability problem in a value flow graph. The value flow graph summarizes dependencies between pointer variables, including those memory dependencies via pointer dereferences. The points-to set for each pointer variable can then be computed as the set of memory objects that can reach it in the graph. We develop an algorithm to build the value flow graph efficiently by examining the pointed-to-by set of a memory object, i.e., the set of pointers that point to an object. The pointed-to-by information of memory objects is very useful for applications such as escape analysis, and information flow analysis.   Our approach is intuitive, easy to implement and very efficient. The implementation is around 2000 lines of code and it is more efficient than existing flow-sensitive points-to analyses. The runtime is comparable with the state-of-the-art flow-insensitive points-to analysis.", "citation": "Citations (60)", "departments": ["Oracle Corporation", "Oracle Corporation", "Oracle Corporation"], "authors": ["Lian Li.....http://dblp.org/pers/hd/l/Li:Lian", "Cristina Cifuentes.....http://dblp.org/pers/hd/c/Cifuentes:Cristina", "Nathan Keynes.....http://dblp.org/pers/hd/k/Keynes:Nathan"], "conf": "sigsoft", "year": "2011", "pages": 11}