{"title": "Performance analysis of spectrum handoff for cognitive radio ad hoc networks without common control channel under homogeneous primary traffic.", "fields": ["spectrum management", "cognitive radio", "handover", "control channel", "markov model"], "abstract": "Cognitive radio (CR) technology is regarded as a promising solution to the spectrum scarcity problem. Due to the spectrum varying nature of CR networks, unlicensed users are required to perform spectrum handoffs when licensed users reuse the spectrum. In this paper, we study the performance of the spectrum handoff process in a CR ad hoc network under homogeneous primary traffic. We propose a novel three dimensional discrete-time Markov chain to characterize the process of spectrum handoffs and analyze the performance of unlicensed users. Since in real CR networks, a dedicated common control channel is not practical, in our model, we implement a network coordination scheme where no dedicated common control channel is needed. Moreover, in wireless communications, collisions among simultaneous transmissions cannot be immediately detected and the whole collided packets need to be retransmitted, which greatly affects the network performance. With this observation, we also consider the retransmissions of the collided packets in our proposed discrete-time Markov chain. In addition, besides the random channel selection scheme, we study the impact of different channel selection schemes on the performance of the spectrum handoff process. Furthermore, we also consider the spectrum sensing delay in our proposed Markov model and investigate its effect on the network performance. We validate the numerical results obtained from our proposed Markov model against simulation and investigate other parameters of interest in the spectrum handoff scenario. Our proposed analytical model can be applied to various practical network scenarios. It also provides new insights on the process of spectrum handoffs. Currently, no existing analysis has considered the comprehensive aspects of spectrum handoff as what we consider in this paper.", "citation": "Citations (69)", "departments": ["University of North Carolina at Charlotte", "University of North Carolina at Charlotte"], "authors": ["Yi Song.....http://dblp.org/pers/hd/s/Song:Yi", "Jiang Xie.....http://dblp.org/pers/hd/x/Xie:Jiang"], "conf": "infocom", "year": "2011", "pages": 9}