{"title": "On Energy-Efficient Trap Coverage in Wireless Sensor Networks.", "fields": ["sensor node", "minimum weight", "software deployment", "key distribution in wireless sensor networks", "bounded function"], "abstract": "In wireless sensor networks (WSNs), trap coverage has recently been proposed to trade off between the availability of sensor nodes and sensing performance. It offers an efficient framework to tackle the challenge of limited resources in large-scale sensor networks. Currently, existing works only studied the theoretical foundation of how to decide the deployment density of sensors to ensure the desired degree of trap coverage. However, practical issues, such as how to efficiently schedule sensor node to guarantee trap coverage under an arbitrary deployment, are still left untouched. In this article, we formally formulate the  Minimum Weight Trap Cover Problem  and prove it is an NP-hard problem. To solve the problem, we introduce a bounded approximation algorithm, called  Trap Cover Optimization  (TCO) to schedule the activation of sensors while satisfying specified trap coverage requirement. We design  Localized Trap Coverage Protocol  as the localized implementation of TCO. The performance of Minimum Weight Trap Coverage we find is proved to be at most  O (ρ) times of the optimal solution, where ρ is the density of sensor nodes in the region. To evaluate our design, we perform extensive simulations to demonstrate the effectiveness of our proposed algorithm and show that our algorithm achieves at least 14p better energy efficiency than the state-of-the-art solution.", "citation": "Citations (17)", "year": "2011", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "University of Minnesota", "Singapore University of Technology and Design", "Zhejiang University", "Zhejiang University", "Zhejiang University", "University of Minnesota", "Singapore University of Technology and Design"], "conf": "rtss", "authors": ["Junkun Li.....http://dblp.org/pers/hd/l/Li:Junkun", "Jiming Chen.....http://dblp.org/pers/hd/c/Chen:Jiming", "Shibo He.....http://dblp.org/pers/hd/h/He:Shibo", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0001:Yu", "Youxian Sun.....http://dblp.org/pers/hd/s/Sun:Youxian"], "pages": 10}