{"title": "Collaborative Users' Brand Preference Mining across Multiple Domains from Implicit Feedbacks.", "fields": ["scarcity", "collaborative filtering", "web navigation", "brand preference", "collaborative learning"], "abstract": "Advanced e-applications require comprehensive knowledge about their users' preferences in order to provide accurate personalized services. In this paper, we propose to learn users' preferences to product brands from their implicit feedbacks such as their searching and browsing behaviors in user Web browsing log data. The user brand preference learning problem is challenge since (1) the users' implicit feedbacks are extremely sparse in various product domains; and (2) we can only observe positive feedbacks from users' behaviors. In this paper, we propose a latent factor model to collaboratively mine users' brand preferences across multiple domains simultaneously. By collective learning, the learning processes in all the domains are mutually enhanced and hence the problem of data scarcity in each single domain can be effectively addressed. On the other hand, we learn our model with an adaption of the Bayesian personalized ranking (BPR) optimization criterion which is a general learning framework for collaborative filtering from implicit feedbacks. Experiments with both synthetic and real world datasets show that our proposed model significantly outperforms the baselines.", "citation": "Citations (10)", "departments": ["Peking University", "Microsoft", "Microsoft", "Peking University", "Huazhong University of Science and Technology"], "authors": ["Jian Tang.....http://dblp.org/pers/hd/t/Tang_0005:Jian", "Jun Yan.....http://dblp.org/pers/hd/y/Yan_0001:Jun", "Lei Ji.....http://dblp.org/pers/hd/j/Ji:Lei", "Ming Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Ming", "Shaodan Guo.....http://dblp.org/pers/hd/g/Guo:Shaodan", "Ning Liu.....http://dblp.org/pers/hd/l/Liu_0001:Ning", "Xianfang Wang.....http://dblp.org/pers/hd/w/Wang:Xianfang", "Zheng Chen.....http://dblp.org/pers/hd/c/Chen_0001:Zheng"], "conf": "aaai", "year": "2011", "pages": -1}