{"title": "EAGLE: engineering software in the ubiquitous globe by leveraging uncErtainty.", "fields": ["goal driven software development process", "software design description", "resource oriented architecture", "software sizing", "software engineering process group"], "abstract": "In the next future we will be surrounded by a virtually infinite number of software applications that provide computational software resources in the open Globe. This will radically change the way software will be produced and used. Users will be keen on producing their own piece of software, by also reusing existing software, to better satisfy their needs, therefore with a goal oriented, opportunistic use in mind. The produced software will need to be able to evolve, react and adapt to a continuously changing environment, while guaranteeing dependability. The strongest adversary to this view is the lack of knowledge on the software's structure, behavior, and execution context. Despite the possibility to extract observational models from existing software, a producer will always operate with software artifacts that exhibit a degree of uncertainty in terms of their functional and non functional characteristics. We believe that uncertainty can only be controlled by making it explicit and by using it to drive the production process itself. In this paper, we introduce a novel paradigm of software production process that explores available software and assesses its degree of uncertainty in relation to the opportunistic goal G, assists the producer in creating the appropriate integration means towards G, and validates the quality of the integrated system with respect to G and the current context.", "citation": "Citations (13)", "departments": ["Università dell ... L'Aquila, Italy", "Università dell ...  L'Aqila, Italy", "Università dell ... L'Aquila, Italy", "Università dell ... L'Aquila, Italy", "Università dell ... L'Aquila, Italy"], "authors": ["Marco Autili.....http://dblp.org/pers/hd/a/Autili:Marco", "Vittorio Cortellessa.....http://dblp.org/pers/hd/c/Cortellessa:Vittorio", "Davide Di Ruscio.....http://dblp.org/pers/hd/r/Ruscio:Davide_Di", "Paola Inverardi.....http://dblp.org/pers/hd/i/Inverardi:Paola", "Patrizio Pelliccione.....http://dblp.org/pers/hd/p/Pelliccione:Patrizio", "Massimo Tivoli.....http://dblp.org/pers/hd/t/Tivoli:Massimo"], "conf": "sigsoft", "year": "2011", "pages": 4}