{"title": "How to nudge in Situ: designing lambent devices to deliver salient information in supermarkets.", "fields": ["food miles", "emoticon", "salient", "recommender system", "clips", "persuasive technology"], "abstract": "There are a number of mobile shopping aids and recommender systems available, but none can be easily used for a weekly shop at a local supermarket. We present a minimal, mobile and fully functional lambent display that clips onto any shopping trolley handle, intended to nudge people when choosing what to buy. It provides salient information about the food miles for various scanned food items represented by varying lengths of lit LEDs on the handle and a changing emoticon comparing the average miles of all the products in the trolley against a social norm. When evaluated in situ, the lambent handle display nudged people to choose products with fewer food miles than the items they selected using their ordinary shopping strategies. People also felt guilty when the average mileage of the contents of their entire shopping trolley was above the social norm. The findings are discussed in terms of how to provide different kinds of product information that people care about, using simple lambent displays.", "citation": "Not cited", "departments": ["Open University", "Open University", "Open University", "Microsoft", "Open University"], "authors": ["Vaiva Kalnikaité.....http://dblp.org/pers/hd/k/Kalnikait=eacute=:Vaiva", "Yvonne Rogers.....http://dblp.org/pers/hd/r/Rogers:Yvonne", "Jon Bird.....http://dblp.org/pers/hd/b/Bird:Jon", "Nicolas Villar.....http://dblp.org/pers/hd/v/Villar:Nicolas", "Khaled Bachour.....http://dblp.org/pers/hd/b/Bachour:Khaled", "Stephen J. Payne.....http://dblp.org/pers/hd/p/Payne:Stephen_J=", "Peter M. Todd.....http://dblp.org/pers/hd/t/Todd:Peter_M=", "Johannes Schöning.....http://dblp.org/pers/hd/s/Sch=ouml=ning:Johannes", "Antonio Krüger.....http://dblp.org/pers/hd/k/Kr=uuml=ger:Antonio", "Stefan Kreitmayer.....http://dblp.org/pers/hd/k/Kreitmayer:Stefan"], "conf": "huc", "year": "2011", "pages": 10}