{"title": "Multicast video delivery with switched beamforming antennas in indoor wireless networks.", "fields": ["distance vector multicast routing protocol", "xcast", "pragmatic general multicast", "reliable multicast", "source specific multicast"], "abstract": "Wireless multicast based video delivery is constrained by the user with the lowest channel quality within a multicast group. Beamforming increases the SINR at the clients thereby increasing the minimum channel quality among the users that form the multicast group. Thus it can be utilized to enhance the wireless multicast video transmission. In this paper, we investigate how to exploit switched beamforming antennas to improve wireless multicast based video transmission in indoor environments. The fundamental problem to be solved is the selection and scheduling of beams to be used to cover different subsets of users within the multicast group. We consider both multi-resolution videos and multi-layered videos and formulate the problem as maximizing the total utility of all multicast clients subject to a total delay constraint, where the utility is a general measure of video quality or user-satisfaction. We prove that it is NP-hard to have a (1−1/e+e)-approximation solution to this problem for any e > 0, under both multi-resolution and multi-layered video models. For the multi-resolution video model, we develop a unified approximation algorithm with a parameter k that controls both the algorithm complexity and the approximation factor. For k = 0, 1, 2, 3, we prove that the proposed algorithm achieves an approximation guarantee close to 0.31, 0.38, 0.55, and 0.63, respectively. For the multi-layered video model, we propose a similar heuristic solution. The proposed algorithms are evaluated with both hypothetical video sequences and real video sequences using channel data collected in an indoor wireless testbed. Evaluation results show that the proposed algorithms have much better performance than naive multicast algorithms for scheduling the beams.", "citation": "Citations (7)", "departments": ["University of Science and Technology of China", "Mobile Communic ... es America, USA", "Mobile Communic ... es America, USA", "Mobile Communic ... es America, USA"], "authors": ["Honghai Zhang.....http://dblp.org/pers/hd/z/Zhang:Honghai", "Yuanxi Jiang.....http://dblp.org/pers/hd/j/Jiang:Yuanxi", "Sampath Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan:Sampath", "Baohua Zhao.....http://dblp.org/pers/hd/z/Zhao:Baohua"], "conf": "infocom", "year": "2011", "pages": 9}