{"title": "Efficient processing of data warehousing queries in a split execution environment.", "fields": ["parallel database", "data warehouse", "scalability", "big data", "sql"], "abstract": "Hadapt is a start-up company currently commercializing the Yale University research project called HadoopDB. The company focuses on building a platform for Big Data analytics in the cloud by introducing a storage layer optimized for structured data and by providing a framework for executing SQL queries efficiently. This work considers processing data warehousing queries over very large datasets. Our goal is to maximize perfor mance while, at the same time, not giving up fault tolerance and scalability. We analyze the complexity of this problem in the split execution environment of HadoopDB. Here, incoming queries are examined; parts of the query are pushed down and executed inside the higher performing database layer; and the rest of the query is processed in a more generic MapReduce framework.   In this paper, we discuss in detail performance-oriented query execution strategies for data warehouse queries in split execution environments, with particular focus on join and aggregation operations. The efficiency of our techniques is demonstrated by running experiments using the TPC-H benchmark with 3TB of data. In these experiments we compare our results with a standard commercial parallel database and an open-source MapReduce implementation featuring a SQL interface (Hive). We show that HadoopDB successfully competes with other systems.", "citation": "Citations (93)", "year": "2011", "departments": ["Yale University", "Yale University", "Yale University", "University of Wisconsin-Madison"], "conf": "sigmod", "authors": ["Kamil Bajda-Pawlikowski.....http://dblp.org/pers/hd/b/Bajda=Pawlikowski:Kamil", "Daniel J. Abadi.....http://dblp.org/pers/hd/a/Abadi:Daniel_J=", "Avi Silberschatz.....http://dblp.org/pers/hd/s/Silberschatz:Avi", "Erik Paulson.....http://dblp.org/pers/hd/p/Paulson:Erik"], "pages": 12}