{"title": "ISABELA-QA: query-driven analytics with ISABELA-compressed extreme-scale scientific data.", "fields": ["search engine indexing", "analytics", "data intensive computing", "range query", "data analysis"], "abstract": "Efficient analytics of scientific data from extreme-scale simulations is quickly becoming a top-notch priority. The increasing simulation output data sizes demand for a paradigm shift in how analytics is conducted. In this paper, we argue that  query-driven analytics over compressed---rather than original, full-size---data  is a promising strategy in order to meet storage-and-I/O-bound application challenges. As a proof-of-principle, we propose a parallel query processing engine, called ISABELA-QA that is designed and optimized for  knowledge priors  driven analytical processing of spatio-temporal, multivariate scientific data that is initially compressed,  in situ , by our ISABELA technology. With ISABELA-QA, the total data storage requirement is less than 23%-30% of the original data, which is upto eight-fold less than what the existing state-of-the-art data management technologies that require storing both the original data and the index could offer. Since ISABELA-QA operates on the metadata generated by our compression technology, its underlying indexing technology for efficient query processing is light-weight; it requires less than 3% of the original data, unlike existing database indexing approaches that require 30%-300% of the original data. Moreover, ISABELA-QA is specifically optimized to retrieve the actual values rather than spatial regions for the variables that satisfy user-specified range queries---a functionality that is critical for high-accuracy data analytics. To the best of our knowledge, this is the first techology that enables query-driven analytics over the compressed spatio-temporal floating-point double-or single-precision data, while offering a light-weight memory and disk storage footprint solution with parallel, scalable, multi-node, multi-core, GPU-based query processing.", "citation": "Citations (63)", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University", "North Carolina State University", "Sandia National Laboratories"], "authors": ["Sriram Lakshminarasimhan.....http://dblp.org/pers/hd/l/Lakshminarasimhan:Sriram", "John Jenkins.....http://dblp.org/pers/hd/j/Jenkins:John", "Isha Arkatkar.....http://dblp.org/pers/hd/a/Arkatkar:Isha", "Zhenhuan Gong.....http://dblp.org/pers/hd/g/Gong:Zhenhuan", "Hemanth Kolla.....http://dblp.org/pers/hd/k/Kolla:Hemanth", "Seung-Hoe Ku.....http://dblp.org/pers/hd/k/Ku:Seung=Hoe", "Stéphane Ethier.....http://dblp.org/pers/hd/e/Ethier:St=eacute=phane", "Jackie Chen.....http://dblp.org/pers/hd/c/Chen:Jackie", "Choong-Seock Chang.....http://dblp.org/pers/hd/c/Chang:Choong=Seock", "Scott Klasky.....http://dblp.org/pers/hd/k/Klasky:Scott", "Robert Latham.....http://dblp.org/pers/hd/l/Latham:Robert", "Robert B. Ross.....http://dblp.org/pers/hd/r/Ross:Robert_B=", "Nagiza F. Samatova.....http://dblp.org/pers/hd/s/Samatova:Nagiza_F="], "conf": "sc", "year": "2011", "pages": 11}