{"title": "CHAIN: Introducing minimum controlled coordination into random access MAC.", "fields": ["network packet", "random access", "ieee 802 11", "correctness", "telecommunications link"], "abstract": "IEEE 802.11 DCF is the dominant protocol used in existing WLANs. However, the efficiency of DCF progressively degrades with the increase of contending clients in the network as well as the wireless link rate. To address this issue, in this paper, we present a distributed random media access protocol, named CHAIN, which significantly improves uplink performance of WLANs. CHAIN mainly uses overhearing to coordinate clients in a network, and thus introduces little control overhead. The key in CHAIN is a novel piggyback transmission opportunity. In CHAIN, clients maintain a precedence relation among one another, and a client can immediately transmit a new packet after it overhears a successful transmission of its predecessor, without going through the regular contending process. When the network load is low, CHAIN behaves similar to DCF; But when the network becomes congested, clients automatically start chains of transmissions to improve efficiency. CHAIN is derived from DCF and co-exists friendly with it. Moreover, it possesses all the advantages of the 802.11 DCF standard - simplicity, robustness, and scalability. We analytically prove the correctness and fairness of CHAIN. Our extensive simulations on J-SIM verify our analytical results, and demonstrate significant performance gain of CHAIN over DCF.", "citation": "Citations (28)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Microsoft", "University of Illinois at Urbana–Champaign"], "authors": ["Zheng Zeng.....http://dblp.org/pers/hd/z/Zeng:Zheng", "Yan Gao.....http://dblp.org/pers/hd/g/Gao:Yan", "Kun Tan.....http://dblp.org/pers/hd/t/Tan:Kun", "P. R. Kumar.....http://dblp.org/pers/hd/k/Kumar:P=_R="], "conf": "infocom", "year": "2011", "pages": 9}