{"title": "Selectivity estimation for extraction operators over text data.", "fields": ["text corpus", "regular expression", "text processing", "operator", "query plan"], "abstract": "Recently, there has been increasing interest in extending relational query processing to efficiently support extraction operators, such as dictionaries and regular expressions, over text data. Many text processing queries are sophisticated in that they involve multiple extraction and join operators, resulting in many possible query plans. However, there has been little research on building the selectivity or cost estimation for these extraction operators, which is crucial for an optimizer to pick a good query plan. In this paper, we define the problem of selectivity estimation for dictionaries and regular expressions, and propose to develop document synopses over a text corpus, from which the selectivity can be estimated. We first adapt the language models in the Natural Language Processing literature to form the top-k n-gram synopsis as the baseline document synopsis. Then we develop two classes of novel document synopses: stratified bloom filter synopsis and roll-up synopsis. We also develop techniques to decompose a complicated regular expression into subparts to achieve more effective and accurate estimation. We conduct experiments over the Enron email corpus using both real-world and synthetic workloads to compare the accuracy of the selectivity estimation over different classes and variations of synopses. The results show that, the top-k stratified bloom filter synopsis and the roll-up synopsis is the most accurate in dictionary and regular expression selectivity estimation respectively.", "citation": "Citations (8)", "departments": ["University of California, Berkeley", "University of California, Berkeley", "IBM", "IBM", "IBM"], "authors": ["Daisy Zhe Wang.....http://dblp.org/pers/hd/w/Wang:Daisy_Zhe", "Long Wei.....http://dblp.org/pers/hd/w/Wei:Long", "Yunyao Li.....http://dblp.org/pers/hd/l/Li_0001:Yunyao", "Frederick Reiss.....http://dblp.org/pers/hd/r/Reiss:Frederick", "Shivakumar Vaithyanathan.....http://dblp.org/pers/hd/v/Vaithyanathan:Shivakumar"], "conf": "icde", "year": "2011", "pages": 12}