{"title": "Unsupervised learning of event AND-OR grammar and semantics from video.", "fields": ["information projection", "attribute grammar", "synchronous context free grammar", "stochastic grammar", "parsing"], "abstract": "We study the problem of automatically learning event AND-OR grammar from videos of a certain environment, e.g. an office where students conduct daily activities. We propose to learn the event grammar under the information projection and minimum description length principles in a coherent probabilistic framework, without manual supervision about what events happen and when they happen. Firstly a predefined set of unary and binary relations are detected for each video frame: e.g. agent's position, pose and interaction with environment. Then their co-occurrences are clustered into a dictionary of simple and transient atomic actions. Recursively these actions are grouped into longer and complexer events, resulting in a stochastic event grammar. By modeling time constraints of successive events, the learned grammar becomes context-sensitive. We introduce a new dataset of surveillance-style video in office, and present a prototype system for video analysis integrating bottom-up detection, grammatical learning and parsing. On this dataset, the learning algorithm is able to automatically discover important events and construct a stochastic grammar, which can be used to accurately parse newly observed video. The learned grammar can be used as a prior to improve the noisy bottom-up detection of atomic actions. It can also be used to infer semantics of the scene. In general, the event grammar is an efficient way for common knowledge acquisition from video.", "citation": "Citations (88)", "year": "2011", "departments": ["University of California, Los Angeles", "Beijing Institute of Technology", "University of California, Los Angeles", "University of California, Los Angeles"], "conf": "iccv", "authors": ["Zhangzhang Si.....http://dblp.org/pers/hd/s/Si:Zhangzhang", "Mingtao Pei.....http://dblp.org/pers/hd/p/Pei:Mingtao", "Benjamin Z. Yao.....http://dblp.org/pers/hd/y/Yao:Benjamin_Z=", "Song-Chun Zhu.....http://dblp.org/pers/hd/z/Zhu:Song=Chun"], "pages": 8}