{"title": "PW-MAC: An energy-efficient predictive-wakeup MAC protocol for wireless sensor networks.", "fields": ["network packet", "sensor node", "retransmission", "asynchronous communication", "latency"], "abstract": "This paper presents PW-MAC (Predictive-Wakeup MAC), a new energy-efficient MAC protocol based on asynchronous duty cycling. In PW-MAC, nodes each wake up to receive at randomized, asynchronous times. PW-MAC minimizes sensor node energy consumption by enabling senders to predict receiver wakeup times; to enable accurate predictions, PW-MAC introduces an on-demand prediction error correction mechanism that effectively addresses timing challenges such as unpredictable hardware and operating system delays and clock drift. PW-MAC also introduces an efficient prediction-based retransmission mechanism to achieve high energy efficiency even when wireless collisions occur and packets must be retransmitted. We evaluate PW-MAC on a testbed of MICAz motes and compare it to X-MAC, WiseMAC, and RI-MAC, three previous energy-efficient MAC protocols, under multiple concurrent multihop traffic flows and under hidden-terminal scenarios and scenarios in which nodes have wakeup schedule conflicts. In all experiments, PW-MAC significantly outperformed these other protocols. For example, evaluated on scenarios with 15 concurrent transceivers in the network, the average sender duty cycle for X-MAC, WiseMAC, and RI-MAC were all over 66%, while PW-MAC's average sender duty cycle was only 11%; the delivery latency for PW-MAC in these scenarios was less than 5% that for WiseMAC and X-MAC. In all experiments, PW-MAC maintained a delivery ratio of 100%.", "citation": "Citations (293)", "departments": ["Rice University", "Texas Instruments", "Ben-Gurion University of the Negev", "Rice University"], "authors": ["Lei Tang.....http://dblp.org/pers/hd/t/Tang:Lei", "Yanjun Sun.....http://dblp.org/pers/hd/s/Sun:Yanjun", "Omer Gurewitz.....http://dblp.org/pers/hd/g/Gurewitz:Omer", "David B. Johnson.....http://dblp.org/pers/hd/j/Johnson:David_B="], "conf": "infocom", "year": "2011", "pages": 9}