{"title": "Approximate polytope membership queries.", "fields": ["polytope", "convex polytope", "birkhoff polytope", "mahler volume", "faust", "best bin first", "vertex enumeration problem", "approximation algorithm", "nearest neighbor search"], "abstract": "We consider an approximate version of a fundamental geometric search problem, polytope membership queries. Given a convex polytope P in RE d , presented as the intersection of halfspaces, the objective is to preprocess P so that, given a query point q, it is possible to determine efficiently whether q lies inside P subject to an error bound e. Previous solutions to this problem were based on straightforward applications of classic polytope approximation techniques by Dudley (1974) and Bentley et al. (1982). The former yields minimum storage, and the latter yields constant query time. A space-time tradeoff can be obtained by interpolating between the two. We present the first significant improvements to this tradeoff. For example, using the same storage as Dudley, we reduce the query time from O(1/e (d-1)/2 ) to O(1/e (d-1)/4 ). Our approach is based on a very simple algorithm. Both lower bounds and upper bounds on the performance of the algorithm are presented.   To establish the relevance of our results, we introduce a reduction from approximate nearest neighbor searching to approximate polytope membership queries. We show that our tradeoff provides significant improvements to the best known space-time tradeoffs for approximate nearest neighbor searching. Furthermore, this is achieved with constructions that are much simpler than existing methods.", "citation": "Not cited", "year": "2011", "departments": ["Hong Kong University of Science and Technology", "Universidade Federal do Estado do Rio de Janeiro", "University of Maryland, College Park"], "conf": "stoc", "authors": ["Sunil Arya.....http://dblp.org/pers/hd/a/Arya:Sunil", "Guilherme Dias da Fonseca.....http://dblp.org/pers/hd/f/Fonseca:Guilherme_Dias_da", "David M. Mount.....http://dblp.org/pers/hd/m/Mount:David_M="], "pages": 8}