{"title": "Entangled queries: enabling declarative data-driven coordination.", "fields": ["constraint satisfaction problem", "computational problem", "sql", "blossom algorithm", "tuple"], "abstract": "Many data-driven social and Web applications involve collaboration and coordination. The vision of  declarative data-driven coordination  (D3C), proposed in [9], is to support coordination in the spirit of data management: to make it data-centric and to specify it using convenient declarative languages. This paper introduces  entangled queries , a language that extends SQL by constraints that allow for the coordinated choice of result tuples across queries originating from different users or applications.   It is nontrivial to define a declarative coordination formalism without arriving at the general (NP-complete) Constraint Satisfaction Problem from AI. In this paper, we propose an efficiently enforcible syntactic  safety  condition that we argue is at the sweet spot where interesting declarative power meets applicability in large scale data management systems and applications.   The key computational problem of D3C is to match entangled queries to achieve coordination. We present an efficient matching algorithm which statically analyzes query workloads and merges coordinating entangled queries into compound SQL queries. These can be sent to a standard database system and return only coordinated results. We present the overall architecture of an implemented system that contains our evaluation algorithm; we also evaluate the performance of the matching algorithm experimentally on realistic coordination workloads.", "citation": "Citations (11)", "year": "2011", "departments": ["Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University"], "conf": "sigmod", "authors": ["Nitin Gupta.....http://dblp.org/pers/hd/g/Gupta_0003:Nitin", "Lucja Kot.....http://dblp.org/pers/hd/k/Kot:Lucja", "Sudip Roy.....http://dblp.org/pers/hd/r/Roy_0002:Sudip", "Gabriel Bender.....http://dblp.org/pers/hd/b/Bender:Gabriel", "Johannes Gehrke.....http://dblp.org/pers/hd/g/Gehrke:Johannes", "Christoph Koch.....http://dblp.org/pers/hd/k/Koch_0001:Christoph"], "pages": 12}