{"title": "Stable throughput tradeoffs in cognitive shared channels with cooperative relaying.", "fields": ["network packet", "cognitive radio", "relay channel", "idle", "channel capacity"], "abstract": "This paper addresses fundamental issues in a shared channel where the users have different priority levels. In particular, we characterize the stable-throughput region in a two user cognitive shared channel where the primary (higher priority) user transmits whenever it has packets to transmit while the secondary (cognitive) node transmits its packets with probability p. Therefore, in this system, the secondary link is allowed to share the channel along with the primary link, in contrast to the traditional notion of cognitive radio, in which the secondary user is required to relinquish the channel as soon as the primary is detected. The analysis also takes into account the compound effects of multi-packet reception as well as of the relaying capability on the stability region of the network. We start by analyzing the non-cooperation case where nodes transmit their own packets to their respective destinations. We then extend the analysis to a system where the secondary node cooperatively relays some of the primary's packets. Specifically, in the cooperation case, the secondary node relays those packets that it receives successfully from the primary, but are not decoded properly by the primary destination. In such cognitive shared channels, a tradeoff arises in terms of activating the secondary along with the primary so that both transmissions may be successful, but with a lower probability, compared to the case of the secondary node staying idle when the primary user transmits. Results show the benefits of relaying for both the primary as well as the secondary nodes in terms of the stable-throughput region.", "citation": "Citations (78)", "departments": ["United States Naval Research Laboratory", "United States Naval Research Laboratory", "Silver Spring Networks", "University of Maryland, College Park"], "authors": ["Sastry Kompella.....http://dblp.org/pers/hd/k/Kompella:Sastry", "Gam D. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Gam_D=", "Jeffrey E. Wieselthier.....http://dblp.org/pers/hd/w/Wieselthier:Jeffrey_E=", "Anthony Ephremides.....http://dblp.org/pers/hd/e/Ephremides:Anthony"], "conf": "infocom", "year": "2011", "pages": 9}