{"title": "Analysis of event detection delay in wireless sensor networks.", "fields": ["network packet", "network delay", "static timing analysis", "sink", "event monitoring"], "abstract": "Emerging applications of wireless sensor networks (WSNs) require real-time event detection to be provided by the network. In a typical event monitoring WSN, multiple reports are generated by several nodes when a physical event occurs, and are then forwarded through multi-hop communication to a sink that detects the event. To improve the event detection reliability, usually timely delivery of a certain number of packets is required. Traditional timing analysis of WSNs are, however, either focused on individual packets or traffic flows from individual nodes. In this paper, a spatio-temporal fluid model is developed to capture the delay characteristics of event detection in large-scale WSNs. More specifically, the distribution of delay in event detection from multiple reports is modeled. Accordingly, metrics such as mean delay and soft delay bounds are analyzed for different network parameters. Motivated by the fact that queue build up in WSNs with low-rate traffic is negligible, a lower-complexity model is also developed. Testbed experiments and simulations are used to validate the accuracy of both approaches. The resulting framework can be utilized to analyze the effects of network and protocol parameters on event detection delay to realize real-time operation in WSNs. To the best of our knowledge, this is the first approach that provides a transient analysis of event detection delay when multiple reports via multi-hop communication are needed.", "citation": "Citations (20)", "departments": ["University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln"], "authors": ["Yunbo Wang.....http://dblp.org/pers/hd/w/Wang:Yunbo", "Mehmet C. Vuran.....http://dblp.org/pers/hd/v/Vuran:Mehmet_C=", "Steve Goddard.....http://dblp.org/pers/hd/g/Goddard:Steve"], "conf": "infocom", "year": "2011", "pages": 9}