{"title": "Accelerating CUDA graph algorithms at maximum warp.", "fields": ["graph500", "memory bandwidth", "speedup", "regular graph", "cuda"], "abstract": "Graphs are powerful data representations favored in many computational domains. Modern GPUs have recently shown promising results in accelerating computationally challenging graph problems but their performance suffered heavily when the graph structure is highly irregular, as most real-world graphs tend to be. In this study, we first observe that the poor performance is caused by work imbalance and is an artifact of a discrepancy between the GPU programming model and the underlying GPU architecture.We then propose a novel virtual warp-centric programming method that exposes the traits of underlying GPU architectures to users. Our method significantly improves the performance of applications with heavily imbalanced workloads, and enables trade-offs between workload imbalance and ALU underutilization for fine-tuning the performance. Our evaluation reveals that our method exhibits up to 9x speedup over previous GPU algorithms and 12x over single thread CPU execution on irregular graphs. When properly configured, it also yields up to 30% improvement over previous GPU algorithms on regular graphs. In addition to performance gains on graph algorithms, our programming method achieves 1.3x to 15.1x speedup on a set of GPU benchmark applications. Our study also confirms that the performance gap between GPUs and other multi-threaded CPU graph implementations is primarily due to the large difference in memory bandwidth.", "citation": "Citations (322)", "year": "2011", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University"], "conf": "ppopp", "authors": ["Sungpack Hong.....http://dblp.org/pers/hd/h/Hong:Sungpack", "Sang Kyun Kim.....http://dblp.org/pers/hd/k/Kim:Sang_Kyun", "Tayo Oguntebi.....http://dblp.org/pers/hd/o/Oguntebi:Tayo", "Kunle Olukotun.....http://dblp.org/pers/hd/o/Olukotun:Kunle"], "pages": 10}