{"title": "Mechanisms for (mis)allocating scientific credit.", "fields": ["algorithmic game theory", "export credit agency", "scientific communication", "congestion game", "matthew effect"], "abstract": "Scientific communities confer many forms of credit --- both implicit and explicit --- on their successful members, and it has long been argued that the motivation provided by these forms of credit helps to shape a community's collective attention toward different lines of research. The allocation of scientific credit, however, has also been the focus of long-documented pathologies: certain research questions are said to command too much credit, at the expense of other equally important questions; and certain researchers (in a version of Robert Merton's Matthew Effect) seem to receive a disproportionate share of the credit, even when the contributions of others are similar.   Here we show that the presence of each of these pathologies can in fact increase the collective productivity of a community. We consider a model for the allocation of credit, in which individuals can choose among  projects  of varying levels of importance and difficulty, and they compete to receive credit with others who choose the same project. Under the most natural mechanism for allocating credit, in which it is divided among those who succeed at a project in proportion to the project's importance, the resulting selection of projects by self-interested, credit-maximizing individuals will in general be socially sub-optimal. However, we show that there exist ways of allocating credit out of proportion to the true importance of the projects, as well as mechanisms that assign credit out of proportion to the relative contributions of the individuals, that lead credit-maximizing individuals to collectively achieve social optimality. These results therefore suggest how well-known forms of misallocation of scientific credit can in fact serve to channel self-interested behavior into socially optimal outcomes.", "citation": "Citations (58)", "year": "2011", "departments": ["Cornell University", "Cornell University"], "conf": "stoc", "authors": ["Jon M. Kleinberg.....http://dblp.org/pers/hd/k/Kleinberg:Jon_M=", "Sigal Oren.....http://dblp.org/pers/hd/o/Oren:Sigal"], "pages": 10}