{"title": "Robust multipath routing in large wireless networks.", "fields": ["wireless", "wireless network", "multipath routing", "disjoint sets", "channel"], "abstract": "One of the challenges of wireless networks is to provide a reliable end-to-end path between two end hosts in the face of link and node outages. These can occur due to fluctuations in channel quality, node movement, or node failure. One mechanism that has been proposed is based on multipath routing, the idea being to establish two or more paths between the end hosts so that they always have a path between them with high probability in the face of outages. This naturally raises the question of how to discover these paths in an unknown, random wireless network to enable robust multipath routing. In order to answer this question, we model a random wireless network as a 2D spatial Poisson process. Based on the results of percolation highways in Franceschetti, et al. [1], we present accurate conditions that enable robust multipath routing. If the number of hops of a path between the end hosts is n, then there exists a path between them in a strip of width proportional to log n. More precisely, there exist C log n disjoint paths in a strip of width a(C, p) · log n, where p is the probability that characterizes the availability of an individual wireless communication link. We derive tight bounds for the function a(C, p). This provides a useful guideline for the establishment of multiple paths in a real wireless network, namely that the width should grow logarithmically in the number of hops on the path between the hosts.", "citation": "Citations (9)", "departments": ["University of Cambridge", "Roke Manor Research", "University of Massachusetts Amherst", "Institute for I ... arch, Singapore"], "authors": ["Chi-Kin Chau.....http://dblp.org/pers/hd/c/Chau:Chi=Kin", "Richard J. Gibbens.....http://dblp.org/pers/hd/g/Gibbens:Richard_J=", "Robert E. Hancock.....http://dblp.org/pers/hd/h/Hancock:Robert_E=", "Donald F. Towsley.....http://dblp.org/pers/hd/t/Towsley:Donald_F="], "conf": "infocom", "year": "2011", "pages": 5}