{"title": "TRACON: interference-aware scheduling for data-intensive applications in virtualized environments.", "fields": ["virtual machine", "cloud computing", "virtualization", "scalability", "server"], "abstract": "Large-scale data centers leverage virtualization technology to achieve excellent resource utilization, scalability, and high availability. Ideally, the performance of an application running inside a virtual machine (VM) shall be independent of co-located applications and VMs that share the physical machine. However, adverse interference effects exist and are especially severe for data-intensive applications in such vir-tualized environments. In this work, we present TRACON, a novel Task and Resource Allocation CONtrol framework that mitigates the interference effects from concurrent data-intensive applications and greatly improves the overall system performance. TRACON utilizes modeling and control techniques from statistical machine learning and consists of three major components: the interference prediction model that infers application performance from resource consumption observed from different VMs, the interference-aware scheduler that is designed to utilize the model for effective resource management, and the task and resource monitor that collects application characteristics at the runtime for model adaption. We simulate TRACON with a wide variety of data-intensive applications including bioinformatics, data mining, video processing, email and web servers, etc. The evaluation results show that TRACON can achieve up to 50% improvement on application runtime, and up to 80% on I/O throughput for data-intensive applications in virtu-alized data centers.", "citation": "Citations (138)", "departments": ["George Washington University", "George Washington University"], "authors": ["Ron Chi-Lung Chiang.....http://dblp.org/pers/hd/c/Chiang:Ron_Chi=Lung", "H. Howie Huang.....http://dblp.org/pers/hd/h/Huang:H=_Howie"], "conf": "sc", "year": "2011", "pages": 12}