{"title": "A coarse-to-fine approach for fast deformable object detection.", "fields": ["inference", "viola jones object detection framework", "recursion", "speedup", "order of magnitude", "pascal", "object detection"], "abstract": "We present a method that can dramatically accelerate object detection with part based models. The method is based on the observation that the cost of detection is likely to be dominated by the cost of matching each part to the image, and not by the cost of computing the optimal configuration of the parts as commonly assumed. Therefore accelerating detection requires minimizing the number of part-to-image comparisons. To this end we propose a multiple-resolutions hierarchical part based model and a corresponding coarse-to-fine inference procedure that recursively eliminates from the search space unpromising part placements. The method yields a ten-fold speedup over the standard dynamic programming approach and is complementary to the cascade-of-parts approach of [9]. Compared to the latter, our method does not have parameters to be determined empirically, which simplifies its use during the training of the model. Most importantly, the two techniques can be combined to obtain a very significant speedup, of two orders of magnitude in some cases. We evaluate our method extensively on the PASCAL VOC and INRIA datasets, demonstrating a very high increase in the detection speed with little degradation of the accuracy.", "citation": "Citations (178)", "year": "2011", "departments": ["Autonomous University of Barcelona", "University of Oxford", "Autonomous University of Barcelona", "Autonomous University of Barcelona", "University of Oxford", "Autonomous University of Barcelona", "Autonomous University of Barcelona"], "conf": "cvpr", "authors": ["Marco Pedersoli.....http://dblp.org/pers/hd/p/Pedersoli:Marco", "Andrea Vedaldi.....http://dblp.org/pers/hd/v/Vedaldi:Andrea", "Jordi Gonzàlez.....http://dblp.org/pers/hd/g/Gonz=agrave=lez_0001:Jordi"], "pages": 8}