{"title": "Jump-stay based channel-hopping algorithm with guaranteed rendezvous for cognitive radio networks.", "fields": ["spectrum management", "cognitive radio", "rendezvous", "control channel", "clock synchronization"], "abstract": "Cognitive radio networks (CRNs) have emerged as advanced and promising paradigm to exploit the existing wireless spectrum opportunistically. It is crucial for users in CRNs to search for neighbors via rendezvous process and thereby establish the communication links to exchange the information necessary for spectrum management and channel contention etc. This paper focuses on the design of algorithms for blind rendezvous, i.e., rendezvous without using any central controller and common control channel (CCC). We propose a jump-stay based channel-hopping (CH) algorithm for blind rendezvous. The basic idea is to generate CH sequence in rounds and each round consists of a jump-pattern and a stay-pattern. Users “jump” on available channels in the jump-pattern while “stay” on a specific channel in the stay-pattern. Compared with the existing CH algorithms, our algorithm achieves the following advances: i) guaranteed rendezvous without the need of time-synchronization; ii) applicability to rendezvous of multi-user and multi-hop scenarios. We derive the maximum time-to-rendezvous (TTR) and the upper-bound of expected TTR of our algorithm for both 2-user and multi-user scenarios (shown in Table I). Extensive simulations are further conducted to evaluate performance of our algorithm.", "citation": "Citations (211)", "departments": ["Hong Kong Baptist University", "Hong Kong Baptist University", "Hong Kong Baptist University", "Hong Kong Baptist University"], "authors": ["Zhiyong Lin.....http://dblp.org/pers/hd/l/Lin:Zhiyong", "Hai Liu.....http://dblp.org/pers/hd/l/Liu:Hai", "Xiaowen Chu.....http://dblp.org/pers/hd/c/Chu:Xiaowen", "Yiu-Wing Leung.....http://dblp.org/pers/hd/l/Leung:Yiu=Wing"], "conf": "infocom", "year": "2011", "pages": 9}