{"title": "Leveraging Value Locality in Optimizing NAND Flash-based SSDs.", "fields": ["flash file system", "nand gate", "auxiliary memory", "exploit", "locality"], "abstract": "NAND flash-based solid-state drives (SSDs) are increasingly being deployed in storage systems at different levels such as buffer-caches and even secondary storage. However, the poor reliability and performance offered by these SSDs for write-intensive workloads continues to be their key shortcoming. Several solutions based on traditionally popular notions of temporal and spatial locality help reduce write traffic for SSDs. However, another form of locality - value locality - has remained completely unexplored. Value locality implies that certain data items (i.e., \"values,\" not just logical addresses) are likely to be accessed preferentially. Given evidence for the presence of significant value locality in real-world workloads, we design CA-SSD which employs content-addressable storage (CAS) to exploit such locality. Our CA-SSD design employs enhancements primarily in the flash translation layer (FTL) with minimal additional hardware, suggesting its feasibility. Using three real-world workloads with content information, we devise statistical characterizations of two aspects of value locality - value popularity and temporal value locality - that form the foundation of CA-SSD. We observe that CA-SSD is able to reduce average response times by about 59-84% compared to traditional SSDs. Even for workloads with little or no value locality, CA-SSD continues to offer comparable performance to a traditional SSD. Our findings advocate adoption of CAS in SSDs, paving the way for a new generation of these devices.", "citation": "Citations (131)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Aayush Gupta.....http://dblp.org/pers/hd/g/Gupta:Aayush", "Raghav Pisolkar.....http://dblp.org/pers/hd/p/Pisolkar:Raghav", "Bhuvan Urgaonkar.....http://dblp.org/pers/hd/u/Urgaonkar:Bhuvan", "Anand Sivasubramaniam.....http://dblp.org/pers/hd/s/Sivasubramaniam:Anand"], "conf": "fast", "year": "2011", "pages": 13}