{"title": "A multi-layer hybrid framework for dimensional emotion classification.", "fields": ["emotion classification", "pattern recognition", "robustness", "machine learning", "hidden markov model", "facial expression", "graphical model"], "abstract": "This paper investigates dimensional emotion prediction and classification from naturalistic facial expressions. Similarly to many pattern recognition problems, dimensional emotion classification requires generating multi-dimensional outputs. To date, classification for valence and arousal dimensions has been done separately, assuming that they are independent. However, various psychological findings suggest that these dimensions are correlated. We therefore propose a novel, multi-layer hybrid framework for emotion classification that is able to model inter-dimensional correlations. Firstly, we derive a novel geometric feature set based on the (a)symmetric spatio-temporal characteristics of facial expressions. Subsequently, we use the proposed feature set to train a multi-layer hybrid framework composed of a tem- poral regression layer for predicting emotion dimensions, a graphical model layer for modeling valence-arousal correlations, and a final classification and fusion layer exploiting informative statistics extracted from the lower layers. This framework (i) introduces the Auto-Regressive Coupled HMM (ACHMM), a graphical model specifically tailored to accommodate not only inter-dimensional correlations but also to exploit the internal dynamics of the actual observations, and (ii) replaces the commonly used Maximum Likelihood principle with a more robust final classification and fusion layer. Subject-independent experimental validation, performed on a naturalistic set of facial expressions, demonstrates the effectiveness of the derived feature set, and the robustness and flexibility of the proposed framework.", "citation": "Not cited", "departments": ["Imperial College London", "University of London", "Imperial College London"], "authors": ["Mihalis A. Nicolaou.....http://dblp.org/pers/hd/n/Nicolaou:Mihalis_A=", "Hatice Gunes.....http://dblp.org/pers/hd/g/Gunes:Hatice", "Maja Pantic.....http://dblp.org/pers/hd/p/Pantic:Maja"], "conf": "mm", "year": "2011", "pages": 4}