{"title": "Improved multithreaded unit testing.", "fields": ["thread", "precision and recall", "false positive paradox", "interleaving", "unit testing"], "abstract": "Multithreaded code is notoriously hard to develop and test. A multithreaded test exercises the code under test with two or more threads. Each test execution follows some schedule/interleaving of the multiple threads, and different schedules can give different results. Developers often want to enforce a particular schedule for test execution, and to do so, they use time delays (Thread.sleep in Java). Unfortunately, this approach can produce false positives or negatives, and can result in unnecessarily long testing time.   This paper presents IMUnit, a novel approach to specifying and executing schedules for multithreaded tests. We introduce a new language that allows explicit specification of schedules as orderings on events encountered during test execution. We present a tool that automatically instruments the code to control test execution to follow the specified schedule, and a tool that helps developers migrate their legacy, sleep-based tests into event-based tests in IMUnit. The migration tool uses novel techniques for inferring events and schedules from the executions of sleep-based tests. We describe our experience in migrating over 200 tests. The inference techniques have high precision and recall of over 75%, and IMUnit reduces testing time compared to sleep-based tests on average 3.39x.", "citation": "Citations (54)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Vilas Jagannath.....http://dblp.org/pers/hd/j/Jagannath:Vilas", "Milos Gligoric.....http://dblp.org/pers/hd/g/Gligoric:Milos", "Dongyun Jin.....http://dblp.org/pers/hd/j/Jin:Dongyun", "Qingzhou Luo.....http://dblp.org/pers/hd/l/Luo:Qingzhou", "Grigore Rosu.....http://dblp.org/pers/hd/r/Rosu:Grigore", "Darko Marinov.....http://dblp.org/pers/hd/m/Marinov:Darko"], "conf": "sigsoft", "year": "2011", "pages": 11}