{"title": "Privacy analysis of user association logs in a large-scale wireless LAN.", "fields": ["adversary", "correlation attack", "information sensitivity", "conditional random field", "information privacy"], "abstract": "User association logs play an important role in wireless network research. One concern of sharing such logs with other researchers, however, is that they pose potential privacy risks for the network users. Today, the common practice in sanitizing these logs before releasing them to the public is to anonymize users' sensitive information, such as their devices' MAC addresses and their exact association locations. In this work, we aim to study whether such sanitization measures are sufficient to protect user privacy. By simulating an adversary's role, we propose a novel type of correlation attack in which the adversary uses the anonymized association log to build signatures against each user, and when combined with auxiliary information, such signatures can help to identify users within the anonymized log. Using a user association log that contains more than four thousand users and millions of association records, we demonstrate that this attack technique, under certain circumstances, is able to pinpoint the victim's identity exactly with a probability as high as 70%, or narrow it down to a set of 20 candidates with a probability close to 100%.We further evaluate the effectiveness of standard anonymization techniques, including generalization and perturbation, in mitigating correlation attacks; our experimental results reveal only limited success of these methods, suggesting that more thorough treatment is needed when anonymizing wireless user association logs before public release.", "citation": "Citations (10)", "departments": ["Dartmouth College", "Los Alamos National Laboratory", "Dartmouth College", "Dartmouth College"], "authors": ["Keren Tan.....http://dblp.org/pers/hd/t/Tan:Keren", "Guanhua Yan.....http://dblp.org/pers/hd/y/Yan:Guanhua", "Jihwang Yeo.....http://dblp.org/pers/hd/y/Yeo:Jihwang", "David Kotz.....http://dblp.org/pers/hd/k/Kotz:David"], "conf": "infocom", "year": "2011", "pages": 5}