{"title": "Jackpine: A benchmark to evaluate spatial database performance.", "fields": ["spatial query", "benchmark", "geospatial analysis", "reverse geocoding", "spatial database"], "abstract": "The volume of spatial data generated and consumed is rising exponentially and new applications are emerging as the costs of storage, processing power and network bandwidth continue to decline. Database support for spatial operations is fast becoming a necessity rather than a niche feature provided by a few products. However, the spatial functionality offered by current commercial and open-source relational databases differs significantly in terms of available features, true geodetic support, spatial functions and indexing. Benchmarks play a crucial role in evaluating the functionality and performance of a particular database, both for application users and developers, and for the database developers themselves. In contrast to transaction processing, however, there is no standard, widely used benchmark for spatial database operations. In this paper, we present a spatial database benchmark called Jackpine. Our benchmark is portable (it can support any database with a JDBC driver implementation) and includes both micro benchmarks and macro workload scenarios. The micro benchmark component tests basic spatial operations in isolation; it consists of queries based on the Dimensionally Extended 9-intersection model of topological relations and queries based on spatial analysis functions. Each macro workload includes a series of queries that are based on a common spatial data application. These macro scenarios include map search and browsing, geocoding, reverse geocoding, flood risk analysis, land information management and toxic spill analysis. We use Jackpine to evaluate the spatial features in 2 open source databases and 1 commercial offering.", "citation": "Citations (55)", "departments": ["University of Toronto", "University of Toronto", "University of Toronto"], "authors": ["Suprio Ray.....http://dblp.org/pers/hd/r/Ray:Suprio", "Bogdan Simion.....http://dblp.org/pers/hd/s/Simion:Bogdan", "Angela Demke Brown.....http://dblp.org/pers/hd/b/Brown:Angela_Demke"], "conf": "icde", "year": "2011", "pages": 12}