{"title": "Heterogeneous Transfer Learning for Image Classification.", "fields": ["inductive transfer", "contextual image classification", "matrix decomposition", "social web", "multi task learning"], "abstract": "Transfer learning as a new machine learning paradigm has gained increasing attention lately. In situations where the training data in a target domain are not sufficient to learn predictive models effectively, transfer learning leverages auxiliary source data from other related source domains for learning. While most of the existing works in this area only focused on using the source data with the same structure as the target data, in this paper, we push this boundary further by proposing a heterogeneous transfer learning framework for knowledge transfer between text and images. We observe that for a target-domain classification problem, some annotated images can be found on many social Web sites, which can serve as a bridge to transfer knowledge from the abundant text documents available over the Web. A key question is how to effectively transfer the knowledge in the source data even though the text can be arbitrarily found. Our solution is to enrich the representation of the target images with semantic concepts extracted from the auxiliary source data through a novel matrix factorization method. By using the latent semantic features generated by the auxiliary data, we are able to build a better integrated image classifier. We empirically demonstrate the effectiveness of our algorithm on the Caltech-256 image dataset.", "citation": "Citations (155)", "departments": ["Hong Kong University of Science and Technology", "Shanghai Jiao Tong University", "Hong Kong University of Science and Technology", "Shanghai Jiao Tong University", "Institute for I ... xis, Singapore"], "authors": ["Yin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yin", "Yuqiang Chen.....http://dblp.org/pers/hd/c/Chen:Yuqiang", "Zhongqi Lu.....http://dblp.org/pers/hd/l/Lu:Zhongqi", "Sinno Jialin Pan.....http://dblp.org/pers/hd/p/Pan:Sinno_Jialin", "Gui-Rong Xue.....http://dblp.org/pers/hd/x/Xue:Gui=Rong", "Yong Yu.....http://dblp.org/pers/hd/y/Yu:Yong", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "aaai", "year": "2011", "pages": -1}