{"title": "A high-throughput routing metric for reliable multicast in multi-rate wireless mesh networks.", "fields": ["distance vector multicast routing protocol", "xcast", "ip multicast", "reliable multicast", "pragmatic general multicast"], "abstract": "We propose a routing metric for enabling high-throughput reliable multicast in multi-rate wireless mesh networks. This new multicast routing metric, called expected multicast transmission time (EMTT), captures the combined effects of 1) MAC-layer retransmission-based reliability, 2) transmission rate diversity, 3) wireless broadcast advantage, and 4) link quality awareness. The EMTT of one-hop transmission of a multicast packet minimizes the amount of expected transmission time (including that required for retransmissions). This is achieved by allowing the sender to adapt its bit-rate for each ongoing transmission/retransmission, optimized exclusively for its next-hop receivers that have not yet received the multicast packet. We model the rate adaptation process as a Markov decision process (MDP) and derive an efficient procedure for computing EMTT from the theory of MDP. We present receiver-initiated algorithms and describe protocol implementation for the EMTT-based multicast routing problem. Numerical results are presented to demonstrate the accuracy of the proposed algorithms against optimal solutions to the multicast routing problem. Simulation experiments confirm that, in comparison with single-rate multicast, multi-rate multicast using the EMTT metric effectively reduces the overall multicast transmission time while yielding higher packet delivery ratio and lower end-to-end latency.", "citation": "Citations (27)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "Singapore Management University", "University of New South Wales"], "authors": ["Xin Zhao.....http://dblp.org/pers/hd/z/Zhao_0002:Xin", "Jun Guo.....http://dblp.org/pers/hd/g/Guo_0001:Jun", "Chun Tung Chou.....http://dblp.org/pers/hd/c/Chou:Chun_Tung", "Archan Misra.....http://dblp.org/pers/hd/m/Misra:Archan", "Sanjay K. Jha.....http://dblp.org/pers/hd/j/Jha:Sanjay_K="], "conf": "infocom", "year": "2011", "pages": 9}