{"title": "BlueStreaming: towards power-efficient internet P2P streaming to mobile devices.", "fields": ["battery", "electrical efficiency", "upload", "streaming data", "bluetooth"], "abstract": "P2P streaming applications are very popular on the Internet today. However, a mobile device in P2P streaming not only needs to continuously receive streaming data from other peers for its playback, but also needs to continuously exchange control information (e.g., buffermaps and file chunk requests) with neighboring peers and upload the downloaded streaming data to them. These lead to excessive battery power consumption on the mobile device.   In this paper, we first conduct Internet experiments to study in-depth the impact of control traffic and uploading traffic on battery power consumption with several popular Internet P2P streaming applications. Motivated by measurement results, we design and implement a system called BlueStreaming that effectively utilizes the commonly existing Bluetooth interface on mobile devices. Instead of activating WiFi and Bluetooth interfaces alternatively, BlueStreaming keeps Bluetooth active all the time to transmit delay-sensitive control traffic while using WiFi for streaming data traffic. BlueStreaming trades Bluetooth's power consumption for much more significant energy saving from shaped WiFi traffic. To evaluate the performance of BlueStreaming, we have implemented prototypes on both Windows and Mac to access existing popular Internet P2P streaming services. The experimental results show that BlueStreaming can save up to 46% battery power compared to the commodity PSM scheme.", "citation": "Citations (23)", "departments": ["George Mason University", "George Mason University", "Microsoft", "Alcatel-Lucent", "George Mason University"], "authors": ["Yao Liu.....http://dblp.org/pers/hd/l/Liu_0001:Yao", "Fei Li.....http://dblp.org/pers/hd/l/Li_0001:Fei", "Lei Guo.....http://dblp.org/pers/hd/g/Guo_0004:Lei", "Yang Guo.....http://dblp.org/pers/hd/g/Guo:Yang", "Songqing Chen.....http://dblp.org/pers/hd/c/Chen:Songqing"], "conf": "mm", "year": "2011", "pages": 10}