{"title": "Hardware acceleration of transactional memory on commodity systems.", "fields": ["software transactional memory", "hardware acceleration", "transactional memory", "cpu cache", "speedup"], "abstract": "The adoption of transactional memory is hindered by the high overhead of software transactional memory and the intrusive design changes required by previously proposed TM hardware. We propose that hardware to accelerate software transactional memory (STM) can reside outside an unmodified commodity processor core, thereby substantially reducing implementation costs. This paper introduces Transactional Memory Acceleration using Commodity Cores (TMACC), a hardware-accelerated TM system that does not modify the processor, caches, or coherence protocol.   We present a complete hardware implementation of TMACC using a rapid prototyping platform. Using this hardware, we implement two unique conflict detection schemes which are accelerated using Bloom filters on an FPGA. These schemes employ novel techniques for tolerating the latency of fine-grained asynchronous communication with an out-of-core accelerator. We then conduct experiments to explore the feasibility of accelerating TM without modifying existing system hardware. We show that, for all but short transactions, it is not necessary to modify the processor to obtain substantial improvement in TM performance. In these cases, TMACC outperforms an STM by an average of 69% in applications using moderate-length transactions, showing maximum speedup within 8% of an upper bound on TM acceleration. Overall, we demonstrate that hardware can substantially accelerate the performance of an STM on unmodified commodity processors.", "citation": "Citations (19)", "year": "2011", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "conf": "asplos", "authors": ["Jared Casper.....http://dblp.org/pers/hd/c/Casper:Jared", "Tayo Oguntebi.....http://dblp.org/pers/hd/o/Oguntebi:Tayo", "Sungpack Hong.....http://dblp.org/pers/hd/h/Hong:Sungpack", "Nathan Grasso Bronson.....http://dblp.org/pers/hd/b/Bronson:Nathan_Grasso", "Christos Kozyrakis.....http://dblp.org/pers/hd/k/Kozyrakis:Christos", "Kunle Olukotun.....http://dblp.org/pers/hd/o/Olukotun:Kunle"], "pages": 12}