{"title": "An experimental analysis of the impact of Touch Screen Interaction techniques for 3-D positioning tasks.", "fields": ["realisation", "haptic technology", "perception", "simulation", "interaction technique"], "abstract": "The use of Touch Screen Interaction (TSI) for 3-D interaction entails both the addition of new haptic cues and the separation of the manipulation of the Degrees of Freedom (DoF) of the task: a 3 DoF task must be transformed into a 2-D+1-D task to be completed using a touch screen. In this paper, we investigate the impact of these two factors in the context of a 3-D positioning task. Our goal is to identify their respective influence on subjective preferences and performance measurements. To that purpose, we conducted an experimental comparison of five positioning techniques, isolating the influence of each of these two factors. The results we obtained suggest that the addition of haptic cues does not influence the user precision. However, the decomposition of the task has a strong influence on accuracy. More precisely, separating the manipulation of the depth dimension leads to an increased precision while isolating other dimensions does not influence the results. To explain this result, we realised a behavioural analysis of the data. This study suggests that the differences in the performance may be linked to the perceptual structure of the techniques. A technique isolating the manipulation of the depth seems to have a more adapted perceptual structure than a technique separating the height, even if those two dimensions are equally involved in the realisation of the task.", "citation": "Citations (5)", "departments": ["University of Strasbourg", "University of Strasbourg", "University of Strasbourg"], "authors": ["Manuel Veit.....http://dblp.org/pers/hd/v/Veit:Manuel", "Antonio Capobianco.....http://dblp.org/pers/hd/c/Capobianco:Antonio", "Dominique Bechmann.....http://dblp.org/pers/hd/b/Bechmann:Dominique"], "conf": "vr", "year": "2011", "pages": 8}