{"title": "Joint distributed access point selection and power allocation in cognitive radio networks.", "fields": ["spectral efficiency", "spectrum management", "cognitive radio", "non cooperative game", "telecommunications link"], "abstract": "Spectrum management has been identified as a crucial step towards enabling the technology of the cognitive radio network (CRN). Most of the current works dealing with spectrum management in the CRN focus on a single task of the problem, e.g., spectrum sensing, spectrum decision, spectrum sharing or spectrum mobility. In this work, we argue that for certain network configurations, jointly performing several tasks of the spectrum management improves the spectrum efficiency. Specifically, we study the uplink resource management problem in a CRN where there exist multiple cognitive users (CUs) and access points (APs), with each AP operates on a set of non-overlapping channels. The CUs, in order to maximize their uplink transmission rates, have to associate to a suitable AP (spectrum decision), and to share the channels belong to this AP with other CUs (spectrum sharing). These tasks are clearly interdependent, and the problem of how they should be carried out efficiently and distributedly is still open in the literature. In this work we formulate this joint spectrum decision and spectrum sharing problem into a non-cooperative game, in which the feasible strategy of a player contains a discrete variable and a continuous vector. The structure of the game is hence very different from most non-cooperative spectrum management game proposed in the literature. We provide characterization of the Nash Equilibrium (NE) of this game, and present a set of novel algorithms that allow the CUs to distributively and efficiently select the suitable AP and share the channels with other CUs. Finally, we study the properties of the proposed algorithms as well as their performance via extensive simulations.", "citation": "Citations (19)", "departments": ["University of Virginia", "University of Virginia", "University of Virginia"], "authors": ["Mingyi Hong.....http://dblp.org/pers/hd/h/Hong:Mingyi", "Alfredo García.....http://dblp.org/pers/hd/g/Garc=iacute=a:Alfredo", "Jorge Barrera.....http://dblp.org/pers/hd/b/Barrera:Jorge"], "conf": "infocom", "year": "2011", "pages": 9}