{"title": "Timing Analysis of a Protected Operating System Kernel.", "fields": ["virtual memory", "memory protection", "correctness", "software verification", "worst case execution time"], "abstract": "Operating systems offering virtual memory and protected address spaces have been an elusive target of static worst-case execution time (WCET) analysis. This is due to a combination of size, unstructured code and tight coupling with hardware. As a result, hard real-time systems are usually developed without memory protection, perhaps utilizing a lightweight real-time executive to provide OS abstractions. This paper presents a WCET analysis of seL4, a third-generation micro kernel. seL4 is the world's first formally-verified operating-system kernel, featuring machine-checked correctness proofs of its complete functionality. This makes seL4 an ideal platform for security-critical systems. Adding temporal guarantees makes seL4 also a compelling platform for safety- and timing-critical systems. It creates a foundation for integrating hard real-time systems with less critical time-sharing components on the same processor, supporting enhanced functionality while keeping hardware and development costs low. We believe this is one of the largest code bases on which a fully context-aware WCET analysis has been performed. This analysis is made possible due to the minimalistic nature of modern micro kernels, and properties of seL4's source code arising from the requirements of formal verification.", "citation": "Citations (37)", "year": "2011", "departments": ["University of New South Wales", "University of New South Wales", "National University of Singapore", "National University of Singapore", "University of New South Wales"], "conf": "rtss", "authors": ["Bernard Blackham.....http://dblp.org/pers/hd/b/Blackham:Bernard", "Yao Shi.....http://dblp.org/pers/hd/s/Shi:Yao", "Sudipta Chattopadhyay.....http://dblp.org/pers/hd/c/Chattopadhyay_0001:Sudipta", "Abhik Roychoudhury.....http://dblp.org/pers/hd/r/Roychoudhury:Abhik", "Gernot Heiser.....http://dblp.org/pers/hd/h/Heiser:Gernot"], "pages": 10}