{"title": "Exploiting Probabilistic Knowledge under Uncertain Sensing for Efficient Robot Behaviour.", "fields": ["probabilistic relational model", "information and computer science", "probabilistic logic", "robot", "machine learning"], "abstract": "Robots must perform tasks efficiently and reliably while acting under uncertainty. One way to achieve efficiency is to give the robot common-sense knowledge about the structure of the world. Reliable robot behaviour can be achieved by modelling the uncertainty in the world probabilistically. We present a robot system that combines these two approaches and demonstrate the improvements in efficiency and reliability that result. Our first contribution is a probabilistic relational model integrating common-sense knowledge about the world in general, with observations of a particular environment. Our second contribution is a continual planning system which is able to plan in the large problems posed by that model, by automatically switching between decision-theoretic and classical procedures. We evaluate our system on object search tasks in two different real-world indoor environments. By reasoning about the trade-offs between possible courses of action with different informational effects, and exploiting the cues and general structures of those environments, our robot is able to consistently demonstrate efficient and reliable goal-directed behaviour.", "citation": "Citations (64)", "year": "2011", "departments": ["University of Birmingham", "University of Birmingham", "University of Birmingham", "University of Birmingham", "University of Birmingham"], "conf": "ijcai", "authors": ["Marc Hanheide.....http://dblp.org/pers/hd/h/Hanheide:Marc", "Charles Gretton.....http://dblp.org/pers/hd/g/Gretton:Charles", "Richard Dearden.....http://dblp.org/pers/hd/d/Dearden:Richard", "Nick Hawes.....http://dblp.org/pers/hd/h/Hawes:Nick", "Jeremy L. Wyatt.....http://dblp.org/pers/hd/w/Wyatt:Jeremy_L=", "Andrzej Pronobis.....http://dblp.org/pers/hd/p/Pronobis:Andrzej", "Alper Aydemir.....http://dblp.org/pers/hd/a/Aydemir:Alper", "Moritz Göbelbecker.....http://dblp.org/pers/hd/g/G=ouml=belbecker:Moritz", "Hendrik Zender.....http://dblp.org/pers/hd/z/Zender:Hendrik"], "pages": 8}