{"title": "Every property of hyperfinite graphs is testable.", "fields": ["graph property", "degree", "forbidden graph characterization", "factor critical graph", "butterfly graph", "random regular graph", "universal graph"], "abstract": "A property testing algorithm for a property Π in the bounded degree graph model[7] is an algorithm that, given access to the adjacency list representation of a graph G=(V,E) with maximum degree at most d, accepts G with probability at least 2/3 if G has property Π, and rejects G with probability at least 2/3, if it differs on more than e dn edges from every d-degree bounded graph with property Π. A property is  testable , if for every e,d and n, there is a property testing algorithm A e,n,d  that makes at most q(e,d) queries to an input graph of n vertices, that is, a non-uniform algorithm that makes a number of queries that is independent of the graph size.   A k-disc around a vertex v of a graph G=(V,E) is the subgraph induced by all vertices of distance at most k from v. We show that the structure of a planar graph on large enough number of vertices, n, and with constant maximum degree d, is determined, up to the modification (insertion or deletion) of at most e d n edges, by the frequency of k-discs for certain k=k(e,d) that is independent of the size of the graph. We can replace planar graphs by any hyperfinite class of graphs, which includes, for example, every graph class that does not contain a set of forbidden minors.   We use this result to obtain new results and improve upon existing results in the area of property testing. In particular, we prove that graph isomorphism is testable for every class of hyperfinite graphs, every graph property is testable for every class of hyperfinite graphs, every hyperfinite graph property is testable in the bounded degree graph model, A large class of graph parameters is approximable for hyperfinite graphs.   Our results also give a partial explanation of the success of motifs in the analysis of complex networks.", "citation": "Citations (24)", "year": "2011", "departments": ["University of Haifa", "Technical University of Dortmund"], "conf": "stoc", "authors": ["Ilan Newman.....http://dblp.org/pers/hd/n/Newman:Ilan", "Christian Sohler.....http://dblp.org/pers/hd/s/Sohler:Christian"], "pages": 10}