{"title": "Intelligent management of virtualized resources for database systems in cloud environment.", "fields": ["human resource management system", "workload", "cloud database", "virtualization", "resource management system"], "abstract": "In a cloud computing environment, resources are shared among different clients. Intelligently managing and allocating resources among various clients is important for system providers, whose business model relies on managing the infrastructure resources in a cost-effective manner while satisfying the client service level agreements (SLAs). In this paper, we address the issue of how to intelligently manage the resources in a shared cloud database system and present SmartSLA, a cost-aware resource management system. SmartSLA consists of two main components: the system modeling module and the resource allocation decision module. The system modeling module uses machine learning techniques to learn a model that describes the potential profit margins for each client under different resource allocations. Based on the learned model, the resource allocation decision module dynamically adjusts the resource allocations in order to achieve the optimum profits. We evaluate SmartSLA by using the TPC-W benchmark with workload characteristics derived from real-life systems. The performance results indicate that SmartSLA can successfully compute predictive models under different hardware resource allocations, such as CPU and memory, as well as database specific resources, such as the number of replicas in the database systems. The experimental results also show that SmartSLA can provide intelligent service differentiation according to factors such as variable workloads, SLA levels, resource costs, and deliver improved profit margins.", "citation": "Citations (154)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "NEC Laboratorie ... , CA 95014, USA", "NEC Laboratorie ... , CA 95014, USA", "NEC Laboratorie ... , CA 95014, USA"], "authors": ["PengCheng Xiong.....http://dblp.org/pers/hd/x/Xiong:PengCheng", "Yun Chi.....http://dblp.org/pers/hd/c/Chi:Yun", "Shenghuo Zhu.....http://dblp.org/pers/hd/z/Zhu:Shenghuo", "Hyun Jin Moon.....http://dblp.org/pers/hd/m/Moon:Hyun_Jin", "Calton Pu.....http://dblp.org/pers/hd/p/Pu:Calton", "Hakan Hacigümüs.....http://dblp.org/pers/hd/h/Hacig=uuml=m=uuml=s:Hakan"], "conf": "icde", "year": "2011", "pages": 12}