{"title": "Landmark/image-based deformable registration of gene expression data.", "fields": ["landmark", "markov random field", "image registration", "image segmentation", "hamming space"], "abstract": "Analysis of gene expression patterns in brain images obtained from high-throughput in situ hybridization requires accurate and consistent annotations of anatomical regions/subregions. Such annotations are obtained by mapping an anatomical atlas onto the gene expression images through intensity- and/or landmark-based registration methods or deformable model-based segmentation methods. Due to the complex appearance of the gene expression images, these approaches require a pre-processing step to determine landmark correspondences in order to incorporate landmark-based geometric constraints. In this paper, we propose a novel method for landmark-constrained, intensity-based registration without determining landmark correspondences a priori. The proposed method performs dense image registration and identifies the landmark correspondences, simultaneously, using a single higher-order Markov Random Field model. In addition, a machine learning technique is used to improve the discriminating properties of local descriptors for landmark matching by projecting them in a Hamming space of lower dimension. We qualitatively show that our method achieves promising results and also compares well, quantitatively, with the expert's annotations, outperforming previous methods.", "citation": "Citations (15)", "year": "2011", "departments": ["University of Houston", "University of Houston", "University of Houston", "Pacific Northwest National Laboratory", "Washington University in St. Louis"], "conf": "cvpr", "authors": ["Uday Kurkure.....http://dblp.org/pers/hd/k/Kurkure:Uday", "Yen H. Le.....http://dblp.org/pers/hd/l/Le:Yen_H=", "Nikos Paragios.....http://dblp.org/pers/hd/p/Paragios:Nikos", "James P. Carson.....http://dblp.org/pers/hd/c/Carson:James_P=", "Tao Ju.....http://dblp.org/pers/hd/j/Ju:Tao", "Ioannis A. Kakadiaris.....http://dblp.org/pers/hd/k/Kakadiaris:Ioannis_A="], "pages": 8}