{"title": "Analysis and algorithms for partial protection in mesh networks.", "fields": ["heuristic", "destination sequenced distance vector routing", "order one network protocol", "grade of service", "multipath routing", "disjoint sets", "exact algorithm", "hazy sighted link state routing protocol", "mesh networking", "equal cost multi path routing"], "abstract": "This paper develops a novel mesh network protection scheme that guarantees a quantifiable minimum grade of service upon a failure within the network using multipath routing. Typically, networks fully guarantee service after a single-link failure, which is often an over-provisioning of resources to maintain essential traffic for the infrequent event of a failure. Our scheme guarantees that a fraction q of each demand remains after any single-link failure, at a fraction of the price of full protection. A linear program is developed to find the minimum-cost capacity allocation to meet both demand and protection requirements. For q≤12, an exact algorithmic solution for the minimum-cost routing and capacity allocation is developed using multiple shortest paths. For q>12, an algorithm is developed based on disjoint path routing that performs, on average, within 1.4% of optimal, and runs four orders of magnitude faster than the minimum-cost solution achieved via the linear program. Moreover, the partial protection strategies developed achieve reductions of up to 83% over traditional full protection schemes.", "citation": "Citations (11)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Greg Kuperman.....http://dblp.org/pers/hd/k/Kuperman:Greg", "Eytan Modiano.....http://dblp.org/pers/hd/m/Modiano:Eytan", "Aradhana Narula-Tam.....http://dblp.org/pers/hd/n/Narula=Tam:Aradhana"], "conf": "infocom", "year": "2011", "pages": 5}