{"title": "Safe and efficient supervised memory systems.", "fields": ["bittorrent tracker", "transactional memory", "memory model", "opensparc", "sequential consistency"], "abstract": "Supervised Memory systems use out-of-band metabits to control and monitor accesses to normal data memory for such purposes as transactional memory and memory typestate trackers. Previous proposals demonstrate the value of supervised memory systems, but have typically (1) assumed sequential consistency (while most deployed systems use weaker models), and (2) used ad hoc, informal memory specifications (that can be ambiguous and/or incorrect). This paper seeks to make many previous proposals more practical. This paper builds a foundation for future supervised memory systems which (1) operate with the TSO and ×86 memory models, and (2) are formally specified using two supervised memory models. The simpler TSO all  model requires all metadata and data accesses to obey TSO, but precludes using store buffers for supervised accesses. The more complex TSO data  model relaxes some ordering constraints (allowing store buffer use) but makes programmer reasoning more difficult. To get the benefits of both models, we propose Safe Supervision, which asks programmers to avoid using metabits from one location to order accesses to another. Programmers that obey safe supervision can reason with the simpler semantics of TSO all  while obtaining the higher performance of TSO data . Our approach is similar to how data-race-free programs can run on relaxed systems and yet appear sequentially consistent. Finally, we show that TSO data  can (a) provide significant performance benefit (up to 22%) over TSO all  and (b) can be incorporated correctly and with low overhead into the RTL of an industrial multi-core chip design (OpenSPARC T2).", "citation": "Citations (3)", "departments": ["Intel", "Polytechnic University of Catalonia", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Jayaram Bobba.....http://dblp.org/pers/hd/b/Bobba:Jayaram", "Marc Lupon.....http://dblp.org/pers/hd/l/Lupon:Marc", "Mark D. Hill.....http://dblp.org/pers/hd/h/Hill:Mark_D=", "David A. Wood.....http://dblp.org/pers/hd/w/Wood:David_A="], "conf": "hpca", "year": "2011", "pages": 12}