{"title": "FabScalar: composing synthesizable RTL designs of arbitrary cores within a canonical superscalar template.", "fields": ["implementation", "multi core processor", "microarchitecture", "register transfer level", "instructions per cycle"], "abstract": "A growing body of work has compiled a strong case for the single-ISA heterogeneous multi-core paradigm. A single-ISA heterogeneous multi-core provides multiple, differently-designed superscalar core types that can streamline the execution of diverse programs and program phases. No prior research has addressed the 'Achilles' heel of this paradigm: design and verification effort is multiplied by the number of different core types.   This work frames superscalar processors in a canonical form, so that it becomes feasible to quickly design many cores that differ in the three major superscalar dimensions: superscalar width, pipeline depth, and sizes of structures for extracting instruction-level parallelism (ILP). From this idea, we develop a toolset, called FabScalar, for automatically composing the synthesizable register-transfer-level (RTL) designs of arbitrary cores within a canonical superscalar template. The template defines canonical pipeline stages and interfaces among them. A Canonical Pipeline Stage Library (CPSL) provides many implementations of each canonical pipeline stage, that differ in their superscalar width and depth of sub-pipelining. An RTL generation tool uses the template and CPSL to automatically generate an overall core of desired configuration. Validation experiments are performed along three fronts to evaluate the quality of RTL designs generated by FabScalar: functional and performance (instructions-per-cycle (IPC)) validation, timing validation (cycle time), and confirmation of suitability for standard ASIC flows. With FabScalar, a chip with many different superscalar core types is conceivable.", "citation": "Citations (145)", "year": "2011", "departments": ["North Carolina State University", "North Carolina State University", "Intel", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "conf": "isca", "authors": ["Niket Kumar Choudhary.....http://dblp.org/pers/hd/c/Choudhary:Niket_Kumar", "Salil V. Wadhavkar.....http://dblp.org/pers/hd/w/Wadhavkar:Salil_V=", "Tanmay A. Shah.....http://dblp.org/pers/hd/s/Shah:Tanmay_A=", "Hiran Mayukh.....http://dblp.org/pers/hd/m/Mayukh:Hiran", "Jayneel Gandhi.....http://dblp.org/pers/hd/g/Gandhi:Jayneel", "Brandon H. Dwiel.....http://dblp.org/pers/hd/d/Dwiel:Brandon_H=", "Sandeep Navada.....http://dblp.org/pers/hd/n/Navada:Sandeep", "Hashem Hashemi Najaf-abadi.....http://dblp.org/pers/hd/n/Najaf=abadi:Hashem_Hashemi", "Eric Rotenberg.....http://dblp.org/pers/hd/r/Rotenberg:Eric"], "pages": 12}