{"title": "Contextual image search.", "fields": ["phrase search", "web query classification", "search analytics", "web search query", "concept search"], "abstract": "In this paper, we propose a novel image search scheme,  contextual image search . Different from conventional image search schemes that present a separate interface (e.g., text input box) to allow users to submit a query, the new search scheme enables users to search images by only masking a few words when they are reading through Web pages or other documents. Rather than merely making use of the explicit query input that is often not sufficient to express user's search intent, our approach explores the context information to better understand the search intent with two key steps: query augmenting and search results reranking using context, and expects to obtain better search results. Beyond contextual Web search, the context in our case is much richer and includes images besides texts. In addition to this type of search scheme, called  contextual image search with text input , we also present another type of scheme, called  contextual image search with image input , to allow users to select an image as the search query from Web pages or other documents they are reading. The key idea is to use the search-to-annotation technique and the contextual textual query mining scheme to determine the corresponding textual query, to finally get semantically similar search results. Experiments show that the proposed schemes make image search more convenient and the search results are more relevant to user intention.", "citation": "Citations (26)", "departments": ["Tsinghua University", "Microsoft", "Microsoft", "Tsinghua University", "Microsoft"], "authors": ["Wenhao Lu.....http://dblp.org/pers/hd/l/Lu:Wenhao", "Jingdong Wang.....http://dblp.org/pers/hd/w/Wang:Jingdong", "Xian-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Xian=Sheng", "Shengjin Wang.....http://dblp.org/pers/hd/w/Wang:Shengjin", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2011", "pages": 10}