{"title": "Combining Supervised and Unsupervised Models via Unconstrained Probabilistic Embedding.", "fields": ["ensemble learning", "generative grammar", "embedding problem", "probabilistic logic", "euclidean space", "embedding", "supervised learning"], "abstract": "In this study, we consider an ensemble problem in which we combine outputs coming from models developed in the supervised and unsupervised modes. By jointly considering the grouping results coming from unsupervised models we aim to improve the classification accuracy of supervised model ensemble. Here, we formulate the ensemble task as an Unconstrained Probabilistic Embedding (UPE) problem. Specifically, we assume both objects and classes/clusters have latent coordinates without constraints in a D-dimensional Euclidean space, and consider the mapping from the embedded space into the space of model results as a probabilistic generative process. A solution to this embedding can be obtained using the quasi-Newton method, which makes objects and classes/clusters with high co-occurrence weights are embedded close. Then, prediction is determined by taking the distances between the object and the classes in the embedded space. We demonstrate the benefits of this unconstrained embedding method by running extensive and systematic experiments on real-world datasets. Furthermore, we conduct experiments to investigate how the quality and the number of clustering models affect the performance of this ensemble method. We also show the robustness of the proposed model.", "citation": "Citations (9)", "year": "2011", "departments": ["Chinese Academy of Sciences", "Hewlett-Packard", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Hewlett-Packard", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "conf": "ijcai", "authors": ["Xudong Ma.....http://dblp.org/pers/hd/m/Ma:Xudong", "Ping Luo.....http://dblp.org/pers/hd/l/Luo_0001:Ping", "Fuzhen Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Fuzhen", "Qing He.....http://dblp.org/pers/hd/h/He:Qing", "Zhongzhi Shi.....http://dblp.org/pers/hd/s/Shi:Zhongzhi", "Zhiyong Shen.....http://dblp.org/pers/hd/s/Shen:Zhiyong"], "pages": 6}