{"title": "History slicing.", "fields": ["social science", "religious order", "source lines of code", "aerial photography", "politics", "software feature", "publishing", "humanities", "program slicing", "order of magnitude", "computer vision", "cavalieri s principle", "literature", "performance art", "slicing", "digital image", "law", "canon law", "diaspora", "gender studies", "demography", "archaeology", "silence", "history"], "abstract": "To perform a number of tasks such as inferring design rationale from past code changes or assessing developer expertise for a software feature or bug, the evolution of a set of lines of code can be assessed by mining software histories. However, determining the evolution of a set of lines of code is a manual and time consuming process. This paper presents a model of this process and an approach for automating it. We call this process History Slicing. We describe the process and options for generating a graph that links every line of code with its corresponding previous revision through the history of the software project. We then explain the method and options for utilizing this graph to determine the exact revisions that contain changes for the lines of interest and their exact position in each revision. Finally, we present some preliminary results which show initial evidence that our automated technique can be several orders of magnitude faster than the manual approach and require that developers examine up to two orders of magnitude less code in extracting such histories.", "citation": "Not cited", "departments": ["University of California, Irvine", "University of California, Irvine", "University of Maine", "University of Tasmania", "University of Missouri", "University of Missouri", "University of Missouri", "University of Missouri", "University of Missouri"], "authors": ["Francisco Servant.....http://dblp.org/pers/hd/s/Servant:Francisco", "James A. Jones.....http://dblp.org/pers/hd/j/Jones:James_A="], "conf": "kbse", "year": "2011", "pages": 4}