{"title": "NV-Heaps: making persistent objects fast and safe with next-generation, non-volatile memories.", "fields": ["pointer", "dangling pointer", "volatile", "thread", "persistent data structure"], "abstract": "Persistent, user-defined objects present an attractive abstraction for working with non-volatile program state. However, the slow speed of persistent storage (i.e., disk) has restricted their design and limited their performance. Fast, byte-addressable, non-volatile technologies, such as phase change memory, will remove this constraint and allow programmers to build high-performance, persistent data structures in non-volatile storage that is almost as fast as DRAM. Creating these data structures requires a system that is lightweight enough to expose the performance of the underlying memories but also ensures safety in the presence of application and system failures by avoiding familiar bugs such as dangling pointers, multiple free()s, and locking errors. In addition, the system must prevent new types of hard-to-find pointer safety bugs that only arise with persistent objects. These bugs are especially dangerous since any corruption they cause will be permanent.   We have implemented a lightweight, high-performance persistent object system called NV-heaps that provides transactional semantics while preventing these errors and providing a model for persistence that is easy to use and reason about. We implement search trees, hash tables, sparse graphs, and arrays using NV-heaps, BerkeleyDB, and Stasis. Our results show that NV-heap performance scales with thread count and that data structures implemented using NV-heaps out-perform BerkeleyDB and Stasis implementations by 32x and 244x, respectively, by avoiding the operating system and minimizing other software overheads. We also quantify the cost of enforcing the safety guarantees that NV-heaps provide and measure the costs of NV-heap primitive operations.", "citation": "Citations (465)", "year": "2011", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "asplos", "authors": ["Joel Coburn.....http://dblp.org/pers/hd/c/Coburn:Joel", "Adrian M. Caulfield.....http://dblp.org/pers/hd/c/Caulfield:Adrian_M=", "Ameen Akel.....http://dblp.org/pers/hd/a/Akel:Ameen", "Laura M. Grupp.....http://dblp.org/pers/hd/g/Grupp:Laura_M=", "Rajesh K. Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Rajesh_K=", "Ranjit Jhala.....http://dblp.org/pers/hd/j/Jhala:Ranjit", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "pages": 14}