{"title": "Spectral Methods for Learning Multivariate Latent Tree Structure.", "fields": ["tree structure", "order statistic tree", "joint probability distribution", "latent variable", "graphical model"], "abstract": "This work considers the problem of learning the structure of multivariate linear tree models, which include a variety of directed tree graphical models with continuous, discrete, and mixed latent variables such as linear-Gaussian models, hidden Markov models, Gaussian mixture models, and Markov evolutionary trees. The setting is one where we only have samples from certain observed variables in the tree, and our goal is to estimate the tree structure (i.e., the graph of how the underlying hidden variables are connected to each other and to the observed variables). We propose the Spectral Recursive Grouping algorithm, an efficient and simple bottom-up procedure for recovering the tree structure from independent samples of the observed variables. Our finite sample size bounds for exact recovery of the tree structure reveal certain natural dependencies on underlying statistical and structural properties of the underlying joint distribution. Furthermore, our sample complexity guarantees have no explicit dependence on the dimensionality of the observed variables, making the algorithm applicable to many high-dimensional settings. At the heart of our algorithm is a spectral quartet test for determining the relative topology of a quartet of variables from second-order statistics.", "citation": "Citations (33)", "departments": ["University of California, Irvine", "University of California, San Diego", "Microsoft", "University of Pennsylvania", "Carnegie Mellon University"], "authors": ["Animashree Anandkumar.....http://dblp.org/pers/hd/a/Anandkumar:Animashree", "Kamalika Chaudhuri.....http://dblp.org/pers/hd/c/Chaudhuri:Kamalika", "Daniel J. Hsu.....http://dblp.org/pers/hd/h/Hsu:Daniel_J=", "Sham M. Kakade.....http://dblp.org/pers/hd/k/Kakade:Sham_M=", "Le Song.....http://dblp.org/pers/hd/s/Song:Le", "Tong Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Tong"], "conf": "nips", "year": "2011", "pages": 9}