{"title": "Creating personalized memories from social events: community-based support for multi-camera recordings of school concerts.", "fields": ["social circle", "video editing", "social media optimization", "upload", "mashup"], "abstract": "The wide availability of relatively high-quality cameras makes it easy for many users to capture video fragments of social events such as concerts, sports events or community gatherings. The wide availability of simple sharing tools makes it nearly as easy to upload individual fragments to on-line video sites. Current work on video mashups focuses on the creation of a video summary based on the characteristics of individual media fragments, but it fails to address the interpersonal relationships and time-variant social context within a community of diverse (but related) users. The aim of this paper is to reformulate the research problem of video authoring, by investigating the social relationships of the media 'authors' relative to the performers. Based on a 10-month evaluation process, we specify a set of guidelines for the design and implementation of socially-aware video editing and sharing tools. Our contributions have been realized and evaluated in a prototype software that enables community-based users to navigate through a large common content space and to generate highly personalized video compilations of targeted interest within a social circle. According to the results, a system like ours is a valid alternative for social interactions when apart. We hope that our insights can stimulate future research on socially-aware multimedia tools and applications.", "citation": "Citations (16)", "departments": ["Centrum Wiskunde & Informatica", "Centrum Wiskunde & Informatica", "Centrum Wiskunde & Informatica", "Goldsmiths, University of London", "BT Research"], "authors": ["Rodrigo Laiola Guimarães.....http://dblp.org/pers/hd/g/Guimar=atilde=es:Rodrigo_Laiola", "Pablo César.....http://dblp.org/pers/hd/c/C=eacute=sar:Pablo", "Dick C. A. Bulterman.....http://dblp.org/pers/hd/b/Bulterman:Dick_C=_A=", "Vilmos Zsombori.....http://dblp.org/pers/hd/z/Zsombori:Vilmos", "Ian Kegel.....http://dblp.org/pers/hd/k/Kegel:Ian"], "conf": "mm", "year": "2011", "pages": 10}