{"title": "Dense one-shot 3D reconstruction by detecting continuous regions with parallel line projection.", "fields": ["epipolar geometry", "object detection", "grid", "parallel", "3d reconstruction"], "abstract": "3D scanning of moving objects has many applications, for example, marker-less motion capture, analysis on fluid dynamics, object explosion and so on. One of the approach to acquire accurate shape is a projector-camera system, especially the methods that reconstructs a shape by using a single image with static pattern is suitable for capturing fast moving object. In this paper, we propose a method that uses a grid pattern consisting of sets of parallel lines. The pattern is spatially encoded by a periodic color pattern. While informations are sparse in the camera image, the proposed method extracts the dense (pixel-wise) phase informations from the sparse pattern. As the result, continuous regions in the camera images can be extracted by analyzing the phase. Since there remain one DOF for each region, we propose the linear solution to eliminate the DOF by using geometric informations of the devices, i.e. epipolar constraint. In addition, solution space is finite because projected pattern consists of parallel lines with same intervals, the linear equation can be efficiently solved by integer least square method. In this paper, the formulations for both single and multiple projectors are presented. We evaluated the accuracy of correspondences and showed the comparison with respect to the number of projectors by simulation. Finally, the dense 3D reconstruction of moving objects are presented in the experiments.", "citation": "Citations (53)", "year": "2011", "departments": ["National Institute of Advanced Industrial Science and Technology", "Kagoshima University", "Kagoshima University", "Hiroshima City University"], "conf": "iccv", "authors": ["Ryusuke Sagawa.....http://dblp.org/pers/hd/s/Sagawa:Ryusuke", "Hiroshi Kawasaki.....http://dblp.org/pers/hd/k/Kawasaki:Hiroshi", "Shota Kiyota.....http://dblp.org/pers/hd/k/Kiyota:Shota", "Ryo Furukawa.....http://dblp.org/pers/hd/f/Furukawa:Ryo"], "pages": 8}