{"title": "Flicker effects in adaptive video streaming to handheld devices.", "fields": ["subjective video quality", "network packet", "flicker", "deflicking", "video quality"], "abstract": "Streaming video over the Internet requires mechanisms that limit the streams' bandwidth consumption within its fair share. TCP streaming guarantees this and provides lossless streaming as a side-effect. Adaptation by packet drop does not occur in the network, and excessive startup latency and stalling must be prevented by adapting the bandwidth consumption of the video itself. However, when the adaptation is performed during an ongoing session, it may influence the perceived quality of the entire video and result in improved or reduced visual quality of experience. We have investigated visual artifacts that are caused by adaptive layer switching -- we call them  flicker effects  -- and present our results for handheld devices in this paper. We considered three types of flicker, namely noise, blur and motion flicker. The perceptual impact of flicker is explored through subjective assessments. We vary both the intensity of quality changes ( amplitude ) and the number of quality changes per second ( frequency ). Users' ability to detect and their acceptance of variations in the amplitudes and frequencies of the quality changes are explored across four content types. Our results indicate that multiple factors influence the acceptance of different quality variations. Amplitude plays the dominant role in delivering satisfactory video quality, while frequency can also be adjusted to relieve the annoyance of flicker artifacts.", "citation": "Citations (94)", "departments": ["Simula Research Laboratory", "Simula Research Laboratory", "Simula Research Laboratory", "Simula Research Laboratory", "Simula Research Laboratory"], "authors": ["Pengpeng Ni.....http://dblp.org/pers/hd/n/Ni:Pengpeng", "Ragnhild Eg.....http://dblp.org/pers/hd/e/Eg:Ragnhild", "Alexander Eichhorn.....http://dblp.org/pers/hd/e/Eichhorn:Alexander", "Carsten Griwodz.....http://dblp.org/pers/hd/g/Griwodz:Carsten", "Pål Halvorsen.....http://dblp.org/pers/hd/h/Halvorsen:P=aring=l"], "conf": "mm", "year": "2011", "pages": 10}