{"title": "A mobile interactive robot for gathering structured social video.", "fields": ["mobile interaction", "clips", "movie theater", "social robot", "dialog box"], "abstract": "Documentaries are typically captured in a very structured way, using teams to film and interview people. We developed an autonomous method for capturing structured cinema verite style documentaries through an interactive robotic camera, which was used as a mobile physical agent to facilitate interaction and story gathering within a ubiquitous media framework. We sent this robot out to autonomously gather human narrative about its environment. The robot had a specific story capture goal and leveraged humans to attain that goal. The robot collected a 1st person view of stories unfolding in real life, and as it engaged with its subjects via a preset dialog, these media clips were intrinsically structured. We evaluated this agent by way of determining \"complete\" vs. \"incomplete\" interactions. \"Complete\" interactions were those that generated viable and interesting videos, which could be edited together into a larger narrative. It was found that 30% of the interactions captured were \"complete\" interactions. Our results suggested that changes in the system would only produce incrementally more \"complete\" interactions, as external factors like natural bias or busyness of the user come into play. The types of users who encountered the robot were fairly polar; either they wanted to interact or did not - very few partial interactions went on for more than 1 minute. Users who partially interacted with the robot were found to treat it rougher than those who completed the full interaction. It was also determined that this type of limited-interaction system is best suited for short-term encounters. At the end of the study, a short cinema verite documentary showcasing the people and activity in our building was easily produced from the structured videos that were captured, indicating the utility of this approach.", "citation": "Citations (2)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Alexander Reben.....http://dblp.org/pers/hd/r/Reben:Alexander", "Joseph A. Paradiso.....http://dblp.org/pers/hd/p/Paradiso:Joseph_A="], "conf": "mm", "year": "2011", "pages": 4}