{"title": "A novel probabilistic pruning approach to speed up similarity queries in uncertain databases.", "fields": ["uncertain data", "probabilistic database", "probabilistic ctl", "correctness", "nearest neighbor search"], "abstract": "In this paper, we propose a novel, effective and efficient probabilistic pruning criterion for probabilistic similarity queries on uncertain data. Our approach supports a general uncertainty model using continuous probabilistic density functions to describe the (possibly correlated) uncertain attributes of objects. In a nutshell, the problem to be solved is to compute the PDF of the random variable denoted by the probabilistic domination count: Given an uncertain database object B, an uncertain reference object R and a set D of uncertain database objects in a multi-dimensional space, the probabilistic domination count denotes the number of uncertain objects in D that are closer to R than B. This domination count can be used to answer a wide range of probabilistic similarity queries. Specifically, we propose a novel geometric pruning filter and introduce an iterative filter-refinement strategy for conservatively and progressively estimating the probabilistic domination count in an efficient way while keeping correctness according to the possible world semantics. In an experimental evaluation, we show that our proposed technique allows to acquire tight probability bounds for the probabilistic domination count quickly, even for large uncertain databases.", "citation": "Citations (25)", "departments": ["Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "Ludwig Maximilian University of Munich", "University of Hong Kong", "Ludwig Maximilian University of Munich"], "authors": ["Thomas Bernecker.....http://dblp.org/pers/hd/b/Bernecker:Thomas", "Tobias Emrich.....http://dblp.org/pers/hd/e/Emrich:Tobias", "Hans-Peter Kriegel.....http://dblp.org/pers/hd/k/Kriegel:Hans=Peter", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos", "Matthias Renz.....http://dblp.org/pers/hd/r/Renz:Matthias", "Andreas Züfle.....http://dblp.org/pers/hd/z/Z=uuml=fle:Andreas"], "conf": "icde", "year": "2011", "pages": 12}