{"title": "From jammer to gambler: Modeling and detection of jamming attacks against time-critical traffic.", "fields": ["near far problem", "network packet", "jamming", "phenomenon", "smart grid"], "abstract": "Time-critical wireless applications in emerging network systems, such as e-healthcare and smart grids, have been drawing increasing attention in both industry and academia. The broadcast nature of wireless channels unavoidably exposes such applications to jamming attacks. However, existing methods to characterize and detect jamming attacks cannot be applied directly to time-critical networks, whose communication traffic model differs from conventional models. In this paper, we aim at modeling and detecting jamming attacks against time-critical traffic. We introduce a new metric, message invalidation ratio, to quantify the performance of time-critical applications. A key insight that leads to our modeling is that the behavior of a jammer who attempts to disrupt the delivery of a time-critical message can be exactly mapped to the behavior of a gambler who tends to win a gambling game. We show via the gambling-based modeling and real-time experiments that there in general exists a phase transition phenomenon for a time-critical application under jamming attacks: as the probability that a packet is jammed increases from 0 to 1, the message invalidation ratio first increases slightly (even negligibly), then increases dramatically to 1. Based on analytical and experimental results, we further design and implement the JADE (Jamming Attack Detection based on Estimation) system to achieve efficient and robust jamming detection for time-critical wireless networks.", "citation": "Citations (31)", "departments": ["North Carolina State University", "North Carolina State University", "Research Triangle Park"], "authors": ["Zhuo Lu.....http://dblp.org/pers/hd/l/Lu:Zhuo", "Wenye Wang.....http://dblp.org/pers/hd/w/Wang:Wenye", "Cliff Wang.....http://dblp.org/pers/hd/w/Wang:Cliff"], "conf": "infocom", "year": "2011", "pages": 9}