{"title": "Multi-core Real-Time Scheduling for Generalized Parallel Task Models.", "fields": ["thread", "multi core processor", "single core", "directed acyclic graph", "task parallelism", "deadline monotonic scheduling", "multiprocessor scheduling", "multiprocessing"], "abstract": "Multi-core processors offer a significant performance increase over single-core processors. They have the potential to enable computation-intensive real-time applications with stringent timing constraints that cannot be met on traditional single-core processors. However, most results in traditional multiprocessor real-time scheduling are limited to sequential programming models and ignore intra-task parallelism. In this paper, we address the problem of scheduling periodic parallel tasks with implicit deadlines on multi-core processors. We first consider a synchronous task model where each task consists of segments, each segment having an arbitrary number of parallel threads that synchronize at the end of the segment. We propose a new task decomposition method that decomposes each parallel task into a set of sequential tasks. We prove that our task decomposition achieves a resource augmentation bound of 4 and 5 when the decomposed tasks are scheduled using global EDF and partitioned deadline monotonic scheduling, respectively. Finally, we extend our analysis to a directed acyclic graph (DAG) task model where each node in the DAG has a unit execution requirement. We show how these tasks can be converted into synchronous tasks such that the same decomposition can be applied and the same augmentation bounds hold. Simulations based on synthetic workload demonstrate that the derived resource augmentation bounds are safe and sufficient.", "citation": "Citations (236)", "year": "2011", "departments": ["Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis"], "conf": "rtss", "authors": ["Abusayeed Saifullah.....http://dblp.org/pers/hd/s/Saifullah:Abusayeed", "Kunal Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Kunal", "Chenyang Lu.....http://dblp.org/pers/hd/l/Lu:Chenyang", "Christopher D. Gill.....http://dblp.org/pers/hd/g/Gill:Christopher_D="], "pages": 10}