{"title": "Market Manipulation with Outside Incentives.", "fields": ["market manipulation", "prediction market", "distrust", "market impact", "nonmarket forces"], "abstract": "Much evidence has shown that prediction markets can effectively aggregate dispersed information about uncertain future events and produce remarkably accurate forecasts. However, if the market prediction will be used for decision making, a strategic participant with a vested interest in the decision outcome may manipulate the market prediction to influence the resulting decision. The presence of such incentives outside of the market would seem to damage the market's ability to aggregate information because of the potential distrust among market participants. While this is true under some conditions, we show that, if the existence of such incentives is certain and common knowledge, in many cases, there exist separating equilibria where each participant changes the market probability to different values given different private signals and information is fully aggregated in the market. At each separating equilibrium, the participant with outside incentives makes a costly move to gain trust from other participants. While there also exist pooling equilibria where a participant changes the market probability to the same value given different private signals and information loss occurs, we give evidence suggesting that two separating equilibria are more natural and desirable than many other equilibria of this game by considering domination-based belief refinement, social welfare, and the expected payoff of either participant in the game. When the existence of outside incentives is uncertain, however, trust cannot be established between players if the outside incentive is sufficiently large and we lose the separability at equilibria.", "citation": "Citations (16)", "departments": ["Harvard University", "Harvard University", "Microsoft", "Analytics Opera ... g, Boston, USA"], "authors": ["Yiling Chen.....http://dblp.org/pers/hd/c/Chen:Yiling", "Xi Alice Gao.....http://dblp.org/pers/hd/g/Gao:Xi_Alice", "Rick Goldstein.....http://dblp.org/pers/hd/g/Goldstein:Rick", "Ian A. Kash.....http://dblp.org/pers/hd/k/Kash:Ian_A="], "conf": "aaai", "year": "2011", "pages": -1}