{"title": "A selective spatio-temporal interest point detector for human action recognition in complex scenes.", "fields": ["contextual image classification", "categorization", "vocabulary", "bag of words model in computer vision", "surround suppression"], "abstract": "Recent progress in the field of human action recognition points towards the use of Spatio-Temporal Interest Points (STIPs) for local descriptor-based recognition strategies. In this paper we present a new approach for STIP detection by applying surround suppression combined with local and temporal constraints. Our method is significantly different from existing STIP detectors and improves the performance by detecting more repeatable, stable and distinctive STIPs for human actors, while suppressing unwanted background STIPs. For action representation we use a bag-of-visual words (BoV) model of local N-jet features to build a vocabulary of visual-words. To this end, we introduce a novel vocabulary building strategy by combining spatial pyramid and vocabulary compression techniques, resulting in improved performance and efficiency. Action class specific Support Vector Machine (SVM) classifiers are trained for categorization of human actions. A comprehensive set of experiments on existing benchmark datasets, and more challenging datasets of complex scenes, validate our approach and show state-of-the-art performance.", "citation": "Citations (28)", "year": "2011", "departments": ["Autonomous University of Barcelona", "MediaTech Institute", "MediaTech Institute", "Autonomous University of Barcelona", "Autonomous University of Barcelona"], "conf": "iccv", "authors": ["Bhaskar Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Bhaskar", "Michael B. Holte.....http://dblp.org/pers/hd/h/Holte:Michael_B=", "Thomas B. Moeslund.....http://dblp.org/pers/hd/m/Moeslund:Thomas_B=", "Jordi Gonzàlez.....http://dblp.org/pers/hd/g/Gonz=agrave=lez_0001:Jordi", "F. Xavier Roca.....http://dblp.org/pers/hd/r/Roca:F=_Xavier"], "pages": 8}