{"title": "Achieving uniform performance and maximizing throughput in the presence of heterogeneity.", "fields": ["scaling", "throughput", "firmware", "multi core processor", "process variation"], "abstract": "Continued scaling of process technologies is critical to sustaining improvements in processor frequencies and performance. However, shrinking process technologies exacerbates process variations — the deviation of process parameters from their target specifications. In the context of multi-core CMPs, which are implemented to feature homogeneous cores, within-die process variations result in substantially different core frequencies. Exposing such process-variation induced heterogeneity interferes with the norm of marketing chips at a single frequency. Further, application performance is undesirably dictated by the frequency of the core it is running on. To work around these challenges, a single uniform frequency, dictated by the slowest core, is currently chosen as the chip frequency sacrificing the increased performance capabilities of cores that could operate at higher frequencies. In this paper, we propose choosing the mean frequency across all cores, in lieu of the minimum frequency, as the single-frequency to use as the chip sales frequency. We examine several scheduling algorithms implemented below the O/S in hardware/firmware that guarantee minimum application performance near that of the average frequency, by masking process-variation induced heterogeneity from the end-user. We show that our Throughput-Driven Fairness (TDF) scheduling policy improves throughput by an average of 12% compared to a naive fairness scheme (round-robin) for frequency-sensitive applications. At the same time, TDF allows 98% of chips to maintain minimum performance at or above 90% of that expected at the mean frequency, providing a single uniform performance level to present for the chip.", "citation": "Citations (25)", "departments": ["Harvard University", "Intel", "Harvard University", "Harvard University"], "authors": ["Krishna K. Rangan.....http://dblp.org/pers/hd/r/Rangan:Krishna_K=", "Michael D. Powell.....http://dblp.org/pers/hd/p/Powell:Michael_D=", "Gu-Yeon Wei.....http://dblp.org/pers/hd/w/Wei:Gu=Yeon", "David M. Brooks.....http://dblp.org/pers/hd/b/Brooks:David_M="], "conf": "hpca", "year": "2011", "pages": 12}