{"title": "A case study in a recommender system based on purchase data.", "fields": ["domain knowledge", "recommender system", "supply chain", "collaborative filtering", "machine learning"], "abstract": "Collaborative filtering has been extensively studied in the context of ratings prediction. However, industrial recommender systems often aim at predicting a few items of immediate interest to the user, typically products that (s)he is likely to buy in the near future. In a collaborative filtering setting, the prediction may be based on the user's purchase history rather than rating information, which may be unreliable or unavailable. In this paper, we present an experimental evaluation of various collaborative filtering algorithms on a real-world dataset of purchase history from customers in a store of a French home improvement and building supplies chain. These experiments are part of the development of a prototype recommender system for salespeople in the store. We show how different settings for training and applying the models, as well as the introduction of domain knowledge may dramatically influence both the absolute and the relative performances of the different algorithms. To the best of our knowledge, the influence of these parameters on the quality of the predictions of recommender systems has rarely been reported in the literature.", "citation": "Citations (17)", "departments": ["Pierre-and-Marie-Curie University", "KXEN Inc.", "Institut national des sciences appliquées de Rouen", "University of Paris", "University of Paris"], "authors": ["Bruno Pradel.....http://dblp.org/pers/hd/p/Pradel:Bruno", "Savaneary Sean.....http://dblp.org/pers/hd/s/Sean:Savaneary", "Julien Delporte.....http://dblp.org/pers/hd/d/Delporte:Julien", "Sébastien Guérif.....http://dblp.org/pers/hd/g/Gu=eacute=rif:S=eacute=bastien", "Céline Rouveirol.....http://dblp.org/pers/hd/r/Rouveirol:C=eacute=line", "Nicolas Usunier.....http://dblp.org/pers/hd/u/Usunier:Nicolas", "Françoise Fogelman-Soulié.....http://dblp.org/pers/hd/f/Fogelman=Souli=eacute=:Fran=ccedil=oise", "Frédéric Dufau-Joël.....http://dblp.org/pers/hd/d/Dufau=Jo=euml=l:Fr=eacute=d=eacute=ric"], "conf": "kdd", "year": "2011", "pages": 9}