{"title": "CoDine: an interactive multi-sensory system for remote dining.", "fields": ["human computer interaction", "interactive media", "multimedia", "computer science", "gesture"], "abstract": "The pervasiveness of computing has extended into domestic realms, including the dining room. Beyond simply a place to consume food, the dining room is a social hub where family members meet and share experiences. Yet busy lifestyles can make it difficult to spend social time with your family. To provide a new solution for family bonding, this paper presents the CoDine system, a dining table embedded with interactive subsystems that augment and transport the experience of communal family dining to create a sense of coexistence among remote family members. CoDine connects people in different locations through shared dining activities: gesture-based screen interaction, mutual food serving, ambient pictures on an animated tablecloth, and the transportation of edible messages. Rather than focusing on functionality or efficiency, CoDine aims to provide people with an engaging interactive dining experience through enriched multi-sensory communication.", "citation": "Citations (34)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Keio University", "National University of Singapore"], "authors": ["Jun Wei.....http://dblp.org/pers/hd/w/Wei:Jun", "Xuan Wang.....http://dblp.org/pers/hd/w/Wang:Xuan", "Roshan Lalintha Peiris.....http://dblp.org/pers/hd/p/Peiris:Roshan_Lalintha", "Yongsoon Choi.....http://dblp.org/pers/hd/c/Choi:Yongsoon", "Xavier Roman Martinez.....http://dblp.org/pers/hd/m/Martinez:Xavier_Roman", "Remi Tache.....http://dblp.org/pers/hd/t/Tache:Remi", "Jeffrey Tzu Kwan Valino Koh.....http://dblp.org/pers/hd/k/Koh:Jeffrey_Tzu_Kwan_Valino", "Veronica Halupka.....http://dblp.org/pers/hd/h/Halupka:Veronica", "Adrian David Cheok.....http://dblp.org/pers/hd/c/Cheok:Adrian_David"], "conf": "huc", "year": "2011", "pages": 10}