{"title": "SafeSlice: a model slicing and design safety inspection tool for SysML.", "fields": ["software design", "slicing", "probabilistic design", "systems modeling language", "structured analysis"], "abstract": "Software safety certification involves checking that the software design meets the (software) safety requirements. In practice, inspections are one of the primary vehicles for ensuring that safety requirements are satisfied by the design. Unless the safety-related aspects of the design are clearly delineated, the inspections conducted by safety assessors would have to consider the entire design, although only small fragments of the design may be related to safety. In a model-driven development context, this means that the assessors have to browse through large models, understand them, and identify the safety-related fragments. This is time-consuming and error-prone, specially noting that the assessors are often third-party regulatory bodies who were not involved in the design. To address this problem, we describe in this paper a prototype tool called, SafeSlice, that enables one to automatically extract the safety-related slices (fragments) of design models. The main enabler for our slicing technique is the traceability between the safety requirements and the design, established by following a structured design methodology that we propose. Our work is grounded on SysML, which is being increasingly used for expressing the design of safety-critical systems. We have validated our work through two case studies and a control experiment which we briefly outline in the paper.", "citation": "Citations (14)", "departments": ["University of Rome Tor Vergata", "University of Rome Tor Vergata", "Simula Research ... b, Oslo, Norway", "Simula Research ... b, Oslo, Norway", "Simula Research ... b, Oslo, Norway"], "authors": ["Davide Falessi.....http://dblp.org/pers/hd/f/Falessi:Davide", "Shiva Nejati.....http://dblp.org/pers/hd/n/Nejati:Shiva", "Mehrdad Sabetzadeh.....http://dblp.org/pers/hd/s/Sabetzadeh:Mehrdad", "Lionel C. Briand.....http://dblp.org/pers/hd/b/Briand:Lionel_C=", "Antonio Messina.....http://dblp.org/pers/hd/m/Messina:Antonio"], "conf": "sigsoft", "year": "2011", "pages": 4}