{"title": "Learning from Natural Instructions.", "fields": ["inductive transfer", "instance based learning", "robot learning", "algorithmic learning theory", "multi task learning"], "abstract": "Machine learning is traditionally formalized and researched as the study of learning concepts and decision functions from labeled examples, requiring a representation that encodes information about the domain of the decision function to be learned. We are interested in providing a way for a human teacher to interact with an automated learner using natural instructions, thus allowing the teacher to communicate the relevant domain expertise to the learner without necessarily knowing anything about the internal representations used in the learning process.\n\nIn this paper we suggest to view the process of learning a decision function as a natural language lesson interpretation problem instead of learning from labeled examples. This interpretation of machine learning is motivated by human learning processes, in which the learner is given a lesson describing the target concept directly, and a few instances exemplifying it. We introduce a learning algorithm for the lesson interpretation problem that gets feedback from its performance on the final task, while learning jointly (1) how to interpret the lesson and (2) how to use this interpretation to do well on the final task. This approach alleviates the supervision burden of traditional machine learning by focusing on supplying the learner with only human-level task expertise for learning.\n\nWe evaluate our approach by applying it to the rules of the Freecell solitaire card game. We show that our learning approach can eventually use natural language instructions to learn the target concept and play the game legally. Furthermore, we show that the learned semantic interpreter also generalizes to previously unseen instructions.", "citation": "Citations (74)", "year": "2011", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "ijcai", "authors": ["Dan Goldwasser.....http://dblp.org/pers/hd/g/Goldwasser:Dan", "Dan Roth.....http://dblp.org/pers/hd/r/Roth:Dan"], "pages": 7}