{"title": "The last minute: Efficient Data Evacuation strategy for sensor networks in post-disaster applications.", "fields": ["nonlinear programming", "wireless sensor network", "snapshot", "computer network", "limiting"], "abstract": "Disasters (e.g., earthquakes, flooding, tornadoes, oil spilling and mining accidents) often result in tremendous cost to our society. Previously, wireless sensor networks (WSNs) have been proposed and deployed to provide information for decision making in post-disaster relief operations. The existing WSN solutions for post-disaster operations normally assume that the deployed sensor network can tolerate the damage caused by disasters and maintain its connectivity and coverage, even though a significant portion of nodes have been physically destroyed. In reality, however, this assumption is often invalid for disastrous events like earthquakes in large scale, limiting the relief capability of the existing solutions. Inspired by the “blackbox” technique in flight industry, we propose that preserving “the last snapshot” of the whole network and transferring those data to a safe zone would be the most logical approach to provide necessary information for rescuing lives and control damages. In this paper, we introduce Data Evacuation (DE), an original idea that takes advantage of the survival time of the WSN, i.e., the gap from the time when the disaster hits and the time when the WSN is paralyzed, to transmit critical data to sensor nodes in the safe area. Mathematically, the problem can be formulated as a nonlinear programming problem with multiple minimums in its support. We propose a gradient-based DE algorithm (GRAD-DE) to verify our DE strategy. Numerical investigations reveal the effectiveness of GRAD-DE algorithm.", "citation": "Citations (14)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "Nanyang Technological University", "Shanghai Jiao Tong University", "Hong Kong Polytechnic University"], "authors": ["Ming Liu.....http://dblp.org/pers/hd/l/Liu_0002:Ming", "Haigang Gong.....http://dblp.org/pers/hd/g/Gong:Haigang", "Yonggang Wen.....http://dblp.org/pers/hd/w/Wen:Yonggang", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai", "Jiannong Cao.....http://dblp.org/pers/hd/c/Cao:Jiannong"], "conf": "infocom", "year": "2011", "pages": 5}