{"title": "2D-3D fusion for layer decomposition of urban facades.", "fields": ["materials science", "planar", "edge detection", "point cloud", "computer vision", "data redundancy", "lidar", "fusion", "decomposition", "artificial intelligence"], "abstract": "We present a method for fusing two acquisition modes, 2D photographs and 3D LiDAR scans, for depth-layer decomposition of urban facades. The two modes have complementary characteristics: point cloud scans are coherent and inherently 3D, but are often sparse, noisy, and incomplete; photographs, on the other hand, are of high resolution, easy to acquire, and dense, but view-dependent and inherently 2D, lacking critical depth information. In this paper we use photographs to enhance the acquired LiDAR data. Our key observation is that with an initial registration of the 2D and 3D datasets we can decompose the input photographs into rectified depth layers. We decompose the input photographs into rectangular planar fragments and diffuse depth information from the corresponding 3D scan onto the fragments by solving a multi-label assignment problem. Our layer decomposition enables accurate repetition detection in each planar layer, using which we propagate geometry, remove outliers and enhance the 3D scan. Finally, the algorithm produces an enhanced, layered, textured model. We evaluate our algorithm on complex multi-planar building facades, where direct autocorrelation methods for repetition detection fail. We demonstrate how 2D photographs help improve the 3D scans by exploiting data redundancy, and transferring high level structural information to (plausibly) complete large missing regions.", "citation": "Not cited", "year": "2011", "departments": ["Ben-Gurion University of the Negev", "Tel Aviv University", "SIAT, China", "SIAT, China", "SIAT, China"], "conf": "iccv", "authors": ["Yangyan Li.....http://dblp.org/pers/hd/l/Li:Yangyan", "Qian Zheng.....http://dblp.org/pers/hd/z/Zheng:Qian", "Andrei Sharf.....http://dblp.org/pers/hd/s/Sharf:Andrei", "Daniel Cohen-Or.....http://dblp.org/pers/hd/c/Cohen=Or:Daniel", "Baoquan Chen.....http://dblp.org/pers/hd/c/Chen:Baoquan", "Niloy J. Mitra.....http://dblp.org/pers/hd/m/Mitra:Niloy_J="], "pages": 8}