{"title": "Blink: managing server clusters on intermittent power.", "fields": ["data center", "demand response", "cache", "cpu cache", "solar power"], "abstract": "Reducing the energy footprint of data centers continues to receive significant attention due to both its financial and environmental impact. There are numerous methods that limit the impact of both factors, such as expanding the use of renewable energy or participating in automated demand-response programs. To take advantage of these methods, servers and applications must gracefully handle intermittent constraints in their power supply. In this paper, we propose blinking---metered transitions between a high-power active state and a low-power inactive state---as the primary abstraction for conforming to intermittent power constraints. We design Blink, an application-independent hardware-software platform for developing and evaluating blinking applications, and define multiple types of blinking policies. We then use Blink to design BlinkCache, a blinking version of memcached, to demonstrate the effect of blinking on an example application. Our results show that a load-proportional blinking policy combines the advantages of both activation and synchronous blinking for realistic Zipf-like popularity distributions and wind/solar power signals by achieving near optimal hit rates (within 15% of an activation policy), while also providing fairer access to the cache (within 2% of a syn- chronous policy) for equally popular objects.", "citation": "Citations (161)", "year": "2011", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "conf": "asplos", "authors": ["Navin Sharma.....http://dblp.org/pers/hd/s/Sharma:Navin", "Sean Kenneth Barker.....http://dblp.org/pers/hd/b/Barker:Sean_Kenneth", "David E. Irwin.....http://dblp.org/pers/hd/i/Irwin:David_E=", "Prashant J. Shenoy.....http://dblp.org/pers/hd/s/Shenoy:Prashant_J="], "pages": 14}