{"title": "Fine-grained location-free planarization in wireless sensor networks.", "fields": ["planar", "graph theory", "chemical mechanical planarization", "stretch factor", "planar graph", "network topology"], "abstract": "Extracting planar graph from network topologies is of great importance for efficient protocol design in wireless ad hoc and sensor networks. Previous techniques of planar topology extraction are often based on ideal assumptions, such as UDG communication model and accurate node location measurements. To make these protocols work effectively in practice, we need extract a planar topology in a location-free and distributed manner with small stretch factors. The planar topologies constructed by current location-free methods often have large stretch factors. In this paper, we present a fine-grained and location-free network planarization method under ρ-quasi-UDG communication model with ρ≥1/√2. Compared with existing location-free planarization approaches, our method can extract a provably connected planar graph, called topological planar simplification (TPS), from the connectivity graph in a fine-grained manner using local connectivity information. We evaluate our design through extensive simulations and compare with the state-of-the-art approaches. The simulation results show that our method produces high-quality planar graphs with a small stretch factor in practical large-scale networks.", "citation": "Citations (4)", "departments": ["National University of Defense Technology", "National University of Defense Technology", "Tsinghua University", "Illinois Institute of Technology", "National University of Defense Technology", "National University of Defense Technology", "Hong Kong University of Science and Technology", "National University of Defense Technology", "CS Dept., IIT, USA"], "authors": ["Dezun Dong.....http://dblp.org/pers/hd/d/Dong:Dezun", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Xiangke Liao.....http://dblp.org/pers/hd/l/Liao:Xiangke", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang"], "conf": "infocom", "year": "2011", "pages": 9}