{"title": "Efficient network-wide flow record generation.", "fields": ["network packet", "fold", "byte", "anomaly detection", "router"], "abstract": "Experiments on diverse topics such as network measurement, management and security are routinely conducted using empirical flow export traces. However, the availability of empirical flow traces from operational networks is limited and frequently comes with significant restrictions. Furthermore, empirical traces typically lack critical meta-data (e.g., labeled anomalies) which reduce their utility in certain contexts. In this paper, we describe fs: a first-of-its-kind tool for automatically generating representative flow export records as well as basic SNMP-like router interface counts. fs generates measurements for a target network topology with specified traffic characteristics. The resulting records for each router in the topology have byte, packet and flow characteristics that are representative of what would be seen in a live network. fs also includes the ability to inject different types of anomalous events that have precisely defined characteristics, thereby enabling evaluation of proposed attack and anomaly detection methods. We validate fs by comparing it with the ns-2 simulator, which targets accurate recreation of packet-level dynamics in small network topologies. We show that data generated by fs are virtually identical to what are generated by ns-2, except over small time scales (below 1 second). We also show that fs is highly efficient, thus enabling test sets to be created for large topologies. Finally, we demonstrate the utility of fs through an assessment of anomaly detection algorithms, highlighting the need for flexible, scalable generation of network-wide measurement data with known ground truth.", "citation": "Citations (28)", "departments": ["Colgate University", "University of Adelaide", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Adelaide"], "authors": ["Joel Sommers.....http://dblp.org/pers/hd/s/Sommers:Joel", "Rhys Alistair Bowden.....http://dblp.org/pers/hd/b/Bowden:Rhys_Alistair", "Brian Eriksson.....http://dblp.org/pers/hd/e/Eriksson:Brian", "Paul Barford.....http://dblp.org/pers/hd/b/Barford:Paul", "Matthew Roughan.....http://dblp.org/pers/hd/r/Roughan:Matthew", "Nick G. Duffield.....http://dblp.org/pers/hd/d/Duffield:Nick_G="], "conf": "infocom", "year": "2011", "pages": 9}