{"title": "Query by document via a decomposition-based two-level retrieval approach.", "fields": ["document retrieval", "locality sensitive hashing", "document clustering", "vector space model", "tf idf"], "abstract": "Retrieving similar documents from a large-scale text corpus according to a given document is a fundamental technique for many applications. However, most of existing indexing techniques have difficulties to address this problem due to special properties of a document query, e.g. high dimensionality, sparse representation and semantic concern. Towards addressing this problem, we propose a two-level retrieval solution based on a document decomposition idea. A document is decomposed to a compact vector and a few document specific keywords by a dimension reduction approach. The compact vector embodies the major semantics of a document, and the document specific keywords complement the discriminative power lost in dimension reduction process. We adopt locality sensitive hashing (LSH) to index the compact vectors, which guarantees to quickly find a set of related documents according to the vector of a query document. Then we re-rank documents in this set by their document specific keywords. In experiments, we obtained promising results on various datasets in terms of both accuracy and performance. We demonstrated that this solution is able to index large-scale corpus for efficient similarity-based document retrieval.", "citation": "Citations (13)", "departments": ["Tsinghua University", "Microsoft", "Microsoft", "Tsinghua University", "Tsinghua University"], "authors": ["Linkai Weng.....http://dblp.org/pers/hd/w/Weng:Linkai", "Zhiwei Li.....http://dblp.org/pers/hd/l/Li:Zhiwei", "Rui Cai.....http://dblp.org/pers/hd/c/Cai:Rui", "Yaoxue Zhang.....http://dblp.org/pers/hd/z/Zhang:Yaoxue", "Yuezhi Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuezhi", "Laurence Tianruo Yang.....http://dblp.org/pers/hd/y/Yang:Laurence_Tianruo", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Lei"], "conf": "sigir", "year": "2011", "pages": 10}