{"title": "Performances of experienced and novice sportball players in heading virtual spinning soccer balls.", "fields": ["immersion", "virtual reality", "ball", "mixed reality", "magnus effect"], "abstract": "Using virtual reality for understanding sports performance allows for systematic investigation of human sensorimotor capabilities and meanwhile promotes the design and comparison of realistic immersive platforms. In this paper, we propose a virtual reality-based experimental design for studying the human ability to intercept spinning balls deflected by the Magnus effect. Compared to the previous approaches, we focused on a tight perception-action coupling. Experienced and novice subjects immersed in a 3D soccer stadium were asked to head realistically simulated balls, free kicked with and without sidespin. Consistent with the former studies, qualitative results show that the interception performance systematically relates to both the ball sidespin direction and arrival position for all the subjects, either experienced or not. However, contrary to those former studies where subjects answered only pseudo-verbally, experienced and novice groups differentiate in quantitative performances, supporting that expertise likely appears when perception is coupled to action. Further analyses will be needed to extract the different information-movement relationships governing the behaviors of experienced subjects and novices.", "citation": "Citations (2)", "departments": ["Istituto Italiano di Tecnologia", "Istituto Italiano di Tecnologia", "Istituto Italiano di Tecnologia", "Istituto Italiano di Tecnologia", "Istituto Italiano di Tecnologia"], "authors": ["Thierry Hoinville.....http://dblp.org/pers/hd/h/Hoinville:Thierry", "Abdeldjallil Naceri.....http://dblp.org/pers/hd/n/Naceri:Abdeldjallil", "Jesús Ortiz.....http://dblp.org/pers/hd/o/Ortiz:Jes=uacute=s", "Emmanuel Bernier.....http://dblp.org/pers/hd/b/Bernier:Emmanuel", "Ryad Chellali.....http://dblp.org/pers/hd/c/Chellali:Ryad"], "conf": "vr", "year": "2011", "pages": 4}