{"title": "Base-station selections for qos provisioning over distributed multi-user MIMO links in wireless networks.", "fields": ["multi user mimo", "time division multiple access", "mimo", "telecommunications link", "provisioning"], "abstract": "We propose the QoS-aware BS-selection and the corresponding resource-allocation schemes for downlink multi-user transmissions over the distributed multiple-input-multiple-output (MIMO) links, where multiple location-independent base-stations (BS), controlled by a central server, cooperatively transmit data to multiple mobile users. Our proposed schemes aim at minimizing the BS usages and reducing the interfering range of the distributed MIMO transmissions, while satisfying diverse statistical delay-QoS requirements for all users, which are characterized by the delay-bound violation probability and the effective capacity technique. Specifically, we propose two BS-usage minimization frameworks to develop the QoS-aware BS-selection schemes and the corresponding wireless resource-allocation algorithms across multiple mobile users. The first framework applies the joint block-diagonalization (BD) and probabilistic transmission (PT) to implement multiple access over multiple mobile users, while the second one employs time-division multiple access (TDMA) approach to control multiple users' links. We then derive the optimal BS-selection schemes for these two frameworks, respectively. In addition, we further discuss the PT-only based BS-selection scheme. Also conducted is a set of simulation evaluations to comparatively study the average BS-usage and interfering range of our proposed schemes and to analyze the impact of QoS constraints on the BS selections for distributed MIMO transmissions.", "citation": "Citations (3)", "departments": ["Texas A&M University", "Texas A&M University"], "authors": ["Qinghe Du.....http://dblp.org/pers/hd/d/Du:Qinghe", "Xi Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Xi"], "conf": "infocom", "year": "2011", "pages": 9}