{"title": "Hello, is grandma there? let's read! StoryVisit: family video chat and connected e-books.", "fields": ["multimedia", "computer science", "videoconferencing", "information and communications technology", "literacy"], "abstract": "StoryVisit allows children and long-distance adults to experience a sense of togetherness by reading children's story books together over a distance. StoryVisit combines video conferencing and connected books: remote grown-up and child readers can see and hear each other, and can also see and control the same e-book. We report on research with 61 families - over 200 users including parents, children and long-distance readers - who used StoryVisit in their homes with a long-distance reader for at least one reading session. In addition, we report qualitative findings regarding nineteen of the families who participated in telephone interviews and four families who were monitored and interviewed by researchers at home. Results show that connected e-book video chat sessions last about five times as long as the typical video chats reported in previous research on families with young children. Moreover, the addition of an animated character increased session lengths by another 50%. StoryVisit usage peaked for families with three year olds, showing that sustained distance interactions with very young children are possible if communication technologies incorporate joint activities that engage children and adults.", "citation": "Citations (69)", "year": "2011", "departments": ["Nokia", "University of Arkansas", "Nokia", "Nokia", "Nokia"], "conf": "chi", "authors": ["Hayes Raffle.....http://dblp.org/pers/hd/r/Raffle:Hayes", "Glenda Revelle.....http://dblp.org/pers/hd/r/Revelle:Glenda", "Koichi Mori.....http://dblp.org/pers/hd/m/Mori:Koichi", "Rafael Ballagas.....http://dblp.org/pers/hd/b/Ballagas:Rafael", "Kyle Buza.....http://dblp.org/pers/hd/b/Buza:Kyle", "Hiroshi Horii.....http://dblp.org/pers/hd/h/Horii:Hiroshi", "Joseph Kaye.....http://dblp.org/pers/hd/k/Kaye:Joseph", "Kristin Cook.....http://dblp.org/pers/hd/c/Cook:Kristin", "Natalie Freed.....http://dblp.org/pers/hd/f/Freed:Natalie", "Janet Go.....http://dblp.org/pers/hd/g/Go:Janet", "Mirjana Spasojevic.....http://dblp.org/pers/hd/s/Spasojevic:Mirjana"], "pages": 10}