{"title": "Pose, illumination and expression invariant pairwise face-similarity measure via Doppelgänger list comparison.", "fields": ["invariant", "fiducial marker", "pairwise comparison", "scale invariant feature transform", "feature"], "abstract": "Face recognition approaches have traditionally focused on direct comparisons between aligned images, e.g. using pixel values or local image features. Such comparisons become prohibitively difficult when comparing faces across extreme differences in pose, illumination and expression. The goal of this work is to develop a face-similarity measure that is largely invariant to these differences. We propose a novel data driven method based on the insight that comparing images of faces is most meaningful when they are in comparable imaging conditions. To this end we describe an image of a face by an ordered list of identities from a Library. The order of the list is determined by the similarity of the Library images to the probe image. The lists act as a signature for each face image: similarity between face images is determined via the similarity of the signatures. Here the CMU Multi-PIE database, which includes images of 337 individuals in more than 2000 pose, lighting and illumination combinations, serves as the Library. We show improved performance over state of the art face-similarity measures based on local features, such as FPLBP, especially across large pose variations on FacePix and multi-PIE. On LFW we show improved performance in comparison with measures like SIFT (on fiducials), LBP, FPLBP and Gabor (C1).", "citation": "Citations (59)", "year": "2011", "departments": ["University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "conf": "iccv", "authors": ["Florian Schroff.....http://dblp.org/pers/hd/s/Schroff:Florian", "Tali Treibitz.....http://dblp.org/pers/hd/t/Treibitz:Tali", "David J. Kriegman.....http://dblp.org/pers/hd/k/Kriegman:David_J=", "Serge J. Belongie.....http://dblp.org/pers/hd/b/Belongie:Serge_J="], "pages": 8}