{"title": "Parallel application memory scheduling.", "fields": ["conventional memory", "uniform memory access", "memory barrier", "registered memory", "interleaved memory"], "abstract": "A primary use of chip-multiprocessor (CMP) systems is to speed up a single application by exploiting thread-level parallelism. In such systems, threads may slow each other down by issuing memory requests that interfere in the shared memory subsystem. This  inter-thread memory system interference  can significantly degrade parallel application performance. Better memory request scheduling may mitigate such performance degradation. However, previously proposed memory scheduling algorithms for CMPs are designed for multi-programmed workloads where each core runs an independent application, and thus do not take into account the inter-dependent nature of threads in a parallel application.   In this paper, we propose a memory scheduling algorithm designed specifically for parallel applications. Our approach has two main components, targeting two common synchronization primitives that cause inter-dependence of threads: locks and barriers. First, the runtime system estimates threads holding the locks that cause the most serialization as the set of limiter threads, which are prioritized by the memory scheduler. Second, the memory scheduler shuffles thread priorities to reduce the time threads take to reach the barrier. We show that our memory scheduler speeds up a set of memory-intensive parallel applications by 12.6% compared to the best previous memory scheduling technique.", "citation": "Citations (138)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "Carnegie Mellon University", "Intel", "University of Texas at Austin"], "authors": ["Eiman Ebrahimi.....http://dblp.org/pers/hd/e/Ebrahimi:Eiman", "Rustam Miftakhutdinov.....http://dblp.org/pers/hd/m/Miftakhutdinov:Rustam", "Chris Fallin.....http://dblp.org/pers/hd/f/Fallin:Chris", "Chang Joo Lee.....http://dblp.org/pers/hd/l/Lee:Chang_Joo", "José A. Joao.....http://dblp.org/pers/hd/j/Joao:Jos=eacute=_A=", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur", "Yale N. Patt.....http://dblp.org/pers/hd/p/Patt:Yale_N="], "conf": "micro", "year": "2011", "pages": 12}