{"title": "DragonNet: A robust mobile Internet service system for long distance trains.", "fields": ["virtual router redundancy protocol", "internet access", "radiation", "resource reservation protocol", "antenna diversity", "routing protocol", "default gateway", "internetworking"], "abstract": "Wide range wireless networks often suffer from annoying service deterioration due to ever-changing wireless environments. This is especially the case with passengers on long-distance trains (LDT, such as intercity, interprovincial, and international commuter trains) connecting to the Internet. To improve the service quality of wide-area wireless networks, we present the DragonNet system and protocol with practical implementations. The DragonNet system is a chained gateway that consists of a group of interlinked DragonNet routers running the DragonNet protocol for node failure amortization across the long stretching router chain. The protocol makes use of the spatial diversity of wireless signals when not all spots on a surface see the same level of radio frequency radiation. In the case of an LDT of around 500 meters, it is highly possible that some of the DragonNet routers in the gateway chain still see sound signal quality when the LDT is partially blocked from the wireless Internet. The DragonNet protocol fully utilizes this feature to amortize single-point router failure over the whole router chain by intelligently rerouting traffic on failed ones to sound ones. We have implemented the DragonNet system and tested it in real railways over a period of three months. Our results have pinpointed two fundamental contributions of the DragonNet protocol. First, DragonNet significantly reduces the average temporary communication blackout (i.e., no Internet connection) to 1.5 seconds compared with 6 seconds without the DragonNet protocol. Second, DragonNet nearly doubles the aggregate system throughput compared with gateway without running the DragonNet protocol.", "citation": "Citations (10)", "departments": ["University of Glasgow", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong"], "authors": ["Fung Po Tso.....http://dblp.org/pers/hd/t/Tso:Fung_Po", "Lin Cui.....http://dblp.org/pers/hd/c/Cui:Lin", "Lizhuo Zhang.....http://dblp.org/pers/hd/z/Zhang:Lizhuo", "Weijia Jia.....http://dblp.org/pers/hd/j/Jia:Weijia", "Di Yao.....http://dblp.org/pers/hd/y/Yao:Di", "Jin Teng.....http://dblp.org/pers/hd/t/Teng:Jin", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong"], "conf": "infocom", "year": "2011", "pages": 9}