{"title": "A data-oriented transaction execution engine and supporting tools.", "fields": ["transaction processing", "online transaction processing", "distributed transaction", "transaction processing system", "extreme transaction processing"], "abstract": "Conventional OLTP systems assign each transaction to a worker thread and that thread accesses data, depending on what the transaction dictates. This thread-to-transaction work assignment policy leads to unpredictable accesses. The unpredictability forces each thread to enter a large number of critical sections for the completion of even the simplest of the transactions; leading to poor performance and scalability on modern manycore hardware.   This demonstration highlights the chaotic access patterns of conventional OLTP designs which are the source of scalability problems. Then, it presents a working prototype of a transaction processing engine that follows a non-conventional architecture, called data-oriented or DORA. DORA is designed around the thread-to-data work assignment policy. It distributes the transaction execution to multiple threads and offers predictable accesses. By design, DORA can decentralize the lock management service, and thereby eliminate the critical sections executed inside the lock manager. We explain the design of the system and show that it more efficiently utilizes the abundant processing power of modern hardware, always contrasting it against the conventional execution. In addition, we present different components of the system, such as a dynamic load balancer. Finally, we present a set of tools that enable the development of applications that use DORA.", "citation": "Citations (9)", "year": "2011", "departments": ["Carnegie Mellon University", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of Patras", "École Polytechnique Fédérale de Lausanne"], "conf": "sigmod", "authors": ["Ippokratis Pandis.....http://dblp.org/pers/hd/p/Pandis:Ippokratis", "Pinar Tözün.....http://dblp.org/pers/hd/t/T=ouml=z=uuml=n:Pinar", "Miguel Branco.....http://dblp.org/pers/hd/b/Branco:Miguel", "Dimitris Karampinas.....http://dblp.org/pers/hd/k/Karampinas:Dimitris", "Danica Porobic.....http://dblp.org/pers/hd/p/Porobic:Danica", "Ryan Johnson.....http://dblp.org/pers/hd/j/Johnson_0001:Ryan", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia"], "pages": 4}