{"title": "Un-zipping cellular infrastructure locations via user geo-intent.", "fields": ["physical access", "location awareness", "exploit", "end user", "data as a service"], "abstract": "Despite the rapid growth in cellular data traffic, we know very little about the (operational) cellular data service network (CDSN) infrastructure. A key step in the process of developing any such understanding is to first understand the locations and distribution of the basestations in the CDSN infrastructure that serve as physical access points for end users for communicating with the underlying network. Such knowledge not only can provide critical insight into the the CDSN infrastructure, but can also guide the development of innovative (e.g. location-aware) services and applications. In this paper we propose a novel approach for mapping the CDSN basestation infrastructure via (explicit) user geo-intent. The intuition behind the proposed approach is to exploit specific geo-locations (i.e. geo-intent) contained in user queries to location-based services, and correlate them with basestation id's to geo-map the CDSN infrastructure. To investigate the validity of our approach, we employ data (RADIUS/RADA data sessions and application sessions) collected at the core IP network inside a CDSN. We develop heuristics for identifying user geo-intent and for geo-mapping the CDSN infrastructure — in particular, the basestations — and evaluate their efficacy using a subset of basestations with ground-truth GPS locations.", "citation": "Citations (3)", "departments": ["University of Minnesota", "University of Minnesota", "Narus", "Narus", "Narus"], "authors": ["Gyan Ranjan.....http://dblp.org/pers/hd/r/Ranjan:Gyan", "Zhi-Li Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhi=Li", "Supranamaya Ranjan.....http://dblp.org/pers/hd/r/Ranjan:Supranamaya", "Ram Keralapura.....http://dblp.org/pers/hd/k/Keralapura:Ram", "Joshua Robinson.....http://dblp.org/pers/hd/r/Robinson:Joshua"], "conf": "infocom", "year": "2011", "pages": 5}