{"title": "Pocket cloudlets.", "fields": ["latency", "cloudlet", "cache only memory architecture", "access network", "mobile search"], "abstract": "Cloud services accessed through mobile devices suffer from high network access latencies and are constrained by energy budgets dictated by the devices' batteries. Radio and battery technologies will improve over time, but are still expected to be the bottlenecks in future systems. Non-volatile memories (NVM), however, may continue experiencing significant and steady improvements in density for at least ten more years. In this paper, we propose to leverage the abundance in memory capacity of mobile devices to mitigate latency and energy issues when accessing cloud services.   We first analyze NVM technology scaling trends, and then propose a cloud service cache architecture that resides on the mobile device's NVM (pocket cloudlet). This architecture utilizes both individual user and community access models to maximize its hit rate, and subsequently reduce overall service latency and energy consumption.   As a showcase we present the design, implementation and evaluation of PocketSearch, a search and advertisement pocket cloudlet. We perform mobile search characterization to guide the design of PocketSearch and evaluate it with 200 million mobile queries from the search logs of  m.bing.com . We show that PocketSearch can serve, on average, 66% of the web search queries submitted by an individual user without having to use the slow 3G link, leading to 16x service access speedup. Finally, based on experience with PocketSearch we provide additional insight and guidelines on how future pocket cloudlets should be organized, from both an architectural and an operating system perspective.", "citation": "Citations (94)", "year": "2011", "departments": ["Princeton University", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "asplos", "authors": ["Emmanouil Koukoumidis.....http://dblp.org/pers/hd/k/Koukoumidis:Emmanouil", "Dimitrios Lymberopoulos.....http://dblp.org/pers/hd/l/Lymberopoulos:Dimitrios", "Karin Strauss.....http://dblp.org/pers/hd/s/Strauss:Karin", "Jie Liu.....http://dblp.org/pers/hd/l/Liu:Jie", "Doug Burger.....http://dblp.org/pers/hd/b/Burger:Doug"], "pages": 14}