{"title": "Avoiding hot-spots on two-level direct networks.", "fields": ["percs", "small number", "interconnection", "scalability", "job scheduler"], "abstract": "A low-diameter, fast interconnection network is going to be a prerequisite for building exascale machines. A two-level direct network has been proposed by several groups as a scalable design for future machines. IBM's PERCS topology and the dragonfly network discussed in the DARPA exascale hardware study are examples of this design. The presence of multiple levels in this design leads to hot-spots on a few links when processes are grouped together at the lowest level to minimize total communication volume. This is especially true for communication graphs with a small number of neighbors per task. Routing and mapping choices can impact the communication performance of parallel applications running on a machine with a two-level direct topology. This paper explores intelligent topology aware mappings of different communication patterns to the physical topology to identify cases that minimize link utilization. We also analyze the trade-offs between using direct and indirect routing with different mappings. We use simulations to study communication and overall performance of applications since there are no installations of two-level direct networks yet. This study raises interesting issues regarding the choice of job scheduling, routing and mapping for future machines.", "citation": "Citations (68)", "departments": ["Lawrence Livermore National Laboratory", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Abhinav Bhatele.....http://dblp.org/pers/hd/b/Bhatele:Abhinav", "Nikhil Jain.....http://dblp.org/pers/hd/j/Jain:Nikhil", "William D. Gropp.....http://dblp.org/pers/hd/g/Gropp:William_D=", "Laxmikant V. Kalé.....http://dblp.org/pers/hd/k/Kal=eacute=:Laxmikant_V="], "conf": "sc", "year": "2011", "pages": 11}