{"title": "Aggregation capacity of wireless sensor networks: Extended network case.", "fields": ["attenuation", "parallel computing", "raw data", "scaling", "throughput", "sink", "transmitter power output", "topology"], "abstract": "A critical function of wireless sensor networks (WSNs) is data gathering. One is often only interested in collecting a specific function of the sensor measurements at a sink node, rather than downloading all the raw data from all the sensors. In this paper, we study the capacity of computing and transporting the specific functions of sensor measurements to the sink node, called aggregation capacity, for WSNs. We focus on random WSNs that can be classified into two types: random extended WSN and random dense WSN. All existing results about aggregation capacity are studied for dense WSNs, including random cases and arbitrary cases, under the protocol model (ProM) or physical model (PhyM). In this paper, we propose the first aggregation capacity scaling laws for random extended WSNs. We point out that unlike random dense WSNs, for random extended WSNs, the assumption made in ProM and PhyM that each successful transmission can sustain a constant rate is over-optimistic and unpractical due to transmit power limitation. We derive the first result on aggregation capacity for random extended WSNs under the generalized physical model. Particularly, we prove that, for the type-sensitive divisible perfectly compressible functions and type-threshold divisible perfectly compressible functions, the aggregation capacities for random extended WSNs with   ${\\mbi {n}}$    nodes are of order   $\\Thetab ({{{({\\bf log} {\\mbi {n}})}^{ - {\\alphab \\over {\\bf 2}} - {\\bf 1}}}})$    and   $\\Theta ({{{{{({\\bf log} {\\mbi {n}})}^{ - \\alphab /{\\bf 2}}}} \\over {{\\bf log}{\\bf log} {\\mbi {n}}}}})$   , respectively, where   $\\alphab \\gt {\\bf 2}$    denotes the power attenuation exponent in the generalized physical model. Furthermore, we improve the aggregation throughput for general divisible perfectly compressible functions to   $\\Omegab ({{{({\\bf log} {\\mbi {n}})}^{ - {\\alphab \\over {\\bf 2}}}}})$    by choosing   $\\Thetab ({\\bf log}\\; {\\mbi {n}})$    sensors from a small region (relative to the whole region) as sink nodes.", "citation": "Citations (13)", "departments": ["Tongji University", "Tongji University", "Tsinghua University", "Illinois Institute of Technology", "Illinois Institute of Technology", "Tongji University", "Tongji University", "Hong Kong University of Science and Technology", "Illinois Institute of Technology", "Illinois Institute of Technology"], "authors": ["Cheng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cheng", "Changjun Jiang.....http://dblp.org/pers/hd/j/Jiang:Changjun", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Huadong Ma.....http://dblp.org/pers/hd/m/Ma:Huadong"], "conf": "infocom", "year": "2011", "pages": 9}