{"title": "Preventing PCM banks from seizing too much power.", "fields": ["interleaved memory", "write combining", "computer memory", "write buffer", "cpu cache"], "abstract": "Widespread adoption of Phase Change Memory (PCM) requires solutions to several problems recently addressed in the literature, including limited endurance, increased write latencies, and system-level changes required to exploit non-volatility. One important difference between PCM and DRAM that has received less attention is the increased need for write power management. Writing to a PCM cell requires high current density over hundreds of nanoseconds, and hard limits on the number of simultaneous writes must be enforced to ensure correct operation, limiting write throughput and therefore overall performance. Because several wear reduction schemes only write those bits that need to be written, the amount of power required to write a cache line back to memory under such a system is now variable, which creates opportunity to reduce write power. This paper proposes policies that monitor the bits that have actually been changed over time, as opposed to simply those lines that are dirty. These polices can more effectively allocate power across the system to improve write concurrency. This method for allocating power across the memory subsystem is built on the idea of \"power tokens,\" a transferable, but time-specific, allocation of power. The results show that with a storage overhead of 4.3% in the last-level cache, a power-aware memory system can improve the performance of multiprogrammed workloads by up to 84%.", "citation": "Citations (85)", "departments": ["University of Auckland", "University of Washington", "University of California, Santa Barbara", "University of Auckland", "University of Washington"], "authors": ["Andrew Hay.....http://dblp.org/pers/hd/h/Hay:Andrew", "Karin Strauss.....http://dblp.org/pers/hd/s/Strauss:Karin", "Timothy Sherwood.....http://dblp.org/pers/hd/s/Sherwood:Timothy", "Gabriel H. Loh.....http://dblp.org/pers/hd/l/Loh:Gabriel_H=", "Doug Burger.....http://dblp.org/pers/hd/b/Burger:Doug"], "conf": "micro", "year": "2011", "pages": 10}