{"title": "Unitary qubit lattice simulations of multiscale phenomena in quantum turbulence.", "fields": ["quantum turbulence", "phase qubit", "qubit", "quantum t design", "quantum phase estimation algorithm"], "abstract": "A unitary qubit lattice algorithm, which scales almost perfectly to the full number of cores available (e.g., 216000 cores on a CRAY  XT 5), is used to examine quantum turbulence and its interrelationship to classical turbulence with production runs on grids up to 5760 3 . The maximal grids achievable by conventional CFD for quantum turbulence is just 2048 3 , and artificial dissipation had to be introduced. Our unitary algorithms preserve the Hamiltonian structure of the Gross-Pitaevskii equation which describes quantum turbulence in a zero-temperature Bose-Einstein condensate (BEC). As a result, parameter regimes have been uncovered which exhibit very short Poincare recurrence time, as well as a strong triple cascade structure in the kinetic energy spectrum. Moreover, a detailed examination of the incompressible kinetic energy spectrum has revealed for the first time within a turbulence simulation the κ −17/5  quantum Kelvin wave cascade. By generalizing the unitary entanglement operators on the 2 qubits, a finite temperature BEC system is examined. These unitary qubit lattice algorithms are directly applicable to quantum computers as they become available.", "citation": "Citations (3)", "departments": ["College of William & Mary", "Rogers State University", "College of William & Mary", "Air Force Research Laboratory", "Old Dominion University"], "authors": ["George Vahala.....http://dblp.org/pers/hd/v/Vahala:George", "Min Soe.....http://dblp.org/pers/hd/s/Soe:Min", "Bo Zhang.....http://dblp.org/pers/hd/z/Zhang:Bo", "Jeffrey Yepez.....http://dblp.org/pers/hd/y/Yepez:Jeffrey", "Linda Vahala.....http://dblp.org/pers/hd/v/Vahala:Linda", "Jonathan Carter.....http://dblp.org/pers/hd/c/Carter:Jonathan", "Sean Ziegeler.....http://dblp.org/pers/hd/z/Ziegeler:Sean"], "conf": "sc", "year": "2011", "pages": 11}