{"title": "When compressive sampling meets multicast: Outage analysis and subblock network coding.", "fields": ["lossy compression", "multicast", "linear network coding", "compressed sensing", "downtime"], "abstract": "This paper studies multicasting compressively sampled signals from a source to many receivers, over lossy wireless channels. Our focus is on the network outage from the perspective of signal distortion across all receivers, for both cases where the transmitter may or may not be capable of reconstructing the compressively sampled signals. Capitalizing on extreme value theory, we characterize the network outage in terms of key system parameters, including the erasure probability, the number of receivers and the sparse structure of the signal. We show that when the transmitter can reconstruct the compressively sensed signal, the strategy of using network coding to multicast the reconstructed signal coefficients can reduce the network outage significantly. We observe, however, that the traditional network coding could result in suboptimal performance with power-law decay signals. Thus motivated, we devise a new method, namely subblock network coding, which involves fragmenting the data into subblocks, and allocating time slots to different subblocks, based on its priority. We formulate the corresponding optimal allocation as an integer programming problem. Since integer programming is often intractable, we develop a heuristic algorithm that prioritizes the time slot allocation by exploiting the inherent priority structure of power-law decay signals. Numerical results show that the proposed schemes outperform the traditional methods with significant margins.", "citation": "Citations (4)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Chandrashekhar Thejaswi P. S......http://dblp.org/pers/hd/s/S=:Chandrashekhar_Thejaswi_P=", "Tuan Tran.....http://dblp.org/pers/hd/t/Tran:Tuan", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan"], "conf": "infocom", "year": "2011", "pages": 9}