{"title": "Optimal control of epidemic evolution.", "fields": ["mobile ad hoc network", "robustness", "resource consumption", "optimal control", "epidemic model"], "abstract": "Epidemic models based on nonlinear differential equations have been extensively applied in a variety of systems as diverse as infectious outbreaks, marketing, diffusion of beliefs, etc., to the dissemination of messages in MANET or p2p networks. Control of such systems is achieved at the cost of consuming the resources. We construct a unifying framework that models the interactions of the control and the elements in systems with epidemic behavior. Specifically, we consider non-replicative and replicative dissemination of messages in a network: a pre-determined set of disseminators distribute the messages in the former, whereas the disseminator set continually grows in the latter as the nodes that receive the patch become disseminators themselves. In both cases, the desired trade-offs can be attained by activating at any given time only fractions of disseminators and selecting their dissemination rates. We formulate the above trade-offs as optimal control problems that seek to minimize a general aggregate cost function which cogently depends on both the states and the overall resource consumption. We prove that the dynamic control strategies have simple structures: (1) it is never optimal to activate a partial fraction of the disseminators (all or none) (2) when the resource consumption cost is concave, the distribution rate of the activated nodes are bang-bang with at most one jump from the maximum to the minimum value. When the resource consumption cost is convex, the above transition is strict but continuous. We compare the efficacy and robustness of different dispatch models and also those of the optimum dynamic and static controls using numerical computations.", "citation": "Citations (71)", "departments": ["University of Pennsylvania", "University of Pennsylvania", "French Institute for Research in Computer Science and Automation"], "authors": ["M. H. R. Khouzani.....http://dblp.org/pers/hd/k/Khouzani:M=_H=_R=", "Saswati Sarkar.....http://dblp.org/pers/hd/s/Sarkar:Saswati", "Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan"], "conf": "infocom", "year": "2011", "pages": 9}