{"title": "Improved Mixing Condition on the Grid for Counting and Sampling Independent Sets.", "fields": ["partition function", "independent set", "degree", "self avoiding walk", "normalizing constant", "approximation algorithm"], "abstract": "The hard-core model has received much attention in the past couple of decades as a lattice gas model with hard constraints in statistical physics, a multicast model of calls in communication networks, and as a weighted independent set problem in combinatorics, probability and theoretical computer science. In this model, each independent set I in a graph G is weighted proportionally to λ|I|, for a positive real parameter λ. For large λ, computing the partition function (namely, the normalizing constant which makes the weighting a probability distribution on a finite graph) on graphs of maximum degree Δ ≥ 3, is a well known computationally challenging problem. More concretely, let \\({\\lambda_c(\\mathbb{T}_\\Delta)}\\) denote the critical value for the so-called uniqueness threshold of the hard-core model on the infinite Δ-regular tree; recent breakthrough results of Weitz (Proceedings of the 38th Annual ACM Symposium on Theory of Computing (STOC), pp. 140–149, 2006) and Sly (Proceedings of the 51st Annual IEEE Symposium on Foundations of Computer Science (FOCS), pp. 287–296, 2010) have identified \\({\\lambda_c(\\mathbb{T}_\\Delta)}\\) as a threshold where the hardness of estimating the above partition function undergoes a computational transition. We focus on the well-studied particular case of the square lattice \\({\\mathbb{Z}^2}\\) , and provide a new lower bound for the uniqueness threshold, in particular taking it well above \\({\\lambda_c(\\mathbb{T}_4)}\\) . Our technique refines and builds on the tree of self-avoiding walks approach of Weitz, resulting in a new technical sufficient criterion (of wider applicability) for establishing strong spatial mixing (and hence uniqueness) for the hard-core model. Our new criterion achieves better bounds on strong spatial mixing when the graph has extra structure, improving upon what can be achieved by just using the maximum degree. Applying our technique to \\({\\mathbb{Z}^2}\\) we prove that strong spatial mixing holds for all λ < 2.3882, improving upon the work of Weitz that held for λ < 27/16 = 1.6875. Our results imply a fully-polynomial deterministic approximation algorithm for estimating the partition function, as well as rapid mixing of the associated Glauber dynamics to sample from the hard-core distribution.", "citation": "Citations (25)", "year": "2011", "departments": ["University of Antioquia", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "focs", "authors": ["Ricardo Restrepo.....http://dblp.org/pers/hd/r/Restrepo:Ricardo", "Jinwoo Shin.....http://dblp.org/pers/hd/s/Shin:Jinwoo", "Prasad Tetali.....http://dblp.org/pers/hd/t/Tetali:Prasad", "Eric Vigoda.....http://dblp.org/pers/hd/v/Vigoda:Eric", "Linji Yang.....http://dblp.org/pers/hd/y/Yang:Linji"], "pages": 10}