{"title": "A declarative language approach to device configuration.", "fields": ["reactive programming", "procedural programming", "concurrent constraint logic programming", "fifth generation programming language", "interrupt", "programming domain", "code refactoring", "reconfigurable computing", "declarative programming", "constraint logic programming"], "abstract": "C remains the language of choice for hardware programming (device drivers, bus configuration, etc.): it is fast, allows low-level access, and is trusted by OS developers. However, the algorithms required to configure and reconfigure hardware devices and interconnects are becoming more complex and diverse, with the added burden of legacy support, quirks, and hardware bugs to work around. Even programming PCI bridges in a modern PC is a surprisingly complex problem, and is getting worse as new functionality such as hotplug appears. Existing approaches use relatively simple algorithms, hard-coded in C and closely coupled with low-level register access code, generally leading to suboptimal configurations.   We investigate the merits and drawbacks of a new approach: separating hardware configuration logic (algorithms to determine configuration parameter values) from mechanism (programming device registers). The latter we keep in C, and the former we encode in a declarative programming language with constraint-satisfaction extensions. As a test case, we have implemented full PCI configuration, resource allocation, and interrupt assignment in the Barrelfish research operating system, using a concise expression of efficient algorithms in constraint logic programming. We show that the approach is tractable, and can successfully configure a wide range of PCs with competitive runtime cost. Moreover, it requires about half the code of the C-based approach in Linux while offering considerably more functionality. Additionally it easily accommodates adaptations such as hotplug, fixed regions, and quirks.", "citation": "Citations (12)", "year": "2011", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich"], "conf": "asplos", "authors": ["Adrian Schüpbach.....http://dblp.org/pers/hd/s/Sch=uuml=pbach:Adrian", "Andrew Baumann.....http://dblp.org/pers/hd/b/Baumann:Andrew", "Timothy Roscoe.....http://dblp.org/pers/hd/r/Roscoe:Timothy", "Simon Peter.....http://dblp.org/pers/hd/p/Peter:Simon"], "pages": 14}