{"title": "Interfacing Virtual Agents with Collaborative Knowledge: Open Domain Question Answering Using Wikipedia-Based Topic Models.", "fields": ["dialog box", "exploit", "utterance", "topic model", "interfacing"], "abstract": "This paper is concerned with the use of conversational agents as an interaction paradigm for accessing open domain encyclopedic knowledge by means of Wikipedia. More precisely, we describe a dialog-based question answering system for German which utilizes Wikipedia-based topic models as a reference point for context detection and answer prediction. We investigate two different perspectives to the task of interfacing virtual agents with collaborative knowledge. First, we exploit the use of Wikipedia categories as a basis for identifying the broader topic of a spoken utterance. Second, we describe how to enhance the conversational behavior of the virtual agent by means of a Wikipedia-based question answering component which incorporates the question topic. At large, our approach identifies topic-related focus terms of a user's question, which are subsequently mapped onto a category taxonomy. Thus, we utilize the taxonomy as a reference point to derive topic labels for a user's question. The employed topic model is thereby based on explicitly given concepts as represented by the document and category structure of the Wikipedia knowledge base. Identified topic categories are subsequently combined with different linguistic filtering methods to improve answer candidate retrieval and reranking. Results show that the topic model approach contributes to an enhancement of the conversational behavior of virtual agents.", "citation": "Citations (14)", "year": "2011", "departments": ["Bielefeld University", "Bielefeld University", "Bielefeld University"], "conf": "ijcai", "authors": ["Ulli Waltinger.....http://dblp.org/pers/hd/w/Waltinger:Ulli", "Alexa Breuing.....http://dblp.org/pers/hd/b/Breuing:Alexa", "Ipke Wachsmuth.....http://dblp.org/pers/hd/w/Wachsmuth:Ipke"], "pages": 7}