{"title": "On mitigating TCP Incast in Data Center Networks.", "fields": ["h tcp", "cubic tcp", "tcp friendly rate control", "tcp westwood plus", "zeta tcp"], "abstract": "TCP Incast, also known as TCP throughput collapse, is a term used to describe a link capacity under-utilization phenomenon in certain many-to-one communication patterns, typically in many datacenter applications. The main root cause of TCP Incast analyzed by prior works is attributed to packet drops at the congestion switch that result in TCP timeout. Congestion control algorithms have been developed to reduce or eliminate packet drops at the congestion switch. In this paper, the performance of Quantized Congestion Notification (QCN) with respect to the TCP incast problem during data access from clustered servers in datacenters are investigated. QCN can effectively control link rates very rapidly in a datacenter environment. However, it performs poorly when TCP Incast is observed. To explain this low link utilization, we examine the rate fluctuation of different flows within one synchronous reading request, and find that the poor performance of TCP throughput with QCN is due to the rate unfairness of different flows. Therefore, an enhanced QCN congestion control algorithm, called fair Quantized Congestion Notification (FQCN), is proposed to improve fairness of multiple flows sharing one bottleneck link. We evaluate the performance of FQCN as compared to that of QCN in terms of fairness and convergence with four simultaneous and eight staggered source flows. As compared to QCN, fairness is improved greatly and the queue length at the bottleneck link converges to the equilibrium queue length very fast. The effects of FQCN to TCP throughput collapse are also investigated. Simulation results show that FQCN significantly enhances TCP throughput performance in a TCP Incast setup.", "citation": "Citations (59)", "departments": ["New Jersey Institute of Technology", "New Jersey Institute of Technology"], "authors": ["Yan Zhang.....http://dblp.org/pers/hd/z/Zhang_0008:Yan", "Nirwan Ansari.....http://dblp.org/pers/hd/a/Ansari:Nirwan"], "conf": "infocom", "year": "2011", "pages": 5}