{"title": "Mining hot calling contexts in small space.", "fields": ["dynamic program analysis", "gprof", "data stream mining", "exploit", "profiling", "call graph"], "abstract": "Calling context trees (CCTs) associate performance metrics with paths through a program's call graph, providing valuable information for program understanding and performance analysis. Although CCTs are typically much smaller than call trees, in real applications they might easily consist of tens of millions of distinct calling contexts: this sheer size makes them difficult to analyze and might hurt execution times due to poor access locality. For performance analysis, accurately collecting information about hot calling contexts may be more useful than constructing an entire CCT that includes millions of uninteresting paths. As we show for a variety of prominent Linux applications, the distribution of calling context frequencies is typically very skewed. In this paper we show how to exploit this property to reduce the CCT size considerably.   We introduce a novel run-time data structure, called  Hot Calling Context Tree (HCCT) , that offers an additional intermediate point in the spectrum of data structures for representing interprocedural control flow. The HCCT is a subtree of the CCT that includes only hot nodes and their ancestors. We show how to compute the HCCT without storing the exact frequency of all calling contexts, by using fast and space-efficient algorithms for mining frequent items in data streams. With this approach, we can distinguish between hot and cold contexts on the fly, while obtaining very accurate frequency counts. We show both theoretically and experimentally that the HCCT achieves a similar precision as the CCT in a much smaller space, roughly proportional to the number of distinct hot contexts: this is typically several orders of magnitude smaller than the total number of calling contexts encountered during a program's execution. Our space-efficient approach can be effectively combined with previous context-sensitive profiling techniques, such as sampling and bursting.", "citation": "Not cited", "departments": ["Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome"], "authors": ["Daniele Cono D'Elia.....http://dblp.org/pers/hd/d/D=Elia:Daniele_Cono", "Camil Demetrescu.....http://dblp.org/pers/hd/d/Demetrescu:Camil", "Irene Finocchi.....http://dblp.org/pers/hd/f/Finocchi:Irene"], "conf": "pldi", "year": "2011", "pages": 12}