{"title": "Learning to produce 3D media from a captured 2D video.", "fields": ["motion compensation", "amateur", "2d to 3d conversion", "block matching algorithm", "computer stereo vision", "stereo cameras", "clips", "epipolar geometry", "video capture", "video processing"], "abstract": "Due to the advances in display technologies and commercial success of 3D motion pictures in recent years, there is renewed interest in enabling consumers to create 3D content. While new 3D content can be created using more advanced capture devices (i.e., stereo cameras), most people still own 2D capture devices. Further, enormously large collections of captured media exist only in 2D. We present a system for producing pseudo-stereo images from captured 2D videos. Our system employs a two-phase procedure where the first phase detects “good” pseudo-stereo images frames from a 2D video, which was captured a priori without any constraints on camera motion or content. We use a trained classifier to detect pairs of video frames that are suitable for constructing pseudo-stereo images. In particular, for a given frame at time t, we determine if exists such that I t+t̅  and I t  can form an acceptable pseudo-stereo image. Moreover, even if t̂ is determined, generating a good pseudo-stereo image from 2D captured video frames can be nontrivial since in many videos, professional or amateur, both foreground and background objects may undergo complex motion. Independent foreground motions from different scene objects define different epipolar geometries that cause the conventional method of generating pseudo-stereo images to fail. To address this problem, the second phase of the proposed system further recomposes the frame pairs to ensure consistent 3D perception for objects for such cases. In this phase, final left and right pseudo-stereo images are created by recompositing different regions of the initial frame pairs to ensure a consistent camera geometry. We verify the performance of our method for producing pseudo-stereo media from captured 2D videos in a psychovisual evaluation using both professional movie clips and amateur home videos.", "citation": "Citations (4)", "departments": ["University of Rochester", "Cornell University", "Eastman Kodak Company", "Eastman Kodak Company", "Eastman Kodak Company", "Eastman Kodak Company", "Eastman Kodak Company", "ObjectVideo, Reston, VA, USA"], "authors": ["Minwoo Park.....http://dblp.org/pers/hd/p/Park:Minwoo", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo", "Andrew C. Gallagher.....http://dblp.org/pers/hd/g/Gallagher:Andrew_C=", "Majid Rabbani.....http://dblp.org/pers/hd/r/Rabbani:Majid"], "conf": "mm", "year": "2011", "pages": 4}