{"title": "Secure continuous aggregation via sampling-based verification in wireless sensor networks.", "fields": ["heuristic", "authentication", "adversary", "correctness", "automatic summarization"], "abstract": "In-network aggregation provides an energy-efficient way to extract summarization information from sensor networks. Continuous aggregation is usually required in many sensor applications to obtain the temporal variation information of some interesting aggregates. However, for the continuous innetwork aggregation in a hostile environment, the adversary could manipulate a series of aggregation results through compromised nodes to fabricate false temporal variation patterns of the aggregates. Existing secure aggregation schemes conduct one individual verification for each aggregation result. Due to the high rate and the long period of a continuous aggregation, directly applying these schemes to detect false temporal variation pattern would incur a great communication cost. In this paper, we identify distinct design issues for protecting continuous in-network aggregation and propose a novel scheme to detect false temporal variation patterns. Compared with the existing schemes, our scheme greatly reduces the communication cost by selecting and checking only a small part of aggregation results to verify the correctness of the temporal variation patterns in a time window. The checking of the aggregation results uses a sampling-based approach, which enables our scheme independent of any particular in-network aggregation protocol. We also propose a series of security mechanisms to protect the sampling process. Both theoretical analysis and simulations show the effectiveness and efficiency of our scheme.", "citation": "Citations (3)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology"], "authors": ["Lei Yu.....http://dblp.org/pers/hd/y/Yu_0002:Lei", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Siyao Cheng.....http://dblp.org/pers/hd/c/Cheng:Siyao", "Shuguang Xiong.....http://dblp.org/pers/hd/x/Xiong:Shuguang"], "conf": "infocom", "year": "2011", "pages": 9}