{"title": "OCS-14 : You Can Get Occluded in Fourteen Ways.", "fields": ["implementation", "spatial intelligence", "formalism", "phenomenon", "video tracking"], "abstract": "Occlusions are a central phenomenon in multiobject computer vision. However, formal analyses (LOS14, ROC20) proposed in the spatial reasoning literature ignore many distinctions crucial to computer vision, as a result of which these algebras have been largely ignored in vision applications. Two distinctions of relevance to visual computation are (a) whether the occluder is a moving object or part of the static background, and (b) whether the visible part of an object is a connected blob or fragmented. In this work, we develop a formal model of occlusion states that combines these criteria with overlap distinctions modeled in spatial reasoning to come up with a comprehensive set of fourteen occlusion states, which we define as OCS14. Transitions between these occlusion states are an important source of information on visual activity (e.g. splits and merges). We show that the resulting formalism is representationally complete in the sense that these states constitute a partition of all possible occlusion situations based on these criteria. Finally, we show results from implementations of this approach in a test application involving static camera based scene analysis, where occlusion state analysis and multiple object tracking can be used for two tasks - (a) identifying static occluders, and (b) modeling a class of interactions represented as transitions of occlusion states. Thus, the formalism is shown to have direct relevance to actual vision applications.", "citation": "Citations (9)", "year": "2011", "departments": ["Harvard University", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur"], "conf": "ijcai", "authors": ["Prithwijit Guha.....http://dblp.org/pers/hd/g/Guha:Prithwijit", "Amitabha Mukerjee.....http://dblp.org/pers/hd/m/Mukerjee:Amitabha", "K. S. Venkatesh.....http://dblp.org/pers/hd/v/Venkatesh:K=_S="], "pages": 6}