{"title": "SocialFilter: Introducing social trust to collaborative spam mitigation.", "fields": ["audit", "inference", "business", "internet privacy", "spamming", "social network", "trustworthiness"], "abstract": "We propose SocialFilter, a trust-aware collaborative spam mitigation system. Our proposal enables nodes with no email classification functionality to query the network on whether a host is a spammer. It employs Sybil-resilient trust inference to weigh the reports concerning spamming hosts that collaborating spam-detecting nodes (reporters) submit to the system. It weighs the spam reports according to the trustworthiness of their reporters to derive a measure of the system's belief that a host is a spammer. SocialFilter is the first collaborative unwanted traffic mitigation system that assesses the trustworthiness of spam reporters by both auditing their reports and by leveraging the social network of the reporters' administrators. The design and evaluation of our proposal offers us the following lessons: a) it is plausible to introduce Sybil-resilient Online-Social-Network-based trust inference mechanisms to improve the reliability and the attack-resistance of collaborative spam mitigation; b) using social links to obtain the trustworthiness of reports concerning spammers can result in comparable spam-blocking effectiveness with approaches that use social links to rate-limit spam (e.g., Ostra [27]); c) unlike Ostra, in the absence of reports that incriminate benign email senders, SocialFilter yields no false positives.", "citation": "Citations (82)", "departments": ["Telefónica", "University of California, Irvine", "Duke University", "Telefónica", "University of California, Irvine", "Duke University"], "authors": ["Michael Sirivianos.....http://dblp.org/pers/hd/s/Sirivianos:Michael", "Kyungbaek Kim.....http://dblp.org/pers/hd/k/Kim:Kyungbaek", "Xiaowei Yang.....http://dblp.org/pers/hd/y/Yang:Xiaowei"], "conf": "infocom", "year": "2011", "pages": 9}