{"title": "Secure and efficient in-network processing of exact SUM queries.", "fields": ["encryption", "data integrity", "network security", "hash function", "secret sharing"], "abstract": "In-network aggregation is a popular methodology adopted in wireless sensor networks, which reduces the energy expenditure in processing aggregate queries (such as SUM, MAX, etc.) over the sensor readings. Recently, research has focused on secure in-network aggregation, motivated (i) by the fact that the sensors are usually deployed in open and unsafe environments, and (ii) by new trends such as outsourcing, where the aggregation process is delegated to an untrustworthy service. This new paradigm necessitates the following key security properties: data confidentiality, integrity, authentication, and freshness. The majority of the existing work on the topic is either unsuitable for large-scale sensor networks, or provides only approximate answers for SUM queries (as well as their derivatives, e.g., COUNT, AVG, etc). Moreover, there is currently no approach offering both confidentiality and integrity at the same time. Towards this end, we propose a novel and efficient scheme called SIES. SIES is the first solution that supports Secure In-network processing of Exact SUM queries, satisfying all security properties. It achieves this goal through a combination of homomorphic encryption and secret sharing. Furthermore, SIES is lightweight (it relies on inexpensive hash operations and modular additions/multiplications), and features a very small bandwidth consumption (in the order of a few bytes). Consequently, SIES constitutes an ideal method for resource-constrained sensors.", "citation": "Citations (16)", "departments": ["The Chinese University of Hong Kong", "National and Kapodistrian University of Athens", "Hong Kong University of Science and Technology"], "authors": ["Stavros Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos_0001:Stavros", "Aggelos Kiayias.....http://dblp.org/pers/hd/k/Kiayias:Aggelos", "Dimitris Papadias.....http://dblp.org/pers/hd/p/Papadias:Dimitris"], "conf": "icde", "year": "2011", "pages": 12}