{"title": "Does adding manpower also affect quality?: an empirical, longitudinal analysis.", "fields": ["software development", "software quality", "team software process", "project manager", "knowledge transfer"], "abstract": "With each new developer to a software development team comes a greater challenge to manage the communication, coordination, and knowledge transfer amongst teammates. Fred Brooks discusses this challenge in The Mythical Man-Month by arguing that rapid team expansion can lead to a complex team organization structure. While Brooks focuses on productivity loss as the negative outcome, poor product quality is also a substantial concern. But if team expansion is unavoidable, can any quality impacts be mitigated? Our objective is to guide software engineering managers by empirically analyzing the effects of team size, expansion, and structure on product quality. We performed an empirical, longitudinal case study of a large Cisco networking product over a five year history. Over that time, the team underwent periods of no expansion, steady expansion, and accelerated expansion. Using team-level metrics, we quantified characteristics of team expansion, including team size, expansion rate, expansion acceleration, and modularity with respect to department designations. We examined statistical correlations between our monthly team-level metrics and monthly product-level metrics. Our results indicate that increased team size and linear growth are correlated with later periods of better product quality. However, periods of accelerated team expansion are correlated with later periods of reduced software quality. Furthermore, our linear regression prediction model based on team metrics was able to predict the product's post-release failure rate within a 95% prediction interval for 38 out of 40 months. Our analysis provides insight for project managers into how the expansion of development teams can impact product quality.", "citation": "Citations (6)", "departments": ["North Carolina State University", "Research Triangle Park", "North Carolina State University"], "authors": ["Andrew Meneely.....http://dblp.org/pers/hd/m/Meneely:Andrew", "Pete Rotella.....http://dblp.org/pers/hd/r/Rotella:Pete", "Laurie Williams.....http://dblp.org/pers/hd/w/Williams:Laurie"], "conf": "sigsoft", "year": "2011", "pages": 10}