{"title": "Memoir: Practical State Continuity for Protected Modules.", "fields": ["software architecture", "correctness", "rollback", "memoir", "software security assurance"], "abstract": "To protect computation, a security architecture must safeguard not only the software that performs it but also the state on which the software operates. This requires more than just preserving state confidentiality and integrity, since, e.g., software may err if its state is rolled back to a correct but stale version. For this reason, we present Memoir, the first system that fully ensures the continuity of a protected software module's state. In other words, it ensures that a module's state remains persistently and completely inviolate. A key contribution of Memoir is a technique to ensure rollback resistance without making the system vulnerable to system crashes. It does this by using a deterministic module, storing a concise summary of the module's request history in protected NVRAM, and allowing only safe request replays after crashes. Since frequent NVRAM writes are impractical on modern hardware, we present a novel way to leverage limited trusted hardware to minimize such writes. To ensure the correctness of our design, we develop formal, machine-verified proofs of safety. To demonstrate Memoir's practicality, we have built it and conducted evaluations demonstrating that it achieves reasonable performance on real hardware. Furthermore, by building three useful Memoir-protected modules that rely critically on state continuity, we demonstrate Memoir's versatility.", "citation": "Citations (91)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Carnegie Mellon University"], "authors": ["Bryan Parno.....http://dblp.org/pers/hd/p/Parno:Bryan", "Jacob R. Lorch.....http://dblp.org/pers/hd/l/Lorch:Jacob_R=", "John R. Douceur.....http://dblp.org/pers/hd/d/Douceur:John_R=", "James W. Mickens.....http://dblp.org/pers/hd/m/Mickens:James_W=", "Jonathan M. McCune.....http://dblp.org/pers/hd/m/McCune:Jonathan_M="], "conf": "sp", "year": "2011", "pages": 16}