{"title": "Network modulation: A new dimension to enhance wireless network performance.", "fields": ["wireless mesh network", "wireless site survey", "wireless wan", "key distribution in wireless sensor networks", "fixed wireless", "network architecture", "wi fi array"], "abstract": "We introduce an approach called network modulation which gives us a new dimension to improve wireless network throughput and save energy. In current wireless systems, when a source transmits data to the receiver through a single-hop or multi-hop wireless path, the physical layer modulates and demodulates the information bits hop-by-hop, and the transmission over each hop is treated the same as in a point-to-point communication link. Given the broadcast nature of wireless medium and the wide variation of wireless channel quality, we let a sender transmit messages to multiple receivers simultaneously, using a software mapping technology, called network modulation, to redefine the constellation of typical quadrature amplitude modulation (QAM) schemes. As the software-based network modulation schemes do not require specialized communication hardware, they can be implemented with low cost and high flexibility. Network modulation can be used to improve network performance in a wide range of scenarios, for anycast (broadcast, multicast and unicast) services, one-way or two-way traffic, and single-hop or multi-hop wireless paths, in infrastructure or ad hoc networks. The minimum requirement for applying network modulation is that there are no less than three nodes within each others' transmission ranges, so we can consider modulation, topology control, resource allocation, and routing jointly.", "citation": "Not cited", "departments": ["University of Victoria", "University of Victoria", "University of Victoria", "Princeton University"], "authors": ["Zhe Yang.....http://dblp.org/pers/hd/y/Yang:Zhe", "Yuanqian Luo.....http://dblp.org/pers/hd/l/Luo:Yuanqian", "Lin Cai.....http://dblp.org/pers/hd/c/Cai_0001:Lin"], "conf": "infocom", "year": "2011", "pages": 9}