{"title": "Exploiting prediction to enable Secure and Reliable routing in Wireless Body Area Networks.", "fields": ["packet forwarding", "static routing", "body area network", "zone routing protocol", "wireless routing protocol"], "abstract": "In this paper, we propose a distributed Prediction-based Secure and Reliable routing framework (PSR) for emerging Wireless Body Area Networks (WBANs). It can be integrated with a specific routing protocol to improve the latter's reliability and prevent data injection attacks during data communication. In PSR, using past link quality measurements, each node predicts the quality of every incidental link, and thus any change in the neighbor set as well, for the immediate future. When there are multiple possible next hops for packet forwarding (according to the routing protocol used), PSR selects the one with the highest predicted link quality among them. Specially-tailored lightweight source and data authentication methods are employed by nodes to secure data communication. Further, each node adaptively enables or disables source authentication according to predicted neighbor set change and prediction accuracy so as to quickly filter false source authentication requests. We demonstrate that PSR significantly increases routing reliability and effectively resists data injection attacks through in-depth security analysis and extensive simulation study.", "citation": "Citations (101)", "departments": ["University of Waterloo", "university of lille", "University of Waterloo", "University of Waterloo", "University of Ontario Institute of Technology"], "authors": ["Xiaohui Liang.....http://dblp.org/pers/hd/l/Liang:Xiaohui", "Xu Li.....http://dblp.org/pers/hd/l/Li_0001:Xu", "Qinghua Shen.....http://dblp.org/pers/hd/s/Shen:Qinghua", "Rongxing Lu.....http://dblp.org/pers/hd/l/Lu:Rongxing", "Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin", "Weihua Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Weihua"], "conf": "infocom", "year": "2012", "pages": 9}