{"title": "Measurement and utilization of customer-provided resources for cloud computing.", "fields": ["data center", "cloud computing security", "trade off", "cloud testing", "utility computing"], "abstract": "Recent years have witnessed cloud computing as an efficient means for providing resources as a form of utility. Driven by the strong demands, such industrial leaders as Amazon, Google, and Microsoft have all offered practical cloud platforms, mostly datacenter-based. These platforms are known to be powerful and cost-effective. Yet, as the cloud customers are pure consumers, their local resources, though abundant, have been largely ignored. In this paper, we for the first time investigate a novel customer-provided cloud platform, SpotCloud, through extensive measurements. Complementing data centers, SpotCloud enables customers to contribute/sell their private resources to collectively offer cloud services. We find that, although the capacity as well as the availability of this platform is not yet comparable to enterprise datacenters, SpotCloud can provide very flexible services to customers in terms of both performance and pricing. It is friendly to the customers who often seek to run short-term and customized tasks at minimum costs. However, different from the standardized enterprise instances, SpotCloud instances are highly diverse, which greatly increase the difficulty of instance selection. To solve this problem, we propose an instance recommendation mechanism for cloud service providers to recommend short-listed instances to the customers. Our model analysis and the real-world experiments show that it can help the customers to find the best trade off between benefit and cost.", "citation": "Citations (21)", "departments": ["University of British Columbia", "University of British Columbia", "University of British Columbia", "Enomaly Inc., Ontario, Canada"], "authors": ["Haiyang Wang.....http://dblp.org/pers/hd/w/Wang:Haiyang", "Feng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Feng", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Justin Groen.....http://dblp.org/pers/hd/g/Groen:Justin"], "conf": "infocom", "year": "2012", "pages": 9}