{"title": "Blogs as a collective war diary.", "fields": ["social media", "plural", "topic model", "pronoun", "collective identity"], "abstract": "Disaster-related research in human-centered computing has typically focused on the shorter-term, emergency period of a disaster event, whereas effects of some crises are long-term, lasting years. Social media archived on the Internet provides researchers the opportunity to examine societal reactions to a disaster over time. In this paper we examine how blogs written during a protracted conflict might reflect a collective view of the event. The sheer amount of data originating from the Internet about a significant event poses a challenge to researchers; we employ topic modeling and pronoun analysis as methods to analyze such large-scale data. First, we discovered that blog war topics temporally tracked the actual, measurable violence in the society suggesting that blog content can be an indicator of the health or state of the affected population. We also found that people exhibited a collective identity when they blogged about war, as evidenced by a higher use of first-person plural pronouns compared to blogging on other topics. Blogging about daily life decreased as violence in the society increased; when violence waned, there was a resurgence of daily life topics, potentially illustrating how a society returns to normalcy.", "citation": "Citations (29)", "departments": ["University of California, Irvine", "University of Colorado Boulder", "University of Colorado Boulder", "University of Colorado Boulder", "University of California, Irvine"], "authors": ["Gloria Mark.....http://dblp.org/pers/hd/m/Mark:Gloria", "Mossaab Bagdouri.....http://dblp.org/pers/hd/b/Bagdouri:Mossaab", "Leysia Palen.....http://dblp.org/pers/hd/p/Palen:Leysia", "James H. Martin.....http://dblp.org/pers/hd/m/Martin:James_H=", "Ban Al-Ani.....http://dblp.org/pers/hd/a/Al=Ani:Ban", "Kenneth Mark Anderson.....http://dblp.org/pers/hd/a/Anderson:Kenneth_Mark"], "conf": "cscw", "year": "2012", "pages": 10}