{"title": "A Game-Theoretic Approach for High-Assurance of Data Trustworthiness in Sensor Networks.", "fields": ["trusted computing", "secure multi party computation", "situation analysis", "key distribution in wireless sensor networks", "ranging"], "abstract": "Sensor networks are being increasingly deployed in many application domains ranging from environment monitoring to supervising critical infrastructure systems (e.g., the power grid). Due to their ability to continuously collect large amounts of data, sensor networks represent a key component in decision-making, enabling timely situation assessment and response. However, sensors deployed in hostile environments may be subject to attacks by adversaries who intend to inject false data into the system. In this context, {\\em data trustworthiness} is an important concern, as false readings may result in wrong decisions with serious consequences (e.g., large-scale power outages). To defend against this threat, it is important to establish trust levels for sensor nodes and adjust node trustworthiness scores to account for malicious interferences. In this paper, we develop a game-theoretic defense strategy to protect sensor nodes from attacks and to guarantee a high level of trustworthiness for sensed data. We use a discrete time model, and we consider that there is a limited attack budget that bounds the capability of the attacker in each round. The defense strategy objective is to ensure that sufficient sensor nodes are protected in each round such that the discrepancy between the value accepted and the truthful sensed value is below a certain threshold. We model the attack-defense interaction as a Stackel berg game, and we derive the Nash equilibrium condition that is sufficient to ensure that the sensed data are truthful within a nominal error bound. We implement a prototype of the proposed strategy and we show through extensive experiments that our solution provides an effective and efficient way of protecting sensor networks from attacks.", "citation": "Citations (25)", "departments": ["Yonsei University", "University of Massachusetts Boston", "Purdue University", "University of Texas at Dallas"], "authors": ["Hyo-Sang Lim.....http://dblp.org/pers/hd/l/Lim:Hyo=Sang", "Gabriel Ghinita.....http://dblp.org/pers/hd/g/Ghinita:Gabriel", "Elisa Bertino.....http://dblp.org/pers/hd/b/Bertino:Elisa", "Murat Kantarcioglu.....http://dblp.org/pers/hd/k/Kantarcioglu:Murat"], "conf": "icde", "year": "2012", "pages": 12}