{"title": "Online incremental attribute-based zero-shot learning.", "fields": ["contextual image classification", "robotics", "mobile telephony", "robot", "computation"], "abstract": "The paper presents a new online incremental zero-shot learning method for applications in robotics and mobile communications where attribute labeling is obtained via online interaction with users, and where the potential for inconsistency exists. Unique to most previous offline batch learning methods, the proposed method is based on the indirect-attribute-prediction (IAP) model instead of the direct-attribute-prediction (DAP). Using self-organizing and incremental neural networks (SOINN) as the learning mechanism, our method can learn new attributes and update existing attributes in an online incremental manner while retaining as high accuracy as that of the state-of-the-art offline method. Compared to the offline methods, the computation time has also been reduced by more than 99%. Two experiments evaluated two aspects of the proposed method. First, our method clearly outperforms the previous IAP-based offline method in terms of both time and accuracy, and yield approximately the same accuracy as the DAP-based offline method. Second, the proposed method can deal with situations where object attributes are gradually labeled via interaction with many users and where some of them may be incorrect. This scenario is very important for applications in mobile communications and robotics where some objects and attributes may be initially unknown and must be learnt online.", "citation": "Citations (73)", "year": "2012", "departments": ["Tokyo Institute of Technology", "Chiang Mai University", "Tokyo Institute of Technology", "Tokyo Institute of Technology"], "conf": "cvpr", "authors": ["Pichai Kankuekul.....http://dblp.org/pers/hd/k/Kankuekul:Pichai", "Aram Kawewong.....http://dblp.org/pers/hd/k/Kawewong:Aram", "Sirinart Tangruamsub.....http://dblp.org/pers/hd/t/Tangruamsub:Sirinart", "Osamu Hasegawa.....http://dblp.org/pers/hd/h/Hasegawa:Osamu"], "pages": 8}