{"title": "Learning to Align from Scratch.", "fields": ["deep learning", "restricted boltzmann machine", "feature learning", "visual descriptors", "scratch"], "abstract": "Unsupervised joint alignment of images has been demonstrated to improve performance on recognition tasks such as face verification. Such alignment reduces undesired variability due to factors such as pose, while only requiring weak supervision in the form of poorly aligned examples. However, prior work on unsupervised alignment of complex, real-world images has required the careful selection of feature representation based on hand-crafted image descriptors, in order to achieve an appropriate, smooth optimization landscape. In this paper, we instead propose a novel combination of unsupervised joint alignment with unsupervised feature learning. Specifically, we incorporate deep learning into the congealing alignment framework. Through deep learning, we obtain features that can represent the image at differing resolutions based on network depth, and that are tuned to the statistics of the specific data being aligned. In addition, we modify the learning algorithm for the restricted Boltzmann machine by incorporating a group sparsity penalty, leading to a topographic organization of the learned filters and improving subsequent alignment results. We apply our method to the Labeled Faces in the Wild database (LFW). Using the aligned images produced by our proposed unsupervised algorithm, we achieve higher accuracy in face verification compared to prior work in both unsupervised and supervised alignment. We also match the accuracy for the best available commercial method.", "citation": "Citations (182)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Michigan", "University of Massachusetts Amherst"], "authors": ["Gary B. Huang.....http://dblp.org/pers/hd/h/Huang:Gary_B=", "Marwan A. Mattar.....http://dblp.org/pers/hd/m/Mattar:Marwan_A=", "Honglak Lee.....http://dblp.org/pers/hd/l/Lee:Honglak", "Erik G. Learned-Miller.....http://dblp.org/pers/hd/l/Learned=Miller:Erik_G="], "conf": "nips", "year": "2012", "pages": 9}