{"title": "Guiding internet-scale video service deployment using microblog-based prediction.", "fields": ["internet video", "recommender system", "popularity", "microblogging", "software deployment"], "abstract": "Online microblogging has been very popular in today's Internet, where users exchange short messages and follow various contents shared by people that they are interested in. Among the variety of exchanges, video links are a representative type on a microblogging site. More and more viewers of an Internet video service are coming from microblog recommendations. It is intriguing research to explore the connections between the patterns of microblog exchanges and the popularity of videos, in order to potentially use the propagation patterns of microblogs to guide proactive service deployment of a video sharing system. Based on extensive traces from Youku and Tencent Weibo, a popular video sharing site and a favored microblogging system in China, we explore how patterns of video link propagation in the microblogging system are correlated with video popularity on the video sharing site, at different times and in different geographic regions. Using influential factors summarized from the measurement studies, we further design neural network-based learning frameworks to predict the number of potential viewers of different videos and the geographic distribution of viewers. Experiments show that our neural network-based frameworks achieve better prediction accuracy, as compared to a classical approach that relies on historical numbers of views. We also briefly discuss how proactive video service deployment can be effectively enabled by our prediction frameworks.", "citation": "Citations (51)", "departments": ["Tsinghua University", "Tsinghua University", "University of Hong Kong", "Tsinghua University"], "authors": ["Zhi Wang.....http://dblp.org/pers/hd/w/Wang_0001:Zhi", "Lifeng Sun.....http://dblp.org/pers/hd/s/Sun:Lifeng", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Shiqiang Yang.....http://dblp.org/pers/hd/y/Yang:Shiqiang"], "conf": "infocom", "year": "2012", "pages": 5}