{"title": "Efficiently Monitoring Top-k Pairs over Sliding Windows.", "fields": ["oracle", "sliding window protocol", "quadratic equation", "score", "algorithm design"], "abstract": "Top-k pairs queries have received significant attention by the research community. k-closest pairs queries, k-furthest pairs queries and their variants are among the most well studied special cases of the top-k pairs queries. In this paper, we present the first approach to answer a broad class of top-k pairs queries over sliding windows. Our framework handles multiple top-k pairs queries and each query is allowed to use a different scoring function, a different value of k and a different size of the sliding window. Although the number of possible pairs in the sliding window is quadratic to the number of objects N in the sliding window, we efficiently answer the top-k pairs query by maintaining a small subset of pairs called K-sky band which is expected to consist of O(K log(N/K)) pairs. For all the queries that use the same scoring function, we need to maintain only one K-sky band. We present efficient techniques for the K-sky band maintenance and query answering. We conduct a detailed complexity analysis and show that the expected cost of our approach is reasonably close to the lower bound cost. We experimentally verify this by comparing our approach with a specially designed supreme algorithm that assumes the existence of an oracle and meets the lower bound cost.", "citation": "Citations (13)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "University of New South Wales", "Microsoft"], "authors": ["Zhitao Shen.....http://dblp.org/pers/hd/s/Shen:Zhitao", "Muhammad Aamir Cheema.....http://dblp.org/pers/hd/c/Cheema:Muhammad_Aamir", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Haixun Wang.....http://dblp.org/pers/hd/w/Wang:Haixun"], "conf": "icde", "year": "2012", "pages": 12}