{"title": "Globally optimal line clustering and vanishing point estimation in Manhattan world.", "fields": ["cross validation", "maxima and minima", "parallel", "vanishing point", "orthogonality"], "abstract": "The projections of world parallel lines in an image intersect at a single point called the vanishing point (VP). VPs are a key ingredient for various vision tasks including rotation estimation and 3D reconstruction. Urban environments generally exhibit some dominant orthogonal VPs. Given a set of lines extracted from a calibrated image, this paper aims to (1) determine the line clustering, i.e. find which line belongs to which VP, and (2) estimate the associated orthogonal VPs. None of the existing methods is fully satisfactory because of the inherent difficulties of the problem, such as the local minima and the chicken-and-egg aspect. In this paper, we present a new algorithm that solves the problem in a mathematically guaranteed globally optimal manner and can inherently enforce the VP orthogonality. Specifically, we formulate the task as a consensus set maximization problem over the rotation search space, and further solve it efficiently by a branch-and-bound procedure based on the Interval Analysis theory. Our algorithm has been validated successfully on sets of challenging real images as well as synthetic data sets.", "citation": "Citations (68)", "year": "2012", "departments": ["ETH Zurich", "Sogang University", "University of Burgundy", "University of Rouen", "University of Tokyo"], "conf": "cvpr", "authors": ["Jean Charles Bazin.....http://dblp.org/pers/hd/b/Bazin:Jean_Charles", "Yongduek Seo.....http://dblp.org/pers/hd/s/Seo:Yongduek", "Cédric Demonceaux.....http://dblp.org/pers/hd/d/Demonceaux:C=eacute=dric", "Pascal Vasseur.....http://dblp.org/pers/hd/v/Vasseur:Pascal", "Katsushi Ikeuchi.....http://dblp.org/pers/hd/i/Ikeuchi:Katsushi", "Inso Kweon.....http://dblp.org/pers/hd/k/Kweon:Inso", "Marc Pollefeys.....http://dblp.org/pers/hd/p/Pollefeys:Marc"], "pages": 8}