{"title": "nuTAB-BackSpace: Rewriting to Normalize Non-determinism in Post-silicon Debug Traces.", "fields": ["determinism", "rewriting", "exploit", "normalization", "debugging"], "abstract": "A primary challenge in post-silicon debug is the lack of observability of on-chip signals. In 2008, we introduced BackSpace, a new paradigm that uses repeated silicon runs to automatically compute debug traces that lead to an observed buggy state. The original BackSpace, however, required excessive on-chip overhead, so we next developed TAB-BackSpace, which uses only pre-existing on-chip debug hardware to compute an abstract debug trace with very low probability of error. With TAB-BackSpace, we demonstrated root-causing a (previously known) bug on an IBM POWER7 processor, in actual silicon.\n\nThe problem with these BackSpace approaches, however, is the need to repeatedly trigger the bug via the exact same execution. In practice, non-determinism makes such exact repetition extremely unlikely. Instead, what typically arises is an intuitively \"equivalent\" trace that triggers the same bug, but isn't cycle-by-cycle identical. In this paper, we introduce nuTAB-BackSpace to exploit this observation. The user provides rewrite rules to specify which traces should be considered equivalent, and nuTAB-BackSpace uses these rules to make progress in trace computation even in the absence of exact trace matches. We prove that under reasonable assumptions about the rewrite rules, the abstract trace computed by nuTAB-BackSpace is concretizable -- i.e., it corresponds to a possible, real chip execution (with the same low possibility of error as TAB-BackSpace). In simulation studies and in FPGA-emulation, nuTAB-BackSpace successfully computes error traces on substantial design examples, where TAB-BackSpace cannot.", "citation": "Citations (7)", "year": "2012", "departments": ["University of British Columbia", "University of British Columbia", "IBM"], "conf": "cav", "authors": ["Flavio M. de Paula.....http://dblp.org/pers/hd/p/Paula:Flavio_M=_de", "Alan J. Hu.....http://dblp.org/pers/hd/h/Hu:Alan_J=", "Amir Nahir.....http://dblp.org/pers/hd/n/Nahir:Amir"], "pages": 19}