{"title": "Analysis of TDMA crossbar real-time switch design for AFDX networks.", "fields": ["ethernet", "time switch", "time division multiple access", "crossbar switch", "shared medium"], "abstract": "The rapid scaling up of modern avionics is forcing its communication infrastructure to evolve from shared medium toward multi-hop switched real-time networks. This prompts the proposal of avionics full-duplex switched Ethernet (AFDX) standard. Since its publication, AFDX has been well-received, and is deployed or to-be-deployed in state-of-the-art aircrafts, such as Airbus A380/A400M/A350, Boeing 787, Bombardier CSeries etc. On the other hand, AFDX standard only specifies the behavior that an underlying switch must follow, but leaves the architecture design open. This creates an open market for switch vendors. Among the different candidate designs for this market, the TDMA crossbar real-time switch architecture stands out as it complies with and even simplifies many mainstream switch architectures, hence lays a smooth evolution path toward AFDX. In this paper, we focus on analyzing this switch design for AFDX networks. We first prove that TDMA crossbar real-time switch architecture complies with the AFDX specifications; and derive closed-form formulae on the corresponding AFDX networks' traffic characteristics and end-to-end real-time delay bound. Then we prove the resource planning problem in the corresponding AFDX networks is NP-Hard. To address this NP-Hard challenge, we re-model the problem. Based upon the re-modeling, we propose an approximation algorithm.", "citation": "Citations (5)", "departments": ["Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "McGill University", "Hong Kong Polytechnic University"], "authors": ["Lei Rao.....http://dblp.org/pers/hd/r/Rao:Lei", "Qixin Wang.....http://dblp.org/pers/hd/w/Wang:Qixin", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Yufei Wang.....http://dblp.org/pers/hd/w/Wang:Yufei"], "conf": "infocom", "year": "2012", "pages": 9}