{"title": "Differentially Private Spatial Decompositions.", "fields": ["simple function", "k d tree", "spatial database", "information privacy", "differential privacy"], "abstract": "Differential privacy has recently emerged as the de facto standard for private data release. This makes it possible to provide strong theoretical guarantees on the privacy and utility of released data. While it is well-understood how to release data based on counts and simple functions under this guarantee, it remains to provide general purpose techniques to release data that is useful for a variety of queries. In this paper, we focus on spatial data such as locations and more generally any multi-dimensional data that can be indexed by a tree structure. Directly applying existing differential privacy methods to this type of data simply generates noise. We propose instead the class of ``private spatial decompositions'': these adapt standard spatial indexing methods such as quad trees and kd-trees to provide a private description of the data distribution. Equipping such structures with differential privacy requires several steps to ensure that they provide meaningful privacy guarantees. Various basic steps, such as choosing splitting points and describing the distribution of points within a region, must be done privately, and the guarantees of the different building blocks composed to provide an overall guarantee. Consequently, we expose the design space for private spatial decompositions, and analyze some key examples. A major contribution of our work is to provide new techniques for parameter setting and post-processing the output to improve the accuracy of query answers. Our experimental study demonstrates that it is possible to build such decompositions efficiently, and use them to answer a variety of queries privately with high accuracy.", "citation": "Citations (207)", "departments": ["AT&T", "AT&T", "AT&T", "North Carolina State University", "North Carolina State University"], "authors": ["Graham Cormode.....http://dblp.org/pers/hd/c/Cormode:Graham", "Cecilia M. Procopiuc.....http://dblp.org/pers/hd/p/Procopiuc:Cecilia_M=", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh", "Entong Shen.....http://dblp.org/pers/hd/s/Shen:Entong", "Ting Yu.....http://dblp.org/pers/hd/y/Yu:Ting"], "conf": "icde", "year": "2012", "pages": 12}