{"title": "Exact throughput capacity under power control in mobile ad hoc networks.", "fields": ["mobile ad hoc network", "network packet", "redundancy", "throughput", "power control"], "abstract": "The lack of a general capacity theory on mobile ad hoc networks (MANETs) is still a challenging roadblock stunting the application of such networks. The available works on this line mainly focus on deriving order sense results, which are helpful for us to explore the general scaling laws of throughput capacity but tell us little about the exact achievable throughput. This paper studies the exact per node throughput capacity of a MANET, where the transmission power of each node can be controlled to adapt to a specified transmission range υ and a generalized two-hop relay with limited packet redundancy f is adopted for packet routing. Based on the concept of automatic feedback control and the Markov chain model, we first develop a general theoretical framework to fully depict the complicated packet delivery process in the challenging MANET environment. With the help of the framework, we are then able to derive the exact per node throughput capacity for a fixed setting of both υ and f. Based on the new throughput result, we further explore the optimal throughput capacity for any f but a fixed υ and also determine the corresponding optimum setting of f to achieve it. This result helps us to understand how such optimal capacity varies with υ (and thus transmission power) and to find the maximum possible throughput capacity of such a network for any f and υ. Surprisingly, our results here indicate that usually such maximum throughput capacity can not be achieved through the local transmission, a fact different from what is generally believed in literature.", "citation": "Citations (43)", "departments": ["Tohoku University", "Future University Hakodate", "Tohoku University", "Tohoku University"], "authors": ["Jiajia Liu.....http://dblp.org/pers/hd/l/Liu:Jiajia", "Xiaohong Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaohong", "Hiroki Nishiyama.....http://dblp.org/pers/hd/n/Nishiyama:Hiroki", "Nei Kato.....http://dblp.org/pers/hd/k/Kato:Nei"], "conf": "infocom", "year": "2012", "pages": 9}