{"title": "Anchored desynchronization.", "fields": ["mathematical proof", "time division multiple access", "existential quantification", "distributed algorithm", "generalized processor sharing"], "abstract": "Distributed algorithms based on pulse-coupled oscillators have been recently proposed in [4], [14] for achieving desynchronization of a system of identical nodes. Though these algorithms are shown to work properly by various computer simulations, they are still lack of rigorous theoretical proofs for both the convergence of the algorithms and the rates of convergence for these algorithms. On the other hand, all the nodes are not likely to be identical in many practical applications. In particular, there might be a node that needs to interact with the “outside” world and thus may not have the freedom to adjust its local clock. Motivated by all these, in this paper we consider the desynchronization problem in a system where there exists an anchored node that never adjusts the phase of its oscillator. For such a system, we propose a generic anchored desynchronization algorithm that achieves ∈-desynchrony (defined in [4]) in O(n 2 ln(n over ∈)) rounds of firings. We also prove that our algorithm converges even for the generalized processor sharing (GPS) scheme, where every node is assigned a weight and the amount of resource received by a node is proportional to its weight. In comparison with the original algorithm in [4], we show that the rate of convergence of the original algorithm in [4] is not always better than ours and it is only better in the asymptotic regime.", "citation": "Citations (10)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Ching-Ming Lien.....http://dblp.org/pers/hd/l/Lien:Ching=Ming", "Shu-Hao Chang.....http://dblp.org/pers/hd/c/Chang:Shu=Hao", "Cheng-Shang Chang.....http://dblp.org/pers/hd/c/Chang:Cheng=Shang", "Duan-Shin Lee.....http://dblp.org/pers/hd/l/Lee:Duan=Shin"], "conf": "infocom", "year": "2012", "pages": 5}