{"title": "Adapting collaborative radiological practice to low-resource environments.", "fields": ["best practice", "human computer interaction", "communications system", "computer supported cooperative work", "teleradiology"], "abstract": "We describe how current radiological best practices are predicated on a sophisticated technological ecosystem usually comprised of multiple large-scale displays, and integrated record keeping and communication systems driven by high-speed networks. At the same time, current development of low-cost ultrasound (U/S) devices for low-resource settings trends towards small-scale, independent devices with palm-sized screens. We reviewed existing literature, analyzed findings from two years of fieldwork in Uganda, and conducted an interview study with clinicians about radiology work practices to determine which patterns and technologies contribute to the efficacy of ultrasound. We use these findings to inform how ultrasound technology in low-resource settings can most usefully be developed and deployed. In addition, findings are relevant for creating medical technologies for low-resource environments generally, as we make clear the importance of considering not just technology development aspects like power consumption and interface, but also larger technology and work ecosystems.", "citation": "Citations (9)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Beth E. Kolko.....http://dblp.org/pers/hd/k/Kolko:Beth_E=", "Alexis Hope.....http://dblp.org/pers/hd/h/Hope:Alexis", "Waylon Brunette.....http://dblp.org/pers/hd/b/Brunette:Waylon", "Karen Saville.....http://dblp.org/pers/hd/s/Saville:Karen", "Wayne Gerard.....http://dblp.org/pers/hd/g/Gerard:Wayne", "Michael Kawooya.....http://dblp.org/pers/hd/k/Kawooya:Michael", "Robert Nathan.....http://dblp.org/pers/hd/n/Nathan:Robert"], "conf": "cscw", "year": "2012", "pages": 10}