{"title": "Towards effective partition management for large graphs.", "fields": ["graph", "graph partition", "sparql", "graph operations", "ranging"], "abstract": "Searching and mining large graphs today is critical to a variety of application domains, ranging from community detection in social networks, to de novo genome sequence assembly. Scalable processing of large graphs requires careful partitioning and distribution of graphs across clusters. In this paper, we investigate the problem of managing large-scale graphs in clusters and study access characteristics of local graph queries such as breadth-first search, random walk, and SPARQL queries, which are popular in real applications. These queries exhibit strong access locality, and therefore require specific data partitioning strategies. In this work, we propose a Self Evolving Distributed Graph Management Environment (Sedge), to minimize inter-machine communication during graph query processing in multiple machines. In order to improve query response time and throughput, Sedge introduces a two-level partition management architecture with complimentary primary partitions and dynamic secondary partitions. These two kinds of partitions are able to adapt in real time to changes in query workload. (Sedge) also includes a set of workload analyzing algorithms whose time complexity is linear or sublinear to graph size. Empirical results show that it significantly improves distributed graph processing on today's commodity clusters.", "citation": "Citations (149)", "year": "2012", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "conf": "sigmod", "authors": ["Shengqi Yang.....http://dblp.org/pers/hd/y/Yang:Shengqi", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Bo Zong.....http://dblp.org/pers/hd/z/Zong:Bo", "Arijit Khan.....http://dblp.org/pers/hd/k/Khan:Arijit"], "pages": 12}