{"title": "On Text Clustering with Side Information.", "fields": ["constrained clustering", "data stream clustering", "fuzzy clustering", "brown clustering", "conceptual clustering"], "abstract": "Text clustering has become an increasingly important problem in recent years because of the tremendous amount of unstructured data which is available in various forms in online forums such as the web, social networks, and other information networks. In most cases, the data is not purely available in text form. A lot of side-information is available along with the text documents. Such side-information may be of different kinds, such as the links in the document, user-access behavior from web logs, or other non-textual attributes which are embedded into the text document. Such attributes may contain a tremendous amount of information for clustering purposes. However, the relative importance of this side-information may be difficult to estimate, especially when some of the information is noisy. In such cases, it can be risky to incorporate side-information into the clustering process, because it can either improve the quality of the representation for clustering, or can add noise to the process. Therefore, we need a principled way to perform the clustering process, so as to maximize the advantages from using this side information. In this paper, we design an algorithm which combines classical partitioning algorithms with probabilistic models in order to create an effective clustering approach. We present experimental results on a number of real data sets in order to illustrate the advantages of using such an approach.", "citation": "Citations (25)", "departments": ["IBM", "University of Illinois at Chicago", "University of Illinois at Chicago"], "authors": ["Charu C. Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Charu_C=", "Yuchen Zhao.....http://dblp.org/pers/hd/z/Zhao:Yuchen", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S="], "conf": "icde", "year": "2012", "pages": 11}