{"title": "BulkCompactor: Optimized deterministic execution via Conflict-Aware commit of atomic blocks.", "fields": ["commit", "three phase commit protocol", "transitive relation", "thread", "instruction set"], "abstract": "Recent proposals for determinism-enforcement architectures are able to honor the dependences between threads through a commit step that often becomes a performance bottleneck. As they commit code blocks (or chunks) in a round-robin order, if one chunk gets squashed due to a conflict, its successors also observe a stall. We call this effect transitive squash delay. This paper proposes a novel, high-performance approach to deterministic execution based on Conflict-Aware commit. Rather than committing chunks in strict round-robin order, the idea is to skip those chunks with conflicts and deterministically execute them slightly later. The scheme, called BulkCompactor, largely eliminates transitive squash delay, “compacts” the chunk commits, and substantially speeds-up execution. With BulkCompactor, the squash overhead is O(N) rather than O(N 2 ) as in round-robin. We describe BulkCompactor designs for machines with centralized or distributed commit. Finally, a simulation-based evaluation shows that BulkCompactor delivers performance comparable to nondeter-ministic systems. For example, for 32 processors, BulkCompactor incurs an average execution overhead of 22% over a nondetermin-istic system. The round-robin scheme's average overhead is 133%.", "citation": "Citations (2)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Yuelu Duan.....http://dblp.org/pers/hd/d/Duan:Yuelu", "Xing Zhou.....http://dblp.org/pers/hd/z/Zhou:Xing", "Wonsun Ahn.....http://dblp.org/pers/hd/a/Ahn:Wonsun", "Josep Torrellas.....http://dblp.org/pers/hd/t/Torrellas:Josep"], "conf": "hpca", "year": "2012", "pages": 12}