{"title": "Using host profiling to refine statistical application identification.", "fields": ["traffic flow", "deep packet inspection", "traffic classification", "traffic shaping", "internet traffic engineering"], "abstract": "The identification of Internet traffic applications is very important for ISPs and network administrators to protect their resources from unwanted traffic and prioritize some major applications. Statistical methods are preferred to port-based ones since they don't rely on the port number, which can change dynamically, and to deep packet inspection since they also work for encrypted traffic. These methods combine the statistical analysis of the application packet flow parameters, such as packet size and inter-packet time, with machine learning techniques. Other successful approaches rely on the way the hosts communicate and their traffic patterns to identify applications. In this paper, we propose a new online method for traffic classification that combines the statistical and host-based approaches in order to construct a robust and precise method for early Internet traffic identification. Without loss of generality we use the packet size as the main feature for the classification and we benefit from the traffic profile of the host (i.e., which application and how much) to refine the classification and decide in favor of this or that application. The host profile is then updated online based on the result of the classification of previous flows originated by or addressed to the same host. We evaluate our method on real traces using several applications. The results show that leveraging the traffic pattern of the host ameliorates the performance of statistical methods. They also prove the capacity of our solution to derive profiles for the traffic of Internet hosts and to identify the services they provide.", "citation": "Citations (12)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Mohamad Jaber.....http://dblp.org/pers/hd/j/Jaber:Mohamad", "Roberto G. Cascella.....http://dblp.org/pers/hd/c/Cascella:Roberto_G=", "Chadi Barakat.....http://dblp.org/pers/hd/b/Barakat:Chadi"], "conf": "infocom", "year": "2012", "pages": 5}