{"title": "Jetway: minimizing costs on inter-datacenter video traffic.", "fields": ["service provider", "computer network", "cloud computing", "high availability", "scalability"], "abstract": "It is typical for video streaming service providers (such as NetFlix) to rely on services from cloud providers (such as Amazon), in order to build a scalable video streaming platform with high availability. The trend is largely driven by the fact that cloud providers deploy a number of datacenters inter-connected by high-capacity links, spanning different geographical regions. Video traffic across datacenters, such as video replication and transit server-to-customer video serving, constitutes a large portion of a cloud provider's inter-datacenter traffic. Charged by ISPs, such inter-datacenter video traffic incurs substantial operational costs to a cloud provider. In this paper, we argue that costs incurred by such inter-datacenter video traffic can be reduced or even minimized by carefully choosing paths, and by assigning flow rates on each inter-datacenter link along every path. We present  Jetway , a new set of algorithms designed to minimize cloud providers' operational costs on inter-datacenter video traffic, by optimally routing video flows in an online fashion. Algorithms in  Jetway  are designed by following a methodical approach based on an in-depth theoretical analysis. As a highlight of this paper, we have built a real-world system framework to implement and deploy  Jetway  in the Amazon EC2 datacenters. With both simulations and real-world experiments using our implementation, we show that  Jetway  effectively helps transmitting videos across datacenters with reduced costs to cloud providers and satisfactory real-world performance.", "citation": "Citations (17)", "departments": ["University of Toronto", "University of Toronto", "Hong Kong University of Science and Technology"], "authors": ["Yuan Feng.....http://dblp.org/pers/hd/f/Feng:Yuan", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "mm", "year": "2012", "pages": 10}