{"title": "Discovering informative social subgraphs and predicting pairwise relationships from group photos.", "fields": ["social media", "machine learning", "categorization", "pairwise comparison", "graph"], "abstract": "An increasing number of users are contributing the sheer amount of group photos (e.g., for family, classmates, colleagues, etc.) on social media for the purpose of photo sharing and social communication. There arise strong needs for automatically understanding the group types (e.g., family vs. classmates) for recommendation services (e.g., recommending a family-friendly restaurant) and even predicting the pairwise relationships (e.g., mother-child) between the people in the photo for mining implicit social connections. Interestingly, we observe that the group photos are composed of atomic subgroups corresponding to certain social relationships. For this work, we propose a novel framework to (1) connect faces of different attributes and positions as a face graph and (2) discover informative subgraphs to represent social subgroups in group photos. A group photo can be further represented by a bag-of-face-subgraphs (BoFG) -- the occurring frequency of social subgroups, which is informative to categorize specific group types or events. We demonstrate the effectiveness of BoFG in recognizing family photos and achieve 30.5% relative improvement over the state-of-the-art low-level features. Moreover, we propose to predict the pairwise relationships (e.g., husband-wife) in a face graph by the co-occurrence information (e.g., co-occurring with a child) in the mined subgraphs. The experiments demonstrate that the informative social subgroups significantly outperform prior work (36% relatively) which considers merely facial attributes for determining pairwise relationships.", "citation": "Citations (25)", "departments": ["National Taiwan University", "National Taiwan University", "Academia Sinica"], "authors": ["Yan-Ying Chen.....http://dblp.org/pers/hd/c/Chen:Yan=Ying", "Winston H. Hsu.....http://dblp.org/pers/hd/h/Hsu:Winston_H=", "Hong-Yuan Mark Liao.....http://dblp.org/pers/hd/l/Liao:Hong=Yuan_Mark"], "conf": "mm", "year": "2012", "pages": 10}