{"title": "Discovering areas of interest with geo-tagged images and check-ins.", "fields": ["ranking", "exploit", "multimedia", "cluster analysis", "check in"], "abstract": "Geo-tagged image is an ideal source for the discovery of popular travel places. However, the aspects of popular venues for daily-life purposes like dining and shopping are often missing in the mined locations from geo-tagged images. Fortunately check-in websites provide us a unique opportunity of analyzing people's preferences in their daily lives to complement the knowledge mined from geo-tagged images. This paper presents a novel approach for the discovery of Areas of Interest (AoI). By analyzing both geo-tagged images and check-ins, the approach exploits travelers' flavors as well as the preferences of daily-life activities of local residents to find AoI in a city. The proposed approach consists of two major steps. Firstly, we devise a density-based clustering method to discover AoI, mainly based on the image densities but also reinforced by the secondary densities from the images' neighboring venues. Then we propose a novel joint authority analysis framework to rank AoI. The framework simultaneously considers both the location-location transitions, and the user-location relations. An interactive presentation interface for visualizing AoI is also presented. The approach is tested with very large datasets for Shanghai city. They consist of 49,460 geo-tagged images from Panoramio.com, and 1,361,547 check-ins from the check-in website Qieke.com. By evaluating the ranking accuracy and quality of AoI, we demonstrate great improvements of our method over compared methods.", "citation": "Citations (30)", "departments": ["University of Queensland", "University of Queensland", "Hong Kong University of Science and Technology", "University of Queensland", "École Polytechnique Fédérale de Lausanne"], "authors": ["Jiajun Liu.....http://dblp.org/pers/hd/l/Liu:Jiajun", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao", "Zhixian Yan.....http://dblp.org/pers/hd/y/Yan:Zhixian"], "conf": "mm", "year": "2012", "pages": 10}