{"title": "Learning-based Query Performance Modeling and Prediction.", "fields": ["query optimization", "performance prediction", "workload", "sargable", "ranging"], "abstract": "Accurate query performance prediction (QPP) is central to effective resource management, query optimization and query scheduling. Analytical cost models, used in current generation of query optimizers, have been successful in comparing the costs of alternative query plans, but they are poor predictors of execution latency. As a more promising approach to QPP, this paper studies the practicality and utility of sophisticated learning-based models, which have recently been applied to a variety of predictive tasks with great success, in both static (i.e., fixed) and dynamic query workloads. We propose and evaluate predictive modeling techniques that learn query execution behavior at different granularities, ranging from coarse-grained plan-level models to fine-grained operator-level models. We demonstrate that these two extremes offer a tradeoff between high accuracy for static workload queries and generality to unforeseen queries in dynamic workloads, respectively, and introduce a hybrid approach that combines their respective strengths by selectively composing them in the process of QPP. We discuss how we can use a training workload to (i) pre-build and materialize such models offline, so that they are readily available for future predictions, and (ii) build new models online as new predictions are needed. All prediction models are built using only static features (available prior to query execution) and the performance values obtained from the offline execution of the training workload. We fully implemented all these techniques and extensions on top of Postgre SQL and evaluated them experimentally by quantifying their effectiveness over analytical workloads, represented by well-established TPC-H data and queries. The results provide quantitative evidence that learning-based modeling for QPP is both feasible and effective for both static and dynamic workload scenarios.", "citation": "Citations (109)", "departments": ["Brown University", "Brown University", "Brown University", "Brown University", "Brown University"], "authors": ["Mert Akdere.....http://dblp.org/pers/hd/a/Akdere:Mert", "Ugur Çetintemel.....http://dblp.org/pers/hd/=/=Ccedil=etintemel:Ugur", "Matteo Riondato.....http://dblp.org/pers/hd/r/Riondato:Matteo", "Eli Upfal.....http://dblp.org/pers/hd/u/Upfal:Eli", "Stanley B. Zdonik.....http://dblp.org/pers/hd/z/Zdonik:Stanley_B="], "conf": "icde", "year": "2012", "pages": 12}