{"title": "A distributed optimal framework for mobile data gathering with concurrent data uploading in wireless sensor networks.", "fields": ["latency", "space division multiple access", "distributed algorithm", "mobile broadband", "message passing"], "abstract": "In this paper, we consider mobile data gathering in wireless sensor networks (WSNs) by using a mobile collector with multiple antennas. By taking into account the elastic nature of wireless link capacity and the power control for each sensor, we first propose a data gathering cost minimization (DaGCM) framework with concurrent data uploading, which is constrained by flow conservation, energy consumption, link capacity, compatibility among sensors and the bound on total sojourn time of the mobile collector at all anchor points. One of the main features of this framework is that it allows concurrent data uploading from sensors to the mobile collector to sharply shorten data gathering latency and significantly reduce energy consumption due to the use of multiple antennas and space-division multiple access technique. We then relax the DaGCM problem with Lagrangian dualization and solve it with the subgradient iteration algorithm. Furthermore, we present a distributed algorithm composed of cross-layer data control, routing, power control and compatibility determination subalgorithms with explicit message passing. We also give the subalgorithm for finding the optimal sojourn time of the mobile collector at different anchor points. Finally, we provide numerical results to show the convergence of the proposed DaGCM algorithm and its advantages over the algorithm without concurrent data uploading and power control in terms of data gathering latency and energy consumption.", "citation": "Citations (16)", "departments": ["Chongqing University", "Chongqing University"], "authors": ["Songtao Guo.....http://dblp.org/pers/hd/g/Guo:Songtao", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan"], "conf": "infocom", "year": "2012", "pages": 9}