{"title": "The Credit Suisse Meta-data Warehouse.", "fields": ["business analytics", "warehouse", "data warehouse", "dimensional modeling", "metadata"], "abstract": "This paper describes the meta-data warehouse of Credit Suisse that is productive since 2009. Like most other large organizations, Credit Suisse has a complex application landscape and several data warehouses in order to meet the information needs of its users. The problem addressed by the meta-data warehouse is to increase the agility and flexibility of the organization with regards to changes such as the development of a new business process, a new business analytics report, or the implementation of a new regulatory requirement. The meta-data warehouse supports these changes by providing services to search for information items in the data warehouses and to extract the lineage of information items. One difficulty in the design of such a meta-data warehouse is that there is no standard or well-known meta-data model that can be used to support such search services. Instead, the meta-data structures need to be flexible themselves and evolve with the changing IT landscape. This paper describes the current data structures and implementation of the Credit Suisse meta-data warehouse and shows how its services help to increase the flexibility of the whole organization. A series of example meta-data structures, use cases, and screenshots are given in order to illustrate the concepts used and the lessons learned based on feedback of real business and IT users within Credit Suisse.", "citation": "Citations (4)", "departments": ["Credit Suisse", "ETH Zurich", "Credit Suisse", "ETH Zurich", "Credit Suisse"], "authors": ["Claudio Jossen.....http://dblp.org/pers/hd/j/Jossen:Claudio", "Lukas Blunschi.....http://dblp.org/pers/hd/b/Blunschi:Lukas", "Magdalini Mori.....http://dblp.org/pers/hd/m/Mori:Magdalini", "Donald Kossmann.....http://dblp.org/pers/hd/k/Kossmann:Donald", "Kurt Stockinger.....http://dblp.org/pers/hd/s/Stockinger:Kurt"], "conf": "icde", "year": "2012", "pages": 12}