{"title": "The Yin and Yang of power and performance for asymmetric hardware and managed software.", "fields": ["system software", "exploit", "workload", "multi core processor", "ranging"], "abstract": "On the  hardware  side, asymmetric multicore processors present software with the challenge and opportunity of optimizing in two dimensions: performance and power. Asymmetric multicore processors (AMP) combine general-purpose  big  (fast, high power) cores and  small  (slow, low power) cores to meet power constraints. Realizing their energy efficiency opportunity requires workloads with differentiated performance and power characteristics.   On the software side, managed workloads written in languages such as C#, Java, JavaScript, and PHP are ubiquitous. Managed languages abstract over hardware using Virtual Machine (VM) services (garbage collection, interpretation, and/or just-in-time compilation) that together impose substantial energy and performance costs, ranging from 10% to over 80%. We show that these services manifest a differentiated performance and power workload. To differing degrees, they are parallel, asynchronous, communicate infrequently, and are not on the application?s critical path.   We identify a synergy between AMP and VM services that we exploit to attack the 40% average energy overhead due to VM services. Using measurements and very conservative models, we show that adding small cores tailored for VM services should deliver, at least, improvements in performance of 13%, energy of 7%, and performance per energy of 22%. The  yin  of VM services is overhead, but it meets the  yang  of small cores on an AMP. The  yin  of AMP is exposed hardware complexity, but it meets the  yang  of abstraction in managed languages. VM services fulfill the AMP requirement for an asynchronous, non-critical, differentiated, parallel, and ubiquitous workload to deliver energy efficiency. Generalizing this approach beyond system software to applications will require substantially more software and hardware investment, but these results show the potential energy efficiency gains are significant.", "citation": "Citations (96)", "year": "2012", "departments": ["Australian National University", "Australian National University", "Australian National University", "University of Texas at Austin"], "conf": "isca", "authors": ["Ting Cao.....http://dblp.org/pers/hd/c/Cao:Ting", "Stephen M. Blackburn.....http://dblp.org/pers/hd/b/Blackburn:Stephen_M=", "Tiejun Gao.....http://dblp.org/pers/hd/g/Gao:Tiejun", "Kathryn S. McKinley.....http://dblp.org/pers/hd/m/McKinley:Kathryn_S="], "pages": 12}