{"title": "Efficient Support of XQuery Update Facility in XML Enabled RDBMS.", "fields": ["xml base", "xml framework", "xml encryption", "xml schema editor", "xml database"], "abstract": "XQuery Update Facility (XQUF), which provides a declarative way of updating XML, has become recommendation by W3C. The SQL/XML standard, on the other hand, defines XMLType as a column data type in RDBMS environment and defines the standard SQL/XML operator, such as XML Query() to embed XQuery to query XMLType column in RDBMS. Based on this SQL/XML standard, XML enabled RDBMS becomes industrial strength platforms to host XML applications in a standard compliance way by providing XML store and query capability. However, updating XML capability support remains to be proprietary in RDBMS until XQUF becomes the recommendation. XQUF is agnostic of how XML is stored so that propagation of actual update to any persistent XML store is beyond the scope of XQUF. In this paper, we show how XQUF can be incorporated into XML Query() to effectively update XML stored in XMLType column in the environment of XML enabled RDBMS, such as Oracle XMLDB. We present various compile time and run time optimisation techniques to show how XQUF can be efficiently implemented to declaratively update XML stored in RDBMS. We present how our approaches of optimising XQUF for common physical XML storage models: native binary XML storage model and relational decomposition of XML storage model. Although our study is done using Oracle XMLDB, all of the presented optimisation techniques are generic to XML stores that need to support update of persistent XML store and not specific to Oracle XMLDB implementation.", "citation": "Citations (3)", "departments": ["Oracle Corporation", "Oracle Corporation", "Oracle Corporation"], "authors": ["Zhen Hua Liu.....http://dblp.org/pers/hd/l/Liu:Zhen_Hua", "Hui J. Chang.....http://dblp.org/pers/hd/c/Chang:Hui_J=", "Balasubramanyam Sthanikam.....http://dblp.org/pers/hd/s/Sthanikam:Balasubramanyam"], "conf": "icde", "year": "2012", "pages": 11}