{"title": "QuickIA: Exploring heterogeneous architectures on real prototypes.", "fields": ["juncture", "homogeneous", "multi core processor", "architecture", "scalability"], "abstract": "Over the last decade, homogeneous multi-core processors emerged and became the de-facto approach for offering high parallelism, high performance and scalability for a wide range of platforms. We are now at an interesting juncture where several critical factors (smaller form factor devices, power challenges, need for specialization, etc) are guiding architects to consider heterogeneous chips and platforms for the next decade and beyond. Exploring heterogeneous architectures is challenging since it involves re-evaluating architecture options, OS implications and application development. In this paper, we describe these research challenges and then introduce a heterogeneous prototype platform called QuickIA that enables rapid exploration of heterogeneous architectures employing multiple generations of Intel processors for evaluating the implications of asymmetry and FPGAs to experiment with specialized processors or accelerators. We also show example case studies using the QuickIA research prototype to highlight its value in conducting heterogeneous architecture, OS and applications research.", "citation": "Citations (76)", "departments": ["Intel", "Intel", "Intel", "Intel", "Intel"], "authors": ["Nagabhushan Chitlur.....http://dblp.org/pers/hd/c/Chitlur:Nagabhushan", "Ganapati Srinivasa.....http://dblp.org/pers/hd/s/Srinivasa:Ganapati", "Scott Hahn.....http://dblp.org/pers/hd/h/Hahn:Scott", "P. K. Gupta.....http://dblp.org/pers/hd/g/Gupta:P=_K=", "Dheeraj Reddy.....http://dblp.org/pers/hd/r/Reddy:Dheeraj", "David A. Koufaty.....http://dblp.org/pers/hd/k/Koufaty:David_A=", "Paul Brett.....http://dblp.org/pers/hd/b/Brett:Paul", "Abirami Prabhakaran.....http://dblp.org/pers/hd/p/Prabhakaran:Abirami", "Li Zhao.....http://dblp.org/pers/hd/z/Zhao:Li", "Nelson Ijih.....http://dblp.org/pers/hd/i/Ijih:Nelson", "Suchit Subhaschandra.....http://dblp.org/pers/hd/s/Subhaschandra:Suchit", "Sabina Grover.....http://dblp.org/pers/hd/g/Grover:Sabina", "Xiaowei Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaowei", "Ravi Iyer.....http://dblp.org/pers/hd/i/Iyer:Ravi"], "conf": "hpca", "year": "2012", "pages": 8}