{"title": "Re-founding software engineering - SEMAT at the age of three (keynote abstract).", "fields": ["feature oriented domain analysis", "information engineering", "software requirements", "software development", "social software engineering"], "abstract": "Software engineering is gravely hampered by immature practices. Specific problems include: The prevalence of fads more typical of the fashion industry than an engineering discipline; a huge number of methods and method variants, with differences little understood and artificially magnified; the lack of credible experimental evaluation and validation; and the split between industry practice and academic research. At the root of the problems we lack a sound, widely accepted theoretical basis. A prime example of such a basis is Maxwell’s equations in electrical engineering. It is difficult to fathom what electrical engineering would be today without those four concise equations. They are a great example to the statement “There is nothing so practical as a good theory”. In software engineering we have nothing similar, and there is widespread doubt whether it is needed. This talk will argue for the need of a basic theory in software engineering, a theory identifying its pure essence, its common ground or its kernel. The Semat (Software Engineering Methods and Theory) community addresses this huge challenge. It supports a process to refound software engineering based on a kernel of widely-agreed elements, extensible for specific uses, addressing both technology and people issues. This kernel represents the essence of software engineering. This talk promises to make you see the light in the tunnel.", "citation": "Citations (1)", "year": "2012", "departments": ["Royal Institute of Technology", "Royal Institute of Technology", "Ivar Jacobson I ... ternational, UK", "Ivar Jacobson I ... ternational, UK"], "conf": "kbse", "authors": ["Ivar Jacobson.....http://dblp.org/pers/hd/j/Jacobson:Ivar", "Ian Spence.....http://dblp.org/pers/hd/s/Spence:Ian", "Pontus Johnson.....http://dblp.org/pers/hd/j/Johnson:Pontus", "Mira Kajko-Mattsson.....http://dblp.org/pers/hd/k/Kajko=Mattsson:Mira"], "pages": 5}