{"title": "Use your frequency wisely: Explore frequency domain for channel contention and ACK.", "fields": ["overhead", "orthogonal frequency division multiplexing", "single antenna interference cancellation", "physical layer", "channel allocation schemes"], "abstract": "The promise of high speed (over 1Gbps) wireless transmission rate at the physical layer can be significantly compromised with the current design of 802.11 DCF. There are three overheads in the 802.11 MAC that contribute to the performance degradation: DIFS, random backoff and ACK. Motivated by the recent progress in OFDM and self-interference cancellation technologies, in this paper, we propose a novel MAC design called REPICK (REversed contention and PIggy-backed ACK) to collectively address all the three overheads. The key idea in our proposal is to take advantage of OFDM subcarriers in the frequency domain to enhance the MAC efficiency. In REPICK, we propose a novel reverse contention algorithm, which enables and facilitates receivers to contend channel in the frequency domain (reversed contention). We also design an efficient mechanism which allows ACKs from receivers to be piggy-backed through subcarriers together with the contention information (piggy-backed ACK). We prove through rigorous analysis that the proposed scheme can substantially reduce the overheads associated with 802.11 DCF and a guaranteed throughput gain can be obtained. In addition, results from extensive simulations demonstrate that REPICK can improve the throughput by up to 170%.", "citation": "Citations (34)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Xiaojun Feng.....http://dblp.org/pers/hd/f/Feng:Xiaojun", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2012", "pages": 9}