{"title": "Prudent Practices for Designing Malware Experiments: Status Quo and Outlook.", "fields": ["the internet", "malware", "correctness", "status quo", "computer security"], "abstract": "Malware researchers rely on the observation of malicious code in execution to collect datasets for a wide array of experiments, including generation of detection models, study of longitudinal behavior, and validation of prior research. For such research to reflect prudent science, the work needs to address a number of concerns relating to the correct and representative use of the datasets, presentation of methodology in a fashion sufficiently transparent to enable reproducibility, and due consideration of the need not to harm others. In this paper we study the methodological rigor and prudence in 36 academic publications from 2006-2011 that rely on malware execution. 40% of these papers appeared in the 6 highest-ranked academic security conferences. We find frequent shortcomings, including problematic assumptions regarding the use of execution-driven datasets (25% of the papers), absence of description of security precautions taken during experiments (71% of the articles), and oftentimes insufficient description of the experimental setup. Deficiencies occur in top-tier venues and elsewhere alike, highlighting a need for the community to improve its handling of malware datasets. In the hope of aiding authors, reviewers, and readers, we frame guidelines regarding transparency, realism, correctness, and safety for collecting and using malware datasets.", "citation": "Citations (131)", "departments": ["University of Erlangen-Nuremberg", "University of California, Berkeley", "International Computer Science Institute", "International Computer Science Institute", "Computer Systems"], "authors": ["Christian Rossow.....http://dblp.org/pers/hd/r/Rossow:Christian", "Christian J. Dietrich.....http://dblp.org/pers/hd/d/Dietrich:Christian_J=", "Chris Grier.....http://dblp.org/pers/hd/g/Grier:Chris", "Christian Kreibich.....http://dblp.org/pers/hd/k/Kreibich:Christian", "Vern Paxson.....http://dblp.org/pers/hd/p/Paxson:Vern", "Norbert Pohlmann.....http://dblp.org/pers/hd/p/Pohlmann:Norbert", "Herbert Bos.....http://dblp.org/pers/hd/b/Bos:Herbert", "Maarten van Steen.....http://dblp.org/pers/hd/s/Steen:Maarten_van"], "conf": "sp", "year": "2012", "pages": 15}