{"title": "Don't Be Strict in Local Search!", "fields": ["incremental heuristic search", "iterated local search", "interpolation search", "combinatorial search", "guided local search"], "abstract": "Local Search is one of the fundamental approaches to combinatorial optimization and it is used throughout AI. Several local search algorithms are based on searching the k-exchange neighborhood. This is the set of solutions that can be obtained from the current solution by exchanging at most k elements. As a rule of thumb, the larger k is, the better are the chances of finding an improved solution. However, for inputs of size n, a naive brute-force search of the k-exchange neighborhood requires nO(k) time, which is not practical even for very small values of k.\n\nFellows et al. (IJCAI 2009) studied whether this brute-force search is avoidable and gave positive and negative answers for several combinatorial problems. They used the notion of local search in a strict sense. That is, an improved solution needs to be found in the k-exchange neighborhood even if a global optimum can be found efficiently.\n\nInthis paper we consider a natural relaxation of local search, called permissive local search (Marx and Schlotter, IWPEC 2009) and investigate whether it enhances the domain of tractable inputs. We exemplify this approach on a fundamental combinatorial problem, VERTEX COVER. More precisely, we show that for a class of inputs, finding an optimum is hard, strict local search is hard, but permissive local search is tractable.\n\nWe carry out this investigation in the framework of parameterized complexity.", "citation": "Citations (12)", "departments": ["University of New South Wales", "University of Paris", "Vienna University of Technology", "Vienna University of Technology", "The Institute o ... tical Sciences"], "authors": ["Serge Gaspers.....http://dblp.org/pers/hd/g/Gaspers:Serge", "Eun Jung Kim.....http://dblp.org/pers/hd/k/Kim_0002:Eun_Jung", "Sebastian Ordyniak.....http://dblp.org/pers/hd/o/Ordyniak:Sebastian", "Saket Saurabh.....http://dblp.org/pers/hd/s/Saurabh_0001:Saket", "Stefan Szeider.....http://dblp.org/pers/hd/s/Szeider:Stefan"], "conf": "aaai", "year": "2012", "pages": -1}