{"title": "Maximizing profit on user-generated content platforms with heterogeneous participants.", "fields": ["subsidy", "utility maximization problem", "best response", "payment", "user generated content"], "abstract": "In this paper, we consider a user-generated content platform monetized through advertising and managed by an intermediary. To maximize the intermediary's profit given the rational decision-making of content viewers and heterogeneous content producers, a payment scheme is proposed in which the intermediary can either tax or subsidize the content producers. First, we use a model with a representative content viewer to determine how the content viewers' attention is allocated across available content by solving a utility maximization problem. Then, by modeling the content producers as self-interested agents making independent production decisions, we show that there exists a unique equilibrium in the content production stage, and propose a best-response dynamics to model the decision-making process. Next, we study the intermediary's optimal payment based on decisions made by the representative content viewer and the content producers. In particular, by considering the well-known quality-adjusted Dixit-Stiglitz utility function for the representative content viewer, we derive explicitly the optimal payment maximizing the intermediary's profit and characterize analytical conditions under which the intermediary should tax or subsidize the content producers. Finally, we generalize the analysis by considering heterogeneity in terms of production costs among the content producers.", "citation": "Citations (5)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Shaolei Ren.....http://dblp.org/pers/hd/r/Ren:Shaolei", "Jaeok Park.....http://dblp.org/pers/hd/p/Park:Jaeok", "Mihaela van der Schaar.....http://dblp.org/pers/hd/s/Schaar:Mihaela_van_der"], "conf": "infocom", "year": "2012", "pages": 9}