{"title": "Quantitative Verification of Implantable Cardiac Pacemakers.", "fields": ["software quality", "embedded software", "correctness", "automata theory", "bradycardia"], "abstract": "Implantable medical devices, such as cardiac pacemakers, must be designed and programmed to the highest levels of safety and reliability. Recently, errors in embedded software have led to a substantial increase in safety alerts, costly device recalls or even patient death. To address such issues, we propose a model-based framework for quantitative, automated verification of pacemaker software. We adapt the electrocardiogram model of Clifford et al, which generates realistic normal and abnormal heart beat behaviours, with probabilistic transitions between them, to produce a timed sequence of action potential signals that serve as pacemaker input. Working with the timed automata model of the pacemaker by Jiang et al, we develop a methodology for deriving the composition of the heart and the pacemaker, based on discretisation. The main correctness properties we consider include checking that the pacemaker corrects Bradycardia (slow heart beat) and does not induce Tachycardia (fast heart beat), for a range of realistic heart behaviours. We also analyse under sensing, through considering noise on sensor readings, and energy usage. We implement the framework using the probabilistic model checker PRISM and MATLAB and demonstrate encouraging experimental results. Our approach can be adapted to individual patients and is applicable to other pacemaker models.", "citation": "Citations (20)", "year": "2012", "departments": ["University of Oxford", "University of Oxford", "University of Oxford", "University of Oxford"], "conf": "rtss", "authors": ["Taolue Chen.....http://dblp.org/pers/hd/c/Chen:Taolue", "Marco Diciolla.....http://dblp.org/pers/hd/d/Diciolla:Marco", "Marta Z. Kwiatkowska.....http://dblp.org/pers/hd/k/Kwiatkowska:Marta_Z=", "Alexandru Mereacre.....http://dblp.org/pers/hd/m/Mereacre:Alexandru"], "pages": 10}