{"title": "PReFilter: An efficient privacy-preserving Relay Filtering scheme for delay tolerant networks.", "fields": ["network packet", "encryption", "network performance", "relay", "delay tolerant networking"], "abstract": "Without direct path, information delivery in sparse delay tolerant networks (DTNs) typically relies on intermittent relays, making the transmission not only unreliable but also time consuming. To make the matter even worse, the source nodes may transmit some encrypted “junk” information, similar as the spam emails in current mail systems, to the destinations; without effective control, the delivery of encrypted junk information would significantly consume the precious resource of DTN and accordingly throttle the network efficiency. To address this challenging issue, we propose PReFilter, an efficient privacy-preserving relay filter scheme to prevent the relay of encrypted junk information early in DTNs. In PReFilter, each node maintains a specific filtering policy based on its interests, and distributes this policy to a group of “friends” in the network in advance. By applying the filtering policy, the friends can filter the junk packets which are heading to the node during the relay. Note that the keywords in the filtering policy may disclose the node's interest/preference to some extent, harming the privacy of nodes, a privacy-preserving filtering policy distribution technique is introduced, which will keep the sensitive keywords secret in the filtering policy. Through detailed security analysis, we demonstrate that PReFilter can prevent strong privacy-curious adversaries from learning the filtering keywords, and discourage a weak privacy-curious friend to guess the filtering keywords from the filtering policy. In addition, with extensive simulations, we show that PReFilter is not only effective in the filtering of junk packets but also significantly improve the network performance with the dramatically reduced delivery cost due to the junk packets.", "citation": "Citations (25)", "departments": ["University of Waterloo", "University of Ontario Institute of Technology", "University of Waterloo", "University of Waterloo", "university of lille"], "authors": ["Rongxing Lu.....http://dblp.org/pers/hd/l/Lu:Rongxing", "Xiaodong Lin.....http://dblp.org/pers/hd/l/Lin:Xiaodong", "Tom H. Luan.....http://dblp.org/pers/hd/l/Luan:Tom_H=", "Xiaohui Liang.....http://dblp.org/pers/hd/l/Liang:Xiaohui", "Xu Li.....http://dblp.org/pers/hd/l/Li_0001:Xu", "Le Chen.....http://dblp.org/pers/hd/c/Chen:Le", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin"], "conf": "infocom", "year": "2012", "pages": 9}