{"title": "Search-Based Path Planning with Homotopy Class Constraints in 3D.", "fields": ["n connected", "cauchy s integral theorem", "residue theorem", "cauchy s integral formula", "eilenberg maclane space"], "abstract": "Homotopy classes of trajectories, arising due to the presence of obstacles, are defined as sets of trajectories that can be transformed into each other by gradual bending and stretching without colliding with obstacles. The problem of exploring/finding the different homotopy classes in an environment and the problem of finding least-cost paths restricted to a specific homotopy class (or not belonging to certain homotopy classes) arises frequently in such applications as predicting paths for unpredictable entities and deployment of multiple agents for efficient exploration of an environment. In (Bhattacharya, Kumar, and Likhachev 2010) we have shown how homotopy classes of trajectories on a two-dimensional plane with obstacles can be classified and identified using the Cauchy Integral Theorem and the Residue Theorem from Complex Analysis. In more recent work (Bhattacharya, Likhachev, and Kumar 2011) we extended this representation to three-dimensional spaces by exploiting certain laws from the Theory of Electromagnetism (Biot-Savart law and Ampere's Law) for representing and identifying homotopy classes in three dimensions in an efficient way. Using such a representation, we showed that homotopy class constraints can be seamlessly weaved into graph search techniques for determining optimal path constrained to certain homotopy classes or forbidden from others, as well as for exploring different homotopy classes in an environment.", "citation": "Citations (96)", "departments": ["University of Pennsylvania", "Carnegie Mellon University", "University of Pennsylvania"], "authors": ["Subhrajit Bhattacharya.....http://dblp.org/pers/hd/b/Bhattacharya:Subhrajit", "Maxim Likhachev.....http://dblp.org/pers/hd/l/Likhachev:Maxim", "Vijay Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Vijay"], "conf": "aaai", "year": "2012", "pages": -1}