{"title": "Towards optimal energy store-carry-and-deliver for PHEVs via V2G system.", "fields": ["smart grid", "electric vehicle", "energy accounting", "electricity pricing", "inventory theory"], "abstract": "As an important component of smart grid, the vehicle-to-grid (V2G) system is recently introduced to enable bidirectional energy delivery between the power grid and plug-in electric vehicles. Communication technology is incorporated to facilitate the energy delivery by providing electricity pricing and energy demand information. However, different from the stationary energy storage systems, the energy store-carry-and-deliver mechanism for a V2G system poses new challenges for performance optimization, such as bi-directional energy flow and non-stationary energy demand. How to utilize the statistical information provided by the communication system to achieve efficient energy delivery is critical for a V2G system and is still an open issue. In this paper, we address a specific problem in this new research area, i.e., daily energy cost minimization of vehicle owners under time-of-use (TOU) electricity pricing. We investigate a plug-in hybrid electric vehicle (PHEV) with a realistic battery model, which is general for both battery electric cars and plug-in hybrids. A dynamic programming formulation is established by considering the bidirectional energy flow, non-stationary energy demand, battery characteristics, and TOU electricity price. We prove the optimality of a state-dependent double-threshold (or (S, S′)) policy based on the stochastic inventory theory. A modified backward iteration algorithm is devised for practical applications, where an exponentially weighted moving average (EWMA) algorithm is used to estimate the statistics of PHEV mobility and energy demand. The performance of the proposed scheme is demonstrated by simulations based on survey and real data collected from Canadian households. Numerical results indicate that our proposed scheme performs closely to a scheme with a priori knowledge of the PHEV mobility and energy demand information. Compared with the existing approaches, the proposed scheme can achieve energy cost reduction, which increases with the battery capacity.", "citation": "Citations (65)", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Hao Liang.....http://dblp.org/pers/hd/l/Liang_0002:Hao", "Bong Jun Choi.....http://dblp.org/pers/hd/c/Choi:Bong_Jun", "Weihua Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Weihua", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin"], "conf": "infocom", "year": "2012", "pages": 9}