{"title": "Optimal task assignment in multithreaded processors: a statistical approach.", "fields": ["multithreading", "linear bottleneck assignment problem", "weapon target assignment problem", "generalized assignment problem", "deadline monotonic scheduling"], "abstract": "The introduction of massively multithreaded (MMT) processors, comprised of a large number of cores with many shared resources, has made task scheduling, in particular task to hardware thread assignment, one of the most promising ways to improve system performance. However, finding an optimal task assignment for a workload running on MMT processors is an NP-complete problem. Due to the fact that the performance of the best possible task assignment is unknown, the room for improvement of current task-assignment algorithms cannot be determined. This is a major problem for the industry because it could lead to: (1)~A waste of resources if excessive effort is devoted to improving a task assignment algorithm that already provides a performance that is close to the optimal one, or (2)~significant performance loss if insufficient effort is devoted to improving poorly-performing task assignment algorithms.   In this paper, we present a method based on Extreme Value Theory that allows the prediction of the performance of the optimal task assignment in MMT processors. We further show that executing a sample of several hundred or several thousand  random  task assignments is enough to obtain, with very high confidence, an assignment with a performance that is close to the optimal one. We validate our method with an industrial case study for a set of multithreaded network applications running on an UltraSPARC~T2 processor.", "citation": "Citations (28)", "year": "2012", "departments": ["Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia"], "conf": "asplos", "authors": ["Petar Radojkovic.....http://dblp.org/pers/hd/r/Radojkovic:Petar", "Vladimir Cakarevic.....http://dblp.org/pers/hd/c/Cakarevic:Vladimir", "Miquel Moretó.....http://dblp.org/pers/hd/m/Moret=oacute=:Miquel", "Javier Verdú.....http://dblp.org/pers/hd/v/Verd=uacute=:Javier", "Alex Pajuelo.....http://dblp.org/pers/hd/p/Pajuelo:Alex", "Francisco J. Cazorla.....http://dblp.org/pers/hd/c/Cazorla:Francisco_J=", "Mario Nemirovsky.....http://dblp.org/pers/hd/n/Nemirovsky:Mario", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "pages": 14}