{"title": "Building a dictionary of image fragments.", "fields": ["contextual image classification", "object detection", "feature extraction", "discriminative model", "image segmentation"], "abstract": "We show how to build large dictionaries of meaningful image fragments. These fragments could represent objects, objects in a local context, or parts of scenes. Our fragments operate as region-based exemplars, and we show how they can be used for image classification, to localize objects, and to compose new images. While each of these activities has been demonstrated before, each has required manually extracted fragments. Because our method for fragment extraction is automatic it can operate at a large scale. Our method uses recent advances in generic object detection techniques, together with discriminative tests to obtain good, clean fragment sets with extensive diversity. Our fragments are organized by the tags of the source images to build a semantically organized fragment table. A good set of fragment exemplars describes only the object, rather than object+context. Context could help identify an object; but it could also contribute noise, because other objects might appear in the same context. We show a slight improvement in classification performance by two standard exemplar matching methods using our fragment dictionary over such methods using image exemplars. This suggests that knowing the support of an exemplar is valuable. Furthermore, we demonstrate our automatically built fragment dictionary is capable of good localization. Finally, our fragment dictionary supports a keyword based fragment search system, which allows artists to get the fragments they need to make image collages.", "citation": "Citations (8)", "year": "2012", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "cvpr", "authors": ["Zicheng Liao.....http://dblp.org/pers/hd/l/Liao:Zicheng", "Ali Farhadi.....http://dblp.org/pers/hd/f/Farhadi:Ali", "Yang Wang.....http://dblp.org/pers/hd/w/Wang_0003:Yang", "Ian Endres.....http://dblp.org/pers/hd/e/Endres:Ian", "David A. Forsyth.....http://dblp.org/pers/hd/f/Forsyth:David_A="], "pages": 8}