{"title": "Socializing volunteers in an online community: a field experiment.", "fields": ["social experiment", "mentorship", "technical support", "online community", "cohort"], "abstract": "Although many off-line organizations give their employees training, mentorship, a cohort and other socialization experiences that improve their retention and productivity, online production communities rarely do this. This paper describes the planning, execution and evaluation of a socialization regime for an online technical support community. In a two-phase project, we first automatically identified from participants' early behavior, those with high potential to become core members. We then designed, delivered and experimentally evaluated socialization experiences intended to build commitment and competence among these potential core members. We were able to identify potential core members with high accuracy from only two weeks of behavior. A year later, those classified as potential core members participated in the community ten times more actively than those not identified. In an evaluation experiment, some potential core members were randomly assigned to receive socialization experiences, while others were not. A year later, those who had participated in the socialization regime contributed more answers in the community compared to those in the control condition. The socialization experiences, however, undercut their sense of connection to the community and the quality of their contributions. We discuss what was effective and what could be improved in designing socialization experiences for online groups.", "citation": "Citations (19)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "University of Minnesota", "University of Minnesota"], "authors": ["Rosta Farzan.....http://dblp.org/pers/hd/f/Farzan:Rosta", "Robert E. Kraut.....http://dblp.org/pers/hd/k/Kraut:Robert_E=", "Aditya Pal.....http://dblp.org/pers/hd/p/Pal:Aditya", "Joseph A. Konstan.....http://dblp.org/pers/hd/k/Konstan:Joseph_A="], "conf": "cscw", "year": "2012", "pages": 10}