{"title": "scc: cluster storage provisioning informed by application characteristics and SLAs.", "fields": ["homogeneous", "compiler", "software deployment", "service level", "provisioning"], "abstract": "Storage for cluster applications is typically provisioned based on rough, qualitative characterizations of applications. Moreover, configurations are often selected based on rules of thumb and are usually homogeneous across a deployment; to handle increased load, the application is simply scaled out across additional machines and storage of the same type. As deployments grow larger and storage options (e.g., disks, SSDs, DRAM) diversify, however, current practices are becoming increasingly inefficient in trading off cost versus performance.\n\nTo enable more cost-effective deployment of cluster applications, we develop scc--a storage configuration compiler for cluster applications. scc automates cluster configuration decisions based on formal specifications of application behavior and hardware properties. We study a range of storage configurations and identify specifications that succinctly capture the trade-offs offered by different types of hardware, as well as the varying demands of application components. We apply scc to three representative applications and find that scc is expressive enough to meet application Service Level Agreements (SLAs) while delivering 2-4.5× savings in cost on average compared to simple scale-out options. scc's advantage stems mainly from its ability to configure heterogeneous--rather than conventional, homogeneous--cluster architectures to optimize cost.", "citation": "Citations (18)", "departments": ["University of California, Riverside", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Harsha V. Madhyastha.....http://dblp.org/pers/hd/m/Madhyastha:Harsha_V=", "John McCullough.....http://dblp.org/pers/hd/m/McCullough:John", "George Porter.....http://dblp.org/pers/hd/p/Porter:George", "Rishi Kapoor.....http://dblp.org/pers/hd/k/Kapoor:Rishi", "Stefan Savage.....http://dblp.org/pers/hd/s/Savage:Stefan", "Alex C. Snoeren.....http://dblp.org/pers/hd/s/Snoeren:Alex_C=", "Amin Vahdat.....http://dblp.org/pers/hd/v/Vahdat:Amin"], "conf": "fast", "year": "2012", "pages": 1}