{"title": "When video search goes wrong: predicting query failure using search engine logs and visual search results.", "fields": ["phrase search", "ranking", "search analytics", "sargable", "web search query"], "abstract": "The recent increase in the volume and variety of video content available online presents growing challenges for video search. Users face increased difficulty in formulating effective queries and search engines must deploy highly effective algorithms to provide relevant results. Although lately much effort has been invested in optimizing video search engine results, relatively little attention has been given to predicting for which queries results optimization is most useful, i.e., predicting which queries will fail. Being able to predict when a video search query would fail is likely to make the video search result optimization more efficient and effective, improve the search experience for the user by providing support in the query formulation process and in this way boost the development of video search engines in general. While insight about a query's performance in general could be obtained using the well-known concept of query performance prediction (QPP), we propose a novel approach for predicting a failure of a video search query in the specific context of a search session. Our 'context-aware query failure' prediction approach uses a combination of 'user indicators' and 'engine indicators' to predict whether a particular query is likely to fail in the context of a particular search session. User indicators are derived from the search log and capture the patterns of query (re)formulation behavior and the click-through data of a user during a typical video search session. Engine indicators are derived from the video search results list and capture the visual variance of search results that would be offered to the user for the given query. We validate our approach experimentally on a test set containing 1+ million video search queries and show its effectiveness compared to a set of conventional QPP baselines. Our approach achieves a 13% relative improvement over the baseline.", "citation": "Citations (3)", "departments": ["Delft University of Technology", "Microsoft", "Delft University of Technology", "Microsoft", "Delft University of Technology"], "authors": ["Christoph Kofler.....http://dblp.org/pers/hd/k/Kofler:Christoph", "Linjun Yang.....http://dblp.org/pers/hd/y/Yang:Linjun", "Martha Larson.....http://dblp.org/pers/hd/l/Larson:Martha", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Alan Hanjalic.....http://dblp.org/pers/hd/h/Hanjalic:Alan", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2012", "pages": 10}