{"title": "Towards an upper ontology and methodology for robotics and automation.", "fields": ["suggested upper merged ontology", "upper ontology", "distributed development", "process ontology", "ontology based data integration"], "abstract": "In this article, we present the ongoing efforts within the newly formed IEEE-RAS Working Group named Ontologies for Robotics and Automation. We focus in particular on one of the four subgroups that compose this working group, called the Upper Ontology/Methodology (UpOM) subgroup. As the name indicates, the aim of this subgroup is to develop an upper ontology and a methodology for ontology building and evaluation. This methodology will be used to coordinate the distributed development of domain specific ontologies by the other three subgroups, and to generate a global ontology that we hope will contribute to the standardization process of robotics and automation. This paper presents the composition, the envisioned methodology, and the future work of the UpOM subgroup. It also discusses some general aspects related to ontologies for the robotics and automation field, and to the efforts in standardizing them.", "citation": "Not cited", "departments": ["Universidade Federal do Rio Grande do Sul", "University of Paris", "National Institute of Standards and Technology", "Öebro University, Sweden", "CEA LIST Institute, France"], "authors": ["Edson Prestes.....http://dblp.org/pers/hd/p/Prestes:Edson", "Abdelghani Chibani.....http://dblp.org/pers/hd/c/Chibani:Abdelghani", "Alessandro Saffiotti.....http://dblp.org/pers/hd/s/Saffiotti:Alessandro", "Craig Schlenoff.....http://dblp.org/pers/hd/s/Schlenoff:Craig", "Sébastien Gérard.....http://dblp.org/pers/hd/g/G=eacute=rard:S=eacute=bastien", "Ricardo Sanz.....http://dblp.org/pers/hd/s/Sanz:Ricardo", "Marcos E. Barreto.....http://dblp.org/pers/hd/b/Barreto:Marcos_E=", "Raj Madhavan.....http://dblp.org/pers/hd/m/Madhavan:Raj", "Yacine Amirat.....http://dblp.org/pers/hd/a/Amirat:Yacine"], "conf": "huc", "year": "2012", "pages": 10}