{"title": "Walnut: a unified cloud object store.", "fields": ["information repository", "latency", "cloud storage", "data management", "converged storage"], "abstract": "Walnut is an object-store being developed at Yahoo! with the goal of serving as a common low-level storage layer for a variety of cloud data management systems including Hadoop (a MapReduce system), MObStor (a multimedia serving system), and PNUTS (an extended key-value serving system). Thus, a key performance challenge is to meet the latency and throughput requirements of the wide range of workloads commonly observed across these diverse systems. The motivation for Walnut is to leverage a carefully optimized low-level storage system, with support for elasticity and high-availability, across all of Yahoo!'s data clouds. This would enable sharing of hardware resources across hitherto siloed clouds of different types, offering greater potential for intelligent load balancing and efficient elastic operation, and simplify the operational tasks related to data storage.   In this paper, we discuss the motivation for unifying different storage clouds, describe the requirements of a common storage layer, and present the Walnut design, which uses a quorum-based replication protocol and one-hop direct client access to the data in most regular operations. A unique contribution of Walnut is its hybrid object strategy, which efficiently supports both small and large objects. We present experiments based on both synthetic and real data traces, showing that Walnut works well over a wide range of workloads, and can indeed serve as a common low-level storage layer across a range of cloud systems.", "citation": "Citations (34)", "year": "2012", "departments": ["Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!", "Yahoo!"], "conf": "sigmod", "authors": ["Jianjun Chen.....http://dblp.org/pers/hd/c/Chen_0001:Jianjun", "Chris Douglas.....http://dblp.org/pers/hd/d/Douglas:Chris", "Michi Mutsuzaki.....http://dblp.org/pers/hd/m/Mutsuzaki:Michi", "Patrick Quaid.....http://dblp.org/pers/hd/q/Quaid:Patrick", "Raghu Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Raghu", "Sriram Rao.....http://dblp.org/pers/hd/r/Rao:Sriram", "Russell Sears.....http://dblp.org/pers/hd/s/Sears:Russell"], "pages": 12}