{"title": "On managing quality of experience of multiple video streams in wireless networks.", "fields": ["multiplexing", "wimax", "streams", "greedy algorithm", "variable bitrate", "wi fi array"], "abstract": "Managing the Quality-of-Experience (QoE) of video streaming for wireless clients is becoming increasingly important due to the rapid growth of video traffic on wireless networks. The inherent variability of the wireless channel as well as the Variable Bit Rate (VBR) of the compressed video streams make QoE management a challenging problem. Prior work has studied this problem in the context of transmitting a single video stream. In this paper, we investigate multiplexing schemes to transmit multiple video streams from a base station to mobile clients that use number of playout stalls as a performance metric. In this context, we present an epoch-by-epoch framework to fairly allocate wireless transmission slots to streaming videos. In each epoch our scheme essentially reduces the vulnerability to stalling by allocating slots to videos in a way that maximizes the minimum ‘playout lead’ across all videos. Next, we show that the problem of allocating slots fairly is NP-complete even for a constant number of videos. We then present a fast lead-aware greedy algorithm for the problem. Our choice of greedy algorithm is motivated by the fact that this algorithm is optimal when the channel quality of a user remains unchanged within an epoch (but different users may experience different channel quality). Moreover, our experimental results based on public MPEG-4 video traces and wireless channel traces that we collected from a WiMAX test-bed show that the lead-aware greedy approach performs a fair distribution of stalls across the clients when compared to other algorithms, while still maintaining similar or lower average number of stalls per client.", "citation": "Citations (31)", "departments": ["IBM", "University of Massachusetts Amherst", "IBM", "IBM", "IBM", "University of Massachusetts Amherst", "Xerox", "IBM", "University of Massachusetts Amherst", "IBM"], "authors": ["Partha Dutta.....http://dblp.org/pers/hd/d/Dutta:Partha", "Anand Seetharam.....http://dblp.org/pers/hd/s/Seetharam:Anand", "Vijay Arya.....http://dblp.org/pers/hd/a/Arya:Vijay", "Malolan Chetlur.....http://dblp.org/pers/hd/c/Chetlur:Malolan", "Shivkumar Kalyanaraman.....http://dblp.org/pers/hd/k/Kalyanaraman:Shivkumar", "Jim Kurose.....http://dblp.org/pers/hd/k/Kurose:Jim"], "conf": "infocom", "year": "2012", "pages": 9}