{"title": "Discriminately decreasing discriminability with learned image filters.", "fields": ["contextual image classification", "machine learning", "facial expression", "facial recognition system", "spurious relationship"], "abstract": "In machine learning and computer vision, input signals are often filtered to increase data discriminability. For example, preprocessing face images with Gabor band-pass filters is known to improve performance in expression recognition tasks [1]. Sometimes, however, one may wish to purposely decrease discriminability of one classification task (a “distractor” task), while simultaneously preserving information relevant to another task (the target task): For example, due to privacy concerns, it may be important to mask the identity of persons contained in face images before submitting them to a crowdsourcing site (e.g., Mechanical Turk) when labeling them for certain facial attributes. Suppressing discriminability in distractor tasks may also be needed to improve inter-dataset generalization: training datasets may sometimes contain spurious correlations between a target attribute (e.g., facial expression) and a distractor attribute (e.g., gender). We might improve generalization to new datasets by suppressing the signal related to the distractor task in the training dataset. This can be seen as a special form of supervised regularization. In this paper we present an approach to automatically learning preprocessing filters that suppress discriminability in distractor tasks while preserving it in target tasks. We present promising results in simulated image classification problems and in a realistic expression recognition problem.", "citation": "Citations (5)", "year": "2012", "departments": ["University of California, San Diego", "University of California, San Diego"], "conf": "cvpr", "authors": ["Jacob Whitehill.....http://dblp.org/pers/hd/w/Whitehill:Jacob", "Javier R. Movellan.....http://dblp.org/pers/hd/m/Movellan:Javier_R="], "pages": 8}