{"title": "The Locality of Distributed Symmetry Breaking.", "fields": ["planar graph", "log log plot", "degree", "arboricity", "vertex", "binary logarithm", "maximal independent set", "degeneracy"], "abstract": "Symmetry-breaking problems are among the most well studied in the field of distributed computing and yet the most fundamental questions about their complexity remain open. In this article we work in the LOCAL model (where the input graph and underlying distributed network are identical) and study the  randomized  complexity of four fundamental symmetry-breaking problems on graphs: computing MISs (maximal independent sets), maximal matchings, vertex colorings, and ruling sets. A small sample of our results includes the following:   —An MIS algorithm running in  O (log 2 D Δ L 2√log  n , and comes close to the Ω(flog Δ log log Δ lower bound of Kuhn, Moscibroda, and Wattenhofer.   —A maximal matching algorithm running in  O (log Δ + log  4 log  n ) time. This is the first significant improvement to the 1986 algorithm of Israeli and Itai. Moreover, its dependence on Δ is  nearly optimal .   —A (Δ + 1)-coloring algorithm requiring  O (log Δ + 2  o (√log log  n )  time, improving on an  O (log Δ + √log  n )-time algorithm of Schneider and Wattenhofer.   —A method for reducing symmetry-breaking problems in low arboricity/degeneracy graphs to low-degree graphs. (Roughly speaking, the arboricity or degeneracy of a graph bounds the density of any subgraph.) Corollaries of this reduction include an  O (√log  n )-time maximal matching algorithm for graphs with arboricity up to 2√log  n  and an  O (log  2/3  n )-time MIS algorithm for graphs with arboricity up to 2 (log  n )1/3 .   Each of our algorithms is based on a simple but powerful technique for reducing a  randomized  symmetry-breaking task to a corresponding  deterministic  one on a poly(log  n )-size graph.", "citation": "Citations (132)", "year": "2012", "departments": ["Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "University of Michigan", "ETH Zurich", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "University of Michigan", "ETH Zurich"], "conf": "focs", "authors": ["Leonid Barenboim.....http://dblp.org/pers/hd/b/Barenboim:Leonid", "Michael Elkin.....http://dblp.org/pers/hd/e/Elkin:Michael", "Seth Pettie.....http://dblp.org/pers/hd/p/Pettie:Seth", "Johannes Schneider.....http://dblp.org/pers/hd/s/Schneider:Johannes"], "pages": 10}