{"title": "Divergent physical design tuning for replicated databases.", "fields": ["physical design", "materialized view", "workload", "design for all", "load balancing"], "abstract": "We introduce  divergent designs  as a novel tuning paradigm for database systems that employ replication. A divergent design installs a different physical configuration (e.g., indexes and materialized views) with each database replica, specializing replicas for different subsets of the workload. At runtime, queries are routed to the subset of the replicas configured to yield the most efficient execution plans. When compared to uniformly designed replicas, divergent replicas can potentially execute their subset of the queries significantly faster, and their physical configurations could be initialized and maintained(updated) in less time. However, the specialization of divergent replicas limits the ability to load-balance the workload at runtime.   We formalize the divergent design problem, characterize the properties of good designs, and analyze the complexity of identifying the optimal divergent design. Our paradigm captures the trade-off between load balancing among all  n  replicas vs. load balancing among  m  ≤  n  specialized replicas. We develop an effective algorithm (leveraging single-node-tuning functionality) to compute good divergent designs for all the points of this trade-off. Experimental results validate the effectiveness of the algorithm and demonstrate that divergent designs can substantially improve workload performance.", "citation": "Citations (8)", "year": "2012", "departments": ["University of Toronto", "University of California, Santa Cruz", "University of California, Santa Cruz", "University of California, Santa Cruz"], "conf": "sigmod", "authors": ["Mariano P. Consens.....http://dblp.org/pers/hd/c/Consens:Mariano_P=", "Kleoni Ioannidou.....http://dblp.org/pers/hd/i/Ioannidou:Kleoni", "Jeff LeFevre.....http://dblp.org/pers/hd/l/LeFevre:Jeff", "Neoklis Polyzotis.....http://dblp.org/pers/hd/p/Polyzotis:Neoklis"], "pages": 12}