{"title": "A distributed broadcast protocol in multi-hop cognitive radio ad hoc networks without a common control channel.", "fields": ["vehicular ad hoc network", "ad hoc wireless distribution service", "optimized link state routing protocol", "atomic broadcast", "broadcast radiation"], "abstract": "Broadcast is an important operation in wireless ad hoc networks where control information is usually propagated as broadcasts for the realization of most networking protocols. In traditional ad hoc networks, since the spectrum availability is uniform, broadcasts are delivered via a common channel which can be heard by all users in a network. However, in cognitive radio (CR) ad hoc networks, different unlicensed users may acquire different available channel sets. This non-uniform spectrum availability imposes special design challenges for broadcasting in CR ad hoc networks. In this paper, a fully-distributed broadcast protocol in multi-hop CR ad hoc networks without a common control channel is proposed. In our design, we consider practical scenarios that each unlicensed user is not assumed to be aware of the global network topology, the spectrum availability information of other users, and time synchronization information. By intelligently downsizing the original available channel set and designing the broadcasting sequences and scheduling schemes, our proposed broadcast protocol can provide very high successful broadcast ratio while achieving the shortest average broadcast delay. It can also eliminate broadcast collisions. To the best of our knowledge, this is the first work that addresses the broadcasting challenges specifically in multi-hop CR ad hoc networks under practical scenarios.", "citation": "Citations (80)", "departments": ["University of North Carolina at Charlotte", "University of North Carolina at Charlotte"], "authors": ["Yi Song.....http://dblp.org/pers/hd/s/Song:Yi", "Jiang Xie.....http://dblp.org/pers/hd/x/Xie:Jiang"], "conf": "infocom", "year": "2012", "pages": 9}