{"title": "Capacity of distributed content delivery in large-scale wireless ad hoc networks.", "fields": ["multi frequency network", "mobile ad hoc network", "multicast", "key distribution in wireless sensor networks", "wireless wan"], "abstract": "In most existing wireless networks, end users obtain data content from the wired network, typically, the Internet. In this manner, virtually all of their traffic must go through a few access points, which implies that the capacity of wireless network is limited by the aggregated transmission data rate of these access points. To fully exploit the capability of wireless network, we envision that future wireless networks shall be able to provide data content within themselves. In this paper, we address the behavior of such networks from a theoretical perspective. Specifically, we consider that multicast is used for distributed content delivery, and we investigate the asymptotic upper bound of the throughput capacity for distributed content delivery in large-scale wireless ad hoc networks (DCD-WANET). Our analysis shows how the upper bound of throughput capacity is affected by the geometric size of the network, the number of data items, the popularity of the data content, and the number of storage nodes that contain those data items. In particular, our theoretical results show that, if the number of storage nodes exceed a critical threshold, the upper bound grows with the number of storage nodes, according to a power-law where the scaling exponent depends on the popularity of data items. We also provide the data item placement strategy to achieve the upper bound of throughput capacity for DCD-WANET.", "citation": "Citations (1)", "departments": ["University of Science and Technology of China", "University of Puerto Rico at Mayagüez", "City University of Hong Kong", "University of Nebraska–Lincoln", "New York Institute of Technology"], "authors": ["Wang Liu.....http://dblp.org/pers/hd/l/Liu:Wang", "Kejie Lu.....http://dblp.org/pers/hd/l/Lu:Kejie", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Yi Qian.....http://dblp.org/pers/hd/q/Qian:Yi", "Tao Zhang.....http://dblp.org/pers/hd/z/Zhang:Tao", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng"], "conf": "infocom", "year": "2012", "pages": 9}