{"title": "Energy Efficient Storage Management Cooperated with Large Data Intensive Applications.", "fields": ["data center", "power management", "idle", "file server", "online transaction processing"], "abstract": "Power, especially that consumed for storing data, and cooling costs for data centers have increased rapidly. The main applications running at data centers are data intensive applications such as large file servers or database systems. Recently, power management of the data intensive applications has been emphasized in the literature. Such reports discuss the importance of power savings. However, these reports lack research on power management models for the efficient use of data intensive applications' I/O behaviors. This paper proposes a novel energy efficient storage management system that monitors both application- and device-level I/O patterns at run time, and uses not only the device-level I/O pattern but also application level patterns. First, the design of the proposed model combined with such large data intensive applications will be shown. The key features of the model are i) classifying application-level I/O into four patterns using run-time access behaviors such as the length of idle time and read/write frequency, and ii) adopting an appropriate power-saving method-based on these application level I/O patterns. Next, the proposed method is quantitatively evaluated with typical data intensive applications such as file servers, OLTP, and DSS. It is shown that energy efficient storage management is effective in achieving large power savings compared with traditional approaches while an application is running.", "citation": "Citations (8)", "departments": ["University of Tokyo", "University of Tokyo", "University of Tokyo"], "authors": ["Norifumi Nishikawa.....http://dblp.org/pers/hd/n/Nishikawa:Norifumi", "Miyuki Nakano.....http://dblp.org/pers/hd/n/Nakano:Miyuki", "Masaru Kitsuregawa.....http://dblp.org/pers/hd/k/Kitsuregawa:Masaru"], "conf": "icde", "year": "2012", "pages": 12}