{"title": "Quantum to Classical Randomness Extractors.", "fields": ["randomness", "quantum cryptography", "randomness extractor", "noisy storage model", "quantum mechanics", "quantum capacity", "quantum t design", "quantum", "mathematics", "randomness tests"], "abstract": "The goal of randomness extraction is to distill (almost) perfect randomness from a weak source of randomness. When the source yields a classical string X, many extractor constructions are known. Yet, when considering a physical randomness source, X is itself ultimately the result of a measurement on an underlying quantum system. When characterizing the power of a source to supply randomness, it is hence natural to ask how much classical randomness we can extract from a quantum system. To tackle this question, we here take on the study of quantum-to-classical randomness extractors (QC-extractors). We provide constructions of QC-extractors based on measurements in a full set of mutually unbiased bases (MUBs), and certain single qubit measurements. The latter are particularly appealing since they are not only easy to implement, but also appear throughout quantum cryptography. We proceed to prove an upper bound on the maximum amount of randomness that we could hope to extract from any quantum state. Some of our QC-extractors almost match this bound. We show two applications of our results. First, we show that any QC-extractor gives rise to entropic uncertainty relations with respect to quantum side information. Such relations were previously only known for two measurements. In particular, we obtain strong relations in terms of the von Neumann (Shannon) entropy as well as the min-entropy for measurements in (almost) unitary two-designs, a full set of MUBs, and single qubit measurements in three MUBs each. Second, we resolve the central open question in the noisy-storage model by linking security to the quantum capacity of the adversary's storage device. More precisely, we show that any two party cryptographic primitives can be implemented securely as long as the adversary's storage device has sufficiently low quantum capacity. Our protocol does not need any quantum storage to implement, and is technologically feasible using present-day technology.", "citation": "Citations (17)", "departments": ["ETH Zurich", "ETH Zurich", "National University of Singapore", "ETH Zurich", "McGill University", "National University of Singapore"], "authors": ["Mario Berta.....http://dblp.org/pers/hd/b/Berta:Mario", "Omar Fawzi.....http://dblp.org/pers/hd/f/Fawzi:Omar", "Stephanie Wehner.....http://dblp.org/pers/hd/w/Wehner:Stephanie"], "conf": "crypto", "year": "2012", "pages": 18}