{"title": "Jointly optimizing multi-user rate adaptation for video transport over wireless systems: Mean-fairness-variability tradeoffs.", "fields": ["data compression ratio", "online algorithm", "quality of experience", "novelty", "video quality"], "abstract": "User perceived video quality depends on a variety of only partially understood factors, e.g., the application domain, content, compression, transport mechanism, and most importantly psycho-visual systems determining the ultimate Quality of Experience (QoE) of users. This paper centers on two key observations in addressing the problem of joint rate adaptation for video streams sharing a congested resource. First, we note that a user viewing a given video will experience temporal variations in the dependence of perceived video quality to the compression rate. Intuitively this is due to the possibly changing nature of the content, e.g., from an action to a slower scene. Thus, in allocating rates to users sharing a congested resource, in particular a wireless system where additional temporal variability in users' capacity may be high, content dependent tradeoffs can be realized to deliver a better overall average perceived video quality. Second, we note that such adaptation of users' rates, may result in temporal variations in video quality which combined with perceptual hysteresis effects will degrade users' QoE. We develop an asymptotically optimal online algorithm, requiring minimal statistical information, for optimizing users' QoE by realizing tradeoffs across mean, variance and fairness. Simulations show that our approach achieves significant gains in viewers' QoE. The novelty of this work lies not only in tackling the fundamental problem of achieving fair allocations of perceived video quality across a user population with time varying sensitivities and capacity, but, in addition, in integrating the deleterious impact that variations in perceived quality has on their QoE.", "citation": "Citations (57)", "departments": ["University of Texas at Austin", "University of Texas at Austin"], "authors": ["Vinay Joseph.....http://dblp.org/pers/hd/j/Joseph:Vinay", "Gustavo de Veciana.....http://dblp.org/pers/hd/v/Veciana:Gustavo_de"], "conf": "infocom", "year": "2012", "pages": 9}