{"title": "GUPT: privacy preserving data analysis made easy.", "fields": ["side channel attack", "programmer", "differential privacy", "privacy by design", "privacy software"], "abstract": "It is often highly valuable for organizations to have their data analyzed by external agents. However, any program that computes on potentially sensitive data risks leaking information through its output. Differential privacy provides a theoretical framework for processing data while protecting the privacy of individual records in a dataset. Unfortunately, it has seen limited adoption because of the loss in output accuracy, the difficulty in making programs differentially private, lack of mechanisms to describe the privacy budget in a programmer's utilitarian terms, and the challenging requirement that data owners and data analysts manually distribute the limited privacy budget between queries.   This paper presents the design and evaluation of a new system, GUPT, that overcomes these challenges. Unlike existing differentially private systems such as PINQ and Airavat, it guarantees differential privacy to programs not developed with privacy in mind, makes no trust assumptions about the analysis program, and is secure to all known classes of side-channel attacks.   GUPT uses a new model of data sensitivity that degrades privacy of data over time. This enables efficient allocation of different levels of privacy for different user applications while guaranteeing an overall constant level of privacy and maximizing the utility of each application. GUPT also introduces techniques that improve the accuracy of output while achieving the same level of privacy. These approaches enable GUPT to easily execute a wide variety of data analysis programs while providing both utility and privacy.", "citation": "Citations (168)", "year": "2012", "departments": ["University of California, Berkeley", "Pennsylvania State University", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "sigmod", "authors": ["Prashanth Mohan.....http://dblp.org/pers/hd/m/Mohan:Prashanth", "Abhradeep Thakurta.....http://dblp.org/pers/hd/t/Thakurta:Abhradeep", "Elaine Shi.....http://dblp.org/pers/hd/s/Shi:Elaine", "Dawn Song.....http://dblp.org/pers/hd/s/Song:Dawn", "David E. Culler.....http://dblp.org/pers/hd/c/Culler:David_E="], "pages": 12}