{"title": "Planar F-Deletion: Approximation, Kernelization and Optimal FPT Algorithms.", "fields": ["planar straight line graph", "kernelization", "feedback vertex set", "forbidden graph characterization", "vertex cover"], "abstract": "Let F be a finite set of graphs. In the F-deletion problem, we are given an n-vertex graph G and an integer k as input, and asked whether at most k vertices can be deleted from G such that the resulting graph does not contain a graph from F as a minor. F-deletion is a generic problem and by selecting different sets of forbidden minors F, one can obtain various fundamental problems such as {\\sc Vertex Cover}, {\\sc Feedback Vertex Set} or {\\sc Tree width k-deletion}. In this paper we obtain a number of generic algorithmic results about F-deletion, when F contains at least one planar graph. The highlights of our work are: 1. A constant factor approximation algorithm for the optimization version of Planar F-deletion, 2. A linear time and single exponential parameterized algorithm, that is, an algorithm running in time O(exp(2, O(k))n), for the parameterized version of Planar F-deletion where all graphs in Planar F are connected, 3. A polynomial kernel for parameterized F-deletion. These algorithms unify, generalize, and improve a multitude of results in the literature. Our main results have several direct applications, but also the methods we develop on the way have applicability beyond the scope of this paper. Our results -- constant factor approximation, polynomial kernelization and FPT algorithms -- are stringed together by a common theme of polynomial time preprocessing.", "citation": "Citations (121)", "year": "2012", "departments": ["University of Bergen", "University of California, San Diego", "Inst. of Math.  ...  Chennai, India", "Inst. of Math.  ...  Chennai, India"], "conf": "focs", "authors": ["Fedor V. Fomin.....http://dblp.org/pers/hd/f/Fomin:Fedor_V=", "Daniel Lokshtanov.....http://dblp.org/pers/hd/l/Lokshtanov:Daniel", "Neeldhara Misra.....http://dblp.org/pers/hd/m/Misra:Neeldhara", "Saket Saurabh.....http://dblp.org/pers/hd/s/Saurabh_0001:Saket"], "pages": 10}