{"title": "SWST: A Disk Based Index for Sliding Window Spatio-Temporal Data.", "fields": ["search engine indexing", "database index", "data type", "temporal database", "sliding window protocol"], "abstract": "Numerous applications such as wireless communication and telematics need to keep track of evolution of spatio-temporal data for a limited past. Limited retention may even be required by regulations. In general, each data entry can have its own user specified lifetime. It is desired that expired entries are automatically removed by the system through some garbage collection mechanism. This kind of limited retention can be achieved by using a sliding window semantics similar to that from stream data processing. However, due to the large volume and relatively long lifetime of data in the aforementioned applications (in contrast to the real-time transient streaming data), the sliding window here needs to be maintained for data on disk rather than in memory. It is a new challenge to provide fast access to the information from the recent past and, at the same time, facilitate efficient deletion of the expired entries. In this paper, we propose a disk based, two-layered, sliding window indexing scheme for discretely moving spatio-temporal data. Our index can support efficient processing of standard time slice and interval queries and delete expired entries with almost no overhead. In existing historical spatio-temporal indexing techniques, deletion is either infeasible or very inefficient. Our sliding window based processing model can support both current and past entries, while many existing historical spatio-temporal indexing techniques cannot keep these two types of data together in the same index. Our experimental comparison with the best known historical index (i.e., the MV3R tree) for discretely moving spatio-temporal data shows that our index is about five times faster in terms of insertion time and comparable in terms of search performance. MV3R follows a partial persistency model, whereas our index can support very efficient deletion and update.", "citation": "Citations (9)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Manish Singh.....http://dblp.org/pers/hd/s/Singh:Manish", "Qiang Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Qiang", "H. V. Jagadish.....http://dblp.org/pers/hd/j/Jagadish:H=_V="], "conf": "icde", "year": "2012", "pages": 12}