{"title": "CALMS: Cloud-assisted live media streaming for globalized demands with time/region diversities.", "fields": ["peer to peer", "software deployment", "scalability", "server", "provisioning"], "abstract": "Live media streaming has become one of the most popular applications over the Internet. We have witnessed the successful deployment of commercial systems with CDN- or peer-to-peer based engines. While each being effective in certain aspects, having an all-round scalable, reliable, responsive and cost-effective solution remains an illusive goal. Moreover, today's live streaming services have become highly globalized, with subscribers from all over the world. Such a globalization makes user behaviors and demands even more diverse and dynamic, further challenging state-of-the-art system designs. The emergence of cloud computing however sheds new lights into this dilemma. Leveraging the elastic resource provisioning from cloud, we present CALMS (Cloud-Assisted Live Media Streaming), a generic framework that facilitates a migration to the cloud. CALMS adaptively leases and adjusts cloud server resources in a fine granularity to accommodate temporal and spatial dynamics of demands from live streaming users. We present optimal solutions to deal with cloud servers with diverse capacities and lease prices, as well as the potential latencies in initiating and terminating leases in real world cloud platforms. Our solution well accommodates location heterogeneity, mitigating the impact from user globalization. It also enables seamless migration for existing streaming systems, e.g., peer-to-peer, and fully explores their potentials. Simulations with data traces from both cloud service provider (Amazon EC2) and live media streaming service provider (PPTV) demonstrate that CALMS effectively mitigates the overall system deployment costs and yet provides users with satisfactory streaming latency and rate.", "citation": "Citations (143)", "departments": ["Simon Fraser University", "Simon Fraser University", "The Chinese University of Hong Kong"], "authors": ["Feng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Feng", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua"], "conf": "infocom", "year": "2012", "pages": 9}