{"title": "A case for a coordinated internet video control plane.", "fields": ["internet video", "routing control plane", "user expectations", "throughput", "low latency"], "abstract": "Video traffic already represents a significant fraction of today's traffic and is projected to exceed 90% in the next five years. In parallel, user expectations for a high quality viewing experience (e.g., low startup delays, low buffering, and high bitrates) are continuously increasing. Unlike traditional workloads that either require low latency (e.g., short web transfers) or high average throughput (e.g., large file transfers), a high quality video viewing experience requires  sustained  performance over  extended  periods of time (e.g., tens of minutes). This imposes fundamentally different demands on content delivery infrastructures than those envisioned for traditional traffic patterns. Our large-scale measurements over 200 million video sessions show that today's delivery infrastructure fails to meet these requirements: more than 20% of sessions have a rebuffering ratio ≥ 10% and more than 14% of sessions have a video startup delay ≥ 10s. Using measurement-driven insights, we make a case for a video control plane that can use a global view of client and network conditions to dynamically optimize the video delivery in order to provide a high quality viewing experience despite an unreliable delivery infrastructure. Our analysis shows that such a control plane can potentially improve the rebuffering ratio by up to 2× in the average case and by more than one order of magnitude under stress.", "citation": "Citations (214)", "departments": ["Carnegie Mellon University", "University of California, Berkeley", "Conviva, San Mateo, USA", "Conviva, San Mateo, USA", "Conviva, San Mateo, USA"], "authors": ["Xi Liu.....http://dblp.org/pers/hd/l/Liu:Xi", "Florin Dobrian.....http://dblp.org/pers/hd/d/Dobrian:Florin", "Henry Milner.....http://dblp.org/pers/hd/m/Milner:Henry", "Junchen Jiang.....http://dblp.org/pers/hd/j/Jiang:Junchen", "Vyas Sekar.....http://dblp.org/pers/hd/s/Sekar:Vyas", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion", "Hui Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Hui"], "conf": "sigcomm", "year": "2012", "pages": 12}