{"title": "CodePipe: An opportunistic feeding and routing protocol for reliable multicast with pipelined network coding.", "fields": ["distance vector multicast routing protocol", "xcast", "pragmatic general multicast", "reliable multicast", "source specific multicast"], "abstract": "Multicast is an important mechanism in modern wireless networks and has attracted significant efforts to improve its performance with different metrics including throughput, delay, energy efficiency, etc. Traditionally, an ideal loss-free channel model is widely used to facilitate routing protocol design. However, the quality of wireless links would be affected or even jeopardized by many factors like collisions, fading or the noise of environment. In this paper, we propose a reliable multicast protocol, called CodePipe, with advanced performance in terms of energy-efficiency, throughput and fairness in lossy wireless networks. Built upon opportunistic routing and random linear network coding, CodePipe not only simplifies transmission coordination between nodes, but also improves the multicast throughput significantly by exploiting both intra-batch and inter-batch coding opportunities. In particular, four key techniques, namely, LP-based opportunistic routing structure, opportunistic feeding, fast batch moving and inter-batch coding, are proposed to offer substantial improvement in throughput, energy-efficiency and fairness. We evaluate CodePipe on ns2 simulator by comparing with other two state-of-art multicast protocols, MORE and Pacifier. Simulation results show that CodePipe significantly outperforms both of them.", "citation": "Citations (171)", "departments": ["University of Aizu", "University of Aizu", "Deakin University", "National Technical University of Athens"], "authors": ["Peng Li.....http://dblp.org/pers/hd/l/Li_0017:Peng", "Song Guo.....http://dblp.org/pers/hd/g/Guo_0001:Song", "Shui Yu.....http://dblp.org/pers/hd/y/Yu:Shui", "Athanasios V. Vasilakos.....http://dblp.org/pers/hd/v/Vasilakos:Athanasios_V="], "conf": "infocom", "year": "2012", "pages": 9}