{"title": "Efficient external-memory bisimulation on DAGs.", "fields": ["xpath", "sort", "auxiliary memory", "bisimulation", "directed acyclic graph", "tree structure", "ranging", "out of core algorithm"], "abstract": "In this paper we introduce the first efficient external-memory algorithm to compute the bisimilarity equivalence classes of a directed acyclic graph (DAG). DAGs are commonly used to model data in a wide variety of practical applications, ranging from XML documents and data provenance models, to web taxonomies and scientific workflows. In the study of efficient reasoning over massive graphs, the notion of node bisimilarity plays a central role. For example, grouping together bisimilar nodes in an XML data set is the first step in many sophisticated approaches to building indexing data structures for efficient XPath query evaluation. To date, however, only internal-memory bisimulation algorithms have been investigated. As the size of real-world DAG data sets often exceeds available main memory, storage in external memory becomes necessary. Hence, there is a practical need for an efficient approach to computing bisimulation in external memory.   Our general algorithm has a worst-case IO-complexity of  O (Sort(| N | + | E |)), where | N | and | E | are the numbers of nodes and edges, resp., in the data graph and Sort( n ) is the number of accesses to external memory needed to sort an input of size  n . We also study specializations of this algorithm to common variations of bisimulation for tree-structured XML data sets. We empirically verify efficient performance of the algorithms on graphs and XML documents having billions of nodes and edges, and find that the algorithms can process such graphs efficiently even when very limited internal memory is available. The proposed algorithms are simple enough for practical implementation and use, and open the door for further study of external-memory bisimulation algorithms. To this end, the full open-source C++ implementation has been made freely available.", "citation": "Not cited", "year": "2012", "departments": ["University of Hasselt", "Eindhoven University of Technology", "Eindhoven University of Technology"], "conf": "sigmod", "authors": ["Jelle Hellings.....http://dblp.org/pers/hd/h/Hellings:Jelle", "George H. L. Fletcher.....http://dblp.org/pers/hd/f/Fletcher:George_H=_L=", "Herman J. Haverkort.....http://dblp.org/pers/hd/h/Haverkort:Herman_J="], "pages": 12}