{"title": "Correlation Support for Risk Evaluation in Databases.", "fields": ["copula", "uncertain data", "histogram", "group method of data handling"], "abstract": "Investigating potential dependencies in data and their effect on future business developments can help experts to prevent misestimations of risks and chances. This makes correlation a highly important factor in risk analysis tasks. Previous research on correlation in uncertain data management addressed foremost the handling of dependencies between discrete rather than continuous distributions. Also, none of the existing approaches provides a clear method for extracting correlation structures from data and introducing assumptions about correlation to independently represented data. To enable risk analysis under correlation assumptions, we use an approximation technique based on copula functions. This technique enables analysts to introduce arbitrary correlation structures between arbitrary distributions and calculate relevant measures over thus correlated data. The correlation information can either be extracted at runtime from historic data or be accessed from a parametrically precomputed structure. We discuss the construction, application and querying of approximate correlation representations for different analysis tasks. Our experiments demonstrate the efficiency and accuracy of the proposed approach, and point out several possibilities for optimization.", "citation": "Citations (1)", "departments": ["SAP Res., Dresden, Germany", "Tech. Univ. Ber ... Berlin, Germany", "SAP Res., Dresden, Germany", "Tech. Univ. Ber ... Berlin, Germany", "SAP Res., Dresden, Germany"], "authors": ["Katrin Eisenreich.....http://dblp.org/pers/hd/e/Eisenreich:Katrin", "Jochen Adamek.....http://dblp.org/pers/hd/a/Adamek:Jochen", "Philipp Rösch.....http://dblp.org/pers/hd/r/R=ouml=sch:Philipp", "Volker Markl.....http://dblp.org/pers/hd/m/Markl:Volker", "Gregor Hackenbroich.....http://dblp.org/pers/hd/h/Hackenbroich:Gregor"], "conf": "icde", "year": "2012", "pages": 12}