{"title": "Saliency filters: Contrast based filtering for salient region detection.", "fields": ["filter", "salience", "gaussian process", "kadir brady saliency detector", "histogram"], "abstract": "Saliency estimation has become a valuable tool in image processing. Yet, existing approaches exhibit considerable variation in methodology, and it is often difficult to attribute improvements in result quality to specific algorithm properties. In this paper we reconsider some of the design choices of previous methods and propose a conceptually clear and intuitive algorithm for contrast-based saliency estimation. Our algorithm consists of four basic steps. First, our method decomposes a given image into compact, perceptually homogeneous elements that abstract unnecessary detail. Based on this abstraction we compute two measures of contrast that rate the uniqueness and the spatial distribution of these elements. From the element contrast we then derive a saliency measure that produces a pixel-accurate saliency map which uniformly covers the objects of interest and consistently separates fore- and background. We show that the complete contrast and saliency estimation can be formulated in a unified way using high-dimensional Gaussian filters. This contributes to the conceptual simplicity of our method and lends itself to a highly efficient implementation with linear complexity. In a detailed experimental evaluation we analyze the contribution of each individual feature and show that our method outperforms all state-of-the-art approaches.", "citation": "Citations (1,056)", "year": "2012", "departments": ["Disney Research", "Stanford University", "Disney Research", "Disney Research"], "conf": "cvpr", "authors": ["Federico Perazzi.....http://dblp.org/pers/hd/p/Perazzi:Federico", "Philipp Krähenbühl.....http://dblp.org/pers/hd/k/Kr=auml=henb=uuml=hl:Philipp", "Yael Pritch.....http://dblp.org/pers/hd/p/Pritch:Yael", "Alexander Hornung.....http://dblp.org/pers/hd/h/Hornung:Alexander"], "pages": 8}