{"title": "Covariance discriminative learning: A natural and efficient approach to image set classification.", "fields": ["matern covariance function", "estimation of covariance matrices", "rational quadratic covariance function", "covariance", "covariance function"], "abstract": "We propose a novel discriminative learning approach to image set classification by modeling the image set with its natural second-order statistic, i.e. covariance matrix. Since nonsingular covariance matrices, a.k.a. symmetric positive definite (SPD) matrices, lie on a Riemannian manifold, classical learning algorithms cannot be directly utilized to classify points on the manifold. By exploring an efficient metric for the SPD matrices, i.e., Log-Euclidean Distance (LED), we derive a kernel function that explicitly maps the covariance matrix from the Riemannian manifold to a Euclidean space. With this explicit mapping, any learning method devoted to vector space can be exploited in either its linear or kernel formulation. Linear Discriminant Analysis (LDA) and Partial Least Squares (PLS) are considered in this paper for their feasibility for our specific problem. We further investigate the conventional linear subspace based set modeling technique and cast it in a unified framework with our covariance matrix based modeling. The proposed method is evaluated on two tasks: face recognition and object categorization. Extensive experimental results show not only the superiority of our method over state-of-the-art ones in both accuracy and efficiency, but also its stability to two real challenges: noisy set data and varying set size.", "citation": "Citations (285)", "year": "2012", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "Tsinghua University"], "conf": "cvpr", "authors": ["Ruiping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Ruiping", "Huimin Guo.....http://dblp.org/pers/hd/g/Guo:Huimin", "Larry S. Davis.....http://dblp.org/pers/hd/d/Davis:Larry_S=", "Qionghai Dai.....http://dblp.org/pers/hd/d/Dai:Qionghai"], "pages": 8}