{"title": "RASS: A Portable Real-time Automatic Sleep Scoring System.", "fields": ["real time computing", "computer science", "sleep apnea"], "abstract": "It is a well known fact that the quality of sleep is an important factor in health-related quality of life (HRQoL), and people could prevent potential problems by tracking the quality of their sleep. Unfortunately sleep scoring, which is a systematic way to address the sleep staging as well as the scoring of arousals, respiratory, cardiac, and movement events, is usually conducted with specialized equipment which is expensive and operated by specialists in dedicated sleep centers. Related research studies and products (e.g. ZEO) tried to solve this problem, but they either used multiple probes that cause discomfort to the patient, or could not score in real time. In this paper, we design and implement RASS, a portable Real-time Automatic Sleep Scoring system. RASS only requires one probe, which is inexpensive and, as a result, may be used at home or during travel. RASS accurately scores the sleeping state and detects sleep apnea in real-time based on the sensing results of pulse, blood oxygen, activity, sound and light signals. An alarm will be generated when a severely abnormal sleep state is detected. RASS has been tested with 48 patients, and the test results show that RASS could achieve higher than 84% accuracy.", "citation": "Citations (3)", "year": "2012", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Shenzhen New El ... Shenzhen, China", "Shenzhen New El ... Shenzhen, China", "Shenzhen New El ... Shenzhen, China"], "conf": "rtss", "authors": ["Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Dawei Chen.....http://dblp.org/pers/hd/c/Chen:Dawei", "Jianhui Zhao.....http://dblp.org/pers/hd/z/Zhao:Jianhui", "Mincong He.....http://dblp.org/pers/hd/h/He:Mincong", "Yuanpeng Wang.....http://dblp.org/pers/hd/w/Wang:Yuanpeng", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "pages": 10}