{"title": "Discovering Spammers in Social Networks.", "fields": ["social media", "exploit", "popularity", "spamming", "social actions"], "abstract": "As the popularity of the social media increases, as evidenced in Twitter, Facebook and China's Renren, spamming activities also picked up in numbers and variety. On social network sites, spammers often disguise themselves by creating fake accounts and hijacking normal users' accounts for personal gains. Different from the spammers in traditional systems such as SMS and email, spammers in social media behave like normal users and they continue to change their spamming strategies to fool anti-spamming systems. However, due to the privacy and resource concerns, many social media websites cannot fully monitor all the contents of users, making many of the previous approaches, such as topology-based and content-classification-based methods, infeasible to use. In this paper, we propose a Supervised Matrix Factorization method with Social Regularization (SMFSR) for spammer detection in social networks that exploits both social activities as well as users' social relations in an innovative and highly scalable manner. The proposed method detects spammers collectively based on users' social actions and social relations. We have empirically tested our method on data from Renren.com, which is one of the largest social networks in China, and demonstrated that our new method can improve the detection performance significantly.", "citation": "Citations (74)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Renren Inc., China", "Renren Inc., China"], "authors": ["Yin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yin", "Xiao Wang.....http://dblp.org/pers/hd/w/Wang:Xiao", "Erheng Zhong.....http://dblp.org/pers/hd/z/Zhong:Erheng", "Nathan Nan Liu.....http://dblp.org/pers/hd/l/Liu:Nathan_Nan", "He Li.....http://dblp.org/pers/hd/l/Li:He", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "aaai", "year": "2012", "pages": -1}