{"title": "Center-Shift: An approach towards automatic robust mesh segmentation (ARMS).", "fields": ["segmentation based object categorization", "feature vector", "shape analysis", "scale space segmentation", "kernel density estimation"], "abstract": "In the area of 3D shape analysis, research in mesh segmentation has always been an important topic, as it is a fundamental low-level task which can be utilized in many applications including computer-aided design, computer animation, biomedical applications and many other fields. We define the automatic robust mesh segmentation (ARMS) method in this paper, which 1) is invariant to isometric transformation, 2) is insensitive to noise and deformation, 3) performs closely to human perception, 4) is efficient in computation, and 5) is minimally dependent on prior knowledge. In this work, we develop a new framework, namely the Center-Shift, which discovers meaningful segments of a 3D object by exploring the intrinsic geometric structure encoded in the biharmonic kernel. Our Center-Shift framework has three main steps: First, we construct a feature space where every vertex on the mesh surface is associated with the corresponding biharmonic kernel density function value. Second, we apply the Center-Shift algorithm for initial segmentation. Third, the initial segmentation result is refined through an efficient iterative process which leads to visually salient segmentation of the shape. The performance of this segmentation method is demonstrated through extensive experiments on various sets of 3D shapes and different types of noise and deformation. The experimental results of 3D shape segmentation have shown better performance of Center-Shift, compared to state-of-the-art segmentation methods.", "citation": "Citations (3)", "year": "2012", "departments": ["Purdue University", "Purdue University", "Purdue University"], "conf": "cvpr", "authors": ["Mengtian Sun.....http://dblp.org/pers/hd/s/Sun:Mengtian", "Yi Fang.....http://dblp.org/pers/hd/f/Fang:Yi", "Karthik Ramani.....http://dblp.org/pers/hd/r/Ramani:Karthik"], "pages": 8}