{"title": "Distributed measurement-aware routing: Striking a balance between measurement and traffic engineering.", "fields": ["network traffic simulation", "internet traffic engineering", "traffic shaping", "floating car data", "traffic policing"], "abstract": "Network-wide traffic measurement is important for various network management tasks, ranging from traffic accounting, traffic engineering, and network troubleshooting to security. Existing techniques for traffic measurement tend to be sub-optimal due to poor choice of monitor deployment location or due to constantly evolving monitoring objectives and traffic characteristics. It is not feasible to dynamically reconfigure/redeploy monitoring infrastructure to satisfy such evolving measurement requirements. In this paper, we present a distributed measurement-aware traffic engineering protocol based on a game-theoretic re-routing policy that attempts to optimally utilize existing monitor locations for maximizing the traffic measurement gain while ensuring that the traffic load distribution across the network satisfies some traffic engineering constraint. We introduce a novel cost function on each link that reflects both the measurement gain and the traffic engineering (TE) constraint. Individual routers compete with each other (in a game) to minimize their own costs for the downstream paths, i.e., each router dynamically gathers its cost information for upstream routers and use it to locally decide how to adjust traffic split ratios for each destination to the next-hop routers among these multiple equal-cost paths. Our routing policy guarantees not only a provable Nash equilibrium, but also a quick convergence without significant oscillations to an equilibrium state in which the measurement gain of the network is close to the best case performance bounds We evaluate the protocol via simulations using real traces/topologies (Abilene, AS6461 and GEANT). The simulation results show fast convergence (as expected from the theoretical results), improved measurement gains (e.g., 12 % higher) and much lower TE-violations (e.g., up to 100X smaller) compared to static, centralized measurement-aware routing framework in dynamic traffic scenario.", "citation": "Citations (3)", "departments": ["University of California, San Diego", "University of California, Davis", "University of California, Davis", "University of California, San Diego", "University of California, Davis"], "authors": ["Chia-Wei Chang.....http://dblp.org/pers/hd/c/Chang:Chia=Wei", "Han Liu.....http://dblp.org/pers/hd/l/Liu:Han", "Guanyao Huang.....http://dblp.org/pers/hd/h/Huang:Guanyao", "Bill Lin.....http://dblp.org/pers/hd/l/Lin:Bill", "Chen-Nee Chuah.....http://dblp.org/pers/hd/c/Chuah:Chen=Nee"], "conf": "infocom", "year": "2012", "pages": 5}