{"title": "Transparent user models for personalization.", "fields": ["generative model", "user modeling", "microblogging", "phenomenon", "mistake"], "abstract": "Personalization is a ubiquitous phenomenon in our daily online experience. While such technology is critical for helping us combat the overload of information we face, in many cases, we may not even realize that our results are being tailored to our personal tastes and preferences. Worse yet, when such a system makes a mistake, we have little recourse to correct it.   In this work, we propose a framework for addressing this problem by developing a new user-interpretable feature set upon which to base personalized recommendations. These features, which we call badges, represent fundamental traits of users (e.g., \"vegetarian\" or \"Apple fanboy\") inferred by modeling the interplay between a user's behavior and self-reported identity. Specifically, we consider the microblogging site Twitter, where users provide short descriptions of themselves in their profiles, as well as perform actions such as tweeting and retweeting. Our approach is based on the insight that we can define badges using high precision, low recall rules (e.g., \"Twitter profile contains the phrase 'Apple fanboy'\"), and with enough data, generalize to other users by observing shared behavior. We develop a fully Bayesian, generative model that describes this interaction, while allowing us to avoid the pitfalls associated with having positive-only data.   Experiments on real Twitter data demonstrate the effectiveness of our model at capturing rich and interpretable user traits that can be used to provide transparency for personalization.", "citation": "Citations (14)", "departments": ["Carnegie Mellon University", "Microsoft", "Facebook", "Microsoft", "Rangespan Ltd., ...  United Kingdom"], "authors": ["Khalid El-Arini.....http://dblp.org/pers/hd/e/El=Arini:Khalid", "Ulrich Paquet.....http://dblp.org/pers/hd/p/Paquet:Ulrich", "Ralf Herbrich.....http://dblp.org/pers/hd/h/Herbrich:Ralf", "Jurgen Van Gael.....http://dblp.org/pers/hd/g/Gael:Jurgen_Van", "Blaise Agüera y Arcas.....http://dblp.org/pers/hd/a/Arcas:Blaise_Ag=uuml=era_y"], "conf": "kdd", "year": "2012", "pages": 9}