{"title": "Multiparty Computation with Low Communication, Computation and Interaction via Threshold FHE.", "fields": ["homomorphic encryption", "distributed computing", "public key cryptography", "plaintext", "secure multi party computation", "computer science", "computation", "theoretical computer science", "universal composability"], "abstract": "Fully homomorphic encryption (FHE) enables secure computation over the encrypted data of a single party. We explore how to extend this to multiple parties, using threshold fully homomorphic encryption (TFHE). In such scheme, the parties jointly generate a common FHE public key along with a secret key that is shared among them; they can later cooperatively decrypt ciphertexts without learning anything but the plaintext. We show how to instantiate this approach efficiently, by extending the recent FHE schemes of Brakerski, Gentry and Vaikuntanathan (CRYPTO '11, FOCS '11, ITCS '12) based on the (ring) learning with errors assumption. Our main tool is to exploit the property that such schemes are additively homomorphic over their keys.\n\nUsing TFHE, we construct simple multiparty computation protocols secure against fully malicious attackers, tolerating any number of corruptions, and providing security in the universal composability framework. Our protocols have the following properties: Low interaction: 3 rounds of interaction given a common random string, or 2 rounds with a public-key infrastructure. Low communication: independent of the function being computed (proportional to just input and output sizes). Cloud-assisted computation: the bulk of the computation can be efficiently outsourced to an external entity (e.g. a cloud service) so that the computation of all other parties is independent of the complexity of the evaluated function.", "citation": "Not cited", "year": "2012", "departments": ["Bar-Ilan University", "University of California, Los Angeles", "New York University", "Tel Aviv University", "University of Toronto"], "conf": "eurocrypt", "authors": ["Gilad Asharov.....http://dblp.org/pers/hd/a/Asharov:Gilad", "Abhishek Jain.....http://dblp.org/pers/hd/j/Jain_0002:Abhishek", "Adriana López-Alt.....http://dblp.org/pers/hd/l/L=oacute=pez=Alt:Adriana", "Eran Tromer.....http://dblp.org/pers/hd/t/Tromer:Eran", "Vinod Vaikuntanathan.....http://dblp.org/pers/hd/v/Vaikuntanathan:Vinod", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "pages": 19}