{"title": "Ad hoc wireless networks meet the infrastructure: Mobility, capacity and delay.", "fields": ["wireless mesh network", "mobile ad hoc network", "ad hoc wireless distribution service", "key distribution in wireless sensor networks", "optimized link state routing protocol"], "abstract": "In our previous work [9], we investigated the capacity and delay of a static hybrid wireless network, consisting of n static wireless nodes overlaid with a cellular architecture of m base stations. By employing a more practical and simple routing policy, we proved that each wireless node can be realized with a throughput that scales sublinearly or linearly with m. This was in fact a significant result as opposed to prior works on hybrid wireless networks which claims that if m grows slower than some threshold, the benefit of augmenting those base stations to the pure ad hoc network is insignificant. Albeit our novel approach can render improved benefits in terms of capacity and delay as opposed to prior efforts, the analysis shows that one requires a large deployment cost in order to achieve a Θ(1) capacity. Existing research efforts also indicate that for pure mobile ad hoc networks, a capacity of Θ(1) can be achieved by exploiting the mobility of the nodes, at the expense of very high end-to-end delay. This larger delay, nevertheless, stems from the assumption of global mobility, where nodes move around the entire network. In this paper, by leveraging a more practical and restricted mobility model, we investigate the capacity and delay of our hybrid wireless network design with n mobile nodes and m base stations, termed as mobile hybrid wireless network. Interestingly, our results show that each node can be realized with a capacity of Θ(1), while keeping the average end-to-end delay smaller by a factor of m than the pure mobile ad hoc networks.", "citation": "Citations (15)", "departments": ["Illinois Institute of Technology", "Embedded System ... rch Center, USA"], "authors": ["Devu Manikantan Shila.....http://dblp.org/pers/hd/s/Shila:Devu_Manikantan", "Yu Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Yu"], "conf": "infocom", "year": "2012", "pages": 5}