{"title": "Be Conservative: Enhancing Failure Diagnosis with Proactive Logging.", "fields": ["source code", "system call", "logging", "software system", "real time computing"], "abstract": "When systems fail in the field, logged error or warning messages are frequently the only evidence available for assessing and diagnosing the underlying cause. Consequently, the efficacy of such logging--how often and how well error causes can be determined via postmortem log messages--is a matter of significant practical importance. However, there is little empirical data about how well existing logging practices work and how they can yet be improved. We describe a comprehensive study characterizing the efficacy of logging practices across five large and widely used software systems. Across 250 randomly sampled reported failures, we first identify that more than half of the failures could not be diagnosed well using existing log data. Surprisingly, we find that majority of these unreported failures are manifested via a common set of generic error patterns (e.g., system call return errors) that, if logged, can significantly ease the diagnosis of these unreported failure cases. We further mechanize this knowledge in a tool called Errlog, that proactively adds appropriate logging statements into source code while adding only 1.4% performance overhead. A controlled user study suggests that Errlog can reduce diagnosis time by 60.7%.", "citation": "Citations (92)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of California, San Diego", "University of California, San Diego", "University of California, San Diego"], "authors": ["Ding Yuan.....http://dblp.org/pers/hd/y/Yuan:Ding", "Soyeon Park.....http://dblp.org/pers/hd/p/Park:Soyeon", "Peng Huang.....http://dblp.org/pers/hd/h/Huang:Peng", "Yang Liu.....http://dblp.org/pers/hd/l/Liu_0044:Yang", "Michael Mihn-Jong Lee.....http://dblp.org/pers/hd/l/Lee:Michael_Mihn=Jong", "Xiaoming Tang.....http://dblp.org/pers/hd/t/Tang:Xiaoming", "Yuanyuan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuanyuan", "Stefan Savage.....http://dblp.org/pers/hd/s/Savage:Stefan"], "conf": "osdi", "year": "2012", "pages": 14}