{"title": "Infrastructure-assisted routing in vehicular networks.", "fields": ["packet forwarding", "network packet", "vehicular ad hoc network", "vehicle routing problem", "knapsack problem"], "abstract": "Deploying roadside access points (APs) or an infrastructure can improve data delivery. Our empirical results from real trace driven simulations show that deploying APs produces up to 5× performance gain in delivery ratio and reduces delivery delay by as much as 35% with simple routing. However, we also find that buffer resources at the APs become a critical factor and poor buffer allocation leads to marginal performance gain for inter-vehicle routing. Motivated by this important observation, we investigate the optimal infrastructure-assisted routing for inter-vehicle data delivery. It remains a challenging issue for two major reasons. First, the addition of APs dramatically changes delivery opportunities between vehicles, which has not been well understood by existing work. Second, packet forwarding and buffer allocation are inter-dependent and should be addressed together. To tackle the challenges, we first characterize packet delivery probability as a function of predicted vehicle trajectories and AP locations. Then, we formulate the coexisting problem of packet forwarding and buffer allocation as an optimization problem and show that it is a knapsack problem. We design a global algorithm to solve this optimization problem. For more realistic settings, we propose a distributed algorithm for packet forwarding and buffer allocation in which each vehicle and the APs make decisions locally. Through trace-driven simulations, we demonstrate that the distributed algorithm steadily outperforms other alternative approaches under a wide range of network configurations.", "citation": "Citations (73)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Yuchen Wu.....http://dblp.org/pers/hd/w/Wu:Yuchen", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2012", "pages": 9}