{"title": "Thermal Inertia: Towards an energy conservation room management system.", "fields": ["building management system", "software deployment", "phenomenon", "air conditioning", "schedule"], "abstract": "We are in an age where people are paying increasing attention to energy conservation around the world. The heating and air-conditioning systems of buildings introduce one of the largest chunk of energy expenses. In this paper, we make a key observation that after a meeting or a class ends in a room, the indoor temperature will not immediately increase to the outdoor temperature. We call this phenomenon Thermal Inertia. Thus, if we arrange subsequent meetings in the same room; than a room that has not been used for some time, we can take advantage of such un-dissipated cool or heated air and conserve energy. We develop a green room management system with three main components. First, it has a wireless sensor network to collect indoor, outdoor temperature and electricity expenses of the air-conditioning devices. Second, we build an energy-temperature correlation model for the energy expenses and the corresponding room temperature. Third, we develop room scheduling algorithms. Our system is validated with real deployment of a sensor network for data collection and thermodynamics model calibration. We conduct a comprehensive evaluation with synthetic room and meeting configurations. We observe a 30% energy saving as compared with the current schedules.", "citation": "Citations (17)", "departments": ["Harbin Institute of Technology", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Illinois Institute of Technology", "Harbin Institute of Technology"], "authors": ["Dawei Pan.....http://dblp.org/pers/hd/p/Pan:Dawei", "Yi Yuan.....http://dblp.org/pers/hd/y/Yuan:Yi", "Dan Wang.....http://dblp.org/pers/hd/w/Wang_0002:Dan", "XiaoHua Xu.....http://dblp.org/pers/hd/x/Xu:XiaoHua", "Yu Peng.....http://dblp.org/pers/hd/p/Peng:Yu", "Xiyuan Peng.....http://dblp.org/pers/hd/p/Peng:Xiyuan", "Peng-Jun Wan.....http://dblp.org/pers/hd/w/Wan:Peng=Jun"], "conf": "infocom", "year": "2012", "pages": 5}