{"title": "Scalable framework for mapping streaming applications onto multi-GPU systems.", "fields": ["graph partition", "memory hierarchy", "cuda", "speedup", "gpu cluster"], "abstract": "Graphics processing units leverage on a large array of parallel processing cores to boost the performance of a specific streaming computation pattern frequently found in graphics applications. Unfortunately, while many other general purpose applications do exhibit the required streaming behavior, they also possess unfavorable data layout and poor computation-to-communication ratios that penalize any straight-forward execution on the GPU. In this paper we describe an efficient and scalable code generation framework that can map general purpose streaming applications onto a multi-GPU system. This framework spans the entire core and memory hierarchy exposed by the multi-GPU system. Several key features in our framework ensure the scalability required by complex streaming applications. First, we propose an efficient stream graph partitioning algorithm that partitions the complex application to achieve the best performance under a given shared memory constraint. Next, the resulting partitions are mapped to multiple GPUs using an efficient architecture-driven strategy. The mapping balances the workload while considering the communication overhead. Finally, a highly effective pipeline execution is employed for the execution of the partitions on the multi-GPU system. The framework has been implemented as a back-end of the StreamIt programming language compiler. Our comprehensive experiments show its scalability and significant performance speedup compared with a previous state-of-the-art solution.", "citation": "Citations (33)", "year": "2012", "departments": ["Agency for Science, Technology and Research", "National University of Singapore", "National University of Singapore", "Agency for Science, Technology and Research"], "conf": "ppopp", "authors": ["Huynh Phung Huynh.....http://dblp.org/pers/hd/h/Huynh:Huynh_Phung", "Andrei Hagiescu.....http://dblp.org/pers/hd/h/Hagiescu:Andrei", "Weng-Fai Wong.....http://dblp.org/pers/hd/w/Wong:Weng=Fai", "Rick Siow Mong Goh.....http://dblp.org/pers/hd/g/Goh:Rick_Siow_Mong"], "pages": 10}