{"title": "Approximate Message Passing with Consistent Parameter Estimation and Applications to Sparse Learning.", "fields": ["scalar", "independent and identically distributed random variables", "gaussian process", "compressed sensing", "belief propagation"], "abstract": "We consider the estimation of an independent and identically distributed (i.i.d.) (possibly non-Gaussian) vector x ∈ R n  from measurements y ∈ R m  obtained by a general cascade model consisting of a known linear transform followed by a probabilistic componentwise (possibly nonlinear) measurement channel. A novel method, called adaptive generalized approximate message passing (adaptive GAMP) is presented. It enables the joint learning of the statistics of the prior and measurement channel along with estimation of the unknown vector x. We prove that, for large i.i.d. Gaussian transform matrices, the asymptotic componentwise behavior of the adaptive GAMP is predicted by a simple set of scalar state evolution equations. In addition, we show that the adaptive GAMP yields asymptotically consistent parameter estimates, when a certain maximum-likelihood estimation can be performed in each step. This implies that the algorithm achieves a reconstruction quality equivalent to the oracle algorithm that knows the correct parameter values. Remarkably, this result applies to essentially arbitrary parametrizations of the unknown distributions, including nonlinear and non-Gaussian ones. The adaptive GAMP methodology thus provides a systematic, general and computationally efficient method applicable to a large range of linear-nonlinear models with provable guarantees.", "citation": "Citations (68)", "departments": ["École Normale Supérieure", "New York University", "University of California, Santa Cruz", "École Normale Supérieure"], "authors": ["Ulugbek Kamilov.....http://dblp.org/pers/hd/k/Kamilov:Ulugbek", "Sundeep Rangan.....http://dblp.org/pers/hd/r/Rangan:Sundeep", "Alyson K. Fletcher.....http://dblp.org/pers/hd/f/Fletcher:Alyson_K=", "Michael Unser.....http://dblp.org/pers/hd/u/Unser:Michael"], "conf": "nips", "year": "2012", "pages": 9}