{"title": "On latency distribution and scaling: from finite to large Cognitive Radio Networks under general mobility.", "fields": ["spectral efficiency", "bounded function", "cognitive radio", "heavy tailed distribution", "latency"], "abstract": "Cognitive Radio Networks (CRNs), as a phenomenal technique to improve spectrum efficiency for opportunistic communications, become an integral component in the future communication regime. In this paper, we study the end-to-end latency in CRNs because many CRN applications, such as military networks and emergency networks, are either time-sensitive or dependent on delay performance. In particular, we consider a general mobility framework that captures most characteristics of the existing models and accounts for spatial heterogeneity resulting from the scenario that some locations are more likely to be visited by mobile nodes (these can be home in the case of people, or garage in the case of vehicles). By assuming that secondary users are mobile under this general framework, we find that there exists a cutoff point on the mobility radius #, which indicates how far a mobile node can reach in the spatial domain, below which the latency has a heavy-tailed distribution and above which the tail distribution is bounded by some Gamma (light-tailed) distribution. A heavy tail of the latency implies a significant probability that it takes long time to disseminate a message from the source to the destination and thus a light-tailed latency is crucial for time-critical applications. Moreover, as the network grows large, we notice that the latency is asymptotically scalable (linear) with the dissemination distance (e.g., the number of hops or Euclidean distance). Another interesting observation is that although the density of primary users adversely impacts the expected latency, it makes no influence on the dichotomy of the tail distribution of the latency in finite networks and the linearity of latency in large networks. Our results encourage the CRN deployment for real-time and large applications, when the mobility radius of secondary users is large enough.", "citation": "Citations (15)", "departments": ["North Carolina State University", "North Carolina State University"], "authors": ["Lei Sun.....http://dblp.org/pers/hd/s/Sun:Lei", "Wenye Wang.....http://dblp.org/pers/hd/w/Wang:Wenye"], "conf": "infocom", "year": "2012", "pages": 9}