{"title": "Cats and dogs.", "fields": ["veterinary medicine", "contextual image classification", "categorization", "phenomenon", "theoretical physics", "applied mathematics", "breed", "collusion", "bag of words model", "animal science", "psychology", "cats", "industrial organization", "helminths", "profitability index", "medicine", "pathology", "physics", "anesthesia", "international trade"], "abstract": "We investigate the fine grained object categorization problem of determining the breed of animal from an image. To this end we introduce a new annotated dataset of pets covering 37 different breeds of cats and dogs. The visual problem is very challenging as these animals, particularly cats, are very deformable and there can be quite subtle differences between the breeds. We make a number of contributions: first, we introduce a model to classify a pet breed automatically from an image. The model combines shape, captured by a deformable part model detecting the pet face, and appearance, captured by a bag-of-words model that describes the pet fur. Fitting the model involves automatically segmenting the animal in the image. Second, we compare two classification approaches: a hierarchical one, in which a pet is first assigned to the cat or dog family and then to a breed, and a flat one, in which the breed is obtained directly. We also investigate a number of animal and image orientated spatial layouts. These models are very good: they beat all previously published results on the challenging ASIRRA test (cat vs dog discrimination). When applied to the task of discriminating the 37 different breeds of pets, the models obtain an average accuracy of about 59%, a very encouraging result considering the difficulty of the problem.", "citation": "Not cited", "year": "2012", "departments": ["University of Oxford", "University of Oxford", "University of Oxford", "International Institute of Information Technology, Hyderabad", "Ludwig Maximilian University of Munich", "University of California, Santa Barbara"], "conf": "cvpr", "authors": ["Omkar M. Parkhi.....http://dblp.org/pers/hd/p/Parkhi:Omkar_M=", "Andrea Vedaldi.....http://dblp.org/pers/hd/v/Vedaldi:Andrea", "Andrew Zisserman.....http://dblp.org/pers/hd/z/Zisserman:Andrew", "C. V. Jawahar.....http://dblp.org/pers/hd/j/Jawahar:C=_V="], "pages": 8}