{"title": "Dynamic scene understanding: The role of orientation features in space and time in scene classification.", "fields": ["contextual image classification", "visual space", "spacetime", "image based modeling and rendering", "visualization"], "abstract": "Natural scene classification is a fundamental challenge in computer vision. By far, the majority of studies have limited their scope to scenes from single image stills and thereby ignore potentially informative temporal cues. The current paper is concerned with determining the degree of performance gain in considering short videos for recognizing natural scenes. Towards this end, the impact of multiscale orientation measurements on scene classification is systematically investigated, as related to: (i) spatial appearance, (ii) temporal dynamics and (iii) joint spatial appearance and dynamics. These measurements in visual space, x-y, and spacetime, x-y-t, are recovered by a bank of spatiotemporal oriented energy filters. In addition, a new data set is introduced that contains 420 image sequences spanning fourteen scene categories, with temporal scene information due to objects and surfaces decoupled from camera-induced ones. This data set is used to evaluate classification performance of the various orientation-related representations, as well as state-of-the-art alternatives. It is shown that a notable performance increase is realized by spatiotemporal approaches in comparison to purely spatial or purely temporal methods.", "citation": "Citations (80)", "year": "2012", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "York University"], "conf": "cvpr", "authors": ["Konstantinos G. Derpanis.....http://dblp.org/pers/hd/d/Derpanis:Konstantinos_G=", "Matthieu Lecce.....http://dblp.org/pers/hd/l/Lecce:Matthieu", "Kostas Daniilidis.....http://dblp.org/pers/hd/d/Daniilidis:Kostas", "Richard P. Wildes.....http://dblp.org/pers/hd/w/Wildes:Richard_P="], "pages": 8}