{"title": "On template-based reconstruction from a single view: Analytical solutions and proofs of well-posedness for developable, isometric and conformal surfaces.", "fields": ["isometry", "regular polygon", "surface reconstruction", "conformal map", "developable surface"], "abstract": "Recovering a deformable surface's 3D shape from a single view registered to a 3D template requires one to provide additional constraints. A recent approach has been to constrain the surface to deform quasi-isometrically. This is applicable to surfaces of materials such as paper and cloth. Current ‘closed-form’ solutions solve a convex approximation of the original problem whereby the surface's depth is maximized under the isometry constraints (this is known as the maximum depth heuristic). No such convex approximation has yet been proposed for the conformal case. We give a unified problem formulation as a system of PDEs for developable, isometric and conformal surfaces that we solve analytically. This has important consequences. First, it gives the first analytical algorithms to solve this type of reconstruction problems. Second, it gives the first algorithms to solve for the exact constraints. Third, it allows us to study the well-posedness of this type of reconstruction: we establish that isometric surfaces can be reconstructed unambiguously and that conformal surfaces can be reconstructed up to a few discrete ambiguities and a global scale. In the latter case, the candidate solution surfaces are obtained analytically. Experimental results on simulated and real data show that our methods generally perform as well as or outperform state of the art approaches in terms of reconstruction accuracy.", "citation": "Citations (65)", "year": "2012", "departments": ["Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique"], "conf": "cvpr", "authors": ["Adrien Bartoli.....http://dblp.org/pers/hd/b/Bartoli:Adrien", "Yan Gérard.....http://dblp.org/pers/hd/g/G=eacute=rard:Yan", "François Chadebecq.....http://dblp.org/pers/hd/c/Chadebecq:Fran=ccedil=ois", "Toby Collins.....http://dblp.org/pers/hd/c/Collins:Toby"], "pages": 8}