{"title": "The design and evaluation of prototype eco-feedback displays for fixture-level water usage data.", "fields": ["formative assessment", "iterative design", "fixture", "usage data", "granularity"], "abstract": "Few means currently exist for home occupants to learn about their water consumption:  e.g. , where water use occurs, whether such use is excessive and what steps can be taken to conserve. Emerging water sensing systems, however, can provide detailed usage data at the level of individual water fixtures ( i.e., disaggregated  usage data). In this paper, we perform formative evaluations of two sets of novel eco-feedback displays that take advantage of this disaggregated data. The first display set isolates and examines specific elements of an eco-feedback design space such as  data  and  time granularity . Displays in the second set act as  design probes  to elicit reactions about competition, privacy, and integration into domestic space. The displays were evaluated via an online survey of 651 North American respondents and in-home, semi-structured interviews with 10 families (20 adults). Our findings are relevant not only to the design of future water eco-feedback systems but also for other types of consumption ( e.g. , electricity and gas).", "citation": "Citations (133)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Jon Froehlich.....http://dblp.org/pers/hd/f/Froehlich:Jon", "Leah Findlater.....http://dblp.org/pers/hd/f/Findlater:Leah", "Marilyn Ostergren.....http://dblp.org/pers/hd/o/Ostergren:Marilyn", "Solai Ramanathan.....http://dblp.org/pers/hd/r/Ramanathan:Solai", "Josh Peterson.....http://dblp.org/pers/hd/p/Peterson:Josh", "Inness Wragg.....http://dblp.org/pers/hd/w/Wragg:Inness", "Eric C. Larson.....http://dblp.org/pers/hd/l/Larson:Eric_C=", "Fabia Fu.....http://dblp.org/pers/hd/f/Fu:Fabia", "Mazhengmin Bai.....http://dblp.org/pers/hd/b/Bai:Mazhengmin", "Shwetak Patel.....http://dblp.org/pers/hd/p/Patel:Shwetak", "James A. Landay.....http://dblp.org/pers/hd/l/Landay:James_A="], "conf": "chi", "year": "2012", "pages": 10}