{"title": "A reverse auction framework for access permission transaction to promote hybrid access in femtocell network.", "fields": ["femtocell", "reverse auction", "data quality", "vickrey clarke groves auction", "network performance"], "abstract": "Femtocell refers to a new class of low-power, low-cost base stations (BSs) which can provide better coverage and improved voice/data Quality of Service (QoS). Hybrid access in two-tier macro-femto network is regarded as the most ideal access control mechanism to enhance overall network performance. But the implementation of hybrid access is hindered by a lack of market that can motivate ACcess Permission (ACP) trading between Wireless Service Providers (WSPs) and private femtocell owners. In this paper, we propose a reverse auction framework for fair and efficient ACP transaction. Unlike strict outcome (the demand of bidder must be fully satisfied) in most of the existing works on auction design, the proposed auction model allows range outcome, in which WSP accepts partial demand fulfillment and femtocell owners makes best-effort selling. We first propose a Vickery-Clarke-Grove (VCG) based mechanism to maximize social welfare. As the VCG mechanism is too time-consuming, we further propose an alternative truthful mechanism (referred to as suboptimal mechanism) with acceptable polynomial computational complexity. The simulation results have shown that the suboptimal mechanism generates almost the same social welfare and the cost for WSP as VCG mechanism.", "citation": "Citations (57)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Waterloo"], "authors": ["Yanjiao Chen.....http://dblp.org/pers/hd/c/Chen:Yanjiao", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Juncheng Jia.....http://dblp.org/pers/hd/j/Jia:Juncheng"], "conf": "infocom", "year": "2012", "pages": 5}