{"title": "Omni-range spatial contexts for visual classification.", "fields": ["bin", "contextual image classification", "arbitrarily large", "discriminative model", "spatial contextual awareness"], "abstract": "Spatial contexts encode rich discriminative information for visual classification. However, as object shapes and scales vary significantly among images, spatial contexts with manually specified distance ranges are not guaranteed with optimality. In this work, we investigate how to automatically select discriminative and stable distance bin groups for modeling image spatial contexts to improve classification performance. We make two observations. First, the number of distance bins for context modeling can be arbitrarily large, and discriminative contexts are only from a small subset of distance bins. Second, adjacent distance bins for contexts modeling often show similar characteristics, thus encouraging grouping them together can result in more stable representation. Utilizing these two observations, we propose an omni-range spatial context mining framework for image classification. A sparse selection and grouping regularizer is employed along with an empirical risk, to discover discriminative and stable distance bin groups for context modeling. To facilitate efficient optimization, the objective function is approximated by a smooth convex function with theoretically guaranteed error bounds. The selected and grouped image spatial contexts, which are applied in food and national flag recognition, are demonstrated to be discriminative, compact and robust.", "citation": "Citations (5)", "year": "2012", "departments": ["Agency for Science, Technology and Research", "National University of Singapore", "Nanjing University of Science and Technology", "National University of Singapore", "University of Illinois at Urbana–Champaign"], "conf": "cvpr", "authors": ["Bingbing Ni.....http://dblp.org/pers/hd/n/Ni:Bingbing", "Mengdi Xu.....http://dblp.org/pers/hd/x/Xu:Mengdi", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Pierre Moulin.....http://dblp.org/pers/hd/m/Moulin:Pierre"], "pages": 8}