{"title": "Traffic clustering and online traffic prediction in vehicle networks: A social influence perspective.", "fields": ["business", "affinity propagation", "simulation", "traffic generation model", "social influence", "data mining", "traffic congestion reconstruction with kerner s three phase theory", "cluster analysis", "spatial correlation"], "abstract": "In this paper we investigate the dynamic traffic relationship characterized by a similarity value from one road point to another in vehicle networks. Due to the regularity of human mobility, traffic exhibits strong correlations in both temporal domain and spatial domain. By exploiting the similarity values, we derive application-specific message update rules for affinity propagation, based on which we propose an instant traffic clustering algorithm to partition the road points into time variant clusters, where the traffics within the same cluster are strongly spatially correlated. Online traffic clustering is also considered by clustering combination via evidence accumulation for further influence study. We also present a neural network based traffic prediction algorithm to predict the traffic conditions cluster by cluster for a future time based on the current and historical traffic data. Simulation study on real traffic data demonstrates that our proposed algorithms are able to identify the true influences among road points and provide accurate traffic predictions.", "citation": "Not cited", "departments": ["George Washington University", "University of Science and Technology of China", "George Washington University", "University of Science and Technology of China", "Beijing Normal University"], "authors": ["Bowu Zhang.....http://dblp.org/pers/hd/z/Zhang:Bowu", "Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng", "Rongfang Bie.....http://dblp.org/pers/hd/b/Bie:Rongfang"], "conf": "infocom", "year": "2012", "pages": 9}