{"title": "Unsupervised face-name association via commute distance.", "fields": ["graph", "machine learning", "speedup", "adjacency matrix", "automatic image annotation"], "abstract": "Recently, the task of unsupervised face-name association has received a considerable interests in multimedia and information retrieval communities. It is quite different with the generic facial image annotation problem because of its unsupervised and ambiguous assignment properties. Specifically, the task of face-name association should obey the following three constraints: (1) a face can only be assigned to a name appearing in its associated caption or to null; (2) a name can be assigned to at most one face; and (3) a face can be assigned to at most one name. Many conventional methods have been proposed to tackle this task while suffering from some common problems, eg, many of them are computational expensive and hard to make the null assignment decision. In this paper, we design a novel framework named face-name association via commute distance (FACD), which judges face-name and face-null assignments under a unified framework via commute distance (CD) algorithm. Then, to further speed up the on-line processing, we propose a novel anchor-based commute distance (ACD) algorithm whose main idea is using the anchor point representation structure to accelerate the eigen-decomposition of the adjacency matrix of a graph. Systematic experiment results on a large scale and real world image-caption database with a total of 194,046 detected faces and 244,725 names show that our proposed approach outperforms many state-of-the-art methods in performance. Our framework is appropriate for a large scale and real-time system.", "citation": "Citations (9)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University"], "authors": ["Jiajun Bu.....http://dblp.org/pers/hd/b/Bu:Jiajun", "Bin Xu.....http://dblp.org/pers/hd/x/Xu_0005:Bin", "Chenxia Wu.....http://dblp.org/pers/hd/w/Wu:Chenxia", "Chun Chen.....http://dblp.org/pers/hd/c/Chen:Chun", "Jianke Zhu.....http://dblp.org/pers/hd/z/Zhu:Jianke", "Deng Cai.....http://dblp.org/pers/hd/c/Cai:Deng", "Xiaofei He.....http://dblp.org/pers/hd/h/He:Xiaofei"], "conf": "mm", "year": "2012", "pages": 10}