{"title": "Reducing power of traffic manager in routers via dynamic on/off-chip scheduling.", "fields": [], "abstract": "Green networking in the Internet becomes increasingly important. In a high-performance router, the dominant power consumer on the Internet, half of its total power usage goes into the line-cards, where the traffic managers inside consume most of it. In this paper, we propose an energy-efficient design on the traffic manager architecture for packet buffering and storage. Unlike traditional routers where packets are always kept in off-chip memory, we propose a dynamic on-chip and off-chip scheduling mechanism, called Dynamic Packet Manager (DPM), to reduce both peak and average power consumption caused by the traffic manager. DPM buffers packets in a small on-chip memory in the light-traffic period, and activates the off-chip memory on when the on-chip memory is to overflow. In this design, when the traffic is light, the off-chip memory is put into power saving state by clock gating so that the average power consumption is reduced. With an on-chip flow based and off-chip class-based design, DPM can save one off-chip memory otherwise used for the per-flow index information storage, therefore further reduce the peak power usage. We present the theoretic analysis guiding the implementation of the DPM mechanism. Experiments on three prototypes implemented on different hardware show that the peak and average power consumptions can be reduced by 27.9% and 37.5% respectively, along with less on-chip memory cost. Besides, the traffic manger with DPM shows better performance on average packet scheduling delay than the one without DPM.", "citation": "Citations (5)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Jindou Fan.....http://dblp.org/pers/hd/f/Fan:Jindou", "Chengchen Hu.....http://dblp.org/pers/hd/h/Hu:Chengchen", "Keqiang He.....http://dblp.org/pers/hd/h/He:Keqiang", "Junchen Jiang.....http://dblp.org/pers/hd/j/Jiang:Junchen", "Bin Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bin"], "conf": "infocom", "year": "2012", "pages": 9}