{"title": "Compressive depth map acquisition using a single photon-counting detector: Parametric signal processing meets sparsity.", "fields": ["raster scan", "architecture", "depth map", "ranging", "lidar"], "abstract": "Active range acquisition systems such as light detection and ranging (LIDAR) and time-of-flight (TOF) cameras achieve high depth resolution but suffer from poor spatial resolution. In this paper we introduce a new range acquisition architecture that does not rely on scene raster scanning as in LIDAR or on a two-dimensional array of sensors as used in TOF cameras. Instead, we achieve spatial resolution through patterned sensing of the scene using a digital micromirror device (DMD) array. Our depth map reconstruction uses parametric signal modeling to recover the set of distinct depth ranges present in the scene. Then, using a convex program that exploits the sparsity of the Laplacian of the depth map, we recover the spatial content at the estimated depth ranges. In our experiments we acquired 64×64-pixel depth maps of fronto-parallel scenes at ranges up to 2.1 M using a pulsed laser, a DMD array and a single photon-counting detector. We also demonstrated imaging in the presence of unknown partially-transmissive occluders. The prototype and results provide promising directions for non-scanning, low-complexity range acquisition devices for various computer vision applications.", "citation": "Citations (31)", "year": "2012", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "University of Rochester", "University of Rochester", "Massachusetts Institute of Technology"], "conf": "cvpr", "authors": ["Andrea Colaco.....http://dblp.org/pers/hd/c/Colaco:Andrea", "Ahmed Kirmani.....http://dblp.org/pers/hd/k/Kirmani:Ahmed", "Gregory A. Howland.....http://dblp.org/pers/hd/h/Howland:Gregory_A=", "John C. Howell.....http://dblp.org/pers/hd/h/Howell:John_C=", "Vivek K. Goyal.....http://dblp.org/pers/hd/g/Goyal:Vivek_K="], "pages": 7}