{"title": "An Axiomatic Memory Model for POWER Multiprocessors.", "fields": ["equivalence", "vendor", "axiom", "memory model", "software"], "abstract": "The growing complexity of hardware optimizations employed by multiprocessors leads to subtle distinctions among allowed and disallowed behaviors, posing challenges in specifying their memory models formally and accurately, and in understanding and analyzing the behavior of concurrent software. This complexity is particularly evident in the IBM® Power Architecture®, for which a faithful specification was published only in 2011 using an operational style. In this paper we present an equivalent axiomatic specification, which is more abstract and concise. Although not officially sanctioned by the vendor, our results indicate that this axiomatic specification provides a reasonable basis for reasoning about current IBM® POWER® multiprocessors. We establish the equivalence of the axiomatic and operational specifications using both manual proof and extensive testing. To demonstrate that the constraint-based style of axiomatic specification is more amenable to computer-aided verification, we develop a SAT-based tool for evaluating possible outcomes of multi-threaded test programs, and we show that this tool is significantly more efficient than a tool based on an operational specification.", "citation": "Citations (83)", "year": "2012", "departments": ["University of Pennsylvania", "French Institute for Research in Computer Science and Automation", "University of Cambridge", "University of Cambridge", "University of Oxford"], "conf": "cav", "authors": ["Sela Mador-Haim.....http://dblp.org/pers/hd/m/Mador=Haim:Sela", "Luc Maranget.....http://dblp.org/pers/hd/m/Maranget:Luc", "Susmit Sarkar.....http://dblp.org/pers/hd/s/Sarkar:Susmit", "Kayvan Memarian.....http://dblp.org/pers/hd/m/Memarian:Kayvan", "Jade Alglave.....http://dblp.org/pers/hd/a/Alglave:Jade", "Scott Owens.....http://dblp.org/pers/hd/o/Owens:Scott", "Rajeev Alur.....http://dblp.org/pers/hd/a/Alur:Rajeev", "Milo M. K. Martin.....http://dblp.org/pers/hd/m/Martin:Milo_M=_K=", "Peter Sewell.....http://dblp.org/pers/hd/s/Sewell:Peter", "Derek Williams.....http://dblp.org/pers/hd/w/Williams:Derek"], "pages": 18}