{"title": "Input-sensitive profiling.", "fields": ["instrumentation", "workload", "profiling", "tuple", "benchmark", "asymptotic analysis", "dynamic program analysis", "spec", "theoretical computer science"], "abstract": "In this paper we present a profiling methodology and toolkit for helping developers discover hidden asymptotic inefficiencies in the code. From one or more runs of a program, our profiler automatically measures how the performance of individual routines scales as a function of the input size, yielding clues to their growth rate. The output of the profiler is, for each executed routine of the program, a set of tuples that aggregate performance costs by input size. The collected profiles can be used to produce performance plots and derive trend functions by statistical curve fitting or bounding techniques. A key feature of our method is the ability to automatically measure the size of the input given to a generic code fragment: to this aim, we propose an effective metric for estimating the input size of a routine and show how to compute it efficiently. We discuss several case studies, showing that our approach can reveal asymptotic bottlenecks that other profilers may fail to detect and characterize the workload and behavior of individual routines in the context of real applications. To prove the feasibility of our techniques, we implemented a Valgrind tool called aprof and performed an extensive experimental evaluation on the SPEC CPU2006 benchmarks. Our experiments show that aprof delivers comparable performance to other prominent Valgrind tools, and can generate informative plots even from single runs on typical workloads for most algorithmically-critical routines.", "citation": "Not cited", "departments": ["Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "University of Illinois at Chicago", "University of Illinois at Chicago", "University of Illinois at Chicago"], "authors": ["Emilio Coppa.....http://dblp.org/pers/hd/c/Coppa:Emilio", "Camil Demetrescu.....http://dblp.org/pers/hd/d/Demetrescu:Camil", "Irene Finocchi.....http://dblp.org/pers/hd/f/Finocchi:Irene"], "conf": "pldi", "year": "2012", "pages": 10}