{"title": "Fair background data transfers of minimal delay impact.", "fields": ["tcp global synchronization", "hstcp", "tcp tuning", "tcp friendly rate control", "approximation error"], "abstract": "In this paper we present a methodology for the design of congestion control protocols for background data transfers that have a minimal delay impact on short TCP transfers and compete for a target share of the leftover average capacity with other background TCP transfers. We analytically compute the optimal policy and show that it's delay performance can be well approximated by a weighted TCP policy, which maintains a target proportion of TCPs bandwidth at all times in order to achieve the same share of excess capacity. The relative approximation error is always less than 17.2% while it quickly decreases to zero as the number of coexisting background TCP flows increases. Next, we consider a general utility-based fairness criterion for sharing the leftover average capacity, including a penalty term capturing the delay impact to short flows. The criterion is jointly optimized over all allocations of excess capacity to background flows (including TCP ones) on long timescales, and all bandwidth sharing policies on fast time scales. Even though the delay optimal sharing policy that solves the above optimization problem does not lead to distributed congestion control algorithms and more significantly, requires knowledge of the number of competing background TCP flows, both problems disappear under the weighted TCP policy. A distributed weight adjustment policy is considered where, at equilibrium, the overall performance is nearly optimal, with a vanishing relative optimality error as the number of background TCP flows increases. We illustrate the methodology by giving two examples of congestion control algorithms for background transfers. Both achieve low delay for short flows relative to TCP, but at the same time they present strong incentives for adoption against incumbent low priority solutions in public environments.", "citation": "Citations (4)", "departments": ["Athens University of Economics and Business", "Athens University of Economics and Business"], "authors": ["Costas Courcoubetis.....http://dblp.org/pers/hd/c/Courcoubetis:Costas", "Antonis Dimakis.....http://dblp.org/pers/hd/d/Dimakis:Antonis"], "conf": "infocom", "year": "2012", "pages": 9}