{"title": "Designing FPT Algorithms for Cut Problems Using Randomized Contractions.", "fields": ["unique games conjecture", "maximum cut", "alphabet", "double exponential function", "minimum cut", "bounded function", "binary logarithm", "parameterized complexity"], "abstract": "We introduce a new technique for designing fixed-parameter algorithms for cut problems, namely randomized contractions. With our framework: * We obtain the first FPT algorithm for the parameterized version of the UNIQUE LABEL COVER problem, with single exponential dependency on the size of the cutset and the size of the alphabet. As a consequence, we extend the set of the polynomial time solvable instances of UNIQUE GAMES to those with at most O(sqrt{log n}) violated constraints. * We obtain a new FPT algorithm for the STEINER CUT problem with exponential speed-up over the recent work of Kawarabayashi and Thorup (FOCS'11). * We show how to combine considering 'cut' and 'uncut' constraints at the same time. We define a robust problem NODE MULTIWAY CUT-UNCUT that can serve as an abstraction of introducing uncut constraints, and show that it admits an FPT algorithm with single exponential dependency on the size of the cutset. To the best of our knowledge, the only known way of tackling uncut constraints was via the approach of Marx, O'Sullivan and Razgon (STACS'10), which yields algorithms with double exponential running time. An interesting aspect of our algorithms is that they can handle real weights, to the best of our knowledge, the technique of important separators does not work in the weighted version.", "citation": "Citations (22)", "year": "2012", "departments": ["University of Maryland, College Park", "University of Lugano", "University of Maryland, College Park", "University of Warsaw", "University of Bergen"], "conf": "focs", "authors": ["Rajesh Hemant Chitnis.....http://dblp.org/pers/hd/c/Chitnis:Rajesh_Hemant", "Marek Cygan.....http://dblp.org/pers/hd/c/Cygan:Marek", "MohammadTaghi Hajiaghayi.....http://dblp.org/pers/hd/h/Hajiaghayi:MohammadTaghi", "Marcin Pilipczuk.....http://dblp.org/pers/hd/p/Pilipczuk:Marcin", "Michal Pilipczuk.....http://dblp.org/pers/hd/p/Pilipczuk:Michal"], "pages": 10}