{"title": "Strategic Advice Provision in Repeated Human-Agent Interactions.", "fields": ["complete information", "management science", "knowledge management", "hyperbolic discounting", "empirical research", "multi agent system", "behavioral economics"], "abstract": "This paper addresses the problem of automated advice provision in scenarios that involve repeated interactions between people and computer agents. This problem arises in many applications such as route selection systems, office assistants and climate control systems. To succeed in such settings agents must reason about how their advice influences people's future actions or decisions over time. This work models such scenarios as a family of repeated bilateral interaction called \"choice selection processes\", in which humans or computer agents may share certain goals, but are essentially self-interested. We propose a social agent for advice provision (SAP) for such environments that generates advice using a social utility function which weighs the sum of the individual utilities of both agent and human participants. The SAP agent models human choice selection using hyperbolic discounting and samples the model to infer the best weights for its social utility function. We demonstrate the effectiveness of SAP in two separate domains which vary in the complexity of modeling human behavior as well as the information that is available to people when they need to decide whether to accept the agent's advice. In both of these domains, we evaluated SAP in extensive empirical studies involving hundreds of human subjects. SAP was compared to agents using alternative models of choice selection processes informed by behavioral economics and psychological models of decision-making. Our results show that in both domains, the SAP agent was able to outperform alternative models. This work demonstrates the efficacy of combining computational methods with behavioral economics to model how people reason about machine-generated advice and presents a general methodology for agent-design in such repeated advice settings.", "citation": "Citations (31)", "departments": ["Carnegie Mellon University", "Ben-Gurion University of the Negev", "Bar-Ilan University", "General Motors", "Bar-Ilan University", "Bar-Ilan University", "University of Maryland, College Park", "General Motors", "Ben-Gurion University of the Negev"], "authors": ["Amos Azaria.....http://dblp.org/pers/hd/a/Azaria:Amos", "Zinovi Rabinovich.....http://dblp.org/pers/hd/r/Rabinovich:Zinovi", "Sarit Kraus.....http://dblp.org/pers/hd/k/Kraus:Sarit", "Claudia V. Goldman.....http://dblp.org/pers/hd/g/Goldman:Claudia_V=", "Ya'akov Gal.....http://dblp.org/pers/hd/g/Gal:Ya=akov"], "conf": "aaai", "year": "2012", "pages": -1}