{"title": "Guess Again (and Again and Again): Measuring Password Strength by Simulating Password-Cracking Algorithms.", "fields": ["password policy", "computer access control", "password strength", "cognitive password", "password cracking"], "abstract": "Text-based passwords remain the dominant authentication method in computer systems, despite significant advancement in attackers' capabilities to perform password cracking. In response to this threat, password composition policies have grown increasingly complex. However, there is insufficient research defining metrics to characterize password strength and using them to evaluate password-composition policies. In this paper, we analyze 12,000 passwords collected under seven composition policies via an online study. We develop an efficient distributed method for calculating how effectively several heuristic password-guessing algorithms guess passwords. Leveraging this method, we investigate (a) the resistance of passwords created under different conditions to guessing, (b) the performance of guessing algorithms under different training sets, (c) the relationship between passwords explicitly created under a given composition policy and other passwords that happen to meet the same requirements, and (d) the relationship between guess ability, as measured with password-cracking algorithms, and entropy estimates. Our findings advance understanding of both password-composition policies and metrics for quantifying password security.", "citation": "Citations (311)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Patrick Gage Kelley.....http://dblp.org/pers/hd/k/Kelley:Patrick_Gage", "Saranga Komanduri.....http://dblp.org/pers/hd/k/Komanduri:Saranga", "Michelle L. Mazurek.....http://dblp.org/pers/hd/m/Mazurek:Michelle_L=", "Richard Shay.....http://dblp.org/pers/hd/s/Shay:Richard", "Timothy Vidas.....http://dblp.org/pers/hd/v/Vidas:Timothy", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Nicolas Christin.....http://dblp.org/pers/hd/c/Christin:Nicolas", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith", "Julio Lopez.....http://dblp.org/pers/hd/l/Lopez:Julio"], "conf": "sp", "year": "2012", "pages": 15}