{"title": "\"We've bin watching you\": designing for reflection and social persuasion to promote sustainable lifestyles.", "fields": ["bin", "everyday life", "feeling", "normative", "persuasion"], "abstract": "BinCam is a social persuasive system to motivate reflection and behavioral change in the food waste and recycling habits of young adults. The system replaces an existing kitchen refuse bin and automatically logs disposed of items through digital images captured by a smart phone installed on the underside of the bin lid. Captured images are uploaded to a BinCam application on Facebook where they can be explored by all users of the BinCam system. Engagement with BinCam is designed to fit into the existing structure of users' everyday life, with the intention that reflection on waste and recycling becomes a playful and shared group activity. Results of a user study reveal an increase in both users' awareness of, and reflection about, their waste management and their motivation to improve their waste-related skills. With BinCam, we also explore informational and normative social influences as a source of change (e.g., socially evoked feelings of 'guilt' for non-recycling or food disposal), which has to date been underexplored in persuasive HCI. Design implications for reflection and social persuasion are proposed.", "citation": "Citations (114)", "departments": ["Newcastle University", "Newcastle University", "Newcastle University", "University of Duisburg-Essen", "Univeristy of D ... tfalia, Germany"], "authors": ["Anja Thieme.....http://dblp.org/pers/hd/t/Thieme:Anja", "Rob Comber.....http://dblp.org/pers/hd/c/Comber:Rob", "Julia Miebach.....http://dblp.org/pers/hd/m/Miebach:Julia", "Jack Weeden.....http://dblp.org/pers/hd/w/Weeden:Jack", "Nicole C. Krämer.....http://dblp.org/pers/hd/k/Kr=auml=mer:Nicole_C=", "Shaun W. Lawson.....http://dblp.org/pers/hd/l/Lawson:Shaun_W=", "Patrick Olivier.....http://dblp.org/pers/hd/o/Olivier:Patrick"], "conf": "chi", "year": "2012", "pages": 10}