{"title": "Cross-Entropy Optimisation of Importance Sampling Parameters for Statistical Model Checking.", "fields": ["importance sampling", "continuous time markov chain", "state space", "cross entropy", "stochastic matrix"], "abstract": "Statistical model checking avoids the exponential growth of states associated with probabilistic model checking by estimating probabilities from multiple executions of a system and by giving results within confidence bounds. Rare properties are often important but pose a particular challenge for simulation-based approaches, hence a key objective for statistical model checking (SMC) is to reduce the number and length of simulations necessary to produce a result with a given level of confidence. Importance sampling can achieves this, however to maintain the advantages of SMC it is necessary to find good importance sampling distributions without considering the entire state space.\n\nHere we present a simple algorithm that uses the notion of cross-entropy to find an optimal importance sampling distribution. In contrast to previous work, our algorithm uses a naturally defined low dimensional vector of parameters to specify this distribution and thus avoids the intractable explicit representation of a transition matrix. We show that our parametrisation leads to a unique optimum and can produce many orders of magnitude improvement in simulation efficiency. We demonstrate the efficacy of our methodology by applying it to models from reliability engineering and biochemistry.", "citation": "Citations (53)", "year": "2012", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "conf": "cav", "authors": ["Cyrille Jégourel.....http://dblp.org/pers/hd/j/J=eacute=gourel:Cyrille", "Axel Legay.....http://dblp.org/pers/hd/l/Legay:Axel", "Sean Sedwards.....http://dblp.org/pers/hd/s/Sedwards:Sean"], "pages": 16}