{"title": "WEST: Cloning data cache behavior using Stochastic Traces.", "fields": ["cache invalidation", "bus sniffing", "cache oblivious algorithm", "smart cache", "cache pollution"], "abstract": "Cache designers need an in-depth understanding of end user workloads, but certain end users are apprehensive about sharing code or traces due to the proprietary or confidential nature of code and data. To bridge this gap, cache designers use a reduced representation of the code (a clone). A promising cloning approach is the black box approach, where workloads are profiled to obtain key statistics, and a clone is automatically generated. Despite its potential, currently there are no highly accurate black box cloning methods for replicating data cache behavior. We propose Workload Emulation using Stochastic Traces (WEST), a highly accurate black box cloning technique for replicating data cache behavior of arbitrary programs. First, we analyze what profiling statistics are necessary and sufficient to capture a workload. Then, we generate a clone stochastically that produces statistics identical to the proprietary workload. WEST clones can be used in lieu of the workload for exploring cache sizes, associativities, write policies, replacement policies, cache hierarchies and co-scheduling, at a significantly reduced simulation time. We use a simple IPC model to control the rate of accesses to the cache hierarchy. We evaluated WEST using CPU2006 and BioBench suites over a wide cache design space for single core and dual core CMPs. The clones achieve an average error in miss ratio of only 0.4% across 1394 single core cache configurations. For co-scheduled mixes, WEST achieves an average error in miss ratio of only 3.1% for over 600 configurations.", "citation": "Citations (17)", "departments": ["North Carolina State University", "North Carolina State University"], "authors": ["Ganesh Balakrishnan.....http://dblp.org/pers/hd/b/Balakrishnan:Ganesh", "Yan Solihin.....http://dblp.org/pers/hd/s/Solihin:Yan"], "conf": "hpca", "year": "2012", "pages": 12}