{"title": "Succinct Arguments from Multi-prover Interactive Proofs and Their Efficiency Benefits.", "fields": ["mathematical proof", "cryptographic hash function", "nondeterministic algorithm", "interactive proof system", "succinct data structure"], "abstract": "Succinct arguments of knowledge are computationally-sound proofs of knowledge for NP where the verifier's running time is independent of the time complexity of the NP nondeterministic machine for the considered language.\n\nExisting succinct argument constructions are, typically, based on techniques that combine cryptographic hashing and probabilistically-checkable proofs PCPs, and thus, in light of today's state-of-the-art PCP technology, are quite inefficient: either one uses long PCP proofs with lots of redundancy to make the verifier fast but at the cost of making the prover slow, or one uses short PCP proofs to make the prover fast but at the cost of making the verifier slow.\n\nTo obtain better efficiency, we propose to investigate the alternative approach of constructing succinct arguments based on multi-prover interactive proofs MIPs and stronger cryptographic techniques:\n\n1 We construct a one-round succinct MIP of knowledge protocol where i each prover is highly efficient in terms of time AND space, and ALSO ii the verifier is highly efficient.\n\n2 We show how to transform any one round MIP protocol to a succinct four-message argument with a single prover, while preserving the time and space efficiency of the original MIP protocol.\n\nAs a main tool for this transformation, we construct a succinct multi-function commitment that a allows the sender to commit to a vector of functions in time and space complexity that are essentially the same as those needed for a single evaluation of the functions, and b ensures that the receiver's running time is essentially independent of the function. The scheme is based on fully-homomorphic encryption and no additional assumptions are needed for our succinct argument.\n\n3 In addition, we revisit the problem of non-interactive succinct arguments of knowledge SNARKs, where known impossibilities rule out solutions based on black-box reductions to standard assumptions. We formulate a natural though non-standard variant of homomorphic encryption that has a homomorphism-extraction property. We then show that his primitive essentially allows to \"squash\" our interactive protocol, while again preserving time and space efficiency. We further show that this variant is, in fact, implied by the existence of SNARKs.", "citation": "Citations (18)", "departments": ["Massachusetts Institute of Technology", "TAU, Tel Aviv, Israel"], "authors": ["Nir Bitansky.....http://dblp.org/pers/hd/b/Bitansky:Nir", "Alessandro Chiesa.....http://dblp.org/pers/hd/c/Chiesa:Alessandro"], "conf": "crypto", "year": "2012", "pages": 18}