{"title": "TraceLab: An experimental workbench for equipping researchers to innovate, synthesize, and comparatively evaluate traceability solutions.", "fields": ["visual modeling", "traceability", "benchmark", "unix", "innovation management"], "abstract": "TraceLab is designed to empower future traceability research, through facilitating innovation and creativity, increasing collaboration between researchers, decreasing the startup costs and effort of new traceability research projects, and fostering technology transfer. To this end, it provides an experimental environment in which researchers can design and execute experiments in TraceLab's visual modeling environment using a library of reusable and user-defined components. TraceLab fosters research competitions by allowing researchers or industrial sponsors to launch research contests intended to focus attention on compelling traceability challenges. Contests are centered around specific traceability tasks, performed on publicly available datasets, and are evaluated using standard metrics incorporated into reusable TraceLab components. TraceLab has been released in beta-test mode to researchers at seven universities, and will be publicly released via CoEST.org in the summer of 2012. Furthermore, by late 2012 TraceLab's source code will be released as open source software, licensed under GPL. TraceLab currently runs on Windows but is designed with cross platforming issues in mind to allow easy ports to Unix and Mac environments.", "citation": "Citations (59)", "departments": ["DePaul University", "DePaul University", "DePaul University", "DePaul University", "DePaul University"], "authors": ["Ed Keenan.....http://dblp.org/pers/hd/k/Keenan:Ed", "Adam Czauderna.....http://dblp.org/pers/hd/c/Czauderna:Adam", "Greg Leach.....http://dblp.org/pers/hd/l/Leach:Greg", "Jane Cleland-Huang.....http://dblp.org/pers/hd/c/Cleland=Huang:Jane", "Yonghee Shin.....http://dblp.org/pers/hd/s/Shin:Yonghee", "Evan Moritz.....http://dblp.org/pers/hd/m/Moritz:Evan", "Malcom Gethers.....http://dblp.org/pers/hd/g/Gethers:Malcom", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys", "Jonathan I. Maletic.....http://dblp.org/pers/hd/m/Maletic:Jonathan_I=", "Jane Huffman Hayes.....http://dblp.org/pers/hd/h/Hayes:Jane_Huffman", "Alex Dekhtyar.....http://dblp.org/pers/hd/d/Dekhtyar:Alex", "Daria Manukian.....http://dblp.org/pers/hd/m/Manukian:Daria", "Shervin Hossein.....http://dblp.org/pers/hd/h/Hossein:Shervin", "Derek Hearn.....http://dblp.org/pers/hd/h/Hearn:Derek"], "conf": "icse", "year": "2012", "pages": 4}