{"title": "Mixing real and virtual conferencing: Lessons learned.", "fields": ["teleconference", "participant observation", "sound quality", "distributed collaboration", "collaborative virtual environment", "instructional simulation", "data type", "fidelity"], "abstract": "This paper describes a conference which linked several remote location sites via a virtual environment so that the virtual audience could follow the presentations and interact with real presenters. The aim was to assess the feasibility of linking distributed virtual audiences to an ongoing conference event. The conference consisted of an annual gathering of researchers and developers of a global information technology consultancy firm based in India. This firm developed a virtual environment specifically for distributed collaboration across sites. During the conference, researchers gathered various types of data, including participant observations, interviews, capture of the virtual environment and a survey of the audience. These data are analysed in the paper. The main finding is that a number of `low tech' improvements could be made to the operation of the system that could greatly enhance this type of virtual conferencing. A related finding is that the visual fidelity of the environment and of the avatars plays a lesser role than other factors such as audio quality. Given the paucity of research on how virtual conferencing can substitute for travel, plus the urgency of this topic for environmental reasons, a number of suggestions are made for the implementation of remote virtual conference participation.", "citation": "Not cited", "departments": ["Tata Consultancy Services", "University of Oxford", "Tata Consultancy Services", "Tata Consultancy Services", "University of Oxford", "Tata Consultancy Services"], "authors": ["Ajay Surendernath.....http://dblp.org/pers/hd/s/Surendernath:Ajay", "Geetika Sharma.....http://dblp.org/pers/hd/s/Sharma:Geetika", "Ralph Schroeder.....http://dblp.org/pers/hd/s/Schroeder:Ralph", "Basant Kumar Pandey.....http://dblp.org/pers/hd/p/Pandey:Basant_Kumar"], "conf": "vr", "year": "2012", "pages": 2}