{"title": "Traffic-aware multiple mix zone placement for protecting location privacy.", "fields": ["heuristic", "location based service", "adversary", "information privacy", "constrained optimization"], "abstract": "Privacy protection is of critical concern to Location-Based Service (LBS) users in mobile networks. Long-term pseudonyms, although appear to be anonymous, in fact empower third-party service providers to continuously track users' movements. Researchers have proposed the mix zone model to allow pseudonym changes in protected areas. In this paper, we investigate a new form of privacy attack to the LBS system that an adversary reveals a user's true identity and complete moving trajectory with the aid of side information. We propose a new metric to quantify the system's resilience to such attacks, and suggest using multiple mix zones to tackle this problem. A mathematical model is presented that treats the deployment of multiple mix zones as a cost constrained optimization problem. Furthermore, the influence of traffic density is also taken into account to enhance the protection effectiveness. The placement optimization problem is NP-hard. We therefore design two heuristic algorithms as practical and effective means to strategically select mix zone locations, and consequently reduce the privacy risks of mobile users trajectories. The effectiveness of our proposed solutions is demonstrated through extensive simulations on real-world mobile user data traces.", "citation": "Citations (100)", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida", "University of Florida"], "authors": ["Xinxin Liu.....http://dblp.org/pers/hd/l/Liu:Xinxin", "Han Zhao.....http://dblp.org/pers/hd/z/Zhao:Han", "Miao Pan.....http://dblp.org/pers/hd/p/Pan:Miao", "Hao Yue.....http://dblp.org/pers/hd/y/Yue:Hao", "Xiaolin Li.....http://dblp.org/pers/hd/l/Li_0001:Xiaolin", "Yuguang Fang.....http://dblp.org/pers/hd/f/Fang:Yuguang"], "conf": "infocom", "year": "2012", "pages": 9}