{"title": "Searching and mining trillions of time series subsequences under dynamic time warping.", "fields": ["dynamic time warping", "bottleneck", "subroutine", "data stream mining", "nearest neighbor search"], "abstract": "Most time series data mining algorithms use similarity search as a core subroutine, and thus the time taken for similarity search is the bottleneck for virtually all time series data mining algorithms. The difficulty of scaling search to large datasets largely explains why most academic work on time series data mining has plateaued at considering a few millions of time series objects, while much of industry and science sits on billions of time series objects waiting to be explored. In this work we show that by using a combination of four novel ideas we can search and mine truly massive time series for the first time. We demonstrate the following extremely unintuitive fact; in large datasets we can exactly search under DTW much more quickly than the current state-of-the-art  Euclidean distance  search algorithms. We demonstrate our work on the largest set of time series experiments ever attempted. In particular, the largest dataset we consider is larger than the combined size of all of the time series datasets considered in all data mining papers ever published. We show that our ideas allow us to solve higher-level time series data mining problem such as motif discovery and clustering at scales that would otherwise be untenable. In addition to mining massive datasets, we will show that our ideas also have implications for real-time monitoring of data streams, allowing us to handle much faster arrival rates and/or use cheaper and lower powered devices than are currently possible.", "citation": "Citations (511)", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "University of São Paulo", "Brigham and Women's Hospital"], "authors": ["Thanawin Rakthanmanon.....http://dblp.org/pers/hd/r/Rakthanmanon:Thanawin", "Bilson J. L. Campana.....http://dblp.org/pers/hd/c/Campana:Bilson_J=_L=", "Abdullah Mueen.....http://dblp.org/pers/hd/m/Mueen:Abdullah", "Gustavo E. A. P. A. Batista.....http://dblp.org/pers/hd/b/Batista:Gustavo_E=_A=_P=_A=", "M. Brandon Westover.....http://dblp.org/pers/hd/w/Westover:M=_Brandon", "Qiang Zhu.....http://dblp.org/pers/hd/z/Zhu_0002:Qiang", "Jesin Zakaria.....http://dblp.org/pers/hd/z/Zakaria:Jesin", "Eamonn J. Keogh.....http://dblp.org/pers/hd/k/Keogh:Eamonn_J="], "conf": "kdd", "year": "2012", "pages": 9}