{"title": "Optimal resource allocation to defend against deliberate attacks in networking infrastructures.", "fields": ["nash equilibrium", "game theory", "flow network", "zero sum game", "strategy"], "abstract": "Protecting networking infrastructures from malicious attacks is important as a successful attack on a high data rate link can cause the loss or delay of large amounts of data. In this paper, we consider a proactive approach where the ISPs are willing to allocate some (limited) resources to defend the networking infrastructures against the attacks. We aim to answer where and how much the defending resource should be placed so that the expected data loss can be minimized no matter where the attacker may launch the attack. We model the problem as a 2-player zero-sum game where the payoffs are measured by the maximum network flow. In order to overcome the unique challenges of such payoffs, we transform the payoffs into explicit piece-wise functions through multi-parametric linear programming (MP-LP) and divide the entire strategy space into a set of critical regions. We prove that a global Nash Equilibrium (NE) exists when there is only one critical region. However, when the number of critical regions is greater than 1, there is no global NE. We also prove that there exists one and only one local NE in each critical region. We then design a mixed-strategy solution. Our results have shown that to dedicate all defending resources to one min-cut set when there are multiple min-cut sets will not be an optimal solution, however, min-cut strategies will have higher probabilities to be selected in the mixed-strategy solution when the defending resource is limited.", "citation": "Citations (4)", "departments": ["City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "University at Buffalo"], "authors": ["Xun Xiao.....http://dblp.org/pers/hd/x/Xiao:Xun", "Minming Li.....http://dblp.org/pers/hd/l/Li:Minming", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming"], "conf": "infocom", "year": "2012", "pages": 9}