{"title": "JustMyFriends: full SQL, full transactional amenities, and access privacy.", "fields": ["data sharing", "stored procedure", "nobody", "login", "data access"], "abstract": "A major obstacle to using Cloud services for many enterprises is the fear that the data will be stolen. Bringing the Cloud in-house is an incomplete solution to the problem because that implies that data center personnel as well as myriad repair personnel must be trusted. An ideal security solution would be to share data among precisely the people who should see it (\"my friends\") and nobody else.   Encryption might seem to be an easy answer. Each friend could download the data, update it perhaps, and return it to a shared untrusted repository. But such a solution permits no concurrency and therefore no real sharing.   JustMyFriends ensures sharing among friends without revealing unencrypted data to anyone outside of a circle of trust. In fact, non-friends (such as system administrators) see only encrypted blobs being added to a persistent store. JustMyFriends allows data sharing and full transactions. It supports the use of all SQL including stored procedures, updates, and arbitrary queries. Additionally, it provides full access privacy, preventing the host from discovering patterns or correlations in the user's data access behavior.   The demonstration will show how friends in an unnamed government agency can coordinate the management of a spy network in a transactional fashion. Demo visitors will be able to play the roles of station chiefs and/or of troublemakers. As station chiefs, they will write their own transactions and queries, logout, login. As troublemakers, visitors will be able to play the role of a curious observer, kill client processes, and in general try to disrupt the system.", "citation": "Citations (1)", "year": "2012", "departments": ["New York University", "New York University"], "conf": "sigmod", "authors": ["Arthur Meacham.....http://dblp.org/pers/hd/m/Meacham:Arthur", "Dennis E. Shasha.....http://dblp.org/pers/hd/s/Shasha:Dennis_E="], "pages": 4}