{"title": "A generic framework for throughput-optimal control in MR-MC wireless networks.", "fields": ["queuing delay", "rate monotonic scheduling", "two level scheduling", "round robin scheduling", "fair share scheduling"], "abstract": "In this paper, we study the throughput-optimal control in the multi-radio multi-channel (MR-MC) wireless networks, which is particularly challenging due to the coupled link scheduling and channel/radio assignment. This paper has threefold contributions: 1) We develop a new model by transforming a network node into multiple node-radio-channel (NRC) tuples. Such modeling facilitates the development of a tuple-based back pressure algorithm, the solution of which can jointly solve the link scheduling, routing and channel/radio assignment in the MRMC network. 2) The tuple-based model enables the extensions of some well-known algorithms, e.g., greedy maximal scheduling and maximal scheduling, to MR-MC networks with guaranteed performance. We provide stability and capacity efficiency ratio analysis to the tuple-based scheduling algorithms. 3) The tuple-based framework facilitates a decomposable cross-layer formulation that enhances the delay performance of throughput-optimal control by integrating the link-layer scheduling with the network-layer path selection, where both hop-count and queuing delay are considered. Simulation results are presented to demonstrate the capacity region and delay performance of the proposed methodology, with comparison to the existing approach [3].", "citation": "Citations (11)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Hongkun Li.....http://dblp.org/pers/hd/l/Li:Hongkun", "Yu Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Yu", "Xiaohua Tian.....http://dblp.org/pers/hd/t/Tian:Xiaohua", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing"], "conf": "infocom", "year": "2012", "pages": 9}