{"title": "HAWK: An unmanned mini helicopter-based aerial wireless kit for localization.", "fields": ["moore curve", "moore space", "mobile computing", "motion planning", "packet analyzer", "waypoint"], "abstract": "This paper presents a fully functional and highly portable mini Unmanned Aerial Vehicle (UAV) system, HAWK, for conducting aerial localization. HAWK is a programmable mini helicopter - Draganflyer X6 - armed with a wireless sniffer - Nokia N900. We developed custom PI-Control laws to implement a robust waypoint algorithm for the mini helicopter to fly a planned route. A Moore space filling curve is designed as a flight route for HAWK to survey a specific area. A set of theorems were derived to calculate the minimum Moore curve level for sensing all targets in the area with minimum flight distance. With such a flight strategy, we can confine the location of a target of interest to a small hot area. We can recursively apply the Moore curve based flight route to the hot area for a fine-grained localization of a target of interest. Therefore, HAWK does not rely on a positioning infrastructure for localization. We have conducted extensive experiments to validate the feasibility of HAWK and our theory. A demo of HAWK in autonomous fly is available at http://www.youtube.com/watch?v=ju86xnHbEq0.", "citation": "Citations (6)", "departments": ["University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Connecticut", "University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Massachusetts Lowell", "University of Connecticut", "University of Massachusetts Lowell"], "authors": ["Zhongli Liu.....http://dblp.org/pers/hd/l/Liu:Zhongli", "Yinjie Chen.....http://dblp.org/pers/hd/c/Chen:Yinjie", "Benyuan Liu.....http://dblp.org/pers/hd/l/Liu:Benyuan", "Chengyu Cao.....http://dblp.org/pers/hd/c/Cao:Chengyu", "Xinwen Fu.....http://dblp.org/pers/hd/f/Fu:Xinwen"], "conf": "infocom", "year": "2012", "pages": 9}