{"title": "Cosmic rays don't strike twice: understanding the nature of DRAM errors and the implications for system design.", "fields": ["dram", "data scrubbing", "soft error", "memory errors", "granularity"], "abstract": "Main memory is one of the leading hardware causes for machine crashes in today's datacenters. Designing, evaluating and modeling systems that are resilient against memory errors requires a good understanding of the underlying characteristics of errors in DRAM in the field. While there have recently been a few first studies on DRAM errors in production systems, these have been too limited in either the size of the data set or the granularity of the data to conclusively answer many of the open questions on DRAM errors. Such questions include, for example, the prevalence of soft errors compared to hard errors, or the analysis of typical patterns of hard errors. In this paper, we study data on DRAM errors collected on a diverse range of production systems in total covering nearly 300 terabyte-years of main memory. As a first contribution, we provide a detailed analytical study of DRAM error characteristics, including both hard and soft errors. We find that a large fraction of DRAM errors in the field can be attributed to hard errors and we provide a detailed analytical study of their characteristics. As a second contribution, the paper uses the results from the measurement study to identify a number of promising directions for designing more resilient systems and evaluates the potential of different protection mechanisms in the light of realistic error patterns. One of our findings is that simple page retirement policies might be able to mask a large number of DRAM errors in production systems, while sacrificing only a negligible fraction of the total DRAM in the system.", "citation": "Citations (221)", "year": "2012", "departments": ["University of Toronto", "University of Toronto", "University of Toronto"], "conf": "asplos", "authors": ["Andy A. Hwang.....http://dblp.org/pers/hd/h/Hwang:Andy_A=", "Ioan A. Stefanovici.....http://dblp.org/pers/hd/s/Stefanovici:Ioan_A=", "Bianca Schroeder.....http://dblp.org/pers/hd/s/Schroeder:Bianca"], "pages": 12}