{"title": "Fault-tolerant RFID reader localization based on passive RFID tags.", "fields": ["redundancy", "distributed computing", "real time computing", "computer science", "indexation", "fault tolerance"], "abstract": "With the growing use of RFID-based devices, RFID reader localization attracts increasing attentions recently. In this technology, an object carrying an RFID reader is located by communicating with some passive RFID tags deployed in the environment. One important problem of RFID reader localization is that frequent occurred RFID faults affect localization accuracy. Specifically, complex localization environment (may include metal, water, obstacles, etc.) makes some tags fail to communicate with the reader, which makes the localization result deviate from the real location. Existing approaches can tolerate the faults occurred in individual tags and lasting for a short time period, but suffer serious localization error if the faults exist in a large region and last for a long time period. Moreover, existing approaches do not provide quality measurement of a localization result. In this paper, we propose an effective fault-tolerant RFID reader localization approach suitable for the above-mentioned situations, and illustrate how to measure the quality of a localization result. We have taken extensive simulations and implemented an RFID-based localization system. In both cases, our solution outperforms existing approaches in localization accuracy and can provide additional quality information.", "citation": "Citations (57)", "departments": ["Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University"], "authors": ["Weiping Zhu.....http://dblp.org/pers/hd/z/Zhu_0004:Weiping", "Jiannong Cao.....http://dblp.org/pers/hd/c/Cao:Jiannong", "Yi Xu.....http://dblp.org/pers/hd/x/Xu:Yi", "Lei Yang.....http://dblp.org/pers/hd/y/Yang_0024:Lei", "Junjun Kong.....http://dblp.org/pers/hd/k/Kong:Junjun"], "conf": "infocom", "year": "2012", "pages": 9}