{"title": "Autonomous cleaning of corrupted scanned documents - A generative modeling approach.", "fields": ["planar", "probabilistic logic", "generative model", "generality", "latent variable"], "abstract": "We study the task of cleaning scanned text documents that are strongly corrupted by dirt such as manual line strokes, spilled ink etc. We aim at autonomously removing dirt from a single letter-size page based only on the information the page contains. Our approach, therefore, has to learn character representations without supervision and requires a mechanism to distinguish learned representations from irregular patterns. To learn character representations, we use a probabilistic generative model parameterizing pattern features, feature variances, the features' planar arrangements, and pattern frequencies. The latent variables of the model describe pattern class, pattern position, and the presence or absence of individual pattern features. The model parameters are optimized using a novel variational EM approximation. After learning, the parameters represent, independently of their absolute position, planar feature arrangements and their variances. A quality measure defined based on the learned representation then allows for an autonomous discrimination between regular character patterns and the irregular patterns making up the dirt. The irregular patterns can thus be removed to clean the document. For a full Latin alphabet we found that a single page does not contain sufficiently many character examples. However, even if heavily corrupted by dirt, we show that a page containing a lower number of character types can efficiently and autonomously be cleaned solely based on the structural regularity of the characters it contains. In different examples using characters from different alphabets, we demonstrate generality of the approach and discuss its implications for future developments.", "citation": "Citations (5)", "year": "2012", "departments": ["Frankfurt Institute for Advanced Studies", "Frankfurt Institute for Advanced Studies"], "conf": "cvpr", "authors": ["Zhenwen Dai.....http://dblp.org/pers/hd/d/Dai:Zhenwen", "Jörg Lücke.....http://dblp.org/pers/hd/l/L=uuml=cke:J=ouml=rg"], "pages": 8}