{"title": "Cooperative partitioning: Energy-efficient cache partitioning for high-performance CMPs.", "fields": ["power gating", "single core", "cache", "multiprocessing", "performance improvement"], "abstract": "Intelligently partitioning the last-level cache within a chip multiprocessor can bring significant performance improvements. Resources are given to the applications that can benefit most from them, restricting each core to a number of logical cache ways. However, although overall performance is increased, existing schemes fail to consider energy saving when making their partitioning decisions. This paper presents Cooperative Partitioning, a runtime partitioning scheme that reduces both dynamic and static energy while maintaining high performance. It works by enforcing cached data to be way-aligned, so that a way is owned by a single core at any time. Cores cooperate with each other to migrate ways between themselves after partitioning decisions have been made. Upon access to the cache, a core needs only to consult the ways that it owns to find its data, saving dynamic energy. Unused ways can be power-gated for static energy saving. We evaluate our approach on two-core and four-core systems, showing that we obtain average dynamic and static energy savings of 35% and 25% compared to a fixed partitioning scheme. In addition, Cooperative Partitioning maintains high performance while transferring ways five times faster than an existing state-of-the-art technique.", "citation": "Citations (60)", "departments": ["University of Edinburgh", "University of Edinburgh", "University of Cambridge", "University of Edinburgh", "University of Edinburgh"], "authors": ["Karthik T. Sundararajan.....http://dblp.org/pers/hd/s/Sundararajan:Karthik_T=", "Vasileios Porpodas.....http://dblp.org/pers/hd/p/Porpodas:Vasileios", "Timothy M. Jones.....http://dblp.org/pers/hd/j/Jones_0001:Timothy_M=", "Nigel P. Topham.....http://dblp.org/pers/hd/t/Topham:Nigel_P=", "Björn Franke.....http://dblp.org/pers/hd/f/Franke:Bj=ouml=rn"], "conf": "hpca", "year": "2012", "pages": 12}