{"title": "Query optimization in microsoft SQL server PDW.", "fields": ["rdf query language", "query by example", "web query classification", "sargable", "view"], "abstract": "In recent years, Massively Parallel Processors have increasingly been used to manage and query vast amounts of data. Dramatic performance improvements are achieved through distributed execution of queries across many nodes. Query optimization for such system is a challenging and important problem.   In this paper we describe the Query Optimizer inside the SQL Server Parallel Data Warehouse product (PDW QO). We leverage existing QO technology in Microsoft SQL Server to implement a cost-based optimizer for distributed query execution. By properly abstracting metadata we can readily reuse existing logic for query simplification, space exploration and cardinality estimation. Unlike earlier approaches that simply parallelize the best serial plan, our optimizer considers a rich space of execution alternatives, and picks one based on a cost-model for the distributed execution environment. The result is a high-quality, effective query optimizer for distributed query processing in an MPP.", "citation": "Citations (19)", "year": "2012", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Srinath Shankar.....http://dblp.org/pers/hd/s/Shankar:Srinath", "Rimma V. Nehme.....http://dblp.org/pers/hd/n/Nehme:Rimma_V=", "Josep Aguilar-Saborit.....http://dblp.org/pers/hd/a/Aguilar=Saborit:Josep", "Andrew Chung.....http://dblp.org/pers/hd/c/Chung:Andrew", "Mostafa Elhemali.....http://dblp.org/pers/hd/e/Elhemali:Mostafa", "Alan Halverson.....http://dblp.org/pers/hd/h/Halverson:Alan", "Eric Robinson.....http://dblp.org/pers/hd/r/Robinson:Eric", "Mahadevan Sankara Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Mahadevan_Sankara", "David J. DeWitt.....http://dblp.org/pers/hd/d/DeWitt:David_J=", "César A. Galindo-Legaria.....http://dblp.org/pers/hd/g/Galindo=Legaria:C=eacute=sar_A="], "pages": 10}