{"title": "Reconstruction of super-resolution lung 4D-CT using patch-based sparse representation.", "fields": ["partial volume", "discontinuity", "sparse approximation", "spline interpolation", "linear interpolation"], "abstract": "4D-CT plays an important role in lung cancer treatment. However, due to the inherent high-dose exposure associated with CT, dense sampling along superior-inferior direction is often not practical. As a result, artifacts such as lung vessel discontinuity and partial volume are typical in 4D-CT images and might mislead dose administration in radiation therapy. In this paper, we present a novel patch-based technique for super-resolution enhancement of the 4D-CT images along the superior-inferior direction. Our working premise is that the anatomical information that is missing at one particular phase can be recovered from other phases. Based on this assumption, we employ a patch-based mechanism for guided reconstruction of super-resolution axial slices. Specifically, to reconstruct each targeted super-resolution slice for a CT image at a particular phase, we agglomerate a dictionary of patches from images of all other phases in the 4D-CT sequence. Then we perform a sparse combination of the patches in this dictionary to reconstruct details of a super-resolution patch, under constraint of similarity to the corresponding patches in the neighboring slices. By iterating this procedure over all possible patch locations, a superresolution 4D-CT image sequence with enhanced anatomical details can be eventually reconstructed. Our method was extensively evaluated using a public dataset. In all experiments, our method outperforms the conventional linear and cubic-spline interpolation methods in terms of preserving image details and suppressing misleading artifacts.", "citation": "Citations (8)", "year": "2012", "departments": ["Southern Medical University", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "Southern Medical University", "University of North Carolina at Chapel Hill"], "conf": "cvpr", "authors": ["Yu Zhang.....http://dblp.org/pers/hd/z/Zhang:Yu", "Guorong Wu.....http://dblp.org/pers/hd/w/Wu_0001:Guorong", "Pew-Thian Yap.....http://dblp.org/pers/hd/y/Yap:Pew=Thian", "Qianjin Feng.....http://dblp.org/pers/hd/f/Feng:Qianjin", "Jun Lian.....http://dblp.org/pers/hd/l/Lian:Jun", "Wufan Chen.....http://dblp.org/pers/hd/c/Chen:Wufan", "Dinggang Shen.....http://dblp.org/pers/hd/s/Shen:Dinggang"], "pages": 7}