{"title": "Large-scale image classification with trace-norm regularization.", "fields": ["matrix norm", "numerical linear algebra", "coordinate descent", "statistical classification", "contextual image classification"], "abstract": "With the advent of larger image classification dataseis such as ImageNet, designing scalable and efficient multi-class classification algorithms is now an important challenge. We introduce a new scalable learning algorithm for large-scale multi-class image classification, based on the multinomial logistic loss and the trace-norm regularization penalty. Reframing the challenging non-smooth optimization problem into a surrogate infinite-dimensional optimization problem with a regular l 1 -regularization penalty, we propose a simple and provably efficient accelerated coordinate descent algorithm. Furthermore, we show how to perform efficient matrix computations in the compressed domain for quantized dense visual features, scaling up to 100,000s examples, 1,000s-dimensional features, and 100s of categories. Promising experimental results on the \"Fungus\", \"Ungulate\", and \"Vehicles\" subsets of ImageNet are presented, where we show that our approach performs significantly better than state-of-the-art approaches for Fisher vectors with 16 Gaussians.", "citation": "Citations (94)", "year": "2012", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Yahoo!", "Centre national de la recherche scientifique"], "conf": "cvpr", "authors": ["Zaïd Harchaoui.....http://dblp.org/pers/hd/h/Harchaoui:Za=iuml=d", "Matthijs Douze.....http://dblp.org/pers/hd/d/Douze:Matthijs", "Mattis Paulin.....http://dblp.org/pers/hd/p/Paulin:Mattis", "Miroslav Dudík.....http://dblp.org/pers/hd/d/Dud=iacute=k:Miroslav", "Jérôme Malick.....http://dblp.org/pers/hd/m/Malick:J=eacute=r=ocirc=me"], "pages": 8}