{"title": "Analysis of backward congestion notification with delay for enhanced ethernet networks.", "fields": ["netfpga", "network packet", "delay differential equation", "low latency", "transmission delay", "internet traffic", "exponential stability", "inter process communication"], "abstract": "At present, companies and standards organizations are enhancing Ethernet as the unified switch fabric for all of the TCP/IP traffic, the storage traffic and the high performance computing traffic in data centers. Backward congestion notification (BCN) is the basic mechanism for the end-to-end congestion management enhancement of Ethernet. To fulfill the special requirements of the unified switch fabric, i.e., losslessness and low transmission delay, BCN should hold the buffer occupancy around a target point tightly. Thus, the stability of the control loop and the buffer size are critical to BCN. Currently, the impacts of delay on the performance of BCN are unidentified. When the speed of Ethernet increases to 40 Gbps or 100 Gbps in the near future, the number of on-the-fly packets becomes the same order with the buffer size of switch. Accordingly, the impacts of delay will become significant. In this paper, we analyze BCN, paying special attention on the delay. We model the BCN system with a set of segmented delayed differential equations, and then deduce sufficient condition for the uniformly asymptotic stability of BCN. Subsequently, the bounds of buffer occupancy are estimated, which provides direct guidelines on setting buffer size. Finally, numerical analysis and experiments on the NetFPGA platform verify our theoretical analysis.", "citation": "Citations (6)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Ottawa"], "authors": ["Wanchun Jiang.....http://dblp.org/pers/hd/j/Jiang:Wanchun", "Fengyuan Ren.....http://dblp.org/pers/hd/r/Ren:Fengyuan", "Chuang Lin.....http://dblp.org/pers/hd/l/Lin:Chuang", "Ivan Stojmenovic.....http://dblp.org/pers/hd/s/Stojmenovic:Ivan"], "conf": "infocom", "year": "2012", "pages": 5}