{"title": "Generating Realistic Datasets for Deduplication Analysis.", "fields": ["data deduplication", "file system", "terabyte", "computer science", "database"], "abstract": "Deduplication is a popular component of modern storage systems, with a wide variety of approaches. Unlike traditional storage systems, deduplication performance depends on data content as well as access patterns and meta-data characteristics. Most datasets that have been used to evaluate deduplication systems are either unrepresentative, or unavailable due to privacy issues, preventing easy comparison of competing algorithms. Understanding how both content and meta-data evolve is critical to the realistic evaluation of deduplication systems.\n\nWe developed a generic model of file system changes based on properties measured on terabytes of real, diverse storage systems. Our model plugs into a generic framework for emulating file system changes. Building on observations from specific environments, the model can generate an initial file system followed by ongoing modifications that emulate the distribution of duplicates and file sizes, realistic changes to existing files, and file system growth. In our experiments we were able to generate a 4TB dataset within 13 hours on a machine with a single disk drive. The relative error of emulated parameters depends on the model size but remains within 15% of real-world observations.", "citation": "Citations (57)", "departments": ["Stony Brook University", "Stony Brook University", "Harvey Mudd College", "EMC Corporation", "Harvey Mudd College"], "authors": ["Vasily Tarasov.....http://dblp.org/pers/hd/t/Tarasov:Vasily", "Amar Mudrankit.....http://dblp.org/pers/hd/m/Mudrankit:Amar", "Will Buik.....http://dblp.org/pers/hd/b/Buik:Will", "Philip Shilane.....http://dblp.org/pers/hd/s/Shilane:Philip", "Geoff Kuenning.....http://dblp.org/pers/hd/k/Kuenning:Geoff", "Erez Zadok.....http://dblp.org/pers/hd/z/Zadok:Erez"], "conf": "usenix", "year": "2012", "pages": 12}