{"title": "Unsupervised object class discovery via saliency-guided multiple class learning.", "fields": ["object type", "viola jones object detection framework", "method", "discriminative model", "competitive learning", "salience", "semi supervised learning", "special case", "object class detection"], "abstract": "Discovering object classes from images in a fully unsupervised way is an intrinsically ambiguous task; saliency detection approaches however ease the burden on unsupervised learning. We develop an algorithm for simultaneously localizing objects and discovering object classes via bottom-up (saliency-guided) multiple class learning (bMCL), and make the following contributions: (1) saliency detection is adopted to convert unsupervised learning into multiple instance learning, formulated as bottom-up multiple class learning (bMCL); (2) we utilize the Discriminative EM (DiscEM) to solve our bMCL problem and show DiscEM's connection to the MIL-Boost method[34]; (3) localizing objects, discovering object classes, and training object detectors are performed simultaneously in an integrated framework; (4) significant improvements over the existing methods for multi-class object discovery are observed. In addition, we show single class localization as a special case in our bMCL framework and we also demonstrate the advantage of bMCL over purely data-driven saliency methods.", "citation": "Citations (69)", "year": "2012", "departments": ["Microsoft", "Tsinghua University", "Microsoft", "Microsoft", "Microsoft", "University of California, Berkeley", "Tsinghua University", "Beihang University", "Microsoft", "University of California, San Diego"], "conf": "cvpr", "authors": ["Jun-Yan Zhu.....http://dblp.org/pers/hd/z/Zhu:Jun=Yan", "Jiajun Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jiajun", "Yichen Wei.....http://dblp.org/pers/hd/w/Wei:Yichen", "Eric I-Chao Chang.....http://dblp.org/pers/hd/c/Chang:Eric_I=Chao", "Zhuowen Tu.....http://dblp.org/pers/hd/t/Tu:Zhuowen"], "pages": 8}