{"title": "Finding perfect rendezvous on the go: accurate mobile visual localization and its applications to routing.", "fields": ["image retrieval", "tree structure", "location based service", "geotagging", "rendezvous"], "abstract": "While on the go, more and more people are using their phones to enjoy ubiquitous location-based services (LBS). One of the fundamental problems of LBS is localization. Researchers are now investigating ways to use a phone-captured image for localization as it contains more scene context information than the embedded sensors. In this paper, we present a novel approach to mobile visual localization that accurately senses geographic scene context according to the current image (typically associated with a rough GPS position). Unlike most existing visual localization methods, the proposed approach is capable of providing a complete set of more accurate parameters about the scene geo---including the actual locations of both the mobile user and perhaps more importantly the captured scene along with the viewing direction. Our approach takes advantage of advanced techniques for large-scale image retrieval and 3D model reconstruction from photos. Specifically, we first perform joint geo-visual clustering in the cloud to generate scene clusters, with each scene represented by a 3D model. The 3D scene models are then indexed using a visual vocabulary tree structure. The phone-captured image is used to retrieve the relevant scene models, then aligned with the models, and further registered to the real-world map. Our approach achieves an estimation accuracy of user location within 14 meters, viewing direction within 9 degrees, and scene location within 21 meters. Such a complete set of accurate geo-parameters can lead to various LBS applications for routing that cannot be achieved with most existing methods. In particular, we showcase three novel applications: 1) accurate self-localization, 2) collaborative localization for rendezvous routing, and 3) routing for photographing. The evaluations through user studies indicate these applications are effective for facilitating the perfect rendezvous for mobile users.", "citation": "Citations (78)", "departments": ["University of Science and Technology of China", "Microsoft", "University of Rochester", "University of Science and Technology of China", "Microsoft"], "authors": ["Heng Liu.....http://dblp.org/pers/hd/l/Liu:Heng", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Jiebo Luo.....http://dblp.org/pers/hd/l/Luo:Jiebo", "Houqiang Li.....http://dblp.org/pers/hd/l/Li:Houqiang", "Shipeng Li.....http://dblp.org/pers/hd/l/Li:Shipeng"], "conf": "mm", "year": "2012", "pages": 10}