{"title": "Physically Independent Stream Merging.", "fields": ["group method of data handling", "exploit", "multiple description coding", "data stream management system", "data stream mining"], "abstract": "A facility for merging equivalent data streams can support multiple capabilities in a data stream management system (DSMS), such as query-plan switching and high availability. One can logically view a data stream as a temporal table of events, each associated with a lifetime (time interval) over which the event contributes to output. In many applications, the \"same\" logical stream may present itself physically in multiple physical forms, for example, due to disorder arising in transmission or from combining multiple sources, and modifications of earlier events. Merging such streams correctly is challenging when the streams may differ physically in timing, order, and composition. This paper introduces a new stream operator called Logical Merge (LMerge) that takes multiple logically consistent streams as input and outputs a single stream that is compatible with all of them. LMerge can handle the dynamic attachment and detachment of input streams. We present a range of algorithms for LMerge that can exploit compile-time stream properties for efficiency. Experiments with Stream Insight, a commercial DSMS, show that LMerge is sometimes orders-of-magnitude more efficient than enforcing determinism on inputs, and that there is benefit to using specialized algorithms when stream variability is limited. We also show that LMerge and its extensions can provide performance benefits in several real-world applications.", "citation": "Citations (3)", "departments": ["Microsoft", "Portland State University", "Microsoft"], "authors": ["Badrish Chandramouli.....http://dblp.org/pers/hd/c/Chandramouli:Badrish", "David Maier.....http://dblp.org/pers/hd/m/Maier_0001:David", "Jonathan Goldstein.....http://dblp.org/pers/hd/g/Goldstein:Jonathan"], "conf": "icde", "year": "2012", "pages": 12}