{"title": "Automatic taxonomy construction from keywords.", "fields": ["text corpus", "binary logarithm", "existential quantification", "hierarchical clustering", "online advertising"], "abstract": "Taxonomies, especially the ones in specific domains, are becoming indispensable to a growing number of applications. State-of-the-art approaches assume there exists a text corpus to accurately characterize the domain of interest, and that a taxonomy can be derived from the text corpus using information extraction techniques. In reality, neither assumption is valid, especially for highly focused or fast-changing domains. In this paper, we study a challenging problem: Deriving a taxonomy from a set of keyword phrases. A solution can benefit many real life applications because i) keywords give users the flexibility and ease to characterize a specific domain; and ii) in many applications, such as online advertisements, the domain of interest is already represented by a set of keywords. However, it is impossible to create a taxonomy out of a keyword set itself. We argue that additional knowledge and contexts are needed. To this end, we first use a general purpose knowledgebase and keyword search to supply the required knowledge and context. Then we develop a Bayesian approach to build a hierarchical taxonomy for a given set of keywords. We reduce the complexity of previous hierarchical clustering approaches from  O ( n  2  log  n ) to  O ( n  log  n ), so that we can derive a domain specific taxonomy from one million keyword phrases in less than an hour. Finally, we conduct comprehensive large scale experiments to show the effectiveness and efficiency of our approach. A real life example of building an insurance-related query taxonomy illustrates the usefulness of our approach for specific domains.", "citation": "Citations (111)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Xueqing Liu.....http://dblp.org/pers/hd/l/Liu:Xueqing", "Yangqiu Song.....http://dblp.org/pers/hd/s/Song:Yangqiu", "Shixia Liu.....http://dblp.org/pers/hd/l/Liu:Shixia", "Haixun Wang.....http://dblp.org/pers/hd/w/Wang:Haixun"], "conf": "kdd", "year": "2012", "pages": 9}