{"title": "SFS: random write considered harmful in solid state drives.", "fields": ["considered harmful", "exploit", "ext4", "nand gate", "auxiliary memory"], "abstract": "Over the last decade we have witnessed the relentless technological improvement in flash-based solid-state drives (SSDs) and they have many advantages over hard disk drives (HDDs) as a secondary storage such as performance and power consumption. However, the random write performance in SSDs still remains as a concern. Even in modern SSDs, the disparity between random and sequential write bandwidth is more than tenfold. Moreover, random writes can shorten the limited lifespan of SSDs because they incur more NAND block erases per write.\n\nIn order to overcome these problems due to random writes, in this paper, we propose a new file system for SSDs, SFS. First, SFS exploits the maximum write bandwidth of SSD by taking a log-structured approach. SFS transforms all random writes at file system level to sequential ones at SSD level. Second, SFS takes a new data grouping strategy on writing, instead of the existing data separation strategy on segment cleaning. It puts the data blocks with similar update likelihood into the same segment. This minimizes the inevitable segment cleaning overhead in any log-structured file system by allowing the segments to form a sharp bimodal distribution of segment utilization.\n\nWe have implemented a prototype SFS by modifying Linux-based NILFS2 and compared it with three state-of-the-art file systems using several realistic workloads. SFS outperforms the traditional LFS by up to 2.5 times in terms of throughput. Additionally, in comparison to modern file systems such as ext4 and btrfs, it drastically reduces the block erase count inside the SSD by up to 7.5 times.", "citation": "Citations (175)", "departments": ["Sungkyunkwan University", "Sungkyunkwan University", "Samsung", "Sungkyunkwan University", "Sungkyunkwan University"], "authors": ["Changwoo Min.....http://dblp.org/pers/hd/m/Min:Changwoo", "Kangnyeon Kim.....http://dblp.org/pers/hd/k/Kim:Kangnyeon", "Hyunjin Cho.....http://dblp.org/pers/hd/c/Cho:Hyunjin", "Sang-Won Lee.....http://dblp.org/pers/hd/l/Lee_0001:Sang=Won", "Young Ik Eom.....http://dblp.org/pers/hd/e/Eom:Young_Ik"], "conf": "fast", "year": "2012", "pages": 1}