{"title": "Accelerating Range Queries for Brain Simulations.", "fields": ["search engine indexing", "tree", "level of detail", "range query", "spatial database"], "abstract": "Neuroscientists increasingly use computational tools in building and simulating models of the brain. The amounts of data involved in these simulations are immense and efficiently managing this data is key. One particular problem in analyzing this data is the scalable execution of range queries on spatial models of the brain. Known indexing approaches do not perform well even on today's small models which represent a small fraction of the brain, containing only few millions of densely packed spatial elements. The problem of current approaches is that with the increasing level of detail in the models, also the overlap in the tree structure increases, ultimately slowing down query execution. The neuroscientists' need to work with bigger and more detailed (denser) models thus motivates us to develop a new indexing approach. To this end we develop FLAT, a scalable indexing approach for dense data sets. We base the development of FLAT on the key observation that current approaches suffer from overlap in case of dense data sets. We hence design FLAT as an approach with two phases, each independent of density. In the first phase it uses a traditional spatial index to retrieve an initial object efficiently. In the second phase it traverses the initial object's neighborhood to retrieve the remaining query result. Our experimental results show that FLAT not only outperforms R-Tree variants from a factor of two up to eight but that it also achieves independence from data set size and density.", "citation": "Citations (22)", "departments": ["École Normale Supérieure", "Aalborg University", "École Normale Supérieure", "MIND Institute", "MIND Institute"], "authors": ["Farhan Tauheed.....http://dblp.org/pers/hd/t/Tauheed:Farhan", "Laurynas Biveinis.....http://dblp.org/pers/hd/b/Biveinis:Laurynas", "Thomas Heinis.....http://dblp.org/pers/hd/h/Heinis:Thomas", "Felix Schürmann.....http://dblp.org/pers/hd/s/Sch=uuml=rmann:Felix", "Henry Markram.....http://dblp.org/pers/hd/m/Markram:Henry", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia"], "conf": "icde", "year": "2012", "pages": 12}