{"title": "Improving write operations in MLC phase change memory.", "fields": ["memory architecture", "phase change memory", "process variation", "access time", "latency"], "abstract": "Phase change memory (PCM) recently has emerged as a promising technology to meet the fast growing demand for large capacity memory in modern computer systems. In particular, multi-level cell (MLC) PCM that stores multiple bits in a single cell, offers high density with low per-byte fabrication cost. However, despite many advantages, such as good scalability and low leakage, PCM suffers from exceptionally slow write operations, which makes it challenging to be integrated in the memory hiearchy. In this paper, we propose architectural innovations to improve the access time of MLC PCM. Due to cell process variation, composition fluctuation and the relatively small differences among resistance levels, MLC PCM typically employs an iterative write scheme to achieve precise control, which suffers from large write access latency. To address this issue, we propose write truncation (WT) to reduce the number of write iterations with the assistance of an extra error correction code (ECC). We also propose form switch (FS) to reduce the storage overhead of the ECC. By storing highly compressible lines in SLC form, FS improves read latency as well. Our experimental results show that WT and FS improve the effective write/read latency by 57%/28% respectively, and achieve 26% performance improvement over the state of the art.", "citation": "Citations (147)", "departments": ["University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh"], "authors": ["Lei Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Lei", "Bo Zhao.....http://dblp.org/pers/hd/z/Zhao_0007:Bo", "Youtao Zhang.....http://dblp.org/pers/hd/z/Zhang:Youtao", "Jun Yang.....http://dblp.org/pers/hd/y/Yang_0002:Jun", "Bruce R. Childers.....http://dblp.org/pers/hd/c/Childers:Bruce_R="], "conf": "hpca", "year": "2012", "pages": 10}