{"title": "Prescriptive persuasion and open-ended social awareness: expanding the design space of mobile health.", "fields": ["health technology", "persuasion", "computer supported cooperative work", "mobile technology", "user experience design"], "abstract": "Most mobile technology systems designed to encourage healthy decisions focus on prescriptive persuasion, telling the user either implicitly or explicitly what to do, as the primary means of improving health. However, other technically and socially viable options exist. Drawing on both relevant social theory and previous CSCW research, this paper suggests that  open-ended social awareness , making users aware of both others' and their own decisions, may also serve as an effective central design principle for mobile health. To explore this approach, this paper presents analysis of qualitative data from two studies of such a system. Results suggest that open-endedness allowed users flexibility and freedom in defining what counts as health, and that the social aspects compounded both the positive and the occasionally negative impacts of this openness. The paper concludes with implications for the design and evaluation of research on mobile health technology, as well as suggestions for how future work can further explore the design space of mobile health beyond prescriptive persuasion.", "citation": "Citations (74)", "departments": ["Cornell University", "Cornell University", "Cornell University", "Cornell University", "University of Pennsylvania"], "authors": ["Eric P. S. Baumer.....http://dblp.org/pers/hd/b/Baumer:Eric_P=_S=", "Sherri Jean Katz.....http://dblp.org/pers/hd/k/Katz:Sherri_Jean", "Jill E. Freeman.....http://dblp.org/pers/hd/f/Freeman:Jill_E=", "Phil Adams.....http://dblp.org/pers/hd/a/Adams:Phil", "Amy L. Gonzales.....http://dblp.org/pers/hd/g/Gonzales:Amy_L=", "John P. Pollak.....http://dblp.org/pers/hd/p/Pollak:John_P=", "Daniela Retelny.....http://dblp.org/pers/hd/r/Retelny:Daniela", "Jeff Niederdeppe.....http://dblp.org/pers/hd/n/Niederdeppe:Jeff", "Christine M. Olson.....http://dblp.org/pers/hd/o/Olson:Christine_M=", "Geri K. Gay.....http://dblp.org/pers/hd/g/Gay:Geri_K="], "conf": "cscw", "year": "2012", "pages": 10}