{"title": "Low-delay wireless scheduling with partial channel-state information.", "fields": ["fixed priority pre emptive scheduling", "rate monotonic scheduling", "multilevel queue", "round robin scheduling", "earliest deadline first scheduling"], "abstract": "We consider a server serving a time-slotted queued system of multiple packet-based flows, where not more than one flow can be serviced in a single time slot. The flows have exogenous packet arrivals and time-varying service rates. At each time, the server can observe instantaneous service rates for only a subset of flows (selected from a fixed collection of observable subsets) before scheduling a flow in the subset for service. We are interested in queue-length aware scheduling to keep the queues short. The limited availability of instantaneous service rate information requires the scheduler to make a careful choice of which subset of service rates to sample. We develop scheduling algorithms that use only partial service rate information from subsets of channels, and that minimize the likelihood of queue overflow in the system. Specifically, we present a new joint subset-sampling and scheduling algorithm called Max-Exp that uses only the current queue lengths to pick a subset of flows, and subsequently schedules a flow using the Exponential rule. When the collection of observable subsets is disjoint, we show that Max-Exp achieves the best exponential decay rate, among all scheduling algorithms using partial information, of the tail of the longest queue in the system. To accomplish this, we introduce novel analytical techniques for studying the performance of scheduling algorithms using partial state information, that are of independent interest. These include new sample-path large deviations results for processes obtained by nonrandom, predictable sampling of sequences of independent and identically distributed random variables, which show that scheduling with partial state information yields a rate function significantly different from the case of full information. As a special case, Max-Exp reduces to simply serving the flow with the longest queue when the observable subsets are singleton flows, i.e., when there is effectively no a priori channel-state information; thus, our results show that this greedy scheduling policy is large-deviations optimal.", "citation": "Citations (7)", "departments": ["Technion – Israel Institute of Technology", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Aditya Gopalan.....http://dblp.org/pers/hd/g/Gopalan:Aditya", "Constantine Caramanis.....http://dblp.org/pers/hd/c/Caramanis:Constantine", "Sanjay Shakkottai.....http://dblp.org/pers/hd/s/Shakkottai:Sanjay"], "conf": "infocom", "year": "2012", "pages": 9}