{"title": "Secure two-party computations in ANSI C.", "fields": ["secure two party computation", "ansi c", "boolean circuit", "secure multi party computation", "compiler"], "abstract": "The practical application of Secure Two-Party Computation is hindered by the difficulty to implement secure computation protocols. While recent work has proposed very simple programming languages which can be used to specify secure computations, it is still difficult for practitioners to use them, and cumbersome to translate existing source code into this format. Similarly, the manual construction of two-party computation protocols, in particular ones based on the approach of garbled circuits, is labor intensive and error-prone.   The central contribution of the current paper is a tool which achieves Secure Two-Party Computation for ANSI C. Our work is based on a combination of model checking techniques and two-party computation based on garbled circuits. Our key insight is a nonstandard use of the bit-precise model checker CBMC which enables us to translate C programs into equivalent Boolean circuits. To this end, we modify the standard CBMC translation from programs into Boolean formulas whose variables correspond to the memory bits manipulated by the program. As CBMC attempts to minimize the size of the formulas, the circuits obtained by our tool chain are also size efficient; to improve the efficiency of the garbled circuit evaluation, we perform optimizations on the circuits. Experimental results with the new tool CBMC-GC demonstrate the practical usefulness of our approach.", "citation": "Citations (110)", "year": "2012", "departments": ["Vienna University of Technology", "Technische Universität Darmstadt", "Vienna University of Technology", "CrypTool Projec ... nkfurt, Germany"], "conf": "ccs", "authors": ["Andreas Holzer.....http://dblp.org/pers/hd/h/Holzer:Andreas", "Martin Franz.....http://dblp.org/pers/hd/f/Franz:Martin", "Stefan Katzenbeisser.....http://dblp.org/pers/hd/k/Katzenbeisser_0001:Stefan", "Helmut Veith.....http://dblp.org/pers/hd/v/Veith:Helmut"], "pages": 12}