{"title": "Dinner of Luciérnaga: an interactive play with iPhone app in theater.", "fields": ["digital performance", "choreography", "interactive design", "digital art", "sound design"], "abstract": "Interactive digital art in the field of performance is emerging as an increasingly important form of artistic expression in Taiwan. Dinner of Luciernaga is an interdisciplinary project produced by more than ten talented members which include the director, dancer, choreographer, artist, interactive designer, sound designer, iPhone app engineer, image processing designer, stage designer and light designer. The goal of this project is to create new modes of interactive participation between the performers and audience through the use of an innovative iPhone application that links dancer to audience and audience to dancer. The application not only plays a key role in connecting the audience and dancer, but also uses an interesting sound generation application that enhances the spectators' experience. It creates and shares special interactive experiences. Dinner of Luciernaga is a story about the relationship of light and human in the digital era. It is a stunning performance in visuals and interactive process with focus on new interface that are put into use in authentic environments for validation by audience. In this paper, we will discuss our artistic motivation, the development of the digitally interactive performances, and our process for creating the digitally interactive performance entitled Dinner of Luciernaga.", "citation": "Citations (1)", "departments": ["Shih Hsin University", "National Taiwan University", "National Chiao Tung University", "MUTIENLIAO Inte ... ung, Taiwan Roc"], "authors": ["Yu-Chuan Tseng.....http://dblp.org/pers/hd/t/Tseng:Yu=Chuan", "Yi-Ching Huang.....http://dblp.org/pers/hd/h/Huang:Yi=Ching", "Kuan-Ying Wu.....http://dblp.org/pers/hd/w/Wu:Kuan=Ying", "Chi-Ping Chin.....http://dblp.org/pers/hd/c/Chin:Chi=Ping"], "conf": "mm", "year": "2012", "pages": 10}