{"title": "Full proof cryptography: verifiable compilation of efficient zero-knowledge protocols.", "fields": ["verifiable secret sharing", "distributed computing", "cryptographic primitive", "cryptography", "implementation", "zero knowledge proof", "mathematical proof", "theoretical computer science"], "abstract": "Developers building cryptography into security-sensitive applications face a daunting task. Not only must they understand the security guarantees delivered by the constructions they choose, they must also implement and combine them correctly and efficiently. Cryptographic compilers free developers from this task by turning high-level specifications of security goals into efficient implementations. Yet, trusting such tools is hard as they rely on complex mathematical machinery and claim security properties that are subtle and difficult to verify. In this paper we present ZKCrypt, an optimizing cryptographic compiler achieving an unprecedented level of assurance without sacrificing practicality for a comprehensive class of cryptographic protocols, known as Zero-Knowledge Proofs of Knowledge. The pipeline of ZKCrypt integrates purpose-built verified compilers and verifying compilers producing formal proofs in the CertiCrypt framework. By combining the guarantees delivered by each stage, ZKCrypt provides assurance that the output implementation securely realizes the abstract proof goal given as input. We report on the main characteristics of ZKCrypt, highlight new definitions and concepts at its foundations, and illustrate its applicability through a representative example of an anonymous credential system", "citation": "Citations (19)", "year": "2012", "departments": ["University of Minho", "University of Minho", "Bern University of Applied Sciences", "IMDEA", "Institute of Science and Technology Austria"], "conf": "ccs", "authors": ["José Bacelar Almeida.....http://dblp.org/pers/hd/a/Almeida:Jos=eacute=_Bacelar", "Manuel Barbosa.....http://dblp.org/pers/hd/b/Barbosa:Manuel", "Endre Bangerter.....http://dblp.org/pers/hd/b/Bangerter:Endre", "Gilles Barthe.....http://dblp.org/pers/hd/b/Barthe:Gilles", "Stephan Krenn.....http://dblp.org/pers/hd/k/Krenn:Stephan", "Santiago Zanella Béguelin.....http://dblp.org/pers/hd/b/B=eacute=guelin:Santiago_Zanella"], "pages": 13}