{"title": "On the proactive and interactive visualization for feature evolution comprehension: An industrial investigation.", "fields": ["data visualization", "program comprehension", "software visualization", "software maintenance", "interactive visualization"], "abstract": "Program comprehension is a key activity through maintenance and evolution of large-scale software systems. The understanding of a program often requires the evolution analysis of individual functionalities, so-called features. The comprehension of evolving features is not trivial as their implementations are often tangled and scattered through many modules. Even worse, existing techniques are limited in providing developers with direct means for visualizing the evolution of featuresâ   code. This work presents a proactive and interactive visualization strategy to enable feature evolution analysis. It proactively identifies code elements of evolving features and provides multiple views to present their structure under different perspectives. The novel visualization strategy was compared to a lightweight visualization strategy based on a tree-structure. We ran a controlled experiment with industry developers, who performed feature evolution comprehension tasks on an industrial-strength software. The results showed that the use of the proposed strategy presented significant gains in terms of correctness and execution time for feature evolution comprehension tasks.", "citation": "Citations (11)", "departments": ["Federal University of Bahia", "Pontifical Catholic University of Rio de Janeiro", "Federal University of Bahia", "Pontifical Catholic University of Rio de Janeiro", "Pontifical Catholic University of Rio de Janeiro"], "authors": ["Renato Lima Novais.....http://dblp.org/pers/hd/n/Novais:Renato_Lima", "Camila Nunes.....http://dblp.org/pers/hd/n/Nunes:Camila", "Caio A. N. Lima.....http://dblp.org/pers/hd/l/Lima:Caio_A=_N=", "Elder Cirilo.....http://dblp.org/pers/hd/c/Cirilo:Elder", "Francisco Dantas.....http://dblp.org/pers/hd/d/Dantas:Francisco", "Alessandro Garcia.....http://dblp.org/pers/hd/g/Garcia:Alessandro", "Manoel G. Mendonça.....http://dblp.org/pers/hd/m/Mendon=ccedil=a:Manoel_G="], "conf": "icse", "year": "2012", "pages": 10}