{"title": "Software reuse through methodical component reuse and amethodical snippet remixing.", "fields": ["feature oriented domain analysis", "software peer review", "software sizing", "package development process", "backporting"], "abstract": "Every method for developing software is a prescriptive model. Applying a deconstructionist analysis to methods reveals that there are two texts, or sets of assumptions and ideals: a set that is privileged by the method and a second set that is left out, or marginalized by the method. We apply this analytical lens to software reuse, a technique in software development that seeks to expedite one's own project by using programming artifacts created by others. By analyzing the methods prescribed by Component-Based Software Engineering (CBSE), we arrive at two texts: Methodical CBSE and Amethodical Remixing. Empirical data from four studies on code search on the web draws attention to four key points of tension: status of component boundaries; provenance of source code; planning and process; and evaluation criteria for candidate code. We conclude the paper with a discussion of the implications of this work for the limits of methods, structure of organizations that reuse software, and the design of search engines for source code.", "citation": "Citations (12)", "departments": ["University of California, Irvine", "University of California, Irvine", "Columbia University", "State University of New York System", "University of California, Irvine"], "authors": ["Kavita Philip.....http://dblp.org/pers/hd/p/Philip:Kavita", "Medha Umarji.....http://dblp.org/pers/hd/u/Umarji:Medha", "Megha Agarwala.....http://dblp.org/pers/hd/a/Agarwala:Megha", "Susan Elliott Sim.....http://dblp.org/pers/hd/s/Sim:Susan_Elliott", "Rosalva E. Gallardo-Valencia.....http://dblp.org/pers/hd/g/Gallardo=Valencia:Rosalva_E=", "Cristina V. Lopes.....http://dblp.org/pers/hd/l/Lopes:Cristina_V=", "Sukanya Ratanotayanon.....http://dblp.org/pers/hd/r/Ratanotayanon:Sukanya"], "conf": "cscw", "year": "2012", "pages": 10}