{"title": "To index or not to index: time-space trade-offs in search engines with positional ranking functions.", "fields": ["ranking", "web search engine", "information retrieval", "snippet", "computer science", "search engine", "space trade", "spacetime"], "abstract": "Positional ranking functions, widely used in Web search engines, improve result quality by exploiting the positions of the query terms within documents. However, it is well known that positional indexes demand large amounts of extra space, typically about three times the space of a basic nonpositional index. Textual data, on the other hand, is needed to produce text snippets. In this paper, we study time-space trade-offs for search engines with positional ranking functions and text snippet generation. We consider both index-based and non-index based alternatives for positional data. We aim to answer the question of whether one should index positional data or not. We show that there is a wide range of practical time-space trade-offs. Moreover, we show that both position and textual data can be stored using about 71% of the space used by traditional positional indexes, with a minor increase in query time. This yields considerable space savings and outperforms, both in space and time, recent alternatives from the literature. We also propose several efficient compressed text representations for snippet generation, which are able to use about half of the space of current state-of-the-art alternatives with little impact in query processing time.", "citation": "Not cited", "departments": ["Yahoo!", "University of Chile", "University of Santiago, Chile", "University of Santiago, Chile", "New York University"], "authors": ["Diego Arroyuelo.....http://dblp.org/pers/hd/a/Arroyuelo:Diego", "Senén González.....http://dblp.org/pers/hd/g/Gonz=aacute=lez:Sen=eacute=n", "Mauricio Marín.....http://dblp.org/pers/hd/m/Mar=iacute=n:Mauricio", "Mauricio Oyarzún.....http://dblp.org/pers/hd/o/Oyarz=uacute=n:Mauricio", "Torsten Suel.....http://dblp.org/pers/hd/s/Suel:Torsten"], "conf": "sigir", "year": "2012", "pages": 10}