{"title": "Command Center: Authoring tool to supervise augmented reality session.", "fields": ["optical head mounted display", "rendering", "pose", "command and control", "wearable computer"], "abstract": "We describe a real time authoring tool that is useful to supervise group of users in an augmented reality environment. The overall system is composed of a server; the Command Center (CC) and several clients; Wearable Systems (WS). The server is used to visualize the virtual representation of the real environment, 3d features map where augmentation are to occur, augmented content that will be rendered and users avatar that evolves on the field. The user's WS is equipped of a Head Mounted Display (HMD) along with sensors (GPS/DRM/Compass) to provide constant pose estimation (position and orientation) to the CC and a vision based tracking that uses natural features and pose estimation allgorithms to render virtual content accordingly. Alternatively a sensor based renderer is used to display AR guidance on the HMD based on the path defined and sent from the CC. The natural features system handles a large number of small 3D features maps. The overall system offers a complete system to train and supervise remote users through an AR environment.", "citation": "Not cited", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Remi Tache.....http://dblp.org/pers/hd/t/Tache:Remi", "Hunfuko Asanka Abeykoon.....http://dblp.org/pers/hd/a/Abeykoon:Hunfuko_Asanka", "Kasun Karunanayaka.....http://dblp.org/pers/hd/k/Karunanayaka:Kasun", "Prabhash Kumarasinghe.....http://dblp.org/pers/hd/k/Kumarasinghe:Prabhash", "Gerhard Roth.....http://dblp.org/pers/hd/r/Roth:Gerhard", "Owen Noel Newton Fernando.....http://dblp.org/pers/hd/f/Fernando:Owen_Noel_Newton", "Adrian David Cheok.....http://dblp.org/pers/hd/c/Cheok:Adrian_David"], "conf": "vr", "year": "2012", "pages": 2}