{"title": "Threshold compression for 3G scalable monitoring.", "fields": [], "abstract": "We study the problem of scalable monitoring of operational 3G wireless networks. Threshold-based performance monitoring in large 3G networks is very challenging for two main factors: large network scale and dynamics in both time and spatial domains. A fine-grained threshold setting (e.g., perlocation hourly) incurs prohibitively high management complexity, while a single static threshold fails to capture the network dynamics, thus resulting in unacceptably poor alarm quality (up to 70% false/miss alarm rates). In this paper, we propose a scalable monitoring solution, called threshold-compression that can characterize the location- and time-specific threshold trend of each individual network element (NE) with minimal threshold setting. The main insight is to identify groups of NEs with similar threshold behaviors across location and time dimensions, forming spatial-temporal clusters to reduce the number of thresholds while maintaining acceptable alarm accuracy in a large-scale 3G network. Our evaluations based on the operational experience on a commercial 3G network have demonstrated the effectiveness of the proposed solution. We are able to reduce the threshold setting up to 90% with less than 10% false/miss alarms.", "citation": "Citations (6)", "departments": ["Carnegie Mellon University", "AT&T Labs", "AT&T Labs", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Suk-Bok Lee.....http://dblp.org/pers/hd/l/Lee:Suk=Bok", "Dan Pei.....http://dblp.org/pers/hd/p/Pei:Dan", "MohammadTaghi Hajiaghayi.....http://dblp.org/pers/hd/h/Hajiaghayi:MohammadTaghi", "Ioannis Pefkianakis.....http://dblp.org/pers/hd/p/Pefkianakis:Ioannis", "Songwu Lu.....http://dblp.org/pers/hd/l/Lu:Songwu", "He Yan.....http://dblp.org/pers/hd/y/Yan:He", "Zihui Ge.....http://dblp.org/pers/hd/g/Ge:Zihui", "Jennifer Yates.....http://dblp.org/pers/hd/y/Yates:Jennifer", "Mario Kosseifi.....http://dblp.org/pers/hd/k/Kosseifi:Mario"], "conf": "infocom", "year": "2012", "pages": 9}