{"title": "Location privacy preservation in collaborative spectrum sensing.", "fields": ["geolocation", "cognitive radio", "wireless", "idle", "data aggregator", "antenna diversity", "testbed", "spectrum management", "mobile device"], "abstract": "Collaborative spectrum sensing has been regarded as a promising approach to enable secondary users to detect primary users by exploiting spatial diversity. In this paper, we consider a converse question: could space diversity be exploited by a malicious entity, e.g., an external attacker or an untrusted Fusion Center (FC), to achieve involuntary geolocation of a secondary user by linking his location-dependent sensing report to his physical position. We answer this question by identifying a new security threat in collaborative sensing from testbed implementation, and it is shown that the attackers could geo-locate a secondary user from its sensing report with a successful rate of above 90% even in the presence of data aggregation. We then introduce a novel location privacy definition to quantify the location privacy leaking in collaborative sensing. We propose a Privacy Preserving collaborative Spectrum Sensing (PPSS) scheme, which includes two primitive protocols: Privacy Preserving Sensing Report Aggregation protocol (PPSRA) and Distributed Dummy Report Injection Protocol (DDRI). Specifically, PPSRA scheme utilizes applied cryptographic techniques to allow the FC to obtain the aggregated result from various secondary users without learning each individual's values while DDRI algorithm can provide differential location privacy for secondary users by introducing a novel sensing data randomization technique. We implement and evaluate the PPSS scheme in a real-world testbed. The evaluation results show that PPSS can significantly improve the secondary user's location privacy with a reasonable security overhead in collaborative sensing.", "citation": "Citations (82)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Science and Technology of China", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Shuai Li.....http://dblp.org/pers/hd/l/Li:Shuai", "Haojin Zhu.....http://dblp.org/pers/hd/z/Zhu:Haojin", "Zhaoyu Gao.....http://dblp.org/pers/hd/g/Gao:Zhaoyu", "Xinping Guan.....http://dblp.org/pers/hd/g/Guan:Xinping", "Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai", "Xuemin Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin"], "conf": "infocom", "year": "2012", "pages": 9}