{"title": "Loop mitigation in bloom filter based multicast: A destination-oriented approach.", "fields": ["distance vector multicast routing protocol", "xcast", "protocol independent multicast", "ip multicast", "source specific multicast"], "abstract": "Recently, several Bloom filter based multicast schemes have been proposed, in which multicast routing information is carried with an in-packet Bloom filter. Since routers have no need to maintain forwarding states on a per-group basis, the Bloom filter based multicast protocols have desirable scalability. However, a critical issue is that these schemes may incur forwarding loops due to the false positive inherent in the Bloom filter. Existing solutions can only conditionally mitigate the probability of the forwarding loop, instead of fully preventing such events which (once occurred) will cause severe damage to the network. In this paper, we resolve this issue in the context of a destination-oriented multicast (DOM) scheme, a Bloom filter based multicast protocol carrying destinations IP addresses with the in-packet Bloom filter. With a theoretical analysis of the loop issue in DOM context developed, we reveal that the DOM design natively supports automatical elimination of permanent forwarding loops in all cases except a subtle one termed as conservation of bits. Based on the conclusion, we derive a probability upper bound on the loop occurrence in DOM. Furthermore, we propose an accurate tree branch pruning scheme, which equips the DOM the capability to completely and efficiently remove the false-positive forwarding loop. We present simulation results over a practical topology to demonstrate the performance of the loop mitigating DOM, with comparison to a representative Bloom filter based multicast scheme FRM and traditional IP multicast.", "citation": "Citations (12)", "departments": ["Shanghai Jiao Tong University", "Illinois Institute of Technology"], "authors": ["Xiaohua Tian.....http://dblp.org/pers/hd/t/Tian:Xiaohua", "Yu Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Yu"], "conf": "infocom", "year": "2012", "pages": 9}