{"title": "Computational sprinting.", "fields": ["response time", "single core", "thermal mass", "power density", "dark silicon"], "abstract": "Although transistor density continues to increase, voltage scaling has stalled and thus power density is increasing each technology generation. Particularly in mobile devices, which have limited cooling options, these trends lead to a utilization wall in which sustained chip performance is limited primarily by power rather than area. However, many mobile applications do not demand sustained performance; rather they comprise short bursts of computation in response to sporadic user activity. To improve responsiveness for such applications, this paper explores activating otherwise powered-down cores for sub-second bursts of intense parallel computation. The approach exploits the concept of computational sprinting, in which a chip temporarily exceeds its sustainable thermal power budget to provide instantaneous throughput, after which the chip must return to nominal operation to cool down. To demonstrate the feasibility of this approach, we analyze the thermal and electrical characteristics of a smart-phone-like system that nominally operates a single core (~1W peak), but can sprint with up to 16 cores for hundreds of milliseconds. We describe a thermal design that incorporates phase-change materials to provide thermal capacitance to enable such sprints. We analyze image recognition kernels to show that parallel sprinting has the potential to achieve the task response time of a 16W chip within the thermal constraints of a 1W mobile platform.", "citation": "Citations (164)", "departments": ["University of Pennsylvania", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Arun Raghavan.....http://dblp.org/pers/hd/r/Raghavan:Arun", "Yixin Luo.....http://dblp.org/pers/hd/l/Luo:Yixin", "Anuj Chandawalla.....http://dblp.org/pers/hd/c/Chandawalla:Anuj", "Marios C. Papaefthymiou.....http://dblp.org/pers/hd/p/Papaefthymiou:Marios_C=", "Kevin P. Pipe.....http://dblp.org/pers/hd/p/Pipe:Kevin_P=", "Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F=", "Milo M. K. Martin.....http://dblp.org/pers/hd/m/Martin:Milo_M=_K="], "conf": "hpca", "year": "2012", "pages": 12}