{"title": "The GISMOE challenge: constructing the pareto program surface using genetic programming to find better programs (keynote paper).", "fields": ["search based software engineering", "genetic programming", "software design", "pareto principle", "implementation"], "abstract": "Optimising programs for non-functional properties such as speed, size, throughput, power consumption and bandwidth can be demanding; pity the poor programmer who is asked to cater for them all at once! We set out an alternate vision for a new kind of software development environment inspired by recent results from Search Based Software Engineering (SBSE). Given an input program that satisfies the functional requirements, the proposed programming environment will automatically generate a set of candidate program implementations, all of which share functionality, but each of which differ in their non-functional trade offs. The software designer navigates this diverse Pareto surface of candidate implementations, gaining insight into the trade offs and selecting solutions for different platforms and environments, thereby stretching beyond the reach of current compiler technologies. Rather than having to focus on the details required to manage complex, inter-related and conflicting, non-functional trade offs, the designer is thus freed to explore, to understand, to control and to decide rather than to construct.", "citation": "Citations (87)", "year": "2012", "departments": ["University College London", "University College London", "University College London", "University of Glasgow", "Simula Research Laboratory"], "conf": "kbse", "authors": ["Mark Harman.....http://dblp.org/pers/hd/h/Harman:Mark", "William B. Langdon.....http://dblp.org/pers/hd/l/Langdon:William_B=", "Yue Jia.....http://dblp.org/pers/hd/j/Jia:Yue", "David Robert White.....http://dblp.org/pers/hd/w/White:David_Robert", "Andrea Arcuri.....http://dblp.org/pers/hd/a/Arcuri:Andrea", "John A. Clark.....http://dblp.org/pers/hd/c/Clark:John_A="], "pages": 14}