{"title": "Evaluating service disciplines for mobile elements in wireless ad hoc sensor networks.", "fields": ["wireless ad hoc network", "latency", "mobile radio", "data modeling", "data model"], "abstract": "The introduction of mobile elements in wireless sensor networks creates a new dimension to reduce and balance the energy consumption for resource-constrained sensor nodes; however, it also introduces extra latency in the data collection process due to the limited mobility of mobile elements. Therefore, how to arrange and schedule the movement of mobile elements throughout the sensing field is of ultimate importance. In this paper, the online scenario where data collection requests arrive progressively is investigated, and the data collection process is modeled as an M/G/1/c-NJN queuing system, where NJN stands for nearest-job-next, a simple and intuitive service discipline. Based on this model, the performance of data collection is evaluated through both theoretical analysis and extensive simulation. The NJN discipline is further extended by considering the possibility of requests combination (NJNC). The simulation results validate our analytical models and give more insights when comparing with the first-come-first-serve (FCFS) discipline. In contrast to the conventional wisdom of the starvation problem, we reveal that NJN and NJNC have a better performance than FCFS, in both the average and more importantly the worst cases, which gives the much needed assurance to adopt NJN and NJNC in the design of more sophisticated data collection schemes for mobile elements in wireless ad hoc sensor networks, as well as many other similar scheduling application scenarios.", "citation": "Citations (28)", "departments": ["University of Victoria", "University of Victoria", "University of Victoria", "University of Victoria", "Nankai University"], "authors": ["Liang He.....http://dblp.org/pers/hd/h/He_0002:Liang", "Zhe Yang.....http://dblp.org/pers/hd/y/Yang:Zhe", "Jianping Pan.....http://dblp.org/pers/hd/p/Pan_0001:Jianping", "Lin Cai.....http://dblp.org/pers/hd/c/Cai_0001:Lin", "Jingdong Xu.....http://dblp.org/pers/hd/x/Xu:Jingdong"], "conf": "infocom", "year": "2012", "pages": 9}