{"title": "TreeSpan: efficiently computing similarity all-matching.", "fields": ["subgraph isomorphism problem", "bounded function", "minimum degree spanning tree", "special case", "orders of magnitude"], "abstract": "Given a query graph $q$ and a data graph  G , computing all occurrences of  q  in  G , namely exact all-matching, is fundamental in graph data analysis with a wide spectrum of real applications. It is challenging since even finding one occurrence of  q  in  G  (subgraph isomorphism test) is NP-Complete. Consider that in many real applications, exploratory queries from users are often inaccurate to express their real demands. In this paper, we study the problem of efficiently computing all approximate occurrences of  q  in  G . Particularly, we study the problem of efficiently retrieving all matches of  q  in  G  with the number of possible missing edges bounded by a given threshold θ, namely similarity all-matching. The problem of similarity all-matching is harder than the problem of exact all-matching since it covers the problem of exact all-matching as a special case with θ = 0.   In this paper, we develop a novel paradigm to conduct similarity all-matching. Specifically, we propose to use a minimal set  QT  of spanning trees in  q  to  cover  all connected subgraphs  q'  of  q  missing at most θ edges; that is, each  q'  is spanned by a spanning tree in  QT . Then, we conduct exact all-matching for each spanning tree in  QT  to induce all similarity matches. A rigid theoretic analysis shows that our new search paradigm significantly reduces the times of conducting exact all-matching against the existing techniques. To further speed-up the computation, we develop new filtering, computation sharing, and search ordering techniques. Our comprehensive experiments on both real and synthetic datasets demonstrate that our techniques outperform the state of the art technique by 7 orders of magnitude.", "citation": "Citations (23)", "year": "2012", "departments": ["The Chinese University of Hong Kong", "Univeristy of N ... dney, Australia", "Univeristy of N ... dney, Australia", "Univeristy of N ... dney, Australia", "Univeristy of N ... dney, Australia"], "conf": "sigmod", "authors": ["Gaoping Zhu.....http://dblp.org/pers/hd/z/Zhu:Gaoping", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Ke Zhu.....http://dblp.org/pers/hd/z/Zhu:Ke", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu"], "pages": 12}