{"title": "Mitigating timing based information leakage in shared schedulers.", "fields": ["performance metric", "shared memory", "information privacy", "shared resource", "information leakage"], "abstract": "In this work, we study information leakage in timing side channels that arise in the context of shared event schedulers. Consider two processes, one of them an innocuous process (referred to as Alice) and the other a malicious one (referred to as Bob), using a common scheduler to process their jobs. Based on when his jobs get processed, Bob wishes to learn about the pattern (size and timing) of jobs of Alice. Depending on the context, knowledge of this pattern could have serious implications on Alice's privacy and security. For instance, shared routers can reveal traffic patterns, shared memory access can reveal cloud usage patterns, and suchlike. We present a formal framework to study the information leakage in shared resource schedulers using the pattern estimation error as a performance metric. In this framework, a uniform upper bound is derived to benchmark different scheduling policies. The first-come-first-serve scheduling policy is analyzed, and shown to leak significant information when the scheduler is loaded heavily. To mitigate the timing information leakage, we propose an “Accumulate-and-Serve” policy which trades in privacy for a higher delay. The policy is analyzed under the proposed framework and is shown to leak minimum information to the attacker, and is shown to have comparatively lower delay than a fixed scheduler that preemptively assigns service times irrespective of traffic patterns.", "citation": "Citations (20)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Lehigh University"], "authors": ["Sachin Kadloor.....http://dblp.org/pers/hd/k/Kadloor:Sachin", "Negar Kiyavash.....http://dblp.org/pers/hd/k/Kiyavash:Negar", "Parv Venkitasubramaniam.....http://dblp.org/pers/hd/v/Venkitasubramaniam:Parv"], "conf": "infocom", "year": "2012", "pages": 9}