{"title": "Video segmentation by tracing discontinuities in a trajectory embedding.", "fields": ["embedding", "segmentation based object categorization", "thresholding", "range segmentation", "scale space segmentation"], "abstract": "Our goal is to segment a video sequence into moving objects and the world scene. In recent work, spectral embedding of point trajectories based on 2D motion cues accumulated from their lifespans, has shown to outperform factorization and per frame segmentation methods for video segmentation. The scale and kinematic nature of the moving objects and the background scene determine how close or far apart trajectories are placed in the spectral embedding. Such density variations may confuse clustering algorithms, causing over-fragmentation of object interiors. Therefore, instead of clustering in the spectral embedding, we propose detecting discontinuities of embedding density between spatially neighboring trajectories. Detected discontinuities are strong indicators of object boundaries and thus valuable for video segmentation. We propose a novel embedding discretization process that recovers from over-fragmentations by merging clusters according to discontinuity evidence along inter-cluster boundaries. For segmenting articulated objects, we combine motion grouping cues with a center-surround saliency operation, resulting in “context-aware”, spatially coherent, saliency maps. Figure-ground segmentation obtained from saliency thresholding, provides object connectedness constraints that alter motion based trajectory affinities, by keeping articulated parts together and separating disconnected in time objects. Finally, we introduce Gabriel graphs as effective per frame superpixel maps for converting trajectory clustering to dense image segmentation. Gabriel edges bridge large contour gaps via geometric reasoning without over-segmenting coherent image regions. We present experimental results of our method that outperform the state-of-the-art in challenging motion segmentation datasets.", "citation": "Citations (120)", "year": "2012", "departments": ["University of Pennsylvania", "Xi'an Jiaotong University", "University of Pennsylvania"], "conf": "cvpr", "authors": ["Katerina Fragkiadaki.....http://dblp.org/pers/hd/f/Fragkiadaki:Katerina", "Geng Zhang.....http://dblp.org/pers/hd/z/Zhang:Geng", "Jianbo Shi.....http://dblp.org/pers/hd/s/Shi:Jianbo"], "pages": 8}