{"title": "Statistical performance comparisons of computers.", "fields": ["computer performance", "public domain software", "software performance testing", "benchmark", "speedup", "sample mean and sample covariance", "spec", "parametric statistics"], "abstract": "As a fundamental task in computer architecture research, performance comparison has been continuously hampered by the variability of computer performance. In traditional performance comparisons, the impact of performance variability is usually ignored (i.e., the means of performance measurements are compared regardless of the variability), or in the few cases where it is factored in using parametric confidence techniques, the confidence is either erroneously computed based on the distribution of performance measurements (with the implicit assumption that it obeys the normal law), instead of the distribution of sample mean of performance measurements, or too few measurements are considered for the distribution of sample mean to be normal. We first illustrate how such erroneous practices can lead to incorrect comparisons. Then, we propose a non-parametric Hierarchical Performance Testing (HPT) framework for performance comparison, which is significantly more practical than standard parametric techniques because it does not require to collect a large number of measurements in order to achieve a normal distribution of the sample mean. This HPT framework has been implemented as an open-source software.", "citation": "Citations (16)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "French Institute for Research in Computer Science and Automation", "Chinese Academy of Sciences", "French Institute for Research in Computer Science and Automation", ", State Key Lab ... g 100190, China", ", Department of ... , PA 15213, USA", ", State Key Lab ... g 100190, China", ", State Key Lab ... g 100190, China"], "authors": ["Tianshi Chen.....http://dblp.org/pers/hd/c/Chen:Tianshi", "Yunji Chen.....http://dblp.org/pers/hd/c/Chen:Yunji", "Qi Guo.....http://dblp.org/pers/hd/g/Guo:Qi", "Olivier Temam.....http://dblp.org/pers/hd/t/Temam:Olivier", "Yue Wu.....http://dblp.org/pers/hd/w/Wu:Yue", "Weiwu Hu.....http://dblp.org/pers/hd/h/Hu:Weiwu"], "conf": "hpca", "year": "2012", "pages": 12}