{"title": "Parameter-Free Determination of Distance Thresholds for Metric Distance Constraints.", "fields": ["metric", "pattern matching", "association rule learning", "expected utility hypothesis", "data quality"], "abstract": "The importance of introducing distance constraints to data dependencies, such as differential dependencies (DDs) [28], has recently been recognized. The metric distance constraints are tolerant to small variations, which enable them apply to wide data quality checking applications, such as detecting data violations. However, the determination of distance thresholds for the metric distance constraints is non-trivial. It often relies on a truth data instance which embeds the distance constraints. To find useful distance threshold patterns from data, there are several guidelines of statistical measures to specify, e.g., support, confidence and dependent quality. Unfortunately, given a data instance, users might not have any knowledge about the data distribution, thus it is very challenging to set the right parameters. In this paper, we study the determination of distance thresholds for metric distance constraints, in a parameter-free style. Specifically, we compute an expected utility based on the statistical measures from the data. According to our analysis as well as experimental verification, distance threshold patterns with higher expected utility could offer better usage in real applications, such as violation detection. We then develop efficient algorithms to determine the distance thresholds having the maximum expected utility. Finally, our extensive experimental evaluation demonstrates the effectiveness and efficiency of the proposed methods.", "citation": "Citations (7)", "departments": ["Tsinghua University", "Hong Kong University of Science and Technology", "The Chinese University of Hong Kong"], "authors": ["Shaoxu Song.....http://dblp.org/pers/hd/s/Song:Shaoxu", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Hong Cheng.....http://dblp.org/pers/hd/c/Cheng:Hong"], "conf": "icde", "year": "2012", "pages": 12}