{"title": "A Data-Driven Approach to Question Subjectivity Identification in Community Question Answering.", "fields": ["subjectivity", "labeled data", "question answering", "data driven", "popularity"], "abstract": "Automatic Subjective Question Answering (ASQA), which aims at answering users' subjective questions using summaries of multiple opinions, becomes increasingly important. One challenge of ASQA is that expected answers for subjective questions may not readily exist in the Web. The rising and popularity of Community Question Answering (CQA) sites, which provide platforms for people to post and answer questions, provides an alternative to ASQA. One important task of ASQA is question subjectivity identification, which identifies whether a user is asking a subjective question. Unfortunately, there has been little labeled training data available for this task. In this paper, we propose an approach to collect training data automatically by utilizing social signals in CQA sites without involving any manual labeling. Experimental results show that our data-driven approach achieves 9:37% relative improvement over the supervised approach using manually labeled data, and achieves 5:15% relative gain over a state-of-the-art semi-supervised approach. In addition, we propose several heuristic features for question subjectivity identification. By adding these features, we achieve 11:23% relative improvement over word n-gram feature under the same experimental setting.", "citation": "Citations (15)", "departments": ["The Chinese University of Hong Kong", "Google", "Google", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Tom Chao Zhou.....http://dblp.org/pers/hd/z/Zhou:Tom_Chao", "Xiance Si.....http://dblp.org/pers/hd/s/Si:Xiance", "Edward Y. Chang.....http://dblp.org/pers/hd/c/Chang:Edward_Y=", "Irwin King.....http://dblp.org/pers/hd/k/King:Irwin", "Michael R. Lyu.....http://dblp.org/pers/hd/l/Lyu:Michael_R="], "conf": "aaai", "year": "2012", "pages": -1}