{"title": "Generalized Multiview Analysis: A discriminative latent space.", "fields": ["image retrieval", "contextual image classification", "discriminative model", "linear subspace", "invariant"], "abstract": "This paper presents a general multi-view feature extraction approach that we call Generalized Multiview Analysis or GMA. GMA has all the desirable properties required for cross-view classification and retrieval: it is supervised, it allows generalization to unseen classes, it is multi-view and kernelizable, it affords an efficient eigenvalue based solution and is applicable to any domain. GMA exploits the fact that most popular supervised and unsupervised feature extraction techniques are the solution of a special form of a quadratic constrained quadratic program (QCQP), which can be solved efficiently as a generalized eigenvalue problem. GMA solves a joint, relaxed QCQP over different feature spaces to obtain a single (non)linear subspace. Intuitively, GMA is a supervised extension of Canonical Correlational Analysis (CCA), which is useful for cross-view classification and retrieval. The proposed approach is general and has the potential to replace CCA whenever classification or retrieval is the purpose and label information is available. We outperform previous approaches for textimage retrieval on Pascal and Wiki text-image data. We report state-of-the-art results for pose and lighting invariant face recognition on the MultiPIE face dataset, significantly outperforming other approaches.", "citation": "Citations (406)", "year": "2012", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "conf": "cvpr", "authors": ["Abhishek Sharma.....http://dblp.org/pers/hd/s/Sharma:Abhishek", "Abhishek Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Abhishek", "Hal Daumé III.....http://dblp.org/pers/hd/d/Daum=eacute=_III:Hal", "David W. Jacobs.....http://dblp.org/pers/hd/j/Jacobs:David_W="], "pages": 8}