{"title": "Spatial pooling of heterogeneous features for image applications.", "fields": ["contextual image classification", "pooling", "spatial contextual awareness", "generality", "visual word"], "abstract": "The Bag-of-Features (BoF) model has played an important role for image representation in many multimedia applications. It has been extensively applied to many tasks including image classification, image retrieval, scene understanding, and so on. Despite the advantages of this model such as simplicity, efficiency and generality, there are also notable drawbacks for this model, including poor power of semantic expression of local descriptors, and lack of robust structures upon single visual words. To overcome these problems, various techniques have been proposed, such as multiple descriptors, spatial context modeling and interest region detection. Though they have been proven to improve the BoF model to some extent, there still lacks a coherent scheme to integrate each individual module.   To address the problems above, we propose a novel framework with spatial pooling of heterogeneous features. Our framework differs from the traditional Bag-of-Features model on three aspects. First, we propose a new scheme for combining texture and edge based local features together at the descriptor extraction level. Next, we build geometric visual phrases to model spatial context upon heterogeneous features for mid-level representation of images. Finally, based on a smoothed edgemap, a simple and effective spatial weighting scheme is performed on our mid-level image representation. We test our integrated framework on several benchmark datasets for image classification and retrieval applications. The extensive results show the superior performance of our algorithm over state-of-the-art methods.", "citation": "Citations (18)", "departments": ["Tsinghua University", "University of Texas at San Antonio", "Tsinghua University"], "authors": ["Lingxi Xie.....http://dblp.org/pers/hd/x/Xie:Lingxi", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi", "Bo Zhang.....http://dblp.org/pers/hd/z/Zhang:Bo"], "conf": "mm", "year": "2012", "pages": 10}