{"title": "Coordinated Multi-Robot Exploration Under Communication Constraints Using Decentralized Markov Decision Processes.", "fields": ["observable", "observability", "motion planning", "markov decision process", "robot"], "abstract": "Recent works on multi-agent sequential decision making using decentralized partially observable Markov decision processes have been concerned with interactionoriented resolution techniques and provide promising results. These techniques take advantage of local interactions and coordination. In this paper, we propose an approach based on an interaction-oriented resolution of decentralized decision makers. To this end, distributed value functions (DVF) have been used by decoupling the multi-agent problem into a set of individual agent problems. However existing DVF techniques assume permanent and free communication between the agents. In this paper, we extend the DVF methodology to address full local observability, limited share of information and communication breaks. We apply our new DVF in a real-world application consisting of multi-robot exploration where each robot computes locally a strategy that minimizes the interactions between the robots and maximizes the space coverage of the team even under communication constraints. Our technique has been implemented and evaluated in simulation and in real-world scenarios during a robotic challenge for the exploration and mapping of an unknown environment. Experimental results from real-world scenarios and from the challenge are given where our system was vice-champion.", "citation": "Citations (17)", "departments": ["University of Caen Lower Normandy", "University of Caen Lower Normandy", "University of Caen Lower Normandy"], "authors": ["Laëtitia Matignon.....http://dblp.org/pers/hd/m/Matignon:La=euml=titia", "Laurent Jeanpierre.....http://dblp.org/pers/hd/j/Jeanpierre:Laurent", "Abdel-Illah Mouaddib.....http://dblp.org/pers/hd/m/Mouaddib:Abdel=Illah"], "conf": "aaai", "year": "2012", "pages": -1}