{"title": "Inferring method specifications from natural language API descriptions.", "fields": ["application programming interface", "formal specification", "software verification", "software system", "design by contract"], "abstract": "Application Programming Interface (API) documents are a typical way of describing legal usage of reusable software libraries, thus facilitating software reuse. However, even with such documents, developers often overlook some documents and build software systems that are inconsistent with the legal usage of those libraries. Existing software verification tools require formal specifications (such as code contracts), and therefore cannot directly verify the legal usage described in natural language text of API documents against the code using that library. However, in practice, most libraries do not come with formal specifications, thus hindering tool-based verification. To address this issue, we propose a novel approach to infer formal specifications from natural language text of API documents. Our evaluation results show that our approach achieves an average of 92% precision and 93% recall in identifying sentences that describe code contracts from more than 2500 sentences of API documents. Furthermore, our results show that our approach has an average 83% accuracy in inferring specifications from over 1600 sentences describing code contracts.", "citation": "Citations (108)", "departments": ["North Carolina State University", "North Carolina State University", "Chinese Academy of Sciences", "North Carolina State University", "Carnegie Mellon University"], "authors": ["Rahul Pandita.....http://dblp.org/pers/hd/p/Pandita:Rahul", "Xusheng Xiao.....http://dblp.org/pers/hd/x/Xiao:Xusheng", "Hao Zhong.....http://dblp.org/pers/hd/z/Zhong:Hao", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "Stephen Oney.....http://dblp.org/pers/hd/o/Oney:Stephen", "Amit M. Paradkar.....http://dblp.org/pers/hd/p/Paradkar:Amit_M="], "conf": "icse", "year": "2012", "pages": 11}