{"title": "A POMDP framework for heterogeneous sensor selection in wireless body area networks.", "fields": ["body area network", "software deployment", "partially observable markov decision process", "mobile phone", "stochastic control"], "abstract": "Wireless body area networks (WBANs) are emerging as a powerful tool for health management, emergency response, military personnel wellness as well as sports and entertainment. In contrast to traditional sensor networks for, say, environmental sensing, WBANs are often characterized by a modest number of heterogeneous sensors wirelessly coupled to a fusion center such as a mobile phone. Based on an actual implementation of a prototype WBAN, energy efficiency at the fusion center has proven to be one of the critical roadblocks to long-term deployment of WBANs. To this end, a novel formulation based on stochastic control tools is devised to model the sensor selection process. Sensors are heterogeneous both in their discrimination capabilities as well as their energy cost, further challenging sensor selection. The goal is to maximize the WBAN's lifetime while optimizing the performance of a physical state detection application. To this end, an optimal dynamic programming algorithm is derived. However, due to the prohibitive complexity of the optimal method, a low-cost approximation scheme, T3S, is designed. The low complexity design is based on several key properties of the cost functional. The proposed T3S scheme is evaluated on real-world data collected from an implemented WBAN and observed to offer near optimal performance with significantly lower complexity.", "citation": "Citations (12)", "departments": ["University of Southern California", "Stanford University", "University of Southern California"], "authors": ["Daphney-Stavroula Zois.....http://dblp.org/pers/hd/z/Zois:Daphney=Stavroula", "Marco Levorato.....http://dblp.org/pers/hd/l/Levorato:Marco", "Urbashi Mitra.....http://dblp.org/pers/hd/m/Mitra:Urbashi"], "conf": "infocom", "year": "2012", "pages": 5}