{"title": "DejaVu: accelerating resource allocation in virtualized environments.", "fields": ["management system", "workload", "virtual machine", "speedup", "provisioning", "resource allocation"], "abstract": "Effective resource management of virtualized environments is a challenging task. State-of-the-art management systems either rely on analytical models or evaluate resource allocations by running actual experiments. However, both approaches incur a significant overhead once the workload changes. The former needs to re-calibrate and re-validate models, whereas the latter has to run a new set of experiments to select a new resource allocation. During the adaptation period, the system may run with an inefficient configuration. In this paper, we propose DejaVu - a framework that (1) minimizes the resource management overhead by identifying a small set of workload classes for which it needs to evaluate resource allocation decisions, (2) quickly adapts to workload changes by classifying workloads using signatures and caching their preferred resource allocations at runtime, and (3) deals with interference by estimating an \"interference index\". We evaluate DejaVu by running representative network services on Amazon EC2. DejaVu achieves more than 10x speedup in adaptation time for each workload change relative to the state-of-the-art. By enabling quick adaptation, DejaVu saves up to 60% of the service provisioning cost. Finally, DejaVu is easily deployable as it does not require any extensive instrumentation or human intervention.", "citation": "Not cited", "year": "2012", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Rutgers University"], "conf": "asplos", "authors": ["Nedeljko Vasic.....http://dblp.org/pers/hd/v/Vasic:Nedeljko", "Dejan M. Novakovic.....http://dblp.org/pers/hd/n/Novakovic:Dejan_M=", "Svetozar Miucin.....http://dblp.org/pers/hd/m/Miucin:Svetozar", "Dejan Kostic.....http://dblp.org/pers/hd/k/Kostic:Dejan", "Ricardo Bianchini.....http://dblp.org/pers/hd/b/Bianchini:Ricardo"], "pages": 14}