{"title": "Network optimization for DHT-based applications.", "fields": ["operator", "server", "upload", "shared resource", "hash function"], "abstract": "P2P platforms have been criticized because of the heavy strain that some P2P services can inflict on costly inter-domain links of network operators. It is therefore necessary to develop network optimization schemes for controlling the load generated by P2P platforms on an operator network. Previous focus on network optimization has been mostly on centralized tracker-based systems. However, in recent years multiple DHT-based P2P networks are widely deployed due to their scalability and fault tolerance, and these networks have even been considered as platforms for commercial services. Thereby, finding network optimization for DHT-based P2P applications has potentially large practical impacts. In this paper, we present THash, a simple scheme to implement an effective distributed network optimization for DHT systems. THash is based on standard DHT put/get semantics and utilizes a triple hash method to guide the DHT clients sharing resources with peers in proper domains. We have implemented THash in a major P2P application (PPLive) by using the standard ALTO/P4P protocol as the network information source. We conducted realistic experiments over the network and observed that compared with Native DHT, THash only generated 45.5% and 35.7% of inter-PID and inter-AS traffic, and at the same time shortened the average downloading time by 13.8% to 22.1%.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Yale University", "MediaTech Institute", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Yi Sun.....http://dblp.org/pers/hd/s/Sun_0004:Yi", "Yang Richard Yang.....http://dblp.org/pers/hd/y/Yang:Yang_Richard", "Xiaobing Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiaobing", "Yang Guo.....http://dblp.org/pers/hd/g/Guo:Yang", "Jun Li.....http://dblp.org/pers/hd/l/Li_0002:Jun", "Kavé Salamatian.....http://dblp.org/pers/hd/s/Salamatian:Kav=eacute="], "conf": "infocom", "year": "2012", "pages": 9}