{"title": "When cloud meets eBay: Towards effective pricing for cloud computing.", "fields": ["spot contract", "bidding", "collusion", "scarcity", "revenue"], "abstract": "The rapid deployment of cloud computing promises network users with elastic, abundant, and on-demand cloud services. The pay-as-you-go model allows users to be charged only for services they use. Current purchasing designs, however, are still primitive with significant constraints. Spot Instance, the first deployed auction-style pricing model of Amazon EC2, fails to enforce fair competition among users in facing of resource scarcity and may thus lead to untruthful bidding and unfair resource allocation. Dishonest users are able to abuse the system and obtain (at least) short-term advantages by deliberately setting large maximum price bids while being charged only at lower Spot Prices. Meanwhile, this may also prevent the demands of honest users from being satisfied due to resource scarcity. Furthermore, Spot Instance is inefficient and may not adequately meet users' overall demands because it limits users to bid for each computing instance individually instead of multiple different instances at a time. In this paper, we formulate and investigate the problem of cloud resource pricing. We propose a suite of computationally efficient and truthful auction-style pricing mechanisms, which enable users to fairly compete for resources and cloud providers to increase their overall revenue. We analytically show that the proposed algorithms can achieve truthfulness without collusion or (t; p)-truthfulness tolerating a collusion group of size t with probability at least p. We also show that the two proposed algorithms have polynomial complexities O(nm + n 2 ) and O(nm), respectively, when n users compete for m different computing instances with multiple units. Extensive simulations show that, in a competitive cloud resource market, the proposed mechanisms can increase the revenue of cloud providers, especially when allocating relatively limited computing resources to a potentially large number of cloud users.", "citation": "Citations (133)", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "IBM"], "authors": ["Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Xiaoqiao Meng.....http://dblp.org/pers/hd/m/Meng:Xiaoqiao"], "conf": "infocom", "year": "2012", "pages": 9}