{"title": "Interactive regret minimization.", "fields": ["regret", "open problem", "minification", "ask price", "tuple"], "abstract": "We study the notion of  regret ratio  proposed in [19] Nanongkai et al. [VLDB10] to deal with multi-criteria decision making in database systems. The regret minimization query proposed in [19] Nanongkai et al. was shown to have features of both skyline and top- k : it does not need information from the user but still controls the output size. While this approach is suitable for obtaining a reasonably small regret ratio, it is still open whether one can make the regret ratio arbitrarily small. Moreover, it remains open whether reasonable questions can be asked to the users in order to improve efficiency of the process.   In this paper, we study the problem of minimizing regret ratio when the system is enhanced with  interaction . We assume that when presented with a set of tuples the user can tell which tuple is most preferred. Under this assumption, we develop the problem of  interactive regret minimization  where we fix the number of questions and tuples per question that we can display, and aim at minimizing the regret ratio. We try to answer two questions in this paper: (1) How much does interaction help? That is, how much can we improve the regret ratio when there are interactions? (2) How efficient can interaction be? In particular, we measure how many questions we have to ask the user in order to make her regret ratio small enough.   We answer both questions from both theoretical and practical standpoints. For the first question, we show that interaction can reduce the regret ratio almost  exponentially . To do this, we prove a lower bound for the previous approach (thereby resolving an open problem from [19] Nanongkai et al.), and develop an almost-optimal upper bound that makes the regret ratio exponentially smaller. Our experiments also confirm that, in practice, interactions help in improving the regret ratio by many orders of magnitude. For the second question, we prove that when our algorithm shows a reasonable number of points per question, it only needs a few questions to make the regret ratio small. Thus, interactive regret minimization seems to be a necessary and sufficient way to deal with multi-criteria decision making in database systems.", "citation": "Citations (12)", "year": "2012", "departments": ["University of Vienna", "Denison University", "Google", "University of Tokyo"], "conf": "sigmod", "authors": ["Danupon Nanongkai.....http://dblp.org/pers/hd/n/Nanongkai:Danupon", "Ashwin Lall.....http://dblp.org/pers/hd/l/Lall:Ashwin", "Atish Das Sarma.....http://dblp.org/pers/hd/s/Sarma:Atish_Das", "Kazuhisa Makino.....http://dblp.org/pers/hd/m/Makino:Kazuhisa"], "pages": 12}