{"title": "Query preserving graph compression.", "fields": ["clique width", "universal graph", "edge transitive graph", "simplex graph", "string graph"], "abstract": "It is common to find graphs with millions of nodes and billions of edges in,  e.g. , social networks. Queries on such graphs are often prohibitively expensive. These motivate us to propose  query preserving graph compression , to compress graphs  relative to  a class Λ of queries of users' choice. We compute a small  G   r   from a graph  G  such that (a) for  any  query  Q  E Λ  Q ,  Q ( G ) = Q'( G   r  ), where  Q'  E Λ can be efficiently computed from  Q ; and (b) any algorithm for computing  Q ( G ) can be  directly  applied to evaluating  Q'  on  G   r    as is . That is, while we cannot lower the complexity of evaluating graph queries, we reduce data graphs while preserving the answers to  all  the queries in Λ. To verify the effectiveness of this approach, (1) we develop compression strategies for two classes of queries: reachability and graph pattern queries via (bounded) simulation. We show that graphs can be efficiently compressed via a reachability equivalence relation and graph bisimulation, respectively, while reserving query answers. (2) We provide techniques for aintaining compressed graph  G   r   in response to changes Δ G  to the original graph  G . We show that the incremental maintenance problems are  unbounded  for the two lasses of queries,  i.e. , their costs are not a function of the size of Δ G  and changes in  G   r  . Nevertheless, we develop incremental algorithms that depend only on Δ G  and  G   r  ,  independent of   G , i.e., we do not have to decompress  G  r  to propagate the changes. (3) Using real-life data, we experimentally verify that our compression techniques could reduce graphs in average by 95% for reachability and 57% for graph pattern matching, and that our incremental maintenance algorithms are efficient.", "citation": "Citations (129)", "year": "2012", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "University of Edinburgh", "University of California, Santa Barbara"], "conf": "sigmod", "authors": ["Wenfei Fan.....http://dblp.org/pers/hd/f/Fan:Wenfei", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Xin Wang.....http://dblp.org/pers/hd/w/Wang:Xin", "Yinghui Wu.....http://dblp.org/pers/hd/w/Wu:Yinghui"], "pages": 12}