{"title": "Mobile product search with Bag of Hash Bits and boundary reranking.", "fields": ["hash function", "bag of words model", "small number", "visual search", "visual word"], "abstract": "Rapidly growing applications on smartphones have provided an excellent platform for mobile visual search. Most of previous visual search systems adopt the framework of ”Bag of Words”, in which words indicate quantized codes of visual features. In this work, we propose a novel visual search system based on ”Bag of Hash Bits” (BoHB), in which each local feature is encoded to a very small number of hash bits, instead of quantized to visual words, and the whole image is represented as bag of hash bits. The proposed BoHB method offers unique benefits in solving the challenges associated with mobile visual search, e.g., low transmission cost, cheap memory and computation on the mobile side, etc. Moreover, our BoHB method leverages the distinct properties of hashing bits such as multi-table indexing, multiple bucket probing, bit reuse, and hamming distance based ranking to achieve efficient search over gigantic visual databases. The proposed method significantly outperforms state-of-the-art mobile visual search methods like CHoG, and other (conventional desktop) visual search approaches like bag of words via vocabulary tree, or product quantization. The proposed BoHB approach is easy to implement on mobile devices, and general in the sense that it can be applied to different types of local features, hashing algorithms and image databases. We also incorporate a boundary feature in the reranking step to describe the object shapes, complementing the local features that are usually used to characterize the local details. The boundary feature can further filter out noisy results and improve the search performance, especially at the coarse category level. Extensive experiments over large-scale data sets up to 400k product images demonstrate the effectiveness of our approach.", "citation": "Citations (136)", "year": "2012", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "conf": "cvpr", "authors": ["Junfeng He.....http://dblp.org/pers/hd/h/He:Junfeng", "Jinyuan Feng.....http://dblp.org/pers/hd/f/Feng:Jinyuan", "Xianglong Liu.....http://dblp.org/pers/hd/l/Liu:Xianglong", "Tao Cheng.....http://dblp.org/pers/hd/c/Cheng:Tao", "Tai-Hsu Lin.....http://dblp.org/pers/hd/l/Lin:Tai=Hsu", "Hyunjin Chung.....http://dblp.org/pers/hd/c/Chung:Hyunjin", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "pages": 8}