{"title": "Learning Stochastic Models of Information Flow.", "fields": ["data set", "metropolis hastings algorithm", "data flow analysis", "hash function", "probabilistic logic"], "abstract": "An understanding of information flow has many applications, including for maximizing marketing impact on social media, limiting malware propagation, and managing undesired disclosure of sensitive information. This paper presents scalable methods for both learning models of information flow in networks from data, based on the Independent Cascade Model, and predicting probabilities of unseen flow from these models. Our approach is based on a principled probabilistic construction and results compare favourably with existing methods in terms of accuracy of prediction and scalable evaluation, with the addition that we are able to evaluate a broader range of queries than previously shown, including probability of joint and/or conditional flow, as well as reflecting model uncertainty. Exact evaluation of flow probabilities is exponential in the number of edges and naive sampling can also be expensive, so we propose sampling in an efficient Markov-Chain Monte-Carlo fashion using the Metropolis-Hastings algorithm -- details described in the paper. We identify two types of data, those where the paths of past flows are known -- attributed data, and those where only the endpoints are known -- unattributed data. Both data types are addressed in this paper, including training methods, example real world data sets, and experimental evaluation. In particular, we investigate flow data from the Twitter microblogging service, exploring the flow of messages through retweets (tweet forwards) for the attributed case, and the propagation of hash tags (metadata tags) and urls for the unattributed case.", "citation": "Citations (16)", "departments": ["Imperial College London", "IBM", "IBM", "IBM", "Imperial College London"], "authors": ["Luke Dickens.....http://dblp.org/pers/hd/d/Dickens:Luke", "Ian Molloy.....http://dblp.org/pers/hd/m/Molloy:Ian", "Jorge Lobo.....http://dblp.org/pers/hd/l/Lobo_0001:Jorge", "Pau-Chen Cheng.....http://dblp.org/pers/hd/c/Cheng:Pau=Chen", "Alessandra Russo.....http://dblp.org/pers/hd/r/Russo:Alessandra"], "conf": "icde", "year": "2012", "pages": 12}