{"title": "Rate adaptation for 802.11 multiuser mimo networks.", "fields": ["network packet", "transmission time", "computer network", "mobile computing", "3g mimo", "control theory", "throughput", "computer science", "mimo"], "abstract": "In multiuser MIMO (MU-MIMO) networks, the optimal bit rate of a user is highly dynamic and changes from one packet to the next. This breaks traditional bit rate adaptation algorithms, which rely on recent history to predict the best bit rate for the next packet. To address this problem, we introduce TurboRate, a rate adaptation scheme for MU-MIMO LANs. TurboRate shows that clients in a MU-MIMO LAN can adapt their bit rate on a per-packet basis if each client learns two variables: its SNR when it transmits alone to the access point, and the direction along which its signal is received at the AP. TurboRate also shows that each client can compute these two variables passively without exchanging control frames with the access point. A TurboRate client then annotates its packets with these variables to enable other clients to pick the optimal bit rate and transmit concurrently to the AP. A prototype implementation in USRP-N200 shows that traditional rate adaptation does not deliver the gains of MU-MIMO WLANs, and can interact negatively with MU-MIMO, leading to low throughput. In contrast, enabling MU-MIMO with TurboRate provides a mean throughput gain of 1.7x and 2.3x, for 2-antenna and 3-antenna APs respectively.", "citation": "Not cited", "departments": ["Academia Sinica", "Academia Sinica", "Academia Sinica", "Academia Sinica", "University of Washington", "Center for Information Technology", "Center for Information Technology", "University of Washington", "Center for Information Technology"], "authors": ["Wei-Liang Shen.....http://dblp.org/pers/hd/s/Shen:Wei=Liang", "Yu-Chih Tung.....http://dblp.org/pers/hd/t/Tung:Yu=Chih", "Kuang-Che Lee.....http://dblp.org/pers/hd/l/Lee:Kuang=Che", "Kate Ching-Ju Lin.....http://dblp.org/pers/hd/l/Lin:Kate_Ching=Ju", "Shyamnath Gollakota.....http://dblp.org/pers/hd/g/Gollakota:Shyamnath", "Dina Katabi.....http://dblp.org/pers/hd/k/Katabi:Dina", "Ming-Syan Chen.....http://dblp.org/pers/hd/c/Chen:Ming=Syan"], "conf": "mobicom", "year": "2012", "pages": 12}