{"title": "A statistical approach for target counting in sensor-based surveillance systems.", "fields": ["residual sum of squares", "probability distribution", "binomial distribution", "kernel regression", "explained sum of squares"], "abstract": "Target counting in sensor-based surveillance systems is an interesting task that potentially could have many important applications in practice. In such a system, each sensor outputs the number of targets in its sensing region, and the problem is how one can combine all the reported numbers from sensors to provide an estimate of the total number of targets present in the entire monitored area. The main challenge of the problem is how to handle different sensors' outputs that contain some counts of the same targets falling into the overlapped area from these sensors' sensing regions. This paper introduces a statistical approach to estimate the target count in such a surveillance system. Our approach avoids direct handling of the overlapping issue by adopting statistical methods. First, depending on whether or not certain prior knowledge is available regarding the target distribution, the procedure in minimizing the residual sum of squares or kernel regression is used to estimate the distribution of targets. Then the estimated count of the total targets is obtained by the method of likelihood estimation based on a sequence of binomial distributions that are derived from a sampling procedure. Comparisons based on simulations show that our proposed counting approach outperform the state of art counting algorithms. Extensive simulations also show that our proposed approach is very fast and very promising in estimating the target count in sensor-based surveillance systems.", "citation": "Citations (11)", "departments": ["George Washington University", "Uniformed Services University of the Health Sciences", "University of Science and Technology of China", "George Washington University"], "authors": ["Dengyuan Wu.....http://dblp.org/pers/hd/w/Wu:Dengyuan", "Dechang Chen.....http://dblp.org/pers/hd/c/Chen:Dechang", "Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen"], "conf": "infocom", "year": "2012", "pages": 9}