{"title": "Region scheduling: efficiently using the cache architectures via page-level affinity.", "fields": ["uniform memory access", "bus sniffing", "cache pollution", "two level scheduling", "tag ram"], "abstract": "The performance of modern many-core platforms strongly depends on the effectiveness of using their complex cache and memory structures. This indicates the need for a memory-centric approach to platform scheduling, in which it is the locations of memory blocks in caches rather than CPU idleness that determines where application processes are run. Using the term 'memory region' to denote the current set of physical memory pages actively used by an application, this paper presents and evaluates region-based scheduling methods for multicore platforms. This involves (i) continuously and at runtime identifying the memory regions used by executable entities, and their sizes, (ii) mapping these regions to caches to match performance goals, and (iii) maintaining region to cache mappings by ensuring that entities run on processors with direct access to the caches containing their regions. Region scheduling can implement policies that (i) offer improved performance to applications by 'unifying' the multiple caches present on the underlying physical machine and/or by 'balancing' cache usage to take maximum advantage of available cache space, (ii) better isolate applications from each other, particularly when their performance is strongly affected by cache availability, and also (iii) take advantage of standard scheduling and CPU-based load balancing when regioning is ineffective. The paper describes region scheduling and its system-level implementation and evaluates its performance with micro-benchmarks and representative multi-core applications. Single applications see performance improvements of up to 15% with region scheduling, and we observe 40% latency improvements when a platform is shared by multiple applications. Superior isolation is shown to be particularly important for cache-sensitive or real-time codes.", "citation": "Citations (19)", "year": "2012", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "asplos", "authors": ["Min Lee.....http://dblp.org/pers/hd/l/Lee:Min", "Karsten Schwan.....http://dblp.org/pers/hd/s/Schwan:Karsten"], "pages": 12}