{"title": "EUDEMON: A System for Online Video Frame Copy Detection by Earth Mover's Distance.", "fields": ["content based image retrieval", "image retrieval", "software deployment", "image registration", "earth mover s distance"], "abstract": "The Earth Mover's Distance, or EMD for short, has been proven to be effective for content-based image retrieval. However, due to the cubic complexity of EMD computation, it remains difficult to use EMD in applications with stringent requirement for efficiency. In this paper, we present our new system, called EUDEMON, which utilizes new techniques to support fast Online Video Frame Copy Detection based on the EMD. Given a group of registered frames as queries and a set of targeted detection videos, EUDEMON is capable of identifying relevant frames from the video stream in real time. The significant improvement on efficiency mainly relies on the primal-dual theory in linear programming and well-designed B+ tree filters for adaptive candidate pruning. Generally speaking, our system includes a variety of new features crucial to the deployment of EUDEMON in real applications. First, EUDEMON achieves high throughput even when a large number of queries are registered in the system. Second, EUDEMON contains self-optimization component to automatically enhance the effectiveness of the filters based on the recent content of the video stream. Finally, EUDEMON provides a user-friendly visualization interface, named EMD Flow Chart, to help the users to better understand the alarm with the perspective of the EMD.", "citation": "Citations (3)", "departments": ["Northeastern University", "Northeastern University", "Northeastern University", "National University of Singapore", "Northeastern University"], "authors": ["Jia Xu.....http://dblp.org/pers/hd/x/Xu:Jia", "Qiushi Bai.....http://dblp.org/pers/hd/b/Bai:Qiushi", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0002:Yu", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H=", "Guoren Wang.....http://dblp.org/pers/hd/w/Wang:Guoren", "Ge Yu.....http://dblp.org/pers/hd/y/Yu_0001:Ge", "Zhenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenjie"], "conf": "icde", "year": "2012", "pages": 4}