{"title": "L2P2: Location-aware location privacy protection for location-based services.", "fields": ["location awareness", "cloaking", "location based service", "information privacy", "privacy software"], "abstract": "Location privacy has been a serious concern for mobile users who use location-based services provided by the third-party provider via mobile networks. Recently, there have been tremendous efforts on developing new anonymity or obfuscation techniques to protect location privacy of mobile users. Though effective in certain scenarios, these existing techniques usually assume that a user has a constant privacy requirement along spatial and/or temporal dimensions, which may not be true in real-life scenarios. In this paper, we introduce a new location privacy problem: Location-aware Location Privacy Protection (L2P2) problem, where users can define dynamic and diverse privacy requirements for different locations. The goal of the L2P2 problem is to find the smallest cloaking area for each location request so that diverse privacy requirements over spatial and/or temporal dimensions are satisfied for each user. In this paper, we formalize two versions of the L2P2 problem, and propose several efficient heuristics to provide such location-aware location privacy protection for mobile users. Through multiple simulations on a large data set of trajectories for one thousand mobile users, we confirm the effectiveness and efficiency of the proposed L2P2 algorithms.", "citation": "Citations (75)", "departments": ["University of North Carolina at Charlotte", "Governors State University", "Beijing Institute of Technology", "Beijing Institute of Technology", "Beijing Institute of Technology"], "authors": ["Yu Wang.....http://dblp.org/pers/hd/w/Wang_0003:Yu", "Dingbang Xu.....http://dblp.org/pers/hd/x/Xu:Dingbang", "Xiao He.....http://dblp.org/pers/hd/h/He:Xiao", "Chao Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao", "Fan Li.....http://dblp.org/pers/hd/l/Li_0001:Fan", "Bin Xu.....http://dblp.org/pers/hd/x/Xu_0001:Bin"], "conf": "infocom", "year": "2012", "pages": 9}