{"title": "Explicit Subspace Designs.", "fields": ["wronskian", "linear subspace", "combinatorics", "linear independence", "subspace topology", "discrete mathematics", "mathematics", "univariate"], "abstract": "A subspace design is a collection {H 1 , H 2 , . . . , H M } of subspaces of F m  q  with the property that no low-dimensional subspace W of F q  m  intersects too many subspaces of the collection. Subspace designs were introduced by Guruswami and Xing (STOC 2013) who used them to give a randomized construction of optimal rate list-decodable codes over constant-sized large alphabets and sub-logarithmic (and even smaller) list size. Subspace designs are the only non-explicit part of their construction. In this paper, we give explicit constructions of subspace designs with parameters close to the probabilistic construction, and this implies the first deterministic polynomial time construction of list-decodable codes achieving the above parameters. Our constructions of subspace designs are natural and easily described, and are based on univariate polynomials over finite fields. Curiously, the constructions are very closely related to certain good list-decodable codes (folded RS codes and univariate multiplicity codes). The proof of the subspace design property uses the polynomial method (with multiplicities): Given a target low-dimensional subspace W, we construct a nonzero low-degree polynomial P W  that has several roots for each H that non-trivially intersects W. The construction of P W  is based on the classical Wronskian determinant and the folded Wronskian determinant, the latter being a recently studied notion that we make explicit in this paper. Our analysis reveals some new phenomena about the zeroes of univariate polynomials, namely that polynomials with many structured roots or many high multiplicity roots tend to be linearly independent.", "citation": "Citations (15)", "year": "2013", "departments": ["Carnegie Mellon University", "Rutgers University", "Carnegie Mellon University", "Rutgers University"], "conf": "focs", "authors": ["Venkatesan Guruswami.....http://dblp.org/pers/hd/g/Guruswami:Venkatesan", "Swastik Kopparty.....http://dblp.org/pers/hd/k/Kopparty:Swastik"], "pages": 10}