{"title": "Simultaneous Resettability from One-Way Functions.", "fields": ["soundness", "permutation", "probabilistic logic", "witness", "one way function"], "abstract": "Resettable-security, introduced by Canetti, Goldreich, Goldwasser and Micali (STOC'00), considers the security of cryptographic two-party protocols (in particular zero-knowledge arguments) in a setting where the attacker may “reset” or “rewind” one of the players. The strongest notion of resettable security, simultaneous resettability, introduced by Barak, Goldreich, Goldwasser and Lindell (FOCS'01), requires resettable security to hold for both parties: in the context of zero-knowledge, both the soundness and the zero-knowledge conditions remain robust to resetting attacks. To date, all known constructions of protocols satisfying simultaneous resettable security rely on the existence of ZAPs; constructions of ZAPs are only known based on the existence of trapdoor permutations or number-theoretic assumptions. In this paper, we provide a new method for constructing protocols satisfying simultaneous resettable security while relying only on the minimal assumption of one-way functions. Our key results establish, assuming only one-way functions: Every language in NP has an ω(1)-round simultaneously resettable witness indistinguishable argument system; Every language in NP has a (polynomial-round) simultaneously resettable zero-knowledge argument system. The key conceptual insight in our technique is relying on black-box impossibility results for concurrent zero-knowledge to achieve resettable-security.", "citation": "Citations (8)", "year": "2013", "departments": ["University of California, Los Angeles", "Cornell University", "University of Salerno", "Acad. Sinica, Taipei, Taiwan"], "conf": "focs", "authors": ["Kai-Min Chung.....http://dblp.org/pers/hd/c/Chung:Kai=Min", "Rafail Ostrovsky.....http://dblp.org/pers/hd/o/Ostrovsky:Rafail", "Rafael Pass.....http://dblp.org/pers/hd/p/Pass:Rafael", "Ivan Visconti.....http://dblp.org/pers/hd/v/Visconti:Ivan"], "pages": 10}