{"title": "Energy-efficient cognitive heterogeneous networks powered by the smart grid.", "fields": ["heterogeneous network", "smart grid", "grid", "cognitive radio", "cognitive network"], "abstract": "Rapidly rising energy costs and increasingly rigid environmental standards have led to an emerging trend of addressing the “energy efficiency” aspect of mobile cellular networks. Cognitive heterogeneous mobile networks are considered as important techniques to improve the energy efficiency. However, most existing works do not consider the power grid, which provides electricity to cellular networks. Currently, the power grid is experiencing a significant shift from the traditional grid to the smart grid. In the smart grid environment, only considering energy efficiency may not be sufficient, since the dynamics of the smart grid will have significant impacts on mobile networks. In this paper, we study cognitive heterogeneous mobile networks in the smart grid environment. Unlike most existing studies on cognitive networks, where only the radio spectrum is sensed, our cognitive networks sense not only the radio spectrum environment but also the smart grid environment, based on which power allocation and interference management are performed. We formulate the problems of electricity price decision, energy-efficient power allocation and interference management as a three-level Stackelberg game. A homogeneous Bertrand game with asymmetric costs is used to model price decisions made by the electricity retailers. A backward induction method is used to analyze the proposed Stackelberg game. Simulation results show that our proposed scheme can significantly reduce operational expenditure and CO 2  emissions in cognitive heterogeneous mobile networks.", "citation": "Citations (13)", "departments": ["Carleton University", "Carleton University", "Carleton University"], "authors": ["Shengrong Bu.....http://dblp.org/pers/hd/b/Bu:Shengrong", "F. Richard Yu.....http://dblp.org/pers/hd/y/Yu:F=_Richard", "Yi Qian.....http://dblp.org/pers/hd/q/Qian:Yi"], "conf": "infocom", "year": "2013", "pages": 9}