{"title": "Efficient distributed multiple-message broadcasting in unstructured wireless networks.", "fields": ["broadcast communication network", "network model", "distributed algorithm", "asynchronous communication", "broadcast radiation"], "abstract": "Multiple-message broadcast is a generalization of the traditional broadcast problem. It is to disseminate k distinct (1 ≤ k ≤ n) messages stored at k arbitrary nodes to the entire network with the fewest timeslots. In this paper, we study this basic communication primitive in unstructured wireless networks under the physical interference model (also known as the SINR model). The unstructured wireless network assumes unknown network topology, no collision detection and asynchronous communications. Our proposed randomized distributed algorithm can accomplish multiple-message broadcast in O((D + k) log n + log 2  n) timeslots with high probability, where D is the network diameter and n is the number of nodes in the network. To our best knowledge, this work is the first one to consider distributively implementing multiple-message broadcasting in unstructured wireless networks under a global interference model, which may shed some light on how to efficiently solve in general a “global” problem in a “local” fashion with “global” interference constraints in asynchronous wireless ad hoc networks. Apart from the algorithm, we also show an Ω(D+k+log n) lower bound for randomized distributed multiple message broadcast algorithms under the assumed network model.", "citation": "Citations (13)", "departments": ["University of Hong Kong", "Tsinghua University", "Tsinghua University", "Qufu Normal University", "University of Hong Kong"], "authors": ["Dongxiao Yu.....http://dblp.org/pers/hd/y/Yu:Dongxiao", "Qiang-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Qiang=Sheng", "Yuexuan Wang.....http://dblp.org/pers/hd/w/Wang:Yuexuan", "Jiguo Yu.....http://dblp.org/pers/hd/y/Yu:Jiguo", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2013", "pages": 9}