{"title": "Pareto-Based Multiobjective AI Planning.", "fields": ["job shop scheduling", "automated planning and scheduling", "planner", "pareto principle", "solver"], "abstract": "Real-world problems generally involve several antagonistic objectives, like quality and cost for design problems, or makespan and cost for planning problems. The only approaches to multiobjective AI Planning rely on metrics, that can incorporate several objectives in some linear combinations, and metric sensitive planners, that are able to give different plans for different metrics, and hence to eventually approximate the Pareto front of the multiobjective problem, i.e. the set of optimal trade-offs between the antagonistic objectives. Divide-and-Evolve (DAE) is an evolutionary planner that embeds a classical planner and feeds it with a sequence of subproblems of the problem at hand. Like all Evolutionary Algorithms, DAE can be turned into a Pareto-based multiobjective solver, even though using an embedded planner that is not metric sensitive. The Pareto-based multiobjective planner MO-DAE thus avoids the drawbacks of the aggregation method. Furthermore, using YAHSP as the embedded planner, it outperforms in many cases the metric-based approach using LPG metric sensitive planner, as witnessed by experimental results on original multiobjective benchmarks built upon IPC-2011 domains.", "citation": "Citations (7)", "year": "2013", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "ONERA, Toulouse, France", "Thales Research ... aiseau, France", "Thales Research ... aiseau, France"], "conf": "ijcai", "authors": ["Mostepha Redouane Khouadjia.....http://dblp.org/pers/hd/k/Khouadjia:Mostepha_Redouane", "Marc Schoenauer.....http://dblp.org/pers/hd/s/Schoenauer:Marc", "Vincent Vidal.....http://dblp.org/pers/hd/v/Vidal_0001:Vincent", "Johann Dréo.....http://dblp.org/pers/hd/d/Dr=eacute=o:Johann", "Pierre Savéant.....http://dblp.org/pers/hd/s/Sav=eacute=ant:Pierre"], "pages": 7}