{"title": "Dynamic switching-based reliable flooding in low-duty-cycle wireless sensor networks.", "fields": ["network packet", "latency", "duty cycle", "key distribution in wireless sensor networks", "network operations center", "flooding"], "abstract": "Reliable flooding in wireless sensor networks (WSNs) is desirable for a broad range of applications and network operations, and has been extensively investigated. However, relatively little work has been done for reliable flooding in lowduty-cycle WSNs with unreliable wireless links. It is a challenging problem to efficiently ensure 100% flooding coverage considering the combined effects of low-duty-cycle operation and unreliable wireless transmission. In this work, we propose a novel dynamic switching-based reliable flooding (DSRF) framework, which is designed as an enhancement layer to provide efficient and reliable delivery for a variety of existing flooding tree structures in lowduty-cycle WSNs. The key novelty of DSRF lies in the dynamic switching decision making when encountering a transmission failure, where a flooding tree structure is dynamically adjusted based on the packet reception results for energy saving and delay reduction. DSRF is distinctive from existing works in that it explores both poor links and good links on demand. Through comprehensive performance comparisons, we demonstrate that, compared with the flooding protocol without DSRF enhancement, DSRF effectively reduces the flooding delay and the total number of packet transmission by 12% 25% and 10% 15%, respectively. Remarkably, the achieved performance is close to the theoretical lower bound.", "citation": "Citations (21)", "departments": ["Singapore University of Technology and Design", "Singapore University of Technology and Design", "University of Minnesota", "Beihang University", "Singapore University of Technology and Design", "Singapore University of Technology and Design", "University of Minnesota", "Beihang University"], "authors": ["Long Cheng.....http://dblp.org/pers/hd/c/Cheng_0005:Long", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0001:Yu", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian", "Jianwei Niu.....http://dblp.org/pers/hd/n/Niu_0002:Jianwei"], "conf": "infocom", "year": "2013", "pages": 9}