{"title": "Practical algorithm for power efficient DRX configuration in next generation mobiles.", "fields": ["network packet", "battery", "electrical efficiency", "discontinuous reception", "next generation network"], "abstract": "In this paper, we consider wireless communication systems where user equipments (UEs) monitor packet-data traffic characteristics and adopt Discontinuous Reception (DRX) to conserve battery power. With DRX, the receiver circuitry is configured to toggle between on (active) and off (inactive) states for specified durations, depending on the packet arrival process. Arriving at an appropriate DRX configuration remains a challenging research issue, especially when multiple applications generate traffic. Our objective in this work is to provide a practical mechanism for selecting a suitable DRX configuration. First, we derive an analytical expression for the expected maximum time (delay) required for a packet arriving during the offduration to be serviced for any arrival process. Second, we obtain an estimate for the on-duration, T on * for which the expected delay is below a certain threshold. Using T on *, we compute the active duration, T active  in each DRX cycle by considering the timers specified in 3 rd  Generation Partnership Project (3GPP) Release 10 and for a given interarrival time distribution between packets. Finally, using our analysis, we propose a pragmatic algorithm and show how to select an appropriate DRX configuration which will lead to high power efficiency with acceptable buffer requirements. Through extensive analysis and simulations both with general arrival processes and real-time traces, we show that our algorithm can lead to significant extension in battery life at the UE.", "citation": "Citations (10)", "departments": ["Samsung", "Samsung"], "authors": ["R. M. Karthik.....http://dblp.org/pers/hd/k/Karthik:R=_M=", "Arvind Chakrapani.....http://dblp.org/pers/hd/c/Chakrapani:Arvind"], "conf": "infocom", "year": "2013", "pages": 9}