{"title": "Hyperbolic Harmonic Mapping for Constrained Brain Surface Registration.", "fields": ["ricci flow", "diffeomorphism", "general topology", "harmonic", "harmonic map"], "abstract": "Automatic computation of surface correspondence via harmonic map is an active research field in computer vision, computer graphics and computational geometry. It may help document and understand physical and biological phenomena and also has broad applications in biometrics, medical imaging and motion capture. Although numerous studies have been devoted to harmonic map research, limited progress has been made to compute a diffeomorphic harmonic map on general topology surfaces with landmark constraints. This work conquer this problem by changing the Riemannian metric on the target surface to a hyperbolic metric, so that the harmonic mapping is guaranteed to be a diffeomorphism under landmark constraints. The computational algorithms are based on the Ricci flow method and the method is general and robust. We apply our algorithm to study constrained human brain surface registration problem. Experimental results demonstrate that, by changing the Riemannian metric, the registrations are always diffeomorphic, and achieve relative high performance when evaluated with some popular cortical surface registration evaluation standards.", "citation": "Citations (16)", "year": "2013", "departments": ["Stony Brook University", "Florida International University", "Stony Brook University", "University of Southern California", "Ohio State University"], "conf": "cvpr", "authors": ["Rui Shi.....http://dblp.org/pers/hd/s/Shi:Rui", "Wei Zeng.....http://dblp.org/pers/hd/z/Zeng:Wei", "Zhengyu Su.....http://dblp.org/pers/hd/s/Su:Zhengyu", "Hanna Damasio.....http://dblp.org/pers/hd/d/Damasio:Hanna", "Zhonglin Lu.....http://dblp.org/pers/hd/l/Lu:Zhonglin", "Yalin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Yalin", "Shing-Tung Yau.....http://dblp.org/pers/hd/y/Yau:Shing=Tung", "Xianfeng Gu.....http://dblp.org/pers/hd/g/Gu:Xianfeng"], "pages": 8}