{"title": "Mining lines in the sand: on trajectory discovery from untrustworthy data in cyber-physical system.", "fields": ["cyber physical system", "battlefield", "identification", "trustworthiness", "trajectory"], "abstract": "A Cyber-Physical System (CPS) integrates physical (i.e., sensor) devices with cyber (i.e., informational) components to form a context sensitive system that responds intelligently to dynamic changes in real-world situations. The CPS has wide applications in scenarios such as environment monitoring, battlefield surveillance and traffic control. One key research problem of CPS is called \" mining lines in the sand \". With a large number of sensors (sand) deployed in a designated area, the CPS is required to discover all the trajectories (lines) of passing intruders in real time. There are two crucial challenges that need to be addressed: (1) the collected sensor data are not trustworthy; (2) the intruders do not send out any identification information. The system needs to distinguish multiple intruders and track their movements. In this study, we propose a method called  LiSM  (Line-in-the-Sand Miner) to discover trajectories from untrustworthy sensor data.  LiSM  constructs a watching network from sensor data and computes the locations of intruder appearances based on the link information of the network. The system retrieves a  cone-mode l from the historical trajectories and tracks multiple intruders based on this model. Finally the system validates the mining results and updates the sensor's reliability in a feedback process. Extensive experiments on big datasets demonstrate the feasibility and applicability of the proposed methods.", "citation": "Citations (3)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "BBN Technology, ... sachusetts, USA"], "authors": ["Lu An Tang.....http://dblp.org/pers/hd/t/Tang:Lu_An", "Xiao Yu.....http://dblp.org/pers/hd/y/Yu:Xiao", "Quanquan Gu.....http://dblp.org/pers/hd/g/Gu:Quanquan", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Alice Leung.....http://dblp.org/pers/hd/l/Leung:Alice", "Thomas F. La Porta.....http://dblp.org/pers/hd/p/Porta:Thomas_F=_La"], "conf": "kdd", "year": "2013", "pages": 9}