{"title": "Effective Inter-Component Communication Mapping in Android: An Essential Step Towards Holistic Security Analysis.", "fields": ["security analysis", "android", "computer security", "scalability", "static analysis"], "abstract": "Many threats present in smartphones are the result of interactions between application components, not just artifacts of single components. However, current techniques for identifying inter-application communication are ad hoc and do not scale to large numbers of applications. In this paper, we reduce the discovery of inter-component communication (ICC) in smartphones to an instance of the Interprocedural Distributive Environment (IDE) problem, and develop a sound static analysis technique targeted to the Android platform. We apply this analysis to 1,200 applications selected from the Play store and characterize the locations and substance of their ICC. Experiments show that full specifications for ICC can be identified for over 93% of ICC locations for the applications studied. Further the analysis scales well; analysis of each application took on average 113 seconds to complete. Epicc, the resulting tool, finds ICC vulnerabilities with far fewer false positives than the next best tool. In this way, we develop a scalable vehicle to extend current security analysis to entire collections of applications as well as the interfaces they export.", "citation": "Citations (355)", "year": "2013", "departments": ["Pennsylvania State University", "Pennsylvania State University", "University of Wisconsin-Madison", "University of Luxembourg", "Technische Universität Darmstadt"], "conf": "uss", "authors": ["Damien Octeau.....http://dblp.org/pers/hd/o/Octeau:Damien", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D=", "Somesh Jha.....http://dblp.org/pers/hd/j/Jha:Somesh", "Alexandre Bartel.....http://dblp.org/pers/hd/b/Bartel:Alexandre", "Eric Bodden.....http://dblp.org/pers/hd/b/Bodden:Eric", "Jacques Klein.....http://dblp.org/pers/hd/k/Klein:Jacques", "Yves Le Traon.....http://dblp.org/pers/hd/t/Traon:Yves_Le"], "pages": 16}