{"title": "Size does matter: how image size affects aesthetic perception?", "fields": ["crowdsourcing", "composition", "salience", "display size", "pixel"], "abstract": "There is no doubt that an image's content determines how people assess the image aesthetically. Previous works have shown that image contrast, saliency features, and the composition of objects may jointly determine whether or not an image is perceived as aesthetically pleasing. In addition to an image's content, the way the image is presented may affect how much viewers appreciate it. For example, it may be assumed that a picture will always look better when it is displayed in a larger size. Is this \"the-bigger-the-better\" rule always valid? If not, in what situations is it invalid?    In this paper, we investigate how an image's resolution (pixels) and physical dimensions (inches) affect viewers' appreciation of it. Based on a large-scale aesthetic assessments of 100 images displayed in a variety of resolutions and physical dimensions, we show that an image's size significantly affects its aesthetic rating in a complicated way. Normally a picture looks better when it is bigger, but it may look worse depending on its content. We develop a set of regression models to predict a picture's absolute and relative aesthetic levels at a given display size based on its content and compositional features. In addition, we analyze the essential features that lead to the size-dependent property of image aesthetics. It is hoped that this work will motivate further research by showing that both content and presentation should be considered when evaluating an image's aesthetic appeals.", "citation": "Citations (13)", "departments": ["National Chung Cheng University", "National Chung Cheng University", "Academia Sinica"], "authors": ["Wei-Ta Chu.....http://dblp.org/pers/hd/c/Chu:Wei=Ta", "Yu-Kuang Chen.....http://dblp.org/pers/hd/c/Chen:Yu=Kuang", "Kuan-Ta Chen.....http://dblp.org/pers/hd/c/Chen:Kuan=Ta"], "conf": "mm", "year": "2013", "pages": 10}