{"title": "Tatonnement beyond gross substitutes?: gradient descent to the rescue.", "fields": ["walrasian auction", "demand curve", "complementary good", "bregman divergence", "differentiable function"], "abstract": "Tatonnement is a simple and natural rule for updating prices in Exchange (Arrow-Debreu) markets. In this paper we define a class of markets for which tatonnement is equivalent to gradient descent. This is the class of markets for which there is a convex potential function whose gradient is always equal to the negative of the excess demand and we call it Convex Potential Function (CPF) markets. We show the following results. CPF markets contain the class of Eisenberg Gale (EG) markets, defined previously by Jain and Vazirani. The subclass of CPF markets for which the demand is a differentiable function contains exactly those markets whose demand function has a symmetric negative semi-definite Jacobian. We define a family of continuous versions of tatonnement based on gradient descent using a Bregman divergence. As we show, all processes in this family converge to an equilibrium for any CPF market. This is analogous to the classic result for markets satisfying the Weak Gross Substitutes property. A discrete version of tatonnement converges toward the equilibrium for the following markets of complementary goods; its convergence rate for these settings is analyzed using a common potential function. Fisher markets in which all buyers have Leontief utilities. The tatonnement process reduces the distance to the equilibrium, as measured by the potential function, to an e fraction of its initial value in O(1/e) rounds of price updates. Fisher markets in which all buyers have complementary CES utilities. Here, the distance to the equilibrium is reduced to an e fraction of its initial value in O(log(1/e)) rounds of price updates.   This shows that tatonnement converges for the entire range of Fisher markets when buyers have  complementary  CES utilities, in contrast to prior work, which could analyze only the  substitutes  range, together with a small portion of the complementary range.", "citation": "Citations (21)", "year": "2013", "departments": ["New York University", "New York University", "Microsoft"], "conf": "stoc", "authors": ["Yun Kuen Cheung.....http://dblp.org/pers/hd/c/Cheung:Yun_Kuen", "Richard Cole.....http://dblp.org/pers/hd/c/Cole_0001:Richard", "Nikhil R. Devanur.....http://dblp.org/pers/hd/d/Devanur:Nikhil_R="], "pages": 10}