{"title": "Wireless scheduling for network utility maximization with optimal convergence speed.", "fields": ["transmission", "diffusing update algorithm", "maximization", "network utility", "moving average"], "abstract": "In this paper, we study the design of joint flow rate control and scheduling policies in multi-hop wireless networks for achieving maximum network utility with provably optimal convergence speed. Fast convergence is especially important in wireless networks which are dominated by the dynamics of incoming and outgoing flows as well as the time sensitive applications. Yet, the design of fast converging policies in wireless networks is complicated by: (i) the interference-constrained communication capabilities, and (ii) the finite set of transmission rates to select from due to operational and physical-layer constraints. We tackle these challenges by explicitly incorporating such discrete constraints to understand their impact on the convergence speed at which the running average of the received service rates and the network utility converges to their limits. In particular, we establish a fundamental fact that the convergence speed of any feasible policy cannot be faster than Ω (1/T) under both the T rate and utility metrics. Then, we develop an algorithm that achieves this optimal convergence speed in both metrics. We also show that the well-known dual algorithm can achieve the optimal convergence speed in terms of its utility value. These results reveal the interesting fact that the convergence speed of rates and utilities in wireless networks is dominated by the discrete choices of scheduling and transmission rates, which also implies that the use of higher-order flow rate controllers with fast convergence guarantees cannot overcome the aforementioned fundamental limitation.", "citation": "Citations (6)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Bin Li.....http://dblp.org/pers/hd/l/Li_0014:Bin", "Atilla Eryilmaz.....http://dblp.org/pers/hd/e/Eryilmaz:Atilla", "Ruogu Li.....http://dblp.org/pers/hd/l/Li:Ruogu"], "conf": "infocom", "year": "2013", "pages": 9}