{"title": "Compressing IP forwarding tables: towards entropy bounds and beyond.", "fields": ["asymptotically optimal algorithm", "trie", "ip forwarding", "longest prefix match", "virtual routing and forwarding"], "abstract": "Lately, there has been an upsurge of interest in compressed data structures, aiming to pack ever larger quantities of information into constrained memory without sacrificing the efficiency of standard operations, like random access, search, or update. The main goal of this paper is to demonstrate how data compression can benefit the networking community, by showing how to squeeze the IP Forwarding Information Base (FIB), the giant table consulted by IP routers to make forwarding decisions, into information-theoretical entropy bounds, with essentially zero cost on longest prefix match and FIB update. First, we adopt the state-of-the-art in compressed data structures, yielding a static entropy-compressed FIB representation with asymptotically optimal lookup. Then, we re-design the venerable prefix tree, used commonly for IP lookup for at least 20 years in IP routers, to also admit entropy bounds and support lookup in optimal time and update in nearly optimal time. Evaluations on a Linux kernel prototype indicate that our compressors encode a FIB comprising more than 440K prefixes to just about 100--400 KBytes of memory, with a threefold increase in lookup throughput and no penalty on FIB updates.", "citation": "Citations (70)", "departments": ["Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics", "Budapest University of Technology and Economics"], "authors": ["Gábor Rétvári.....http://dblp.org/pers/hd/r/R=eacute=tv=aacute=ri:G=aacute=bor", "János Tapolcai.....http://dblp.org/pers/hd/t/Tapolcai:J=aacute=nos", "Attila Korösi.....http://dblp.org/pers/hd/k/Kor=ouml=si:Attila", "András Majdán.....http://dblp.org/pers/hd/m/Majd=aacute=n:Andr=aacute=s", "Zalán Heszberger.....http://dblp.org/pers/hd/h/Heszberger:Zal=aacute=n"], "conf": "sigcomm", "year": "2013", "pages": 12}