{"title": "Change-Point Detection with Feature Selection in High-Dimensional Time-Series Data.", "fields": ["kernel", "change detection", "supervised learning", "synthetic data", "binary number"], "abstract": "Change-point detection is the problem of finding abrupt changes in time-series, and it is attracting a lot of attention in the artificial intelligence and data mining communities. In this paper, we present a supervised learning based change-point detection approach in which we use the separability of past and future data at time t (they are labeled as +1 and -1) as plausibility of change-points. Based on this framework, we propose a detection measure called the additive Hilbert-Schmidt Independence Criterion (aHSIC), which is defined as the weighted sum of the HSIC scores between features and its corresponding binary labels. Here, the HSIC is a kernel-based independence measure. A novel aspect of the aHSIC score is that it can incorporate feature selection during its detection measure estimation. More specifically, we first select features that are responsible for an abrupt change by using a supervised approach, and then compute the aHSIC score by employing the selected features. Thus, compared with traditional detection measures, our approach tends to be robust as regards noise features, and so the aHSIC is suitable for a use with high-dimensional time-series change-point detection problems. We demonstrate that the proposed change-point detection method is promising through extensive experiments on synthetic data sets and a real-world human activity data set.", "citation": "Citations (13)", "year": "2013", "departments": ["Nippon Telegraph and Telephone", "Nippon Telegraph and Telephone", "Nippon Telegraph and Telephone", "Nippon Telegraph and Telephone"], "conf": "ijcai", "authors": ["Makoto Yamada.....http://dblp.org/pers/hd/y/Yamada:Makoto", "Akisato Kimura.....http://dblp.org/pers/hd/k/Kimura:Akisato", "Futoshi Naya.....http://dblp.org/pers/hd/n/Naya:Futoshi", "Hiroshi Sawada.....http://dblp.org/pers/hd/s/Sawada:Hiroshi"], "pages": 7}