{"title": "Efficient distance-aware query evaluation on indoor moving objects.", "fields": ["computational geometry", "k nearest neighbors algorithm", "categorization", "range query", "scalability"], "abstract": "Indoor spaces accommodate large parts of people's life. The increasing availability of indoor positioning, driven by technologies like Wi-Fi, RFID, and Bluetooth, enables a variety of indoor location-based services (LBSs). Efficient indoor distance-aware queries on indoor moving objects play an important role in supporting and boosting such LBSs. However, the distance-aware query evaluation on indoor moving objects is challenging because: (1) indoor spaces are characterized by many special entities and thus render distance calculation very complex; (2) the limitations of indoor positioning technologies create inherent uncertainties in indoor moving objects data. In this paper, we propose a complete set of techniques for efficient distance-aware queries on indoor moving objects. We define and categorize the indoor distances in relation to indoor uncertain objects, and derive different distance bounds that can facilitate query evaluation. Existing works often assume indoor floor plans are static, and require extensive pre-computation on indoor topologies. In contrast, we design a composite index scheme that integrates indoor geometries, indoor topologies, as well as indoor uncertain objects, and thus supports indoor distance-aware queries efficiently without time-consuming and volatile distance computation. We design algorithms for range query and k nearest neighbor query on indoor moving objects. The results of extensive experimental studies demonstrate that our proposals are efficient and scalable in evaluating distance-aware queries over indoor moving objects.", "citation": "Citations (15)", "departments": ["Aalborg University", "Aalborg University", "Aalborg University"], "authors": ["Xike Xie.....http://dblp.org/pers/hd/x/Xie:Xike", "Hua Lu.....http://dblp.org/pers/hd/l/Lu_0001:Hua", "Torben Bach Pedersen.....http://dblp.org/pers/hd/p/Pedersen:Torben_Bach"], "conf": "icde", "year": "2013", "pages": 12}