{"title": "A localized backbone renovating algorithm for wireless ad hoc and sensor networks.", "fields": ["vehicular ad hoc network", "backbone network", "ad hoc wireless distribution service", "key distribution in wireless sensor networks", "computation"], "abstract": "In this paper we propose and analyze a localized backbone renovating algorithm (LBR) to renovate a broken backbone in the network. This research is motivated by the problem of virtual backbone maintenance in wireless ad hoc and sensor networks, where the coverage area of nodes are disks with identical radii. According to our theoretical analysis, the proposed algorithm has the ability to renovate the backbone in a purely localized manner with a guaranteed connectivity of the network, while keeping the backbone size within a constant factor from that of the minimum CDS. Both the communication overhead and computation overhead of the LBR algorithm are O(k), where k is the number of nodes broken or added. We also conduct extensive simulation study on connectivity, backbone size, and the communication/computation overhead. The simulation results show that the proposed algorithm can always keep the renovated backbone being connected at low communication/computation overhead with a relatively small backbone, compared with other existing schemes. Furthermore, the LBR algorithm has the ability to deal with arbitrary number of node failures and additions in the network.", "citation": "Citations (2)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "Hefei University of Technology", "Shanghai Jiao Tong University", "University of Science and Technology of China"], "authors": ["Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai", "Shuo Zhang.....http://dblp.org/pers/hd/z/Zhang:Shuo", "Lei Shi.....http://dblp.org/pers/hd/s/Shi:Lei", "Haojin Zhu.....http://dblp.org/pers/hd/z/Zhu:Haojin", "Yuepeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Yuepeng"], "conf": "infocom", "year": "2013", "pages": 9}