{"title": "Cyrus: unintrusive application-level record-replay for replay parallelism.", "fields": ["debugging", "snoopy cache", "theoretical computer science", "intrusion", "software"], "abstract": "Architectures for deterministic record-replay (R&R) of multithreaded code are attractive for program debugging, intrusion analysis, and fault-tolerance uses. However, very few of the proposed designs have focused on maximizing replay speed -- a key enabling property of these systems. The few efforts that focus on replay speed require intrusive hardware or software modifications, or target whole-system R&R rather than the more useful application-level R&R.   This paper presents the first hardware-based scheme for unintrusive, application-level R&R that explicitly targets high replay speed. Our scheme, called  Cyrus , requires no modification to commodity snoopy cache coherence. It introduces the concept of an on-the-fly software Backend Pass during recording which, as the log is being generated, transforms it for high replay parallelism. This pass also fixes-up the log, and can flexibly trade-off replay parallelism for log size. We analyze the performance of Cyrus using full system (OS plus hardware) simulation. Our results show that Cyrus has negligible recording overhead. In addition, for 8-processor runs of SPLASH-2, Cyrus attains an average replay parallelism of 5, and a replay speed that is, on average, only about 50% lower than the recording speed.", "citation": "Citations (19)", "year": "2013", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Intel"], "conf": "asplos", "authors": ["Nima Honarmand.....http://dblp.org/pers/hd/h/Honarmand:Nima", "Nathan Dautenhahn.....http://dblp.org/pers/hd/d/Dautenhahn:Nathan", "Josep Torrellas.....http://dblp.org/pers/hd/t/Torrellas:Josep", "Samuel T. King.....http://dblp.org/pers/hd/k/King:Samuel_T=", "Gilles Pokam.....http://dblp.org/pers/hd/p/Pokam:Gilles", "Cristiano Pereira.....http://dblp.org/pers/hd/p/Pereira:Cristiano"], "pages": 14}