{"title": "Peeking into the optimization of data flow programs with MapReduce-style UDFs.", "fields": ["peek", "static program analysis", "data processing system", "joins", "user defined function"], "abstract": "Data flows are a popular abstraction to define dataintensive processing tasks. In order to support a wide range of use cases, many data processing systems feature MapReduce-style user-defined functions (UDFs). In contrast to UDFs as known from relational DBMS, MapReduce-style UDFs have less strict templates. These templates do not alone provide all the information needed to decide whether they can be reordered with relational operators and other UDFs. However, it is well-known that reordering operators such as filters, joins, and aggregations can yield runtime improvements by orders of magnitude. We demonstrate an optimizer for data flows that is able to reorder operators with MapReduce-style UDFs written in an imperative language. Our approach leverages static code analysis to extract information from UDFs which is used to reason about the reorderbility of UDF operators. This information is sufficient to enumerate a large fraction of the search space covered by conventional RDBMS optimizers including filter and aggregation push-down, bushy join orders, and choice of physical execution strategies based on interesting properties. We demonstrate our optimizer and a job submission client that allows users to peek step-by-step into each phase of the optimization process: the static code analysis of UDFs, the enumeration of reordered candidate data flows, the generation of physical execution plans, and their parallel execution. For the demonstration, we provide a selection of relational and nonrelational data flow programs which highlight the salient features of our approach.", "citation": "Citations (14)", "departments": ["Humboldt State University", "Tech. Univ. Ber ... Berlin, Germany", "Tech. Univ. Ber ... Berlin, Germany", "Tech. Univ. Ber ... Berlin, Germany", "Tech. Univ. Ber ... Berlin, Germany"], "authors": ["Fabian Hueske.....http://dblp.org/pers/hd/h/Hueske:Fabian", "Mathias Peters.....http://dblp.org/pers/hd/p/Peters:Mathias", "Aljoscha Krettek.....http://dblp.org/pers/hd/k/Krettek:Aljoscha", "Matthias Ringwald.....http://dblp.org/pers/hd/r/Ringwald:Matthias", "Kostas Tzoumas.....http://dblp.org/pers/hd/t/Tzoumas:Kostas", "Volker Markl.....http://dblp.org/pers/hd/m/Markl:Volker", "Johann-Christoph Freytag.....http://dblp.org/pers/hd/f/Freytag:Johann=Christoph"], "conf": "icde", "year": "2013", "pages": 4}