{"title": "Integrity-oriented content transmission in highway vehicular ad hoc networks.", "fields": ["file size", "vehicular ad hoc network", "volatile", "admission control", "provisioning"], "abstract": "The effective inter-vehicle transmission of content files, e.g., images, music and video clips, is the basis of media communications in vehicular networks, such as social communications and video sharing. However, due to the presence of diverse node velocities, severe channel fadings and intensive mutual interferences among vehicles, the inter-vehicle or vehicle-to-vehicle (V2V) communications tend to be transient and highly dynamic. Content transmissions among vehicles over the volatile and spotty V2V channels are thus susceptible to frequent interruptions and failures, resulting in many fragment content transmissions which are unable to finish during the connection time and unusable by on-top media applications. The interruptions of content transmissions not only lead to the failure of media presentations to users, but the transmission of the invalid fragment contents would also result in the significant waste of precious vehicular bandwidth. On addressing this issue, in this work we target on provisioning the integrity-oriented inter-vehicle content transmissions. Given the initial distance and mobility statistics of vehicles, we develop an analytical framework to evaluate the data volume that can be transmitted upon the short-lived and spotty V2V connection from the source to the destination vehicle. Provided the content file size, we are able to evaluate the likelihood of successful content transmissions through the model. Based upon this analysis, we propose an admission control scheme at the transmitters, that filters the suspicious content transmission requests which are unlikely to be accomplished over the transient inter-vehicle links. Using extensive simulations, we demonstrate the accuracy of the developed analytical model, and the effectiveness of the proposed admission control scheme. In the simulated scenario, with the proposed admission control scheme applied, it is observed that about 30% of the network bandwidth can be saved for effective content transmissions.", "citation": "Citations (33)", "departments": ["University of Waterloo", "University of Waterloo", "General Motors"], "authors": ["Tom H. Luan.....http://dblp.org/pers/hd/l/Luan:Tom_H=", "Xuemin (Sherman) Shen.....http://dblp.org/pers/hd/s/Shen:Xuemin_=Sherman=", "Fan Bai.....http://dblp.org/pers/hd/b/Bai:Fan"], "conf": "infocom", "year": "2013", "pages": 9}