{"title": "The answer is blowing in the wind: Analysis of powering Internet data centers with wind energy.", "fields": ["renewable energy", "wind power", "uncorrelated", "leverage", "server"], "abstract": "Internet-scale data centers (IDCs) have rapidly proliferated to such an extent that their energy consumption and GreenHouse Gas (GHG) emissions have become an important concern to society. As a result, many IDC operators have started using renewable energy, e.g., wind power, to power their data centers. Unfortunately, the utilization of wind energy has stayed at a low ratio due to the intermittent nature of wind. This paper makes the case that it is in fact possible for a distributed IDC system to exploit multiple uncorrelated wind energy sources to significantly reduce the effect of intermittency and nearly achieve “entirely green” cloud-scale services. This result is obtained based on the analysis of real-world wind power traces from 69 wind farms. The idea is to leverage the front-end load dispatching server to send work to the location where wind power is available. We propose a wind-power-aware (WPA) policy that routes jobs based only on the current states of workloads and wind power availabilities in the data centers. We show that with the WPA policy more than 95% of energy consumption in IDCs can in fact be satisfied by wind power, and, secondly, that achieving this does not require the delaying of processing of jobs due to wind availability. We also show that the locations where data centers are placed play an important role in achieving high wind power utilization. Our analysis shows that wind power utilization can generally lie in a range from 44% to 96%, depending on how the locations of wind farms are selected. We propose a method for location selection that uses the coefficient of variation instead of the correlation coefficient, and show that with this method the utilization can lie in the high end of the above range. Finally, we verify these results by simulations that are based on real-world traces for both workloads and wind power generations.", "citation": "Citations (22)", "departments": ["Accenture", "Apple Inc.", "McGill University", "Texas A&M University"], "authors": ["Yan Gao.....http://dblp.org/pers/hd/g/Gao:Yan", "Zheng Zeng.....http://dblp.org/pers/hd/z/Zeng:Zheng", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "P. R. Kumar.....http://dblp.org/pers/hd/k/Kumar:P=_R="], "conf": "infocom", "year": "2013", "pages": 5}