{"title": "Efficient search algorithm for SimRank.", "fields": ["spamdexing", "simrank", "search algorithm", "approximation theory", "sylvester equation"], "abstract": "Graphs are a fundamental data structure and have been employed to model objects as well as their relationships. The similarity of objects on the web (e.g., webpages, photos, music, micro-blogs, and social networking service users) is the key to identifying relevant objects in many recent applications. SimRank, proposed by Jeh and Widom, provides a good similarity score and has been successfully used in many applications such as web spam detection, collaborative tagging analysis, link prediction, and so on. SimRank computes similarities iteratively, and it needs O(N 4 T) time and O(N 2 ) space for similarity computation where N and T are the number of nodes and iterations, respectively. Unfortunately, this iterative approach is computationally expensive. The goal of this work is to process top-k search and range search efficiently for a given node. Our solution, SimMat, is based on two ideas: (1) It computes the approximate similarity of a selected node pair efficiently in non-iterative style based on the Sylvester equation, and (2) It prunes unnecessary approximate similarity computations when searching for the high similarity nodes by exploiting estimations based on the Cauchy-Schwarz inequality. These two ideas reduce the time and space complexities of the proposed approach to O(Nn) where n is the target rank of the low-rank approximation (n ≪ N in practice). Our experiments show that our approach is much faster, by several orders of magnitude, than previous approaches in finding the high similarity nodes.", "citation": "Citations (26)", "departments": ["Nippon Telegraph and Telephone", "Nippon Telegraph and Telephone", "Nippon Telegraph and Telephone", "NTT Service Evo ... Yokosuka, Japan"], "authors": ["Yasuhiro Fujiwara.....http://dblp.org/pers/hd/f/Fujiwara:Yasuhiro", "Makoto Nakatsuji.....http://dblp.org/pers/hd/n/Nakatsuji:Makoto", "Hiroaki Shiokawa.....http://dblp.org/pers/hd/s/Shiokawa:Hiroaki", "Makoto Onizuka.....http://dblp.org/pers/hd/o/Onizuka:Makoto"], "conf": "icde", "year": "2013", "pages": 12}