{"title": "Investigating applications portability with the Uintah DAG-based runtime system on PetaScale supercomputers.", "fields": ["top500", "software framework", "runtime system", "software portability", "petascale computing"], "abstract": "Present trends in high performance computing present formidable challenges for applications code using multicore nodes possibly with accelerators and/or co-processors and reduced memory while still attaining scalability. Software frameworks that execute machine-independent applications code using a runtime system that shields users from architectural complexities offer a possible solution. The Uintah framework for example, solves a broad class of large-scale problems on structured adaptive grids using fluid-flow solvers coupled with particle-based solids methods. Uintah executes directed acyclic graphs of computational tasks with a scalable asynchronous and dynamic runtime system for CPU cores and/or accelerators/co-processors on a node. Uintah's clear separation between application and runtime code has led to scalability increases of 1000x without significant changes to application code. This methodology is tested on three leading Top500 machines; OLCF Titan, TACC Stampede and ALCF Mira using three diverse and challenging applications problems. This investigation of scalability with regard to the different processors and communications performance leads to the overall conclusion that the adaptive DAG-based approach provides a very powerful abstraction for solving challenging multi-scale multi-physics engineering problems on some of the largest and most powerful computers available today.", "citation": "Citations (19)", "departments": ["University of Utah", "University of Utah", "University of Utah", "University of Utah"], "authors": ["Qingyu Meng.....http://dblp.org/pers/hd/m/Meng:Qingyu", "Alan Humphrey.....http://dblp.org/pers/hd/h/Humphrey:Alan", "John A. Schmidt.....http://dblp.org/pers/hd/s/Schmidt:John_A=", "Martin Berzins.....http://dblp.org/pers/hd/b/Berzins:Martin"], "conf": "sc", "year": "2013", "pages": 12}