{"title": "Towards efficient sparse coding for scalable image annotation.", "fields": ["neural coding", "hash function", "snapshot", "annotation", "automatic image annotation"], "abstract": "Nowadays, content-based retrieval methods are still the development trend of the traditional retrieval systems. Image labels, as one of the most popular approaches for the semantic representation of images, can fully capture the representative information of images. To achieve the high performance of retrieval systems, the precise annotation for images becomes inevitable. However, as the massive number of images in the Internet, one cannot annotate all the images without a scalable and flexible (i.e., training-free) annotation method. In this paper, we particularly investigate the problem of accelerating sparse coding based scalable image annotation, whose off-the-shelf solvers are generally inefficient on large-scale dataset. By leveraging the prior that most reconstruction coefficients should be zero, we develop a general and efficient framework to derive an accurate solution to the large-scale sparse coding problem through solving a series of much smaller-scale subproblems. In this framework, an active variable set, which expands and shrinks iteratively, is maintained, with each snapshot of the active variable set corresponding to a subproblem. Meanwhile, the convergence of our proposed framework to global optimum is theoretically provable. To further accelerate the proposed framework, a sub-linear time complexity hashing strategy, e.g.  Locality-Sensitive Hashing , is seamlessly integrated into our framework. Extensive empirical experiments on NUS-WIDE and IMAGENET datasets demonstrate that the orders-of-magnitude acceleration is achieved by the proposed framework for large-scale image annotation, along with zero/negligible accuracy loss for the cases without/with hashing speed-up, compared to the expensive off-the-shelf solvers.", "citation": "Citations (12)", "departments": ["National University of Singapore", "Purdue University", "Singapore Management University", "National University of Singapore"], "authors": ["Junshi Huang.....http://dblp.org/pers/hd/h/Huang:Junshi", "Hairong Liu.....http://dblp.org/pers/hd/l/Liu:Hairong", "Jialie Shen.....http://dblp.org/pers/hd/s/Shen:Jialie", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2013", "pages": 10}