{"title": "Tele echo tube: beyond cultural and imaginable boundaries.", "fields": ["metaphor", "beauty", "umwelt", "multimedia", "meter", "metaverse", "computer vision", "augmented reality", "echo sounding", "elevation"], "abstract": "Currently, human-computer interaction (HCI) is primarily focused on human-centric interactions; however, people experience many nonhuman-centric interactions during the course of a day. Interactions with nature, such as experiencing the sounds of birds or trickling water, can imprint the beauty of nature in our memories. In this context, this paper presents an interface of such nonhuman interactions to observe people's reaction to the interactions through an imaginable interaction with a mythological creature. Tele Echo Tube (TET) is a speaking tube interface that acoustically interacts with a deep mountain echo through the slightly vibrating lampshade-like interface. TET allows users to interact with the mountain echo in real time through an augmented echo-sounding experience with the vibration over a satellite data network. This novel interactive system can create an imaginable presence of the mythological creature in the undeveloped natural locations beyond our cultural and imaginable boundaries. The results indicate that users take the reflection of the sound as a cue that triggers the nonlinguistic believability in the form of the mythological metaphor of the mountain echo. This echo-like experience of believable interaction in an augmented reality between a human and nature gave the users an imaginable presence of the mountain echo with a high degree of excitement. This paper describes the development and integration of nonhuman-centric design protocols, requirements, methods, and context evaluation.", "citation": "Not cited", "departments": ["University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo", "University of Tokyo"], "authors": ["Hill Hiroki Kobayashi.....http://dblp.org/pers/hd/k/Kobayashi:Hill_Hiroki", "Michitaka Hirose.....http://dblp.org/pers/hd/h/Hirose:Michitaka", "Akio Fujiwara.....http://dblp.org/pers/hd/f/Fujiwara:Akio", "Kazuhiko Nakamura.....http://dblp.org/pers/hd/n/Nakamura:Kazuhiko", "Kaoru Sezaki.....http://dblp.org/pers/hd/s/Sezaki:Kaoru", "Kaoru Saito.....http://dblp.org/pers/hd/s/Saito:Kaoru"], "conf": "mm", "year": "2013", "pages": 10}