{"title": "Wisdom in the social crowd: an analysis of quora.", "fields": ["small set", "graph", "the internet", "social graph", "knowledge base"], "abstract": "Efforts such as Wikipedia have shown the ability of user communities to collect, organize and curate information on the Internet. Recently, a number of question and answer (Q&A) sites have successfully built large growing knowledge repositories, each driven by a wide range of questions and answers from its users community. While sites like Yahoo Answers have stalled and begun to shrink, one site still going strong is Quora, a rapidly growing service that augments a regular Q&A system with social links between users. Despite its success, however, little is known about what drives Quora's growth, and how it continues to connect visitors and experts to the right questions as it grows.   In this paper, we present results of a detailed analysis of Quora using measurements. We shed light on the impact of three different connection networks (or graphs) inside Quora, a graph connecting topics to users, a social graph connecting users, and a graph connecting related questions. Our results show that heterogeneity in the user and question graphs are significant contributors to the quality of Quora's knowledge base. One drives the attention and activity of users, and the other directs them to a small set of popular and interesting questions.", "citation": "Citations (125)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Gang Wang.....http://dblp.org/pers/hd/w/Wang_0011:Gang", "Konark Gill.....http://dblp.org/pers/hd/g/Gill:Konark", "Manish Mohanlal.....http://dblp.org/pers/hd/m/Mohanlal:Manish", "Haitao Zheng.....http://dblp.org/pers/hd/z/Zheng:Haitao", "Ben Y. Zhao.....http://dblp.org/pers/hd/z/Zhao:Ben_Y="], "conf": "www", "year": "2013", "pages": 12}