{"title": "Design and optimization of multi-clocked embedded systems using formal technique.", "fields": ["dataflow", "timed automaton", "synchronous data flow", "asynchronous communication", "engineering design process"], "abstract": "Today’s system-on-chip and distributed systems are commonly equipped with multiple clocks. The key challenge in designing such systems is that heterogenous control-oriented and data-oriented behaviors within one clock domain, and asynchronous communications between two clock domains have to be captured and evaluated in a single framework. In this paper, we propose to use timed automata and synchronous dataflow to capture the dynamic behaviors of multi-clock embedded systems. A timed automata and synchronous dataflow based modeling and analyzing framework is constructed to evaluate and optimize the performance of multiclock embedded systems. Data-oriented behaviors are captured by synchronous dataflow, while synchronous control-oriented behaviors are captured by timed automata, and inter clock-domain asynchronous communication can be modeled in an interface timed automaton or a synchronous dataflow module with the CSP mechanism. The behaviors of synchronous dataflow are interpreted by some equivalent timed automata to maintain the semantic consistency of the mixed model. Then, various functional properties can be simulated and verified within the framework. We apply this framework in the design process of a sub-system that is used in real world subway communication control system", "citation": "Citations (4)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Portland State University"], "authors": ["Yu Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Yu", "Zonghui Li.....http://dblp.org/pers/hd/l/Li:Zonghui", "Hehua Zhang.....http://dblp.org/pers/hd/z/Zhang:Hehua", "Yangdong Deng.....http://dblp.org/pers/hd/d/Deng:Yangdong", "Xiaoyu Song.....http://dblp.org/pers/hd/s/Song:Xiaoyu", "Ming Gu.....http://dblp.org/pers/hd/g/Gu_0001:Ming", "Jiaguang Sun.....http://dblp.org/pers/hd/s/Sun:Jiaguang"], "conf": "sigsoft", "year": "2013", "pages": 4}