{"title": "A unified model for stable and temporal topic detection from social media data.", "fields": ["social media", "hidden markov model", "spatial analysis", "mixture model", "smoothing"], "abstract": "Web 2.0 users generate and spread huge amounts of messages in online social media. Such user-generated contents are mixture of temporal topics (e.g., breaking events) and stable topics (e.g., user interests). Due to their different natures, it is important and useful to distinguish temporal topics from stable topics in social media. However, such a discrimination is very challenging because the user-generated texts in social media are very short in length and thus lack useful linguistic features for precise analysis using traditional approaches. In this paper, we propose a novel solution to detect both stable and temporal topics simultaneously from social media data. Specifically, a unified user-temporal mixture model is proposed to distinguish temporal topics from stable topics. To improve this model's performance, we design a regularization framework that exploits prior spatial information in a social network, as well as a burst-weighted smoothing scheme that exploits temporal prior information in the time dimension. We conduct extensive experiments to evaluate our proposal on two real data sets obtained from Del.icio.us and Twitter. The experimental results verify that our mixture model is able to distinguish temporal topics from stable topics in a single detection process. Our mixture model enhanced with the spatial regularization and the burst-weighted smoothing scheme significantly outperforms competitor approaches, in terms of topic detection accuracy and discrimination in stable and temporal topics.", "citation": "Citations (64)", "departments": ["Peking University", "Peking University", "Aalborg University", "Peking University", "Peking University"], "authors": ["Hongzhi Yin.....http://dblp.org/pers/hd/y/Yin:Hongzhi", "Bin Cui.....http://dblp.org/pers/hd/c/Cui_0001:Bin", "Hua Lu.....http://dblp.org/pers/hd/l/Lu_0001:Hua", "Yuxin Huang.....http://dblp.org/pers/hd/h/Huang:Yuxin", "Junjie Yao.....http://dblp.org/pers/hd/y/Yao:Junjie"], "conf": "icde", "year": "2013", "pages": 12}