{"title": "Design space exploration and optimization of path oblivious RAM in secure processors.", "fields": ["distributed computing", "parallel computing", "design space exploration", "overhead", "oblivious ram", "computer science", "theoretical computer science", "spec", "auxiliary memory"], "abstract": "Keeping user data private is a huge problem both in cloud computing and computation outsourcing. One paradigm to achieve data privacy is to use tamper-resistant processors, inside which users' private data is decrypted and computed upon. These processors need to interact with untrusted external memory. Even if we encrypt all data that leaves the trusted processor, however, the address sequence that goes off-chip may still leak information. To prevent this address leakage, the security community has proposed ORAM (Oblivious RAM). ORAM has mainly been explored in server/file settings which assume a vastly different computation model than secure processors. Not surprisingly, naively applying ORAM to a secure processor setting incurs large performance overheads.   In this paper, a recent proposal called Path ORAM is studied. We demonstrate techniques to make Path ORAM practical in a secure processor setting. We introduce background eviction schemes to prevent Path ORAM failure and allow for a performance-driven design space exploration. We propose a concept called super blocks to further improve Path ORAM's performance, and also show an efficient integrity verification scheme for Path ORAM. With our optimizations, Path ORAM overhead drops by 41.8%, and SPEC benchmark execution time improves by 52.4% in relation to a baseline configuration. Our work can be used to improve the security level of previous secure processors.", "citation": "Not cited", "year": "2013", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "isca", "authors": ["Ling Ren.....http://dblp.org/pers/hd/r/Ren_0001:Ling", "Xiangyao Yu.....http://dblp.org/pers/hd/y/Yu:Xiangyao", "Christopher W. Fletcher.....http://dblp.org/pers/hd/f/Fletcher:Christopher_W=", "Marten van Dijk.....http://dblp.org/pers/hd/d/Dijk:Marten_van", "Srinivas Devadas.....http://dblp.org/pers/hd/d/Devadas:Srinivas"], "pages": 12}