{"title": "Ficklebase: Looking into the future to erase the past.", "fields": ["database design", "rendering", "erasure", "digital forensics", "tuple"], "abstract": "It has become apparent that in the digital world data once stored is never truly deleted even when such an expunction is desired either as a normal system function or for regulatory compliance purposes. Forensic Analysis techniques on systems are often successful at recovering information said to have been deleted in the past. Efforts aimed at thwarting such forensic analysis of systems have either focused on (i) identifying the system components where deleted data lingers and performing a secure delete operation over these remnants, or (ii) designing history independent data structures that hide information about past operations which result in the current system state. Yet, new data is constantly derived by processing existing (input) data which makes it increasingly difficult to remove all traces of this existing data, i.e., for regulatory compliance purposes. Even after deletion, significant information can linger in and be recoverable from the side effects the deleted data records left on the currently available state. In this paper we address this aspect in the context of a relational database, such that when combined with (i) & (ii), complete erasure of data and its effects can be achieved (“un-traceable deletion”). We introduce Ficklebase - a relational database wherein once a tuple has been “expired” - any and all its side-effects are removed, thereby eliminating all its traces, rendering it unrecoverable, and also guaranteeing that the deletion itself is undetectable. We present the design and evaluation of Ficklebase, and then discuss several of the fundamental functional implications of un-traceable deletion.", "citation": "Citations (11)", "departments": ["Stony Brook University", "Stony Brook University"], "authors": ["Sumeet Bajaj.....http://dblp.org/pers/hd/b/Bajaj:Sumeet", "Radu Sion.....http://dblp.org/pers/hd/s/Sion:Radu"], "conf": "icde", "year": "2013", "pages": 12}