{"title": "Dense Object Reconstruction with Semantic Priors.", "fields": ["active shape model", "prior probability", "training set", "structure from motion", "point cloud"], "abstract": "We present a dense reconstruction approach that overcomes the drawbacks of traditional multiview stereo by incorporating semantic information in the form of learned category-level shape priors and object detection. Given training data comprised of 3D scans and images of objects from various viewpoints, we learn a prior comprised of a mean shape and a set of weighted anchor points. The former captures the commonality of shapes across the category, while the latter encodes similarities between instances in the form of appearance and spatial consistency. We propose robust algorithms to match anchor points across instances that enable learning a mean shape for the category, even with large shape variations across instances. We model the shape of an object instance as a warped version of the category mean, along with instance-specific details. Given multiple images of an unseen instance, we collate information from 2D object detectors to align the structure from motion point cloud with the mean shape, which is subsequently warped and refined to approach the actual shape. Extensive experiments demonstrate that our model is general enough to learn semantic priors for different object categories, yet powerful enough to reconstruct individual shapes with large variations. Qualitative and quantitative evaluations show that our framework can produce more accurate reconstructions than alternative state-of-the-art multiview stereo systems.", "citation": "Citations (99)", "year": "2013", "departments": ["University of Michigan", "University of Michigan", "NEC Labs. Ameri ... ertino, CA, USA", "NEC Labs. Ameri ... ertino, CA, USA"], "conf": "cvpr", "authors": ["Sid Ying-Ze Bao.....http://dblp.org/pers/hd/b/Bao:Sid_Ying=Ze", "Manmohan Chandraker.....http://dblp.org/pers/hd/c/Chandraker:Manmohan", "Yuanqing Lin.....http://dblp.org/pers/hd/l/Lin:Yuanqing", "Silvio Savarese.....http://dblp.org/pers/hd/s/Savarese:Silvio"], "pages": 8}