{"title": "Exploring Adaptive Reconfiguration to Optimize Energy Efficiency in Large-Scale Battery Systems.", "fields": ["battery", "graph", "voltage regulator", "control reconfiguration", "electric vehicle"], "abstract": "Large-scale battery packs with hundreds/thousands of battery cells are commonly adopted in many emerging cyber-physical systems such as electric vehicles and smart micro-grids. For many applications, the load requirements on the battery systems are dynamic and could significantly change over time. How to resolve the discrepancies between the output power supplied by the battery system and the input power required by the loads is key to the development of large-scale battery systems. Traditionally, voltage regulators are often adopted to convert the voltage outputs to match loads' required input power. Unfortunately, the efficiency of utilizing such voltage regulators degrades significantly when the difference between supplied and required voltages becomes large or the load becomes light. In this paper, we propose to address this problem via an adaptive reconfiguration framework for the battery system. By abstracting the battery system into a graph representation, we develop two adaptive reconfiguration algorithms to identify the desired system configurations dynamically in accordance with real-time load requirements. We extensively evaluate our design with empirical experiments on a prototype battery system, electric vehicle driving trace-based emulation, and battery discharge trace-based simulations. The evaluation results demonstrate that, depending on the system states, our proposed adaptive reconfiguration algorithms are able to achieve 1× to 5× performance improvement with regard to the system operation time.", "citation": "Citations (24)", "year": "2013", "departments": ["Singapore University of Technology and Design", "Shanghai University of Engineering Sciences", "Singapore University of Technology and Design", "Singapore University of Technology and Design", "University of Texas at Dallas"], "conf": "rtss", "authors": ["Liang He.....http://dblp.org/pers/hd/h/He_0002:Liang", "Lipeng Gu.....http://dblp.org/pers/hd/g/Gu:Lipeng", "Linghe Kong.....http://dblp.org/pers/hd/k/Kong:Linghe", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0001:Yu", "Cong Liu.....http://dblp.org/pers/hd/l/Liu_0005:Cong", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "pages": 10}