{"title": "Understanding user behavior at scale in a mobile video chat application.", "fields": ["click through rate", "android", "content analysis", "internet privacy", "mobile search"], "abstract": "Online video chat services such as Chatroulette and Omegle randomly match users in video chat sessions and have become increasingly popular, with tens of thousands of users online at anytime during a day. Our interest is in examining user behavior in the growing domain of mobile video, and in particular how users behave in such video chat services as they are extended onto mobile clients. To date, over four thousand people have downloaded and used our Android-based mobile client, which was developed to be compatible with an existing video chat service. The paper provides a first-ever detailed large scale study of mobile user behavior in a random video chat service over a three week period. This study identifies major characteristics such as mobile user session durations, time of use, demographic distribution and the large number of brief sessions that users click through to find good matches. Through content analysis of video and audio, as well as analysis of texting and clicking behavior, we discover key correlations among these characteristics, e.g., normal mobile users are highly correlated with using the front camera and with the presence of a face, whereas misbehaving mobile users have a high negative correlation with the presence of a face.", "citation": "Citations (3)", "departments": ["University of Colorado Boulder", "University of Colorado Boulder", "University of Colorado Boulder", "Microsoft", "University of Colorado Boulder"], "authors": ["Lei Tian.....http://dblp.org/pers/hd/t/Tian:Lei", "Shaosong Li.....http://dblp.org/pers/hd/l/Li:Shaosong", "Junho Ahn.....http://dblp.org/pers/hd/a/Ahn:Junho", "David Chu.....http://dblp.org/pers/hd/c/Chu:David", "Richard Han.....http://dblp.org/pers/hd/h/Han:Richard", "Qin Lv.....http://dblp.org/pers/hd/l/Lv:Qin", "Shivakant Mishra.....http://dblp.org/pers/hd/m/Mishra:Shivakant"], "conf": "huc", "year": "2013", "pages": 10}