{"title": "Offering supplementary wireless technologies: Adoption behavior and offloading benefits.", "fields": ["externality", "wireless", "femtocell", "mobile broadband", "throughput"], "abstract": "To alleviate the congestion caused by rapid growth in demand for mobile data, ISPs have begun encouraging users to offload some of their traffic onto a supplementary, better quality network technology, e.g., offloading from 3G or 4G to WiFi and femtocells. With the growing popularity of such offerings, a deeper understanding of the underlying economic principles and their impact on technology adoption is necessary. To this end, we develop a model for user adoption of a base wireless technology and a bundle of the base plus a supplementary technology. In our model, individual users make their adoption decisions based on several factors, including the technologies' intrinsic qualities, throughput degradation due to congestion externalities from other subscribers, and the flat access rates that an ISP charges. We study the adoption dynamics and show that they converge to a unique equilibrium for a given set of exogenously determined system parameters. In particular, we characterize the occurrence of interesting adoption behaviors, including a possible decrease in the adoption of the supplementary technology as its coverage increases. Similar behaviors occur at an ISP's profit-maximizing prices and the optimal coverage area for the supplementary technology. To account for the potential benefits from offloading in practice, we collect 3G and WiFi usage and location data from twenty mobile users. We then use this data to numerically investigate the profit-maximizing adoption levels when an ISP accounts for its cost of deploying the supplemental technology and savings from offloading traffic onto this technology.", "citation": "Citations (22)", "departments": ["Princeton University", "Princeton University", "Princeton University"], "authors": ["Carlee Joe-Wong.....http://dblp.org/pers/hd/j/Joe=Wong:Carlee", "Soumya Sen.....http://dblp.org/pers/hd/s/Sen:Soumya", "Sangtae Ha.....http://dblp.org/pers/hd/h/Ha:Sangtae"], "conf": "infocom", "year": "2013", "pages": 9}