{"title": "eHeritage of shadow puppetry: creation and manipulation.", "fields": ["scripting language", "shadow", "manipulator", "animation", "puppetry"], "abstract": "To preserve the precious traditional heritage Chinese shadow puppetry, we propose the puppetry eHeritage, including a creator module and a manipulator module. The creator module accepts a frontal view face image and a profile face image of the user as input, and automatically generates the corresponding puppet, which looks like the original person and meanwhile has some typical characteristics of traditional Chinese shadow puppetry. In order to create the puppet, we first extract the central profile curve and warp the reference puppet eye and eyebrow to the shape of the frontal view eye and eyebrow. Then we transfer the puppet texture to the real face area. The manipulator module can accept the script provided by the user as input and automatically generate the motion sequences. Technically, we first learn atomic motions from a set of shadow puppetry videos. A scripting system converts the user's input to atomic motions, and finally synthesizes the animation based on the atomic motion instances. For better visual effects, we propose the sparsity optimization over simplexes formulation to automatically assemble weighted instances of different atomic actions into a smooth shadow puppetry animation sequence. We evaluate the performance of the creator module and the manipulator module sequentially. Extensive experimental results on the creation of puppetry characters and puppetry plays well demonstrate the effectiveness of the proposed system.", "citation": "Citations (3)", "departments": ["National University of Singapore", "Hefei University of Technology", "National University of Singapore", "Hefei University of Technology", "Hefei University of Technology"], "authors": ["Min Lin.....http://dblp.org/pers/hd/l/Lin:Min", "Zhenzhen Hu.....http://dblp.org/pers/hd/h/Hu:Zhenzhen", "Si Liu.....http://dblp.org/pers/hd/l/Liu_0001:Si", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2013", "pages": 10}