{"title": "An experimental study of data retention behavior in modern DRAM devices: implications for retention time profiling mechanisms.", "fields": ["data retention", "dram", "profiling", "data loss", "parallel computing"], "abstract": "DRAM cells store data in the form of charge on a capacitor. This charge leaks off over time, eventually causing data to be lost. To prevent this data loss from occurring, DRAM cells must be periodically refreshed. Unfortunately, DRAM refresh operations waste energy and also degrade system performance by interfering with memory requests. These problems are expected to worsen as DRAM density increases.   The amount of time that a DRAM cell can safely retain data without being refreshed is called the cell's  retention time . In current systems, all DRAM cells are refreshed at the rate required to guarantee the integrity of the cell with the shortest retention time, resulting in unnecessary refreshes for cells with longer retention times. Prior work has proposed to reduce unnecessary refreshes by exploiting differences in retention time among DRAM cells; however, such mechanisms require knowledge of each cell's retention time.   In this paper, we present a comprehensive quantitative study of retention behavior in modern DRAMs. Using a temperature-controlled FPGA-based testing platform, we collect retention time information from 248 commodity DDR3 DRAM chips from five major DRAM vendors. We observe two significant phenomena:  data pattern dependence , where the retention time of each DRAM cell is significantly affected by the data stored in other DRAM cells, and  variable retention time , where the retention time of some DRAM cells changes unpredictably over time. We discuss possible physical explanations for these phenomena, how their magnitude may be affected by DRAM technology scaling, and their ramifications for DRAM retention time profiling mechanisms.", "citation": "Citations (202)", "year": "2013", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Intel", "Carnegie Mellon University"], "conf": "isca", "authors": ["Jamie Liu.....http://dblp.org/pers/hd/l/Liu:Jamie", "Ben Jaiyen.....http://dblp.org/pers/hd/j/Jaiyen:Ben", "Yoongu Kim.....http://dblp.org/pers/hd/k/Kim:Yoongu", "Chris Wilkerson.....http://dblp.org/pers/hd/w/Wilkerson:Chris", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur"], "pages": 12}