{"title": "RT-WiFi: Real-Time High-Speed Communication Protocol for Wireless Cyber-Physical Control Applications.", "fields": ["wireless lan controller", "capwap", "wireless transport layer security", "neurfon", "inter access point protocol"], "abstract": "Applying wireless technologies in control systems can significantly enhance the system mobility and reduce the deployment and maintenance cost. Existing wireless technology standards, however either cannot provide real-time guarantee on packet delivery or are not fast enough to support high-speed control systems which typically require 1kHz or higher sampling rate. Nondeterministic packet transmission and insufficiently high sampling rate will severely hurt the control performance. To address this problem, in this paper, we present our design and implementation of a real-time high-speed wireless communication protocol called RT-WiFi. RT-WiFi is a TDMA data link layer protocol based on IEEE 802.11 physical layer to provide deterministic timing guarantee on packet delivery and high sampling rate up to 6kHz. It incorporates configurable components for adjusting design trade-offs including sampling rate, latency variance, reliability, and compatibility to existing Wi-Fi networks, thus can serve as an ideal communication platform for supporting a wide range of high-speed wireless control systems. We implemented RT-WiFi on commercial off-the-shelf hardware and integrated it into a mobile gait rehabilitation system. Our extensive experiments demonstrate the effectiveness of RT-WiFi in providing deterministic packet delivery in both data link layer and application layer, which further eases the controller design and significantly improve the control performance.", "citation": "Citations (68)", "year": "2013", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Connecticut", "University of Texas at Austin", "University of California, Berkeley"], "conf": "rtss", "authors": ["Yi-Hung Wei.....http://dblp.org/pers/hd/w/Wei:Yi=Hung", "Quan Leng.....http://dblp.org/pers/hd/l/Leng:Quan", "Song Han.....http://dblp.org/pers/hd/h/Han:Song", "Aloysius K. Mok.....http://dblp.org/pers/hd/m/Mok:Aloysius_K=", "Wenlong Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenlong", "Masayoshi Tomizuka.....http://dblp.org/pers/hd/t/Tomizuka:Masayoshi"], "pages": 10}