{"title": "Fault tolerant complex event detection in WSNs: A case study in structural health monitoring.", "fields": ["distributed algorithm", "feature vector", "wireless sensor network", "structural health monitoring", "scalar", "dynamic data", "condition monitoring", "fault tolerance"], "abstract": "Fault-tolerant event detection (FTED), whose objective is to correctly detect events of interest in the presence of faulty nodes, remains to be one of the hot research areas in wireless sensor networks (WSNs). However, many recently emerged ‘domain-specific’ applications of WSNs, such as structural health monitoring (SHM) and volcano monitoring, have shown some distinct features from traditional WSN applications. For example, data collected each time from sensor nodes is not a scalar but a long dynamic data sequence. In addition, detecting an event in these applications generally requires low-level collaboration of multiple sensors. As a consequence, existing FTED schemes usually cannot work well in these applications. In this paper, we realize FTED in a typical domain-specific application of WSNs: SHM. The main contribution of this work is I-FUND, a faulty node detection algorithm that takes feature vectors as input and can even handle the ‘element mismatch problem’ where comparable elements in vectors are located at unknown different positions. In addition, I-FUND adopts adaptive stop criterion identified from data and turns out to be reliable even when a large percentage of the sensor nodes report erroneous observations. The effectiveness of the proposed scheme is demonstrated through both simulations and real experiments.", "citation": "Citations (5)", "departments": ["Huazhong University of Science and Technology", "Hong Kong Polytechnic University", "University of Texas at Dallas", "Huazhong University of Science and Technology", "Illinois Institute of Technology", "Dept. of Comput ... ong Kong, China", "Dept. of Comput ... ong Kong, China"], "authors": ["Xuefeng Liu.....http://dblp.org/pers/hd/l/Liu:Xuefeng", "Jiannong Cao.....http://dblp.org/pers/hd/c/Cao:Jiannong", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie"], "conf": "infocom", "year": "2013", "pages": 9}