{"title": "Sustainable energy consumption monitoring in residential settings.", "fields": ["demand response", "energy consumption", "brute force search", "meter", "heuristic"], "abstract": "The continuous growth of energy needs and the fact that unpredictable energy demand is mostly served by unsustainable (i.e. fossil-fuel) power generators have given rise to the development of Demand Response (DR) mechanisms for flattening energy demand. Building effective DR mechanisms and user awareness on power consumption can significantly benefit from fine-grained monitoring of user consumption at the appliance level. However, installing and maintaining such a monitoring infrastructure in residential settings can be quite expensive. In this paper, we study the problem of fine-grained appliance power-consumption monitoring based on one house-level meter and few plug-level meters. We explore the trade-off between monitoring accuracy and cost, and exhaustively find the minimum subset of plug-level meters that maximize accuracy. As exhaustive search is time- and resource-consuming, we define a heuristic approach that finds the optimal set of plug-level meters without utilizing any other sets of plug-level meters. Based on experiments with real data, we found that few plug-level meters - when appropriately placed - can very accurately disaggregate the total real power consumption of a residential setting and verified the effectiveness of our heuristic approach.", "citation": "Citations (17)", "departments": ["École Normale Supérieure", "École Normale Supérieure", "IBM", "École Normale Supérieure"], "authors": ["S. N. Akshay Uttama Nambi.....http://dblp.org/pers/hd/n/Nambi:S=_N=_Akshay_Uttama", "Thanasis G. Papaioannou.....http://dblp.org/pers/hd/p/Papaioannou:Thanasis_G=", "Dipanjan Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty_0001:Dipanjan", "Karl Aberer.....http://dblp.org/pers/hd/a/Aberer:Karl"], "conf": "infocom", "year": "2013", "pages": 6}