{"title": "An efficient and compact indexing scheme for large-scale data store.", "fields": ["distributed database", "bitmap index", "distributed file system", "speedup", "bitmap"], "abstract": "The amount of data managed in today's Cloud systems has reached an unprecedented scale. In order to speed up query processing, an effective mechanism is to build indexes on attributes that are used in query predicates. However, conventional indexing schemes fail to provide a scalable service: as the size of these indexes are proportional to the data size, it is not space efficient to build many indexes. As such, it becomes more crucial to develop effective index to provide scalable database services in the Cloud. In this paper, we propose a compact bitmap indexing scheme for a large-scale data store. The bitmap indexing scheme combines state-of-the-art bitmap compression techniques, such as WAH encoding and bit-sliced encoding. To further reduce the index cost, a novel and query efficient partial indexing technique is adopted, which dynamically refreshes the index to handle updates and process queries. The intuition of our indexing approach is to maximize the number of indexed attributes, so that a wider range of queries, including range and join queries, can be efficiently supported. Our indexing scheme is light-weight and its creation can be seamlessly grafted onto the MapReduce processing engine without incurring significant running cost. Moreover, the compactness allows us to maintain the bitmap indexes in memory so that performance overhead of index access is minimal. We implement our indexing scheme on top of the underlying Distributed File System (DFS) and evaluate its performance on an in-house cluster. We compare our index-based query processing with HadoopDB to show its superior performance. Our experimental results confirm the effectiveness, efficiency and scalability of the indexing scheme.", "citation": "Citations (15)", "departments": ["National University of Singapore", "Zhejiang University", "Zhejiang University", "National University of Singapore"], "authors": ["Peng Lu.....http://dblp.org/pers/hd/l/Lu:Peng", "Sai Wu.....http://dblp.org/pers/hd/w/Wu:Sai", "Lidan Shou.....http://dblp.org/pers/hd/s/Shou:Lidan", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee"], "conf": "icde", "year": "2013", "pages": 12}