{"title": "Delegatable pseudorandom functions and applications.", "fields": ["functional encryption", "cryptographic primitive", "pseudorandomness", "pseudorandom number generator", "pseudorandom function family", "computer science", "discrete mathematics", "pseudorandom generator theorem"], "abstract": "We put forth the problem of delegating the evaluation of a pseudorandom function (PRF) to an untrusted proxy and introduce a novel cryptographic primitive called delegatable pseudorandom functions, or DPRFs for short: A DPRF enables a proxy to evaluate a pseudorandom function on a strict subset of its domain using a trapdoor derived from the DPRF secret key. The trapdoor is constructed with respect to a certain policy predicate that determines the subset of input values which the proxy is allowed to compute. The main challenge in constructing DPRFs is to achieve bandwidth efficiency (which mandates that the trapdoor is smaller than the precomputed sequence of the PRF values conforming to the predicate), while maintaining the pseudorandomness of unknown values against an attacker that adaptively controls the proxy. A DPRF may be optionally equipped with an additional property we call policy privacy, where any two delegation predicates remain indistinguishable in the view of a DPRF-querying proxy: achieving this raises new design challenges as policy privacy and bandwidth efficiency are seemingly conflicting goals.   For the important class of policy predicates described as (1-dimensional) ranges, we devise two DPRF constructions and rigorously prove their security. Built upon the well-known tree-based GGM PRF family, our constructions are generic and feature only logarithmic delegation size in the number of values conforming to the policy predicate. At only a constant-factor efficiency reduction, we show that our second construction is also policy private. Finally, we describe that their new security and efficiency properties render our DPRF schemes particularly useful in numerous security applications, including RFID, symmetric searchable encryption, and broadcast encryption.", "citation": "Not cited", "year": "2013", "departments": ["Hong Kong University of Science and Technology", "National and Ka ...  Athens, Greece", "RSA Laboratorie ... sachusetts, USA", "National and Ka ...  Athens, Greece"], "conf": "ccs", "authors": ["Aggelos Kiayias.....http://dblp.org/pers/hd/k/Kiayias:Aggelos", "Stavros Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos_0001:Stavros", "Nikos Triandopoulos.....http://dblp.org/pers/hd/t/Triandopoulos:Nikos", "Thomas Zacharias.....http://dblp.org/pers/hd/z/Zacharias_0001:Thomas"], "pages": 16}