{"title": "Towards realistic team formation in social networks based on densest subgraphs.", "fields": ["linear programming relaxation", "social network analysis", "cardinality", "social network", "locality"], "abstract": "Given a task  T , a set of experts  V  with multiple skills and a social network  G ( V ,  W ) reflecting the compatibility among the experts,  team formation  is the problem of identifying a team  C  ?  V  that is both competent in performing the task  T  and compatible in working together. Existing methods for this problem make too restrictive assumptions and thus cannot model practical scenarios. The goal of this paper is to consider the team formation problem in a realistic setting and present a novel formulation based on densest subgraphs. Our formulation allows modeling of many natural requirements such as (i) inclusion of a designated team leader and/or a group of given experts, (ii) restriction of the size or more generally cost of the team (iii) enforcing  locality  of the team, e.g., in a geographical sense or social sense, etc. The proposed formulation leads to a generalized version of the classical densest subgraph problem with cardinality constraints (DSP), which is an NP hard problem and has many applications in social network analysis. In this paper, we present a new method for (approximately) solving the generalized DSP (GDSP). Our method,  FORTE,  is based on solving an  equivalent  continuous relaxation of GDSP. The solution found by our method has a quality guarantee and always satisfies the constraints of GDSP. Experiments show that the proposed formulation (GDSP) is useful in modeling a broader range of team formation problems and that our method produces more coherent and compact teams of high quality. We also show, with the help of an LP relaxation of GDSP, that our method gives close to optimal solutions to GDSP.", "citation": "Citations (58)", "departments": ["Max Planck Society", "Saarland University", "Saarland University"], "authors": ["Syama Sundar Rangapuram.....http://dblp.org/pers/hd/r/Rangapuram:Syama_Sundar", "Thomas Bühler.....http://dblp.org/pers/hd/b/B=uuml=hler:Thomas", "Matthias Hein.....http://dblp.org/pers/hd/h/Hein_0001:Matthias"], "conf": "www", "year": "2013", "pages": 12}