{"title": "Scaling network-based spectrum analyzer with constant communication cost.", "fields": ["wideband", "spectrum analyzer", "cognitive radio", "fast fourier transform", "compressed sensing"], "abstract": "We propose a spectrum analyzer that leverages many networked commodity sensor nodes, each of which samples its portion in a wideband spectrum. The sensors operate in parallel and transmit their measurements over a wireless network without performing any significant computations such as FFT. The measurements are forwarded to the backend of the system where spectrum analysis takes place. In particular, we propose a solution that compresses the raw measurements in a simple random linear projection and combines the compressed measurements from multiple sensors in-network. As a result, we achieve a substantial reduction in the network bandwidth requirement to operate the proposed system. We discover that the overall communication cost can be independent of the number of sensors and is affected only by sparsity of discretized spectrum under analysis. This principle founds the basis for a claim that our network-based spectrum analyzer can scale up the number of sensor nodes to process a very wide spectrum block potentially having a GHz bandwidth. We devise a novel recovery algorithm that systematically undoes compressive encoding and in-network combining done to the raw measurements, incorporating the least squares and I1-minimization decoding used in compressive sensing, and demonstrate that the algorithm can effectively restore an accurate estimate of the original data suitable for finegrained spectrum analysis. We present mathematical analysis and empirical evaluation of the system with software-defined radios.", "citation": "Citations (1)", "departments": ["Harvard University", "Harvard University"], "authors": ["Youngjune Gwon.....http://dblp.org/pers/hd/g/Gwon:Youngjune", "H. T. Kung.....http://dblp.org/pers/hd/k/Kung:H=_T="], "conf": "infocom", "year": "2013", "pages": 9}