{"title": "SoK: P2PWNED - Modeling and Evaluating the Resilience of Peer-to-Peer Botnets.", "fields": ["network security", "single point of failure", "law enforcement", "botnet", "peer to peer"], "abstract": "Centralized botnets are easy targets for takedown efforts by computer security researchers and law enforcement. Thus, botnet controllers have sought new ways to harden the infrastructures of their botnets. In order to meet this objective, some botnet operators have (re)designed their botnets to use Peer-to-Peer (P2P) infrastructures. Many P2P botnets are far more resilient to takedown attempts than centralized botnets, because they have no single points of failure. However, P2P botnets are subject to unique classes of attacks, such as node enumeration and poisoning. In this paper, we introduce a formal graph model to capture the intrinsic properties and fundamental vulnerabilities of P2P botnets. We apply our model to current P2P botnets to assess their resilience against attacks. We provide assessments on the sizes of all eleven active P2P botnets, showing that some P2P botnet families contain over a million bots. In addition, we have prototyped several mitigation strategies to measure the resilience of existing P2P botnets. We believe that the results from our analysis can be used to assist security researchers in evaluating mitigation strategies against current and future P2P botnets.", "citation": "Citations (143)", "departments": ["VU University Amsterdam", "University of California, Santa Barbara", "Fraunhofer Society", "Inst. for Inter ... irchen, Germany"], "authors": ["Christian Rossow.....http://dblp.org/pers/hd/r/Rossow:Christian", "Dennis Andriesse.....http://dblp.org/pers/hd/a/Andriesse:Dennis", "Tillmann Werner.....http://dblp.org/pers/hd/w/Werner:Tillmann", "Brett Stone-Gross.....http://dblp.org/pers/hd/s/Stone=Gross:Brett", "Daniel Plohmann.....http://dblp.org/pers/hd/p/Plohmann:Daniel", "Christian J. Dietrich.....http://dblp.org/pers/hd/d/Dietrich:Christian_J=", "Herbert Bos.....http://dblp.org/pers/hd/b/Bos:Herbert"], "conf": "sp", "year": "2013", "pages": 15}