{"title": "Voluntary turnover in a distributed work setting: an examination of the role of spatial propinquity and role similarity in project affiliation networks.", "fields": ["social network analysis", "feeling", "propinquity", "project team", "embeddedness"], "abstract": "Project affiliation networks (i.e., individuals connected through common project team memberships) create fruitful junctures to understand how individuals are connected to others in their social contexts, especially in distributed organizations. Advances in technology-mediated environments further help individuals develop connections with their colleagues who may or may not be collocated. This embeddedness creates inertial pressures on individuals and constrains them to conform to firm norms and thus stay with the firm. In this paper, we examine whether ties to those who quit the firm can trump the feeling of connection to the firm and thus motivate subsequent quit decisions. We argue that individuals with a greater number of defectors in their project affiliation networks are more likely than others to leave the firm and the influence on those focal individuals will be higher when they are collocated and occupy similar professional roles as the affiliated defectors. We analyze complete project affiliation data linking 728 geographically distributed employees at a multi-national high technology firm across five years to test these arguments. During this time 183 employees voluntarily left the firm. The findings support our arguments and suggest that project affiliation networks in such settings occasion social comparisons among employees and serve as conduits for the diffusion of their career mobility decisions. We discuss the implications of our work for managing voluntary turnover in knowledge intensive distributed organizations.", "citation": "Citations (1)", "departments": ["Infosys", "University of Kentucky", "University of Kentucky"], "authors": ["Gopakumar M. Gopalakrishnan.....http://dblp.org/pers/hd/g/Gopalakrishnan:Gopakumar_M=", "Daniel S. Halgin.....http://dblp.org/pers/hd/h/Halgin:Daniel_S=", "Stephen P. Borgatti.....http://dblp.org/pers/hd/b/Borgatti:Stephen_P="], "conf": "cscw", "year": "2013", "pages": 12}