{"title": "Efficient Learning in Linearly Solvable MDP Models.", "fields": ["speed learning", "reinforcement learning", "markov decision process", "stochastic matrix", "subclass"], "abstract": "Linearly solvable Markov Decision Process (MDP) models are a powerful subclass of problems with a simple structure that allow the policy to be written directly in terms of the uncontrolled (passive) dynamics of the environment and the goals of the agent. However, there have been no learning algorithms for this class of models. In this research, we develop a robust learning approach to linearly solvable MDPs. To exploit the simple solution for general problems, we show how to construct passive dynamics from any transition matrix, use Bayesian updating to estimate the model parameters and apply approximate and efficient Bayesian exploration to speed learning. In addition, we reduce the computational cost of learning using intermittent Bayesian updating and policy solving. We also gave a polynomial theoretical time complexity bound for the convergence of our learning algorithm, and demonstrate a linear bound for the subclass of the reinforcement learning problems with the property that the transition error depends only on the agent itself. Test results for our algorithm in a grid world are presented, comparing our algorithm with the BEB algorithm. The results showed that our algorithm learned more than the BEB algorithm without losing convergence speed, so that the advantage of our algorithm increased as the environment got more complex. We also showed that our algorithm's performance is more stable after convergence. Finally, we show how to apply our approach to the Cellular Telephones problem by defining the passive dynamics.", "citation": "Citations (3)", "year": "2013", "departments": ["University of Minnesota", "University of Minnesota"], "conf": "ijcai", "authors": ["Ang Li.....http://dblp.org/pers/hd/l/Li:Ang", "Paul R. Schrater.....http://dblp.org/pers/hd/s/Schrater:Paul_R="], "pages": 6}