{"title": "ε-Approximation to data streams in sensor networks.", "fields": ["mobile wireless sensor network", "online algorithm", "time complexity", "key distribution in wireless sensor networks", "data stream mining"], "abstract": "The rapid development in processor, memory, and radio technology have contributed to the furtherance of decentralized sensor networks of small, inexpensive nodes that are capable of sensing, computation, and wireless communication. Due to the characteristic of limited communication bandwidth and other resource constraints of sensor networks, an important and practical demand is to compress time series data generated by sensor nodes with precision guarantee in an online manner. Although a large number of data compression algorithms have been proposed to reduce data volume, their offline characteristic or super-linear time complexity prevents them from being applied directly on time series data generated by sensor nodes. To remedy the deficiencies of previous methods, we propose an optimal online algorithm GDPLA for constructing a disconnected piecewise linear approximation representation of a time series which guarantees that the vertical distance between each real data point and the corresponding fit line is less than or equal to e. GDPLA not only generates the minimum number of segments to approximate a time series with precision guarantee, but also only requires linear time O(n) bounded by a constant coefficient 6, where unit 1 denotes the time complexity of comparing the slopes of two lines. The low cost characteristic of our method makes it the popular choice for resource-constrained sensor networks. Extensive experiments on a real dataset have been conducted to demonstrate the superior compression performance of our approach.", "citation": "Citations (3)", "departments": ["Harbin Institute of Technology", "Harbin Institute of Technology", "Harbin Institute of Technology"], "authors": ["Guohua Li.....http://dblp.org/pers/hd/l/Li:Guohua", "Jianzhong Li.....http://dblp.org/pers/hd/l/Li:Jianzhong", "Hong Gao.....http://dblp.org/pers/hd/g/Gao:Hong"], "conf": "infocom", "year": "2013", "pages": 9}