{"title": "Cache-Aware Compositional Analysis of Real-Time Multicore Virtualization Platforms.", "fields": ["static timing analysis", "cache", "virtualization", "multi core processor", "cost reduction", "full virtualization"], "abstract": "Multicore processors are becoming ubiquitous, and it is becoming increasingly common to run multiple real-time systems on a shared multicore platform. While this trend helps to reduce cost and to increase performance, it also makes it more challenging to achieve timing guarantees and functional isolation. One approach to achieving functional isolation is to use virtualization. However, virtualization also introduces many challenges to the multicore timing analysis, for instance, the overhead due to cache misses becomes harder to predict, since it depends not only on the direct interference between tasks but also on the indirect interference between virtual processors and the tasks executing on them. In this paper, we present a cache-aware compositional analysis technique that can be used to ensure timing guarantees of components scheduled on a multicore virtualization platform. Our technique improves on previous multicore compositional analyses by accounting for the cache-related overhead in the components' interfaces, and it addresses the new virtualization-specific challenges in the overhead analysis. To demonstrate the utility of our technique, we report results from an extensive evaluation based on randomly generated workloads.", "citation": "Citations (29)", "year": "2013", "departments": ["University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "Washington University in St. Louis", "University of Pennsylvania", "University of Pennsylvania", "University of Pennsylvania", "Washington University in St. Louis", "Washington University in St. Louis"], "conf": "rtss", "authors": ["Meng Xu.....http://dblp.org/pers/hd/x/Xu:Meng", "Linh T. X. Phan.....http://dblp.org/pers/hd/p/Phan:Linh_T=_X=", "Insup Lee.....http://dblp.org/pers/hd/l/Lee:Insup", "Oleg Sokolsky.....http://dblp.org/pers/hd/s/Sokolsky:Oleg", "Sisu Xi.....http://dblp.org/pers/hd/x/Xi:Sisu", "Chenyang Lu.....http://dblp.org/pers/hd/l/Lu:Chenyang", "Christopher D. Gill.....http://dblp.org/pers/hd/g/Gill:Christopher_D="], "pages": 10}