{"title": "Leakage-Resilient Cryptography from Minimal Assumptions.", "fields": ["algebraic number", "cryptography", "cryptosystem", "pseudorandom number generator", "key size", "computer science", "encryption", "arbitrarily large", "leakage", "theoretical computer science"], "abstract": "We present new constructions of leakage-resilient cryptosystems, which remain provably secure even if the attacker learns some arbitrary partial information about their internal secret key. For any polynomial l, we can instantiate these schemes so as to tolerate up to l bits of leakage. While there has been much prior work constructing such leakage-resilient cryptosystems under concrete number-theoretic and algebraic assumptions, we present the first schemes under general and minimal assumptions. In particular, we construct: \n\n\nLeakage-resilient public-key encryption from any standard public-key encryption.\n\n\nLeakage-resilient weak pseudorandom functions, symmetric-key encryption, and message-authentication codes from any one-way function.\n\n\n\nThese are the first constructions of leakage-resilient symmetric-key primitives that do not rely on public-key assumptions. We also get the first constructions of leakage-resilient public-key encryption from “search assumptions”, such as the hardness of factoring or CDH. Although our schemes can tolerate arbitrarily large amounts of leakage, the tolerated rate of leakage (defined as the ratio of leakage-amount to key-size) is rather poor in comparison to prior results under specific assumptions.", "citation": "Not cited", "year": "2013", "departments": ["Bar-Ilan University", "New York University", "George Washington University", "Northeastern University", "Bar-Ilan University", "New York University", "École Normale Supérieure", "Northeastern University"], "conf": "eurocrypt", "authors": ["Carmit Hazay.....http://dblp.org/pers/hd/h/Hazay:Carmit", "Adriana López-Alt.....http://dblp.org/pers/hd/l/L=oacute=pez=Alt:Adriana", "Hoeteck Wee.....http://dblp.org/pers/hd/w/Wee:Hoeteck", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "pages": 17}