{"title": "The constrained Ski-Rental problem and its application to online cloud cost optimization.", "fields": ["renting", "cache", "ski rental problem", "competitive analysis", "web application"], "abstract": "Cloud service providers (CSPs) enable tenants to elastically scale their resources to meet their demands. In fact, there are various types of resources offered at various price points. While running applications on the cloud, a tenant aiming to minimize cost is often faced with crucial trade-off considerations. For instance, upon each arrival of a query, a web application can either choose to pay for CPU to compute the response fresh, or pay for cache storage to store the response so as to reduce the compute costs of future requests. The SkiRental problem abstracts such scenarios where a tenant is faced with a to-rent-or-to-buy trade-off; in its basic form, a skier should choose between renting or buying a set of skis without knowing the number of days she will be skiing. In this paper, we introduce a variant of the classical SkiRental problem in which we assume that the skier knows the first (or second) moment of the distribution of the number of ski days in a season. We demonstrate that utilizing this information leads to achieving the best worst-case expected competitive ratio (CR) performance. Our method yields a new class of randomized algorithms that provide arrivals-distribution-free performance guarantees. Further, we apply our solution to a cloud file system and demonstrate the cost savings obtained in comparison to other competing schemes. Simulations illustrate that our scheme exhibits robust average-cost performance that combines the best of the well-known deterministic and randomized schemes previously proposed to tackle the Ski-Rental problem.", "citation": "Citations (15)", "departments": ["University of Illinois at Urbana–Champaign", "Bell Labs", "Bell Labs"], "authors": ["Ali Khanafer.....http://dblp.org/pers/hd/k/Khanafer_0002:Ali", "Murali S. Kodialam.....http://dblp.org/pers/hd/k/Kodialam:Murali_S=", "Krishna P. N. Puttaswamy.....http://dblp.org/pers/hd/p/Puttaswamy:Krishna_P=_N="], "conf": "infocom", "year": "2013", "pages": 9}