{"title": "An empirical analysis of the co-evolution of schema and code in database applications.", "fields": ["database model", "database testing", "view", "schema migration", "physical data model"], "abstract": "Modern database applications are among the most widely used and complex software systems. They constantly evolve, responding to changes to data, database schemas, and code. It is challenging to manage these changes and ensure that everything co-evolves consistently. For example, when a database schema is modified, all the code that interacts with the database must be changed accordingly. Although database evolution and software evolution have been extensively studied in isolation, the co-evolution of schema and code has largely been unexplored.     This paper presents the first comprehensive empirical analysis of the co-evolution of database schemas and code in ten popular large open-source database applications, totaling over 160K revisions. Our major findings include: 1) Database schemas evolve frequently during the application lifecycle, exhibiting a variety of change types with similar distributions across the studied applications; 2) Overall, schema changes induce significant code-level modifications, while certain change types have more impact on code than others; and 3) Co-change analyses can be viable to automate or assist with database application evolution. We have also observed that: 1) 80% of the schema changes happened in 20-30% of the tables, while nearly 40% of the tables did not change; and 2) Referential integrity constraints and stored procedures are rarely used in our studied subjects. We believe that our study reveals new insights into how database applications evolve and useful guidelines for designing assistive tools to aid their evolution.", "citation": "Citations (53)", "departments": ["Southeast University", "Southeast University", "University of California, Davis"], "authors": ["Dong Qiu.....http://dblp.org/pers/hd/q/Qiu:Dong", "Bixin Li.....http://dblp.org/pers/hd/l/Li:Bixin", "Zhendong Su.....http://dblp.org/pers/hd/s/Su:Zhendong"], "conf": "sigsoft", "year": "2013", "pages": 11}