{"title": "Identifying Useful Human Correction Feedback from an On-Line Machine Translation Service.", "fields": ["example based machine translation", "binary classification", "simple features", "phrase", "rule based machine translation"], "abstract": "Post-editing feedback provided by users of on-line translation services offers an excellent opportunity for automatic improvement of statistical machine translation (SMT) systems. However, feedback provided by casual users is very noisy, and must be automatically filtered in order to identify the potentially useful cases. We present a study on automatic feedback filtering in a real weblog collected from Reverso.net. We extend and re-annotate a training corpus, define an extended set of simple features and approach the problem as a binary classification task, experimenting with linear and kernel-based classifiers and feature selection. Results on the feedback filtering task show a significant improvement over the majority class, but also a precision ceiling around 70-80%. This reflects the inherent difficulty of the problem and indicates that shallow features cannot fully capture the semantic nature of the problem. Despite the modest results on the filtering task, the classifiers are proven effective in an application-based evaluation. The incorporation of a filtered set of feedback instances selected from a larger corpus significantly improves the performance of a phrase-based SMT system, according to a set of standard evaluation metrics.", "citation": "Citations (4)", "year": "2013", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia"], "conf": "ijcai", "authors": ["Alberto Barrón-Cedeño.....http://dblp.org/pers/hd/b/Barr=oacute=n=Cede=ntilde=o:Alberto", "Lluís Màrquez.....http://dblp.org/pers/hd/m/M=agrave=rquez:Llu=iacute=s", "Carlos A. Henríquez Q......http://dblp.org/pers/hd/q/Q=:Carlos_A=_Henr=iacute=quez", "Lluís Formiga.....http://dblp.org/pers/hd/f/Formiga:Llu=iacute=s", "Enrique Romero.....http://dblp.org/pers/hd/r/Romero:Enrique", "Jonathan May.....http://dblp.org/pers/hd/m/May:Jonathan"], "pages": 7}