{"title": "ElasticSwitch: practical work-conserving bandwidth guarantees for cloud computing.", "fields": ["hypervisor", "spare part", "resource", "controller", "testbed"], "abstract": "While cloud computing providers offer guaranteed allocations for resources such as CPU and memory, they do not offer any guarantees for network resources. The lack of network guarantees prevents tenants from predicting lower bounds on the performance of their applications. The research community has recognized this limitation but, unfortunately, prior solutions have significant limitations: either they are inefficient, because they are not work-conserving, or they are impractical, because they require expensive switch support or congestion-free network cores.   In this paper, we propose ElasticSwitch, an efficient and practical approach for providing bandwidth guarantees. ElasticSwitch is efficient because it utilizes the spare bandwidth from unreserved capacity or underutilized reservations. ElasticSwitch is practical because it can be fully implemented in hypervisors, without requiring a specific topology or any support from switches. Because hypervisors operate mostly independently, there is no need for complex coordination between them or with a central controller. Our experiments, with a prototype implementation on a 100-server testbed, demonstrate that ElasticSwitch provides bandwidth guarantees and is work-conserving, even in challenging situations.", "citation": "Citations (151)", "departments": ["Hewlett-Packard", "Hewlett-Packard", "Google", "Hewlett-Packard", "Avi Networks, S ... nyvale, CA, USA"], "authors": ["Lucian Popa.....http://dblp.org/pers/hd/p/Popa_0002:Lucian", "Praveen Yalagandula.....http://dblp.org/pers/hd/y/Yalagandula:Praveen", "Sujata Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Sujata", "Jeffrey C. Mogul.....http://dblp.org/pers/hd/m/Mogul:Jeffrey_C=", "Yoshio Turner.....http://dblp.org/pers/hd/t/Turner:Yoshio", "Jose Renato Santos.....http://dblp.org/pers/hd/s/Santos:Jose_Renato"], "conf": "sigcomm", "year": "2013", "pages": 12}