{"title": "Sometimes when we touch: how arm embodiments change reaching and collaboration on digital tables.", "fields": ["negotiation", "collaborative software", "embodied cognition", "workspace", "design elements and principles"], "abstract": "In tabletop work with direct input, people avoid crossing each others' arms. This natural touch avoidance has important consequences for coordination: for example, people rarely grab the same item simultaneously, and negotiate access to the workspace via turn-taking. At digital tables, however, some situations require the use of indirect input (e.g., large tables or remote participants), and in these cases, people are often represented with virtual arm embodiments. There is little information about what happens to coordination and reaching when we move from physical to digital arm embodiments. To gather this information, we carried out a controlled study of tabletop behaviour with different embodiments. We found dramatic differences in moving to a digital embodiment: people touch and cross with virtual arms far more than they do with real arms, which removes a natural coordination mechanism in tabletop work. We also show that increasing the visual realism of the embodiment does not change behaviour, but that changing the thickness has a minor effect. Our study identifies important design principles for virtual embodiments in tabletop groupware, and adds to our understanding of embodied interaction in small groups.", "citation": "Citations (20)", "departments": ["University of Saskatchewan", "University of Saskatchewan", "University of Saskatchewan", "University of St Andrews", "University of Saskatchewan"], "authors": ["Andre Doucette.....http://dblp.org/pers/hd/d/Doucette:Andre", "Carl Gutwin.....http://dblp.org/pers/hd/g/Gutwin:Carl", "Regan L. Mandryk.....http://dblp.org/pers/hd/m/Mandryk:Regan_L=", "Miguel A. Nacenta.....http://dblp.org/pers/hd/n/Nacenta:Miguel_A=", "Sunny Sharma.....http://dblp.org/pers/hd/s/Sharma:Sunny"], "conf": "cscw", "year": "2013", "pages": 10}