{"title": "Verifying quantitative reliability for programs that execute on unreliable hardware.", "fields": ["approximate computing", "computer architecture", "big data", "computer science", "computation", "computer hardware", "theoretical computer science"], "abstract": "Emerging high-performance architectures are anticipated to contain unreliable components that may exhibit  soft errors , which silently corrupt the results of computations. Full detection and masking of soft errors is challenging, expensive, and, for some applications, unnecessary. For example, approximate computing applications (such as multimedia processing, machine learning, and big data analytics) can often naturally tolerate soft errors.   We present Rely a programming language that enables developers to reason about the quantitative reliability of an application -- namely, the probability that it produces the correct result when executed on unreliable hardware. Rely allows developers to specify the reliability requirements for each value that a function produces.   We present a static quantitative reliability analysis that verifies quantitative requirements on the reliability of an application, enabling a developer to perform sound and verified reliability engineering. The analysis takes a Rely program with a reliability specification and a hardware specification that characterizes the reliability of the underlying hardware components and verifies that the program satisfies its reliability specification when executed on the underlying unreliable hardware platform. We demonstrate the application of quantitative reliability analysis on six computations implemented in Rely.", "citation": "Citations (186)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Michael Carbin.....http://dblp.org/pers/hd/c/Carbin:Michael", "Sasa Misailovic.....http://dblp.org/pers/hd/m/Misailovic:Sasa", "Martin C. Rinard.....http://dblp.org/pers/hd/r/Rinard:Martin_C="], "conf": "oopsla", "year": "2013", "pages": 20}