{"title": "Providing probabilistic guarantees on the time of information spread in opportunistic networks.", "fields": ["network security", "autonomous system", "probabilistic logic", "computer virus", "mobile device"], "abstract": "A variety of mathematical tools have been developed for predicting the spreading patterns in a number of varied environments including infectious diseases, computer viruses, and urgent messages broadcast to mobile agents (e.g., humans, vehicles, and mobile devices). These tools have mainly focused on estimating the average time for the spread to reach a fraction (e.g., α) of the agents, i.e., the so-called average completion time E(T α ). We claim that providing probabilistic guarantee on the time for the spread T α  rather than only its average gives a much better understanding of the spread, and hence could be used to design improved methods to prevent epidemics or devise accelerated methods for distributing data. To demonstrate the benefits, we introduce a new metric G α,β  that denotes the time required to guarantee α completion with probability β, and develop a new framework to characterize the distribution of T α  for various spread parameters such as number of seeds, level of contact rates, and heterogeneity in contact rates. We apply our technique to an experimental mobility trace of taxies in Shanghai and show that our framework enables us to allocate resources (i.e., to control spread parameters) for acceleration of spread in a far more efficient way than the state-of-the-art.", "citation": "Citations (17)", "departments": ["Ohio State University", "Ulsan National Institute of Science and Technology", "Ohio State University", "North Carolina State University"], "authors": ["Yoora Kim.....http://dblp.org/pers/hd/k/Kim:Yoora", "Kyunghan Lee.....http://dblp.org/pers/hd/l/Lee:Kyunghan", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B=", "Injong Rhee.....http://dblp.org/pers/hd/r/Rhee:Injong"], "conf": "infocom", "year": "2013", "pages": 9}