{"title": "Meet the walkers: accelerating index traversals for in-memory databases.", "fields": ["database index", "translation lookaside buffer", "speedup", "hash table", "2 choice hashing"], "abstract": "The explosive growth in digital data and its growing role in real-time decision support motivate the design of high-performance database management systems (DBMSs). Meanwhile, slowdown in supply voltage scaling has stymied improvements in core performance and ushered an era of power-limited chips. These developments motivate the design of DBMS accelerators that (a) maximize utility by accelerating the dominant operations, and (b) provide flexibility in the choice of DBMS, data layout, and data types.   We study data analytics workloads on contemporary in-memory databases and find hash index lookups to be the largest single contributor to the overall execution time. The critical path in hash index lookups consists of ALU-intensive key hashing followed by pointer chasing through a node list. Based on these observations, we introduce Widx, an on-chip accelerator for database hash index lookups, which achieves both high performance and flexibility by (1) decoupling key hashing from the list traversal, and (2) processing multiple keys in parallel on a set of programmable  walker  units. Widx reduces design cost and complexity through its tight integration with a conventional core, thus eliminating the need for a dedicated TLB and cache. An evaluation of Widx on a set of modern data analytics workloads (TPC-H, TPC-DS) using full-system simulation shows an average speedup of 3.1x over an aggressive OoO core on bulk hash table operations, while reducing the OoO core energy by 83%.", "citation": "Citations (127)", "departments": ["École Polytechnique Fédérale de Lausanne", "University of Edinburgh", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Hewlett-Packard"], "authors": ["Yusuf Onur Koçberber.....http://dblp.org/pers/hd/k/Ko=ccedil=berber:Yusuf_Onur", "Boris Grot.....http://dblp.org/pers/hd/g/Grot:Boris", "Javier Picorel.....http://dblp.org/pers/hd/p/Picorel:Javier", "Babak Falsafi.....http://dblp.org/pers/hd/f/Falsafi:Babak", "Kevin T. Lim.....http://dblp.org/pers/hd/l/Lim:Kevin_T=", "Parthasarathy Ranganathan.....http://dblp.org/pers/hd/r/Ranganathan:Parthasarathy"], "conf": "micro", "year": "2013", "pages": 12}