{"title": "Robust QoS-guaranteed network engineering in interference-aware wireless networks.", "fields": ["multi frequency network", "network simulation", "key distribution in wireless sensor networks", "service set", "signal to interference plus noise ratio"], "abstract": "Due to the time-varying nature of wireless networks, it is required to find robust optimal methods to control the behavior and performance of such networks; however, this is a challenging task since robustness metrics and QoS-based (Quality of service) constraints in a wireless environment are typically highly non-linear and non-convex. This paper explores the possibility of using graph theoretic metrics to provide robustness in a wireless network at the presence of a set of QoS constraints. In particular, we are interested in robust planning of a wireless network for a given demand matrix while preserving end-to-end delay for input demands below a given threshold set. To this end, we show that the upper bound of end-to-end round trip time between two nodes of a network can be approximated by point-to-point network criticality (or resistance distance) of the network. We construct a convex optimization problem to provide a delay-guaranteed jointly optimal allocation of transmit powers and link flows. We show that the solution provides a robust behavior, i.e. it is insensitive to the environmental changes such as wireless link disruption, this is expected because network criticality is a robustness metric. Our framework can be applied to a wide range of SINR (Signal to Interference plus Noise Ratio) values.", "citation": "Not cited", "departments": ["University of Toronto", "University of Toronto", "University of Toronto", "Lakehead University"], "authors": ["Ali Tizghadam.....http://dblp.org/pers/hd/t/Tizghadam:Ali", "Ali Shariat.....http://dblp.org/pers/hd/s/Shariat:Ali", "Alberto Leon-Garcia.....http://dblp.org/pers/hd/l/Leon=Garcia:Alberto", "Hassan Naser.....http://dblp.org/pers/hd/n/Naser:Hassan"], "conf": "infocom", "year": "2013", "pages": 6}