{"title": "Euler Clustering.", "fields": ["singular point of a curve", "magnetization", "ringing", "deconvolution", "homogeneity", "cluster", "cartesian coordinate system", "polygon mesh", "wavefront", "global positioning system", "estimation of distribution algorithm", "interference", "euler s formula", "aliasing", "spurious relationship", "perimeter", "multigrid method", "geology", "laminar flow", "geophysics", "kernel density estimation", "matrix similarity", "free parameter", "compressible flow", "filter", "data set", "cluster analysis", "airfoil"], "abstract": "Results of Euler deconvolution strongly depend on the selection of viable solutions. Synthetic calculations using multiple causative sources show that Euler solutions cluster in the vicinity of causative bodies even when they do not group densely about the perimeter of the bodies. We have developed a clustering technique to serve as a tool for selecting appropriate solutions. The clustering technique uses a methodology based on artificial intelligence, and it was originally designed to classify large data sets. It is based on a geometrical approach to study object concentration in a finite metric space of any dimension. The method uses a formal definition of cluster and includes free parameters that search for clusters of given properties. Tests on synthetic and real data showed that the clustering technique successfully outlines causative bodies more accurately than other methods used to discriminate Euler solutions. In complex field cases, such as the magnetic field in the Gulf of Saint Malo region (Brittany, France), the method provides dense clusters, which more clearly outline possible causative sources. In particular, it allows one to trace offshore the main inland tectonic structures and to study their interrelationships in the Gulf of Saint Malo. The clusters provide solutions associated with particular bodies, or parts of bodies, allowing the analysis of different clusters of Euler solutions separately. This may allow computation of average parameters for individual causative bodies. Those measurements of the anomalous field that yield clusters also form dense clusters themselves. Application of this clustering technique thus outlines areas where the influence of different causative sources is more prominent. This allows one to focus on these areas for more detailed study, using different window sizes, structural indices, etc.", "citation": "Not cited", "year": "2013", "departments": ["Russian Academy of Sciences", "Institut de Physique du Globe de Paris", "Institut de Physique du Globe de Paris", "Russian Academy of Sciences", "Russian Academy of Sciences", "Kyushu University", "University of Burgos", "University of Leeds", "Norwegian University of Science and Technology", "University of the Witwatersrand", "United States Geological Survey"], "conf": "ijcai", "authors": ["Jian-Sheng Wu.....http://dblp.org/pers/hd/w/Wu:Jian=Sheng", "Wei-Shi Zheng.....http://dblp.org/pers/hd/z/Zheng:Wei=Shi", "Jian-Huang Lai.....http://dblp.org/pers/hd/l/Lai:Jian=Huang"], "pages": 7}