{"title": "Coding Opportunity Aware Backbone metrics for broadcast in wireless networks.", "fields": ["backbone network", "implementation", "connected dominating set", "exploit", "testbed", "linear network coding", "information exchange"], "abstract": "Reducing transmission redundancy is the key to the efficiency of wireless network broadcast. A standard technique to achieve this is to create a network backbone consisting of a subset of nodes that are responsible for data forwarding, while other nodes act as passive receivers. On top of this, network coding (NC) is often used to further reduce unnecessary transmissions. The main problem with existing backbone and NC combinations is that the backbone construction process is blind of what is needed by network coding, thus may produce a structure that limits performance gain achievable by NC algorithms. To address this problem, we propose Coding Opportunity Aware Backbone (COAB) metrics, which seek to maximize coding opportunities when guiding the selection of backbone forwarders.We show that the better informed backbone construction supported by our metrics leads to significantly increased coding frequency, at minimal cost of localized information exchange. Importantly, the highlight of our work is COAB's broad applicability and effectiveness. We integrate the COAB metrics with ten state-of-the-art broadcast algorithms specified in eight publications, and evaluate COAB with a running testbed of 30 MICAz nodes and extensively simulations. The experimental results show that our design outperforms the existing schemes substantially.", "citation": "Citations (14)", "departments": ["University of Minnesota", "Chinese Academy of Sciences", "Huazhong University of Science and Technology", "University of Minnesota", "University of Minnesota", "Huazhong University of Science and Technology", "University of Minnesota", "Third Research  ... Shanghai, China", "SIAT, China", "Third Res. Inst ... Security, China"], "authors": ["Shuai Wang.....http://dblp.org/pers/hd/w/Wang_0008:Shuai", "Guang Tan.....http://dblp.org/pers/hd/t/Tan:Guang", "Yunhuai Liu.....http://dblp.org/pers/hd/l/Liu:Yunhuai", "Hongbo Jiang.....http://dblp.org/pers/hd/j/Jiang:Hongbo", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "infocom", "year": "2013", "pages": 5}