{"title": "Scalable and parallelizable processing of influence maximization for large-scale social networks?", "fields": ["multi core processor", "approximation algorithm", "maximization", "scalability", "message passing"], "abstract": "As social network services connect people across the world, influence maximization, i.e., finding the most influential nodes (or individuals) in the network, is being actively researched with applications to viral marketing. One crucial challenge in scalable influence maximization processing is evaluating influence, which is #P-hard and thus hard to solve in polynomial time. We propose a scalable influence approximation algorithm, Independent Path Algorithm (IPA) for Independent Cascade (IC) diffusion model. IPA efficiently approximates influence by considering an independent influence path as an influence evaluation unit. IPA are also easily parallelized by simply adding a few lines of OpenMP meta-programming expressions. Also, overhead of maintaining influence paths in memory is relieved by safely throwing away insignificant influence paths. Extensive experiments conducted on large-scale real social networks show that IPA is an order of magnitude faster and uses less memory than the state of the art algorithms. Our experimental results also show that parallel versions of IPA speeds up further as the number of CPU cores increases, and more speed-up is achieved for larger datasets. The algorithms have been implemented in our demo application for influence maximization (available at http://dm.postech.ac.kr/ipa demo), which efficiently finds the most influential nodes in a social network.", "citation": "Citations (88)", "departments": ["Pohang University of Science and Technology", "Pohang University of Science and Technology", "Pohang University of Science and Technology"], "authors": ["Jinha Kim.....http://dblp.org/pers/hd/k/Kim:Jinha", "Seung-Keol Kim.....http://dblp.org/pers/hd/k/Kim:Seung=Keol", "Hwanjo Yu.....http://dblp.org/pers/hd/y/Yu:Hwanjo"], "conf": "icde", "year": "2013", "pages": 12}