{"title": "Non-parametric passive traffic monitoring in cognitive radio networks.", "fields": ["nonparametric statistics", "passive monitoring", "cognitive radio", "density estimation", "exploit"], "abstract": "Passive monitoring by distributed wireless sniffers has been used to strategically capture the network traffic, as the basis of automatic network diagnosis. However, the traditional monitoring techniques fall short in cognitive radio networks (CRNs) due to the much larger number of channels to be monitored, and the secondary users' channel availability uncertainty imposed by primary user activities. To better serve CRNs, we propose a systematic passive monitoring framework for traffic collection using a limited number of sniffers in WiFi like CRNs. We jointly consider primary user activity and secondary user channel access pattern to optimize the traffic capturing strategy. In particular, we exploit a non-parametric density estimation method to learn and predict secondary users' access pattern in an online fashion, which rapidly adapts to the users' dynamic behaviors and supports accurate estimation of merged access patterns from multiple users. We also design near-optimal monitoring algorithms that maximize two levels of quality-of-monitoring goals respectively, based on the predicted channel access patterns. The simulations and experiments show that our proposed framework outperforms the existing schemes significantly.", "citation": "Citations (9)", "departments": ["Utah State University", "Virginia Polyte ... ksburg, VA, USA", "Virginia Polyte ... ksburg, VA, USA", "Virginia Polyte ... ksburg, VA, USA", "Virginia Polyte ... ksburg, VA, USA"], "authors": ["Qiben Yan.....http://dblp.org/pers/hd/y/Yan:Qiben", "Ming Li.....http://dblp.org/pers/hd/l/Li_0003:Ming", "Feng Chen.....http://dblp.org/pers/hd/c/Chen_0001:Feng", "Tingting Jiang.....http://dblp.org/pers/hd/j/Jiang:Tingting", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas", "Chang-Tien Lu.....http://dblp.org/pers/hd/l/Lu:Chang=Tien"], "conf": "infocom", "year": "2013", "pages": 9}