{"title": "The challenges of specifying intervals and absences in temporal queries: a graphical language approach.", "fields": ["query optimization", "web query classification", "query expansion", "query language", "pharmacovigilance"], "abstract": "In our burgeoning world of ubiquitous sensors and affordable data storage, records of timestamped events are being produced across nearly every domain of personal and professional computing. The resulting data surge has created an overarching need to search these records for meaningful patterns of events. This paper reports on a two-part user study, as well as a series of early tests and interviews with clinical researchers, that informed the development of two temporal query interfaces: a basic, menu-based interface and an advanced, graphic-based interface. While the scope of temporal query is very broad, this work focuses on two particularly complex and critical facets of temporal event sequences: intervals (events with both a start time and an end time), and the absence of an event. We describe how users encounter a common set of difficulties when specifying such queries, and propose solutions to help overcome them. Finally, we report on two case studies with epidemiologists at the US Army Pharmacovigilance Center, illustrating how both query interfaces were used to study patterns of drug use.", "citation": "Citations (30)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "Technical University of Madrid", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Megan Monroe.....http://dblp.org/pers/hd/m/Monroe:Megan", "Rongjian Lan.....http://dblp.org/pers/hd/l/Lan:Rongjian", "Juan Morales del Olmo.....http://dblp.org/pers/hd/o/Olmo:Juan_Morales_del", "Ben Shneiderman.....http://dblp.org/pers/hd/s/Shneiderman:Ben", "Catherine Plaisant.....http://dblp.org/pers/hd/p/Plaisant:Catherine", "Jeff Millstein.....http://dblp.org/pers/hd/m/Millstein:Jeff"], "conf": "chi", "year": "2013", "pages": 10}