{"title": "Hybrid robotic/virtual pan-tilt-zom cameras for autonomous event recording.", "fields": ["smart camera", "cropping", "controller", "stereo camera", "camera auto calibration"], "abstract": "We present a method to generate aesthetic video from a robotic camera by incorporating a virtual camera operating on a delay, and a hybrid controller which uses feedback from both the robotic and virtual cameras. Our strategy employs a robotic camera to follow a coarse region-of-interest identified by a realtime computer vision system, and then resamples the captured images to synthesize the video that would have been recorded along a smooth, aesthetic camera trajectory. The smooth motion trajectory is obtained by operating the virtual camera on a short delay so that perfect knowledge of immediate future events is known. Previous autonomous camera installations have employed either robotic cameras or stationary wide-angle cameras with subregion cropping. Robotic cameras track the subject using realtime sensor data, and regulate a smoothness-latency trade-off through control gains. Fixed cameras post-process the data and suffer significant reductions in image resolution when the subject moves freely over a large area.   Our approach provides a solution for broadcasting events from locations where camera operators cannot easily access. We can also offer broadcasters additional actuated camera angles without the overhead of additional human operators. Experiments on our prototype system for college basketball illustrate how our approach better mimics human operators compared to traditional robotic control approaches, while avoiding the loss in resolution that occurs from fixed camera system.", "citation": "Citations (44)", "departments": ["Disney Research", "University of Birmingham", "Disney Research"], "authors": ["Peter Carr.....http://dblp.org/pers/hd/c/Carr_0001:Peter", "Michael Mistry.....http://dblp.org/pers/hd/m/Mistry:Michael", "Iain A. Matthews.....http://dblp.org/pers/hd/m/Matthews:Iain_A="], "conf": "mm", "year": "2013", "pages": 10}