{"title": "D2Taint: Differentiated and dynamic information flow tracking on smartphones for numerous data sources.", "fields": ["mobile computing", "information flow", "information sensitivity", "the internet", "information leakage"], "abstract": "With smartphones' meteoric growth in recent years, leaking sensitive information from them has become an increasingly critical issue. Such sensitive information can originate from smartphones themselves (e.g., location information) or from many Internet sources (e.g., bank accounts, emails). While prior work has demonstrated information flow tracking's (IFT's) effectiveness at detecting information leakage from smartphones, it can only handle a limited number of sensitive information sources. This paper presents a novel IFT tagging strategy using differentiated and dynamic tagging. We partition information sources into differentiated classes and store them in fixed-length tags. We adjust tag structure based on time-varying received information sources. Our tagging strategy enables us to track at runtime numerous information sources in multiple classes and rapidly detect information leakage from any of these sources. We design and implement D2Taint, an IFT system using our tagging strategy on real-world smartphones. We experimentally evaluate D2Taint's effectiveness with 84 real-world applications downloaded from Google Play. D2Taint reports that over 80% of them leak data to third-party destinations; 14% leak highly sensitive data. Our experimental evaluation using a standard benchmark tool illustrates D2Taint's effectiveness at handling many information sources on smartphones with moderate runtime and space overhead.", "citation": "Citations (7)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Boxuan Gu.....http://dblp.org/pers/hd/g/Gu:Boxuan", "Xinfeng Li.....http://dblp.org/pers/hd/l/Li:Xinfeng", "Gang Li.....http://dblp.org/pers/hd/l/Li:Gang", "Adam C. Champion.....http://dblp.org/pers/hd/c/Champion:Adam_C=", "Zhezhe Chen.....http://dblp.org/pers/hd/c/Chen:Zhezhe", "Feng Qin.....http://dblp.org/pers/hd/q/Qin:Feng", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong"], "conf": "infocom", "year": "2013", "pages": 9}