{"title": "Load balance vs energy efficiency in traffic engineering: A game Theoretical Perspective.", "fields": ["traffic engineering", "load balancing", "pareto principle", "game theory", "bargaining problem"], "abstract": "In this paper, we study the tradeoff between two important traffic engineering objectives: load balance and energy efficiency. Although traditional commonly used multi-objective optimization methods can yield a Pareto efficient solution, they need to construct an aggregate objective function (AOF) or model one of the two objectives as a constraint in the optimization problem formulation. As a result, it is difficult to achieve a fair tradeoff between these two objectives. Accordingly, we induce a Nash bargaining framework which treats the two objectives as two virtual players in a game theoretic model, who negotiate how traffic should be routed in order to optimize both objectives. During the negotiation, each of them announces its performance threat value to reduce its cost, so the model is regarded as a threat value game. Our analysis shows that no agreement can be achieved if each player sets its threat value selfishly. To avoid such a negotiation break-down, we modify the threat value game to have a repeated process and design a mechanism to not only guarantee an agreement, but also generate a fair solution. In addition, the insights from this work are also useful for achieving a fair tradeoff in other multi-objective optimization problems.", "citation": "Citations (16)", "departments": ["University at Buffalo", "Key Lab. of Opt ...  Chengdu, China", "Key Lab. of Opt ...  Chengdu, China", "Key Lab. of Opt ...  Chengdu, China", "Key Lab. of Opt ...  Chengdu, China"], "authors": ["Yangming Zhao.....http://dblp.org/pers/hd/z/Zhao:Yangming", "Sheng Wang.....http://dblp.org/pers/hd/w/Wang_0006:Sheng", "Shizhong Xu.....http://dblp.org/pers/hd/x/Xu:Shizhong", "Xiong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Xiong", "Xiujiao Gao.....http://dblp.org/pers/hd/g/Gao:Xiujiao", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming"], "conf": "infocom", "year": "2013", "pages": 5}