{"title": "RapidRAID: Pipelined erasure codes for fast data archival in distributed storage systems.", "fields": ["erasure", "forward error correction", "atomicity", "fountain code", "online codes"], "abstract": "To achieve reliability in distributed storage systems, data has usually been replicated across different nodes. However the increasing volume of data to be stored has motivated the introduction of erasure codes, a storage efficient alternative to replication, particularly suited for archival in data centers, where old datasets (rarely accessed) can be erasure encoded, while replicas are maintained only for the latest data. Many recent works consider the design of new storage-centric erasure codes for improved repairability. In contrast, this paper addresses the migration from replication to encoding: traditionally erasure coding is an atomic operation in that a single node with the whole object encodes and uploads all the encoded pieces. Although large datasets can be concurrently archived by distributing individual object encodings among different nodes, the network and computing capacity of individual nodes constrain the archival process due to such atomicity. We propose a new pipelined coding strategy that distributes the network and computing load of single-object encodings among different nodes, which also speeds up multiple object archival. We further present RapidRAID codes, an explicit family of pipelined erasure codes which provides fast archival without compromising either data reliability or storage overheads. Finally, we provide a real implementation of RapidRAID codes and benchmark its performance using both a cluster of 50 nodes and a set of Amazon EC2 instances. Experiments show that RapidRAID codes reduce a single object's coding time by up to 90%, while when multiple objects are encoded concurrently, the reduction is up to 20%.", "citation": "Citations (24)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Lluis Pamies-Juarez.....http://dblp.org/pers/hd/p/Pamies=Juarez:Lluis", "Anwitaman Datta.....http://dblp.org/pers/hd/d/Datta:Anwitaman", "Frédérique E. Oggier.....http://dblp.org/pers/hd/o/Oggier:Fr=eacute=d=eacute=rique_E="], "conf": "infocom", "year": "2013", "pages": 9}