{"title": "Optimization of HTTP adaptive streaming over mobile cellular networks.", "fields": ["proportionally fair", "hypertext transfer protocol", "cellular network", "video quality", "utility maximization problem"], "abstract": "Video streaming, in particular, hypertext transfer protocol based (HTTP) adaptive streaming (HAS) of video, is expected to be a dominant application over mobile networks in the near future. The observation that the base station can alter the video quality requested by a HAS client to its server by controlling the over-the-air throughput from the base station to the client implies that the base station can jointly maximize aggregate video quality of all the HAS flows and throughput of data flows that it serves. We formulate a utility maximization problem that separately takes into account different utility functions for video and data flows and show that the utility maximization can be achieved through an algorithm, we term adaptive guaranteed bit rate (AGBR), wherein target bit rates are calculated for each HAS flow and passed on to an underlying minimum rate proportional fair scheduler that schedules resources across all the flows. This approach has the advantage that it retains the existing scheduling function in the base station with a separate function to compute the target bit rates for the video flows allowing them to only change slowly over time in order to avoid frequent video quality changes. Through analytical modeling and simulations we show that the proposed algorithm can achieve required fairness among the video flows as well as automatically and fairly adapt video quality with increasing congestion thereby preventing data flow throughput starvation.", "citation": "Citations (63)", "departments": ["Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs"], "authors": ["Danny De Vleeschauwer.....http://dblp.org/pers/hd/v/Vleeschauwer:Danny_De", "Harish Viswanathan.....http://dblp.org/pers/hd/v/Viswanathan:Harish", "Andre Beck.....http://dblp.org/pers/hd/b/Beck:Andre", "Steven A. Benno.....http://dblp.org/pers/hd/b/Benno:Steven_A=", "Gang Li.....http://dblp.org/pers/hd/l/Li:Gang", "Raymond B. Miller.....http://dblp.org/pers/hd/m/Miller:Raymond_B="], "conf": "infocom", "year": "2013", "pages": 9}