{"title": "Approximate Bayesian Image Interpretation using Generative Probabilistic Graphics Programs.", "fields": ["rendering", "graphics software", "probabilistic logic", "latent variable", "approximate bayesian computation"], "abstract": "The idea of computer vision as the Bayesian inverse problem to computer graphics has a long history and an appealing elegance, but it has proved difficult to directly implement. Instead, most vision tasks are approached via complex bottom-up processing pipelines. Here we show that it is possible to write short, simple probabilistic graphics programs that define flexible generative models and to automatically invert them to interpret real-world images. Generative probabilistic graphics programs (GPGP) consist of a stochastic scene generator, a renderer based on graphics software, a stochastic likelihood model linking the renderer's output and the data, and latent variables that adjust the fidelity of the renderer and the tolerance of the likelihood. Representations and algorithms from computer graphics are used as the deterministic backbone for highly approximate and stochastic generative models. This formulation combines probabilistic programming, computer graphics, and approximate Bayesian computation, and depends only on general-purpose, automatic inference techniques. We describe two applications: reading sequences of degraded and adversarially obscured characters, and inferring 3D road models from vehicle-mounted camera images. Each of the probabilistic graphics programs we present relies on under 20 lines of probabilistic code, and yields accurate, approximately Bayesian inferences about real-world images.", "citation": "Citations (60)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Siberian Federal University", "Massachusetts Institute of Technology"], "authors": ["Vikash K. Mansinghka.....http://dblp.org/pers/hd/m/Mansinghka:Vikash_K=", "Tejas D. Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni:Tejas_D=", "Yura N. Perov.....http://dblp.org/pers/hd/p/Perov:Yura_N=", "Joshua B. Tenenbaum.....http://dblp.org/pers/hd/t/Tenenbaum:Joshua_B="], "conf": "nips", "year": "2013", "pages": 9}