{"title": "A privacy preserving framework for managing vehicle data in road pricing systems.", "fields": ["road pricing", "privacy policy", "workload", "data management", "gnss applications"], "abstract": "The Electronic Road Pricing (ERP) system was implemented by the Land Transport Authority of Singapore to control traffic by road pricing since 1998. To better understand the traffic condition and improve the pricing scheme, the government initiated the next generation ERP (ERP 2) project, which aims to use the Global Navigation Satellite System (GNSS) collecting positional data from vehicles for analysis. However, most drivers fear of being monitored once the government installs the devices in their vehicles to collect GPS data. The existing data stream management systems (DSMS) centralize both data management and privacy control at server site. This framework assumes DSMS server is secure and trustable, and protects providers' data from illegal access by data users. In ERP 2, the DSMS server is maintained by the government, i.e., data user. Thus, the existing framework is not adoptable. We propose a novel framework in which privacy protection is pushed to data provider site. By doing this, the system could be safer and more efficient. Our framework can be used for the situations such as ERP 2, i.e., data providers would like to control their own privacy policies and/or the workload of DSMS server needs to be reduced.", "citation": "Citations (1)", "departments": ["National University of Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore"], "authors": ["Huayu Wu.....http://dblp.org/pers/hd/w/Wu_0001:Huayu", "Wee Siong Ng.....http://dblp.org/pers/hd/n/Ng:Wee_Siong", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Wei Wu.....http://dblp.org/pers/hd/w/Wu:Wei", "Shili Xiang.....http://dblp.org/pers/hd/x/Xiang:Shili", "Mingqiang Xue.....http://dblp.org/pers/hd/x/Xue:Mingqiang"], "conf": "kdd", "year": "2013", "pages": 9}