{"title": "Using fault history to improve mutation reduction.", "fields": ["mutation testing", "test suite", "mutant", "mutation", "fault detection and isolation"], "abstract": "Mutation testing can be used to measure test suite quality in two ways: by treating the kill score as a quality metric, or by treating each surviving, non-equivalent mutant as an indicator of an inadequacy in the test suite. The first technique relies on the assumption that the mutation score is highly correlated with the suite's real fault detection rate, which is not well supported by the literature. The second technique relies only on the weaker assumption that the \"interesting\" mutants (i.e., the ones that indicate an inadequacy in the suite) are in the set of surviving mutants. Using the second technique also makes improving the suite straightforward.     Unfortunately, mutation testing has a performance problem. At least part of the test suite must be run on every mutant, meaning mutation testing can be too slow for practical use. Previous work has addressed this by reducing the number of mutants to evaluate in various ways, including selecting a random subset of them. However, reducing the set of mutants by random reduction is suboptimal for developers using the second technique described above, since random reduction will eliminate many of the interesting mutants.     We propose a new reduction method that supports the use of the second technique by reducing the set of mutants to those generated by altering files that have contained many faults in the past. We performed a pilot study that suggests that this reduction method preferentially chooses mutants that will survive mutation testing; that is, it preserves a greater number of interesting mutants than random reduction does.", "citation": "Citations (2)", "departments": ["University of Waterloo", "University of Manitoba", "University of Waterloo"], "authors": ["Laura Inozemtseva.....http://dblp.org/pers/hd/i/Inozemtseva:Laura", "Hadi Hemmati.....http://dblp.org/pers/hd/h/Hemmati:Hadi", "Reid Holmes.....http://dblp.org/pers/hd/h/Holmes:Reid"], "conf": "sigsoft", "year": "2013", "pages": 4}