{"title": "Performance evaluation of time-critical communication networks for smart grids based on IEC 61850.", "fields": ["ethernet", "iec 61850", "interoperability", "network calculus", "smart grid"], "abstract": "Driven by the increasing application of Smart Grid technologies in today's power systems, communication networks are becoming more and more important for exchanging monitoring, control and protection information on local and wide area level. For communication the IEC 61850 standard is a candidate for the Smart Grid and has been introduced for Substation Automation Systems (SAS) some years ago. IEC 61850 provides interoperability among various manufactures and enables systemwide communication between intelligent components of future power systems. However, as IEC 61850 addresses Ethernet (ISO/IEC 8802-3 family) as network technology, especially high performance aspects of Ethernet have become increasingly important for time-critical communication within substation automation systems. In this paper we introduce the generic architecture of IEC 61850 and present our modelling approach for evaluating high performance and real-time capability of communication technologies for future smart grid application. First, we give a short overview of the IEC 61850 protocol and present communication flows in substation automation systems according to the standard. Here we focus on substation automation at bay level, located inside an exemplary substation node taken from the IEEE 39-bus power system network. Afterwards we demonstrate our modeling approach for communication networks based on IEC 61850. For performance evaluation we developed a simulation model along with an analytical approach on basis of Network Calculus, enabling to identify worst case boundaries for intra-substation communication. Finally results for simulative and analytical modelling are provided and cross validated for two bay level scenarios, showing the applicability of Network Calculus for real-time constrained smart grid communication.", "citation": "Citations (26)", "departments": ["Commun. Network ... rtmund, Germany", "Commun. Network ... rtmund, Germany", "Commun. Network ... rtmund, Germany", "Commun. Network ... rtmund, Germany"], "authors": ["Hanno Georg.....http://dblp.org/pers/hd/g/Georg:Hanno", "Nils Dorsch.....http://dblp.org/pers/hd/d/Dorsch:Nils", "Markus Putzke.....http://dblp.org/pers/hd/p/Putzke:Markus", "Christian Wietfeld.....http://dblp.org/pers/hd/w/Wietfeld:Christian"], "conf": "infocom", "year": "2013", "pages": 6}