{"title": "Fast and practical secret key extraction by exploiting channel response.", "fields": ["multiplexing", "pre shared key", "key generation", "key management", "key distribution"], "abstract": "Securing wireless communication remains challenging in dynamic mobile environments due to the shared nature of wireless medium and lacking of fixed key management infrastructures. Generating secret keys using physical layer information thus has drawn much attention to complement traditional cryptographic-based methods. Although recent work has demonstrated that Received Signal Strength (RSS) based secret key extraction is practical, existing RSS-based key generation techniques are largely limited in the rate they generate secret bits and are mainly applicable to mobile wireless networks. In this paper, we show that exploiting the channel response from multiple Orthogonal Frequency-Division Multiplexing (OFDM) subcarriers can provide fine-grained channel information and achieve higher bit generation rate for both static and mobile cases in real-world scenarios. We further develop a Channel Gain Complement (CGC) assisted secret key extraction scheme to cope with channel non-reciprocity encountered in practice. Our extensive experiments using WiFi networks in both indoor as well as outdoor environments demonstrate that our approach can achieve significantly faster secret bit generation rate at 60 ~ 90bit/packet, and is resilient to malicious attacks identified to be harmful to RSS-based techniques including predictable channel attack and stalking attack.", "citation": "Citations (95)", "departments": ["Stevens Institute of Technology", "Stevens Institute of Technology", "University of Rochester", "Stevens Institute of Technology"], "authors": ["Hongbo Liu.....http://dblp.org/pers/hd/l/Liu:Hongbo", "Yang Wang.....http://dblp.org/pers/hd/w/Wang:Yang", "Jie Yang.....http://dblp.org/pers/hd/y/Yang_0003:Jie", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying"], "conf": "infocom", "year": "2013", "pages": 9}