{"title": "Exploiting innocuous activity for correlating users across sites.", "fields": ["timestamp", "exploit", "persona", "writing style", "geotagging"], "abstract": "We study how potential attackers can identify accounts on different social network sites that all belong to the same user, exploiting only innocuous activity that inherently comes with posted content. We examine three specific features on Yelp, Flickr, and Twitter: the geo-location attached to a user's posts, the timestamp of posts, and the user's writing style as captured by language models. We show that among these three features the location of posts is the most powerful feature to identify accounts that belong to the same user in different sites. When we combine all three features, the accuracy of identifying Twitter accounts that belong to a set of Flickr users is comparable to that of existing attacks that exploit usernames. Our attack can identify 37% more accounts than using usernames when we instead correlate Yelp and Twitter. Our results have significant privacy implications as they present a novel class of attacks that exploit users' tendency to assume that, if they maintain different personas with different names, the accounts cannot be linked together; whereas we show that the posts themselves can provide enough information to correlate the accounts.", "citation": "Citations (149)", "departments": ["University of Paris", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["Oana Goga.....http://dblp.org/pers/hd/g/Goga:Oana", "Howard Lei.....http://dblp.org/pers/hd/l/Lei:Howard", "Sree Hari Krishnan Parthasarathi.....http://dblp.org/pers/hd/p/Parthasarathi:Sree_Hari_Krishnan", "Gerald Friedland.....http://dblp.org/pers/hd/f/Friedland:Gerald", "Robin Sommer.....http://dblp.org/pers/hd/s/Sommer:Robin", "Renata Teixeira.....http://dblp.org/pers/hd/t/Teixeira:Renata"], "conf": "www", "year": "2013", "pages": 12}