{"title": "seL4: From General Purpose to a Proof of Information Flow Enforcement.", "fields": ["microkernel", "mathematical proof", "formal proof", "covert channel", "correctness"], "abstract": "In contrast to testing, mathematical reasoning and formal verification can show the absence of whole classes of security vulnerabilities. We present the, to our knowledge, first complete, formal, machine-checked verification of information flow security for the implementation of a general-purpose microkernel; namely seL4. Unlike previous proofs of information flow security for operating system kernels, ours applies to the actual 8, 830 lines of C code that implement seL4, and so rules out the possibility of invalidation by implementation errors in this code. We assume correctness of compiler, assembly code, hardware, and boot code. We prove everything else. This proof is strong evidence of seL4's utility as a separation kernel, and describes precisely how the general purpose kernel should be configured to enforce isolation and mandatory information flow control. We describe the information flow security statement we proved (a variant of intransitive noninterference), including the assumptions on which it rests, as well as the modifications that had to be made to seL4 to ensure it was enforced. We discuss the practical limitations and implications of this result, including covert channels not covered by the formal proof.", "citation": "Citations (146)", "departments": ["NICTA", "NICTA", "NICTA", "NICTA", "NICTA"], "authors": ["Toby C. Murray.....http://dblp.org/pers/hd/m/Murray:Toby_C=", "Daniel Matichuk.....http://dblp.org/pers/hd/m/Matichuk:Daniel", "Matthew Brassil.....http://dblp.org/pers/hd/b/Brassil:Matthew", "Peter Gammie.....http://dblp.org/pers/hd/g/Gammie:Peter", "Timothy Bourke.....http://dblp.org/pers/hd/b/Bourke:Timothy", "Sean Seefried.....http://dblp.org/pers/hd/s/Seefried:Sean", "Corey Lewis.....http://dblp.org/pers/hd/l/Lewis:Corey", "Xin Gao.....http://dblp.org/pers/hd/g/Gao:Xin", "Gerwin Klein.....http://dblp.org/pers/hd/k/Klein:Gerwin"], "conf": "sp", "year": "2013", "pages": 15}