{"title": "TAMES: A Truthful Auction Mechanism for heterogeneous spectrum allocation.", "fields": ["exploit", "bandwidth allocation", "frequency allocation", "spectrum auction", "path loss"], "abstract": "Spectrums are heterogeneous, especially from the aspect of their central frequency. According to signal propagation properties, low-frequency spectrum generally has lower path loss, thus longer transmission range, compared with high-frequency spectrum. Cellular operators with different targeted cell size will have different preferences for spectrums with different frequencies. Furthermore, the transmission range also affects the interference relationships among transmitters. Transmitters who can reuse the same high-frequency spectrum may interfere with each other when reusing the low-frequency spectrum, so it is difficult to decide how to construct the interference graph to exploit spectrum reusability among transmitters. Auction is considered as an efficient way for spectrum allocation. However, most of the previous works only considered homogenous spectrum auction, failing to address the problem of spectrum heterogeneity. In this paper, we propose TAMES, a Truthful Auction Mechanism for hEterogeneous Spectrum allocation, which allows buyers to freely express their different preferences towards different spectrums. Frequency-specific interference graphs are constructed to determine buyer groups. The proposed heterogeneous spectrum auction is theoretically proved to be truthful and individual rational. The simulation results verifies that the proposed auction mechanism outperforms other auction mechanisms with homogenous bid or homogenous interference graph. The proposed auction mechanism is able to yield higher buyers' satisfaction, seller's revenue and spectrum utilization.", "citation": "Citations (19)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Sun Yat-sen University", "Hong Kong University of Science and Technology"], "authors": ["Yanjiao Chen.....http://dblp.org/pers/hd/c/Chen:Yanjiao", "Jin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jin", "Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian"], "conf": "infocom", "year": "2013", "pages": 5}