{"title": "Economics of mobile data offloading.", "fields": ["perfect competition", "femtocell", "subgame perfect equilibrium", "mobile data offloading", "monopoly"], "abstract": "Mobile data offloading is a promising approach to alleviate network congestion and enhance quality of service (QoS) in mobile cellular networks. In this paper, we investigate the economics of mobile data offloading through third-party WiFi or femtocell access points (APs). Specifically, we consider a market-based data offloading solution, where macrocellular base stations (BSs) pay APs for offloading traffic. The key questions arising in such a marketplace are following: (i) how much traffic should each AP offload for each BS? and (ii) what is the corresponding payment of each BS to each AP? We answer these questions by using the non-cooperative game theory. In particular, we define a multi-leader multi-follower data offloading game (DOFF), where BSs (leaders) propose market prices, and accordingly APs (followers) determine the traffic volumes they are willing to offload. We characterize the subgame perfect equilibrium (SPE) of this game, and further compare the SPE with two other classic market outcomes: (i) the market balance (MB) in a perfect competition market (i.e., without price participation), and (ii) the monopoly outcome (MO) in a monopoly market (i.e., without price competition). Our results analytically show that (i) the price participation (of BSs) will drive market prices down, compared to those under the MB outcome, and (ii) the price competition (among BSs) will drive market prices up, compared to those under the MO outcome.", "citation": "Citations (113)", "departments": ["The Chinese University of Hong Kong", "University of Thessaly", "The Chinese University of Hong Kong", "University of Thessaly"], "authors": ["Lin Gao.....http://dblp.org/pers/hd/g/Gao_0001:Lin", "George Iosifidis.....http://dblp.org/pers/hd/i/Iosifidis:George", "Jianwei Huang.....http://dblp.org/pers/hd/h/Huang:Jianwei", "Leandros Tassiulas.....http://dblp.org/pers/hd/t/Tassiulas:Leandros"], "conf": "infocom", "year": "2013", "pages": 6}