{"title": "Tiered billing scheme for residential load scheduling with bidirectional energy trading.", "fields": ["job shop scheduling", "distributed generation", "nash equilibrium", "software deployment", "smart grid"], "abstract": "Future generation smart grids will allow customers to trade energy bidirectionally. Specifically, each customer will be able to not only buy energy from the aggregator during its peak hours but also sell its surplus energy during its off-peak hours. In these emerging energy trading markets, a key component will be the deployment of effective energy billing schemes which consider the customers residential load scheduling. In this paper, we consider a residential load scheduling problem with bidirectional energy trading. Compared with the previous work, in which customers are assumed to be obedient and agree to maximize the social welfare of the smart grid system, in this paper, we consider a non-collaborative approach, where consumers are self-interested. We model the energy scheduling problem as a non-cooperative game, where each customer determines its load scheduling and energy trading to maximize its own profit. In order to resolve the unfairness between heavy and light customers, we propose a novel tiered billing scheme that can control the electricity rates for customers according to their different energy consumption levels. We also propose a distributed energy scheduling algorithm that converges to the unique Nash equilibrium of the studied non-cooperative game. Through the numerical results, we study the impact of the proposed tiered billing scheme on the selfish customers' behavior and on their incentives to participate in the energy trading market.", "citation": "Citations (4)", "departments": ["Yonsei University", "University of Miami", "University of California, Los Angeles", "Yonsei University"], "authors": ["Byung-Gook Kim.....http://dblp.org/pers/hd/k/Kim:Byung=Gook", "Shaolei Ren.....http://dblp.org/pers/hd/r/Ren:Shaolei", "Mihaela van der Schaar.....http://dblp.org/pers/hd/s/Schaar:Mihaela_van_der", "Jang-Won Lee.....http://dblp.org/pers/hd/l/Lee:Jang=Won"], "conf": "infocom", "year": "2013", "pages": 6}