{"title": "Privacy manipulation and acclimation in a location sharing application.", "fields": ["mobile computing", "internet privacy", "small number", "social network", "privacy software"], "abstract": "Location sharing is a popular feature of online social networks, but challenges remain in the effective presentation of privacy choices to users, whose location sharing preferences are complex and diverse. One proposed approach for capturing these nuances builds on the observation that key attributes of users' location sharing preferences can be represented by a small number of privacy profiles, which can provide a basis for configuring individual preferences. However, the impact of this approach on how users view their privacy is relatively unknown. We present a study evaluating the impact of this approach on users' location sharing preferences and their satisfaction with the decisions made by their resulting settings. The results suggest that this approach can influence users to share significantly more without a substantial difference in comfort. This further suggests that the provision of profiles for privacy settings must be carefully considered, as they can substantially alter sharing behavior.", "citation": "Citations (26)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Shomir Wilson.....http://dblp.org/pers/hd/w/Wilson:Shomir", "Justin Cranshaw.....http://dblp.org/pers/hd/c/Cranshaw:Justin", "Norman M. Sadeh.....http://dblp.org/pers/hd/s/Sadeh:Norman_M=", "Alessandro Acquisti.....http://dblp.org/pers/hd/a/Acquisti:Alessandro", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith", "Jay Springfield.....http://dblp.org/pers/hd/s/Springfield:Jay", "Sae Young Jeong.....http://dblp.org/pers/hd/j/Jeong:Sae_Young", "Arun Balasubramanian.....http://dblp.org/pers/hd/b/Balasubramanian:Arun"], "conf": "huc", "year": "2013", "pages": 10}