{"title": "A new analytical technique for designing provably efficient MapReduce schedulers.", "fields": ["fixed priority pre emptive scheduling", "almost surely", "online algorithm", "competitive analysis", "group method of data handling"], "abstract": "With the rapid increase in size and number of jobs that are being processed in the MapReduce framework, efficiently scheduling jobs under this framework is becoming increasingly important. We consider the problem of minimizing the total flowtime of a sequence of jobs in the MapReduce framework, where the jobs arrive over time and need to be processed through both Map and Reduce procedures before leaving the system. We show that for this problem for non-preemptive tasks, no on-line algorithm can achieve a constant competitive ratio (defined as the ratio between the completion time of the online algorithm to the completion time of the optimal non-causal off-line algorithm). We then construct a slightly weaker metric of performance called the efficiency ratio. An online algorithm is said to achieve an efficiency ratio of γ when the flow-time incurred by that scheduler divided by the minimum flow-time achieved over all possible schedulers is almost surely less than or equal to γ. Under some weak assumptions, we then show a surprising property that, for the flow-time problem, any work-conserving scheduler has a constant efficiency ratio in both preemptive and nonpreemptive scenarios. More importantly, we are able to develop an online scheduler with a very small efficiency ratio (2), and through simulations we show that it outperforms the state-of-the-art schedulers.", "citation": "Citations (30)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Yousi Zheng.....http://dblp.org/pers/hd/z/Zheng:Yousi", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B=", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun"], "conf": "infocom", "year": "2013", "pages": 9}