{"title": "Communication-efficient Outlier Detection for Scale-out Systems.", "fields": ["stream processing", "domain knowledge", "anomaly detection", "software bug", "outlier"], "abstract": "Modern scale-out services are built on top of large datacenters composed of thousands of individual machines. These must be continuously monitored because unexpected failures can overload fail-over mechanism and cause large-scale outages. Such monitoring can be accomplished by periodically measuring hundreds of performance metrics and looking for outliers, often caused by misconfigurations, hardware failures or even software bugs. Previous work has shown that many failures are indeed preceded by such performance outliers, known as performance problems or latent faults. In this work we adapt an existing unsupervised statistical framework for latent fault detection to provide an online, communicationand computation-reduced version. The existing framework is effective in predicting machine failures days before they happen, but requires each monitored machine to send all its periodic metric measurements, which is prohibitive in some settings and requires that the datacenter provide parallel storage and processing. Our adapted framework is able to reduce the amount of data sent and the processing cost at the central coordinator by processing the data in situ, making it usable in wider settings. We utilize techniques from the domain of stream processing, specifically sketching and safe zones, to trade-off accuracy for communication and computation, without compromising its advantages. Like the original framework, our adapted framework is unsupervised, does not require domain knowledge, and provides statistical guarantees on the rate of false positives. Initial experiments show that scores yielded by the adapted framework match the original scores very well, while reducing communications by over 90%.", "citation": "Citations (7)", "departments": ["Technion – Israel Institute of Technology", "University of Haifa", "Technion – Israel Institute of Technology"], "authors": ["Moshe Gabel.....http://dblp.org/pers/hd/g/Gabel:Moshe", "Daniel Keren.....http://dblp.org/pers/hd/k/Keren:Daniel", "Assaf Schuster.....http://dblp.org/pers/hd/s/Schuster:Assaf"], "conf": "vldb", "year": "2013", "pages": 6}