{"title": "On the security of TLS renegotiation.", "fields": ["secure channel", "transport layer security", "key exchange", "cryptographic primitive", "authenticated key exchange"], "abstract": "The Transport Layer Security (TLS) protocol is the most widely used security protocol on the Internet. It supports negotiation of a wide variety of cryptographic primitives through different cipher suites, various modes of client authentication, and additional features such as renegotiation. Despite its widespread use, only recently has the full TLS protocol been proven secure, and only the core cryptographic protocol with no additional features. These additional features have been the cause of several practical attacks on TLS. In 2009, Ray and Dispensa demonstrated how TLS renegotiation allows an attacker to splice together its own session with that of a victim, resulting in a man-in-the-middle attack on TLS-reliant applications such as HTTP. TLS was subsequently patched with two defence mechanisms for protection against this attack.   We present the first formal treatment of renegotiation in secure channel establishment protocols. We add optional renegotiation to the authenticated and confidential channel establishment model of Jager et al., an adaptation of the Bellare--Rogaway authenticated key exchange model. We describe the attack of Ray and Dispensa on TLS within our model. We show generically that the proposed fixes for TLS offer good protection against renegotiation attacks, and give a simple new countermeasure that provides renegotiation security for TLS even in the face of stronger adversaries.", "citation": "Not cited", "year": "2013", "departments": ["Ruhr University Bochum", "Ruhr University Bochum", "Queensland University of Technology"], "conf": "ccs", "authors": ["Florian Giesen.....http://dblp.org/pers/hd/g/Giesen:Florian", "Florian Kohlar.....http://dblp.org/pers/hd/k/Kohlar:Florian", "Douglas Stebila.....http://dblp.org/pers/hd/s/Stebila:Douglas"], "pages": 12}