{"title": "ImproveMyCity: an open source platform for direct citizen-government communication.", "fields": ["visualization", "computer science", "computer security", "government"], "abstract": "ImproveMyCity is an open source platform that enables residents to directly report to their public administration local issues about their neighborhood such as discarded trash bins, faulty street lights, broken tiles on sidewalks, illegal advertising boards, etc. The reported issues are automatically transmitted to the appropriate office in public administration so as to schedule their settlement. Reporting is feasible both through a web- and a smartphone-based front-end that adopt a map-based visualization, which makes reporting a user-friendly and intriguing process. The management and routing of incoming issues is performed through a back-end infrastructure that serves as an integrated management system with easy to use interfaces. Apart from reporting a new issue, both front-ends allow the citizens to add comments or vote on existing issues, which adds a social dimension on the collected content. Finally, the platform makes also provision for informing the citizens about the progress status of the reported issue and in this way facilitate the establishment of a two-way dialogue between the citizen and public administration.", "citation": "Citations (10)", "departments": ["Aristotle University of Thessaloniki", "Centre for Rese ... aloniki, Greece", "Centre for Rese ... aloniki, Greece", "Centre for Rese ... aloniki, Greece", "Centre for Rese ... aloniki, Greece"], "authors": ["Ioannis Tsampoulatidis.....http://dblp.org/pers/hd/t/Tsampoulatidis:Ioannis", "Dimitrios Ververidis.....http://dblp.org/pers/hd/v/Ververidis:Dimitrios", "Panagiotis Tsarchopoulos.....http://dblp.org/pers/hd/t/Tsarchopoulos:Panagiotis", "Spiros Nikolopoulos.....http://dblp.org/pers/hd/n/Nikolopoulos:Spiros", "Ioannis Kompatsiaris.....http://dblp.org/pers/hd/k/Kompatsiaris:Ioannis", "Nicos Komninos.....http://dblp.org/pers/hd/k/Komninos:Nicos"], "conf": "mm", "year": "2013", "pages": 4}