{"title": "Effectively-Propositional Reasoning about Reachability in Linked Data Structures.", "fields": ["transitive closure", "descriptive complexity theory", "linked list", "boolean satisfiability problem", "counterexample"], "abstract": "This paper proposes a novel method of harnessing existing SAT solvers to verify reachability properties of programs that manipulate linked-list data structures. Such properties are essential for proving program termination, correctness of data structure invariants, and other safety properties. Our solution is complete, i.e., a SAT solver produces a counterexample whenever a program does not satisfy its specification. This result is surprising since even first-order theorem provers usually cannot deal with reachability in a complete way, because doing so requires reasoning about transitive closure.\n\nOur result is based on the following ideas: (1) Programmers must write assertions in a restricted logic without quantifier alternation or function symbols. (2) The correctness of many programs can be expressed in such restricted logics, although we explain the tradeoffs. (3) Recent results in descriptive complexity can be utilized to show that every program that manipulates potentially cyclic, singly- and doubly-linked lists and that is annotated with assertions written in this restricted logic, can be verified with a SAT solver.\n\nWe implemented a tool atop Z3 and used it to show the correctness of several linked list programs.", "citation": "Citations (31)", "year": "2013", "departments": ["Tel Aviv University", "IMDEA", "University of Massachusetts Amherst", "IMDEA", "Tel Aviv University"], "conf": "cav", "authors": ["Shachar Itzhaky.....http://dblp.org/pers/hd/i/Itzhaky:Shachar", "Anindya Banerjee.....http://dblp.org/pers/hd/b/Banerjee_0001:Anindya", "Neil Immerman.....http://dblp.org/pers/hd/i/Immerman:Neil", "Aleksandar Nanevski.....http://dblp.org/pers/hd/n/Nanevski:Aleksandar", "Mooly Sagiv.....http://dblp.org/pers/hd/s/Sagiv:Mooly"], "pages": 17}