{"title": "Emergence of equilibria from individual strategies in online content diffusion.", "fields": ["market research", "solution concept", "game theory", "content management", "user generated content"], "abstract": "Social scientists have observed that human behavior in society can often be modeled as corresponding to a threshold type policy. A new behavior would propagate by a procedure in which an individual adopts the new behavior if the fraction of his neighbors or friends having adopted such behavior exceeds some threshold. In this paper we study the question of whether the emergence of threshold policies may be modeled as a result of some rational process which would describe the behavior of non-cooperative rational members of some social network. We focus on situations in which individuals take the decision whether to access or not some content, based on the number of views that the content has. Our analysis aims at understanding not only the behavior of individuals, but also the way in which information about the quality of a given content can be deduced from view counts when only part of the viewers that access the content are informed about its quality. In this paper we present a game formulation for the behavior of individuals using a meanfield model: the number of individuals is approximated by a continuum of atomless players and for which the Wardrop equilibrium is the solution concept. We derive conditions on the problem's parameters that result indeed in the emergence of threshold equilibria policies. But we also identify some parameters in which other structures are obtained for the equilibrium behavior of individuals.", "citation": "Citations (6)", "departments": ["French Institute for Research in Computer Science and Automation", "University of Avignon", "University of Avignon", "CREATE-NET, Trento, Italy", "CREATE-NET, Trento, Italy"], "authors": ["Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan", "Francesco De Pellegrini.....http://dblp.org/pers/hd/p/Pellegrini:Francesco_De", "Rachid El Azouzi.....http://dblp.org/pers/hd/a/Azouzi:Rachid_El", "Daniele Miorandi.....http://dblp.org/pers/hd/m/Miorandi:Daniele", "Tania Jiménez.....http://dblp.org/pers/hd/j/Jim=eacute=nez:Tania"], "conf": "infocom", "year": "2013", "pages": 6}