{"title": "Scalable and incremental software bug detection.", "fields": ["source lines of code", "static program analysis", "software bug", "inter process communication", "static analysis"], "abstract": "An important, but often neglected, goal of static analysis for detecting bugs is the ability to show defects to the programmer quickly. Unfortunately, existing static analysis tools scale very poorly, or are shallow and cannot find complex interprocedural defects. Previous attempts at reducing the analysis time by adding more resources (CPU, memory) or by splitting the analysis into multiple sub-analyses based on defect detection capabilities resulted in limited/negligible improvements.     We present a technique for parallel and incremental static analysis using top-down, bottom-up and global specification inference based around the concept of a work unit, a self-contained atom of analysis input, that deterministically maps to its output. A work unit contains both abstract and concrete syntax to analyze, a supporting fragment of the class hierarchy, summarized interprocedural behavior, and defect reporting information, factored to ensure a high level of reuse when analyzing successive versions incrementally. Work units are created and consumed by an analysis master process that coordinates the multiple analysis passes, the flow of information among them, and incrementalizes the computation. Meanwhile, multiple analysis worker processes use abstract interpretation to compute work unit results. Process management and interprocess communication is done by a general-purpose computation distributor layer.     We have implemented our approach and our experimental results show that using eight processor cores, we can perform complete analysis of code bases with millions of lines of code in a few hours, and even faster after incremental changes to that code. The analysis is thorough and accurate: it usually reports about one crash-causing defect per thousand lines of code, with a false positive rate of 10--20%", "citation": "Citations (13)", "departments": ["Coverity", "Coverity", "Indian Institute of Science"], "authors": ["Scott McPeak.....http://dblp.org/pers/hd/m/McPeak:Scott", "Charles-Henri Gros.....http://dblp.org/pers/hd/g/Gros:Charles=Henri", "Murali Krishna Ramanathan.....http://dblp.org/pers/hd/r/Ramanathan:Murali_Krishna"], "conf": "sigsoft", "year": "2013", "pages": 11}