{"title": "Almost optimal virtual machine placement for traffic intense data centers.", "fields": ["data center", "approximation algorithm", "cloud computing", "storage area network", "virtual machine"], "abstract": "The recent growing popularity of cloud-based solutions and the variety of new applications present new challenges for cloud management and resource utilization. In this paper we concentrate on the networking aspect and consider the placement problem of virtual machines (VMs) of applications with intense bandwidth requirements. Optimizing the available network bandwidth is far more complex than optimizing resources like memory or CPU, since every network link may be used by many physical hosts and thus by the VMs residing in these hosts. We focus on maximizing the benefit from the overall communication sent by the VMs to a single designated point in the data center (called the root). This is the typical case when considering a storage area network of applications with intense storage requirements. We formulate a bandwidth-constrained VM placement optimization problem that models this setting. This problem is NP hard, and we present a polynomial-time constant approximation algorithm for its most general version, in which hosts are connected to the root by a general network graph. For more practical cases, in which the network topology is a tree and the revenue is a simple function of the allocated bandwidth, we present improved approximation algorithms that are more efficient in terms of running time. We evaluate the expected performance of our proposed algorithms through a simulation study over traces from a real production data center, providing strong indications to the superiority of our proposed solutions.", "citation": "Citations (36)", "departments": ["IBM", "IBM", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology"], "authors": ["Rami Cohen.....http://dblp.org/pers/hd/c/Cohen:Rami", "Liane Lewin-Eytan.....http://dblp.org/pers/hd/l/Lewin=Eytan:Liane", "Joseph Naor.....http://dblp.org/pers/hd/n/Naor:Joseph", "Danny Raz.....http://dblp.org/pers/hd/r/Raz:Danny"], "conf": "infocom", "year": "2013", "pages": 5}