{"title": "Efficient 3G budget utilization in mobile participatory sensing applications.", "fields": ["heuristic", "test data generation", "software deployment", "upload", "participatory sensing"], "abstract": "This paper explores efficient 3G budget utilization in mobile participatory sensing applications. 1 Distinct from previous research work that either rely on limited WiFi access points or assume the availability of unlimited 3G communication capability, we offer a more practical participatory sensing system that leverages potential 3G budgets that participants contribute at will, and uses it efficiently customized for the needs of multiple participatory sensing applications with heterogeneous sensitivity to environmental changes. We address the challenge that the information of data generation and WiFi encounters is not a priori knowledge, and propose an online decision making algorithm that takes advantage of participants' historical data. We also develop a heuristic algorithm to consume less energy and reduce the storage overhead while maintaining efficient 3G budget utilization. Experimental results from a 30-participant deployment demonstrate that, even when the budget is as small as 2.5% of a popular data plan, these two algorithms achieve higher utility of uploaded data compared to the baseline solution, especially, they increase the utility of received data by 151.4% and 137.8% for those sensitive applications.", "citation": "Citations (14)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Wisconsin-Madison", "University of Virginia", "University of Illinois at Urbana–Champaign"], "authors": ["Hengchang Liu.....http://dblp.org/pers/hd/l/Liu:Hengchang", "Shaohan Hu.....http://dblp.org/pers/hd/h/Hu:Shaohan", "Wei Zheng.....http://dblp.org/pers/hd/z/Zheng:Wei", "Zhiheng Xie.....http://dblp.org/pers/hd/x/Xie:Zhiheng", "Shiguang Wang.....http://dblp.org/pers/hd/w/Wang:Shiguang", "Pan Hui.....http://dblp.org/pers/hd/h/Hui:Pan", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F="], "conf": "infocom", "year": "2013", "pages": 9}