{"title": "Cascading verification: an integrated method for domain-specific model checking.", "fields": ["domain model", "ontology language", "yaml", "modeling language", "semantic web rule language", "abstraction model checking"], "abstract": "Model checking is an established method for verifying behavioral properties of system models. But model checkers tend to support low-level modeling languages that require intricate models to represent even the simplest systems. Modeling complexity arises in part from the need to encode domain knowledge at relatively low levels of abstraction.     In this paper, we demonstrate that formalized domain knowledge can be reused to raise the abstraction level of model and property specifications, and hence the effectiveness of model checking. We describe a novel method for domain-specific model checking called cascading verification that uses composite reasoning over high-level system specifications and formalized domain knowledge to synthesize both low-level system models and their behavioral properties for verification. In particular, model builders use a high-level domain-specific language (DSL) based on YAML to express system specifications that can be verified with probabilistic model checking. Domain knowledge is encoded in the Web Ontology Language (OWL), the Semantic Web Rule Language (SWRL) and Prolog, which are used in combination to overcome their individual limitations. A compiler then synthesizes models and properties for verification by the probabilistic model checker PRISM. We illustrate cascading verification for the domain of uninhabited aerial vehicles (UAVs), for which we have constructed a prototype implementation. An evaluation of this prototype reveals nontrivial reductions in the size and complexity of input specifications compared to the artifacts synthesized for PRISM.", "citation": "Not cited", "departments": ["University College London", "National University of Singapore", "University of Nebraska–Lincoln", "University College London"], "authors": ["Fokion Zervoudakis.....http://dblp.org/pers/hd/z/Zervoudakis:Fokion", "David S. Rosenblum.....http://dblp.org/pers/hd/r/Rosenblum:David_S=", "Sebastian G. Elbaum.....http://dblp.org/pers/hd/e/Elbaum:Sebastian_G=", "Anthony Finkelstein.....http://dblp.org/pers/hd/f/Finkelstein:Anthony"], "conf": "sigsoft", "year": "2013", "pages": 11}