{"title": "No country for old members: user lifecycle and linguistic change in online communities.", "fields": ["linguistics", "norm", "social influence", "collective identity", "social dynamics"], "abstract": "Vibrant online communities are in constant flux. As members join and depart, the interactional norms evolve, stimulating further changes to the membership and its social dynamics. Linguistic change --- in the sense of innovation that becomes accepted as the norm --- is essential to this dynamic process: it both facilitates individual expression and fosters the emergence of a collective identity.   We propose a framework for tracking linguistic change as it happens and for understanding how specific users react to these evolving norms. By applying this framework to two large online communities we show that users follow a determined two-stage lifecycle with respect to their susceptibility to linguistic change: a linguistically innovative learning phase in which users adopt the language of the community followed by a conservative phase in which users stop changing and the evolving community norms pass them by.   Building on this observation, we show how this framework can be used to detect, early in a user's career, how long she will stay active in the community. Thus, this work has practical significance for those who design and maintain online communities. It also yields new theoretical insights into the evolution of linguistic norms and the complex interplay between community-level and individual-level linguistic change.", "citation": "Citations (218)", "departments": ["Max Planck Society", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "authors": ["Cristian Danescu-Niculescu-Mizil.....http://dblp.org/pers/hd/d/Danescu=Niculescu=Mizil:Cristian", "Robert West.....http://dblp.org/pers/hd/w/West_0001:Robert", "Dan Jurafsky.....http://dblp.org/pers/hd/j/Jurafsky:Dan", "Jure Leskovec.....http://dblp.org/pers/hd/l/Leskovec:Jure", "Christopher Potts.....http://dblp.org/pers/hd/p/Potts:Christopher"], "conf": "www", "year": "2013", "pages": 12}