{"title": "Outsourced symmetric private information retrieval.", "fields": ["business", "plaintext", "encryption", "internet privacy", "symmetric key algorithm", "private information retrieval", "computer security", "authorization"], "abstract": "In the setting of searchable symmetric encryption (SSE), a data owner D outsources a database (or document/file collection) to a remote server E in encrypted form such that D can later search the collection at E while hiding information about the database and queries from E. Leakage to E is to be confined to well-defined forms of data-access and query patterns while preventing disclosure of explicit data and query plaintext values. Recently, Cash et al. presented a protocol, OXT, which can run arbitrary boolean queries in the SSE setting and which is remarkably efficient even for very large databases.   In this paper we investigate a richer setting in which the data owner D outsources its data to a server E but D is now interested to allow clients (third parties) to search the database such that clients learn the information D authorizes them to learn but nothing else while E still does not learn about the data or queried values as in the basic SSE setting. Furthermore, motivated by a wide range of applications, we extend this model and requirements to a setting where, similarly to private information retrieval, the client's queried values need to be hidden also from the data owner D even though the latter still needs to authorize the query. Finally, we consider the scenario in which authorization can be enforced by the data owner D without D learning the policy, a setting that arises in court-issued search warrants.   We extend the OXT protocol of Cash et al. to support arbitrary boolean queries in all of the above models while withstanding adversarial non-colluding servers (D and E) and arbitrarily malicious clients, and while preserving the remarkable performance of the protocol.", "citation": "Not cited", "year": "2013", "departments": ["University of California, Irvine", "IBM", "IBM", "University of California, Irvine", "IBM"], "conf": "ccs", "authors": ["Stanislaw Jarecki.....http://dblp.org/pers/hd/j/Jarecki:Stanislaw", "Charanjit S. Jutla.....http://dblp.org/pers/hd/j/Jutla:Charanjit_S=", "Hugo Krawczyk.....http://dblp.org/pers/hd/k/Krawczyk:Hugo", "Marcel-Catalin Rosu.....http://dblp.org/pers/hd/r/Rosu:Marcel=Catalin", "Michael Steiner.....http://dblp.org/pers/hd/s/Steiner:Michael"], "pages": 14}