{"title": "Upper Bounds for Newton's Method on Monotone Polynomial Systems, and P-Time Model Checking of Probabilistic One-Counter Automata.", "fields": ["monotonic function", "model of computation", "least fixed point", "model checking", "newton s method", "rate of convergence"], "abstract": "A central computational problem for analyzing and model checking various classes of infinite-state recursive probabilistic systems (including quasi-birth-death processes, multi-type branching processes, stochastic context-free grammars, probabilistic pushdown automata and recursive Markov chains) is the computation of termination probabilities, and computing these probabilities in turn boils down to computing the least fixed point (LFP) solution of a corresponding monotone polynomial system (MPS) of equations, denoted x=P(x).\n\nIt was shown by Etessami and Yannakakis [11] that a decomposed variant of Newton's method converges monotonically to the LFP solution for any MPS that has a non-negative solution. Subsequently, Esparza, Kiefer, and Luttenberger [7] obtained upper bounds on the convergence rate of Newton's method for certain classes of MPSs. More recently, better upper bounds have been obtained for special classes of MPSs ([10, 9]).\n\nHowever, prior to this paper, for arbitrary (not necessarily strongly-connected) MPSs, no upper bounds at all were known on the convergence rate of Newton's method as a function of the encoding size |P| of the input MPS, x=P(x).\n\nIn this paper we provide worst-case upper bounds, as a function of both the input encoding size |P|, and e>0, on the number of iterations required for decomposed Newton's method (even with rounding) to converge to within additive error e>0 of q*, for an arbitrary MPS with LFP solution q*. Our upper bounds are essentially optimal in terms of several important parameters of the problem.\n\nUsing our upper bounds, and building on prior work, we obtain the first P-time algorithm (in the standard Turing model of computation) for quantitative model checking, to within arbitrary desired precision, of discrete-time QBDs and (equivalently) probabilistic 1-counter automata, with respect to any (fixed) ω-regular or LTL property.", "citation": "Citations (16)", "year": "2013", "departments": ["University of Edinburgh", "University of Edinburgh", "Columbia University", "University of Edinburgh", "University of Edinburgh", "Columbia University"], "conf": "cav", "authors": ["Alistair Stewart.....http://dblp.org/pers/hd/s/Stewart:Alistair", "Kousha Etessami.....http://dblp.org/pers/hd/e/Etessami:Kousha", "Mihalis Yannakakis.....http://dblp.org/pers/hd/y/Yannakakis:Mihalis"], "pages": 16}