{"title": "Proof-carrying cloud computation: The case of convex optimization.", "fields": ["data integrity", "engineering optimization", "convex optimization", "correctness", "outsourcing", "software as a service", "cloud testing"], "abstract": "Cloud computing offers a great opportunity to bridge the gap between the fast growing computation needs and limited local resources. However, without the adequate trust and strong integrity assurance, it would be difficult to expect clients to completely turn over control of their computation to the cloud. Hence, securing cloud computation becomes an imperative and challenging task, especially in the aspect of integrity verification. To address the challenge, we propose a hassle-free, fixed-rate, and job-based software as a service cloud model along with the integrity verification mechanisms, with particular focus on outsourcing the widely applicable engineering optimization problem, i.e., convex optimization. We aim to construct efficient integrity verification mechanisms using application-specific techniques. Our security design does not require the use of heavy cryptographic tools. Instead, we leverage the inherent structure of the optimization problems and make the computation outsourcing proof-carrying to achieve efficient integrity verification. The proposed design provides substantial computational savings on the client side and introduces marginal overhead on the cloud side. We further prove its correctness and soundness. The extensive experiments under the real cloud environment show our mechanisms ensure strong integrity assurance with high efficiency on both the client and the cloud sides and are readily applicable in current practice.", "citation": "Citations (12)", "departments": ["University at Buffalo", "City University of Hong Kong", "University at Buffalo", "Concordia University", "National and Kapodistrian University of Athens", "University at Buffalo", "City University of Hong Kong", "Wuhan University", "University at Buffalo", "Concordia University"], "authors": ["Zhen Xu.....http://dblp.org/pers/hd/x/Xu:Zhen", "Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong", "Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Lingyu Wang.....http://dblp.org/pers/hd/w/Wang_0001:Lingyu"], "conf": "infocom", "year": "2013", "pages": 5}