{"title": "ARTSense: Anonymous reputation and trust in participatory sensing.", "fields": ["participatory sensing", "personally identifiable information", "communication source", "anonymity", "computational trust"], "abstract": "With the proliferation of sensor-embedded mobile computing devices, participatory sensing is becoming popular to collect information from and outsource tasks to participating users. These applications deal with a lot of personal information, e.g., users' identities and locations at a specific time. Therefore, we need to pay a deeper attention to privacy and anonymity. However, from a data consumer's point of view, we want to know the source of the sensing data, i.e., the identity of the sender, in order to evaluate how much the data can be trusted. “Anonymity” and “trust” are two conflicting objectives in participatory sensing networks, and there are no existing research efforts which investigated the possibility of achieving both of them at the same time. In this paper, we propose ARTSense, a framework to solve the problem of “trust without identity” in participatory sensing networks. Our solution consists of a privacy-preserving provenance model, a data trust assessment scheme and an anonymous reputation management protocol. We have shown that ARTSense achieves the anonymity and security requirements. Validations are done to show that we can capture the trust of information and reputation of participants accurately.", "citation": "Citations (127)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of Illinois at Urbana–Champaign"], "authors": ["Xinlei (Oscar) Wang.....http://dblp.org/pers/hd/w/Wang:Xinlei_=Oscar=", "Wei Cheng.....http://dblp.org/pers/hd/c/Cheng:Wei", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant", "Tarek F. Abdelzaher.....http://dblp.org/pers/hd/a/Abdelzaher:Tarek_F="], "conf": "infocom", "year": "2013", "pages": 9}