{"title": "On the throughput-delay trade-off in large-scale MANETs with a generalized i.i.d. mobility model.", "fields": ["mobile ad hoc network", "asymptotically optimal algorithm", "vehicular ad hoc network", "independent and identically distributed random variables", "exploit"], "abstract": "In mobile ad hoc networks (MANETs), it is important to understand the throughput-delay trade-off (TD trade-off) problem in large-scale scenarios. In the literature, the TD tradeoff problem has been studied extensively and many of them are based on the independent and identically distributed (i.i.d.) mobility model, in which each node can randomly move to any place in the network, after every time slot. Although the i.i.d. model has been widely used, it cannot fully represent MANETs in which nodes change positions less frequently. To characterize such MANETs, in this paper, we propose a generalized i.i.d. (g.i.i.d.) mobility model, in which each node moves once after every 1/f (0 <; f ≤ 1) time slots, and remains static between two moves. To investigate the TD trade-off under the g.i.i.d. model, we develop a novel multi-relay multi-hop (MRMH) scheme that exploits the opportunities of multi-hop transmissions when the network is static. Furthermore, to enable the multi-hop transmissions, we construct a new percolation highway system, which has not been used in the TD trade-off analysis for MANETs. Using the proposed MRMH scheme, we develop and prove constructive bounds for throughput and delay in MANETs with different scales of f. Our constructive bound is asymptotically optimal for f = 1 (i.e., the i.i.d. model).", "citation": "Citations (7)", "departments": ["Central South University", "University of Puerto Rico at Mayagüez", "City University of Hong Kong", "University of Nebraska–Lincoln", "University of Science and Technology of China"], "authors": ["Wang Liu.....http://dblp.org/pers/hd/l/Liu:Wang", "Kejie Lu.....http://dblp.org/pers/hd/l/Lu:Kejie", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Yi Qian.....http://dblp.org/pers/hd/q/Qian:Yi", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng", "Jun Liu.....http://dblp.org/pers/hd/l/Liu:Jun", "Dapeng Oliver Wu.....http://dblp.org/pers/hd/w/Wu:Dapeng_Oliver"], "conf": "infocom", "year": "2013", "pages": 9}