{"title": "Globally distributed system developers: their trust expectations and processes.", "fields": ["empirical research", "distributed development", "qualitative research", "competence", "computational trust"], "abstract": "Trust remains a challenge in globally distributed development teams. In order to investigate how trust plays out in this context, we conducted a qualitative study of 5 multi-national IT organizations. We interviewed 58 individuals across 10 countries and made two principal findings. First, study participants described trust in terms of their expectations of their colleagues. These expectations fell into one of three dimensions: that socially correct behavior will persist, that team members possess technical competency, and that individuals will demonstrate concern for others. Second, our study participants described trust as a dynamic process, with phases including formation, dissolution, adjustment and restoration. We provide new insights into these dimensions and phases of trust within distributed teams which extend existing literature. Our study also provides guidelines on effective practices within distributed teams in addition to providing implications for the extension of software engineering and collaboration tools.", "citation": "Citations (23)", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Irvine", "University of California, Irvine", "University of California, Irvine"], "authors": ["Ban Al-Ani.....http://dblp.org/pers/hd/a/Al=Ani:Ban", "Matthew J. Bietz.....http://dblp.org/pers/hd/b/Bietz:Matthew_J=", "Yi Wang.....http://dblp.org/pers/hd/w/Wang_0013:Yi", "Erik H. Trainer.....http://dblp.org/pers/hd/t/Trainer:Erik_H=", "Benjamin Koehne.....http://dblp.org/pers/hd/k/Koehne:Benjamin", "Sabrina Marczak.....http://dblp.org/pers/hd/m/Marczak:Sabrina", "David F. Redmiles.....http://dblp.org/pers/hd/r/Redmiles:David_F=", "Rafael Prikladnicki.....http://dblp.org/pers/hd/p/Prikladnicki:Rafael"], "conf": "cscw", "year": "2013", "pages": 12}