{"title": "Leveraging load migration and basestaion consolidation for green communications in virtualized Cognitive Radio Networks.", "fields": ["heuristic", "cognitive radio", "special case", "virtual network", "network planning and design"], "abstract": "With wireless resource virtualization, multiple Mobile Virtual Network Operators (MVNOs) can be supported over a shared physical wireless network and traffic loads in a Base Station (BS) can be easily migrated to more power-efficient BSs in its neighborhood such that idle BSs can be turned off or put into sleep to save power. In this paper, we propose to leverage load migration and BS consolidation for green communications and consider a power-efficient network planning problem in virtualized Cognitive Radio Networks (CRNs) with the objective of minimizing total power consumption while meeting traffic load demand of each MVNO. First, we present a Mixed Integer Linear Programming (MILP) to provide optimal solutions. Then we present a general optimization framework to guide algorithm design, which solves two subproblems, channel assignment and load allocation, in sequence. For channel assignment, we present a (Δ1)-approximation algorithm (where Δ is the maximum number of BSs a BS can potentially interfere with). For load allocation, we present a polynomial-time optimal algorithm for a special case where BSs are power-proportional as well as two effective heuristic algorithms for the general case. In addition, we present an effective heuristic algorithm that jointly solves the two subproblems. It has been shown by extensive simulation results that the proposed algorithms produce close-to-optimal solutions, and moreover, achieve over 45% power savings compared to a baseline algorithm that does not migrate loads or consolidate BSs.", "citation": "Citations (6)", "departments": ["Syracuse University", "Syracuse University", "Syracuse University", "AT&T Labs", "InterDigital, Inc."], "authors": ["Xiang Sheng.....http://dblp.org/pers/hd/s/Sheng:Xiang", "Jian Tang.....http://dblp.org/pers/hd/t/Tang_0008:Jian", "Chenfei Gao.....http://dblp.org/pers/hd/g/Gao:Chenfei", "Weiyi Zhang.....http://dblp.org/pers/hd/z/Zhang:Weiyi", "Chonggang Wang.....http://dblp.org/pers/hd/w/Wang:Chonggang"], "conf": "infocom", "year": "2013", "pages": 9}