{"title": "RERAN: timing- and touch-sensitive record and replay for Android.", "fields": ["graphical user interface", "android beam", "android", "touchscreen", "gesture recognition"], "abstract": "Touchscreen-based devices such as smartphones and tablets are gaining popularity, but their rich input capabilities pose new development and testing complications. To alleviate this problem, we present an approach and tool named Reran that permits record-and-replay for the Android smartphone platform. Existing GUI-level record-and-replay approaches are inadequate due to the expressiveness of the smartphone domain, in which applications support sophisticated GUI gestures, depend on inputs from a variety of sensors on the device, and have precise timing requirements among the various input events. We address these challenges by directly capturing the low-level event stream on the phone, which includes both GUI events and sensor events, and replaying it with microsecond accuracy. Moreover, Reran does not require access to app source code, perform any app rewriting, or perform any modifications to the virtual machine or Android platform. We demonstrate RERAN's applicability in a variety of scenarios, including (a) replaying 86 out of the Top-100 Android apps on Google Play; (b) reproducing bugs in popular apps, e.g., Firefox, Facebook, Quickoffice; and (c) fast-forwarding executions. We believe that our versatile approach can help both Android developers and researchers.", "citation": "Citations (226)", "departments": ["University of California, Los Angeles", "University of California, Riverside", "University of California, Riverside", "University of California, Los Angeles"], "authors": ["Lorenzo Gomez.....http://dblp.org/pers/hd/g/Gomez:Lorenzo", "Iulian Neamtiu.....http://dblp.org/pers/hd/n/Neamtiu:Iulian", "Tanzirul Azim.....http://dblp.org/pers/hd/a/Azim:Tanzirul", "Todd D. Millstein.....http://dblp.org/pers/hd/m/Millstein:Todd_D="], "conf": "icse", "year": "2013", "pages": 10}