{"title": "Why do they still use paper?: understanding data collection and use in Autism education.", "fields": ["contextual inquiry", "graph", "computer supported cooperative work", "group decision making", "autism"], "abstract": "Autism education programs for children collect and use large amounts of behavioral data on each student. Staff use paper almost exclusively to collect these data, despite significant problems they face in tracking student data in situ, filling out data sheets and graphs on a daily basis, and using the sheets in collaborative decision making. We conducted fieldwork to understand data collection and use in the domain of autism education to explain why current technology had not met staff needs. We found that data needs are complex and unstandardized, immediate demands of the job interfere with staff ability to collect in situ data, and existing technology for data collection is inadequate. We also identified opportunities for technology to improve sharing and use of data. We found that data sheets are idiosyncratic and not useful without human mediation; improved communication with parents could benefit children's development; and staff are willing, and even eager, to incorporate technology. These factors explain the continued dependence on paper for data collection in this environment, and reveal opportunities for technology to support data collection and improve use of collected data.", "citation": "Citations (16)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Gabriela Marcu.....http://dblp.org/pers/hd/m/Marcu:Gabriela", "Kevin Tassini.....http://dblp.org/pers/hd/t/Tassini:Kevin", "Quintin Carlson.....http://dblp.org/pers/hd/c/Carlson:Quintin", "Jillian Goodwyn.....http://dblp.org/pers/hd/g/Goodwyn:Jillian", "Gabrielle Rivkin.....http://dblp.org/pers/hd/r/Rivkin:Gabrielle", "Kevin J. Schaefer.....http://dblp.org/pers/hd/s/Schaefer:Kevin_J=", "Anind K. Dey.....http://dblp.org/pers/hd/d/Dey:Anind_K=", "Sara B. Kiesler.....http://dblp.org/pers/hd/k/Kiesler:Sara_B="], "conf": "chi", "year": "2013", "pages": 10}