{"title": "Data debugging with continuous testing.", "fields": ["continuous testing", "shotgun debugging", "security bug", "algorithmic program debugging", "database testing"], "abstract": "Today, systems rely as heavily on data as on the software that manipulates those data. Errors in these systems are incredibly costly, annually resulting in multi-billion dollar losses, and, on multiple occasions, in death. While software debugging and testing have received heavy research attention, less effort has been devoted to data debugging: discovering system errors caused by well-formed but incorrect data. In this paper, we propose continuous data testing: using otherwise-idle CPU cycles to run test queries, in the background, as a user or database administrator modifies a database. This technique notifies the user or administrator about a data bug as quickly as possible after that bug is introduced, leading to at least three benefits: (1) The bug is discovered quickly and can be fixed before it is likely to cause a problem. (2) The bug is discovered while the relevant change is fresh in the user's or administrator's mind, increasing the chance that the underlying cause of the bug, as opposed to only the discovered side-effect, is fixed. (3) When poor documentation or company policies contribute to bugs, discovering the bug quickly is likely to identify these contributing factors, facilitating updating documentation and policies to prevent similar bugs in the future. We describe the problem space and potential benefits of continuous data testing, our vision for the technique, challenges we encountered, and our prototype implementation for PostgreSQL. The prototype's low overhead shows promise that continuous data testing can address the important problem of data debugging.", "citation": "Citations (10)", "departments": ["University of Washington", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Kivanç Muslu.....http://dblp.org/pers/hd/m/Muslu:Kivan=ccedil=", "Yuriy Brun.....http://dblp.org/pers/hd/b/Brun:Yuriy", "Alexandra Meliou.....http://dblp.org/pers/hd/m/Meliou:Alexandra"], "conf": "sigsoft", "year": "2013", "pages": 4}