{"title": "Predicting query execution time: Are optimizer cost models really unusable?", "fields": ["online aggregation", "web query classification", "view", "sargable", "query plan"], "abstract": "Predicting query execution time is useful in many database management issues including admission control, query scheduling, progress monitoring, and system sizing. Recently the research community has been exploring the use of statistical machine learning approaches to build predictive models for this task. An implicit assumption behind this work is that the cost models used by query optimizers are insufficient for query execution time prediction. In this paper we challenge this assumption and show while the simple approach of scaling the optimizer's estimated cost indeed fails, a properly calibrated optimizer cost model is surprisingly effective. However, even a well-tuned optimizer cost model will fail in the presence of errors in cardinality estimates. Accordingly we investigate the novel idea of spending extra resources to refine estimates for the query plan after it has been chosen by the optimizer but before execution. In our experiments we find that a well calibrated query optimizer model along with cardinality estimation refinement provides a low overhead way to provide estimates that are always competitive and often much better than the best reported numbers from the machine learning approaches.", "citation": "Citations (93)", "departments": ["University of Wisconsin-Madison", "NEC Labs. Ameri ... ertino, CA, USA", "NEC Labs. Ameri ... ertino, CA, USA", "NEC Labs. Ameri ... ertino, CA, USA", "NEC Labs. Ameri ... ertino, CA, USA"], "authors": ["Wentao Wu.....http://dblp.org/pers/hd/w/Wu_0001:Wentao", "Yun Chi.....http://dblp.org/pers/hd/c/Chi:Yun", "Shenghuo Zhu.....http://dblp.org/pers/hd/z/Zhu:Shenghuo", "Jun'ichi Tatemura.....http://dblp.org/pers/hd/t/Tatemura:Jun=ichi", "Hakan Hacigümüs.....http://dblp.org/pers/hd/h/Hacig=uuml=m=uuml=s:Hakan", "Jeffrey F. Naughton.....http://dblp.org/pers/hd/n/Naughton:Jeffrey_F="], "conf": "icde", "year": "2013", "pages": 12}