{"title": "Exploiting application dynamism and cloud elasticity for continuous dataflows.", "fields": ["dataflow", "data center", "cloud computing", "bin packing problem", "heuristics"], "abstract": "Contemporary continuous dataflow systems use elastic scaling on distributed cloud resources to handle variable data rates and to meet applications' needs while attempting to maximize resource utilization. However, virtualized clouds present an added challenge due to the variability in resource performance -- over time and space -- thereby impacting the application's QoS. Elastic use of cloud resources and their allocation to continuous dataflow tasks need to adapt to such infrastructure dynamism. In this paper, we develop the concept of \"dynamic dataflows\" as an extension to continuous dataflows that utilizes  alternate tasks  and allows additional control over the dataflow's cost and QoS. We formalize an optimization problem to perform both deployment and runtime cloud resource management for such dataflows, and define an objective function that allows trade-off between the application's  value  against resource  cost . We present two novel heuristics, local and global, based on the variable sized bin packing heuristics to solve this NP-hard problem. We evaluate the heuristics against a static allocation policy for a dataflow with different data rate profiles that is simulated using VM performance traces from a private cloud data center. The results show that the heuristics are effective in intelligently utilizing cloud elasticity to mitigate the effect of both input data rate and cloud resource performance variabilities on QoS.", "citation": "Citations (16)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California"], "authors": ["Alok Gautam Kumbhare.....http://dblp.org/pers/hd/k/Kumbhare:Alok_Gautam", "Yogesh Simmhan.....http://dblp.org/pers/hd/s/Simmhan:Yogesh", "Viktor K. Prasanna.....http://dblp.org/pers/hd/p/Prasanna:Viktor_K="], "conf": "sc", "year": "2013", "pages": 12}