{"title": "Online multimodal deep similarity learning with application to image retrieval.", "fields": ["deep learning", "multimedia information retrieval", "autoencoder", "active learning", "online machine learning"], "abstract": "Recent years have witnessed extensive studies on distance metric learning (DML) for improving similarity search in multimedia information retrieval tasks. Despite their successes, most existing DML methods suffer from two critical limitations: (i) they typically attempt to learn a linear distance function on the input feature space, in which the assumption of linearity limits their capacity of measuring the similarity on complex patterns in real-world applications; (ii) they are often designed for learning distance metrics on uni-modal data, which may not effectively handle the similarity measures for multimedia objects with multimodal representations. To address these limitations, in this paper, we propose a novel framework of online multimodal deep similarity learning (OMDSL), which aims to optimally integrate multiple deep neural networks pretrained with stacked denoising autoencoder. In particular, the proposed framework explores a unified two-stage online learning scheme that consists of (i) learning a flexible nonlinear transformation function for each individual modality, and (ii) learning to find the optimal combination of multiple diverse modalities simultaneously in a coherent process. We conduct an extensive set of experiments to evaluate the performance of the proposed algorithms for multimodal image retrieval tasks, in which the encouraging results validate the effectiveness of the proposed technique.", "citation": "Citations (117)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Pengcheng Wu.....http://dblp.org/pers/hd/w/Wu:Pengcheng", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H=", "Hao Xia.....http://dblp.org/pers/hd/x/Xia:Hao", "Peilin Zhao.....http://dblp.org/pers/hd/z/Zhao:Peilin", "Dayong Wang.....http://dblp.org/pers/hd/w/Wang:Dayong", "Chunyan Miao.....http://dblp.org/pers/hd/m/Miao:Chunyan"], "conf": "mm", "year": "2013", "pages": 10}