{"title": "Cooperative relay selection in cognitive radio networks.", "fields": ["cognitive radio", "relay", "collision", "optimal stopping", "relay channel", "system requirements"], "abstract": "The benefits of cognitive radio networking (CRN) have been well recognized with the emerging wireless applications in recent years. While many existing works assume that the secondary transmissions are negative interferences to the primary users (PUs), in this paper, the authors take secondary users (SUs) as positive potential cooperators for the PUs. In particular, they consider the problem of cooperative relay selection, in which the PUs actively select appropriate SUs as relay nodes to enhance their transmission performance. The most critical challenge for such a problem is how to select a relay efficiently. Due to the potentially large number of SUs, it is infeasible for a PU to first scan all the SUs and then pick the best. Basically, the PU transmitter intends to observe the SUs sequentially. After observing an SU, the PU needs to make a decision regarding whether to terminate its observation and use the current SU as its relay or to skip it and observe the next SU. The authors address this problem by using the optimal stopping theory and derive the optimal stopping rule. They also discuss the optimal observation order of the SUs and analyze the collision probability. To evaluate the performance of their proposed scheme, they compare their optimal stopping policy with the random selection policy through simulation study, and the results demonstrate the superiority of their policy. Extensive simulation study is conducted to investigate the impact of different parameters on the system performance, and the results indicate that their algorithm can satisfy different system requirements by carefully tuning the corresponding system parameters.", "citation": "Citations (73)", "departments": ["Beijing Jiaotong University", "Beijing Jiaotong University", "George Washington University", "Beijing Jiaotong University", "George Washington University", "Beijing Jiaotong University", "Beijing Jiaotong University", "George Washington University", "George Washington University", "George Washington University"], "authors": ["Tao Jing.....http://dblp.org/pers/hd/j/Jing:Tao", "Shixiang Zhu.....http://dblp.org/pers/hd/z/Zhu:Shixiang", "Hongjuan Li.....http://dblp.org/pers/hd/l/Li:Hongjuan", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen", "Yan Huo.....http://dblp.org/pers/hd/h/Huo:Yan"], "conf": "infocom", "year": "2013", "pages": 5}