{"title": "Jalangi: a selective record-replay and dynamic analysis framework for JavaScript.", "fields": ["javascript", "taint checking", "x86", "concolic testing", "slowdown"], "abstract": "JavaScript is widely used for writing client-side web applications and is getting increasingly popular for writing mobile applications. However, unlike C, C++, and Java, there are not that many tools available for analysis and testing of JavaScript applications. In this paper, we present a simple yet powerful framework, called Jalangi, for writing heavy-weight dynamic analyses. Our framework incorporates two key techniques: 1) selective record-replay, a technique which enables to record and to faithfully replay a user-selected part of the program, and 2) shadow values and shadow execution, which enables easy implementation of heavy-weight dynamic analyses. Our implementation makes no special assumption about JavaScript, which makes it applicable to real-world JavaScript programs running on multiple platforms. We have implemented concolic testing, an analysis to track origins of nulls and undefined, a simple form of taint analysis, an analysis to detect likely type inconsistencies, and an object allocation profiler in Jalangi. Our evaluation of Jalangi on the SunSpider benchmark suite and on five web applications shows that Jalangi has an average slowdown of 26X during recording and 30X slowdown during replay and analysis. The slowdowns are comparable with slowdowns reported for similar tools, such as PIN and Valgrind for x86 binaries. We believe that the techniques proposed in this paper are applicable to other dynamic languages.", "citation": "Citations (167)", "departments": ["University of California, Berkeley", "Samsung", "Samsung", "Samsung"], "authors": ["Koushik Sen.....http://dblp.org/pers/hd/s/Sen:Koushik", "Swaroop Kalasapur.....http://dblp.org/pers/hd/k/Kalasapur:Swaroop", "Tasneem G. Brutch.....http://dblp.org/pers/hd/b/Brutch:Tasneem_G=", "Simon Gibbs.....http://dblp.org/pers/hd/g/Gibbs:Simon"], "conf": "sigsoft", "year": "2013", "pages": 11}