{"title": "Focused matrix factorization for audience selection in display advertising.", "fields": ["product classification", "matrix decomposition", "sparse matrix", "collaborative filtering", "display advertising"], "abstract": "Audience selection is a key problem in display advertising systems in which we need to select a list of users who are interested (i.e., most likely to buy) in an advertising campaign. The users' past feedback on this campaign can be leveraged to construct such a list using collaborative filtering techniques such as matrix factorization. However, the user-campaign interaction is typically extremely sparse, hence the conventional matrix factorization does not perform well. Moreover, simply combining the users feedback from all campaigns does not address this since it dilutes the focus on target campaign in consideration. To resolve these issues, we propose a novel focused matrix factorization model (FMF) which learns users' preferences towards the specific campaign products, while also exploiting the information about related products. We exploit the product taxonomy to discover related campaigns, and design models to discriminate between the users' interest towards campaign products and non-campaign products. We develop a parallel multi-core implementation of the FMF model and evaluate its performance over a real-world advertising dataset spanning more than a million products. Our experiments demonstrate the benefits of using our models over existing approaches.", "citation": "Citations (14)", "departments": ["Google", "Google", "Twitter", "Google", "Google"], "authors": ["Bhargav Kanagal.....http://dblp.org/pers/hd/k/Kanagal:Bhargav", "Amr Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Amr", "Sandeep Pandey.....http://dblp.org/pers/hd/p/Pandey:Sandeep", "Vanja Josifovski.....http://dblp.org/pers/hd/j/Josifovski:Vanja", "Lluis Garcia Pueyo.....http://dblp.org/pers/hd/p/Pueyo:Lluis_Garcia", "Jeffrey Yuan.....http://dblp.org/pers/hd/y/Yuan:Jeffrey"], "conf": "icde", "year": "2013", "pages": 12}