{"title": "How shadowing hurts vehicular communications and how dynamic beaconing can help.", "fields": ["broadcast radiation", "vehicular ad hoc network", "mobile telephony", "low latency", "broadcasting", "hop", "channel"], "abstract": "We study the effect of radio signal shadowing dynamics, caused by vehicles and by buildings, on the performance of beaconing protocols in Inter-Vehicular Communication (IVC). Recent research indicates that beaconing, i.e., one hop message broadcast, shows excellent characteristics and can outperform other communication approaches for both safety and efficiency applications, which require low latency and wide area information dissemination, respectively. To mitigate the broadcast storm problem, adaptive beaconing solutions have been proposed and designed. We show how shadowing dynamics of moving obstacles hurt IVC, reducing the performance of beaconing protocols. To the best of our knowledge, this is one of the first studies on identifying the problem and the underlying challenges and proposing the opportunities presented by such challenges. Shadowing also limits the risk of overloading the wireless channel. We demonstrate how these challenges and opportunities can be taken into account and outline a novel approach to dynamic beaconing. It provides low-latency communication (i.e., very short beaconing intervals), while ensuring not to overload the wireless channel. The presented simulation results substantiate our theoretical considerations.", "citation": "Citations (104)", "departments": ["University of Paderborn", "University of Innsbruck", "University of Innsbruck", "Carnegie Mellon University", "University of Trento", "University of Innsbruck", "University of Innsbruck", "University of Innsbruck", "Carnegie Mellon University", "University of Trento"], "authors": ["Christoph Sommer.....http://dblp.org/pers/hd/s/Sommer_0001:Christoph", "Stefan Joerer.....http://dblp.org/pers/hd/j/Joerer:Stefan", "Michele Segata.....http://dblp.org/pers/hd/s/Segata:Michele", "Ozan K. Tonguz.....http://dblp.org/pers/hd/t/Tonguz:Ozan_K=", "Renato Lo Cigno.....http://dblp.org/pers/hd/c/Cigno:Renato_Lo", "Falko Dressler.....http://dblp.org/pers/hd/d/Dressler:Falko"], "conf": "infocom", "year": "2013", "pages": 5}