{"title": "Rejecting the attack: Source authentication for Wi-Fi management frames using CSI Information.", "fields": ["channel state information", "spoofing attack", "decorrelation", "physical layer", "rss"], "abstract": "Comparing to well protected data frames, Wi-Fi management frames (MFs) are extremely vulnerable to various attacks. Since MFs are transmitted without encryption or authentication, attackers can easily launch various attacks by forging the MFs. In a collaborative environment with many Wi-Fi sniffers, such attacks can be easily detected by sensing the anomaly RSS changes. However, it is quite difficult to identify these spoofing attacks without assistance from other nodes. By exploiting some unique characteristics (e.g., rapid spatial decorrelation, independence of Txpower, and much richer dimensions) of 802.11n Channel State Information (CSI), we design and implement CSITE, a prototype system to authenticate the Wi-Fi management frames on PHY layer merely by one station. Our system CSITE, built upon off-the-shelf hardware, achieves precise spoofing detection without collaboration and in-advance fingerprint. Several novel techniques are designed to address the challenges caused by user mobility and channel dynamics. To verify the performances of our solution, we conduct extensive evaluations in various scenarios. Our test results show that our design significantly outperforms the RSS-based method. We observe about 8 times improvement by CSITE over RSS-based method on the falsely accepted attacking frames.", "citation": "Citations (34)", "departments": ["Xi'an Jiaotong University", "Xi'an Jiaotong University", "Illinois Institute of Technology", "Xi'an Jiaotong University", "Xi'an Jiaotong University"], "authors": ["Zhiping Jiang.....http://dblp.org/pers/hd/j/Jiang:Zhiping", "Jizhong Zhao.....http://dblp.org/pers/hd/z/Zhao:Jizhong", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Jinsong Han.....http://dblp.org/pers/hd/h/Han:Jinsong", "Wei Xi.....http://dblp.org/pers/hd/x/Xi:Wei"], "conf": "infocom", "year": "2013", "pages": 9}