{"title": "Rolling Riemannian Manifolds to Solve the Multi-class Classification Problem.", "fields": ["tangent space", "contextual image classification", "multiclass classification", "riemannian manifold", "statistical manifold"], "abstract": "In the past few years there has been a growing interest on geometric frameworks to learn supervised classification models on Riemannian manifolds [32, 28]. A popular framework, valid over any Riemannian manifold, was proposed in [32] for binary classification. Once moving from binary to multi-class classification this paradigm is not valid anymore, due to the spread of multiple positive classes on the manifold [28]. It is then natural to ask whether the multi-class paradigm could be extended to operate on a large class of Riemannian manifolds. We propose a mathematically well-founded classification paradigm that allows to extend the work in [32] to multi-class models, taking into account the structure of the space. The idea is to project all the data from the manifold onto an affine tangent space at a particular point. To mitigate the distortion induced by local diffeomorphisms, we introduce for the first time in the computer vision community a well-founded mathematical concept, so-called Rolling map [22, 17]. The novelty in this alternate school of thought is that the manifold will be firstly rolled (without slipping or twisting) as a rigid body, then the given data is unwrapped onto the affine tangent space, where the classification is performed.", "citation": "Citations (14)", "year": "2013", "departments": ["University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra"], "conf": "cvpr", "authors": ["Rui Caseiro.....http://dblp.org/pers/hd/c/Caseiro:Rui", "Pedro Martins.....http://dblp.org/pers/hd/m/Martins_0004:Pedro", "João F. Henriques.....http://dblp.org/pers/hd/h/Henriques:Jo=atilde=o_F=", "Fatima Silva Leite.....http://dblp.org/pers/hd/l/Leite:Fatima_Silva", "Jorge P. Batista.....http://dblp.org/pers/hd/b/Batista:Jorge_P="], "pages": 8}