{"title": "Performance bounds of energy detection with signal uncertainty in cognitive radio networks.", "fields": ["false alarm", "cognitive radio", "moment", "ambiguity", "channel"], "abstract": "The harmonic coexistence of secondary users (SUs) and primary users (PUs) in cognitive radio networks requires SUs to identify the idle spectrum bands. One common approach to achieve spectrum awareness is through spectrum sensing, which usually assumes known distributions of the received signals. However, due to the nature of wireless channels, such an assumption is often too strong to be realistic, and leads to unreliable detection performance in practical networks. In this paper, we study the sensing performance under distribution uncertainty, i.e., the actual distribution functions of the received signals are subject to ambiguity and not fully known. Firstly, we define a series of uncertainty models based on signals' moment statistics in different spectrum conditions. Then we present mathematical formulations to study the detection performance corresponding to these uncertainty models. Moreover, in order to make use of the distribution information embedded in historical data, we extract a reference distribution from past channel observations, and define a new uncertainty model in terms of it. With this uncertainty model, we propose two iterative procedures to study the false alarm probability and detection probability, respectively. Numerical results show that the detection performance with a reference distribution is less conservative compared with that of the uncertainty models merely based on signal statistics.", "citation": "Citations (7)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Huazhong University of Science and Technology", "University of Waterloo"], "authors": ["Shimin Gong.....http://dblp.org/pers/hd/g/Gong:Shimin", "Ping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Ping", "Wei Liu.....http://dblp.org/pers/hd/l/Liu_0004:Wei", "Weihua Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Weihua"], "conf": "infocom", "year": "2013", "pages": 9}