{"title": "Fourier Sparsity, Spectral Norm, and the Log-Rank Conjecture.", "fields": ["matrix norm", "parity", "fourier analysis", "communication complexity", "polynomial"], "abstract": "We study Boolean functions with sparse Fourier spectrum or small spectral norm, and show their applications to the Log-rank Conjecture for XOR functions f(x ⊕ y) - a fairly large class of functions including well studied ones such as Equality and Hamming Distance. The rank of the communication matrix M f  for such functions is exactly the Fourier sparsity of f. Let d = deg 2 (f) be the F 2 -degree of f and DCC(f · ⊕) stand for the deterministic communication complexity for f(x ⊕ y). We show that 1) DCC(f · ⊕) = O(2 d2/2  log d- 2 ∥f̂∥ 1 ). In particular, the Log-rank conjecture holds for XOR functions with constant F 2 -degree. 2) D CC (f · ⊕) = O(d∥f̂∥ 1 ) = O(√(rank(M f ))). This improves the (trivial) linear bound by nearly a quadratic factor. We obtain our results through a degree-reduction protocol based on a variant of polynomial rank, and actually conjecture that the communication cost of our protocol is at most log O(1)  rank(M f ). The above bounds are obtained from different analysis for the number of parity queries required to reduce f's F 2 -degree. Our bounds also hold for the parity decision tree complexity of f, a measure that is no less than the communication complexity. Along the way we also prove several structural results about Boolean functions with small Fourier sparsity ∥f̂∥ 0  or spectral norm ∥f̂∥ 1 , which could be of independent interest. For functions f with constant F 2 -degree, we show that: 1) f can be written as the summation of quasi-polynomially many indicator functions of subspaces with ±-signs, improving the previous doubly exponential upper bound by Green and Sanders; 2) being sparse in Fourier domain is polynomially equivalent to having a small parity decision tree complexity; and 3) f depends only on polylog∥f̂∥ 1  linear functions of input variables. For functions f with small spectral norm, we show that: 1) there is an affine subspace of co dimension ∥f̂∥ 1  on which f(x) is a constant, and 2) there is a parity decision ∥f̂∥ 1 log∥f̂∥ 0  for computing f.", "citation": "Citations (21)", "year": "2013", "departments": ["The Chinese University of Hong Kong", "Florida International University", "The Chinese University of Hong Kong"], "conf": "focs", "authors": ["Hing Yin Tsang.....http://dblp.org/pers/hd/t/Tsang:Hing_Yin", "Chung Hoi Wong.....http://dblp.org/pers/hd/w/Wong:Chung_Hoi", "Ning Xie.....http://dblp.org/pers/hd/x/Xie_0002:Ning", "Shengyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Shengyu"], "pages": 10}