{"title": "An analysis of the EMV channel establishment protocol.", "fields": ["key exchange", "elliptic curve cryptography", "computer network", "computer science", "secure channel", "universal composability", "channel", "authentication protocol"], "abstract": "With over 1.6 billion debit and credit cards in use worldwide, the EMV system (a.k.a. \"Chip-and-PIN\") has become one of the most important deployed cryptographic protocol suites. Recently, the EMV consortium has decided to upgrade the existing RSA based system with a new system relying on Elliptic Curve Cryptography (ECC). One of the central components of the new system is a protocol that enables a card to establish a secure channel with a card reader. In this paper we provide a security analysis of the proposed protocol, we propose minor changes/clarifications to the \"Request for Comments\" issued in Nov 2012, and demonstrate that the resulting protocol meets the intended security goals.   The structure of the protocol is one commonly encountered in practice: first run a key-exchange to establish a shared key (which performs authentication and key confirmation), only then use the channel to exchange application messages. Although common in practice, this structure takes the protocol out of the reach of most standard security models for key-exchange. Unfortunately, the only models that can cope with the above structure suffer from some drawbacks that make them unsuitable for our analysis. Our second contribution is to provide new security models for channel establishment protocols. Our models have a more inclusive syntax, are quite general, deal with a realistic notion of authentication (one-sided authentication as required by EMV), and do not suffer from the drawbacks that we identify in prior models.", "citation": "Not cited", "year": "2013", "departments": ["Tel Aviv University", "University of Bristol", "University of Bristol", "University of Bristol"], "conf": "ccs", "authors": ["Christina Brzuska.....http://dblp.org/pers/hd/b/Brzuska:Christina", "Nigel P. Smart.....http://dblp.org/pers/hd/s/Smart:Nigel_P=", "Bogdan Warinschi.....http://dblp.org/pers/hd/w/Warinschi:Bogdan", "Gaven J. Watson.....http://dblp.org/pers/hd/w/Watson:Gaven_J="], "pages": 14}