{"title": "Intra-data-center traffic engineering with ensemble routing.", "fields": ["network management", "approximation algorithm", "load balancing", "network topology", "virtual lan"], "abstract": "Today's data centers are shared among multiple tenants running a wide range of applications. These applications require a network with a scalable and robust layer-2 network management solution that enables load-balancing and QoS provisioning. Ensemble routing was proposed to achieve management scalability and robustness by using Virtual Local Area Networks (VLANs) and operating on the granularity of flow ensembles, i.e. group of flows. The key challenge of intra-data-center traffic engineering with ensemble routing is the combinatorial optimization of VLAN assignment, i.e., optimally assigning flow ensembles to VLANs to achieve load balancing and low network costs. Based on the Markov approximation framework, we solve the VLAN assignment problem with a general objective function and arbitrary network topologies by designing approximation algorithms with close-to-optimal performance guarantees. We study several properties of our algorithms, including performance optimality, perturbation bound, convergence of algorithms and impacts of algorithmic parameter choices. Then we extend these results to variants of VLAN assignment problem, including interaction with TCP congestion and QoS considerations. We validate our analytical results by conducting extensive numerical experiments. The results show that our algorithms can be tuned to meet different temporal constraints, incorporate fine-grained traffic management, overcome traffic measurement limitations, and tolerate imprecise and incomplete traffic matrices.", "citation": "Citations (13)", "departments": ["The Chinese University of Hong Kong", "Princeton University", "Google", "The Chinese University of Hong Kong", "Princeton University"], "authors": ["Ziyu Shao.....http://dblp.org/pers/hd/s/Shao:Ziyu", "Xin Jin.....http://dblp.org/pers/hd/j/Jin:Xin", "Wenjie Jiang.....http://dblp.org/pers/hd/j/Jiang:Wenjie", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung"], "conf": "infocom", "year": "2013", "pages": 9}