{"title": "CCR: Capacity-constrained replication for data delivery in vehicular networks.", "fields": [], "abstract": "Given the unique characteristics of vehicular networks, specifically, frequent communication unavailability and short encounter time, packet replication has been commonly used to facilitate data delivery. Replication enables multiple copies of the same packet to be forwarded towards the destination, which increases the chance of delivery to a target destination. However, this is achieved at the expense of consuming extra already scarce bandwidth resource in vehicular networks. Therefore, it is crucial to investigate the fundamental problem of exploiting constrained network capacity with packet replication. We make the first attempt in this work to address this challenging problem. We first conduct extensive empirical analysis using three large datasets of real vehicle GPS traces. We show that a replication scheme that either underestimates or overestimates the network capacity results in poor delivery performance. Based on the observation, we propose a Capacity-Constrained Replication scheme or CCR for data delivery in vehicular networks. The key idea is to explore the residual capacity for packet replication. We introduce an analytical model for characterizing the relationship among the number of replicated copies of a packet, replication limit and queue length. Based on this insight, we derive the rule for adaptive adjustment towards the optimal replication strategy. We then design a distributed algorithm to dictate how each vehicle can adaptively determine its replication strategy subject to the current network capacity. Extensive simulations based on real vehicle GPS traces show that our proposed CCR can significantly improve delivery ratio comparing with the state-of-the-art algorithms.", "citation": "Citations (11)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Yuchen Wu.....http://dblp.org/pers/hd/w/Wu:Yuchen", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Hongzi Zhu.....http://dblp.org/pers/hd/z/Zhu:Hongzi", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2013", "pages": 9}