{"title": "The case for re-configurable backhaul in cloud-RAN based small cell networks.", "fields": ["access network", "wimax", "backhaul", "small cell", "frequency division multiple access"], "abstract": "Small cells have become an integral component in meeting the increased demand for cellular network capacity. Cloud radio access networks (C-RAN) have been proposed as an effective means to harness the capacity benefits of small cells at reduced capital and operational expenses. With the baseband units (BBUs) separated from the radio access units (RAUs) and moved to the cloud for centralized processing, the backhaul between BBUs and RAUs forms a key component of any C-RAN. In this work, we argue that a one-one mapping of BBUs to RAUs is highly sub-optimal, thereby calling for a functional decoupling of the BBU pool from the RAUs. Further, the backhaul architecture must be made re-configurable to allow the mapping between BBUs and RAUs to be flexible and changed dynamically so as to not just optimize RAN performance but also energy consumption in the BBU pool. Towards this end, we design and implement the first OFDMA-based C-RAN test-bed with a reconfigurable backhaul that allows 4 BBUs to connect flexibly with 4 RAUs using radio-over-fiber technology. We demonstrate the feasibility of our system over a 10 km separation between the BBU pool and RAUs. Further, real world experiments with commercial off-the-shelf WiMAX clients reveal the performance benefits of our reconfigurable backhaul in catering effectively to heterogeneous user (static and mobile clients) and traffic profiles, while also delivering energy benefits in the BBU pool.", "citation": "Citations (103)", "departments": ["Georgia Institute of Technology", "Princeton University", "Princeton University", "Princeton University", "Georgia Institute of Technology"], "authors": ["Cheng Liu.....http://dblp.org/pers/hd/l/Liu:Cheng", "Karthikeyan Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Karthikeyan", "Meilong Jiang.....http://dblp.org/pers/hd/j/Jiang:Meilong", "Sampath Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan:Sampath", "Gee-Kung Chang.....http://dblp.org/pers/hd/c/Chang:Gee=Kung"], "conf": "infocom", "year": "2013", "pages": 9}