{"title": "Interval reverse nearest neighbor queries on uncertain data with Markov correlations.", "fields": ["recommender system", "result set", "group method of data handling", "k nearest neighbors algorithm", "uncertain data"], "abstract": "Nowadays, many applications return to the user a set of results that take the query as their nearest neighbor, which are commonly expressed through reverse nearest neighbor (RNN) queries. When considering moving objects, users would like to find objects that appear in the RNN result set for a period of time in some real-world applications such as collaboration recommendation and anti-tracking. In this work, we formally define the problem of interval reverse nearest neighbor (IRNN) queries over moving objects, which return the objects that maintain nearest neighboring relations to the moving query objects for the longest time in the given interval. Location uncertainty of moving data objects and moving query objects is inherent in various domains, and we investigate objects that exhibit Markov correlations, that is, each object's location is only correlated with its own location at previous timestamp while being independent of other objects. There exists the efficiency challenge for answering IRNN queries on uncertain moving objects with Markov correlations since we have to retrieve not only all the possible locations of each object at current time but also its historically possible locations. To speed up the query processing, we present a general framework for answering IRNN queries on uncertain moving objects with Markov correlations in two phases. In the first phase, we apply space pruning and probability pruning techniques, which reduce the search space significantly. In the second phase, we verify whether each unpruned object is an IRNN of the query object. During this phase, we propose an approach termed Probability Decomposition Verification (PDV) algorithm which avoid computing the probability of any object being an RNN of the query object exactly and thus improve the efficiency of verification. The performance of the proposed algorithm is demonstrated by extensive experiments on synthetic and real datasets, and the experimental results show that our algorithm is more efficient than the Monte-Carlo based approximate algorithm.", "citation": "Citations (13)", "departments": ["Northeastern University", "Northeastern University", "Hong Kong University of Science and Technology", "Northeastern University", "Northeastern University"], "authors": ["Chuanfei Xu.....http://dblp.org/pers/hd/x/Xu:Chuanfei", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0002:Yu", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Jianzhong Qiao.....http://dblp.org/pers/hd/q/Qiao:Jianzhong", "Ge Yu.....http://dblp.org/pers/hd/y/Yu_0001:Ge"], "conf": "icde", "year": "2013", "pages": 12}