{"title": "The role of information diffusion in the evolution of social networks.", "fields": ["social media", "triadic closure", "social network", "artificial intelligence", "machine learning"], "abstract": "Every day millions of users are connected through online social networks, generating a rich trove of data that allows us to study the mechanisms behind human interactions. Triadic closure has been treated as the major mechanism for creating social links: if Alice follows Bob and Bob follows Charlie, Alice will follow Charlie. Here we present an analysis of longitudinal micro-blogging data, revealing a more nuanced view of the strategies employed by users when expanding their social circles. While the network structure affects the spread of information among users, the network is in turn shaped by this communication activity. This suggests a link creation mechanism whereby Alice is more likely to follow Charlie after seeing many messages by Charlie. We characterize users with a set of parameters associated with different link creation strategies, estimated by a Maximum-Likelihood approach. Triadic closure does have a strong effect on link formation, but shortcuts based on traffic are another key factor in interpreting network evolution. However, individual strategies for following other users are highly heterogeneous. Link creation behaviors can be summarized by classifying users in different categories with distinct structural and behavioral characteristics. Users who are popular, active, and influential tend to create traffic-based shortcuts, making the information diffusion process more efficient in the network.", "citation": "Citations (116)", "departments": ["Indiana University Bloomington", "Google", "Northeastern University", "Aix-Marseille University", "Qatar Computing Research Institute"], "authors": ["Lilian Weng.....http://dblp.org/pers/hd/w/Weng:Lilian", "Jacob Ratkiewicz.....http://dblp.org/pers/hd/r/Ratkiewicz:Jacob", "Nicola Perra.....http://dblp.org/pers/hd/p/Perra:Nicola", "Bruno Gonçalves.....http://dblp.org/pers/hd/g/Gon=ccedil=alves:Bruno", "Carlos Castillo.....http://dblp.org/pers/hd/c/Castillo_0001:Carlos", "Francesco Bonchi.....http://dblp.org/pers/hd/b/Bonchi:Francesco", "Rossano Schifanella.....http://dblp.org/pers/hd/s/Schifanella:Rossano", "Filippo Menczer.....http://dblp.org/pers/hd/m/Menczer:Filippo", "Alessandro Flammini.....http://dblp.org/pers/hd/f/Flammini:Alessandro"], "conf": "kdd", "year": "2013", "pages": 9}