{"title": "PHANTOM: practical oblivious computation in a secure processor.", "fields": ["latency", "computational indistinguishability", "adversary", "oblivious ram", "memory controller"], "abstract": "We introduce PHANTOM [1] a new secure processor that obfuscates its memory access trace. To an adversary who can observe the processor's output pins, all memory access traces are computationally indistinguishable (a property known as obliviousness). We achieve obliviousness through a cryptographic construct known as Oblivious RAM or ORAM. We first improve an existing ORAM algorithm and construct an empirical model for its trusted storage requirement. We then present PHANTOM, an oblivious processor whose novel memory controller aggressively exploits DRAM bank parallelism to reduce ORAM access latency and scales well to a large number of memory channels. Finally, we build a complete hardware implementation of PHANTOM on a commercially available FPGA-based server, and through detailed experiments show that PHANTOM is efficient in both area and performance. Accessing 4KB of data from a 1GB ORAM takes 26.2us (13.5us for the data to be available), a 32x slowdown over accessing 4KB from regular memory, while SQLite queries on a population database see 1.2-6x slowdown. PHANTOM is the first demonstration of a practical, oblivious processor and can provide strong confidentiality guarantees when offloading computation to the cloud.", "citation": "Citations (154)", "year": "2013", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of Texas at Austin", "University of Maryland, College Park"], "conf": "ccs", "authors": ["Martin Maas.....http://dblp.org/pers/hd/m/Maas:Martin", "Eric Love.....http://dblp.org/pers/hd/l/Love:Eric", "Emil Stefanov.....http://dblp.org/pers/hd/s/Stefanov:Emil", "Mohit Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Mohit", "Elaine Shi.....http://dblp.org/pers/hd/s/Shi:Elaine", "Krste Asanovic.....http://dblp.org/pers/hd/a/Asanovic:Krste", "John Kubiatowicz.....http://dblp.org/pers/hd/k/Kubiatowicz:John", "Dawn Song.....http://dblp.org/pers/hd/s/Song:Dawn"], "pages": 14}