{"title": "On incentive-based tagging.", "fields": ["text mining", "tag system", "web page", "resource allocation", "incentive"], "abstract": "A social tagging system, such as del.icio.us and Flickr, allows users to annotate resources (e.g., web pages and photos) with text descriptions called tags. Tags have proven to be invaluable information for searching, mining, and recommending resources. In practice, however, not all resources receive the same attention from users. As a result, while some highly-popular resources are over-tagged, most of the resources are under-tagged. Incomplete tagging on resources severely affects the effectiveness of all tag-based techniques and applications. We address an interesting question: if users are paid to tag specific resources, how can we allocate incentives to resources in a crowd-sourcing environment so as to maximize the tagging quality of resources? We address this question by observing that the tagging quality of a resource becomes stable after it has been tagged a sufficient number of times. We formalize the concepts of tagging quality (TQ) and tagging stability (TS) in measuring the quality of a resource's tag description. We propose a theoretically optimal algorithm given a fixed “budget” (i.e., the amount of money paid for tagging resources). This solution decides the amount of rewards that should be invested on each resource in order to maximize tagging stability. We further propose a few simple, practical, and efficient incentive allocation strategies. On a dataset from del.icio.us, our best strategy provides resources with a close-to-optimal gain in tagging stability.", "citation": "Citations (14)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong", "University of Hong Kong"], "authors": ["Xuan S. Yang.....http://dblp.org/pers/hd/y/Yang:Xuan_S=", "Reynold Cheng.....http://dblp.org/pers/hd/c/Cheng:Reynold", "Luyi Mo.....http://dblp.org/pers/hd/m/Mo:Luyi", "Ben Kao.....http://dblp.org/pers/hd/k/Kao:Ben", "David W. Cheung.....http://dblp.org/pers/hd/c/Cheung:David_W="], "conf": "icde", "year": "2013", "pages": 12}