{"title": "Event detection using customer care calls.", "fields": ["customer intelligence", "customer reference program", "service level requirement", "customer service assurance", "voice of the customer"], "abstract": "Customer care calls serve as a direct channel for a service provider to learn feedbacks from their customers. They reveal details about the nature and impact of major events and problems observed by customers. By analyzing the customer care calls, a service provider can detect important events to speed up problem resolution. However, automating event detection based on customer care calls poses several significant challenges. First, the relationship between customers' calls and network events is blurred because customers respond to an event in different ways. Second, customer care calls can be labeled inconsistently across agents and across call centers, and a given event naturally give rise to calls spanning a number of categories. Third, many important events cannot be detected by looking at calls in one category. How to aggregate calls from different categories for event detection is important but challenging. Lastly, customer care call records have high dimensions (e.g., thousands of categories in our dataset). In this paper, we propose a systematic method for detecting events in a major cellular network using customer care call data. It consists of three main components: (i) using a regression approach that exploits temporal stability and low-rank properties to automatically learn the relationship between customer calls and major events, (ii) reducing the number of unknowns by clustering call categories and using L 1  norm minimization to identify important categories, and (iii) employing multiple classifiers to enhance the robustness against noise and different response time. For the detected events, we leverage Twitter social media to summarize them and to locate the impacted regions. We show the effectiveness of our approach using data from a large cellular service provider in the US.", "citation": "Citations (4)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "AT&T Labs", "University of Texas at Austin", "AT&T Labs"], "authors": ["Yi-Chao Chen.....http://dblp.org/pers/hd/c/Chen:Yi=Chao", "Gene Moo Lee.....http://dblp.org/pers/hd/l/Lee:Gene_Moo", "Nick G. Duffield.....http://dblp.org/pers/hd/d/Duffield:Nick_G=", "Lili Qiu.....http://dblp.org/pers/hd/q/Qiu:Lili", "Jia Wang.....http://dblp.org/pers/hd/w/Wang:Jia"], "conf": "infocom", "year": "2013", "pages": 9}