{"title": "Departures from optimality: understanding human analyst's information foraging in assisted requirements tracing.", "fields": ["toddler", "ant", "bebugging", "software bug", "oracle"], "abstract": "Performance bugs are programming errors that create significant performance degradation. While developers often use automated oracles for detecting functional bugs, detecting performance bugs usually requires time-consuming, manual analysis of execution profiles. The human effort for performance analysis limits the number of performance tests analyzed and enables performance bugs to easily escape to production. Unfortunately, while profilers can successfully localize slow executing code, profilers cannot be effectively used as automated oracles. This paper presents Toddler, a novel automated oracle for performance bugs, which enables testing for performance bugs to use the well established and automated process of testing for functional bugs. Toddler reports code loops whose computation has repetitive and partially similar memory-access patterns across loop iterations. Such repetitive work is likely unnecessary and can be done faster. We implement Toddler for Java and evaluate it on 9 popular Java codebases. Our experiments with 11 previously known, real-world performance bugs show that Toddler finds these bugs with a higher accuracy than the standard Java profiler. Using Toddler, we also found 42 new bugs in six Java projects: Ant, Google Core Libraries, JUnit, Apache Collections, JDK, and JFreeChart. Based on our bug reports, developers so far fixed 10 bugs and confirmed 6 more as real bugs.", "citation": "Citations (102)", "departments": ["University of Illinois at Urbana–Champaign", "University of Wisconsin-Madison", "University of Illinois at Urbana–Champaign", "University of Wisconsin-Madison"], "authors": ["Nan Niu.....http://dblp.org/pers/hd/n/Niu:Nan", "Anas Mahmoud.....http://dblp.org/pers/hd/m/Mahmoud:Anas", "Zhangji Chen.....http://dblp.org/pers/hd/c/Chen:Zhangji", "Gary Bradshaw.....http://dblp.org/pers/hd/b/Bradshaw:Gary"], "conf": "icse", "year": "2013", "pages": 10}