{"title": "Accurate and efficient private release of datacubes and contingency tables.", "fields": ["contingency table", "spatial query", "tree", "information privacy", "data cube"], "abstract": "A central problem in releasing aggregate information about sensitive data is to do so accurately while providing a privacy guarantee on the output. Recent work focuses on the class of linear queries, which include basic counting queries, data cubes, and contingency tables. The goal is to maximize the utility of their output, while giving a rigorous privacy guarantee. Most results follow a common template: pick a “strategy” set of linear queries to apply to the data, then use the noisy answers to these queries to reconstruct the queries of interest. This entails either picking a strategy set that is hoped to be good for the queries, or performing a costly search over the space of all possible strategies. In this paper, we propose a new approach that balances accuracy and efficiency: we show how to improve the accuracy of a given query set by answering some strategy queries more accurately than others. This leads to an efficient optimal noise allocation for many popular strategies, including wavelets, hierarchies, Fourier coefficients and more. For the important case of marginal queries we show that this strictly improves on previous methods, both analytically and empirically. Our results also extend to ensuring that the returned query answers are consistent with an (unknown) data set at minimal extra cost in terms of time and noise.", "citation": "Citations (20)", "departments": ["Pennsylvania State University", "AT&T Labs", "AT&T Labs", "AT&T Labs"], "authors": ["Grigory Yaroslavtsev.....http://dblp.org/pers/hd/y/Yaroslavtsev:Grigory", "Graham Cormode.....http://dblp.org/pers/hd/c/Cormode:Graham", "Cecilia M. Procopiuc.....http://dblp.org/pers/hd/p/Procopiuc:Cecilia_M=", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh"], "conf": "icde", "year": "2013", "pages": 12}