{"title": "An efficient protocol for RFID multigroup threshold-based classification.", "fields": ["supply chain management", "system model", "product type", "small number", "group testing"], "abstract": "RFID technology has many applications such as object tracking, automatic inventory control, and supply chain management. They can be used to identify individual objects or count the population of each type of objects in a deployment area, no matter whether the objects are passports, retail products, books or even humans. Most existing work adopts a “flat” RFID system model and performs functions of collecting tag IDs, estimating the number of tags, or detecting the missing tags. However, in practice, tags are often attached to objects of different groups, which may represent a different product type in a warehouse, a different book category in a library, etc. An interesting problem, called multigroup threshold-based classification, is to determine whether the number of objects in each group is above or below a prescribed threshold value. Solving this problem is important for inventory tracking applications. If the number of groups is very large, it will be inefficient to measure the groups one at a time. The best existing solution for multigroup threshold-based classification is based on generic group testing, whose design is however geared towards detecting a small number of populous groups. Its performance degrades quickly when the number of groups above the threshold become large. In this paper, we propose a new classification protocol based on logical bitmaps. It achieves high efficiency by measuring all groups in a mixed fashion. In the meantime, we show that the new method is able to perform threshold-based classification with an accuracy that can be pre-set to any desirable level, allowing tradeoff between time efficiency and accuracy.", "citation": "Citations (25)", "departments": ["University of Florida", "University of Florida", "University of Florida"], "authors": ["Wen Luo.....http://dblp.org/pers/hd/l/Luo:Wen", "Yan Qiao.....http://dblp.org/pers/hd/q/Qiao:Yan", "Shigang Chen.....http://dblp.org/pers/hd/c/Chen:Shigang"], "conf": "infocom", "year": "2013", "pages": 9}