{"title": "PSR: Practical synchronous rendezvous in low-duty-cycle wireless networks.", "fields": ["clock drift", "network packet", "efficient energy use", "duty cycle", "rendezvous"], "abstract": "Low-duty-cycle radio operations have been proposed for wireless networks facing severe energy constraints. Despite energy savings, duty-cycling the radio creates transient-available wireless links, making communication rendezvous a challenging task under the practical issue of clock drift. To overcome limitations of prior work, this paper presents PSR, a practical design for synchronous rendezvous in low-duty-cycle wireless networks. The key idea behind PSR is to extract timing information naturally embedded in the pattern of radio duty-cycling, so that normal traffic in the network can be utilized as a “free” input for drift detection, which helps reduce (or even eliminate) the overhead of traditional time-stamp exchange with dedicated packets or bits. To prevent an overuse of such free information, leading to energy waste, an energy-driven adaptive mechanism is developed for clock calibration to balance between energy efficiency and rendezvous accuracy. PSR is evaluated with both test-bed experiments and extensive simulations, by augmenting and comparing with four different MAC protocols. Results show that PSR is practical and effective under different levels of traffic load, and can be fused with those MAC protocols to improve their energy efficiency without major change of the original designs.", "citation": "Citations (15)", "departments": ["University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Minnesota", "University of Minnesota"], "authors": ["Hao Huang.....http://dblp.org/pers/hd/h/Huang:Hao", "Jihoon Yun.....http://dblp.org/pers/hd/y/Yun:Jihoon", "Ziguo Zhong.....http://dblp.org/pers/hd/z/Zhong:Ziguo", "Song Min Kim.....http://dblp.org/pers/hd/k/Kim:Song_Min", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "infocom", "year": "2013", "pages": 9}