{"title": "Modeling performance variation due to cache sharing.", "fields": ["cache invalidation", "cache coloring", "cache oblivious algorithm", "smart cache", "cache pollution"], "abstract": "Shared cache contention can cause significant variability in the performance of co-running applications from run to run. This variability arises from different overlappings of the applications' phases, which can be the result of offsets in application start times or other delays in the system. Understanding this variability is important for generating an accurate view of the expected impact of cache contention. However, variability effects are typically ignored due to the high overhead of modeling or simulating the many executions needed to expose them. This paper introduces a method for efficiently investigating the performance variability due to cache contention. Our method relies on input data captured from native execution of applications running in isolation and a fast, phase-aware, cache sharing performance model. This allows us to assess the performance interactions and bandwidth demands of co-running applications by quickly evaluating hundreds of overlappings. We evaluate our method on a contemporary multicore machine and show that performance and bandwidth demands can vary significantly across runs of the same set of co-running applications. We show that our method can predict application slowdown with an average relative error of 0.41% (maximum 1.8%) as well as bandwidth consumption. Using our method, we can estimate an application pair's performance variation 213× faster, on average, than native execution.", "citation": "Citations (26)", "departments": ["Uppsala University", "Uppsala University", "Uppsala University", "Uppsala University"], "authors": ["Andreas Sandberg.....http://dblp.org/pers/hd/s/Sandberg:Andreas", "Andreas Sembrant.....http://dblp.org/pers/hd/s/Sembrant:Andreas", "Erik Hagersten.....http://dblp.org/pers/hd/h/Hagersten:Erik", "David Black-Schaffer.....http://dblp.org/pers/hd/b/Black=Schaffer:David"], "conf": "hpca", "year": "2013", "pages": 12}