{"title": "deDacota: toward preventing server-side XSS via automatic code and data separation.", "fields": ["client side scripting", "content security policy", "cross site scripting", "server side scripting", "html scripting"], "abstract": "Web applications are constantly under attack. They are popular, typically accessible from anywhere on the Internet, and they can be abused as malware delivery systems.   Cross-site scripting flaws are one of the most common types of vulnerabilities that are leveraged to compromise a web application and its users. A large set of cross-site scripting vulnerabilities originates from the browser's confusion between data and code. That is, untrusted data input to the web application is sent to the clients' browser, where it is then interpreted as code and executed. While new applications can be designed with code and data separated from the start, legacy web applications do not have that luxury.   This paper presents a novel approach to securing legacy web applications by automatically and statically rewriting an application so that the code and data are clearly separated in its web pages. This transformation protects the application and its users from a large range of server-side cross-site scripting attacks. Moreover, the code and data separation can be efficiently enforced at run time via the Content Security Policy enforcement mechanism available in modern browsers.   We implemented our approach in a tool, called deDacota, that operates on binary ASP.NET applications. We demonstrate on six real-world applications that our tool is able to automatically separate code and data, while keeping the application's semantics unchanged.", "citation": "Citations (30)", "year": "2013", "departments": ["University of California, Santa Barbara", "Microsoft", "Microsoft", "Microsoft", "University of California, Santa Barbara"], "conf": "ccs", "authors": ["Adam Doupé.....http://dblp.org/pers/hd/d/Doup=eacute=:Adam", "Weidong Cui.....http://dblp.org/pers/hd/c/Cui:Weidong", "Mariusz H. Jakubowski.....http://dblp.org/pers/hd/j/Jakubowski:Mariusz_H=", "Marcus Peinado.....http://dblp.org/pers/hd/p/Peinado:Marcus", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "pages": 12}