{"title": "Multilinear Multitask Learning.", "fields": ["transduction", "kernel", "multilinear algebra", "tensor", "active learning", "proximal gradient methods for learning", "machine learning", "tucker decomposition", "factorization", "multilinear subspace learning", "stability", "multilinear principal component analysis", "curse of dimensionality", "relaxation", "matching pursuit", "mathematical optimization", "multi task learning", "instance based learning", "multilinear map"], "abstract": "We present a framework based on convex optimization and spectral regularization to perform learning when feature observations are multidimensional arrays (tensors). We give a mathematical characterization of spectral penalties for tensors and analyze a unifying class of convex optimization problems for which we present a provably convergent and scalable template algorithm. We then specialize this class of problems to perform learning both in a transductive as well as in an inductive setting. In the transductive case one has an input data tensor with missing features and, possibly, a partially observed matrix of labels. The goal is to both infer the missing input features as well as predict the missing labels. For induction, the goal is to determine a model for each learning task to be used for out of sample prediction. Each training pair consists of a multidimensional array and a set of labels each of which corresponding to related but distinct tasks. In either case the proposed technique exploits precise low multilinear rank assumptions over unknown multidimensional arrays; regularization is based on composite spectral penalties and connects to the concept of Multilinear Singular Value Decomposition. As a by-product of using a tensor-based formalism, our approach allows one to tackle the multi-task case in a natural way. Empirical studies demonstrate the merits of the proposed methods.", "citation": "Not cited", "departments": ["Katholieke Universiteit Leuven", "École Polytechnique Fédérale de Lausanne", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "University College London", "University College London", "University College London", "University College London", "Tokyo Institute of Technology", "University of Tokyo", "University of Illinois at Chicago", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "University of Kansas", "University of Kansas"], "authors": ["Bernardino Romera-Paredes.....http://dblp.org/pers/hd/r/Romera=Paredes:Bernardino", "Hane Aung.....http://dblp.org/pers/hd/a/Aung:Hane", "Nadia Bianchi-Berthouze.....http://dblp.org/pers/hd/b/Bianchi=Berthouze:Nadia", "Massimiliano Pontil.....http://dblp.org/pers/hd/p/Pontil:Massimiliano"], "conf": "icml", "year": "2013", "pages": 9}