{"title": "Network control without CSI using rateless codes for downlink cellular systems.", "fields": ["channel state information", "throughput", "dynamic network analysis", "channel", "maximum throughput scheduling"], "abstract": "Wireless network scheduling and control techniques (e.g., opportunistic scheduling) rely heavily on access to Channel State Information (CSI). However, obtaining this information is costly in terms of bandwidth, time, and power, and could result in large overhead. Therefore, a critical question is how to optimally manage network resources in the absence of such information. To that end, we develop a cross-layer solution for downlink cellular systems with imperfect (and possibly no) CSI at the transmitter. We use rateless codes to resolve channel uncertainty. To keep the decoding complexity low, we explicitly incorporate time-average block-size constraints, and aim to maximize the system utility. The block-size of a rateless code is determined by both the network control decisions and the unknown CSI of many time slots. Therefore, unlike standard utility maximization problems, this problem can be viewed as a constrained partial observed Markov decision problem (CPOMDP), which is known to be hard due to the “curse of dimensionality.” However, by using a modified Lyapunov drift method, we develop a dynamic network control scheme, which yields a total network utility within O(1/L av ) of utility-optimal point achieved by infinite block-size channel codes, where L av  is the enforced value of the time-average block-size of rateless codes. This opens the door of being able to trade complexity/delay for performance gains in the absence of accurate CSI. Our simulation results show that the proposed scheme improves the network throughput by up to 68% over schemes that use fixed-rate codes.", "citation": "Citations (7)", "departments": ["Ohio State University", "Ohio State University", "Hewlett-Packard", "Hewlett-Packard"], "authors": ["Yin Sun.....http://dblp.org/pers/hd/s/Sun:Yin", "Can Emre Koksal.....http://dblp.org/pers/hd/k/Koksal:Can_Emre", "Sung-Ju Lee.....http://dblp.org/pers/hd/l/Lee:Sung=Ju", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2013", "pages": 9}