{"title": "Protein Function Prediction via Laplacian Network Partitioning Incorporating Function Category Correlations.", "fields": ["laplace operator", "quotient", "f1 score", "biological data", "protein function prediction"], "abstract": "Understanding the molecular mechanisms of life requires decoding the functions of the proteins in an organism. Various high-throughput experimental techniques have been developed to characterize biological systems at the genome scale. A fundamental challenge of the post-genomic era is to assign biological functions to all the proteins encoded by the genome using high-throughput biological data. To address this challenge, we propose a novel Laplacian Network Partitioning incorporating function category Correlations (LNPC) method to predict protein function on protein-protein interaction (PPI) networks by optimizing a Laplacian based quotient objective function that seeks the optimal network configuration to maximize consistent function assignments over edges on the whole graph. Unlike the existing approaches that have no unique optimization solutions, our optimization problem has unique global solution by eigen-decomposition methods. The correlations among protein function categories are quantified and incorporated into a correlated protein affinity graph which is integrated into the PPI graph to significantly improve the protein function prediction accuracy. We apply our new method to the BioGRID dataset for the Saccharomyces Cerevisiae species using the MIPS annotation scheme. Our new method outperforms other related state-of-the-art approaches more than 63% by the average precision of function prediction and 53% by the average F1 score.", "citation": "Citations (2)", "year": "2013", "departments": ["Colorado School of Mines", "University of Texas at Arlington", "University of Texas at Arlington"], "conf": "ijcai", "authors": ["Hua Wang.....http://dblp.org/pers/hd/w/Wang:Hua", "Heng Huang.....http://dblp.org/pers/hd/h/Huang:Heng", "Chris H. Q. Ding.....http://dblp.org/pers/hd/d/Ding:Chris_H=_Q="], "pages": 8}