{"title": "Towards scalable network emulation: Channel accuracy versus implementation resources.", "fields": ["memory footprint", "channel", "emulation", "scalability", "network emulation"], "abstract": "Channel emulators are valuable tools for controllable and repeatable wireless experimentation. Often, however, the high cost of such emulators preclude their widespread usage, especially in large-scale wireless networks. Moreover, existing channel emulators offer either very realistic channels for simplistic topologies or complex topologies with highly-abstracted, low-fidelity channels. To bridge the gap in offering a low-cost channel emulation solution which can scale to a large network size, in this paper, we study the tradeoff in channel emulation fidelity versus the hardware resources consumed using both analytical modeling and FPGA-based implementation. To reduce the memory footprint of our design, we optimize our channel emulation using an iterative structure to generate the Rayleigh fading channel. In addition, the channel update rate and word length selection are also evaluated in the paper which greatly improve the efficiency of implementation. We then extend our analysis of a single channel to understand how the implementation scales for the emulation of a large-scale wireless network, showing that up to 24 vehicular channels can be emulated in real-time on a single Virtex-4 FPGA.", "citation": "Citations (6)", "departments": ["Southern Methodist University", "Southern Methodist University", "Southern Methodist University", "Southern Methodist University", "Southern Methodist University"], "authors": ["Pengda Huang.....http://dblp.org/pers/hd/h/Huang:Pengda", "Matthew Jordan Tonnemacher.....http://dblp.org/pers/hd/t/Tonnemacher:Matthew_Jordan", "Yongjiu Du.....http://dblp.org/pers/hd/d/Du:Yongjiu", "Dinesh Rajan.....http://dblp.org/pers/hd/r/Rajan:Dinesh", "Joseph David Camp.....http://dblp.org/pers/hd/c/Camp:Joseph_David"], "conf": "infocom", "year": "2013", "pages": 9}