{"title": "Goal-Oriented Euclidean Heuristics with Manifold Learning.", "fields": ["incremental heuristic search", "consistent heuristic", "null move heuristic", "nonlinear dimensionality reduction", "admissible heuristic"], "abstract": "Recently, a Euclidean heuristic (EH) has been proposed for A* search. EH exploits manifold learning methods to construct an embedding of the state space graph, and derives an admissible heuristic distance between two states from the Euclidean distance between their respective embedded points. EH has shown good performance and memory efficiency in comparison to other existing heuristics such as differential heuristics. However, its potential has not been fully explored. In this paper, we propose a number of techniques that can significantly improve the quality of EH. We propose a goal-oriented manifold learning scheme that optimizes the Euclidean distance to goals in the embedding while maintaining admissibility and consistency. We also propose a state heuristic enhancement technique to reduce the gap between heuristic and true distances. The enhanced heuristic is admissible but no longer consistent. We then employ a modified search algorithm, known as B′ algorithm, that achieves optimality with inconsistent heuristics using consistency check and propagation. We demonstrate the effectiveness of the above techniques and report un-matched reduction in search costs across several non-trivial benchmark search problems.", "citation": "Citations (1)", "departments": ["Washington University in St. Louis", "Washington University in St. Louis", "Washington University in St. Louis", "University of Science and Technology of China", "University of Science and Technology of China"], "authors": ["Wenlin Chen.....http://dblp.org/pers/hd/c/Chen:Wenlin", "Yixin Chen.....http://dblp.org/pers/hd/c/Chen:Yixin", "Kilian Q. Weinberger.....http://dblp.org/pers/hd/w/Weinberger:Kilian_Q=", "Qiang Lu.....http://dblp.org/pers/hd/l/Lu:Qiang", "Xiaoping Chen.....http://dblp.org/pers/hd/c/Chen:Xiaoping"], "conf": "aaai", "year": "2013", "pages": -1}