{"title": "Second-order constraints in dynamic invariant inference.", "fields": ["precondition", "inference", "mathematics", "discrete mathematics", "invariant", "programmer", "aspectj", "compiler"], "abstract": "The current generation of dynamic invariant detectors often produce invariants that are inconsistent with program semantics or programmer knowledge. We improve the consistency of dynamically discovered invariants by taking into account higher-level constraints. These constraints encode knowledge about invariants, even when the invariants themselves are unknown. For instance, even though the invariants describing the behavior of two functions f1 and f2 may be unknown, we may know that any valid input for f1 is also valid for f2, i.e., the precondition of f1 implies that of f2. We explore techniques for expressing and employing such consistency constraints to improve the quality of produced invariants. We further introduce techniques for dynamically discovering potential second-order constraints that the programmer can subsequently approve or reject.     Our implementation builds on the Daikon tool, with a vocabulary of constraints that the programmer can use to enhance and constrain Daikon’s inference. We show that dynamic inference of second-order constraints together with minimal human effort can significantly influence the produced (first-order) invariants even in systems of substantial size, such as the Apache Commons Collections and the AspectJ compiler. We also find that 99% of the dynamically inferred second-order constraints we sampled are true.", "citation": "Not cited", "departments": ["University of Massachusetts Amherst", "Goethe University Frankfurt", "National and Kapodistrian University of Athens", "University of Oregon"], "authors": ["Kaituo Li.....http://dblp.org/pers/hd/l/Li:Kaituo", "Christoph Reichenbach.....http://dblp.org/pers/hd/r/Reichenbach:Christoph", "Yannis Smaragdakis.....http://dblp.org/pers/hd/s/Smaragdakis:Yannis", "Michal Young.....http://dblp.org/pers/hd/y/Young:Michal"], "conf": "sigsoft", "year": "2013", "pages": 11}