{"title": "Patch Match Filter: Efficient Edge-Aware Filtering Meets Randomized Search for Fast Correspondence Field Estimation.", "fields": ["optical flow", "image retrieval", "edge detection", "speedup", "nearest neighbor search"], "abstract": "Though many tasks in computer vision can be formulated elegantly as pixel-labeling problems, a typical challenge discouraging such a discrete formulation is often due to computational efficiency. Recent studies on fast cost volume filtering based on efficient edge-aware filters have provided a fast alternative to solve discrete labeling problems, with the complexity independent of the support window size. However, these methods still have to step through the entire cost volume exhaustively, which makes the solution speed scale linearly with the label space size. When the label space is huge, which is often the case for (sub pixel-accurate) stereo and optical flow estimation, their computational complexity becomes quickly unacceptable. Developed to search approximate nearest neighbors rapidly, the Patch Match method can significantly reduce the complexity dependency on the search space size. But, its pixel-wise randomized search and fragmented data access within the 3D cost volume seriously hinder the application of efficient cost slice filtering. This paper presents a generic and fast computational framework for general multi-labeling problems called Patch Match Filter (PMF). For the very first time, we explore effective and efficient strategies to weave together these two fundamental techniques developed in isolation, i.e., Based-based randomized search and efficient edge-aware image filtering. By decompositing an image into compact super pixels, we also propose super pixel-based novel search strategies that generalize and improve the original Patch Match method. Focusing on dense correspondence field estimation in this paper, we demonstrate PMF's applications in stereo and optical flow. Our PMF methods achieve state-of-the-art correspondence accuracy but run much faster than other competing methods, often giving over 10-times speedup for large label space cases.", "citation": "Citations (121)", "year": "2013", "departments": ["University of Illinois at Urbana–Champaign", "Adv. Digital Sc ... pore, Singapore", "Adv. Digital Sc ... pore, Singapore", "Adv. Digital Sc ... pore, Singapore"], "conf": "cvpr", "authors": ["Jiangbo Lu.....http://dblp.org/pers/hd/l/Lu:Jiangbo", "Hongsheng Yang.....http://dblp.org/pers/hd/y/Yang:Hongsheng", "Dongbo Min.....http://dblp.org/pers/hd/m/Min:Dongbo", "Minh N. Do.....http://dblp.org/pers/hd/d/Do:Minh_N="], "pages": 8}