{"title": "Inverted linear quadtree: Efficient top k spatial keyword search.", "fields": ["spatial query", "location based service", "quadtree", "exploit", "web search query", "inverted index", "query expansion"], "abstract": "With advances in geo-positioning technologies and geo-location services, there are a rapidly growing amount of spatio-textual objects collected in many applications such as location based services and social networks, in which an object is described by its spatial location and a set of keywords (terms). Consequently, the study of spatial keyword search which explores both location and textual description of the objects has attracted great attention from the commercial organizations and research communities. In the paper, we study the problem of top k spatial keyword search (TOPK-SK), which is fundamental in the spatial keyword queries. Given a set of spatio-textual objects, a query location and a set of query keywords, the top k spatial keyword search retrieves the closest k objects each of which contains all keywords in the query. Based on the inverted index and the linear quadtree, we propose a novel index structure, called inverted linear quadtree (IL-Quadtree), which is carefully designed to exploit both spatial and keyword based pruning techniques to effectively reduce the search space. An efficient algorithm is then developed to tackle top k spatial keyword search. In addition, we show that the IL-Quadtree technique can also be applied to improve the performance of other spatial keyword queries such as the direction-aware top k spatial keyword search and the spatio-textual ranking query. Comprehensive experiments on real and synthetic data clearly demonstrate the efficiency of our methods.", "citation": "Citations (80)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "University of New South Wales", "University of New South Wales", "University of Technology, Sydney", "University of New South Wales", "East China Normal University"], "authors": ["Chengyuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Chengyuan", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin"], "conf": "icde", "year": "2013", "pages": 12}