{"title": "Alternate hop-and-wait channel rendezvous method for cognitive radio networks.", "fields": ["cognitive radio", "rendezvous", "single point of failure", "control channel", "wait"], "abstract": "Cognitive Radio (CR) is an emerging technology developed to improve the utilization of licensed spectra, and a promising solution to alleviate the spectrum shortage problem. In cognitive radio networks (CRNs), if users want to establish communication links with neighbors, they need to rendezvous on an available channel. However, it is infeasible to employ a common control channel (CCC) in a licensed spectrum, because the CCC will be congested by primary users and degrade the performance of CRNs by the single point of failure problem. Therefore, the channel hopping (CH) based methods without CCC support are usually adopted to establish rendezvous in CRNs. This kind of rendezvous is called blind rendezvous and generally estimated by the following criteria: 1) asynchronous rendezvous support, 2) guaranteed rendezvous, 3) asymmetric model support, 4) multi-user/multi-hop scenario support, and 5) short time-to-rendezvous (TTR). Most existing blind rendezvous methods fail to fully satisfy these criteria or have considerable TTR which is significantly increased with the number of available channels. In this paper, the alternate hop-and-wait CH method is proposed to solve these problems. Furthermore, each user has a unique alternating sequence of HOP and WAIT modes. The theoretical analysis results have confirmed that the proposed method satisfies all evaluation criteria mentioned above and provides shorter TTR. According to simulation results, the performance of the proposed method even is two times better than Jump-Stay algorithm (JS), which is the most efficient blind rendezvous method as we know, under the asymmetric model which is much critical for CRNs.", "citation": "Citations (70)", "departments": ["National Cheng Kung University", "National Cheng Kung University", "Kun Shan University", "National Cheng Kung University"], "authors": ["I-Hsun Chuang.....http://dblp.org/pers/hd/c/Chuang:I=Hsun", "Hsiao-Yun Wu.....http://dblp.org/pers/hd/w/Wu:Hsiao=Yun", "Kuan-Rong Lee.....http://dblp.org/pers/hd/l/Lee:Kuan=Rong", "Yau-Hwang Kuo.....http://dblp.org/pers/hd/k/Kuo:Yau=Hwang"], "conf": "infocom", "year": "2013", "pages": 9}