{"title": "Parallel field alignment for cross media retrieval.", "fields": ["manifold alignment", "abstraction", "semantic gap", "manifold", "vector field"], "abstract": "Cross media retrieval systems have received increasing interest in recent years. Due to the semantic gap between low-level features and high-level semantic concepts of multimedia data, many researchers have explored joint-model techniques in cross media retrieval systems. Previous joint-model approaches usually focus on two traditional ways to design cross media retrieval systems: (a) fusing features from different media data; (b) learning different models for different media data and fusing their outputs. However, the process of fusing features or outputs will lose both low- and high-level abstraction information of media data. Hence, both ways do not really reveal the semantic correlations among the heterogeneous multimedia data. In this paper, we introduce a novel method for the cross media retrieval task, named Parallel Field Alignment Retrieval (PFAR), which integrates a manifold alignment framework from the perspective of vector fields. Instead of fusing original features or outputs, we consider the cross media retrieval as a manifold alignment problem using parallel fields. The proposed manifold alignment algorithm can effectively preserve the metric of data manifolds, model heterogeneous media data and project their relationship into intermediate latent semantic spaces during the process of manifold alignment. After the alignment, the semantic correlations are also determined. In this way, the cross media retrieval task can be resolved by the determined semantic correlations. Comprehensive experimental results have demonstrated the effectiveness of our approach.", "citation": "Citations (51)", "departments": ["Zhejiang University", "Arizona State University", "Zhejiang University", "Zhejiang University", "Simon Fraser University"], "authors": ["Xiangbo Mao.....http://dblp.org/pers/hd/m/Mao:Xiangbo", "Binbin Lin.....http://dblp.org/pers/hd/l/Lin:Binbin", "Deng Cai.....http://dblp.org/pers/hd/c/Cai:Deng", "Xiaofei He.....http://dblp.org/pers/hd/h/He:Xiaofei", "Jian Pei.....http://dblp.org/pers/hd/p/Pei:Jian"], "conf": "mm", "year": "2013", "pages": 10}