{"title": "Attribute-augmented semantic hierarchy: towards bridging semantic gap and intention gap in image retrieval.", "fields": ["semantic grid", "semantic search", "explicit semantic analysis", "social semantic web", "semantic technology"], "abstract": "This paper presents a novel Attribute-augmented Semantic Hierarchy (A 2  SH) and demonstrates its effectiveness in bridging both the semantic and intention gaps in Content-based Image Retrieval (CBIR). A 2  SH organizes the semantic concepts into multiple semantic levels and augments each concept with a set of related attributes, which describe the multiple facets of the concept and act as the intermediate bridge connecting the concept and low-level visual content. A hierarchical semantic similarity function is learnt to characterize the semantic similarities among images for retrieval. To better capture user search intent, a hybrid feedback mechanism is developed, which collects hybrid feedbacks on attributes and images. These feedbacks are then used to refine the search results based on A 2  SH. We develop a content-based image retrieval system based on the proposed A 2  SH. We conduct extensive experiments on a large-scale data set of over one million Web images. Experimental results show that the proposed A 2  SH can characterize the semantic affinities among images accurately and can shape user search intent precisely and quickly, leading to more accurate search results as compared to state-of-the-art CBIR solutions.", "citation": "Citations (115)", "departments": ["National University of Singapore", "Chinese Academy of Sciences", "National University of Singapore", "Chinese Academy of Sciences", "National University of Singapore"], "authors": ["Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Zheng-Jun Zha.....http://dblp.org/pers/hd/z/Zha:Zheng=Jun", "Yang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Yang", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Yue Gao.....http://dblp.org/pers/hd/g/Gao:Yue", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2013", "pages": 10}