{"title": "Distributed cross-layer optimization in wireless networks: A second-order approach.", "fields": ["hessian matrix", "cross layer optimization", "newton s method", "newton s method in optimization", "subgradient method"], "abstract": "Due to the rapidly growing scale and heterogeneity of wireless networks, the design of distributed cross-layer optimization algorithms has received significant interest from the networking research community. So far, the standard distributed cross-layer approach in the literature is based on the first-order Lagrangian dual decomposition and the subgradient method, which suffers from a slow convergence rate. In this paper, we make the first known attempt to develop a distributed Newton's method, which is second-order and enjoys a quadratic convergence rate. However, due to the inherent interference in wireless networks, the Hessian matrix of the cross-layer problem has a non-separable structure. As a result, developing a distributed second-order algorithm is far more difficult than its counterpart for wireline networks. Our main contributions in this paper are two-fold: i) For a special network setting where all links mutually interfere, we derive closed-form expressions for the Hessian inverse, which further yield a distributed Newton's method; ii) For general wireless networks where the interference relationships are arbitrary, we propose a double matrix-splitting scheme, which also leads to a distributed Newton's method. Collectively, these results create a new theoretical framework for distributed cross-layer optimization in wireless networks. More importantly, our work contributes to a potential second-order paradigm shift in wireless networks optimization theory.", "citation": "Citations (19)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Virginia Tech"], "authors": ["Jia Liu.....http://dblp.org/pers/hd/l/Liu_0002:Jia", "Cathy H. Xia.....http://dblp.org/pers/hd/x/Xia:Cathy_H=", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B=", "Hanif D. Sherali.....http://dblp.org/pers/hd/s/Sherali:Hanif_D="], "conf": "infocom", "year": "2013", "pages": 9}