{"title": "Efficient Generation of Small Interpolants in CNF.", "fields": ["conjunctive normal form", "novelty", "propositional formula", "rendering", "exploit", "variable elimination"], "abstract": "Interpolation-based model checking (ITP) [14] is an efficient and complete model checking procedure. However, for large problems, interpolants generated by ITP might become extremely large, rendering the procedure slow or even intractable.\n\nIn this work we present a novel technique for interpolant generation in the context of model checking. The main novelty of our work is that we generate small interpolants in Conjunctive Normal Form (CNF) using a twofold procedure: First we propose an algorithm that exploits resolution refutation properties to compute an interpolant approximation. Then we introduce an algorithm that takes advantage of inductive reasoning to turn the interpolant approximation into an interpolant. Unlike ITP, our approach maintains only the relevant subset of the resolution refutation. In addition, the second part of the procedure exploits the properties of the model checking problem at hand, in contrast to the general-purpose algorithm used in ITP.\n\nWe developed a new interpolation-based model checking algorithm, called CNF-ITP. Our algorithm takes advantage of the smaller interpolants and exploits the fact that the interpolants are given in CNF. We integrated our method into a SAT-based model checker and experimented with a representative subset of the HWMCC'12 benchmark set. Our experiments show that, overall, the interpolants generated by our method are 42 times smaller than those generated by ITP. Our CNF-ITP algorithm outperforms ITP, and at times solves problems that ITP cannot solve. We also compared CNF-ITP to the successful IC3 [3] algorithm. We found that CNF-ITP outperforms IC3 [3] in a large number of cases.", "citation": "Not cited", "year": "2013", "departments": ["Technion – Israel Institute of Technology", "Intel", "Intel", "Princeton University", "Intel", "Intel"], "conf": "cav", "authors": ["Yakir Vizel.....http://dblp.org/pers/hd/v/Vizel:Yakir", "Vadim Ryvchin.....http://dblp.org/pers/hd/r/Ryvchin:Vadim", "Alexander Nadel.....http://dblp.org/pers/hd/n/Nadel:Alexander"], "pages": 17}