{"title": "Detecting bad smells in source code using change history information.", "fields": ["solid", "code smell", "static program analysis", "shotgun surgery", "software maintenance"], "abstract": "Code smells represent symptoms of poor implementation choices. Previous studies found that these smells make source code more difficult to maintain, possibly also increasing its fault-proneness. There are several approaches that identify smells based on code analysis techniques. However, we observe that many code smells are intrinsically characterized by how code elements change over time. Thus, relying solely on structural information may not be sufficient to detect all the smells accurately.   We propose an approach to detect five different code smells, namely Divergent Change, Shotgun Surgery, Parallel Inheritance, Blob, and Feature Envy, by exploiting change history information mined from versioning systems. We applied approach, coined as HIST (Historical Information for Smell deTection), to eight software projects written in Java, and wherever possible compared with existing state-of-the-art smell detectors based on source code analysis. The results indicate that HIST's precision ranges between 61% and 80%, and its recall ranges between 61% and 100%. More importantly, the results confirm that HIST is able to identify code smells that cannot be identified through approaches solely based on code analysis.", "citation": "Citations (132)", "year": "2013", "departments": ["University of Salerno", "University of Sannio", "University of Sannio", "University of Molise", "University of Salerno"], "conf": "kbse", "authors": ["Fabio Palomba.....http://dblp.org/pers/hd/p/Palomba:Fabio", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Rocco Oliveto.....http://dblp.org/pers/hd/o/Oliveto:Rocco", "Andrea De Lucia.....http://dblp.org/pers/hd/l/Lucia:Andrea_De", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "pages": 11}