{"title": "Efficient and change-resilient test automation: an industrial case study.", "fields": ["totally integrated automation", "test management approach", "test harness", "regression testing", "test script"], "abstract": "Test automation, which involves the conversion of manual test cases to executable test scripts, is necessary to carry out efficient regression testing of GUI-based applications. However, test automation takes significant investment of time and skilled effort. Moreover, it is not a one-time investment: as the application or its environment evolves, test scripts demand continuous patching. Thus, it is challenging to perform test automation in a cost-effective manner. At IBM, we developed a tool, called ATA [1], [2], to meet this challenge. ATA has novel features that are designed to lower the cost of initial test automation significantly. Moreover, ATA has the ability to patch scripts automatically for certain types of application or environment changes. How well does ATA meet its objectives in the real world? In this paper, we present a detailed case study in the context of a challenging production environment: an enterprise web application that has over 6500 manual test cases, comes in two variants, evolves frequently, and needs to be tested on multiple browsers in time-constrained and resource-constrained regression cycles. We measured how well ATA improved the efficiency in initial automation. We also evaluated the effectiveness of ATA's change-resilience along multiple dimensions: application versions, browsers, and browser versions. Our study highlights several lessons for test-automation practitioners as well as open research problems in test automation.", "citation": "Citations (18)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Suresh Thummalapenta.....http://dblp.org/pers/hd/t/Thummalapenta:Suresh", "Pranavadatta Devaki.....http://dblp.org/pers/hd/d/Devaki:Pranavadatta", "Saurabh Sinha.....http://dblp.org/pers/hd/s/Sinha:Saurabh", "Satish Chandra.....http://dblp.org/pers/hd/c/Chandra_0001:Satish", "Sivagami Gnanasundaram.....http://dblp.org/pers/hd/g/Gnanasundaram:Sivagami", "Deepa D. Nagaraj.....http://dblp.org/pers/hd/n/Nagaraj:Deepa_D=", "Sampathkumar Sathishkumar.....http://dblp.org/pers/hd/s/Sathishkumar:Sampathkumar"], "conf": "icse", "year": "2013", "pages": 10}