{"title": "SCMF: Sparse Covariance Matrix Factorization for Collaborative Filtering.", "fields": ["estimation of covariance matrices", "movielens", "cma es", "collaborative filtering", "covariance intersection"], "abstract": "Matrix factorization (MF) is a popular collaborative filtering approach for recommender systems due to its simplicity and effectiveness. Existing MF methods either assume that all latent features are uncorrelated or assume that all are correlated. To address the important issue of what structure should be imposed on the features, we investigate the covariance matrix of the latent features learned from real data. Based on the findings, we propose an MF model with a sparse covariance prior which favors a sparse yet non-diagonal covariance matrix. Not only can this reflect the semantics more faithfully, but imposing sparsity can also have a side effect of preventing overfitting. Starting from a probabilistic generative model with a sparse covariance prior, we formulate the model inference problem as a maximum a posteriori (MAP) estimation problem. The optimization procedure makes use of stochastic gradient descent and majorization-minimization. For empirical validation, we conduct experiments using the MovieLens and Netflix datasets to compare the proposed method with two strong baselines which use different priors. Experimental results show that our sparse covariance prior can lead to performance improvement.", "citation": "Citations (10)", "year": "2013", "departments": ["The Chinese University of Hong Kong", "Hong Kong University of Science and Technology", "The Chinese University of Hong Kong", "Hong Kong University of Science and Technology", "The Chinese University of Hong Kong"], "conf": "ijcai", "authors": ["Jianping Shi.....http://dblp.org/pers/hd/s/Shi:Jianping", "Naiyan Wang.....http://dblp.org/pers/hd/w/Wang:Naiyan", "Yang Xia.....http://dblp.org/pers/hd/x/Xia:Yang", "Dit-Yan Yeung.....http://dblp.org/pers/hd/y/Yeung:Dit=Yan", "Irwin King.....http://dblp.org/pers/hd/k/King:Irwin", "Jiaya Jia.....http://dblp.org/pers/hd/j/Jia:Jiaya"], "pages": 7}