{"title": "Adaptive information-sharing for privacy-aware mobile social networks.", "fields": ["personally identifiable information", "level of detail", "group information management", "information sharing", "granularity"], "abstract": "Personal and contextual information are increasingly shared via mobile social networks. Users' locations, activities and their co-presence can be shared easily with online \"friends\", as their smartphones already access such information from embedded sensors and storage. Yet, people usually exhibit selective sharing behavior depending on contextual attributes, thus showing that privacy, utility, and usability are paramount to the success of such online services. In this paper, we present SPISM, a novel information-sharing system that decides (semi-)automatically whether to share information with others, whenever they request it, and at what granularity. Based on active machine learning and context, SPISM adapts to each user's behavior and it predicts the level of detail for each sharing decision, without revealing any personal information to a third-party. Based on a personalized survey about information sharing involving 70 participants, our results provide insight into the most influential features behind a sharing decision. Moreover, we investigate the reasons for the users' decisions and their confidence in them. We show that SPISM outperforms other kinds of global and individual policies, by achieving up to 90% of correct decisions.", "citation": "Citations (25)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Wichita State University", "École Polytechnique Fédérale de Lausanne"], "authors": ["Igor Bilogrevic.....http://dblp.org/pers/hd/b/Bilogrevic:Igor", "Kévin Huguenin.....http://dblp.org/pers/hd/h/Huguenin:K=eacute=vin", "Berker Agir.....http://dblp.org/pers/hd/a/Agir:Berker", "Murtuza Jadliwala.....http://dblp.org/pers/hd/j/Jadliwala:Murtuza", "Jean-Pierre Hubaux.....http://dblp.org/pers/hd/h/Hubaux:Jean=Pierre"], "conf": "huc", "year": "2013", "pages": 10}