{"title": "Bundling mobile base station and wireless energy transfer: Modeling and optimization.", "fields": ["mobile wireless sensor network", "wi fi array", "fixed wireless", "base transceiver station", "key distribution in wireless sensor networks"], "abstract": "Wireless energy transfer is a promising technology to fundamentally address energy and lifetime problems in a wireless sensor network (WSN). On the other hand, it has been well recognized that a mobile base station has significant advantages over a static one. In this paper, we study the interesting problem of co-locating the mobile base station on the wireless charging vehicle (WCV). The goal is to minimize energy consumption of the entire system while ensuring none of the sensor nodes runs out of energy. We develop a mathematical model for this complex problem. Instead of studying the general problem formulation (OPT-t), which is time-dependent, we show that it is sufficient to study a special subproblem (OPT-s) which only involves space-dependent variables. Subsequently, we develop a provably near-optimal solution to OPT-s. The novelty of this research mainly resides in the development of several solution techniques to tackle a complex problem that is seemingly intractable at first glance. In addition to addressing a challenging and interesting problem in a WSN, we expect the techniques developed in this research can be applied to address other related networking problems involving time-dependent movement, flow routing, and energy consumption.", "citation": "Citations (77)", "departments": ["Virginia Polyte ... ksburg, VA, USA", "Virginia Polyte ... ksburg, VA, USA", "Virginia Polyte ... ksburg, VA, USA", "Virginia Polyte ... ksburg, VA, USA", "Virginia Polyte ... ksburg, VA, USA"], "authors": ["Liguang Xie.....http://dblp.org/pers/hd/x/Xie:Liguang", "Yi Shi.....http://dblp.org/pers/hd/s/Shi_0001:Yi", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Hanif D. Sherali.....http://dblp.org/pers/hd/s/Sherali:Hanif_D=", "Scott F. Midkiff.....http://dblp.org/pers/hd/m/Midkiff:Scott_F="], "conf": "infocom", "year": "2013", "pages": 9}