{"title": "Utility-based cooperative spectrum sensing scheduling in cognitive radio networks.", "fields": ["cognitive radio", "constant false alarm rate", "evolutionary computation", "channel", "free rider problem", "game theory"], "abstract": "In this paper, we consider the problem of cooperative spectrum sensing scheduling (C3S) in a cognitive radio network when there exist multiple primary channels. Deviated from the existing research our work focuses on a scenario in which each secondary user has the freedom to decide whether or not to participate in cooperative spectrum sensing; if not, the SU becomes a free rider who can eavesdrop the decision about the channel status made by others. Such a mechanism can conserve the energy for spectrum sensing at a risk of scarifying the spectrum sensing performance. To overcome this problem, we address the following two questions: “which action (contributing to spectrum sensing or not) to take?” and “which channel to sense?” To answer the first question, we model our framework as an evolutionary game in which each SU makes its decision based on its utility history, and takes an action more frequently if it brings a relatively higher utility. We also develop an entropy based coalition formation algorithm to answer the second question, where each SU always chooses the coalition (channel) that brings the most information regarding the status of the corresponding channel. All the SUs selecting the same channel to sense form a coalition. Our simulation study indicates that the proposed scheme can guarantee the detection probability at a low false alarm rate.", "citation": "Citations (26)", "departments": ["George Washington University", "George Washington University", "Dalian University of Technology", "Beijing Jiaotong University", "Beijing Jiaotong University", "George Washington University", "Changshu Institute of Technology", "University of Macau", "George Washington University", "Dalian University of Technology"], "authors": ["Hongjuan Li.....http://dblp.org/pers/hd/l/Li:Hongjuan", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen", "Keqiu Li.....http://dblp.org/pers/hd/l/Li:Keqiu", "Xiaoshuang Xing.....http://dblp.org/pers/hd/x/Xing:Xiaoshuang", "Tao Jing.....http://dblp.org/pers/hd/j/Jing:Tao"], "conf": "infocom", "year": "2013", "pages": 5}