{"title": "Materialization strategies in the Vertica analytic database: Lessons learned.", "fields": ["sort", "bookkeeping", "joins", "strengths and weaknesses", "tuple"], "abstract": "Column store databases allow for various tuple reconstruction strategies (also called materialization strategies). Early materialization is easy to implement but generally performs worse than late materialization. Late materialization is more complex to implement, and usually performs much better than early materialization, although there are situations where it is worse. We identify these situations, which essentially revolve around joins where neither input fits in memory (also called spilling joins). Sideways information passing techniques provide a viable solution to get the best of both worlds. We demonstrate how early materialization combined with sideways information passing allows us to get the benefits of late materialization, without the bookkeeping complexity or worse performance for spilling joins. It also provides some other benefits to query processing in Vertica due to positive interaction with compression and sort orders of the data. In this paper, we report our experiences with late and early materialization, highlight their strengths and weaknesses, and present the details of our sideways information passing implementation. We show experimental results of comparing these materialization strategies, which highlight the significant performance improvements provided by our implementation of sideways information passing (up to 72% on some TPC-H queries).", "citation": "Citations (13)", "departments": ["Vertica Syst.,  ... bridge, MA, USA", "Vertica Syst.,  ... bridge, MA, USA", "Vertica Syst.,  ... bridge, MA, USA", "Vertica Syst.,  ... bridge, MA, USA", "Vertica Syst.,  ... bridge, MA, USA"], "authors": ["Lakshmikant Shrinivas.....http://dblp.org/pers/hd/s/Shrinivas:Lakshmikant", "Sreenath Bodagala.....http://dblp.org/pers/hd/b/Bodagala:Sreenath", "Ramakrishna Varadarajan.....http://dblp.org/pers/hd/v/Varadarajan:Ramakrishna", "Ariel Cary.....http://dblp.org/pers/hd/c/Cary:Ariel", "Vivek Bharathan.....http://dblp.org/pers/hd/b/Bharathan:Vivek", "Chuck Bear.....http://dblp.org/pers/hd/b/Bear:Chuck"], "conf": "icde", "year": "2013", "pages": 12}