{"title": "Data-driven neuroscience: enabling breakthroughs via innovative data management.", "fields": ["data discovery", "computational neuroscience", "human brain project", "data driven", "level of detail"], "abstract": "Scientists in all disciplines increasingly rely on simulations to develop a better understanding of the subject they are studying. For example the neuroscientists we collaborate with in the Blue Brain project have started to simulate the brain on a supercomputer. The level of detail of their models is unprecedented as they model details on the subcellular level (e.g., the neurotransmitter). This level of detail, however, also leads to a true data deluge and the neuroscientists have only few tools to efficiently analyze the data.   This demonstration showcases three innovative spatial management techniques that have substantial impact on computational neuroscience and other disciplines in that they allow to build, analyze and simulate bigger and more detailed models. More particularly, we demonstrate a tool that integrates three spatial data management techniques that have enabled breakthroughs in neuroscience: FLAT that enables efficient querying of spatial data, SCOUT that allows for fast exploration of spatial data and HiDOP that makes efficient data discovery possible.", "citation": "Citations (4)", "year": "2013", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "conf": "sigmod", "authors": ["Alexandros Stougiannis.....http://dblp.org/pers/hd/s/Stougiannis:Alexandros", "Mirjana Pavlovic.....http://dblp.org/pers/hd/p/Pavlovic:Mirjana", "Farhan Tauheed.....http://dblp.org/pers/hd/t/Tauheed:Farhan", "Thomas Heinis.....http://dblp.org/pers/hd/h/Heinis:Thomas", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia"], "pages": 4}