{"title": "Beyond Hard Negative Mining: Efficient Detector Learning via Block-Circulant Decomposition.", "fields": ["sliding window protocol", "matrix decomposition", "object detection", "circulant matrix", "order of magnitude"], "abstract": "Competitive sliding window detectors require vast training sets. Since a pool of natural images provides a nearly endless supply of negative samples, in the form of patches at different scales and locations, training with all the available data is considered impractical. A staple of current approaches is hard negative mining, a method of selecting relevant samples, which is nevertheless expensive. Given that samples at slightly different locations have overlapping support, there seems to be an enormous amount of duplicated work. It is natural, then, to ask whether these redundancies can be eliminated. In this paper, we show that the Gram matrix describing such data is block-circulant. We derive a transformation based on the Fourier transform that block-diagonalizes the Gram matrix, at once eliminating redundancies and partitioning the learning problem. This decomposition is valid for any dense features and several learning algorithms, and takes full advantage of modern parallel architectures. Surprisingly, it allows training with all the potential samples in sets of thousands of images. By considering the full set, we generate in a single shot the optimal solution, which is usually obtained only after several rounds of hard negative mining. We report speed gains on Caltech Pedestrians and INRIA Pedestrians of over an order of magnitude, allowing training on a desktop computer in a couple of minutes.", "citation": "Citations (83)", "year": "2013", "departments": ["University of Coimbra", "University of Coimbra", "University of Coimbra", "University of Coimbra"], "conf": "iccv", "authors": ["João F. Henriques.....http://dblp.org/pers/hd/h/Henriques:Jo=atilde=o_F=", "João Carreira.....http://dblp.org/pers/hd/c/Carreira:Jo=atilde=o", "Rui Caseiro.....http://dblp.org/pers/hd/c/Caseiro:Rui", "Jorge Batista.....http://dblp.org/pers/hd/b/Batista:Jorge"], "pages": 8}