{"title": "Optimal pricing for local and global WiFi markets.", "fields": ["internet access", "revenue sharing", "valuation", "sequential game", "revenue"], "abstract": "This paper analyzes two pricing schemes commonly used in WiFi markets: flat-rate pricing and usage-based pricing. The flat-free pricing encourages users to achieve the maximum WiFi usage and targets at users with high valuations in mobile Internet access, whereas the usage-based pricing is flexible to attract more users - even those with low valuations. First, we show that for a local provider, the flat-rate pricing provides more revenue than the usage-based pricing, which is consistent with the common practice in today's local markets. Second, we study how Skype may work with many local WiFi providers to provide a global WiFi service. We formulate the interactions between Skype, local providers, and users as a two-stage dynamic game. In Stage I, Skype bargains with each local provider to determine the global Skype WiFi service price and revenue sharing agreement; in Stage II, local users and travelers decide whether and how to use local or Skype WiFi service. Our analysis discovers two key insights behind Skype's current choice of usage-based pricing for its global WiFi service: to avoid severe competition with local providers and attract travelers to the service. We further show that at the equilibrium, Skype needs to share the majority of his revenue with a local provider to compensate the local provider's revenue loss due to competition. When there are more travelers or fewer local users, the competition between Skype and a local provider becomes less severe, and Skype can give away less revenue and reduce its usage-based price to attract more users.", "citation": "Citations (11)", "departments": ["Singapore University of Technology and Design", "The Chinese University of Hong Kong", "City University of Hong Kong"], "authors": ["Lingjie Duan.....http://dblp.org/pers/hd/d/Duan:Lingjie", "Jianwei Huang.....http://dblp.org/pers/hd/h/Huang:Jianwei", "Biying Shou.....http://dblp.org/pers/hd/s/Shou:Biying"], "conf": "infocom", "year": "2013", "pages": 9}