{"title": "Minimizing CPU time shortage risks in integrated embedded software.", "fields": ["search based software engineering", "avionics software", "software construction", "software system", "cpu modes"], "abstract": "A major activity in many industries is to integrate software artifacts such that the functional and performance requirements are properly taken care of. In this paper, we focus on the problem of minimizing the risk of CPU time shortage in integrated embedded systems. In order to minimize this risk, we manipulate the start time (offset) of the software executables such that the system real-time constraints are satisfied, and further, the maximum CPU time usage is minimized. We develop a number of search-based optimization algorithms, specifically designed to work for large search spaces, to compute offsets for concurrent software executables with the objective of minimizing CPU usage. We evaluated and compared our algorithms by applying them to a large automotive software system. Our experience shows that our algorithms can automatically generate offsets such that the maximum CPU usage is very close to the known lower bound imposed by the domain constraints. Further, our approach finds limits on the maximum CPU usage lower than those found by a random strategy, and is not slower than a random strategy. Finally, our work achieves better results than the CPU usage minimization techniques devised by domain experts.", "citation": "Citations (4)", "year": "2013", "departments": ["University of Luxembourg", "University of Luxembourg", "University of Luxembourg", "Delphi Automotive", "Delphi Automotive"], "conf": "kbse", "authors": ["Shiva Nejati.....http://dblp.org/pers/hd/n/Nejati:Shiva", "Morayo Adedjouma.....http://dblp.org/pers/hd/a/Adedjouma:Morayo", "Lionel C. Briand.....http://dblp.org/pers/hd/b/Briand:Lionel_C=", "Jonathan Hellebaut.....http://dblp.org/pers/hd/h/Hellebaut:Jonathan", "Julien Begey.....http://dblp.org/pers/hd/b/Begey:Julien", "Yves Clement.....http://dblp.org/pers/hd/c/Clement:Yves"], "pages": 11}