{"title": "Improving ReduceTask data locality for sequential MapReduce jobs.", "fields": ["stochastic optimization", "group method of data handling", "model predictive control", "testbed", "locality"], "abstract": "Improving data locality for MapReduce jobs is critical for the performance of large-scale Hadoop clusters, embodying the principle of moving computation close to data for big data platforms. Scheduling tasks in the vicinity of stored data can significantly diminish network traffic, which is crucial for system stability and efficiency. Though the issue on data locality has been investigated extensively for MapTasks, most of the existing schedulers ignore data locality for ReduceTasks when fetching the intermediate data, causing performance degradation. This problem of reducing the fetching cost for ReduceTasks has been identified recently. However, the proposed solutions are exclusively based on a greedy approach, relying on the intuition to place ReduceTasks to the slots that are closest to the majority of the already generated intermediate data. The consequence is that, in presence of job arrivals and departures, assigning the ReduceTasks of the current job to the nodes with the lowest fetching cost can prevent a subsequent job with even better match of data locality from being launched on the already taken slots. To this end, we formulate a stochastic optimization framework to improve the data locality for ReduceTasks, with the optimal placement policy exhibiting a threshold-based structure. In order to ease the implementation, we further propose a receding horizon control policy based on the optimal solution under restricted conditions. The improved performance is further validated through simulation experiments and real performance tests on our testbed.", "citation": "Citations (56)", "departments": ["IBM", "IBM", "IBM", "IBM"], "authors": ["Jian Tan.....http://dblp.org/pers/hd/t/Tan:Jian", "Shicong Meng.....http://dblp.org/pers/hd/m/Meng:Shicong", "Xiaoqiao Meng.....http://dblp.org/pers/hd/m/Meng:Xiaoqiao", "Li Zhang.....http://dblp.org/pers/hd/z/Zhang_0002:Li"], "conf": "infocom", "year": "2013", "pages": 9}