{"title": "Towards Understanding Global Spread of Disease from Everyday Interpersonal Interactions.", "fields": ["computational epidemiology", "interpersonal communication", "predictability", "scalability", "latent variable"], "abstract": "Monitoring and forecast of global spread of infectious diseases is difficult, mainly due to lack of fine-grained and timely data. Previous work in computational epidemiology has shown that mining data from the web can improve the predictability of high-level aggregate patterns of epidemics. By contrast, this paper explores how individuals contribute to the global spread of disease. We consider the important task of predicting the prevalence of flu-like illness in a given city based on interpersonal interactions of the city's residents with the outside world. We use the geo-tagged status updates of traveling Twitter users to infer properties of the flow of individuals between cities. While previous research considered only the raw volume of passengers, we estimate a number of latent variables, including the number of sick (symptomatic) travelers and the number of sick individuals to whom each traveler was exposed. We show that AI techniques provide insights into the mechanisms of disease spread and significantly improve predictability of future flu outbreaks. Our experiments involve over 51,000 individuals traveling between 75 cities prior and during a severe ongoing flu epidemic (October 2012 - January 2013). Our model leverages the text and interpersonal interactions recorded in over 6.5 million online status updates without any active user participation, enabling scalable public health applications.", "citation": "Citations (16)", "year": "2013", "departments": ["University of Rochester", "University of Rochester", "University of Rochester"], "conf": "ijcai", "authors": ["Sean Padraig Brennan.....http://dblp.org/pers/hd/b/Brennan:Sean_Padraig", "Adam Sadilek.....http://dblp.org/pers/hd/s/Sadilek:Adam", "Henry A. Kautz.....http://dblp.org/pers/hd/k/Kautz:Henry_A="], "pages": 7}