{"title": "SybilShield: An agent-aided social network-based Sybil defense among multiple communities.", "fields": ["graph", "trusted computing", "adversary", "multi agent system", "sybil attack"], "abstract": "Lacking trusted central authority, distributed systems have received serious security threats from Sybil attack, where an adversary forges identities of more than one node and attempts to control the system. By utilizing the real-world trust relationships between users, social network-based defense schemes have been proposed to mitigate the impact of Sybil attacks. These solutions are mostly built on the assumption that the social network graph can be partitioned into two loosely linked regions - a tightly connected non-Sybil region and a Sybil region. Although such an assumption may hold in certain settings, studies have shown that the real-world social connections tend to divide users into multiple inter-connected small worlds instead of a single uniformly connected large region. Given this fact, the applicability of existing schemes would be greatly undermined for inability to distinguish Sybil users from valid ones in the small non-Sybil regions. This paper addresses this problem and presents SybilShield, the first protocol that defends against Sybil attack utilizing multi-community social network structure in real world. Our scheme leverages the sociological property that the number of cutting edges between a non-Sybil community and a Sybil community, which represent human-established trust relationships, is much smaller than that among non-Sybil communities. With the help of agent nodes, SybilShield greatly reduces false positive rate of non-Sybils among multiple communities, while effectively identifying Sybil nodes. Analytical results prove the superiority of SybilShield. Our experiments on a real-world social network graph with 100,000 nodes also validate the effectiveness of SybilShield.", "citation": "Citations (25)", "departments": ["University of Arkansas at Little Rock", "University of Arkansas at Little Rock", "Virginia Tech", "Virginia Tech"], "authors": ["Lu Shi.....http://dblp.org/pers/hd/s/Shi:Lu", "Shucheng Yu.....http://dblp.org/pers/hd/y/Yu:Shucheng", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas"], "conf": "infocom", "year": "2013", "pages": 9}