{"title": "HACC: extreme scaling and performance across diverse architectures.", "fields": ["scaling", "q systems", "supercomputer", "grid", "central processing unit"], "abstract": "Supercomputing is evolving towards hybrid and accelerator-based architectures with millions of cores. The HACC (Hardware/Hybrid Accelerated Cosmology Code) framework exploits this diverse landscape at the largest scales of problem size, obtaining high scalability and sustained performance. Developed to satisfy the science requirements of cosmological surveys, HACC melds particle and grid methods using a novel algorithmic structure that flexibly maps across architectures, including CPU/GPU, multi/many-core, and Blue Gene systems. We demonstrate the success of HACC on two very different machines, the CPU/GPU system Titan and the BG/Q systems Sequoia and Mira, attaining unprecedented levels of scalable performance. We demonstrate strong and weak scaling on Titan, obtaining up to 99.2% parallel efficiency, evolving 1.1 trillion particles. On Sequoia, we reach 13.94 PFlops (69.2% of peak) and 90% parallel efficiency on 1,572,864 cores, with 3.6 trillion particles, the largest cosmological benchmark yet performed. HACC design concepts are applicable to several other supercomputer applications.", "citation": "Citations (29)", "departments": ["Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory"], "authors": ["Salman Habib.....http://dblp.org/pers/hd/h/Habib:Salman", "Vitali A. Morozov.....http://dblp.org/pers/hd/m/Morozov:Vitali_A=", "Nicholas Frontiere.....http://dblp.org/pers/hd/f/Frontiere:Nicholas", "Hal Finkel.....http://dblp.org/pers/hd/f/Finkel:Hal", "Adrian Pope.....http://dblp.org/pers/hd/p/Pope:Adrian", "Katrin Heitmann.....http://dblp.org/pers/hd/h/Heitmann:Katrin"], "conf": "sc", "year": "2013", "pages": 10}