{"title": "Arithmetic Circuits: A Chasm at Depth Three.", "fields": ["binary decision diagram", "circuit complexity", "polynomial identity testing", "electronic circuit", "discrete mathematics", "multiplication", "mathematics", "binary logarithm", "pure mathematics", "arithmetic"], "abstract": "We show that, over Q, if an n-variate polynomial of degree d = n O(1)  is computable by an arithmetic circuit of size s (respectively by an arithmetic branching program of size s) then it can also be computed by a depth three circuit (i.e. a ΣΠΣ-circuit) of size exp(O(√(d log n log d log s))) (respectively of size exp(O(√(d log n log s))). In particular this yields a ΣΠΣ circuit of size exp(O(√(d log d))) computing the d × d determinant Det d . It also means that if we can prove a lower bound of exp(omega(√(d log d))) on the size of any ΣΠΣ-circuit computing the d × d permanent Perm d  then we get super polynomial lower bounds for the size of any arithmetic branching program computing Perm d . We then give some further results pertaining to derandomizing polynomial identity testing and circuit lower bounds. The ΣΠΣ circuits that we construct have the property that (some of) the intermediate polynomials have degree much higher than d. Indeed such a counterintuitive construction is unavoidable - it is known that in any ΣΠΣ circuit C computing either Det d  or Perm_d, if every multiplication gate has fanin at most d (or any constant multiple thereof) then C must have size at least exp(Ω(d)).", "citation": "Citations (93)", "year": "2013", "departments": ["Microsoft", "Microsoft", "Microsoft", "Chennai Math. I ...  Chennai, India"], "conf": "focs", "authors": ["Ankit Gupta.....http://dblp.org/pers/hd/g/Gupta_0001:Ankit", "Pritish Kamath.....http://dblp.org/pers/hd/k/Kamath:Pritish", "Neeraj Kayal.....http://dblp.org/pers/hd/k/Kayal:Neeraj", "Ramprasad Saptharishi.....http://dblp.org/pers/hd/s/Saptharishi:Ramprasad"], "pages": 10}