{"title": "Hierarchical Bayesian Matrix Factorization with Side Information.", "fields": ["bayesian hierarchical modeling", "non negative matrix factorization", "bayesian statistics", "bayesian average", "variable order bayesian network"], "abstract": "Bayesian treatment of matrix factorization has been successfully applied to the problem of collaborative prediction, where unknown ratings are determined by the predictive distribution, inferring posterior distributions over user and item factor matrices that are used to approximate the user-item matrix as their product. In practice, however, Bayesian matrix factorization suffers from cold-start problems, where inferences are required for users or items about which a sufficient number of ratings are not gathered. In this paper we present a method for Bayesian matrix factorization with side information, to handle cold-start problems. To this end, we place Gaussian-Wishart priors on mean vectors and precision matrices of Gaussian user and item factor matrices, such that mean of each prior distribution is regressed on corresponding side information. We develop variational inference algorithms to approximately compute posterior distributions over user and item factor matrices. In addition, we provide Bayesian Cramer-Rao Bound for our model, showing that the hierarchical Bayesian matrix factorization with side information improves the reconstruction over the standard Bayesian matrix factorization where the side information is not used. Experiments on MovieLens data demonstrate the useful behavior of our model in the case of cold-start problems.", "citation": "Citations (23)", "year": "2013", "departments": ["Pohang University of Science and Technology", "Pohang University of Science and Technology", "Pohang University of Science and Technology"], "conf": "ijcai", "authors": ["Sunho Park.....http://dblp.org/pers/hd/p/Park:Sunho", "Yong-Deok Kim.....http://dblp.org/pers/hd/k/Kim:Yong=Deok", "Seungjin Choi.....http://dblp.org/pers/hd/c/Choi:Seungjin"], "pages": 7}