{"title": "Human vs machine: establishing a human baseline for multimodal location estimation.", "fields": ["crowdsourcing", "latitude", "test set", "mixture model", "inference"], "abstract": "Over the recent years, the problem of video location estimation (i.e., estimating the longitude/latitude coordinates of a video without GPS information) has been approached with diverse methods and ideas in the research community and significant improvements have been made. So far, however, systems have only been compared against each other and no systematic study on human performance has been conducted. Based on a human-subject study with 11,900 experiments, this article presents a human baseline for location estimation for different combinations of modalities (audio, audio/video, audio/video/text). Furthermore, this article compares state-of-the-art location estimation systems with the human baseline. Although the overall performance of humans' multimodal video location estimation is better than current machine learning approaches, the difference is quite small: For 41% of the test set, the machine's accuracy was superior to the humans. We present case studies and discuss why machines did better for some videos and not for others. Our analysis suggests new directions and priorities for future work on the improvement of location inference algorithms.", "citation": "Citations (10)", "departments": ["International Computer Science Institute", "International Computer Science Institute", "University of California, Berkeley", "Technical University of Berlin", "International Computer Science Institute"], "authors": ["Jaeyoung Choi.....http://dblp.org/pers/hd/c/Choi:Jaeyoung", "Howard Lei.....http://dblp.org/pers/hd/l/Lei:Howard", "Venkatesan N. Ekambaram.....http://dblp.org/pers/hd/e/Ekambaram:Venkatesan_N=", "Pascal Kelm.....http://dblp.org/pers/hd/k/Kelm:Pascal", "Luke R. Gottlieb.....http://dblp.org/pers/hd/g/Gottlieb:Luke_R=", "Thomas Sikora.....http://dblp.org/pers/hd/s/Sikora:Thomas", "Kannan Ramchandran.....http://dblp.org/pers/hd/r/Ramchandran:Kannan", "Gerald Friedland.....http://dblp.org/pers/hd/f/Friedland:Gerald"], "conf": "mm", "year": "2013", "pages": 10}