{"title": "Compressing forwarding tables.", "fields": ["routing table", "forwarding information base", "forwarding plane", "virtualization", "virtual routing and forwarding"], "abstract": "With the rise of datacenter virtualization, the number of entries in forwarding tables is expected to scale from several thousands to several millions. Unfortunately, such forwarding table sizes can hardly be implemented today in on-chip memory. In this paper, we investigate the compressibility of forwarding tables. We first introduce a novel forwarding table architecture with separate encoding in each column. It is designed to keep supporting fast random accesses and fixed-width memory words. Then, we suggest an encoding whose memory requirement per row entry is guaranteed to be within a small additive constant of the optimum. Next, we analyze the common case of two-column forwarding tables, and show that such tables can be presented as bipartite graphs. We deduce graph-theoretical bounds on the encoding size. We also introduce an algorithm for optimal conditional encoding of the second column given an encoding of the first one. In addition, we explain how our architecture can handle table updates. Last, we evaluate our suggested encoding techniques on synthetic forwarding tables as well as on real-life tables.", "citation": "Not cited", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Marvell, Israel"], "authors": ["Ori Rottenstreich.....http://dblp.org/pers/hd/r/Rottenstreich:Ori", "Marat Radan.....http://dblp.org/pers/hd/r/Radan:Marat", "Yuval Cassuto.....http://dblp.org/pers/hd/c/Cassuto:Yuval", "Isaac Keslassy.....http://dblp.org/pers/hd/k/Keslassy:Isaac", "Carmi Arad.....http://dblp.org/pers/hd/a/Arad:Carmi", "Tal Mizrahi.....http://dblp.org/pers/hd/m/Mizrahi:Tal", "Yoram Revah.....http://dblp.org/pers/hd/r/Revah:Yoram", "Avinatan Hassidim.....http://dblp.org/pers/hd/h/Hassidim:Avinatan"], "conf": "infocom", "year": "2013", "pages": 9}