{"title": "Economic models of sponsored content in wireless networks with uncertain demand.", "fields": ["business service provider", "service level objective", "migration authorisation code", "provider edge", "online charging system"], "abstract": "The interaction of a content provider with end users on an infrastructure platform built and maintained by a service provider can be viewed as a two-sided market. Content sponsoring, i.e., charging the content provider instead of viewers for resources consumed in viewing the content, can benefit all parties involved. Without being charged directly or having it counted against their monthly data quotas, end users will view more content, allowing the content provider to generate more advertising revenue, extracted by the service provider to subsidize its investment and operation of the network infrastructure. However, realizing such gains requires a proper contractual relationship between the service provider and content provider. We consider the determination of this contract through a Stackelberg game. The service provider sets a pricing schedule for sponsoring and the content provider responds by deciding how much content to sponsor. We analyze the best strategies for the content provider and service provider in the event that the underlying demand for the content is uncertain. Two separate settings are defined. In the first, end users can be charged for non-sponsored views on a per-byte basis. In the second we extend the model to the more common case in which end users purchase data quotas on a periodic basis. Our main conclusion is that a coordinating contract can be designed that maximizes total system profit. Moreover, the additional profit due to sponsoring can be split between the content provider and service provider in an arbitrary manner.", "citation": "Citations (62)", "departments": ["Bell Labs", "Özyeğin University", "Bell Labs", "University of Illinois at Urbana–Champaign"], "authors": ["Matthew Andrews.....http://dblp.org/pers/hd/a/Andrews:Matthew", "Ulas Özen.....http://dblp.org/pers/hd/=/=Ouml=zen:Ulas", "Martin I. Reiman.....http://dblp.org/pers/hd/r/Reiman:Martin_I=", "Qiong Wang.....http://dblp.org/pers/hd/w/Wang:Qiong"], "conf": "infocom", "year": "2013", "pages": 6}