{"title": "Using Poisson processes to model lattice cellular networks.", "fields": ["spectral efficiency", "log normal distribution", "fading distribution", "fading", "poisson regression"], "abstract": "An almost ubiquitous assumption made in the stochastic-analytic approach to study of the quality of user-service in cellular networks is Poisson distribution of base stations, often completed by some specific assumption regarding the distribution of the fading (e.g. Rayleigh). The former (Poisson) assumption is usually (vaguely) justified in the context of cellular networks, by various irregularities in the real placement of base stations, which ideally should form a lattice (e.g. hexagonal) pattern. In the first part of this paper we provide a different and rigorous argument justifying the Poisson assumption under sufficiently strong lognormal shadowing observed in the network, in the evaluation of a natural class of the typical-user service-characteristics (including path-loss, interference, signal-to-interference ratio, spectral efficiency). Namely, we present a Poisson-convergence result for a broad range of stationary (including lattice) networks subject to log-normal shadowing of increasing variance. We show also for the Poisson model that the distribution of all these typical-user service characteristics does not depend on the particular form of the additional fading distribution. Our approach involves a mapping of 2D network model to 1D image of it “perceived” by the typical user. For this image we prove our Poisson convergence result and the invariance of the Poisson limit with respect to the distribution of the additional shadowing or fading. Moreover, in the second part of the paper we present some new results for Poisson model allowing one to calculate the distribution function of the SINR in its whole domain. We use them to study and optimize the mean energy efficiency in cellular networks.", "citation": "Citations (214)", "departments": ["École Normale Supérieure", "École Normale Supérieure", "Orange Labs., I ... lineaux, France"], "authors": ["Bartlomiej Blaszczyszyn.....http://dblp.org/pers/hd/b/Blaszczyszyn:Bartlomiej", "Mohamed Kadhem Karray.....http://dblp.org/pers/hd/k/Karray:Mohamed_Kadhem", "Holger Paul Keeler.....http://dblp.org/pers/hd/k/Keeler:Holger_Paul"], "conf": "infocom", "year": "2013", "pages": 9}