{"title": "A new approach to computing maximum flows using electrical flows.", "fields": ["regular polygon", "affine space", "out of kilter algorithm", "exact algorithm", "minimum cut"], "abstract": "We give an algorithm which computes a (1-e)-approximately maximum st-flow in an undirected uncapacitated graph in time O(1/e√m/F⋅ m log 2  n) where  F  is the flow value. By trading this off against the Karger-Levine algorithm for undirected graphs which takes ~O(m+nF) time, we obtain a running time of ~O(m n 1/3 /e 2/3 ) for uncapacitated graphs, improving the previous best dependence on e by a factor of O(1/e 3 ). Like the algorithm of Christiano, Kelner, Madry, Spielman and Teng, our algorithm reduces the problem to electrical flow computations which are carried out in linear time using fast Laplacian solvers. However, in contrast to previous work, our algorithm does not reweight the edges of the graph in any way, and instead uses  local  (i.e., non s-t) electrical flows to reroute the flow on congested edges. The algorithm is simple and may be viewed as trying to find a point at the intersection of two convex sets (the affine subspace of st-flows of value F and the l ∞  ball) by an accelerated version of the method of alternating projections due to Nesterov.   By combining this with Ford and Fulkerson's augmenting paths algorithm, we obtain an exact algorithm with running time ~O(m 5/4  F 1/4 ) for uncapacitated undirected graphs, improving the previous best running time of ~O(m+ min(nF,m 3/2 )).   We give a related algorithm with the same running time for approximate minimum cut, based on minimizing a smoothed version of the l 1  norm inside the cut space of the input graph. We show that the minimizer of this norm is related to an approximate blocking flow and use this to give an algorithm for computing a length k approximately blocking flow in time ~O(m √k).", "citation": "Citations (20)", "year": "2013", "departments": ["Massachusetts Institute of Technology", "University of California, Berkeley", "Microsoft"], "conf": "stoc", "authors": ["Yin Tat Lee.....http://dblp.org/pers/hd/l/Lee:Yin_Tat", "Satish Rao.....http://dblp.org/pers/hd/r/Rao:Satish", "Nikhil Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Nikhil"], "pages": 10}