{"title": "eTime: Energy-efficient transmission between cloud and mobile devices.", "fields": ["instruction prefetch", "lyapunov optimization", "cloud computing", "mobile cloud computing", "mobile device"], "abstract": "Mobile cloud computing, promising to extend the capabilities of resource-constrained mobile devices, is emerging as a new computing paradigm which has fostered a wide range of exciting applications. In this new paradigm, efficient data transmission between the cloud and mobile devices becomes essential. This, however, is highly unreliable and unpredictable due to several uncontrollable factors, particularly the instability and intermittency of wireless connections, fluctuation of communication bandwidth, and user mobility. Consequently, this puts a heavy burden on the energy consumption of mobile devices. Confirmed by our experiments, significantly more energy is consumed during “bad” connectivity. Inspired by the feasibility to schedule data transmissions for prefetching-friendly or delay-tolerant applications, in this paper, we present eTime, a novel Energy-efficient data Transmission strategy between cloud and Mobile dEvices, based on Lyapunov optimization. It aggressively and adaptively seizes the timing of good connectivity to prefetch frequently used data while deferring delay-tolerant data in bad connectivity. To cope with the randomness and unpredictability of wireless connectivity, eTime only relies on the current status information to make a global energy-delay tradeoff decision. Our evaluations from both trace-driven simulation and realworld implementation show that eTime can be applied to various popular applications while achieving 20%-35% energy saving.", "citation": "Citations (104)", "departments": ["Key Lab. of Ser ...  & Syst., China", "Key Lab. of Ser ...  & Syst., China", "Key Lab. of Ser ...  & Syst., China", "Key Lab. of Ser ...  & Syst., China", "Key Lab. of Ser ...  & Syst., China"], "authors": ["Peng Shu.....http://dblp.org/pers/hd/s/Shu:Peng", "Fangming Liu.....http://dblp.org/pers/hd/l/Liu:Fangming", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai", "Min Chen.....http://dblp.org/pers/hd/c/Chen:Min", "Feng Wen.....http://dblp.org/pers/hd/w/Wen:Feng", "Yupeng Qu.....http://dblp.org/pers/hd/q/Qu:Yupeng", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo"], "conf": "infocom", "year": "2013", "pages": 5}