{"title": "Active Learning for Teaching a Robot Grounded Relational Symbols.", "fields": ["robot learning", "symbol", "abstraction", "imitation", "generalization"], "abstract": "We investigate an interactive teaching scenario, where a human teaches a robot symbols which abstract the geometric properties of objects. There are multiple motivations for this scenario: First, state-of-the-art methods for relational reinforcement learning demonstrate that we can learn and employ strongly generalizing abstract models with great success for goal-directed object manipulation. However, these methods rely on given grounded action and state symbols and raise the classical question: Where do the symbols come from? Second, existing research on learning from human-robot interaction has focused mostly on the motion level (e.g., imitation learning). However, if the goal of teaching is to enable the robot to autonomously solve sequential manipulation tasks in a goal-directed manner, the human should have the possibility to teach the relevant abstractions to describe the task and let the robot eventually leverage powerful relational RL methods. In this paper we formalize human-robot teaching of grounded symbols as an active learning problem, where the robot actively generates pick-and-place geometric situations that maximize its information gain about the symbol to be learned. We demonstrate that the learned symbols can be used by a robot in a relational RL framework to learn probabilistic relational rules and use them to solve object manipulation tasks in a goal-directed manner.", "citation": "Citations (33)", "year": "2013", "departments": ["University of Stuttgart", "University of Stuttgart", "Free University of Berlin", "French Institute for Research in Computer Science and Automation"], "conf": "ijcai", "authors": ["Johannes Kulick.....http://dblp.org/pers/hd/k/Kulick:Johannes", "Marc Toussaint.....http://dblp.org/pers/hd/t/Toussaint:Marc", "Tobias Lang.....http://dblp.org/pers/hd/l/Lang_0001:Tobias", "Manuel Lopes.....http://dblp.org/pers/hd/l/Lopes_0001:Manuel"], "pages": 7}