{"title": "A Graphical Transformation for Belief Propagation: Maximum Weight Matchings and Odd-Sized Cycles.", "fields": ["linear programming relaxation", "cutting plane method", "correctness", "maximum a posteriori estimation", "belief propagation"], "abstract": "Max-product 'belief propagation' (BP) is a popular distributed heuristic for finding the Maximum A Posteriori (MAP) assignment in a joint probability distribution represented by a Graphical Model (GM). It was recently shown that BP converges to the correct MAP assignment for a class of loopy GMs with the following common feature: the Linear Programming (LP) relaxation to the MAP problem is tight (has no integrality gap). Unfortunately, tightness of the LP relaxation does not, in general, guarantee convergence and correctness of the BP algorithm. The failure of BP in such cases motivates reverse engineering a solution - namely, given a tight LP, can we design a 'good' BP algorithm.\n\nIn this paper, we design a BP algorithm for the Maximum Weight Matching (MWM) problem over general graphs. We prove that the algorithm converges to the correct optimum if the respective LP relaxation, which may include inequalities associated with non-intersecting odd-sized cycles, is tight. The most significant part of our approach is the introduction of a novel graph transformation designed to force convergence of BP. Our theoretical result suggests an efficient BP-based heuristic for the MWM problem, which consists of making sequential, \"cutting plane\", modifications to the underlying GM. Our experiments show that this heuristic performs as well as traditional cutting-plane algorithms using LP solvers on MWM problems.", "citation": "Citations (4)", "departments": ["KAIST", "University of California, Irvine", "Los Alamos National Laboratory"], "authors": ["Jinwoo Shin.....http://dblp.org/pers/hd/s/Shin:Jinwoo", "Andrew E. Gelfand.....http://dblp.org/pers/hd/g/Gelfand:Andrew_E=", "Michael Chertkov.....http://dblp.org/pers/hd/c/Chertkov:Michael"], "conf": "nips", "year": "2013", "pages": 9}