{"title": "Endhost-based shortest path routing in dynamic networks: An online learning approach.", "fields": ["dsrflow", "hazy sighted link state routing protocol", "destination sequenced distance vector routing", "multipath routing", "equal cost multi path routing"], "abstract": "We consider the problem of endhost-based shortest path routing in a network with unknown, time-varying link qualities. Endhost-based routing is needed when internal nodes of the network do not have the scope or capability to provide globally optimal paths to given source-destination pairs, as can be the case in networks consisting of autonomous subnetworks or those with endhost-based routing restrictions. Assuming the source can probe links along selected paths, we formulate the problem as an online learning problem, where an existing solution achieves a performance loss (called regret) that is logarithmic in time with respect to (wrt) an offline algorithm that knows the link qualities. Current solutions assume coupled probing and routing; in contrast, we give a simple algorithm based on decoupled probing and routing, whose regret is only constant in time. We then extend our solution to support multi-path probing and cooperative learning between multiple sources, where we show an inversely proportional decay in regret wrt the probing rate. We also show that without the decoupling, the regret grows at least logarithmically in time, thus establishing decoupling as critical for obtaining constant regret. Although our analysis assumes certain conditions (i.i.d.) on link qualities, our solution applies with straightforward amendments to much broader scenarios where these conditions are relaxed. The efficacy of the proposed solution is verified by trace-driven simulations.", "citation": "Citations (8)", "departments": ["IBM", "University of Massachusetts Amherst", "IBM", "University of Massachusetts Amherst"], "authors": ["Ting He.....http://dblp.org/pers/hd/h/He_0001:Ting", "Dennis Goeckel.....http://dblp.org/pers/hd/g/Goeckel:Dennis", "Ramya Raghavendra.....http://dblp.org/pers/hd/r/Raghavendra:Ramya", "Don Towsley.....http://dblp.org/pers/hd/t/Towsley:Don"], "conf": "infocom", "year": "2013", "pages": 9}