{"title": "Operator-based and random mutant selection: Better together.", "fields": ["mutation testing", "test suite", "mutant", "mutation", "runtime verification"], "abstract": "Mutation testing is a powerful methodology for evaluating the quality of a test suite. However, the methodology is also very costly, as the test suite may have to be executed for each mutant.  Selective mutation testing  is a well-studied technique to reduce this cost by selecting a subset of all mutants, which would otherwise have to be considered in their entirety. Two common approaches are  operator-based mutant selection , which only generates mutants using a subset of mutation operators, and  random mutant selection , which selects a subset of mutants generated using all mutation operators. While each of the two approaches provides some reduction in the number of mutants to execute, applying either of the two to medium-sized, realworld programs can still generate a huge number of mutants, which makes their execution too expensive. This paper presents eight random sampling strategies defined on top of operatorbased mutant selection, and empirically validates that operatorbased selection and random selection can be applied in tandem to further reduce the cost of mutation testing. The experimental results show that even sampling only 5% of mutants generated by operator-based selection can still provide precise mutation testing results, while reducing the average mutation testing time to 6.54% (i.e., on average less than 5 minutes for this study).", "citation": "Citations (53)", "year": "2013", "departments": ["University of Texas at Austin", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Texas at Austin"], "conf": "kbse", "authors": ["Lingming Zhang.....http://dblp.org/pers/hd/z/Zhang:Lingming", "Milos Gligoric.....http://dblp.org/pers/hd/g/Gligoric:Milos", "Darko Marinov.....http://dblp.org/pers/hd/m/Marinov:Darko", "Sarfraz Khurshid.....http://dblp.org/pers/hd/k/Khurshid:Sarfraz"], "pages": 11}