{"title": "FCD: Fast-concurrent-distributed load balancing under switching costs and imperfect observations.", "fields": ["load balancing", "rate of convergence", "local search", "backtracking", "server"], "abstract": "The problem of distributed load balancing among m agents operating in an n-server slotted system is considered. A randomized local search mechanism, FCD (fast, concurrent and distributed) algorithm, is implemented concurrently by each agent associated with a user. It involves switching to a different server with a certain exploration probability and then backtracking with a probability proportional to the ratio of the measured loads in the two servers (in consecutive time slots). The exploration and backtracking operations are executed concurrently by users in local alternating time slots. To ensure that users do not switch to other servers asymptotically, each user chooses the exploration probability to be decaying polynomially with time for decaying rate β ∈ [0.5, 1]. The backtracking decision is then based on an estimate of the server load which is computed based on local information. Thus, FCD algorithm does not require synchronization or coordination with other users. The main contribution of this work, besides the FCD algorithm, is the analysis of the convergence time for the system to be approximately balanced, i.e. to reach an c-Nash equilibrium. We show that the system reaches an c-Nash equilibrium in expected time O (max {n log n/ϵ + n 1/β , (n 3 /m 3  log n 2 /ϵ)1/β}) when m > n 2 . This implies that the convergence rate is robust with large scale system(large user population), and is not affected by imperfect measurements of the server load. We also extend our analysis to open systems where users arrive and depart from a system with an initial load of m users. We allow for general time-dependent arrival processes (including heavy-tailed processes) and consider a uniform and a load-oblivious routing of the arrivals to the servers. A wide class of departure processes including load-dependent departures from the servers is also allowed. Our analysis demonstrates that it is possible to design fast, concurrent and distributed load balancing mechanisms in large multi-agent systems via randomized local search.", "citation": "Not cited", "departments": ["University of California, Irvine", "University of California, Irvine"], "authors": ["Furong Huang.....http://dblp.org/pers/hd/h/Huang:Furong", "Anima Anandkumar.....http://dblp.org/pers/hd/a/Anandkumar:Anima"], "conf": "infocom", "year": "2013", "pages": 9}