{"title": "Automatic generation of social media snippets for mobile browsing.", "fields": ["snippet", "media consumption", "electronic media", "display size", "mobile search"], "abstract": "The ongoing revolution in media consumption from traditional PCs to the pervasiveness of mobile devices is driving the adoption of social media in our daily lives. More and more people are using their mobile devices to enjoy social media content while on the move. However, mobile display constraints create challenges for presenting and authoring the rich media content on screens with limited display size. This paper presents an innovative system to automatically generate magazine-like social media visual summaries, which is called \"snippet,\" for efficient mobile browsing. The system excerpts the most salient and dominant elements, i.e., a major picture element and a set of textual elements, from the original media content, and composes these elements into a text overlaid image by maximizing information perception. In particular, we investigate a set of aesthetic rules and visual perception principles to optimize the layout of the extracted elements by considering display constraints. As a result, browsing the snippet on mobile devices is just like quickly glancing at a magazine. To the best of our knowledge, this paper represents one of the first attempts at automatic social media snippet generation by studying aesthetic rules and visual perception principles. We have conducted experiments and user studies with social posts from news entities. We demonstrated that the generated snippets are effective at representing media content in a visually appealing and compact way, leading to a better user experience when consuming social media content on mobile devices.", "citation": "Citations (5)", "departments": ["University at Buffalo", "Microsoft", "University at Buffalo"], "authors": ["Wenyuan Yin.....http://dblp.org/pers/hd/y/Yin:Wenyuan", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "conf": "mm", "year": "2013", "pages": 10}