{"title": "MiniLEGO: Efficient Secure Two-Party Computation from General Assumptions.", "fields": ["oblivious transfer", "distributed computing", "security parameter", "secure two party computation", "speedup", "computer science", "commitment scheme"], "abstract": "One of the main tools to construct secure two-party computation pro- tocols are Yao garbled circuits. Using the cut-and-choose technique, one can get reasonably efficient Yao-based protocols with security against malicious ad- versaries. At TCC 2009, Nielsen and Orlandi (28) suggested to apply cut-and- choose at the gate level, while previously cut-and-choose was applied on the circuit as a whole. This idea allows for a speed up with practical significance (in the order of the logarithm of the size of the circuit) and has become known as the \"LEGO\" construction. Unfortunately the construction in (28) is based on a specific number-theoretic assumption and requires public-key operations per gate of the circuit. The main technical contribution of this work is a new XOR- homomorphic commitment scheme based on oblivious transfer, that we use to cope with the problem of connecting the gates in the LEGO construction. Our new protocol has the following advantages: 1. It maintains the efficiency of the LEGO cut-and-choose. 2. After a number of seed oblivious transfers linear in the security parameter, the construction uses only primitives from Minicrypt (i.e., private-key cryp- tography) per gate in the circuit (hence the name MiniLEGO). 3. MiniLEGO is compatible with all known optimization for Yao garbled gates (row reduction, free-XORs, point-and-permute).", "citation": "Not cited", "year": "2013", "departments": ["Aarhus University", "Aarhus University", "Aarhus University", "Aarhus University", "Aarhus University"], "conf": "eurocrypt", "authors": ["Tore Kasper Frederiksen.....http://dblp.org/pers/hd/f/Frederiksen:Tore_Kasper", "Thomas Pelle Jakobsen.....http://dblp.org/pers/hd/j/Jakobsen:Thomas_Pelle", "Jesper Buus Nielsen.....http://dblp.org/pers/hd/n/Nielsen:Jesper_Buus", "Peter Sebastian Nordholt.....http://dblp.org/pers/hd/n/Nordholt:Peter_Sebastian", "Claudio Orlandi.....http://dblp.org/pers/hd/o/Orlandi:Claudio"], "pages": 20}