{"title": "n-CD: A geometric approach to preserving location privacy in location-based services.", "fields": ["service provider", "region of interest", "location based service", "information privacy", "mobile device"], "abstract": "With great advances in mobile devices, e.g., smart phones and tablets, location-based services (LBSs) have recently emerged as a very popular application in mobile networks. However, since LBS service providers require users to report their location information, how to preserve users' location privacy is one of the most challenging problems in LBSs. Most existing approaches either cannot fully protect users' location privacy, or cannot provide accurate LBSs. Many of them also need the help of a trusted third-party, which may not always be available. In this paper, we propose a geometric approach, called n-CD, to provide realtime accurate LBSs while preserving users' location privacy without involving any third-party. Specifically, we first divide a user's region of interest (ROI), which is a disk centered at the user's location, into n equal sectors. Then, we generate n concealing disks (CDs), one for each sector, one by one to collaboratively and fully cover each of the n sectors. We call the area covered by the n CDs the concealing space, which fully contains the user's ROI. After rotating the concealing space with respect to the user's location, we send the rotated centers of the n CDs along with their radii to the service provider, instead of the user's real location and his/her ROI. To investigate the performance of n-CD, we theoretically analyze its privacy level and concealing cost. Extensive simulations are finally conducted to evaluate the efficacy and efficiency of the proposed schemes.", "citation": "Citations (14)", "departments": ["Mississippi State University", "Mississippi State University", "Mississippi State University", "Mississippi State University"], "authors": ["Ming Li.....http://dblp.org/pers/hd/l/Li_0006:Ming", "Sergio Salinas.....http://dblp.org/pers/hd/s/Salinas:Sergio", "Arun Thapa.....http://dblp.org/pers/hd/t/Thapa:Arun", "Pan Li.....http://dblp.org/pers/hd/l/Li_0001:Pan"], "conf": "infocom", "year": "2013", "pages": 9}