{"title": "Learning with Rounding, Revisited - New Reduction, Properties and Applications.", "fields": ["deterministic encryption", "algorithm", "lossy compression", "rounding", "open problem", "learning with errors", "mathematics"], "abstract": "The learning with rounding (LWR) problem, introduced by Banerjee, Peikert and Rosen (BPR12) at EUROCRYPT '12, is a variant of learning with errors (LWE), where one replaces random errors with deterministic rounding. The LWR problem was shown to be as hard as LWE for a setting of parameters where the modulus and modulus-to-error ratio are super-polynomial. In this work we resolve the main open problem of (BPR12) and give a new reduction that works for a larger range of parameters, allowing for a polynomial modulus and modulus-to-error ratio. In particular, a smaller modulus gives us greater eciency, and a smaller modulus-to-error ratio gives us greater security, which now follows from the worst-case hardness of GapSVP with polynomial (rather than super-polynomial) approximation factors. As a tool in the reduction, we show that there is a \\lossy mode\" for the LWR problem, in which LWR samples only reveal partial information about the secret. This property gives us several interesting new applications, including a proof that LWR remains secure with weakly random secrets of sucient min- entropy, and very simple new constructions of deterministic encryption, lossy trapdoor functions and reusable extractors. Our approach is inspired by a technique of Goldwasser et al. (GKPV10) from ICS '10, which implicitly showed the existence of a \\lossy mode\" for LWE. By rening this technique, we also improve on the parameters of that work to only requiring a polynomial (instead of super-polynomial) modulus and modulus-to-error ratio.", "citation": "Not cited", "departments": ["ETH Zurich", "IBM", "Institute of Science and Technology Austria", "Northeastern University"], "authors": ["Joël Alwen.....http://dblp.org/pers/hd/a/Alwen:Jo=euml=l", "Stephan Krenn.....http://dblp.org/pers/hd/k/Krenn:Stephan", "Krzysztof Pietrzak.....http://dblp.org/pers/hd/p/Pietrzak:Krzysztof", "Daniel Wichs.....http://dblp.org/pers/hd/w/Wichs:Daniel"], "conf": "crypto", "year": "2013", "pages": 18}