{"title": "On the Boundary of Behavioral Strategies.", "fields": ["nash equilibrium", "doxastic logic", "forcing", "modal logic", "epistemic modal logic"], "abstract": "In recent years, huge effort has been devoted to the definition of modal logics for strategic reasoning in the setting of multi-agent games. In this area, a recent contribution is the introduction of Strategy Logic (SL, for short) by Mogavero, Murano, and Vardi. This logic allows to reason explicitly about strategies as first order objects. It strictly subsumes all major previously studied logics in the field and let to express in a very natural and elegant way several solution concepts like Nash equilibria, secure equilibira, ecc. The price that one has to pay for the high expressiveness of SL semantics is that agents' strategies it admits may be not behavioral, i.e., a choice of an agent, at a given moment of a play, may depend on a choice another agent can make in the future, along the same play. As the latter choices are unpredictable, these kinds of strategies cannot be implemented. Clearly, this is a strong practical limitation on using SL for synthesizing strategies. In this paper, we investigate two syntactical fragments of SL, namely Conjunctive Strategy Logic and Disjunctive Strategy Logic, respectively named SL[CG] and SL[DG] for short, and prove that their semantics admit behavioral strategies only. These logics are respectively obtained by forcing SL formulas to be only conjunctions or disjunctions of goals, which are temporal assertions associated with a binding of agents with strategies. As SL formulas with any Boolean combination of goals turn out to be non behavioral, we have that SL[CG] and SL[DG] represent the maximal fragments of SL having behavioral strategies. As a consequence of the above results, we also prove that the model-checking question for both SL[CG] and SL[DG] is solvable in 2ExpTime as it is for the subsumed logic ATL*.", "citation": "Citations (24)", "departments": ["Univ. degli Stu ... , Naples, Italy", "Univ. degli Stu ... , Naples, Italy", "Univ. degli Stu ... , Naples, Italy"], "authors": ["Fabio Mogavero.....http://dblp.org/pers/hd/m/Mogavero:Fabio", "Aniello Murano.....http://dblp.org/pers/hd/m/Murano:Aniello", "Luigi Sauro.....http://dblp.org/pers/hd/s/Sauro:Luigi"], "conf": "lics", "year": "2013", "pages": 10}