{"title": "Data services for E-tailers leveraging web search engine assets.", "fields": ["data as a service", "cloud computing", "synonym", "web search engine", "leverage"], "abstract": "Retail is increasingly moving online. There are only a few big e-tailers but there is a long tail of small-sized e-tailers. The big e-tailers are able to collect significant data on user activities at their websites. They use these assets to derive insights about their products and to provide superior experiences for their users. On the other hand, small e-tailers do not possess such user data and hence cannot match the rich user experiences offered by big e-tailers. Our key insight is that web search engines possess significant data on user behaviors that can be used to help smaller e-tailers mine the same signals that big e-tailers derive from their proprietary user data assets. These signals can be exposed as data services in the cloud; e-tailers can leverage them to enable similar user experiences as the big e-tailers. We present three such data services in the paper: entity synonym data service, query-to-entity data service and entity tagging data service. The entity synonym service is an in-production data service that is currently available while the other two are data services currently in development at Microsoft. Our experiments on product datasets show (i) these data services have high quality and (ii) they have significant impact on user experiences on e-tailer websites. To the best of our knowledge, this is the first paper to explore the potential of using search engine data assets for e-tailers.", "citation": "Citations (4)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Tao Cheng.....http://dblp.org/pers/hd/c/Cheng:Tao", "Kaushik Chakrabarti.....http://dblp.org/pers/hd/c/Chakrabarti:Kaushik", "Surajit Chaudhuri.....http://dblp.org/pers/hd/c/Chaudhuri:Surajit", "Vivek R. Narasayya.....http://dblp.org/pers/hd/n/Narasayya:Vivek_R=", "Manoj Syamala.....http://dblp.org/pers/hd/s/Syamala:Manoj"], "conf": "icde", "year": "2013", "pages": 12}