{"title": "Interval indexing and querying on key-value cloud stores.", "fields": ["data set", "segment tree", "tree", "speedup", "analytics"], "abstract": "Cloud key-value stores are becoming increasingly more important. Challenging applications, requiring efficient and scalable access to massive data, arise every day. We focus on supporting interval queries (which are prevalent in several data intensive applications, such as temporal querying for temporal analytics), an efficient solution for which is lacking. We contribute a compound interval index structure, comprised of two tiers: (i) the MRSegmentTree (MRST), a key-value representation of the Segment Tree, and (ii) the Endpoints Index (EPI), a column family index that stores information for interval endpoints. In addition to the above, our contributions include: (i) algorithms for efficiently constructing and populating our indices using MapReduce jobs, (ii) techniques for efficient and scalable index maintenance, and (iii) algorithms for processing interval queries. We have implemented all algorithms using HBase and Hadoop, and conducted a detailed performance evaluation. We quantify the costs associated with the construction of the indices, and evaluate our query processing algorithms using queries on real data sets. We compare the performance of our approach to two alternatives: the native support for interval queries provided in HBase, and the execution of such queries using the Hive query execution tool. Our results show a significant speedup, far outperforming the state of the art.", "citation": "Citations (15)", "departments": ["University of Patras", "University of Patras", "University of Patras", "University of Patras"], "authors": ["George Sfakianakis.....http://dblp.org/pers/hd/s/Sfakianakis:George", "Ioannis Patlakas.....http://dblp.org/pers/hd/p/Patlakas:Ioannis", "Nikos Ntarmos.....http://dblp.org/pers/hd/n/Ntarmos:Nikos", "Peter Triantafillou.....http://dblp.org/pers/hd/t/Triantafillou:Peter"], "conf": "icde", "year": "2013", "pages": 12}