{"title": "Mining checkins from location-sharing services for client-independent IP geolocation.", "fields": ["geolocation", "exploit", "internet hosting service", "network delay", "response time"], "abstract": "Accurately determining the geographic location of an Internet host is important for location-aware applications such as location-based advertising and network diagnostics. Despite their fast response time, widely used database-driven geolocation approaches provide only inaccurate locations. Delay measurement based approaches improve the estimation accuracy but still suffer from a limited precision (about 10 km) and a long response time (tens of seconds) to localize a single PC, which cannot meet the demand of precise and real-time geolocation for location- aware applications. In this paper, we propose a new geolocation approach, Checkin-Geo, which exploits geolocation resources fun- damentally different from existing database-driven (using DNS, Whois, etc.) or network delay measurement based approaches. In particular, we leverage the location data that users are willing to share in location-sharing services and logs of user logins from PCs for real-time and accurate geolocation. Experimental results show that compared to existing geolocation techniques, Checkin-Geo achieves 1) a median estimation error of 799 meters (an order of magnitude smaller than existing approaches), and 2) a negligible response time, which are promising for accurate location-aware applications.", "citation": "Citations (16)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Göttingen"], "authors": ["Hao Liu.....http://dblp.org/pers/hd/l/Liu_0006:Hao", "Yaoxue Zhang.....http://dblp.org/pers/hd/z/Zhang:Yaoxue", "Yuezhi Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuezhi", "Di Zhang.....http://dblp.org/pers/hd/z/Zhang:Di", "Xiaoming Fu.....http://dblp.org/pers/hd/f/Fu_0001:Xiaoming", "K. K. Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:K=_K="], "conf": "infocom", "year": "2014", "pages": 9}