{"title": "Effective location identification from microblogs.", "fields": ["glitter", "point of interest", "microblogging", "approximate string matching", "tree structure"], "abstract": "The rapid development of social networks has resulted in a proliferation of user-generated content (UGC). The UGC data, when properly analyzed, can be beneficial to many applications. For example, identifying a user's locations from microblogs is very important for effective location-based advertisement and recommendation. In this paper, we study the problem of identifying a user's locations from microblogs. This problem is rather challenging because the location information in a microblog is incomplete and we cannot get an accurate location from a local microblog. To address this challenge, we propose a global location identification method, called Glitter. Glitter combines multiple microblogs of a user and utilizes them to identify the user's locations. Glitter not only improves the quality of identifying a user's location but also supplements the location of a microblog so as to obtain an accurate location of a microblog. To facilitate location identification, GLITTER organizes points of interest (POIs) into a tree structure where leaf nodes are POIs and non-leaf nodes are segments of POIs, e.g., countries, states, cities, districts, and streets. Using the tree structure, Glitter first extracts candidate locations from each microblog of a user which correspond to some tree nodes. Then Glitter aggregates these candidate locations and identifies top-k locations of the user. Using the identified top-k user locations, Glitter refines the candidate locations and computes top-k locations of each microblog. To achieve high recall, we enable fuzzy matching between locations and microblogs. We propose an incremental algorithm to support dynamic updates of microblogs. Experimental results on real-world datasets show that our method achieves high quality and good performance, and scales very well.", "citation": "Citations (23)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "National University of Singapore"], "authors": ["Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Jun Hu.....http://dblp.org/pers/hd/h/Hu:Jun", "Jianhua Feng.....http://dblp.org/pers/hd/f/Feng:Jianhua", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee"], "conf": "icde", "year": "2014", "pages": 12}