{"title": "Modeling mass protest adoption in social network communities using geometric brownian motion.", "fields": ["geometric brownian motion", "social media", "word of mouth", "poisson process", "dissemination"], "abstract": "Modeling the movement of information within social media outlets, like Twitter, is key to understanding to how ideas spread but quantifying such movement runs into several difficulties. Two specific areas that elude a clear characterization are (i) the intrinsic random nature of individuals to potentially adopt and subsequently broadcast a Twitter topic, and (ii) the dissemination of information via non-Twitter sources, such as news outlets and word of mouth, and its impact on Twitter propagation. These distinct yet inter-connected areas must be incorporated to generate a comprehensive model of information diffusion. We propose a bispace model to capture propagation in the union of (exclusively) Twitter and non-Twitter environments. To quantify the stochastic nature of Twitter topic propagation, we combine principles of geometric Brownian motion and traditional network graph theory. We apply Poisson process functions to model information diffusion outside of the Twitter mentions network. We discuss techniques to unify the two sub-models to accurately model information dissemination. We demonstrate the novel application of these techniques on real Twitter datasets related to mass protest adoption in social communities.", "citation": "Citations (13)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech", "LinkedIn"], "authors": ["Fang Jin.....http://dblp.org/pers/hd/j/Jin:Fang", "Rupinder Paul Khandpur.....http://dblp.org/pers/hd/k/Khandpur:Rupinder_Paul", "Nathan Self.....http://dblp.org/pers/hd/s/Self:Nathan", "Edward R. Dougherty.....http://dblp.org/pers/hd/d/Dougherty:Edward_R=", "Sheng Guo.....http://dblp.org/pers/hd/g/Guo_0002:Sheng", "Feng Chen.....http://dblp.org/pers/hd/c/Chen_0001:Feng", "B. Aditya Prakash.....http://dblp.org/pers/hd/p/Prakash:B=_Aditya", "Naren Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Naren"], "conf": "kdd", "year": "2014", "pages": 10}