{"title": "The Complexity of Counting Edge Colorings and a Dichotomy for Some Higher Domain Holant Problems.", "fields": ["planar graph", "galois group", "tutte polynomial", "galois theory", "schaefer s dichotomy theorem", "special case", "puiseux series"], "abstract": "We show that an effective version of Siegel’s theorem on finiteness of integer solutions for a specific algebraic curve and an application of elementary Galois theory are key ingredients in a complexity classification of some Holant problems. These Holant problems, denoted by \\({\\text {Holant}}(f)\\), are defined by a symmetric ternary function f that is invariant under any permutation of the \\(\\kappa \\ge 3\\) domain elements. We prove that \\({\\text {Holant}}(f)\\) exhibits a complexity dichotomy. The hardness, and thus the dichotomy, holds even when restricted to planar multigraphs. A special case of this result is that counting edge \\(\\kappa \\)-colorings is #P-hard over planar 3-regular multigraphs for all \\(\\kappa \\ge 3\\). In fact, we prove that counting edge \\(\\kappa \\)-colorings is #P-hard over planar r-regular multigraphs for all \\(\\kappa \\ge r \\ge 3\\). The problem is polynomial time computable in all other parameter settings. The proof of the dichotomy theorem for \\({\\text {Holant}}(f)\\) depends on the fact that a specific polynomial p(x, y) has an explicitly listed finite set of integer solutions and the determination of the Galois groups of some specific polynomials. In the process, we also encounter the Tutte polynomial, medial graphs, Eulerian partitions, Puiseux series, and a certain lattice condition on the (logarithm of) the roots of polynomials.", "citation": "Citations (7)", "departments": ["University of Wisconsin-Madison", "Queen Mary University of London", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Jin-Yi Cai.....http://dblp.org/pers/hd/c/Cai:Jin=Yi", "Heng Guo.....http://dblp.org/pers/hd/g/Guo_0001:Heng", "Tyson Williams.....http://dblp.org/pers/hd/w/Williams:Tyson"], "conf": "focs", "year": "2014", "pages": 10}