{"title": "Unifying Leakage Models: From Probing Attacks to Noisy Leakage.", "fields": ["communication noise", "cryptography", "implementation", "adversary", "security analysis", "masking", "bounded function", "mathematical proof", "leakage"], "abstract": "A recent trend in cryptography is to formally show the leakage resilience of cryptographic implementations in a given leakage model. A realistic model is to assume that leakages are sufficiently noisy, following real-world observations. While the noisy leakage assumption has first been studied in the seminal work of Chari et al. (CRYPTO 99), the recent work of Prouff and Rivain (Eurocrypt 2013) provides the first analysis of a full masking scheme under a physically motivated noise model. Unfortunately, the security analysis of Prouff and Rivain has three important shortcomings: (1) it requires leak-free gates, (2) it considers a restricted adversarial model (random message attacks), and (3) the security proof has limited application for cryptographic settings. In this work, we provide an alternative security proof in the same noisy model that overcomes these three challenges. We achieve this goal by a new reduction from noisy leakage to the important theoretical model of probing adversaries (Ishai et al – CRYPTO 2003). Our work can be viewed as a next step of closing the gap between theory and practice in leakage resilient cryptography: while our security proofs heavily rely on concepts of theoretical cryptography, we solve problems in practically motivated leakage models.", "citation": "Not cited", "year": "2014", "departments": ["École Polytechnique Fédérale de Lausanne", "University of Warsaw", "Sapienza University of Rome", "École Polytechnique Fédérale de Lausanne", "University of Warsaw", "Technische Universität Darmstadt", "University of A ... HES-SO/HEIG-VD)"], "conf": "eurocrypt", "authors": ["Alexandre Duc.....http://dblp.org/pers/hd/d/Duc:Alexandre", "Stefan Dziembowski.....http://dblp.org/pers/hd/d/Dziembowski:Stefan", "Sebastian Faust.....http://dblp.org/pers/hd/f/Faust:Sebastian"], "pages": 18}