{"title": "Performance-aware energy optimization on mobile devices in cellular network.", "fields": ["user experience design", "efficient energy use", "mobile computing", "energy minimization", "radio access network", "cellular network", "radio resource management", "cellular traffic", "mobile device"], "abstract": "In cellular networks, it is important to conserve energy while at the same time satisfying different user performance requirements. In this paper, we first propose a comprehensive metric to capture the user performance cost due to task delay, deadline violation, different application profiles, and user preferences. We prove that finding the energy-optimal scheduling solution while meeting the requirements on the performance cost is NP-hard. Then, we design an adaptive online scheduling algorithm PerES to minimize the total energy cost on data transmissions subject to user performance constraints. We prove that PerES can make the energy consumption arbitrarily close to that of the optimal scheduling solution. Further, we develop offline algorithms to serve as the evaluation benchmark for PerES. The evaluation results demonstrate that PerES achieves average 2.5 times faster convergence speed compared to state-of-art static methods, and also higher performance than peers under various test conditions. Using 821 million traffic flows collected from a commercial cellular carrier, we verify our scheme could achieve on average 32-56 percent energy savings over the total transmission energy with different levels of user experience.", "citation": "Citations (14)", "departments": ["Tsinghua University", "Tsinghua University", "Stony Brook University", "City University of Hong Kong", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Stony Brook University", "Tsinghua University", "Tsinghua University"], "authors": ["Yong Cui.....http://dblp.org/pers/hd/c/Cui_0001:Yong", "Shihan Xiao.....http://dblp.org/pers/hd/x/Xiao:Shihan", "Xin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Xin", "Minming Li.....http://dblp.org/pers/hd/l/Li:Minming", "Hongyi Wang.....http://dblp.org/pers/hd/w/Wang:Hongyi", "Zeqi Lai.....http://dblp.org/pers/hd/l/Lai:Zeqi"], "conf": "infocom", "year": "2014", "pages": 9}