{"title": "Hardness of k-LWE and Applications in Traitor Tracing.", "fields": ["lattice problem", "computational indistinguishability", "lattice based cryptography", "traitor tracing", "learning with errors"], "abstract": "We introduce the k-LWE problem, a Learning With Errors variant of the k-SIS problem. The Boneh-Freeman reduction from SIS to k-SIS suffers from an exponential loss in k. We improve and extend it to an LWE to k-LWE reduction with a polynomial loss in k, by relying on a new technique involving trapdoors for random integer kernel lattices. Based on this hardness result, we present the first algebraic construction of a traitor tracing scheme whose security relies on the worst-case hardness of standard lattice problems. The proposed LWE traitor tracing is almost as efficient as the LWE encryption. Further, it achieves public traceability, i.e., allows the authority to delegate the tracing capability to ”untrusted” parties. To this aim, we introduce the notion of projective sampling family in which each sampling function is keyed and, with a projection of the key on a well chosen space, one can simulate the sampling function in a computationally indistinguishable way. The construction of a projective sampling family from k-LWE allows us to achieve public traceability, by publishing the projected keys of the users. We believe that the new lattice tools and the projective sampling family are quite general that they may have applications in other areas.", "citation": "Citations (17)", "departments": ["Nanyang Technological University", "Centre national de la recherche scientifique", "French Institute for Research in Computer Science and Automation", "Monash University", "Nanyang Technological University", "University of Limoges", "French Institute for Research in Computer Science and Automation", "Monash University"], "authors": ["San Ling.....http://dblp.org/pers/hd/l/Ling:San", "Duong Hieu Phan.....http://dblp.org/pers/hd/p/Phan:Duong_Hieu", "Damien Stehlé.....http://dblp.org/pers/hd/s/Stehl=eacute=:Damien", "Ron Steinfeld.....http://dblp.org/pers/hd/s/Steinfeld:Ron"], "conf": "crypto", "year": "2014", "pages": 20}