{"title": "GenBase: a complex analytics genomics benchmark.", "fields": ["coprocessor", "scripting language", "web analytics", "array dbms", "analytics"], "abstract": "This paper introduces a new benchmark designed to test database management system (DBMS) performance on a mix of data management tasks (joins, filters, etc.) and complex analytics (regression, singular value decomposition, etc.) Such mixed workloads are prevalent in a number of application areas including most science workloads and web analytics. As a specific use case, we have chosen genomics data for our benchmark and have constructed a collection of typical tasks in this domain. In addition to being representative of a mixed data management and analytics workload, this benchmark is also meant to scale to large dataset sizes and multiple nodes across a cluster. Besides presenting this benchmark, we have run it on a variety of storage systems including traditional row stores, newer column stores, Hadoop, and an array DBMS. We present performance numbers on all systems on single and multiple nodes, and show that performance differs by orders of magnitude between the various solutions. In addition, we demonstrate that most platforms have scalability issues. We also test offloading the analytics onto a coprocessor. The intent of this benchmark is to focus research interest in this area; to this end, all of our data, data generators, and scripts are available on our web site.", "citation": "Citations (17)", "year": "2014", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Intel", "Intel", "Massachusetts Institute of Technology"], "conf": "sigmod", "authors": ["Rebecca Taft.....http://dblp.org/pers/hd/t/Taft:Rebecca", "Manasi Vartak.....http://dblp.org/pers/hd/v/Vartak:Manasi", "Nadathur Rajagopalan Satish.....http://dblp.org/pers/hd/s/Satish:Nadathur_Rajagopalan", "Narayanan Sundaram.....http://dblp.org/pers/hd/s/Sundaram:Narayanan", "Samuel Madden.....http://dblp.org/pers/hd/m/Madden:Samuel", "Michael Stonebraker.....http://dblp.org/pers/hd/s/Stonebraker:Michael"], "pages": 12}