{"title": "Assigning time budgets to component functions in the design of time-critical automotive systems.", "fields": ["model driven architecture", "autosar", "design space exploration", "automotive software", "procurement"], "abstract": "The adoption of AUTOSAR and Model Driven Engineering (MDE) for the design of automotive software architectures allows an early analysis of system properties and the automatic synthesis of architecture and software implementation. To select and configure the architecture with respect to timing constraints, knowledge about the worst case execution times (WCET) of functions is required. An accurate evaluation of the WCET is only possible when reusing legacy functionality or very late in the development and procurement process. To drive the integration of SW components belonging to systems with timing constraints, automotive methodologies propose to assign WCET budgets to functions. This paper presents two solutions to assign budgets, while considering at the same time the problem of SW/HW synthesis. The first solution is a one-step algorithm. The second is an iterative improvement procedure with a staged approach that scales better to very large size systems. Both methods are evaluated on industrial systems to study their effectiveness and scalability.", "citation": "Citations (3)", "departments": ["Sant'Anna School of Advanced Studies", "McGill University", "CEA LIST, Gif s ...  Yvette, France", "CEA LIST, Gif s ...  Yvette, France", "CEA LIST, Gif s ...  Yvette, France"], "authors": ["Ernest Wozniak.....http://dblp.org/pers/hd/w/Wozniak:Ernest", "Marco Di Natale.....http://dblp.org/pers/hd/n/Natale:Marco_Di", "Haibo Zeng.....http://dblp.org/pers/hd/z/Zeng:Haibo", "Chokri Mraidha.....http://dblp.org/pers/hd/m/Mraidha:Chokri", "Sara Tucci Piergiovanni.....http://dblp.org/pers/hd/p/Piergiovanni:Sara_Tucci", "Sébastien Gérard.....http://dblp.org/pers/hd/g/G=eacute=rard:S=eacute=bastien"], "conf": "kbse", "year": "2014", "pages": 12}