{"title": "Which concepts are worth extracting?", "fields": ["regrading", "conceptual design", "maximization", "polynomial time approximation scheme", "annotation"], "abstract": "It is well established that extracting and annotating occurrences of entities in a collection of unstructured text documents with their concepts improve the effectiveness of answering queries over the collection. However, it is very resource intensive to create and maintain large annotated collections. Since the available resources of an enterprise are limited and/or its users may have urgent information needs, it may have to select only a subset of relevant concepts for extraction and annotation. We call this subset a conceptual design for the annotated collection. In this paper, we introduce the problem of cost effective conceptual design, where given a collection, a set of relevant concepts, and a fixed budget, one likes to find a conceptual design that improves the effectiveness of answering queries over the collection the most. We prove that the problem is generally NP-hard in the number of relevant concepts and propose two efficient approximation algorithms to solve the problem: Approximate Popularity Maximization (APM for short) and Approximate Annotation-benefit Maximization (AAM for short). We show that if there is not any constraints regrading the overlap of concepts, APM is a fully polynomial time approximation scheme. We also prove that if the relevant concepts are mutually exclusive, APM has a constant approximation ratio and AAM is a fully polynomial time approximation scheme. Our empirical results using Wikipedia collection and a search engine query log validate the proposed formalization of the problem and show that APM and AAM efficiently compute conceptual designs. They also indicate that in general APM delivers the optimal conceptual designs if the relevant concepts are not mutually exclusive. Also, if the relevant concepts are mutually exclusive, the conceptual designs delivered by AAM improve the effectiveness of answering queries over the collection more than the solutions provided by APM.", "citation": "Citations (3)", "year": "2014", "departments": ["Oregon State University", "Massachusetts Institute of Technology", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "sigmod", "authors": ["Arash Termehchy.....http://dblp.org/pers/hd/t/Termehchy:Arash", "Ali Vakilian.....http://dblp.org/pers/hd/v/Vakilian:Ali", "Yodsawalai Chodpathumwan.....http://dblp.org/pers/hd/c/Chodpathumwan:Yodsawalai", "Marianne Winslett.....http://dblp.org/pers/hd/w/Winslett:Marianne"], "pages": 12}