{"title": "Exponential improvement in precision for simulating sparse Hamiltonians.", "fields": ["log log plot", "quantum algorithm", "mathematics", "amplitude amplification", "exponential function", "quantum", "sparse approximation", "qubit", "mathematical optimization"], "abstract": "We provide a quantum algorithm for simulating the dynamics of sparse Hamiltonians with complexity sublogarithmic in the inverse error, an exponential improvement over previous methods. Specifically, we show that a  d -sparse Hamiltonian  H  on  n  qubits can be simulated for time  t  with precision  e  using  O ( τ log( τ / e )/log log( τ/e )) queries and  O ( τn log 2 ( τ/e )/log log( τ/e )) additional 2-qubit gates, where τ=d 2 ||H|| max t  . Unlike previous approaches based on product formulas, the query complexity is independent of the number of qubits acted on, and for time-varying Hamiltonians, the gate complexity is logarithmic in the norm of the derivative of the Hamiltonian. Our algorithm is based on a significantly improved simulation of the continuous- and fractional-query models using discrete quantum queries, showing that the former models are not much more powerful than the discrete model even for very small error. We also significantly simplify the analysis of this conversion, avoiding the need for a complex fault correction procedure. Our simplification relies on a new form of \"oblivious amplitude amplification\" that can be applied even though the reflection about the input state is unavailable. Finally, we prove new lower bounds showing that our algorithms are optimal as a function of the error.", "citation": "Citations (56)", "year": "2014", "departments": ["Macquarie University", "University of Waterloo", "University of Waterloo", "University of Waterloo", "Los Alamos National Laboratory", "University of Maryland, College Park", "University of Waterloo", "Canadian Institute for Advanced Research", "University of Waterloo", "Massachusetts Institute of Technology", "University of Waterloo", "Los Alamos National Laboratory", "Department of P ... s and Astronomy"], "conf": "stoc", "authors": ["Dominic W. Berry.....http://dblp.org/pers/hd/b/Berry:Dominic_W=", "Andrew M. Childs.....http://dblp.org/pers/hd/c/Childs:Andrew_M=", "Richard Cleve.....http://dblp.org/pers/hd/c/Cleve:Richard", "Robin Kothari.....http://dblp.org/pers/hd/k/Kothari:Robin", "Rolando D. Somma.....http://dblp.org/pers/hd/s/Somma:Rolando_D="], "pages": 10}