{"title": "FAST: Near Real-Time Searchable Data Analytics for the Cloud.", "fields": ["analytics", "exploit", "data analysis", "cloud storage", "latency"], "abstract": "With the explosive growth in data volume and complexity and the increasing need for highly efficient searchable data analytics, existing cloud storage systems have largely failed to offer an adequate capability for real-time data analytics. Since the true value or worth of data heavily depends on how efficiently data analytics can be carried out on the data in (near-) real-time, large fractions of data end up with their values being lost or significantly reduced due to the data staleness. To address this problem, we propose a near-real-time and cost-effective searchable data analytics methodology, called FAST. The idea behind FAST is to explore and exploit the semantic correlation within and among datasets via correlation-aware hashing and manageable flat-structured addressing to significantly reduce the processing latency, while incurring acceptably small loss of data-search accuracy. The near-real-time property of FAST enables rapid identification of correlated files and the significant narrowing of the scope of data to be processed. FAST supports several types of data analytics, which can be implemented in existing searchable storage systems. We conduct a real-world use case in which children reported missing in an extremely crowded environment (e.g., a highly popular scenic spot on a peak tourist day) are identified in a timely fashion by analyzing 60 million images using FAST. Extensive experimental results demonstrate the efficiency and efficacy of FAST in the performance improvements and energy savings.", "citation": "Citations (11)", "departments": ["Huazhong University of Science and Technology", "University of Nebraska–Lincoln", "Huazhong University of Science and Technology"], "authors": ["Yu Hua.....http://dblp.org/pers/hd/h/Hua_0001:Yu", "Hong Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Hong", "Dan Feng.....http://dblp.org/pers/hd/f/Feng_0001:Dan"], "conf": "sc", "year": "2014", "pages": 12}