{"title": "A temporal context-aware model for user behavior modeling in social media systems.", "fields": ["social media mining", "social media", "content addressable memory", "mixture model", "data mining"], "abstract": "Social media provides valuable resources to analyze user behaviors and capture user preferences. This paper focuses on analyzing user behaviors in social media systems and designing a latent class statistical mixture model, named temporal context-aware mixture model (TCAM), to account for the intentions and preferences behind user behaviors. Based on the observation that the behaviors of a user in social media systems are generally influenced by intrinsic interest as well as the temporal context (e.g., the public's attention at that time), TCAM simultaneously models the topics related to users' intrinsic interests and the topics related to temporal context and then combines the influences from the two factors to model user behaviors in a unified way. To further improve the performance of TCAM, an item-weighting scheme is proposed to enable TCAM to favor items that better represent topics related to user interests and topics related to temporal context, respectively. Based on TCAM, we design an efficient query processing technique to support fast online recommendation for large social media data. Extensive experiments have been conducted to evaluate the performance of TCAM on four real-world datasets crawled from different social media sites. The experimental results demonstrate the superiority of the TCAM models, compared with the state-of-the-art competitor methods, by modeling user behaviors more precisely and making more effective and efficient recommendations.", "citation": "Citations (97)", "year": "2014", "departments": ["Peking University", "Peking University", "University of Technology, Sydney", "Peking University", "University of Queensland"], "conf": "sigmod", "authors": ["Hongzhi Yin.....http://dblp.org/pers/hd/y/Yin:Hongzhi", "Bin Cui.....http://dblp.org/pers/hd/c/Cui_0001:Bin", "Ling Chen.....http://dblp.org/pers/hd/c/Chen:Ling", "Zhiting Hu.....http://dblp.org/pers/hd/h/Hu:Zhiting", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi"], "pages": 12}