{"title": "Related-Key Security for Pseudorandom Functions Beyond the Linear Barrier.", "fields": ["cryptographic primitive", "open problem", "pseudorandom number generator", "affine transformation", "adversary", "pseudorandom generator theorem"], "abstract": "Related-key attacks (RKAs) concern the security of cryptographic primitives in the situation where the key can be manipulated by the adversary. In the RKA setting, the adversary’s power is expressed through the class of related-key deriving (RKD) functions which the adversary is restricted to using when modifying keys. Bellare and Kohno (Eurocrypt 2003) first formalised RKAs and pin-pointed the foundational problem of constructing RKA-secure pseudorandom functions (RKA-PRFs). To date there are few constructions for RKA-PRFs under standard assumptions, and it is a major open problem to construct RKA-PRFs for larger classes of RKD functions. We make significant progress on this problem. We first show how to repair the Bellare-Cash framework for constructing RKA-PRFs and extend it to handle the more challenging case of classes of RKD functions that contain claws. We apply this extension to show that a variant of the Naor-Reingold function already considered by Bellare and Cash is an RKA-PRF for a class of affine RKD functions under the DDH assumption, albeit with an exponential-time security reduction. We then develop a second extension of the Bellare-Cash framework, and use it to show that the same Naor-Reingold variant is actually an RKA-PRF for a class of degree d polynomial RKD functions under the stronger decisional d-Diffie-Hellman inversion assumption. As a significant technical contribution, our proof of this result avoids the exponential-time security reduction that was inherent in the work of Bellare and Cash and in our first result.", "citation": "Not cited", "departments": ["École Normale Supérieure", "École Normale Supérieure", "École Normale Supérieure", "Royal Holloway, University of London", "PSL Research University", "IBM", "University of California, Los Angeles", "University of London"], "authors": ["Michel Abdalla.....http://dblp.org/pers/hd/a/Abdalla:Michel", "Fabrice Benhamouda.....http://dblp.org/pers/hd/b/Benhamouda:Fabrice", "Alain Passelègue.....http://dblp.org/pers/hd/p/Passel=egrave=gue:Alain", "Kenneth G. Paterson.....http://dblp.org/pers/hd/p/Paterson:Kenneth_G="], "conf": "crypto", "year": "2014", "pages": 18}