{"title": "Parallel Deep Neural Network Training for Big Data on Blue Gene/Q.", "fields": ["big data", "time delay neural network", "supercomputer", "object detection", "multi core processor", "programming paradigm"], "abstract": "Deep Neural Networks (DNNs) have recently been shown to significantly outperform existing machine learning techniques in several pattern recognition tasks. DNNs are the state-of-the-art models used in image recognition, object detection, classification and tracking, and speech and language processing applications. The biggest drawback to DNNs has been the enormous cost in computation and time taken to train the parameters of the networks - often a tenfold increase relative to conventional technologies. Such training time costs can be mitigated by the application of parallel computing algorithms and architectures. However, these algorithms often run into difficulties because of the cost of inter-processor communication bottlenecks. In this paper, we describe how to enable Parallel Deep Neural Network Training on the IBM Blue Gene/Q (BG/Q) computer system. Specifically, we explore DNN training using the data parallel Hessian-free 2nd order optimization algorithm. Such an algorithm is particularly well-suited to parallelization across a large set of loosely coupled processors. BG/Q, with its excellent inter-processor communication characteristics, is an ideal match for this type of algorithm. The paper discusses how issues regarding programming model and data-dependent imbalances are addressed. Results on large-scale speech tasks show that the performance on BG/Q scales linearly up to 4096 processes with no loss in accuracy. This allows us to train neural networks using billions of training examples in a few hours.", "citation": "Citations (17)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM", "IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["I-Hsin Chung.....http://dblp.org/pers/hd/c/Chung:I=Hsin", "Tara N. Sainath.....http://dblp.org/pers/hd/s/Sainath:Tara_N=", "Bhuvana Ramabhadran.....http://dblp.org/pers/hd/r/Ramabhadran:Bhuvana", "Michael Picheny.....http://dblp.org/pers/hd/p/Picheny:Michael", "John A. Gunnels.....http://dblp.org/pers/hd/g/Gunnels:John_A=", "Vernon Austel.....http://dblp.org/pers/hd/a/Austel:Vernon", "Upendra V. Chaudhari.....http://dblp.org/pers/hd/c/Chaudhari:Upendra_V=", "Brian Kingsbury.....http://dblp.org/pers/hd/k/Kingsbury:Brian"], "conf": "sc", "year": "2014", "pages": 9}