{"title": "Caffe: Convolutional Architecture for Fast Feature Embedding.", "fields": ["theano", "cuda", "convolutional neural network", "resnet", "deep learning"], "abstract": "Caffe provides multimedia scientists and practitioners with a clean and modifiable framework for state-of-the-art deep learning algorithms and a collection of reference models. The framework is a BSD-licensed C++ library with Python and MATLAB bindings for training and deploying general-purpose convolutional neural networks and other deep models efficiently on commodity architectures. Caffe fits industry and internet-scale media needs by CUDA GPU computation, processing over 40 million images a day on a single K40 or Titan GPU (approx 2 ms per image). By separating model representation from actual implementation, Caffe allows experimentation and seamless switching among platforms for ease of development and deployment from prototyping machines to cloud environments.   Caffe is maintained and developed by the Berkeley Vision and Learning Center (BVLC) with the help of an active community of contributors on GitHub. It powers ongoing research projects, large-scale industrial applications, and startup prototypes in vision, speech, and multimedia.", "citation": "Citations (9,020)", "departments": ["Google", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["Yangqing Jia.....http://dblp.org/pers/hd/j/Jia:Yangqing", "Evan Shelhamer.....http://dblp.org/pers/hd/s/Shelhamer:Evan", "Jeff Donahue.....http://dblp.org/pers/hd/d/Donahue:Jeff", "Sergey Karayev.....http://dblp.org/pers/hd/k/Karayev:Sergey", "Jonathan Long.....http://dblp.org/pers/hd/l/Long:Jonathan", "Ross B. Girshick.....http://dblp.org/pers/hd/g/Girshick:Ross_B=", "Sergio Guadarrama.....http://dblp.org/pers/hd/g/Guadarrama:Sergio", "Trevor Darrell.....http://dblp.org/pers/hd/d/Darrell:Trevor"], "conf": "mm", "year": "2014", "pages": 4}