{"title": "Can long passwords be secure and usable?", "fields": ["password policy", "password", "usable", "password strength", "security policy"], "abstract": "To encourage strong passwords, system administrators employ password-composition policies, such as a traditional policy requiring that passwords have at least 8 characters from 4 character classes and pass a dictionary check. Recent research has suggested, however, that policies requiring longer passwords with fewer additional requirements can be more usable and in some cases more secure than this traditional policy. To explore long passwords in more detail, we conducted an online experiment with 8,143 participants. Using a cracking algorithm modified for longer passwords, we evaluate eight policies across a variety of metrics for strength and usability. Among the longer policies, we discover new evidence for a security/usability tradeoff, with none being strictly better than another on both dimensions. However, several policies are both more usable and more secure that the traditional policy we tested. Our analyses additionally reveal common patterns and strings found in cracked passwords. We discuss how system administrators can use these results to improve password-composition policies.", "citation": "Citations (85)", "year": "2014", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "chi", "authors": ["Richard Shay.....http://dblp.org/pers/hd/s/Shay:Richard", "Saranga Komanduri.....http://dblp.org/pers/hd/k/Komanduri:Saranga", "Adam L. Durity.....http://dblp.org/pers/hd/d/Durity:Adam_L=", "Phillip (Seyoung) Huh.....http://dblp.org/pers/hd/h/Huh:Phillip_=Seyoung=", "Michelle L. Mazurek.....http://dblp.org/pers/hd/m/Mazurek:Michelle_L=", "Sean M. Segreti.....http://dblp.org/pers/hd/s/Segreti:Sean_M=", "Blase Ur.....http://dblp.org/pers/hd/u/Ur:Blase", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Nicolas Christin.....http://dblp.org/pers/hd/c/Christin:Nicolas", "Lorrie Faith Cranor.....http://dblp.org/pers/hd/c/Cranor:Lorrie_Faith"], "pages": 10}