{"title": "X10 and APGAS at Petascale.", "fields": ["partitioned global address space", "supercomputer", "betweenness centrality", "concurrency", "petascale computing"], "abstract": "X10 is a high-performance, high-productivity programming language aimed at large-scale distributed and shared-memory parallel applications. It is based on the Asynchronous Partitioned Global Address Space (APGAS) programming model, supporting the same fine-grained concurrency mechanisms within and across shared-memory nodes.   We demonstrate that X10 delivers solid performance at petascale by running (weak scaling) eight application kernels on an IBM Power 775 supercomputer utilizing up to 55,680 Power7 cores (for 1.7 Pflop/s of theoretical peak performance). We detail our advances in distributed termination detection, distributed load balancing, and use of high-performance interconnects that enable X10 to scale out to tens of thousands of cores.   For the four HPC Class 2 Challenge benchmarks, X10 achieves 41% to 87% of the system's potential at scale (as measured by IBM's HPCC Class 1 optimized runs). We also implement K-Means, Smith-Waterman, Betweenness Centrality, and Unbalanced Tree Search (UTS) for geometric trees. Our UTS implementation is the first to scale to petaflop systems.", "citation": "Citations (24)", "year": "2014", "departments": ["IBM", "IBM", "Google", "IBM", "IBM", "IBM", "IBM", "IBM", "IBM", "IBM"], "conf": "ppopp", "authors": ["Olivier Tardieu.....http://dblp.org/pers/hd/t/Tardieu:Olivier", "Benjamin Herta.....http://dblp.org/pers/hd/h/Herta:Benjamin", "David Cunningham.....http://dblp.org/pers/hd/c/Cunningham:David", "David Grove.....http://dblp.org/pers/hd/g/Grove:David", "Prabhanjan Kambadur.....http://dblp.org/pers/hd/k/Kambadur:Prabhanjan", "Vijay A. Saraswat.....http://dblp.org/pers/hd/s/Saraswat:Vijay_A=", "Avraham Shinnar.....http://dblp.org/pers/hd/s/Shinnar:Avraham", "Mikio Takeuchi.....http://dblp.org/pers/hd/t/Takeuchi:Mikio", "Mandana Vaziri.....http://dblp.org/pers/hd/v/Vaziri:Mandana"], "pages": 14}