{"title": "Information extraction and manipulation threats in crowd-powered systems.", "fields": ["crowdsourcing", "flagging", "information extraction", "computer security", "workflow"], "abstract": "Crowd-powered systems have become a popular way to augment the capabilities of automated systems in real-world settings. Many of these systems rely on human workers to process potentially sensitive data or make important decisions. This puts these systems at risk of unintentionally releasing sensitive data or having their outcomes maliciously manipulated. While almost all crowd-powered approaches account for errors made by individual workers, few factor in active attacks on the system. In this paper, we analyze different forms of threats from individuals and groups of workers extracting information from crowd-powered systems or manipulating these systems' outcomes. Via a set of studies performed on Amazon's Mechanical Turk platform and involving 1,140 unique workers, we demonstrate the viability of these threats. We show that the current system is vulnerable to coordinated attacks on a task based on the requests of another task and that a significant portion of Mechanical Turk workers are willing to contribute to an attack. We propose several possible approaches to mitigating these threats, including leveraging workers who are willing to go above and beyond to help, automatically flagging sensitive content, and using workflows that conceal information from each individual, while still allowing the group to complete a task. Our findings enable the crowd to continue to play an important part in automated systems, even as the data they use and the decisions they support become increasingly important.", "citation": "Citations (28)", "departments": ["University of Rochester", "Microsoft", "Microsoft"], "authors": ["Walter S. Lasecki.....http://dblp.org/pers/hd/l/Lasecki:Walter_S=", "Jaime Teevan.....http://dblp.org/pers/hd/t/Teevan:Jaime", "Ece Kamar.....http://dblp.org/pers/hd/k/Kamar:Ece"], "conf": "cscw", "year": "2014", "pages": 9}