{"title": "MeanKS: meaningful keyword search in relational databases with complex schema.", "fields": ["database model", "semi structured model", "star schema", "information schema", "view"], "abstract": "Keyword search in relational databases was introduced in the last decade to assist users who are not familiar with a query language, the schema of the database, or the content of the data. An answer is a join tree of tuples that contains the query keywords. When searching a database with a complex schema, there are potentially many answers to the query. Therefore, ranking answers based on their relevance is crucial in this context. Prior work has addressed relevance based on the size of the answer or the IR scores of the tuples. However, this is not sufficient when searching a complex schema. We demonstrate MeanKS, a new system for meaningful keyword search over relational databases. The system first captures the user's interest by determining the roles of the keywords. Then, it uses schema-based ranking to rank join trees that cover the keyword roles. This uses the relevance of relations and foreign-key relationships in the schema over the information content of the database. In the demonstration, attendees can execute queries against the TPC-E warehouse and compare the proposed measures against a gold standard derived from a real workload over TPC-E to test the effectiveness of our methods.", "citation": "Citations (8)", "year": "2014", "departments": ["University of Ontario Institute of Technology", "York Universtiy ... nto, ON, Canada", "York Universtiy ... nto, ON, Canada", "York Universtiy ... nto, ON, Canada", "York Universtiy ... nto, ON, Canada"], "conf": "sigmod", "authors": ["Mehdi Kargar.....http://dblp.org/pers/hd/k/Kargar:Mehdi", "Aijun An.....http://dblp.org/pers/hd/a/An:Aijun", "Nick Cercone.....http://dblp.org/pers/hd/c/Cercone:Nick", "Parke Godfrey.....http://dblp.org/pers/hd/g/Godfrey:Parke", "Jaroslaw Szlichta.....http://dblp.org/pers/hd/s/Szlichta:Jaroslaw", "Xiaohui Yu.....http://dblp.org/pers/hd/y/Yu:Xiaohui"], "pages": 4}