{"title": "Major technical advancements in apache hive.", "fields": ["file format", "storage efficiency", "scalability", "big data", "data warehouse"], "abstract": "Apache Hive is a widely used data warehouse system for Apache Hadoop, and has been adopted by many organizations for various big data analytics applications. Closely working with many users and organizations, we have identified several shortcomings of Hive in its file formats, query planning, and query execution, which are key factors determining the performance of Hive. In order to make Hive continuously satisfy the requests and requirements of processing increasingly high volumes data in a scalable and efficient way, we have set two goals related to storage and runtime performance in our efforts on advancing Hive. First, we aim to maximize the effective storage capacity and to accelerate data accesses to the data warehouse by updating the existing file formats. Second, we aim to significantly improve cluster resource utilization and runtime performance of Hive by developing a highly optimized query planner and a highly efficient query execution engine. In this paper, we present a community-based effort on technical advancements in Hive. Our performance evaluation shows that these advancements provide significant improvements on storage efficiency and query execution performance. This paper also shows how academic research lays a foundation for Hive to improve its daily operations.", "citation": "Citations (81)", "year": "2014", "departments": ["Ohio State University", "Microsoft", "Hortonworks Inc ... o Alto, CA, USA", "Hortonworks Inc ... o Alto, CA, USA", "Hortonworks Inc ... o Alto, CA, USA"], "conf": "sigmod", "authors": ["Yin Huai.....http://dblp.org/pers/hd/h/Huai:Yin", "Ashutosh Chauhan.....http://dblp.org/pers/hd/c/Chauhan:Ashutosh", "Alan Gates.....http://dblp.org/pers/hd/g/Gates:Alan", "Günther Hagleitner.....http://dblp.org/pers/hd/h/Hagleitner:G=uuml=nther", "Eric N. Hanson.....http://dblp.org/pers/hd/h/Hanson:Eric_N=", "Owen O'Malley.....http://dblp.org/pers/hd/o/O=Malley:Owen", "Jitendra Pandey.....http://dblp.org/pers/hd/p/Pandey:Jitendra", "Yuan Yuan.....http://dblp.org/pers/hd/y/Yuan:Yuan", "Rubao Lee.....http://dblp.org/pers/hd/l/Lee:Rubao", "Xiaodong Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiaodong"], "pages": 12}