{"title": "Improving data forwarding in Mobile Social Networks with infrastructure support: A space-crossing community approach.", "fields": ["bubble", "reality mining", "software as a service", "exploit", "social network"], "abstract": "In this paper, we study two tightly coupled issues: space-crossing community detection and its influence on data forwarding in Mobile Social Networks (MSNs) by taking the hybrid underlying networks with infrastructure support into consideration. The hybrid underlying network is composed of large numbers of mobile users and a small portion of Access Points (APs). Because APs can facilitate the communication among long-distance nodes, the concept of physical proximity community can be extended to be one across the geographical space. In this work, we first investigate a space-crossing community detection method for MSNs. Based on the detection results, we design a novel data forwarding algorithm SAAS (Social Attraction and AP Spreading), and show how to exploit the space-crossing communities to improve the data forwarding efficiency. We evaluate our SAAS algorithm on real-life data from MIT Reality Mining and University of Illinois Movement (UIM). Results show that space-crossing community plays a positive role in data forwarding in MSNs in terms of delivery ratio and delay. Based on this new type of community, SAAS achieves a better performance than existing social community-based data forwarding algorithms in practice, including Bubble Rap and Nguyen's Routing algorithms. © 2014 IEEE.", "citation": "Citations (10)", "departments": ["Tongji University", "Tongji University", "Tongji University", "Tongji University", "University of Ottawa"], "authors": ["Zhong Li.....http://dblp.org/pers/hd/l/Li:Zhong", "Cheng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cheng", "Siqian Yang.....http://dblp.org/pers/hd/y/Yang:Siqian", "Changjun Jiang.....http://dblp.org/pers/hd/j/Jiang:Changjun", "Ivan Stojmenovic.....http://dblp.org/pers/hd/s/Stojmenovic:Ivan"], "conf": "infocom", "year": "2014", "pages": 9}