{"title": "Enablers, inhibitors, and perceptions of testing in novice software teams.", "fields": ["collaborative software", "return on investment", "test suite", "software quality", "test strategy"], "abstract": "There are many different approaches to testing software, with different benefits for software quality and the development process. Yet, it is not well understood what developers struggle with when getting started with testing - and why some do not test at all or not as much as would be good for their project. This missing understanding keeps us from improving processes and tools to help novices adopt proper testing practices. We conducted a qualitative study with 97 computer science students. Through interviews, we explored their experiences and attitudes regarding testing in a collaborative software project. We found enabling and inhibiting factors for testing activities, the different testing strategies they used, and novices’ perceptions and attitudes of testing. Students push test automation to the end of the project, thus robbing themselves from the advantages of having a test suite during implementation. Students were not convinced of the return of investment in automated tests and opted for laborious manual tests - which they often regretted in the end. Understanding such challenges and opportunities novices face when confronted with adopting testing can help us improve testing processes, company policies, and tools. Our findings provide recommendations that can enable organizations to facilitate the adoption of testing practices by their members.", "citation": "Citations (9)", "departments": ["Leibniz University of Hanover", "Leibniz University of Hanover", "Leibniz University of Hanover", "University of Victoria", "Leibniz University of Hanover"], "authors": ["Raphael Pham.....http://dblp.org/pers/hd/p/Pham:Raphael", "Stephan Kiesling.....http://dblp.org/pers/hd/k/Kiesling:Stephan", "Olga Liskin.....http://dblp.org/pers/hd/l/Liskin:Olga", "Leif Singer.....http://dblp.org/pers/hd/s/Singer:Leif", "Kurt Schneider.....http://dblp.org/pers/hd/s/Schneider:Kurt"], "conf": "sigsoft", "year": "2014", "pages": 11}