{"title": "A privacy-aware cloud-assisted healthcare monitoring system via compressive sensing.", "fields": ["cloud computing", "compressed sensing", "information privacy", "dissemination", "data acquisition"], "abstract": "Wireless sensors are being increasingly used to monitor/collect information in healthcare medical systems. For resource-efficient data acquisition, one major trend today is to utilize compressive sensing, for it unifies traditional data sampling and compression. Despite the increasing popularity, how to effectively process the ever-growing healthcare data and simultaneously protect data privacy, while maintaining low overhead at sensors, remains challenging. To address the problem, we propose a privacy-aware cloud-assisted healthcare monitoring system via compressive sensing, which integrates different domain techniques with following benefits. By design, acquired sensitive data samples never leave sensors in unprotected form. Protected samples are later sent to cloud, for storage, processing, and disseminating reconstructed data to receivers. The system is privacy-assured where cloud sees neither the original samples nor underlying data. It handles well sparse and general data, and data tampered with noise. Theoretical and empirical evaluations demonstrate the system achieves privacy-assurance, efficiency, effectiveness, and resource-savings simultaneously.", "citation": "Citations (22)", "departments": ["City University of Hong Kong", "University at Buffalo", "University at Buffalo", "University of Arizona", "University at Buffalo"], "authors": ["Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong", "Bingsheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Bingsheng", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Janet Meiling Wang Roveda.....http://dblp.org/pers/hd/r/Roveda:Janet_Meiling_Wang", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen", "Zhen Xu.....http://dblp.org/pers/hd/x/Xu:Zhen"], "conf": "infocom", "year": "2014", "pages": 9}