{"title": "Managing GPU Concurrency in Heterogeneous Architectures.", "fields": ["computer performance", "cache", "central processing unit", "shared resource", "compiler"], "abstract": "Heterogeneous architectures consisting of general-purpose CPUs and throughput-optimized GPUs are projected to be the dominant computing platforms for many classes of applications. The design of such systems is more complex than that of homogeneous architectures because maximizing resource utilization while minimizing shared resource interference between CPU and GPU applications is difficult. We show that GPU applications tend to monopolize the shared hardware resources, such as memory and network, because of their high thread-level parallelism (TLP), and discuss the limitations of existing GPU-based concurrency management techniques when employed in heterogeneous systems. To solve this problem, we propose an integrated concurrency management strategy that modulates the TLP in GPUs to control the performance of both CPU and GPU applications. This mechanism considers both GPU core state and system-wide memory and network congestion information to dynamically decide on the level of GPU concurrency to maximize system performance. We propose and evaluate two schemes: one (CM-CPU) for boosting CPU performance in the presence of GPU interference, the other (CM-BAL) for improving both CPU and GPU performance in a balanced manner and thus overall system performance. Our evaluations show that the first scheme improves average CPU performance by 24%, while reducing average GPU performance by 11%. The second scheme provides 7% average performance improvement for both CPU and GPU applications. We also show that our solution allows the user to control performance trade-offs between CPUs and GPUs.", "citation": "Citations (84)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Carnegie Mellon University", "Pennsylvania State University"], "authors": ["Onur Kayiran.....http://dblp.org/pers/hd/k/Kayiran:Onur", "Nachiappan Chidambaram Nachiappan.....http://dblp.org/pers/hd/n/Nachiappan:Nachiappan_Chidambaram", "Adwait Jog.....http://dblp.org/pers/hd/j/Jog:Adwait", "Rachata Ausavarungnirun.....http://dblp.org/pers/hd/a/Ausavarungnirun:Rachata", "Mahmut T. Kandemir.....http://dblp.org/pers/hd/k/Kandemir:Mahmut_T=", "Gabriel H. Loh.....http://dblp.org/pers/hd/l/Loh:Gabriel_H=", "Onur Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Onur", "Chita R. Das.....http://dblp.org/pers/hd/d/Das:Chita_R="], "conf": "micro", "year": "2014", "pages": 13}