{"title": "Dynamic Background Learning through Deep Auto-encoder Networks.", "fields": ["data set", "background subtraction", "motion detection", "autoencoder", "machine learning"], "abstract": "Background learning is a pre-processing of motion detection which is a basis step of video analysis. For the static background, many previous works have already achieved good performance. However, the results on learning dynamic background are still much to be improved. To address this challenge, in this paper, a novel and practical method is proposed based on deep auto-encoder networks. Firstly, dynamic background images are extracted through a deep auto-encoder network (called Background Extraction Network) from video frames containing motion objects. Then, a dynamic background model is learned by another deep auto-encoder network (called Background Learning Network) using the extracted background images as the input. To be more flexible, our background model can be updated on-line to absorb more training samples. Our main contributions are 1) a cascade of two deep auto-encoder networks which can deal with the separation of dynamic background and foregrounds very efficiently; 2) a method of online learning is adopted to accelerate the training of Background Extraction Network. Compared with previous algorithms, our approach obtains the best performance over six benchmark data sets. Especially, the experiments show that our algorithm can handle large variation background very well.", "citation": "Citations (12)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Queensland", "University of Electronic Science and Technology of China", "University of Queensland"], "authors": ["Pei Xu.....http://dblp.org/pers/hd/x/Xu:Pei", "Mao Ye.....http://dblp.org/pers/hd/y/Ye_0001:Mao", "Xue Li.....http://dblp.org/pers/hd/l/Li_0001:Xue", "Qihe Liu.....http://dblp.org/pers/hd/l/Liu:Qihe", "Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi", "Jian Ding.....http://dblp.org/pers/hd/d/Ding:Jian"], "conf": "mm", "year": "2014", "pages": 10}