{"title": "Scalable similarity search for SimRank.", "fields": ["simrank", "recursion", "vertex", "scalability", "nearest neighbor search"], "abstract": "SimRank, proposed by Jeh and Widom, provides a good similarity score and has been successfully used in many of the above mentioned applications. While there are many algorithms proposed so far to compute SimRank, but unfortunately, none of them are scalable up to graphs of billions size. Motivated by this fact, we consider the following SimRank-based similarity search problem: given a query vertex u, find top-k vertices v with the k highest SimRank scores s(u,v) with respect to u.   We propose a very fast and scalable algorithm for this similarity search problem. Our method consists of the following ingredients: (1) We first introduce a \"linear\" recursive formula for SimRank. This allows us to formulate a problem that we can propose a very fast algorithm. (2) We establish a Monte-Carlo based algorithm to compute a single pair SimRank score s(u,v), which is based on the random-walk interpretation of our linear recursive formula. (3) We empirically show that SimRank score s(u,v) decreases rapidly as distance d(u,v) increases. Therefore, in order to compute SimRank scores for a query vertex u for our similarity search problem, we only need to look at very \"local\" area. (4) We can combine two upper bounds for SimRank score s(u,v) (which can be obtained by Monte-Carlo simulation in our preprocess), together with some adaptive sample technique, to prune the similarity search procedure. This results in a much faster algorithm.   Once our preprocess is done (which only takes O(n) time), our algorithm finds, given a query vertex u, top-20 similar vertices v with the 20 highest SimRank scores s(u,v) in less than a few seconds even for graphs with billions edges.   To the best of our knowledge, this is the first time to scale for graphs with at least billions edges(for the single source case).", "citation": "Citations (61)", "year": "2014", "departments": ["National Institute of Informatics", "National Institute of Informatics", "Preferred Infra ... c, Tokyo, Japan"], "conf": "sigmod", "authors": ["Mitsuru Kusumoto.....http://dblp.org/pers/hd/k/Kusumoto:Mitsuru", "Takanori Maehara.....http://dblp.org/pers/hd/m/Maehara:Takanori", "Ken-ichi Kawarabayashi.....http://dblp.org/pers/hd/k/Kawarabayashi:Ken=ichi"], "pages": 12}