{"title": "Indexing on modern hardware: hekaton and beyond.", "fields": ["database engine", "exploit", "data deduplication", "memory hierarchy", "online transaction processing"], "abstract": "Recent OLTP support exploits new techniques, running on modern hardware, to achieve unprecedented performance compared with prior approaches. In SQL Server, the Hekaton main-memory database engine embodies this new OLTP support. Hekaton uses the Bw-tree to achieve its great indexing performance. The Bw-Tree is a latch-free B-tree index that also exploits log-structured storage when used \"beyond\" Hekaton as a separate key value store. It is designed from the ground up to address two hardware trends: (1) Multi-core and main memory hierarchy: the Bw-tree is completely latch-free, using an atomic compare-and-swap instruction to install state changes on a \"page address\" mapping table; it performs updates as \"deltas\" to avoid update-in-place. These improve performance by eliminating thread blocking while improving cache hit ratios. (2) Flash storage: the Bw-tree organizes secondary storage in a log-structured manner, using large sequential writes to avoid entirely the adverse performance impact of random writes. We demonstrate the architectural versatility and performance of the Bw-tree in two scenarios: (a) running live within Hekaton and (2) running as a standalone key value store compared to both BerkeleyDB and a state-of-the-art in-memory range index (latch-free skiplists). Using workloads from real-world applications (Microsoft XBox Live Primetime and enterprise deduplication), we show the Bw-tree is 19x faster than BerkeleyDB and 3x faster than skiplists.", "citation": "Citations (10)", "year": "2014", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Justin J. Levandoski.....http://dblp.org/pers/hd/l/Levandoski:Justin_J=", "David B. Lomet.....http://dblp.org/pers/hd/l/Lomet:David_B=", "Sudipta Sengupta.....http://dblp.org/pers/hd/s/Sengupta:Sudipta", "Adrian Birka.....http://dblp.org/pers/hd/b/Birka:Adrian", "Cristian Diaconu.....http://dblp.org/pers/hd/d/Diaconu:Cristian"], "pages": 4}