{"title": "An Automatic Inequality Prover and Instance Optimal Identity Testing.", "fields": ["countable set", "total variation", "multiple", "monotonic function", "physical constant", "cauchy schwarz inequality", "gas meter prover", "bounded function"], "abstract": "We consider the problem of verifying the identity of a distribution: Given the description of a distribution over a discrete support p = (p1, p2,\u0085, pn) how many samples (independent draws) must one obtain from an unknown distribution, q, to distinguish, with high probability, the case that p = q from the case that the total variation distance (L1 distance) | |p--q| | 1≥ e? We resolve this question, up to constant factors, on an instance by instance basis: there exist universal constants c, c' and a function f(p, e) on distributions and error parameters, such that our tester distinguishes the case that p = q from | |p--q| | 1≥ e using f(p, e) samples with success probability >2/3, but no tester can distinguish p = q | |p--q| | 1≥ e c ⋅ e when given c' f(p, e) samples. The function f(p, e) is upper-bounded by a multiple of the | |p| |2/3e2, but is more complicated, and is significantly smaller in some cases when p has many small domain elements, or a single large one. This result significantly generalizes and tightens previous results: since distributions of support at most n have L2/3 norm bounded by √(n), this result immediately shows that for such distributions, O(√(n)/e2) samples suffice, tightening the previous bound of O(√(n)polylog n/e4) for this class of distributions, and matching the (tight) known results for the case that p is the uniform distribution over support n. The analysis of our very simple testing algorithm involves several hairy inequalities. To facilitate this analysis, we give a complete characterization of a general class of inequalities -- generalizing Cauchy-Schwarz, Holder's inequality, and the monotonicity of Lp norms. Specifically, we characterize the set of sequences (a)i = a1,\u0085, ar, (b) i = b1,\u0085, br, (c)i = c1,\u0085, cr, for which it holds that for all finite sequences of positive numbers (x)j = x1,\u0085 and (y)j = y1,\u0085 rΠi=1(Σj xai, j yjbi) ci ≥1. For example, the standard Cauchy-Schwarz inequality corresponds to the sequences a = (1,0,1/2), b = (0,1,1/2), c = (1/2, 1/2,-- 1). Our characterization is of a non-traditional nature in that it uses linear programming to compute a derivation that may otherwise have to be sought through trial and error, by hand. We do not believe such a characterization has appeared in the literature, and hope its computational nature will be useful to others, and facilitate analyses like the one here.", "citation": "Citations (66)", "departments": ["Stanford University", "Brown University"], "authors": ["Gregory Valiant.....http://dblp.org/pers/hd/v/Valiant:Gregory", "Paul Valiant.....http://dblp.org/pers/hd/v/Valiant:Paul"], "conf": "focs", "year": "2014", "pages": 10}