{"title": "CRAID: online RAID upgrades using dynamic hot data reorganization.", "fields": ["raid", "upgrade", "file server", "cache", "web server"], "abstract": "Current algorithms used to upgrade RAID arrays typically require large amounts of data to be migrated, even those that move only the minimum amount of data required to keep a balanced data load. This paper presents CRAID, a self-optimizing RAID array that performs an online block reorganization of frequently used, long-term accessed data in order to reduce this migration even further. To achieve this objective, CRAID tracks frequently used, long-term data blocks and copies them to a dedicated partition spread across all the disks in the array. When new disks are added, CRAID only needs to extend this process to the new devices to redistribute this partition, thus greatly reducing the overhead of the upgrade process. In addition, the reorganized access patterns within this partition improve the array's performance, amortizing the copy overhead and allowing CRAID to offer a performance competitive with traditional RAIDs.\n\nWe describe CRAID's motivation and design and we evaluate it by replaying seven real-world workloads including a file server, a web server and a user share. Our experiments show that CRAID can successfully detect hot data variations and begin using new disks as soon as they are added to the array. Also, the usage of a dedicated partition improves the sequentiality of relevant data access, which amortizes the cost of reorganizations. Finally, we prove that a full-HDD CRAID array with a small distributed partition (<1.28% per disk) can compete in performance with an ideally restriped RAID-5 and a hybrid RAID-5 with a small SSD cache.", "citation": "Citations (21)", "departments": ["Barcelona Supercomputing Center", "Polytechnic University of Catalonia"], "authors": ["A. Miranda.....http://dblp.org/pers/hd/m/Miranda:A=", "T. Cortes.....http://dblp.org/pers/hd/c/Cortes:T="], "conf": "fast", "year": "2014", "pages": 14}