{"title": "Continuous data cleaning.", "fields": ["inference", "snapshot", "dynamic data", "semantics", "remuneration"], "abstract": "In declarative data cleaning, data semantics are encoded as constraints and errors arise when the data violates the constraints. Various forms of statistical and logical inference can be used to reason about and repair inconsistencies (errors) in data. Recently, unified approaches that repair both errors in data and errors in semantics (the constraints) have been proposed. However, both data-only approaches and unified approaches are by and large static in that they apply cleaning to a single snapshot of the data and constraints. We introduce a continuous data cleaning framework that can be applied to dynamic data and constraint environments. Our approach permits both the data and its semantics to evolve and suggests repairs based on the accumulated evidence to date. Importantly, our approach uses not only the data and constraints as evidence, but also considers the past repairs chosen and applied by a user (user repair preferences). We introduce a repair classifier that predicts the type of repair needed to resolve an inconsistency, and that learns from past user repair preferences to recommend more accurate repairs in the future. Our evaluation shows that our techniques achieve high prediction accuracy and generate high quality repairs. Of independent interest, our work makes use of a set of data statistics that are shown to be sensitive to predicting particular repair types.", "citation": "Citations (64)", "departments": ["University of Toronto", "McMaster University", "University of Toronto", "University of Toronto"], "authors": ["Maksims Volkovs.....http://dblp.org/pers/hd/v/Volkovs:Maksims", "Fei Chiang.....http://dblp.org/pers/hd/c/Chiang:Fei", "Jaroslaw Szlichta.....http://dblp.org/pers/hd/s/Szlichta:Jaroslaw", "Renée J. Miller.....http://dblp.org/pers/hd/m/Miller:Ren=eacute=e_J="], "conf": "icde", "year": "2014", "pages": 12}