{"title": "New and Improved Key-Homomorphic Pseudorandom Functions.", "fields": ["random oracle", "lattice problem", "pseudorandom function family", "key size", "learning with errors"], "abstract": "A key-homomorphic pseudorandom function (PRF) familyfFs : D! Rg allows one to efficiently compute the valueFs+t(x) givenFs(x) andFt(x). Such functions have many applications, such as distributing the operation of a key-distribution center and updatable symmetric encryption. The only known construction of key-homomorphic PRFs without random oracles, due to Boneh et al. (CRYPTO 2013), is based on the learning with errors (LWE) problem and hence on worst-case lattice problems. However, the security proof relies on a very strong LWE assumption (i.e., very large approximation factors), and hence has quite inefficient parameter sizes and runtimes. In this work we give new constructions of key-homomorphic PRFs that are based on much weakerLWE assumptions, are much more efficient in time and space, and are still highly parallel. More specifically, we improve the LWE approximation factor from exponential in the input length to exponential in its logarithm (or less). For input length and 2 security against known lattice algorithms, we improve the key size from 3 to bits, the public parameters from 6 to 2 bits, and the runtime from 7 to !+1 bit operations (ignoring polylogarithmic factors in ), where !2 [2; 2:373] is the exponent of matrix multiplication. In addition, we give even more efficient ring-LWE-based constructions whose key sizes, public parameters, and incremental runtimes on consecutive inputs are all quasi-linear ~ O( ), which is optimal up to polylogarithmic factors. To our knowledge, these are the first low-depth PRFs (whether key homomorphic or not) enjoying any of these efficiency measures together with nontrivial proofs of 2 security under any conventional assumption.", "citation": "Citations (52)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Abhishek Banerjee.....http://dblp.org/pers/hd/b/Banerjee_0001:Abhishek", "Chris Peikert.....http://dblp.org/pers/hd/p/Peikert:Chris"], "conf": "crypto", "year": "2014", "pages": 18}