{"title": "Mobile-to-mobile energy replenishment in mission-critical robotic sensor networks.", "fields": ["implementation", "problem statement", "closeness", "mission critical", "rendezvous"], "abstract": "Recently, much research effort has been devoted to employing mobile chargers for energy replenishment of the robots in robotic sensor networks. Observing the discrepancy between the charging latency of robots and charger travel distance, we propose a novel tree-based charging schedule for the charger, which minimizes its travel distance without causing the robot energy depletion. We analytically evaluate its performance and show its closeness to the optimal solutions. Furthermore, through a queue-based approach, we provide theoretical guidance on the setting of the remaining energy threshold at which the robots request energy replenishment. This guided setting guarantees the feasibility of the tree-based schedule to return a depletion-free charging schedule. The performance of the tree-based charging schedule is evaluated through extensive simulations. The results show that the charger travel distance can be reduced by around 20%, when compared with the schedule that only considers the robot charging latency. Motivated by the above observations, in this paper, we focus on the mission-critical mobile-to-mobile charging scenario, in which the energy replenishment of the robots cannot interfere with their normal operations, e.g., due to the emergency of the robot's rescue tasks. Consequently, it is solely the responsibili- ty of the charger to rendezvous and travel along with the to-be- charged robot to accomplish the charging task. Specifically, by observing the discrepant requirements between robots (short charging latency) and chargers (short travel distance), we propose a novel charging schedule design for the charger that jointly optimizes the energy replenishing process according to these two requirements. By eliminating the interference on robots due to the charging requirements, we expect our solution to be a better alternative for mission-critical robotic sensor networks. Our major contributions in this paper include: • We introduce the concept of mission-critical mobile-to- mobile energy replenishment in robotic sensor networks. To the best of our knowledge, this is the first design that jointly optimizes the energy replenishment for both the robots and chargers. • We transform the mission-critical mobile-to-mobile charging problem to a shortest-path problem, and design an efficient charging schedule that minimizes the charger travel distance without causing the robot energy deple- tion. The performance of the proposed schedule is ana- lytically evaluated with regard to the optimal solutions. • To assist system implementation, we present a queue- based analytical approach that provides guidance on setting the robot's remaining energy threshold (according to which the robots send out requests for energy replen- ishment). We show that this approach can guarantee the feasibility for the proposed schedule to return a depletion- free solution. The paper is organized as follows. We present the problem statement in Section II. The proposed charging schedule is presented in Section III, and the guidance on setting the re- maining energy threshold is presented in Section IV. Section V evaluates the performance of the charging schedule and the guidance. Section VI reviews the literature, and we conclude this paper in Section VII.", "citation": "Citations (33)", "departments": ["Singapore University of Technology and Design", "Zhejiang University", "Singapore University of Technology and Design", "University of Victoria", "Binghamton University"], "authors": ["Liang He.....http://dblp.org/pers/hd/h/He_0002:Liang", "Peng Cheng.....http://dblp.org/pers/hd/c/Cheng_0001:Peng", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0001:Yu", "Jianping Pan.....http://dblp.org/pers/hd/p/Pan_0001:Jianping", "Ting Zhu.....http://dblp.org/pers/hd/z/Zhu:Ting", "Cong Liu.....http://dblp.org/pers/hd/l/Liu_0005:Cong"], "conf": "infocom", "year": "2014", "pages": 9}