{"title": "A hierarchical Dirichlet model for taxonomy expansion for search engines.", "fields": ["information needs", "tree structure", "complete category", "user information", "vertical search"], "abstract": "Emerging trends and products pose a challenge to modern search engines since they must adapt to the constantly changing needs and interests of users. For example, vertical search engines, such as Amazon, eBay, Walmart, Yelp and Yahoo! Local, provide business category hierarchies for people to navigate through millions of business listings. The category information also provides important ranking features that can be used to improve search experience. However, category hierarchies are often manually crafted by some human experts and they are far from complete. Manually constructed category hierarchies cannot handle the ever-changing and sometimes long-tail user information needs. In this paper, we study the problem of how to expand an existing category hierarchy for a search/navigation system to accommodate the information needs of users more comprehensively. We propose a general framework for this task, which has three steps: 1) detecting meaningful missing categories; 2) modeling the category hierarchy using a hierarchical Dirichlet model and predicting the optimal tree structure according to the model; 3) reorganizing the corpus using the complete category structure, i.e., associating each webpage with the relevant categories from the complete category hierarchy. Experimental results demonstrate that our proposed framework generates a high-quality category hierarchy and significantly boosts the retrieval performance.", "citation": "Citations (5)", "departments": ["Urbana University", "Yahoo!", "Yahoo!", "Urbana University"], "authors": ["Jingjing Wang.....http://dblp.org/pers/hd/w/Wang:Jingjing", "Changsung Kang.....http://dblp.org/pers/hd/k/Kang:Changsung", "Yi Chang.....http://dblp.org/pers/hd/c/Chang:Yi", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "www", "year": "2014", "pages": 10}