{"title": "New algorithms and lower bounds for circuits with linear threshold gates.", "fields": ["modulus", "symmetric function", "nexptime", "boolean data type", "integer"], "abstract": "Let ACC o THR be the class of constant-depth circuits comprised of AND, OR, and MOD m  gates (for some constant  m  > 1), with a bottom layer of gates computing arbitrary linear threshold functions. This class of circuits can be seen as a \"midpoint\" between ACC (where we know nontrivial lower bounds) and depth-two linear threshold circuits (where nontrivial lower bounds remain open).   We give an algorithm for evaluating an arbitrary symmetric function of 2 n o(1)   ACC o THR circuits of size 2 n o(1)  , on all possible inputs, in 2  n   · poly( n ) time. Several consequences are derived:   • The number of satisfying assignments to an ACC o THR circuit of 2 n o(1)   size is computable in 2 n-n e   time (where  e  > 0 depends on the depth and modulus of the circuit).   • NEXP does not have quasi-polynomial size ACC o THR circuits, and NEXP does not have quasi-polynomial size ACC o SYM circuits. Nontrivial size lower bounds were not known even for AND o OR o THR circuits.   • Every 0-1 integer linear program with  n  Boolean variables and  s  linear constraints is solvable in 2 n-Ω(n/log M)(log s) 5 )  poly( s, n,M ) time with high probability, where  M  upper bounds the bit complexity of the coefficients. (For example, 0-1 integer programs with weights in [--2 poly( n ) , 2 poly( n ) ] and poly( n ) constraints can be solved in 2 n-Ω(n/log 6 n)  time.) Impagliazzo, Paturi, and Schneider [IPS13] recently gave an algorithm for  O  ( n ) constraints; ours is the first asymptotic improvement over exhaustive search for up to subexponentially many constraints.   We also present an algorithm for evaluating depth-two linear threshold circuits (a.k.a., THR o THR) with exponential weights and 2  n /24  size on all 2  n   input assignments, running in 2  n   · poly( n ) time. This is evidence that non-uniform lower bounds for THR o THR are within reach.", "citation": "Citations (33)", "year": "2014", "departments": ["Stanford University"], "conf": "stoc", "authors": ["Ryan Williams.....http://dblp.org/pers/hd/w/Williams_0001:Ryan"], "pages": 9}