{"title": "Metascalable Quantum Molecular Dynamics Simulations of Hydrogen-on-Demand.", "fields": ["quantum", "scaling", "divide and conquer algorithms", "multigrid method", "solver"], "abstract": "We enabled an unprecedented scale of quantum molecular dynamics simulations through algorithmic innovations. A new lean divide-and-conquer density functional theory algorithm significantly reduces the prefactor of the  O ( N ) computational cost based on complexity and error analyses. A globally scalable and locally fast solver hybridizes a global real-space multigrid with local plane-wave bases. The resulting weak-scaling parallel efficiency was 0.984 on 786,432 IBM Blue Gene/Q cores for a 50.3 million-atom (39.8 trillion degrees-of-freedom) system. The time-to-solution was 60-times less than the previous state-of-the-art, owing to enhanced strong scaling by hierarchical band-spacedomain decomposition and high floating-point performance (50.5% of the peak). Production simulation involving 16,661 atoms for 21,140 time steps (or 129,208 self-consistent-field iterations) revealed a novel nanostructural design for on-demand hydrogen production from water, advancing renewable energy technologies. This metascalable (or \"design once, scale on new architectures\") algorithm is used for broader applications within a recently proposed divide-conquer-recombine paradigm.", "citation": "Citations (7)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California", "University of Southern California", "Kumamoto University"], "authors": ["Ken-ichi Nomura.....http://dblp.org/pers/hd/n/Nomura:Ken=ichi", "Rajiv K. Kalia.....http://dblp.org/pers/hd/k/Kalia:Rajiv_K=", "Aiichiro Nakano.....http://dblp.org/pers/hd/n/Nakano:Aiichiro", "Priya Vashishta.....http://dblp.org/pers/hd/v/Vashishta:Priya", "Kohei Shimamura.....http://dblp.org/pers/hd/s/Shimamura:Kohei", "Fuyuki Shimojo.....http://dblp.org/pers/hd/s/Shimojo:Fuyuki", "Manaschai Kunaseth.....http://dblp.org/pers/hd/k/Kunaseth:Manaschai", "Paul C. Messina.....http://dblp.org/pers/hd/m/Messina:Paul_C=", "Nichols A. Romero.....http://dblp.org/pers/hd/r/Romero:Nichols_A="], "conf": "sc", "year": "2014", "pages": 13}