{"title": "Routing games with progressive filling.", "fields": ["destination sequenced distance vector routing", "bandwidth", "resource management", "static routing", "price of anarchy", "zero sum game", "computation", "polynomial", "example of a game without a value", "price of stability"], "abstract": "Max-min fairness (MMF) is a widely known approach to a fair allocation of bandwidth to each of the users in a network. This allocation can be computed by uniformly raising the bandwidths of all users without violating capacity constraints. We consider an extension of these allocations by raising the bandwidth with arbitrary and not necessarily uniform time-depending velocities (allocation rates). These allocations are used in a game-theoretic context for routing choices, which we formalize in progressive filling games (PFGs). We present a variety of results for equilibria in PFGs. We show that these games possess pure Nash and strong equilibria. While computation in general is NP-hard, there are polynomial-time algorithms for prominent classes of Max-Min-Fair Games (MMFG), including the case when all users have the same source-destination pair. We characterize prices of anarchy and stability for pure Nash and strong equilibria in PFGs and MMFGs when players have different or the same source-destination pairs. In addition, we show that when a designer can adjust allocation rates, it is possible to design games with optimal strong equilibria. Some initial results on polynomial-time algorithms in this direction are also derived.", "citation": "Citations (5)", "departments": ["Maastricht University", "Max Planck Society", "Technical University of Berlin", "Max Planck Society", "Heinz Nixdorf Institute", "External Organizations", "External Organizations", "External Organizations"], "authors": ["Tobias Harks.....http://dblp.org/pers/hd/h/Harks:Tobias", "Martin Hoefer.....http://dblp.org/pers/hd/h/Hoefer:Martin", "Kevin Schewior.....http://dblp.org/pers/hd/s/Schewior:Kevin", "Alexander Skopalik.....http://dblp.org/pers/hd/s/Skopalik:Alexander"], "conf": "infocom", "year": "2014", "pages": 9}