{"title": "Computing General First-Order Parallel and Prioritized Circumscription.", "fields": ["solver", "answer set programming", "circumscription", "stable marriage problem", "stable model semantics"], "abstract": "This paper focuses on computing general first-order parallel and prioritized circumscription with varying constants. We propose linear translations from general first-order circumscription to first-order theories under stable model semantics over arbitrary structures, including Trv for parallel circumscription and Trvs for conjunction of parallel circumscriptions (further for prioritized circumscription). To improve the efficiency, we give an optimization Γ∃ to reduce logic programs in size when eliminating existential quantifiers during the translations. Based on these results, a general first-order circumscription solver, named cfo2lp, is developed by calling answer set programming (ASP) solvers. Using circuit diagnosis problem and extended stable marriage problem as benchmarks, we compare cfo2lp with a propositional circumscription solver circ2dlp and an ASP solver with complex optimization metasp on efficiency. Experimental results demonstrate that for problems represented by first-order circumscription naturally and intuitively, cfo2lp can compute all solutions over finite structures. We also apply our approach to description logics with circumscription and repairs in inconsistent databases, which can be handled effectively.", "citation": "Not cited", "departments": ["Sun Yat-sen University", "Sun Yat-sen University", "Sun Yat-sen University", "University of Western Sydney", "University of Western Sydney"], "authors": ["Hai Wan.....http://dblp.org/pers/hd/w/Wan:Hai", "Zhanhao Xiao.....http://dblp.org/pers/hd/x/Xiao:Zhanhao", "Zhenfeng Yuan.....http://dblp.org/pers/hd/y/Yuan:Zhenfeng", "Heng Zhang.....http://dblp.org/pers/hd/z/Zhang_0006:Heng", "Yan Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Yan"], "conf": "aaai", "year": "2014", "pages": 7}