{"title": "Domain Decomposition Preconditioners for Communication-Avoiding Krylov Methods on a Hybrid CPU/GPU Cluster.", "fields": ["krylov subspace", "domain decomposition methods", "generalized minimal residual method", "xeon", "gpu cluster"], "abstract": "Krylov subspace projection methods are widely used iterative methods for solving large-scale linear systems of equations. Researchers have demonstrated that communication-avoiding (CA) techniques can improve Krylov methods' performance on modern computers, where communication is becoming increasingly expensive compared to arithmetic operations. In this paper, we extend these studies by two major contributions. First, we present our implementation of a CA variant of the Generalized Minimum Residual (GMRES) method, called CA-GMRES, for solving nonsymmetric linear systems of equations on a hybrid CPU/GPU cluster. Our performance results on up to 120 GPUs show that CA-GMRES gives a speedup of up to 2.5x in total solution time over standard GMRES on a hybrid cluster with twelve Intel Xeon CPUs and three Nvidia Fermi GPUs on each node. We then outline a domain decomposition framework to introduce a family of preconditioners that are suitable for CA Krylov methods. Our preconditioners do not incur any additional communication and allow the easy reuse of existing algorithms and software for the subdomain solves. Experimental results on the hybrid CPU/GPU cluster demonstrate that CA-GMRES with preconditioning achieve a speedup of up to 7.4x over CA-GMRES without preconditioning, and speedup of up to 1.7x over GMRES with preconditioning in total solution time. These results confirm the potential of our framework to develop a practical and effective preconditioned CA Krylov method.", "citation": "Citations (9)", "departments": ["University of Tennessee", "Sandia National Laboratories", "Sandia National Laboratories", "Sandia National Laboratories", "Sandia National Laboratories"], "authors": ["Ichitaro Yamazaki.....http://dblp.org/pers/hd/y/Yamazaki:Ichitaro", "Sivasankaran Rajamanickam.....http://dblp.org/pers/hd/r/Rajamanickam:Sivasankaran", "Erik G. Boman.....http://dblp.org/pers/hd/b/Boman:Erik_G=", "Mark Hoemmen.....http://dblp.org/pers/hd/h/Hoemmen:Mark", "Michael A. Heroux.....http://dblp.org/pers/hd/h/Heroux:Michael_A=", "Stanimire Tomov.....http://dblp.org/pers/hd/t/Tomov:Stanimire"], "conf": "sc", "year": "2014", "pages": 12}