{"title": "DeCAF: A Deep Convolutional Activation Feature for Generic Visual Recognition.", "fields": ["domain adaptation", "cognitive neuroscience of visual object recognition", "cluster analysis", "concept learning", "architecture"], "abstract": "We evaluate whether features extracted from the activation of a deep convolutional network trained in a fully supervised fashion on a large, fixed set of object recognition tasks can be repurposed to novel generic tasks. Our generic tasks may differ significantly from the originally trained tasks and there may be insufficient labeled or unlabeled data to conventionally train or adapt a deep architecture to the new tasks. We investigate and visualize the semantic clustering of deep convolutional features with respect to a variety of such tasks, including scene recognition, domain adaptation, and fine-grained recognition challenges. We compare the efficacy of relying on various network levels to define a fixed feature, and report novel results that significantly outperform the state-of-the-art on several important vision challenges. We are releasing DeCAF, an open-source implementation of these deep convolutional activation features, along with all associated network parameters to enable vision researchers to be able to conduct experimentation with deep representations across a range of visual concept learning paradigms.", "citation": "Citations (2,362)", "year": "2014", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "icml", "authors": ["Jeff Donahue.....http://dblp.org/pers/hd/d/Donahue:Jeff", "Yangqing Jia.....http://dblp.org/pers/hd/j/Jia:Yangqing", "Oriol Vinyals.....http://dblp.org/pers/hd/v/Vinyals:Oriol", "Judy Hoffman.....http://dblp.org/pers/hd/h/Hoffman:Judy", "Ning Zhang.....http://dblp.org/pers/hd/z/Zhang_0014:Ning", "Eric Tzeng.....http://dblp.org/pers/hd/t/Tzeng:Eric", "Trevor Darrell.....http://dblp.org/pers/hd/d/Darrell:Trevor"], "pages": 9}