{"title": "Scalable Kernel Methods via Doubly Stochastic Gradients.", "fields": ["variable kernel density estimation", "string kernel", "tree kernel", "kernel smoother", "kernel embedding of distributions"], "abstract": "The general perception is that kernel methods are not scalable, so neural nets become the choice for large-scale nonlinear learning problems. Have we tried hard enough for kernel methods? In this paper, we propose an approach that scales up kernel methods using a novel concept called \"doubly stochastic functional gradients\". Based on the fact that many kernel methods can be expressed as convex optimization problems, our approach solves the optimization problems by making two unbiased stochastic approximations to the functional gradient—one using random training points and another using random features associated with the kernel—and performing descent steps with this noisy functional gradient. Our algorithm is simple, need no commit to a preset number of random features, and allows the flexibility of the function class to grow as we see more incoming data in the streaming setting. We demonstrate that a function learned by this procedure after t iterations converges to the optimal function in the reproducing kernel Hilbert space in rate O(1/t), and achieves a generalization bound of O(1/√t). Our approach can readily scale kernel methods up to the regimes which are dominated by neural nets. We show competitive performances of our approach as compared to neural nets in datasets such as 2.3 million energy materials from MolecularSpace, 8 million handwritten digits from MNIST, and 1 million photos from ImageNet using convolution features.", "citation": "Citations (120)", "year": "2014", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Princeton University", "Georgia Institute of Technology"], "conf": "nips", "authors": ["Bo Dai.....http://dblp.org/pers/hd/d/Dai:Bo", "Bo Xie.....http://dblp.org/pers/hd/x/Xie_0002:Bo", "Niao He.....http://dblp.org/pers/hd/h/He:Niao", "Yingyu Liang.....http://dblp.org/pers/hd/l/Liang:Yingyu", "Anant Raj.....http://dblp.org/pers/hd/r/Raj:Anant", "Maria-Florina Balcan.....http://dblp.org/pers/hd/b/Balcan:Maria=Florina", "Le Song.....http://dblp.org/pers/hd/s/Song:Le"], "pages": 9}