{"title": "Personalized Query Suggestion With Diversity Awareness.", "fields": ["rdf query language", "ranking", "web query classification", "sargable", "web search query"], "abstract": "Query suggestion is an important functionality provided by the search engine to facilitate information seeking of the users. Existing query suggestion methods usually focus on recommending queries that are the most relevant to the input query. However, such relevance-oriented strategy cannot effectively handle query uncertainty, a common scenario that the input query can be interpreted as multiple different meanings. To alleviate this problem, the concepts of diversification and person-alization have been individually introduced to query suggestion systems. These two concepts are often seen as incompatible alternatives, because diversification considers multiple aspects of the input query to maximize the probability that some query aspect is relevant to the user while personalization aims to adapt the suggestions to a specific aspect that aligns with the preference of a specific user. In this paper, we refute this antagonistic view and propose a new query suggestion paradigm, Personalized Query Suggestion With Diversity Awareness (PQS-DA) to effectively combine diversification and personalization into one unified framework. In PQS-DA, the suggested queries are effectively diversified to cover different potential facets of the input query while the ranking of suggested queries are personalized to ensure that the top ones are those that align with a user's personal preference. We evaluate PQS-DA on a real-life search engine query log against several state-of-the-art methods with respect to a variety of metrics. The experimental results verify our hypothesis that diversification and personalization can be effectively integrated and they are able to enhance each other within the PQS-DA framework, which significantly outperforms several strong baselines with respect to a series of metrics.", "citation": "Citations (16)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Di Jiang.....http://dblp.org/pers/hd/j/Jiang:Di", "Kenneth Wai-Ting Leung.....http://dblp.org/pers/hd/l/Leung:Kenneth_Wai=Ting", "Jan Vosecky.....http://dblp.org/pers/hd/v/Vosecky:Jan", "Wilfred Ng.....http://dblp.org/pers/hd/n/Ng:Wilfred"], "conf": "icde", "year": "2014", "pages": 12}