{"title": "Start from Scratch: Towards Automatically Identifying, Modeling, and Naming Visual Attributes.", "fields": ["deep learning", "scratch", "autoencoder", "architecture", "automatic image annotation"], "abstract": "Higher-level semantics such as visual attributes are crucial for fundamental multimedia applications. We present a novel attribute discovery approach that can automatically identify, model and name attributes from an arbitrary set of image and text pairs that can be easily gathered on the Web. Different from conventional attribute discovery methods, our approach does not rely on any pre-defined vocabularies and human labeling. Therefore, we are able to build a large visual knowledge base without any human efforts. The discovery is based on a novel deep architecture, named Independent Component Multimodal Autoencoder (ICMAE), that can continually learn shared higher-level representations across the visual and textual modalities. With the help of the resultant representations encoding strong visual and semantic evidences, we propose to (a) identify attributes and their corresponding high-quality training images, (b) iteratively model them with maximum compactness and comprehensiveness, and (c) name the attribute models with human understandable words. To date, the proposed system has discovered 1,898 attributes over 1.3 million pairs of image and text. Extensive experiments on various real-world multimedia datasets demonstrate the quality and effectiveness of the discovered attributes, facilitating multimedia applications such as image annotation and retrieval as compared to the state-of-the-art approaches.", "citation": "Citations (28)", "departments": ["National University of Singapore", "University of Electronic Science and Technology of China", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Yang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Yang", "Huan-Bo Luan.....http://dblp.org/pers/hd/l/Luan:Huan=Bo", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2014", "pages": 10}