{"title": "Accelerating Restore and Garbage Collection in Deduplication-based Backup Systems via Exploiting Historical Information.", "fields": ["rewriting", "data deduplication", "exploit", "backup", "merge"], "abstract": "In deduplication-based backup systems, the chunks of each backup are physically scattered after deduplication, which causes a challenging fragmentation problem. The fragmentation decreases restore performance, and results in invalid chunks becoming physically scattered in different containers after users delete backups. Existing solutions attempt to rewrite duplicate but fragmented chunks to improve the restore performance, and reclaim invalid chunks by identifying and merging valid but fragmented chunks into new containers. However, they cannot accurately identify fragmented chunks due to their limited rewrite buffer. Moreover, the identification of valid chunks is cumbersome and the merging operation is the most time-consuming phase in garbage collection.\n\nOur key observation that fragmented chunks remain fragmented in subsequent backups motivates us to propose a History-Aware Rewriting algorithm (HAR). HAR exploits historical information of backup systems to more accurately identify and rewrite fragmented chunks. Since the valid chunks are aggregated in compact containers by HAR, the merging operation is no longer required. To reduce the metadata overhead of the garbage collection, we further propose a Container-Marker Algorithm (CMA) to identify valid containers instead of valid chunks. Our extensive experimental results from real-world datasets show HAR significantly improves the restore performance by 2.6X-17X at a cost of only rewriting 0.45-1.99% data. CMA reduces the metadata overhead for the garbage collection by about 90X.", "citation": "Citations (70)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Virginia Commonwealth University", "National Engine ... Beijing, China"], "authors": ["Min Fu.....http://dblp.org/pers/hd/f/Fu_0002:Min", "Dan Feng.....http://dblp.org/pers/hd/f/Feng_0001:Dan", "Yu Hua.....http://dblp.org/pers/hd/h/Hua_0001:Yu", "Xubin He.....http://dblp.org/pers/hd/h/He:Xubin", "Zuoning Chen.....http://dblp.org/pers/hd/c/Chen:Zuoning", "Wen Xia.....http://dblp.org/pers/hd/x/Xia:Wen", "Fangting Huang.....http://dblp.org/pers/hd/h/Huang:Fangting", "Qing Liu.....http://dblp.org/pers/hd/l/Liu_0007:Qing"], "conf": "usenix", "year": "2014", "pages": 12}