{"title": "ABS: a system for scalable approximate queries with accuracy guarantees.", "fields": ["analytics", "overhead", "relational algebra", "generality", "sql"], "abstract": "Approximate Query Processing (AQP) based on sampling is critical for supporting timely and cost-effective analytics over big data. To be applied successfully, AQP must be accompanied by reliable estimates on the quality of sample-produced approximate answers; the two main techniques used in the past for this purpose are (i) closed-form analytic error estimation, and (ii) the bootstrap method. Approach (i) is extremely efficient but lacks generality, whereas (ii) is general but suffers from high computational overhead. Our recently introduced Analytical Bootstrap method combines the strengths of both approaches and provides the basis for our ABS system, which will be demonstrated at the conference. The ABS system models bootstrap by a probabilistic relational model, and extends relational algebra with operations on probabilistic relations to predict the distributions of the AQP results. Thus, ABS entails a very fast computation of bootstrap-based quality measures for a general class of SQL queries, which is several orders of magnitude faster than the standard simulation-based bootstrap. In this demo, we will demonstrate the generality, automaticity, and ease of use of the ABS system, and its superior performance over the traditional approaches described above.", "citation": "Citations (19)", "year": "2014", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "University of Michigan", "University of California, Los Angeles"], "conf": "sigmod", "authors": ["Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0002:Kai", "Shi Gao.....http://dblp.org/pers/hd/g/Gao:Shi", "Jiaqi Gu.....http://dblp.org/pers/hd/g/Gu:Jiaqi", "Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan", "Carlo Zaniolo.....http://dblp.org/pers/hd/z/Zaniolo:Carlo"], "pages": 4}