{"title": "SI-TM: reducing transactional memory abort rates through snapshot isolation.", "fields": ["software transactional memory", "transactional memory", "memory controller", "snapshot isolation", "multiversion concurrency control"], "abstract": "Transactional memory represents an attractive conceptual model for programming concurrent applications. Unfortunately, high transaction abort rates can cause significant performance degradation. Conventional transactional memory realizations not only pessimistically abort transactions on every read-write conflict but also because of false sharing, cache evictions, TLB misses, page faults and interrupts. Consequently, the use of transactions needs to be restricted to a very small number of operations to achieve predictable performance, thereby, limiting its benefit to programming simplification. In this paper, we investigate snapshot isolation transactional memory in which transactions operate on memory snapshots that always guarantee consistent reads. By exploiting snapshots, an established database model of transactions, transactions can ignore read-write conflicts and only need to abort on write-write conflicts. Our implementation utilizes a memory controller that supports multiversion memory, to efficiently support snapshotting in hardware.We show that snapshot isolation can reduce the number of aborts in some cases by three orders of magnitude and improve performance by up to 20x.", "citation": "Citations (17)", "year": "2014", "departments": ["Stanford University", "Stanford University", "Stanford University", "HICAMP Systems, ... o Park, CA, USA", "HICAMP Systems, ... o Park, CA, USA"], "conf": "asplos", "authors": ["Heiner Litz.....http://dblp.org/pers/hd/l/Litz:Heiner", "David R. Cheriton.....http://dblp.org/pers/hd/c/Cheriton:David_R=", "Amin Firoozshahian.....http://dblp.org/pers/hd/f/Firoozshahian:Amin", "Omid Azizi.....http://dblp.org/pers/hd/a/Azizi:Omid", "John P. Stevenson.....http://dblp.org/pers/hd/s/Stevenson:John_P="], "pages": 16}