{"title": "Multiple Features But Few Labels?: A Symbiotic Solution Exemplified for Video Analysis.", "fields": ["graph", "semi supervised learning", "the internet", "computer vision", "machine learning"], "abstract": "Video analysis has been attracting increasing research due to the proliferation of internet videos. In this paper, we investigate how to improve the performance on internet quality video analysis. Particularly, we work on the scenario of few labeled training videos being provided, which is less focused in multimedia. To being with, we consider how to more effectively harness the evidences from the low-level features. Researchers have developed several promising features to represent videos to capture the semantic information. However, as videos usually characterize rich semantic contents, the analysis performance by using one single feature is potentially limited. Simply combining multiple features through early fusion or late fusion to incorporate more informative cues is doable but not optimal due to the heterogeneity and different predicting capability of these features. For better exploitation of multiple features, we propose to mine the importance of different features and cast it into the learning of the classification model. Our method is based on multiple graphs from different features and uses the Riemannian metric to evaluate the feature importance. On the other hand, to be able to use limited labeled training videos for a respectable accuracy we formulate our method in a semi-supervised way. The main contribution of this paper is a novel scheme of evaluating the feature importance that is further casted into a unified framework of harnessing multiple weighted features with limited labeled training videos. We perform extensive experiments on video action recognition and multimedia event recognition and the comparison to other state-of-the-art multi-feature learning algorithms has validated the efficacy of our framework.", "citation": "Citations (10)", "departments": ["Carnegie Mellon University", "University of Queensland", "University of Trento", "Carnegie Mellon University"], "authors": ["Zhigang Ma.....http://dblp.org/pers/hd/m/Ma:Zhigang", "Yi Yang.....http://dblp.org/pers/hd/y/Yang_0001:Yi", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu", "Alexander G. Hauptmann.....http://dblp.org/pers/hd/h/Hauptmann:Alexander_G="], "conf": "mm", "year": "2014", "pages": 10}