{"title": "A generalized coverage-preserving scheduling in WSNs: A case study in structural health monitoring.", "fields": ["mobile wireless sensor network", "sensor node", "scheduling", "key distribution in wireless sensor networks", "structural health monitoring"], "abstract": "Wireless sensor networks (WSNs) are generally used to monitor, in an area, certain phenomena which can be events or targets that users are interested. To extend the system lifetime, a widely used technique is 'Energy-Efficient Coverage-Preserving Scheduling(EECPS)', in which at any time, only part of the nodes are activated to fulfill the function. To determine which nodes should be activated at a certain time is the key for the EECPS and this problem has been studied extensively. Existing solutions are based on the assumption that each node has a fixed coverage area, and once the event/target occurs in this area, it can be detected by this sensor. However, this coverage model is not always valid. In some applications such as structural health monitoring (SHM) and volcano monitoring, to fulfill a required function always requires low level collaboration from multiple sensors. The coverage area for individual sensor node therefore cannot be defined explicitly since single sensor is not able to fulfill the function alone, even it is close to the event or target to be monitored. In this paper, using an example of SHM, we illustrate how to support EECPS in some special applications of WSNs. We re-define the 'coverage' and based on the new coverage model, two methods are proposed to partition the deployed sensor nodes into qualified cover sets such that the system lifetime can be maximized by letting these sets work by turns. The performance of the methods is demonstrated through extensive simulation and experiment.", "citation": "Citations (7)", "departments": ["Temple University", "Huazhong University of Science and Technology", "Dept. of Comp., ... ong Kong, China", "Dept. of Comp., ... ong Kong, China"], "authors": ["Xuefeng Liu.....http://dblp.org/pers/hd/l/Liu:Xuefeng", "Jiannong Cao.....http://dblp.org/pers/hd/c/Cao:Jiannong", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Peng Guo.....http://dblp.org/pers/hd/g/Guo:Peng"], "conf": "infocom", "year": "2014", "pages": 9}