{"title": "Structured Possibilistic Planning Using Decision Diagrams.", "fields": ["probabilistic logic", "observability", "real number", "computation", "generalization"], "abstract": "Qualitative Possibilistic Mixed-Observable MDPs (π-MOMDPs), generalizing π-MDPs and π-POMDPs, are well-suited models to planning under uncertainty with mixed-observability when transition, observation and reward functions are not precisely known and can be qualitatively described. Functions defining the model as well as intermediate calculations are valued in a finite possibilistic scale L, which induces a finite belief state space under partial observability contrary to its probabilistic counterpart. In this paper, we propose the first study of factored π-MOMDP models in order to solve large structured planning problems under qualitative uncertainty, or considered as qualitative approximations of probabilistic problems. Building upon the SPUDD algorithm for solving factored (probabilistic) MDPs, we conceived a symbolic algorithm named PPUDD for solving factored π-MOMDPs. Whereas SPUDD's decision diagrams' leaves may be as large as the state space since their values are real numbers aggregated through additions and multiplications, PPUDD's ones always remain in the finite scale L via min and max operations only. Our experiments show that PPUDD's computation time is much lower than SPUDD, Symbolic-HSVI and APPL for possibilistic and probabilistic versions of the same benchmarks under either total or mixed observability, while still providing high-quality policies.", "citation": "Citations (3)", "departments": ["Paul Sabatier University", "Onera, The Fren ... edex 4, France", "Onera, The Fren ... edex 4, France", "Onera, The Fren ... edex 4, France"], "authors": ["Nicolas Drougard.....http://dblp.org/pers/hd/d/Drougard:Nicolas", "Florent Teichteil-Königsbuch.....http://dblp.org/pers/hd/t/Teichteil=K=ouml=nigsbuch:Florent", "Jean-Loup Farges.....http://dblp.org/pers/hd/f/Farges:Jean=Loup", "Didier Dubois.....http://dblp.org/pers/hd/d/Dubois:Didier"], "conf": "aaai", "year": "2014", "pages": 7}