{"title": "One of a Kind: User Profiling by Social Curation.", "fields": ["personalized search", "profiling", "convolutional neural network", "social media", "deep learning"], "abstract": "Social Curation Service (SCS) is a new type of emerging social media platform, where users can select, organize and keep track of multimedia contents they like. In this paper, we take advantage of this great opportunity and target at the very starting point in social media: user profiling, which supports fundamental applications such as personalized search and recommendation. As compared to other profiling methods in conventional Social Network Services (SNS), our work benefits from the two distinguishable characteristics of SCS: a) organized multimedia user-generated contents, and b) content-centric social network. Based on these two characteristics, we are able to deploy the state-of-the-art multimedia analysis techniques to establish content-based user profiles by extracting user preferences and their social relations. First, we automatically construct a content-based user preference ontology and learn the ontological models to generate comprehensive user profiles. In particular, we propose a new deep learning strategy called multi-task convolutional neural network (mtCNN) to learn profile models and profile-related visual features simultaneously. Second, we propose to model the multi-level social relations offered by SCS to refine the user profiles in a low-rank recovery framework. To the best of our knowledge, our work is the first that explores how social curation can help in content-based social media technologies, taking user profiling as an example. Extensive experiments on 1,293 users and 1.5 million images collected from Pinterest in fashion domain demonstrate that recommendation methods based on the proposed user profiles are considerably more effective than other state-of-the-art recommendation strategies.", "citation": "Citations (14)", "departments": ["National University of Singapore", "National University of Singapore", "University of Electronic Science and Technology of China", "National University of Singapore", "Visenze Pte. Lt ... pore, Singapore"], "authors": ["Xue Geng.....http://dblp.org/pers/hd/g/Geng:Xue", "Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Zheng Song.....http://dblp.org/pers/hd/s/Song:Zheng", "Yang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Yang", "Huan-Bo Luan.....http://dblp.org/pers/hd/l/Luan:Huan=Bo", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2014", "pages": 10}