{"title": "Joint Coupled-Feature Representation and Coupled Boosting for AD Diagnosis.", "fields": ["text mining", "complex systems", "sensor fusion", "pairwise comparison", "boosting"], "abstract": "Recently, there has been a great interest in computer- aided Alzheimer's Disease (AD) and Mild Cognitive Im- pairment (MCI) diagnosis. Previous learning based meth- ods defined the diagnosis process as a classification task and directly used the low-level features extracted from neu- roimaging data without considering relations among them. However, from a neuroscience point of view, it's well known that a human brain is a complex system that multiple brain regions are anatomically connected and functionally inter- act with each other. Therefore, it is natural to hypothesize that the low-level features extracted from neuroimaging da- ta are related to each other in some ways. To this end, in this paper, we first devise a coupled feature representa- tion by utilizing intra-coupled and inter-coupled interaction relationship. Regarding multi-modal data fusion, we pro- pose a novel coupled boosting algorithm that analyzes the pairwise coupled-diversity correlation between modalities. Specifically, we formulate a new weight updating function, which considers both incorrectly and inconsistently classi- fied samples. In our experiments on the ADNI dataset, the proposed method presented the best performance with accu- racies of 94.7% and 80.1% for AD vs. Normal Control (NC) and MCI vs. NC classifications, respectively, outperforming the competing methods and the state-of-the-art methods.", "citation": "Citations (10)", "year": "2014", "departments": ["Nanjing University", "University of North Carolina at Chapel Hill", "Nanjing University", "University of North Carolina at Chapel Hill"], "conf": "cvpr", "authors": ["Yinghuan Shi.....http://dblp.org/pers/hd/s/Shi:Yinghuan", "Heung-Il Suk.....http://dblp.org/pers/hd/s/Suk:Heung=Il", "Yang Gao.....http://dblp.org/pers/hd/g/Gao_0001:Yang", "Dinggang Shen.....http://dblp.org/pers/hd/s/Shen:Dinggang"], "pages": 8}