{"title": "SoK: Security and Privacy in Implantable Medical Devices and Body Area Networks.", "fields": ["wireless", "cloud computing security", "health care", "telemetry", "key"], "abstract": "Balancing security, privacy, safety, and utility is a necessity in the health care domain, in which implantable medical devices (IMDs) and body area networks (BANs) have made it possible to continuously and automatically manage and treat a number of health conditions. In this work, we survey publications aimed at improving security and privacy in IMDs and health-related BANs, providing clear definitions and a comprehensive overview of the problem space. We analyze common themes, categorize relevant results, and identify trends and directions for future research. We present a visual illustration of this analysis that shows the progression of IMD/BAN research and highlights emerging threats. We identify three broad research categories aimed at ensuring the security and privacy of the telemetry interface, software, and sensor interface layers and discuss challenges researchers face with respect to ensuring reproducibility of results. We find that while the security of the telemetry interface has received much attention in academia, the threat of software exploitation and the sensor interface layer deserve further attention. In addition, we observe that while the use of physiological values as a source of entropy for cryptographic keys holds some promise, a more rigorous assessment of the security and practicality of these schemes is required.", "citation": "Citations (130)", "departments": ["Johns Hopkins University", "Johns Hopkins University", "University of Michigan", "University of Michigan"], "authors": ["Michael Rushanan.....http://dblp.org/pers/hd/r/Rushanan:Michael", "Aviel D. Rubin.....http://dblp.org/pers/hd/r/Rubin:Aviel_D=", "Denis Foo Kune.....http://dblp.org/pers/hd/k/Kune:Denis_Foo", "Colleen M. Swanson.....http://dblp.org/pers/hd/s/Swanson:Colleen_M="], "conf": "sp", "year": "2014", "pages": 16}