{"title": "Symmetrized Summation Polynomials: Using Small Order Torsion Points to Speed Up Elliptic Curve Index Calculus.", "fields": ["classical orthogonal polynomials", "difference polynomials", "invariant theory", "expression", "orthogonal polynomials"], "abstract": "Decomposition-based index calculus methods are currently efficient only for elliptic curves E defined over non-prime finite fields of very small extension degree n. This corresponds to the fact that the Semaev summation polynomials, which encode the relation search (or “sieving”), grow over-exponentially with n. Actually, even their computation is a first stumbling block and the largest Semaev polynomial ever computed is the 6-th. Following ideas from Faugere, Gaudry, Huot and Renault, our goal is to use the existence of small order torsion points on E to define new summation polynomials whose symmetrized expressions are much more compact and easier to compute. This setting allows to consider smaller factor bases, and the high sparsity of the new summation polynomials provides a very efficient decomposition step. In this paper the focus is on 2-torsion points, as it is the most important case in practice. We obtain records of two kinds: we successfully compute up to the 8-th symmetrized summation polynomial and give new timings for the computation of relations with degree 5 extension fields.", "citation": "Citations (9)", "year": "2014", "departments": ["University of Paris", "Centre national de la recherche scientifique", "University of Paris", "Centre national de la recherche scientifique", "University of Paris", "Centre national de la recherche scientifique", "Joseph Fourier University", "CryptoExperts"], "conf": "eurocrypt", "authors": ["Jean-Charles Faugère.....http://dblp.org/pers/hd/f/Faug=egrave=re:Jean=Charles", "Louise Huot.....http://dblp.org/pers/hd/h/Huot:Louise", "Antoine Joux.....http://dblp.org/pers/hd/j/Joux:Antoine", "Guénaël Renault.....http://dblp.org/pers/hd/r/Renault:Gu=eacute=na=euml=l", "Vanessa Vitse.....http://dblp.org/pers/hd/v/Vitse:Vanessa"], "pages": 18}