{"title": "ViewBox: integrating local file systems with cloud storage services.", "fields": ["ext4", "snapshot", "cloud storage", "file synchronization", "upload"], "abstract": "Cloud-based file synchronization services have become enormously popular in recent years, both for their ability to synchronize files across multiple clients and for the automatic cloud backups they provide. However, despite the excellent reliability that the cloud back-end provides, the loose coupling of these services and the local file system makes synchronized data more vulnerable than users might believe. Local corruption may be propagated to the cloud, polluting all copies on other devices, and a crash or untimely shutdown may lead to inconsistency between a local file and its cloud copy. Even without these failures, these services cannot provide causal consistency.\n\nTo address these problems, we present ViewBox, an integrated synchronization service and local file system that provides freedom from data corruption and inconsistency. ViewBox detects these problems using ext4-cksum, a modified version of ext4, and recovers from them using a user-level daemon, cloud helper, to fetch correct data from the cloud. To provide a stable basis for recovery, ViewBox employs the view manager on top of ext4-cksum. The view manager creates and exposes views, consistent in-memory snapshots of the file system, which the synchronization client then uploads. Our experiments show that ViewBox detects and recovers from both corruption and inconsistency, while incurring minimal overhead.", "citation": "Citations (30)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Yupu Zhang.....http://dblp.org/pers/hd/z/Zhang:Yupu", "Chris Dragga.....http://dblp.org/pers/hd/d/Dragga:Chris", "Andrea C. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Andrea_C=", "Remzi H. Arpaci-Dusseau.....http://dblp.org/pers/hd/a/Arpaci=Dusseau:Remzi_H="], "conf": "fast", "year": "2014", "pages": 14}