{"title": "Video Event Detection by Inferring Temporal Instance Labels.", "fields": ["search engine indexing", "pooling", "latent variable", "video tracking", "machine learning"], "abstract": "Video event detection allows intelligent indexing of video content based on events. Traditional approaches extract features from video frames or shots, then quantize and pool the features to form a single vector representation for the entire video. Though simple and efficient, the final pooling step may lead to loss of temporally local information, which is important in indicating which part in a long video signifies presence of the event. In this work, we propose a novel instance-based video event detection approach. We represent each video as multiple 'instances', defined as video segments of different temporal intervals. The objective is to learn an instance-level event detection model based on only video-level labels. To solve this problem, we propose a large-margin formulation which treats the instance labels as hidden latent variables, and simultaneously infers the instance labels as well as the instance-level classification model. Our framework infers optimal solutions that assume positive videos have a large number of positive instances while negative videos have the fewest ones. Extensive experiments on large-scale video event datasets demonstrate significant performance gains. The proposed method is also useful in explaining the detection results by localizing the temporal segments in a video which is responsible for the positive detection.", "citation": "Citations (79)", "year": "2014", "departments": ["Columbia University", "National Taiwan University", "Columbia University", "Res. Center for ...  Taipei, Taiwan"], "conf": "cvpr", "authors": ["Kuan-Ting Lai.....http://dblp.org/pers/hd/l/Lai:Kuan=Ting", "Felix X. Yu.....http://dblp.org/pers/hd/y/Yu:Felix_X=", "Ming-Syan Chen.....http://dblp.org/pers/hd/c/Chen:Ming=Syan", "Shih-Fu Chang.....http://dblp.org/pers/hd/c/Chang:Shih=Fu"], "pages": 8}