{"title": "Protibadi: a platform for fighting sexual harassment in urban bangladesh.", "fields": ["harassment", "management", "public participation", "focus group", "mobile phone"], "abstract": "Public sexual harassment has emerged as a large and growing concern in urban Bangladesh, with deep and damaging implications for gender security, justice, and rights of public participation. In this paper we describe an integrated program of ethnographic and design work meant to understand and address such problems. For one year we conducted surveys, interviews, and focus groups around sexual harassment with women at three different universities in Dhaka. Based on this input, we developed \" Protibadi \", a web and mobile phone based application designed to report, map, and share women's stories around sexual harassment in public places. In August 2013 the system launched, user studies were conducted, and public responses were monitored to gauge reactions, strengths, and limits of the system. This paper describes the findings of our ethnographic and design-based work, and suggests lessons relevant to other HCI efforts to understand and design around difficult and culturally sensitive problems.", "citation": "Citations (29)", "year": "2014", "departments": ["Cornell University", "Cornell University", "North South University", "Bangladesh University of Engineering and Technology", "Bangladesh University of Engineering and Technology"], "conf": "chi", "authors": ["Syed Ishtiaque Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Syed_Ishtiaque", "Steven J. Jackson.....http://dblp.org/pers/hd/j/Jackson:Steven_J=", "Nova Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Nova", "Hasan Shahid Ferdous.....http://dblp.org/pers/hd/f/Ferdous:Hasan_Shahid", "Md. Rashidujjaman Rifat.....http://dblp.org/pers/hd/r/Rifat:Md=_Rashidujjaman", "A. S. M Rizvi.....http://dblp.org/pers/hd/r/Rizvi:A=_S=_M", "Shamir Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Shamir", "Rifat Sabbir Mansur.....http://dblp.org/pers/hd/m/Mansur:Rifat_Sabbir"], "pages": 10}