{"title": "Maximizing the value of sensed information in underwater wireless sensor networks via an autonomous underwater vehicle.", "fields": ["value of information", "network packet", "heuristic", "sink", "pathfinding"], "abstract": "This paper considers underwater wireless sensor networks (UWSNs) for submarine surveillance and monitoring. Nodes produce data with an associated value, decaying in time. An autonomous underwater vehicle (AUV) is sent to retrieve information from the nodes, through optical communication, and periodically emerges to deliver the collected data to a sink, located on the surface or onshore. Our objective is to determine a collection path for the AUV so that the Value of Information (VoI) of the data delivered to the sink is maximized. To this purpose, we first define an Integer Linear Programming (ILP) model for path planning that considers realistic data communication rates, distances, and surfacing constraints. We then define the first heuristic for path finding that is adaptive to the occurrence of new events, relying only on acoustic communication for exchanging short control messages. Our Greedy and Adaptive AUV Pathfinding (GAAP) heuristic drives the AUV to collect packets from nodes to maximize the VoI of the delivered data. We compare the VoI of data obtained by running the optimum solution derived by the ILP model to that obtained from running GAAP over UWSNs with realistic and desirable size. In our experiments GAAP consistently delivers more than 80% of the theoretical maximum VoI determined by the ILP model.", "citation": "Citations (35)", "departments": ["Northeastern University", "University of Central Florida", "Sapienza University of Rome", "Sapienza University of Rome", "Sandia National Laboratories"], "authors": ["Stefano Basagni.....http://dblp.org/pers/hd/b/Basagni:Stefano", "Ladislau Bölöni.....http://dblp.org/pers/hd/b/B=ouml=l=ouml=ni:Ladislau", "Petrika Gjanci.....http://dblp.org/pers/hd/g/Gjanci:Petrika", "Chiara Petrioli.....http://dblp.org/pers/hd/p/Petrioli:Chiara", "Cynthia A. Phillips.....http://dblp.org/pers/hd/p/Phillips:Cynthia_A=", "Danila Turgut.....http://dblp.org/pers/hd/t/Turgut:Danila"], "conf": "infocom", "year": "2014", "pages": 9}