{"title": "Private search on key-value stores with hierarchical indexes.", "fields": ["secure multi party computation", "database index", "oblivious transfer", "query optimization", "privacy software"], "abstract": "Query processing that preserves both the query privacy at the client and the data privacy at the server is a new research problem. It has many practical applications, especially when the queries are about the sensitive attributes of records. However, most existing studies, including those originating from data outsourcing, address the data privacy and query privacy separately. Although secure multiparty computation (SMC) is a suitable computing paradigm for this problem, it has significant computation and communication overheads, thus unable to scale up to large datasets. Fortunately, recent advances in cryptography bring us two relevant tools — conditional oblivious transfer and homomorphic encryption. In this paper, we integrate database indexing techniques with these tools in the context of private search on key-value stores. We first present an oblivious index traversal framework, in which the server cannot trace the index traversal path of a query during evaluation. The framework is generic and can support a wide range of query types with a suitable homomorphic encryption algorithm in place. Based on this framework, we devise secure protocols for classic key search queries on B+-tree and R-tree indexes. Our approach is verified by both security analysis and performance study.", "citation": "Citations (9)", "departments": ["Hong Kong Baptist University", "Hong Kong Baptist University", "Hong Kong Baptist University", "Hong Kong Baptist University", "Hong Kong Baptist University"], "authors": ["Haibo Hu.....http://dblp.org/pers/hd/h/Hu:Haibo", "Jianliang Xu.....http://dblp.org/pers/hd/x/Xu:Jianliang", "Xizhong Xu.....http://dblp.org/pers/hd/x/Xu:Xizhong", "Kexin Pei.....http://dblp.org/pers/hd/p/Pei:Kexin", "Byron Choi.....http://dblp.org/pers/hd/c/Choi:Byron", "Shuigeng Zhou.....http://dblp.org/pers/hd/z/Zhou:Shuigeng"], "conf": "icde", "year": "2014", "pages": 12}