{"title": "Mercury: A memory-constrained spatio-temporal real-time search on microblogs.", "fields": ["ranking", "load shedding", "microblogging", "real time search", "latency"], "abstract": "This paper presents Mercury; a system for real-time support of top-k spatio-temporal queries on microblogs, where users are able to browse recent microblogs near their locations. With high arrival rates of microblogs, Mercury ensures real-time query response within a tight memory-constrained environment. Mercury bounds its search space to include only those microblogs that have arrived within certain spatial and temporal boundaries, in which only the top-k microblogs, according to a spatio-temporal ranking function, are returned in the search results. Mercury employs: (a) a scalable dynamic in-memory index structure that is capable of digesting all incoming microblogs, (b) an efficient query processor that exploits the in-memory index through spatio-temporal pruning techniques that reduce the number of visited microblogs to return the final answer, (c) an index size tuning module that dynamically finds and adjusts the minimum index size to ensure that incoming queries will be answered accurately, and (d) a load shedding technique that trades slight decrease in query accuracy for significant storage savings. Extensive experimental results based on a real-time Twitter Firehose feed and actual locations of Bing search queries show that Mercury supports high arrival rates of up to 64K microblogs/second and average query latency of 4 msec.", "citation": "Citations (26)", "departments": ["University of Minnesota", "University of Minnesota", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Amr Magdy.....http://dblp.org/pers/hd/m/Magdy_0001:Amr", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F=", "Sameh Elnikety.....http://dblp.org/pers/hd/e/Elnikety:Sameh", "Suman Nath.....http://dblp.org/pers/hd/n/Nath:Suman", "Yuxiong He.....http://dblp.org/pers/hd/h/He:Yuxiong"], "conf": "icde", "year": "2014", "pages": 12}