{"title": "Monadic Decomposition.", "fields": ["beta function", "sentence", "monad", "feynman diagram", "penrose tiling", "graph reduction", "lithography", "heuristic", "semidefinite programming", "graph", "graph bandwidth", "audio time scale pitch modification", "bhabha scattering", "sphere packing", "semantic search", "strength of a graph", "verb", "subtraction", "design for manufacturability", "multiple patterning", "scaling", "image stitching", "precision and recall", "modular decomposition", "aperiodic tiling", "integrated circuit layout"], "abstract": "While double patterning lithography (DPL) has been widely recognized as one of the most promising solutions for the sub-22nm technology node to enhance pattern printability, triple patterning lithography (TPL) will be required for gate, contact, and metal-1 layers which are too complex and dense to be split into only two masks, for the 15nm technology node and beyond. Nevertheless, there is very little research focusing on the layout decomposition for TPL. The recent work [16] proposed the first systematic study on the layout decomposition for TPL. However, the proposed algorithm extending a stitch-finding method used in DPL may miss legal stitch locations and generate conflicts that can be resolved by inserting stitches for TPL. In this paper, we point out two main differences between DPL and TPL layout decompositions. Based on the two differences, we propose a novel TPL layout decomposition algorithm. We first present two new graph reduction techniques to reduce the problem size without degrading overall solution quality. We then propose a stitch-aware mask assignment algorithm, based on a heuristic that finds a mask assignment such that the conflicts among the features in the same mask are more likely to be resolved by inserting stitches. Finally, stitches are inserted to resolve as many conflicts as possible. Experimental results show that the proposed layout decomposition algorithm can achieve around 56% reduction of conflicts and more than 40X speed-up compared to the previous work.", "citation": "Citations (85)", "year": "2014", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "University of Texas at Austin", "Facebook", "Oracle Corporation", "University of Texas at Austin", "National Taiwan University of Science and Technology", "National Taiwan University", "National Taiwan University", "University of Freiburg", "University of Freiburg", "University of Edinburgh", "Durham University", "Synopsys", "Synopsys", "Synopsys", "Mentor Graphics", "Mentor Graphics", "University of California, Los Angeles", "IBM", "IBM", "IBM", "University of California, Los Angeles"], "conf": "cav", "authors": ["Margus Veanes.....http://dblp.org/pers/hd/v/Veanes:Margus", "Nikolaj Bjørner.....http://dblp.org/pers/hd/b/Bj=oslash=rner:Nikolaj", "Lev Nachmanson.....http://dblp.org/pers/hd/n/Nachmanson:Lev", "Sergey Bereg.....http://dblp.org/pers/hd/b/Bereg:Sergey"], "pages": 18}