{"title": "REIN: A fast event matching approach for content-based publish/subscribe systems.", "fields": ["publication", "cube", "enclosure", "rectangle", "order of magnitude"], "abstract": "Event matching is the process of checking high volumes of events against large numbers of subscriptions and is a fundamental issue for the overall performance of a large- scale distributed publish/subscribe system. Most existing algo- rithms are based on counting satisfied component constraints in each subscription. As the scale of a system grows, these algorithms inevitably suffer from performance degradation. We present REIN (REctangle INtersection), a fast event matching approach for large-scale content-based publish/subscribe systems. The idea behind REIN is to quickly filter out unlikely matched subscriptions. In REIN, the event matching problem is first transformed into the rectangle intersection problem. Then, an efficient index structure is designed to address the problem by using bit operations. Experimental results show that REIN has a better matching performance than its counterparts. In particular, the event matching speed is faster by an order of magnitude when the selectivity of subscriptions is high and the number of subscriptions is large. In the paper, we present REIN (REctangle INtersec- tion), a fast event matching approach for content-based pub- lish/subscribe systems. The key idea behind REIN is to quickly filter out unlikely matched subscriptions rather than to determine whether a subscription is matched or not by counting its satisfied component constraints. In our research, it is assumed that each subscription is composed of multiple range constraints and each range constraint is a condition specified on an attribute with a low value and a high value. The range constraint is satisfied if an attribute value is located in the range formed by the low value and the high value. The attributes appearing in events form a high-dimensional space. In this space, a subscription is a high-dimensional rectangle (for short rectangle) and an event is a point. Therefore, the matching problem is equivalent to the point enclosure problem. We enlarge a point (event) into a high-dimensional cube (for short cube) to transform the point enclosure problem into the rectangle intersection problem. An efficient index structure is also designed to address the rectangle intersection problem by using bit operations.", "citation": "Citations (11)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Shiyou Qian.....http://dblp.org/pers/hd/q/Qian:Shiyou", "Jian Cao.....http://dblp.org/pers/hd/c/Cao:Jian", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu"], "conf": "infocom", "year": "2014", "pages": 9}