{"title": "Rendezvous for heterogeneous spectrum-agile devices.", "fields": ["cognitive radio", "rendezvous", "idle", "spite", "handshaking"], "abstract": "Cognitive radio (CR) is intended to meet the expo- nentially growing demand for spectrum by allowing for oppor- tunistic utilization of idle legacy channels. Rendezvous ,w here two radios complete handshaking in an idle channel, is a key step for \"stranger\" (unknown to each other) CRs to start communication. However, none of existing algorithms guarantee rendezvous for heterogeneous or stranger CRs with different spectrum-sensing capabilities, in spite of the fact that (i) a wide variety of mobile devices are equipped with heterogeneous radios and (ii) there are numerous applications requiring efficient rendezvous for heterogeneous radios/CRs. In this paper, we propose a new channel hopping algorithm, called Heterogeneous Hopping (HH), that guarantees rendezvous without assuming existence of a universal channel set that can be sensed by all radios. HH is realized with a two-layer design that harmonizes the fixed-short-cycle and parity-alignment techniques we propose here, in order to guide CRs to rendezvous in two com- plementary situations resulting from the different capabilities of mobile wireless devices. To best of our knowledge, HH is the first channel-hopping scheme that guarantees rendezvous between heterogeneous radios. Our in-depth evaluation has shown HH to be significantly faster than simple extensions of existing schemes. Moreover, the latter cannot guarantee successful rendezvous, either.", "citation": "Citations (20)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University", "University of Michigan"], "authors": ["Shan-Hung Wu.....http://dblp.org/pers/hd/w/Wu:Shan=Hung", "Ching-Chan Wu.....http://dblp.org/pers/hd/w/Wu:Ching=Chan", "Wing-Kai Hon.....http://dblp.org/pers/hd/h/Hon:Wing=Kai", "Kang G. Shin.....http://dblp.org/pers/hd/s/Shin:Kang_G="], "conf": "infocom", "year": "2014", "pages": 9}