{"title": "How to delegate computations: the power of no-signaling proofs.", "fields": ["delegation", "gas meter prover", "pspace", "delegate", "computation", "discrete mathematics", "computer science", "mathematical proof", "theoretical computer science"], "abstract": "We construct a 1-round delegation scheme (i.e., argument system) for every language computable in time  t  =  t ( n ), where the running time of the prover is poly( t ) and the running time of the verifier is  n  · polylog( t ). In particular, for every language in P we obtain a delegation scheme with almost linear time verification. Our construction relies on the existence of a computational sub-exponentially secure private information retrieval (PIR) scheme.   The proof exploits a curious connection between the problem of  computation delegation  and the model of  multi-prover interactive proofs that are sound against no-signaling (cheating) strategies , a model that was studied in the context of multi-prover interactive proofs with provers that share quantum entanglement, and is motivated by the physical principle that information cannot travel faster than light.   For any language computable in time  t  =  t ( n ), we construct a multi-prover interactive proof (MIP) that is sound against no-signaling strategies, where the running time of the provers is poly( t ), the number of provers is polylog( t ), and the running time of the verifier is  n  · polylog( t ).   In particular, this shows that the class of languages that have polynomial-time MIPs that are sound against no-signaling strategies, is exactly EXP. Previously, this class was only known to contain PSPACE.   To convert our MIP into a 1-round delegation scheme, we use the method suggested by Aiello  et al  (ICALP, 2000). This method relies on the existence of a sub-exponentially secure PIR scheme, and was proved secure by Kalai  et al  (STOC, 2013) assuming the underlying MIP is secure against no-signaling provers.", "citation": "Citations (72)", "year": "2014", "departments": ["Microsoft", "Institute for Advanced Study", "Weizmann Institute of Science"], "conf": "stoc", "authors": ["Yael Tauman Kalai.....http://dblp.org/pers/hd/k/Kalai:Yael_Tauman", "Ran Raz.....http://dblp.org/pers/hd/r/Raz:Ran", "Ron D. Rothblum.....http://dblp.org/pers/hd/r/Rothblum:Ron_D="], "pages": 10}