{"title": "Characterizing the achievable throughput in wireless networks with two active RF chains.", "fields": ["spatial multiplexing", "multi user mimo", "mimo", "radio resource management", "3g mimo"], "abstract": "Recent breakthroughs in wireless communica- tion show that by using new signal processing techniques, a wireless node is capable of transmitting and receiving simultaneously on the same frequency band by activating both of its RF chains, thus achieving full-duplex communica- tion and potentially doubling the link throughput. However, with two sets of RF chains, one can build a half-duplex multi-input and multi-output (MIMO) system that achieves the same gain. While this gain is the same between a pair of nodes, the gains are unclear when multiple nodes are involved, as in a general network. The key reason is that MIMO and full-duplex have different interference patterns. A MIMO transmission blocks transmissions around its receiver and receptions around its transmitter. A full-duplex bi- directional transmission blocks any transmission around the two communicating nodes, but allows a reception on one RF chain. Thus, in a general network, the requirements for the two technologies could result in potentially different achievable throughput regions. This work investigates the achievable throughput perfor- mance of MIMO, full-duplex and their variants that allow simultaneous activation of two RF chains. It is the first work of its kind to precisely characterize the conditions under which these technologies outperform each other for a general network topology under a binary interference model. The analytical results in this paper are validated using software-defined radios.", "citation": "Citations (14)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Yang Yang.....http://dblp.org/pers/hd/y/Yang_0010:Yang", "Bo Chen.....http://dblp.org/pers/hd/c/Chen:Bo", "Kannan Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Kannan", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2014", "pages": 9}