{"title": "Large-scale frequent subgraph mining in MapReduce.", "fields": ["graph", "cardinality", "implicit graph", "overhead", "clique width"], "abstract": "Mining frequent subgraphs from a large collection of graph objects is an important problem in several application domains such as bio-informatics, social networks, computer vision, etc. The main challenge in subgraph mining is efficiency, as (i) testing for graph isomorphisms is computationally intensive, and (ii) the cardinality of the graph collection to be mined may be very large. We propose a two-step filter-and-refinement approach that is suitable to massive parallelization within the scalable MapReduce computing model. We partition the collection of graphs among worker nodes, and each worker applies the filter step to determine a set of candidate subgraphs that are locally frequent in its partition. The union of all such graphs is the input to the refinement step, where each candidate is checked against all partitions and only the globally frequent graphs are retained. We devise a statistical threshold mechanism that allows us to predict which subgraphs have a high chance to become globally frequent, and thus reduce the computational overhead in the refinement step. We also propose effective strategies to avoid redundant computation in each round when searching for candidate graphs, as well as a lightweight graph compression mechanism to reduce the communication cost between machines. Extensive experimental evaluation results on several real-world large graph datasets show that the proposed approach clearly outperforms the existing state-of-the-art and provides a practical solution to the problem of frequent subgraph mining for massive collections of graphs.", "citation": "Citations (63)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "University of Massachusetts Boston"], "authors": ["Wenqing Lin.....http://dblp.org/pers/hd/l/Lin:Wenqing", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Gabriel Ghinita.....http://dblp.org/pers/hd/g/Ghinita:Gabriel"], "conf": "icde", "year": "2014", "pages": 12}