{"title": "AI: a lightweight system for tolerating concurrency bugs.", "fields": ["software quality", "bebugging", "atomicity", "thread", "debugging"], "abstract": "Concurrency bugs are notoriously difficult to eradicate during software testing because of their non-deterministic nature. Moreover, fixing concurrency bugs is time-consuming and error-prone. Thus, tolerating concurrency bugs during production runs is an attractive complementary approach to bug detection and testing. Unfortunately, existing bug-tolerating tools are usually either 1) constrained in types of bugs they can handle or 2) requiring roll-back mechanism, which can hitherto not be fully achieved efficiently without hardware supports. This paper presents a novel program invariant, called Anticipating Invariant (AI), which can help anticipate bugs before any irreversible changes are made. Benefiting from this ability of anticipating bugs beforehand, our software-only system is able to forestall the failures with a simple thread stalling technique, which does not rely on execution roll-back and hence has good performance Experiments with 35 real-world concurrency bugs demonstrate that AI is capable of detecting and tolerating most types of concurrency bugs, including both atomicity and order violations. Two new bugs have been detected and confirmed by the corresponding developers. Performance evaluation with 6 representative parallel programs shows that AI incurs negligible overhead (", "citation": "Citations (7)", "departments": ["Tsinghua University", "Tsinghua University", "University of Wisconsin-Madison", "University of Illinois at Urbana–Champaign", "Tsinghua University"], "authors": ["Mingxing Zhang.....http://dblp.org/pers/hd/z/Zhang:Mingxing", "Yongwei Wu.....http://dblp.org/pers/hd/w/Wu:Yongwei", "Shan Lu.....http://dblp.org/pers/hd/l/Lu:Shan", "Shanxiang Qi.....http://dblp.org/pers/hd/q/Qi:Shanxiang", "Jinglei Ren.....http://dblp.org/pers/hd/r/Ren:Jinglei", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin"], "conf": "sigsoft", "year": "2014", "pages": 11}