{"title": "Network stack specialization for performance.", "fields": ["name server", "protocol stack", "generality", "web server", "exploit", "stack"], "abstract": "Contemporary network stacks are masterpieces of generality, supporting a range of edge-node and middle-node functions. This generality comes at significant performance cost: current APIs, memory models, and implementations drastically limit the effectiveness of increasingly powerful hardware. Generality has historically been required to allow individual systems to perform many functions. However, as providers have scaled up services to support hundreds of millions of users, they have transitioned toward many thousands (or even millions) of dedicated servers performing narrow ranges of functions. We argue that the overhead of generality is now a key obstacle to effective scaling, making specialization not only viable, but necessary.   This paper presents Sandstorm, a clean-slate userspace network stack that exploits knowledge of web server semantics, improving throughput over current off-the-shelf designs while retaining use of conventional operating-system and programming frameworks. Based on Netmap, our novel approach merges application and network-stack memory models, aggressively amortizes stack-internal TCP costs based on application-layer knowledge, tightly couples with the NIC event model, and exploits low-latency hardware access. We compare our approach to the FreeBSD and Linux network stacks with nginx as the web server, demonstrating ~3.5x throughput improvement, while experiencing low CPU utilization, linear scaling on multicore systems, and saturating current NIC hardware.", "citation": "Citations (86)", "departments": ["University of Cambridge", "University of Cambridge", "University College London", "University of Cambridge", "University of Cambridge", "University College London"], "authors": ["Ilias Marinos.....http://dblp.org/pers/hd/m/Marinos:Ilias", "Robert N. M. Watson.....http://dblp.org/pers/hd/w/Watson:Robert_N=_M=", "Mark Handley.....http://dblp.org/pers/hd/h/Handley:Mark"], "conf": "sigcomm", "year": "2014", "pages": 12}