{"title": "How 'How' Reflects What's What: Content-based Exploitation of How Users Frame Social Images.", "fields": ["contextual image classification", "exploit", "image processing", "framing", "semantics"], "abstract": "In this paper, we introduce the concept of intentional framing, defined as the sum of the choices that a photographer makes on how to portray the subject matter of an image. We carry out analysis experiments that demonstrate the existence of a correspondence between image similarity that is calculated automatically on the basis of global feature representations, and image similarity that is perceived by humans at the level of intentional frames. Intentional framing has profound implications: The existence of a fundamental image-interpretation principle that explains the importance of global representations in capturing human-perceived image semantics reaches beyond currently dominant assumptions in multimedia research. The ability of fast global-feature approaches to compete with more `sophisticated' approaches, which are computationally more complex, is demonstrated using a simple search method (SimSea) to classify a large (2M) collection of social images by tag class. In short, intentional framing provides a principled connection between human interpretations of images and lightweight, fast image processing methods. Moving forward, it is critical that the community explicitly exploits such approaches, as the social image collections that we tackle, continue to grow larger.", "citation": "Citations (15)", "departments": ["Simula Research Laboratory", "Delft University of Technology", "Alpen-Adria-Universität Klagenfurt", "Delft University of Technology"], "authors": ["Michael Riegler.....http://dblp.org/pers/hd/r/Riegler:Michael", "Martha Larson.....http://dblp.org/pers/hd/l/Larson:Martha", "Mathias Lux.....http://dblp.org/pers/hd/l/Lux:Mathias", "Christoph Kofler.....http://dblp.org/pers/hd/k/Kofler:Christoph"], "conf": "mm", "year": "2014", "pages": 10}