{"title": "Exploring human mobility with multi-source data at extremely large metropolitan scales.", "fields": ["multi source", "application layer", "data feed", "abstraction layer", "reference implementation"], "abstract": "Expanding our knowledge about human mobility is essential for building efficient wireless protocols and mobile applications. Previous human mobility studies have typically been built upon empirical single-source data (e.g., cellphone or transit data), which inevitably introduces a bias against residents not contributing this type of data, e.g., call detail records cannot be obtained from the residents without cellphone activities, and transit data cannot cover the residents who walk or ride private vehicles. To address this issue, we propose and implement a novel architecture mPat to explore human mobility using multi-source data. A reference implementation of mPat was developed at an unprecedented scale upon the urban infrastructures of Shenzhen, China. The novelty and uniqueness of mPat lie in its three layers: (i) a data feed layer consisting of real-time data feeds from 24 thousand vehicles, 16 million smart cards and 10 million cellphones; (ii) a mobility abstraction layer exploring the correlation and divergence among the multi-source data to analyze and infer human mobility; and (iii) an application layer to improve urban efficiency based on the human mobility findings of the study. The evaluation shows that mPat achieves a 75% inference accuracy, and that its real-world application reduces passenger travel time by 36%.", "citation": "Citations (57)", "departments": ["University of Minnesota", "Shenzhen Instit ... Shenzhen, China", "Shenzhen Instit ... Shenzhen, China", "Shenzhen Instit ... Shenzhen, China", "Shenzhen Instit ... Shenzhen, China"], "authors": ["Desheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Desheng", "Jun Huang.....http://dblp.org/pers/hd/h/Huang:Jun", "Ye Li.....http://dblp.org/pers/hd/l/Li:Ye", "Fan Zhang.....http://dblp.org/pers/hd/z/Zhang:Fan", "Cheng-Zhong Xu.....http://dblp.org/pers/hd/x/Xu:Cheng=Zhong", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "mobicom", "year": "2014", "pages": 12}