{"title": "Feedback generation for performance problems in introductory programming assignments.", "fields": ["programming language specification", "implementation", "computational science", "computer science", "theoretical computer science", "specification language", "programming language"], "abstract": "Providing feedback on programming assignments manually is a tedious, error prone, and time-consuming task. In this paper, we motivate and address the problem of generating feedback on performance aspects in introductory programming assignments. We studied a large number of functionally correct student solutions to introductory programming assignments and observed: (1) There are different algorithmic strategies, with varying levels of efficiency, for solving a given problem. These different strategies merit different feedback. (2) The same algorithmic strategy can be implemented in countless different ways, which are not relevant for reporting feedback on the student program. We propose a light-weight programming language extension that allows a teacher to define an algorithmic strategy by specifying certain key values that should occur during the execution of an implementation. We describe a dynamic analysis based approach to test whether a student's program matches a teacher's specification. Our experimental results illustrate the effectiveness of both our specification language and our dynamic analysis. On one of our benchmarks consisting of 2316 functionally correct implementations to 3 programming problems, we identified 16 strategies that we were able to describe using our specification language (in 95 minutes after inspecting 66, i.e., around 3%, implementations). Our dynamic analysis correctly matched each implementation with its corresponding specification, thereby automatically producing the intended feedback.", "citation": "Not cited", "departments": ["Microsoft", "Vienna University of Technology", "Vienna University of Technology"], "authors": ["Sumit Gulwani.....http://dblp.org/pers/hd/g/Gulwani:Sumit", "Ivan Radicek.....http://dblp.org/pers/hd/r/Radicek:Ivan", "Florian Zuleger.....http://dblp.org/pers/hd/z/Zuleger:Florian"], "conf": "sigsoft", "year": "2014", "pages": 11}