{"title": "EkhoNet: high speed ultra low-power backscatter for next generation sensors.", "fields": ["electronic engineering", "wireless sensor network", "engineering", "rf front end", "throughput", "backscatter", "bottleneck", "channel"], "abstract": "This paper argues for a clean-slate redesign of wireless sensor systems to take advantage of the extremely low power consumption of backscatter communication and emerging ultra-low power sensor modalities. We make the case that existing sensing architectures incur substantial overhead for a variety of computational blocks between the sensor and RF front end - while these overheads were negligible on platforms where communication was expensive, they become the bottleneck on backscatter-based systems and increase power consumption while limiting throughput. We present a radically new design that is minimalist, yet efficient, and designed to operate end-to-end at tens of μWs while enabling high-data rate backscatter at rates upwards of many hundreds of Kbps. In addition, we demonstrate a complex reader-driven MAC layer that jointly considers energy, channel conditions, data utility, and platform constraints to enable network-wide throughput optimizations. We instantiate this architecture on a custom FPGA-based platform connected to microphones, and show that the platform consumes 73x lower power and has 12.5x higher throughput than existing backscatter-based sensing platforms.", "citation": "Not cited", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Pengyu Zhang.....http://dblp.org/pers/hd/z/Zhang:Pengyu", "Pan Hu.....http://dblp.org/pers/hd/h/Hu:Pan", "Vijay Pasikanti.....http://dblp.org/pers/hd/p/Pasikanti:Vijay", "Deepak Ganesan.....http://dblp.org/pers/hd/g/Ganesan:Deepak"], "conf": "mobicom", "year": "2014", "pages": 12}