{"title": "Turnstile streaming algorithms might as well be linear sketches.", "fields": ["logarithm", "turnstile", "streaming algorithm", "communication complexity", "randomized algorithm"], "abstract": "In the turnstile model of data streams, an underlying vector  x  ∈ {-- m ,-- m +1,...,  m --1, m }  n   is presented as a long sequence of positive and negative integer updates to its coordinates. A randomized algorithm seeks to approximate a function  f ( x ) with constant probability while only making a single pass over this sequence of updates and using a small amount of space. All known algorithms in this model are linear sketches: they sample a matrix  A  from a distribution on integer matrices in the preprocessing phase, and maintain the linear sketch  A · x  while processing the stream. At the end of the stream, they output an arbitrary function of  A  ·  x . One cannot help but ask:  are linear sketches universal?    In this work we answer this question by showing that any 1-pass constant probability streaming algorithm for approximating an arbitrary function  f  of  x  in the turnstile model can also be implemented by sampling a matrix  A  from the uniform distribution on  O ( n  log m ) integer matrices, with entries of magnitude poly( n ), and maintaining the linear sketch  Ax . Furthermore, the logarithm of the number of possible states of  Ax , as  x  ranges over {-- m ,-- m  + 1,...,  m }  n  , plus the amount of randomness needed to store  A , is at most a logarithmic factor larger than the space required of the space-optimal algorithm. Our result shows that to prove space lower bounds for 1-pass streaming algorithms, it suffices to prove lower bounds in the simultaneous model of communication complexity, rather than the stronger 1-way model. Moreover, the fact that we can assume we have a linear sketch with polynomially-bounded entries further simplifies existing lower bounds, e.g., for frequency moments we present a simpler proof of the Ω( n  1-2/ k  ) bit complexity lower bound without using communication complexity.", "citation": "Citations (30)", "year": "2014", "departments": ["Max Planck Society", "Princeton University", "IBM"], "conf": "stoc", "authors": ["Yi Li.....http://dblp.org/pers/hd/l/Li_0002:Yi", "Huy L. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Huy_L=", "David P. Woodruff.....http://dblp.org/pers/hd/w/Woodruff:David_P="], "pages": 10}