{"title": "Incremental discovery of prominent situational facts.", "fields": ["skyline", "popularity", "computational journalism", "subspace topology", "tuple"], "abstract": "We study the novel problem of finding new, prominent situational facts, which are emerging statements about objects that stand out within certain contexts. Many such facts are newsworthy—e.g., an athlete's outstanding performance in a game, or a viral video's impressive popularity. Effective and efficient identification of these facts assists journalists in reporting, one of the main goals of computational journalism. Technically, we consider an ever-growing table of objects with dimension and measure attributes. A situational fact is a “contextual” skyline tuple that stands out against historical tuples in a context, specified by a conjunctive constraint involving dimension attributes, when a set of measure attributes are compared. New tuples are constantly added to the table, reflecting events happening in the real world. Our goal is to discover constraint-measure pairs that qualify a new tuple as a contextual skyline tuple, and discover them quickly before the event becomes yesterday's news. A brute-force approach requires exhaustive comparison with every tuple, under every constraint, and in every measure subspace. We design algorithms in response to these challenges using three corresponding ideas—tuple reduction, constraint pruning, and sharing computation across measure subspaces. We also adopt a simple prominence measure to rank the discovered facts when they are numerous. Experiments over two real datasets validate the effectiveness and efficiency of our techniques.", "citation": "Citations (5)", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Texas at Arlington", "Duke University", "Google"], "authors": ["Afroza Sultana.....http://dblp.org/pers/hd/s/Sultana:Afroza", "Naeemul Hassan.....http://dblp.org/pers/hd/h/Hassan:Naeemul", "Chengkai Li.....http://dblp.org/pers/hd/l/Li:Chengkai", "Jun Yang.....http://dblp.org/pers/hd/y/Yang_0001:Jun", "Cong Yu.....http://dblp.org/pers/hd/y/Yu_0001:Cong"], "conf": "icde", "year": "2014", "pages": 12}