{"title": "Structure-Preserving Signatures from Type II Pairings.", "fields": ["2 group", "homomorphism", "ring signature", "bilinear interpolation", "conjecture"], "abstract": "We investigate structure-preserving signatures in asymmet- ric bilinear groups with an efficiently computable homomorphism from one source group to the other, i.e., the Type II setting. It has been shown that in the Type I and Type III settings, structure-preserving signatures need at least 2 verification equations and 3 group elements. It is therefore natural to conjecture that this would also be required in the intermediate Type II setting, but surprisingly this turns out not to be the case. We construct structure-preserving signatures in the Type II setting that only require a single verification equation and consist of only 2 group elements. This shows that the Type II setting with partial asymmetry is different from the other two settings in a way that permits the construction of cryptographic schemes with unique properties. We also investigate lower bounds on the size of the public verification key in the Type II setting. Previous work on structure-preserving signatures has explored lower bounds on the number of verification equations and the number of group elements in a signature but the size of the verification key has not been investigated before. We show that in the Type II setting it is necessary to have at least 2 group elements in the public verification key in a signature scheme with a single verification equation. Our constructions match the lower bounds so they are optimal with re- spect to verification complexity, signature sizes and verification key sizes. In fact, in terms of verification complexity, they are the most efficient structure preserving signature schemes to date. We give two structure-preserving signature schemes with a single verifi- cation equation where both the signatures and the public verification keys consist of two group elements each. One signature scheme is strongly exis- tentially unforgeable, the other is fully randomizable. Having such simple and elegant structure-preserving signatures may make the Type II setting the easiest to use when designing new structure-preserving cryptographic schemes, and lead to schemes with the greatest conceptual simplicity.", "citation": "Citations (33)", "departments": ["University College London", "NTT Secure Plat ... rm Laboratories", "Security Fundam ... Lab, NSRI, NICT", "NTT Secure Plat ... rm Laboratories"], "authors": ["Masayuki Abe.....http://dblp.org/pers/hd/a/Abe:Masayuki", "Jens Groth.....http://dblp.org/pers/hd/g/Groth:Jens", "Miyako Ohkubo.....http://dblp.org/pers/hd/o/Ohkubo:Miyako", "Mehdi Tibouchi.....http://dblp.org/pers/hd/t/Tibouchi:Mehdi"], "conf": "crypto", "year": "2014", "pages": 18}