{"title": "Applying data mining techniques to address critical process optimization needs in advanced manufacturing.", "fields": ["exploit", "data analysis", "symmetric multiprocessor system", "advanced manufacturing", "process optimization"], "abstract": "Advanced manufacturing such as aerospace, semi-conductor, and flat display device often involves complex production processes, and generates large volume of production data. In general, the production data comes from products with different levels of quality, assembly line with complex flows and equipments, and processing craft with massive controlling parameters. The scale and complexity of data is beyond the analytic power of traditional IT infrastructures. To achieve better manufacturing performance, it is imperative to explore the underlying dependencies of the production data and exploit analytic insights to improve the production process. However, few research and industrial efforts have been reported on providing manufacturers with integrated data analytical solutions to reveal potentials and optimize the production process from data-driven perspectives.   In this paper, we design, implement and deploy an integrated solution, named PDP-Miner, which is a data analytics platform customized for process optimization in Plasma Display Panel (PDP) manufacturing. The system utilizes the latest advances in data mining technologies and Big Data infrastructures to create a complete analytical solution. Besides, our proposed system is capable of supporting automatically configuring and scheduling analysis tasks, and balancing heterogeneous computing resources. The system and the analytic strategies can be applied to other advanced manufacturing fields to enable complex data analysis tasks. Since 2013, PDP-Miner has been deployed as the data analysis platform of ChangHong COC. By taking the advantages of our system, the overall PDP yield rate has increased from 91% to 94%. The monthly production is boosted by 10,000 panels, which brings more than 117 million RMB of revenue improvement per year.", "citation": "Citations (13)", "departments": ["Florida International University", "Florida International University", "Florida International University", "Florida International University", "Florida International University"], "authors": ["Li Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Li", "Chunqiu Zeng.....http://dblp.org/pers/hd/z/Zeng:Chunqiu", "Lei Li.....http://dblp.org/pers/hd/l/Li_0001:Lei", "Yexi Jiang.....http://dblp.org/pers/hd/j/Jiang:Yexi", "Wei Xue.....http://dblp.org/pers/hd/x/Xue:Wei", "Jingxuan Li.....http://dblp.org/pers/hd/l/Li:Jingxuan", "Chao Shen.....http://dblp.org/pers/hd/s/Shen:Chao", "Wubai Zhou.....http://dblp.org/pers/hd/z/Zhou:Wubai", "Hongtai Li.....http://dblp.org/pers/hd/l/Li:Hongtai", "Liang Tang.....http://dblp.org/pers/hd/t/Tang:Liang", "Tao Li.....http://dblp.org/pers/hd/l/Li_0001:Tao", "Bing Duan.....http://dblp.org/pers/hd/d/Duan:Bing", "Ming Lei.....http://dblp.org/pers/hd/l/Lei:Ming", "Pengnian Wang.....http://dblp.org/pers/hd/w/Wang:Pengnian"], "conf": "kdd", "year": "2014", "pages": 10}