{"title": "NewsNetExplorer: automatic construction and exploration of news information networks.", "fields": ["online analytical processing", "information integration", "information extraction", "scalability", "granularity"], "abstract": "News data is one of the most abundant and familiar data sources. News data can be systematically utilized and ex- plored by database, data mining, NLP and information re- trieval researchers to demonstrate to the general public the power of advanced information technology. In our view, news data contains rich, inter-related and multi-typed data objects, forming one or a set of gigantic, interconnected, het- erogeneous information networks. Much knowledge can be derived and explored with such an information network if we systematically develop effective and scalable data-intensive information network analysis technologies. By further developing a set of information extraction, in- formation network construction, and information network mining methods, we extract types, topical hierarchies and other semantic structures from news data, construct a semi- structured news information network NewsNet. Further, we develop a set of news information network exploration and mining mechanisms that explore news in multi-dimensional space, which include (i) OLAP-based operations on the hierarchical dimensional and topical structures and rich-text, such as cell summary, single dimension analysis, and promo- tion analysis, (ii) a set of network-based operations, such as similarity search and ranking-based clustering, and (iii) a set of hybrid operations or network-OLAP operations, such as entity ranking at different granularity levels. These form the basis of our proposed NewsNetExplorer system. Although some of these functions have been studied in recent research, effective and scalable realization of such functions in large networks still poses multiple challenging research problems. Moreover, some functions are our on-going research tasks. By integrating these functions, NewsNetExplorer not only provides with us insightful recommendations in NewsNet exploration system but also helps us gain insight on how to perform effective information extraction, integration and mining in large unstructured datasets.", "citation": "Citations (10)", "year": "2014", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Rensselaer Polytechnic Institute", "University of Illinois at Urbana–Champaign"], "conf": "sigmod", "authors": ["Fangbo Tao.....http://dblp.org/pers/hd/t/Tao:Fangbo", "George Brova.....http://dblp.org/pers/hd/b/Brova:George", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Heng Ji.....http://dblp.org/pers/hd/j/Ji:Heng", "Chi Wang.....http://dblp.org/pers/hd/w/Wang_0001:Chi", "Brandon Norick.....http://dblp.org/pers/hd/n/Norick:Brandon", "Ahmed El-Kishky.....http://dblp.org/pers/hd/e/El=Kishky:Ahmed", "Jialu Liu.....http://dblp.org/pers/hd/l/Liu:Jialu", "Xiang Ren.....http://dblp.org/pers/hd/r/Ren:Xiang", "Yizhou Sun.....http://dblp.org/pers/hd/s/Sun:Yizhou"], "pages": 4}