{"title": "Regression Test Selection for Distributed Software Histories.", "fields": ["codebase", "software regression", "linearization", "regression testing", "software versioning"], "abstract": "Regression test selection analyzes incremental changes to a codebase and chooses to run only those tests whose behavior may be affected by the latest changes in the code. By focusing on a small subset of all the tests, the testing process runs faster and can be more tightly integrated into the development process. Existing techniques for regression test selection consider two versions of the code at a time, effectively assuming a development process where changes to the code occur in a linear sequence.\n\nModern development processes that use distributed version-control systems are more complex. Software version histories are generally modeled as directed graphs; in addition to version changes occurring linearly, multiple versions can be related by other commands, e.g., branch, merge, rebase, cherry-pick, revert, etc. This paper describes a regression test-selection technique for software developed using modern distributed version-control systems. By modeling different branch or merge commands directly in our technique, it computes safe test sets that can be substantially smaller than applying previous techniques to a linearization of the software history.\n\nWe evaluate our technique on software histories of several large open-source projects. The results are encouraging: our technique obtained an average of 10.89× reduction in the number of tests over an existing technique while still selecting all tests whose behavior may differ.", "citation": "Citations (8)", "year": "2014", "departments": ["University of Illinois at Urbana–Champaign", "Max Planck Society", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "cav", "authors": ["Milos Gligoric.....http://dblp.org/pers/hd/g/Gligoric:Milos", "Rupak Majumdar.....http://dblp.org/pers/hd/m/Majumdar:Rupak", "Rohan Sharma.....http://dblp.org/pers/hd/s/Sharma:Rohan", "Lamyaa Eloussi.....http://dblp.org/pers/hd/e/Eloussi:Lamyaa", "Darko Marinov.....http://dblp.org/pers/hd/m/Marinov:Darko"], "pages": 17}