{"title": "A Mixture of Manhattan Frames: Beyond the Manhattan World.", "fields": ["unit sphere", "robotics", "perpendicular", "orthogonal coordinates", "phenomenon"], "abstract": "Objects and structures within man-made environments typically exhibit a high degree of organization in the form of orthogonal and parallel planes. Traditional approaches to scene representation exploit this phenomenon via the somewhat restrictive assumption that every plane is perpendicular to one of the axes of a single coordinate system. Known as the Manhattan-World model, this assumption is widely used in computer vision and robotics. The complexity of many real-world scenes, however, necessitates a more flexible model. We propose a novel probabilistic model that describes the world as a mixture of Manhattan frames: each frame defines a different orthogonal coordinate system. This results in a more expressive model that still exploits the orthogonality constraints. We propose an adaptive Markov-Chain Monte-Carlo sampling algorithm with Metropolis-Hastings split/merge moves that utilizes the geometry of the unit sphere. We demonstrate the versatility of our Mixture-of-Manhattan-Frames model by describing complex scenes using depth images of indoor scenes as well as aerial-LiDAR measurements of an urban center. Additionally, we show that the model lends itself to focal-length calibration of depth cameras and to plane segmentation.", "citation": "Citations (33)", "year": "2014", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "cvpr", "authors": ["Julian Straub.....http://dblp.org/pers/hd/s/Straub:Julian", "Guy Rosman.....http://dblp.org/pers/hd/r/Rosman:Guy", "Oren Freifeld.....http://dblp.org/pers/hd/f/Freifeld:Oren", "John J. Leonard.....http://dblp.org/pers/hd/l/Leonard:John_J=", "John W. Fisher III.....http://dblp.org/pers/hd/f/Fisher_III:John_W="], "pages": 8}