{"title": "Invariant Verification of Nonlinear Hybrid Automata Networks of Cardiac Cells.", "fields": ["invariant", "theoretical computer science", "biological network", "hybrid system", "nonlinear system"], "abstract": "Verification algorithms for networks of nonlinear hybrid automata (HA) can aid us understand and control biological processes such as cardiac arrhythmia, formation of memory, and genetic regulation. We present an algorithm for over-approximating reach sets of networks of nonlinear HA which can be used for sound and relatively complete invariant checking. First, it uses automatically computed input-to-state discrepancy functions for the individual automata modules in the network    $\\mathcal{A}$    for constructing a low-dimensional model    $\\mathcal{M}$   . Simulations of both    $\\mathcal{A}$    and    $\\mathcal{M}$    are then used to compute the reach tubes for    $\\mathcal{A}$   . These techniques enable us to handle a challenging verification problem involving a network of cardiac cells, where each cell has four continuous variables and 29 locations. Our prototype tool can check bounded-time invariants for networks with 5 cells (20 continuous variables, 295 locations) typically in less than 15 minutes for up to reasonable time horizons. From the computed reach tubes we can infer biologically relevant properties of the network from a set of initial states.", "citation": "Citations (18)", "year": "2014", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Oxford", "University of Illinois at Urbana–Champaign", "University of Oxford"], "conf": "cav", "authors": ["Zhenqi Huang.....http://dblp.org/pers/hd/h/Huang:Zhenqi", "Chuchu Fan.....http://dblp.org/pers/hd/f/Fan:Chuchu", "Alexandru Mereacre.....http://dblp.org/pers/hd/m/Mereacre:Alexandru", "Sayan Mitra.....http://dblp.org/pers/hd/m/Mitra:Sayan", "Marta Z. Kwiatkowska.....http://dblp.org/pers/hd/k/Kwiatkowska:Marta_Z="], "pages": 18}