{"title": "Towards ubiquitous indoor localization service leveraging environmental physical features.", "fields": ["crowdsourcing", "heuristic", "software deployment", "wireless site survey", "logos bible software"], "abstract": "Mainstream indoor localization technologies rely on RF signatures that require extensive human efforts to measure and periodically re-calibrate. Although recent crowdsourcing based work has started to address the issue, incentives are still lacking for wide user adoption. Thus the progress to ubiquitous localization remains slow. In this paper, we explore an alternative approach that leverages environmental physical features such as store logos or wall posters. A user uses a smartphone to obtain relative position measurements to such static reference points for the system to triangulate the user location. We study the principle of such localization, determine the suitable sensor, and devise guidelines for the user to choose reference points for better accuracy. To enable fast deployment, we propose a lightweight site survey method for service providers to quickly estimate the coordinates of reference points. We incorporate and enhance image matching algorithms with a heuristic technique to automatically identify chosen reference points at high accuracy. Extensive experiments have shown that the prototype achieves 4 − 5m accuracy at 80-percentile, comparable to the industry state-of-the-art, while covering a 150×75m mall and 300×200m train station requires a one time investment of only 2− 3 manhours from service providers.", "citation": "Citations (28)", "departments": ["Peking University", "Peking University", "Peking University", "Peking University", "Peking University"], "authors": ["Yang Tian.....http://dblp.org/pers/hd/t/Tian:Yang", "Ruipeng Gao.....http://dblp.org/pers/hd/g/Gao:Ruipeng", "Kaigui Bian.....http://dblp.org/pers/hd/b/Bian:Kaigui", "Fan Ye.....http://dblp.org/pers/hd/y/Ye:Fan", "Tao Wang.....http://dblp.org/pers/hd/w/Wang_0004:Tao", "Yizhou Wang.....http://dblp.org/pers/hd/w/Wang:Yizhou", "Xiaoming Li.....http://dblp.org/pers/hd/l/Li:Xiaoming"], "conf": "infocom", "year": "2014", "pages": 9}