{"title": "A Riemannian Framework for Matching Point Clouds Represented by the Schrödinger Distance Transform.", "fields": ["point set registration", "distance transform", "riemannian manifold", "norm", "blossom algorithm"], "abstract": "In this paper, we cast the problem of point cloud matching as a shape matching problem by transforming each of the given point clouds into a shape representation called the Schrodinger distance transform (SDT) representation. This is achieved by solving a static Schrodinger equation instead of the corresponding static Hamilton-Jacobi equation in this setting. The SDT representation is an analytic expression and following the theoretical physics literature, can be normalized to have unit 2 norm -- making it a square-root density, which is identified with a point on a unit Hilbert sphere, whose intrinsic geometry is fully known. The Fisher-Rao metric, a natural metric for the space of densities leads to analytic expressions for the geodesic distance between points on this sphere. In this paper, we use the well known Riemannian framework never before used for point cloud matching, and present a novel matching algorithm. We pose point set matching under rigid and non-rigid transformations in this framework and solve for the transformations using standard nonlinear optimization techniques. Finally, to evaluate the performance of our algorithm -- dubbed SDTM -- we present several synthetic and real data examples along with extensive comparisons to state-of-the-art techniques. The experiments show that our algorithm outperforms state-of the-art point set registration algorithms on many quantitative metrics.", "citation": "Citations (10)", "year": "2014", "departments": ["University of Florida", "University of Florida", "University of Florida", "University of Florida"], "conf": "cvpr", "authors": ["Yan Deng.....http://dblp.org/pers/hd/d/Deng:Yan", "Anand Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan_0001:Anand", "Stephan J. Eisenschenk.....http://dblp.org/pers/hd/e/Eisenschenk:Stephan_J=", "Baba C. Vemuri.....http://dblp.org/pers/hd/v/Vemuri:Baba_C="], "pages": 6}