{"title": "Random walks based modularity: application to semi-supervised learning.", "fields": ["data set", "graph", "semi supervised learning", "modularity"], "abstract": "Although criticized for some of its limitations, modularity remains a standard measure for analyzing social networks. Quantifying the statistical surprise in the arrangement of the edges of the network has led to simple and powerful algorithms. However, relying solely on the distribution of  edges  instead of more complex structures such as  paths  limits the extent of modularity. Indeed, recent studies have shown restrictions of optimizing modularity, for instance its resolution limit. We introduce here a novel, formal and well-defined modularity measure based on random walks. We show how this modularity can be computed from  paths  induced by the graph instead of the traditionally used  edges . We argue that by computing modularity on paths instead of edges, more informative features can be extracted from the network. We verify this hypothesis on a semi-supervised classification procedure of the nodes in the network, where we show that, under the same settings, the features of the random walk modularity help to classify better than the features of the usual modularity. Additionally, the proposed approach outperforms the classical label propagation procedure on two data sets of labeled social networks.", "citation": "Citations (7)", "departments": ["Université libre de Bruxelles", "Yahoo!", "Université catholique de Louvain", "Université libre de Bruxelles", "Yahoo!"], "authors": ["Robin Devooght.....http://dblp.org/pers/hd/d/Devooght:Robin", "Amin Mantrach.....http://dblp.org/pers/hd/m/Mantrach:Amin", "Ilkka Kivimäki.....http://dblp.org/pers/hd/k/Kivim=auml=ki:Ilkka", "Hugues Bersini.....http://dblp.org/pers/hd/b/Bersini:Hugues", "Alejandro Jaimes.....http://dblp.org/pers/hd/j/Jaimes:Alejandro", "Marco Saerens.....http://dblp.org/pers/hd/s/Saerens:Marco"], "conf": "www", "year": "2014", "pages": 12}