{"title": "Fast Sparse Matrix-Vector Multiplication on GPUs for Graph Applications.", "fields": ["thread", "row", "sparse matrix vector multiplication", "sparse matrix", "cuda"], "abstract": "Sparse matrix-vector multiplication (SpMV) is a widely used computational kernel. The most commonly used format for a sparse matrix is CSR (Compressed Sparse Row), but a number of other representations have recently been developed that achieve higher SpMV performance. However, the alternative representations typically impose a significant preprocessing overhead. While a high preprocessing overhead can be amortized for applications requiring many iterative invocations of SpMV that use the same matrix, it is not always feasible -- for instance when analyzing large dynamically evolving graphs.   This paper presents ACSR, an adaptive SpMV algorithm that uses the standard CSR format but reduces thread divergence by combining rows into groups (bins) which have a similar number of non-zero elements. Further, for rows in bins that span a wide range of non zero counts, dynamic parallelism is leveraged. A significant benefit of ACSR over other proposed SpMV approaches is that it works directly with the standard CSR format, and thus avoids significant preprocessing overheads. A CUDA implementation of ACSR is shown to outperform SpMV implementations in the NVIDIA CUSP and cuSPARSE libraries on a set of sparse matrices representing power-law graphs. We also demonstrate the use of ACSR for the analysis of dynamic graphs, where the improvement over extant approaches is even higher.", "citation": "Citations (86)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Arash Ashari.....http://dblp.org/pers/hd/a/Ashari:Arash", "Naser Sedaghati.....http://dblp.org/pers/hd/s/Sedaghati:Naser", "John Eisenlohr.....http://dblp.org/pers/hd/e/Eisenlohr:John", "Srinivasan Parthasarathy.....http://dblp.org/pers/hd/p/Parthasarathy_0001:Srinivasan", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P="], "conf": "sc", "year": "2014", "pages": 12}