{"title": "Reflectance and Fluorescent Spectra Recovery Based on Fluorescent Chromaticity Invariance under Varying Illumination.", "fields": ["chemical imaging", "rgb color model", "chromaticity", "3d reconstruction", "spectral sensitivity"], "abstract": "In recent years, fluorescence analysis of scenes has received attention. Fluorescence can provide additional information about scenes, and has been used in applications such as camera spectral sensitivity estimation, 3D reconstruction, and color relighting. In particular, hyperspectral images of reflective-fluorescent scenes provide a rich amount of data. However, due to the complex nature of fluorescence, hyperspectral imaging methods rely on specialized equipment such as hyperspectral cameras and specialized illuminants. In this paper, we propose a more practical approach to hyperspectral imaging of reflective-fluorescent scenes using only a conventional RGB camera and varied colored illuminants. The key idea of our approach is to exploit a unique property of fluorescence: the chromaticity of fluorescence emissions are invariant under different illuminants. This allows us to robustly estimate spectral reflectance and fluorescence emission chromaticity. We then show that given the spectral reflectance and fluorescent chromaticity, the fluorescence absorption and emission spectra can also be estimated. We demonstrate in results that all scene spectra can be accurately estimated from RGB images. Finally, we show that our method can be used to accurately relight scenes under novel lighting.", "citation": "Citations (3)", "year": "2014", "departments": ["University of Tokyo", "Kyushu Institute of Technology", "Nat. Inst. of I ... ., Tokyo, Japan", "Minist. of Inte ...  Commun., Japan", "Nat. Inst. of I ... ., Tokyo, Japan"], "conf": "cvpr", "authors": ["Ying Fu.....http://dblp.org/pers/hd/f/Fu:Ying", "Antony Lam.....http://dblp.org/pers/hd/l/Lam:Antony", "Yasuyuki Kobashi.....http://dblp.org/pers/hd/k/Kobashi:Yasuyuki", "Imari Sato.....http://dblp.org/pers/hd/s/Sato:Imari", "Takahiro Okabe.....http://dblp.org/pers/hd/o/Okabe:Takahiro", "Yoichi Sato.....http://dblp.org/pers/hd/s/Sato:Yoichi"], "pages": 8}