{"title": "From Writing to Painting: A Kinect-Based Cross-Modal Chinese Painting Generation System.", "fields": ["repertoire", "calligraphy", "digital painting", "casual", "modalities"], "abstract": "As computer and interaction technologies mature, a much broader range of media is now used for input and output, each of which has its own rich repertoire of techniques, instruments, and cultural heritage. The combination of multiple media can produce novel multimedia human-computer interaction approaches which are more efficient and interesting than traditional single media methods. This paper presents CalliPaint, a system for cross-modal art generation that links together Chinese ink brush calligraphy writing and Chinese landscape painting. We investigate the mapping between the two modalities based on concepts of metaphoric congruence, and implement our findings into a prototype system. A multi-step evaluation experiment with real users suggests that CalliPaint provides a realistic and intuitive experience that allows even novice users to create attractive landscape paintings from writing. Comparison with a general-purpose digital painting software suggests that CalliPaint provides users with a more enjoyable experience. Finally, exhibiting CalliPaint in an open-access location for use by casual users without any training shows that the system is easy to learn.", "citation": "Citations (1)", "departments": ["University of Central Florida", "Hong Kong Polyt ... ong Kong, China", "Hong Kong Polyt ... Kong, Hong Kong", "Hong Kong Polyt ... Kong, Hong Kong", "Hong Kong Polyt ... Kong, Hong Kong"], "authors": ["Jiajia Li.....http://dblp.org/pers/hd/l/Li:Jiajia", "Grace Ngai.....http://dblp.org/pers/hd/n/Ngai:Grace", "Stephen Chi-fai Chan.....http://dblp.org/pers/hd/c/Chan:Stephen_Chi=fai", "Kien A. Hua.....http://dblp.org/pers/hd/h/Hua:Kien_A=", "Hong Va Leong.....http://dblp.org/pers/hd/l/Leong:Hong_Va", "Alvin T. S. Chan.....http://dblp.org/pers/hd/c/Chan:Alvin_T=_S="], "conf": "mm", "year": "2014", "pages": 10}