{"title": "Overlap interval partition join.", "fields": ["tuple", "temporal database", "contiguity", "joins", "valid time"], "abstract": "Each tuple in a valid-time relation includes an interval attribute T that represents the tuple's valid time. The overlap join between two valid-time relations determines all pairs of tuples with overlapping intervals. Although overlap joins are common, existing partitioning and indexing schemes are inefficient if the data includes long-lived tuples or if intervals intersect partition boundaries.   We propose Overlap Interval Partitioning (OIP), a new partitioning approach for data with an interval. OIP divides the time range of a relation into k base granules and defines overlapping partitions for sequences of contiguous granules. OIP is the first partitioning method for interval data that gives a constant clustering guarantee: the difference in duration between the interval of a tuple and the interval of its partition is independent of the duration of the tuple's interval. We offer a detailed analysis of the average false hit ratio and the average number of partition accesses for queries with overlap predicates, and we prove that the average false hit ratio is independent of the number of short- and long-lived tuples. To compute the overlap join, we propose the Overlap Interval Partition Join (OIPJoin), which uses OIP to partition the input relations on-the-fly. Only the tuples from overlapping partitions have to be joined to compute the result. We analytically derive the optimal number of granules, k, for partitioning the two input relations, from the size of the data, the cost of CPU operations, and the cost of main memory or disk IOs. Our experiments confirm the analytical results and show that the OIPJoin outperforms state-of-the-art techniques for the overlap join.", "citation": "Citations (13)", "year": "2014", "departments": ["University of Zurich", "University of Zurich", "Free University of Bozen-Bolzano"], "conf": "sigmod", "authors": ["Anton Dignös.....http://dblp.org/pers/hd/d/Dign=ouml=s:Anton", "Michael H. Böhlen.....http://dblp.org/pers/hd/b/B=ouml=hlen:Michael_H=", "Johann Gamper.....http://dblp.org/pers/hd/g/Gamper:Johann"], "pages": 12}