{"title": "GeoMF: joint geographical modeling and matrix factorization for point-of-interest recommendation.", "fields": ["kernel density estimation", "matrix decomposition", "non negative matrix factorization", "phenomenon", "collaborative filtering"], "abstract": "Point-of-Interest (POI) recommendation has become an important means to help people discover attractive locations. However, extreme sparsity of user-POI matrices creates a severe challenge. To cope with this challenge, viewing mobility records on location-based social networks (LBSNs) as implicit feedback for POI recommendation, we first propose to exploit weighted matrix factorization for this task since it usually serves collaborative filtering with implicit feedback better. Besides, researchers have recently discovered a spatial clustering phenomenon in human mobility behavior on the LBSNs, i.e., individual visiting locations tend to cluster together, and also demonstrated its effectiveness in POI recommendation, thus we incorporate it into the factorization model. Particularly, we augment users' and POIs' latent factors in the factorization model with activity area vectors of users and influence area vectors of POIs, respectively. Based on such an augmented model, we not only capture the spatial clustering phenomenon in terms of two-dimensional kernel density estimation, but we also explain why the introduction of such a phenomenon into matrix factorization helps to deal with the challenge from matrix sparsity. We then evaluate the proposed algorithm on a large-scale LBSN dataset. The results indicate that weighted matrix factorization is superior to other forms of factorization models and that incorporating the spatial clustering phenomenon into matrix factorization improves recommendation performance.", "citation": "Citations (245)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "Microsoft", "University of Science and Technology of China", "University of Science and Technology of China"], "authors": ["Defu Lian.....http://dblp.org/pers/hd/l/Lian:Defu", "Cong Zhao.....http://dblp.org/pers/hd/z/Zhao:Cong", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Guangzhong Sun.....http://dblp.org/pers/hd/s/Sun:Guangzhong", "Enhong Chen.....http://dblp.org/pers/hd/c/Chen:Enhong", "Yong Rui.....http://dblp.org/pers/hd/r/Rui:Yong"], "conf": "kdd", "year": "2014", "pages": 10}