{"title": "Balancing trade-offs in test-suite reduction.", "fields": ["software versioning", "test suite", "test management approach", "regression testing", "software evolution"], "abstract": "Regression testing is an important activity but can get expensive for large test suites. Test-suite reduction speeds up regression testing by identifying and removing redundant tests based on a given set of requirements. Traditional research on test-suite reduction is rather diverse but most commonly shares three properties: (1) requirements are defined by a coverage criterion such as statement coverage; (2) the reduced test suite has to satisfy all the requirements as the original test suite; and (3) the quality of the reduced test suites is measured on the software version on which the reduction is performed. These properties make it hard for test engineers to decide how to use reduced test suites. We address all three properties of traditional test-suite reduction: (1) we evaluate test-suite reduction with requirements defined by killed mutants; (2) we evaluate inadequate reduction that does not require reduced test suites to satisfy all the requirements; and (3) we propose evolution-aware metrics that evaluate the quality of the reduced test suites across multiple software versions. Our evaluations allow a more thorough exploration of trade-offs in test-suite reduction, and our evolution-aware metrics show how the quality of reduced test suites can change after the version where the reduction is performed. We compare the trade-offs among various reductions on 18 projects with a total of 261,235 tests over 3,590 commits and a cumulative history spanning 35 years of development. Our results help test engineers make a more informed decision about balancing size, coverage, and fault-detection loss of reduced test suites.", "citation": "Citations (59)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["August Shi.....http://dblp.org/pers/hd/s/Shi:August", "Alex Gyori.....http://dblp.org/pers/hd/g/Gyori:Alex", "Milos Gligoric.....http://dblp.org/pers/hd/g/Gligoric:Milos", "Andrey Zaytsev.....http://dblp.org/pers/hd/z/Zaytsev:Andrey", "Darko Marinov.....http://dblp.org/pers/hd/m/Marinov:Darko"], "conf": "sigsoft", "year": "2014", "pages": 11}