{"title": "Pay-as-you-go reconciliation in schema matching networks.", "fields": ["schema", "probabilistic logic", "schema matching", "data integration", "database schema"], "abstract": "Schema matching is the process of establishing correspondences between the attributes of database schemas for data integration purposes. Although several automatic schema matching tools have been developed, their results are often incomplete or erroneous. To obtain a correct set of correspondences, a human expert is usually required to validate the generated correspondences. We analyze this reconciliation process in a setting where a number of schemas needs to be matched, in the presence of consistency expectations about the network of attribute correspondences. We develop a probabilistic model that helps to identify the most uncertain correspondences, thus allowing us to guide the expert's work and collect his input about the most problematic cases. As the availability of such experts is often limited, we develop techniques that can construct a set of good quality correspondences with a high probability, even if the expert does not validate all the necessary correspondences. We demonstrate the efficiency of our techniques through extensive experimentation using real-world datasets.", "citation": "Citations (21)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of Rennes", "École Polytechnique Fédérale de Lausanne", "Technion – Israel Institute of Technology"], "authors": ["Nguyen Quoc Viet Hung.....http://dblp.org/pers/hd/h/Hung:Nguyen_Quoc_Viet", "Nguyen Thanh Tam.....http://dblp.org/pers/hd/t/Tam:Nguyen_Thanh", "Zoltán Miklós.....http://dblp.org/pers/hd/m/Mikl=oacute=s_0001:Zolt=aacute=n", "Karl Aberer.....http://dblp.org/pers/hd/a/Aberer:Karl", "Avigdor Gal.....http://dblp.org/pers/hd/g/Gal:Avigdor", "Matthias Weidlich.....http://dblp.org/pers/hd/w/Weidlich:Matthias"], "conf": "icde", "year": "2014", "pages": 12}