{"title": "Torturing Databases for Fun and Profit.", "fields": ["source lines of code", "data loss", "atomicity", "ranging", "online transaction processing"], "abstract": "Programmers use databases when they want a high level of reliability. Specifically, they want the sophisticated ACID (atomicity, consistency, isolation, and durability) protection modern databases provide. However, the ACID properties are far from trivial to provide, particularly when high performance must be achieved. This leads to complex and error-prone code--even at a low defect rate of one bug per thousand lines, the millions of lines of code in a commercial OLTP database can harbor thousands of bugs.\n\nHere we propose a method to expose and diagnose violations of the ACID properties. We focus on an ostensibly easy case: power faults. Our framework includes workloads to exercise the ACID guarantees, a record/replay subsystem to allow the controlled injection of simulated power faults, a ranking algorithm to prioritize where to fault based on our experience, and a multi-layer tracer to diagnose root causes. Using our framework, we study 8 widely-used databases, ranging from open-source key-value stores to high-end commercial OLTP servers. Surprisingly, all 8 databases exhibit erroneous behavior. For the open-source databases, we are able to diagnose the root causes using our tracer, and for the proprietary commercial databases we can reproducibly induce data loss.", "citation": "Citations (28)", "departments": ["Ohio State University", "Hewlett-Packard", "Ohio State University", "Ohio State University", "Hewlett-Packard"], "authors": ["Mai Zheng.....http://dblp.org/pers/hd/z/Zheng:Mai", "Joseph Tucek.....http://dblp.org/pers/hd/t/Tucek:Joseph", "Dachuan Huang.....http://dblp.org/pers/hd/h/Huang:Dachuan", "Feng Qin.....http://dblp.org/pers/hd/q/Qin:Feng", "Mark Lillibridge.....http://dblp.org/pers/hd/l/Lillibridge:Mark", "Elizabeth S. Yang.....http://dblp.org/pers/hd/y/Yang:Elizabeth_S=", "Bill W. Zhao.....http://dblp.org/pers/hd/z/Zhao:Bill_W=", "Shashank Singh.....http://dblp.org/pers/hd/s/Singh_0003:Shashank"], "conf": "osdi", "year": "2014", "pages": 16}