{"title": "Are mutants a valid substitute for real faults in software testing?", "fields": ["source lines of code", "mutation testing", "test suite", "mutant", "code coverage"], "abstract": "A good test suite is one that detects real faults. Because the set of faults in a program is usually unknowable, this definition is not useful to practitioners who are creating test suites, nor to researchers who are creating and evaluating tools that generate test suites. In place of real faults, testing research often uses mutants, which are artificial faults -- each one a simple syntactic variation -- that are systematically seeded throughout the program under test. Mutation analysis is appealing because large numbers of mutants can be automatically-generated and used to compensate for low quantities or the absence of known real faults. Unfortunately, there is little experimental evidence to support the use of mutants as a replacement for real faults. This paper investigates whether mutants are indeed a valid substitute for real faults, i.e., whether a test suite’s ability to detect mutants is correlated with its ability to detect real faults that developers have fixed. Unlike prior studies, these investigations also explicitly consider the conflating effects of code coverage on the mutant detection rate. Our experiments used 357 real faults in 5 open-source applications that comprise a total of 321,000 lines of code. Furthermore, our experiments used both developer-written and automatically-generated test suites. The results show a statistically significant correlation between mutant detection and real fault detection, independently of code coverage. The results also give concrete suggestions on how to improve mutation analysis and reveal some inherent limitations.", "citation": "Citations (281)", "departments": ["University of Washington", "University of Washington", "University of Waterloo", "University of Washington", "University of Waterloo"], "authors": ["René Just.....http://dblp.org/pers/hd/j/Just:Ren=eacute=", "Darioush Jalali.....http://dblp.org/pers/hd/j/Jalali:Darioush", "Laura Inozemtseva.....http://dblp.org/pers/hd/i/Inozemtseva:Laura", "Michael D. Ernst.....http://dblp.org/pers/hd/e/Ernst:Michael_D=", "Reid Holmes.....http://dblp.org/pers/hd/h/Holmes:Reid", "Gordon Fraser.....http://dblp.org/pers/hd/f/Fraser:Gordon"], "conf": "sigsoft", "year": "2014", "pages": 12}