{"title": "Scalable atomic visibility with RAMP transactions.", "fields": ["materialized view", "multipartition", "snapshot", "database transaction", "commit", "atomicity", "transaction processing"], "abstract": "Databases can provide scalability by partitioning data across several servers. However, multi-partition, multi-operation transactional access is often expensive, employing coordination-intensive locking, validation, or scheduling mechanisms. Accordingly, many real-world systems avoid mechanisms that provide useful semantics for multi-partition operations. This leads to incorrect behavior for a large class of applications including secondary indexing, foreign key enforcement, and materialized view maintenance. In this work, we identify a new isolation model---Read Atomic (RA) isolation---that matches the requirements of these use cases by ensuring atomic visibility: either all or none of each transaction's updates are observed by other transactions. We present algorithms for Read Atomic Multi-Partition (RAMP) transactions that enforce atomic visibility while offering excellent scalability, guaranteed commit despite partial failures (via synchronization independence), and minimized communication between servers (via partition independence). These RAMP transactions correctly mediate atomic visibility of updates and provide readers with snapshot access to database state by using limited multi-versioning and by allowing clients to independently resolve non-atomic reads. We demonstrate that, in contrast with existing algorithms, RAMP transactions incur limited overhead---even under high contention---and scale linearly to 100 servers.", "citation": "Citations (88)", "year": "2014", "departments": ["University of California, Berkeley", "University of Sydney", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Stanford University", "University of Sydney", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "sigmod", "authors": ["Peter Bailis.....http://dblp.org/pers/hd/b/Bailis:Peter", "Alan Fekete.....http://dblp.org/pers/hd/f/Fekete:Alan", "Joseph M. Hellerstein.....http://dblp.org/pers/hd/h/Hellerstein:Joseph_M=", "Ali Ghodsi.....http://dblp.org/pers/hd/g/Ghodsi_0002:Ali", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "pages": 12}