{"title": "Uncorrelated Multi-View Discrimination Dictionary Learning for Recognition.", "fields": ["discriminative model", "uncorrelated", "redundancy", "feature learning", "machine learning"], "abstract": "Dictionary learning (DL) has now become an important feature learning technique that owns state-of-the-art recognition performance. Due to sparse characteristic of data in real-world applications, DL uses a set of learned dictionary bases to represent the linear decomposition of a data point. Fisher discrimination DL (FDDL) is a representative supervised DL method, which constructs a structured dictionary whose atoms correspond to the class labels. Recent years have witnessed a growing interest in multi-view (more than two views) feature learning techniques. Although some multiview (or multi-modal) DL methods have been presented, there still exists much room for improvement. How to enhance the total discriminability of dictionaries and reduce their redundancy is a crucial research topic. To boost the performance of multi-view DL technique, we propose an uncorrelated multi-view discrimination DL (UMD2L) approach for recognition. By making dictionary atoms correspond to the class labels such that the obtained reconstruction error is discriminative, UMD2L aims to jointly learn multiple dictionaries with totally favorable discriminative power. Furthermore, we design the uncorrelated constraint for multiview DL, so as to reduce the redundancy among dictionaries learned from different views. Experiments on several public datasets demonstrate the effectiveness of the proposed approach.", "citation": "Citations (11)", "departments": ["Nanjing University of Posts and Telecommunications", "Wuhan University", "Nanjing University of Posts and Telecommunications", "Chinese Academy of Sciences", "Nanjing University of Posts and Telecommunications"], "authors": ["Xiao-Yuan Jing.....http://dblp.org/pers/hd/j/Jing:Xiao=Yuan", "Ruimin Hu.....http://dblp.org/pers/hd/h/Hu:Ruimin", "Fei Wu.....http://dblp.org/pers/hd/w/Wu_0004:Fei", "Xi-Lin Chen.....http://dblp.org/pers/hd/c/Chen:Xi=Lin", "Qian Liu.....http://dblp.org/pers/hd/l/Liu:Qian", "Yong-Fang Yao.....http://dblp.org/pers/hd/y/Yao:Yong=Fang"], "conf": "aaai", "year": "2014", "pages": 9}