{"title": "PANDA: Pose Aligned Networks for Deep Attribute Modeling.", "fields": ["deep learning", "minimum bounding box", "cognitive neuroscience of visual object recognition", "artificial neural network", "3d pose estimation"], "abstract": "We propose a method for inferring human attributes (such as gender, hair style, clothes style, expression, action) from images of people under large variation of viewpoint, pose, appearance, articulation and occlusion. Convolutional Neural Nets (CNN) have been shown to perform very well on large scale object recognition problems. In the context of attribute classification, however, the signal is often subtle and it may cover only a small part of the image, while the image is dominated by the effects of pose and viewpoint. Discounting for pose variation would require training on very large labeled datasets which are not presently available. Part-based models, such as poselets [4] and DPM [12] have been shown to perform well for this problem but they are limited by shallow low-level features. We propose a new method which combines part-based models and deep learning by training pose-normalized CNNs. We show substantial improvement vs. state-of-the-art methods on challenging attribute classification tasks in unconstrained settings. Experiments confirm that our method outperforms both the best part-based methods on this problem and conventional CNNs trained on the full bounding box of the person.", "citation": "Citations (304)", "year": "2014", "departments": ["University of California", "Georgia Institute of Technology", "Facebook", "University of California, Berkeley", "Facebook"], "conf": "cvpr", "authors": ["Ning Zhang.....http://dblp.org/pers/hd/z/Zhang_0014:Ning", "Manohar Paluri.....http://dblp.org/pers/hd/p/Paluri:Manohar", "Marc'Aurelio Ranzato.....http://dblp.org/pers/hd/r/Ranzato:Marc=Aurelio", "Trevor Darrell.....http://dblp.org/pers/hd/d/Darrell:Trevor", "Lubomir D. Bourdev.....http://dblp.org/pers/hd/b/Bourdev:Lubomir_D="], "pages": 8}