{"title": "Exploring Principles-of-Art Features For Image Emotion Recognition.", "fields": ["principles of art", "contextual image classification", "international affective picture system", "feature", "gradation"], "abstract": "Emotions can be evoked in humans by images. Most previous works on image emotion analysis mainly used the elements-of-art-based low-level visual features. However, these features are vulnerable and not invariant to the different arrangements of elements. In this paper, we investigate the concept of principles-of-art and its influence on image emotions. Principles-of-art-based emotion features (PAEF) are extracted to classify and score image emotions for understanding the relationship between artistic principles and emotions. PAEF are the unified combination of representation features derived from different principles, including balance, emphasis, harmony, variety, gradation, and movement. Experiments on the International Affective Picture System (IAPS), a set of artistic photography and a set of peer rated abstract paintings, demonstrate the superiority of PAEF for affective image classification and regression (with about 5% improvement on classification accuracy and 0.2 decrease in mean squared error), as compared to the state-of-the-art approaches. We then utilize PAEF to analyze the emotions of master paintings, with promising results.", "citation": "Citations (100)", "departments": ["Harbin Institute of Technology", "National University of Singapore", "Harbin Institute of Technology", "Harbin Institute of Technology", "National University of Singapore"], "authors": ["Sicheng Zhao.....http://dblp.org/pers/hd/z/Zhao:Sicheng", "Yue Gao.....http://dblp.org/pers/hd/g/Gao:Yue", "Xiaolei Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaolei", "Hongxun Yao.....http://dblp.org/pers/hd/y/Yao:Hongxun", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng", "Xiaoshuai Sun.....http://dblp.org/pers/hd/s/Sun:Xiaoshuai"], "conf": "mm", "year": "2014", "pages": 10}