{"title": "User-level psychological stress detection from social media using deep neural network.", "fields": ["convolutional neural network", "psychological stress", "microblogging", "social engagement", "deep learning"], "abstract": "It is of significant importance to detect and manage stress before it turns into severe problems. However, existing stress detection methods usually rely on psychological scales or physiological devices, making the detection complicated and costly. In this paper, we explore to automatically detect individuals' psychological stress via social media. Employing real online micro-blog data, we first investigate the correlations between users' stress and their tweeting content, social engagement and behavior patterns. Then we define two types of stress-related attributes: 1) low-level content attributes from a single tweet, including text, images and social interactions; 2) user-scope statistical attributes through their weekly micro-blog postings, leveraging information of tweeting time, tweeting types and linguistic styles. To combine content attributes with statistical attributes, we further design a convolutional neural network (CNN) with cross autoencoders to generate user-scope content attributes from low-level content attributes. Finally, we propose a deep neural network (DNN) model to incorporate the two types of user-scope attributes to detect users' psychological stress. We test the trained model on four different datasets from major micro-blog platforms including Sina Weibo, Tencent Weibo and Twitter. Experimental results show that the proposed model is effective and efficient on detecting psychological stress from micro-blog data. We believe our model would be useful in developing stress detection tools for mental health agencies and individuals.", "citation": "Citations (32)", "departments": ["Tsinghua University", "Tsinghua University", "Sichuan University", "Tsinghua University", "Tsinghua University"], "authors": ["Huijie Lin.....http://dblp.org/pers/hd/l/Lin:Huijie", "Jia Jia.....http://dblp.org/pers/hd/j/Jia_0001:Jia", "Quan Guo.....http://dblp.org/pers/hd/g/Guo:Quan", "Yuanyuan Xue.....http://dblp.org/pers/hd/x/Xue:Yuanyuan", "Qi Li.....http://dblp.org/pers/hd/l/Li_0006:Qi", "Jie Huang.....http://dblp.org/pers/hd/h/Huang:Jie", "Lianhong Cai.....http://dblp.org/pers/hd/c/Cai:Lianhong", "Ling Feng.....http://dblp.org/pers/hd/f/Feng:Ling"], "conf": "mm", "year": "2014", "pages": 10}