{"title": "Towards indexing functions: answering scalar product queries.", "fields": ["data point", "linear space", "scalar", "search engine indexing", "hyperplane"], "abstract": "We consider a broad category of analytic queries, denoted by scalar product queries, which can be expressed as a scalar product between a known function over multiple database attributes and an unknown set of parameters. More specifically, given a set of d-dimensional data points, we retrieve all points x which satisfy an inequality given by a scalar product:      Efficiently answering such scalar product queries are essential in a wide range of applications including evaluation of complex SQL functions, time series prediction, scientific simulation, and active learning. Although some specific subclasses of the aforementioned scalar product queries and their applications have been studied in computational geometry, machine learning, and in moving object queries, surprisingly no generalized indexing scheme has been proposed for efficiently computing scalar product queries.   We present a lightweight, yet scalable, dynamic, and generalized indexing scheme, called the planar index, for answering scalar product queries in an accurate manner, which is based on the idea of indexing function f(x) for each data point x using multiple sets of parallel hyperplanes. Planar index has loglinear indexing time and linear space complexity, and the query time ranges from logarithmic to being linear in the number of data points. Based on an extensive set of experiments on several real-world and synthetic datasets, we show that planar index is not only scalable and dynamic, but also effective in various real-world applications including intersection finding between moving objects and active learning.", "citation": "Citations (2)", "year": "2014", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich"], "conf": "sigmod", "authors": ["Arijit Khan.....http://dblp.org/pers/hd/k/Khan:Arijit", "Pouya Yanki.....http://dblp.org/pers/hd/y/Yanki:Pouya", "Bojana Dimcheva.....http://dblp.org/pers/hd/d/Dimcheva:Bojana", "Donald Kossmann.....http://dblp.org/pers/hd/k/Kossmann:Donald"], "pages": 12}