{"title": "Explore-by-example: an automatic query steering framework for interactive data exploration.", "fields": ["relevance feedback", "conjunctive query", "wait", "data discovery", "data exploration"], "abstract": "Interactive Data Exploration (IDE) is a key ingredient of a diverse set of discovery-oriented applications, including ones from scientific computing and evidence-based medicine. In these applications, data discovery is a highly ad hoc interactive process where users execute numerous exploration queries using varying predicates aiming to balance the trade-off between collecting all relevant information and reducing the size of returned data. Therefore, there is a strong need to support these human-in-the-loop applications by assisting their navigation in the data to find interesting objects.   In this paper, we introduce AIDE, an Automatic Interactive Data Exploration framework, that iteratively steers the user towards interesting data areas and predicts a query that retrieves his objects of interest. Our approach leverages relevance feedback on database samples to model user interests and strategically collects more samples to refine the model while minimizing the user effort. AIDE integrates machine learning and data management techniques to provide effective data exploration results (matching the user's interests with high accuracy) as well as high interactive performance. It delivers highly accurate query predictions for very common conjunctive queries with very small user effort while, given a reasonable number of samples, it can predict with high accuracy complex conjunctive queries. Furthermore, it provides interactive performance by limiting the user wait time per iteration to less than a few seconds in average. Our user study indicates that AIDE is a practical exploration framework as it significantly reduces the user effort and the total exploration time compared with the current state-of-the-art approach of manual exploration.", "citation": "Citations (82)", "year": "2014", "departments": ["Brandeis University", "Brandeis University", "University of Massachusetts Amherst"], "conf": "sigmod", "authors": ["Kyriaki Dimitriadou.....http://dblp.org/pers/hd/d/Dimitriadou:Kyriaki", "Olga Papaemmanouil.....http://dblp.org/pers/hd/p/Papaemmanouil:Olga", "Yanlei Diao.....http://dblp.org/pers/hd/d/Diao:Yanlei"], "pages": 12}