{"title": "A probabilistic model for linking named entities in web text with heterogeneous information networks.", "fields": ["weak entity", "popularity", "object model", "ambiguity", "entity linking"], "abstract": "Heterogeneous information networks that consist of multi-type, interconnected objects are becoming ubiquitous and increasingly popular, such as social media networks and bibliographic networks. The task to link named entity mentions detected from the unstructured Web text with their corresponding entities existing in a heterogeneous information network is of practical importance for the problem of information network population and enrichment. This task is challenging due to name ambiguity and limited knowledge existing in the information network. Most existing entity linking methods focus on linking entities with Wikipedia or Wikipedia-derived knowledge bases (e.g., YAGO), and are largely dependent on the special features associated with Wikipedia (e.g., Wikipedia articles or Wikipedia-based relatedness measures). Since heterogeneous information networks do not have such features, these previous methods cannot be applied to our task. In this paper, we propose SHINE, the first probabilistic model to link the named entities in Web text with a heterogeneous information network to the best of our knowledge. Our model consists of two components: the entity popularity model that captures the popularity of an entity, and the entity object model that captures the distribution of multi-type objects appearing in the textual context of an entity, which is generated using meta-path constrained random walks over networks. As different meta-paths express diverse semantic meanings and lead to various distributions over objects, different paths have different weights in entity linking. We propose an effective iterative approach to automatically learning the weights for each meta-path based on the expectation-maximization (EM) algorithm without requiring any training data. Experimental results on a real world data set demonstrate the effectiveness and efficiency of our proposed model in comparison with the baselines.", "citation": "Citations (24)", "year": "2014", "departments": ["Tsinghua University", "University of Illinois at Urbana–Champaign", "Tsinghua University"], "conf": "sigmod", "authors": ["Wei Shen.....http://dblp.org/pers/hd/s/Shen_0004:Wei", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei", "Jianyong Wang.....http://dblp.org/pers/hd/w/Wang:Jianyong"], "pages": 12}