{"title": "Application-driven bandwidth guarantees in datacenters.", "fields": ["workload", "virtual network", "dynamic bandwidth allocation", "computer network", "cloud computing", "bandwidth", "network traffic control", "high availability"], "abstract": "Providing bandwidth guarantees to specific applications is becoming increasingly important as applications compete for shared cloud network resources. We present CloudMirror, a solution that provides bandwidth guarantees to cloud applications based on a new network abstraction and workload placement algorithm. An effective network abstraction should enable applications to easily and accurately specify their requirements, while simultaneously enabling the infrastructure to provision resources efficiently for deployed applications. Prior research has approached the bandwidth guarantee specification by using abstractions that resemble physical network topologies. We present a contrasting approach of deriving a network abstraction based on application communication structure, called Tenant Application Graph or TAG. CloudMirror also incorporates a new workload placement algorithm that efficiently meets bandwidth requirements specified by TAGs while factoring in high availability considerations. Extensive simulations using real application traces and datacenter topologies show that CloudMirror can handle 40% more bandwidth demand than the state of the art (e.g., the Oktopus system), while improving high availability from 20% to 70%.", "citation": "Citations (124)", "departments": ["Hewlett-Packard", "Hewlett-Packard", "University of Edinburgh", "University of California, Berkeley", "Hewlett-Packard", "School of Informatics"], "authors": ["Jeongkeun Lee.....http://dblp.org/pers/hd/l/Lee:Jeongkeun", "Yoshio Turner.....http://dblp.org/pers/hd/t/Turner:Yoshio", "Myungjin Lee.....http://dblp.org/pers/hd/l/Lee:Myungjin", "Lucian Popa.....http://dblp.org/pers/hd/p/Popa_0002:Lucian", "Sujata Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Sujata", "Joon-Myung Kang.....http://dblp.org/pers/hd/k/Kang:Joon=Myung", "Puneet Sharma.....http://dblp.org/pers/hd/s/Sharma:Puneet"], "conf": "sigcomm", "year": "2014", "pages": 12}