{"title": "ProWord: An unsupervised approach to protocol feature word extraction.", "fields": ["packet analyzer", "internet traffic", "feature", "application layer", "traffic classification"], "abstract": "Protocol feature words are byte subsequences within traffic payload that can distinguish application protocols, and they form the building blocks of many constructions of deep packet analysis rules in network management, measurement, and security systems. However, how to systematically and efficiently extract protocol feature words from network traffic remains a challenging issue. Existing n-gram approaches simply break pay- load into equal-length pieces and are ineffective in capturing the hidden statistical structure of the payload content. In this paper, we propose ProWord, an unsupervised approach that extracts protocol feature words from traffic traces. ProWord builds on two nontrivial algorithms. First, we propose an unsupervised segmen- tation algorithm based on the modified Voting Experts algorithm, such that we break payload into candidate words according to entropy information and provide more accurate segmentation than existing n-gram approaches. Second, we propose a ranking algorithm that incorporates different types of well-known feature word retrieval heuristics, such that we can build an ordered structure on the candidate words and select the highest ranked ones as protocol feature words. We compare ProWord and existing n-gram approaches via evaluation on real-world traffic traces. We show that ProWord captures true protocol feature words more accurately and performs significantly faster. I. INTRODUCTION To deal with the increasing variety and complexity of mod- ern Internet traffic, operators often need deep understanding of applications running in their networks. Today's operators are challenged by how to keep pace with the explosive growth of new web and mobile applications (1). Protocol feature words (or feature words for short) are byte subsequences within pay- load that can distinguish application protocols. If we consider each protocol as a type of communication language, feature words make up a lexicon and form the building blocks for any deep packet analysis. Feature words are important in security and measurement systems. For example, the Linux application classifier L7-Filter (2) uses layer-7 feature words to build regular expressions for traffic identification. Intrusion detection systems, such as Snort (3) and Bro (4), need feature words to construct rules and guide their engines to properly conduct application layer protocol processing. Traffic analysis tools such as Wireshark (5) and NetDude (6) require third-party development of additional plugins to provide feature support for new protocols. Compared to the noise-prone and easily morphed behavioral features such as packet sizes and interval times, feature words are more stable and distinguishable in traffic classification related applications (7), (8).", "citation": "Citations (13)", "departments": ["The Chinese University of Hong Kong", "Peking University", "Inst. of Comput ...  Beijing, China", "Inst. of Comput ...  Beijing, China", "Inst. of Comput ...  Beijing, China"], "authors": ["Zhuo Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhuo", "Zhibin Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhibin", "Patrick P. C. Lee.....http://dblp.org/pers/hd/l/Lee:Patrick_P=_C=", "Yunjie Liu.....http://dblp.org/pers/hd/l/Liu:Yunjie", "Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang"], "conf": "infocom", "year": "2014", "pages": 9}