{"title": "A longitudinal analysis of Internet rate limitations.", "fields": ["hstcp", "tcp hole punching", "tcp friendly rate control", "tcp westwood plus", "zeta tcp"], "abstract": "TCP remains the dominant transport protocol for Internet traffic, but the preponderance of its congestion control mechanisms in determining flow throughput is often disputed. This paper analyzes the extent to which network, host and application settings define flow throughput over time and across autonomous systems. Drawing from a longitudinal study spanning five years of passive traces collected from a single transit link, our results show that continuing OS upgrades have reduced the influence of host limitations owing both to windowscale deployment, which by 2011 covered 80% of inbound traffic, and increased socket buffer sizes. On the other hand, we show that for this data set, approximately half of all inbound traffic remains throttled by constraints beyond network capacity, challenging the traditional model of congestion control in TCP traffic as governed primarily by loss and delay. I. INTRODUCTION TCP plays a central role in mediating between application needs and network capacity. In the absence of congestion, TCP is responsible for increasing sending rates in a bid to make efficient use of available bandwidth. Conversely, should congestion arise, TCP is expected to reduce its rate. This form of congestion control embedded in TCP is largely credited with performing resource allocation across the Internet and averting congestion collapse. But to what extent does this behaviour describe TCP throughput in practice?", "citation": "Citations (1)", "departments": ["University College London", "University College London", "University College London", "University College London", "National Institute of Informatics"], "authors": ["João Taveira Araújo.....http://dblp.org/pers/hd/a/Ara=uacute=jo:Jo=atilde=o_Taveira", "Raul Landa.....http://dblp.org/pers/hd/l/Landa:Raul", "Richard G. Clegg.....http://dblp.org/pers/hd/c/Clegg:Richard_G=", "George Pavlou.....http://dblp.org/pers/hd/p/Pavlou:George", "Kensuke Fukuda.....http://dblp.org/pers/hd/f/Fukuda:Kensuke"], "conf": "infocom", "year": "2014", "pages": 9}