{"title": "Minimizing Running Costs in Consumption Systems.", "fields": ["battery", "bounded function", "controller", "parity game", "decidability"], "abstract": "A standard approach to optimizing long-run running costs of discrete systems is based on minimizing the mean-payoff, i.e., the long-run average amount of resources (\"energy\") consumed per transition. However, this approach inherently assumes that the energy source has an unbounded capacity, which is not always realistic. For example, an autonomous robotic device has a battery of finite capacity that has to be recharged periodically, and the total amount of energy consumed between two successive charging cycles is bounded by the capacity. Hence, a controller minimizing the mean-payoff must obey this restriction. In this paper we study the controller synthesis problem for consumption systems with a finite battery capacity, where the task of the controller is to minimize the mean-payoff while preserving the functionality of the system encoded by a given linear-time property. We show that an optimal controller always exists, and it may either need only finite memory or require infinite memory (it is decidable in polynomial time which of the two cases holds). Further, we show how to compute an effective description of an optimal controller in polynomial time. Finally, we consider the limit values achievable by larger and larger battery capacity, show that these values are computable in polynomial time, and we also analyze the corresponding rate of convergence. To the best of our knowledge, these are the first results about optimizing the long-run running costs in systems with bounded energy stores.", "citation": "Citations (2)", "year": "2014", "departments": ["Masaryk University", "Masaryk University", "Masaryk University", "Masaryk University"], "conf": "cav", "authors": ["Tomás Brázdil.....http://dblp.org/pers/hd/b/Br=aacute=zdil:Tom=aacute=s", "David Klaska.....http://dblp.org/pers/hd/k/Klaska:David", "Antonín Kucera.....http://dblp.org/pers/hd/k/Kucera:Anton=iacute=n", "Petr Novotný.....http://dblp.org/pers/hd/n/Novotn=yacute=_0001:Petr"], "pages": 16}