{"title": "VidWiki: enabling the crowd to improve the legibility of online educational videos.", "fields": ["legibility", "handwriting", "massive open online course", "collaborative editing", "overlay"], "abstract": "Videos are becoming an increasingly popular medium for communicating information, especially for online education. Recent efforts by organizations like Coursera, edX, Udacity and Khan Academy have produced thousands of educational videos with hundreds of millions of views in their attempt to make high quality teaching available to the masses. As a medium, videos are time-consuming to produce and cannot be easily modified after release. As a result, errors or problems with legibility are common. While text-based information platforms like Wikipedia have benefitted enormously from crowdsourced contributions for the creation and improvement of content, the various limitations of video hinder the collaborative editing and improvement of educational videos. To address this issue, we present VidWiki, an online platform that enables students to iteratively improve the presentation quality and content of educational videos. Through the platform, users can improve the legibility of handwriting, correct errors, or translate text in videos by overlaying typeset content such as text, shapes, equations, or images. We conducted a small user study in which 13 novice users annotated and revised Khan Academy videos. Our results suggest that with only a small investment of time on the part of viewers, it may be possible to make meaningful improvements in online educational videos.", "citation": "Citations (21)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Andrew Cross.....http://dblp.org/pers/hd/c/Cross:Andrew", "Mydhili Bayyapunedi.....http://dblp.org/pers/hd/b/Bayyapunedi:Mydhili", "Dilip Ravindran.....http://dblp.org/pers/hd/r/Ravindran:Dilip", "Edward Cutrell.....http://dblp.org/pers/hd/c/Cutrell:Edward", "William Thies.....http://dblp.org/pers/hd/t/Thies:William"], "conf": "cscw", "year": "2014", "pages": 9}