{"title": "OAuth Demystified for Mobile Application Developers.", "fields": ["same origin policy", "implementation", "android", "swift", "authorization"], "abstract": "OAuth has become a highly influential protocol due to its swift and wide adoption in the industry. The initial objective of the protocol was specific: it serves the authorization needs for websites. What motivates our work is the realization that the protocol has been significantly re-purposed and re-targeted over the years: (1) all major identity providers, e.g., Facebook, Google and Microsoft, have re-purposed OAuth for user authentication; (2) developers have re-targeted OAuth to the mobile platforms, in addition to the traditional web platform. Therefore, we believe that it is necessary and timely to conduct an in-depth study to demystify OAuth for mobile application developers. Our work consists of two pillars: (1) an in-house study of the OAuth protocol documentation that aims to identify what might be ambiguous or unspecified for mobile developers; (2) a field-study of over 600 popular mobile applications that highlights how well developers fulfill the authentication and authorization goals in practice. The result is really worrisome: among the 149 applications that use OAuth, 89 of them (59.7%) were incorrectly implemented and thus vulnerable. In the paper, we pinpoint the key portions in each OAuth protocol flow that are security critical, but are confusing or unspecified for mobile application developers. We then show several representative cases to concretely explain how real implementations fell into these pitfalls. Our findings have been communicated to vendors of the vulnerable applications. Most vendors positively confirmed the issues, and some have applied fixes. We summarize lessons learned from the study, hoping to provoke further thoughts about clear guidelines for OAuth usage in mobile applications.", "citation": "Citations (99)", "year": "2014", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Microsoft", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "ccs", "authors": ["Eric Y. Chen.....http://dblp.org/pers/hd/c/Chen:Eric_Y=", "Yutong Pei.....http://dblp.org/pers/hd/p/Pei:Yutong", "Shuo Chen.....http://dblp.org/pers/hd/c/Chen_0001:Shuo", "Yuan Tian.....http://dblp.org/pers/hd/t/Tian_0001:Yuan", "Robert Kotcher.....http://dblp.org/pers/hd/k/Kotcher:Robert", "Patrick Tague.....http://dblp.org/pers/hd/t/Tague:Patrick"], "pages": 12}