{"title": "Multi-objective data placement for multi-cloud socially aware services.", "fields": ["service quality", "carbon footprint", "cut", "data access", "interconnection"], "abstract": "Socially aware services often have a large user base and data of users have to be partitioned and replicated over multiple geographically distributed clouds. Choosing in which cloud to place data, however, is difficult. Effective data placements entail meeting multiple system objectives, including reducing the usage of cloud resources, providing good service quality to users, and even minimizing the carbon footprint, while facing critical challenges such as the interconnection of social data, the conflicting requirements of different objectives, and the customized multi-cloud data access policies. In this paper, we study multi-objective optimization for plac- ing users' data over multiple clouds for socially aware services. We build a model framework that can accommodate a range of different objectives, and based on this model we formulate the optimization problem. Leveraging graph cuts, we propose an optimization approach that decomposes our original problem into two simpler subproblems and solves them alternately in multiple rounds. We carry out evaluations using a large group of real- world geographically distributed users with realistic interactions, and place users' data over 10 clouds all across the US. We demonstrate results that are significantly superior to standard and de facto methods in all objectives, and also show that our approach is capable of exploring trade-offs among objectives, converges fast and scales to a huge user base.", "citation": "Citations (57)", "departments": ["University of Göttingen", "University of Göttingen", "University of Göttingen", "University of Oregon"], "authors": ["Lei Jiao.....http://dblp.org/pers/hd/j/Jiao:Lei", "Jun Li.....http://dblp.org/pers/hd/l/Li_0001:Jun", "Wei Du.....http://dblp.org/pers/hd/d/Du:Wei", "Xiaoming Fu.....http://dblp.org/pers/hd/f/Fu_0001:Xiaoming"], "conf": "infocom", "year": "2014", "pages": 9}