{"title": "Black-box non-black-box zero knowledge.", "fields": ["commit", "zero knowledge proof", "merkle tree", "witness", "string"], "abstract": "Motivated by theoretical and practical interest, the challenging task of designing cryptographic protocols having only black-box access to primitives has generated various breakthroughs in the last decade. Despite such positive results, even though nowadays we know black-box constructions for secure two-party and multi-party computation even in constant rounds, there still are in Cryptography several constructions that critically require non-black-box use of primitives in order to securely realize some fundamental tasks. As such, the study of the gap between black-box and nonblack-box constructions still includes major open questions.   In this work we make progress towards filling the above gap. We consider the case of black-box constructions for computations requiring that even the  size  of the input of a player remains hidden. We show how to commit to a string of arbitrary size and to prove statements over the bits of the string. Both the commitment and the proof are succinct, hide the input size and use standard primitives in a blackbox way. We achieve such a result by giving a black-box construction of an  extendable  Merkle tree that relies on a novel use of the \"MPC in the head\" paradigm of Ishai et al. [STOC 2007].   We show the power of our new techniques by giving the first black-box constant-round public-coin zero knowledge argument for NP. To achieve this result we use the nonblack-box simulation technique introduced by Barak [FOCS 2001], the PCP of Proximity introduced by Ben-Sasson et al. [STOC 2004], together with a black-box public-coin witness indistinguishable universal argument that we construct along the way.", "citation": "Citations (12)", "year": "2014", "departments": ["Microsoft", "University of California, Los Angeles", "University of California, Los Angeles", "University of Salerno"], "conf": "stoc", "authors": ["Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Rafail Ostrovsky.....http://dblp.org/pers/hd/o/Ostrovsky:Rafail", "Alessandra Scafuro.....http://dblp.org/pers/hd/s/Scafuro:Alessandra", "Ivan Visconti.....http://dblp.org/pers/hd/v/Visconti:Ivan"], "pages": 10}