{"title": "Factorized sparse learning models with interpretable high order feature interactions.", "fields": ["oracle", "discriminative model", "pairwise comparison", "generalized linear model", "sparse approximation"], "abstract": "Identifying interpretable discriminative high-order feature interactions given limited training data in high dimensions is challenging in both machine learning and data mining. In this paper, we propose a factorization based sparse learning framework termed FHIM for identifying high-order feature interactions in linear and logistic regression models, and study several optimization methods for solving them. Unlike previous sparse learning methods, our model FHIM recovers both the main effects and the interaction terms accurately without imposing tree-structured hierarchical constraints. Furthermore, we show that FHIM has oracle properties when extended to generalized linear regression models with pairwise interactions. Experiments on simulated data show that FHIM outperforms the state-of-the-art sparse lear-ning techniques. Further experiments on our experimentally generated data from patient blood samples using a novel SOMAmer (Slow Off-rate Modified Aptamer) technology show that, FHIM performs blood-based cancer diagnosis and bio-marker discovery for Renal Cell Carcinoma much better than other competing methods, and it identifies interpretable block-wise high-order gene interactions predictive of cancer stages of samples. A literature survey shows that the interactions identified by FHIM play important roles in cancer development.", "citation": "Citations (3)", "departments": ["University of Southern California", "Princeton University", "University of Southern California", "SomaLogic, Inc. ... oulder, CO, USA"], "authors": ["Sanjay Purushotham.....http://dblp.org/pers/hd/p/Purushotham:Sanjay", "Martin Renqiang Min.....http://dblp.org/pers/hd/m/Min:Martin_Renqiang", "C.-C. Jay Kuo.....http://dblp.org/pers/hd/k/Kuo:C==C=_Jay", "Rachel Ostroff.....http://dblp.org/pers/hd/o/Ostroff:Rachel"], "conf": "kdd", "year": "2014", "pages": 10}