{"title": "Exploring Inter-feature and Inter-class Relationships with Deep Neural Networks for Video Classification.", "fields": ["exploit", "computer vision", "artificial neural network", "semantics", "machine learning"], "abstract": "Videos contain very rich semantics and are intrinsically multimodal. In this paper, we study the challenging task of classifying videos according to their high-level semantics such as human actions or complex events. Although extensive efforts have been paid to study this problem, most existing works combined multiple features using simple fusion strategies and neglected the exploration of inter-class semantic relationships. In this paper, we propose a novel unified framework that jointly learns feature relationships and exploits the class relationships for improved video classification performance. Specifically, these two types of relationships are learned and utilized by rigorously imposing regularizations in a deep neural network (DNN). Such a regularized DNN can be efficiently launched using a GPU implementation with an affordable training cost. Through arming the DNN with better capability of exploring both the inter-feature and the inter-class relationships, the proposed regularized DNN is more suitable for identifying video semantics. With extensive experimental evaluations, we demonstrate that the proposed framework exhibits superior performance over several state-of-the-art approaches. On the well-known Hollywood2 and Columbia Consumer Video benchmarks, we obtain to-date the best reported results: 65.7% and 70.6% respectively in terms of mean average precision.", "citation": "Citations (75)", "departments": ["Fudan University", "Fudan University", "Alibaba Group", "Fudan University", "Fudan University"], "authors": ["Zuxuan Wu.....http://dblp.org/pers/hd/w/Wu:Zuxuan", "Yu-Gang Jiang.....http://dblp.org/pers/hd/j/Jiang:Yu=Gang", "Jun Wang.....http://dblp.org/pers/hd/w/Wang:Jun", "Jian Pu.....http://dblp.org/pers/hd/p/Pu:Jian", "Xiangyang Xue.....http://dblp.org/pers/hd/x/Xue:Xiangyang"], "conf": "mm", "year": "2014", "pages": 10}