{"title": "Caiipa: automated large-scale mobile app testing through contextual fuzzing.", "fields": ["cloud computing", "fuzz testing", "wireless network", "scalability", "automation"], "abstract": "Scalable and comprehensive testing of mobile apps is extremely challenging. Every test input needs to be run with a variety of  contexts , such as: device heterogeneity, wireless network speeds, locations, and unpredictable sensor inputs. The range of values for each context, e.g. location, can be very large. In this paper we present  Caiipa , a cloud service for testing apps over an expanded mobile context space in a scalable way. It incorporates key techniques to make app testing more tractable, including a context test space prioritizer to quickly discover failure scenarios for each app. We have implemented Caiipa on a cluster of VMs and real devices that can each emulate various combinations of contexts for tablet and phone apps. We evaluate Caiipa by testing 265 commercially available mobile apps based on a comprehensive library of real-world conditions. Our results show that Caiipa leads to improvements of 11.1x and 8.4x in the number of crashes and performance bugs discovered compared to conventional UI-based automation (i.e., monkey-testing).", "citation": "Citations (58)", "departments": ["Microsoft", "Microsoft", "Delft University of Technology", "University of Science and Technology, Sana'a", "Microsoft"], "authors": ["Chieh-Jan Mike Liang.....http://dblp.org/pers/hd/l/Liang:Chieh=Jan_Mike", "Nicholas D. Lane.....http://dblp.org/pers/hd/l/Lane:Nicholas_D=", "Niels Brouwers.....http://dblp.org/pers/hd/b/Brouwers:Niels", "Li Zhang.....http://dblp.org/pers/hd/z/Zhang:Li", "Börje F. Karlsson.....http://dblp.org/pers/hd/k/Karlsson:B=ouml=rje_F=", "Hao Liu.....http://dblp.org/pers/hd/l/Liu:Hao", "Yan Liu.....http://dblp.org/pers/hd/l/Liu:Yan", "Jun Tang.....http://dblp.org/pers/hd/t/Tang:Jun", "Xiang Shan.....http://dblp.org/pers/hd/s/Shan:Xiang", "Ranveer Chandra.....http://dblp.org/pers/hd/c/Chandra:Ranveer", "Feng Zhao.....http://dblp.org/pers/hd/z/Zhao_0001:Feng"], "conf": "mobicom", "year": "2014", "pages": 12}