{"title": "Optimal collaborative access point association in wireless networks.", "fields": ["wireless lan controller", "wireless distribution system", "capwap", "wireless intrusion prevention system", "wi fi array"], "abstract": "The popularity of wireless local area networks has led to a dramatic increase in the density of access points, especially in urban areas. These access points are individually owned, placed, and power-tuned for their local users and are generally oblivious to others. On the other hand, the abundance of access points that mostly share the same upstream provider, offers opportunities for optimization of association to mitigate the negative impact of the overlapped coverage. We use this opportunity to enable collaboration by using a share of each access point's bandwidth to serve non-local users and gain access to their bandwidth in return. We extend the conventional proportional fair association through sharing and collaboration among individual networks, and present centrally optimized solutions. Our performance evaluation, based on data traces col- lected in 100 residential locations, demonstrate the superiority of our solution, outperforming the throughput of non-collaborative optimal access by up to 140% 1 . I. INTRODUCTION The popularity of wireless local area networks for home internet access has led to a dramatic increase in the density of access points, especially in urban areas. While a user is connecting to an access point, other access points may be active within its receiving or sensing range. Unfortunately, many of these access points operate on the same channel, given the limited number of orthogonal channels in 802.11 wireless networks. This results in higher interference, higher", "citation": "Citations (19)", "year": "2014", "departments": ["Simon Fraser University", "Simon Fraser University", "Princeton University"], "conf": "infocom", "authors": ["Ouldooz Baghban Karimi.....http://dblp.org/pers/hd/k/Karimi:Ouldooz_Baghban", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Jennifer Rexford.....http://dblp.org/pers/hd/r/Rexford:Jennifer"], "pages": 9}