{"title": "Exploiting group recommendation functions for flexible preferences.", "fields": ["approximation algorithm", "hamming distance", "voting", "robustness", "semantics"], "abstract": "We examine the problem of enabling the flexibility of updating one's preferences in group recommendation. In our setting, any group member can provide a vector of preferences that, in addition to past preferences and other group members' preferences, will be accounted for in computing group recommendation. This functionality is essential in many group recommendation applications, such as travel planning, online games, book clubs, or strategic voting, as it has been previously shown that user preferences may vary depending on mood, context, and company (i.e., other people in the group). Preferences are enforced in an feedback box that replaces preferences provided by the users by a potentially different feedback vector that is better suited for maximizing the individual satisfaction when computing the group recommendation. The feedback box interacts with a traditional recommendation box that implements a group consensus semantics in the form of Aggregated Voting or Least Misery, two popular aggregation functions for group recommendation. We develop efficient algorithms to compute robust group recommendations that are appropriate in situations where users have changing preferences. Our extensive empirical study on real world data-sets validates our findings.", "citation": "Citations (14)", "departments": ["University of Washington", "University of Texas at Arlington", "Centre national de la recherche scientifique", "University of Texas at Arlington", "Google"], "authors": ["Senjuti Basu Roy.....http://dblp.org/pers/hd/r/Roy:Senjuti_Basu", "Saravanan Thirumuruganathan.....http://dblp.org/pers/hd/t/Thirumuruganathan:Saravanan", "Sihem Amer-Yahia.....http://dblp.org/pers/hd/a/Amer=Yahia:Sihem", "Gautam Das.....http://dblp.org/pers/hd/d/Das_0001:Gautam", "Cong Yu.....http://dblp.org/pers/hd/y/Yu_0001:Cong"], "conf": "icde", "year": "2014", "pages": 12}