{"title": "Perception-Guided Multimodal Feature Fusion for Photo Aesthetics Assessment.", "fields": ["fusion", "supervised learning", "probabilistic logic", "sensory cue", "perception"], "abstract": "Photo aesthetic quality evaluation is a challenging task in multimedia and computer vision fields. Conventional approaches suffer from the following three drawbacks: 1) the deemphasized role of semantic content that is many times more important than low-level visual features in photo aesthetics; 2) the difficulty to optimally fuse low-level and high-level visual cues in photo aesthetics evaluation; and 3) the absence of a sequential viewing path in the existing models, as humans perceive visually salient regions sequentially when viewing a photo.    To solve these problems, we propose a new aesthetic descriptor that mimics humans sequentially perceiving visually/semantically salient regions in a photo. In particular, a weakly supervised learning paradigm is developed to project the local aesthetic descriptors (graphlets in this work) into a low-dimensional semantic space. Thereafter, each graphlet can be described by multiple types of visual features, both at low-level and in high-level. Since humans usually perceive only a few salient regions in a photo, a sparsity-constrained graphlet ranking algorithm is proposed that seamlessly integrates both the low-level and the high-level visual cues. Top-ranked graphlets are those visually/semantically prominent graphlets in a photo. They are sequentially linked into a path that simulates the process of humans actively viewing. Finally, we learn a probabilistic aesthetic measure based on such actively viewing paths (AVPs) from the training photos that are marked as aesthetically pleasing by multiple users. Experimental results show that: 1) the AVPs are 87.65% consistent with real human gaze shifting paths, as verified by the eye-tracking data; and 2) our photo aesthetic measure outperforms many of its competitors.", "citation": "Citations (20)", "departments": ["National University of Singapore", "National University of Singapore", "University of Illinois at Urbana–Champaign", "National University of Singapore", "University of Texas at San Antonio"], "authors": ["Luming Zhang.....http://dblp.org/pers/hd/z/Zhang:Luming", "Yue Gao.....http://dblp.org/pers/hd/g/Gao:Yue", "Chao Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao", "Hanwang Zhang.....http://dblp.org/pers/hd/z/Zhang:Hanwang", "Qi Tian.....http://dblp.org/pers/hd/t/Tian_0001:Qi", "Roger Zimmermann.....http://dblp.org/pers/hd/z/Zimmermann:Roger"], "conf": "mm", "year": "2014", "pages": 10}