{"title": "Fashion Parsing with Video Context.", "fields": ["pose", "scale invariant feature transform", "active learning", "multimedia", "scalability", "parsing", "icon"], "abstract": "In this paper, we explore how to utilize the video context to facilitate fashion parsing. Instead of annotating a large amount of fashion images, we present a general, affordable and scalable solution, which harnesses the rich contexts in easily available fashion videos to boost any existing fashion parser. First, we crawl a large unlabelled fashion video corpus with fashion frames. Then for each fashion video, the cross-frame contexts are utilized for human pose co-estimation, and then video co-parsing to obtain satisfactory fashion parsing results for all frames. More specifically, Sift Flow and super-pixel matching are used to build correspondences across frames, and these correspondences then con- textualize the pose estimations and fashion parsing in individual frames. Finally, these parsed video frames are used as the reference corpus for the non-parametric fashion parsing component of the whole solution. Extensive experiments on two benchmark fashion datasets as well as a newly collected challenging Fashion Icon (FI) dataset demonstrate the encouraging performance gain from our general pipeline for fashion parsing.", "citation": "Citations (17)", "departments": ["National University of Singapore", "Sun Yat-sen University", "National University of Singapore", "Chinese Academy of Sciences", "Sun Yat-sen University", "National University of Singapore", "Sun Yat-sen University", "National University of Singapore", "Chinese Academy of Sciences", "Sun Yat-sen University"], "authors": ["Si Liu.....http://dblp.org/pers/hd/l/Liu_0001:Si", "Xiaodan Liang.....http://dblp.org/pers/hd/l/Liang:Xiaodan", "Luoqi Liu.....http://dblp.org/pers/hd/l/Liu:Luoqi", "Ke Lu.....http://dblp.org/pers/hd/l/Lu:Ke", "Liang Lin.....http://dblp.org/pers/hd/l/Lin:Liang", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "mm", "year": "2014", "pages": 10}