{"title": "Let's stay together: Towards traffic aware virtual machine placement in data centers.", "fields": ["data center", "approximation algorithm", "subset sum problem", "virtual machine", "greedy algorithm"], "abstract": "As tenants take networked virtual machines (VMs) as their requirements, effective placement of VMs is needed to reduce the network cost in cloud data centers. The cost is one of the major concerns for the cloud providers. In addition to the cost caused by network traffics (N-cost), the cost caused by the utilization of physical machines (PM-cost) is also non-negligible. In this paper, we focus on the optimized placement of VMs to minimize the cost, the combination of N-cost and PM-cost. We define N-cost by various functions, according to different communication models. We formulate the placement problem, and prove it to be NP-hard. We investigate the problem from two aspects. Firstly, we put a special emphasis on minimizing the N- cost with fixed PM-cost. For the case that tenants request the same amount of VMs, we present optimal algorithms under various definitions of N-cost. For the case that tenants require different numbers of VMs, we propose an approximation algorithm. Also, a greedy algorithm is implemented as the baseline to evaluate the performance. Secondly, we study the general case of the VM placement problem, in which both N-cost and PM-cost are taken into account. We present an effective binary-search- based algorithm to determine how many PMs should be used, which makes a tradeoff between PM-cost and N-cost. For all of the algorithms, we conduct theoretical analysis and extensive simulations to evaluate their performance and efficiency.", "citation": "Citations (99)", "year": "2014", "departments": ["Nanjing University", "Temple University", "Temple University", "Nanjing University"], "conf": "infocom", "authors": ["Xin Li.....http://dblp.org/pers/hd/l/Li_0017:Xin", "Jie Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jie", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Sanglu Lu.....http://dblp.org/pers/hd/l/Lu:Sanglu"], "pages": 9}