{"title": "Continuous fragmented skylines over distributed streams.", "fields": ["data set", "skyline", "streams", "distributed database", "distributed object"], "abstract": "Distributed skyline computation is important for a wide range of application domains, from distributed and web-based systems to ISP-network monitoring and distributed databases. The problem is particularly challenging in dynamic distributed settings, where the goal is to efficiently monitor a continuous skyline query over a collection of distributed streams. All existing work relies on the assumption of a single point of reference for object attributes/dimensions, i.e., objects may be vertically or horizontally partitioned, but the accurate value of each dimension for each object is always maintained by a single site. This assumption is unrealistic for several distributed monitoring applications, where object information is fragmented over a set of distributed streams (each monitored by a different site) and needs to be aggregated (e.g., averaged) across several sites. Furthermore, it is frequently useful to define skyline dimensions through complex functions over the aggregated objects, which raises further challenges for dealing with object fragmentation. In this paper, we present the first known distributed approach for continuous fragmented skylines, namely distributed monitoring of skylines over complex functions of fragmented multi-dimensional objects. We also propose several optimizations, including a new technique based on random-walk models for adaptively determining the most efficient monitoring strategy for each object. A thorough experimental study with synthetic and real-life data sets verifies the effectiveness of our approach, demonstrating order-of-magnitude improvements in communication costs compared to the only available centralized solution.", "citation": "Citations (14)", "departments": ["Technical University of Crete", "Technical University of Crete"], "authors": ["Odysseas Papapetrou.....http://dblp.org/pers/hd/p/Papapetrou:Odysseas", "Minos N. Garofalakis.....http://dblp.org/pers/hd/g/Garofalakis:Minos_N="], "conf": "icde", "year": "2014", "pages": 12}