{"title": "On Model Parallelization and Scheduling Strategies for Distributed Machine Learning.", "fields": ["implementation", "matrix decomposition", "correctness", "topic model", "lasso"], "abstract": "Distributed machine learning has typically been approached from a data parallel perspective, where big data are partitioned to multiple workers and an algorithm is executed concurrently over different data subsets under various synchronization schemes to ensure speed-up and/or correctness. A sibling problem that has received relatively less attention is how to ensure efficient and correct model parallel execution of ML algorithms, where parameters of an ML program are partitioned to different workers and undergone concurrent iterative updates. We argue that model and data parallelisms impose rather different challenges for system design, algorithmic adjustment, and theoretical analysis. In this paper, we develop a system for model-parallelism, STRADS, that provides a programming abstraction for scheduling parameter updates by discovering and leveraging changing structural properties of ML programs. STRADS enables a flexible tradeoff between scheduling efficiency and fidelity to intrinsic dependencies within the models, and improves memory efficiency of distributed ML. We demonstrate the efficacy of model-parallel algorithms implemented on STRADS versus popular implementations for topic modeling, matrix factorization, and Lasso.", "citation": "Citations (20)", "year": "2014", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Agency for Science, Technology and Research", "Carnegie Mellon University"], "conf": "nips", "authors": ["Seunghak Lee.....http://dblp.org/pers/hd/l/Lee:Seunghak", "Jin Kyu Kim.....http://dblp.org/pers/hd/k/Kim:Jin_Kyu", "Xun Zheng.....http://dblp.org/pers/hd/z/Zheng:Xun", "Qirong Ho.....http://dblp.org/pers/hd/h/Ho:Qirong", "Garth A. Gibson.....http://dblp.org/pers/hd/g/Gibson:Garth_A=", "Eric P. Xing.....http://dblp.org/pers/hd/x/Xing:Eric_P="], "pages": 9}