{"title": "Backdoors into Heterogeneous Classes of SAT and CSP.", "fields": ["homogeneous", "backdoor", "constraint satisfaction", "parameterized complexity", "exponential function"], "abstract": "Backdoor sets represent clever reasoning shortcuts through the search space for SAT and CSP. By instantiating the backdoor variables one reduces the given instance to several easy instances that belong to a tractable class. The overall time needed to solve the instance is exponential in the size of the backdoor set, hence it is a challenging problem to find a small backdoor set if one exists; over the last years this problem has been subject of intensive research.\n\nIn this paper we extend the classical notion of a strong backdoor set by allowing that different instantiations of the backdoor variables result in instances that belong to different base classes; the union of the base classes forms a heterogeneous base class. Backdoor sets to heterogeneous base classes can be much smaller than backdoor sets to homogeneous ones, hence they are much more desirable but possibly harder to find.\n\nWe draw a detailed complexity landscape for the problem of detecting strong backdoor sets into heterogeneous base classes for SAT and CSP. We provide algorithms that establish fixedparameter tractability under natural parameterizations, and we contrast the tractability results with hardness results that pinpoint the theoretical limits.\n\nOur results apply to the current state-of-the-art of tractable classes of CSP and SAT that are definable by restricting the constraint language.", "citation": "Citations (7)", "departments": ["NICTA", "Indian Institute of Science", "Masaryk University", "Vienna University of Technology", "University of Oxford"], "authors": ["Serge Gaspers.....http://dblp.org/pers/hd/g/Gaspers:Serge", "Neeldhara Misra.....http://dblp.org/pers/hd/m/Misra:Neeldhara", "Sebastian Ordyniak.....http://dblp.org/pers/hd/o/Ordyniak:Sebastian", "Stefan Szeider.....http://dblp.org/pers/hd/s/Szeider:Stefan", "Stanislav Zivny.....http://dblp.org/pers/hd/z/Zivny:Stanislav"], "conf": "aaai", "year": "2014", "pages": 7}