{"title": "Reminiscence Therapy using Image-Based Rendering in VR.", "fields": ["rendering", "reminiscence therapy", "image based modeling and rendering", "autobiographical memory", "fluency"], "abstract": "We present a novel VR solution for Reminiscence Therapy (RT), developed jointly by a group of memory clinicians and computer scientists. RT involves the discussion of past activities, events or experiences with others, often with the aid of tangible props which are familiar items from the past; it is a popular intervention in dementia care. We introduce an immersive VR system designed for RT, which allows easy presentation of familiar environments. In particular, our system supports highly-realistic Image-Based Rendering in an immersive setting. To evaluate the effectiveness and utility of our system for RT, we perform a study with healthy elderly participants to test if our VR system can help with the generation of autobiographical memories. We adapt a verbal Autobiographical Fluency protocol to our VR context, in which elderly participants are asked to generate memories based on images they are shown. We compare the use of our image-based system for an unknown and a familiar environment. The results of our study show that the number of memories generated for a familiar environment is higher than that for an unknown environment using our system. This indicates that IBR can convey familiarity of a given scene, which is an essential requirement for the use of VR in RT. Our results also show that our system is as effective as traditional RT protocols, while acceptability and motivation scores demonstrate that our system is well tolerated by elderly participants.", "citation": "Citations (4)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "CMRR Nice", "CMRR Nice"], "authors": ["Emmanuelle Chapoulie.....http://dblp.org/pers/hd/c/Chapoulie:Emmanuelle", "Rachid Guerchouche.....http://dblp.org/pers/hd/g/Guerchouche:Rachid", "Pierre-David Petit.....http://dblp.org/pers/hd/p/Petit:Pierre=David", "Gaurav Chaurasia.....http://dblp.org/pers/hd/c/Chaurasia:Gaurav", "Philippe Robert.....http://dblp.org/pers/hd/r/Robert:Philippe", "George Drettakis.....http://dblp.org/pers/hd/d/Drettakis:George"], "conf": "vr", "year": "2014", "pages": 6}