{"title": "Towards zero-time wakeup of line cards in power-aware routers.", "fields": ["enhanced interior gateway routing protocol", "routing domain", "line card", "static routing", "routing table", "hierarchical routing", "idle", "longest prefix match", "download", "networking hardware"], "abstract": "As the network infrastructure has been consuming more and more power, various schemes have been proposed to improve the power efficiency of network devices. Many schemes put links to sleep when idle and wake them up when needed. A presumption in these schemes, though, is that router's line cards can be waken up very quickly. However, through systematic measurement of a major vendor's high-end routers, we find that it takes minutes to get a line card ready under the current design. To address this issue, we propose a new line card design that 1) keeps the host processor in a line card standby, which only consumes a small fraction of power but will save considerable wakeup time, and 2) downloads a slim slot of popular prefixes with higher priority, so that the line card will be ready for forwarding most of the traffic much earlier. We design algorithms as well as architecture that ensure fast and correct longest prefix match during prioritized routing prefix download. Experiments on an FPGA-based prototype show that the customized hardware can be ready to forward packets in 127.27 ms, which is 0.3% of the time the original design takes. This can better support numerous power-saving schemes based on the sleep/wakeup mechanism.", "citation": "Citations (4)", "departments": ["Tsinghua University", "Tsinghua University", "University of Arizona", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "University of Arizona", "Tsinghua University", "Tsinghua University"], "authors": ["Tian Pan.....http://dblp.org/pers/hd/p/Pan:Tian", "Ting Zhang.....http://dblp.org/pers/hd/z/Zhang:Ting", "Junxiao Shi.....http://dblp.org/pers/hd/s/Shi:Junxiao", "Yang Li.....http://dblp.org/pers/hd/l/Li:Yang", "Linxiao Jin.....http://dblp.org/pers/hd/j/Jin:Linxiao", "Fuliang Li.....http://dblp.org/pers/hd/l/Li:Fuliang", "Jiahai Yang.....http://dblp.org/pers/hd/y/Yang:Jiahai", "Beichuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Beichuan", "Bin Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bin"], "conf": "infocom", "year": "2014", "pages": 9}