{"title": "Reachability queries on large dynamic graphs: a total order approach.", "fields": ["search engine indexing", "scratch", "semantic web", "vertex", "reachability"], "abstract": "Reachability queries are a fundamental type of queries on graphs that find important applications in numerous domains. Although a plethora of techniques have been proposed for reachability queries, most of them require that the input graph is  static , i.e., they are inapplicable to the {\\em dynamic} graphs (e.g., social networks and the Semantic Web) commonly encountered in practice. There exist a few techniques that can handle dynamic graphs, but none of them can scale to sizable graphs without significant loss of efficiency. To address this deficiency, this paper presents a novel study on reachability indices for  large dynamic graphs . We first introduce a general indexing framework that summarizes a family of reachability indices with the best performance among the existing techniques for static graphs. Then, we propose general and efficient algorithms for handling vertex insertions and deletions under the proposed framework. In addition, we show that our update algorithms can be used to improve the existing reachability techniques on static graphs, and we also propose a new approach for constructing a reachability index from scratch under our framework. We experimentally evaluate our solution on a large set of benchmark datasets, and we demonstrate that our solution not only supports efficient updates on dynamic graphs, but also provides even better query performance than the state-of-the-art techniques for  static  graphs.", "citation": "Citations (24)", "year": "2014", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "conf": "sigmod", "authors": ["Andy Diwen Zhu.....http://dblp.org/pers/hd/z/Zhu:Andy_Diwen", "Wenqing Lin.....http://dblp.org/pers/hd/l/Lin:Wenqing", "Sibo Wang.....http://dblp.org/pers/hd/w/Wang_0001:Sibo", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui"], "pages": 12}