{"title": "Understanding the Effects of Communication and Coordination on Checkpointing at Scale.", "fields": ["asynchrony", "psychological resilience", "overhead", "scalability", "programming paradigm"], "abstract": "Fault-tolerance poses a major challenge for future large-scale systems. Active research into coordinated, uncoordinated, and hybrid check pointing systems has explored how the introduction of asynchrony can address anticipated scalability issues. However, few insights into selection and tuning of these protocols for applications at scale have emerged. In this paper, we use a simulation-based approach to show that local checkpoint activity in resilience mechanisms can significantly affect the performance of key workloads, even when less than 1% of a local node's compute time is allocated to resilience mechanisms (a very generous assumption). Specifically, we show that even though much work on uncoordinated check pointing has focused on optimizing message log volumes, local check pointing activity may dominate the overheads of this technique at scale. Our study shows that local checkpoints lead to process delays that can propagate through messaging relations to other processes causing a cascading series of delays. We demonstrate how to tune hierarchical uncoordinated check pointing protocols designed to reduce log volumes to significantly reduce these synchronization overheads at scale. Our work provides a critical analysis and comparison of coordinated and uncoordinated check pointing and enables users and system administrators to fine-tune the check pointing scheme to the application and system characteristics.", "citation": "Citations (13)", "departments": ["Sandia National Laboratories", "Sandia National Laboratories", "University of New Mexico", "University of New Mexico", "ETH Zurich"], "authors": ["Kurt B. Ferreira.....http://dblp.org/pers/hd/f/Ferreira:Kurt_B=", "Patrick M. Widener.....http://dblp.org/pers/hd/w/Widener:Patrick_M=", "Scott Levy.....http://dblp.org/pers/hd/l/Levy:Scott", "Dorian C. Arnold.....http://dblp.org/pers/hd/a/Arnold:Dorian_C=", "Torsten Hoefler.....http://dblp.org/pers/hd/h/Hoefler:Torsten"], "conf": "sc", "year": "2014", "pages": 12}