{"title": "Dissecting On-Node Memory Access Performance: A Semantic Approach.", "fields": ["uniform memory access", "interleaved memory", "flat memory model", "memory map", "overlay"], "abstract": "Optimizing memory access is critical for performance and power efficiency. CPU manufacturers have developed sampling-based performance measurement units (PMUs) that report precise costs of memory accesses at specific addresses. However, this data is too low-level to be meaningfully interpreted and contains an excessive amount of irrelevant or uninteresting information.   We have developed a method to gather fine-grained memory access performance data for specific data objects and regions of code with low overhead and attribute semantic information to the sampled memory accesses. This information provides the context necessary to more effectively interpret the data. We have developed a tool that performs this sampling and attribution and used the tool to discover and diagnose performance problems in real-world applications. Our techniques provide useful insight into the memory behavior of applications and allow programmers to understand the performance ramifications of key design decisions: domain decomposition, multi-threading, and data motion within distributed memory systems.", "citation": "Citations (16)", "year": "2014", "departments": ["University of California, Davis", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "University of California, Davis"], "conf": "sc", "authors": ["Alfredo Giménez.....http://dblp.org/pers/hd/g/Gim=eacute=nez:Alfredo", "Todd Gamblin.....http://dblp.org/pers/hd/g/Gamblin:Todd", "Barry Rountree.....http://dblp.org/pers/hd/r/Rountree:Barry", "Abhinav Bhatele.....http://dblp.org/pers/hd/b/Bhatele:Abhinav", "Ilir Jusufi.....http://dblp.org/pers/hd/j/Jusufi:Ilir", "Peer-Timo Bremer.....http://dblp.org/pers/hd/b/Bremer:Peer=Timo", "Bernd Hamann.....http://dblp.org/pers/hd/h/Hamann:Bernd"], "pages": 11}