{"title": "POST: Exploiting dynamic sociality for mobile advertising in vehicular networks.", "fields": ["heuristics", "distributed computing", "social network analysis", "computer network", "vehicular ad hoc network", "computer science", "markov chain", "sociality"], "abstract": "Mobile advertising in vehicular networks is of great interest with which timely information can be fast spread into the network. Given a limited budget for hiring seed vehicles, how to achieve the maximum advertising coverage within a given period of time is NP-hard. In this paper, we propose an innovative scheme, POST, for mobile advertising in vehicular networks. The POST design is based on two key observations we have found by analyzing three large-scale vehicular traces. First, vehicles demonstrate dynamic sociality in the network; second, such vehicular sociality has strong temporal correlations. With the knowledge, POST uses Markov chains to infer future vehicular sociality and adopts two greedy heuristics to select the most “centric” vehicles as seeds for mobile advertising. Extensive simulations based on three real data sets of taxi and bus traces have been carried out. The results show that POST can greatly improve the coverage and the intensity of advertising. For all the three involved data sets, it achieves an average gain of 64 percent comparing with the state-of-art schemes.", "citation": "Citations (57)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Electronic Science and Technology of China", "Shanghai Jiao Tong University", "Univ. of Electr ...  Chengdu, China"], "authors": ["Jun Qin.....http://dblp.org/pers/hd/q/Qin:Jun", "Hongzi Zhu.....http://dblp.org/pers/hd/z/Zhu:Hongzi", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Li Lu.....http://dblp.org/pers/hd/l/Lu_0001:Li", "Guangtao Xue.....http://dblp.org/pers/hd/x/Xue:Guangtao", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu"], "conf": "infocom", "year": "2014", "pages": 9}