{"title": "GPUMech: GPU Performance Modeling Technique Based on Interval Analysis.", "fields": ["cache", "multithreading", "general purpose computing on graphics processing units", "speedup", "interval arithmetic"], "abstract": "GPU has become a first-order computing plat-form. Nonetheless, not many performance modeling techniques have been developed for architecture studies. Several GPU analytical performance models have been proposed, but they mostly target application optimizations rather than the study of different architecture design options. Interval analysis is a relatively accurate performance modeling technique, which traverses the instruction trace and uses functional simulators, e.g., Cache simulator, to track the stall events that cause performance loss. It shows hundred times of speedup compared to detailed timing simulations and better accuracy compared to pure analytical models. However, previous techniques are limited to CPUs and not applicable to multithreaded architectures. In this work, we propose GPU Mech, an interval analysis-based performance modeling technique for GPU architectures. GPU Mech models multithreading and resource contentions caused by memory divergence. We compare GPU Mech with a detailed timing simulator and show that on average, GPU Mechhas 13.2% error for modeling the round-robin scheduling policy and 14.0% error for modeling the greedy-then-oldest policy while achieving a 97x faster simulation speed. In addition, GPU Mech generates CPI stacks, which help hardware/software developers to visualize performance bottlenecks of a kernel.", "citation": "Citations (8)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Jen-Cheng Huang.....http://dblp.org/pers/hd/h/Huang:Jen=Cheng", "Joo Hwan Lee.....http://dblp.org/pers/hd/l/Lee:Joo_Hwan", "Hyesoon Kim.....http://dblp.org/pers/hd/k/Kim:Hyesoon", "Hsien-Hsin S. Lee.....http://dblp.org/pers/hd/l/Lee:Hsien=Hsin_S="], "conf": "micro", "year": "2014", "pages": 12}