{"title": "Abstract interpretation: past, present and future.", "fields": ["program transformation", "undecidable problem", "type inference", "abstract interpretation", "abstraction"], "abstract": "Abstract interpretation is a theory of abstraction and constructive approximation of the mathematical structures used in the formal description of complex or infinite systems and the inference or verification of their combinatorial or undecidable properties. Developed in the late seventies, it has been since then used, implicitly or explicitly, to many aspects of computer science (such as static analysis and verification, contract inference, type inference, termination inference, model-checking, abstraction/refinement, program transformation (including watermarking, obfuscation,  etc ), combination of decision procedures, security, malware detection, database queries,  etc ) and more recently, to system biology and SAT/SMT solvers. Production-quality verification tools based on abstract interpretation are available and used in the advanced software, hardware, transportation, communication, and medical industries.   The talk will consist in an introduction to the basic notions of abstract interpretation and the induced methodology for the systematic development of sound abstract interpretation-based tools. Examples of abstractions will be provided, from semantics to typing, grammars to safety, reachability to potential/definite termination, numerical to protein-protein abstractions, as well as applications (including those in industrial use) to software, hardware and system biology.   This paper is a general discussion of abstract interpretation, with selected publications, which unfortunately are far from exhaustive both in the considered themes and the corresponding references.", "citation": "Citations (13)", "departments": ["Centre national de la recherche scientifique", "CIMS, NYU"], "authors": ["Patrick Cousot.....http://dblp.org/pers/hd/c/Cousot:Patrick", "Radhia Cousot.....http://dblp.org/pers/hd/c/Cousot:Radhia"], "conf": "lics", "year": "2014", "pages": 10}