{"title": "Characterizing Large-Scale Click Fraud in ZeroAccess.", "fields": ["cybercrime", "malware", "zeroaccess botnet", "botnet", "click fraud"], "abstract": "Click fraud is a scam that hits a criminal sweet spot by both tapping into the vast wealth of online advertising and exploiting that ecosystem's complex structure to obfuscate the flow of money to its perpetrators. In this work, we illuminate the intricate nature of this activity through the lens of ZeroAccess--one of the largest click fraud botnets in operation. Using a broad range of data sources, including peer-to-peer measurements, command-and-control telemetry, and contemporaneous click data from one of the top ad networks, we construct a view into the scale and complexity of modern click fraud operations. By leveraging the dynamics associated with Microsoft's attempted takedown of ZeroAccess in December 2013, we employ this coordinated view to identify \"ad units\" whose traffic (and hence revenue) primarily derived from ZeroAccess. While it proves highly challenging to extrapolate from our direct observations to a truly global view, by anchoring our analysis in the data for these ad units we estimate that the botnet's fraudulent activities plausibly induced advertising losses on the order of $100,000 per day.", "citation": "Citations (15)", "year": "2014", "departments": ["International Computer Science Institute", "Microsoft", "University of California, Berkeley", "University of California, San Diego", "Microsoft"], "conf": "ccs", "authors": ["Paul Pearce.....http://dblp.org/pers/hd/p/Pearce:Paul", "Vacha Dave.....http://dblp.org/pers/hd/d/Dave:Vacha", "Chris Grier.....http://dblp.org/pers/hd/g/Grier:Chris", "Kirill Levchenko.....http://dblp.org/pers/hd/l/Levchenko:Kirill", "Saikat Guha.....http://dblp.org/pers/hd/g/Guha:Saikat", "Damon McCoy.....http://dblp.org/pers/hd/m/McCoy:Damon", "Vern Paxson.....http://dblp.org/pers/hd/p/Paxson:Vern", "Stefan Savage.....http://dblp.org/pers/hd/s/Savage:Stefan", "Geoffrey M. Voelker.....http://dblp.org/pers/hd/v/Voelker:Geoffrey_M="], "pages": 12}