{"title": "Hooked on smartphones: an exploratory study on smartphone overuse among college students.", "fields": ["exploratory research", "multimedia", "sleep deprivation", "usage data", "push technology"], "abstract": "The negative aspects of smartphone overuse on young adults, such as sleep deprivation and attention deficits, are being increasingly recognized recently. This emerging issue motivated us to analyze the usage patterns related to smartphone overuse. We investigate smartphone usage for 95 college students using surveys, logged data, and interviews. We first divide the participants into risk and non-risk groups based on self-reported rating scale for smartphone overuse. We then analyze the usage data to identify between-group usage differences, which ranged from the overall usage patterns to app-specific usage patterns. Compared with the non-risk group, our results show that the risk group has longer usage time per day and different diurnal usage patterns. Also, the risk group users are more susceptible to push notifications, and tend to consume more online content. We characterize the overall relationship between usage features and smartphone overuse using analytic modeling and provide detailed illustrations of problematic usage behaviors based on interview data.", "citation": "Citations (95)", "year": "2014", "departments": ["KAIST", "KAIST", "KAIST", "KAIST", "KAIST"], "conf": "chi", "authors": ["Uichin Lee.....http://dblp.org/pers/hd/l/Lee:Uichin", "Joonwon Lee.....http://dblp.org/pers/hd/l/Lee:Joonwon", "Minsam Ko.....http://dblp.org/pers/hd/k/Ko:Minsam", "Changhun Lee.....http://dblp.org/pers/hd/l/Lee:Changhun", "Yuhwan Kim.....http://dblp.org/pers/hd/k/Kim:Yuhwan", "Subin Yang.....http://dblp.org/pers/hd/y/Yang:Subin", "Koji Yatani.....http://dblp.org/pers/hd/y/Yatani:Koji", "Gahgene Gweon.....http://dblp.org/pers/hd/g/Gweon:Gahgene", "Kyong-Mee Chung.....http://dblp.org/pers/hd/c/Chung:Kyong=Mee", "Junehwa Song.....http://dblp.org/pers/hd/s/Song:Junehwa"], "pages": 10}