{"title": "A new Q(lambda) with interim forward view and Monte Carlo equivalence.", "fields": ["monte carlo method", "derivation", "equivalence", "reinforcement learning", "lambda"], "abstract": "Q-learning, the most popular of reinforcement learning algorithms, has always included an extension to eligibility traces to enable more rapid learning and improved asymptotic performance on non-Markov problems. The λ parameter smoothly shifts on-policy algorithms such as TD(λ) and Sarsa(λ) from a pure bootstrapping form (λ=0) to a pure Monte Carlo form (λ=1). In off-policy algorithms, including Q(λ), GQ(λ), and off-policy LSTD(λ), the λ parameter is intended to play the same role, but does not; on every exploratory action these algorithms bootstrap regardless of the value of λ, and as a result they fail to approximate Monte Carlo learning when λ = 1. It may seem that this is inevitable for any online off-policy algorithm; if updates are made on each step on which the target policy is followed, then how could just the right updates be 'un-made' upon deviation from the target policy? In this paper, we introduce a new version of Q(λ) that does exactly that, without significantly increased algorithmic complexity. En route to our new Q(λ), we introduce a new derivation technique based on the forward-view/backward-view analysis familiar from TD(λ) but extended to apply at every time step rather than only at the end of episodes. We apply this technique to derive first a new off-policy version of TD(λ), called PTD(λ), and then our new Q(λ), called PQ(λ).", "citation": "Citations (14)", "year": "2014", "departments": ["University of Alberta", "University of Alberta", "McGill University", "University of Alberta"], "conf": "icml", "authors": ["Richard S. Sutton.....http://dblp.org/pers/hd/s/Sutton:Richard_S=", "Ashique Rupam Mahmood.....http://dblp.org/pers/hd/m/Mahmood:Ashique_Rupam", "Doina Precup.....http://dblp.org/pers/hd/p/Precup:Doina", "Hado van Hasselt.....http://dblp.org/pers/hd/h/Hasselt:Hado_van"], "pages": 9}