{"title": "\"Sheldon speaking, Bonjour!\": Leveraging Multilingual Tracks for (Weakly) Supervised Speaker Identification.", "fields": ["voice activity detection", "speaker recognition", "speaker diarisation", "annotation", "source code"], "abstract": "We address the problem of speaker identification in multimedia data, and TV series in particular. While speaker identification is traditionally a supervised machine-learning task, our first contribution is to significantly reduce the need for costly preliminary manual annotations through the use of automatically aligned (and potentially noisy) fan-generated transcripts and subtitles.   We show that both speech activity detection and speech turn identification modules trained in this weakly supervised manner achieve similar performance as their fully supervised counterparts (i.e. relying on fine manual speech/non-speech/speaker annotation).   Our second contribution relates to the use of multilingual audio tracks usually available with this kind of content to significantly improve the overall speaker identification performance. Reproducible experiments (including dataset, manual annotations and source code) performed on the first six episodes of The Big Bang Theory TV series show that combining the French audio track (containing dubbed actor voices) with the English one (with the original actor voices) improves the overall English speaker identification performance by 5% absolute and up to 70% relative on the five main characters.", "citation": "Citations (2)", "departments": ["Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique"], "authors": ["Hervé Bredin.....http://dblp.org/pers/hd/b/Bredin:Herv=eacute=", "Anindya Roy.....http://dblp.org/pers/hd/r/Roy:Anindya", "Nicolas Pécheux.....http://dblp.org/pers/hd/p/P=eacute=cheux:Nicolas", "Alexandre Allauzen.....http://dblp.org/pers/hd/a/Allauzen:Alexandre"], "conf": "mm", "year": "2014", "pages": 10}