{"title": "Multivariate General Linear Models (MGLM) on Riemannian Manifolds with Applications to Statistical Analysis of Diffusion Weighted Images.", "fields": ["parametric model", "variables", "manifold", "generalized linear model", "parametric statistics"], "abstract": "Linear regression is a parametric model which is ubiquitous in scientific analysis. The classical setup where the observations and responses, i.e., (xi, yi) pairs, are Euclidean is well studied. The setting where yi is manifold valued is a topic of much interest, motivated by applications in shape analysis, topic modeling, and medical imaging. Recent work gives strategies for max-margin classifiers, principal components analysis, and dictionary learning on certain types of manifolds. For parametric regression specifically, results within the last year provide mechanisms to regress one real-valued parameter, xi e R, against a manifold-valued variable, yi e M. We seek to substantially extend the operating range of such methods by deriving schemes for multivariate multiple linear regression--a manifold-valued dependent variable against multiple independent variables, i.e., f: Rn → M. Our variational algorithm efficiently solves for multiple geodesic bases on the manifold concurrently via gradient updates. This allows us to answer questions such as: what is the relationship of the measurement at voxel y to disease when conditioned on age and gender. We show applications to statistical analysis of diffusion weighted images, which give rise to regression tasks on the manifold GL(n)/O(n) for diffusion tensor images (DTI) and the Hilbert unit sphere for orientation distribution functions (ODF) from high angular resolution acquisition. The companion open-source code is available on nitrc.org/projects/riem_mglm.", "citation": "Citations (18)", "year": "2014", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "conf": "cvpr", "authors": ["Hyunwoo J. Kim.....http://dblp.org/pers/hd/k/Kim:Hyunwoo_J=", "Barbara B. Bendlin.....http://dblp.org/pers/hd/b/Bendlin:Barbara_B=", "Nagesh Adluru.....http://dblp.org/pers/hd/a/Adluru:Nagesh", "Maxwell D. Collins.....http://dblp.org/pers/hd/c/Collins:Maxwell_D=", "Moo K. Chung.....http://dblp.org/pers/hd/c/Chung:Moo_K=", "Sterling C. Johnson.....http://dblp.org/pers/hd/j/Johnson:Sterling_C=", "Richard J. Davidson.....http://dblp.org/pers/hd/d/Davidson:Richard_J=", "Vikas Singh.....http://dblp.org/pers/hd/s/Singh:Vikas"], "pages": 8}