{"title": "Modular reasoning about heap paths via effectively propositional formulas.", "fields": ["binary heap", "transitive closure", "loop invariant", "separation logic", "functional verification"], "abstract": "First order logic with transitive closure, and separation logic enable elegant interactive verification of heap-manipulating programs. However, undecidabilty results and high asymptotic complexity of checking validity preclude complete automatic verification of such programs, even when loop invariants and procedure contracts are specified as formulas in these logics. This paper tackles the problem of procedure-modular verification of reachability properties of heap-manipulating programs using efficient decision procedures that are complete: that is, a SAT solver must generate a counterexample whenever a program does not satisfy its specification. By (a) requiring each procedure modifies a fixed set of heap partitions and creates a bounded amount of heap sharing, and (b) restricting program contracts and loop invariants to use only deterministic paths in the heap, we show that heap reachability updates can be described in a simple manner. The restrictions force program specifications and verification conditions to lie within a fragment of first-order logic with transitive closure that is reducible to effectively propositional logic, and hence facilitate sound, complete and efficient verification. We implemented a tool atop Z3 and report on preliminary experiments that establish the correctness of several programs that manipulate linked data structures.", "citation": "Citations (12)", "departments": ["Tel Aviv University", "IMDEA", "University of Massachusetts Amherst", "Tel Aviv University", "IMDEA"], "authors": ["Shachar Itzhaky.....http://dblp.org/pers/hd/i/Itzhaky:Shachar", "Anindya Banerjee.....http://dblp.org/pers/hd/b/Banerjee_0001:Anindya", "Neil Immerman.....http://dblp.org/pers/hd/i/Immerman:Neil", "Ori Lahav.....http://dblp.org/pers/hd/l/Lahav:Ori", "Aleksandar Nanevski.....http://dblp.org/pers/hd/n/Nanevski:Aleksandar", "Mooly Sagiv.....http://dblp.org/pers/hd/s/Sagiv:Mooly"], "conf": "popl", "year": "2014", "pages": 12}