{"title": "Scalable Gaussian Process Structured Prediction for Grid Factor Graph Applications.", "fields": ["ensemble learning", "conditional random field", "latent class model", "factor graph", "structured prediction"], "abstract": "Structured prediction is an important and well-studied problem with many applications across machine learning. GPstruct is a recently proposed structured prediction model that offers appealing properties such as being kernelised, non-parametric, and supporting Bayesian inference (Bratieres et al., 2013). The model places a Gaussian process prior over energy functions which describe relationships between input variables and structured output variables. However, the memory demand of GPstruct is quadratic in the number of latent variables and training runtime scales cubically. This prevents GPstruct from being applied to problems involving grid factor graphs, which are prevalent in computer vision and spatial statistics applications.\n\nHere we explore a scalable approach to learning GPstruct models based on ensemble learning, with weak learners (predictors) trained on subsets of the latent variables and bootstrap data, which can easily be distributed. We show experiments with 4M latent variables on image segmentation. Our method outperforms widely-used conditional random field models trained with pseudo-likelihood. Moreover, in image segmentation problems it improves over recent state-of-the-art marginal optimisation methods in terms of predictive performance and uncertainty calibration. Finally, it generalises well on all training set sizes.", "citation": "Citations (3)", "year": "2014", "departments": ["University of Cambridge", "University of Cambridge", "University of Sussex", "Microsoft", "University of Cambridge"], "conf": "icml", "authors": ["Sebastien Bratieres.....http://dblp.org/pers/hd/b/Bratieres:Sebastien", "Novi Quadrianto.....http://dblp.org/pers/hd/q/Quadrianto:Novi", "Sebastian Nowozin.....http://dblp.org/pers/hd/n/Nowozin:Sebastian", "Zoubin Ghahramani.....http://dblp.org/pers/hd/g/Ghahramani:Zoubin"], "pages": 9}