{"title": "Near-Optimal Joint Object Matching via Convex Relaxation.", "fields": ["data set", "regular polygon", "pairwise comparison", "compatibility", "graph"], "abstract": "Joint object matching aims at aggregating information from a large collection of similar instances (e.g. images, graphs, shapes) to improve the correspondences computed between pairs of objects, typically by exploiting global map compatibility. Despite some practical advances on this problem, from the theoretical point of view, the error-correction ability of existing algorithms are limited by a constant barrier -- none of them can provably recover the correct solution when more than a constant fraction of input correspondences are corrupted. Moreover, prior approaches focus mostly on fully similar objects, while it is practically more demanding and realistic to match instances that are only partially similar to each other.\n\nIn this paper, we propose an algorithm to jointly match multiple objects that exhibit only partial similarities, where the provided pairwise feature correspondences can be densely corrupted. By encoding a consistent partial map collection into a 0-1 semidefinite matrix, we attempt recovery via a two-step procedure, that is, a spectral technique followed by a parameter-free convex program called MatchLift. Under a natural randomized model, MatchLift exhibits nearoptimal error-correction ability, i.e. it guarantees the recovery of the ground-truth maps even when a dominant fraction of the inputs are randomly corrupted. We evaluate the proposed algorithm on various benchmark data sets including synthetic examples and real-world examples, all of which confirm the practical applicability of the proposed algorithm.", "citation": "Citations (55)", "year": "2014", "departments": ["Stanford University", "Stanford University", "Stanford University"], "conf": "icml", "authors": ["Yuxin Chen.....http://dblp.org/pers/hd/c/Chen:Yuxin", "Leonidas J. Guibas.....http://dblp.org/pers/hd/g/Guibas:Leonidas_J=", "Qi-Xing Huang.....http://dblp.org/pers/hd/h/Huang:Qi=Xing"], "pages": 9}