{"title": "Error-Driven Incremental Learning in Deep Convolutional Neural Network for Large-Scale Image Classification.", "fields": ["contextual image classification", "incremental learning", "convolutional neural network", "snapshot", "speedup"], "abstract": "Supervised learning using deep convolutional neural network has shown its promise in large-scale image classification task. As a building block, it is now well positioned to be part of a larger system that tackles real-life multimedia tasks. An unresolved issue is that such model is trained on a static snapshot of data. Instead, this paper positions the training as a continuous learning process as new classes of data arrive. A system with such capability is useful in practical scenarios, as it gradually expands its capacity to predict increasing number of new classes. It is also our attempt to address the more fundamental issue: a good learning system must deal with new knowledge that it is exposed to, much as how human do.   We developed a training algorithm that grows a network not only incrementally but also hierarchically. Classes are grouped according to similarities, and self-organized into levels. The newly added capacities are divided into component models that predict coarse-grained superclasses and those return final prediction within a superclass. Importantly, all models are cloned from existing ones and can be trained in parallel. These models inherit features from existing ones and thus further speed up the learning. Our experiment points out advantages of this approach, and also yields a few important open questions.", "citation": "Citations (74)", "departments": ["Peking University", "Microsoft", "Microsoft", "Peking University", "Microsoft"], "authors": ["Tianjun Xiao.....http://dblp.org/pers/hd/x/Xiao:Tianjun", "Jiaxing Zhang.....http://dblp.org/pers/hd/z/Zhang:Jiaxing", "Kuiyuan Yang.....http://dblp.org/pers/hd/y/Yang:Kuiyuan", "Yuxin Peng.....http://dblp.org/pers/hd/p/Peng:Yuxin", "Zheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Zheng"], "conf": "mm", "year": "2014", "pages": 10}