{"title": "Triolet: a programming system that unifies algorithmic skeleton interfaces for high-performance cluster computing.", "fields": ["loop fusion", "haskell", "algorithmic skeleton", "modular design", "computer cluster"], "abstract": "Functional algorithmic skeletons promise a high-level programming interface for distributed-memory clusters that free developers from concerns of task decomposition, scheduling, and communication. Unfortunately, prior distributed functional skeleton frameworks do not deliver performance comparable to that achievable in a low-level distributed programming model such as C with MPI and OpenMP, even when used in concert with high-performance array libraries. There are several causes: they do not take advantage of shared memory on each cluster node; they impose a fixed partitioning strategy on input data; and they have limited ability to fuse loops involving skeletons that produce a variable number of outputs per input.   We address these shortcomings in the Triolet programming language through a modular library design that separates concerns of parallelism, loop nesting, and data partitioning. We show how Triolet substantially improves the parallel performance of algorithms involving array traversals and nested, variable-size loops over what is achievable in Eden, a distributed variant of Haskell. We further demonstrate how Triolet can substantially simplify parallel programming relative to C with MPI and OpenMP while achieving 23--100% of its performance on a 128-core cluster.", "citation": "Citations (4)", "year": "2014", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "ppopp", "authors": ["Christopher I. Rodrigues.....http://dblp.org/pers/hd/r/Rodrigues:Christopher_I=", "Thomas B. Jablin.....http://dblp.org/pers/hd/j/Jablin:Thomas_B=", "Abdul Dakkak.....http://dblp.org/pers/hd/d/Dakkak:Abdul", "Wen-mei W. Hwu.....http://dblp.org/pers/hd/h/Hwu:Wen=mei_W="], "pages": 12}