{"title": "Emergent, crowd-scale programming practice in the IDE.", "fields": ["reactive programming", "programming domain", "procedural programming", "event driven programming", "symbolic programming"], "abstract": "While emergent behaviors are uncodified across many domains such as programming and writing, interfaces need explicit rules to support users. We hypothesize that by codifying emergent programming behavior, software engineering interfaces can support a far broader set of developer needs. To explore this idea, we built Codex, a knowledge base that records common practice for the Ruby programming language by indexing over three million lines of popular code. Codex enables new data-driven interfaces for programming systems: statistical linting, identifying code that is unlikely to occur in practice and may constitute a bug; pattern annotation, automatically discovering common programming idioms and annotating them with metadata using expert crowdsourcing; and library generation, constructing a utility package that encapsulates and reflects emergent software practice. We evaluate these applications to find Codex captures a broad swatch of programming practice, statistical linting detects problematic code snippets, and pattern annotation discovers nontrivial idioms such as basic HTTP authentication and database migration templates. Our work suggests that operationalizing practice-driven knowledge in structured domains such as programming can enable a new class of user interfaces.", "citation": "Citations (22)", "year": "2014", "departments": ["Stanford University", "Stanford University", "Stanford University", "Adobe Systems", "Stanford University"], "conf": "chi", "authors": ["Ethan Fast.....http://dblp.org/pers/hd/f/Fast:Ethan", "Daniel Steffee.....http://dblp.org/pers/hd/s/Steffee:Daniel", "Lucy Wang.....http://dblp.org/pers/hd/w/Wang:Lucy", "Joel R. Brandt.....http://dblp.org/pers/hd/b/Brandt:Joel_R=", "Michael S. Bernstein.....http://dblp.org/pers/hd/b/Bernstein:Michael_S="], "pages": 10}