{"title": "Frenzy: collaborative data organization for creating conference sessions.", "fields": ["human computer interaction", "constraint satisfaction", "web application", "crowdsourcing", "computer science", "software deployment", "computer supported cooperative work"], "abstract": "Organizing conference sessions around themes improves the experience for attendees. However, the session creation process can be difficult and time-consuming due to the amount of expertise and effort required to consider alternative paper groupings. We present a collaborative web application called  Frenzy  to draw on the efforts and knowledge of an entire program committee. Frenzy comprises (a) interfaces to support large numbers of experts working collectively to create sessions, and (b) a two-stage process that decomposes the session-creation problem into meta-data elicitation and global constraint satisfaction. Meta-data elicitation involves a large group of experts working simultaneously, while global constraint satisfaction involves a smaller group that uses the meta-data to form sessions.   We evaluated Frenzy with 48 people during a deployment at the CSCW 2014 program committee meeting. The session making process was much faster than the traditional process, taking 88 minutes instead of a full day. We found that meta-data elicitation was useful for session creation. Moreover, the sessions created by Frenzy were the basis of the CSCW 2014 schedule.", "citation": "Not cited", "year": "2014", "departments": ["University of Washington", "Massachusetts Institute of Technology", "Carnegie Mellon University", "University of Washington", "University of Washington"], "conf": "chi", "authors": ["Lydia B. Chilton.....http://dblp.org/pers/hd/c/Chilton:Lydia_B=", "Juho Kim.....http://dblp.org/pers/hd/k/Kim:Juho", "Paul André.....http://dblp.org/pers/hd/a/Andr=eacute=:Paul", "Felicia Cordeiro.....http://dblp.org/pers/hd/c/Cordeiro:Felicia", "James A. Landay.....http://dblp.org/pers/hd/l/Landay:James_A=", "Daniel S. Weld.....http://dblp.org/pers/hd/w/Weld:Daniel_S=", "Steven P. Dow.....http://dblp.org/pers/hd/d/Dow:Steven_P=", "Robert C. Miller.....http://dblp.org/pers/hd/m/Miller:Robert_C=", "Haoqi Zhang.....http://dblp.org/pers/hd/z/Zhang:Haoqi"], "pages": 10}