{"title": "Predicting employee expertise for talent management in the enterprise.", "fields": ["analytics", "talent management", "software deployment", "workforce planning", "business process"], "abstract": "Strategic planning and talent management in large enterprises composed of knowledge workers requires complete, accurate, and up-to-date representation of the expertise of employees in a form that integrates with business processes. Like other similar organizations operating in dynamic environments, the IBM Corporation strives to maintain such current and correct information, specifically assessments of employees against job roles and skill sets from its expertise taxonomy. In this work, we deploy an analytics-driven solution that infers the expertise of employees through the mining of enterprise and social data that is not specifically generated and collected for expertise inference. We consider job role and specialty prediction and pose them as supervised classification problems. We evaluate a large number of feature sets, predictive models and postprocessing algorithms, and choose a combination for deployment. This expertise analytics system has been deployed for key employee population segments, yielding large reductions in manual effort and the ability to continually and consistently serve up-to-date and accurate data for several business functions. This expertise management system is in the process of being deployed throughout the corporation.", "citation": "Citations (18)", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Kush R. Varshney.....http://dblp.org/pers/hd/v/Varshney:Kush_R=", "Vijil Chenthamarakshan.....http://dblp.org/pers/hd/c/Chenthamarakshan:Vijil", "Scott W. Fancher.....http://dblp.org/pers/hd/f/Fancher:Scott_W=", "Jun Wang.....http://dblp.org/pers/hd/w/Wang_0006:Jun", "DongPing Fang.....http://dblp.org/pers/hd/f/Fang:DongPing", "Aleksandra Mojsilovic.....http://dblp.org/pers/hd/m/Mojsilovic:Aleksandra"], "conf": "kdd", "year": "2014", "pages": 10}