{"title": "Knowing when you're wrong: building fast and reliable approximate query processing systems.", "fields": ["memory bandwidth", "sargable", "data mining", "error bar", "computer science", "web query classification", "query expansion", "theoretical computer science"], "abstract": "Modern data analytics applications typically process massive amounts of data on clusters of tens, hundreds, or thousands of machines to support near-real-time decisions.The quantity of data and limitations of disk and memory bandwidth often make it infeasible to deliver answers at interactive speeds. However, it has been widely observed that many applications can tolerate some degree of inaccuracy. This is especially true for exploratory queries on data, where users are satisfied with \"close-enough\" answers if they can come quickly. A popular technique for speeding up queries at the cost of accuracy is to execute each query on a sample of data, rather than the whole dataset. To ensure that the returned result is not too inaccurate, past work on approximate query processing has used statistical techniques to estimate \"error bars\" on returned results. However, existing work in the sampling-based approximate query processing (S-AQP) community has not validated whether these techniques actually generate accurate error bars for real query workloads. In fact, we find that error bar estimation often fails on real world production workloads. Fortunately, it is possible to quickly and accurately diagnose the failure of error estimation for a query. In this paper, we show that it is possible to implement a query approximation pipeline that produces approximate answers and reliable error bars at interactive speeds.", "citation": "Not cited", "year": "2014", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "sigmod", "authors": ["Sameer Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Sameer", "Henry Milner.....http://dblp.org/pers/hd/m/Milner:Henry", "Ariel Kleiner.....http://dblp.org/pers/hd/k/Kleiner:Ariel", "Ameet Talwalkar.....http://dblp.org/pers/hd/t/Talwalkar:Ameet", "Michael I. Jordan.....http://dblp.org/pers/hd/j/Jordan:Michael_I=", "Samuel Madden.....http://dblp.org/pers/hd/m/Madden:Samuel", "Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "pages": 12}