{"title": "Parallel De Bruijn Graph Construction and Traversal for De Novo Genome Assembly.", "fields": ["sequence assembly", "unified parallel c", "distributed hash table", "genome", "de bruijn graph"], "abstract": "De novo whole genome assembly reconstructs genomic sequence from short, overlapping, and potentially erroneous fragments called reads. We study optimized parallelization of the most time-consuming phases of Meraculous, a state-of-the-art production assembler. First, we present a new parallel algorithm for  k -mer analysis, characterized by intensive communication and I/O requirements, and reduce the memory requirements by 6.93×. Second, we efficiently parallelize de Bruijn graph construction and traversal, which necessitates a distributed hash table and is a key component of most de novo assemblers. We provide a novel algorithm that leverages one-sided communication capabilities of the Unified Parallel C (UPC) to facilitate the requisite fine-grained parallelism and avoidance of data hazards, while analytically proving its scalability properties. Overall results show unprecedented performance and efficient scaling on up to 15,360 cores of a Cray XC30, on human genome as well as the challenging wheat genome, with performance improvement from  days  to  seconds .", "citation": "Citations (61)", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory"], "authors": ["Evangelos Georganas.....http://dblp.org/pers/hd/g/Georganas:Evangelos", "Aydin Buluç.....http://dblp.org/pers/hd/b/Bulu=ccedil=:Aydin", "Jarrod Chapman.....http://dblp.org/pers/hd/c/Chapman:Jarrod", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid", "Daniel Rokhsar.....http://dblp.org/pers/hd/r/Rokhsar:Daniel", "Katherine A. Yelick.....http://dblp.org/pers/hd/y/Yelick:Katherine_A="], "conf": "sc", "year": "2014", "pages": 12}