{"title": "Omid: Lock-free transactional support for distributed data stores.", "fields": ["lock", "transactions per second", "snapshot", "snapshot isolation", "commit"], "abstract": "In this paper, we introduce Omid, a tool for lock-free transactional support in large data stores such as HBase. Omid uses a centralized scheme and implements snapshot isolation, a property that guarantees that all read operations of a transaction are performed on a consistent snapshot of the data. In a lock-based approach, the unreleased, distributed locks that are held by a failed or slow client block others. By using a centralized scheme for Omid, we are able to implement a lock-free commit algorithm, which does not suffer from this problem. Moreover, Omid lightly replicates a read-only copy of the transaction metadata into the clients where they can locally service a large part of queries on metadata. Thanks to this technique, Omid does not require modifying either the source code of the data store or the tables' schema, and the overhead on data servers is also negligible. The experimental results show that our implementation on a simple dual-core machine can service up to a thousand of client machines. While the added latency is limited to only 10 ms, Omid scales up to 124K write transactions per second. Since this capacity is multiple times larger than the maximum reported traffic in similar systems, we do not expect the centralized scheme of Omid to be a bottleneck even for current large data stores.", "citation": "Citations (15)", "departments": ["Microsoft", "Yahoo!", "Facebook", "Twitter", "Splice Machine, ... arcelona, Spain"], "authors": ["Daniel Gómez Ferro.....http://dblp.org/pers/hd/f/Ferro:Daniel_G=oacute=mez", "Flavio Junqueira.....http://dblp.org/pers/hd/j/Junqueira:Flavio", "Ivan Kelly.....http://dblp.org/pers/hd/k/Kelly:Ivan", "Benjamin Reed.....http://dblp.org/pers/hd/r/Reed:Benjamin", "Maysam Yabandeh.....http://dblp.org/pers/hd/y/Yabandeh:Maysam"], "conf": "icde", "year": "2014", "pages": 12}