{"title": "MISO: souping up big data query processing with a multistore system.", "fields": ["physical design", "analytics", "relational database management system", "computation", "big data"], "abstract": "Multistore systems utilize multiple distinct data stores such as Hadoop's HDFS and an RDBMS for query processing by allowing a query to access data and computation in both stores. Current approaches to multistore query processing fail to achieve the full potential benefits of utilizing both systems due to the high cost of data movement and loading between the stores. Tuning the physical design of a multistore, i.e., deciding what data resides in which store, can reduce the amount of data movement during query processing, which is crucial for good multistore performance. In this work, we provide what we believe to be the first method to tune the physical design of a multistore system, by focusing on which store to place data. Our method, called MISO for MultISstore Online tuning, is adaptive, lightweight, and works in an online fashion utilizing only the by-products of query processing, which we term as opportunistic views. We show that MISO significantly improves the performance of ad-hoc big data query processing by leveraging the specific characteristics of the individual stores while incurring little additional overhead on the stores.", "citation": "Citations (66)", "year": "2014", "departments": ["University of California, Santa Cruz", "University of California, Santa Cruz", "NEC Labs Americ ...  Cupertino, USA", "NEC Labs Americ ...  Cupertino, USA", "NEC Labs Americ ...  Cupertino, USA"], "conf": "sigmod", "authors": ["Jeff LeFevre.....http://dblp.org/pers/hd/l/LeFevre:Jeff", "Jagan Sankaranarayanan.....http://dblp.org/pers/hd/s/Sankaranarayanan:Jagan", "Hakan Hacigümüs.....http://dblp.org/pers/hd/h/Hacig=uuml=m=uuml=s:Hakan", "Jun'ichi Tatemura.....http://dblp.org/pers/hd/t/Tatemura:Jun=ichi", "Neoklis Polyzotis.....http://dblp.org/pers/hd/p/Polyzotis:Neoklis", "Michael J. Carey.....http://dblp.org/pers/hd/c/Carey_0001:Michael_J="], "pages": 12}