{"title": "RIAL: Resource Intensity Aware Load balancing in clouds.", "fields": ["service level agreement", "supercomputer", "scalability", "provisioning", "virtualization", "service level", "resource intensity", "load balancing"], "abstract": "To provide robust infrastructure as a service (IaaS), clouds currently perform load balancing by migrating virtual machines (VMs) from heavily loaded physical machines (PMs) to lightly loaded PMs. The unique features of clouds pose formidable challenges to achieving effective and efficient load balancing. First, VMs in clouds use different resources (e.g., CPU, bandwidth, memory) to serve a variety of services (e.g., high performance computing, web services, file services), resulting in different overutilized resources in different PMs. Also, the overutilized resources in a PM may vary over time due to the time-varying heterogenous service requests. Second, there is intensive network communication between VMs. However, previous load balancing methods statically assign equal or pre- defined weights to different resources, which leads to degraded performance in terms of speed and cost to achieve load balance. Also, they do not strive to minimize the VM communications between PMs. We propose a Resource Intensity Aware Load balancing method (RIAL). For each PM, RIAL dynamically assigns different weights to different resources according to their usage intensity in the PM, which significantly reduces the time and cost to achieve load balance and avoids future load imbalance. It also tries to keep frequently communicating VMs in the same PM to reduce bandwidth cost, and migrate VMs to PMs with minimum VM performance degradation. Our extensive trace-driven simulation results and real-world experimental results show the superior performance of RIAL compared to other load balancing methods. I. INTRODUCTION Cloud computing is becoming increasingly popular due to its ability to provide unlimited computing services with the pay-as-you-go service model. Currently cloud systems employ virtualization technology to provide resources in physical machines (PMs) in the form of virtual machines (VMs). Users create VMs deployed on the cloud on demand. Each VM runs its own operating system and consumes resources (e.g., CPU, memory and bandwidth) from its host PM. Cloud providers supply services by signing Service Level Agreement (SLA) with cloud customers that serves as both the blueprint and the warranty for cloud computing. Under- provisioning of resources leads to SLA violations while over- provisioning of resources leads to resource underutilization, and a consequent decrease in revenue for the cloud providers. Under this dilemma, it is important for cloud providers to fully utilize cloud resources and meanwhile uphold the SLAs. In order to provide robust infrastructure as a service (IaaS), clouds currently perform load balancing by migrating VMs from heavily loaded PMs to lightly loaded PMs so that the utilizations of PMs' resources (defined as the ratio between", "citation": "Citations (24)", "departments": ["Clemson University", "Clemson University", "Clemson University", "University of Virginia"], "authors": ["Liuhua Chen.....http://dblp.org/pers/hd/c/Chen:Liuhua", "Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Karan Sapra.....http://dblp.org/pers/hd/s/Sapra:Karan"], "conf": "infocom", "year": "2014", "pages": 9}