{"title": "Tsmart-GalsBlock: a toolkit for modeling, validation, and synthesis of multi-clocked embedded systems.", "fields": ["correctness", "executable", "program synthesis", "system model", "vhdl"], "abstract": "The key challenges of the model-driven approach to designing multi-clocked embedded systems are three-fold: (1) how to model local synchronous components and asynchronous communication between components in a single framework, (2) how to ensure the correctness of the model, and (3) how to maintain the consistency between the model and the implementation of the system. In this paper, we present Tsmart, a self-contained toolkit to address these three challenges. Tsmart seamlessly integrates (1) a graphical editor to facilitate the modeling of the complex behaviors and structures in an embedded system, (2) a simulator for interactive graphical simulation to understand and debug the system model, (3) a verication engine to verify the correctness of the system design, and (4) a synthesis engine to automatically generate ecient executable VHDL code from the model. The toolkit has been successfully applied to designing the main control system of a train communication controller, and the system has already been deployed and in operation. The evaluation of Tsmart on this real industrial application demonstrates the eectiveness and the potential of the toolkit.", "citation": "Citations (2)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Yu Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Yu", "Hehua Zhang.....http://dblp.org/pers/hd/z/Zhang:Hehua", "Huafeng Zhang.....http://dblp.org/pers/hd/z/Zhang:Huafeng", "Xinyan Zhao.....http://dblp.org/pers/hd/z/Zhao:Xinyan", "Han Liu.....http://dblp.org/pers/hd/l/Liu:Han", "Chengnian Sun.....http://dblp.org/pers/hd/s/Sun:Chengnian", "Xiaoyu Song.....http://dblp.org/pers/hd/s/Song:Xiaoyu", "Ming Gu.....http://dblp.org/pers/hd/g/Gu_0001:Ming", "Jia-Guang Sun.....http://dblp.org/pers/hd/s/Sun:Jia=Guang"], "conf": "sigsoft", "year": "2014", "pages": 4}