{"title": "A global name service for a highly mobile internetwork.", "fields": ["latency", "replica", "high availability", "scalability", "network architecture"], "abstract": "Mobile devices dominate the Internet today, however the Internet rooted in its tethered origins continues to provide poor infrastructure support for mobility. Our position is that in order to address this problem, a key challenge that must be addressed is the design of a massively scalable global name service that rapidly resolves identities to network locations under high mobility. Our primary contribution is the design, implementation, and evaluation of auspice, a next-generation global name service that addresses this challenge. A key insight underlying auspice is a demand-aware replica {placement engine} that intelligently replicates name records to provide low lookup latency, low update cost, and high availability. We have implemented a prototype of auspice and compared it against several commercial managed DNS providers as well as state-of-the-art research alternatives, and shown that auspice significantly outperforms both. We demonstrate proof-of-concept that auspice can serve as a complete end-to-end mobility solution as well as enable novel context-based communication primitives that generalize name- or address-based communication in today's Internet.", "citation": "Citations (62)", "departments": ["University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst", "University of Massachusetts Amherst"], "authors": ["Abhigyan Sharma.....http://dblp.org/pers/hd/s/Sharma:Abhigyan", "Xiaozheng Tie.....http://dblp.org/pers/hd/t/Tie:Xiaozheng", "Hardeep Uppal.....http://dblp.org/pers/hd/u/Uppal:Hardeep", "Arun Venkataramani.....http://dblp.org/pers/hd/v/Venkataramani:Arun", "David Westbrook.....http://dblp.org/pers/hd/w/Westbrook:David", "Aditya Yadav.....http://dblp.org/pers/hd/y/Yadav:Aditya"], "conf": "sigcomm", "year": "2014", "pages": 12}