{"title": "Cellular multi-coverage with non-uniform rates.", "fields": ["femtocell", "wimax", "access network", "timing advance", "user equipment"], "abstract": "Recent advances in the standardization of 4G cel- lular networks introduce the notion of multi-coverage, where multiple base stations may collaboratively satisfy the demands of mobile users. We provide a theoretical model for studying such multi-coverage environments, in highly heterogeneous settings, where users demands and profits may vary, as can base stations' capacities and the rates with which they can service the users. Whereas previous works provided solutions that were only applicable to scenarios where rates are uniform throughout the network, or allowed a mobile user to be serviced by at most one base station, we present several algorithms for the multi-coverage problem in the presence of non-uniform rates, and analyze their performance. We complete our study by a simulation study that further validates our results and provides further insight into algorithm design, depending on the users' characteristics. I. INTRODUCTION Next generation cellular systems, 3GPP Long Term Evo- lution (LTE), (1), and IEEE 802.16m (WiMAX), (2) pro- vide integrated broadband services while maintaining diverse Quality of Service (QoS) guarantees. In these systems, each mobile user is associated with a base station (BS) 1 . The base station allocates (schedules) distinct frequency-time chunks to the active mobile users within its cell. In order to cope with the high traffic demands, the density of base stations is expected to grow exponentially in the near future (3), where each cell is expected to have a different size determined by the maximum range at which the users can successfully hear the transmitter and by the maximum combined data rate of all the mobiles in the cell. Accordingly, coverage will be provided by a mixture of cells, comprising Macrocells which provide wide-area coverage of a few kilometers, Microcells which cover a few hundred meters and are suitable for densely populated urban areas, combined with smaller cells such as Picocells which are installed in large indoor environments such as offices or shopping centers and Femtocells which are self-deployed residential base stations, which bring the network closer to users and provide a big leap in performance. The challenge in such dense networks is hence to provide wide coverage supporting high data rate applications anywhere and anytime, and in particular increasing cell edge users' throughput allowing them to also benefit from the high data rate application support. 1 In this paper we use the terminology of users and base stations which is similar to user equipment (UE) and evolved Node B (eNB), and mobile stations (MS) and base station (BS), in the LTE and WiMAX jargon, respectively. Traditionally each user is associated with a single BS. Accordingly, the BS-user association problem is crucial in multicell networks. Typically a signal to noise ratio approach is used in which a user is associated with the BS whose signal is received with the highest average strength. Sometimes the cell load is also considered, prioritizing cells with lighter traffic loads. Nonetheless, when the traffic loads are high, the system cannot support all users and admission control is required. One should note that in such heavy loads scenarios, when the loads among cells are not balanced, some users may be blocked even though some of their neighboring cells may be not fully utilized. In this paper we evaluate a mechanism which allows more than one base station to transmit data to a single user simultaneously. Note that this suggested mechanism is in the spirit of the current standards which support the coordinated multi-point (CoMP) mechanism between base stations, which not only allows coordination between the BSs but also lever- ages this coordination and allows more than one base station to transmit data to a single user simultaneously. Specifically, we consider a multiple base station (BS) net- work serving a large number of users. Each user has a different PHY data rate from each BS which is a function of the SNR received from this BS. We further assume that different users run different applications with different traffic demands, and are therefore associated with different utilizations and gains. We assume that each user has a minimum traffic demand which if not fulfilled, the user is deemed uncovered. Furthermore, no extra gain can be obtained from allocating extra resources beyond the minimum required by a user, i.e., each user utilization function can be modeled as a step function where the step is located at its minimum demand. We study the user selection problem in highly loaded heterogeneous scheduled access networks. Typically, the user selection problem considers two closely related problems: (i) admission control, and (ii) schedule and frame building procedure. The admission controller is responsible for selecting the users that can be served. The schedule and frame builder is responsible for the logical positioning of the allocation within the frame. In this study we deal only with the admission control mechanism, which aims at maximizing the overall system benefit under the constraint that the aggregate allocated resources by each BS to its users is feasible. In this paper we overlook the micro scheduling problem and its feasibility, i.e., we assume that any resource distribution by the network which is feasible by", "citation": "Citations (4)", "departments": ["Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev", "Ben-Gurion University of the Negev"], "authors": ["Omer Gurewitz.....http://dblp.org/pers/hd/g/Gurewitz:Omer", "Yakov Sandomirsky.....http://dblp.org/pers/hd/s/Sandomirsky:Yakov", "Gabriel Scalosub.....http://dblp.org/pers/hd/s/Scalosub:Gabriel"], "conf": "infocom", "year": "2014", "pages": 9}