{"title": "Weakly-Supervised Image Parsing via Constructing Semantic Graphs and Hypergraphs.", "fields": ["graph database", "modular decomposition", "abstract semantic graph", "s attributed grammar", "clique width"], "abstract": "In this paper, we address the problem of weakly-supervised image parsing, whose aim is to automatically determine the class labels of image regions given image-level labels only. In the literature, existing studies pay main attention to the formulation of the weakly-supervised learning problem, i.e., how to propagate class labels from images to regions given an affinity graph of regions. Notably, however, the affinity graph of regions, which is generally constructed in relatively simpler settings in existing methods, is of crucial importance to the parsing performance due to the fact that the weakly-supervised image parsing problem cannot be handled within a single image, and that the affinity graph facilitates label propagation among multiple images. Therefore, in contrast to existing methods, we focus on how to make the affinity graph more descriptive through embedding more semantics into it. We develop two novel graphs by leveraging the weak supervision information carefully: 1) Semantic graph, which is established upon a conventional graph by utilizing the proposed weakly-supervised criteria; 2) Semantic hypergraph, which explores both intra-image and inter-image high-order semantic relevance. Experimental results on two standard datasets demonstrate that the proposed semantic graphs and hypergraphs not only capture more semantic relevance, but also perform significantly better than conventional graphs in image parsing. More remarkably, due to the complementariness among the proposed semantic graphs and hypergraphs, the combination of them shows even more promising results.", "citation": "Citations (9)", "departments": ["Peking University", "Peking University", "Peking University"], "authors": ["Wenxuan Xie.....http://dblp.org/pers/hd/x/Xie:Wenxuan", "Yuxin Peng.....http://dblp.org/pers/hd/p/Peng:Yuxin", "Jianguo Xiao.....http://dblp.org/pers/hd/x/Xiao:Jianguo"], "conf": "mm", "year": "2014", "pages": 10}