{"title": "XRay: Enhancing the Web's Transparency with Differential Correlation.", "fields": ["audit", "tracking system", "precision and recall", "small number", "leverage"], "abstract": "Today's Web services - such as Google, Amazon, and Facebook - leverage user data for varied purposes, including personalizing recommendations, targeting advertisements, and adjusting prices. At present, users have little insight into how their data is being used. Hence, they cannot make informed choices about the services they choose.\n\nTo increase transparency, we developed XRay, the first fine-grained, robust, and scalable personal data tracking system for the Web. XRay predicts which data in an arbitrary Web account (such as emails, searches, or viewed products) is being used to target which outputs (such as ads, recommended products, or prices). XRay's core functions are service agnostic and easy to instantiate for new services, and they can track data within and across services. To make predictions independent of the audited service, XRay relies on the following insight: by comparing outputs from different accounts with similar, but not identical, subsets of data, one can pinpoint targeting through correlation. We show both theoretically, and through experiments on Gmail, Amazon, and YouTube, that XRay achieves high precision and recall by correlating data from a surprisingly small number of extra accounts.", "citation": "Citations (81)", "year": "2014", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "conf": "uss", "authors": ["Mathias Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Mathias", "Guillaume Ducoffe.....http://dblp.org/pers/hd/d/Ducoffe:Guillaume", "Francis Lan.....http://dblp.org/pers/hd/l/Lan:Francis", "Andrei Papancea.....http://dblp.org/pers/hd/p/Papancea:Andrei", "Theofilos Petsios.....http://dblp.org/pers/hd/p/Petsios:Theofilos", "Riley Spahn.....http://dblp.org/pers/hd/s/Spahn:Riley", "Augustin Chaintreau.....http://dblp.org/pers/hd/c/Chaintreau:Augustin", "Roxana Geambasu.....http://dblp.org/pers/hd/g/Geambasu:Roxana"], "pages": 16}