{"title": "Fine-grained partitioning for aggressive data skipping.", "fields": ["data warehouse", "metadata", "data access", "block", "tuple"], "abstract": "Modern query engines are increasingly being required to process enormous datasets in near real-time. While much can be done to speed up the data access, a promising technique is to reduce the need to access data through data skipping. By maintaining some metadata for each block of tuples, a query may skip a data block if the metadata indicates that the block does not contain relevant data. The effectiveness of data skipping, however, depends on how well the blocking scheme matches the query filters.   In this paper, we propose a fine-grained blocking technique that reorganizes the data tuples into blocks with a goal of enabling queries to skip blocks aggressively. We first extract representative filters in a workload as features using frequent itemset mining. Based on these features, each data tuple can be represented as a feature vector. We then formulate the blocking problem as a optimization problem on the feature vectors, called Balanced MaxSkip Partitioning, which we prove is NP-hard. To find an approximate solution efficiently, we adopt the bottom-up clustering framework. We prototyped our blocking techniques on Shark, an open-source data warehouse system. Our experiments on TPC-H and a real-world workload show that our blocking technique leads to 2-5x improvement in query response time over traditional range-based blocking techniques.", "citation": "Citations (28)", "year": "2014", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "sigmod", "authors": ["Liwen Sun.....http://dblp.org/pers/hd/s/Sun:Liwen", "Michael J. Franklin.....http://dblp.org/pers/hd/f/Franklin:Michael_J=", "Sanjay Krishnan.....http://dblp.org/pers/hd/k/Krishnan:Sanjay", "Reynold S. Xin.....http://dblp.org/pers/hd/x/Xin:Reynold_S="], "pages": 12}