{"title": "DBDesigner: A customizable physical design tool for Vertica Analytic Database.", "fields": ["physical design", "workload", "massively parallel", "use case", "tuple"], "abstract": "In this paper, we present Vertica's customizable physical design tool, called the DBDesigner (DBD), that produces designs optimized for various scenarios and applications. For a given workload and space budget, DBD automatically recommends a physical design that optimizes query performance, storage footprint, fault tolerance and recovery to meet different customer requirements. Vertica is a distributed, massively parallel columnar database that physically organizes data into projections. Projections are attribute subsets from one or more tables with tuples sorted by one or more attributes, that are replicated or segmented (distributed) on cluster nodes. The key challenges involved in projection design are picking appropriate column sets, sort orders, cluster data distributions and column encodings. To achieve the desired trade-off between query performance and storage footprint, DBD operates under three different design policies: (a) load-optimized, (b) query-optimized or (c) balanced. These policies indirectly control the number of projections proposed and queries optimized to achieve the desired balance. To cater to query workloads that evolve over time, DBD also operates in a comprehensive and incremental design mode. In addition, DBD lets users override specific features of projection design based on their intimate knowledge about the data and query workloads. We present the complete physical design algorithm, describing in detail how projection candidates are efficiently explored and evaluated using optimizer's cost and benefit model. Our experimental results show that DBD produces good physical designs that satisfy a variety of customer use cases.", "citation": "Citations (9)", "departments": ["Vertica Systems ... , MA 02140, USA", "Vertica Systems ... , MA 02140, USA", "Vertica Systems ... , MA 02140, USA", "Vertica Systems ... , MA 02140, USA", "Vertica Systems ... , MA 02140, USA"], "authors": ["Ramakrishna Varadarajan.....http://dblp.org/pers/hd/v/Varadarajan:Ramakrishna", "Vivek Bharathan.....http://dblp.org/pers/hd/b/Bharathan:Vivek", "Ariel Cary.....http://dblp.org/pers/hd/c/Cary:Ariel", "Jaimin Dave.....http://dblp.org/pers/hd/d/Dave:Jaimin", "Sreenath Bodagala.....http://dblp.org/pers/hd/b/Bodagala:Sreenath"], "conf": "icde", "year": "2014", "pages": 12}