{"title": "Fast and unified local search for random walk based k-nearest-neighbor query in large graphs.", "fields": ["iterated local search", "guided local search", "local optimum", "monotonic function", "proximity search"], "abstract": "Given a large graph and a query node, finding its k-nearest-neighbor (kNN) is a fundamental problem. Various random walk based measures have been developed to measure the proximity (similarity) between nodes. Existing algorithms for the random walk based top-k proximity search can be categorized as global and local methods based on their search strategies. Global methods usually require an expensive precomputing step. By only searching the nodes near the query node, local methods have the potential to support more efficient query. However, most existing local search methods cannot guarantee the exactness of the solution. Moreover, they are usually designed for specific proximity measures. Can we devise an efficient local search method that applies to different measures and also guarantees result exactness? In this paper, we present FLoS (Fast Local Search), a unified local search method for efficient and exact top-k proximity query in large graphs. FLoS is based on the no local optimum property of proximity measures. We show that many measures have no local optimum. Utilizing this property, we introduce several simple operations on transition probabilities, which allow developing lower and upper bounds on the proximity. The bounds monotonically converge to the exact proximity when more nodes are visited. We further show that FLoS can also be applied to measures having local optimum by utilizing relationship among different measures. We perform comprehensive experiments to evaluate the efficiency and applicability of the proposed method.", "citation": "Citations (12)", "year": "2014", "departments": ["Case Western Reserve University", "Kent State University", "Case Western Reserve University"], "conf": "sigmod", "authors": ["Yubao Wu.....http://dblp.org/pers/hd/w/Wu:Yubao", "Ruoming Jin.....http://dblp.org/pers/hd/j/Jin:Ruoming", "Xiang Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiang"], "pages": 12}