{"title": "Parallel subgraph listing in a large-scale graph.", "fields": ["graph factorization", "universal graph", "factor critical graph", "forbidden graph characterization", "degeneracy"], "abstract": "Subgraph listing is a fundamental operation to many graph and network analyses. The problem itself is computationally expensive and is well-studied in centralized processing algorithms. However, the centralized solutions cannot scale well to large graphs. Recently, several parallel approaches are introduced to handle the large graphs. Unfortunately, these parallel approaches still rely on the expensive join operations, thus cannot achieve high performance. In this paper, we design a novel parallel subgraph listing framework, named PSgL. The PSgL iteratively enumerates subgraph instances and solves the subgraph listing in a divide-and-conquer fashion. The framework completely relies on the graph traversal, and avoids the explicit join operation. Moreover, in order to improve its performance, we propose several solutions to balance the workload and reduce the size of intermediate results. Specially, we prove the problem of partial subgraph instance distribution for workload balance is NP-hard, and carefully design a set of heuristic strategies. To further reduce the enormous intermediate results, we introduce three independent mechanisms, which are automorphism breaking of the pattern graph, initial pattern vertex selection based on a cost model, and a pruning method based on a light-weight index.   We have implemented the prototype of PSgL, and run comprehensive experiments of various graph listing operations on diverse large graphs. The experiments clearly demonstrate that PSgL is robust and can achieve performance gain over the state-of-the-art solutions up to 90%.", "citation": "Citations (35)", "year": "2014", "departments": ["Peking University", "Peking University", "Hong Kong University of Science and Technology", "Peking University", "Peking University"], "conf": "sigmod", "authors": ["Yingxia Shao.....http://dblp.org/pers/hd/s/Shao:Yingxia", "Bin Cui.....http://dblp.org/pers/hd/c/Cui_0001:Bin", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Lin Ma.....http://dblp.org/pers/hd/m/Ma:Lin", "Junjie Yao.....http://dblp.org/pers/hd/y/Yao:Junjie", "Ning Xu.....http://dblp.org/pers/hd/x/Xu:Ning"], "pages": 12}