{"title": "Beta reduction is invariant, indeed.", "fields": ["exponential growth", "linear logic", "turing machine", "random access", "beta normal form"], "abstract": "Slot and van Emde Boas' weak invariance thesis states that  reasonable  machines can simulate each other within a polynomially overhead in time. Is λ-calculus a reasonable machine? Is there a way to measure the computational complexity of a λ-term? This paper presents the first complete positive answer to this long-standing problem. Moreover, our answer is completely machine-independent and based over a standard notion in the theory of λ-calculus: the length of a leftmost-outermost derivation to normal form is an invariant cost model. Such a theorem cannot be proved by directly relating λ-calculus with Turing machines or random access machines, because of the  size explosion problem : there are terms that in a linear number of steps produce an exponentially long output. The first step towards the solution is to shift to a notion of evaluation for which the length and the size of the output are linearly related. This is done by adopting the linear substitution calculus (LSC), a calculus of explicit substitutions modelled after linear logic proof nets and admitting a decomposition of leftmost-outermost derivations with the desired property. Thus, the LSC is invariant with respect to, say, random access machines. The second step is to show that LSC is invariant with respect to the λ-calculus. The size explosion problem seems to imply that this is not possible: having the same notions of normal form, evaluation in the LSC is exponentially longer than in the λ-calculus. We solve such an  impasse  by introducing a new form of shared normal form and shared reduction, deemed  useful . Useful evaluation avoids those steps that only unshare the output without contributing to  β -redexes,  i.e . the steps that cause the blow-up in size. The main technical contribution of the paper is indeed the definition of useful reductions and the thorough analysis of their properties.", "citation": "Citations (20)", "departments": ["University of Bologna", "University of Bologna"], "authors": ["Beniamino Accattoli.....http://dblp.org/pers/hd/a/Accattoli:Beniamino", "Ugo Dal Lago.....http://dblp.org/pers/hd/l/Lago:Ugo_Dal"], "conf": "lics", "year": "2014", "pages": 10}