{"title": "Quality-adaptive Prefetching for Interactive Branched Video using HTTP-based Adaptive Streaming.", "fields": ["instruction prefetch", "information and computer science", "multimedia", "real time computing", "personalization"], "abstract": "Interactive branched video that allows users to select their own paths through the video, provides creative content designers with great personalization opportunities; however, such video also introduces significant new challenges for the system developer. For example, without careful prefetching and buffer management, the use of multiple alternative playback paths can easily result in playback interruptions. In this paper, we present a full implementation of an interactive branched video player using HTTP-based Adaptive Streaming (HAS) that provides seamless playback even when the users defer their branch path choices to the last possible moment. Our design includes optimized prefetching policies that we derive under a simple optimization framework, effective buffer management of prefetched data, and the use of parallel TCP connections to achieve efficient buffer workahead. Through performance evaluation under a wide range of scenarios, we show that our optimized policies can effectively prefetch data of carefully selected qualities along multiple alternative paths such as to ensure seamless playback, offering users a pleasant viewing experience without playback interruptions.", "citation": "Citations (13)", "departments": ["Linköping University", "Linköping University", "University of Saskatchewan", "NICTA", "Linköping University"], "authors": ["Vengatanathan Krishnamoorthi.....http://dblp.org/pers/hd/k/Krishnamoorthi:Vengatanathan", "Niklas Carlsson.....http://dblp.org/pers/hd/c/Carlsson:Niklas", "Derek L. Eager.....http://dblp.org/pers/hd/e/Eager:Derek_L=", "Anirban Mahanti.....http://dblp.org/pers/hd/m/Mahanti:Anirban", "Nahid Shahmehri.....http://dblp.org/pers/hd/s/Shahmehri:Nahid"], "conf": "mm", "year": "2014", "pages": 10}