{"title": "Personal clouds: Sharing and integrating networked resources to enhance end user experiences.", "fields": ["middleware", "mobile device", "end user", "personal cloud", "utility computing"], "abstract": "End user experiences on mobile devices with their rich sets of sensors are constrained by limited device battery lives and restricted form factors, as well as by the 'scope' of the data available locally. The 'Personal Cloud' distributed software abstractions address these issues by enhancing the capabilities of a mobile device via seamless use of both nearby and remote cloud resources. In contrast to vendor-specific, middleware-based cloud solutions, Personal Cloud instances are created at hypervisor- level, to create for each end user the federation of networked resources best suited for the current environment and use. Specifically, the Cirrostratus extensions of the Xen hypervisor can federate a user's networked resources to establish a personal execution environment, governed by policies that go beyond evaluating network connectivity to also consider device ownership and access rights, the latter managed in a secure fashion via standard Social Network Services. Experimental evaluations with both Linux- and Android-based devices, and using Facebook as the SNS, show the approach capable of substantially augmenting a device's innate capabilities, improving application performance and the effective functionality seen by end users.", "citation": "Citations (15)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology College of Computing"], "authors": ["Minsung Jang.....http://dblp.org/pers/hd/j/Jang:Minsung", "Karsten Schwan.....http://dblp.org/pers/hd/s/Schwan:Karsten", "Ketan Bhardwaj.....http://dblp.org/pers/hd/b/Bhardwaj:Ketan", "Ada Gavrilovska.....http://dblp.org/pers/hd/g/Gavrilovska:Ada", "Adhyas Avasthi.....http://dblp.org/pers/hd/a/Avasthi:Adhyas"], "conf": "infocom", "year": "2014", "pages": 9}