{"title": "MultiLanes: providing virtualized storage for OS-level virtualization on many cores.", "fields": ["file system", "converged storage", "storage virtualization", "virtualization", "application virtualization"], "abstract": "OS-level virtualization is an efficient method for server consolidation. However, the sharing of kernel services among the co-located virtualized environments (VEs) incurs performance interference between each other. Especially, interference effects within the shared I/O stack would lead to severe performance degradations on many-core platforms incorporating fast storage technologies (e.g., non-volatile memories).\n\nThis paper presents MultiLanes, a virtualized storage system for OS-level virtualization on many cores. Multi-Lanes builds an isolated I/O stack on top of a virtualized storage device for each VE to eliminate contention on kernel data structures and locks between them, thus scaling them to many cores. Moreover, the overhead of storage device virtualization is tuned to be negligible so that MultiLanes can deliver competitive performance against Linux. Apart from scalability, MultiLanes also delivers flexibility and security to all the VEs, as the virtualized storage device allows each VE to run its own guest file system.\n\nThe evaluation of our prototype system built for Linux container (LXC) on a 16-core machine with a RAM disk demonstrates MultiLanes outperforms Linux by up to 11.32X and 11.75X in micro- and macro-benchmarks, and exhibits nearly linear scalability.", "citation": "Citations (1)", "departments": ["Beihang University", "Beihang University", "Beihang University", "Beihang University", "Beihang University"], "authors": ["Junbin Kang.....http://dblp.org/pers/hd/k/Kang:Junbin", "Benlong Zhang.....http://dblp.org/pers/hd/z/Zhang:Benlong", "Tianyu Wo.....http://dblp.org/pers/hd/w/Wo:Tianyu", "Chunming Hu.....http://dblp.org/pers/hd/h/Hu:Chunming", "Jinpeng Huai.....http://dblp.org/pers/hd/h/Huai:Jinpeng"], "conf": "fast", "year": "2014", "pages": 13}