{"title": "Private matchings and allocations.", "fields": ["valuation", "wish", "partition", "differential privacy", "bipartite graph", "special case", "small number"], "abstract": "We consider a private variant of the classical  allocation problem : given  k  goods and  n  agents with individual, private valuation functions over bundles of goods, how can we partition the goods amongst the agents to maximize social welfare? An important special case is when each agent desires at most one good, and specifies her (private) value for each good: in this case, the problem is exactly the maximum-weight matching problem in a bipartite graph.   Private matching and allocation problems have not been considered in the differential privacy literature, and for good reason: they are plainly impossible to solve under differential privacy. Informally, the allocation must match agents to their preferred goods in order to maximize social welfare, but this preference is exactly what agents wish to hide! Therefore, we consider the problem under the relaxed constraint of  joint differential privacy : for any agent  i , no coalition of agents excluding  i  should be able to learn about the valuation function of agent  i . In this setting, the full allocation is no longer published---instead, each agent is told what good to get. We first show that with a small number of identical copies of each good, it is possible to efficiently and accurately solve the maximum weight matching problem while guaranteeing joint differential privacy. We then consider the more general allocation problem, when bidder valuations satisfy the  gross substitutes  condition. Finally, we prove that the allocation problem cannot be solved to non-trivial accuracy under joint differential privacy without requiring multiple copies of each type of good.", "citation": "Not cited", "year": "2014", "departments": ["University of Pennsylvania", "University of Hong Kong", "University of Pennsylvania", "Stanford University", "University of Pennsylvania"], "conf": "stoc", "authors": ["Justin Hsu.....http://dblp.org/pers/hd/h/Hsu:Justin", "Zhiyi Huang.....http://dblp.org/pers/hd/h/Huang_0002:Zhiyi", "Aaron Roth.....http://dblp.org/pers/hd/r/Roth:Aaron", "Tim Roughgarden.....http://dblp.org/pers/hd/r/Roughgarden:Tim", "Zhiwei Steven Wu.....http://dblp.org/pers/hd/w/Wu:Zhiwei_Steven"], "pages": 10}