{"title": "Scalable heterogeneous translated hashing.", "fields": ["feature hashing", "dynamic perfect hashing", "double hashing", "universal hashing", "locality sensitive hashing"], "abstract": "Hashing has enjoyed a great success in large-scale similarity search. Recently, researchers have studied the multi-modal hashing to meet the need of similarity search across different types of media. However, most of the existing methods are applied to search across multi-views among which explicit bridge information is provided. Given a heterogeneous media search task, we observe that abundant multi-view data can be found on the Web which can serve as an auxiliary bridge. In this paper, we propose a Heterogeneous Translated Hashing (HTH) method with such auxiliary bridge incorporated not only to improve current multi-view search but also to enable similarity search across heterogeneous media which have no direct correspondence. HTH simultaneously learns hash functions embedding heterogeneous media into different Hamming spaces, and translators aligning these spaces. Unlike almost all existing methods that map heterogeneous data in a common Hamming space, mapping to different spaces provides more flexible and discriminative ability. We empirically verify the effectiveness and efficiency of our algorithm on two real world large datasets, one publicly available dataset of Flickr and the other MIRFLICKR-Yahoo Answers dataset.", "citation": "Citations (17)", "departments": ["Hong Kong University of Science and Technology", "University of Illinois at Urbana–Champaign", "Duke University", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Ying Wei.....http://dblp.org/pers/hd/w/Wei:Ying", "Yangqiu Song.....http://dblp.org/pers/hd/s/Song:Yangqiu", "Yi Zhen.....http://dblp.org/pers/hd/z/Zhen:Yi", "Bo Liu.....http://dblp.org/pers/hd/l/Liu_0015:Bo", "Qiang Yang.....http://dblp.org/pers/hd/y/Yang_0001:Qiang"], "conf": "kdd", "year": "2014", "pages": 10}