{"title": "WiFall: Device-free fall detection by wireless networks.", "fields": ["wireless lan controller", "channel state information", "wireless site survey", "wireless wan", "false alarm", "physical layer", "radio propagation model", "fixed wireless", "motion detection", "key distribution in wireless sensor networks"], "abstract": "Injuries that are caused by falls have been regarded as one of the major health threats to the independent living for the elderly. Conventional fall detection systems have various limitations. In this work, we first look for the correlations between different radio signal variations and activities by analyzing radio propagation model. Based on our observation, we propose WiFall, a truly unobtrusive fall detection system. WiFall employs physical layer Channel State Information (CSI) as the indicator of activities. It can detect fall of the human without hardware modification, extra environmental setup, or any wearable device. We implement WiFall on desktops equipped with commodity 802.11n NIC, and evaluate the performance in three typical indoor scenarios with several layouts of transmitter-receiver (Tx-Rx) links. In our area of interest, WiFall can achieve fall detection for a single person with high accuracy. As demonstrated by the experimental results, WiFall yields 90 percent detection precision with a false alarm rate of 15 percent on average using a one-class SVM classifier in all testing scenarios. It can also achieve average 94 percent fall detection precisions with 13 percent false alarm using Random Forest algorithm.", "citation": "Citations (168)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Macau"], "authors": ["Chunmei Han.....http://dblp.org/pers/hd/h/Han:Chunmei", "Kaishun Wu.....http://dblp.org/pers/hd/w/Wu:Kaishun", "Yuxi Wang.....http://dblp.org/pers/hd/w/Wang:Yuxi", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M="], "conf": "infocom", "year": "2014", "pages": 9}