{"title": "Online allocation of virtual machines in a distributed cloud.", "fields": ["virtual machine", "distributed computing", "cloud computing", "competitive analysis", "data center", "cloud testing", "distributed database", "resource allocation"], "abstract": "One of the primary functions of a cloud service provider is to allocate cloud resources to users upon request. Requests arrive in real-time and resource placement decisions must be made as and when a request arrives, without any prior knowledge of future arrivals. In addition, when a cloud service provider operates a geographically diversified cloud that consists of a large number of small data centers, the resource allocation problem becomes even more complex. This is due to the fact that resource request can have additional constraints on data center location, service delay guarantee, and so on, which is especially true for the emerging network function virtualization application. In this paper, we propose a generalized resource placement methodology that can work across different cloud architectures, resource request constraints, with real-time request arrivals and departures. The proposed algorithms are online in the sense that allocations are made without any knowledge of resource requests that arrive in the future, and the current resource allocations are made in such a manner as to permit the acceptance of as many future arrivals as possible. We derive worst case competitive ratio for the algorithms. We show through experiments and case studies the superior performance of the algorithms in practice.", "citation": "Citations (63)", "departments": ["Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs", "Bell Labs"], "authors": ["Fang Hao.....http://dblp.org/pers/hd/h/Hao:Fang", "Murali S. Kodialam.....http://dblp.org/pers/hd/k/Kodialam:Murali_S=", "T. V. Lakshman.....http://dblp.org/pers/hd/l/Lakshman:T=_V=", "Sarit Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Sarit"], "conf": "infocom", "year": "2014", "pages": 9}