{"title": "Toward Robust Hidden Volumes Using Write-Only Oblivious RAM.", "fields": ["disk encryption", "parallel computing", "symmetric key algorithm", "device file", "oblivious ram", "deniable encryption", "computer science"], "abstract": "With sensitive data being increasingly stored on mobile devices and laptops, hard disk encryption is more important than ever. In particular, being able to plausibly deny that a hard disk contains certain information is a very useful and interesting research goal. However, it has been known for some time that existing ``hidden volume'' solutions, like TrueCrypt, fail in the face of an adversary who is able to observe the contents of a disk on multiple, separate occasions. In this work, we explore more robust constructions for hidden volumes and present HiVE, which is resistant to more powerful adversaries with multiple-snapshot capabilities. In pursuit of this, we propose the first security definitions for hidden volumes, and prove HiVE secure under these definitions. At the core of HiVE, we design a new write-only Oblivious RAM. We show that, when only hiding writes, it is possible to achieve ORAM with optimal O(1) communication complexity and only poly-logarithmic user memory. This is a significant improvement over existing work and an independently interesting result. We go on to show that our write-only ORAM is specially equipped to provide hidden volume functionality with low overhead and significantly increased security. Finally, we implement HiVE as a Linux kernel block device to show both its practicality and usefulness on existing platforms.", "citation": "Not cited", "year": "2014", "departments": ["Northeastern University", "Northeastern University", "Northeastern University", "Northeastern University"], "conf": "ccs", "authors": ["Erik-Oliver Blass.....http://dblp.org/pers/hd/b/Blass:Erik=Oliver", "Travis Mayberry.....http://dblp.org/pers/hd/m/Mayberry:Travis", "Guevara Noubir.....http://dblp.org/pers/hd/n/Noubir:Guevara", "Kaan Onarlioglu.....http://dblp.org/pers/hd/o/Onarlioglu:Kaan"], "pages": 12}