{"title": "An optimal data collection technique for improved utility in UAS-aided networks.", "fields": ["link adaptation", "bit error rate", "price of anarchy", "throughput", "potential game"], "abstract": "Recent technological advances in electronics, sen- sors, and communications devices have facilitated the prolifer- ation of Unmanned Aircraft System (UAS)-aided applications. However, the UAS-aided communications networks are yet to receive sufficient research endeavor. In this paper, we address one of the most important research challenges pertaining to UAS-aided networks comprising adaptive modulation-capable nodes, namely how to fairly maximize the energy efficiency (throughput per energy). For the mobility pattern innate to the UAS, we demonstrate how the adaptive modulation behaves. Furthermore, we formulate the problem as a potential game that is played between the UAS and the network-nodes, and prove its stability, optimality, and convergence. Based upon the potential game, a data collection method is envisioned to maximize the energy efficiency with the fairness constraint. Additionally, we analyze the Price of Anarchy (PoA) of our proposed game. Extensive simulations exhibit the effectiveness of our proposal under varying environments. sensor nodes require only capabilities to communicate with the CHs. The mobility pattern of the UAS causes the distance between a CH and the UAS to vary. The distance between the CH and the UAS affects the Signal-to-Noise Ratio (SNR), which in turn affects the Bit Error Rate (BER) of the CH transmissions. Both SNR and BER affect the modulation scheme. This is because modulation schemes that transmit more bits per symbol require higher values of SNR for a given BER requirement (9). Moreover, if high levels of BER are acceptable, the achievable number of bits per symbol that a modulation scheme transmits can be increased.", "citation": "Citations (18)", "departments": ["Tohoku University", "Tohoku University", "Tohoku University", "Tohoku University", "Nat. Inst. of I ... ., Tokyo, Japan"], "authors": ["Ahmed E. A. A. Abdulla.....http://dblp.org/pers/hd/a/Abdulla:Ahmed_E=_A=_A=", "Zubair Md. Fadlullah.....http://dblp.org/pers/hd/f/Fadlullah:Zubair_Md=", "Hiroki Nishiyama.....http://dblp.org/pers/hd/n/Nishiyama:Hiroki", "Nei Kato.....http://dblp.org/pers/hd/k/Kato:Nei", "Fumie Ono.....http://dblp.org/pers/hd/o/Ono:Fumie", "Ryu Miura.....http://dblp.org/pers/hd/m/Miura:Ryu"], "conf": "infocom", "year": "2014", "pages": 9}