{"title": "Cloud service placement via subgraph matching.", "fields": ["search engine indexing", "graph", "instruction cycle", "probabilistic logic", "memory management"], "abstract": "Fast service placement, finding a set of nodes with enough free capacity of computation, storage, and network connectivity, is a routine task in daily cloud administration. In this work, we formulate this as a subgraph matching problem. Different from the traditional setting, including approximate and probabilistic graphs, subgraph matching on data-center networks has two unique properties. (1) Node/edge labels representing vacant CPU cycles and network bandwidth change rapidly, while the network topology varies little. (2) There is a partial order on node/edge labels. Basically, one needs to place service in nodes with enough free capacity. Existing graph indexing techniques have not considered very frequent label updates, and none of them supports partial order on numeric labels. Therefore, we resort to a new graph index framework, Gradin, to address both challenges. Gradin encodes subgraphs into multi-dimensional vectors and organizes them with indices such that it can efficiently search the matches of a query's subgraphs and combine them to form a full match. In particular, we analyze how the index parameters affect update and search performance with theoretical results. Moreover, a revised pruning algorithm is introduced to reduce unnecessary search during the combination of partial matches. Using both real and synthetic datasets, we demonstrate that Gradin outperforms the baseline approaches up to 10 times.", "citation": "Citations (9)", "departments": ["University of California, Santa Barbara", "IBM", "IBM", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Bo Zong.....http://dblp.org/pers/hd/z/Zong:Bo", "Ramya Raghavendra.....http://dblp.org/pers/hd/r/Raghavendra:Ramya", "Mudhakar Srivatsa.....http://dblp.org/pers/hd/s/Srivatsa:Mudhakar", "Xifeng Yan.....http://dblp.org/pers/hd/y/Yan:Xifeng", "Ambuj K. Singh.....http://dblp.org/pers/hd/s/Singh:Ambuj_K=", "Kang-Won Lee.....http://dblp.org/pers/hd/l/Lee:Kang=Won"], "conf": "icde", "year": "2014", "pages": 12}