{"title": "TRAC: Truthful auction for location-aware collaborative sensing in mobile crowdsourcing.", "fields": ["location awareness", "crowdsourcing", "reverse auction", "rationality", "trac"], "abstract": "In this paper, we tackle the problem of stimulating smartphone users to join mobile crowdsourcing applications with smartphones. Different from existing work of mechanism design, we uniquely take into consideration thecrucial dimension of location informationwhen assigning sensing tasks to smartphones. However, the location awareness largely increases the theoretical and computational complexity. In this paper, we introduce a reverse auction frameworkto model the interactions between the platform and the smartphones. We rigorously prove that optimally determining the winning bids isNP hard. In this paper we design a mechanism called TRACwhich consists of two main components. The first component is a near-optimal approximate algorithm for determining the winning bids with polynomial-time computation complexity, which approximates the optimal solution within a factor of 1+l n(n), wheren is the maximum number of sensing tasks that a smartphone can accommodate. The second component is a critical payment scheme which, despite the approximation of determining winning bids, guarantees that submitted bids of smartphones reflect their real costs of performing sensing tasks. Through both rigid theoretical analysis and extensive simulations, we demonstrate that the proposed mechanism achieves truthfulness, individual rationality and high computation efficiency.", "citation": "Citations (211)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Hong Kong University of Science and Technology", "Shanghai Jiao Tong University", "National and Kapodistrian University of Athens"], "authors": ["Zhenni Feng.....http://dblp.org/pers/hd/f/Feng:Zhenni", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Qian Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Qian", "Lionel M. Ni.....http://dblp.org/pers/hd/n/Ni:Lionel_M=", "Athanasios V. Vasilakos.....http://dblp.org/pers/hd/v/Vasilakos:Athanasios_V="], "conf": "infocom", "year": "2014", "pages": 9}