{"title": "Automatically generated patches as debugging aids: a human study.", "fields": ["debugging", "real time computing", "software deployment", "correctness", "computer science"], "abstract": "Recent research has made significant progress in automatic patch generation, an approach to repair programs with less or no manual intervention. However, direct deployment of auto-generated patches remains difficult, for reasons such as patch quality variations and developers' intrinsic resistance. In this study, we take one step back and investigate a more feasible application scenario of automatic patch generation, that is, using generated patches as debugging aids. We recruited 95 participants for a controlled experiment, in which they performed debugging tasks with the aid of either buggy locations (i.e., the control group), or generated patches of varied qualities. We observe that: a) high-quality patches significantly improve debugging correctness; b) such improvements are more obvious for difficult bugs; c) when using low-quality patches, participants' debugging correctness drops to an even lower point than that of the control group; d) debugging time is significantly affected not by debugging aids, but by participant type and the specific bug to fix. These results highlight that the benefits of using generated patches as debugging aids are contingent upon the quality of the patches. Our qualitative analysis of participants' feedback further sheds light on how generated patches can be improved and better utilized as debugging aids.", "citation": "Citations (19)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Nanjing University"], "authors": ["Yida Tao.....http://dblp.org/pers/hd/t/Tao:Yida", "Jindae Kim.....http://dblp.org/pers/hd/k/Kim:Jindae", "Sunghun Kim.....http://dblp.org/pers/hd/k/Kim_0001:Sunghun", "Chang Xu.....http://dblp.org/pers/hd/x/Xu:Chang"], "conf": "sigsoft", "year": "2014", "pages": 11}