{"title": "How can botnets cause storms? Understanding the evolution and impact of mobile botnets.", "fields": ["computer network", "distributed computing", "the internet", "mobile malware", "botnet"], "abstract": "A botnet in mobile networks is a collection of compromised nodes due to mobile malware, which are able to perform coordinated attacks. Different from Internet botnets, mobile botnets do not need to propagate using centralized infrastructures, but can keep compromising vulnerable nodes in close proximity and evolving organically via data forwarding. Such a distributed mechanism relies heavily on node mobility as well as wireless links, therefore breaks down the underlying premise in existing epidemic modeling for Internet botnets. In this paper, we adopt a stochastic approach to study the evolution and impact of mobile botnets. We find that node mobility can be a trigger to botnet propagation storms: the average size (i.e., number of compromised nodes) of a botnet increases quadratically over time if the mobility range that each node can reach exceeds a threshold; otherwise, the botnet can only contaminate a limited number of nodes with average size always bounded above. This also reveals that mobile botnets can propagate at the fastest rate of quadratic growth in size, which is substantially slower than the exponential growth of Internet botnets. To measure the denial-of-service impact of a mobile botnet, we define a new metric, called last chipper time, which is the last time that service requests, even partially, can still be processed on time as the botnet keeps propagating and launching attacks. The last chipper time is identified to decrease at most on the order of 1/ p B, where B is the network bandwidth. This", "citation": "Citations (11)", "departments": ["North Carolina State University", "North Carolina State University", "Research Triangle Park"], "authors": ["Zhuo Lu.....http://dblp.org/pers/hd/l/Lu:Zhuo", "Wenye Wang.....http://dblp.org/pers/hd/w/Wang:Wenye", "Cliff Wang.....http://dblp.org/pers/hd/w/Wang:Cliff"], "conf": "infocom", "year": "2014", "pages": 9}