{"title": "Optimal approximation algorithm of virtual machine placement for data latency minimization in cloud systems.", "fields": ["bounded function", "approximation algorithm", "virtual machine", "cloud computing", "latency"], "abstract": "The MapReduce/Hadoop architecture has become very important and effective in cloud systems because many data-intensive applications are usually required to process big data. In such environments, big data is partitioned and stored over several data nodes; thus, the total completion time of a task would be delayed if the maximum access latency among all pairs of a data node and its assigned computation node is not bounded. Moreover, the computation nodes usually need to communicate with each other for aggregating the computation results; therefore, the maximum access latency among all pairs of assigned computation nodes also needs to be bounded. In the literature, it has been proved that the placement problem of computation nodes (virtual machines) to minimize the maximum access latency among all pairs of a data node and its assigned computation node and among all pairs of assigned computation nodes does not admit any approximation algorithm with a factor smaller than two, whereas no approximation algorithms have been proposed so far. In this paper, we first propose a 3-approximation algorithm for resolving the problem. Subsequently, we close the gap by proposing a 2-approximation algorithm, that is, an optimal approximation algorithm, for resolving the problem in the price of higher time complexity. Finally, we conduct simulations for evaluating the performance of our algorithms.", "citation": "Citations (56)", "departments": ["National Tsing Hua University", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Jian-Jhih Kuo.....http://dblp.org/pers/hd/k/Kuo:Jian=Jhih", "Hsiu-Hsien Yang.....http://dblp.org/pers/hd/y/Yang:Hsiu=Hsien", "Ming-Jer Tsai.....http://dblp.org/pers/hd/t/Tsai:Ming=Jer"], "conf": "infocom", "year": "2014", "pages": 9}