{"title": "FastProbe: Malicious user detection in Cognitive Radio Networks through active transmissions.", "fields": ["transmission control protocol", "cognitive radio", "attack model", "denial of service attack", "out of band management"], "abstract": "Sensing white space channels to detect whether a particular channel is free or not is very crucial to the operation of Cognitive Radio Networks (CRNs). Cooperative sensing has been shown to improve the performance of channel sensing. However, cooperative sensing is susceptible to malicious users that may not faithfully follow sensing instructions to save energy and/or time, or to launch denial of service attacks against the network. In this paper, we propose a novel active transmissions based algorithm, FastProbe for detecting malicious users. FastProbe proactively detects malicious users before the CRN causes any interference to the Primary Users. Further, using active transmissions, FastProbe achieves higher detection accuracy while maintaining lower overheads when compared with existing algorithms. Simulations and experiments show that in the presence of malicious nodes operating under 2 different attack models, FastProbe reduces the throughput loss due to sensing by as much as 65% compared to existing algorithms. I. INTRODUCTION FCC regulations require Cognitive Radios (CRs) to operate on only those white space channels that are not occupied by Primary Users (PUs). To that end, CRs need to perform regular in-band scanning (or sensing) (1) of channels to avoid interference to PUs as well as out of band sensing to find unused channels. To achieve better sensing accuracy, CRs perform cooperative sensing where multiple nodes participate in channel sensing and their sensing results are processed centrally at a sensing server to determine if the channel is occupied (2). Cooperative sensing improves sensing accuracy but at the same time makes the system more susceptible to malicious users that may be present in the system. A malicious user may (i) have a hardware error due to which its readings are erratic; (ii) be hacked by the owner so that it reports arbitrary sensing results without performing any sensing to save time and/or energy; (iii) report the channel to be busy so as to either leave the channel free for its own personal usage (3) or to initiate a Denial-of-Service attack against the network (4); (iv) selfishly report the channel to be free so that it can operate on that channel; or, (v) skip in-band sensing in order to save energy and/or throughput. The recent increase in attacks against TCP Protocol (5), mobile devices and other hardware devices (6) as well as the software based design of CRs suggests that in the future CRs will be very vulnerable to similar kinds of attacks. Such attacks may affect the sensing capability of CRs and may result in nodes causing interference to PUs, thereby violating the FCC requirements.", "citation": "Citations (10)", "departments": ["Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Tarun Bansal.....http://dblp.org/pers/hd/b/Bansal:Tarun", "Bo Chen.....http://dblp.org/pers/hd/c/Chen:Bo", "Prasun Sinha.....http://dblp.org/pers/hd/s/Sinha:Prasun"], "conf": "infocom", "year": "2014", "pages": 9}