{"title": "Combinatorial Partial Monitoring Game with Linear Feedback and Its Applications.", "fields": ["small set", "crowdsourcing", "exponential growth", "regret", "enumeration"], "abstract": "In online learning, a player chooses actions to play and receives reward and feedback from the environment with the goal of maximizing her reward over time. In this paper, we propose the model of combinatorial partial monitoring games with linear feedback, a model which simultaneously addresses limited feedback, infinite outcome space of the environment and exponentially large action space of the player. We present the Global Confidence Bound (GCB) algorithm, which integrates ideas from both combinatorial multi-armed bandits and finite partial monitoring games to handle all the above issues. GCB only requires feedback on a small set of actions and achieves O(T2/3 log T) distribution-independent regret and O(log T) distribution-dependent regret (the latter assuming unique optimal action), where T is the total time steps played. Moreover, the regret bounds only depend linearly on log |χ| rather than |χ|, where χ is the action space. GCB isolates offline optimization tasks from online learning and avoids explicit enumeration of all actions in the online learning part. We demonstrate that our model and algorithm can be applied to a crowdsourcing application leading to both an efficient learning algorithm and low regret, and argue that they can be applied to a wide range of combinatorial applications constrained with limited feedback.", "citation": "Citations (19)", "year": "2014", "departments": ["Tsinghua University", "Cornell University", "Cornell University", "The Chinese University of Hong Kong", "Microsoft"], "conf": "icml", "authors": ["Tian Lin.....http://dblp.org/pers/hd/l/Lin:Tian", "Bruno D. Abrahao.....http://dblp.org/pers/hd/a/Abrahao:Bruno_D=", "Robert D. Kleinberg.....http://dblp.org/pers/hd/k/Kleinberg:Robert_D=", "John C. S. Lui.....http://dblp.org/pers/hd/l/Lui:John_C=_S=", "Wei Chen.....http://dblp.org/pers/hd/c/Chen:Wei"], "pages": 9}