{"title": "Automatic entity-grouping for OLTP workloads.", "fields": ["serialization", "workload", "distributed transaction", "user experience design", "online transaction processing"], "abstract": "Supporting an online transaction processing (OLTP) workload in a scalable and elastic fashion is a challenging task. Recently, a new breed of scalable systems have shown significant throughput gains by limiting consistency to small units of data called “entity-groups” (e.g., a user's account information stored together with all her emails in an online email service.) Transactions that access the data from only one entity-group are guaranteed of full ACID, but those that access multiple entity-groups are not. Defining entity-groups has direct impact on workload consistency and performance, and doing so for data with a complex schema is very challenging. It is prone to go to extremes - groups that are too fine-grained cause excessive number of expensive distributed transactions while those that are too coarse lead to excessive serialization and performance degradation. It is also difficult to balance conflicting requirements from different transactions. In commercially available entity-group systems, creating entity-groups is usually a manual process, which severely limits the usability of those systems. This paper is the first systematic effort on automating the entity-group design process. Our goal is to build a user-friendly design tool for automatically creating entity-groups based on a given workload and to help users trade consistency for performance in a principled manner. For advanced users, we allow them to provide feedback to the entity-group design and iteratively improve the final output. We demonstrate the effectiveness of our approach with widely used benchmarks. We also present the user experience of a prototype we built.", "citation": "Citations (3)", "departments": ["NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA", "NEC Laboratorie ... ertino, CA, USA"], "authors": ["Bin Liu.....http://dblp.org/pers/hd/l/Liu:Bin", "Jun'ichi Tatemura.....http://dblp.org/pers/hd/t/Tatemura:Jun=ichi", "Oliver Po.....http://dblp.org/pers/hd/p/Po:Oliver", "Wang-Pin Hsiung.....http://dblp.org/pers/hd/h/Hsiung:Wang=Pin", "Hakan Hacigümüs.....http://dblp.org/pers/hd/h/Hacig=uuml=m=uuml=s:Hakan"], "conf": "icde", "year": "2014", "pages": 12}