{"title": "Microbank: Architecting Through-Silicon Interposer-Based Main Memory Systems.", "fields": ["conventional memory", "uniform memory access", "memory rank", "extended memory", "interleaved memory"], "abstract": "Through-Silicon Interposer (TSI) has recently been proposed to provide high memory bandwidth and improve energy efficiency of the main memory system. However, the impact of TSI on main memory system architecture has not been well explored. While TSI improves the I/O energy efficiency, we show that it results in an  unbalanced  memory system design in terms of energy efficiency as the core DRAM dominates overall energy consumption. To balance and enhance the energy efficiency of a TSI-based memory system, we propose  μ bank, a novel DRAM device organization in which each bank is partitioned into multiple smaller banks (or  μ banks) that operate independently like conventional banks with minimal area overhead. The  μ bank organization significantly increases the amount of bank-level parallelism to improve the performance and energy efficiency of the TSI-based memory system. The massive number of  μ banks reduces bank conflicts, hence simplifying the memory system design. We evaluated a sophisticated prediction-based DRAM page-management policy, which can improve performance by up to 20.5% in a conventional memory system without  μ banks. However, a  μ bank-based design does not require such a complex page-management policy and a simple open-page policy is often sufficient -- achieving within 5% of a perfect predictor. Our proposed  μ bank-based memory system improves the IPC and system energy-delay product by 1.62× and 4.80×, respectively, for memory-intensive SPEC 2006 benchmarks on average, over the baseline DDR3-based memory system.", "citation": "Citations (13)", "departments": ["Seoul National University", "Seoul National University", "Pohang University of Science and Technology", "Seoul National University", "Seoul National University"], "authors": ["Young Hoon Son.....http://dblp.org/pers/hd/s/Son:Young_Hoon", "Seongil O.....http://dblp.org/pers/hd/o/O:Seongil", "Hyunggyun Yang.....http://dblp.org/pers/hd/y/Yang:Hyunggyun", "Daejin Jung.....http://dblp.org/pers/hd/j/Jung:Daejin", "Jung Ho Ahn.....http://dblp.org/pers/hd/a/Ahn:Jung_Ho", "John Kim.....http://dblp.org/pers/hd/k/Kim:John", "Jangwoo Kim.....http://dblp.org/pers/hd/k/Kim:Jangwoo", "Jae W. Lee.....http://dblp.org/pers/hd/l/Lee:Jae_W="], "conf": "sc", "year": "2014", "pages": 12}