{"title": "Finding minimum type error sources.", "fields": ["satisfiability modulo theories", "human error assessment and reduction technique", "round off error", "type inference", "compiler"], "abstract": "Automatic type inference is a popular feature of functional programming languages. If a program cannot be typed, the compiler typically reports a single program location in its error message. This location is the point where the type inference failed, but not necessarily the actual source of the error. Other potential error sources are not even considered. Hence, the compiler often misses the true error source, which increases debugging time for the programmer. In this paper, we present a general framework for automatic localization of type errors. Our algorithm finds all minimum error sources, where the exact definition of minimum is given in terms of a compiler-specific ranking criterion. Compilers can use minimum error sources to produce more meaningful error reports, and for automatic error correction. Our approach works by reducing the search for minimum error sources to an optimization problem that we formulate in terms of weighted maximum satisfiability modulo theories (MaxSMT). The reduction to weighted MaxSMT allows us to build on SMT solvers to support rich type systems and at the same time abstract from the concrete criterion that is used for ranking the error sources. We have implemented an instance of our framework targeted at Hindley-Milner type systems and evaluated it on existing OCaml benchmarks for type error localization. Our evaluation shows that our approach has the potential to significantly improve the quality of type error reports produced by state of the art compilers.", "citation": "Not cited", "departments": ["New York University", "New York University", "New York University"], "authors": ["Zvonimir Pavlinovic.....http://dblp.org/pers/hd/p/Pavlinovic:Zvonimir", "Tim King.....http://dblp.org/pers/hd/k/King_0001:Tim", "Thomas Wies.....http://dblp.org/pers/hd/w/Wies:Thomas"], "conf": "oopsla", "year": "2014", "pages": 18}