{"title": "Automatic identification of application I/O signatures from noisy server-side traces.", "fields": ["data structure alignment", "system software", "tracing", "dynamic time warping", "job scheduler"], "abstract": "Competing workloads on a shared storage system cause I/O resource contention and application performance vagaries. This problem is already evident in today's HPC storage systems and is likely to become acute at exascale. We need more interaction between application I/O requirements and system software tools to help alleviate the I/O bottleneck, moving towards I/O-aware job scheduling. However, this requires rich techniques to capture application I/O characteristics, which remain evasive in production systems.\n\nTraditionally, I/O characteristics have been obtained using client-side tracing tools, with drawbacks such as non-trivial instrumentation/development costs, large trace traffic, and inconsistent adoption. We present a novel approach, I/O Signature Identifier (IOSI), to characterize the I/O behavior of data-intensive applications. IOSI extracts signatures from noisy, zero-overhead server-side I/O throughput logs that are already collected on today's supercomputers, without interfering with the compiling/execution of applications. We evaluated IOSI using the Spider storage system at Oak Ridge National Laboratory, the S3D turbulence application (running on 18,000 Titan nodes), and benchmark-based pseudo-applications. Through our experiments we confirmed that IOSI effectively extracts an application's I/O signature despite significant server-side noise. Compared to client-side tracing tools, IOSI is transparent, interface-agnostic, and incurs no overhead. Compared to alternative data alignment techniques (e.g., dynamic time warping), it offers higher signature accuracy and shorter processing time.", "citation": "Citations (34)", "departments": ["North Carolina State University", "Oak Ridge National Laboratory", "Qatar Computing Research Institute", "Oak Ridge National Laboratory"], "authors": ["Yang Liu.....http://dblp.org/pers/hd/l/Liu:Yang", "Raghul Gunasekaran.....http://dblp.org/pers/hd/g/Gunasekaran:Raghul", "Xiaosong Ma.....http://dblp.org/pers/hd/m/Ma:Xiaosong", "Sudharshan S. Vazhkudai.....http://dblp.org/pers/hd/v/Vazhkudai:Sudharshan_S="], "conf": "fast", "year": "2014", "pages": 16}