{"title": "Learning Latent Engagement Patterns of Students in Online Courses.", "fields": ["psychological intervention", "abstraction", "student engagement", "statistical relational learning", "student activities"], "abstract": "Maintaining and cultivating student engagement is critical for learning. Understanding factors affecting student engagement will help in designing better courses and improving student retention. The large number of participants in massive open online courses (MOOCs) and data collected from their interaction with the MOOC open up avenues for studying student engagement at scale. In this work, we develop a framework for modeling and understanding student engagement in online courses based on student behavioral cues. Our first contribution is the abstraction of student engagement types using latent representations. We use that abstraction in a probabilistic model to connect student behavior with course completion. We demonstrate that the latent formulation for engagement helps in predicting student survival across three MOOCs. Next, in order to initiate better instructor interventions, we need to be able to predict student survival early in the course. We demonstrate that we can predict student survival early in the course reliably using the latent model. Finally, we perform a closer quantitative analysis of user interaction with the MOOC and identify student activities that are good indicators for survival at different points in the course.", "citation": "Citations (69)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of California, Santa Cruz"], "authors": ["Arti Ramesh.....http://dblp.org/pers/hd/r/Ramesh:Arti", "Dan Goldwasser.....http://dblp.org/pers/hd/g/Goldwasser:Dan", "Bert Huang.....http://dblp.org/pers/hd/h/Huang:Bert", "Hal Daumé III.....http://dblp.org/pers/hd/d/Daum=eacute=_III:Hal", "Lise Getoor.....http://dblp.org/pers/hd/g/Getoor:Lise"], "conf": "aaai", "year": "2014", "pages": 7}