{"title": "A hybrid machine-crowdsourcing system for matching web tables.", "fields": ["data web", "web modeling", "schema matching", "social semantic web", "web mapping"], "abstract": "The Web is teeming with rich structured information in the form of HTML tables, which provides us with the opportunity to build a knowledge repository by integrating these tables. An essential problem of web data integration is to discover semantic correspondences between web table columns, and schema matching is a popular means to determine the semantic correspondences. However, conventional schema matching techniques are not always effective for web table matching due to the incompleteness in web tables. In this paper, we propose a two-pronged approach for web table matching that effectively addresses the above difficulties. First, we propose a concept-based approach that maps each column of a web table to the best concept, in a well-developed knowledge base, that represents it. This approach overcomes the problem that sometimes values of two web table columns may be disjoint, even though the columns are related, due to incompleteness in the column values. Second, we develop a hybrid machine-crowdsourcing framework that leverages human intelligence to discern the concepts for “difficult” columns. Our overall framework assigns the most “beneficial” column-to-concept matching tasks to the crowd under a given budget and utilizes the crowdsourcing result to help our algorithm infer the best matches for the rest of the columns. We validate the effectiveness of our framework through an extensive experimental study over two real-world web table data sets. The results show that our two-pronged approach outperforms existing schema matching techniques at only a low cost for crowdsourcing.", "citation": "Citations (84)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "University of California, Berkeley", "National University of Singapore"], "authors": ["Ju Fan.....http://dblp.org/pers/hd/f/Fan:Ju", "Meiyu Lu.....http://dblp.org/pers/hd/l/Lu:Meiyu", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Wang-Chiew Tan.....http://dblp.org/pers/hd/t/Tan:Wang=Chiew", "Meihui Zhang.....http://dblp.org/pers/hd/z/Zhang:Meihui"], "conf": "icde", "year": "2014", "pages": 12}