{"title": "Higher-Order CRF Structural Segmentation of 3D Reconstructed Surfaces.", "fields": ["segmentation based object categorization", "object model", "range segmentation", "scale space segmentation", "conditional random field"], "abstract": "In this paper, we propose a structural segmentation algorithm to partition multi-view stereo reconstructed surfaces of large-scale urban environments into structural segments. Each segment corresponds to a structural component describable by a surface primitive of up to the second order. This segmentation is for use in subsequent urban object modeling, vectorization, and recognition. To overcome the high geometrical and topological noise levels in the 3D reconstructed urban surfaces, we formulate the structural segmentation as a higher-order Conditional Random Field (CRF) labeling problem. It not only incorporates classical lower-order 2D and 3D local cues, but also encodes contextual geometric regularities to disambiguate the noisy local cues. A general higher-order CRF is difficult to solve. We develop a bottom-up progressive approach through a patch-based surface representation, which iteratively evolves from the initial mesh triangles to the final segmentation. Each iteration alternates between performing a prior discovery step, which finds the contextual regularities of the patch-based representation, and an inference step that leverages the regularities as higher-order priors to construct a more stable and regular segmentation. The efficiency and robustness of the proposed method is extensively demonstrated on real reconstruction models, yielding significantly better performance than classical mesh segmentation methods.", "citation": "Citations (4)", "year": "2015", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "conf": "iccv", "authors": ["Jingbo Liu.....http://dblp.org/pers/hd/l/Liu:Jingbo", "Jinglu Wang.....http://dblp.org/pers/hd/w/Wang:Jinglu", "Tian Fang.....http://dblp.org/pers/hd/f/Fang:Tian", "Chiew-Lan Tai.....http://dblp.org/pers/hd/t/Tai:Chiew=Lan", "Long Quan.....http://dblp.org/pers/hd/q/Quan:Long"], "pages": 9}