{"title": "StoreApp: A shared storage appliance for efficient and scalable virtualized Hadoop clusters.", "fields": ["cluster", "exploit", "software deployment", "degree of parallelism", "scalability"], "abstract": "Virtualizing Hadoop clusters provides many benefits, including rapid deployment, on-demand elasticity and secure multi-tenancy. However, a simple migration of Hadoop to a virtualized environment does not fully exploit these benefits. The dual role of a Hadoop worker, acting as both a compute node and a data node, makes it difficult to achieve efficient IO processing, maintain data locality, and exploit resource elasticity in the cloud. We find that decoupling per-node storage from its computation opens up opportunities for IO acceleration, locality improvement, and on-the-fly cluster resizing. To fully exploit these opportunities, we propose StoreApp, a shared storage appliance for virtual Hadoop worker nodes co-located on the same physical host. To completely separate storage from computation and prioritize IO processing, StoreApp pro-actively pushes intermediate data generated by map tasks to the storage node. StoreApp also implements late-binding task creation to take the advantage of prefetched data due to mis-aligned records. Experimental results show that StoreApp achieves up to 61% performance improvement compared to stock Hadoop and resizes the cluster to the (near) optimal degree of parallelism.", "citation": "Citations (2)", "departments": ["University of Colorado Colorado Springs", "University of Colorado Colorado Springs", "University of Colorado Colorado Springs", "Tongji University", "Wayne State University"], "authors": ["Yanfei Guo.....http://dblp.org/pers/hd/g/Guo:Yanfei", "Jia Rao.....http://dblp.org/pers/hd/r/Rao:Jia", "Dazhao Cheng.....http://dblp.org/pers/hd/c/Cheng:Dazhao", "Changjun Jiang.....http://dblp.org/pers/hd/j/Jiang:Changjun", "Cheng-Zhong Xu.....http://dblp.org/pers/hd/x/Xu:Cheng=Zhong", "Xiaobo Zhou.....http://dblp.org/pers/hd/z/Zhou_0002:Xiaobo"], "conf": "infocom", "year": "2015", "pages": 9}