{"title": "Readactor: Practical Code Randomization Resilient to Memory Disclosure.", "fields": ["dead code", "threaded code", "unreachable code", "dead code elimination", "code bloat"], "abstract": "Code-reuse attacks such as return-oriented programming (ROP) pose a severe threat to modern software. Designing practical and effective defenses against code-reuse attacks is highly challenging. One line of defense builds upon fine-grained code diversification to prevent the adversary from constructing a reliable code-reuse attack. However, all solutions proposed so far are either vulnerable to memory disclosure or are impractical for deployment on commodity systems. In this paper, we address the deficiencies of existing solutions and present the first practical, fine-grained code randomization defense, called Read actor, resilient to both static and dynamic ROP attacks. We distinguish between direct memory disclosure, where the attacker reads code pages, and indirect memory disclosure, where attackers use code pointers on data pages to infer the code layout without reading code pages. Unlike previous work, Read actor resists both types of memory disclosure. Moreover, our technique protects both statically and dynamically generated code. We use a new compiler-based code generation paradigm that uses hardware features provided by modern CPUs to enable execute-only memory and hide code pointers from leakage to the adversary. Finally, our extensive evaluation shows that our approach is practical -- we protect the entire Google Chromium browser and its V8 JIT compiler -- and efficient with an average SPEC CPU2006 performance overhead of only 6.4%.", "citation": "Citations (136)", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Irvine", "CASED, Tech. Un ... mstadt, Germany", "CASED, Tech. Un ... mstadt, Germany"], "authors": ["Stephen Crane.....http://dblp.org/pers/hd/c/Crane:Stephen", "Christopher Liebchen.....http://dblp.org/pers/hd/l/Liebchen:Christopher", "Andrei Homescu.....http://dblp.org/pers/hd/h/Homescu:Andrei", "Lucas Davi.....http://dblp.org/pers/hd/d/Davi:Lucas", "Per Larsen.....http://dblp.org/pers/hd/l/Larsen:Per", "Ahmad-Reza Sadeghi.....http://dblp.org/pers/hd/s/Sadeghi:Ahmad=Reza", "Stefan Brunthaler.....http://dblp.org/pers/hd/b/Brunthaler:Stefan", "Michael Franz.....http://dblp.org/pers/hd/f/Franz:Michael"], "conf": "sp", "year": "2015", "pages": 18}