{"title": "Voltage Correlations in Smart Meter Data.", "fields": ["transformer", "smart meter", "cluster analysis", "spatial analysis", "electric distribution network"], "abstract": "The connectivity model of a power distribution network can easily become outdated due to system changes occurring in the field. Maintaining and sustaining an accurate connectivity model is a key challenge for distribution utilities worldwide. This work shows that voltage time series measurements collected from customer smart meters exhibit correlations that are consistent with the hierarchical structure of the distribution network. These correlations may be leveraged to cluster customers based on common ancestry and help verify and correct an existing connectivity model. Additionally, customers may be clustered in combination with voltage data from circuit metering points, spatial data from the geographical information system, and any existing but partially accurate connectivity model to infer customer to transformer and phase connectivity relationships with high accuracy.   We report analysis and validation results based on data collected from multiple feeders of a large electric distribution network in North America. To the best of our knowledge, this is the first large scale measurement study of customer voltage data and its use in inferring network connectivity information.", "citation": "Citations (6)", "departments": ["IBM", "IBM", "IBM", "IBM", "DTE Energy, Detroit, USA"], "authors": ["Rajendu Mitra.....http://dblp.org/pers/hd/m/Mitra:Rajendu", "Ramachandra Kota.....http://dblp.org/pers/hd/k/Kota:Ramachandra", "Sambaran Bandyopadhyay.....http://dblp.org/pers/hd/b/Bandyopadhyay:Sambaran", "Vijay Arya.....http://dblp.org/pers/hd/a/Arya:Vijay", "Brian Sullivan.....http://dblp.org/pers/hd/s/Sullivan:Brian", "Richard Mueller.....http://dblp.org/pers/hd/m/Mueller:Richard", "Heather Storey.....http://dblp.org/pers/hd/s/Storey:Heather", "Gerard Labut.....http://dblp.org/pers/hd/l/Labut:Gerard"], "conf": "kdd", "year": "2015", "pages": 10}