{"title": "ASLR-Guard: Stopping Address Space Leakage for Code Reuse Attacks.", "fields": ["self modifying code", "code bloat", "unreachable code", "dead code elimination", "code access security"], "abstract": "A general prerequisite for a code reuse attack is that the attacker needs to locate code gadgets that perform the desired operations and then direct the control flow of a vulnerable application to those gadgets. Address Space Layout Randomization (ASLR) attempts to stop code reuse attacks by making the first part of the prerequisite unsatisfiable. However, research in recent years has shown that this protection is often defeated by commonly existing information leaks, which provides attackers clues about the whereabouts of certain code gadgets. In this paper, we present ASLR-Guard, a novel mechanism that completely prevents the leaks of code pointers, and render other information leaks (e.g., the ones of data pointers) useless in deriving code address. The main idea behind ASLR-Guard is to render leak of data pointer useless in deriving code address by separating code and data, provide a secure storage for code pointers, and encode the code pointers when they are treated as data. ASLR-Guard can either prevent code pointer leaks or render their leaks harmless. That is, ASLR-Guard makes it impossible to overwrite code pointers with values that point to or will hijack the control flow to a desired address when the code pointers are dereferenced. We have implemented a prototype of ASLR-Guard, including a compilation toolchain and a C/C++ runtime. Our evaluation results show that (1) ASLR-Guard supports normal operations correctly; (2) it completely stops code address leaks and can resist against recent sophisticated attacks; (3) it imposes almost no runtime overhead (", "citation": "Citations (58)", "year": "2015", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "ccs", "authors": ["Kangjie Lu.....http://dblp.org/pers/hd/l/Lu:Kangjie", "Chengyu Song.....http://dblp.org/pers/hd/s/Song:Chengyu", "Byoungyoung Lee.....http://dblp.org/pers/hd/l/Lee:Byoungyoung", "Simon P. Chung.....http://dblp.org/pers/hd/c/Chung:Simon_P=", "Taesoo Kim.....http://dblp.org/pers/hd/k/Kim:Taesoo", "Wenke Lee.....http://dblp.org/pers/hd/l/Lee:Wenke"], "pages": 12}