{"title": "Enterprise: breadth-first graph traversal on GPUs.", "fields": ["massively parallel", "memory hierarchy", "graph traversal", "graphics processing unit", "instruction set"], "abstract": "The Breadth-First Search (BFS) algorithm serves as the foundation for many graph-processing applications and analytics workloads. While Graphics Processing Unit (GPU) offers massive parallelism, achieving high-performance BFS on GPUs entails efficient scheduling of a large number of GPU threads and effective utilization of GPU memory hierarchy. In this paper, we present Enterprise, a new GPU-based BFS system that combines three techniques to remove potential performance bottlenecks: (1)  streamlined GPU threads scheduling  through constructing a frontier queue without contention from concurrent threads, yet containing no duplicated frontiers and optimized for both top-down and bottom-up BFS. (2)  GPU workload balancing  that classifies the frontiers based on different out-degrees to utilize the full spectrum of GPU parallel granularity, which significantly increases thread-level parallelism; and (3)  GPU based BFS direction optimization  quantifies the effect of hub vertices on direction-switching and selectively caches a small set of critical hub vertices in the limited GPU shared memory to reduce expensive random data accesses. We have evaluated Enterprise on a large variety of graphs with different GPU devices. Enterprise achieves up to 76 billion traversed edges per second (TEPS) on a single NVIDIA Kepler K40, and up to 122 billion TEPS on two GPUs that ranks No. 45 in the Graph 500 on November 2014. Enterprise is also very energy-efficient as No. 1 in the GreenGraph 500 (small data category), delivering 446 million TEPS per watt.", "citation": "Citations (23)", "year": "2015", "departments": ["George Washington University", "George Washington University"], "conf": "sc", "authors": ["Hang Liu.....http://dblp.org/pers/hd/l/Liu:Hang", "H. Howie Huang.....http://dblp.org/pers/hd/h/Huang:H=_Howie"], "pages": 12}