{"title": "Performance of random sampling for computing low-rank approximations of a dense matrix on GPUs.", "fields": ["approximation algorithm", "qr decomposition", "speedup", "sparse matrix", "factorization"], "abstract": "A low-rank approximation of a dense matrix plays an important role in many applications. To compute such an approximation, a common approach uses the QR factorization with column pivoting (QRCP). Though the reliability and efficiency of QRCP have been demonstrated, this deterministic approach requires costly communication at each step of the factorization. Since such communication is becoming increasingly expensive on modern computers, an alternative approach based on random sampling, which can be implemented using communication-optimal kernels, is becoming attractive. To study its potential, in this paper, we compare the performance of random sampling with that of QRCP on an NVIDIA Kepler GPU. Our performance results demonstrate that random sampling can be up to 12.8x faster than the deterministic approach for computing the approximation of the same accuracy. We also present the parallel scaling of the random sampling over multiple GPUs on a single compute node, showing a speedup of 3.8x over three Kepler GPUs. These results demonstrate the potential of the random sampling as an excellent computational tool for many applications, and its potential is likely to grow on the emerging computers with the increasing communication costs.", "citation": "Citations (4)", "year": "2015", "departments": ["University of Toulouse", "University of Tennessee", "University of Tennessee", "University of Tennessee", "University of Tennessee"], "conf": "sc", "authors": ["Theo Mary.....http://dblp.org/pers/hd/m/Mary:Theo", "Ichitaro Yamazaki.....http://dblp.org/pers/hd/y/Yamazaki:Ichitaro", "Jakub Kurzak.....http://dblp.org/pers/hd/k/Kurzak:Jakub", "Piotr Luszczek.....http://dblp.org/pers/hd/l/Luszczek:Piotr", "Stanimire Tomov.....http://dblp.org/pers/hd/t/Tomov:Stanimire", "Jack J. Dongarra.....http://dblp.org/pers/hd/d/Dongarra:Jack_J="], "pages": 11}