{"title": "Groupwise analytics via adaptive MapReduce.", "fields": ["analytics", "theoretical computer science", "speedup", "data structure", "shuffling"], "abstract": "Shared-nothing systems such as Hadoop vastly simplify parallel programming when processing disk-resident data whose size exceeds aggregate cluster memory. Such systems incur a significant performance penalty, however, on the important class of “groupwise set-valued analytics” (GSVA) queries in which the data is dynamically partitioned into groups and then a set-valued synopsis is computed for some or all of the groups. Key examples of synopses include top-k sets, bottom-k sets, and uniform random samples. Applications of GSVA queries include micro-marketing, root-cause analysis for problem diagnosis, and fraud detection. A naive approach to executing GSVA queries first reshuffles all of the data so that all records in a group are at the same node and then computes the synopsis for the group. This approach can be extremely inefficient when, as is typical, only a very small fraction of the records in each group actually contribute to the final groupwise synopsis, so that most of the shuffling effort is wasted. We show how to significantly speed up GSVA queries by slightly modifying the shared-nothing environment to allow tasks to occasionally access a small, common data structure; we focus on the Hadoop setting and use the “Adaptive MapReduce” infrastructure of Vernica et al. to implement the data structure. Our approach retains most of the advantages of a system such as Hadoop while significantly improving GSVA query performance, and also allows for incremental updating of query results. Experiments show speedups of up to 5x. Importantly, our new technique can potentially be applied to other shared-nothing systems with disk-resident data.", "citation": "Citations (1)", "departments": ["University of Massachusetts Amherst", "Google", "University of California, Berkeley", "IBM", "Platfora, Inc., USA"], "authors": ["Liping Peng.....http://dblp.org/pers/hd/p/Peng:Liping", "Vuk Ercegovac.....http://dblp.org/pers/hd/e/Ercegovac:Vuk", "Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0002:Kai", "Peter J. Haas.....http://dblp.org/pers/hd/h/Haas:Peter_J=", "Andrey Balmin.....http://dblp.org/pers/hd/b/Balmin:Andrey", "Yannis Sismanis.....http://dblp.org/pers/hd/s/Sismanis:Yannis"], "conf": "icde", "year": "2015", "pages": 12}