{"title": "DocRicher: An Automatic Annotation System for Text Documents Using Social Media.", "fields": ["information needs", "social media", "ground truth", "annotation", "sensor fusion"], "abstract": "We demonstrate a system,  DocRicher , to enrich a text document with social media, that implicitly reference certain passages of it. The aim is to provide an automatic annotation interface to satisfy users' information need, without cumbersome queries to traditional search engines. The system consists of four components: text analysis, query construction, data assignment, and user feedback. Through text analysis, the system decomposes a text document into appropriate topical passages, of which each is represented using detected key phrases. By submitting combinations of these phrases as queries to social media systems, the relevant results are used to suggest new annotations, that are linked to the corresponding passages. We have built a user-friendly visualization tool for users to browse automatically recommended annotations on their reading documents. Users are either allowed to rate a recommended annotation by accepting it or not; or add a new annotation by manually highlighting texts and adding personal comments. Both these annotations are regarded as the ground truth to derive new queries for retrieving more relevant contents. We also apply data fusion to merge the query results from various contexts and retain most relevant ones.", "citation": "Citations (2)", "year": "2015", "departments": ["SeSaMe Centre,  ... pore, Singapore", "School of Compu ... pore, Singapore", "SeSaMe Centre,  ... pore, Singapore", "School of Compu ... pore, Singapore", "SeSaMe Centre,  ... pore, Singapore"], "conf": "sigmod", "authors": ["Qiang Hu.....http://dblp.org/pers/hd/h/Hu:Qiang", "Qi Liu.....http://dblp.org/pers/hd/l/Liu:Qi", "Xiaoli Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoli", "Anthony K. H. Tung.....http://dblp.org/pers/hd/t/Tung:Anthony_K=_H=", "Shubham Goyal.....http://dblp.org/pers/hd/g/Goyal:Shubham", "Jisong Yang.....http://dblp.org/pers/hd/y/Yang:Jisong"], "pages": 6}