{"title": "The Dropper Effect: Insights into Malware Distribution with Downloader Graph Analytics.", "fields": ["cryptovirology", "analytics", "component based software engineering", "executable", "upload"], "abstract": "Malware remains an important security threat, as miscreants continue to deliver a variety of malicious programs to hosts around the world. At the heart of all the malware delivery techniques are executable files (known as downloader trojans or droppers) that download other malware. Because the act of downloading software components from the Internet is not inherently malicious, benign and malicious downloaders are difficult to distinguish based only on their content and behavior. In this paper, we introduce the downloader-graph abstraction, which captures the download activity on end hosts, and we explore the growth patterns of benign and malicious graphs. Downloader graphs have the potential of exposing large parts of the malware download activity, which may otherwise remain undetected. By combining telemetry from anti-virus and intrusion-prevention systems, we reconstruct and analyze 19 million downloader graphs from 5 million real hosts. We identify several strong indicators of malicious activity, such as the growth rate, the diameter, and the Internet access patterns of downloader graphs. Building on these insights, we implement and evaluate a machine learning system for malware detection. Our system achieves a 96.0% true-positive rate, with a 1.0% false-positive rate, and detects malware an average of 9.24 days earlier than existing anti-virus products. We also perform an external validation by examining a sample of unlabeled files that our system detects as malicious, and we find that 41.41% are blocked by anti-virus products.", "citation": "Citations (26)", "year": "2015", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "IBM", "Symantec", "University of Maryland, College Park"], "conf": "ccs", "authors": ["Bum Jun Kwon.....http://dblp.org/pers/hd/k/Kwon:Bum_Jun", "Jayanta Mondal.....http://dblp.org/pers/hd/m/Mondal:Jayanta", "Jiyong Jang.....http://dblp.org/pers/hd/j/Jang:Jiyong", "Leyla Bilge.....http://dblp.org/pers/hd/b/Bilge:Leyla", "Tudor Dumitras.....http://dblp.org/pers/hd/d/Dumitras:Tudor"], "pages": 12}