{"title": "Skipping Refinement.", "fields": ["botany", "bitstream", "coding", "scalar", "computation", "principal component analysis", "multivariate statistics", "transcoding", "reuse", "data exploration", "rna splicing", "computer vision", "dystrophin", "computer science", "artificial intelligence", "stack machine", "exon skipping", "gluten", "oligonucleotide", "bilinear interpolation", "memory controller", "refinement calculus", "pattern recognition", "correctness", "motion vector", "motion estimation", "morpholino"], "abstract": "Abstract   The GlutoPeak test can predict wheat flour quality by measuring gluten aggregation properties in a short time and using a small amount of sample; thus it has usefulness along the entire wheat delivery chain. However, no information on the suitability of this new test on whole grain flours is available. In this contest a multivariate approach was used to assess the GlutoPeak test ability to predict dough quality directly from whole grain flour. GlutoPeak test was performed on both refined and whole grain flours (22 samples), obtaining both profiles and calculated indices, which were subjected to data exploration through Principal Component Analysis. Results suggested a trend according to farinographic stability values. Furthermore, k-Nearest Neighbours classification models were developed using the GlutoPeak profiles to predict farinographic stability, leading to average prediction ability of 81.8% for both refined and whole grain flour data. The present outcome suggests the possibility of predicting farinographic stability by GlutoPeak test directly on whole grain flour, thus skipping the refinement process.", "citation": "Not cited", "year": "2015", "departments": ["University of Milan", "University of Milan", "Agricultural Research Service", "University of Minnesota", "University of Minnesota", "University of Milan", "Northeastern University", "Northeastern University", "MediaTek", "MediaTek", "MediaTek", "Anhui University", "Anhui University"], "conf": "cav", "authors": ["Mitesh Jain.....http://dblp.org/pers/hd/j/Jain:Mitesh", "Panagiotis Manolios.....http://dblp.org/pers/hd/m/Manolios:Panagiotis"], "pages": 17}