{"title": "Is the cure worse than the disease? overfitting in automated program repair.", "fields": ["overfitting", "debugging", "test suite", "correctness", "reliability engineering"], "abstract": "Automated program repair has shown promise for reducing the significant manual effort debugging requires. This paper addresses a deficit of earlier evaluations of automated repair techniques caused by repairing programs and evaluating generated patches' correctness using the same set of tests. Since tests are an imperfect metric of program correctness, evaluations of this type do not discriminate between correct patches and patches that overfit the available tests and break untested but desired functionality. This paper evaluates two well-studied repair tools, GenProg and TrpAutoRepair, on a publicly available benchmark of bugs, each with a human-written patch. By evaluating patches using tests independent from those used during repair, we find that the tools are unlikely to improve the proportion of independent tests passed, and that the quality of the patches is proportional to the coverage of the test suite used during repair. For programs that pass most tests, the tools are as likely to break tests as to fix them. However, novice developers also overfit, and automated repair performs no worse than these developers. In addition to overfitting, we measure the effects of test suite coverage, test suite provenance, and starting program quality, as well as the difference in quality between novice-developer-written and tool-generated patches when quality is assessed with a test suite independent from the one used for patch generation.", "citation": "Citations (103)", "departments": ["University of Massachusetts Amherst", "University College London", "Carnegie Mellon University", "University of Massachusetts Amherst"], "authors": ["Edward K. Smith.....http://dblp.org/pers/hd/s/Smith:Edward_K=", "Earl T. Barr.....http://dblp.org/pers/hd/b/Barr:Earl_T=", "Claire Le Goues.....http://dblp.org/pers/hd/g/Goues:Claire_Le", "Yuriy Brun.....http://dblp.org/pers/hd/b/Brun:Yuriy"], "conf": "sigsoft", "year": "2015", "pages": 12}