{"title": "When, how, and why developers (do not) test in their IDEs.", "fields": ["computer science", "mockito", "software engineering", "unit testing", "software"], "abstract": "The research community in Software Engineering and Software Testing in particular builds many of its contributions on a set of mutually shared expectations. Despite the fact that they form the basis of many publications as well as open-source and commercial testing applications, these common expectations and beliefs are rarely ever questioned. For example, Frederic Brooks’ statement that testing takes half of the development time seems to have manifested itself within the community since he first made it in the “Mythical Man Month” in 1975. With this paper, we report on the surprising results of a large-scale field study with 416 software engineers whose development activity we closely monitored over the course of five months, resulting in over 13 years of recorded work time in their integrated development environments (IDEs). Our findings question several commonly shared assumptions and beliefs about testing and might be contributing factors to the observed bug proneness of software in practice: the majority of developers in our study does not test; developers rarely run their tests in the IDE; Test-Driven Development (TDD) is not widely practiced; and, last but not least, software developers only spend a quarter of their work time engineering tests, whereas they think they test half of their time.", "citation": "Citations (77)", "departments": ["Delft University of Technology", "Radboud University Nijmegen", "Delft University of Technology", "Delft University of Technology"], "authors": ["Moritz Beller.....http://dblp.org/pers/hd/b/Beller:Moritz", "Georgios Gousios.....http://dblp.org/pers/hd/g/Gousios:Georgios", "Annibale Panichella.....http://dblp.org/pers/hd/p/Panichella:Annibale", "Andy Zaidman.....http://dblp.org/pers/hd/z/Zaidman:Andy"], "conf": "sigsoft", "year": "2015", "pages": 12}