{"title": "The effect of visual display properties and gain presentation mode on the perceived naturalness of virtual walking speeds.", "fields": ["preferred walking speed", "naturalness", "distortion", "main effect", "treadmill"], "abstract": "Individuals tend to find realistic walking speeds too slow when relying on treadmill walking or Walking-In-Place (WIP) techniques for virtual travel. This paper details three studies investigating the effects of visual display properties and gain presentation mode on the perceived naturalness of virtual walking speeds: The first study compared three different degrees of peripheral occlusion; the second study compared three different degrees of perceptual distortion produced by varying the geometric field of view (GFOV); and the third study compared three different ways of presenting visual gains. All three studies compared treadmill walking and WIP locomotion. The first study revealed no significant main effects of peripheral occlusion. The second study revealed a significant main effect of GFOV, suggesting that the GFOV size may be inversely proportional to the degree of underestimation of the visual speed. The third study found a significant main effect of gain presentation mode. Allowing participants to interactively adjust the gain led to a smaller range of perceptually natural gains and this approach was significantly faster. However, the efficiency may come at the expense of confidence. Generally the lower and upper bounds of the perceptually natural speeds were higher for treadmill walking than WIP. However, not all differences were statistically significant.", "citation": "Citations (5)", "departments": ["Aalborg University", "Aalborg University", "Aalborg University"], "authors": ["Niels Christian Nilsson.....http://dblp.org/pers/hd/n/Nilsson:Niels_Christian", "Stefania Serafin.....http://dblp.org/pers/hd/s/Serafin:Stefania", "Rolf Nordahl.....http://dblp.org/pers/hd/n/Nordahl:Rolf"], "conf": "vr", "year": "2015", "pages": 8}