{"title": "StoryPivot: Comparing and Contrasting Story Evolution.", "fields": ["social media", "data mining", "crash", "ranging", "complex event processing"], "abstract": "As the world evolves around us, so does the digital coverage of it. Events of diverse types, associated with different actors and various locations, are continuously captured by multiple information sources such as news articles, blogs, social media etc. day by day. In the digital world, these events are represented through  information snippets  that contain information on the involved entities, a description of the event, when the event occurred, etc. In our work, we observe that events (and their corresponding digital representations) are often inter-connected, i.e., they form  stories  which represent evolving relationships between events over time. Take as an example the plane crash in Ukraine in July 2014 which involved multiple entities such as \"Ukraine\", \"Malaysia\", and \"Russia\" and multiple events ranging from the actual crash to the incident investigation and the presentation of the investigator's findings. In this demonstration we present StoryPivot, a framework that helps its users to detect evolving stories in event datasets over time. To resolve stories, we differentiate between  story identification , the problem of connecting events over time within a source, and  story alignment , the problem of integrating stories across sources. The goal of this demonstration is to present an interactive exploration of both these problems and how events can be dynamically interpreted and put into context in real-world datasets.", "citation": "Citations (1)", "year": "2015", "departments": ["ETH Zurich", "ETH Zurich", "University of Maryland, College Park", "AT&T Labs"], "conf": "sigmod", "authors": ["Anja Gruenheid.....http://dblp.org/pers/hd/g/Gruenheid:Anja", "Donald Kossmann.....http://dblp.org/pers/hd/k/Kossmann:Donald", "Theodoros Rekatsinas.....http://dblp.org/pers/hd/r/Rekatsinas:Theodoros", "Divesh Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Divesh"], "pages": 6}