{"title": "Parameterizing the Permanent: Genus, Apices, Minors, Evaluation Mod 2k.", "fields": ["triangle free graph", "apex graph", "pathwidth", "treewidth", "hadwiger number"], "abstract": "We identify and study relevant structural parameters for the problem of counting perfect matchings in a given input graph G. These generalize the well-known tractable planar case, and they include the genus of G, its apex number (the minimum number of vertices whose removal renders G planar), and its Hadwiger number (the size of a largest clique minor). To study these parameters, we first introduce the notion of combined match gates, a general technique that bridges parameterized counting problems and the theory of so-called Holants and match gates: Using combined match gates, we can simulate certain non-existing gadgets F as linear combinations of t=O(1) existing gadgets. If a graph G features k occurrences of F, we can then reduce G to tk graphs that feature only existing gadgets, thus enabling parameterized reductions. As applications of this technique, we simplify known 4g*n3 time algorithms for counting perfect matchings on graphs of genus g. Orthogonally to this, we show #W[1]-hardness of the permanent on k-apex graphs, implying its #W[1]-hardness under the Hadwiger number. Additionally, we rule out no(k/log k) time algorithms under the counting exponential-time hypothesis #ETH. Finally, we use combined match gates to prove parity-W[1]-hardness of evaluating the permanent modulo 2k, complementing an O(n4k) time algorithm by Valiant and answering an open question of Bjorklund. We also obtain a lower bound of na#x03A9;(k/log k) under the parity version of the exponential-time hypothesis.", "citation": "Citations (4)", "departments": ["Inst. for Compu ... dapest, Hungary", "State Key Lab.  ...  Beijing, China"], "authors": ["Radu Curticapean.....http://dblp.org/pers/hd/c/Curticapean:Radu", "Mingji Xia.....http://dblp.org/pers/hd/x/Xia:Mingji"], "conf": "focs", "year": "2015", "pages": 16}