{"title": "Heterogeneous memory architectures: A HW/SW approach for mixing die-stacked and off-package memories.", "fields": ["conventional memory", "uniform memory access", "registered memory", "cache only memory architecture", "interleaved memory"], "abstract": "Die-stacked DRAM is a technology that will soon be integrated in high-performance systems. Recent studies have focused on hardware caching techniques to make use of the stacked memory, but these approaches require complex changes to the processor and also cannot leverage the stacked memory to increase the system's overall memory capacity. In this work, we explore the challenges of exposing the stacked DRAM as part of the system's physical address space. This non-uniform access memory (NUMA) styled approach greatly simplifies the hardware and increases the physical memory capacity of the system, but pushes the burden of managing the heterogeneous memory architecture (HMA) to the software layers. We first explore simple (and somewhat impractical) schemes to manage the HMA, and then refine the mechanisms to address a variety of hardware and software implementation challenges. In the end, we present an HMA approach with low hardware and software impact that can dynamically tune itself to different application scenarios, achieving performance even better than the (impractical-to-implement) baseline approaches.", "citation": "Citations (84)", "departments": ["Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices"], "authors": ["Mitesh R. Meswani.....http://dblp.org/pers/hd/m/Meswani:Mitesh_R=", "Sergey Blagodurov.....http://dblp.org/pers/hd/b/Blagodurov:Sergey", "David Roberts.....http://dblp.org/pers/hd/r/Roberts:David", "John Slice.....http://dblp.org/pers/hd/s/Slice:John", "Mike Ignatowski.....http://dblp.org/pers/hd/i/Ignatowski:Mike", "Gabriel H. Loh.....http://dblp.org/pers/hd/l/Loh:Gabriel_H="], "conf": "hpca", "year": "2015", "pages": 11}