{"title": "Accelerating regular expression matching over compressed HTTP.", "fields": ["implementation", "regular expression", "deep packet inspection", "byte", "http compression"], "abstract": "This paper focuses on regular expression matching over compressed traffic. The need for such matching arises from two independent trends. First, the volume and share of compressed HTTP traffic is constantly increasing. Second, due to their superior expressibility, current Deep Packet Inspection engines use regular expressions more and more frequently. We present an algorithmic framework to accelerate such matching, taking advantage of information gathered when the traffic was initially compressed. HTTP compression is typically performed through the GZIP protocol, which uses back-references to repeated strings. Our algorithm is based on calculating (for every byte) the minimum number of (previous) bytes that can be part of a future regular expression matching. When inspecting a back-reference, only these bytes should be taken into account, thus enabling one to skip repeated strings almost entirely without missing a match. We show that our generic framework works with either NFA-based or DFA-based implementations and gains performance boosts of more than 70%. Moreover, it can be readily adapted to most existing regular expression matching algorithms, which usually are based either on NFA, DFA or combinations of the two. Finally, we discuss other applications in which calculating the number of relevant bytes becomes handy, even when the traffic is not compressed.", "citation": "Citations (5)", "departments": ["University of Missouri", "Interdisciplinary Center Herzliya", "Hebrew University of Jerusalem", "Interdisciplinary Center Herzliya", "Hebrew University of Jerusalem"], "authors": ["Michela Becchi.....http://dblp.org/pers/hd/b/Becchi:Michela", "Anat Bremler-Barr.....http://dblp.org/pers/hd/b/Bremler=Barr:Anat", "David Hay.....http://dblp.org/pers/hd/h/Hay:David", "Omer Kochba.....http://dblp.org/pers/hd/k/Kochba:Omer", "Yaron Koral.....http://dblp.org/pers/hd/k/Koral:Yaron"], "conf": "infocom", "year": "2015", "pages": 9}