{"title": "Weighted Coverage based Reviewer Assignment.", "fields": ["domain knowledge", "special case", "assignment problem", "exact algorithm", "greedy algorithm"], "abstract": "Peer reviewing is a standard process for assessing the quality of submissions at academic conferences and journals. A very important task in this process is the assignment of reviewers to papers. However, achieving an appropriate assignment is not easy, because all reviewers should have similar load and the subjects of the assigned papers should be consistent with the reviewers' expertise. In this paper, we propose a generalized framework for fair reviewer assignment. We first extract the domain knowledge from the reviewers' published papers and model this knowledge as a set of topics. Then, we perform a  group assignment  of reviewers to papers, which is a generalization of the classic Reviewer Assignment Problem (RAP), considering the relevance of the papers to topics as weights. We study a special case of the problem, where reviewers are to be found for just one paper (Journal Assignment Problem) and propose an exact algorithm which is fast in practice, as opposed to brute-force solutions. For the general case of having to assign multiple papers, which is too hard to be solved exactly, we propose a greedy algorithm that achieves a 1/2-approximation ratio compared to the exact solution. This is a great improvement compared to the 1/3-approximation solution proposed in previous work for the simpler coverage-based reviewer assignment problem, where there are no weights on topics. We theoretically prove the approximation bound of our solution and experimentally show that it is superior to the current state-of-the-art.", "citation": "Citations (15)", "year": "2015", "departments": ["University of Macau", "University of Macau", "University of Hong Kong", "University of Macau"], "conf": "sigmod", "authors": ["Ngai Meng Kou.....http://dblp.org/pers/hd/k/Kou:Ngai_Meng", "Leong Hou U.....http://dblp.org/pers/hd/u/U:Leong_Hou", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos", "Zhiguo Gong.....http://dblp.org/pers/hd/g/Gong:Zhiguo"], "pages": 16}