{"title": "Biologically Inspired Media Quality Modeling.", "fields": ["contextual image classification", "statistical model", "active learning", "visual perception", "automatic summarization"], "abstract": "A successful quality model is indispensable in a rich variety of multimedia applications, e.g., image classification and video summarization. Conventional approaches have developed many features to assess media quality at both low-level and high-level. However, they cannot reflect the process of human visual cortex in media perception. It is generally accepted that an ideal quality model should be biologically plausible, i.e., capable of mimicking human gaze shifting as well as the complicated visual cognition. In this paper, we propose a biologically inspired quality model, focusing on interpreting how humans perceive visually and semantically important regions in an image (or a video clip). Particularly, we first extract local descriptors (graphlets in this work) from an image/frame. They are projected onto the perceptual space, which is built upon a set of low-level and high-level visual features. Then, an active learning algorithm is utilized to select graphlets that are both visually and semantically salient. The algorithm is based on the observation that each graphlet can be linearly reconstructed by its surrounding ones, and spatially nearer ones make a greater contribution. In this way, both the local and global geometric properties of an image/frame can be encoded in the selection process. These selected graphlets are linked into a so-called biological viewing path (BVP) to simulate human visual perception. Finally, the quality of an image or a video clip is predicted by a probabilistic model. Experiments shown that 1) the predicted BVPs are over 90% consistent with real human gaze shifting paths on average; and 2) our quality model outperforms many of its competitors remarkably.", "citation": "Citations (10)", "departments": ["Hefei University of Technology", "Hefei University of Technology", "National University of Singapore", "Hefei University of Technology", "Zhejiang University"], "authors": ["Luming Zhang.....http://dblp.org/pers/hd/z/Zhang:Luming", "Meng Wang.....http://dblp.org/pers/hd/w/Wang_0001:Meng", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Richang Hong.....http://dblp.org/pers/hd/h/Hong:Richang", "Yingjie Xia.....http://dblp.org/pers/hd/x/Xia:Yingjie", "Roger Zimmermann.....http://dblp.org/pers/hd/z/Zimmermann:Roger"], "conf": "mm", "year": "2015", "pages": 10}