{"title": "Beyond one-dollar mouse: A battery-free device for 3D human-computer interaction via RFID tags.", "fields": ["battery", "liberian dollar", "extended kalman filter", "antenna", "ambiguity"], "abstract": "For today's computer users, the mouse plays such an important role that it dominates the interaction interface in personal computer for nearly half a century since it was invented. However, the mouse is gradually unfit for the demand of modern 3D display techniques, e.g. 3D-projection or -screen, for the reason that the relevant interactions are confined in a surface. Although some new methods such as computer vision based techniques attempt to bridge the human-computer barrier, they suffer from many limitations such as ambiguity in multitargets and dependence on light. This paper presents a battery-free device called Tagball for 3D human-computer interaction via RFID tags. Tagball devises a control ball, on which N passive tags are attached, for users to generate two basic kinds of interactive commands: translation and rotation. Instead of locating N tags independently, we model the ball as a whole in a more cooperative way under the circumstance that their geometric relationships are known in advance. In addition, we consider the phase values measured by M RF antennas for these N tags as observations of the ball state. Our key innovations are the studies on motion behaviors of a group of tags by using Extended Kalman Filter, and the implementation based on purely Commercial Off-The-Shelf (COTS) RFID products. The systematical evaluation shows that Tagball traces the ball translation to 1.5cm and identifies ball orientation to 1.8° in 3D space.", "citation": "Citations (10)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Qiongzheng Lin.....http://dblp.org/pers/hd/l/Lin:Qiongzheng", "Lei Yang.....http://dblp.org/pers/hd/y/Yang_0025:Lei", "Yuxin Sun.....http://dblp.org/pers/hd/s/Sun:Yuxin", "Tianci Liu.....http://dblp.org/pers/hd/l/Liu:Tianci", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2015", "pages": 9}