{"title": "Detecting JavaScript races that matter.", "fields": ["asynchrony", "real time computing", "javascript", "overhead", "web application"], "abstract": "As JavaScript has become virtually omnipresent as the language for programming large and complex web applications in the last several years, we have seen an increase in interest in finding data races in client-side JavaScript. While JavaScript execution is single-threaded, there is still enough potential for data races, created largely by the non-determinism of the scheduler. Recently, several academic efforts have explored both static and run-time analysis approaches in an effort to find data races. However, despite this, we have not seen these analysis techniques deployed in practice and we have only seen scarce evidence that developers find and fix bugs related to data races in JavaScript. In this paper we argue for a different formulation of what it means to have a data race in a JavaScript application and distinguish between benign and harmful races, affecting persistent browser or server state. We further argue that while benign races — the subject of the majority of prior work — do exist, harmful races are exceedingly rare in practice (19 harmful vs. 621 benign). Our results shed a new light on the issues of data race prevalence and importance. To find races, we also propose a novel lightweight run-time symbolic exploration algorithm for finding races in traces of run-time execution. Our algorithm eschews schedule exploration in favor of smaller run-time overheads and thus can be used by beta testers or in crowd-sourced testing. In our experiments on 26 sites, we demonstrate that benign races are considerably more common than harmful ones.", "citation": "Citations (11)", "departments": ["Koç University", "Koç University", "Microsoft"], "authors": ["Erdal Mutlu.....http://dblp.org/pers/hd/m/Mutlu:Erdal", "Serdar Tasiran.....http://dblp.org/pers/hd/t/Tasiran:Serdar", "Benjamin Livshits.....http://dblp.org/pers/hd/l/Livshits:Benjamin"], "conf": "sigsoft", "year": "2015", "pages": 12}