{"title": "Automatic Image Dataset Construction from Click-through Logs Using Deep Neural Network.", "fields": ["click through rate", "supervised learning", "convolutional neural network", "deep learning", "automatic image annotation"], "abstract": "Labelled image datasets are the backbone for high-level image understanding tasks with wide application scenarios, and continuously drive and evaluate the progress of feature designing and supervised learning models. Recently, the million scale labelled image dataset further contributes to the rebirth of deep convolutional neural network and bypass manual designing handcraft features. However, the construction process of image dataset is mainly manual-based and quite labor intensive, which often take years' efforts to construct a million scale dataset with high quality. In this paper, we propose a deep learning based method to construct large scale image dataset in an automatic way. Specifically, word representation and image representation are learned in a deep neural network from large amount of click-through logs, and further used to define word-word similarity and image-word similarity. These two similarities are used to automatize the two labor intensive steps in manual-based image dataset construction: query formation and noisy image removal. With a new proposed cross convolutional filter regularizer, we can construct a million scale image dataset in one week. Finally, two image datasets are constructed to verify the effectiveness of the method. In addition to scale, the automatically constructed dataset has comparable accuracy, diversity and cross-dataset generalization with manually labelled image datasets.", "citation": "Citations (16)", "departments": ["Harbin Institute of Technology", "Microsoft", "Harbin Institute of Technology", "Nankai University", "Microsoft"], "authors": ["Yalong Bai.....http://dblp.org/pers/hd/b/Bai:Yalong", "Kuiyuan Yang.....http://dblp.org/pers/hd/y/Yang:Kuiyuan", "Wei Yu.....http://dblp.org/pers/hd/y/Yu_0004:Wei", "Chang Xu.....http://dblp.org/pers/hd/x/Xu:Chang", "Wei-Ying Ma.....http://dblp.org/pers/hd/m/Ma:Wei=Ying", "Tiejun Zhao.....http://dblp.org/pers/hd/z/Zhao:Tiejun"], "conf": "mm", "year": "2015", "pages": 10}