{"title": "Paper-Digital Workflows in Global Development Organizations.", "fields": ["human computer interaction", "management science", "affordance", "international development", "workflow"], "abstract": "Global development organizations rely on the essential affordances provided by both paper and digital materials to navigate hurdles posed by poor infrastructure, low connectivity, linguistic differences, and other socioeconomic constraints that render communication and collaboration challenging. This paper examines the collaborative practices around paper-digital workflows within global development organizations operating in low-resource environments. We use a mixed methods approach to gather data from 23 organizations in 16 countries. Our findings show the tensions that arise between the ubiquitousness of paper and the desirability of digitized data, and highlight the challenges associated with transitioning information several times between paper and digital materials. We also reveal design opportunities for new tools to bridge the gap between paper-based and digital information in low-resource settings. Finally, we contribute a nuanced understanding of the cross-cultural and infrastructural challenges that influence the paper-digital lifecycle. Our findings will be useful for researchers and practitioners interested in understanding or participating in the workflows that drive global development.", "citation": "Citations (8)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "Village Reach,  ... eattle, WA, USA"], "authors": ["Nicola Dell.....http://dblp.org/pers/hd/d/Dell:Nicola", "Trevor Perrier.....http://dblp.org/pers/hd/p/Perrier:Trevor", "Neha Kumar.....http://dblp.org/pers/hd/k/Kumar:Neha", "Mitchell Lee.....http://dblp.org/pers/hd/l/Lee:Mitchell", "Rachel Powers.....http://dblp.org/pers/hd/p/Powers:Rachel", "Gaetano Borriello.....http://dblp.org/pers/hd/b/Borriello:Gaetano"], "conf": "cscw", "year": "2015", "pages": 11}