{"title": "PandaSearch: A fine-grained academic search engine for research documents.", "fields": ["phrase search", "query expansion", "semantic search", "search analytics", "search engine optimization"], "abstract": "In the world of academia, research documents enable the sharing and dissemination of scientific discoveries. During these “big data” times, academic search engines are widely used to find the relevant research documents. Considering the domain of computer science, a researcher often inputs a query with a specific goal to find an algorithm or a theorem. However, to this date, the return result of most search engines is just as a list of related papers. Users have to browse the results, download the interesting papers and look for the desired information, which is obviously laborious and inefficient. In this paper, we present a novel academic search system, called PandaSearch, that returns the results with a fine-grained interface, where the results are well organized by different categories, such as definitions, theorems, lemmas, algorithms and figures. The key technical challenges in our system include the automatic identification and extraction of different parts in a research document, the discovery of the main topic phrases for a definition or a theorem, and the recommendation of related definitions or figures to elegantly satisfy the search intention of users. Based on this, we have built a user friendly search interface for users to conveniently explore the documents, and find the relevant information.", "citation": "Citations (5)", "departments": ["Renmin University of China", "Renmin University of China", "Renmin University of China", "National University of Singapore", "Renmin University of China"], "authors": ["Feiran Huang.....http://dblp.org/pers/hd/h/Huang:Feiran", "Jia Li.....http://dblp.org/pers/hd/l/Li:Jia", "Jiaheng Lu.....http://dblp.org/pers/hd/l/Lu:Jiaheng", "Tok Wang Ling.....http://dblp.org/pers/hd/l/Ling:Tok_Wang", "Zhaoan Dong.....http://dblp.org/pers/hd/d/Dong:Zhaoan"], "conf": "icde", "year": "2015", "pages": 4}