{"title": "VIP: virtualizing IP chains on handheld platforms.", "fields": ["nexus", "multi core processor", "virtualization", "orchestration", "central processing unit"], "abstract": "Energy-efficient user-interactive and display-oriented applications on handhelds rely heavily on multiple accelerators (termed IP cores) to meet their periodic frame processing needs. Further, these platforms are starting to host multiple applications concurrently on the multiple CPU cores. Unfortunately, today's hardware exposes an interface that forces the host software (Android drivers) to treat each IP core as an isolated device. Consequently, the host CPU has to get involved in the (i) processing of each frame, (ii) scheduling them to ensure timely progress through the IP cores to meet their QoS needs, and (iii) explicitly having to move data from one IP core to the next, with main memory serving as the common staging area.   We show in this paper through measurements on a Nexus 7 platform that the frequent invocation of the CPU for processing these frames and the involvement of main memory as a data flow conduit, are serious limitations. Instead, we propose a novel IP virtualization framework (VIP), involving three key ideas that allow several IPs to be chained together and made to appear to the software as a single device. First, chaining of IPs avoids data transfer through the memory system, enhancing the throughput of flows through the IPs. Second, by using a burst-mode, the CPU can initiate the processing of several frames through the virtual IP chain, without getting involved (and interrupted) for each frame, thereby allowing better energy saving and utilization opportunities. Removing the CPU from this loop, requires alternate orchestration of frame flows to ensure QoS guarantees for each frame of each application. Our third enhancement in VIP creates several virtual paths, one for each flow, through these IP chains with the hardware scheduling the frames to enforce QoS guarantees despite any contention for resources along the way. Our experimental evaluations demonstrate the effectiveness of VIP on energy consumption and QoS for multiple applications.", "citation": "Citations (7)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University", "Intel", "Pennsylvania State University"], "authors": ["Nachiappan Chidambaram Nachiappan.....http://dblp.org/pers/hd/n/Nachiappan:Nachiappan_Chidambaram", "Haibo Zhang.....http://dblp.org/pers/hd/z/Zhang:Haibo", "Jihyun Ryoo.....http://dblp.org/pers/hd/r/Ryoo:Jihyun", "Niranjan Soundararajan.....http://dblp.org/pers/hd/s/Soundararajan:Niranjan", "Anand Sivasubramaniam.....http://dblp.org/pers/hd/s/Sivasubramaniam:Anand", "Mahmut T. Kandemir.....http://dblp.org/pers/hd/k/Kandemir:Mahmut_T=", "Ravishankar R. Iyer.....http://dblp.org/pers/hd/i/Iyer:Ravishankar_R=", "Chita R. Das.....http://dblp.org/pers/hd/d/Das:Chita_R="], "conf": "isca", "year": "2015", "pages": 13}