{"title": "Heterogeneous statistical QoS provisioning over 5G wireless full-duplex networks.", "fields": ["spectral efficiency", "radio resource management", "heterogeneous network", "key distribution in wireless sensor networks", "mobile qos"], "abstract": "Recently, both academia and industry are moving their research attention to the fifth-generation (5G) wireless networks — the next new era of wireless networks. The wireless full-duplex transmission, as one of promising candidate techniques for 5G, can significantly boost the spectrum efficiency of the wireless networks, thus providing a powerful thrust to optimize the quality-of-service (QoS) performances for the wireless networks. However, due to the heterogeneity caused by different types of simultaneous traffics over the wireless full-duplex link, supporting QoS guarantees for wireless full-duplex networks imposes the new challenges that we need to provide heterogeneous QoS guarantees for different types of traffics over the same link simultaneously. To overcome the aforementioned problems, in this paper we propose the heterogeneous statistical QoS provisioning framework for bidirectional transmission based wireless full-duplex networks. In particular, we formulate the optimization problems to maximize the system throughput subject to heterogeneous statistical delay-bound QoS requirements. Then, we convert the resulted non-convex optimization problem into an equivalent convex optimization problem, solving which we can derive the optimal QoS-driven power allocation scheme to maximize the system throughput while guaranteeing the heterogeneous statistical delay-bound QoS requirements. The extensive simulation results obtained show that our proposed QoS-driven power allocation scheme for heterogeneous statistical delay-bound QoS requirements can achieve larger aggregate system throughput than the scheme for the homogeneous statistical delay-bound QoS requirement over 5G mobile wireless full-duplex networks.", "citation": "Citations (11)", "departments": ["Xidian University", "Texas A&M University", "Xidian University"], "authors": ["Wenchi Cheng.....http://dblp.org/pers/hd/c/Cheng:Wenchi", "Xi Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Xi", "Hailin Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Hailin"], "conf": "infocom", "year": "2015", "pages": 9}