{"title": "Tempura: Temporal Dimension for IDEs.", "fields": ["search engine indexing", "mobile device", "scalability", "plug in", "usability"], "abstract": "Modern integrated development environments (IDEs) make many software engineering tasks easier by providing automated programming support such as code completion and navigation. However, such support -- and therefore IDEs as a whole -- operate on  one revision of the code at a time , and leave handling of code history to external tools or plugins, such as EGit for Eclipse. For example, when a method is removed from a class, developers can no longer find the method through code completion. This forces developers to manually switch across different revisions or resort to using external tools when they need to learn about previous code revisions.   We propose a novel approach of adding a temporal dimension to IDEs, enabling code completion and navigation to operate on  multiple revisions of code at a time.  We previously introduced the idea of temporal code completion and navigation, and presented a vision for how that idea may be realized. This paper realizes that vision by implementing and evaluating a prototype tool called Tempura. We describe our algorithm for processing and indexing historical code information from repositories for Tempura, and demonstrate Tempura's scalability with three large Eclipse projects. We also evaluate Tempura's usability through a controlled user study. The study participants learned about the code history with more accuracy when using Tempura compared to EGit. Although the sample size was not large enough to provide strong statistical significance, the results show a promising outlook for our approach.", "citation": "Citations (1)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Yun Young Lee.....http://dblp.org/pers/hd/l/Lee:Yun_Young", "Darko Marinov.....http://dblp.org/pers/hd/m/Marinov:Darko", "Ralph E. Johnson.....http://dblp.org/pers/hd/j/Johnson:Ralph_E="], "conf": "icse", "year": "2015", "pages": 11}