{"title": "CIVL: the concurrency intermediate verification language.", "fields": ["pointer", "deadlock", "non lock concurrency control", "software verification", "concurrency"], "abstract": "There are many ways to express parallel programs: message-passing libraries (MPI) and multithreading/GPU language extensions such as OpenMP, Pthreads, and CUDA, are but a few. This multitude creates a serious challenge for developers of software verification tools: it takes enormous effort to develop such tools, but each development effort typically targets one small part of the concurrency landscape, with little sharing of techniques and code among efforts. To address this problem, we present  CIVL: the Concurrency Intermediate Verification Language.  CIVL provides a general concurrency model capable of representing programs in a variety of concurrency dialects, including those listed above. The CIVL framework currently includes front-ends for the four dialects, and a back-end verifier which uses model checking and symbolic execution to check a number of properties, including the absence of deadlocks, race conditions, assertion violations, illegal pointer dereferences and arithmetic, memory leaks, divisions by zero, and out-of-bound array indexing; it can also check that two programs are functionally equivalent.", "citation": "Citations (17)", "year": "2015", "departments": ["University of Delaware", "University of Delaware", "University of Delaware", "University of Delaware", "University of Delaware"], "conf": "sc", "authors": ["Stephen F. Siegel.....http://dblp.org/pers/hd/s/Siegel:Stephen_F=", "Manchun Zheng.....http://dblp.org/pers/hd/z/Zheng:Manchun", "Ziqing Luo.....http://dblp.org/pers/hd/l/Luo:Ziqing", "Timothy K. Zirkel.....http://dblp.org/pers/hd/z/Zirkel:Timothy_K=", "Andre V. Marianiello.....http://dblp.org/pers/hd/m/Marianiello:Andre_V=", "John G. Edenhofner.....http://dblp.org/pers/hd/e/Edenhofner:John_G=", "Matthew B. Dwyer.....http://dblp.org/pers/hd/d/Dwyer:Matthew_B=", "Michael S. Rogers.....http://dblp.org/pers/hd/r/Rogers:Michael_S="], "pages": 12}