{"title": "Describing Videos by Exploiting Temporal Structure.", "fields": ["bleu", "machine learning", "convolutional neural network", "recurrent neural network", "natural language"], "abstract": "Recent progress in using recurrent neural networks (RNNs) for image description has motivated the exploration of their application for video description. However, while images are static, working with videos requires modeling their dynamic temporal structure and then properly integrating that information into a natural language description model. In this context, we propose an approach that successfully takes into account both the local and global temporal structure of videos to produce descriptions. First, our approach incorporates a spatial temporal 3-D convolutional neural network (3-D CNN) representation of the short temporal dynamics. The 3-D CNN representation is trained on video action recognition tasks, so as to produce a representation that is tuned to human motion and behavior. Second we propose a temporal attention mechanism that allows to go beyond local temporal modeling and learns to automatically select the most relevant temporal segments given the text-generating RNN. Our approach exceeds the current state-of-art for both BLEU and METEOR metrics on the Youtube2Text dataset. We also present results on a new, larger and more challenging dataset of paired video and natural language descriptions.", "citation": "Citations (426)", "year": "2015", "departments": ["École Polytechnique de Montréal", "École Polytechnique de Montréal", "Université de Montréal", "École Polytechnique de Montréal", "École Polytechnique de Montréal"], "conf": "iccv", "authors": ["Li Yao.....http://dblp.org/pers/hd/y/Yao:Li", "Atousa Torabi.....http://dblp.org/pers/hd/t/Torabi:Atousa", "Kyunghyun Cho.....http://dblp.org/pers/hd/c/Cho:Kyunghyun", "Nicolas Ballas.....http://dblp.org/pers/hd/b/Ballas:Nicolas", "Christopher J. Pal.....http://dblp.org/pers/hd/p/Pal:Christopher_J=", "Hugo Larochelle.....http://dblp.org/pers/hd/l/Larochelle:Hugo", "Aaron C. Courville.....http://dblp.org/pers/hd/c/Courville:Aaron_C="], "pages": 9}