{"title": "Parallel implementation and performance optimization of the configuration-interaction method.", "fields": ["thread", "memory bandwidth", "configuration interaction", "sparse matrix", "lanczos resampling"], "abstract": "The  configuration-interaction  (CI) method, long a popular approach to describe quantum many-body systems, is cast as a very large sparse matrix eigenpair problem with matrices whose dimension can exceed one billion. Such formulations place high demands on memory capacity and memory bandwidth --- two quantities at a premium today. In this paper, we describe an efficient, scalable implementation, BIGSTICK, which, by factorizing both the basis and the interaction into two levels, can reconstruct the nonzero matrix elements on the fly, reduce the memory requirements by one or two orders of magnitude, and enable researchers to trade reduced resources for increased computational time. We optimize BIGSTICK on two leading HPC platforms --- the Cray XC30 and the IBM Blue Gene/Q. Specifically, we not only develop an empirically-driven load balancing strategy that can evenly distribute the matrix-vector multiplication across 256K threads, we also developed techniques that improve the performance of the Lanczos reorthogonalization. Combined, these optimizations improved performance by 1.3-8× depending on platform and configuration.", "citation": "Citations (3)", "year": "2015", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "San Diego State University", "University of California, Berkeley", "Lawrence Livermore National Laboratory"], "conf": "sc", "authors": ["Hongzhang Shan.....http://dblp.org/pers/hd/s/Shan:Hongzhang", "Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel", "Calvin W. Johnson.....http://dblp.org/pers/hd/j/Johnson:Calvin_W=", "Kenneth S. McElvain.....http://dblp.org/pers/hd/m/McElvain:Kenneth_S=", "W. Erich Ormand.....http://dblp.org/pers/hd/o/Ormand:W=_Erich"], "pages": 12}