{"title": "Imperfect Forward Secrecy: How Diffie-Hellman Fails in Practice.", "fields": ["forward secrecy", "logjam", "precomputation", "small number", "diffie hellman key exchange"], "abstract": "We investigate the security of Diffie-Hellman key exchange as used in popular Internet protocols and find it to be less secure than widely believed. First, we present Logjam, a novel flaw in TLS that lets a man-in-the-middle downgrade connections to \"export-grade\" Diffie-Hellman. To carry out this attack, we implement the number field sieve discrete log algorithm. After a week-long precomputation for a specified 512-bit group, we can compute arbitrary discrete logs in that group in about a minute. We find that 82% of vulnerable servers use a single 512-bit group, allowing us to compromise connections to 7% of Alexa Top Million HTTPS sites. In response, major browsers are being changed to reject short groups. We go on to consider Diffie-Hellman with 768- and 1024-bit groups. We estimate that even in the 1024-bit case, the computations are plausible given nation-state resources. A small number of fixed or standardized groups are used by millions of servers; performing precomputation for a single 1024-bit group would allow passive eavesdropping on 18% of popular HTTPS sites, and a second group would allow decryption of traffic to 66% of IPsec VPNs and 26% of SSH servers. A close reading of published NSA leaks shows that the agency's attacks on VPNs are consistent with having achieved such a break. We conclude that moving to stronger key exchange methods should be a priority for the Internet community.", "citation": "Citations (270)", "year": "2015", "departments": ["University of Michigan", "French Institute for Research in Computer Science and Automation", "University of Michigan", "University of Lorraine", "Johns Hopkins University"], "conf": "ccs", "authors": ["David Adrian.....http://dblp.org/pers/hd/a/Adrian:David", "Karthikeyan Bhargavan.....http://dblp.org/pers/hd/b/Bhargavan:Karthikeyan", "Zakir Durumeric.....http://dblp.org/pers/hd/d/Durumeric:Zakir", "Pierrick Gaudry.....http://dblp.org/pers/hd/g/Gaudry:Pierrick", "Matthew Green.....http://dblp.org/pers/hd/g/Green_0001:Matthew", "J. Alex Halderman.....http://dblp.org/pers/hd/h/Halderman:J=_Alex", "Nadia Heninger.....http://dblp.org/pers/hd/h/Heninger:Nadia", "Drew Springall.....http://dblp.org/pers/hd/s/Springall:Drew", "Emmanuel Thomé.....http://dblp.org/pers/hd/t/Thom=eacute=:Emmanuel", "Luke Valenta.....http://dblp.org/pers/hd/v/Valenta:Luke", "Benjamin VanderSloot.....http://dblp.org/pers/hd/v/VanderSloot:Benjamin", "Eric Wustrow.....http://dblp.org/pers/hd/w/Wustrow:Eric", "Santiago Zanella Béguelin.....http://dblp.org/pers/hd/b/B=eacute=guelin:Santiago_Zanella", "Paul Zimmermann.....http://dblp.org/pers/hd/z/Zimmermann:Paul"], "pages": 13}