{"title": "Architecting to achieve a billion requests per second throughput on a single key-value store server platform.", "fields": ["implementation", "concurrency control", "exploit", "power management", "throughput"], "abstract": "Distributed in-memory key-value stores (KVSs), such as memcached, have become a critical data serving layer in modern Internet-oriented datacenter infrastructure. Their performance and efficiency directly affect the QoS of web services and the efficiency of datacenters. Traditionally, these systems have had significant overheads from inefficient network processing, OS kernel involvement, and concurrency control. Two recent research thrusts have focused upon improving key-value performance. Hardware-centric research has started to explore specialized platforms including FPGAs for KVSs; results demonstrated an order of magnitude increase in throughput and energy efficiency over stock memcached. Software-centric research revisited the KVS application to address fundamental software bottlenecks and to exploit the full potential of modern commodity hardware; these efforts too showed orders of magnitude improvement over stock memcached.   We aim at architecting high performance and efficient KVS platforms, and start with a rigorous architectural characterization across system stacks over a collection of representative KVS implementations. Our detailed full-system characterization not only identifies the critical hardware/software ingredients for high-performance KVS systems, but also leads to guided optimizations atop a recent design to achieve a record-setting throughput of 120 million requests per second (MRPS) on a single commodity server. Our implementation delivers 9.2X the performance (RPS) and 2.8X the system energy efficiency (RPS/watt) of the best-published FPGA-based claims. We craft a set of design principles for future platform architectures, and via detailed simulations demonstrate the capability of achieving a billion RPS with a single server constructed following our principles.", "citation": "Citations (68)", "departments": ["Intel", "Carnegie Mellon University", "Intel", "Seoul National University", "Carnegie Mellon University"], "authors": ["Sheng Li.....http://dblp.org/pers/hd/l/Li_0007:Sheng", "Hyeontaek Lim.....http://dblp.org/pers/hd/l/Lim:Hyeontaek", "Victor W. Lee.....http://dblp.org/pers/hd/l/Lee:Victor_W=", "Jung Ho Ahn.....http://dblp.org/pers/hd/a/Ahn:Jung_Ho", "Anuj Kalia.....http://dblp.org/pers/hd/k/Kalia:Anuj", "Michael Kaminsky.....http://dblp.org/pers/hd/k/Kaminsky:Michael", "David G. Andersen.....http://dblp.org/pers/hd/a/Andersen:David_G=", "Seongil O.....http://dblp.org/pers/hd/o/O:Seongil", "Sukhan Lee.....http://dblp.org/pers/hd/l/Lee:Sukhan", "Pradeep Dubey.....http://dblp.org/pers/hd/d/Dubey:Pradeep"], "conf": "isca", "year": "2015", "pages": 13}