{"title": "Learning Analysis-by-Synthesis for 6D Pose Estimation in RGB-D Images.", "fields": ["rgb color model", "pose", "convolutional neural network", "speech coding", "3d pose estimation"], "abstract": "Analysis-by-synthesis has been a successful approach for many tasks in computer vision, such as 6D pose estimation of an object in an RGB-D image which is the topic of this work. The idea is to compare the observation with the output of a forward process, such as a rendered image of the object of interest in a particular pose. Due to occlusion or complicated sensor noise, it can be difficult to perform this comparison in a meaningful way. We propose an approach that \"learns to compare\", while taking these difficulties into account. This is done by describing the posterior density of a particular object pose with a convolutional neural network (CNN) that compares observed and rendered images. The network is trained with the maximum likelihood paradigm. We observe empirically that the CNN does not specialize to the geometry or appearance of specific objects. It can be used with objects of vastly different shapes and appearances, and in different backgrounds. Compared to state-of-the-art, we demonstrate a significant improvement on two different datasets which include a total of eleven objects, cluttered background, and heavy occlusion.", "citation": "Citations (65)", "year": "2015", "departments": ["Tech. Univ. Dre ... resden, Germany", "Tech. Univ. Dre ... resden, Germany", "Tech. Univ. Dre ... resden, Germany", "Tech. Univ. Dre ... resden, Germany", "Tech. Univ. Dre ... resden, Germany"], "conf": "iccv", "authors": ["Alexander Krull.....http://dblp.org/pers/hd/k/Krull:Alexander", "Eric Brachmann.....http://dblp.org/pers/hd/b/Brachmann:Eric", "Frank Michel.....http://dblp.org/pers/hd/m/Michel:Frank", "Michael Ying Yang.....http://dblp.org/pers/hd/y/Yang:Michael_Ying", "Stefan Gumhold.....http://dblp.org/pers/hd/g/Gumhold:Stefan", "Carsten Rother.....http://dblp.org/pers/hd/r/Rother:Carsten"], "pages": 9}