{"title": "Common Sense Reasoning for Detection, Prevention, and Mitigation of Cyberbullying (Extended Abstract).", "fields": ["social network analysis", "everyday life", "commonsense knowledge", "commonsense reasoning", "dashboard"], "abstract": "We present an approach for cyberbullying detection based on state-of-the-art text classification and a common sense knowledge base, which permits recognition over a broad spectrum of topics in everyday life. We analyze a more narrow range of particular subject matter associated with bullying and construct BullySpace, a common sense knowledge base that encodes particular knowledge about bullying situations. We then perform joint reasoning with common sense knowledge about a wide range of everyday life topics. We analyze messages using our novel AnalogySpace common sense reasoning technique. We also take into account social network analysis and other factors. We evaluate the model on real-world instances that have been reported by users on Formspring, a social networking website that is popular with teenagers. On the intervention side, we explore a set of reflective userinteraction paradigms with the goal of promoting empathy among social network participants. We propose an air traffic control-like dashboard, which alerts moderators to large-scale outbreaks that appear to be escalating or spreading and helps them prioritize the current deluge of user complaints. For potential victims, we provide educational material that informs them about how to cope with the situation, and connects them with emotional support from others. A user evaluation shows that incontext, targeted, and dynamic help during cyberbullying situations fosters end-user reflection that promotes better coping strategies.", "citation": "Not cited", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Karthik Dinakar.....http://dblp.org/pers/hd/d/Dinakar:Karthik", "Rosalind W. Picard.....http://dblp.org/pers/hd/p/Picard:Rosalind_W=", "Henry Lieberman.....http://dblp.org/pers/hd/l/Lieberman:Henry"], "conf": "ijcai", "year": "2015", "pages": 5}