{"title": "More load, more differentiation - A design principle for deadline-aware congestion control.", "fields": ["data center", "bandwidth allocation", "network traffic control", "testbed", "network performance"], "abstract": "Data center network has become an important facility for hosting various online services and applications, and thus its performance and underlying technologies are attracting more and more interests. In order to achieve better network performance, recent studies have proposed to tailor data center network traffic management in different aspects, devising various routing and transport schemes. In particular, for applications that must serve users in a timely manner, strict deadlines for their internal traffic flows should be met, and are explicitly taken into consideration in some latest flow rate control or scheduling algorithms in data center networks. In this paper, we advocate that when designing such deadline-aware rate control schemes, a simple principle should be followed: flows with different deadlines should be differentiated in their bandwidth allocation/occupation, and the more traffic load, the more differentiation should be made. We derive sufficient and necessary conditions for a flow rate control scheme to follow this principle, and present a simple congestion control algorithm called Load Proportional Differentiation (LPD) as its application. We have evaluated LPD under different topologies and load scenarios, both by simulation and in real testbed. Our results show that LPD nearly always outperforms D 2 TCP, a latest deadline-aware rate control scheme, and often reduces the number of flows missing their deadlines by more than 50%. We also give some other applications of this principle, for example, in reducing flow completion time.", "citation": "Citations (6)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Han Zhang.....http://dblp.org/pers/hd/z/Zhang:Han", "Xingang Shi.....http://dblp.org/pers/hd/s/Shi:Xingang", "Xia Yin.....http://dblp.org/pers/hd/y/Yin:Xia", "Fengyuan Ren.....http://dblp.org/pers/hd/r/Ren:Fengyuan", "Zhiliang Wang.....http://dblp.org/pers/hd/w/Wang:Zhiliang"], "conf": "infocom", "year": "2015", "pages": 9}