{"title": "Understanding contention-based channels and using them for defense.", "fields": ["abstraction", "covert channel", "virtualization", "eavesdropping", "channel"], "abstract": "Microarchitectural resources such as caches and predictors can be used to leak information across security domains. Significant prior work has demonstrated attacks and defenses for specific types of such microarchitectural side and covert channels. In this paper, we introduce a general mathematical study of microarchitectural channels using information theory. Our conceptual contribution is a simple mathematical abstraction that captures the common characteristics of all microarchitectural channels. We call this the Bucket model and it reveals that microarchitectural channels are fundamentally different from side and covert channels in networking. We then quantify the communication capacity of several microarchitectural covert channels (including channels that rely on performance counters, AES hardware and memory buses) and measure bandwidths across both KVM based heavy-weight virtualization and light-weight operating-system level isolation. We demonstrate channel capacities that are orders of magnitude higher compared to what was previously considered possible. Finally, we introduce a novel way of detecting intelligent adversaries that try to hide while running covert channel eavesdropping attacks. Our method generalizes a prior detection scheme (that modeled static adversaries) by introducing noise that hides the detection process from an intelligent eavesdropper.", "citation": "Citations (19)", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Casen Hunger.....http://dblp.org/pers/hd/h/Hunger:Casen", "Mikhail Kazdagli.....http://dblp.org/pers/hd/k/Kazdagli:Mikhail", "Ankit Singh Rawat.....http://dblp.org/pers/hd/r/Rawat:Ankit_Singh", "Alexandros G. Dimakis.....http://dblp.org/pers/hd/d/Dimakis:Alexandros_G=", "Sriram Vishwanath.....http://dblp.org/pers/hd/v/Vishwanath:Sriram", "Mohit Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Mohit"], "conf": "hpca", "year": "2015", "pages": 12}