{"title": "Enhancing the Quality of Interactive Multimedia Services by Proactive Monitoring and Failure Prediction.", "fields": ["interactive media", "sound quality", "overhead", "mean opinion score", "mobile qos"], "abstract": "Online multimedia communication services, such as Skype and Google Hangout, are used by millions of users every day. Although these services provide acceptable quality on average, users occasionally suffer from reduced audio quality, dropped video streams, and even failed sessions. To mitigate some of these problems, service providers closely monitor the performance of different parts of the system. However, most current techniques for monitoring and managing the quality of service (QoS) of online multimedia communication services are reactive and lack the ability to adapt to dynamic changes in real time. We propose a novel  proactive  approach for continuously monitoring the health of large-scale multimedia communication services, and dynamically managing and improving the quality of the multimedia sessions. The proposed approach, called Proactive QoS Manager, has novel light-weight methods for estimating the capacity of different components of the system and for using this capacity estimation in allocating resources to multimedia sessions in  real time . We implement the proposed approach in one of the largest online multimedia communication services in the world and evaluate its performance on more than 100 million audio, video, and conferencing sessions. Our empirical results show that substantial quality improvements can be achieved using our proactive approach, without changing the production code of the service or imposing significant overheads. For example, in our experiments, the Proactive QoS Manager reduced the number of failed sessions by up to 25% and improved the quality (in terms of the Mean Opinion Score (MOS)) of the succeeded sessions by up to 12%. These improvements are achieved for the well-engineered and highly-provisioned online service examined in this paper; we expect higher gains for other similar services.", "citation": "Citations (1)", "departments": ["Simon Fraser University", "Qatar Computing Research Institute"], "authors": ["Mohammed Shatnawi.....http://dblp.org/pers/hd/s/Shatnawi:Mohammed", "Mohamed Hefeeda.....http://dblp.org/pers/hd/h/Hefeeda:Mohamed"], "conf": "mm", "year": "2015", "pages": 10}