{"title": "Catch you if you lie to me: Efficient verifiable conjunctive keyword search over large dynamic encrypted cloud data.", "fields": ["verifiable secret sharing", "encryption", "cloud computing", "outsourcing", "computation"], "abstract": "Encrypted data search allows cloud to offer fundamental information retrieval service to its users in a privacy-preserving way. In most existing schemes, search result is returned by a semi-trusted server and usually considered authentic. However, in practice, the server may malfunction or even be malicious itself. Therefore, users need a result verification mechanism to detect the potential misbehavior in this computation outsourcing model and rebuild their confidence in the whole search process. On the other hand, cloud typically hosts large outsourced data of users in its storage. The verification cost should be efficient enough for practical use, i.e., it only depends on the corresponding search operation, regardless of the file collection size. In this paper, we are among the first to investigate the efficient search result verification problem and propose an encrypted data search scheme that enables users to conduct secure conjunctive keyword search, update the outsourced file collection and verify the authenticity of the search result efficiently. The proposed verification mechanism is efficient and flexible, which can be either delegated to a public trusted authority (TA) or be executed privately by data users. We formally prove the universally composable (UC) security of our scheme. Experimental result shows its practical efficiency even with a large dataset.", "citation": "Citations (60)", "departments": ["Xidian University", "Xidian University", "Virginia Tech", "Virginia Tech", "Xidian University"], "authors": ["Wenhai Sun.....http://dblp.org/pers/hd/s/Sun:Wenhai", "Xuefeng Liu.....http://dblp.org/pers/hd/l/Liu:Xuefeng", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas", "Hui Li.....http://dblp.org/pers/hd/l/Li_0006:Hui"], "conf": "infocom", "year": "2015", "pages": 9}