{"title": "Network coding-based multicast in multi-hop CRNs under uncertain spectrum availability.", "fields": ["distributed algorithm", "cognitive radio", "multicast", "linear network coding", "lagrangian relaxation"], "abstract": "The benefits of network coding on multicast in traditional multi-hop wireless networks have already been demonstrated in previous works. However, most existing approaches cannot be directly applied to multi-hop cognitive radio networks (CRNs), given the unpredictable primary user occupancy on licensed channels. Specifically, due to the unpredictable occupancy, the channel's bandwidth is uncertain and thus the capacity of the link using this channel is also uncertain, which may result in severe throughput loss. In this paper, we study the problem of network coding-based multicast in multi-hop CRNs considering the uncertain spectrum availability. To capture the uncertainty of spectrum availability, we first formulate our problem as a chance-constrained program. Given the computationally intractability of the above program, we transform the original problem into a tractable convex optimization problem, through appropriate Bernstein approximation together with relaxation on link scheduling. We further leverage Lagrangian relaxation-based optimization techniques to propose an efficient distributed algorithm for the original problem. Extensive simulation results show that, the proposed algorithm achieves higher multicast rates, compared to a state-of-the-art non-network coding algorithm in multi-hop CRNs, and a conservative robust algorithm that treats the link capacity as a constant value in the optimization.", "citation": "Citations (4)", "departments": ["University of Science and Technology, Sana'a", "University of Science and Technology, Sana'a", "Nanjing University", "Shanghai Jiao Tong University", "University of Texas at Dallas"], "authors": ["Yuben Qu.....http://dblp.org/pers/hd/q/Qu:Yuben", "Chao Dong.....http://dblp.org/pers/hd/d/Dong_0001:Chao", "Haipeng Dai.....http://dblp.org/pers/hd/d/Dai:Haipeng", "Fan Wu.....http://dblp.org/pers/hd/w/Wu_0006:Fan", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Hai Wang.....http://dblp.org/pers/hd/w/Wang_0007:Hai", "Chang Tian.....http://dblp.org/pers/hd/t/Tian:Chang"], "conf": "infocom", "year": "2015", "pages": 9}