{"title": "Efficient implementation of quantum materials simulations on distributed CPU-GPU systems.", "fields": ["distributed memory", "configuration interaction", "scalapack", "scalability", "solver"], "abstract": "We present a scalable implementation of the Linearized Augmented Plane Wave method for distributed memory systems, which relies on an efficient distributed, block-cyclic setup of the Hamiltonian and overlap matrices and allows us to turn around highly accurate 1000+ atom all-electron quantum materials simulations on clusters with a few hundred nodes. The implementation runs efficiently on standard multi-core CPU nodes, as well as hybrid CPU-GPU nodes. The key for the latter is a novel algorithm to solve the generalized eigenvalue problem for dense, complex Hermitian matrices on distributed hybrid CPU-GPU systems. Performance tests for Li-intercalated CoO 2  supercells containing 1501 atoms demonstrate that high-accuracy, transferable quantum simulations can now be used in throughput materials search problems. While our application can benefit and get scalable performance through CPU-only libraries like ScaLAPACK or ELPA2, our new hybrid solver enables the efficient use of GPUs and shows that a hybrid CPU-GPU architecture scales to a desired performance using substantially fewer cluster nodes, and notably, is considerably more energy efficient than the traditional multi-core CPU only systems for such complex applications.", "citation": "Citations (6)", "year": "2015", "departments": ["ETH Zurich", "University of Tennessee", "University of Tennessee", "University of Manchester", "Swiss National, ... no, Switzerland"], "conf": "sc", "authors": ["Raffaele Solcà.....http://dblp.org/pers/hd/s/Solc=agrave=:Raffaele", "Anton Kozhevnikov.....http://dblp.org/pers/hd/k/Kozhevnikov:Anton", "Azzam Haidar.....http://dblp.org/pers/hd/h/Haidar:Azzam", "Stanimire Tomov.....http://dblp.org/pers/hd/t/Tomov:Stanimire", "Jack J. Dongarra.....http://dblp.org/pers/hd/d/Dongarra:Jack_J=", "Thomas C. Schulthess.....http://dblp.org/pers/hd/s/Schulthess:Thomas_C="], "pages": 12}