{"title": "Discovering Temporal Causal Relations from Subsampled Data.", "fields": ["identifiability", "causal system", "principal stratification", "inference", "autoregressive model"], "abstract": "Granger causal analysis has been an important tool for causal analysis for time series in various fields, including neuroscience and economics, and recently it has been extended to include instantaneous effects between the time series to explain the contemporaneous dependence in the residuals. In this paper, we assume that the time series at the true causal frequency follow the vector autoregressive model. We show that when the data resolution becomes lower due to subsampling, neither the original Granger causal analysis nor the extended one is able to discover the underlying causal relations. We then aim to answer the following question: can we estimate the temporal causal relations at the right causal frequency from the subsampled data? Traditionally this suffers from the identifiability problems: under the Gaussianity assumption of the data, the solutions are generally not unique. We prove that, however, if the noise terms are non-Gaussian, the underlying model for the highfrequency data is identifiable from subsampled data under mild conditions. We then propose an Expectation-Maximization (EM) approach and a variational inference approach to recover temporal causal relations from such subsampled data. Experimental results on both simulated and real data are reported to illustrate the performance of the proposed approaches.", "citation": "Citations (14)", "year": "2015", "departments": ["University of Technology, Sydney", "University of Southern California", "Max Planck Society", "Max Planck Society", "University of Technology, Sydney", "Max Planck Society"], "conf": "icml", "authors": ["Mingming Gong.....http://dblp.org/pers/hd/g/Gong:Mingming", "Kun Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Kun", "Bernhard Schölkopf.....http://dblp.org/pers/hd/s/Sch=ouml=lkopf:Bernhard", "Dacheng Tao.....http://dblp.org/pers/hd/t/Tao:Dacheng", "Philipp Geiger.....http://dblp.org/pers/hd/g/Geiger:Philipp"], "pages": 9}