{"title": "On the complexity of optimal routing and content caching in heterogeneous networks.", "fields": ["graph", "heterogeneous network", "cache", "time complexity", "greedy algorithm"], "abstract": "We investigate the problem of optimal request routing and content caching in a heterogeneous network supporting in-network content caching with the goal of minimizing average content access delay. Here, content can either be accessed directly from a back-end server (where content resides permanently) or be obtained from one of multiple in-network caches. To access a piece of content, a user must decide whether to route its request to a cache or to the back-end server. Additionally, caches must decide which content to cache. We investigate the problem complexity of two problem formulations, where the direct path to the back-end server is modeled as i) a congestion-sensitive or ii) a congestion-insensitive path, reflecting whether or not the delay of the uncached path to the back-end server depends on the user request load, respectively. We show that the problem is NP-complete in both cases. We prove that under the congestion-insensitive model the problem can be solved optimally in polynomial time if each piece of content is requested by only one user, or when there are at most two caches in the network. We also identify a structural property of the user-cache graph that potentially makes the problem NP-complete. For the congestion-sensitive model, we prove that the problem remains NP-complete even if there is only one cache in the network and each content is requested by only one user. We show that approximate solutions can be found for both models within a (1 − 1/e) factor of the optimal solution, and demonstrate a greedy algorithm that is found to be within 1% of optimal for small problem sizes. Through trace-driven simulations we evaluate the performance of our greedy algorithms, which show up to a 50% reduction in average delay over solutions based on LRU content caching.", "citation": "Citations (94)", "departments": ["University of Massachusetts Amherst", "California State University, Monterey Bay", "University of Massachusetts Amherst", "IBM", "IBM"], "authors": ["Mostafa Dehghan.....http://dblp.org/pers/hd/d/Dehghan:Mostafa", "Anand Seetharam.....http://dblp.org/pers/hd/s/Seetharam:Anand", "Bo Jiang.....http://dblp.org/pers/hd/j/Jiang_0003:Bo", "Ting He.....http://dblp.org/pers/hd/h/He_0001:Ting", "Theodoros Salonidis.....http://dblp.org/pers/hd/s/Salonidis:Theodoros", "Jim Kurose.....http://dblp.org/pers/hd/k/Kurose:Jim", "Don Towsley.....http://dblp.org/pers/hd/t/Towsley:Don", "Ramesh K. Sitaraman.....http://dblp.org/pers/hd/s/Sitaraman:Ramesh_K="], "conf": "infocom", "year": "2015", "pages": 9}