{"title": "Index-based Optimal Algorithms for Computing Steiner Components with Maximum Connectivity.", "fields": ["graph bandwidth", "algebraic connectivity", "graph factorization", "degree", "graph toughness"], "abstract": "With the proliferation of graph applications, the problem of efficiently computing all $k$-edge connected components of a graph  G  for a user-given  k  has been recently investigated. In this paper, we study the problem of efficiently computing the  steiner  component with the maximum connectivity; that is, given a set  q  of query vertices in a graph  G , we aim to find the maximum induced subgraph  g  of  G  such that  g  contains  q  and  g  has the maximum connectivity, where  g  is denoted as SMCC. To accommodate online query processing, we present an efficient algorithm based on a novel index such that the algorithm runs in linear time regarding the result size; thus, the algorithm is optimal since it needs at least linear time to output the result. Moreover, in this paper we also investigate variations of the above problem. We show that such a problem with the constraint that the size of the SMCC is not smaller than a given size can also be solved in linear time regarding the result size (thus, optimal). We also show that the problem of computing the connectivity (rather than the graph details) of SMCC can be solved in linear time regarding the query size (thus, optimal). To build the index, we extend the techniques in [7] to accommodate batch processing and computation sharing. To efficiently support the applications with graph updates, we also present novel increment techniques. Finally, we conduct extensive performance studies on large real and synthetic graphs, which demonstrate that our index-based algorithms significantly outperform baseline algorithms by several orders of magnitude and our indexing algorithms are efficient.", "citation": "Citations (4)", "year": "2015", "departments": ["University of New South Wales", "University of New South Wales", "University of Technology, Sydney", "The Chinese University of Hong Kong", "University of New South Wales"], "conf": "sigmod", "authors": ["Lijun Chang.....http://dblp.org/pers/hd/c/Chang:Lijun", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Lu Qin.....http://dblp.org/pers/hd/q/Qin:Lu", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie"], "pages": 16}