{"title": "The collocation of measurement points in large open indoor environment.", "fields": ["collocation", "crowdsourcing", "signal strength", "mobile device", "rss"], "abstract": "With the pervasion of mobile devices, crowdsourcing based received signal strength (RSS) fingerprint collection method has drawn much attention to facilitate the indoor localization since it is effective and requires no pre-deployment. However, in large open indoor environment like museums and exhibition centres, RSS measurement points cannot be collocated densely, which degrades localization accuracy. This paper focuses on measurement point collocation in different cases and their effects on localization accuracy. We first study two simple preliminary cases under assumption that users are uniformly distributed: when measurement points are collocated regularly, we propose a collocation pattern which is most beneficial to localization accuracy; when measurement points are collocated randomly, we prove that localization accuracy is limited by a tight bound. Under the general case that users are distributed asymmetrically, we show the best allocation scheme of measurement points: measurement point density ρ is proportional to (cμ) 2/3  in every part of the region, where μ is user density and c is a constant determined by the collocation pattern. We also give some guidelines on collocation choice and perform extensive simulations to validate our assumptions and results.", "citation": "Citations (5)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Kaikai Sheng.....http://dblp.org/pers/hd/s/Sheng:Kaikai", "Zhicheng Gu.....http://dblp.org/pers/hd/g/Gu:Zhicheng", "Xueyu Mao.....http://dblp.org/pers/hd/m/Mao_0001:Xueyu", "Xiaohua Tian.....http://dblp.org/pers/hd/t/Tian:Xiaohua", "Weijie Wu.....http://dblp.org/pers/hd/w/Wu:Weijie", "Xiaoying Gan.....http://dblp.org/pers/hd/g/Gan:Xiaoying", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing"], "conf": "infocom", "year": "2015", "pages": 9}