{"title": "A Practical Implementation of Clustered Fault Tolerant Write Acceleration in a Virtualized Environment.", "fields": ["hypervisor", "high availability", "throughput", "virtual machine", "server"], "abstract": "Host-side flash storage opens up an exciting avenue for accelerating Virtual Machine (VM) writes in virtualized datacenters. The key challenge with implementing such an acceleration layer is to do so without breaking live VM migration which is essential for providing distributed resource management and high availability. High availability also powers-on VMs on new host when the previous host crashes. We introduce FVP, a fault tolerant host-side flash write acceleration layer that seamlessly integrates with the virtualized environment while preserving dynamic resource management and high availability, the holy tenets of a virtualized environment. FVP integrates with the VMware ESX hypervisor kernel to intercept VM I/O and redirects the I/O to host-side flash devices. VMs experience flash latencies instead of SAN latencies and write intensive applications such as databases and email servers benefit from predictable write throughput. No changes are required to the VM guest operating systems so VM applications can continue to function seamlessly without any modifications. FVP pools together all the host-side flash devices in the cluster so every host can access another host's flash device preserving VM mobility. By replicating VM writes onto peer host-side flash devices, FVP is able to tolerate multiple cascading host and flash failures. Failure recovery is distributed, requiring no central co-ordination. We describe the workings of the FVP key components and demonstrate how FVP reduces VM latencies to accelerate VM writes, improves performance predictability, and increases virtualized datacenter efficiency.", "citation": "Citations (7)", "departments": ["PernixData, Inc.", "PernixData, Inc.", "PernixData, Inc.", "PernixData, Inc.", "PernixData, Inc."], "authors": ["Deepavali Bhagwat.....http://dblp.org/pers/hd/b/Bhagwat:Deepavali", "Mahesh Patil.....http://dblp.org/pers/hd/p/Patil:Mahesh", "Michal Ostrowski.....http://dblp.org/pers/hd/o/Ostrowski:Michal", "Murali Vilayannur.....http://dblp.org/pers/hd/v/Vilayannur:Murali", "Woon Jung.....http://dblp.org/pers/hd/j/Jung:Woon", "Chethan Kumar.....http://dblp.org/pers/hd/k/Kumar:Chethan"], "conf": "fast", "year": "2015", "pages": 14}