{"title": "Jigsaw: multi-modal big data management in digital film production.", "fields": ["rendering", "laptop", "match moving", "big data", "point cloud"], "abstract": "Modern digital film production uses large quantities of data captured on-set, such as videos, digital photographs, LIDAR scans, spherical photography and many other sources to create the final film frames. The processing and management of this massive amount of heterogeneous data consumes enormous resources. We propose an integrated pipeline for 2 D /3 D  data registration aimed at film production, based around the prototype application  Jigsaw . It allows users to efficiently manage and process various data types from digital photographs to 3 D  point clouds. A key step in the use of multi-modal 2 D /3 D  data for content production is the registration into a common coordinate frame ( match moving ). 3 D  geometric information is reconstructed from 2 D  data and registered to the reference 3 D  models using 3 D  feature matching [Kim and Hilton 2014]. We present several highly efficient and robust approaches to this problem. Additionally, we have developed and integrated a fast algorithm for incremental marginal covariance calculation [Ila et al. 2015]. This allows us to estimate and visualize the 3 D  reconstruction error directly on-set, where insufficient coverage or other problems can be addressed right away. We describe the fast hybrid multi-core and GPU accelerated techniques that let us run these algorithms on a laptop.  Jigsaw  has been used and evaluated in several major digital film productions and significantly reduced the time and work required to manage and process on-set data.", "citation": "Citations (1)", "year": "2015", "departments": ["Double Negative", "University of Surrey", "Brno University of Technology", "Brno University of Technology", "Double Negative"], "conf": "siggraph", "authors": ["Simon Pabst.....http://dblp.org/pers/hd/p/Pabst:Simon", "Hansung Kim.....http://dblp.org/pers/hd/k/Kim:Hansung", "Lukás Polok.....http://dblp.org/pers/hd/p/Polok:Luk=aacute=s", "Viorela Ila.....http://dblp.org/pers/hd/i/Ila:Viorela", "Ted Waine.....http://dblp.org/pers/hd/w/Waine:Ted", "Adrian Hilton.....http://dblp.org/pers/hd/h/Hilton:Adrian", "Jeff Clifford.....http://dblp.org/pers/hd/c/Clifford:Jeff"], "pages": 1}