{"title": "Personalized route recommendation using big trajectory data.", "fields": ["graph", "computer science", "simulation", "empirical research", "trajectory"], "abstract": "When planning routes, drivers usually consider a multitude of different travel costs, e.g., distances, travel times, and fuel consumption. Different drivers may choose different routes between the same source and destination because they may have different driving preferences (e.g., time-efficient driving v.s. fuel-efficient driving). However, existing routing services support little in modeling multiple travel costs and personalization—they usually deliver the same routes that minimize a single travel cost (e.g., the shortest routes or the fastest routes) to all drivers. We study the problem of how to recommend personalized routes to individual drivers using big trajectory data. First, we provide techniques capable of modeling and updating different drivers' driving preferences from the drivers' trajectories while considering multiple travel costs. To recommend personalized routes, we provide techniques that enable efficient selection of a subset of trajectories from all trajectories according to a driver's preference and the source, destination, and departure time specified by the driver. Next, we provide techniques that enable the construction of a small graph with appropriate edge weights reflecting how the driver would like to use the edges based on the selected trajectories. Finally, we recommend the shortest route in the small graph as the personalized route to the driver. Empirical studies with a large, real trajectory data set from 52,211 taxis in Beijing offer insight into the design properties of the proposed techniques and suggest that they are efficient and effective.", "citation": "Citations (61)", "departments": ["Chinese Academy of Sciences", "Aalborg University", "Aarhus University", "Chinese Academy of Sciences"], "authors": ["Jian Dai.....http://dblp.org/pers/hd/d/Dai:Jian", "Bin Yang.....http://dblp.org/pers/hd/y/Yang_0002:Bin", "Chenjuan Guo.....http://dblp.org/pers/hd/g/Guo:Chenjuan", "Zhiming Ding.....http://dblp.org/pers/hd/d/Ding:Zhiming"], "conf": "icde", "year": "2015", "pages": 12}