{"title": "Unified and Contrasting Cuts in Multiple Graphs: Application to Medical Imaging Segmentation.", "fields": ["spectral clustering", "cut", "data analysis", "disjoint sets", "cognitive network"], "abstract": "The analysis of data represented as graphs is common having wide scale applications from social networks to medical imaging. A popular analysis is to cut the graph so that the disjoint subgraphs can represent communities (for social network) or background and foreground cognitive activity (for medical imaging). An emerging setting is when  multiple  data sets (graphs) exist which opens up the opportunity for many new questions. In this paper we study two such questions: i) For a collection of graphs find a  single  cut that is good for all the graphs and ii) For two collections of graphs find a  single  cut that is good for one collection but poor for the other. We show that existing formulations of multiview, consensus and alternative clustering cannot address these questions and instead we provide novel formulations in the spectral clustering framework. We evaluate our approaches on functional magnetic resonance imaging (fMRI) data to address questions such as: \"What common cognitive network does this group of individuals have?\" and \"What are the differences in the cognitive networks for these two groups?\" We obtain useful results without the need for strong domain knowledge.", "citation": "Citations (7)", "departments": ["University of California, Davis", "Google", "Naval Medical Research Center", "University of California, Davis", "University of Michigan"], "authors": ["Chia-Tung Kuo.....http://dblp.org/pers/hd/k/Kuo:Chia=Tung", "Xiang Wang.....http://dblp.org/pers/hd/w/Wang_0001:Xiang", "Peter B. Walker.....http://dblp.org/pers/hd/w/Walker:Peter_B=", "Owen T. Carmichael.....http://dblp.org/pers/hd/c/Carmichael:Owen_T=", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping", "Ian Davidson.....http://dblp.org/pers/hd/d/Davidson:Ian"], "conf": "kdd", "year": "2015", "pages": 10}