{"title": "A music video authoring system synchronizing climax of video clips and music via rearrangement of musical bars.", "fields": ["clips", "climax", "video editing", "authoring system", "synchronizing"], "abstract": "This paper presents a system that can automatically add a soundtrack to a video clip by replacing and concatenating an existing song's musical bars considering a user's preference. Since a soundtrack makes a video clip attractive, adding a soundtrack to a clip is one of the most important processes in video editing. To make a video clip more attractive, an editor of the clip tends to add a soundtrack considering its timing and climax. For example, editors often add chorus sections to the climax of the clip by replacing and concatenating musical bars in an existing song. However, in the process, editors should take naturalness of rearranged soundtrack into account. Therefore, editors have to decide how to replace musical bars in a song considering its timing, climax, and naturalness of rearranged soundtrack simultaneously. In this case, editors are required to optimize the soundtrack by listening to the rearranged result as well as checking the naturalness and synchronization between the result and the video clip. However, this repetitious work is time-consuming. [Feng et al. 2010] proposed an automatic soundtrack addition method. However, since this method automatically adds soundtrack with data-driven approach, this method cannot consider timing and climax which a user prefers.", "citation": "Citations (2)", "departments": ["Waseda University", "Waseda University", "National Institute of Advanced Industrial Science and Technology", "National Institute of Advanced Industrial Science and Technology", "Waseda University"], "authors": ["Haruki Sato.....http://dblp.org/pers/hd/s/Sato:Haruki", "Tatsunori Hirai.....http://dblp.org/pers/hd/h/Hirai:Tatsunori", "Tomoyasu Nakano.....http://dblp.org/pers/hd/n/Nakano:Tomoyasu", "Masataka Goto.....http://dblp.org/pers/hd/g/Goto:Masataka", "Shigeo Morishima.....http://dblp.org/pers/hd/m/Morishima:Shigeo"], "conf": "siggraph", "year": "2015", "pages": 1}