{"title": "Information retrieval and spectrum based bug localization: better together.", "fields": ["debugging", "software regression", "theoretical computer science", "software system", "ranking"], "abstract": "Debugging often takes much effort and resources. To help developers debug, numerous information retrieval (IR)-based and spectrum-based bug localization techniques have been proposed. IR-based techniques process textual information in bug reports, while spectrum-based techniques process program spectra (i.e., a record of which program elements are executed for each test case). Both eventually generate a ranked list of program elements that are likely to contain the bug. However, these techniques only consider one source of information, either bug reports or program spectra, which is not optimal. To deal with the limitation of existing techniques, in this work, we propose a new multi-modal technique that considers both bug reports and program spectra to localize bugs. Our approach adaptively creates a bug-specific model to map a particular bug to its possible location, and introduces a novel idea of suspicious words that are highly associated to a bug. We evaluate our approach on 157 real bugs from four software systems, and compare it with a state-of-the-art IR-based bug localization method, a state-of-the-art spectrum-based bug localization method, and three state-of-the-art multi-modal feature location methods that are adapted for bug localization. Experiments show that our approach can outperform the baselines by at least 47.62%, 31.48%, 27.78%, and 28.80% in terms of number of bugs successfully localized when a developer inspects 1, 5, and 10 program elements (i.e., Top 1, Top 5, and Top 10), and Mean Average Precision (MAP) respectively.", "citation": "Citations (55)", "departments": ["Singapore Management University", "Singapore Management University", "Singapore Management University"], "authors": ["Tien-Duy B. Le.....http://dblp.org/pers/hd/l/Le:Tien=Duy_B=", "Richard Jayadi Oentaryo.....http://dblp.org/pers/hd/o/Oentaryo:Richard_Jayadi", "David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David"], "conf": "sigsoft", "year": "2015", "pages": 12}