{"title": "Hands-free gesture operation for maintenance work using finger-mounted acceleration sensor.", "fields": ["acceleration", "collision", "computer graphics images", "gesture", "gesture recognition"], "abstract": "In maintenance of electric power control panels, a worker has to do a lot of manual work such as pushing buttons and turning on/off selector switches. Therefore, a hands-free gesture operating system is needed. Tsukada [Tsukada et al. 2002] proposed a gesture operating system using an acceleration sensor and switches. Although it is a simple task to control a home appliance by gesture, users have to use both gesture and switch on/off to perform more complicated tasks such as controlling and recording documents in maintenance work. Therefore, the system becomes complicated. We propose a novel switch-less assist system for maintenance work with a simple structure that recognizes gesture using only an acceleration sensor. Ike [Ike et al. 2014] proposed a hand gesture operating system that enables users to control a TV remotely by adopting \"Tapping\" as a click signal. The system recognizes tapping by detecting a pulse-like acceleration pattern corresponding to a micro collision generated by tapping. However, it is difficult to recognize tapping because maintenance work includes many micro collisions generated by touching things. We adopt \"Tapping & Finger up\", i.e., tapping fingers and turning up a finger, gestures that rarely occur in maintenance work, and design a gesture system enabling users to perform maintenance tasks and gesture operation seamlessly. Our system helps users do maintenance work easily and intuitively without interrupting work.", "citation": "Not cited", "departments": ["Toshiba", "Toshiba", "Toshiba", "Toshiba"], "authors": ["Toshiaki Nakasu.....http://dblp.org/pers/hd/n/Nakasu:Toshiaki", "Tsukasa Ike.....http://dblp.org/pers/hd/i/Ike:Tsukasa", "Kazunori Imoto.....http://dblp.org/pers/hd/i/Imoto:Kazunori", "Yasunobu Yamauchi.....http://dblp.org/pers/hd/y/Yamauchi:Yasunobu"], "conf": "siggraph", "year": "2015", "pages": 1}