{"title": "Model-Based Relative Entropy Stochastic Search.", "fields": ["premature convergence", "exploit", "usability", "generality", "kullback leibler divergence"], "abstract": "Stochastic search algorithms are general black-box optimizers. Due to their ease of use and their generality, they have recently also gained a lot of attention in operations research, machine learning and policy search. Yet, these algorithms require a lot of evaluations of the objective, scale poorly with the problem dimension, are affected by highly noisy objective functions and may converge prematurely. To alleviate these problems, we introduce a new surrogate-based stochastic search approach. We learn simple, quadratic surrogate models of the objective function. As the quality of such a quadratic approximation is limited, we do not greedily exploit the learned models. The algorithm can be misled by an inaccurate optimum introduced by the surrogate. Instead, we use information theoretic constraints to bound the 'distance' between the new and old data distribution while maximizing the objective function. Additionally the new method is able to sustain the exploration of the search distribution to avoid premature convergence. We compare our method with state of art black-box optimization methods on standard uni-modal and multi-modal optimization functions, on simulated planar robot tasks and a complex robot ball throwing task. The proposed method considerably outperforms the existing approaches.", "citation": "Citations (4)", "year": "2015", "departments": ["University of Aveiro", "Institute for Advanced Study", "University of Aveiro", "University of Minho", "Max Planck Society", "University of Aveiro", "Technische Universität Darmstadt", "University of Aveiro", "University of Minho", "Technische Universität Darmstadt"], "conf": "nips", "authors": ["Abbas Abdolmaleki.....http://dblp.org/pers/hd/a/Abdolmaleki:Abbas", "Rudolf Lioutikov.....http://dblp.org/pers/hd/l/Lioutikov:Rudolf", "Jan Peters.....http://dblp.org/pers/hd/p/Peters_0001:Jan", "Nuno Lau.....http://dblp.org/pers/hd/l/Lau:Nuno", "Luís Paulo Reis.....http://dblp.org/pers/hd/r/Reis:Lu=iacute=s_Paulo", "Gerhard Neumann.....http://dblp.org/pers/hd/n/Neumann:Gerhard"], "pages": 9}