{"title": "AppContext: Differentiating Malicious and Benign Mobile App Behaviors Using Context.", "fields": ["malware", "static program analysis", "regression testing", "short message service", "mobile malware"], "abstract": "Mobile malware attempts to evade detection during app analysis by mimicking security-sensitive behaviors of benign apps that provide similar functionality (e.g., sending SMS messages), and suppressing their payload to reduce the chance of being observed (e.g., executing only its payload at night). Since current approaches focus their analyses on the types of security-sensitive resources being accessed (e.g., network), these evasive techniques in malware make differentiating between malicious and benign app behaviors a difficult task during app analysis. We propose that the malicious and benign behaviors within apps can be differentiated based on the contexts that trigger security-sensitive behaviors, i.e., the events and conditions that cause the security-sensitive behaviors to occur. In this work, we introduce AppContext, an approach of static program analysis that extracts the contexts of security-sensitive behaviors to assist app analysis in differentiating between malicious and benign behaviors. We implement a prototype of AppContext and evaluate AppContext on 202 malicious apps from various malware datasets, and 633 benign apps from the Google Play Store. AppContext correctly identifies 192 malicious apps with 87.7% precision and 95% recall. Our evaluation results suggest that the maliciousness of a security-sensitive behavior is more closely related to the intention of the behavior (reflected via contexts) than the type of the security-sensitive resources that the behavior accesses.", "citation": "Citations (146)", "departments": ["University of Illinois at Urbana–Champaign", "Princeton University", "North Carolina State University", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Wei Yang.....http://dblp.org/pers/hd/y/Yang_0013:Wei", "Xusheng Xiao.....http://dblp.org/pers/hd/x/Xiao:Xusheng", "Benjamin Andow.....http://dblp.org/pers/hd/a/Andow:Benjamin", "Sihan Li.....http://dblp.org/pers/hd/l/Li:Sihan", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "William Enck.....http://dblp.org/pers/hd/e/Enck:William"], "conf": "icse", "year": "2015", "pages": 11}