{"title": "User recruitment for mobile crowdsensing over opportunistic networks.", "fields": ["internet access", "set cover problem", "mobility model", "heuristics", "submodular set function"], "abstract": "We look into the realization of mobile crowdsensing campaigns that draw on the opportunistic networking paradigm, as practised in delay-tolerant networks but also in the emerging device-to-device communication mode in cellular networks. In particular, we ask how mobile users can be optimally selected in order to generate the required space-time paths across the network for collecting data from a set of fixed locations. The users hold different roles in these paths, from collecting data with their sensing-enabled devices to relaying them across the network and uploading them to data collection points with Internet connectivity. We first consider scenarios with deterministic node mobility and formulate the selection of users as a minimum-cost set cover problem with a submodular objective function. We then generalize to more realistic settings with uncertainty about the user mobility. A methodology is devised for translating the statistics of individual user mobility to statistics of spacetime path formation and feeding them to the set cover problem formulation. We describe practical greedy heuristics for the resulting NP-hard problems and compute their approximation ratios. Our experimentation with real mobility datasets (a) illustrates the multiple tradeoffs between the campaign cost and duration, the bound on the hopcount of space-time paths, and the number of collection points; and (b) provides evidence that in realistic problem instances the heuristics perform much better than what their pessimistic worst-case bounds suggest.", "citation": "Citations (73)", "departments": ["University of Piraeus", "Information Tec ... , Volos, Greece", "Information Tec ... , Volos, Greece"], "authors": ["Merkourios Karaliopoulos.....http://dblp.org/pers/hd/k/Karaliopoulos:Merkourios", "Orestis Telelis.....http://dblp.org/pers/hd/t/Telelis:Orestis", "Iordanis Koutsopoulos.....http://dblp.org/pers/hd/k/Koutsopoulos:Iordanis"], "conf": "infocom", "year": "2015", "pages": 9}