{"title": "A fistful of pings: Accurate and lightweight anycast enumeration and geolocation.", "fields": ["geolocation", "root name server", "anycast", "planetlab", "service discovery"], "abstract": "Use of IP-layer anycast has increased in the last few years: once relegated to DNS root and top-level domain servers, anycast is now commonly used to assist distribution of general purpose content by CDN providers. Yet, the measurement techniques for discovering anycast replicas have been designed around DNS, limiting their usefulness to this particular service. This raises the need for protocol agnostic methodologies, that should additionally be as lightweight as possible in order to scale up anycast service discovery. This is precisely the aim of this paper, which proposes a new method for exhaustive and accurate enumeration and city-level geolocation of anycast instances, requiring only a handful of latency measurements from a set of known vantage points. Our method exploits an iterative workflow that enumerates (an optimization problem) and geolocates (a classification problem) anycast replicas. We thoroughly validate our methodology on available ground truth (several DNS root servers), using multiple measurement infrastructures (PlanetLab, RIPE), obtaining extremely accurate results (even with simple algorithms, that we compare with the global optimum), that we make available to the scientific community. Compared to the state of the art work that appeared in INFOCOM 2013 and IMC 2013, our technique (i) is not bound to a specific protocol, (ii) requires 1000 times fewer vantage points, not only (iii) achieves over 50% recall but also (iv) accurately identifies the city-level geolocation for over 78% of the enumerated servers, with (v) a mean geolocation error of 361 km for all enumerated servers.", "citation": "Citations (11)", "departments": ["Télécom ParisTech", "Télécom ParisTech", "Télécom ParisTech", "University of Paris", "University of Paris"], "authors": ["Danilo Cicalese.....http://dblp.org/pers/hd/c/Cicalese:Danilo", "Diana Joumblatt.....http://dblp.org/pers/hd/j/Joumblatt:Diana", "Dario Rossi.....http://dblp.org/pers/hd/r/Rossi:Dario", "Marc-Olivier Buob.....http://dblp.org/pers/hd/b/Buob:Marc=Olivier", "Jordan Augé.....http://dblp.org/pers/hd/a/Aug=eacute=:Jordan", "Timur Friedman.....http://dblp.org/pers/hd/f/Friedman:Timur"], "conf": "infocom", "year": "2015", "pages": 9}