{"title": "Cross-Architecture Bug Search in Binary Executables.", "fields": ["executable", "central processing unit", "software security assurance", "instruction set", "architecture", "binary number", "embedded system", "software bug", "computer architecture"], "abstract": "With the general availability of closed-source software for various CPU architectures, there is a need to identify security-critical vulnerabilities at the binary level to perform a vulnerability assessment. Unfortunately, existing bug finding methods fall short in that they i) require source code, ii) only work on a single architecture (typically x86), or iii) rely on dynamic analysis, which is inherently difficult for embedded devices. In this paper, we propose a system to derive bug signatures for known bugs. We then use these signatures to find bugs in binaries that have been deployed on different CPU architectures (e.g., x86 vs. MIPS). The variety of CPU architectures imposes many challenges, such as the incomparability of instruction set architectures between the CPU models. We solve this by first translating the binary code to an intermediate representation, resulting in assignment formulas with input and output variables. We then sample concrete inputs to observe the I/O behavior of basic blocks, which grasps their semantics. Finally, we use the I/O behavior to find code parts that behave similarly to the bug signature, effectively revealing code parts that contain the bug. We have designed and implemented a tool for cross architecture bug search in executables. Our prototype currently supports three instruction set architectures (x86, ARM, and MIPS) and can find vulnerabilities in buggy binary code for any of these architectures. We show that we can find Heart bleed vulnerabilities, regardless of the underlying software instruction set. Similarly, we apply our method to find backdoors in closed source firmware images of MIPS- and ARM-based routers.", "citation": "Not cited", "departments": ["Ruhr University Bochum", "Ruhr University Bochum", "Ruhr University Bochum", "Saarland University", "Ruhr University Bochum"], "authors": ["Jannik Pewny.....http://dblp.org/pers/hd/p/Pewny:Jannik", "Behrad Garmany.....http://dblp.org/pers/hd/g/Garmany:Behrad", "Robert Gawlik.....http://dblp.org/pers/hd/g/Gawlik:Robert", "Christian Rossow.....http://dblp.org/pers/hd/r/Rossow:Christian", "Thorsten Holz.....http://dblp.org/pers/hd/h/Holz:Thorsten"], "conf": "sp", "year": "2015", "pages": 16}