{"title": "Polylogarithmic Approximations for the Capacitated Single-Sink Confluent Flow Problem.", "fields": ["rounding", "combinatorial optimization", "maximization", "sink", "monotonic function"], "abstract": "A single-sink confluent flow is a routing of multiple demands to a sink r such that any flow exiting a node v must use a single arc. Hence, a confluent flow routes on a tree within the network. In uncapacitated (or uniform-capacity) networks, there is an O(1)-approximation algorithm for demand maximization and a logarithmic approximation algorithm for congestion minimization (Chen et al.). We study the case of capacitated networks, where each node v has its own capacity mu(v). Indeed, it was recently shown that demand maximization is inapproximable to within polynomial factors in capacitated networks (Shepherd and Vetta). We circumvent this lower bound in two ways. First, we prove that there is a polylogarithmicapproximation algorithm for demand maximization in networks that satisfy the ubiquitous no-bottleneck assumption (nba). Second, we show a bicriteria result for capacitated networks without the nba: there is a polylog factor approximation guarantee for demand maximization provided we allow congestion 2. We model the capacitated confluent flows problem using a multilayer linear programming formulation. At the heart of our approach for demand maximization is a rounding procedure for flows on multilayer networks which can be viewed as a proposal algorithm for an extension of stable matchings. In addition, the demand maximization algorithms require, as a subroutine, an algorithm for approximate congestion minimization in a special class of capacitated networks that may be of independent interest. Specifically, we present apolylogarithmic approximation algorithm for congestion minimization in monotonic networks -- those networks with the property that a#x03BC;(u) < a#x0398;(v) for each arc (u, v).", "citation": "Not cited", "departments": ["McGill University", "McGill University", "Bell Labs"], "authors": ["F. Bruce Shepherd.....http://dblp.org/pers/hd/s/Shepherd:F=_Bruce", "Adrian Vetta.....http://dblp.org/pers/hd/v/Vetta:Adrian", "Gordon T. Wilfong.....http://dblp.org/pers/hd/w/Wilfong:Gordon_T="], "conf": "focs", "year": "2015", "pages": 11}