{"title": "Traffic Measurement and Route Recommendation System for Mass Rapid Transit (MRT).", "fields": ["market research", "recommender system", "trips architecture", "cellular network", "system of measurement"], "abstract": "Understanding how people use public transport is important for the operation and future planning of the underlying transport networks. We have therefore developed and deployed a traffic measurement system for a key player in the transportation industry to gain insights into crowd behavior for planning purposes. The system has been in operation for several months and reports, at hourly intervals, (1) the crowdedness of subway stations, (2) the flows of people inside interchange stations, and (3) the expected travel time for each possible route in the subway network of Singapore. The core of our system is an efficient algorithm which detects individual subway trips from anonymized real-time data generated by the location based system of Singtel, the country's largest telecommunications company. To assess the accuracy of our system, we engaged an independent market research company to conduct a field study--a manual count of the number of passengers boarding and disembarking at a selected station on three separate days. A strong correlation between the calculations of our algorithm and the manual counts was found. One of our key findings is that travelers do not always choose the route with the shortest travel time in the subway network of Singapore. We have therefore also been developing a mobile app which allows users to plan their trips based on the average travel time between stations.", "citation": "Citations (4)", "departments": ["DataSpark, Sing ... pore, Singapore", "-, Singapore, Singapore", "DataSpark, Sing ... pore, Singapore", "DataSpark, Sing ... pore, Singapore", "DataSpark, Sing ... pore, Singapore"], "authors": ["Thomas Holleczek.....http://dblp.org/pers/hd/h/Holleczek:Thomas", "Dang The Anh.....http://dblp.org/pers/hd/a/Anh:Dang_The", "Shanyang Yin.....http://dblp.org/pers/hd/y/Yin:Shanyang", "Yunye Jin.....http://dblp.org/pers/hd/j/Jin:Yunye", "Spiros Antonatos.....http://dblp.org/pers/hd/a/Antonatos:Spiros", "Han Leong Goh.....http://dblp.org/pers/hd/g/Goh:Han_Leong", "Samantha Low.....http://dblp.org/pers/hd/l/Low:Samantha", "Amy Shi Nash.....http://dblp.org/pers/hd/n/Nash:Amy_Shi"], "conf": "kdd", "year": "2015", "pages": 10}