{"title": "GRECS: Graph Encryption for Approximate Shortest Distance Queries.", "fields": ["distance", "filesystem level encryption", "combinatorics", "encryption", "discrete mathematics", "graph bandwidth", "attribute based encryption", "40 bit encryption", "graph operations", "graph", "graph database"], "abstract": "We propose graph encryption schemes that efficiently support approximate shortest distance queries on large-scale encrypted graphs. Shortest distance queries are one of the most fundamental graph operations and have a wide range of applications. Using such graph encryption schemes, a client can outsource large-scale privacy-sensitive graphs to an untrusted server without losing the ability to query it. Other applications include encrypted graph databases and controlled disclosure systems. We propose GRECS (stands for GRaph EnCryption for approximate Shortest distance queries) which includes three oracle encryption schemes that are provably secure against any semi-honest server. Our first construction makes use of only symmetric-key operations, resulting in a computationally-efficient construction. Our second scheme makes use of somewhat-homomorphic encryption and is less computationally-efficient but achieves optimal communication complexity (i.e. uses a minimal amount of bandwidth). Finally, our third scheme is both computationally-efficient and achieves optimal communication complexity at the cost of a small amount of additional leakage. We implemented and evaluated the efficiency of our constructions experimentally. The experiments demonstrate that our schemes are efficient and can be applied to graphs that scale up to 1.6 million nodes and 11 million edges.", "citation": "Not cited", "year": "2015", "departments": ["Boston University", "Microsoft", "Ben-Gurion University of the Negev", "Boston University"], "conf": "ccs", "authors": ["Xianrui Meng.....http://dblp.org/pers/hd/m/Meng:Xianrui", "Seny Kamara.....http://dblp.org/pers/hd/k/Kamara:Seny", "Kobbi Nissim.....http://dblp.org/pers/hd/n/Nissim:Kobbi", "George Kollios.....http://dblp.org/pers/hd/k/Kollios:George"], "pages": 14}