{"title": "Assert Use in GitHub Projects.", "fields": ["adjunct", "maintainability", "software quality", "software bug", "assertion"], "abstract": "Abstract -- Asserts have long been a strongly recommended (if non-functional) adjunct to programs. They certainly don't add any user-evident feature value; and it can take quite some skill and effort to devise and add useful asserts. However, they are believed to add considerable value to the developer. Certainly, they can help with automated verification; but even in the absence of that, claimed advantages include improved understandability, maintainability, easier fault localization and diagnosis, all eventually leading to better software quality. We focus on this latter claim, and use a large dataset of asserts in C and C++ programs to explore the connection between asserts and defect occurrence. Our data suggests a connection: functions with asserts do have significantly fewer defects. This indicates that asserts do play an important role in software quality; we therefore explored further the factors that play a role in assertion placement: specifically, process factors (such as developer experience and ownership) and product factors, particularly interprocedural factors, exploring how the placement of assertions in functions are influenced by local and global network properties of the callgraph. Finally, we also conduct a differential analysis of assertion use across different application domains.", "citation": "Citations (19)", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "authors": ["Casey Casalnuovo.....http://dblp.org/pers/hd/c/Casalnuovo:Casey", "Premkumar T. Devanbu.....http://dblp.org/pers/hd/d/Devanbu:Premkumar_T=", "Abilio Oliveira.....http://dblp.org/pers/hd/o/Oliveira:Abilio", "Vladimir Filkov.....http://dblp.org/pers/hd/f/Filkov:Vladimir", "Baishakhi Ray.....http://dblp.org/pers/hd/r/Ray:Baishakhi"], "conf": "icse", "year": "2015", "pages": 12}