{"title": "Multiple Social Network Learning and Its Application in Volunteerism Tendency Prediction.", "fields": ["missing data", "evolving networks", "inference", "social learning", "social network"], "abstract": "We are living in the era of social networks, where people throughout the world are connected and organized by multiple social networks. The views revealed by different social networks may vary according to the different services they offer. They are complimentary to each other and comprehensively characterize a specific user from different perspectives. As compared to the scare knowledge conveyed by a single source, appropriate aggregation of multiple social networks offers us a better opportunity for deep user understanding. The challenges, however, co-exist with opportunities. The first challenge lies in the existence of block-wise missing data, caused by the fact that some users may be very active in certain social networks while inactive in others. The second challenge is how to collaboratively integrate multiple social networks. Towards this end, we first proposed a novel model for data missing completion by seamlessly exploring the knowledge from multiple sources. We then developed a robust multiple social network learning model, and applied it to the application of volunteerism tendency prediction. Extensive experiments on real world dataset verify the effectiveness of our scheme. The proposed scheme is applicable to many other domains, such as demographic inference and interest prediction.", "citation": "Citations (60)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Xuemeng Song.....http://dblp.org/pers/hd/s/Song:Xuemeng", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Luming Zhang.....http://dblp.org/pers/hd/z/Zhang:Luming", "Mohammad Akbari.....http://dblp.org/pers/hd/a/Akbari:Mohammad", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "sigir", "year": "2015", "pages": 10}