{"title": "Diverse and Proportional Size-l Object Summaries for Keyword Search.", "fields": ["ranking", "tree structure", "social network", "graph", "tuple"], "abstract": "The abundance and ubiquity of graphs (e.g., Online Social Networks such as Google+ and Facebook; bibliographic graphs such as DBLP) necessitates the effective and efficient search over them. Given a set of keywords that can identify a Data Subject (DS), a recently proposed relational keyword search paradigm produces, as a query result, a set of Object Summaries (OSs). An OS is a tree structure rooted at the DS node (i.e., a tuple containing the keywords) with surrounding nodes that summarize all data held on the graph about the DS. OS snippets, denoted as  size-l  OSs, have also been investigated.  Size-l  OSs are partial OSs containing  l  nodes such that the summation of their importance scores results in the maximum possible total score. However, the set of nodes that maximize the total importance score may result in an uninformative size-l OSs, as very important nodes may be repeated in it, dominating other representative information. In view of this limitation, in this paper we investigate the effective and efficient generation of two novel types of OS snippets, i.e.  diverse  and  proportional size-l  OSs, denoted as  DSize-l  and  PSize-l  OSs. Namely, apart from the importance of each node, we also consider its frequency in the OS and its repetitions in the snippets. We conduct an extensive evaluation on two real graphs (DBLP and Google+). We verify effectiveness by collecting user feedback, e.g. by asking DBLP authors (i.e. the DSs themselves) to evaluate our results. In addition, we verify the efficiency of our algorithms and evaluate the quality of the snippets that they produce.", "citation": "Citations (4)", "year": "2015", "departments": ["Hong Kong University of Science and Technology", "Beijing University of Technology", "University of Hong Kong"], "conf": "sigmod", "authors": ["Georgios John Fakas.....http://dblp.org/pers/hd/f/Fakas:Georgios_John", "Zhi Cai.....http://dblp.org/pers/hd/c/Cai:Zhi", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos"], "pages": 13}