{"title": "Reducing geometry-processing overhead for novel viewpoint creation.", "fields": ["image warping", "bilateral filter", "deferred shading", "graphics hardware", "geometry processing"], "abstract": "Maintaining a high steady frame rate is an important aspect in interactive real-time graphics. It is mainly influenced by the number of objects and the number of lights to be processed for a 3d scene. The upper-bound effort for rendering a scene is then defined by the number of objects times the number of lights, i. e.  O ( N O   ·  N L  ). Deferred shading reduces this upper bound to the number of objects plus the number of lights, i. e.  O ( N O   +  N L  ), by separating the rendering process into two phases: geometry processing and lighting evaluation. The geometry processing rasterizes all objects but only retains visible fragments in a G-Buffer for the current viewpoint. The lighting evaluation then only needs to process those surviving fragments to compute the final image (for the current viewpoint). Unfortunately, this approach not only trades computational effort for memory but also requires the re-creation of the G-Buffer every time the viewpoint changes. Additionally, transparent objects cannot be encoded into a G-Buffer and must be separately processed. Post-rendering 3d warping [Mark et al. 1997] is one particular technique that allows to create images from G-Buffer information for new viewpoints. However, this only works with sufficient fragment information. Objects not encoded in the G-Buffer, because they were not visible from the original viewpoint, will create visual artifacts at discontinuities between objects. We propose fragment-history volumes (FHV) to create novel viewpoints from a discrete representation of the entire scene using current graphics hardware and present an initial performance comparison.", "citation": "Not cited", "departments": ["University of Hull", "University of Hull"], "authors": ["Francisco Inácio.....http://dblp.org/pers/hd/i/In=aacute=cio:Francisco", "Jan P. Springer.....http://dblp.org/pers/hd/s/Springer:Jan_P="], "conf": "siggraph", "year": "2015", "pages": 1}