{"title": "CAreDroid: Adaptation Framework for Android Context-Aware Applications.", "fields": ["text mining", "world wide web", "runtime system", "internet privacy", "mobile computing", "source lines of code", "software system", "android", "computer science"], "abstract": "Context-awareness is the ability of software systems to sense and adapt to their physical environment. Many contemporary mobile applications adapt to changing locations, connectivity states, available computational and energy resources, and proximity to other users and devices. Nevertheless, there is little systematic support for context-awareness in contemporary mobile operating systems. Because of this, application developers must build their own context-awareness adaptation engines, dealing directly with sensors and polluting application code with complex adaptation decisions.   In this paper, we introduce CAreDroid, which is a framework that is designed to decouple the application logic from the complex adaptation decisions in Android context-aware applications. In this framework, developers are required--only--to focus on the application logic by providing a list of methods that are sensitive to certain contexts along with the permissible operating ranges under those contexts. At run time, CAreDroid monitors the context of the physical environment and intercepts calls to sensitive methods, activating only the blocks of code that best fit the current physical context.   CAreDroid is implemented as part of the Android runtime system. By pushing context monitoring and adaptation into the runtime system, CAreDroid eases the development of context-aware applications and increases their efficiency. In particular, case study applications implemented using CAreDroid are shown to have: (1) at least half lines of code fewer and (2) at least 10× more efficient in execution time compared to equivalent context-aware applications that use only standard Android APIs.", "citation": "Not cited", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "State University of Campinas", "University of California, Los Angeles", "Federal Univers ... atarina, Brazil"], "authors": ["Salma Elmalaki.....http://dblp.org/pers/hd/e/Elmalaki:Salma", "Lucas Francisco Wanner.....http://dblp.org/pers/hd/w/Wanner:Lucas_Francisco", "Mani B. Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Mani_B="], "conf": "mobicom", "year": "2015", "pages": 14}