{"title": "Distributed memory code generation for mixed Irregular/Regular computations.", "fields": ["adaptive mesh refinement", "distributed memory", "bottleneck", "control flow", "affine transformation"], "abstract": "Many applications feature a mix of irregular and regular computational structures. For example, codes using adaptive mesh refinement (AMR) typically use a collection of regular blocks, where the number of blocks and the relationship between blocks is irregular. The computational structure in such applications generally involves regular (affine) loop computations within some number of innermost loops, while outer loops exhibit irregularity due to data-dependent control flow and indirect array access patterns. Prior approaches to distributed memory parallelization do not handle such computations effectively. They either target loop nests that are completely affine using polyhedral frameworks, or treat all loops as irregular. Consequently, the generated distributed memory code contains artifacts that disrupt the regular nature of previously affine innermost loops of the computation. This hampers subsequent optimizations to improve on-node performance. We propose a code generation framework that can effectively transform such applications for execution on distributed memory systems. Our approach generates distributed memory code which preserves program properties that enable subsequent polyhederal optimizations. Simultaneously, it addresses a major memory bottleneck of prior techniques that limits the scalability of the generated code. The effectiveness of the proposed framework is demonstrated on computations that are mixed regular/irregular, completely regular, and completely irregular.", "citation": "Citations (6)", "year": "2015", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Louisiana State University"], "conf": "ppopp", "authors": ["Mahesh Ravishankar.....http://dblp.org/pers/hd/r/Ravishankar:Mahesh", "Roshan Dathathri.....http://dblp.org/pers/hd/d/Dathathri:Roshan", "Venmugil Elango.....http://dblp.org/pers/hd/e/Elango:Venmugil", "Louis-Noël Pouchet.....http://dblp.org/pers/hd/p/Pouchet:Louis=No=euml=l", "J. Ramanujam.....http://dblp.org/pers/hd/r/Ramanujam:J=", "Atanas Rountev.....http://dblp.org/pers/hd/r/Rountev:Atanas", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P="], "pages": 11}