{"title": "Fork path: improving efficiency of ORAM by removing redundant memory accesses.", "fields": ["fork", "auxiliary memory", "information leakage", "oblivious ram", "cryptographic primitive"], "abstract": "Oblivious RAM (ORAM) is a cryptographic primitive that can prevent information leakage in the access trace to untrusted external memory. It has become an important component in modern secure processors. However, the major obstacle of adopting an ORAM design is the significantly induced overhead in memory accesses. Recently, Path ORAM has attracted attentions from researchers because of its simplicity in algorithms and efficiency in reducing memory access overhead. However, we observe that there exist a lot of redundant memory accesses during the process of ORAM requests. Moreover, we further argue that these redundant memory accesses can be removed without harming security of ORAM. Based on this observation, we propose a novel Fork Path ORAM scheme. By leveraging three optimization techniques, namely, path merging, ORAM request scheduling, and merging-aware caching, Fork Path ORAM can efficiently remove these redundant memory accesses. Based on this scheme, a detailed ORAM controller architecture is proposed and comprehensive experiments are performed. Compared to traditional Path ORAM approaches, our Fork Path ORAM can reduce overall performance overhead and power consumption of memory system by 58% and 38%, respectively, with negligible design overhead.", "citation": "Citations (7)", "departments": ["Peking University", "Peking University", "Peking University", "Peking University", "Peking University"], "authors": ["Xian Zhang.....http://dblp.org/pers/hd/z/Zhang:Xian", "Guangyu Sun.....http://dblp.org/pers/hd/s/Sun:Guangyu", "Chao Zhang.....http://dblp.org/pers/hd/z/Zhang_0007:Chao", "Weiqi Zhang.....http://dblp.org/pers/hd/z/Zhang:Weiqi", "Yun Liang.....http://dblp.org/pers/hd/l/Liang_0001:Yun", "Tao Wang.....http://dblp.org/pers/hd/w/Wang_0004:Tao", "Yiran Chen.....http://dblp.org/pers/hd/c/Chen:Yiran", "Jia Di.....http://dblp.org/pers/hd/d/Di:Jia"], "conf": "micro", "year": "2015", "pages": 13}