{"title": "Optical see-through head up displays' effect on depth judgments of real world objects.", "fields": ["visualization", "augmented reality", "depth perception", "meter", "graphics"], "abstract": "Recent research indicates that users consistently underestimate depth judgments to Augmented Reality (AR) graphics when viewed through optical see-through displays. However, to our knowledge, little work has examined how AR graphics may affect depth judgments of real world objects that have been overlaid or annotated with AR graphics. This study begins a preliminary analysis whether AR graphics have directional effects on users' depth perception of real-world objects, as might be experienced in vehicle driving scenarios (e.g., as viewed via an optical see-through head-up display or HUD). Twenty-four participants were asked to judge the depth of a physical pedestrian proxy figure moving towards them at a constant rate of 1 meter/second. Participants were shown an initial target location that varied in distance from 11 to 20 m and were then asked to press a button to indicate when the moving target was perceived to be at the previously specified target location. Each participant experienced three different display conditions: no AR visual display (control), a conformal AR graphic overlaid on the pedestrian via a HUD, and the same graphic presented on a tablet physically located on the pedestrian. Participants completed 10 trials (one for each target distance between 11 and 20 inclusive) per display condition for a total of 30 trials per participant. The judged distance from the correct location was recorded, and after each trial, participants' confidence in determining the correct distance was captured. Across all conditions, participants underestimated the distance of the physical object consistent with existing literature. Greater variability was observed in the accuracy of distance judgments under the AR HUD condition relative to the other two display conditions. In addition, participant confidence levels were considerably lower in the AR HUD condition.", "citation": "Citations (3)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "University of Nottingham"], "authors": ["Missie Smith.....http://dblp.org/pers/hd/s/Smith:Missie", "Nadejda Doutcheva.....http://dblp.org/pers/hd/d/Doutcheva:Nadejda", "Joseph L. Gabbard.....http://dblp.org/pers/hd/g/Gabbard:Joseph_L=", "Gary E. Burnett.....http://dblp.org/pers/hd/b/Burnett:Gary_E="], "conf": "vr", "year": "2015", "pages": 5}