{"title": "ReCBuLC: Reproducing Concurrency Bugs Using Local Clocks.", "fields": ["timestamp", "overhead", "software bug", "thread", "order by"], "abstract": "Multi-threaded programs play an increasingly important role in current multi-core environments. Exposing concurrency bugs and debugging such multi-threaded programs have become quite challenging due to their inherent non-determinism. In order to eliminate such non-determinism, many approaches such as record-and-replay and other similar bug reproducing systems have been proposed. However, those approaches often suffer significant performance degradation because they require a large amount of recorded information and/or long analysis and replay time. In this paper, we propose an effective approach, ReCBuLC, to take advantage of the hardware clocks available on modern processors. The key idea is to reduce the recording overhead and analyzing events' global order by using time stamps recorded in each thread. Those timestamps are used to determine the global orders of shared accesses. To avoid the large overhead incurred in accessing system-wide global clock, we opt to use local per-core clocks that incur much less access overhead. We then propose techniques to resolve differences among local clocks and obtain an accurate global event order. By using per-core clocks, state-of-the-art bug reproducing systems such as PRES and CLAP can reduce the recording overheads by 1% ~ 85%, and the analysis time by 84.66% ~ 99.99%, respectively.", "citation": "Citations (4)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "University of Minnesota"], "authors": ["Xiang Yuan.....http://dblp.org/pers/hd/y/Yuan:Xiang", "Chenggang Wu.....http://dblp.org/pers/hd/w/Wu:Chenggang", "Zhenjiang Wang.....http://dblp.org/pers/hd/w/Wang:Zhenjiang", "Jianjun Li.....http://dblp.org/pers/hd/l/Li:Jianjun", "Pen-Chung Yew.....http://dblp.org/pers/hd/y/Yew:Pen=Chung", "Jeff Huang.....http://dblp.org/pers/hd/h/Huang_0001:Jeff", "Xiaobing Feng.....http://dblp.org/pers/hd/f/Feng_0002:Xiaobing", "Yanyan Lan.....http://dblp.org/pers/hd/l/Lan:Yanyan", "Yunji Chen.....http://dblp.org/pers/hd/c/Chen:Yunji", "Yong Guan.....http://dblp.org/pers/hd/g/Guan:Yong"], "conf": "icse", "year": "2015", "pages": 11}