{"title": "Rubik: fast analytical power management for latency-critical systems.", "fields": ["power management", "latency", "heuristics", "dynamic demand", "granularity"], "abstract": "Latency-critical workloads (e.g., web search), common in datacenters, require stable tail (e.g., 95  th   percentile) latencies of a few milliseconds. Servers running these workloads are kept lightly loaded to meet these stringent latency targets. This low utilization wastes billions of dollars in energy and equipment annually.   Applying dynamic power management to latency-critical workloads is challenging. The fundamental issue is coping with their inherent  short-term variability : requests arrive at unpredictable times and have variable lengths. Without knowledge of the future, prior techniques either adapt slowly and conservatively or rely on application-specific heuristics to maintain tail latency.   We propose Rubik, a fine-grain DVFS scheme for latency-critical workloads. Rubik copes with variability through a novel, general, and efficient statistical performance model. This model allows Rubik to adjust frequencies at sub-millisecond granularity to save power while meeting the target tail latency. Rubik saves up to 66% of core power, widely outperforms prior techniques, and requires no application-specific tuning.   Beyond saving core power, Rubik robustly adapts to sudden changes in load and system performance. We use this capability to design RubikColoc, a colocation scheme that uses Rubik to allow batch and latency-critical work to share hardware resources more aggressively than prior techniques. RubikColoc reduces datacenter power by up to 31% while using 41% fewer servers than a datacenter that segregates latency-critical and batch work, and achieves 100% core utilization.", "citation": "Citations (17)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Harshad Kasture.....http://dblp.org/pers/hd/k/Kasture:Harshad", "Davide B. Bartolini.....http://dblp.org/pers/hd/b/Bartolini:Davide_B=", "Nathan Beckmann.....http://dblp.org/pers/hd/b/Beckmann:Nathan", "Daniel Sánchez.....http://dblp.org/pers/hd/s/S=aacute=nchez_0003:Daniel"], "conf": "micro", "year": "2015", "pages": 13}