{"title": "Alloy: Parallel-serial memory channel architecture for single-chip heterogeneous processor systems.", "fields": ["conventional memory", "uniform memory access", "registered memory", "computing with memory", "interleaved memory"], "abstract": "A single-chip heterogeneous processor integrates both CPU and GPU on the same chip, demanding higher memory bandwidth. However, the current parallel interface (e.g., DDR3) can increase neither the number of (memory) channels nor the bit rate of the channels without paying high package and power costs. In contrast, the high-speed serial interface (HSI) can offer much higher bandwidth for the same number of pins and lower power consumption for the same bandwidth than the parallel interface. This allows us to integrate more channels under a pin and/or package power constraint but at the cost of longer latency for memory accesses and higher static energy consumption in particular for idle channels. In this paper, we first provide a deep understanding of recent HSI exhibiting very distinct characteristics from past serial interfaces in terms of bit rate, latency, energy per bit transfer, and static power consumption. To overcome the limitation of using only parallel or serial interfaces, we second propose a hybrid memory channel architecture-Alloy consisting of low-latency parallel and high-bandwidth serial channels. Alloy is assisted by our two proposed techniques: (i), a memory channel partitioning technique adoptively maps physical (memory) pages of latency-sensitive (CPU) and bandwidth-consuming (GPU) applications to parallel and serial channels, respectively, and (ii) a power management technique reduces the static energy consumption of idle serial channels. On average, Alloy provides 21% and 32% higher performance for CPU and GPU, respectively, while consuming total memory interface energy comparable to the baseline parallel channel architecture for diverse mixes of co-running CPU and GPU applications.", "citation": "Citations (2)", "departments": ["University of Wisconsin-Madison", "Samsung", "Southern Methodist University", "Seoul National University", "University of Wisconsin-Madison"], "authors": ["Hao Wang.....http://dblp.org/pers/hd/w/Wang_0011:Hao", "Chang-Jae Park.....http://dblp.org/pers/hd/p/Park:Chang=Jae", "Gyungsu Byun.....http://dblp.org/pers/hd/b/Byun:Gyungsu", "Jung Ho Ahn.....http://dblp.org/pers/hd/a/Ahn:Jung_Ho", "Nam Sung Kim.....http://dblp.org/pers/hd/k/Kim:Nam_Sung"], "conf": "hpca", "year": "2015", "pages": 13}