{"title": "Can living in virtual environments alter reality?", "fields": ["acronym", "command line interface", "user friendly", "graphical user interface", "popularity"], "abstract": "Technology has made some of the once unimaginable a reality. The invention of the computer has inspired some of the most useful inventions that we heavily rely on today. Computers were first given tasks to solve complex calculations and usually consisted of a simple command line interface. Overtime people started to see the potential that computers can have on our personal lives which lead to the more user friendly, graphical user interface (GUI). The GUI was one of many interfaces that came from this growth in technology and the use of computers for personal reasons. Having access to personal computers brought forth many possibilities and applications. Today, staying connected is one of the most influential and heavily used applications of the personal computer. People rely on social networking sites such as Twitter and Facebook to keep ties with one another when far away or even close by. Research has shown that there are some negative side effects of this constant cyber connectivity in regards to our social lives and interactions. A more recent invention has received some popularity as the possibility for social interaction within it is currently being explored. This invention is known as virtual reality (VR). I am interested in researching how VR could affect people if used similar to social networking platforms we already use and how it could influence society and possibly change our social interactions. We live so much in a cyber world that we have even invented an acronym (IRL) to decipher between online/cyber life and real life. Throughout this paper I will refer to real life by using the newly invented acronym, IRL.", "citation": "Not cited", "departments": ["Carleton University"], "authors": ["Melanie Buset.....http://dblp.org/pers/hd/b/Buset:Melanie"], "conf": "vr", "year": "2015", "pages": 6}