{"title": "Nested Kernel: An Operating System Architecture for Intra-Kernel Privilege Separation.", "fields": ["monolithic kernel", "configfs", "hybrid kernel", "kernel preemption", "procfs"], "abstract": "Monolithic operating system designs undermine the security of computing systems by allowing single exploits anywhere in the kernel to enjoy full supervisor privilege. The nested kernel operating system architecture addresses this problem by \"nesting\" a small isolated kernel within a traditional monolithic kernel. The \"nested kernel\" interposes on all updates to virtual memory translations to assert protections on physical memory, thus significantly reducing the trusted computing base for memory access control enforcement. We incorporated the nested kernel architecture into FreeBSD on x86-64 hardware while allowing the entire operating system, including untrusted components, to operate at the highest hardware privilege level by write-protecting MMU translations and de-privileging the untrusted part of the kernel. Our implementation inherently enforces kernel code integrity while still allowing dynamically loaded kernel modules, thus defending against code injection attacks. We also demonstrate that the nested kernel architecture allows kernel developers to isolate memory in ways not possible in monolithic kernels by introducing write-mediation and write-logging services to protect critical system data structures. Performance of the nested kernel prototype shows modest overheads:", "citation": "Citations (30)", "year": "2015", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Rochester", "University of Illinois at Urbana–Champaign"], "conf": "asplos", "authors": ["Nathan Dautenhahn.....http://dblp.org/pers/hd/d/Dautenhahn:Nathan", "Theodoros Kasampalis.....http://dblp.org/pers/hd/k/Kasampalis:Theodoros", "Will Dietz.....http://dblp.org/pers/hd/d/Dietz:Will", "John Criswell.....http://dblp.org/pers/hd/c/Criswell:John", "Vikram S. Adve.....http://dblp.org/pers/hd/a/Adve:Vikram_S="], "pages": 16}