{"title": "Come and Be Served: Parallel Decoding for COTS RFID Tags.", "fields": ["collision", "universal software radio peripheral", "exploit", "physical layer", "software defined radio"], "abstract": "Current commodity RFID systems incur high communication overhead due to severe tag-to-tag collisions. Although some recent works have been proposed to support parallel decoding for concurrent tag transmissions, they require accurate channel measurements, tight tag synchronization, or modifications to standard RFID tag operations. In this paper, we present BiGroup, a novel RFID communication paradigm that allows the reader to decode the collision from multiple COTS (commodity-off-the-shelf) RFID tags in one communication round. In BiGroup, COTS tags can directly join ongoing communication sessions and get decoded in parallel. The collision resolution intelligence is solely put at the reader side. To this end, BiGroup examines the tag collisions at RFID physical layer from constellation domain as well as time domain, exploits the under-utilized channel capacity due to low tag transmission rate, and leverages tag diversities. We implement BiGroup with USRP N210 software radio that is able to read and decode multiple concurrent transmissions from COTS passive tags. Our experimental study gives encouraging results that BiGroup greatly improves RFID communication efficiency, i.e., 11× performance improvement compared to the alternative decoding scheme for COTS tags and 6× gain in time efficiency when applied to EPC C1G2 tag identification.", "citation": "Citations (21)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Hong Kong Polytechnic University", "Nanyang Technological University", "Nanyang Technological University", "Hong Kong Polytechnic University"], "authors": ["Jiajue Ou.....http://dblp.org/pers/hd/o/Ou:Jiajue", "Mo Li.....http://dblp.org/pers/hd/l/Li:Mo", "Yuanqing Zheng.....http://dblp.org/pers/hd/z/Zheng:Yuanqing"], "conf": "mobicom", "year": "2015", "pages": 12}