{"title": "SINGA: Putting Deep Learning in the Hands of Multimedia Users.", "fields": ["deep learning", "usable", "usability", "programming paradigm", "contextual image classification"], "abstract": "Recently, deep learning techniques have enjoyed success in various multimedia applications, such as image classification and multi-modal data analysis. Two key factors behind deep learning's remarkable achievement are the immense computing power and the availability of massive training datasets, which enable us to train large models to capture complex regularities of the data. There are two challenges to overcome before deep learning can be widely adopted in multimedia and other applications. One is usability, namely the implementation of different models and training algorithms must be done by non-experts without much effort. The other is scalability, that is the deep learning system must be able to provision for a huge demand of computing resources for training large models with massive datasets. To address these two challenges, in this paper, we design a distributed deep learning platform called SINGA which has an intuitive programming model and good scalability. Our experience with developing and training deep learning models for real-life multimedia applications in SINGA shows that the platform is both usable and scalable.", "citation": "Citations (19)", "departments": ["National University of Singapore", "Zhejiang University", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Wei Wang.....http://dblp.org/pers/hd/w/Wang_0059:Wei", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Tien Tuan Anh Dinh.....http://dblp.org/pers/hd/d/Dinh:Tien_Tuan_Anh", "Jinyang Gao.....http://dblp.org/pers/hd/g/Gao:Jinyang", "Beng Chin Ooi.....http://dblp.org/pers/hd/o/Ooi:Beng_Chin", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee", "Sheng Wang.....http://dblp.org/pers/hd/w/Wang:Sheng"], "conf": "mm", "year": "2015", "pages": 10}