{"title": "SYNC or ASYNC: time to fuse for distributed graph-parallel computation.", "fields": ["profiling", "speedup", "sync", "asynchronous communication", "ranging"], "abstract": "Large-scale graph-structured computation usually exhibits iterative and convergence-oriented computing nature, where input data is computed iteratively until a convergence condition is reached. Such features have led to the development of two different computation modes for graph-structured programs, namely synchronous (Sync) and asynchronous (Async) modes. Unfortunately, there is currently no in-depth study on their execution properties and thus programmers have to manually choose a mode, either requiring a deep understanding of underlying graph engines, or suffering from suboptimal performance. This paper makes the first comprehensive characterization on the performance of the two modes on a set of typical graph-parallel applications. Our study shows that the performance of the two modes varies significantly with different graph algorithms, partitioning methods, execution stages, input graphs and cluster scales, and no single mode consistently outperforms the other. To this end, this paper proposes Hsync, a hybrid graph computation mode that adaptively switches a graph-parallel program between the two modes for optimal performance. Hsync constantly collects execution statistics on-the-fly and leverages a set of heuristics to predict future performance and determine when a mode switch could be profitable. We have built online sampling and offline profiling approaches combined with a set of heuristics to accurately predicting future performance in the two modes. A prototype called PowerSwitch has been built based on PowerGraph, a state-of-the-art distributed graph-parallel system, to support adaptive execution of graph algorithms. On a 48-node EC2-like cluster, PowerSwitch consistently outperforms the best of both modes, with a speedup ranging from 9% to 73% due to timely switch between two modes.", "citation": "Citations (63)", "year": "2015", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "conf": "ppopp", "authors": ["Chenning Xie.....http://dblp.org/pers/hd/x/Xie:Chenning", "Rong Chen.....http://dblp.org/pers/hd/c/Chen_0001:Rong", "Haibing Guan.....http://dblp.org/pers/hd/g/Guan:Haibing", "Binyu Zang.....http://dblp.org/pers/hd/z/Zang:Binyu", "Haibo Chen.....http://dblp.org/pers/hd/c/Chen:Haibo"], "pages": 11}