{"title": "Multi-sensor Self-Quantification of Presentations.", "fields": ["analytics", "computer vision", "multimedia", "rubric", "wearable computer"], "abstract": "Presentations have been an effective means of delivering information to groups for ages. Over the past few decades, technological advancements have revolutionized the way humans deliver presentations. Despite that, the quality of presentations can be varied and affected by a variety of reasons. Conventional presentation evaluation usually requires painstaking manual analysis by experts. Although the expert feedback can definitely assist users in improving their presentation skills, manual evaluation suffers from high cost and is often not accessible to most people. In this work, we propose a novel multi-sensor self-quantification framework for presentations. Utilizing conventional ambient sensors (i.e., static cameras, Kinect sensor) and the emerging wearable egocentric sensors (i.e., Google Glass), we first analyze the efficacy of each type of sensor with various nonverbal assessment rubrics, which is followed by our proposed multi-sensor presentation analytics framework. The proposed framework is evaluated on a new presentation dataset, namely NUS Multi-Sensor Presentation (NUSMSP) dataset, which consists of 51 presentations covering a diverse set of topics. The dataset was recorded with ambient static cameras, Kinect sensor, and Google Glass. In addition to multi-sensor analytics, we have conducted a user study with the speakers to verify the effectiveness of our system generated analytics, which has received positive and promising feedback.", "citation": "Citations (10)", "departments": ["National University of Singapore", "National University of Singapore", "Interactive & D ... pore, Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore"], "authors": ["Tian Gan.....http://dblp.org/pers/hd/g/Gan:Tian", "Yongkang Wong.....http://dblp.org/pers/hd/w/Wong:Yongkang", "Bappaditya Mandal.....http://dblp.org/pers/hd/m/Mandal:Bappaditya", "Vijay Chandrasekhar.....http://dblp.org/pers/hd/c/Chandrasekhar:Vijay", "Mohan S. Kankanhalli.....http://dblp.org/pers/hd/k/Kankanhalli:Mohan_S="], "conf": "mm", "year": "2015", "pages": 10}