{"title": "An Improved Version of the Random-Facet Pivoting Rule for the Simplex Algorithm.", "fields": ["facet", "binary logarithm", "simplex algorithm", "linear inequality", "expected value"], "abstract": "The Random-Facet pivoting rule of Kalai and of Matousek, Sharir and Welzl is an elegant randomized pivoting rule for the simplex algorithm, the classical combinatorial algorithm for solving linear programs (LPs). The expected number of pivoting steps performed by the simplex algorithm when using this rule, on any linear program involving n inequalities in d variables, is 2 O(√{(n-d),log({d}/{√{n-d}}},) , where log n=max{1,log n}. A dual version of the algorithm performs an expected number of at most 2 O(√{d,log({(n-d)}/√d},)  dual pivoting steps. This dual version is currently the fastest known combinatorial algorithm for solving general linear programs. Kalai also obtained a primal pivoting rule which performs an expected number of at most 2 O(√d,log n)  pivoting steps. We present an improved version of Kalai's pivoting rule for which the expected number of primal pivoting steps is at most min{2 O(√(n-d),log(d/(n-d) ,)},2 O(√{d,log((n-d)/d}},) }. This seemingly modest improvement is interesting for at least two reasons. First, the improved bound for the number of primal pivoting steps is better than the previous bounds for both the primal and dual pivoting steps. There is no longer any need to consider a dual version of the algorithm. Second, in the important case in which n=O(d), i.e., the number of linear inequalities is linear in the number of variables, the expected running time becomes 2 O(√d)  rather than 2 O(√d log d) . Our results, which extend previous results of Gartner, apply not only to LP problems, but also to LP-type problems, supplying in particular slightly improved algorithms for solving 2-player turn-based stochastic games and related problems.", "citation": "Citations (5)", "year": "2015", "departments": ["Aarhus University", "Tel Aviv University"], "conf": "stoc", "authors": ["Thomas Dueholm Hansen.....http://dblp.org/pers/hd/h/Hansen:Thomas_Dueholm", "Uri Zwick.....http://dblp.org/pers/hd/z/Zwick:Uri"], "pages": 10}