{"title": "Quality and productivity outcomes relating to continuous integration in GitHub.", "fields": ["software development", "software deployment", "software quality", "integration testing", "software development process"], "abstract": "Software processes comprise many steps; coding is followed by building, integration testing, system testing, deployment, operations, among others. Software process integration and automation have been areas of key concern in software engineering, ever since the pioneering work of Osterweil; market pressures for Agility, and open, decentralized, software development have provided additional pressures for progress in this area. But do these innovations actually help projects? Given the numerous confounding factors that can influence project performance, it can be a challenge to discern the effects of process integration and automation. Software project ecosystems such as GitHub provide a new opportunity in this regard: one can readily find large numbers of projects in various stages of process integration and automation, and gather data on various influencing factors as well as productivity and quality outcomes. In this paper we use large, historical data on process metrics and outcomes in GitHub projects to discern the effects of one specific innovation in process automation: continuous integration. Our main finding is that continuous integration improves the productivity of project teams, who can integrate more outside contributions, without an observable diminishment in code quality.", "citation": "Citations (98)", "departments": ["University of California, Davis", "National University of Defense Technology", "National University of Defense Technology", "University of California, Davis", "University of California, Davis"], "authors": ["Bogdan Vasilescu.....http://dblp.org/pers/hd/v/Vasilescu:Bogdan", "Yue Yu.....http://dblp.org/pers/hd/y/Yu:Yue", "Huaimin Wang.....http://dblp.org/pers/hd/w/Wang:Huaimin", "Premkumar T. Devanbu.....http://dblp.org/pers/hd/d/Devanbu:Premkumar_T=", "Vladimir Filkov.....http://dblp.org/pers/hd/f/Filkov:Vladimir"], "conf": "sigsoft", "year": "2015", "pages": 12}