{"title": "Improving depth perception during surgical augmented reality.", "fields": ["alpha compositing", "augmented reality", "depth perception", "rendering", "overlay"], "abstract": "Minimally invasive surgery (MIS) is a recent surgical technique where the surgeon does not interact directly with the patient's organs. In contrast to open surgery, the surgeon manipulates the organs through instruments inserted in the patient's abdominal cavity while observing the organ from a display showing the video stream captured by an endoscopic camera. While the benefits of MIS for patients are clearly claimed, performing these operations remains very challenging for the surgeons, due to the loss of depth perception caused by this indirect manipulation. To tackle this limitation, the research community suggests to use augmented reality (AR) during the procedure [Haouchine et al. 2013]. The objective towards the use of AR during surgery is to be able to overlay the 3D model of the organ (that can be obtained from a pre-operative scan of the patient) onto the video stream. Surgical AR made considerable advances and reached a certain maturity in the estimation of tumors and vessels localisation. Howerver, very few studies have investigated depth perception and visualization of internal structures [Lerotic et al. 2007], which is considered by surgeons as a very sensitive issue. This study suggests a method to compensate the loss of depth perception while enhancing organ vessels and tumors to surgeons. This method relies on a combination of contour rendering technique and adaptive alpha blending to effectively perceive the vessels and tumors depth. In addition, this technique is designed to achieve real-time to satisfy the requirements of clinical routines, and has been tested on real human surgery.", "citation": "Citations (1)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "Altran", "French Institute for Research in Computer Science and Automation"], "authors": ["Bruno Marques.....http://dblp.org/pers/hd/m/Marques:Bruno", "Nazim Haouchine.....http://dblp.org/pers/hd/h/Haouchine:Nazim", "Rosalie Plantefève.....http://dblp.org/pers/hd/p/Plantef=egrave=ve:Rosalie", "Stephane Cotin.....http://dblp.org/pers/hd/c/Cotin:Stephane"], "conf": "siggraph", "year": "2015", "pages": 1}