{"title": "DirectFix: Looking for Simple Program Repairs.", "fields": ["reliability engineering", "program synthesis", "regression testing", "maximum satisfiability problem", "software bug"], "abstract": "Recent advances in program repair techniques have raised the possibility of patching bugs automatically. For an automatically generated patch to be accepted by developers, it should not only resolve the bug but also satisfy certain human-related factors including readability and comprehensibility. In this paper, we focus on the simplicity of patches (the size of changes). We present a novel semantics-based repair method that generates the simplest patch such that the program structure of the buggy program is maximally preserved. To take into account the simplicity of repairs in an efficient way (i.e., Without explicitly enumerating each repair candidate for each fault location), our method fuses fault localization and repair generation into one step. We do so by leveraging partial Max SAT constraint solving and component-based program synthesis. We compare our prototype implementation, Direct Fix, with the state-of-the-art semantics-based repair tool Sem Fix, that performs fault localization before repair generation. In our experiments with SIR programs and GNU Coreutils, Direct Fix generates repairs that are simpler than those generated by Sem Fix. Since both Direct Fix and Sem Fix are test-driven repair tools, they can introduce regressions for other tests which do not drive the repair. We found that Direct Fix causes substantially less regression errors than Sem Fix.", "citation": "Citations (135)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Sergey Mechtaev.....http://dblp.org/pers/hd/m/Mechtaev:Sergey", "Jooyong Yi.....http://dblp.org/pers/hd/y/Yi:Jooyong", "Abhik Roychoudhury.....http://dblp.org/pers/hd/r/Roychoudhury:Abhik"], "conf": "icse", "year": "2015", "pages": 11}