{"title": "Exploring QoE for Power Efficiency: A Field Study on Mobile Videos with LCD Displays.", "fields": ["liquid crystal display", "quality of experience", "electrical efficiency", "multimedia", "backlight"], "abstract": "Display power consumption has become a major concern for both mobile users and design engineers, especially considering the prevalence of today's video-rich mobile services. The power consumption of liquid crystal display (LCD), a dominant mobile display technology, can be reduced by dynamic backlight scaling (DBS). However, such dynamic changes of screen brightness may degrade users' quality of experience (QoE) in viewing videos. How would QoE be impacted by different DBS strategies has not yet been understood clearly and thus obscures the way to achieve systematic power saving. In this paper, we take a first step to explore the QoE of DBS on smartphones and aim at maximally enhancing the display power performance without negatively impacting users' QoE. In particular, we conduct three motivational studies to uncover the inherent relationship between QoE and backlight scaling frequency, magnitude, and temporal consistency, respectively. Motivated by the findings of these studies, we design a suite of techniques to implement a comprehensive DBS strategy. We demonstrate an example application of the proposed DBS designs in a mobile video streaming system. Measurements and user evaluations show that more than 40% system power reduction, or equivalently, 20% more power savings than the non-QoE approaches, can be achieved without QoE impairment.", "citation": "Citations (9)", "departments": ["University at Buffalo", "University at Buffalo", "Rensselaer Polytechnic Institute", "University at Buffalo"], "authors": ["Zhisheng Yan.....http://dblp.org/pers/hd/y/Yan:Zhisheng", "Qian Liu.....http://dblp.org/pers/hd/l/Liu:Qian", "Tong Zhang.....http://dblp.org/pers/hd/z/Zhang:Tong", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "conf": "mm", "year": "2015", "pages": 10}