{"title": "MUVIR: Multi-View Rare Category Detection.", "fields": ["insider threat", "data set", "exploit", "prior probability", "upper and lower bounds"], "abstract": "Rare category detection refers to the problem of identifying the initial examples from underrepresented minority classes in an imbalanced data set. This problem becomes more challenging in many real applications where the data comes from multiple views, and some views may be irrelevant for distinguishing between majority and minority classes, such as synthetic ID detection and insider threat detection. Existing techniques for rare category detection are not best suited for such applications, as they mainly focus on data with a single view.\n\nTo address the problem of multi-view rare category detection, in this paper, we propose a novel framework named MUVIR. It builds upon existing techniques for rare category detection with each single view, and exploits the relationship among multiple views to estimate the overall probability of each example belonging to the minority class. In particular, we study multiple special cases of the framework with respect to their working conditions, and analyze the performance of MUVIR in the presence of irrelevant views. For problems where the exact priors of the minority classes are unknown, we generalize the MUVIR algorithm to work with only an upper bound on the priors. Experimental results on both synthetic and real data sets demonstrate the effectiveness of the proposed framework, especially in the presence of irrelevant views.", "citation": "Citations (12)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University"], "authors": ["Dawei Zhou.....http://dblp.org/pers/hd/z/Zhou:Dawei", "Jingrui He.....http://dblp.org/pers/hd/h/He:Jingrui", "K. Selçuk Candan.....http://dblp.org/pers/hd/c/Candan:K=_Sel=ccedil=uk", "Hasan Davulcu.....http://dblp.org/pers/hd/d/Davulcu:Hasan"], "conf": "ijcai", "year": "2015", "pages": 7}