{"title": "Cleaning uncertain data with a noisy crowd.", "fields": ["crowdsourcing", "uncertain data", "probabilistic logic", "leverage", "heuristic"], "abstract": "Uncertain data has been emerged as an important problem in database systems due to the imprecise nature of many applications. To handle the uncertainty, probabilistic databases can be used to store uncertain data, and querying facilities are provided to yield answers with confidence. However, the uncertainty may propagate, hence the returned results from a query or mining process may not be useful. In this paper, we leverage the power of crowdsourcing for cleaning uncertain data. Specifically, we will design a set of Human Intelligence Tasks (HIT)s to ask a crowd to improve the quality of uncertain data. Each HIT is associated with a cost, thus, we need to design solutions to maximize the data quality with minimal number of HITs. There are two obstacles for this non-trivial optimization - first, the crowd has a probability to return incorrect answers; second, the HITs decomposed from uncertain data are often correlated. These two obstacles lead to very high computational cost for selecting the optimal set of HITs. Thus, in this paper, we have addressed these challenges by designing an effective approximation algorithm and an efficient heuristic solution. To further improve the efficiency, we derive tight lower and upper bounds, which are used for effective filtering and estimation. We have verified the solutions with extensive experiments on both a simulated crowd and a real crowdsourcing platform.", "citation": "Citations (14)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Chen Jason Zhang.....http://dblp.org/pers/hd/z/Zhang:Chen_Jason", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Yongxin Tong.....http://dblp.org/pers/hd/t/Tong:Yongxin", "Zheng Liu.....http://dblp.org/pers/hd/l/Liu_0001:Zheng"], "conf": "icde", "year": "2015", "pages": 12}