{"title": "Personalized location privacy in mobile networks: A social group utility approach.", "fields": ["anonymity", "popularity", "maximization", "leverage", "greedy algorithm"], "abstract": "With increasing popularity of location-based services (LBSs), there have been growing concerns for location privacy. To protect location privacy in a LBS, mobile users in physical proximity can work in concert to collectively change their pseudonyms, in order to hide spatial-temporal correlation in their location traces. In this study, we leverage the social tie structure among mobile users to motivate them to participate in pseudonym change. Drawing on a social group utility maximization (SGUM) framework, we cast users' decision making of whether to change pseudonyms as a socially-aware pseudonym change game (PCG). The PCG further assumes a general anonymity model that allows a user to have its specific anonymity set for personalized location privacy. For the SGUM-based PCG, we show that there exists a socially-aware Nash equilibrium (SNE), and quantify the system efficiency of the SNE with respect to the optimal social welfare. Then we develop a greedy algorithm that myopically determines users' strategies, based on the social group utility derived from only the users whose strategies have already been determined. It turns out that this algorithm can efficiently find a Pareto-optimal SNE with social welfare higher than that for the socially-oblivious PCG, pointing out the impact of exploiting social tie structure. We further show that the Pareto-optimal SNE can be achieved in a distributed manner.", "citation": "Citations (12)", "departments": ["Arizona State University", "Arizona State University", "University of Science and Technology of China", "Arizona State University", "Arizona State University"], "authors": ["Xiaowen Gong.....http://dblp.org/pers/hd/g/Gong:Xiaowen", "Xu Chen.....http://dblp.org/pers/hd/c/Chen_0004:Xu", "Kai Xing.....http://dblp.org/pers/hd/x/Xing:Kai", "Dong-Hoon Shin.....http://dblp.org/pers/hd/s/Shin:Dong=Hoon", "Mengyuan Zhang.....http://dblp.org/pers/hd/z/Zhang:Mengyuan", "Junshan Zhang.....http://dblp.org/pers/hd/z/Zhang:Junshan"], "conf": "infocom", "year": "2015", "pages": 9}