{"title": "Reweighted laplace prior based hyperspectral compressive sensing for unknown sparsity.", "fields": ["laplace transform", "bayes theorem", "latent variable", "compressed sensing", "hyperspectral imaging"], "abstract": "Compressive sensing(CS) has been exploited for hype-spectral image(HSI) compression in recent years. Though it can greatly reduce the costs of computation and storage, the reconstruction of HSI from a few linear measurements is challenging. The underlying sparsity of HSI is crucial to improve the reconstruction accuracy. However, the sparsity of HSI is unknown in reality and varied with different noise, which makes the sparsity estimation difficult. To address this problem, a novel reweighted Laplace prior based hyperspectral compressive sensing method is proposed in this study. First, the reweighted Laplace prior is proposed to model the distribution of sparsity in HSI. Second, the latent variable Bayes model is employed to learn the optimal configuration of the reweighted Laplace prior from the measurements. The model unifies signal recovery, prior learning and noise estimation into a variational framework to infer the parameters automatically. The learned sparsity prior can represent the underlying structure of the sparse signal very well and is adaptive to the unknown noise, which improves the reconstruction accuracy of HSI. The experimental results on three hyperspectral datasets demonstrate the proposed method outperforms serveral state-of-the-art hyperspectral CS methods on the reconstruction accuracy.", "citation": "Citations (10)", "year": "2015", "departments": ["Northwestern University", "Northwestern University", "Northwestern Polytechnical University", "Xidian University", "Northwestern Polytechnical University"], "conf": "cvpr", "authors": ["Lei Zhang.....http://dblp.org/pers/hd/z/Zhang_0054:Lei", "Wei Wei.....http://dblp.org/pers/hd/w/Wei_0008:Wei", "Yanning Zhang.....http://dblp.org/pers/hd/z/Zhang:Yanning", "Chunna Tian.....http://dblp.org/pers/hd/t/Tian:Chunna", "Fei Li.....http://dblp.org/pers/hd/l/Li_0011:Fei"], "pages": 8}