{"title": "A Self-Paced Multiple-Instance Learning Framework for Co-Saliency Detection.", "fields": ["stability", "instance based learning", "robot learning", "competitive learning", "active learning"], "abstract": "As an interesting and emerging topic, co-saliency detection aims at simultaneously extracting common salient objects in a group of images. Traditional co-saliency detection approaches rely heavily on human knowledge for designing hand-crafted metrics to explore the intrinsic patterns underlying co-salient objects. Such strategies, however, always suffer from poor generalization capability to flexibly adapt various scenarios in real applications, especially due to their lack of insightful understanding of the biological mechanisms of human visual co-attention. To alleviate this problem, we propose a novel framework for this task, by naturally reformulating it as a multiple-instance learning (MIL) problem and further integrating it into a self-paced learning (SPL) regime. The proposed framework on one hand is capable of fitting insightful metric measurements and discovering common patterns under co-salient regions in a self-learning way by MIL, and on the other hand tends to promise the learning reliability and stability by simulating the human learning process through SPL. Experiments on benchmark datasets have demonstrated the effectiveness of the proposed framework as compared with the state-of-the-arts.", "citation": "Citations (29)", "year": "2015", "departments": ["Northwestern Polytechnical University", "Xi'an Jiaotong University", "Northwestern University", "Carnegie Mellon University", "Xi'an Jiaotong University"], "conf": "iccv", "authors": ["Dingwen Zhang.....http://dblp.org/pers/hd/z/Zhang:Dingwen", "Deyu Meng.....http://dblp.org/pers/hd/m/Meng:Deyu", "Chao Li.....http://dblp.org/pers/hd/l/Li:Chao", "Lu Jiang.....http://dblp.org/pers/hd/j/Jiang_0004:Lu", "Qian Zhao.....http://dblp.org/pers/hd/z/Zhao_0002:Qian", "Junwei Han.....http://dblp.org/pers/hd/h/Han:Junwei"], "pages": 9}