{"title": "The List Decoding Radius of Reed-Muller Codes over Small Fields.", "fields": ["bounded function", "list decoding", "special case", "conjecture", "reed muller code"], "abstract": "The list decoding problem for a code asks for the maximal radius up to which any ball of that radius contains only a constant number of codewords. The list decoding radius is not well understood even for well studied codes, like Reed-Solomon or Reed-Muller codes. Fix a finite field F. The Reed-Muller code RM F (n,d) is defined by n-variate degree-d polynomials over F. In this work, we study the list decoding radius of Reed-Muller codes over a constant prime field F=F p , constant degree d and large n. We show that the list decoding radius is equal to the minimal distance of the code.   That is, if we denote by δ(d) the normalized minimal distance of RM F (n,d), then the number of codewords in any ball of radius δ(d)-e is bounded by c=c(p,d,e) independent of n. This resolves a conjecture of Gopalan-Klivans-Zuckerman [STOC 2008], who among other results proved it in the special case of F=F 2 ; and extends the work of Gopalan [FOCS 2010] who proved the conjecture in the case of d=2.   We also analyse the number of codewords in balls of radius exceeding the minimal distance of the code. For e ≤ d, we show that the number of codewords of RM F (n,d) in a ball of radius δ(e) - e is bounded by exp(c • n d-e ), where c=c(p,d,e) is independent of n. The dependence on $n$ is tight. This extends the work of Kaufman-Lovett-Porat [IEEE Inf. Theory 2012] who proved similar bounds over F 2 .   The proof relies on several new ingredients: an extension of the Frieze-Kannan weak regularity to general function spaces, higher-order Fourier analysis, and an extension of the Schwartz-Zippel-DeMillo-Lipton lemma to compositions of polynomials.", "citation": "Citations (6)", "year": "2015", "departments": ["University of Texas at Austin", "University of California, San Diego"], "conf": "stoc", "authors": ["Abhishek Bhowmick.....http://dblp.org/pers/hd/b/Bhowmick_0001:Abhishek", "Shachar Lovett.....http://dblp.org/pers/hd/l/Lovett:Shachar"], "pages": 9}