{"title": "Modelling Human Factors in Perceptual Multimedia Quality: On The Role of Personality and Culture.", "fields": ["random effects model", "moderation", "personality", "hofstede s cultural dimensions theory", "big five personality traits and culture"], "abstract": "Perception of multimedia quality is shaped by a rich interplay between system, context and human factors. While system and context factors are widely researched, few studies consider human factors as sources of systematic variance. This paper presents an analysis on the influence of personality and cultural traits on the perception of multimedia quality. A set of 144 video sequences (from 12 short movie excerpts) were rated by 114 participants from a cross-cultural population, producing 1232 ratings. On this data, three models are compared: a baseline model that only considers system factors; an extended model that includes personality and culture as human factors; and an optimistic model in which each participant is modelled as a random effect. An analysis shows that personality and cultural traits represent 9.3\\% of the variance attributable to human factors while human factors overall predict an equal or higher proportion of variance compared to system factors. In addition, the quality-enjoyment correlation varied across the excerpts. This suggests that human factors play an important role in perceptual multimedia quality, but further research to explore moderation effects and a broader range of human factors is warranted.", "citation": "Citations (9)", "departments": ["Brunel University London", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Brunel University London"], "authors": ["Michael James Scott.....http://dblp.org/pers/hd/s/Scott:Michael_James", "Sharath Chandra Guntuku.....http://dblp.org/pers/hd/g/Guntuku:Sharath_Chandra", "Huan Yang.....http://dblp.org/pers/hd/y/Yang_0001:Huan", "Weisi Lin.....http://dblp.org/pers/hd/l/Lin:Weisi", "Gheorghita Ghinea.....http://dblp.org/pers/hd/g/Ghinea:Gheorghita"], "conf": "mm", "year": "2015", "pages": 10}