{"title": "ShareInsights: An Unified Approach to Full-stack Data Processing.", "fields": ["data virtualization", "data visualization", "unified process", "data warehouse", "database", "data architecture", "data proliferation", "computer science", "data processing", "data mining"], "abstract": "The field of data analysis seeks to extract value from data for either business or scientific benefit. This field has seen a renewed interest with the advent of big data technologies and a new organizational role called data scientist. Even with the new found focus, the task of analyzing large amounts of data is still challenging and time-consuming.   The essence of data analysis involves setting up data pipe-lines which consists of several operations that are chained together - starting from data collection, data quality checks, data integration, data analysis and data visualization (including the setting up of interaction paths in that visualization).   In our opinion, the challenges stem from from the technology diversity at each stage of the data pipeline as well as the lack of process around the analysis.   In this paper we present a platform that aims to significantly reduce the time it takes to build data pipelines. The platform attempts to achieve this in following ways.   Allow the user to describe the entire data pipeline with a single language and idioms - all the way from data ingestion to insight expression (via visualization and end-user interaction).   Provide a rich library of parts that allow users to quickly assemble a data analysis pipeline in the language.   Allow for a collaboration model that allows multiple users to work together on a data analysis pipeline as well as leverage and extend prior work with minimal effort.     We studied the efficacy of the platform for a data hackathon competition conducted in our organization. The hackathon provided us with a way to study the impact of the approach. Rich data pipelines which traditionally took weeks to build were constructed and deployed in hours. Consequently, we believe that the complexity of designing and running the data analysis pipeline can be significantly reduced; leading to a marked improvement in the productivity of data analysts/data scientists.", "citation": "Not cited", "year": "2015", "departments": ["Persistent Syst ... d., Pune, India", "Persistent Syst ... d., Pune, India", "Persistent Syst ... d., Pune, India", "Persistent Syst ... d., Pune, India"], "conf": "sigmod", "authors": ["Mukund Deshpande.....http://dblp.org/pers/hd/d/Deshpande:Mukund", "Dhruva Ray.....http://dblp.org/pers/hd/r/Ray:Dhruva", "Sameer Dixit.....http://dblp.org/pers/hd/d/Dixit:Sameer", "Avadhoot Agasti.....http://dblp.org/pers/hd/a/Agasti:Avadhoot"], "pages": 16}