{"title": "Sparse Linear Programming via Primal and Dual Augmented Coordinate Descent.", "fields": ["estimation of covariance matrices", "coordinate descent", "non negative matrix factorization", "augmented lagrangian method", "simplex"], "abstract": "Over the past decades, Linear Programming (LP) has been widely used in different areas and considered as one of the mature technologies in numerical optimization. However, the complexity offered by state-of-the-art algorithms (i.e. interior-point method and primal, dual simplex methods) is still unsatisfactory for problems in machine learning with huge number of variables and constraints. In this paper, we investigate a general LP algorithm based on the combination of Augmented Lagrangian and Coordinate Descent (AL-CD), giving an iteration complexity of O((log(1/∊))2) with O(nnz(A)) cost per iteration, where nnz(A) is the number of non-zeros in the m x n constraint matrix A, and in practice, one can further reduce cost per iteration to the order of non-zeros in columns (rows) corresponding to the active primal (dual) variables through an active-set strategy. The algorithm thus yields a tractable alternative to standard LP methods for large-scale problems of sparse solutions and nnz(A) ≪ mn. We conduct experiments on large-scale LP instances from l1 -regularized multi-class SVM, Sparse Inverse Covariance Estimation, and Nonnegative Matrix Factorization, where the proposed approach finds solutions of 10-3 precision orders of magnitude faster than state-of-the-art implementations of interior-point and simplex methods.1", "citation": "Citations (7)", "year": "2015", "departments": ["University of Texas at Austin", "University of Texas at Austin", "University of California, Davis", "University of Texas at Austin", "University of Texas at Austin"], "conf": "nips", "authors": ["Ian En-Hsu Yen.....http://dblp.org/pers/hd/y/Yen:Ian_En=Hsu", "Kai Zhong.....http://dblp.org/pers/hd/z/Zhong:Kai", "Cho-Jui Hsieh.....http://dblp.org/pers/hd/h/Hsieh:Cho=Jui", "Pradeep Ravikumar.....http://dblp.org/pers/hd/r/Ravikumar:Pradeep", "Inderjit S. Dhillon.....http://dblp.org/pers/hd/d/Dhillon:Inderjit_S="], "pages": 9}