{"title": "Petuum: A New Platform for Distributed Machine Learning on Big Data.", "fields": ["dynamic priority scheduling", "big data", "implementation", "correctness", "server", "data parallelism", "computer cluster", "software deployment"], "abstract": "How can one build a distributed framework that allows efficient deployment of a wide spectrum of modern advanced machine learning (ML) programs for industrial-scale problems using Big Models (100s of billions of parameters) on Big Data (terabytes or petabytes)- Contemporary parallelization strategies employ fine-grained operations and scheduling beyond the classic bulk-synchronous processing paradigm popularized by MapReduce, or even specialized operators relying on graphical representations of ML programs. The variety of approaches tends to pull systems and algorithms design in different directions, and it remains difficult to find a universal platform applicable to a wide range of different ML programs at scale. We propose a general-purpose framework that systematically addresses data- and model-parallel challenges in large-scale ML, by leveraging several fundamental properties underlying ML programs that make them different from conventional operation-centric programs: error tolerance, dynamic structure, and nonuniform convergence; all stem from the optimization-centric nature shared in ML programs' mathematical definitions, and the iterative-convergent behavior of their algorithmic solutions. These properties present unique opportunities for an integrative system design, built on bounded-latency network synchronization and dynamic load-balancing scheduling, which is efficient, programmable, and enjoys provable correctness guarantees. We demonstrate how such a design in light of ML-first principles leads to significant performance improvements versus well-known implementations of several ML programs, allowing them to run in much less time and at considerably larger model sizes, on modestly-sized computer clusters.", "citation": "Citations (139)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Agency for Science, Technology and Research", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Institute for I ... pore, Singapore"], "authors": ["Eric P. Xing.....http://dblp.org/pers/hd/x/Xing:Eric_P=", "Qirong Ho.....http://dblp.org/pers/hd/h/Ho:Qirong", "Wei Dai.....http://dblp.org/pers/hd/d/Dai_0003:Wei", "Jin Kyu Kim.....http://dblp.org/pers/hd/k/Kim:Jin_Kyu", "Jinliang Wei.....http://dblp.org/pers/hd/w/Wei:Jinliang", "Seunghak Lee.....http://dblp.org/pers/hd/l/Lee:Seunghak", "Xun Zheng.....http://dblp.org/pers/hd/z/Zheng:Xun", "Pengtao Xie.....http://dblp.org/pers/hd/x/Xie:Pengtao", "Abhimanu Kumar.....http://dblp.org/pers/hd/k/Kumar:Abhimanu", "Yaoliang Yu.....http://dblp.org/pers/hd/y/Yu:Yaoliang"], "conf": "kdd", "year": "2015", "pages": 10}