{"title": "Contextual-code: Simplifying information pulling from targeted sources in physical world.", "fields": ["computer science", "popularity", "multimedia", "mobile search"], "abstract": "The popularity of QR code clearly indicates the strong demand of users to acquire (or pull) further information from interested sources (e.g., a poster) in the physical world. However, existing information pulling practices such as a mobile search or QR code scanning incur heavy user involvement to identify the targeted posters. Meanwhile, businesses (e.g., advertisers) are also interested to learn about the behaviors of potential customers such as where, when, and how users show interests in their offerings. Unfortunately, little such context information are provided by existing information pulling systems. In this paper, we present Contextual-Code (C-Code) — an information pulling system that greatly relieves users' efforts in pulling information from targeted posters, and in the meantime provides rich context information of user behavior to businesses. C-Code leverages the rich contextual information captured by the smartphone sensors to automatically disambiguate information sources in different contexts. It assigns simple codes (e.g., a character) to sources whose contexts are not discriminating enough. To pull the information from an interested source, users only need to input the simple code shown on the targeted source. Our experiments demonstrate the effectiveness of C-Code design. Users can effectively and uniquely identify targeted information sources with an average accuracy over 90%.", "citation": "Not cited", "departments": ["Peking University", "Peking University", "Microsoft", "Peking University", "Peking University"], "authors": ["Yang Tian.....http://dblp.org/pers/hd/t/Tian:Yang", "Kaigui Bian.....http://dblp.org/pers/hd/b/Bian:Kaigui", "Guobin Shen.....http://dblp.org/pers/hd/s/Shen:Guobin", "Xiaochen Liu.....http://dblp.org/pers/hd/l/Liu:Xiaochen", "Xiaoguang Li.....http://dblp.org/pers/hd/l/Li:Xiaoguang", "Thomas Moscibroda.....http://dblp.org/pers/hd/m/Moscibroda:Thomas"], "conf": "infocom", "year": "2015", "pages": 9}