{"title": "Exploring Privacy and Accuracy Trade-Offs in Crowdsourced Behavioral Video Coding.", "fields": ["crowdsourcing", "coding", "internet privacy", "crowds", "social phenomenon"], "abstract": "Coding behavioral video is an important method used by researchers to understand social phenomenon. Unfortunately, traditional hand-coding approaches can take days or weeks of time to complete. Recent work has shown that these tasks can be completed quickly by leveraging the parallelism of large online crowds, but using the crowd introduces new concerns about accuracy, reliability, privacy, and cost. To explore these issues, we conducted interviews with 12 researchers who frequently code behavioral video, to investigate common practices and challenges with video coding. We find accuracy and privacy to be the researchers' primary concerns. To explore this more concretely, we used sample videos to investigate whether crowds can accurately recognize instances of commonly coded behaviors, and show that the crowd yields accurate results. Then, we demonstrate a method for obfuscating participant identity with a video blur filter, and find, as expected, that workers' ability to identify participants decreases as blur level increases. The workers' ability to accurately and reliably code behaviors also decreases, but not as steeply as the identity test. This trade-off between coding quality and privacy protection suggests that researchers can use online crowds to code for some key behaviors in video without compromising participant identity. We conclude with a discussion of how researchers can balance privacy and accuracy on their own data using a system we introduce called Incognito.", "citation": "Citations (5)", "year": "2015", "departments": ["University of Rochester", "University of Rochester", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "chi", "authors": ["Walter S. Lasecki.....http://dblp.org/pers/hd/l/Lasecki:Walter_S=", "Mitchell Gordon.....http://dblp.org/pers/hd/g/Gordon:Mitchell", "Winnie Leung.....http://dblp.org/pers/hd/l/Leung:Winnie", "Ellen Lim.....http://dblp.org/pers/hd/l/Lim:Ellen", "Jeffrey P. Bigham.....http://dblp.org/pers/hd/b/Bigham:Jeffrey_P=", "Steven P. Dow.....http://dblp.org/pers/hd/d/Dow:Steven_P="], "pages": 10}