{"title": "Composite Constant Propagation: Application to Android Inter-Component Communication Analysis.", "fields": ["declarative programming", "process theory", "android", "composite number", "solver"], "abstract": "Many program analyses require statically inferring the possible values of composite types. However, current approaches either do not account for correlations between object fields or do so in an  ad hoc  manner. In this paper, we introduce the problem of composite constant propagation. We develop the first generic solver that infers all possible values of complex objects in an interprocedural, flow and context-sensitive manner, taking field correlations into account. Composite constant propagation problems are specified using COAL, a declarative language. We apply our COAL solver to the problem of inferring Android Inter-Component Communication (ICC) values, which is required to understand how the components of Android applications interact. Using COAL, we model ICC objects in Android more thoroughly than the state-of-the-art. We compute ICC values for 460 applications from the Play store. The ICC values we infer are substantially more precise than previous work. The analysis is efficient, taking slightly over two minutes per application on average. While this work can be used as the basis for many whole-program analyses of Android applications, the COAL solver can also be used to infer the values of composite objects in many other contexts.", "citation": "Citations (115)", "departments": ["Pennsylvania State University", "Carnegie Mellon University", "Pennsylvania State University", "University of Wisconsin-Madison", "Pennsylvania State University"], "authors": ["Damien Octeau.....http://dblp.org/pers/hd/o/Octeau:Damien", "Daniel Luchaup.....http://dblp.org/pers/hd/l/Luchaup:Daniel", "Matthew Dering.....http://dblp.org/pers/hd/d/Dering:Matthew", "Somesh Jha.....http://dblp.org/pers/hd/j/Jha:Somesh", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D="], "conf": "icse", "year": "2015", "pages": 12}