{"title": "The SprayList: a scalable relaxed priority queue.", "fields": ["skip list", "priority queue", "bottleneck", "thread", "concurrent data structure"], "abstract": "High-performance concurrent priority queues are essential for applications such as task scheduling and discrete event simulation. Unfortunately, even the best performing implementations do not scale past a number of threads in the single digits. This is because of the sequential bottleneck in accessing the elements at the head of the queue in order to perform a DeleteMin operation. In this paper, we present the SprayList, a scalable priority queue with relaxed ordering semantics. Starting from a non-blocking SkipList, the main innovation behind our design is that the DeleteMin operations avoid a sequential bottleneck by ``spraying'' themselves onto the head of the SkipList list in a coordinated fashion. The spraying is implemented using a carefully designed random walk, so that DeleteMin returns an element among the first O(p log^3 p) in the list, with high probability, where p is the number of threads. We prove that the running time of a DeleteMin operation is O(log^3 p), with high probability, independent of the size of the list. Our experiments show that the relaxed semantics allow the data structure to scale for high thread counts, comparable to a classic unordered SkipList. Furthermore, we observe that, for reasonably parallel workloads, the scalability benefits of relaxation considerably outweigh the additional work due to out-of-order execution.", "citation": "Citations (31)", "year": "2015", "departments": ["Microsoft", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "ppopp", "authors": ["Dan Alistarh.....http://dblp.org/pers/hd/a/Alistarh:Dan", "Justin Kopinsky.....http://dblp.org/pers/hd/k/Kopinsky:Justin", "Jerry Li.....http://dblp.org/pers/hd/l/Li_0001:Jerry", "Nir Shavit.....http://dblp.org/pers/hd/s/Shavit:Nir"], "pages": 10}