{"title": "IccTA: Detecting Inter-Component Privacy Leaks in Android Apps.", "fields": ["malware", "wallpaper", "upload", "android", "privacy software"], "abstract": "Shake Them All  is a popular \"Wallpaper\" application exceeding millions of downloads on Google Play. At installation, this application is given permission to (1) access the Internet (for updating wallpapers) and (2) use the device microphone (to change background following noise changes). With these permissions, the application could silently record user conversations and upload them remotely. To give more confidence about how  Shake Them All  actually processes what it records, it is necessary to build a precise analysis tool that tracks the flow of any sensitive data from its source point to any sink, especially if those are in different components.   Since Android applications may leak private data carelessly or maliciously, we propose IccTA, a static taint analyzer to detect privacy leaks among components in Android applications. IccTA goes beyond state-of-the-art approaches by supporting inter-component detection. By propagating context information among components, IccTA improves the precision of the analysis. IccTA outperforms existing tools on two benchmarks for ICC-leak detectors: DroidBench and ICC-Bench. Moreover, our approach detects 534 ICC leaks in 108 apps from MalGenome and 2,395 ICC leaks in 337 apps in a set of 15,000 Google Play apps.", "citation": "Citations (289)", "departments": ["University of Luxembourg", "Technische Universität Darmstadt", "University of Luxembourg", "University of Luxembourg", "University of Luxembourg"], "authors": ["Li Li.....http://dblp.org/pers/hd/l/Li_0029:Li", "Alexandre Bartel.....http://dblp.org/pers/hd/b/Bartel:Alexandre", "Tegawendé F. Bissyandé.....http://dblp.org/pers/hd/b/Bissyand=eacute=:Tegawend=eacute=_F=", "Jacques Klein.....http://dblp.org/pers/hd/k/Klein:Jacques", "Yves Le Traon.....http://dblp.org/pers/hd/t/Traon:Yves_Le", "Steven Arzt.....http://dblp.org/pers/hd/a/Arzt:Steven", "Siegfried Rasthofer.....http://dblp.org/pers/hd/r/Rasthofer:Siegfried", "Eric Bodden.....http://dblp.org/pers/hd/b/Bodden:Eric", "Damien Octeau.....http://dblp.org/pers/hd/o/Octeau:Damien", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D="], "conf": "icse", "year": "2015", "pages": 12}