{"title": "Model-Based Tracking at 300Hz Using Raw Time-of-Flight Observations.", "fields": ["modulation", "temporal resolution", "robustness", "time of flight", "video tracking"], "abstract": "Consumer depth cameras have dramatically improved our ability to track rigid, articulated, and deformable 3D objects in real-time. However, depth cameras have a limited temporal resolution (frame-rate) that restricts the accuracy and robustness of tracking, especially for fast or unpredictable motion. In this paper, we show how to perform model-based object tracking which allows to reconstruct the object's depth at an order of magnitude higher frame-rate through simple modifications to an off-the-shelf depth camera. We focus on phase-based time-of-flight (ToF) sensing, which reconstructs each low frame-rate depth image from a set of short exposure 'raw' infrared captures. These raw captures are taken in quick succession near the beginning of each depth frame, and differ in the modulation of their active illumination. We make two contributions. First, we detail how to perform model-based tracking against these raw captures. Second, we show that by reprogramming the camera to space the raw captures uniformly in time, we obtain a 10x higher frame-rate, and thereby improve the ability to track fast-moving objects.", "citation": "Citations (4)", "year": "2015", "departments": ["Technische Universität München", "Microsoft", "Microsoft", "Facebook", "Microsoft"], "conf": "iccv", "authors": ["Jan Stühmer.....http://dblp.org/pers/hd/s/St=uuml=hmer:Jan", "Sebastian Nowozin.....http://dblp.org/pers/hd/n/Nowozin:Sebastian", "Andrew W. Fitzgibbon.....http://dblp.org/pers/hd/f/Fitzgibbon:Andrew_W=", "Richard Szeliski.....http://dblp.org/pers/hd/s/Szeliski:Richard", "Travis Perry.....http://dblp.org/pers/hd/p/Perry:Travis", "Sunil Acharya.....http://dblp.org/pers/hd/a/Acharya:Sunil", "Daniel Cremers.....http://dblp.org/pers/hd/c/Cremers:Daniel", "Jamie Shotton.....http://dblp.org/pers/hd/s/Shotton:Jamie"], "pages": 9}