{"title": "Reactive Integrated Motion Planning and Execution.", "fields": ["graph", "motion planning", "predictability", "testbed", "trajectory"], "abstract": "Current motion planners, such as the ones available in ROS MoveIt, can solve difficult motion planning problems. However, these planners are not practical in unstructured, rapidly-changing environments. First, they assume that the environment is well-known, and static during planning and execution. Second, they do not support temporal constraints, which are often important for synchronization between a robot and other actors. Third, because many popular planners generate completely new trajectories for each planning problem, they do not allow for representing persistent control policy information associated with a trajectory across planning problems.\n\nWe present Chekhov, a reactive, integrated motion planning and execution system that addresses these problems. Chekhov uses a Tube-based Roadmap in which the edges of the roadmap graph are families of trajectories called flow tubes, rather than the single trajectories commonly used in roadmap systems. Flow tubes contain control policy information about how to move through the tube, and also represent the dynamic limits of the system, which imply temporal constraints. This, combined with an incremental APSP algorithm for quickly finding paths in the roadmap graph, allows Chekhov to operate in rapidly changing environments. Testing in simulation, and with a robot testbed has shown improvement in planning speed and motion predictability over current motion planners.", "citation": "Citations (1)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Andreas G. Hofmann.....http://dblp.org/pers/hd/h/Hofmann:Andreas_G=", "Enrique Fernández-González.....http://dblp.org/pers/hd/f/Fern=aacute=ndez=Gonz=aacute=lez:Enrique", "Justin Helbert.....http://dblp.org/pers/hd/h/Helbert:Justin", "Scott D. Smith.....http://dblp.org/pers/hd/s/Smith:Scott_D=", "Brian Charles Williams.....http://dblp.org/pers/hd/w/Williams:Brian_Charles"], "conf": "ijcai", "year": "2015", "pages": 7}