{"title": "Multi-Context TLS (mcTLS): Enabling Secure In-Network Functionality in TLS.", "fields": ["encryption", "transport layer security", "computer security model", "internet traffic", "middlebox"], "abstract": "A significant fraction of Internet traffic is now encrypted and HTTPS will likely be the default in HTTP/2. However, Transport Layer Security (TLS), the standard protocol for encryption in the Internet, assumes that all functionality resides at the endpoints, making it impossible to use in-network services that optimize network resource usage, improve user experience, and protect clients and servers from security threats. Re-introducing in-network functionality into TLS sessions today is done through hacks, often weakening overall security.   In this paper we introduce multi-context TLS (mcTLS), which extends TLS to support middleboxes. mcTLS breaks the current \"all-or-nothing\" security model by allowing endpoints and content providers to explicitly introduce middleboxes in secure end-to-end sessions while controlling which parts of the data they can read or write.   We evaluate a prototype mcTLS implementation in both controlled and \"live\" experiments, showing that its benefits come at the cost of minimal overhead. More importantly, we show that mcTLS can be incrementally deployed and requires only small changes to client, server, and middlebox software.", "citation": "Citations (84)", "departments": ["Carnegie Mellon University", "Case Western Reserve University", "Telefónica", "Telefónica", "Telefónica"], "authors": ["David Naylor.....http://dblp.org/pers/hd/n/Naylor:David", "Kyle Schomp.....http://dblp.org/pers/hd/s/Schomp:Kyle", "Matteo Varvello.....http://dblp.org/pers/hd/v/Varvello:Matteo", "Ilias Leontiadis.....http://dblp.org/pers/hd/l/Leontiadis:Ilias", "Jeremy Blackburn.....http://dblp.org/pers/hd/b/Blackburn:Jeremy", "Diego R. López.....http://dblp.org/pers/hd/l/L=oacute=pez:Diego_R=", "Konstantina Papagiannaki.....http://dblp.org/pers/hd/p/Papagiannaki:Konstantina", "Pablo Rodríguez Rodríguez.....http://dblp.org/pers/hd/r/Rodr=iacute=guez:Pablo_Rodr=iacute=guez", "Peter Steenkiste.....http://dblp.org/pers/hd/s/Steenkiste:Peter"], "conf": "sigcomm", "year": "2015", "pages": 14}