{"title": "A Multimodal Predictive Model of Successful Debaters or How I Learned to Sway Votes.", "fields": ["public speaking", "negotiation", "public opinion", "social skills", "career development"], "abstract": "Interpersonal skills such as public speaking are essential assets for a large variety of professions and in everyday life. The ability to communicate in social environments often greatly influences a person's career development, can help resolve conflict, gain the upper hand in negotiations, or sway the public opinion. We focus our investigations on a special form of public speaking, namely public debates of socioeconomic issues that affect us all. In particular, we analyze performances of expert debaters recorded through the Intelligence Squared U.S. (IQ2US) organization. IQ2US collects high-quality audiovisual recordings of these debates and publishes them online free of charge. We extract audiovisual nonverbal behavior descriptors, including facial expressions, voice quality characteristics, and surface level linguistic characteristics. Within our experiments we investigate if it is possible to automatically predict if a debater or his/her team are going to sway the most votes after the debate using multimodal machine learning and fusion approaches. We identify unimodal nonverbal behaviors that characterize successful debaters and our investigations reveal that multimodal machine learning approaches can reliably predict which individual (~75% accuracy) or team (85% accuracy) is going to win the most votes in the debate. We created a database consisting of over 30 debates with four speakers per debate suitable for public speaking skill analysis and plan to make this database publicly available for the research community.", "citation": "Citations (10)", "departments": ["University of Twente", "AmeriCorps VISTA"], "authors": ["Maarten Brilman.....http://dblp.org/pers/hd/b/Brilman:Maarten", "Stefan Scherer.....http://dblp.org/pers/hd/s/Scherer:Stefan"], "conf": "mm", "year": "2015", "pages": 10}