{"title": "CLAPP: characterizing loops in Android applications.", "fields": ["bounded function", "android", "optimizing compiler", "ranging", "static analysis"], "abstract": "When performing program analysis, loops are one of the most important aspects that needs to be taken into account. In the past, many approaches have been proposed to analyze loops to perform different tasks, ranging from compiler optimizations to Worst-Case Execution Time (WCET) analysis. While these approaches are powerful, they focus on tackling very specific categories of loops and known loop patterns, such as the ones for which the number of iterations can be statically determined. In this work, we developed a static analysis framework to characterize and analyze generic loops, without relying on techniques based on pattern matching. For this work, we focus on the Android platform, and we implemented a prototype, called CLAPP, that we used to perform the first large-scale empirical study of the usage of loops in Android applications. In particular, we used our tool to analyze a total of 4,110,510 loops found in 11,823 Android applications. As part of our evaluation, we provide the detailed results of our empirical study, we show how our analysis was able to determine that the execution of 63.28% of the loops is bounded, and we discuss several interesting insights related to the performance issues and security aspects associated with loops.", "citation": "Citations (13)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Yanick Fratantonio.....http://dblp.org/pers/hd/f/Fratantonio:Yanick", "Aravind Machiry.....http://dblp.org/pers/hd/m/Machiry:Aravind", "Antonio Bianchi.....http://dblp.org/pers/hd/b/Bianchi:Antonio", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "conf": "sigsoft", "year": "2015", "pages": 11}