{"title": "Synthesising Executable Gene Regulatory Networks from Single-Cell Gene Expression Data.", "fields": ["boolean network", "gene regulatory network", "snapshot", "executable", "asynchronous communication"], "abstract": "Recent experimental advances in biology allow researchers to obtain gene expression profiles at single-cell resolution over hundreds, or even thousands of cells at once. These single-cell measurements provide snapshots of the states of the cells that make up a tissue, instead of the population-level averages provided by conventional high-throughput experiments. This new data therefore provides an exciting opportunity for computational modelling. In this paper we introduce the idea of viewing single-cell gene expression profiles as states of an asynchronous Boolean network, and frame model inference as the problem of reconstructing a Boolean network from its state space. We then give a scalable algorithm to solve this synthesis problem. We apply our technique to both simulated and real data. We first apply our technique to data simulated from a well established model of common myeloid progenitor differentiation. We show that our technique is able to recover the original Boolean network rules. We then apply our technique to a large dataset taken during embryonic development containing thousands of cell measurements. Our technique synthesises matching Boolean networks, and analysis of these models yields new predictions about blood development which our experimental collaborators were able to verify.", "citation": "Citations (9)", "year": "2015", "departments": ["University of Cambridge", "Microsoft", "University of California, Berkeley", "University of California", "University of Leicester", "University of Cambridge"], "conf": "cav", "authors": ["Jasmin Fisher.....http://dblp.org/pers/hd/f/Fisher:Jasmin", "Ali Sinan Köksal.....http://dblp.org/pers/hd/k/K=ouml=ksal:Ali_Sinan", "Nir Piterman.....http://dblp.org/pers/hd/p/Piterman:Nir", "Steven Woodhouse.....http://dblp.org/pers/hd/w/Woodhouse:Steven"], "pages": 17}