{"title": "Crowdsourcing with Tullock contests: A new perspective.", "fields": ["crowdsourcing", "revenue", "common value auction", "incentive", "contest"], "abstract": "Incentive mechanisms for crowdsourcing have been extensively studied under the framework of all-pay auctions. Along a distinct line, this paper proposes to use Tullock contests as an alternative tool to design incentive mechanisms for crowdsourcing. We are inspired by the conduciveness of Tullock contests to attracting user entry (yet not necessarily a higher revenue) in other domains. In this paper, we explore a new dimension in optimal Tullock contest design, by superseding the contest prize — which is fixed in conventional Tullock contests — with a prize function that is dependent on the (unknown) winner's contribution, in order to maximize the crowdsourcer's utility. We show that this approach leads to attractive practical advantages: (a) it is well-suited for rapid prototyping in fully distributed web agents and smartphone apps; (b) it overcomes the disincentive to participate caused by players' antagonism to an increasing number of rivals. Furthermore, we optimize conventional, fixed-prize Tullock contests to construct the most superior benchmark to compare against our mechanism. Through extensive evaluations, we show that our mechanism significantly outperforms the optimal benchmark, by over three folds on the crowdsourcer's utility cum profit and up to nine folds on the players' social welfare.", "citation": "Citations (24)", "departments": ["Agency for Science, Technology and Research", "University of New South Wales", "Agency for Science, Technology and Research", "Shanghai Jiao Tong University", "University of Louisiana at Lafayette"], "authors": ["Tie Luo.....http://dblp.org/pers/hd/l/Luo:Tie", "Salil S. Kanhere.....http://dblp.org/pers/hd/k/Kanhere:Salil_S=", "Hwee-Pink Tan.....http://dblp.org/pers/hd/t/Tan:Hwee=Pink", "Fan Wu.....http://dblp.org/pers/hd/w/Wu:Fan", "Hongyi Wu.....http://dblp.org/pers/hd/w/Wu:Hongyi"], "conf": "infocom", "year": "2015", "pages": 9}