{"title": "Interactive Cloud Experimentation for Biology: An Online Education Case Study.", "fields": ["learning analytics", "cloud computing", "computation", "scalability", "educational technology"], "abstract": "Interacting with biological systems via experiments is important for academia, industry, and education, but access barriers exist due to training, costs, safety, logistics, and spatial separation. High-throughput equipment combined with web streaming could enable interactive biology experiments online, but no such platform currently exists. We present a cloud experimentation architecture (paralleling cloud computation), which is optimized for a class of domain-specific equipments (biotic processing units - BPU) to share and execute many experiments in parallel remotely and interactively at all time. We implemented an instance of this architecture that enables chemotactic experiments with a slime mold Physarum Polycephelum. A user study in the blended teaching and research setting of a graduate-level biophysics class demonstrated that this platform lowers the access barrier for non-biologists, enables discovery, and facilitates learning analytics. This architecture is flexible for integration with various biological specimens and equipments to facilitate scalable interactive online education, collaborations, research, and citizen science.", "citation": "Citations (15)", "year": "2015", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "conf": "chi", "authors": ["Zahid Hossain.....http://dblp.org/pers/hd/h/Hossain_0001:Zahid", "Xiaofan Jin.....http://dblp.org/pers/hd/j/Jin:Xiaofan", "Engin W. Bumbacher.....http://dblp.org/pers/hd/b/Bumbacher:Engin_W=", "Alice M. Chung.....http://dblp.org/pers/hd/c/Chung:Alice_M=", "Stephen Koo.....http://dblp.org/pers/hd/k/Koo:Stephen", "Jordan D. Shapiro.....http://dblp.org/pers/hd/s/Shapiro:Jordan_D=", "Cynthia Y. Truong.....http://dblp.org/pers/hd/t/Truong:Cynthia_Y=", "Sean Choi.....http://dblp.org/pers/hd/c/Choi:Sean", "Nathan D. Orloff.....http://dblp.org/pers/hd/o/Orloff:Nathan_D=", "Paulo Blikstein.....http://dblp.org/pers/hd/b/Blikstein:Paulo", "Ingmar H. Riedel-Kruse.....http://dblp.org/pers/hd/r/Riedel=Kruse:Ingmar_H="], "pages": 10}