{"title": "Diversified top-k clique search.", "fields": ["k tree", "clique percolation method", "simplex graph", "clique graph", "clique", "intersection number"], "abstract": "Maximal clique enumeration is a fundamental problem in graph theory and has been extensively studied. However, maximal clique enumeration is time-consuming in large graphs and always returns enormous cliques with large overlaps. Motivated by this, in this paper, we study the diversified top-k clique search problem which is to find top-k cliques that can cover most number of nodes in the graph. Diversified top-k clique search can be widely used in a lot of applications including community search, motif discovery, and anomaly detection in large graphs. A naive solution for diversified top-k clique search is to keep all maximal cliques in memory and then find k of them that cover most nodes in the graph by using the approximate greedy max k-cover algorithm. However, such a solution is impractical when the graph is large. In this paper, instead of keeping all maximal cliques in memory, we devise an algorithm to maintain k candidates in the process of maximal clique enumeration. Our algorithm has limited memory footprint and can achieve a guaranteed approximation ratio. We also introduce a novel light-weight $$\\mathsf {PNP}$$PNP-$$\\mathsf {Index}$$Index, based on which we design an optimal maximal clique maintenance algorithm. We further explore three optimization strategies to avoid enumerating all maximal cliques and thus largely reduce the computational cost. Besides, for the massive input graph, we develop an I/O efficient algorithm to tackle the problem when the input graph cannot fit in main memory. We conduct extensive performance studies on real graphs and synthetic graphs. One of the real graphs contains 1.02 billion edges. The results demonstrate the high efficiency and effectiveness of our approach.", "citation": "Citations (4)", "departments": ["University of New South Wales", "University of Technology, Sydney", "University of New South Wales", "University of New South Wales", "University of New South Wales", "University of New South Wales", "University of Technology, Sydney", "University of New South Wales", "University of New South Wales", "University of New South Wales"], "authors": ["Long Yuan.....http://dblp.org/pers/hd/y/Yuan:Long", "Lu Qin.....http://dblp.org/pers/hd/q/Qin:Lu", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Lijun Chang.....http://dblp.org/pers/hd/c/Chang:Lijun", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie"], "conf": "icde", "year": "2015", "pages": 12}