{"title": "Differentially private frequent sequence mining via sampling-based candidate pruning.", "fields": ["closure", "sequential pattern mining", "information privacy", "pruning", "differential privacy"], "abstract": "In this paper, we study the problem of mining frequent sequences under the rigorous differential privacy model. We explore the possibility of designing a differentially private frequent sequence mining (FSM) algorithm which can achieve both high data utility and a high degree of privacy. We found, in differentially private FSM, the amount of required noise is proportionate to the number of candidate sequences. If we could effectively reduce the number of unpromising candidate sequences, the utility and privacy tradeoff can be significantly improved. To this end, by leveraging a sampling-based candidate pruning technique, we propose a novel differentially private FSM algorithm, which is referred to as PFS 2 . The core of our algorithm is to utilize sample databases to further prune the candidate sequences generated based on the downward closure property. In particular, we use the noisy local support of candidate sequences in the sample databases to estimate which sequences are potentially frequent. To improve the accuracy of such private estimations, a sequence shrinking method is proposed to enforce the length constraint on the sample databases. Moreover, to decrease the probability of misestimating frequent sequences as infrequent, a threshold relaxation method is proposed to relax the user-specified threshold for the sample databases. Through formal privacy analysis, we show that our PFS 2  algorithm is e-differentially private. Extensive experiments on real datasets illustrate that our PFS 2  algorithm can privately find frequent sequences with high accuracy.", "citation": "Citations (9)", "departments": ["Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Emory University"], "authors": ["Shengzhi Xu.....http://dblp.org/pers/hd/x/Xu:Shengzhi", "Sen Su.....http://dblp.org/pers/hd/s/Su:Sen", "Xiang Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Xiang", "Zhengyi Li.....http://dblp.org/pers/hd/l/Li:Zhengyi", "Li Xiong.....http://dblp.org/pers/hd/x/Xiong_0001:Li"], "conf": "icde", "year": "2015", "pages": 12}