{"title": "Cracking App Isolation on Apple: Unauthorized Cross-App Resource Access on MAC OS~X and iOS.", "fields": ["os x", "websocket", "sandbox", "exploit", "mac os"], "abstract": "On modern operating systems, applications under the same user are separated from each other, for the purpose of protecting them against malware and compromised programs. Given the complexity of today's OSes, less clear is whether such isolation is effective against different kind of cross-app resource access attacks (called XARA in our research). To better understand the problem, on the less-studied Apple platforms, we conducted a systematic security analysis on MAC OS~X and iOS. Our research leads to the discovery of a series of high-impact security weaknesses, which enable a sandboxed malicious app, approved by the Apple Stores, to gain unauthorized access to other apps' sensitive data. More specifically, we found that the inter-app interaction services, including the keychain, WebSocket and NSConnection on OS~X and URL Scheme on the MAC OS and iOS, can all be exploited by the malware to steal such confidential information as the passwords for iCloud, email and bank, and the secret token of Evernote. Further, the design of the app sandbox on OS~X was found to be vulnerable, exposing an app's private directory to the sandboxed malware that hijacks its Apple Bundle ID. As a result, sensitive user data, like the notes and user contacts under Evernote and photos under WeChat, have all been disclosed. Fundamentally, these problems are caused by the lack of app-to-app and app-to-OS authentications. To better understand their impacts, we developed a scanner that automatically analyzes the binaries of MAC OS and iOS apps to determine whether proper protection is missing in their code. Running it on hundreds of binaries, we confirmed the pervasiveness of the weaknesses among high-impact Apple apps. Since the issues may not be easily fixed, we built a simple program that detects exploit attempts on OS~X, helping protect vulnerable apps before the problems can be fully addressed.", "citation": "Citations (10)", "year": "2015", "departments": ["Indiana University Bloomington", "Indiana University Bloomington", "Peking University", "Indiana University Bloomington", "Chinese Academy of Sciences"], "conf": "ccs", "authors": ["Luyi Xing.....http://dblp.org/pers/hd/x/Xing:Luyi", "Xiaolong Bai.....http://dblp.org/pers/hd/b/Bai:Xiaolong", "Tongxin Li.....http://dblp.org/pers/hd/l/Li:Tongxin", "XiaoFeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:XiaoFeng", "Kai Chen.....http://dblp.org/pers/hd/c/Chen_0012:Kai", "Xiaojing Liao.....http://dblp.org/pers/hd/l/Liao:Xiaojing", "Shi-Min Hu.....http://dblp.org/pers/hd/h/Hu:Shi=Min", "Xinhui Han.....http://dblp.org/pers/hd/h/Han:Xinhui"], "pages": 13}