{"title": "Robust optimization of cognitive radio networks powered by energy harvesting.", "fields": ["global optimum", "robust optimization", "cognitive radio", "transmitter power output", "power control"], "abstract": "We consider a cognitive radio network, where primary users (PUs) share their spectrum with energy harvesting (EH) enabled secondary users (SUs), conditioned on a limited SUs' interference at PU receivers. Due to the lack of information exchange between SUs and PUs, the SU-PU interference channels are subject to uncertainty in channel estimation. Besides channel uncertainty, SUs' EH profile is also subject to spatial and temporal variations, which enforce an energy causality constraint on SUs' transmit power control and affect SUs' interference at PU receivers. Considering both the channel and EH uncertainties, we propose a robust design for SUs' power control to maximize SUs' throughput performance. Our robust design targets at the worst-case interference constraint to provide a robust protection for PUs, while guarantees a transmission probability to reflect SUs' minimum QoS requirements. To make the non-convex throughput maximization problem tractable, we develop a convex approximation for each robust constraint and successfully design a successive approximation approach that converges to the global optimum of the throughput objective. Simulations show that SUs will change transmission strategies according to PUs' sensitivity to interference, and we also exploit the impact of SUs' EH profile (e.g., mean, variance, and correlation) on SUs' power control.", "citation": "Citations (7)", "departments": ["Singapore University of Technology and Design", "Singapore University of Technology and Design", "Nanyang Technological University"], "authors": ["Shimin Gong.....http://dblp.org/pers/hd/g/Gong:Shimin", "Lingjie Duan.....http://dblp.org/pers/hd/d/Duan:Lingjie", "Ping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Ping"], "conf": "infocom", "year": "2015", "pages": 9}