{"title": "DeepFont: Identify Your Font from An Image.", "fields": ["deep learning", "domain adaptation", "font", "convolutional neural network", "test data"], "abstract": "As font is one of the core design concepts, automatic font identification and similar font suggestion from an image or photo has been on the wish list of many designers. We study the Visual Font Recognition (VFR) problem [4] LFE, and advance the state-of-the-art remarkably by developing the  DeepFont  system. First of all, we build up the first available large-scale VFR dataset, named  AdobeVFR , consisting of both labeled synthetic data and partially labeled real-world data. Next, to combat the domain mismatch between available training and testing data, we introduce a Convolutional Neural Network (CNN) decomposition approach, using a domain adaptation technique based on a Stacked Convolutional Auto-Encoder (SCAE) that exploits a large corpus of unlabeled real-world text images combined with synthetic data preprocessed in a specific way. Moreover, we study a novel learning-based model compression approach, in order to reduce the DeepFont model size without sacrificing its performance. The DeepFont system achieves an accuracy of higher than 80% (top-5) on our collected dataset, and also produces a good font similarity measure for font selection and suggestion. We also achieve around 6 times compression of the model without any visible loss of recognition accuracy.", "citation": "Citations (19)", "departments": ["University of Illinois at Urbana–Champaign", "Adobe Systems", "Adobe Systems", "Google", "Snapchat Inc, Venice, CA, USA"], "authors": ["Zhangyang Wang.....http://dblp.org/pers/hd/w/Wang:Zhangyang", "Jianchao Yang.....http://dblp.org/pers/hd/y/Yang:Jianchao", "Hailin Jin.....http://dblp.org/pers/hd/j/Jin:Hailin", "Eli Shechtman.....http://dblp.org/pers/hd/s/Shechtman:Eli", "Aseem Agarwala.....http://dblp.org/pers/hd/a/Agarwala:Aseem", "Jonathan Brandt.....http://dblp.org/pers/hd/b/Brandt:Jonathan", "Thomas S. Huang.....http://dblp.org/pers/hd/h/Huang:Thomas_S="], "conf": "mm", "year": "2015", "pages": 9}