{"title": "Towards Domain-Specific Semantic Relatedness: A Case Study from Geography.", "fields": ["text mining", "graph", "semantic similarity", "ranging", "geospatial analysis"], "abstract": "Semantic relatedness (SR) measures form the algorithmic foundation of intelligent technologies in domains ranging from artificial intelligence to human-computer interaction. Although SR has been researched for decades, this work has focused on developing general SR measures rooted in graph and text mining algorithms that perform reasonably well for many different types of concepts. This paper introduces domain-specific SR, which augments general SR by identifying, capturing, and synthesizing domain-specific relationships between concepts. Using the domain of geography as a case study, we show that domain-specific SR -- and even geography-specific signals alone (e.g. distance, containment) without sophisticated graph or text mining algorithms -- significantly outperform the SR state-of-the-art for geographic concepts. In addition to substantially improving SR measures for geospatial technologies, an area that is rapidly increasing in importance, this work also unlocks an important new direction for SR research: SR measures that incorporate domain-specific customizations to increase accuracy.", "citation": "Citations (1)", "departments": ["Macalester College", "University of Minnesota", "Brandeis University", "Macalester College", "Wilamette College"], "authors": ["Shilad Sen.....http://dblp.org/pers/hd/s/Sen:Shilad", "Isaac L. Johnson.....http://dblp.org/pers/hd/j/Johnson:Isaac_L=", "Rebecca Harper.....http://dblp.org/pers/hd/h/Harper:Rebecca", "Huy Mai.....http://dblp.org/pers/hd/m/Mai:Huy", "Samuel Horlbeck Olsen.....http://dblp.org/pers/hd/o/Olsen:Samuel_Horlbeck", "Benjamin Mathers.....http://dblp.org/pers/hd/m/Mathers:Benjamin", "Laura Souza Vonessen.....http://dblp.org/pers/hd/v/Vonessen:Laura_Souza", "Matthew Wright.....http://dblp.org/pers/hd/w/Wright:Matthew", "Brent J. Hecht.....http://dblp.org/pers/hd/h/Hecht:Brent_J="], "conf": "ijcai", "year": "2015", "pages": 9}