{"title": "Efficient Route Planning on Public Transportation Networks: A Labelling Approach.", "fields": ["schedule", "overhead", "preprocessor", "flow network", "labelling"], "abstract": "A public transportation network can often be modeled as a  timetable graph  where (i) each node represents a station; and (ii) each directed edge  (u,v)  is associated with a  timetable  that records the departure (resp. arrival) time of each vehicle at station  u  (resp.  v ). Several techniques have been proposed for various types of route planning on timetable graphs, e.g., retrieving the route from a node to another with the shortest travel time. These techniques, however, either provide insufficient query efficiency or incur significant space overheads.   This paper presents  Timetable Labelling (TTL) , an efficient indexing technique for route planning on timetable graphs. The basic idea of  TTL  is to associate each node $u$ with a set of  labels , each of which records the shortest travel time from  u  to some other node  v  given a certain departure time from  u ; such labels would then be used during query processing to improve efficiency. In addition, we propose query algorithms that enable  TTL  to support three popular types of route planning queries, and investigate how we reduce the space consumption of  TTL  with advanced preprocessing and label compression methods. By conducting an extensive set of experiments on real world datasets, we demonstrate that  TTL  significantly outperforms the states of the art in terms of query efficiency, while incurring moderate preprocessing and space overheads.", "citation": "Citations (17)", "year": "2015", "departments": ["Nanyang Technological University", "Agency for Science, Technology and Research", "Fudan University", "Nanyang Technological University", "Fudan University"], "conf": "sigmod", "authors": ["Sibo Wang.....http://dblp.org/pers/hd/w/Wang_0001:Sibo", "Wenqing Lin.....http://dblp.org/pers/hd/l/Lin:Wenqing", "Yi Yang.....http://dblp.org/pers/hd/y/Yang:Yi", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Shuigeng Zhou.....http://dblp.org/pers/hd/z/Zhou:Shuigeng"], "pages": 16}