{"title": "Noise-tolerant localization from incomplete range measurements for wireless sensor networks.", "fields": ["euclidean distance matrix", "ranging", "scale invariant feature transform", "matrix completion", "distance matrix"], "abstract": "Accurate and sufficient range measurements are essential for range-based localization in wireless sensor networks. However, noise and data missing are inevitable in distance ranging, which may degrade localization accuracy drastically. Existing localization approaches often degrade in terms of accuracy in the co-existence of incomplete and corrupted range measurements. To address this challenge, a noise-tolerant localization algorithm called NLIRM is presented. By utilizing the natural low rank property of Euclidean distance matrix, the reconstruction of partially sampled and noisy distance matrix is formulated as a norm-regularized matrix completion problem, where Gaussian noises and outliers are smoothed by Frobenius-norm and L 1  norm regularization, respectively. As far as we are aware of, this is the first scheme that can recover the missing range measurements and explicitly sift Gaussian noise and outlier simultaneously. Simulation results demonstrate that, compared with traditional algorithms, NLIRM achieves better localization performance under the same experiment setting. In addition, our algorithm provides an accurate prediction of outlier positions, which is the prerequisite for malfunction diagnosis in WSN.", "citation": "Citations (10)", "departments": ["Nanjing University of Posts and Telecommunications", "Nanjing University of Posts and Telecommunications", "Nanjing University of Posts and Telecommunications", "Nanjing University of Posts and Telecommunications", "Nanjing University of Posts and Telecommunications"], "authors": ["Fu Xiao.....http://dblp.org/pers/hd/x/Xiao:Fu", "Chaoheng Sha.....http://dblp.org/pers/hd/s/Sha:Chaoheng", "Lei Chen.....http://dblp.org/pers/hd/c/Chen:Lei", "Lijuan Sun.....http://dblp.org/pers/hd/s/Sun:Lijuan", "Ruchuan Wang.....http://dblp.org/pers/hd/w/Wang:Ruchuan"], "conf": "infocom", "year": "2015", "pages": 9}