{"title": "Squall: Fine-Grained Live Reconfiguration for Partitioned Main Memory Databases.", "fields": ["control reconfiguration", "downtime", "transaction processing", "distributed transaction", "online transaction processing"], "abstract": "For data-intensive applications with many concurrent users, modern distributed main memory database management systems (DBMS) provide the necessary scale-out support beyond what is possible with single-node systems. These DBMSs are optimized for the short-lived transactions that are common in on-line transaction processing (OLTP) workloads. One way that they achieve this is to partition the database into disjoint subsets and use a single-threaded transaction manager per partition that executes transactions one-at-a-time in serial order. This minimizes the overhead of concurrency control mechanisms, but requires careful partitioning to limit distributed transactions that span multiple partitions. Previous methods used off-line analysis to determine how to partition data, but the dynamic nature of these applications means that they are prone to hotspots. In these situations, the DBMS needs to reconfigure how data is partitioned in real-time to maintain performance objectives. Bringing the system off-line to reorganize the database is unacceptable for on-line applications.   To overcome this problem, we introduce the Squall technique for supporting live reconfiguration in partitioned, main memory DBMSs. Squall supports fine-grained repartitioning of databases in the presence of distributed transactions, high throughput client workloads, and replicated data. An evaluation of our approach on a distributed DBMS shows that Squall can reconfigure a database with no downtime and minimal overhead on transaction latency.", "citation": "Citations (15)", "year": "2015", "departments": ["University of Chicago", "University of California, Santa Barbara", "Massachusetts Institute of Technology", "Carnegie Mellon University", "University of California, Santa Barbara"], "conf": "sigmod", "authors": ["Aaron J. Elmore.....http://dblp.org/pers/hd/e/Elmore:Aaron_J=", "Vaibhav Arora.....http://dblp.org/pers/hd/a/Arora:Vaibhav", "Rebecca Taft.....http://dblp.org/pers/hd/t/Taft:Rebecca", "Andrew Pavlo.....http://dblp.org/pers/hd/p/Pavlo:Andrew", "Divyakant Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Divyakant", "Amr El Abbadi.....http://dblp.org/pers/hd/a/Abbadi:Amr_El"], "pages": 15}