{"title": "Smart Beholder: An Open-Source Smart Lens for Mobile Photography.", "fields": ["viewfinder", "small form factor", "network dynamics", "frame rate", "latency"], "abstract": "Smart lenses are detachable lenses connected to mobile devices via wireless networks, which are not constrained by the small form factor of mobile devices, and have potential to deliver better photo (video) quality. However, the viewfinder previews of smart lenses on mobile devices are difficult to optimize, due to the strict resource constraints on smart lenses and fluctuating wireless network conditions. In this paper, we design, implement, and evaluate an open-source smart lens, called Smart Beholder. It achieves three design goals: (i) cost effectiveness, (ii) low interaction latency, and (iii) high preview quality by: (i) selecting an embedded system board that is just powerful enough, (ii) minimizing per-component latency, and (iii) dynamically adapting the video coding parameters to maximizing Quality of Experience (QoE), respectively. Several optimization techniques, such as anti-drifting mechanism for video frames and QoE-driven resolution/frame rate adaptation algorithm, are proposed in this paper. Our measurement study shows that Smart Beholder outperforms Altek Cubic and Sony QX100 in terms of lower bitrate, lower latency, slightly higher frame rate, and better preview quality. We also demonstrate that sys adapts to network dynamics. Smart Beholder has been made public at http://www.smartbeholder.org as an experimental platform for researchers and developers to optimize smart lenses and other embedded real-time video streaming systems.", "citation": "Citations (3)", "departments": ["National Taiwan Ocean University", "Academia Sinica", "Academia Sinica", "National Tsing Hua University", "National Tsing Hua University"], "authors": ["Chun-Ying Huang.....http://dblp.org/pers/hd/h/Huang:Chun=Ying", "Chih-Fan Hsu.....http://dblp.org/pers/hd/h/Hsu:Chih=Fan", "Tsung-Han Tsai.....http://dblp.org/pers/hd/t/Tsai:Tsung=Han", "Ching-Ling Fan.....http://dblp.org/pers/hd/f/Fan:Ching=Ling", "Cheng-Hsin Hsu.....http://dblp.org/pers/hd/h/Hsu:Cheng=Hsin", "Kuan-Ta Chen.....http://dblp.org/pers/hd/c/Chen:Kuan=Ta"], "conf": "mm", "year": "2015", "pages": 10}