{"title": "Real time personalized search on social networks.", "fields": ["personalized search", "algorithm design", "phenomenon", "ranking", "inverted index"], "abstract": "Internet users are shifting from searching on traditional media to social network platforms (SNPs) to retrieve up-to-date and valuable information. SNPs have two unique characteristics: frequent content update and small world phenomenon. However, existing works are not able to support these two features simultaneously. To address this problem, we develop a general framework to enable real time personalized top-k query. Our framework is based on a general ranking function that incorporates time freshness, social relevance and textual similarity. To ensure efficient update and query processing, there are two key challenges. The first is to design an index structure that is update-friendly while supporting instant query processing. The second is to efficiently compute the social relevance in a complex graph. To address these challenges, we first design a novel 3D cube inverted index to support efficient pruning on the three dimensions simultaneously. Then we devise a cube based threshold algorithm to retrieve the top-k results, and propose several pruning techniques to optimize the social distance computation, whose cost dominates the query processing. Furthermore, we optimize the 3D index via a hierarchical partition method to enhance our pruning on the social dimension. Extensive experimental results on two real world large datasets demonstrate the efficiency and the robustness of our proposed solution.", "citation": "Citations (22)", "departments": ["National University of Singapore", "University of Tasmania", "Tsinghua University", "National University of Singapore"], "authors": ["Yuchen Li.....http://dblp.org/pers/hd/l/Li:Yuchen", "Zhifeng Bao.....http://dblp.org/pers/hd/b/Bao:Zhifeng", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Kian-Lee Tan.....http://dblp.org/pers/hd/t/Tan:Kian=Lee"], "conf": "icde", "year": "2015", "pages": 12}