{"title": "Distributed Outlier Detection using Compressive Sensing.", "fields": ["logarithm", "news aggregator", "novelty", "big data", "outlier"], "abstract": "Computing outliers and related statistical aggregation functions from large-scale big data sources is a critical operation in many cloud computing scenarios, e.g. service quality assurance, fraud detection, or novelty discovery. Such problems commonly have to be solved in a distributed environment where each node only has a local slice of the entirety of the data. To process a query on the global data, each node must transmit its local slice of data or an aggregated subset thereof to a global aggregator node, which can then compute the desired statistical aggregation function. In this context, reducing the total communication cost is often critical to the overall efficiency.   In this paper, we show both theoretically and empirically that these communication costs can be significantly reduced for common distributed computing problems if we take advantage of the fact that production-level big data usually exhibits a form of sparse structure. Specifically, we devise a new aggregation paradigm for outlier detection and related queries. The paradigm leverages compressive sensing for data sketching in combination with outlier detection techniques. We further propose an algorithm that works even for non-sparse data that concentrates around an unknown value. In both cases, we show that the communication cost is reduced to the logarithm of the global data size. We incorporate our approach into Hadoop and evaluate it on real web-scale production data (distributed click-data logs). Our approach reduces data shuffling IO by up to 99%, and end-to-end job duration by up to 40% on many actual production queries.", "citation": "Citations (6)", "year": "2015", "departments": ["Microsoft", "Microsoft", "Microsoft", "Peking University", "University of Illinois at Urbana–Champaign"], "conf": "sigmod", "authors": ["Ying Yan.....http://dblp.org/pers/hd/y/Yan:Ying", "Jiaxing Zhang.....http://dblp.org/pers/hd/z/Zhang:Jiaxing", "Bojun Huang.....http://dblp.org/pers/hd/h/Huang:Bojun", "Xuzhan Sun.....http://dblp.org/pers/hd/s/Sun:Xuzhan", "Jiaqi Mu.....http://dblp.org/pers/hd/m/Mu:Jiaqi", "Zheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Zheng", "Thomas Moscibroda.....http://dblp.org/pers/hd/m/Moscibroda:Thomas"], "pages": 14}