{"title": "Finding top-k local users in geo-tagged social media data.", "fields": ["data set", "ranking", "friendship", "search engine indexing", "instruction set"], "abstract": "Social network platforms and location-based services are increasingly popular in people's daily lives. The combination of them results in location-based social media where people are connected not only through the friendship in the social network but also by their geographical locations in reality. This duality makes it possible to query and make use of social media data in novel ways. In this work, we formulate a novel and useful problem called top-k local user search (TkLUS for short) from tweets with geo-tags. Given a location q, a distance r, and a set of keywords W, the TkLUS query finds the top-k users who have posted tweets relevant to the desired keywords in W at a place within the distance r from q. TkLUS queries are useful in many application scenarios such as friend recommendation, spatial decision, etc. We design a set of techniques to answer such queries efficiently. First, we propose two local user ranking methods that integrate text relevance and location proximity in a TkLUS query. Second, we construct a hybrid index under a scalable framework, which is aware of keywords as well as locations, to organize high volume geo-tagged tweets. Furthermore, we devise two algorithms for processing TkLUS queries. Finally, we conduct an experimental study using real tweet data sets to evaluate the proposed techniques. The experimental results demonstrate the efficiency, effectiveness and scalability of our proposals.", "citation": "Citations (20)", "departments": ["Aalborg University", "Aalborg University", "Aalborg University", "Peking University"], "authors": ["Jinling Jiang.....http://dblp.org/pers/hd/j/Jiang:Jinling", "Hua Lu.....http://dblp.org/pers/hd/l/Lu_0001:Hua", "Bin Yang.....http://dblp.org/pers/hd/y/Yang_0002:Bin", "Bin Cui.....http://dblp.org/pers/hd/c/Cui_0001:Bin"], "conf": "icde", "year": "2015", "pages": 12}