{"title": "Snooping Keystrokes with mm-level Audio Ranging on a Single Phone.", "fields": ["phone", "password", "labeled data", "ranging", "keystroke logging"], "abstract": "This paper explores the limits of audio ranging on mobile devices in the context of a keystroke snooping scenario. Acoustic keystroke snooping is challenging because it requires distinguishing and labeling sounds generated by tens of keys in very close proximity. Existing work on acoustic keystroke recognition relies on training with labeled data, linguistic context, or multiple phones placed around a keyboard --- requirements that limit usefulness in an adversarial context. In this work, we show that mobile audio hardware advances can be exploited to discriminate mm-level position differences and that this makes it feasible to locate the origin of keystrokes from only a single phone behind the keyboard. The technique clusters keystrokes using time-difference of arrival measurements as well as acoustic features to identify multiple strokes of the same key. It then computes the origin of these sounds precise enough to identify and label each key. By locating keystrokes this technique avoids the need for labeled training data or linguistic context. Experiments with three types of keyboards and off-the-shelf smartphones demonstrate scenarios where our system can recover $94\\%$ of keystrokes, which to our knowledge, is the first single-device technique that enables acoustic snooping of passwords.", "citation": "Citations (29)", "departments": ["Stevens Institute of Technology", "Stevens Institute of Technology", "Rutgers University", "Stevens Institute of Technology", "Florida State University"], "authors": ["Jian Liu.....http://dblp.org/pers/hd/l/Liu_0001:Jian", "Yan Wang.....http://dblp.org/pers/hd/w/Wang_0003:Yan", "Gorkem Kar.....http://dblp.org/pers/hd/k/Kar:Gorkem", "Yingying Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yingying", "Jie Yang.....http://dblp.org/pers/hd/y/Yang_0003:Jie", "Marco Gruteser.....http://dblp.org/pers/hd/g/Gruteser:Marco"], "conf": "mobicom", "year": "2015", "pages": 13}