{"title": "Missing the Point(er): On the Effectiveness of Code Pointer Integrity.", "fields": ["implementation", "memory corruption", "exploit", "memory safety", "memory leak"], "abstract": "Memory corruption attacks continue to be a major vector of attack for compromising modern systems. Numerous defenses have been proposed against memory corruption attacks, but they all have their limitations and weaknesses. Stronger defenses such as complete memory safety for legacy languages (C/C++) incur a large overhead, while weaker ones such as practical control flow integrity have been shown to be ineffective. A recent technique called code pointer integrity (CPI) promises to balance security and performance by focusing memory safety on code pointers thus preventing most control-hijacking attacks while maintaining low overhead. CPI protects access to code pointers by storing them in a safe region that is protected by instruction level isolation. On x86-32, this isolation is enforced by hardware, on x86-64 and ARM, isolation is enforced by information hiding. We show that, for architectures that do not support segmentation in which CPI relies on information hiding, CPI's safe region can be leaked and then maliciously modified by using data pointer overwrites. We implement a proof-of-concept exploit against Nginx and successfully bypass CPI implementations that rely on information hiding in 6 seconds with 13 observed crashes. We also present an attack that generates no crashes and is able to bypass CPI in 98 hours. Our attack demonstrates the importance of adequately protecting secrets in security mechanisms and the dangers of relying on difficulty of guessing without guaranteeing the absence of memory leaks.", "citation": "Citations (103)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Isaac Evans.....http://dblp.org/pers/hd/e/Evans:Isaac", "Sam Fingeret.....http://dblp.org/pers/hd/f/Fingeret:Sam", "Julian Gonzalez.....http://dblp.org/pers/hd/g/Gonzalez:Julian", "Ulziibayar Otgonbaatar.....http://dblp.org/pers/hd/o/Otgonbaatar:Ulziibayar", "Tiffany Tang.....http://dblp.org/pers/hd/t/Tang:Tiffany", "Howard E. Shrobe.....http://dblp.org/pers/hd/s/Shrobe:Howard_E=", "Stelios Sidiroglou-Douskos.....http://dblp.org/pers/hd/s/Sidiroglou=Douskos:Stelios", "Martin Rinard.....http://dblp.org/pers/hd/r/Rinard:Martin", "Hamed Okhravi.....http://dblp.org/pers/hd/o/Okhravi:Hamed"], "conf": "sp", "year": "2015", "pages": 16}