{"title": "AEDSMS: Automotive Embedded Data Stream Management System.", "fields": ["stream processing", "automotive industry", "data stream", "data stream management system", "low latency"], "abstract": "Data stream management systems (DSMSs) are useful for the management and processing of continuous data at a high input rate with low latency. In the automotive domain, embedded systems use a variety of sensor data and communications from outside the vehicle to promote autonomous and safe driving. Thus, the software developed for these systems must be capable of handling large volumes of data and complex processing. At present, we are developing a platform for the integration and management of data in an automotive embedded system using a DSMS. However, compared with conventional DSMS fields, we have encountered new challenges such as precompiling queries when designing automotive systems (which demands time predictability), distributed stream processing in in-vehicle networks, and real-time scheduling and sensor data fusion by stream processing. Therefore, we developed an automotive embedded DSMS (AEDSMS) to address these challenges. The main contributions of the present study are: (1) a clear understanding of the challenges faced when introducing DSMSs into the automotive field; (2) the development of AEDSMS to tackle these challenges; and (3) an evaluation of AEDSMS during runtime using a driving assistance application.", "citation": "Citations (6)", "departments": ["Nagoya University", "University of Hyogo", "Doshisha University", "Nagoya University", "Nagoya University"], "authors": ["Akihiro Yamaguchi.....http://dblp.org/pers/hd/y/Yamaguchi:Akihiro", "Yukikazu Nakamoto.....http://dblp.org/pers/hd/n/Nakamoto:Yukikazu", "Kenya Sato.....http://dblp.org/pers/hd/s/Sato:Kenya", "Yoshiharu Ishikawa.....http://dblp.org/pers/hd/i/Ishikawa:Yoshiharu", "Yousuke Watanabe.....http://dblp.org/pers/hd/w/Watanabe:Yousuke", "Shinya Honda.....http://dblp.org/pers/hd/h/Honda:Shinya", "Hiroaki Takada.....http://dblp.org/pers/hd/t/Takada:Hiroaki"], "conf": "icde", "year": "2015", "pages": 12}