{"title": "A consensus-based approach for platooning with inter-vehicular communications.", "fields": ["radar", "controller", "fading", "platoon", "channel"], "abstract": "Automated and coordinated vehicles' driving (platooning) is gaining more and more attention today and it represents a challenging scenario heavily relying on wireless Inter-Vehicular Communication (IVC). In this paper, we propose a novel controller for vehicle platooning based on consensus. Opposed to current approaches where the logical control topology is fixed a priori and the control law designed consequently, we design a system whose control topology can be reconfigured depending on the actual network status. Moreover, the controller does not require the vehicles to be radar equipped and automatically compensates outdated information caused by network delays. We define the control law and analyze it in both analytical and simulative way, showing its robustness in different network scenarios. We consider three different wireless network settings: uncorrelated Bernoullian losses, correlated losses using a Gilbert-Elliott channel, and a realistic traffic scenario with interferences caused by other vehicles. Finally, we compare our strategy with another state of the art controller. The results show the ability of the proposed approach to maintain a stable string of vehicles even in the presence of strong interference, delays, and fading conditions, providing higher comfort and safety for platoon drivers. 1", "citation": "Citations (25)", "departments": ["University of Innsbruck", "University of N ... rico II (Italy)", "University of N ... rico II (Italy)", "University of N ... rico II (Italy)", "University of N ... rico II (Italy)"], "authors": ["Stefania Santini.....http://dblp.org/pers/hd/s/Santini:Stefania", "Alessandro Salvi.....http://dblp.org/pers/hd/s/Salvi:Alessandro", "Antonio Saverio Valente.....http://dblp.org/pers/hd/v/Valente:Antonio_Saverio", "Antonio Pescapè.....http://dblp.org/pers/hd/p/Pescap=egrave=:Antonio", "Michele Segata.....http://dblp.org/pers/hd/s/Segata:Michele", "Renato Lo Cigno.....http://dblp.org/pers/hd/c/Cigno:Renato_Lo"], "conf": "infocom", "year": "2015", "pages": 9}