{"title": "Effective test suites for mixed discrete-continuous stateflow controllers.", "fields": ["real time computing", "embedded software", "selection algorithm", "stateflow", "automation"], "abstract": "Modeling mixed discrete-continuous controllers using Stateflow is common practice and has a long tradition in the embedded software system industry. Testing Stateflow models is complicated by expensive and manual test oracles that are not amenable to full automation due to the complex continuous behaviors of such models. In this paper, we reduce the cost of manual test oracles by providing test case selection algorithms that help engineers develop small test suites with high fault revealing power for Stateflow models. We present six test selection algorithms for discrete-continuous Stateflows: An adaptive random test selection algorithm that diversifies test inputs, two white-box coverage-based algorithms, a black-box algorithm that diversifies test outputs, and two search-based black-box algorithms that aim to maximize the likelihood of presence of continuous output failure patterns. We evaluate and compare our test selection algorithms, and find that our three output-based algorithms consistently outperform the coverage- and input-based algorithms in revealing faults in discrete-continuous Stateflow models. Further, we show that our output-based algorithms are complementary as the two search-based algorithms perform best in revealing specific failures with small test suites, while the output diversity algorithm is able to identify different failure types better than other algorithms when test suites are above a certain size.", "citation": "Citations (8)", "departments": ["University of Luxembourg", "University of Luxembourg", "University of Luxembourg", "Delphi Automotive"], "authors": ["Reza Matinnejad.....http://dblp.org/pers/hd/m/Matinnejad:Reza", "Shiva Nejati.....http://dblp.org/pers/hd/n/Nejati:Shiva", "Lionel C. Briand.....http://dblp.org/pers/hd/b/Briand:Lionel_C=", "Thomas Bruckmann.....http://dblp.org/pers/hd/b/Bruckmann:Thomas"], "conf": "sigsoft", "year": "2015", "pages": 12}