{"title": "Deep Compositional Cross-modal Learning to Rank via Local-Global Alignment.", "fields": ["learning to rank", "exploit", "pairwise comparison", "visual objects", "smith waterman algorithm"], "abstract": "Cross-modal retrieval is a very hot research topic that is imperative to many applications involving multi-modal data. Discovering an appropriate representation for multi-modal data and learning a ranking function are essential to boost the cross-media retrieval. Motivated by the assumption that a compositional cross-modal semantic representation (pairs of images and text) is more attractive for cross-modal ranking, this paper exploits the existing image-text databases to optimize a ranking function for cross-modal retrieval, called  deep  compositional cross-modal learning to rank (C 2 MLR). In this paper, C2MLR considers learning a multi-modal embedding from the perspective of optimizing a pairwise ranking problem while enhancing both  local alignment  and  global alignment . In particular, the local alignment (i.e., the alignment of visual objects and textual words) and the global alignment (i.e., the image-level and sentence-level alignment) are collaboratively utilized to learn the multi-modal embedding common space in a max-margin learning to rank manner. The experiments demonstrate the superiority of our proposed C2MLR due to its nature of multi-modal compositional embedding.", "citation": "Citations (11)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University", "Zhejiang University"], "authors": ["Xinyang Jiang.....http://dblp.org/pers/hd/j/Jiang:Xinyang", "Fei Wu.....http://dblp.org/pers/hd/w/Wu_0001:Fei", "Xi Li.....http://dblp.org/pers/hd/l/Li_0001:Xi", "Zhou Zhao.....http://dblp.org/pers/hd/z/Zhao:Zhou", "Weiming Lu.....http://dblp.org/pers/hd/l/Lu:Weiming", "Siliang Tang.....http://dblp.org/pers/hd/t/Tang:Siliang", "Yueting Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Yueting"], "conf": "mm", "year": "2015", "pages": 10}