{"title": "MoDisSENSE: A Distributed Spatio-Temporal and Textual Processing Platform for Social Networking Services.", "fields": ["digital footprint", "personalized search", "recommender system", "social graph", "big data"], "abstract": "The amount of social networking data that is being produced and consumed daily is huge and it is constantly increasing. A user's digital footprint coming from social networks or mobile devices, such as comments and check-ins contains valuable information about his preferences. The collection and analysis of such footprints using also information about the users' friends and their footprints offers many opportunities in areas such as personalized search, recommendations, etc. When the size of the collected data or the complexity of the applied methods increases, traditional storage and processing systems are not enough and distributed approaches are employed. In this work, we present MoDisSENSE, an open-source distributed platform that provides personalized search for points of interest and trending events based on the user's social graph by combining spatio-textual user generated data. The system is designed with scalability in mind, it is built using a combination of latest state-of-the art big data frameworks and its functionality is offered through easy to use mobile and web clients which support the most popular social networks. We give an overview of its architectural components and technologies and we evaluate its performance and scalability using different query types over various cluster sizes. Using the web or mobile clients, users are allowed to register themselves with their own social network credentials, perform socially enhanced queries for POIs, browse the results and explore the automatic blog creation functionality that is extracted by analyzing already collected GPS traces.", "citation": "Citations (3)", "year": "2015", "departments": ["National Technical University of Athens", "National Technical University of Athens", "National Technical University of Athens", "National Technical University of Athens", "Institute for the Management of Information Systems"], "conf": "sigmod", "authors": ["Ioannis Mytilinis.....http://dblp.org/pers/hd/m/Mytilinis:Ioannis", "Ioannis Giannakopoulos.....http://dblp.org/pers/hd/g/Giannakopoulos:Ioannis", "Ioannis Konstantinou.....http://dblp.org/pers/hd/k/Konstantinou:Ioannis", "Katerina Doka.....http://dblp.org/pers/hd/d/Doka:Katerina", "Dimitrios Tsitsigkos.....http://dblp.org/pers/hd/t/Tsitsigkos:Dimitrios", "Manolis Terrovitis.....http://dblp.org/pers/hd/t/Terrovitis:Manolis", "Lampros Giampouras.....http://dblp.org/pers/hd/g/Giampouras:Lampros", "Nectarios Koziris.....http://dblp.org/pers/hd/k/Koziris:Nectarios"], "pages": 6}