{"title": "Automatic generation of mobile app signatures from traffic observations.", "fields": ["mobile web", "mobile search", "floating car data", "mobile database", "mobile deep linking"], "abstract": "There are network management, traffic engineering, and security practices adopted in today's networking that rely on the knowledge about what applications' traffic is passing through the networks. These practices might fail with mobile apps whose identity remains hidden in generic HTTP traffic. The main reason is that unlike traditional applications, most mobile apps do not use specific protocols or IP ports with distinctive features. Many enterprises and service providers are in a great need of regaining control over their networks that increasingly carry mobile traffic. In this paper we propose FLOWR, a system that automatically identifies mobile apps by continually learning the apps' distinguishing features via traffic analysis. FLOWR focuses solely on key-value pairs in HTTP headers and intelligently identifies the pairs suitable for app signatures. Our system employs a custom supervised learning approach that leverages a very limited knowledge of app-signature seeds and autonomously grows its capacity for app identification. The approach is motivated by a simple but effective hypothesis that unknown app-identifying features should co-occur with the known signatures. Our experimental results show a significant growth in flow identification coverage provided by FLOWR. Specifically, we show that FLOWR can achieve identification of 86–95% of flows related to their generating apps.", "citation": "Citations (24)", "departments": ["University of Michigan", "Symantec", "Symantec", "University of Michigan", "Symantec"], "authors": ["Qiang Xu.....http://dblp.org/pers/hd/x/Xu:Qiang", "Yong Liao.....http://dblp.org/pers/hd/l/Liao:Yong", "Stanislav Miskovic.....http://dblp.org/pers/hd/m/Miskovic:Stanislav", "Zhuoqing Morley Mao.....http://dblp.org/pers/hd/m/Mao:Zhuoqing_Morley", "Mario Baldi.....http://dblp.org/pers/hd/b/Baldi:Mario", "Antonio Nucci.....http://dblp.org/pers/hd/n/Nucci:Antonio", "Thomas Andrews.....http://dblp.org/pers/hd/a/Andrews:Thomas"], "conf": "infocom", "year": "2015", "pages": 9}