{"title": "Sequential and adaptive sampling for matrix completion in network monitoring systems.", "fields": ["adaptive sampling", "small number", "matrix completion", "rank", "network monitoring"], "abstract": "End-to-end network monitoring is essential to ensure transmission quality for Internet applications. However, in large-scale networks, full-mesh measurement of network performance between all transmission pairs is infeasible. As a newly emerging sparsity representation technique, matrix completion allows the recovery of a low-rank matrix using only a small number of random samples. Existing schemes often fix the number of samples assuming the rank of the matrix is known, while the data features thus the matrix rank vary over time. In this paper, we propose to exploit the matrix completion techniques to derive the end-to-end network performance among all node pairs by only measuring a small subset of end-to-end paths. To address the challenge of rank change in the practical system, we propose a sequential and information-based adaptive sampling scheme, along with a novel sampling stopping condition. Our scheme is based only on the data observed without relying on the reconstruction method or the knowledge on the sparsity of unknown data. We have performed extensive simulations based on real-world trace data, and the results demonstrate that our scheme can significantly reduce the measurement cost while ensuring high accuracy in obtaining the whole network performance data.", "citation": "Citations (15)", "departments": ["Hunan University", "Hunan University", "Stony Brook University", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Kun Xie.....http://dblp.org/pers/hd/x/Xie:Kun", "Lele Wang.....http://dblp.org/pers/hd/w/Wang_0003:Lele", "Xin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Xin", "Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang", "Guangxing Zhang.....http://dblp.org/pers/hd/z/Zhang:Guangxing", "Dongliang Xie.....http://dblp.org/pers/hd/x/Xie:Dongliang", "Jigang Wen.....http://dblp.org/pers/hd/w/Wen:Jigang"], "conf": "infocom", "year": "2015", "pages": 9}