{"title": "A Multivariate Timeseries Modeling Approach to Severity of Illness Assessment and Forecasting in ICU with Sparse, Heterogeneous Clinical Data.", "fields": ["data set", "hyperparameter", "severity of illness", "gaussian process", "multivariate statistics"], "abstract": "The ability to determine patient acuity (or severity of illness) has immediate practical use for clinicians. We evaluate the use of multivariate timeseries modeling with the multi-task Gaussian process (GP) models using noisy, incomplete, sparse, heterogeneous and unevenly-sampled clinical data, including both physiological signals and clinical notes. The learned multi-task GP (MTGP) hyperparameters are then used to assess and forecast patient acuity. Experiments were conducted with two real clinical data sets acquired from ICU patients: firstly, estimating cerebrovascular pressure reactivity, an important indicator of secondary damage for traumatic brain injury patients, by learning the interactions between intracranial pressure and mean arterial blood pressure signals, and secondly, mortality prediction using clinical progress notes. In both cases, MTGPs provided improved results: an MTGP model provided better results than single-task GP models for signal interpolation and forecasting (0.91 vs 0.69 RMSE), and the use of MTGP hyperparameters obtained improved results when used as additional classification features (0.812 vs 0.788 AUC).", "citation": "Citations (84)", "departments": ["Massachusetts Institute of Technology", "University of Oxford", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "University of Oxford"], "authors": ["Marzyeh Ghassemi.....http://dblp.org/pers/hd/g/Ghassemi:Marzyeh", "Marco A. F. Pimentel.....http://dblp.org/pers/hd/p/Pimentel:Marco_A=_F=", "Tristan Naumann.....http://dblp.org/pers/hd/n/Naumann:Tristan", "Thomas Brennan.....http://dblp.org/pers/hd/b/Brennan:Thomas", "David A. Clifton.....http://dblp.org/pers/hd/c/Clifton:David_A=", "Peter Szolovits.....http://dblp.org/pers/hd/s/Szolovits:Peter", "Mengling Feng.....http://dblp.org/pers/hd/f/Feng:Mengling"], "conf": "aaai", "year": "2015", "pages": 8}