{"title": "CDR-To-MoVis: Developing a Mobility Visualization System from CDR data.", "fields": ["kernel density estimation", "trips architecture", "transport network", "data visualization", "granularity"], "abstract": "CDR (Call Detail Records) data is more easily available than other network related data (such as GPS data) as most telecommunications service providers (TSPs) maintain such data. By analyzing it one can find mobility patterns of most of the population thus leading to efficient urban planning, disease and traffic control, etc. But its granularity is low as the latitude and longitude (lat-lon) of a cell tower is used as the current location of all mobile phones that are connected to the cell tower at that time. Granularity can range between 10s of metres to several kms depending on population density of a locality. This is one reason why, although there are many existing systems on visualizing mobility of people based on GPS data, there is hardly any existing system for CDR. We develop a Mobility Visualization System (MoVis) for visualizing mobility of people from their CDR records. First of all, given the CDR records of a user, we determine her stay regions (places where she stays for a significant amount of time). Trajectories of phone events (and lat-lon of cell towers) between stay regions are extracted as her trips. Start and end times of a trip are estimated using linear extrapolation. Based on the start and end times, temporal patterns are extracted. Trips with sufficient number of intermediate points are mapped to transport network that consists of train lines, bus routes and expressways. We use Kernel density estimation to visualize the most common path for a given origin and destination. Based on this we create a round-the-clock visualization of mobility of people over the entire city separately for weekdays and weekends. At the end we show the validation results.", "citation": "Citations (1)", "departments": ["Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "R&D Labs, Livin ... ingapore 239732"], "authors": ["Manoranjan Dash.....http://dblp.org/pers/hd/d/Dash:Manoranjan", "Kee Kiat Koo.....http://dblp.org/pers/hd/k/Koo:Kee_Kiat", "James Decraene.....http://dblp.org/pers/hd/d/Decraene:James", "Ghim-Eng Yap.....http://dblp.org/pers/hd/y/Yap:Ghim=Eng", "Wei Wu.....http://dblp.org/pers/hd/w/Wu:Wei", "João Bártolo Gomes.....http://dblp.org/pers/hd/g/Gomes:Jo=atilde=o_B=aacute=rtolo", "Amy Shi Nash.....http://dblp.org/pers/hd/n/Nash:Amy_Shi", "Xiaoli Li.....http://dblp.org/pers/hd/l/Li_0001:Xiaoli"], "conf": "icde", "year": "2015", "pages": 4}