{"title": "Mixed reality simulation with physical mobile display devices.", "fields": ["computer mediated reality", "display device", "virtual retinal display", "mixed reality", "augmented reality"], "abstract": "This paper presents the design and implementation of a system for simulating mixed reality in setups combining mobile devices and large backdrop displays. With a mixed reality simulator, one can perform usability studies and evaluate mixed reality systems while minimizing confounding variables. This paper describes how mobile device AR design factors can be flexibly and systematically explored without sacrificing the touch and direct unobstructed manipulation of a physical personal MR display. First, we describe general principles to consider when implementing a mixed reality simulator, enumerating design factors. Then, we present our implementation which utilizes personal mobile display devices in conjunction with a large surround-view display environment. Standing in the center of the display, a user may direct a mobile device, such as a tablet or head-mounted display, to a portion of the scene, which affords them a potentially annotated view of the area of interest. The user may employ gesture or touch screen interaction on a simulated augmented camera feed, as they typically would in video-see-through mixed reality applications. We present calibration and system performance results and illustrate our system's flexibility by presenting the design of three usability evaluation scenarios.", "citation": "Citations (4)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Mathieu Rodrigue.....http://dblp.org/pers/hd/r/Rodrigue:Mathieu", "Andrew Waranis.....http://dblp.org/pers/hd/w/Waranis:Andrew", "Tim Wood.....http://dblp.org/pers/hd/w/Wood:Tim", "Tobias Höllerer.....http://dblp.org/pers/hd/h/H=ouml=llerer:Tobias"], "conf": "vr", "year": "2015", "pages": 6}