{"title": "GPGPU performance and power estimation using machine learning.", "fields": ["engineering design process", "hardware performance counter", "general purpose computing on graphics processing units", "memory bandwidth", "graphics"], "abstract": "Graphics Processing Units (GPUs) have numerous configuration and design options, including core frequency, number of parallel compute units (CUs), and available memory bandwidth. At many stages of the design process, it is important to estimate how application performance and power are impacted by these options. This paper describes a GPU performance and power estimation model that uses machine learning techniques on measurements from real GPU hardware. The model is trained on a collection of applications that are run at numerous different hardware configurations. From the measured performance and power data, the model learns how applications scale as the GPU's configuration is changed. Hardware performance counter values are then gathered when running a new application on a single GPU configuration. These dynamic counter values are fed into a neural network that predicts which scaling curve from the training data best represents this kernel. This scaling curve is then used to estimate the performance and power of the new application at different GPU configurations. Over an 8× range of the number of CUs, a 3.3× range of core frequencies, and a 2.9× range of memory bandwidth, our model's performance and power estimates are accurate to within 15% and 10% of real hardware, respectively. This is comparable to the accuracy of cycle-level simulators. However, after an initial training phase, our model runs as fast as, or faster than the program running natively on real hardware.", "citation": "Citations (73)", "departments": ["University of Texas at Austin", "Advanced Micro Devices", "Advanced Micro Devices", "Advanced Micro Devices", "University of Texas at Austin"], "authors": ["Gene Y. Wu.....http://dblp.org/pers/hd/w/Wu:Gene_Y=", "Joseph L. Greathouse.....http://dblp.org/pers/hd/g/Greathouse:Joseph_L=", "Alexander Lyashevsky.....http://dblp.org/pers/hd/l/Lyashevsky:Alexander", "Nuwan Jayasena.....http://dblp.org/pers/hd/j/Jayasena:Nuwan", "Derek Chiou.....http://dblp.org/pers/hd/c/Chiou:Derek"], "conf": "hpca", "year": "2015", "pages": 13}