{"title": "Avoiding information leakage in the memory controller with fixed service policies.", "fields": ["uniform memory access", "interleaved memory", "memory controller", "distributed shared memory", "information leakage"], "abstract": "Trusted applications frequently execute in tandem with untrusted applications on personal devices and in cloud environments. Since these co-scheduled applications share hardware resources, the latencies encountered by the untrusted application betray information about whether the trusted applications are accessing shared resources or not. Prior studies have shown that such information leaks can be used by the untrusted application to decipher keys or launch covert-channel attacks. Prior work has also proposed techniques to eliminate information leakage in various shared resources. The best known solution to eliminate information leakage in the memory system incurs high performance penalties. This work develops a comprehensive approach to eliminate timing channels in the memory controller that has two key elements: (i) We shape the memory access behavior of each thread so that it has an unchanging memory access pattern. (ii) We show how efficient memory access pipelines can be constructed to process the resulting memory accesses without introducing any resource conflicts. We mathematically show that the proposed system yields zero information leakage. We then show that various page mapping policies can impact the throughput of our secure memory system. We also introduce techniques to re-order requests from different threads to boost performance without leaking information. Our best solution offers throughput that is 27% lower than that of an optimized non-secure baseline, and that is 69% higher than the best known competing scheme.", "citation": "Citations (6)", "departments": ["University of Utah", "University of Utah", "University of Utah", "University of Utah", "University of Texas at Austin"], "authors": ["Ali Shafiee.....http://dblp.org/pers/hd/s/Shafiee:Ali", "Akhila Gundu.....http://dblp.org/pers/hd/g/Gundu:Akhila", "Manjunath Shevgoor.....http://dblp.org/pers/hd/s/Shevgoor:Manjunath", "Rajeev Balasubramonian.....http://dblp.org/pers/hd/b/Balasubramonian:Rajeev", "Mohit Tiwari.....http://dblp.org/pers/hd/t/Tiwari:Mohit"], "conf": "micro", "year": "2015", "pages": 13}