{"title": "UbiFlow: Mobility management in urban-scale software defined IoT.", "fields": ["flow control", "network performance", "networking hardware", "testbed", "mobility management"], "abstract": "The growing of Internet of Things (IoT) devices has resulted in a number of urban-scale deployments of IoT multinetworks, where heterogeneous wireless communication solutions coexist. Managing the multinetworks for mobile IoT access is a key challenge. Software-defined networking (SDN) is emerging as a promising paradigm for quick configuration of network devices, but its application in multinetworks with frequent IoT access is not well studied. In this paper we present UbiFlow, the first software-defined IoT system for ubiquitous flow control and mobility management in multinetworks. UbiFlow adopts distributed controllers to divide urban-scale SDN into different geographic partitions. A distributed hashing based overlay structure is proposed to maintain network scalability and consistency. Based on this UbiFlow overlay structure, relevant issues pertaining to mobility management such as scalable control, fault tolerance, and load balancing have been carefully examined and studied. The UbiFlow controller differentiates flow scheduling based on the per-device requirement and whole-partition capability. Therefore, it can present a network status view and optimized selection of access points in multinetworks to satisfy IoT flow requests, while guaranteeing network performance in each partition. Simulation and realistic testbed experiments confirm that UbiFlow can successfully achieve scalable mobility management and robust flow scheduling in IoT multinetworks.", "citation": "Citations (61)", "departments": ["Imperial College London", "University of California, Irvine", "Imperial College London", "University of California, Irvine", "Imperial College London"], "authors": ["Di Wu.....http://dblp.org/pers/hd/w/Wu_0002:Di", "Dmitri I. Arkhipov.....http://dblp.org/pers/hd/a/Arkhipov:Dmitri_I=", "Eskindir Asmare.....http://dblp.org/pers/hd/a/Asmare:Eskindir", "Zhijing Qin.....http://dblp.org/pers/hd/q/Qin:Zhijing", "Julie A. McCann.....http://dblp.org/pers/hd/m/McCann:Julie_A="], "conf": "infocom", "year": "2015", "pages": 9}