{"title": "Measuring Urban Deprivation from User Generated Content.", "fields": ["urbanization", "precision and recall", "granularity", "thematic analysis", "user generated content"], "abstract": "Measuring socioeconomic deprivation of cities in an accurate and timely fashion has become a priority for governments around the world, as the massive urbanization process we are witnessing is causing high levels of inequalities which require intervention. Traditionally, deprivation indexes have been derived from census data, which is however very expensive to obtain, and thus acquired only every few years. Alternative computational methods have been proposed in recent years to automatically extract proxies of deprivation at a fine spatio-temporal level of granularity; however, they usually require access to datasets (e.g., call details records) that are not publicly available to governments and agencies. To remedy this, we propose a new method to automatically mine deprivation at a fine level of spatio-temporal granularity that only requires access to freely available user-generated content. More precisely, the method needs access to datasets describing what urban elements are present in the physical environment; examples of such datasets are Foursquare and OpenStreetMap. Using these datasets, we quantitatively describe neighborhoods by means of a metric, called  Offering Advantage , that reflects which urban elements are distinctive features of each neighborhood. We then use that metric to ( i ) build accurate classifiers of urban deprivation and ( ii ) interpret the outcomes through thematic analysis. We apply the method to three UK urban areas of different scale and elaborate on the results in terms of precision and recall.", "citation": "Citations (36)", "departments": ["University College London", "University College London", "University College London", "Yahoo!", "Yahoo!"], "authors": ["Alessandro Venerandi.....http://dblp.org/pers/hd/v/Venerandi:Alessandro", "Giovanni Quattrone.....http://dblp.org/pers/hd/q/Quattrone:Giovanni", "Licia Capra.....http://dblp.org/pers/hd/c/Capra:Licia", "Daniele Quercia.....http://dblp.org/pers/hd/q/Quercia:Daniele", "Diego Sáez-Trumper.....http://dblp.org/pers/hd/s/S=aacute=ez=Trumper:Diego"], "conf": "cscw", "year": "2015", "pages": 11}