{"title": "BwE: Flexible, Hierarchical Bandwidth Allocation for WAN Distributed Computing.", "fields": ["delegation", "bandwidth", "bandwidth allocation", "software defined networking", "dynamic bandwidth allocation"], "abstract": "WAN bandwidth remains a constrained resource that is economically infeasible to substantially overprovision. Hence, it is important to allocate capacity according to service priority and based on the incremental value of additional allocation. For example, it may be the highest priority for one service to receive 10Gb/s of bandwidth but upon reaching such an allocation, incremental priority may drop sharply favoring allocation to other services. Motivated by the observation that individual flows with fixed priority may not be the ideal basis for bandwidth allocation, we present the design and implementation of Bandwidth Enforcer (BwE), a global, hierarchical bandwidth allocation infrastructure. BwE supports: i) service-level bandwidth allocation following prioritized bandwidth functions where a service can represent an arbitrary collection of flows, ii)independent allocation and delegation policies according to user-defined hierarchy, all accounting for a global view of bandwidth and failure conditions, iii) multi-path forwarding common in traffic-engineered networks, and iv) a central administrative point to override (perhaps faulty) policy during exceptional conditions. BwE has delivered more service efficient bandwidth utilization and simpler management in production for multiple years.", "citation": "Citations (65)", "departments": ["Google", "Google", "Google", "Google", "Premise Data Co ... ncisco, CA, USA"], "authors": ["Alok Kumar.....http://dblp.org/pers/hd/k/Kumar:Alok", "Sushant Jain.....http://dblp.org/pers/hd/j/Jain:Sushant", "Uday Naik.....http://dblp.org/pers/hd/n/Naik:Uday", "Anand Raghuraman.....http://dblp.org/pers/hd/r/Raghuraman:Anand", "Nikhil Kasinadhuni.....http://dblp.org/pers/hd/k/Kasinadhuni:Nikhil", "Enrique Cauich Zermeno.....http://dblp.org/pers/hd/z/Zermeno:Enrique_Cauich", "C. Stephen Gunn.....http://dblp.org/pers/hd/g/Gunn:C=_Stephen", "Jing Ai.....http://dblp.org/pers/hd/a/Ai:Jing", "Björn Carlin.....http://dblp.org/pers/hd/c/Carlin:Bj=ouml=rn", "Mihai Amarandei-Stavila.....http://dblp.org/pers/hd/a/Amarandei=Stavila:Mihai", "Mathieu Robin.....http://dblp.org/pers/hd/r/Robin:Mathieu", "Aspi Siganporia.....http://dblp.org/pers/hd/s/Siganporia:Aspi", "Stephen Stuart.....http://dblp.org/pers/hd/s/Stuart:Stephen", "Amin Vahdat.....http://dblp.org/pers/hd/v/Vahdat:Amin"], "conf": "sigcomm", "year": "2015", "pages": 14}