{"title": "Robust clustering of multi-type relational data via a heterogeneous manifold ensemble.", "fields": ["euclidean distance", "linear subspace", "subspace topology", "relational database", "matrix decomposition", "sparse matrix"], "abstract": "High-Order Co-Clustering (HOCC) methods have attracted high attention in recent years because of their ability to cluster multiple types of objects simultaneously using all available information. During the clustering process, HOCC methods exploit object co-occurrence information, i.e., inter-type relationships amongst different types of objects as well as object affinity information, i.e., intra-type relationships amongst the same types of objects. However, it is difficult to learn accurate intra-type relationships in the presence of noise and outliers. Existing HOCC methods consider the p nearest neighbours based on Euclidean distance for the intra-type relationships, which leads to incomplete and inaccurate intra-type relationships. In this paper, we propose a novel HOCC method that incorporates multiple subspace learning with a heterogeneous manifold ensemble to learn complete and accurate intra-type relationships. Multiple subspace learning reconstructs the similarity between any pair of objects that belong to the same subspace. The heterogeneous manifold ensemble is created based on two-types of intra-type relationships learnt using p-nearest-neighbour graph and multiple subspaces learning. Moreover, in order to make sure the robustness of clustering process, we introduce a sparse error matrix into matrix decomposition and develop a novel iterative algorithm. Empirical experiments show that the proposed method achieves improved results over the state-of-art HOCC methods for FScore and NMI.", "citation": "Not cited", "departments": ["Queensland University of Technology", "Queensland University of Technology"], "authors": ["Jun Hou.....http://dblp.org/pers/hd/h/Hou:Jun", "Richi Nayak.....http://dblp.org/pers/hd/n/Nayak:Richi"], "conf": "icde", "year": "2015", "pages": 12}