{"title": "Graph Invariant Kernels.", "fields": ["kernel", "signed graph", "circulant graph", "butterfly graph", "graph kernel", "distance hereditary graph", "kernelization", "maximum cut", "cograph", "graph bandwidth", "induced subgraph", "hereditary property", "graph operations", "lattice graph", "edge cover", "invariant", "universal graph", "quotient graph", "graph product", "strength of a graph", "connectivity", "tangent vector", "line graph", "data point", "graph property", "quartic graph", "forbidden graph characterization", "null graph", "modular decomposition", "graph", "loop"], "abstract": "Given a graph G=(V,E) and a positive integer k, an edge modification problem for a graph property ź consists in deciding whether there exists a set F of pairs of V of size at most k such that the graph $H=(V,E\\vartriangle F)$ satisfies the property ź. In the źedge-completion problem, the set F is constrained to be disjoint from E; in the źedge-deletion problem, F is a subset of E; no constraint is imposed on F in the źedge-editing problem. A number of optimization problems can be expressed in terms of graph modification problems which have been extensively studied in the context of parameterized complexity (Cai in Inf. Process. Lett. 58:171---176, 1996; Fellows et al. in FCT, pp. 312---321, 2007; Heggernes et al. in STOC, pp. 374---381, 2007). When parameterized by the size k of the set F, it has been proved that if ź is a hereditary property characterized by a finite set of forbidden induced subgraphs, then the three ź edge-modification problems are FPT (Cai in Inf. Process. Lett. 58:171---176, 1996). It was then natural to ask (Bodlaender et al. in IWPEC, 2006) whether these problems also admit a polynomial kernel. in polynomial time to an equivalent instance (Gź,kź) with size bounded by a polynomial in k). Using recent lower bound techniques, Kratsch and Wahlstrom answered this question negatively (Kratsch and Wahlstrom in IWPEC, pp. 264---275, 2009). However, the problem remains open on many natural graph classes characterized by forbidden induced subgraphs. question to characterize for which type of graph properties, the parameterized edge-modification problems have polynomial kernels. Kratsch and Wahlstrom asked whether the result holds when the forbidden subgraphs are paths or cycles and pointed out that the problem is already open in the case of P4-free graphs (i.e. cographs). This paper provides positive and negative results in that line of research. We prove that Parameterized cograph edge-modification problems have cubic vertex kernels whereas polynomial kernels are unlikely to exist for the Pl-free edge-deletion and the Cl-free edge-deletion problems for lź7 and lź4 respectively. Indeed, if they exist, then NP⊆coNP/poly.", "citation": "Citations (31)", "departments": ["Iowa State University", "French Institute for Research in Computer Science and Automation", "University of Montpellier", "University of Orléans", "Katholieke Universiteit Leuven", "University of Florence", "Katholieke Universiteit Leuven", "Goethe University Frankfurt", "Technische Hochschule", "Max Planck Society", "University of Bern", "University of Bern", "University of Jena", "University of Montpellier", "University of Montpellier", "Deutsche Telekom", "BARTLETT PETER  ... OELKOPF BERNARD", "BARTLETT PETER  ... OELKOPF BERNARD", "BARTLETT PETER  ... OELKOPF BERNARD", "External Organizations", "External Organizations", "External Organizations", "External Organizations", "DAI-Labor", "DAI-Labor"], "authors": ["Francesco Orsini.....http://dblp.org/pers/hd/o/Orsini:Francesco", "Paolo Frasconi.....http://dblp.org/pers/hd/f/Frasconi:Paolo", "Luc De Raedt.....http://dblp.org/pers/hd/r/Raedt:Luc_De"], "conf": "ijcai", "year": "2015", "pages": 7}