{"title": "Expecting the unexpected: Fast and reliable detection of missing RFID tags in the wild.", "fields": ["false positive paradox", "distributed computing", "computer science", "communications protocol", "software"], "abstract": "RFID systems have been deployed to detect missing products by affixing them with cheap passive RFID tags and monitoring them with RFID readers. Existing missing tag detection protocols require the tag population to contain only those tags whose IDs are already known to the reader. However, in reality, tag populations often contain tags with unknown IDs, called unexpected tags, and cause unexpected false positives i.e., due to them, missing tags are detected as present. We take the first step towards addressing the problem of detecting the missing tags from a population that contains unexpected tags. Our protocol, RUN, mitigates the adverse effects of unexpected false positives by executing multiple frames with different seeds. It minimizes the missing tag detection time by first estimating the number of unexpected tags and then using it along with the false positive probability to obtain optimal frame sizes and number of times Aloha frames should be executed. RUN works with multiple readers with overlapping regions. It is easy to deploy because it is implemented on readers as a software module and does not require modifications to tags or to the communication protocol between tags and readers. We implemented RUN along with four major missing tag detection protocols and the fastest tag ID collection protocol and compared them side-by-side. Our experimental results show that RUN always achieves the required reliability whereas the best existing protocol achieves a maximum reliability of only 67%.", "citation": "Citations (15)", "departments": ["Michigan State University", "Michigan State University"], "authors": ["Muhammad Shahzad.....http://dblp.org/pers/hd/s/Shahzad:Muhammad", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X="], "conf": "infocom", "year": "2015", "pages": 9}