{"title": "SNNAP: Approximate computing on programmable SoCs via neural acceleration.", "fields": ["programmable logic array", "simple programmable logic device", "programmable logic device", "speedup", "reconfigurable computing"], "abstract": "Many applications that can take advantage of accelerators are amenable to approximate execution. Past work has shown that neural acceleration is a viable way to accelerate approximate code. In light of the growing availability of on-chip field-programmable gate arrays (FPGAs), this paper explores neural acceleration on off-the-shelf programmable SoCs. We describe the design and implementation of SNNAP, a flexible FPGA-based neural accelerator for approximate programs. SNNAP is designed to work with a compiler workflow that configures the neural network's topology and weights instead of the programmable logic of the FPGA itself. This approach enables effective use of neural acceleration in commercially available devices and accelerates different applications without costly FPGA reconfigurations. No hardware expertise is required to accelerate software with SNNAP, so the effort required can be substantially lower than custom hardware design for an FPGA fabric and possibly even lower than current “C-to-gates” high-level synthesis (HLS) tools. Our measurements on a Xilinx Zynq FPGA show that SNNAP yields a geometric mean of 3.8× speedup (as high as 38.1×) and 2.8× energy savings (as high as 28 x) with less than 10% quality loss across all applications but one. We also compare SNNAP with designs generated by commercial HLS tools and show that SNNAP has similar performance overall, with better resource-normalized throughput on 4 out of 7 benchmarks.", "citation": "Citations (89)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "Georgia Institute of Technology"], "authors": ["Thierry Moreau.....http://dblp.org/pers/hd/m/Moreau:Thierry", "Mark Wyse.....http://dblp.org/pers/hd/w/Wyse:Mark", "Jacob Nelson.....http://dblp.org/pers/hd/n/Nelson:Jacob", "Adrian Sampson.....http://dblp.org/pers/hd/s/Sampson:Adrian", "Hadi Esmaeilzadeh.....http://dblp.org/pers/hd/e/Esmaeilzadeh:Hadi", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Mark Oskin.....http://dblp.org/pers/hd/o/Oskin:Mark"], "conf": "hpca", "year": "2015", "pages": 12}