{"title": "Priority algorithm for near-data scheduling: Throughput and heavy-traffic optimality.", "fields": ["fixed priority pre emptive scheduling", "priority inheritance", "round robin scheduling", "earliest deadline first scheduling", "deadline monotonic scheduling"], "abstract": "The prevalence of data-parallel applications has made near-data scheduling an important problem. An example is the map task scheduling in the map-reduce framework. Wang et. al. [13] was the first to identify its capacity region and proposed a throughput-optimal algorithm based on MaxWeight. However, the study of the algorithm's delay performance revealed that it is only heavy-traffic optimal for a very special traffic scenario, where all traffic concentrates on a subset of servers. We propose a simple “local-tasks first” priority algorithm and show that it is throughput-optimal and heavy-traffic optimal for all traffic scenarios, i.e., it asymptotically minimizes the average delay as the arrival rate vector approaches the boundary of the capacity region. So far, it is the only known heavy-traffic optimal algorithm for this setting. As the algorithm is based on pre-determined priority, a direct application of the Lyapunov drift technique does not work. The main proof ideas are the construction of an ideal load decomposition and the separate treatment of two subsystems based on their ideal load. To the best of our knowledge, this is the only setup of affinity scheduling where a simple priority algorithm is shown to be heavy-traffic optimal. Simulation shows that our algorithm also significantly outperforms existing algorithms at loads away from the boundary of the capacity region.", "citation": "Citations (14)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Qiaomin Xie.....http://dblp.org/pers/hd/x/Xie:Qiaomin", "Yi Lu.....http://dblp.org/pers/hd/l/Lu:Yi"], "conf": "infocom", "year": "2015", "pages": 10}