{"title": "INSURE: An integrated load reduction framework for XML stream processing.", "fields": ["stream processing", "buffer overflow", "load shedding", "data stream mining", "xml"], "abstract": "Because of high volumes and unpredictable arrival rates, stream processing systems cannot always keep up with input data streams, resulting in buffer overflow and uncontrolled loss of data. Load shedding and spilling, the two prevalent technologies designed to solve this overflow problem by dropping or flushing data to disk, suffer from serious shortcomings. Dropping data suffers in that partial output is lost forever, while flushing may waste precious resources due to making the strong assumption that flushed data can and will eventually still be processed. In this paper, we propose our solution, INSURE, integrating structure-based drop and flush techniques within one unified framework for XML stream systems. Our INSURE framework provides an optimized fine-grained load reduction solution that achieves high quality result production. First, the fusion candidate lattice models the space of load reduction solutions incorporating both drop and flush decisions, called fusion candidates. Second, our systematic analysis of fusion candidates and their interrelationships in the fusion candidate lattice reveals important relationships, including the monotonicity of their feasibility and profitability properties. Third, based upon this fusion candidate lattice model, a family of optimization strategies for the selection of fusion candidates is designed to successfully maximize the overall result quality. Experimental results demonstrate that INSURE consistently achieves higher quality results compared to the state-of-the-art techniques, yet with negligible overhead.", "citation": "Not cited", "departments": ["Oracle Corporation", "Worcester Polytechnic Institute", "University of Michigan"], "authors": ["Mingzhu Wei.....http://dblp.org/pers/hd/w/Wei:Mingzhu", "Elke A. Rundensteiner.....http://dblp.org/pers/hd/r/Rundensteiner:Elke_A=", "Murali Mani.....http://dblp.org/pers/hd/m/Mani:Murali"], "conf": "icde", "year": "2015", "pages": 12}