{"title": "Transition and Reflection in the Use of Health Information: The Case of Pediatric Bone Marrow Transplant Caregivers.", "fields": ["health technology", "emotion work", "computer supported cooperative work", "design paradigm", "health informatics"], "abstract": "The impact of health information on caregivers is of increasing interest to HCI/CSCW in designing systems to support the social and emotional dimensions of managing health. Drawing on an interview study, as well as corroborating data including a multi-year ethnography, we detail the practices of caregivers (particularly parents) in a bone marrow transplant (BMT) center. We examine the interconnections between information and emotion work performed by caregivers through a liminal lens, highlighting the BMT experience as a time of transition and reflection in which caregivers must quickly adapt to the new social world of the hospital and learn to manage a wide range of patient needs. The transition from parent to 'caregiver' is challenging, placing additional emotional burdens on the intensive information work for managing BMT. As a time of reflection, the BMT experience also provides an occasion for generative thinking and alternative approaches to health management. Our study findings call for health systems that reflect a design paradigm focused on 'transforming lives' rather than 'transferring information.'", "citation": "Citations (17)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Elizabeth Kaziunas.....http://dblp.org/pers/hd/k/Kaziunas:Elizabeth", "Ayse G. Buyuktur.....http://dblp.org/pers/hd/b/Buyuktur:Ayse_G=", "Jasmine Jones.....http://dblp.org/pers/hd/j/Jones:Jasmine", "Sung Won Choi.....http://dblp.org/pers/hd/c/Choi:Sung_Won", "David A. Hanauer.....http://dblp.org/pers/hd/h/Hanauer:David_A=", "Mark S. Ackerman.....http://dblp.org/pers/hd/a/Ackerman:Mark_S="], "conf": "cscw", "year": "2015", "pages": 12}