{"title": "Belief Revision Games.", "fields": ["social psychology", "deliberation", "social network", "doxastic logic", "operator", "epistemic modal logic", "information set", "verbal reasoning", "metagaming", "dynamic epistemic logic", "sequential equilibrium", "solution concept", "spurious relationship", "rational agent", "dynamic logic", "belief revision", "rationality", "disposition", "simulations and games in economics education", "combinatorial game theory", "counterfactual conditional", "screening game", "markov decision process", "dependence logic", "welfare economics", "bayesian game", "backward induction", "machine learning", "extensive form game", "merge", "sequential game", "counterfactual thinking", "rationalization", "common knowledge"], "abstract": "Deliberation about what to do in any context requires reasoning about what will or would happen in various alternative situations, including situations that the agent knows will never in fact be realized. In contexts that involve two or more agents who have to take account of each others’ deliberation, the counterfactual reasoning may become quite complex. When I deliberate, I have to consider not only what the causal effects would be of alternative choices that I might make, but also what other agents might believe about the potential effects of my choices, and how their alternative possible actions might affect my beliefs. Counter factual possibilities are implicit in the models that game theorists and decision theorists have developed – in the alternative branches in the trees that model extensive form games and the different cells of the matrices of strategic form representations – but much of the reasoning about those possibilities remains in the informal commentary on and motivation for the models developed. Puzzlement is sometimes expressed by game theorists about the relevance of what happens in a game ‘off the equilibrium path’: of what would happen if what is (according to the theory) both true and known by the players to be true were instead false. My aim in this paper is to make some suggestions for clarifying some of the concepts involved in counterfactual reasoning in strategic contexts, both the reasoning of the rational agents being modeled, and the reasoning of the theorist who is doing the modeling, and to bring together some ideas and technical tools developed by philosophers and logicians that I think might be relevant to the analysis of strategic reasoning, and more generally to the conceptual foundations of game theory.", "citation": "Citations (275)", "departments": ["Massachusetts Institute of Technology", "National Institute of Informatics", "Graduate University for Advanced Studies", "University of Paris", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Massachusetts Institute of Technology", "University of California, Berkeley", "University of California", "Stanford University", "University of California, Davis", "University of Maryland, College Park"], "authors": ["Nicolas Schwind.....http://dblp.org/pers/hd/s/Schwind:Nicolas", "Katsumi Inoue.....http://dblp.org/pers/hd/i/Inoue:Katsumi", "Gauvain Bourgne.....http://dblp.org/pers/hd/b/Bourgne:Gauvain", "Sébastien Konieczny.....http://dblp.org/pers/hd/k/Konieczny:S=eacute=bastien", "Pierre Marquis.....http://dblp.org/pers/hd/m/Marquis:Pierre"], "conf": "aaai", "year": "2015", "pages": 7}