{"title": "Diagnosing the causes and severity of one-sided message contention.", "fields": ["latency", "programming paradigm", "thread", "infiniband", "parallel computing"], "abstract": "Two trends suggest network contention for one-sided messages is poised to become a performance problem that concerns application developers: an increased interest in one-sided programming models and a rising ratio of hardware threads to network injection bandwidth. Often it is difficult to reason about when one-sided tasks decrease or increase network contention. We present effective and portable techniques for diagnosing the causes and severity of one-sided message contention. To detect that a message is affected by contention, we maintain statistics representing instantaneous network resource demand. Using lightweight measurement and modeling, we identify the portion of a message's latency that is due to contention and whether contention occurs at the initiator or target. We attribute these metrics to program statements in their full static and dynamic context. We characterize contention for an important computational chemistry benchmark on InfiniBand, Cray Aries, and IBM Blue Gene/Q interconnects. We pinpoint the sources of contention, estimate their severity, and show that when message delivery time deviates from an ideal model, there are other messages contending for the same network links. With a small change to the benchmark, we reduce contention by 50% and improve total runtime by 20%.", "citation": "Citations (3)", "year": "2015", "departments": ["Pacific Northwest National Laboratory", "Pacific Northwest National Laboratory", "Pacific Northwest National Laboratory", "Pacific Northwest National Laboratory", "Pacific Northwest National Laboratory"], "conf": "ppopp", "authors": ["Nathan R. Tallent.....http://dblp.org/pers/hd/t/Tallent:Nathan_R=", "Abhinav Vishnu.....http://dblp.org/pers/hd/v/Vishnu:Abhinav", "Hubertus Van Dam.....http://dblp.org/pers/hd/d/Dam:Hubertus_Van", "Jeff Daily.....http://dblp.org/pers/hd/d/Daily:Jeff", "Darren J. Kerbyson.....http://dblp.org/pers/hd/k/Kerbyson:Darren_J=", "Adolfy Hoisie.....http://dblp.org/pers/hd/h/Hoisie:Adolfy"], "pages": 10}