{"title": "Automatic Accident Detection and Alarm System.", "fields": ["preferred walking speed", "alarm", "profiling", "field of view", "accident analysis"], "abstract": "Accident detection and alarm system is very important to detect possible accidents or dangers for the peoples using their mobile devices while walking, i.e., distracted walking. In this paper, we introduce an automatic accident detection and alarm system, called AutoADAS, which is fully implemented and tested on the real mobile devices. The proposed system can be activated either manually or automatically when user walks. Under the manual mode, user activates the system before distracted walking while under the automatic mode, a \"user behaviour profiling\" module is used to recognize (distracted) walking behaviours and an \"object detection\" module is activated. Using image processing and camera field of view (FOV), the distance and angle between the user and detected objects are estimated and then applied to identify whether any potential accidents can happen. The \"accident analysis and prediction\" module includes: temporal alarm that inputs the user's walking speed and distance with respect to the detected objects and outputs temporal accident prediction; spatial alarm that inputs the user's walking direction and angle with respect to the detected objects and outputs spatial accident prediction. Once the proposed system positively predicts a potential accident, the \"alarm and suggestion\" module alerts the user with text, sound or vibration.", "citation": "Citations (2)", "departments": ["Huawei", "Singapore Management University", "Wuhan University", "Huawei", "Singapore Management University"], "authors": ["Zhuo Wei.....http://dblp.org/pers/hd/w/Wei:Zhuo", "Swee-Won Lo.....http://dblp.org/pers/hd/l/Lo:Swee=Won", "Yu Liang.....http://dblp.org/pers/hd/l/Liang:Yu", "Tieyan Li.....http://dblp.org/pers/hd/l/Li:Tieyan", "Jialie Shen.....http://dblp.org/pers/hd/s/Shen:Jialie", "Robert H. Deng.....http://dblp.org/pers/hd/d/Deng:Robert_H="], "conf": "mm", "year": "2015", "pages": 4}