{"title": "SmartEye: Real-time and efficient cloud image sharing for disaster environments.", "fields": ["scalability", "data deduplication", "upload", "image sharing", "analytics"], "abstract": "Rapid disaster relief is important to save human lives and reduce property loss. With the wide use of smartphones and their ubiquitous easy access to the Internet, sharing and uploading images to the cloud via smartphones offer a nontrivial opportunity to provide information of disaster zones. However, due to limited available bandwidth and energy, smartphone-based crowdsourcing fails to support the real-time data analytics. The key to efficiently and timely share and analyze the images is to determine the value/worth of the images based on their significance and redundancy, and only upload those valuable and unique images. In this paper, we propose a near-realtime and cost-efficient scheme, called SmartEye, in the cloud-assisted disaster environment. The idea behind SmartEye is to implement QoS-aware in-network deduplication over DiffServ in the software-defined networks (SDN). Due to the ease of use, simplicity and scalability, DiffServ supports the in-network deduplication to meet the needs of differentiated QoS. SmartEye aggregates the flows with similar features via a semantic hashing, and provides communication services for the aggregated, not a single, flow. To achieve these goals, we leverage two main optimization schemes, including semantic hashing and space-efficient filters. Efficient image sharing is helpful to disaster detection and scene recognition. To demonstrate the feasibility of SmartEye, we conduct two real-world case studies in which the loss in Typhoon Haiyan (2013) and Hurricane Sandy (2012) can be identified in a timely fashion by analyzing massive data consisting of more than 22 million images using our SmartEye system. Extensive experimental results illustrate that SmartEye is efficient and effective to achieve real-time analytics in disasters.", "citation": "Citations (16)", "departments": ["Huazhong University of Science and Technology", "McGill University", "McGill University", "Huazhong University of Science and Technology"], "authors": ["Yu Hua.....http://dblp.org/pers/hd/h/Hua_0001:Yu", "Wenbo He.....http://dblp.org/pers/hd/h/He:Wenbo", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Dan Feng.....http://dblp.org/pers/hd/f/Feng_0001:Dan"], "conf": "infocom", "year": "2015", "pages": 9}