{"title": "Multiple clone row DRAM: a low latency and area optimized DRAM.", "fields": ["memory rank", "row", "universal memory", "cas latency", "low latency"], "abstract": "Several previous works have changed DRAM bank structure to reduce memory access latency and have shown performance improvement. However, changes in the area-optimized DRAM bank can incur large area-overhead. To solve this problem, we propose Multiple Clone Row DRAM (MCR-DRAM), which uses existing DRAM bank structure without any modification.   Our key idea is Multiple Clone Row (MCR), in which multiple rows are simultaneously turned on or off to consist of a logically single row. MCR provides two advantages which enable our low-latency mechanisms (Early-Access, Early-Precharge and Fast-Refresh). First, MCR increases the speed of the sensing process by increasing the number of sensed-cells. Thus, it enables a READ/WRITE command to an MCR to be issued earlier than possible for a normal row (Early-Access). Second, DRAM cells in an MCR exhibit more frequent refreshes without additional REFRESH commands, thereby reducing the amount of charge leakage during the refresh interval for the identical cell. The reduced amount of charge leakage enables a PRECHARGE command to be served before the activated-cells are fully restored (Early-Precharge) and a REFRESH operation to be completed before the refreshed-cells are fully restored (Fast-Refresh).   Even though MCR-DRAM sacrifices memory capacity for low-latency, it can be dynamically reconfigured from low-latency to full-capacity DRAM. MCR-DRAM improves both performance and energy efficiency for both single-core and multi-core systems.", "citation": "Citations (14)", "departments": ["KAIST", "KAIST", "KAIST", "KAIST", "SK Hynix"], "authors": ["Jungwhan Choi.....http://dblp.org/pers/hd/c/Choi:Jungwhan", "Wongyu Shin.....http://dblp.org/pers/hd/s/Shin:Wongyu", "Jaemin Jang.....http://dblp.org/pers/hd/j/Jang:Jaemin", "Jinwoong Suh.....http://dblp.org/pers/hd/s/Suh:Jinwoong", "Yongkee Kwon.....http://dblp.org/pers/hd/k/Kwon:Yongkee", "Youngsuk Moon.....http://dblp.org/pers/hd/m/Moon:Youngsuk", "Lee-Sup Kim.....http://dblp.org/pers/hd/k/Kim:Lee=Sup"], "conf": "isca", "year": "2015", "pages": 12}