{"title": "A low-dimensional step pattern analysis algorithm with application to multimodal retinal image registration.", "fields": ["kanade lucas tomasi feature tracker", "curse of dimensionality", "scale invariant feature transform", "feature detection", "feature"], "abstract": "Existing feature descriptor-based methods on retinal image registration are mainly based on scale-invariant feature transform (SIFT) or partial intensity invariant feature descriptor (PIIFD). While these descriptors are often being exploited, they do not work very well upon unhealthy multimodal images with severe diseases. Additionally, the descriptors demand high dimensionality to adequately represent the features of interest. The higher the dimensionality, the greater the consumption of resources (e.g. memory space). To this end, this paper introduces a novel registration algorithm coined low-dimensional step pattern analysis (LoSPA), tailored to achieve low dimensionality while providing sufficient distinctiveness to effectively align unhealthy multimodal image pairs. The algorithm locates hypotheses of robust corner features based on connecting edges from the edge maps, mainly formed by vascular junctions. This method is insensitive to intensity changes, and produces uniformly distributed features and high repeatability across the image domain. The algorithm continues with describing the corner features in a rotation invariant manner using step patterns. These customized step patterns are robust to non-linear intensity changes, which are well-suited for multimodal retinal image registration. Apart from its low dimensionality, the LoSPA algorithm achieves about two-fold higher success rate in multimodal registration on the dataset of severe retinal diseases when compared to the top score among state-of-the-art algorithms.", "citation": "Citations (5)", "year": "2015", "departments": ["Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Agency for Science, Technology and Research"], "conf": "cvpr", "authors": ["Jimmy Addison Lee.....http://dblp.org/pers/hd/l/Lee:Jimmy_Addison", "Jun Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Jun", "Beng Hai Lee.....http://dblp.org/pers/hd/l/Lee:Beng_Hai", "Ee Ping Ong.....http://dblp.org/pers/hd/o/Ong:Ee_Ping", "Guozhen Xu.....http://dblp.org/pers/hd/x/Xu:Guozhen", "Damon Wing Kee Wong.....http://dblp.org/pers/hd/w/Wong:Damon_Wing_Kee", "Jiang Liu.....http://dblp.org/pers/hd/l/Liu_0001:Jiang", "Augustinus Laude.....http://dblp.org/pers/hd/l/Laude:Augustinus", "Tock Han Lim.....http://dblp.org/pers/hd/l/Lim:Tock_Han"], "pages": 8}