{"title": "Barrier elision for production parallel programs.", "fields": ["partitioned global address space", "global arrays", "synchronization", "redundancy", "fortran"], "abstract": "Large scientific code bases are often composed of several layers of runtime libraries, implemented in multiple programming languages. In such situation, programmers often choose conservative synchronization patterns leading to suboptimal performance. In this paper, we present context-sensitive dynamic optimizations that elide barriers redundant during the program execution. In our technique, we perform data race detection alongside the program to identify redundant barriers in their calling contexts; after an initial learning, we start eliding all future instances of barriers occurring in the same calling context. We present an automatic on-the-fly optimization and a multi-pass guided optimization. We apply our techniques to NWChem--a 6 million line computational chemistry code written in C/C++/Fortran that uses several runtime libraries such as Global Arrays, ComEx, DMAPP, and MPI. Our technique elides a surprisingly high fraction of barriers (as many as 63%) in production runs. This redundancy elimination translates to application speedups as high as 14% on 2048 cores. Our techniques also provided valuable insight about the application behavior, later used by NWChem developers. Overall, we demonstrate the value of holistic context-sensitive analyses that consider the domain science in conjunction with the associated runtime software stack.", "citation": "Citations (3)", "year": "2015", "departments": ["Rice University", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "University of California, Berkeley", "Rice University"], "conf": "ppopp", "authors": ["Milind Chabbi.....http://dblp.org/pers/hd/c/Chabbi:Milind", "Wim Lavrijsen.....http://dblp.org/pers/hd/l/Lavrijsen:Wim", "Wibe de Jong.....http://dblp.org/pers/hd/j/Jong:Wibe_de", "Koushik Sen.....http://dblp.org/pers/hd/s/Sen:Koushik", "John M. Mellor-Crummey.....http://dblp.org/pers/hd/m/Mellor=Crummey:John_M=", "Costin Iancu.....http://dblp.org/pers/hd/i/Iancu:Costin"], "pages": 11}