{"title": "Efficient broadcast on fragmented spectrum in cognitive radio networks.", "fields": ["wideband", "cognitive radio", "communication source", "atomic broadcast", "broadcast radiation"], "abstract": "To improve spectrum utilization, cognitive radio (CR) is introduced to detect and exploit available spectrum resources autonomously. The flexible spectrum use imposes special challenges on broadcast because different CR devices may detect different available spectrum fragments at different locations. The sender and the receivers have to agree on spectrum fragments that will be used for broadcast. There may not exist a common spectrum fragment that is available to all receivers. Most existing work assumes that a device works only in a single channel and thus the sender has to broadcast multiple times in different channels to reach all receivers. The broadcast problem is studied as a channel rendezvous and minimum latency scheduling problem. Recent spectrum-agile designs have enabled a device to utilize partially occupied spectrum. We thus view a wideband channel as an aggregation of multiple narrow channels that can be evaluated independently. A Spectrum Fragment Agile Broadcast (SFAB) scheme is introduced in this paper to support efficient broadcast on fragmented spectrum. It aims at achieving spectrum agreement between the transmitter and the receivers efficiently and maximizing the channel width used for broadcast regardless of the spectrum availability differences at receivers. We validate the effectiveness of SFAB through implementation on the GNU Radio / USRP platform and use ns-2 simulations to evaluate the performance in large deployments.", "citation": "Citations (4)", "departments": ["Michigan State University", "Michigan State University", "Michigan State University", "Michigan State University"], "authors": ["Pei Huang.....http://dblp.org/pers/hd/h/Huang:Pei", "Chin-Jung Liu.....http://dblp.org/pers/hd/l/Liu:Chin=Jung", "Xi Yang.....http://dblp.org/pers/hd/y/Yang:Xi", "Li Xiao.....http://dblp.org/pers/hd/x/Xiao_0001:Li"], "conf": "infocom", "year": "2015", "pages": 9}