{"title": "Network motif discovery: A GPU approach.", "fields": ["random graph", "central processing unit", "network motif", "instruction set", "biological network", "power graph analysis"], "abstract": "The identification of network motifs has important applications in numerous domains, such as pattern detection in biological networks and graph analysis in digital circuits. However, mining network motifs is computationally challenging, as it requires enumerating subgraphs from a real-life graph, and computing the frequency of each subgraph in a large number of random graphs. In particular, existing solutions often require days to derive network motifs from biological networks with only a few thousand vertices. To address this problem, this paper presents a novel study on network motif discovery using Graphical Processing Units (GPUs). The basic idea is to employ GPUs to parallelize a large number of subgraph matching tasks in computing subgraph frequencies from random graphs, so as to reduce the overall computation time of network motif discovery. We explore the design space of GPU-based subgraph matching algorithms, with careful analysis of several crucial factors (such as branch divergences and memory coalescing) that affect the performance of GPU programs. Based on our analysis, we develop a GPU-based solution that (i) considerably differs from existing CPU-based methods in how it enumerates subgraphs, and (ii) exploits the strengths of GPUs in terms of parallelism while mitigating their limitations in terms of the computation power per GPU core. With extensive experiments on a variety of biological networks, we show that our solution is up to two orders of magnitude faster than the best CPU-based approach, and is around $20$ times more cost-effective than the latter, when taking into account the monetary costs of the CPU and GPUs used.", "citation": "Citations (1)", "departments": ["Agency for Science, Technology and Research", "Nanyang Technological University", "Microsoft", "Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Nanyang Technological University", "Microsoft Research Asia (China)", "Agency for Science, Technology and Research"], "authors": ["Wenqing Lin.....http://dblp.org/pers/hd/l/Lin:Wenqing", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Xiaoli Li.....http://dblp.org/pers/hd/l/Li_0001:Xiaoli"], "conf": "icde", "year": "2015", "pages": 12}