{"title": "VSMC MIMO: A spectral efficient scheme for cooperative relay in cognitive radio networks.", "fields": ["spatial multiplexing", "multi user mimo", "mimo ofdm", "cooperative mimo", "3g mimo"], "abstract": "Multiple-Input Multiple-Output (MIMO) technology has become an efficient way to improve the capacity and reliability of wireless networks. Traditional MIMO schemes are designed mainly for the scenario of contiguous spectrum ranges. However, in cognitive radio networks, the available spectrum is discontiguous, making traditional MIMO schemes inefficient for spectrum usage. This motivates the design of new MIMO schemes that apply to networks with discontiguous spectrum ranges. In this paper, we propose a scheme called VSMC MIMO, which enables MIMO nodes to transmit variable numbers of streams in multiple discontinuous spectrum ranges. This scheme can largely improve the spectrum utilization and meanwhile maintain the same spatial multiplexing and diversity gains as traditional MIMO schemes. To implement this spectral-efficient scheme on cooperative MIMO relays in cognitive radio networks, we propose a joint relay selection and spectrum allocation algorithm and a corresponding MAC protocol for the system. We also build a testbed by the Universal Software Radio Peripherals (USRPs) to evaluate the performances of the proposed scheme in practical networks. The experimental results show that VSMC MIMO can efficiently utilize the discontiguous spectrum and greatly improve the throughput of cognitive radio networks.", "citation": "Citations (1)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Chao Kong.....http://dblp.org/pers/hd/k/Kong:Chao", "Zengwen Yuan.....http://dblp.org/pers/hd/y/Yuan:Zengwen", "Xushen Han.....http://dblp.org/pers/hd/h/Han:Xushen", "Feng Yang.....http://dblp.org/pers/hd/y/Yang:Feng", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Tao Wang.....http://dblp.org/pers/hd/w/Wang_0004:Tao", "Songwu Lu.....http://dblp.org/pers/hd/l/Lu:Songwu"], "conf": "infocom", "year": "2015", "pages": 9}