{"title": "Optimizing recursive queries with monotonic aggregates in DeALS.", "fields": ["datalog", "monotonic function", "recursion", "generality", "analytics"], "abstract": "The exploding demand for analytics has refocused the attention of data scientists on applications requiring aggregation in recursion. After resisting the efforts of researchers for more than twenty years, this problem is being addressed by innovative systems that are raising logic-oriented data languages to the levels of generality and performance that are needed to support efficiently a broad range of applications. Foremost among these new systems, the Deductive Application Language System (DeALS) achieves superior generality and performance via new constructs and optimization techniques for monotonic aggregates which are described in the paper. The use of a special class of monotonic aggregates in recursion was made possible by recent theoretical results that proved that they preserve the rigorous least-fixpoint semantics of core Datalog programs. This paper thus describes how DeALS extends their definitions and modifies their syntax to enable a concise expression of applications that, without them, could not be expressed in performance-conducive ways, or could not be expressed at all. Then the paper turns to the performance issue, and introduces novel implementation and optimization techniques that outperform traditional approaches, including Semi-naive evaluation. An extensive experimental evaluation was executed comparing DeALS with other systems on large datasets. The results suggest that, unlike other systems, DeALS indeed combines superior generality with superior performance.", "citation": "Citations (9)", "departments": ["University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles"], "authors": ["Alexander Shkapsky.....http://dblp.org/pers/hd/s/Shkapsky:Alexander", "Mohan Yang.....http://dblp.org/pers/hd/y/Yang:Mohan", "Carlo Zaniolo.....http://dblp.org/pers/hd/z/Zaniolo:Carlo"], "conf": "icde", "year": "2015", "pages": 12}