{"title": "Crowds on Wall Street: Extracting Value from Collaborative Investing Platforms.", "fields": ["crowdsourcing", "sentiment analysis", "stock market", "investment banking", "crowds"], "abstract": "In crowdsourced systems, it is often difficult to separate the highly capable \"experts\" from the average worker. In this paper, we study the problem of evaluating and identifying experts in the context of SeekingAlpha and StockTwits, two crowdsourced investment services that are encroaching on a space dominated for decades by large investment banks. We seek to understand the quality and impact of content on collaborative investment platforms, by empirically analyzing complete datasets of SeekingAlpha articles (9 years) and StockTwits messages (4 years). We develop sentiment analysis tools and correlate contributed content to the historical performance of relevant stocks. While SeekingAlpha articles and StockTwits messages provide minimal correlation to stock performance in aggregate, a subset of experts contribute more valuable (predictive) content. We show that these authors can be easily identified by user interactions, and investments using their analysis significantly outperform broader markets. Finally, we conduct a user survey that sheds light on users views of SeekingAlpha content and stock manipulation.", "citation": "Citations (11)", "departments": ["University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara", "University of California, Santa Barbara"], "authors": ["Gang Wang.....http://dblp.org/pers/hd/w/Wang_0011:Gang", "Tianyi Wang.....http://dblp.org/pers/hd/w/Wang:Tianyi", "Bolun Wang.....http://dblp.org/pers/hd/w/Wang:Bolun", "Divya Sambasivan.....http://dblp.org/pers/hd/s/Sambasivan:Divya", "Zengbin Zhang.....http://dblp.org/pers/hd/z/Zhang:Zengbin", "Haitao Zheng.....http://dblp.org/pers/hd/z/Zheng:Haitao", "Ben Y. Zhao.....http://dblp.org/pers/hd/z/Zhao:Ben_Y="], "conf": "cscw", "year": "2015", "pages": 14}