{"title": "GraphSC: Parallel Secure Computation Made Easy.", "fields": ["secure two party computation", "implementation", "secure multi party computation", "private information retrieval", "analysis of parallel algorithms"], "abstract": "We propose introducing modern parallel programming paradigms to secure computation, enabling their secure execution on large datasets. To address this challenge, we present Graph SC, a framework that (i) provides a programming paradigm that allows non-cryptography experts to write secure code, (ii) brings parallelism to such secure implementations, and (iii) meets the need for obliviousness, thereby not leaking any private information. Using Graph SC, developers can efficiently implement an oblivious version of graph-based algorithms (including sophisticated data mining and machine learning algorithms) that execute in parallel with minimal communication overhead. Importantly, our secure version of graph-based algorithms incurs a small logarithmic overhead in comparison with the non-secure parallel version. We build Graph SC and demonstrate, using several algorithms as examples, that secure computation can be brought into the realm of practicality for big data analysis. Our secure matrix factorization implementation can process 1 million ratings in 13 hours, which is a multiple order-of-magnitude improvement over the only other existing attempt, which requires 3 hours to process 16K ratings.", "citation": "Citations (71)", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "Yahoo!", "Technicolor", "Google"], "authors": ["Kartik Nayak.....http://dblp.org/pers/hd/n/Nayak:Kartik", "Xiao Shaun Wang.....http://dblp.org/pers/hd/w/Wang:Xiao_Shaun", "Stratis Ioannidis.....http://dblp.org/pers/hd/i/Ioannidis:Stratis", "Udi Weinsberg.....http://dblp.org/pers/hd/w/Weinsberg:Udi", "Nina Taft.....http://dblp.org/pers/hd/t/Taft:Nina", "Elaine Shi.....http://dblp.org/pers/hd/s/Shi:Elaine"], "conf": "sp", "year": "2015", "pages": 18}