{"title": "Making sense of trajectory data: A partition-and-summarization approach.", "fields": ["homogeneous", "trajectory", "partition", "feature selection", "automatic summarization"], "abstract": "Due to the prevalence of GPS-enabled devices and wireless communication technology, spatial trajectories that describe the movement history of moving objects are being generated and accumulated at an unprecedented pace. However, a raw trajectory in the form of sequence of timestamped locations does not make much sense for humans without semantic representation. In this work we aim to facilitate human's understanding of a raw trajectory by automatically generating a short text to describe it. By formulating this task as the problem of adaptive trajectory segmentation and feature selection, we propose a partition-and-summarization framework. In the partition phase, we first define a set of features for each trajectory segment and then derive an optimal partition with the aim to make the segments within each partition as homogeneous as possible in terms of their features. In the summarization phase, for each partition we select the most interesting features by comparing against the common behaviours of historical trajectories on the same route and generate short text description for these features. For empirical study, we apply our solution to a real trajectory dataset and have found that the generated text can effectively reflect the important parts in a trajectory.", "citation": "Citations (20)", "departments": ["University of Queensland", "University of Queensland", "University of Michigan", "University of Queensland", "University of C ... , United States"], "authors": ["Han Su.....http://dblp.org/pers/hd/s/Su:Han", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0002:Kai", "Jiamin Huang.....http://dblp.org/pers/hd/h/Huang:Jiamin", "Shazia Wasim Sadiq.....http://dblp.org/pers/hd/s/Sadiq:Shazia_Wasim", "Nicholas Jing Yuan.....http://dblp.org/pers/hd/y/Yuan:Nicholas_Jing", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "icde", "year": "2015", "pages": 12}