{"title": "ChASER: Channel-aware symbol error reduction for high-performance WiFi systems in dynamic channel environment.", "fields": ["frame aggregation", "orthogonal frequency division multiplexing", "symbol", "transmission time", "granularity"], "abstract": "Due to considerable increases in user mobility and frame length through aggregation, the wireless channel remains no longer time-invariant during the (aggregated) frame transmission time. However, the existing IEEE 802.11 standards still define the channel estimation to be performed only once at the preamble for coherent OFDM receivers, and the same channel information to be used throughout the entire (aggregated) frame processing. Our experimental results reveal that this baseline channel estimation approach seriously deteriorates the WiFi performance, especially for pedestrian mobile users and the recently adopted frame aggregation scheme. In this paper, we propose Channel-Aware Symbol Error Reduction (ChASER), a new practical channel estimation and tracking scheme for WiFi receivers. ChASER utilizes the re-encoding and re-modulation of the received data symbol to keep up with the wireless channel dynamics at the granularity of OFDM symbols. Our extensive, trace-driven link-level simulation shows significant performance gains over a wide range of channel conditions based on the real wireless channel traces collected by the off-the-shelf WiFi device. In addition, the feasibility of its low-complexity and standard compliance is demonstrated by Microsoft's Software Radio (Sora) prototype implementation and experimentation. To our knowledge, ChASER is the first IEEE 802.11n-compatible channel tracking algorithm since other approaches addressing the time-varying channel conditions over a single (aggregated) frame duration require costly modifications of the IEEE 802.11n standard.", "citation": "Citations (4)", "departments": ["Seoul National University", "Seoul National University", "Seoul National University", "Seoul National University", "EpiSys Science, ... CA 90220, U.S.A"], "authors": ["Okhwan Lee.....http://dblp.org/pers/hd/l/Lee:Okhwan", "Weiping Sun.....http://dblp.org/pers/hd/s/Sun:Weiping", "Jihoon Kim.....http://dblp.org/pers/hd/k/Kim:Jihoon", "Hyuk Lee.....http://dblp.org/pers/hd/l/Lee:Hyuk", "Bo Ryu.....http://dblp.org/pers/hd/r/Ryu:Bo", "Jungwoo Lee.....http://dblp.org/pers/hd/l/Lee_0001:Jungwoo", "Sunghyun Choi.....http://dblp.org/pers/hd/c/Choi:Sunghyun"], "conf": "infocom", "year": "2015", "pages": 9}