{"title": "Game-theory-based batch identification of invalid signatures in wireless mobile networks.", "fields": ["algorithm selection", "complete information", "nash equilibrium", "game theory", "digital signature"], "abstract": "Digital signature has been widely employed in wireless mobile networks to ensure the authenticity of messages and identity of nodes. A paramount concern in signature verification is reducing the verification delay to ensure the network QoS. To address this issue, researchers have proposed the batch cryptography technology. However, most of the existing works focus on designing batch verification algorithms without sufficiently considering the impact of invalid signatures. The performance of batch verification could dramatically drop, if there are verification failures caused by invalid signatures. In this paper, we propose a Game-theory-based Batch Identification Model (GBIM) for wireless mobile networks, enabling nodes to find invalid signatures with the optimal delay under heterogeneous and dynamic attack scenarios. Specifically, we design an incomplete information game model between a verifier and its attackers, and prove the existence of Nash Equilibrium, to select the dominant algorithm for identifying invalid signatures. Moreover, we propose an auto-match protocol to optimize the identification algorithm selection, when the attack strategies can be estimated based on history information. Comprehensive simulation results demonstrate that GBIM can identify invalid signatures more efficiently than existing algorithms.", "citation": "Citations (4)", "departments": ["Wuhan University", "University of Texas of the Permian Basin", "Arizona State University", "Wuhan University"], "authors": ["Jing Chen.....http://dblp.org/pers/hd/c/Chen_0003:Jing", "Quan Yuan.....http://dblp.org/pers/hd/y/Yuan_0003:Quan", "Guoliang Xue.....http://dblp.org/pers/hd/x/Xue:Guoliang", "Ruiying Du.....http://dblp.org/pers/hd/d/Du:Ruiying"], "conf": "infocom", "year": "2015", "pages": 9}