{"title": "Understanding Malvertising Through Ad-Injecting Browser Extensions.", "fields": ["malware", "software deployment", "installation", "adware", "web page"], "abstract": "Malvertising is a malicious activity that leverages advertising to distribute various forms of malware. Because advertising is the key revenue generator for numerous Internet companies, large ad networks, such as Google, Yahoo and Microsoft, invest a lot of effort to mitigate malicious ads from their ad networks. This drives adversaries to look for alternative methods to deploy malvertising. In this paper, we show that browser extensions that use ads as their monetization strategy often facilitate the deployment of malvertising. Moreover, while some extensions simply serve ads from ad networks that support malvertising, other extensions maliciously alter the content of visited webpages to force users into installing malware. To measure the extent of these behaviors we developed Expector, a system that automatically inspects and identifies browser extensions that inject ads, and then classifies these ads as malicious or benign based on their landing pages. Using Expector, we automatically inspected over 18,000 Chrome browser extensions. We found 292 extensions that inject ads, and detected 56 extensions that participate in malvertising using 16 different ad networks and with a total user base of 602,417.", "citation": "Citations (28)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Facebook", "Amazon.com"], "authors": ["Xinyu Xing.....http://dblp.org/pers/hd/x/Xing:Xinyu", "Wei Meng.....http://dblp.org/pers/hd/m/Meng_0001:Wei", "Byoungyoung Lee.....http://dblp.org/pers/hd/l/Lee:Byoungyoung", "Udi Weinsberg.....http://dblp.org/pers/hd/w/Weinsberg:Udi", "Anmol Sheth.....http://dblp.org/pers/hd/s/Sheth:Anmol", "Roberto Perdisci.....http://dblp.org/pers/hd/p/Perdisci:Roberto", "Wenke Lee.....http://dblp.org/pers/hd/l/Lee:Wenke"], "conf": "www", "year": "2015", "pages": 10}