{"title": "Spark SQL: Relational Data Processing in Spark.", "fields": ["code generation", "analytics", "spark", "sql", "scala"], "abstract": "Spark SQL is a new module in Apache Spark that integrates relational processing with Spark's functional programming API. Built on our experience with Shark, Spark SQL lets Spark programmers leverage the benefits of relational processing (e.g. declarative queries and optimized storage), and lets SQL users call complex analytics libraries in Spark (e.g. machine learning). Compared to previous systems, Spark SQL makes two main additions. First, it offers much tighter integration between relational and procedural processing, through a declarative DataFrame API that integrates with procedural Spark code. Second, it includes a highly extensible optimizer, Catalyst, built using features of the Scala programming language, that makes it easy to add composable rules, control code generation, and define extension points. Using Catalyst, we have built a variety of features (e.g. schema inference for JSON, machine learning types, and query federation to external databases) tailored for the complex needs of modern data analysis. We see Spark SQL as an evolution of both SQL-on-Spark and of Spark itself, offering richer APIs and optimizations while keeping the benefits of the Spark programming model.", "citation": "Citations (627)", "year": "2015", "departments": ["Databricks, San Francisco, USA", "Databricks, San Francisco, USA", "Databricks, San Francisco, USA", "Databricks, San Francisco, USA", "Databricks, San Francisco, USA"], "conf": "sigmod", "authors": ["Michael Armbrust.....http://dblp.org/pers/hd/a/Armbrust:Michael", "Reynold S. Xin.....http://dblp.org/pers/hd/x/Xin:Reynold_S=", "Cheng Lian.....http://dblp.org/pers/hd/l/Lian:Cheng", "Yin Huai.....http://dblp.org/pers/hd/h/Huai:Yin", "Davies Liu.....http://dblp.org/pers/hd/l/Liu:Davies", "Joseph K. Bradley.....http://dblp.org/pers/hd/b/Bradley:Joseph_K=", "Xiangrui Meng.....http://dblp.org/pers/hd/m/Meng:Xiangrui", "Tomer Kaftan.....http://dblp.org/pers/hd/k/Kaftan:Tomer", "Michael J. Franklin.....http://dblp.org/pers/hd/f/Franklin:Michael_J=", "Ali Ghodsi.....http://dblp.org/pers/hd/g/Ghodsi_0002:Ali", "Matei Zaharia.....http://dblp.org/pers/hd/z/Zaharia:Matei"], "pages": 12}