{"title": "Quality-Driven Continuous Query Execution over Out-of-Order Data Streams.", "fields": ["stream processing", "timestamp", "aggregate function", "data stream mining", "tuple"], "abstract": "Executing continuous queries over out-of-order data streams, where tuples are not ordered according to timestamps, is challenging; because high result accuracy and low result latency are two conflicting performance metrics. Although many applications allow trading exact query results for lower latency, they still expect the produced results to meet a certain quality requirement. However, none of existing disorder handling approaches have considered minimizing the result latency while meeting user-specified requirements on the quality of query results.   In this demonstration, we showcase  AQ-K-slack , an adaptive, buffer-based disorder handling approach, which supports executing sliding window aggregate queries over out-of-order data streams in a quality-driven manner. By adapting techniques from the field of sampling-based approximate query processing and control theory,  AQ-K-slack  dynamically adjusts the input buffer size at query runtime to minimize the result latency, while respecting a user-specified threshold on relative errors in produced query results.   We demonstrate a prototype stream processing system, which extends SAP Event Stream Processor with the implementation of  AQ-K-slack . Through an interactive interface, the audience will learn the effect of different factors, such as the aggregate function, the window specification, the result error threshold, and stream properties, on the latency and the accuracy of query results. Moreover, they can experience the effectiveness of  AQ-K-slack  in obtaining user-desired latency vs. result accuracy trade-offs, compared to naive disorder handling approaches that make extreme trade-offs. For instance, by scarifying 1% result accuracy, our system can reduce the result latency by 80% when compared to the state of the art.", "citation": "Citations (7)", "year": "2015", "departments": ["SAP SE, Dresden, Germany", "SAP SE, Dresden, Germany", "SAP SE, Berlin, Germany", "SAP SE, Waterloo, Canada", "SAP SE, Dresden, Germany"], "conf": "sigmod", "authors": ["Yuanzhen Ji.....http://dblp.org/pers/hd/j/Ji:Yuanzhen", "Hongjin Zhou.....http://dblp.org/pers/hd/z/Zhou:Hongjin", "Zbigniew Jerzak.....http://dblp.org/pers/hd/j/Jerzak:Zbigniew", "Anisoara Nica.....http://dblp.org/pers/hd/n/Nica:Anisoara", "Gregor Hackenbroich.....http://dblp.org/pers/hd/h/Hackenbroich:Gregor", "Christof Fetzer.....http://dblp.org/pers/hd/f/Fetzer:Christof"], "pages": 6}