{"title": "BlueDBM: an appliance for big data analytics.", "fields": ["complex data type", "analytics", "systems architecture", "auxiliary memory", "flash memory"], "abstract": "Complex data queries, because of their need for random accesses, have proven to be slow unless all the data can be accommodated in DRAM. There are many domains, such as genomics, geological data and daily twitter feeds where the datasets of interest are 5TB to 20 TB. For such a dataset, one would need a cluster with 100 servers, each with 128GB to 256GBs of DRAM, to accommodate all the data in DRAM. On the other hand, such datasets could be stored easily in the flash memory of a rack-sized cluster. Flash storage has much better random access performance than hard disks, which makes it desirable for analytics workloads. In this paper we present BlueDBM, a new system architecture which has flash-based storage with in-store processing capability and a low-latency high-throughput inter-controller network. We show that BlueDBM outperforms a flash-based system without these features by a factor of 10 for some important applications. While the performance of a ram-cloud system falls sharply even if only 5%~10% of the references are to the secondary storage, this sharp performance degradation is not an issue in BlueDBM. BlueDBM presents an attractive point in the cost-performance trade-off for Big Data analytics.", "citation": "Citations (73)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Department of E ...  Cambridge, USA", "Department of E ...  Cambridge, USA"], "authors": ["Sang Woo Jun.....http://dblp.org/pers/hd/j/Jun:Sang_Woo", "Ming Liu.....http://dblp.org/pers/hd/l/Liu:Ming", "Sungjin Lee.....http://dblp.org/pers/hd/l/Lee:Sungjin", "Jamey Hicks.....http://dblp.org/pers/hd/h/Hicks:Jamey", "John Ankcorn.....http://dblp.org/pers/hd/a/Ankcorn:John", "Myron King.....http://dblp.org/pers/hd/k/King:Myron", "Shuotao Xu.....http://dblp.org/pers/hd/x/Xu:Shuotao", "Arvind.....http://dblp.org/pers/hd/a/Arvind:"], "conf": "isca", "year": "2015", "pages": 13}