{"title": "PeerClean: Unveiling peer-to-peer botnets through dynamic group behavior analysis.", "fields": ["computer network", "peer to peer", "flow network", "botnet", "campus network"], "abstract": "Advanced botnets adopt a peer-to-peer (P2P) infrastructure for more resilient command and control (C&C). Traditional detection techniques become less effective in identifying bots that communicate via a P2P structure. In this paper, we present PeerClean, a novel system that detects P2P botnets in real time using only high-level features extracted from C&C network flow traffic. PeerClean reliably distinguishes P2P bot-infected hosts from legitimate P2P hosts by jointly considering flow-level traffic statistics and network connection patterns. Instead of working on individual connections or hosts, PeerClean clusters hosts with similar flow traffic statistics into groups. It then extracts the collective and dynamic connection patterns of each group by leveraging a novel dynamic group behavior analysis. Comparing with the individual host-level connection patterns, the collective group patterns are more robust and differentiable. Multi-class classification models are then used to identify different types of bots based on the established patterns. To increase the detection probability, we further propose to train the model with average group behavior, but to explore the extreme group behavior for the detection. We evaluate PeerClean on real-world flow records from a campus network. Our evaluation shows that PeerClean is able to achieve high detection rates with few false positives.", "citation": "Citations (6)", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech", "Virginia Tech"], "authors": ["Qiben Yan.....http://dblp.org/pers/hd/y/Yan:Qiben", "Yao Zheng.....http://dblp.org/pers/hd/z/Zheng:Yao", "Tingting Jiang.....http://dblp.org/pers/hd/j/Jiang:Tingting", "Wenjing Lou.....http://dblp.org/pers/hd/l/Lou:Wenjing", "Y. Thomas Hou.....http://dblp.org/pers/hd/h/Hou:Y=_Thomas"], "conf": "infocom", "year": "2015", "pages": 9}