{"title": "Flexible and Robust Multi-Network Clustering.", "fields": ["hierarchical clustering of networks", "canopy clustering algorithm", "constrained clustering", "flame clustering", "brown clustering"], "abstract": "Integrating multiple graphs (or networks) has been shown to be a promising approach to improve the graph clustering accuracy. Various multi-view and multi-domain graph clustering methods have recently been developed to integrate multiple networks. In these methods, a network is treated as a view or domain.The key assumption is that there is a common clustering structure shared across all views (domains), and different views (domains) provide compatible and complementary information on this underlying clustering structure. However, in many emerging real-life applications, different networks have different data distributions, where the assumption that all networks share a single common clustering structure does not hold. In this paper, we propose a flexible and robust framework that allows multiple underlying clustering structures across different networks. Our method models the domain similarity as a network, which can be utilized to regularize the clustering structures in different networks. We refer to such a data model as a network of networks (NoN). We develop NoNClus, a novel method based on non-negative matrix factorization (NMF), to cluster an NoN. We provide rigorous theoretical analysis of NoNClus in terms of its correctness, convergence and complexity. Extensive experimental results on synthetic and real-life datasets show the effectiveness of our method.", "citation": "Citations (22)", "departments": ["Case Western Reserve University", "Arizona State University", "Baidu", "Case Western Reserve University"], "authors": ["Jingchao Ni.....http://dblp.org/pers/hd/n/Ni:Jingchao", "Hanghang Tong.....http://dblp.org/pers/hd/t/Tong:Hanghang", "Wei Fan.....http://dblp.org/pers/hd/f/Fan_0001:Wei", "Xiang Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Xiang"], "conf": "kdd", "year": "2015", "pages": 10}