{"title": "Scaling iterative graph computations with GraphMap.", "fields": ["graph bandwidth", "graph", "sequential access", "graph database", "graph partition"], "abstract": "In recent years, systems researchers have devoted considerable effort to the study of large-scale graph processing. Existing distributed graph processing systems such as Pregel, based solely on distributed memory for their computations, fail to provide seamless scalability when the graph data and their intermediate computational results no longer fit into the memory; and most distributed approaches for iterative graph computations do not consider utilizing secondary storage a viable solution. This paper presents GraphMap, a distributed iterative graph computation framework that maximizes access locality and speeds up distributed iterative graph computations by effectively utilizing secondary storage. GraphMap has three salient features: (1) It distinguishes data states that are mutable during iterative computations from those that are read-only in all iterations to maximize sequential access and minimize random access. (2) It entails a two-level graph partitioning algorithm that enables balanced workloads and locality-optimized data placement. (3) It contains a proposed suite of locality-based optimizations that improve computational efficiency. Extensive experiments on several real-world graphs show that GraphMap outperforms existing distributed memory-based systems for various iterative graph algorithms.", "citation": "Citations (6)", "year": "2015", "departments": ["Louisiana State University", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "conf": "sc", "authors": ["Kisung Lee.....http://dblp.org/pers/hd/l/Lee:Kisung", "Ling Liu.....http://dblp.org/pers/hd/l/Liu_0001:Ling", "Karsten Schwan.....http://dblp.org/pers/hd/s/Schwan:Karsten", "Calton Pu.....http://dblp.org/pers/hd/p/Pu:Calton", "Qi Zhang.....http://dblp.org/pers/hd/z/Zhang_0009:Qi", "Yang Zhou.....http://dblp.org/pers/hd/z/Zhou_0001:Yang", "Emre Yigitoglu.....http://dblp.org/pers/hd/y/Yigitoglu:Emre", "Pingpeng Yuan.....http://dblp.org/pers/hd/y/Yuan:Pingpeng"], "pages": 12}