{"title": "Turbulent motions cannot shake VR.", "fields": ["motion simulator", "immersion", "skin conductance", "motion sickness", "shake"], "abstract": "The International Air Transport Association forecasts that there will be at least a 30% increase in passenger demand for flights over the next five years. In these circumstances the aircraft industry is looking for new ways to keep passengers occupied, entertained and healthy, and one of the methods under consideration is immersive virtual reality. It is therefore becoming important to understand how motion sickness and presence in virtual reality are influenced by physical motion. We were specifically interested in the use of head-mounted displays (HMD) while experiencing in-flight motions such as turbulence. 50 people were tested in different virtual environments varying in their context (virtual airplane versus magic carpet ride over tropical islands) and the way the physical motion was incorporated into the virtual world (matching visual and auditory stimuli versus no incorporation). Participants were subjected to three brief periods of turbulent motions realized with a motion simulator. Physiological signals (postural stability, heart rate and skin conductance) as well as subjective experiences (sickness and presence questionnaires) were measured. None of our participants experienced severe motion sickness during the experiment and although there were only small differences between conditions we found indications that it is beneficial for both wellbeing and presence to choose a virtual environment in which turbulent motions could be plausible and perceived as part of the scenario. Therefore we can conclude that brief exposure to turbulent motions does not get participants sick.", "citation": "Citations (2)", "departments": ["Max Planck Society", "University of Barcelona", "Max Planck Society", "Max Planck Society", "University of Barcelona"], "authors": ["Florian Soyka.....http://dblp.org/pers/hd/s/Soyka:Florian", "Elena Kokkinara.....http://dblp.org/pers/hd/k/Kokkinara:Elena", "Markus Leyrer.....http://dblp.org/pers/hd/l/Leyrer:Markus", "Heinrich H. Bülthoff.....http://dblp.org/pers/hd/b/B=uuml=lthoff:Heinrich_H=", "Mel Slater.....http://dblp.org/pers/hd/s/Slater:Mel", "Betty J. Mohler.....http://dblp.org/pers/hd/m/Mohler:Betty_J="], "conf": "vr", "year": "2015", "pages": 8}