{"title": "ZigZag: Automatically Hardening Web Applications Against Client-side Validation Vulnerabilities.", "fields": ["client side", "javascript", "html5", "zigzag", "rendering"], "abstract": "Modern web applications are increasingly moving program code to the client in the form of JavaScript. With the growing adoption of HTML5 APIs such as postMessage, client-side validation (CSV) vulnerabilities are consequently becoming increasingly important to address as well. However, while detecting and preventing attacks against web applications is a well-studied topic on the server, considerably less work has been performed for the client. Exacerbating this issue is the problem that defenses against CSVs must, in the general case, fundamentally exist in the browser, rendering current server-side defenses inadequate.\n\nIn this paper, we present ZigZag, a system for hardening JavaScript-based web applications against clientside validation attacks. ZigZag transparently instruments client-side code to perform dynamic invariant detection on security-sensitive code, generating models that describe how - and with whom - client-side components interact. ZigZag is capable of handling templated JavaScript, avoiding full re-instrumentation when JavaScript programs are structurally similar. Learned invariants are then enforced through a subsequent instrumentation step. Our evaluation demonstrates that ZigZag is capable of automatically hardening client-side code against both known and previously-unknown vulnerabilities. Finally, we show that ZigZag introduces acceptable overhead in many cases, and is compatible with popular websites drawn from the Alexa Top 20 without developer or user intervention.", "citation": "Citations (9)", "year": "2015", "departments": ["Northeastern University", "Northeastern University", "Northeastern University", "University of California, Santa Barbara", "University of California, Santa Barbara"], "conf": "uss", "authors": ["Michael Weissbacher.....http://dblp.org/pers/hd/w/Weissbacher:Michael", "William K. Robertson.....http://dblp.org/pers/hd/r/Robertson:William_K=", "Engin Kirda.....http://dblp.org/pers/hd/k/Kirda:Engin", "Christopher Kruegel.....http://dblp.org/pers/hd/k/Kruegel:Christopher", "Giovanni Vigna.....http://dblp.org/pers/hd/v/Vigna:Giovanni"], "pages": 16}