{"title": "BGMaker: example-based anime background image creation from a photograph.", "fields": ["digital humanities", "painting", "quilting", "storytelling", "anime"], "abstract": "Anime designers often paint actual sceneries to serve as background images based on photographs to complement characters. As painting background scenery is time consuming and cost ineffective, there is a high demand for techniques that can convert photographs into anime styled graphics. Previous approaches for this purpose, such as Image Quilting [Efros and Freeman 2001] transferred a source texture onto a target photograph. These methods synthesized corresponding source patches with the target elements in a photograph, and correspondence was achieved through nearest-neighbor search such as PatchMatch [Barnes et al. 2009]. However, the  nearest -neighbor patch is not always the most  suitable  patch for anime transfer because photographs and anime background images differ in color and texture. For example, real-world color need to be converted into specific colors for anime; further, the type of brushwork required to realize an anime effect, is different for different photograph elements (e.g. sky, mountain, grass). Thus, to get the most suitable patch, we propose a method, wherein we establish global region correspondence before local patch match. In our proposed method, BGMaker, (1) we divide the real and anime images into regions; (2) then, we automatically acquire correspondence between each region on the basis of color and texture features, and (3) search and synthesize the most suitable patch within the corresponding region. Our primary contribution in this paper is a method for automatically acquiring correspondence between target regions and source regions of different color and texture, which allows us to generate an anime background image while preserving the details of the source image.", "citation": "Citations (1)", "departments": ["Waseda University", "Waseda University", "Waseda University", "Waseda University", "Waseda University"], "authors": ["Shugo Yamaguchi.....http://dblp.org/pers/hd/y/Yamaguchi:Shugo", "Chie Furusawa.....http://dblp.org/pers/hd/f/Furusawa:Chie", "Takuya Kato.....http://dblp.org/pers/hd/k/Kato:Takuya", "Tsukasa Fukusato.....http://dblp.org/pers/hd/f/Fukusato:Tsukasa", "Shigeo Morishima.....http://dblp.org/pers/hd/m/Morishima:Shigeo"], "conf": "siggraph", "year": "2015", "pages": 1}