{"title": "Executing Model-Based Tests on Platform-Specific Implementations (T).", "fields": ["recovery testing", "system integration testing", "software reliability testing", "non regression testing", "keyword driven testing"], "abstract": "Model-based testing of embedded real-time systems is challenging because platform-specific details are often abstracted away to make the models amenable to various analyses. Testing an implementation to expose non-conformance to such a model requires reconciling differences arising from these abstractions. Due to stateful behavior, naive comparisons of model and system behaviors often fail causing numerous false positives. Previously proposed approaches address this by being reactively permissive: passing criteria are relaxed to reduce false positives, but may increase false negatives, which is particularly bothersome for safety-critical systems. To address this concern, we propose an automated approach that is proactively adaptive: test stimuli and system responses are suitably modified taking into account platform-specific aspects so that the modified test when executed on the platform-specific implementation exercises the intended scenario captured in the original model-based test. We show that the new framework eliminates false negatives while keeping the number of false positives low for a variety of platform-specific configurations.", "citation": "Not cited", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "University of Pennsylvania", "Medtronic PLC, USA"], "authors": ["Dongjiang You.....http://dblp.org/pers/hd/y/You:Dongjiang", "Sanjai Rayadurgam.....http://dblp.org/pers/hd/r/Rayadurgam:Sanjai", "Mats Per Erik Heimdahl.....http://dblp.org/pers/hd/h/Heimdahl:Mats_Per_Erik", "John Komp.....http://dblp.org/pers/hd/k/Komp:John", "BaekGyu Kim.....http://dblp.org/pers/hd/k/Kim:BaekGyu", "Oleg Sokolsky.....http://dblp.org/pers/hd/s/Sokolsky:Oleg"], "conf": "kbse", "year": "2015", "pages": 11}