{"title": "Searching Persuasively: Joint Event Detection and Evidence Recounting with Limited Supervision.", "fields": ["exploit", "trecvid", "computer vision", "premise", "machine learning"], "abstract": "Multimedia event detection (MED) and multimedia event recounting (MER) are fundamental tasks in managing large amounts of unconstrained web videos, and have attracted a lot of attention in recent years. Most existing systems perform MER as a post-processing step on top of the MED results. In order to leverage the mutual benefits of the two tasks, we propose a joint framework that simultaneously detects high-level events and localizes the indicative concepts of the events. Our premise is that a good recounting algorithm should not only explain the detection result, but should also be able to assist detection in the first place. Coupled in a joint optimization framework, recounting improves detection by pruning irrelevant noisy concepts while detection directs recounting to the most discriminative evidences. To better utilize the powerful and interpretable semantic video representation, we segment each video into several shots and exploit the rich temporal structures at shot level. The consequent computational challenge is carefully addressed through a significant improvement of the current ADMM algorithm, which, after eliminating all inner loops and equipping novel closed-form solutions for all intermediate steps, enables us to efficiently process extremely large video corpora. We test the proposed method on the large scale TRECVID MEDTest 2014 and MEDTest 2013 datasets, and obtain very promising results for both MED and MER.", "citation": "Citations (35)", "departments": ["University of Technology, Sydney", "Carnegie Mellon University", "University of Technology, Sydney", "Carnegie Mellon University"], "authors": ["Xiaojun Chang.....http://dblp.org/pers/hd/c/Chang:Xiaojun", "Yaoliang Yu.....http://dblp.org/pers/hd/y/Yu:Yaoliang", "Yi Yang.....http://dblp.org/pers/hd/y/Yang_0001:Yi", "Alexander G. Hauptmann.....http://dblp.org/pers/hd/h/Hauptmann:Alexander_G="], "conf": "mm", "year": "2015", "pages": 10}