{"title": "HipMer: an extreme-scale de novo genome assembler.", "fields": ["sequence assembly", "genomics", "unified parallel c", "genome", "human genome"], "abstract": "De novo  whole genome assembly reconstructs genomic sequences from short, overlapping, and potentially erroneous DNA segments and is one of the most important computations in modern genomics. This work presents HipMer, the first high-quality end-to-end  de novo  assembler designed for extreme scale analysis, via efficient parallelization of the Meraculous code. First, we significantly improve scalability of parallel k-mer analysis for complex repetitive genomes that exhibit skewed frequency distributions. Next, we optimize the traversal of the de Bruijn graph of k-mers by employing a novel communication-avoiding parallel algorithm in a variety of use-case scenarios. Finally, we parallelize the Meraculous scaffolding modules by leveraging the one-sided communication capabilities of the Unified Parallel C while effectively mitigating load imbalance. Large-scale results on a Cray XC30 using grand-challenge genomes demonstrate efficient performance and scalability on thousands of cores. Overall, our pipeline accelerates Meraculous performance by orders of magnitude, enabling the complete assembly of the human genome in just 8.4 minutes on 15K cores of the Cray XC30, and creating unprecedented capability for extreme-scale genomic analysis.", "citation": "Citations (19)", "year": "2015", "departments": ["Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "Lawrence Berkeley National Laboratory", "University of California, Berkeley"], "conf": "sc", "authors": ["Evangelos Georganas.....http://dblp.org/pers/hd/g/Georganas:Evangelos", "Aydin Buluç.....http://dblp.org/pers/hd/b/Bulu=ccedil=:Aydin", "Jarrod Chapman.....http://dblp.org/pers/hd/c/Chapman:Jarrod", "Steven A. Hofmeyr.....http://dblp.org/pers/hd/h/Hofmeyr:Steven_A=", "Chaitanya Aluru.....http://dblp.org/pers/hd/a/Aluru:Chaitanya", "Rob Egan.....http://dblp.org/pers/hd/e/Egan:Rob", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid", "Daniel Rokhsar.....http://dblp.org/pers/hd/r/Rokhsar:Daniel", "Katherine A. Yelick.....http://dblp.org/pers/hd/y/Yelick:Katherine_A="], "pages": 11}