{"title": "On the performance of successive interference cancellation in D2D-enabled cellular networks.", "fields": ["radio resource management", "stochastic geometry", "single antenna interference cancellation", "expression", "co channel interference"], "abstract": "Device-to-device (D2D) communication underlaying cellular networks is a promising technology to improve network resource utilization. In D2D-enabled cellular networks, the interference among spectrum-sharing links is more severer than that in traditional cellular networks, which motivates the adoption of interference cancellation techniques such as successive interference cancellation (SIC) at the receivers. However, to date, how SIC can affect the performance of D2D-enabled cellular networks is still unknown. In this paper, we present an analytical framework for studying the performance of SIC in large-scale D2D-enabled cellular networks using the tools from stochastic geometry. To facilitate the interference analysis, we propose the approach of stochastic equivalence of the interference, which converts the two-tier interference (interference from both the cellular tier and D2D tier) to an equivalent single-tier interference. Based on the proposed stochastic equivalence models, we derive the general expressions for the successful transmission probabilities of cellular uplinks and D2D links with infinite and finite SIC capabilities respectively. We demonstrate how SIC affects the performance of large-scale D2D-enabled cellular networks by both analytical and numerical results.", "citation": "Citations (17)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Chuan Ma.....http://dblp.org/pers/hd/m/Ma:Chuan", "Weijie Wu.....http://dblp.org/pers/hd/w/Wu:Weijie", "Ying Cui.....http://dblp.org/pers/hd/c/Cui:Ying", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing"], "conf": "infocom", "year": "2015", "pages": 9}