{"title": "Distance estimation in large immersive projection systems, revisited.", "fields": ["immersion", "angular resolution", "cave automatic virtual environment", "parallax", "meter"], "abstract": "When walking within an immersive projection environment, accommodation distance, parallax and angular resolution vary according to the distance between the user and the projection walls which can influence spatial perception. As CAVE-like virtual environments get bigger, accurate spatial perception within the projection setup becomes increasingly important for application domains that require the user to be able to naturally explore a virtual environment by moving through the physical interaction space. In this paper we describe an experiment which analyzes how distance estimation is biased when the distance to the screen and parallax vary. The experiment was conducted in a large immersive projection setup with up to ten meter interaction space. The results showed that both the screen distance and parallax have a strong asymmetric effect on distance judgments. We found an increased distance underestimation for positive parallax conditions. In contrast, we found less distance overestimation for negative and zero parallax conditions. We conclude the paper discussing the results with view on future large immersive projection environments.", "citation": "Citations (16)", "departments": ["University of Hamburg", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Gerd Bruder.....http://dblp.org/pers/hd/b/Bruder:Gerd", "Fernando Argelaguet Sanz.....http://dblp.org/pers/hd/s/Sanz:Fernando_Argelaguet", "Anne-Hélène Olivier.....http://dblp.org/pers/hd/o/Olivier:Anne=H=eacute=l=egrave=ne", "Anatole Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Anatole"], "conf": "vr", "year": "2015", "pages": 6}