{"title": "Cognitive Modelling for Predicting Examinee Performance.", "fields": ["cognition", "machine learning", "fuzzy set", "artificial intelligence", "fuzzy logic"], "abstract": "Cognitive modelling can discover the latent characteristics of examinees for predicting their performance (i.e. scores) on each problem. As cognitive modelling is important for numerous applications, e.g. personalized remedy recommendation, some solutions have been designed in the literature. However, the problem of extracting information from both objective and subjective problems to get more precise and interpretable cognitive analysis is still underexplored. To this end, we propose a fuzzy cognitive diagnosis framework (Fuzzy CDF) for examinees' cognitive modelling with both objective and subjective problems. Specifically, to handle the partially correct responses on subjective problems, we first fuzzify the skill proficiency of examinees. Then, we combine fuzzy set theory and educational hypotheses to model the examinees' mastery on the problems. Further, we simulate the generation of examination scores by considering both slip and guess factors. Extensive experiments on three real-world datasets prove that FuzzyCDF can predict examinee performance more effectively, and the output of FuzzyCDF is also interpretative.", "citation": "Citations (13)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "Anhui USTC iFLY ... ., Ltd., China"], "authors": ["Run-ze Wu.....http://dblp.org/pers/hd/w/Wu:Run=ze", "Qi Liu.....http://dblp.org/pers/hd/l/Liu_0003:Qi", "Yuping Liu.....http://dblp.org/pers/hd/l/Liu:Yuping", "Enhong Chen.....http://dblp.org/pers/hd/c/Chen:Enhong", "Yu Su.....http://dblp.org/pers/hd/s/Su_0002:Yu", "Zhigang Chen.....http://dblp.org/pers/hd/c/Chen:Zhigang", "Guoping Hu.....http://dblp.org/pers/hd/h/Hu:Guoping"], "conf": "ijcai", "year": "2015", "pages": 8}