{"title": "Revisiting overlapped channels: Efficient broadcast in multi-channel wireless networks.", "fields": ["broadcasting", "network management", "idle", "rendezvous", "communication source"], "abstract": "In wireless networks, broadcasting is a fundamental communication primitive for network management and information sharing. However, in multi-channel networks, the broadcast efficiency is very poor as devices are distributed across various channels. Thus, a sender tries all channels for broadcasting a single message, which causes large overhead. In this paper, we propose a novel scheme for efficient broadcast in multichannel networks. Our scheme leverages the overlapped band, which is the frequency range that partially overlapped channels (i.e., adjacent channels) share within their channel boundaries. Specifically, a sender advertises the rendezvous channel through the overlapped band of adjacent channels; the message sharing via broadcast is done on the rendezvous channel. Our scheme employs Signaling via Overlapped Band (SOB), which defines a new signal processing mechanism for communication via the overlapped band. SOB is integrated with MAC layer mechanisms: 1) Reserve Idle Spectrum Fragment (RISF) to reduce waiting time, 2) Reinforce Switch Notification (RSN) to reduce the residing time at a wrong channel, and 3) Multi-sender Agreement on Rendezvous CHannel (MARCH) to support multisender broadcasts. We implemented our scheme on the SORA platform. Experiment results validated communication through the overlapped band. Intensive simulation studies showed that our scheme drastically outperformed previous approach.", "citation": "Citations (6)", "departments": ["University of California, Los Angeles", "Aichi Institute of Technology", "Seoul National University of Science and Technology", "University of California, Los Angeles"], "authors": ["Jae-Han Lim.....http://dblp.org/pers/hd/l/Lim:Jae=Han", "Katsuhiro Naito.....http://dblp.org/pers/hd/n/Naito:Katsuhiro", "Ji-Hoon Yun.....http://dblp.org/pers/hd/y/Yun:Ji=Hoon", "Mario Gerla.....http://dblp.org/pers/hd/g/Gerla:Mario"], "conf": "infocom", "year": "2015", "pages": 9}