{"title": "THERMAL-JOIN: A Scalable Spatial Join for Dynamic Workloads.", "fields": ["bottleneck", "grid", "speedup", "scalability", "gravitation"], "abstract": "Simulations have become ubiquitous in many domains of science. Today scientists study natural phenomena by first building massive three-dimensional spatial models and then by simulating the models at discrete intervals of time to mimic the behavior of natural phenomena. One frequently occurring challenge during simulations is the repeated computation of spatial self-joins of the model at each simulation time step. The join is performed to access a group of neighboring spatial objects (groups of particles, molecules or cosmological objects) so that scientists can calculate the cumulative effect (like gravitational force) on an object. Computing a self-join even in memory, soon becomes a performance bottleneck in simulation applications. The problem becomes even worse as scientists continue to improve the precision of simulations by increasing the number as well as the size (3D extent) of the objects. This leads to an exponential increase in join selectivity that challenges the performance and scalability of state-of-the-art approaches.   We propose THERMAL-JOIN, a novel spatial self-join algorithm for dynamic memory-resident workloads. The algorithm groups objects in spatial proximity together into hot spots. Hot spots minimize the cost of computing join as objects assigned to a hot spot are guaranteed to overlap with each other. Using a nested spatial grid, THERMAL-JOIN partitions and indexes the dataset to locate hot spots. With experiments we show that our approach provides a speedup between 8 to 12x compared to the state of the art and also scales as scientists improve the precision of their simulations.", "citation": "Citations (6)", "year": "2015", "departments": ["Oracle Corporation", "Imperial College London", "École Polytechnique Fédérale de Lausanne"], "conf": "sigmod", "authors": ["Farhan Tauheed.....http://dblp.org/pers/hd/t/Tauheed:Farhan", "Thomas Heinis.....http://dblp.org/pers/hd/h/Heinis:Thomas", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia"], "pages": 12}