{"title": "CoupledLP: Link Prediction in Coupled Networks.", "fields": ["evolving networks", "network science", "intelligent computer network", "organizational network analysis", "interdependent networks"], "abstract": "We study the problem of link prediction in  coupled networks , where we have the structure information of one (source) network and the interactions between this network and another (target) network. The goal is to predict the missing links in the target network. The problem is extremely challenging as we do not have any information of the target network. Moreover, the source and target networks are usually heterogeneous and have different types of nodes and links. How to utilize the structure information in the source network for predicting links in the target network? How to leverage the heterogeneous interactions between the two networks for the prediction task?   We propose a unified framework, CoupledLP, to solve the problem. Given two coupled networks, we first leverage atomic propagation rules to automatically construct implicit links in the target network for addressing the challenge of target network incompleteness, and then propose a coupled factor graph model to incorporate the meta-paths extracted from the coupled part of the two networks for transferring heterogeneous knowledge. We evaluate the proposed framework on two different genres of datasets: disease-gene (DG) and mobile social networks. In the DG networks, we aim to use the disease network to predict the associations between genes. In the mobile networks, we aim to use the mobile communication network of one mobile operator to infer the network structure of its competitors. On both datasets, the proposed CoupledLP framework outperforms several alternative methods. The proposed problem of coupled link prediction and the corresponding framework demonstrate both the scientific and business applications in biology and social networks.", "citation": "Citations (33)", "departments": ["University of Notre Dame", "Tsinghua University", "Tsinghua University", "University of Notre Dame", "Beijing University of Posts and Telecommunications"], "authors": ["Yuxiao Dong.....http://dblp.org/pers/hd/d/Dong:Yuxiao", "Jing Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Jing", "Jie Tang.....http://dblp.org/pers/hd/t/Tang_0001:Jie", "Nitesh V. Chawla.....http://dblp.org/pers/hd/c/Chawla:Nitesh_V=", "Bai Wang.....http://dblp.org/pers/hd/w/Wang_0001:Bai"], "conf": "kdd", "year": "2015", "pages": 10}