{"title": "TLV: abstraction through testing, learning, and validation.", "fields": ["program analysis", "abstraction", "symbolic execution", "abstraction inversion", "abstraction model checking"], "abstract": "A (Java) class provides a service to its clients (i.e., programs which use the class). The service must satisfy certain specifications. Different specifications might be expected at different levels of abstraction depending on the client's objective. In order to effectively contrast the class against its specifications, whether manually or automatically, one essential step is to automatically construct an abstraction of the given class at a proper level of abstraction. The abstraction should be correct (i.e., over-approximating) and accurate (i.e., with few spurious traces). We present an automatic approach, which combines testing, learning, and validation, to constructing an abstraction. Our approach is designed such that a large part of the abstraction is generated based on testing and learning so as to minimize the use of heavy-weight techniques like symbolic execution. The abstraction is generated through a process of abstraction/refinement, with no user input, and converges to a specific level of abstraction depending on the usage context. The generated abstraction is guaranteed to be correct and accurate. We have implemented the proposed approach in a toolkit named TLV and evaluated TLV with a number of benchmark programs as well as three real-world ones. The results show that TLV generates abstraction for program analysis and verification more efficiently.", "citation": "Citations (8)", "departments": ["Singapore University of Technology and Design", "Nanyang Technological University", "Nanyang Technological University", "Singapore University of Technology and Design", "Shenzhen University"], "authors": ["Jun Sun.....http://dblp.org/pers/hd/s/Sun_0001:Jun", "Hao Xiao.....http://dblp.org/pers/hd/x/Xiao:Hao", "Yang Liu.....http://dblp.org/pers/hd/l/Liu_0003:Yang", "Shang-Wei Lin.....http://dblp.org/pers/hd/l/Lin:Shang=Wei", "Shengchao Qin.....http://dblp.org/pers/hd/q/Qin:Shengchao"], "conf": "sigsoft", "year": "2015", "pages": 12}