{"title": "Where to Go on Your Next Trip?: Optimizing Travel Destinations Based on User Preferences.", "fields": ["naive bayes classifier", "ranking", "information retrieval", "data mining", "destinations"], "abstract": "Recommendation based on user preferences is a common task for e-commerce websites. New recommendation algorithms are often evaluated by offline comparison to baseline algorithms such as recommending random or the most popular items. Here, we investigate how these algorithms themselves perform and compare to the operational production system in large scale online experiments in a real-world application. Specifically, we focus on recommending travel destinations at Booking.com, a major online travel site, to users searching for their preferred vacation activities. To build ranking models we use multi-criteria rating data provided by previous users after their stay at a destination. We implement three methods and compare them to the current baseline in Booking.com: random, most popular, and Naive Bayes. Our general conclusion is that, in an online A/B test with live users, our Naive-Bayes based ranker increased user engagement significantly over the current online system.", "citation": "Citations (4)", "departments": ["Eindhoven University of Technology", "Booking.com, Am ... am, Netherlands", "Booking.com, Am ... am, Netherlands", "Booking.com, Am ... am, Netherlands", "Booking.com, Am ... am, Netherlands"], "authors": ["Julia Kiseleva.....http://dblp.org/pers/hd/k/Kiseleva:Julia", "Melanie J. I. Müller.....http://dblp.org/pers/hd/m/M=uuml=ller:Melanie_J=_I=", "Lucas Bernardi.....http://dblp.org/pers/hd/b/Bernardi:Lucas", "Chad Davis.....http://dblp.org/pers/hd/d/Davis:Chad", "Ivan Kovacek.....http://dblp.org/pers/hd/k/Kovacek:Ivan", "Mats Stafseng Einarsen.....http://dblp.org/pers/hd/e/Einarsen:Mats_Stafseng", "Jaap Kamps.....http://dblp.org/pers/hd/k/Kamps:Jaap", "Alexander Tuzhilin.....http://dblp.org/pers/hd/t/Tuzhilin:Alexander", "Djoerd Hiemstra.....http://dblp.org/pers/hd/h/Hiemstra:Djoerd"], "conf": "sigir", "year": "2015", "pages": 4}