{"title": "Graph-Aware, Workload-Adaptive SPARQL Query Caching.", "fields": ["rdf query language", "rdf xml", "rdf schema", "named graph", "sparql"], "abstract": "The pace at which data is described, queried and exchanged using the RDF specification has been ever increasing with the proliferation of Semantic Web. Minimizing SPARQL query response times has been an open issue for the plethora of RDF stores, yet SPARQL result caching techniques have not been extensively utilized. In this work we present a novel system that addresses graph-based, workload-adaptive indexing of large RDF graphs by caching SPARQL query results. At the heart of the system lies a SPARQL query canonical labelling algorithm that is used to uniquely index and reference SPARQL query graphs as well as their isomorphic forms. We integrate our canonical labelling algorithm with a dynamic programming planner in order to generate the optimal join execution plan, examining the utilization of both primitive triple indexes and cached query results. By monitoring cache requests, our system is able to identify and cache SPARQL queries that, even if not explicitly issued, greatly reduce the average response time of a workload. The proposed cache is modular in design, allowing integration with different RDF stores. Incorporating it to an open-source, distributed RDF engine that handles large scale RDF datasets, we prove that workload-adaptive caching can reduce average response times by up to two orders of magnitude and offer interactive response times for complex workloads and huge RDF datasets.", "citation": "Citations (16)", "year": "2015", "departments": ["National Technical University of Athens", "Ionian University", "Skolkovo Institute of Science and Technology", "National Technical University of Athens"], "conf": "sigmod", "authors": ["Nikolaos Papailiou.....http://dblp.org/pers/hd/p/Papailiou:Nikolaos", "Dimitrios Tsoumakos.....http://dblp.org/pers/hd/t/Tsoumakos:Dimitrios", "Panagiotis Karras.....http://dblp.org/pers/hd/k/Karras:Panagiotis", "Nectarios Koziris.....http://dblp.org/pers/hd/k/Koziris:Nectarios"], "pages": 16}