{"title": "Efficient ConvNet-based marker-less motion capture in general scenes with a low number of cameras.", "fields": ["articulated body pose estimation", "match moving", "discriminative model", "pose", "3d pose estimation"], "abstract": "We present a novel method for accurate marker-less capture of articulated skeleton motion of several subjects in general scenes, indoors and outdoors, even from input filmed with as few as two cameras. Our approach unites a discriminative image-based joint detection method with a model-based generative motion tracking algorithm through a combined pose optimization energy. The discriminative part-based pose detection method, implemented using Convolutional Networks (ConvNet), estimates unary potentials for each joint of a kinematic skeleton model. These unary potentials are used to probabilistically extract pose constraints for tracking by using weighted sampling from a pose posterior guided by the model. In the final energy, these constraints are combined with an appearance-based model-to-image similarity term. Poses can be computed very efficiently using iterative local optimization, as ConvNet detection is fast, and our formulation yields a combined pose estimation energy with analytic derivatives. In combination, this enables to track full articulated joint angles at state-of-the-art accuracy and temporal stability with a very low number of cameras.", "citation": "Citations (60)", "year": "2015", "departments": ["New York University", "New York University", "MPI Informatics ... rücken, Germany", "MPI Informatics ... rücken, Germany", "MPI Informatics ... rücken, Germany"], "conf": "cvpr", "authors": ["A. Elhayek.....http://dblp.org/pers/hd/e/Elhayek:A=", "Edilson de Aguiar.....http://dblp.org/pers/hd/a/Aguiar:Edilson_de", "Arjun Jain.....http://dblp.org/pers/hd/j/Jain:Arjun", "Jonathan Tompson.....http://dblp.org/pers/hd/t/Tompson:Jonathan", "Leonid Pishchulin.....http://dblp.org/pers/hd/p/Pishchulin:Leonid", "Mykhaylo Andriluka.....http://dblp.org/pers/hd/a/Andriluka:Mykhaylo", "Christoph Bregler.....http://dblp.org/pers/hd/b/Bregler:Christoph", "Bernt Schiele.....http://dblp.org/pers/hd/s/Schiele:Bernt", "Christian Theobalt.....http://dblp.org/pers/hd/t/Theobalt:Christian"], "pages": 9}