{"title": "Updating Graph Indices with a One-Pass Algorithm.", "fields": ["strength of a graph", "graph bandwidth", "windmill graph", "simplex graph", "factor critical graph"], "abstract": "Indices are commonly built into graph databases in order to support fast searches. Any given graph database and the distribution of queries will change over time. Therefore, the cost of processing queries using a static graph index increases because the index is built to optimize old snapshots of the database. There is growing research interest in determining how to update a graph index with the purpose of adapting to database and query changes. Updating features in a graph index is typically an NP-hard problem. In addition, because the features are chosen from a large number of frequent subgraphs, a multi-pass algorithm is not scalable to big datasets. In order to address this issue, we propose a time-efficient  one-pass algorithm  that is designed to update a graph index by scanning each frequent subgraph at most once. The algorithm replaces a feature with a new subgraph if the latter is ``better\" than the former one. We use the branch and bound technique to skip subgraphs that cannot outperform any of the features in the graph index. We further use a decomposed index and reduce the space complexity from  O(|G||Q|)  to  O(|G| + |Q|) , where  G  is database graphs and  Q  is a query workload. Through the empirical study, we show that the one-pass algorithm is 5--100 times faster than all previous algorithms for updating graph indices. In addition, the one-pass algorithm guarantees the return of a close to optimum solution. Our experiments show that when the one-pass algorithm is used to update an index, the query-processing speed is $1$--$2$ times faster than that of other cutting-edge indices, i.e., the FGindex and the gIndex.", "citation": "Citations (4)", "year": "2015", "departments": ["Pennsylvania State University", "Qatar Airways", "Pennsylvania State University", "Pennsylvania State University"], "conf": "sigmod", "authors": ["Dayu Yuan.....http://dblp.org/pers/hd/y/Yuan:Dayu", "Prasenjit Mitra.....http://dblp.org/pers/hd/m/Mitra:Prasenjit", "Huiwen Yu.....http://dblp.org/pers/hd/y/Yu:Huiwen", "C. Lee Giles.....http://dblp.org/pers/hd/g/Giles:C=_Lee"], "pages": 14}