{"title": "When Relevance Judgement is Happening?: An EEG-based Study.", "fields": ["judgement", "operational definition", "repeated measures design", "electroencephalography", "information retrieval"], "abstract": "Relevance is a central notion in Information Retrieval, but it is considered to be a difficult concept to define. We analyse brain signals for the first 800 milliseconds (ms) of a relevance assessment process to answer the question \"when relevance is happening in the brain?\" with the belief that it will lead to better operational definitions of relevance. For this purpose, we devised a user study in which we captured the brain response of 20 participants. Using a 64-channel EEG device, we measured the electrophysiological activity of the brain while the subjects were in the phase of giving an explicit judgement about the relevance of presented images according to a given topic. Analyses were then performed over different time windows of the recorded EEG signals using repeated measures ANOVA. Data reveal significant variation between relevance and non-relevance within the EEG signals from the presentation of the image to 800 milliseconds afterwards. At an early stage these differences were located at frontal and posterior electrode sites. However, at later stages these differences were located in central, centro-parietal and centro-frontal areas.Our findings are an important step towards (i) a better understanding of the concept of relevance and (ii) a more effective implicit feedback systems.", "citation": "Citations (5)", "departments": ["University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow", "Mitech Srl, Mantova, Italy"], "authors": ["Marco Allegretti.....http://dblp.org/pers/hd/a/Allegretti:Marco", "Yashar Moshfeghi.....http://dblp.org/pers/hd/m/Moshfeghi:Yashar", "Maria Hadjigeorgieva.....http://dblp.org/pers/hd/h/Hadjigeorgieva:Maria", "Frank E. Pollick.....http://dblp.org/pers/hd/p/Pollick:Frank_E=", "Joemon M. Jose.....http://dblp.org/pers/hd/j/Jose:Joemon_M=", "Gabriella Pasi.....http://dblp.org/pers/hd/p/Pasi:Gabriella"], "conf": "sigir", "year": "2015", "pages": 4}