{"title": "Faster R-CNN: Towards Real-Time Object Detection with Region Proposal Networks.", "fields": ["frame rate", "deep learning", "convolutional neural network", "resnet", "machine learning", "object detection", "computation", "coco", "bottleneck", "convolutional code"], "abstract": "State-of-the-art object detection networks depend on region proposal algorithms to hypothesize object locations. Advances like SPPnet  [1]  and Fast R-CNN  [2]  have reduced the running time of these detection networks, exposing region proposal computation as a bottleneck. In this work, we introduce a  Region Proposal Network  (RPN) that shares full-image convolutional features with the detection network, thus enabling nearly cost-free region proposals. An RPN is a fully convolutional network that simultaneously predicts object bounds and objectness scores at each position. The RPN is trained end-to-end to generate high-quality region proposals, which are used by Fast R-CNN for detection. We further merge RPN and Fast R-CNN into a single network by sharing their convolutional features—using the recently popular terminology of neural networks with ’attention’ mechanisms, the RPN component tells the unified network where to look. For the very deep VGG-16 model  [3]  , our detection system has a frame rate of 5 fps ( including all steps ) on a GPU, while achieving state-of-the-art object detection accuracy on PASCAL VOC 2007, 2012, and MS COCO datasets with only 300 proposals per image. In ILSVRC and COCO 2015 competitions, Faster R-CNN and RPN are the foundations of the 1st-place winning entries in several tracks. Code has been made publicly available.", "citation": "Citations (2,412)", "year": "2015", "departments": ["University of Science and Technology of China", "Microsoft", "Facebook", "Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "nips", "authors": ["Shaoqing Ren.....http://dblp.org/pers/hd/r/Ren:Shaoqing", "Kaiming He.....http://dblp.org/pers/hd/h/He:Kaiming", "Ross B. Girshick.....http://dblp.org/pers/hd/g/Girshick:Ross_B=", "Jian Sun.....http://dblp.org/pers/hd/s/Sun_0001:Jian"], "pages": 9}