{"title": "Feature extraction on digital snow microstructures.", "fields": ["kernel", "estimator", "laplacian matrix", "principal curvature", "mean curvature flow"], "abstract": "During a snowfall, the snow crystals accumulate on the ground and gradually form a complex porous medium constituted of air, water vapour, ice and sometimes liquid water. This ground-lying snow transforms with time, depending on the physical parameters of the environment. The main purpose of the digitalSnow project is to provide efficient computational tools to study the metamorphism of real snow microstructures from 3D images acquired using X tomography techniques. We design 3D image-based numerical models than can simulate the shape evolution of the snow microstructure during its metamorphism. As a key measurement, (mean) curvature of snow microstructure boundary plays a crucial role in metamorphosis equations (mostly driven by mean curvature flow). In our previous work, we have proposed robust 2D curvature and 3D mean and principal curvatures estimators using  integral invariants . In short, curvature quantities are estimated using a spherical convolution kernel with given radius  R  applied on point surfaces [Coeurjolly et al. 2014]. The specific aspect of these estimators is that they are defined on (isothetic) digital surfaces (boundary of shape in  Z  3 ). Tailored for this digital model, these estimators allow us to mathematically prove their multigrid convergence,  i.e.  for a class of mathematical shapes ( e.g. C  3 -boundary and bounded positive curvature), the estimated quantity converges to the underlying Euclidean one when shapes are digitized on grids with gridstep tending to zero. In this work, we propose to use the radius  R  of our curvature estimators as a scale-space parameter to extract features on digital shapes. Many feature estimators exist in the literature, either on point clouds or meshes (\" ridge-valley \", threshold on principal curvatures, spectral analysis from Laplacian matrix eigenvalues, . . . ). In the context of objects in  Z  3  and using our robust curvature estimator, we define a new feature extraction approach on which theoretical results can be proven in the  multigrid framework.", "citation": "Not cited", "departments": ["University of S ... e, Lama, France", "University of S ... e, Lama, France", "University of S ... e, Lama, France"], "authors": ["Jérémy Levallois.....http://dblp.org/pers/hd/l/Levallois:J=eacute=r=eacute=my", "David Coeurjolly.....http://dblp.org/pers/hd/c/Coeurjolly:David", "Jacques-Olivier Lachaud.....http://dblp.org/pers/hd/l/Lachaud:Jacques=Olivier"], "conf": "siggraph", "year": "2015", "pages": 1}