{"title": "On Statistical Analysis of Neuroimages with Imperfect Registration.", "fields": ["harmonic analysis", "voxel", "statistical inference", "statistical power", "invariant"], "abstract": "A variety of studies in neuroscience/neuroimaging seek to perform statistical inference on the acquired brain image scans for diagnosis as well as understanding the pathological manifestation of diseases. To do so, an important first step is to register (or co-register) all of the image data into a common coordinate system. This permits meaningful comparison of the intensities at each voxel across groups (e.g., diseased versus healthy) to evaluate the effects of the disease and/or use machine learning algorithms in a subsequent step. But errors in the underlying registration make this problematic, they either decrease the statistical power or make the follow-up inference tasks less effective/accurate. In this paper, we derive a novel algorithm which offers immunity to local errors in the underlying deformation field obtained from registration procedures. By deriving a deformation invariant representation of the image, the downstream analysis can be made more robust as if one had access to a (hypothetical) far superior registration procedure. Our algorithm is based on recent work on Scattering coefficients. Using this as a starting point, we show how results from harmonic analysis (especially, non-Euclidean wavelets) yields strategies for designing deformation and additive noise invariant representations of large 3-D brain image volumes. We present a set of results on synthetic and real brain images where we achieve robust statistical analysis even in the presence of substantial deformation errors, here, standard analysis procedures significantly under-perform and fail to identify the true signal.", "citation": "Not cited", "year": "2015", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "conf": "iccv", "authors": ["Won Hwa Kim.....http://dblp.org/pers/hd/k/Kim:Won_Hwa", "Sathya N. Ravi.....http://dblp.org/pers/hd/r/Ravi:Sathya_N=", "Sterling C. Johnson.....http://dblp.org/pers/hd/j/Johnson:Sterling_C=", "Ozioma C. Okonkwo.....http://dblp.org/pers/hd/o/Okonkwo:Ozioma_C=", "Vikas Singh.....http://dblp.org/pers/hd/s/Singh:Vikas"], "pages": 9}