{"title": "Topic-centric Classification of Twitter User's Political Orientation.", "fields": ["biology and political orientation", "independence referendum", "voting", "topic model", "classifier"], "abstract": "In the recent Scottish Independence Referendum (hereafter, IndyRef), Twitter offered a broad platform for people to express their opinions, with millions of IndyRef tweets posted over the campaign period. In this paper, we aim to classify people's voting intentions by the content of their tweets---their short messages communicated on Twitter. By observing tweets related to the IndyRef, we find that people not only discussed the vote, but raised topics related to an independent Scotland including oil reserves, currency, nuclear weapons, and national debt. We show that the views communicated on these topics can inform us of the individuals' voting intentions (\"Yes\"--in favour of Independence vs. \"No\"--Opposed). In particular, we argue that an accurate classifier can be designed by leveraging the differences in the features' usage across different topics related to voting intentions. We demonstrate improvements upon a Naive Bayesian classifier using the topics enrichment method. Our new classifier identifies the closest topic for each unseen tweet, based on those topics identified in the training data. Our experiments show that our Topics-Based Naive Bayesian classifier improves accuracy by 7.8% over the classical Naive Bayesian baseline.", "citation": "Not cited", "departments": ["University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow", "University of Glasgow"], "authors": ["Anjie Fang.....http://dblp.org/pers/hd/f/Fang:Anjie", "Iadh Ounis.....http://dblp.org/pers/hd/o/Ounis:Iadh", "Philip Habel.....http://dblp.org/pers/hd/h/Habel:Philip", "Craig Macdonald.....http://dblp.org/pers/hd/m/Macdonald:Craig", "Nut Limsopatham.....http://dblp.org/pers/hd/l/Limsopatham:Nut"], "conf": "sigir", "year": "2015", "pages": 4}