{"title": "From Complexity to Algebra and Back: Digraph Classes, Collapsibility, and the PGP.", "fields": ["exponential growth", "clone", "singleton", "algebraic number", "constraint satisfaction problem"], "abstract": "Inspired by computational complexity results for the quantified constraint satisfaction problem, we study the clones of idem potent polymorphisms of certain digraph classes. Our first results are two algebraic dichotomy, even \"gap\", theorems. Building on and extending [Martin CP'11], we prove that partially reflexive paths bequeath a set of idem potent polymorphisms whose associated clone algebra has: either the polynomially generated powers property (PGP), or the exponentially generated powers property (EGP). Similarly, we build on [DaMM ICALP'14] to prove that semi complete digraphs have the same property. These gap theorems are further motivated by new evidence that PGP could be the algebraic explanation that a QCSP is in NP even for unbounded alternation. Along the way we also effect a study of a concrete form of PGP known as collapsibility, tying together the algebraic and structural threads from [Chen Sicomp'08], and show that collapsibility is equivalent to its Pi2-restriction. We also give a decision procedure for k-collapsibility from a singleton source of a finite structure (a form of collapsibility which covers all known examples of PGP for finite structures). Finally, we present a new QCSP trichotomy result, for partially reflexive paths with constants. Without constants it is known these QCSPs are either in NL or Pspace-complete [Martin CP'11], but we prove that with constants they attain the three complexities NL, NP-complete and Pspace-complete.", "citation": "Citations (4)", "departments": ["University of Hertfordshire", "Middlesex University", "GREYC, Univ. de ... rmandie, France"], "authors": ["Catarina Carvalho.....http://dblp.org/pers/hd/c/Carvalho:Catarina", "Florent R. Madelaine.....http://dblp.org/pers/hd/m/Madelaine:Florent_R=", "Barnaby Martin.....http://dblp.org/pers/hd/m/Martin:Barnaby"], "conf": "lics", "year": "2015", "pages": 13}