{"title": "Making System User Interactive Tests Repeatable: When and What Should We Control?", "fields": ["humanoid robot", "system testing", "source lines of code", "invariant", "oracle", "test case", "android", "code coverage", "benchmarking"], "abstract": "System testing and invariant detection is usually conducted from the user interface perspective when the goal is to evaluate the behavior of an application as a whole. A large number of tools and techniques have been developed to generate and automate this process, many of which have been evaluated in the literature or internally within companies. Typical metrics for determining effectiveness of these techniques include code coverage and fault detection, however, with the assumption that there is determinism in the resulting outputs. In this paper we examine the extent to which a common set of factors such as the system platform, Java version, application starting state and tool harness configurations impact these metrics. We examine three layers of testing outputs: the code layer, the behavioral (or invariant) layer and the external (or user interaction) layer. In a study using five open source applications across three operating system platforms, manipulating several factors, we observe as many as 184 lines of code coverage difference between runs using the same test cases, and up to 96 percent false positives with respect to fault detection. We also see some a small variation among the invariants inferred. Despite our best efforts, we can reduce, but not completely eliminate all possible variation in the output. We use our findings to provide a set of best practices that should lead to better consistency and smaller differences in test outcomes, allowing more repeatable and reliable testing and experimentation.", "citation": "Not cited", "departments": ["University of Maryland, College Park", "University of Nebraska–Lincoln", "University of Nebraska–Lincoln", "University of Maryland, College Park", "University of Nebraska–Lincoln", "University of Maryland, College Park"], "authors": ["Zebao Gao.....http://dblp.org/pers/hd/g/Gao:Zebao", "Yalan Liang.....http://dblp.org/pers/hd/l/Liang:Yalan", "Myra B. Cohen.....http://dblp.org/pers/hd/c/Cohen:Myra_B=", "Atif M. Memon.....http://dblp.org/pers/hd/m/Memon:Atif_M=", "Zhen Wang.....http://dblp.org/pers/hd/w/Wang:Zhen"], "conf": "icse", "year": "2015", "pages": 11}