{"title": "Boosting GPU Virtualization Performance with Hybrid Shadow Page Tables.", "fields": ["hypervisor", "shadow", "page table", "transcoding", "virtualization"], "abstract": "The increasing adoption of Graphic Process Unit (GPU) to computation-intensive workloads has stimulated a new computing paradigm called GPU cloud (e.g., Amazon's GPU Cloud), which necessitates the sharing of GPU resources to multiple tenants in a cloud. However, state-of-the-art GPU virtualization techniques such as gVirt still suffer from non-trivial performance overhead for graphics memory-intensive workloads involving frequent page table updates.\n\nTo understand such overhead, this paper first presents GMedia, a media benchmark, and uses it to analyze the causes of such overhead. Our analysis shows that frequent updates to guest VM's page tables causes excessive updates to the shadow page table in the hypervisor, due to the need to guarantee the consistency between guest page table and shadow page table. To this end, this paper proposes gHyvi, an optimized GPU virtualization scheme based on gVirt, which uses adaptive hybrid page table shadowing that combines strict and relaxed page table schemes. By significantly reducing trap-and-emulation due to page table updates, gHyvi significantly improves gVirt's performance for memory-intensive GPU workloads. Evaluation using GMedia shows that gHyvi can achieve up to 13× performance improvement compared to gVirt, and up to 85% native performance for multithread media transcoding.", "citation": "Citations (11)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Intel", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Yaozu Dong.....http://dblp.org/pers/hd/d/Dong:Yaozu", "Mochi Xue.....http://dblp.org/pers/hd/x/Xue:Mochi", "Xiao Zheng.....http://dblp.org/pers/hd/z/Zheng:Xiao", "Jiajun Wang.....http://dblp.org/pers/hd/w/Wang:Jiajun", "Zhengwei Qi.....http://dblp.org/pers/hd/q/Qi:Zhengwei", "Haibing Guan.....http://dblp.org/pers/hd/g/Guan:Haibing"], "conf": "usenix", "year": "2015", "pages": 12}