{"title": "Monadic Second-Order Logic and Bisimulation Invariance for Coalgebras.", "fields": ["monad", "algebraic semantics", "monadic predicate calculus", "bisimulation", "coalgebra"], "abstract": "Generalizing standard monadic second-order logic for Kripke models, we introduce monadic second-order logic MSO(T) interpreted over co algebras for an arbitrary set functor T. Similar to well-known results for monadic second-order logic over trees, we provide a translation of this logic into a class of automata, relative to the class of T-co algebras that admit a tree-like supporting Kripke frame. We then consider invariance under behavioral equivalence of MSO(T)-formulas, more in particular, we investigate whether the co algebraic mu-calculus is the bisimulation-invariant fragment of MSO(T). Building on recent results by the third author we show that in order to provide such a co algebraic generalization of the Janin-Walukiewicz Theorem, it suffices to find what we call an adequate uniform construction for the functor T. As applications of this result we obtain a partly new proof of the Janin-Walukiewicz Theorem, and bisimulation invariance results for the bag functor (graded modal logic) and all exponential polynomial functors. Finally, we consider in some detail the monotone neighborhood functor M, which provides co algebraic semantics for monotone modal logic. It turns out that there is no adequate uniform construction for M, whence the automata-theoretic approach towards bisimulation invariance does not apply directly. This problem can be overcome if we consider global bisimulations between neighborhood models: one of our main results provides a characterization of the monotone modal mu-calculus extended with the global modalities, as the fragment of monadic second order logic for the monotone neighborhood functor that is invariant for global bisimulations.", "citation": "Citations (3)", "departments": ["University of Amsterdam", "University of Amsterdam", "Theoretical Philosophy"], "authors": ["Sebastian Enqvist.....http://dblp.org/pers/hd/e/Enqvist:Sebastian", "Fatemeh Seifan.....http://dblp.org/pers/hd/s/Seifan:Fatemeh", "Yde Venema.....http://dblp.org/pers/hd/v/Venema:Yde"], "conf": "lics", "year": "2015", "pages": 13}