{"title": "The Importance of Being Expert: Efficient Max-Finding in Crowdsourcing.", "fields": ["crowdsourcing", "wisdom of the crowd", "psychometrics", "computation", "distinctive feature"], "abstract": "Crowdsourcing is a computational paradigm whose distinctive feature is the involvement of human workers in key steps of the computation. It is used successfully to address problems that would be hard or impossible to solve for machines. As we highlight in this work, the exclusive use of nonexpert individuals may prove ineffective in some cases, especially when the task at hand or the need for accurate solutions demand some degree of specialization to avoid excessive uncertainty and inconsistency in the answers. We address this limitation by proposing an approach that combines the wisdom of the crowd with the educated opinion of experts. We present a computational model for crowdsourcing that envisions two classes of workers with different expertise levels. One of its distinctive features is the adoption of the threshold error model, whose roots are in psychometrics and which we extend from previous theoretical work. Our computational model allows to evaluate the performance of crowdsourcing algorithms with respect to accuracy and cost. We use our model to develop and analyze an algorithm for approximating the best, in a broad sense, of a set of elements. The algorithm uses naive and expert workers to find an element that is a constant-factor approximation to the best. We prove upper and lower bounds on the number of comparisons needed to solve this problem, showing that our algorithm uses  expert  and  naive  workers optimally up to a constant factor. Finally, we evaluate our algorithm on real and synthetic datasets using the CrowdFlower crowdsourcing platform, showing that our approach is also effective in practice.", "citation": "Citations (7)", "year": "2015", "departments": ["Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome", "Max Planck Society", "Stanford University"], "conf": "sigmod", "authors": ["Aris Anagnostopoulos.....http://dblp.org/pers/hd/a/Anagnostopoulos:Aris", "Luca Becchetti.....http://dblp.org/pers/hd/b/Becchetti:Luca", "Adriano Fazzone.....http://dblp.org/pers/hd/f/Fazzone:Adriano", "Ida Mele.....http://dblp.org/pers/hd/m/Mele:Ida", "Matteo Riondato.....http://dblp.org/pers/hd/r/Riondato:Matteo"], "pages": 16}