{"title": "TSearch: Target-oriented low-delay node searching in DTNs with social network properties.", "fields": ["tracing", "computer science", "distributed computing", "social network", "computer network"], "abstract": "Node searching in delay tolerant networks (DTNs) is of great importance for different applications, in which a locator node finds a target node in person. In the previous distributed node searching method, a locator traces the target along its movement path from its most frequently visited location. For this purpose, nodes leave traces during their movements and also store their long-term movement patterns in their frequently visited locations (i.e., preferred locations). However, such tracing leads to a long delay and high overhead on the locator by longdistance moving. Our trace data study confirms these problems and provides foundation of our design of a new node searching method, called target-oriented method (TSearch). By leveraging social network properties, TSearch aims to enable a locator to directly move towards the target. Nodes create encounter records (ERs) indicating the locations and times of their encounters and make the ERs easily accessible by locators through message exchanges or a hierarchical structure. In node searching, a locator follows the target's latest ER, the latest ERs of its friends (i.e., frequently meeting nodes), and its preferred locations in order. Extensive trace-driven and real-world experiments show that TSearch achieves significantly higher success rate and lower delay in node searching compared with previous methods.", "citation": "Not cited", "departments": ["Clemson University", "Clemson University", "Clemson University", "Clemson University", "Clemson University", "Clemson University"], "authors": ["Li Yan.....http://dblp.org/pers/hd/y/Yan_0004:Li", "Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Kang Chen.....http://dblp.org/pers/hd/c/Chen:Kang"], "conf": "infocom", "year": "2015", "pages": 9}