{"title": "Bits and coins: Supporting collaborative consumption of mobile internet.", "fields": ["internet access", "mobile broadband", "sharing economy", "software defined networking", "mobile search"], "abstract": "The recent mobile data explosion has increased the interest for mobile user-provided networks (MUPNs), where users share their Internet access by exploiting the diversity in their needs and resource availability. Although promising, MUPNs raise unique challenges. Namely, the success of such services relies on user participation which in turn can be achieved on the basis of a fair and efficient resource (i.e., Internet access and battery energy) exchange policy. The latter should be devised and imposed in a very fast time scale, based on near real-time feedback from mobile users regarding their needs, resources, and network conditions that are rapidly changing. To address these challenges we design and implement a novel cloud-controlled MUPN system, that employs software defined networking support on mobile terminals, to dynamically apply data forwarding policies with adaptive flow-control. We devise these policies by solving a coalitional game that is played among the users. We prove that the game has a non-empty core and hence the solution, which determines the servicing policy, incentivizes the users to participate. Finally, we evaluate the performance of the service in a prototype, where we investigate its performance limits, quantify the implementation overheads, and justify our architecture design choices.", "citation": "Citations (15)", "departments": ["Yale University", "Center for Tech ...  Hellas, Greece", "Center for Tech ...  Hellas, Greece", "Center for Tech ...  Hellas, Greece", "Center for Tech ...  Hellas, Greece"], "authors": ["Dimitris Syrivelis.....http://dblp.org/pers/hd/s/Syrivelis:Dimitris", "George Iosifidis.....http://dblp.org/pers/hd/i/Iosifidis:George", "Dimosthenis Delimpasis.....http://dblp.org/pers/hd/d/Delimpasis:Dimosthenis", "Konstantinos Chounos.....http://dblp.org/pers/hd/c/Chounos:Konstantinos", "Thanasis Korakis.....http://dblp.org/pers/hd/k/Korakis:Thanasis", "Leandros Tassiulas.....http://dblp.org/pers/hd/t/Tassiulas:Leandros"], "conf": "infocom", "year": "2015", "pages": 9}