{"title": "Influence-Driven Model for Time Series Prediction from Partial Observations.", "fields": ["mean squared prediction error", "machine learning", "real time data", "time series", "limiting"], "abstract": "Applications in sustainability domains such as in energy, transportation, and natural resource and environment monitoring, increasingly use sensors for collecting data and sending it back to centrally located processing nodes. While data can usually be collected by the sensors at a very high speed, in many cases, it can not be sent back to central nodes at a frequency that is required for fast and real-time modeling and decision-making. This may be due to physical limitations of the transmission networks, or due to consumers limiting frequent transmission of data from sensors located at their premises for security and privacy concerns. We propose a novel solution to the problem of making short term predictions in absence of real-time data from sensors. A key implication of our work is that by using real-time data from only a small subset of influential sensors, we are able to make predictions for all sensors. We evaluated our approach with a large real-world electricity consumption data collected from smart meters in Los Angeles and the results show that between prediction horizons of 2 to 8 hours, despite lack of real time data, our influence model outperforms the baseline model that uses real-time data. Also, when using partial real-time data from only ≈ 7% influential smart meters, we witness prediction error increase by only ≈ 0.5% over the baseline, thus demonstrating the usefulness of our method for practical scenarios.", "citation": "Citations (6)", "departments": ["University of Southern California", "University of Southern California", "University of Southern California"], "authors": ["Saima Aman.....http://dblp.org/pers/hd/a/Aman:Saima", "Charalampos Chelmis.....http://dblp.org/pers/hd/c/Chelmis:Charalampos", "Viktor K. Prasanna.....http://dblp.org/pers/hd/p/Prasanna:Viktor_K="], "conf": "aaai", "year": "2015", "pages": 7}