{"title": "Scalable and efficient implementation of 3d unstructured meshes computation: a case study on matrix assembly.", "fields": ["xeon", "domain decomposition methods", "massively parallel", "distributed memory", "xeon phi"], "abstract": "Exposing massive parallelism on 3D unstructured meshes computation with efficient load balancing and minimal synchronizations is challenging. Current approaches relying on domain decomposition and mesh coloring struggle to scale with the increasing number of cores per nodes, especially with new many-core processors. In this paper, we propose an hybrid approach using domain decomposition to exploit distributed memory parallelism, Divide-and-Conquer, D&C, to exploit shared memory parallelism and improve locality, and mesh coloring at core level to exploit vectors. It illustrates a new trade-off for many-cores between structuredness, memory locality, and vectorization. We evaluate our approach on the finite element matrix assembly of an industrial fluid dynamic code developed by Dassault Aviation. We compare our D&C approach to domain decomposition and to mesh coloring. D&C achieves a high parallel efficiency, a good data locality as well as an improved bandwidth usage. It competes on current nodes with the optimized pure MPI version with a minimum 10% speed-up. D&C shows an impressive 319x strong scaling on 512 cores (32 nodes) with only 2000 vertices per core. Finally, the Intel Xeon Phi version has a performance similar to 10 Intel E5-2665 Xeon Sandy Bridge cores and 95% parallel efficiency on the 60 physical cores. Running on 4 Xeon Phi (240 cores), D&C has 92% efficiency on the physical cores and performance similar to 33 Intel E5-2665 Xeon Sandy Bridge cores.", "citation": "Citations (7)", "year": "2015", "departments": ["Dassault Aviation", "University of V ... sailles, France", "University of V ... sailles, France"], "conf": "ppopp", "authors": ["Loïc Thébault.....http://dblp.org/pers/hd/t/Th=eacute=bault:Lo=iuml=c", "Eric Petit.....http://dblp.org/pers/hd/p/Petit:Eric", "Quang Dinh.....http://dblp.org/pers/hd/d/Dinh:Quang"], "pages": 10}