{"title": "Revisiting the Impact of Classification Techniques on the Performance of Defect Prediction Models.", "fields": ["predictive modelling", "software quality assurance", "replicate", "ranging", "multivariate adaptive regression splines"], "abstract": "Defect prediction models help software quality assurance teams to effectively allocate their limited resources to the most defect-prone software modules. A variety of classification techniques have been used to build defect prediction models ranging from simple (e.g., logistic regression) to advanced techniques (e.g., Multivariate Adaptive Regression Splines (MARS)). Surprisingly, recent research on the NASA dataset suggests that the performance of a defect prediction model is not significantly impacted by the classification technique that is used to train it. However, the dataset that is used in the prior study is both: (a) noisy, i.e., contains erroneous entries and (b) biased, i.e., only contains software developed in one setting. Hence, we set out to replicate this prior study in two experimental settings. First, we apply the replicated procedure to the same (known-to-be noisy) NASA dataset, where we derive similar results to the prior study, i.e., the impact that classification techniques have appear to be minimal. Next, we apply the replicated procedure to two new datasets: (a) the cleaned version of the NASA dataset and (b) the PROMISE dataset, which contains open source software developed in a variety of settings (e.g., Apache, GNU). The results in these new datasets show a clear, statistically distinct separation of groups of techniques, i.e., the choice of classification technique has an impact on the performance of defect prediction models. Indeed, contrary to earlier research, our results suggest that some classification techniques tend to produce defect prediction models that outperform others.", "citation": "Citations (119)", "departments": ["Queen's University", "Queen's University", "Queen's University"], "authors": ["Baljinder Ghotra.....http://dblp.org/pers/hd/g/Ghotra:Baljinder", "Shane McIntosh.....http://dblp.org/pers/hd/m/McIntosh:Shane", "Ahmed E. Hassan.....http://dblp.org/pers/hd/h/Hassan:Ahmed_E="], "conf": "icse", "year": "2015", "pages": 12}