{"title": "Regularity Preserving but Not Reflecting Encodings.", "fields": ["nested word", "recursive set", "countable set", "quantum finite automata", "computable function"], "abstract": "Encodings, that is, injective functions from words to words, have been studied extensively in several settings. In computability theory the notion of encoding is crucial for defining computability on arbitrary domains, as well as for comparing the power of models of computation. In language theory much attention has been devoted to regularity preserving functions. A natural question arising in these contexts is: Is there a bijective encoding such that its image function preserves regularity of languages, but its pre-image function does not? Our main result answers this question in the affirmative: For every countable class C of languages there exists a bijective encoding f such that for every language L a#x220A; C its image f[L] is regular. Our construction of such encodings has several noteworthy consequences. Firstly, anomalies arise when models of computation are compared with respect to a known concept of implementation that is based on encodings which are not required to be computable: Every countable decision model can be implemented, in this sense, by finite-state automata, even via bijective encodings. Hence deterministic finite-state automata would be equally powerful as Turing machine deciders. A second consequence concerns the recognizability of sets of natural numbers via number representations and finite automata. A set of numbers is said to be recognizable with respect to a representation if an automaton accepts the language of representations. Our result entails that there is one number representation with respect to which every recursive set is recognizable.", "citation": "Citations (1)", "departments": ["VU University Amsterdam", "VU University Amsterdam", "VU University Amsterdam"], "authors": ["Jörg Endrullis.....http://dblp.org/pers/hd/e/Endrullis:J=ouml=rg", "Clemens Grabmayer.....http://dblp.org/pers/hd/g/Grabmayer:Clemens", "Dimitri Hendriks.....http://dblp.org/pers/hd/h/Hendriks:Dimitri"], "conf": "lics", "year": "2015", "pages": 12}