{"title": "CodeRepair: PHY-layer partial packet recovery without the pain.", "fields": ["network packet", "bit error rate", "small number", "goodput", "convolutional code"], "abstract": "Prior studies show that repairing partially corrupted packets, instead of retransmitting them in their entirety, holds potential in improving the performance of 802.11 networks. However, the efficiency of existing packet recovery approaches is severely limited by various overhead associated to redundant transmission and repeated channel contention. In this paper, we propose CodeRepair, a practical coding-based protocol that recovers partially corrupted 802.11 packets without these pains. The design of CodeRepair is based on two novel ideas. First, CodeRepair pushes the limit of 802.11 PHY to piggyback parities in the padded bits of OFDM, obviating the need of transmitting extra information for error correction. Second, CodeRepair corrects errors at the PHY layer, which is significantly more efficient than traditional link-layer approaches. This is due to the fact that a single coded bit usually affects the decoding of a group of data bits in 802.11 convolutional code. As a result, CodeRepair can salvage a partially corrupted packet by correcting a small number of erroneous coded bits using the padded parities. To reduce computational cost of error recovery, CodeRepair employs single parity code for correcting coded bit errors. We propose several techniques to augment the error correcting capability of single parity code without compromising its computation efficiency. Our evaluation shows that CodeRepair recovers an average of 34% partially corrupted packets, and improves the end-to-end link goodput by 59% on lossy 802.11 links.", "citation": "Citations (2)", "departments": ["Michigan State University", "Michigan State University", "Beihang University", "Stony Brook University"], "authors": ["Jun Huang.....http://dblp.org/pers/hd/h/Huang_0001:Jun", "Guoliang Xing.....http://dblp.org/pers/hd/x/Xing:Guoliang", "Jianwei Niu.....http://dblp.org/pers/hd/n/Niu_0002:Jianwei", "Shan Lin.....http://dblp.org/pers/hd/l/Lin:Shan"], "conf": "infocom", "year": "2015", "pages": 9}