{"title": "Local Filtering: Improving the Performance of Approximate Queries on String Collections.", "fields": ["string metric", "string to string correction problem", "query string", "jaro winkler distance", "approximate string matching"], "abstract": "We study efficient query processing for approximate string queries, which find strings within a string collection whose edit distances to the query strings are within the given thresholds. Existing methods typically hinge on the property that globally  similar  strings must share at least certain number of  identical  substrings or subsequences. They become ineffective when there are burst errors or when the number of errors is large. In this paper, we explore the opposite paradigm focusing on finding out the  differences  of database strings to the query string. We propose a new filtering method, called  local filtering , based on the idea that two strings exhibiting substantial local  dissimilarities  must be globally  dissimilar . We propose the concept of (positional) local distance to quantify the minimum amount of errors a query fragment contributes to the edit distance between the query and a data string. It also leads to effective pruning rules and can speed up verification via early termination. We devise a family of indexing methods based on the idea of precomputing (positional) local distances for all possible combinations of query fragments and edit distance thresholds. Based on careful analyses of subtle relationships among local distances, novel techniques are proposed to drastically reduce the amount of enumeration with no or little impact on the pruning power. Efficient query processing methods exploiting the new index and bit-parallelism are also proposed. Experimental results on real datasets show that our local filtering-based methods can achieve substantial speedup compared with state-of-the-art methods, and they are robust against factors such as dataset characteristics and large edit distance thresholds.", "citation": "Citations (11)", "year": "2015", "departments": ["Northeastern University", "University of New South Wales", "Northeastern University", "University of New South Wales"], "conf": "sigmod", "authors": ["Xiaochun Yang.....http://dblp.org/pers/hd/y/Yang_0001:Xiaochun", "Yaoshu Wang.....http://dblp.org/pers/hd/w/Wang:Yaoshu", "Bin Wang.....http://dblp.org/pers/hd/w/Wang_0015:Bin", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0011:Wei"], "pages": 16}