{"title": "Interpolation with Decidable Fixpoint Logics.", "fields": ["t norm fuzzy logics", "monoidal t norm logic", "principle of bivalence", "modal μ calculus", "craig interpolation"], "abstract": "A logic satisfies Craig interpolation if whenever one formula ?1 in the logic entails another formula ?2 in the logic, there is an intermediate formula -- one entailed by ?1 and entailing ?2 -- using only relations in the common signature of ? and ?2. Uniform interpolation strengthens this by requiring the interpolant to depend only on ?1 and the common signature. A uniform interpolant can thus be thought of as a minimal upper approximation of a formula within a sub signature. For first-order logic, interpolation holds but uniform interpolation fails. Uniform interpolation is known to hold for several modal and description logics, but little is known about uniform interpolation for fragments of predicate logic over relations with arbitrary arity. Further, little is known about ordinary Craig interpolation for logics over relations of arbitrary arity that have a recursion mechanism, such as fix point logics. In this work we take a step towards filling these gaps, proving interpolation for a decidable fragment of least fix point logic called unary negation fix point logic. We prove this by showing that for any fixed k, uniform interpolation holds for the k-variable fragment of the logic. In order to show this we develop the technique of reducing questions about logics with tree-like models to questions about modal logics, following an approach by Gradel, Hirsch, and Otto. While this technique has been applied to expressivity and satisfiability questions before, we show how to extend it to reduce interpolation questions about such logics to interpolation for the µ-calculus.", "citation": "Citations (1)", "departments": ["University of Oxford", "University of California, Santa Cruz", "University of Oxford"], "authors": ["Michael Benedikt.....http://dblp.org/pers/hd/b/Benedikt:Michael", "Balder ten Cate.....http://dblp.org/pers/hd/c/Cate:Balder_ten", "Michael Vanden Boom.....http://dblp.org/pers/hd/b/Boom:Michael_Vanden"], "conf": "lics", "year": "2015", "pages": 12}