{"title": "Bandwidth-aware Prefetching for Proactive Multi-video Preloading and Improved HAS Performance.", "fields": ["recommender system", "bandwidth", "multimedia", "real time computing", "channel"], "abstract": "This paper considers the problem of providing users playing one streaming video the option of instantaneous and seamless playback of alternative videos. Recommendation systems can easily provide a list of alternative videos, but there is little research on how to best eliminate the startup time for these alternative videos. The problem is motivated by services that want to retain increasingly impatient users, who frequently watch the beginning of multiple videos, before viewing a video to the end. We present the design, implementation, and evaluation of an HTTP-based Adaptive Streaming (HAS) solution that provides careful prefetching and buffer management. We also present the design and evaluation of three fundamental policy classes that provide different tradeoffs between how aggressively new alternative videos are prefetched versus the importance of ensuring high playback quality. We show that our solution allows us to reduce the startup times of alternative videos by an order of magnitude and effectively adapt the quality such as to ensure the highest possible playback quality of the video being viewed. By improving the channel utilization we also address the discrimination problem that HAS clients often suffer from, allowing us to in some cases simultaneously improve the playback quality of the video being viewed and provide the value-added service of allowing instantaneous playback of the prefetched alternative videos.", "citation": "Citations (5)", "departments": ["Linköping University", "Linköping University", "University of Saskatchewan", "NICTA", "Linköping University"], "authors": ["Vengatanathan Krishnamoorthi.....http://dblp.org/pers/hd/k/Krishnamoorthi:Vengatanathan", "Niklas Carlsson.....http://dblp.org/pers/hd/c/Carlsson:Niklas", "Derek L. Eager.....http://dblp.org/pers/hd/e/Eager:Derek_L=", "Anirban Mahanti.....http://dblp.org/pers/hd/m/Mahanti:Anirban", "Nahid Shahmehri.....http://dblp.org/pers/hd/s/Shahmehri:Nahid"], "conf": "mm", "year": "2015", "pages": 10}