{"title": "ShiDianNao: shifting vision processing closer to the sensor.", "fields": ["memory footprint", "filter", "static random access memory", "convolutional neural network", "image sensor"], "abstract": "In recent years, neural network accelerators have been shown to achieve both high energy efficiency and high performance for a broad application scope within the important category of recognition and mining applications.   Still, both the energy efficiency and performance of such accelerators remain limited by memory accesses. In this paper, we focus on image applications, arguably the most important category among recognition and mining applications. The neural networks which are state-of-the-art for these applications are  Convolutional Neural Networks  (CNN), and they have an important property: weights are shared among many neurons, considerably reducing the neural network memory footprint. This property allows to entirely map a CNN within an SRAM, eliminating all DRAM accesses for weights. By further hoisting this accelerator next to the image sensor, it is possible to eliminate all remaining DRAM accesses, i.e., for inputs and outputs.   In this paper, we propose such a CNN accelerator, placed next to a CMOS or CCD sensor. The absence of DRAM accesses combined with a careful exploitation of the specific data access patterns within CNNs allows us to design an accelerator which is 60× more energy efficient than the previous state-of-the-art neural network accelerator. We present a full design down to the layout at 65 nm, with a modest footprint of 4.86mm 2  and consuming only 320mW, but still about  30×  faster than high-end GPUs.", "citation": "Citations (228)", "departments": ["Chinese Academy of Sciences", "École Polytechnique Fédérale de Lausanne", "Chinese Academy of Sciences", "École Polytechnique Fédérale de Lausanne", "Chinese Academy of Sciences"], "authors": ["Zidong Du.....http://dblp.org/pers/hd/d/Du:Zidong", "Robert Fasthuber.....http://dblp.org/pers/hd/f/Fasthuber:Robert", "Tianshi Chen.....http://dblp.org/pers/hd/c/Chen:Tianshi", "Paolo Ienne.....http://dblp.org/pers/hd/i/Ienne:Paolo", "Ling Li.....http://dblp.org/pers/hd/l/Li_0001:Ling", "Tao Luo.....http://dblp.org/pers/hd/l/Luo:Tao", "Xiaobing Feng.....http://dblp.org/pers/hd/f/Feng_0002:Xiaobing", "Yunji Chen.....http://dblp.org/pers/hd/c/Chen:Yunji", "Olivier Temam.....http://dblp.org/pers/hd/t/Temam:Olivier"], "conf": "isca", "year": "2015", "pages": 13}