{"title": "SEDA: Scalable Embedded Device Attestation.", "fields": ["implementation", "office automation", "computer security model", "industrial control system", "critical infrastructure"], "abstract": "Today, large numbers of smart interconnected devices provide safety and security critical services for energy grids, industrial control systems, gas and oil search robots, home/office automation, transportation, and critical infrastructure. These devices often operate in swarms -- large, dynamic, and self-organizing networks. Software integrity verification of device swarms is necessary to ensure their correct and safe operation as well as to protect them against attacks. However, current device attestation schemes assume a single prover device and do not scale to swarms. We present SEDA, the first attestation scheme for device swarms. We introduce a formal security model for swarm attestation and show security of our approach in this model. We demonstrate two proof-of-concept implementations based on two recent (remote) attestation architectures for embedded systems, including an Intel research platform. We assess performance of SEDA based on these implementations and simulations of large swarms. SEDA can efficiently attest swarms with dynamic and static topologies common in automotive, avionic, industrial control and critical infrastructures settings.", "citation": "Citations (52)", "year": "2015", "departments": ["University of Helsinki", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "Intel"], "conf": "ccs", "authors": ["N. Asokan.....http://dblp.org/pers/hd/a/Asokan:N=", "Franz Ferdinand Brasser.....http://dblp.org/pers/hd/b/Brasser:Franz_Ferdinand", "Ahmad Ibrahim.....http://dblp.org/pers/hd/i/Ibrahim_0002:Ahmad", "Ahmad-Reza Sadeghi.....http://dblp.org/pers/hd/s/Sadeghi:Ahmad=Reza", "Matthias Schunter.....http://dblp.org/pers/hd/s/Schunter:Matthias", "Gene Tsudik.....http://dblp.org/pers/hd/t/Tsudik:Gene", "Christian Wachsmann.....http://dblp.org/pers/hd/w/Wachsmann:Christian"], "pages": 12}