{"title": "DeepProposal: Hunting Objects by Cascading Deep Convolutional Layers.", "fields": ["viola jones object detection framework", "detector", "convolutional neural network", "computer vision", "machine learning"], "abstract": "In this paper we evaluate the quality of the activation layers of a convolutional neural network (CNN) for the generation of object proposals. We generate hypotheses in a sliding-window fashion over different activation layers and show that the final convolutional layers can find the object of interest with high recall but poor localization due to the coarseness of the feature maps. Instead, the first layers of the network can better localize the object of interest but with a reduced recall. Based on this observation we design a method for proposing object locations that is based on CNN features and that combines the best of both worlds. We build an inverse cascade that, going from the final to the initial convolutional layers of the CNN, selects the most promising object locations and refines their boxes in a coarse-to-fine manner. The method is efficient, because i) it uses the same features extracted for detection, ii) it aggregates features using integral images, and iii) it avoids a dense evaluation of the proposals due to the inverse coarse-to-fine cascade. The method is also accurate, it outperforms most of the previously proposed object proposals approaches and when plugged into a CNN-based detector produces state-of-the-art detection performance.", "citation": "Citations (71)", "year": "2015", "departments": ["Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven", "Katholieke Universiteit Leuven"], "conf": "iccv", "authors": ["Amir Ghodrati.....http://dblp.org/pers/hd/g/Ghodrati:Amir", "Ali Diba.....http://dblp.org/pers/hd/d/Diba:Ali", "Marco Pedersoli.....http://dblp.org/pers/hd/p/Pedersoli:Marco", "Tinne Tuytelaars.....http://dblp.org/pers/hd/t/Tuytelaars:Tinne", "Luc J. Van Gool.....http://dblp.org/pers/hd/g/Gool:Luc_J=_Van"], "pages": 9}