{"title": "WRH-ONoC: A wavelength-reused hierarchical architecture for optical Network on Chips.", "fields": ["wavelength", "interconnection", "parallel communication", "reuse", "network on a chip"], "abstract": "Optical Network on Chip (ONoC) is a promising technology for the next-generation many-core chip multiprocessors owing to its tremendous advantages in low power consumption, low communication delay, and high bandwidth. In this paper we present WRH-ONoC, a novel wavelength-reused hierarchical architecture that is capable of interconnecting thousands of cores using a limited number of wavelengths while providing extremely high-throughput data communication between connected cores. In WRH-ONoC, the cores are divided into small subsystems that are interconnected using multiple λ-routers and gateways in a hierarchical manner. Each λ-router can provide non-blocking parallel communication among the directly connected cores or gateways, and all λ-routers can reuse the limited number of available wavelengths. Communications between cores in different subsystems are routed via gateways in which optical signals can change their wavelengths via optical-electrical signal conversions. For a given number of cores, we give the minimum number of levels, λ-routers, and gateways required to interconnect these cores, and derive the expected end-to-end data communication delay under the Uniform-Poisson traffic pattern. Both theoretical analysis and simulation results demonstrate that WRH-ONoC can achieve significant improvement on performance and reduction on hardware cost in comparison with the existing solutions.", "citation": "Citations (2)", "departments": ["University of Otago", "University of Otago", "University of Otago", "University of Otago", "Xidian University"], "authors": ["Feiyang Liu.....http://dblp.org/pers/hd/l/Liu:Feiyang", "Haibo Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Haibo", "Yawen Chen.....http://dblp.org/pers/hd/c/Chen:Yawen", "Zhiyi Huang.....http://dblp.org/pers/hd/h/Huang_0001:Zhiyi", "Huaxi Gu.....http://dblp.org/pers/hd/g/Gu:Huaxi"], "conf": "infocom", "year": "2015", "pages": 9}