{"title": "Semi-supervised Hashing with Semantic Confidence for Large Scale Visual Search.", "fields": ["feature hashing", "dynamic perfect hashing", "k independent hashing", "double hashing", "universal hashing"], "abstract": "Similarity search is one of the fundamental problems for large scale multimedia applications. Hashing techniques, as one popular strategy, have been intensively investigated owing to the speed and memory efficiency. Recent research has shown that leveraging supervised information can lead to high quality hashing. However, most existing supervised methods learn hashing function by treating each training example equally while ignoring the different semantic degree related to the label, i.e. semantic confidence, of different examples. In this paper, we propose a novel semi-supervised hashing framework by leveraging semantic confidence. Specifically, a confidence factor is first assigned to each example by neighbor voting and click count in the scenarios with label and click-through data, respectively. Then, the factor is incorporated into the pairwise and triplet relationship learning for hashing. Furthermore, the two learnt relationships are seamlessly encoded into semi-supervised hashing methods with pairwise and listwise supervision respectively, which are formulated as minimizing empirical error on the labeled data while maximizing the variance of hash bits or minimizing quantization loss over both the labeled and unlabeled data. In addition, the kernelized variant of semi-supervised hashing is also presented. We have conducted experiments on both CIFAR-10 (with label) and Clickture (with click data) image benchmarks (up to one million image examples), demonstrating that our approaches outperform the state-of-the-art hashing techniques.", "citation": "Citations (12)", "departments": ["University of Science and Technology of China", "Microsoft", "University of Science and Technology of China", "City University of Hong Kong", "Microsoft"], "authors": ["Yingwei Pan.....http://dblp.org/pers/hd/p/Pan:Yingwei", "Ting Yao.....http://dblp.org/pers/hd/y/Yao:Ting", "Houqiang Li.....http://dblp.org/pers/hd/l/Li:Houqiang", "Chong-Wah Ngo.....http://dblp.org/pers/hd/n/Ngo:Chong=Wah", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao"], "conf": "sigir", "year": "2015", "pages": 10}