{"title": "Ringo: Interactive Graph Analytics on Big-Memory Machines.", "fields": ["analytics", "usability", "web page", "iterative and incremental development", "data exploration"], "abstract": "We present Ringo, a system for analysis of large graphs. Graphs provide a way to represent and analyze systems of interacting objects (people, proteins, webpages) with edges between the objects denoting interactions (friendships, physical interactions, links). Mining graphs provides valuable insights about individual objects as well as the relationships among them.   In building Ringo, we take advantage of the fact that machines with large memory and many cores are widely available and also relatively affordable. This allows us to build an easy-to-use interactive high-performance graph analytics system. Graphs also need to be built from input data, which often resides in the form of relational tables. Thus, Ringo provides rich functionality for manipulating raw input data tables into various kinds of graphs. Furthermore, Ringo also provides over 200 graph analytics functions that can then be applied to constructed graphs.   We show that a single big-memory machine provides a very attractive platform for performing analytics on all but the largest graphs as it offers excellent performance and ease of use as compared to alternative approaches. With Ringo, we also demonstrate how to integrate graph analytics with an iterative process of trial-and-error data exploration and rapid experimentation, common in data mining workloads.", "citation": "Citations (19)", "year": "2015", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "conf": "sigmod", "authors": ["Yonathan Perez.....http://dblp.org/pers/hd/p/Perez:Yonathan", "Rok Sosic.....http://dblp.org/pers/hd/s/Sosic:Rok", "Arijit Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Arijit", "Rohan Puttagunta.....http://dblp.org/pers/hd/p/Puttagunta:Rohan", "Martin Raison.....http://dblp.org/pers/hd/r/Raison:Martin", "Pararth Shah.....http://dblp.org/pers/hd/s/Shah:Pararth", "Jure Leskovec.....http://dblp.org/pers/hd/l/Leskovec:Jure"], "pages": 6}