{"title": "A truthful (1-ε)-optimal mechanism for on-demand cloud resource provisioning.", "fields": ["optimal mechanism", "smoothed analysis", "maximization", "exact algorithm", "provisioning"], "abstract": "On-demand resource provisioning in cloud computing provides tailor-made resource packages (typically in the form of VMs) to meet users' demands. Public clouds nowadays provide more and more elaborated types of VMs, but have yet to offer the most flexible dynamic VM assembly, which is partly due to the lack of a mature mechanism for pricing tailor-made VMs on the spot. This work proposes an efficient randomized auction mechanism based on a novel application of smoothed analysis and randomized reduction, for dynamic VM provisioning and pricing in geo-distributed cloud data centers. This auction, to the best of our knowledge, is the first one in literature that achieves (i) truthfulness in expectation, (ii) polynomial running time in expectation, and (iii) (1 − e)-optimal social welfare in expectation for resource allocation, where e can be arbitrarily close to 0. Our mechanism consists of three modules: (1) an exact algorithm to solve the NP-hard social welfare maximization problem, which runs in polynomial time in expectation, (2) a perturbation-based randomized resource allocation scheme which produces a VM provisioning solution that is (1 − e)-optimal and (3) an auction mechanism that applies the perturbation-based scheme for dynamic VM provisioning and prices the customized VMs using a randomized VCG payment, with a guarantee in truthfulness in expectation. We validate the efficacy of the mechanism through careful theoretical analysis and trace-driven simulations. 1", "citation": "Citations (11)", "departments": ["University of Hong Kong", "University of Hong Kong", "University of Calgary", "University of Hong Kong"], "authors": ["Xiaoxi Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiaoxi", "Chuan Wu.....http://dblp.org/pers/hd/w/Wu:Chuan", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2015", "pages": 9}