{"title": "DeepContour: A deep convolutional feature learned by positive-sharing loss for contour detection.", "fields": ["discriminative model", "extractor", "convolutional neural network", "feature", "subclass"], "abstract": "Contour detection serves as the basis of a variety of computer vision tasks such as image segmentation and object recognition. The mainstream works to address this problem focus on designing engineered gradient features. In this work, we show that contour detection accuracy can be improved by instead making the use of the deep features learned from convolutional neural networks (CNNs). While rather than using the networks as a blackbox feature extractor, we customize the training strategy by partitioning contour (positive) data into subclasses and fitting each subclass by different model parameters. A new loss function, named positive-sharing loss, in which each subclass shares the loss for the whole positive class, is proposed to learn the parameters. Compared to the sofmax loss function, the proposed one, introduces an extra regularizer to emphasizes the losses for the positive and negative classes, which facilitates to explore more discriminative features. Our experimental results demonstrate that learned deep features can achieve top performance on Berkeley Segmentation Dataset and Benchmark (BSDS500) and obtain competitive cross dataset generalization result on the NYUD dataset.", "citation": "Citations (173)", "year": "2015", "departments": ["Shanghai University", "Huazhong University of Science and Technology", "Nanyang Technological University", "Huazhong University of Science and Technology", "Shanghai University"], "conf": "cvpr", "authors": ["Wei Shen.....http://dblp.org/pers/hd/s/Shen_0002:Wei", "Xinggang Wang.....http://dblp.org/pers/hd/w/Wang:Xinggang", "Yan Wang.....http://dblp.org/pers/hd/w/Wang:Yan", "Xiang Bai.....http://dblp.org/pers/hd/b/Bai:Xiang", "Zhijiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhijiang"], "pages": 10}