{"title": "Exploring the potential of heterogeneous von neumann/dataflow execution models.", "fields": ["dataflow", "overhead", "speculation", "von neumann architecture", "latency"], "abstract": "General purpose processors (GPPs), from small inorder designs to many-issue out-of-order, incur large power overheads which must be addressed for future technology generations. Major sources of overhead include structures which dynamically extract the data-dependence graph or maintain precise state. Considering irregular workloads, current specialization approaches either heavily curtail performance, or provide simply too little benefit. Interestingly, well known  explicit-dataflow  architectures eliminate these overheads by directly executing the data-dependence graph and eschewing instruction-precise recoverability. However, even after decades of research, dataflow architectures have yet to come into prominence as a solution. We attribute this to a lack of effective control speculation and the latency overhead of explicit communication, which is crippling for certain codes.   This paper makes the observation that if both out-of-order and explicit-dataflow were available in one processor, many types of GPP cores can benefit from dynamically switching during certain phases of an application's lifetime. Analysis reveals that an ideal  explicit-dataflow  engine could be profitable for more than half of instructions, providing significant performance and energy improvements. The challenge is to achieve these benefits without introducing excess hardware complexity. To this end, we propose the Specialization Engine for Explicit-Dataflow (SEED). Integrated with an inorder core, we see 1.67× performance and 1.65× energy benefits, with an Out-Of-Order (OOO) dual-issue core we see 1.33× and 1.70×, and with a quad-issue OOO, 1.14× and 1.54×.", "citation": "Citations (14)", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison"], "authors": ["Tony Nowatzki.....http://dblp.org/pers/hd/n/Nowatzki:Tony", "Vinay Gangadhar.....http://dblp.org/pers/hd/g/Gangadhar:Vinay", "Karthikeyan Sankaralingam.....http://dblp.org/pers/hd/s/Sankaralingam:Karthikeyan"], "conf": "isca", "year": "2015", "pages": 13}