{"title": "Improved rendezvous algorithms for heterogeneous cognitive radio networks.", "fields": ["spectrum management", "cognitive radio", "log log plot", "rendezvous problem", "rendezvous"], "abstract": "Cognitive radio networks (CRNs) have been proposed to solve the spectrum scarcity problem. One of their fundamental procedures is to construct a communication link on a common channel for the users, which is referred as rendezvous. In reality, the capability to sense the spectrum may vary from user to user, and such users form what is known as a heterogeneous cognitive radio network (HCRN). The licensed spectrum is divided in to n channels, U = {1, 2,…, n}. We denote the capability of user i as C i  ⊆ U and the set of available channels (i.e. the channels not occupied by the paying users) as V i  ⊆ C i . We study the rendezvous problem in HCRN under two circumstances: fully available spectrum (V i  = C i ) and partially available spectrum (V i  ≠ C i ). For any two users a, b, we propose the Traversing Pointer (TP) algorithm that guarantees rendezvous in O(max{|C a |,|C b |}log log n) time slots for the fully available spectrum scenario. This result is only O (log log n) larger than our constructive lower bound. Moreover, it removes an O(min{|C a |, |C b |}) factor as compared to the state-of-the-art result (O(|C a ||C b |) in [26]). For the partially available spectrum scenario, we propose the Moving Traversing Pointers (MTP) algorithm to guarantee rendezvous in O((max{|V a |, |V b |}) 2  log log n) time slots, which works more efficiently than the previous best result (O(|C a ||C b |) in [25]) in various circumstances. We also conduct extensive simulations and the results corroborate our analysis.", "citation": "Citations (11)", "departments": ["Tsinghua University", "Tsinghua University", "Huazhong University of Science and Technology", "University of Hong Kong"], "authors": ["Zhaoquan Gu.....http://dblp.org/pers/hd/g/Gu:Zhaoquan", "Haosen Pu.....http://dblp.org/pers/hd/p/Pu:Haosen", "Qiang-Sheng Hua.....http://dblp.org/pers/hd/h/Hua:Qiang=Sheng", "Francis C. M. Lau.....http://dblp.org/pers/hd/l/Lau_0001:Francis_C=_M="], "conf": "infocom", "year": "2015", "pages": 9}