{"title": "How Was It?: Exploiting Smartphone Sensing to Measure Implicit Audience Responses to Live Performances.", "fields": ["dance", "immersion", "willingness to recommend", "mood", "audience response"], "abstract": "In this paper, we present an approach to understand the response of an audience to a live dance performance by the processing of mobile sensor data. We argue that exploiting sensing capabilities already available in smart phones enables a potentially large scale measurement of an audience's implicit response to a performance. In this work, we leverage both tri-axial accelerometers, worn by ordinary members of the public during a dance performance, to predict responses to a number of survey answers, comprising enjoyment, immersion, willingness to recommend the event to others, and change in mood. We also analyse how behaviour as a result of seeing a dance performance might be reflected in a people's subsequent social behaviour using proximity and acceleration sensing. To our knowledge, this is the first work where pervasive mobile sensing has been used to investigate spontaneous responses to predict the affective evaluation of a live performance. Using a single body worn accelerometer to monitor a set of audience members, we were able to predict whether they enjoyed the event with a balanced classification accuracy of 90\\%. The collective coordination of the audience's bodily movements also highlighted memorable moments that were reported later by the audience. The effective use of body movements to measure affective responses in such a setting is particularly surprising given that traditionally, physiological signals such as skin conductance or brain-based signals are the more commonly accepted methods to measure implicit affective response. Our experiments open interesting new directions for research on both automated techniques and applications for the implicit tagging of real world events via spontaneous and implicit audience responses during as well as after a performance.", "citation": "Citations (9)", "departments": ["University of Amsterdam", "Delft University of Technology", "Delft University of Technology", "University of Twente", "Delft University of Technology"], "authors": ["Claudio Martella.....http://dblp.org/pers/hd/m/Martella:Claudio", "Ekin Gedik.....http://dblp.org/pers/hd/g/Gedik:Ekin", "Laura Cabrera Quiros.....http://dblp.org/pers/hd/q/Quiros:Laura_Cabrera", "Gwenn Englebienne.....http://dblp.org/pers/hd/e/Englebienne:Gwenn", "Hayley Hung.....http://dblp.org/pers/hd/h/Hung:Hayley"], "conf": "mm", "year": "2015", "pages": 10}