{"title": "Online procurement auctions for resource pooling in client-assisted cloud storage systems.", "fields": ["competitive analysis", "pooling", "online algorithm", "vickrey clarke groves auction", "cloud storage"], "abstract": "Latest developments in cloud computing technologies have enabled a plethora of cloud based data storage services. Cloud storage service providers are facing significant bandwidth cost as the user population scales. Such bandwidth cost can be substantially slashed by exploring a hybrid cloud storage architecture that takes advantage of under-utilized storage and network resources at storage clients. A critical component in the new hybrid cloud storage architecture is an economic mechanism that incentivizes clients to contribute their local resources, while at the same time minimizes the provider's cost for pooling those resources. This work studies online procurement auction mechanisms towards these goals. The online nature of the auction is in line with asynchronous user request arrivals in practice. After carefully characterizing truthfulness conditions under the online procurement auction paradigm, we prove that truthfulness can be guaranteed by a price-based allocation rule and payment rule. Our truthfulness characterization actually converts the mechanism design problem into an online algorithm design problem, with a marginal pricing function for resources as variables set by cloud storage service providers for online procurement auction. We derive the marginal pricing function for the online algorithm. We also prove the competitive ratio of the social cost of our algorithm against that of the offline VCG mechanism and of the resource pooling cost of our algorithm against that of the offline optimal auction. Simulation studies driven by real-world traces are conducted to show the efficacy of our online auction mechanism.", "citation": "Citations (8)", "departments": ["Hong Kong Baptist University", "Hong Kong Baptist University", "Hong Kong Baptist University", "Hong Kong Baptist University", "University of Calgary"], "authors": ["Jian Zhao.....http://dblp.org/pers/hd/z/Zhao:Jian", "Xiaowen Chu.....http://dblp.org/pers/hd/c/Chu:Xiaowen", "Hai Liu.....http://dblp.org/pers/hd/l/Liu:Hai", "Yiu-Wing Leung.....http://dblp.org/pers/hd/l/Leung:Yiu=Wing", "Zongpeng Li.....http://dblp.org/pers/hd/l/Li:Zongpeng"], "conf": "infocom", "year": "2015", "pages": 9}