{"title": "Clone-based and interactive recommendation for modifying pasted code.", "fields": ["computer science", "clone", "reuse", "data mining"], "abstract": "Developers often need to modify pasted code when programming with copy-and-paste practice. Some modifications on pasted code could involve lots of editing efforts, and any missing or wrong edit could incur bugs. In this paper, we propose a clone-based and interactive approach to recommending where and how to modify the pasted code. In our approach, we regard clones of the pasted code as the results of historical copy-and-paste operations and their differences as historical modifications on the same piece of code. Our approach first retrieves clones of the pasted code from a clone repository and detects syntactically complete differences among them. Then our approach transfers each clone difference into a modification slot on the pasted code, suggests options for each slot, and further mines modifying regulations from the clone differences. Based on the mined modifying regulations, our approach dynamically updates the suggested options and their ranking in each slot according to developer's modifications on the pasted code. We implement a proof-of-concept tool CCDemon based on our approach and evaluate its effectiveness based on code clones detected from five open source projects. The results show that our approach can identify 96.9% of the to-be-modified positions in pasted code and suggest 75.0% of the required modifications. Our human study further confirms that CCDemon can help developers to accomplish their modifications of pasted code more efficiently.", "citation": "Citations (4)", "departments": ["Fudan University", "Fudan University", "Nanyang Technological University", "Fudan University", "Fudan University"], "authors": ["Yun Lin.....http://dblp.org/pers/hd/l/Lin_0001:Yun", "Xin Peng.....http://dblp.org/pers/hd/p/Peng:Xin", "Zhenchang Xing.....http://dblp.org/pers/hd/x/Xing:Zhenchang", "Diwen Zheng.....http://dblp.org/pers/hd/z/Zheng:Diwen", "Wenyun Zhao.....http://dblp.org/pers/hd/z/Zhao:Wenyun"], "conf": "sigsoft", "year": "2015", "pages": 12}