{"title": "Different Users, Different Opinions: Predicting Search Satisfaction with Mouse Movement Information.", "fields": ["judgement", "information retrieval", "data mining", "computer user satisfaction", "search engine"], "abstract": "Satisfaction prediction is one of the prime concerns in search performance evaluation. It is a non-trivial task for two major reasons: (1) The definition of satisfaction is rather subjective and different users may have different opinions in satisfaction judgement. (2) Most existing studies on satisfaction prediction mainly rely on users' click-through or query reformulation behaviors but there are many sessions without such kind of interactions. To shed light on these research questions, we construct an experimental search engine that could collect users' satisfaction feedback as well as mouse click-through/movement data. Different from existing studies, we compare for the first time search users' and external assessors' opinions on satisfaction. We find that search users pay more attention to the utility of results while external assessors emphasize on the efforts spent in search sessions. Inspired by recent studies in predicting result relevance based on mouse movement patterns (namely motifs), we propose to estimate the utilities of search results and the efforts in search sessions with motifs extracted from mouse movement data on search result pages (SERPs). Besides the existing frequency-based motif selection method, two novel selection strategies (distance-based and distribution-based) are also adopted to extract high quality motifs for satisfaction prediction. Experimental results on over 1,000 user sessions show that the proposed strategies outperform existing methods and also have promising generalization capability for different users and queries.", "citation": "Citations (29)", "departments": ["Tsinghua University", "Tsinghua University", "Nanjing University of Science and Technology", "Samsung", "Tsinghua University"], "authors": ["Yiqun Liu.....http://dblp.org/pers/hd/l/Liu:Yiqun", "Ye Chen.....http://dblp.org/pers/hd/c/Chen:Ye", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "Jiashen Sun.....http://dblp.org/pers/hd/s/Sun:Jiashen", "Min Zhang.....http://dblp.org/pers/hd/z/Zhang_0006:Min", "Shaoping Ma.....http://dblp.org/pers/hd/m/Ma:Shaoping", "Xuan Zhu.....http://dblp.org/pers/hd/z/Zhu:Xuan"], "conf": "sigir", "year": "2015", "pages": 10}