{"title": "Effort-aware just-in-time defect prediction: simple unsupervised models could be better than supervised models.", "fields": ["predictive modelling", "pattern recognition", "software system", "unsupervised learning", "machine learning"], "abstract": "Unsupervised models do not require the defect data to build the prediction models and hence incur a low building cost and gain a wide application range. Consequently, it would be more desirable for practitioners to apply unsupervised models in effort-aware just-in-time (JIT) defect prediction if they can predict defect-inducing changes well. However, little is currently known on their prediction effectiveness in this context. We aim to investigate the predictive power of simple unsupervised models in effort-aware JIT defect prediction, especially compared with the state-of-the-art supervised models in the recent literature. We first use the most commonly used change metrics to build simple unsupervised models. Then, we compare these unsupervised models with the state-of-the-art supervised models under cross-validation, time-wise-cross-validation, and across-project prediction settings to determine whether they are of practical value. The experimental results, from open-source software systems, show that many simple unsupervised models perform better than the state-of-the-art supervised models in effort-aware JIT defect prediction.", "citation": "Citations (14)", "departments": ["Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University", "Nanjing University"], "authors": ["Yibiao Yang.....http://dblp.org/pers/hd/y/Yang:Yibiao", "Yuming Zhou.....http://dblp.org/pers/hd/z/Zhou:Yuming", "Jinping Liu.....http://dblp.org/pers/hd/l/Liu:Jinping", "Yangyang Zhao.....http://dblp.org/pers/hd/z/Zhao:Yangyang", "Hongmin Lu.....http://dblp.org/pers/hd/l/Lu:Hongmin", "Lei Xu.....http://dblp.org/pers/hd/x/Xu_0003:Lei", "Baowen Xu.....http://dblp.org/pers/hd/x/Xu:Baowen", "Hareton Leung.....http://dblp.org/pers/hd/l/Leung:Hareton"], "conf": "sigsoft", "year": "2016", "pages": 12}