{"title": "Efficient Macroscopic Urban Traffic Models for Reducing Congestion: A PDDL+ Planning Approach.", "fields": ["urbanization", "mathematical model", "simulation", "planning domain definition language", "management science"], "abstract": "The global growth in urbanisation increases the demand for services including road transport infrastructure, presenting challenges in terms of mobility. In this scenario, optimising the exploitation of urban road networks is a pivotal challenge. Existing urban traffic control approaches, based on complex mathematical models, can effectively deal with planned-ahead events, but are not able to cope with unexpected situations –such as roads blocked due to car accidents or weather-related events– because of their huge computational requirements. Therefore, such unexpected situations are mainly dealt with manually, or by exploiting pre-computed policies.\n\nOur goal is to show the feasibility of using mixed discrete-continuous planning to deal with unexpected circumstances in urban traffic control. We present a PDDL+ formulation of urban traffic control, where continuous processes are used to model flows of cars, and show how planning can be used to efficiently reduce congestion of specified roads by controlling traffic light green phases. We present simulation results on two networks (one of them considers Manchester city centre) that demonstrate the effectiveness of the approach, compared with fixed-time and reactive techniques.", "citation": "Citations (10)", "departments": ["University of Huddersfield", "King's College London", "Delft University of Technology", "University of Huddersfield", "University of Huddersfield"], "authors": ["Mauro Vallati.....http://dblp.org/pers/hd/v/Vallati:Mauro", "Daniele Magazzeni.....http://dblp.org/pers/hd/m/Magazzeni:Daniele", "Bart De Schutter.....http://dblp.org/pers/hd/s/Schutter:Bart_De", "Lukás Chrpa.....http://dblp.org/pers/hd/c/Chrpa:Luk=aacute=s", "Thomas Leo McCluskey.....http://dblp.org/pers/hd/m/McCluskey:Thomas_Leo"], "conf": "aaai", "year": "2016", "pages": 7}