{"title": "Kvazaar: Open-Source HEVC/H.265 Encoder.", "fields": ["scratch", "xeon", "arm architecture", "x86", "powerpc"], "abstract": "Kvazaar is an academic software video encoder for the emerging High Efficiency Video Coding (HEVC/H.265) standard. It provides students, academic professionals, and industry experts a free, cross-platform HEVC encoder for x86, x64, PowerPC, and ARM processors on Windows, Linux, and Mac. Kvazaar is being developed from scratch in C and optimized in Assembly under the LGPLv2.1 license. The development is being coordinated by Ultra Video Group at Tampere University of Technology (TUT) and the implementation work is carried out by an active community on GitHub. Developer friendly source code of Kvazaar makes joining easy for new developers. Currently, Kvazaar includes all essential coding tools of HEVC and its modular source code facilitates parallelization on multi and manycore processors as well as algorithm acceleration on hardware. Kvazaar is able to attain real-time HEVC coding speed up to 4K video on an Intel 14-core Xeon processor. Kvazaar is also supported by FFmpeg and Libav. These de-facto standard multimedia frameworks boost Kvazaar popularity and enable its joint usage with other well-known multimedia processing tools. Nowadays, Kvazaar is an integral part of teaching at TUT and it has got a key role in three Eureka Celtic-Plus projects in the fields of 4K TV broadcasting, virtual advertising, Video on Demand, and video surveillance.", "citation": "Citations (5)", "departments": ["Tampere University of Technology", "Tampere University of Technology", "Tampere University of Technology", "Tampere University of Technology", "Tampere University of Technology"], "authors": ["Marko Viitanen.....http://dblp.org/pers/hd/v/Viitanen:Marko", "Ari Koivula.....http://dblp.org/pers/hd/k/Koivula:Ari", "Ari Lemmetti.....http://dblp.org/pers/hd/l/Lemmetti:Ari", "Arttu Ylä-Outinen.....http://dblp.org/pers/hd/y/Yl=auml==Outinen:Arttu", "Jarno Vanne.....http://dblp.org/pers/hd/v/Vanne:Jarno", "Timo D. Hämäläinen.....http://dblp.org/pers/hd/h/H=auml=m=auml=l=auml=inen:Timo_D="], "conf": "mm", "year": "2016", "pages": 4}