{"title": "Sample + Seek: Approximating Aggregates with Distribution Precision Guarantee.", "fields": ["error threshold", "response time", "arbitrarily large", "search engine indexing", "sampling"], "abstract": "Data volumes are growing exponentially for our decision-support systems making it challenging to ensure interactive response time for ad-hoc queries without increasing cost of hardware. Aggregation queries with Group By that produce an aggregate value for every combination of values in the grouping columns are the most important class of ad-hoc queries. As small errors are usually tolerable for such queries, approximate query processing (AQP) has the potential to answer them over very large datasets much faster.   In many cases analysts require the distribution of (group, aggvalue) pairs in the estimated answer to be guaranteed within a certain error threshold of the exact distribution. Existing AQP techniques are inadequate for two main reasons.   First, users cannot express such guarantees. Second, sampling techniques used in traditional AQP can produce arbitrarily large errors even for summ queries. To address those limitations, we first introduce a new precision metric, called  distribution precision , to express such error guarantees.   We then study how to provide fast approximate answers to aggregation queries with distribution precision guaranteed within a user-specified error bound. The main challenges are to provide rigorous error guarantees and to handle arbitrary highly selective predicates without maintaining large-sized samples. We propose a novel sampling scheme called  measure-biased sampling  to address the former challenge.   For the latter, we propose two new indexes to augment in-memory samples. Like other sampling-based AQP techniques, our solution supports any aggregate that can be estimated from random samples.   In addition to deriving theoretical guarantees, we conduct experimental study to compare our system with state-of-the-art AQP techniques and a commercial column-store database system on both synthetic and real enterprise datasets. Our system provides a median speed-up of more than 100x with around 5% distribution error compared with the commercial database.", "citation": "Citations (17)", "year": "2016", "departments": ["Microsoft", "University of Illinois at Urbana–Champaign", "Microsoft", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Bolin Ding.....http://dblp.org/pers/hd/d/Ding:Bolin", "Silu Huang.....http://dblp.org/pers/hd/h/Huang:Silu", "Surajit Chaudhuri.....http://dblp.org/pers/hd/c/Chaudhuri:Surajit", "Kaushik Chakrabarti.....http://dblp.org/pers/hd/c/Chakrabarti:Kaushik", "Chi Wang.....http://dblp.org/pers/hd/w/Wang_0001:Chi"], "pages": 16}