{"title": "Competitive auctions for cost-aware cellular traffic offloading with optimized capacity gain.", "fields": ["cellular traffic", "femtocell", "common value auction", "maximization", "budget constraint"], "abstract": "Offloading part of cellular traffic through existing alternative wireless networks, such as femtocells and WiFi networks, is one promising solution to the severe traffic overload faced by cellular network providers (CSPs) nowadays. Most existing cellular offloading auction mechanisms assume the CSP has the knowledge of incoming overloaded traffic demand, and satisfy the demand by offloading. However, in practice, with the explosive growth of mobile device communications, the overloaded traffic demand at CSPs is very likely to pass over the total capability that third-party resource owners can provide. Then it is critical to enable CSPs to optimize the traffic handling capacity gain through offloading with budget constraints. In this paper, we propose two efficient Competitive Auction MEchanisms for mObile offloading, CAMEO-min and CAMEO-ws. Both mechanisms are proven to be non-budget-deficit, individually rational and incentive-compatible, and have guaranteed lower bounds on the ratio of the CSP's gain achieved in them to the maximum gain that the CSP could achieve in any omniscient auction (the auction with an omniscient auctioneer). Our extensive evaluations show that CAMEOs achieve very good performance in terms of the maximization of the CSP's gain especially when the global bidder dominance or the region dominance is big.", "citation": "Citations (2)", "departments": ["Nanjing University", "Nanjing University", "California State Polytechnic University, Pomona", "Nanjing University"], "authors": ["Yuan Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Yuan", "Siyuan Tang.....http://dblp.org/pers/hd/t/Tang:Siyuan", "Tingting Chen.....http://dblp.org/pers/hd/c/Chen:Tingting", "Sheng Zhong.....http://dblp.org/pers/hd/z/Zhong:Sheng"], "conf": "infocom", "year": "2016", "pages": 9}