{"title": "Interactive and Deterministic Data Cleaning.", "fields": ["falcon", "traverse", "distributed file system", "sql", "bootstrapping"], "abstract": "We present Falcon, an interactive, deterministic, and declarative data cleaning system, which uses SQL update queries as the language to repair data. Falcon does not rely on the existence of a set of pre-defined data quality rules. On the contrary, it encourages users to explore the data, identify possible problems, and make updates to fix them. Bootstrapped by one user update, Falcon guesses a set of possible sql update queries that can be used to repair the data. The main technical challenge addressed in this paper consists in finding a set of sql update queries that is minimal in size and at the same time fixes the largest number of errors in the data. We formalize this problem as a search in a lattice-shaped space. To guarantee that the chosen updates are semantically correct, Falcon navigates the lattice by interacting with users to gradually validate the set of sql update queries. Besides using traditional one-hop based traverse algorithms (e.g., BFS or DFS), we describe novel multi-hop search algorithms such that Falcon can dive over the lattice and conduct the search efficiently. Our novel search strategy is coupled with a number of optimization techniques to further prune the search space and efficiently maintain the lattice. We have conducted extensive experiments using both real-world and synthetic datasets to show that Falcon can effectively communicate with users in data repairing.", "citation": "Citations (10)", "year": "2016", "departments": ["Tsinghua University", "Tsinghua University", "Universita dell ...  Potenza, Italy", "Universita dell ...  Potenza, Italy", "Universita dell ...  Potenza, Italy"], "conf": "sigmod", "authors": ["Jian He.....http://dblp.org/pers/hd/h/He:Jian", "Enzo Veltri.....http://dblp.org/pers/hd/v/Veltri:Enzo", "Donatello Santoro.....http://dblp.org/pers/hd/s/Santoro:Donatello", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Giansalvatore Mecca.....http://dblp.org/pers/hd/m/Mecca:Giansalvatore", "Paolo Papotti.....http://dblp.org/pers/hd/p/Papotti:Paolo", "Nan Tang.....http://dblp.org/pers/hd/t/Tang_0001:Nan"], "pages": 15}