{"title": "A lightweight electrotactile feedback device for grasp improvement in immersive virtual environments.", "fields": ["grasp", "lever", "immersion", "workload", "finger tracking"], "abstract": "An immersive virtual environment is the ideal platform for the planning and training of on-orbit servicing missions, as it provides a flexible and safe environment. In such kind of virtual assembly simulation, grasping virtual objects is one of the most common and natural interactions. However, unlike grasping objects in the real world, it is a non-trivial task in virtual environments, where the primary feedback is visual only. A lot of research investigated ways to provide haptic feedback, such as force, vibrational and electrotactile feedback. Such devices, however, are usually uncomfortable and hard to integrate in projection-based immersive YR systems. In this paper, we present a novel, small and lightweight electro-tactile feedback device, specifically designed for immersive virtual environments. It consists of a small tactor with eight electrodes for each finger and a signal generator attached to the user's hand or arm. Our device can be easily integrated with an existing optical finger tracking system. The study presented in this paper assesses the feasibility and usability of the interaction device. An experiment was conducted in a repeated measures design using the electrotactile feedback modality as independent variable. As benchmark, we chose three typical assembly tasks of a YR simulation for satellite on-orbit servicing missions, including pressing a button, switching a lever switch, and pulling a module from its slot. Results show that electrotactile feedback improved the user's grasping in our virtual on-orbit servicing scenario. The task completion time was significantly lower for all three tasks and the precision of the user's interaction was higher. The workload reported by the participants was significantly lower when using electrotactile feedback. Additionally, users were more confident with their performance while completing the tasks with electrotactile feedback. We describe the device, outline the user study and report the results.", "citation": "Citations (4)", "departments": ["German Aerospace Center", "German Aerospace Center", "Kaiserslautern University of Technology", "German Aerospace Center", "German Aerospace Center"], "authors": ["Johannes Hummel.....http://dblp.org/pers/hd/h/Hummel:Johannes", "Janki Dodiya.....http://dblp.org/pers/hd/d/Dodiya:Janki", "Laura Eckardt.....http://dblp.org/pers/hd/e/Eckardt:Laura", "Robin Wolff.....http://dblp.org/pers/hd/w/Wolff:Robin", "Andreas Gerndt.....http://dblp.org/pers/hd/g/Gerndt:Andreas", "Torsten W. Kuhlen.....http://dblp.org/pers/hd/k/Kuhlen:Torsten_W="], "conf": "vr", "year": "2016", "pages": 10}