{"title": "\"Told you i didn't like it\": Exploiting uninteresting items for effective collaborative filtering.", "fields": ["data mining", "movielens", "information retrieval", "collaborative filtering", "singular value decomposition"], "abstract": "We study how to improve the accuracy and running time of top-N recommendation with collaborative filtering (CF). Unlike existing works that use mostly rated items (which is only a small fraction in a rating matrix), we propose the notion of pre-use preferences of users toward a vast amount of unrated items. Using this novel notion, we effectively identify uninteresting items that were not rated yet but are likely to receive very low ratings from users, and impute them as zero. This simple-yet-novel zero-injection method applied to a set of carefully-chosen uninteresting items not only addresses the sparsity problem by enriching a rating matrix but also completely prevents uninteresting items from being recommended as top-N items, thereby improving accuracy greatly. As our proposed idea is method-agnostic, it can be easily applied to a wide variety of popular CF methods. Through comprehensive experiments using the Movielens dataset and MyMediaLite implementation, we successfully demonstrate that our solution consistently and universally improves the accuracies of popular CF methods (e.g., item-based CF, SVD-based CF, and SVD++) by two to five orders of magnitude on average. Furthermore, our approach reduces the running time of those CF methods by 1.2 to 2.3 times when its setting produces the best accuracy. The datasets and codes that we used in experiments are available at: https://goo.gl/KUrmip", "citation": "Citations (6)", "departments": ["Hanyang University", "Hanyang University", "Hanyang University", "Hankuk University of Foreign Studies", "Penn State College of Information Sciences and Technology"], "authors": ["Won-Seok Hwang.....http://dblp.org/pers/hd/h/Hwang:Won=Seok", "Juan Parc.....http://dblp.org/pers/hd/p/Parc:Juan", "Sang-Wook Kim.....http://dblp.org/pers/hd/k/Kim:Sang=Wook", "Jongwuk Lee.....http://dblp.org/pers/hd/l/Lee:Jongwuk", "Dongwon Lee.....http://dblp.org/pers/hd/l/Lee_0001:Dongwon"], "conf": "icde", "year": "2016", "pages": 12}