{"title": "Lease/release: architectural support for scaling contended data structures.", "fields": ["cache coherence", "thread", "cache", "priority queue", "non blocking algorithm", "concurrent data structure"], "abstract": "High memory contention is generally agreed to be a worst-case scenario for concurrent data structures. There has been a significant amount of research effort spent investigating designs which minimize contention, and several programming techniques have been proposed to mitigate its effects. However, there are currently few architectural mechanisms to allow scaling contended data structures at high thread counts.   In this paper, we investigate hardware support for scalable contended data structures. We propose Lease/Release, a simple addition to standard directory-based MSI cache coherence protocols, allowing participants to lease memory, at the granularity of cache lines, by delaying coherence messages for a  short, bounded  period of time. Our analysis shows that Lease/Release can significantly reduce the overheads of contention for both non-blocking (lock-free) and lock-based data structure implementations, while ensuring that no deadlocks are introduced. We validate Lease/Release empirically on the Graphite multiprocessor simulator, on a range of data structures, including queue, stack, and priority queue implementations, as well as on transactional applications. Results show that Lease/Release consistently improves both throughput and energy usage, by up to 5x, both for lock-free and lock-based data structure designs.", "citation": "Not cited", "year": "2016", "departments": ["University of Connecticut", "Massachusetts Institute of Technology", "Microsoft", "University of Connecticut", "D. E. Shaw Research", "Institute of Science and Technology Austria"], "conf": "ppopp", "authors": ["Syed Kamran Haider.....http://dblp.org/pers/hd/h/Haider:Syed_Kamran", "William Hasenplaugh.....http://dblp.org/pers/hd/h/Hasenplaugh:William", "Dan Alistarh.....http://dblp.org/pers/hd/a/Alistarh:Dan"], "pages": 12}