{"title": "Weakly-Supervised Deep Learning for Customer Review Sentiment Classification.", "fields": ["feature engineering", "deep learning", "sentence", "sentiment analysis", "user generated content"], "abstract": "Sentiment analysis is one of the key challenges for mining online user generated content. In this work, we focus on customer reviews which are an important form of opinionated content. The goal is to identify each sentence's semantic orientation (e.g. positive or negative) of a review. Traditional sentiment classification methods often involve substantial human efforts, e.g. lexicon construction, feature engineering. In recent years, deep learning has emerged as an effective means for solving sentiment classification problems. A neural network intrinsically learns a useful representation automatically without human efforts. However, the success of deep learning highly relies on the availability of large-scale training data. In this paper, we propose a novel deep learning framework for review sentiment classification which employs prevalently available ratings as weak supervision signals. The framework consists of two steps: (1) learn a high level representation (embedding space) which captures the general sentiment distribution of sentences through rating information; (2) add a classification layer on top of the embedding layer and use labeled sentences for supervised fine-tuning. Experiments on review data obtained from Amazon show the efficacy of our method and its superiority over baseline methods.", "citation": "Citations (6)", "year": "2016", "departments": ["Northwest University", "Northwest University", "Xidian University", "Zhejiang University", "Baidu"], "conf": "ijcai", "authors": ["Ziyu Guan.....http://dblp.org/pers/hd/g/Guan:Ziyu", "Long Chen.....http://dblp.org/pers/hd/c/Chen_0007:Long", "Wei Zhao.....http://dblp.org/pers/hd/z/Zhao_0019:Wei", "Yi Zheng.....http://dblp.org/pers/hd/z/Zheng:Yi", "Shulong Tan.....http://dblp.org/pers/hd/t/Tan:Shulong", "Deng Cai.....http://dblp.org/pers/hd/c/Cai:Deng"], "pages": 7}