{"title": "A multi-player Markov stopping game for delay-tolerant and opportunistic resource sharing networks.", "fields": ["crowdsourcing", "exploit", "time diversity", "nash equilibrium", "shared resource"], "abstract": "Opportunistic resources are often present in various resource sharing networks for the users to exploit, but their qualities often change over time. Fortunately, many user tasks are delay-tolerant, which offers the network users a favorable degree of freedom in waiting for and accessing the opportunistic resource at the time of its best quality. For such delay-tolerant and opportunistic resource sharing networks (DT-ORS-Net), the corresponding optimal accessing strategies developed in existing literature mainly focus on the single-user scenarios, while the potential competition from other peer users in practical multi-user DT-ORS-Net is often ignored. Considering this, a multi-player Markov stopping game (M-MSG) is developed in this work, and the derived Nash equilibrium (NE) strategy of this M-MSG can guide network users to properly handle the potential competition from other peers and thus exploit the time diversity of the opportunistic resource more effectively, which in turn further improves the resource utilization efficiency. Applications in the cloud-computing and the mobile crowdsourcing networks are demonstrated to verify the effectiveness of the proposed method, and simulation results show that using the NE strategy of the proposed M-MSG can provide substantial performance gain as compared to using the conventional single-user optimal one.", "citation": "Citations (2)", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University", "North Carolina State University"], "authors": ["Xiaofan He.....http://dblp.org/pers/hd/h/He:Xiaofan", "Huaiyu Dai.....http://dblp.org/pers/hd/d/Dai:Huaiyu", "Peng Ning.....http://dblp.org/pers/hd/n/Ning:Peng", "Rudra Dutta.....http://dblp.org/pers/hd/d/Dutta:Rudra"], "conf": "infocom", "year": "2016", "pages": 9}