{"title": "TOPIC: Toward perfect Influence Graph Summarization.", "fields": ["clustering coefficient", "graph", "moral graph", "power graph analysis", "graph drawing"], "abstract": "Summarizing large influence graphs is crucial for many graph visualization and mining tasks. Classical graph clustering and compression algorithms focus on summarizing the nodes by their structural-level or attribute-level similarities, but usually are not designed to characterize the flow-level pattern which is the centerpiece of influence graphs. On the other hand, the social influence analysis has been intensively studied, but little is done on the summarization problem without an explicit focus on social networks. Building on the recent study of the Influence Graph Summarization (IGS), this paper presents a new perspective of the underlying flow-based heuristic. It establishes a direct linkage between the optimal summarization and the classic eigenvector centrality of the graph nodes. Such a theoretic linkage has important implications on numerous aspects in the pursuit of a perfect influence graph summarization. In particular, it enables us to develop a suite of algorithms that can: 1) achieve a near-optimal IGS objective, 2) support dynamic summarizations balancing the IGS objective and the stability of transition in navigating the summarization, and 3) scale to million-node graphs with a near-linear computational complexity. Both quantitative experiments on real-world citation networks and the user studies on the task analysis experience demonstrate the effectiveness of the proposed summarization algorithms.", "citation": "Citations (1)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Fudan University", "Chinese Academy of Sciences", "Arizona State University"], "authors": ["Lei Shi.....http://dblp.org/pers/hd/s/Shi:Lei", "Sibai Sun.....http://dblp.org/pers/hd/s/Sun:Sibai", "Yuan Xuan.....http://dblp.org/pers/hd/x/Xuan:Yuan", "Yue Su.....http://dblp.org/pers/hd/s/Su:Yue", "Hanghang Tong.....http://dblp.org/pers/hd/t/Tong:Hanghang", "Shuai Ma.....http://dblp.org/pers/hd/m/Ma:Shuai", "Yang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Yang"], "conf": "icde", "year": "2016", "pages": 12}