{"title": "Opportunistic WiFi offloading in a vehicular environment: Waiting or downloading now?", "fields": ["download", "vehicular ad hoc network", "adaptive algorithm", "upload", "wait"], "abstract": "The increasing traffic demand has become a serious concern for cellular networks. To solve the traffic explosion problem in a vehicular network environment, there have been many efforts to offload the traffic from cellular links to Roadside Units (RSUs). Compared with the cost of downloading from cellular link, downloading through RSUs is considered practically free. In most cases, we have to wait for one or several RSUs to download the entire data, which causing huge delays. However, people can always download data from the cellular network. In reality, people are sensitive to the downloading delay but would like to pay little money for downloading the data. As the result, there exists a delay-cost trade-off. In this paper, we unify the downloading cost and downloading delay as the user's satisfaction. The objective of this paper is to maximize the user's satisfaction. A user will be unsatisfied if they are paying too much for data, or if they wait for a long time. We analyze the optimal solution under the condition that the encountering time between vehicles and RSUs follows the exponential and Gaussian distributions. Generally, we propose an adaptive algorithm. A downloading strategy is made based on the historical encountering situation between the vehicle and multiple RSUs. After a period of time, if the real situation is different with the initial prediction, the data downloading strategy will be correspondingly adjusted. Extensive real-trace driven experiment results show that our algorithm achieves a good performance.", "citation": "Citations (9)", "departments": ["Department of C ... University, USA", "Department of C ... University, USA"], "authors": ["Ning Wang.....http://dblp.org/pers/hd/w/Wang:Ning", "Jie Wu.....http://dblp.org/pers/hd/w/Wu:Jie"], "conf": "infocom", "year": "2016", "pages": 9}