{"title": "HAWK: Hardware support for unstructured log processing.", "fields": ["text corpus", "hardware acceleration", "cycles per instruction", "data set", "fpga prototype"], "abstract": "Rapidly processing high-velocity text data is critical for many technical and business applications. Widely used software solutions for processing these large text corpora target disk-resident data and rely on pre-computed indexes and large clusters to achieve high performance. However, greater capacity and falling costs are enabling a shift to RAM-resident data sets. The enormous bandwidth of RAM can facilitate scan operations that are competitive with pre-computed indexes for interactive, ad-hoc queries. However, software approaches for processing these large text corpora fall far short of saturating available bandwidth and meeting peak scan rates possible on modern memory systems. In this paper, we present HAWK, a hardware accelerator for ad hoc queries against large in-memory logs. HAWK comprises a stall-free hardware pipeline that scans input data at a constant rate, examining multiple input characters in parallel during a single accelerator clock cycle. We describe a 1GHz 32-characterwide HAWK design targeting ASIC implementation, designed to process data at 32GB/s (up to two orders of magnitude faster than software solutions), and demonstrate a scaled-down FPGA prototype that operates at 100MHz with 4-wide parallelism, which processes at 400MB/s (13× faster than software grep for large multi-pattern scans).", "citation": "Citations (4)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Prateek Tandon.....http://dblp.org/pers/hd/t/Tandon:Prateek", "Faissal M. Sleiman.....http://dblp.org/pers/hd/s/Sleiman:Faissal_M=", "Michael J. Cafarella.....http://dblp.org/pers/hd/c/Cafarella:Michael_J=", "Thomas F. Wenisch.....http://dblp.org/pers/hd/w/Wenisch:Thomas_F="], "conf": "icde", "year": "2016", "pages": 12}