{"title": "StressClick: Sensing Stress from Gaze-Click Patterns.", "fields": ["crowdsourcing", "gaze", "generalizability theory", "affective computing", "modalities"], "abstract": "Stress sensing is valuable in many applications, including online learning crowdsourcing and other daily human-computer interactions. Traditional affective computing techniques investigate affect inference based on different individual modalities, such as facial expression, vocal tones, and physiological signals or the aggregation of signals of these independent modalities, without explicitly exploiting their inter-connections. In contrast, this paper focuses on exploring the impact of mental stress on the coordination between two human nervous systems, the somatic and autonomic nervous systems. Specifically, we present the analysis of the subtle but indicative pattern of human gaze behaviors surrounding a mouse-click event, i.e. the gaze-click pattern. Our evaluation shows that mental stress affects the gaze-click pattern, and this influence has largely been ignored in previous work. This paper, therefore, further proposes a non-intrusive approach to inferring human stress level based on the gaze-click pattern, using only data collected from the common computer webcam and mouse. We conducted a human study on solving math questions under different stress levels to explore the validity of stress recognition based on this coordination pattern. Experimental results show the effectiveness of our technique and the generalizability of the proposed features for user-independent modeling. Our results suggest that it may be possible to detect stress non-intrusively in the wild, without the need for specialized equipment.", "citation": "Citations (7)", "departments": ["Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University"], "authors": ["Michael Xuelin Huang.....http://dblp.org/pers/hd/h/Huang:Michael_Xuelin", "Jiajia Li.....http://dblp.org/pers/hd/l/Li:Jiajia", "Grace Ngai.....http://dblp.org/pers/hd/n/Ngai:Grace", "Hong Va Leong.....http://dblp.org/pers/hd/l/Leong:Hong_Va"], "conf": "mm", "year": "2016", "pages": 10}