{"title": "SPORE: A sequential personalized spatial item recommender system.", "fields": ["recommender system", "locality sensitive hashing", "markov chain", "speedup", "latent variable"], "abstract": "With the rapid development of location-based social networks (LBSNs), spatial item recommendation has become an important way of helping users discover interesting locations to increase their engagement with location-based services. Although human movement exhibits sequential patterns in LBSNs, most current studies on spatial item recommendations do not consider the sequential influence of locations. Leveraging sequential patterns in spatial item recommendation is, however, very challenging, considering 1) users' check-in data in LBSNs has a low sampling rate in both space and time, which renders existing prediction techniques on GPS trajectories ineffective; 2) the prediction space is extremely large, with millions of distinct locations as the next prediction target, which impedes the application of classical Markov chain models; and 3) there is no existing framework that unifies users' personal interests and the sequential influence in a principled manner. In light of the above challenges, we propose a sequential personalized spatial item recommendation framework (SPORE) which introduces a novel latent variable topic-region to model and fuse sequential influence with personal interests in the latent and exponential space. The advantages of modeling the sequential effect at the topic-region level include a significantly reduced prediction space, an effective alleviation of data sparsity and a direct expression of the semantic meaning of users' spatial activities. Furthermore, we design an asymmetric Locality Sensitive Hashing (ALSH) technique to speed up the online top-k recommendation process by extending the traditional LSH. We evaluate the performance of SPORE on two real datasets and one large-scale synthetic dataset. The results demonstrate a significant improvement in SPORE's ability to recommend spatial items, in terms of both effectiveness and efficiency, compared with the state-of-the-art methods.", "citation": "Citations (28)", "departments": ["University of Queensland", "University of Queensland", "University of Queensland", "University of Technology, Sydney", "Chinese Academy of Sciences"], "authors": ["Weiqing Wang.....http://dblp.org/pers/hd/w/Wang:Weiqing", "Hongzhi Yin.....http://dblp.org/pers/hd/y/Yin:Hongzhi", "Shazia Wasim Sadiq.....http://dblp.org/pers/hd/s/Sadiq:Shazia_Wasim", "Ling Chen.....http://dblp.org/pers/hd/c/Chen:Ling", "Min Xie.....http://dblp.org/pers/hd/x/Xie:Min", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang"], "conf": "icde", "year": "2016", "pages": 12}