{"title": "Representational Similarity Learning with Application to Brain Networks.", "fields": ["perception", "pattern recognition", "similarity learning", "machine learning", "mathematics", "artificial intelligence", "lasso"], "abstract": "Representational Similarity Learning (RSL) aims to discover features that are important in representing (human-judged) similarities among objects. RSL can be posed as a sparsity-regularized multi-task regression problem. Standard methods, like group lasso, may not select important features if they are strongly correlated with others. To address this shortcoming we present a new regularizer for multitask regression called Group Ordered Weighted l1 (GrOWL). Another key contribution of our paper is a novel application to fMRI brain imaging. Representational Similarity Analysis (RSA) is a tool for testing whether localized brain regions encode perceptual similarities. Using GrOWL, we propose a new approach called Network RSA that can discover arbitrarily structured brain networks (possibly widely distributed and non-local) that encode similarity information. We show, in theory and fMRI experiments, how GrOWL deals with strongly correlated covariates.", "citation": "Not cited", "year": "2016", "departments": ["University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Manchester", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "University of Wisconsin-Madison", "Division of Neu ... Psychology (L5)", "Division of Neu ... Psychology (L5)"], "conf": "icml", "authors": ["Urvashi Oswal.....http://dblp.org/pers/hd/o/Oswal:Urvashi", "Christopher R. Cox.....http://dblp.org/pers/hd/c/Cox:Christopher_R=", "Matthew A. Lambon Ralph.....http://dblp.org/pers/hd/r/Ralph:Matthew_A=_Lambon", "Timothy T. Rogers.....http://dblp.org/pers/hd/r/Rogers:Timothy_T=", "Robert D. Nowak.....http://dblp.org/pers/hd/n/Nowak:Robert_D="], "pages": 9}