{"title": "How Limited Interaction Hinders Real Communication (and What It Means for Proof and Circuit Complexity).", "fields": ["directed acyclic graph", "boolean circuit", "communication complexity", "circuit complexity", "proof complexity"], "abstract": "We obtain the first true size-space trade-offs for the cutting planes proof system, where the upper bounds hold for size and total space for derivations with constantsize coefficients, and the lower bounds apply to length and formula space (i.e., number of inequalities in memory) even for derivations with exponentially large coefficients. These are also the first trade-offs to hold uniformly for resolution, polynomial calculus and cutting planes, thus capturing the main methods of reasoning used in current state-of-the-art SAT solvers. We prove our results by a reduction to communication lower bounds in a round-efficient version of the real communication model of [Kraj´iˇcek ’98], drawing on and extending techniques in [Raz and McKenzie ’99] and [G¨o¨os et al. ’15]. The communication lower bounds are in turn established by a reduction to trade-offs between cost and number of rounds in the game of [Dymond and Tompa ’85] played on directed acyclic graphs. As a by-product of the techniques developed to show these proof complexity trade-off results, we also obtain an exponential separation between monotone-ACi1 and monotone-ACi, improving exponentially over the superpolynomial separation in [Raz and McKenzie ’99]. That is, we give an explicit Boolean function that can be computed by monotone Boolean circuits of depth logi n and polynomial size, but for which circuits of depth O(logi1 n) require exponential size.", "citation": "Citations (5)", "departments": ["University of São Paulo", "Royal Institute of Technology", "Royal Institute of Technology"], "authors": ["Susanna F. de Rezende.....http://dblp.org/pers/hd/r/Rezende:Susanna_F=_de", "Jakob Nordström.....http://dblp.org/pers/hd/n/Nordstr=ouml=m:Jakob", "Marc Vinyals.....http://dblp.org/pers/hd/v/Vinyals:Marc"], "conf": "focs", "year": "2016", "pages": 10}