{"title": "Understanding Dominant Factors for Precipitation over the Great Lakes Region.", "fields": ["geopotential height", "random permutation", "precipitation", "feature selection", "permutation"], "abstract": "Statistical modeling of local precipitation involves understanding local, regional and global factors informative of precipitation variability in a region. Modern machine learning methods for feature selection can potentially be explored for identifying statistically significant features from pool of potential predictors of precipitation. In this work, we consider sparse regression, which simultaneously performs feature selection and regression, followed by random permutation tests for selecting dominant factors. We consider average winter precipitation over Great Lakes Region in order to identify its dominant influencing factors. Experiments show that global climate indices, computed at different temporal lags, offer predictive information for winter precipitation. Further, among the dominant factors identified using randomized permutation tests, multiple climate indices indicate the influence of geopotential height patterns on winter precipitation. Using composite analysis, we illustrate that certain patterns are indeed typical in high and low precipitation years, and offer plausible scientific reasons for variations in precipitation. Thus, feature selection methods can be useful in identifying influential climate processes and variables, and thereby provide useful hypotheses over physical mechanisms affecting local precipitation.", "citation": "Not cited", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "University of Minnesota"], "authors": ["Soumyadeep Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Soumyadeep", "Stefan Liess.....http://dblp.org/pers/hd/l/Liess:Stefan", "Arindam Banerjee.....http://dblp.org/pers/hd/b/Banerjee:Arindam", "Vipin Kumar.....http://dblp.org/pers/hd/k/Kumar:Vipin"], "conf": "aaai", "year": "2016", "pages": 7}