{"title": "Shorter-is-Better: Venue Category Estimation from Micro-Video.", "fields": ["clips", "multimedia", "data mining", "leverage", "modalities"], "abstract": "According to our statistics on over 2 million micro-videos, only 1.22% of them are associated with venue information, which greatly hinders the location-oriented applications and personalized services. To alleviate this problem, we aim to label the bite-sized video clips with venue categories. It is, however, nontrivial due to three reasons: 1) no available benchmark dataset; 2) insufficient information, low quality, and 3) information loss; and 3) complex relatedness among venue categories. Towards this end, we propose a scheme comprising of two components. In particular, we first crawl a representative set of micro-videos from Vine and extract a rich set of features from textual, visual and acoustic modalities. We then, in the second component, build a tree-guided multi-task multi-modal learning model to estimate the venue category for each unseen micro-video. This model is able to jointly learn a common space from multi-modalities and leverage the predefined Foursquare hierarchical structure to regularize the relatedness among venue categories. Extensive experiments have well-validated our model. As a side research contribution, we have released our data, codes and involved parameters.", "citation": "Citations (15)", "departments": ["Communication University of China", "National University of Singapore", "National University of Singapore", "National University of Singapore", "Communication University of China"], "authors": ["Jianglong Zhang.....http://dblp.org/pers/hd/z/Zhang:Jianglong", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Xiang Wang.....http://dblp.org/pers/hd/w/Wang:Xiang", "Xiangnan He.....http://dblp.org/pers/hd/h/He_0001:Xiangnan", "Xianglin Huang.....http://dblp.org/pers/hd/h/Huang:Xianglin", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2016", "pages": 10}