{"title": "Estimating latency and concurrency of asynchronous real-time interactive systems using model checking.", "fields": ["latency", "profiling", "asynchronous communication", "concurrency", "abstraction model checking"], "abstract": "This article introduces model checking as an alternative method to estimate the latency and parallelism of asynchronous Realtime Interactive Systems (RISs). Five typical concurrency and synchronization schemes often found in concurrent Virtual Reality (VR) and computer game systems are identified as use-cases. These use-cases guide the development a) of software primitives necessary for the use-case implementation based on asynchronous RIS architectures and b) of a graphical editor for the specification of various concurrency and synchronization schemes (including the use-cases) based on these primitives. Several model-checking tools are evaluated against typical requirements in the RIS area. As a result, the formal model checking language Rebeca and its model checker RMC are applied to the specification of the use-cases to estimate latency and parallelism for each case. The estimations are compared to measured results achieved by classical profiling from a real-world application. The estimated results of the latencies by model checking approximated the measured results adequately with a minimal difference of 3.9% in the best case and −26.8% in the worst case. It also detected a problematic execution path not covered by the stochastic nature of the measured profiling samples. The estimated results of the degree of parallelization by model checking are approximated with an minimal difference of 9.3% and a maximal difference of −28.8%. Finally, the effort of model checking is compared to the effort of implementing and profiling a RIS.", "citation": "Not cited", "departments": ["Beuth Hochschul ... Berlin, Germany", "Universität Würzburg, Germany", "Beuth Hochschul ... Berlin, Germany"], "authors": ["Stephan Rehfeld.....http://dblp.org/pers/hd/r/Rehfeld:Stephan", "Marc Erich Latoschik.....http://dblp.org/pers/hd/l/Latoschik:Marc_Erich", "Henrik Tramberend.....http://dblp.org/pers/hd/t/Tramberend:Henrik"], "conf": "vr", "year": "2016", "pages": 10}