{"title": "Using the Shapley Value to Analyze Algorithm Portfolios.", "fields": ["shapley value", "machine learning", "mathematical economics", "portfolio", "mathematics", "mathematical optimization", "strengths and weaknesses"], "abstract": "Algorithms for NP-complete problems often have different strengths and weaknesses, and thus algorithm portfolios often outperform individual algorithms. It is surprisingly difficult to quantify a component algorithm's contribution to such a portfolio. Reporting a component's standalone performance wrongly rewards near-clones while penalizing algorithms that have small but distinct areas of strength. Measuring a component's marginal contribution to an existing portfolio is better, but penalizes sets of strongly correlated algorithms, thereby obscuring situations in which it is essential to have at least one algorithm from such a set. This paper argues for analyzing component algorithm contributions via a measure drawn from coalitional game theory—the Shapley value—and yields insight into a research community's progress over time. We conclude with an application of the analysis we advocate to SAT competitions, yielding novel insights into the behaviour of algorithm portfolios, their components, and the state of SAT solving technology.", "citation": "Not cited", "departments": ["University of Oxford", "Masdar Institute of Science and Technology", "University of British Columbia", "University of British Columbia", "University of Warsaw", "Masdar Institute of Science and Technology", "University of British Columbia", "Unversity of British Columbia", "Unversity of British Columbia", "Unversity of British Columbia"], "authors": ["Alexandre Fréchette.....http://dblp.org/pers/hd/f/Fr=eacute=chette:Alexandre", "Lars Kotthoff.....http://dblp.org/pers/hd/k/Kotthoff:Lars", "Tomasz P. Michalak.....http://dblp.org/pers/hd/m/Michalak:Tomasz_P=", "Talal Rahwan.....http://dblp.org/pers/hd/r/Rahwan:Talal", "Holger H. Hoos.....http://dblp.org/pers/hd/h/Hoos:Holger_H=", "Kevin Leyton-Brown.....http://dblp.org/pers/hd/l/Leyton=Brown:Kevin"], "conf": "aaai", "year": "2016", "pages": 7}