{"title": "Overcoming open source project entry barriers with a portal for newcomers.", "fields": ["onboarding", "technology acceptance model", "software bug", "barriers to entry", "documentation"], "abstract": "Community-based Open Source Software (OSS) projects are usually self-organized and dynamic, receiving contributions from distributed volunteers. Newcomer are important to the survival, long-term success, and continuity of these communities. However, newcomers face many barriers when making their first contribution to an OSS project, leading in many cases to dropouts. Therefore, a major challenge for OSS projects is to provide ways to support newcomers during their first contribution. In this paper, we propose and evaluate FLOSScoach, a portal created to support newcomers to OSS projects. FLOSScoach was designed based on a conceptual model of barriers created in our previous work. To evaluate the portal, we conducted a study with 65 students, relying on qualitative data from diaries, self-efficacy questionnaires, and the Technology Acceptance Model. The results indicate that FLOSScoach played an important role in guiding newcomers and in lowering barriers related to the orientation and contribution process, whereas it was not effective in lowering technical barriers. We also found that FLOSScoach is useful, easy to use, and increased newcomers' confidence to contribute. Our results can help project maintainers on deciding the points that need more attention in order to help OSS project newcomers overcome entry barriers.", "citation": "Citations (22)", "departments": ["Federal University of Technology - Paraná", "Federal University of Amazonas", "University of São Paulo", "University of São Paulo"], "authors": ["Igor Steinmacher.....http://dblp.org/pers/hd/s/Steinmacher:Igor", "Tayana Uchôa Conte.....http://dblp.org/pers/hd/c/Conte:Tayana_Uch=ocirc=a", "Christoph Treude.....http://dblp.org/pers/hd/t/Treude:Christoph", "Marco Aurélio Gerosa.....http://dblp.org/pers/hd/g/Gerosa:Marco_Aur=eacute=lio"], "conf": "icse", "year": "2016", "pages": 12}