{"title": "A size-free CLT for poisson multinomials and its applications.", "fields": ["poisson distribution", "total variation", "central limit theorem", "laplace operator", "multinomial distribution"], "abstract": "An ( n , k )- Poisson Multinomial Distribution  (PMD) is the distribution of the sum of  n  independent random vectors supported on the set     B   k  ={ e  1 ,…, e   k  } of standard basis vectors in ℝ  k  . We show that any ( n , k )-PMD is  poly ( k /σ)-close in total variation distance to the (appropriately discretized) multi-dimensional Gaussian with the same first two moments, removing the dependence on  n  from the Central Limit Theorem of Valiant and Valiant. Interestingly, our CLT is obtained by bootstrapping the Valiant-Valiant CLT itself through the structural characterization of PMDs shown in recent work by Daskalakis, Kamath and Tzamos. In turn, our stronger CLT can be leveraged to obtain an efficient PTAS for approximate Nash equilibria in anonymous games, significantly improving the state of the art, and matching qualitatively the running time dependence on  n  and 1/є of the best known algorithm for two-strategy anonymous games. Our new CLT also enables the construction of covers for the set of ( n , k )-PMDs, which are proper and whose size is shown to be essentially optimal. Our cover construction combines our CLT with the Shapley-Folkman theorem and recent sparsification results for Laplacian matrices by Batson, Spielman, and Srivastava. Our cover size lower bound is based on an algebraic geometric construction. Finally, leveraging the structural properties of the Fourier spectrum of PMDs we show that these distributions can be learned from  O   k  (1/є 2 ) samples in  poly   k  (1/є)-time, removing the quasi-polynomial dependence of the running time on 1/є from prior work.", "citation": "Citations (14)", "year": "2016", "departments": ["Massachusetts Institute of Technology", "Northwestern University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "stoc", "authors": ["Constantinos Daskalakis.....http://dblp.org/pers/hd/d/Daskalakis:Constantinos", "Anindya De.....http://dblp.org/pers/hd/d/De:Anindya", "Gautam Kamath.....http://dblp.org/pers/hd/k/Kamath:Gautam", "Christos Tzamos.....http://dblp.org/pers/hd/t/Tzamos:Christos"], "pages": 13}