{"title": "Traffic at-a-glance: Time-bounded analytics on large visual traffic data.", "fields": ["heuristic", "big data", "locality of reference", "analytics", "batch processing", "traffic analysis"], "abstract": "Massive visual traffic data have become available recently. Though it opens the realm of intelligent traffic analysis, processing the data in a timely manner is difficult yet critical to time sensitive decisions, which are typical to traffic related management. In this paper, we study time-bounded aggregation analytics on large visual traffic data including traffic images and videos. We first find that current MapReduce framework can not work well due to two challenges: first, significant dual diversities exist on data distributions and processing time; second, apriori knowledge on these distributions and time costs are not always available. However, we also observe spatial and temporal locality on data values and processing time. Based on the examination, we design Traffic At-a-Glance (TaG), an augmented MapReduce framework for time-bounded traffic analytics jobs. Particularly, we propose a novel sampling algorithm that exploits traffic data localities and stratifies samples based on data distributions and processing time. It runs in an iterative, adaptive manner without apriori knowledge. Moreover, we propose a heuristic scheduling algorithm with considerations of batch processing overhead. Further, we refine the load balancing mechanism based on data processing time locality to respect job time bounds. In addition, we extend TaG to well handle traffic videos by sampling video data based on motion information encoded in the videos. We implement TaG on Hadoop and conduct extensive experiments on a large visual traffic dataset. The evaluations on different data sizes show TaG is able to achieve high accuracy within time bounds.", "citation": "Not cited", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Xinfeng Li.....http://dblp.org/pers/hd/l/Li:Xinfeng", "Gang Li.....http://dblp.org/pers/hd/l/Li:Gang", "Fan Yang.....http://dblp.org/pers/hd/y/Yang:Fan", "Jin Teng.....http://dblp.org/pers/hd/t/Teng:Jin", "Dong Xuan.....http://dblp.org/pers/hd/x/Xuan:Dong", "Biao Chen.....http://dblp.org/pers/hd/c/Chen:Biao"], "conf": "infocom", "year": "2016", "pages": 9}