{"title": "A data driven scheduling approach for power management on HPC systems.", "fields": ["power management", "flow shop scheduling", "round robin scheduling", "two level scheduling", "fair share scheduling", "scheduling", "data driven", "search engine", "fixed priority pre emptive scheduling", "rate monotonic scheduling"], "abstract": "Modern schedulers running on HPC systems traditionally consider the number of resources and the time requested for each job that is to be executed when making scheduling decisions. Until recently this has been sufficient, however as systems get larger, other metrics like power consumption become necessary to ensure system stability.   In this paper, we propose a data driven scheduling approach for controlling the power consumption of the entire system under any user defined budget. Here, \"data driven\" means that our approach actively observes, analyzes, and assesses power behaviors of the system and user jobs to guide scheduling decisions for power management. This design is based on the key observation that HPC jobs have distinct power profiles. Our work contains an empirical analysis of workload power characteristics on a production system, dynamic learner to estimate the job power profile for scheduling, and an online power-aware scheduler for managing the overall system power. Using real workload traces, we demonstrate that our design effectively controls system power consumption while minimizing the impact on system utilization.", "citation": "Not cited", "departments": ["Illinois Institute of Technology", "Illinois Institute of Technology", "Argonne National Laboratory", "Argonne National Laboratory", "Argonne National Laboratory"], "authors": ["Sean Wallace.....http://dblp.org/pers/hd/w/Wallace:Sean", "Xu Yang.....http://dblp.org/pers/hd/y/Yang:Xu", "Venkatram Vishwanath.....http://dblp.org/pers/hd/v/Vishwanath:Venkatram", "William E. Allcock.....http://dblp.org/pers/hd/a/Allcock:William_E=", "Susan Coghlan.....http://dblp.org/pers/hd/c/Coghlan:Susan", "Michael E. Papka.....http://dblp.org/pers/hd/p/Papka:Michael_E=", "Zhiling Lan.....http://dblp.org/pers/hd/l/Lan:Zhiling"], "conf": "sc", "year": "2016", "pages": 11}