{"title": "Interference-aware time-based fairness for multihop wireless networks.", "fields": ["constructive", "max min fairness", "fairness measure", "fair queuing", "maximum throughput scheduling"], "abstract": "We consider the problem of maximizing performance in multihop wireless networks while achieving fairness among flows. While time-based fairness has been widely recognized as the appropriate fairness mechanism in single-hop wireless networks, no analogous notion has been developed for multihop wireless networks. We define the first general notion of time-based fairness for multihop networks by abstracting a network into a virtual single-hop network and applying the single-hop time-based fairness notion. This produces rate shares for each flow in the network, and we develop a constructive method for achieving these rate shares through physical-interference-aware scheduling. When combined with an appropriate link transmission policy, this scheduling approach preserves the time-based-fair rate shares for flows even with spatial reuse and the resulting rate reductions that occur among concurrent links. To our best knowledge, this is the first constructive approach for achieving fair rate shares in multihop wireless networks with or without interference consideration. We also prove that, with an appropriate scheduling algorithm, this approach produces an aggregate rate that is within a constant factor of the maximum aggregate rate subject to time-based fairness. Finally, we perform extensive simulations, which show that our approach as much as doubles the aggregate rate of a solution that approximates max-min fairness, while achieving a more natural fairness property.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Massachusetts Institute of Technology", "Istituto di Inf ... he, Pisa, Italy"], "authors": ["Douglas M. Blough.....http://dblp.org/pers/hd/b/Blough:Douglas_M=", "Giovanni Resta.....http://dblp.org/pers/hd/r/Resta:Giovanni", "Paolo Santi.....http://dblp.org/pers/hd/s/Santi:Paolo"], "conf": "infocom", "year": "2016", "pages": 9}