{"title": "\"It's like living with a friendly stranger\": perceptions of personality traits in a smart home.", "fields": ["trait", "internet of things", "socialization", "big five personality traits", "home automation"], "abstract": "Interacting with smart homes and Internet of Things devices is still far from being a seamless experience as there are often many different interfaces involved. Due to the improvements of speech recognition and synthesis, voice-based agents are becoming more common to give users a unified interface to different individual systems. These agents often exhibit human-like personality traits, such as responding in a humorous way or showing caring behavior in reminders. We are exploring this approach in the context of smart homes and home automation. Should a smart home have a proactive or passive personality? Should it try to socialize with inhabitants? What personality traits do people consider desirable or undesirable? To learn more about this design space, we created two variants of a usage scenario of a domestic routine in a smart home to demonstrate different personality trait combinations. Forty-one participants experienced the scenario and provided feedback about the designs. In this paper, we report findings about participants' preferences, how they responded to the proactive and social behavior our prototype demonstrated and implications for the design of agent-based interfaces in the home.", "citation": "Citations (7)", "departments": ["University of Zurich", "University of Zurich", "University of Zurich", "University of Zurich", "University of Zurich"], "authors": ["Sarah Mennicken.....http://dblp.org/pers/hd/m/Mennicken:Sarah", "Oliver Zihler.....http://dblp.org/pers/hd/z/Zihler:Oliver", "Frida Juldaschewa.....http://dblp.org/pers/hd/j/Juldaschewa:Frida", "Veronika Molnar.....http://dblp.org/pers/hd/m/Molnar:Veronika", "David Aggeler.....http://dblp.org/pers/hd/a/Aggeler:David", "Elaine May Huang.....http://dblp.org/pers/hd/h/Huang:Elaine_May"], "conf": "huc", "year": "2016", "pages": 12}