{"title": "Private spatial data aggregation in the local setting.", "fields": ["mobile device", "differential privacy", "data element", "mobile technology", "privacy software"], "abstract": "With the deep penetration of the Internet and mobile devices, privacy preservation in the local setting has become increasingly relevant. The local setting refers to the scenario where a user is willing to share his/her information only if it has been properly sanitized before leaving his/her own device. Moreover, a user may hold only a single data element to share, instead of a database. Despite its ubiquitousness, the above constraints make the local setting substantially more challenging than the traditional centralized or distributed settings. In this paper, we initiate the study of private spatial data aggregation in the local setting, which finds its way in many real-world applications, such as Waze and Google Maps. In response to users' varied privacy requirements that are natural in the local setting, we propose a new privacy model called personalized local differential privacy (PLDP) that allows to achieve desirable utility while still providing rigorous privacy guarantees. We design an efficient personalized count estimation protocol as a building block for achieving PLDP and give theoretical analysis of its utility, privacy and complexity. We then present a novel framework that allows an untrusted server to accurately learn the user distribution over a spatial domain while satisfying PLDP for each user. This is mainly achieved by designing a novel user group clustering algorithm tailored to our problem. We confirm the effectiveness and efficiency of our framework through extensive experiments on multiple real benchmark datasets.", "citation": "Citations (11)", "departments": ["Samsung", "Emory University", "RMIT University", "Samsung", "Samsung"], "authors": ["Rui Chen.....http://dblp.org/pers/hd/c/Chen:Rui", "Haoran Li.....http://dblp.org/pers/hd/l/Li:Haoran", "A. K. Qin.....http://dblp.org/pers/hd/q/Qin:A=_K=", "Shiva Prasad Kasiviswanathan.....http://dblp.org/pers/hd/k/Kasiviswanathan:Shiva_Prasad", "Hongxia Jin.....http://dblp.org/pers/hd/j/Jin:Hongxia"], "conf": "icde", "year": "2016", "pages": 12}