{"title": "CertiKOS: An Extensible Architecture for Building Certified Concurrent OS Kernels.", "fields": ["kernel", "correctness", "hybrid kernel", "kernel preemption", "process management"], "abstract": "Complete formal verification of a non-trivial concurrent OS kernel is widely considered a grand challenge. We present a novel compositional approach for building certified concurrent OS kernels. Concurrency allows interleaved execution of kernel/user modules across different layers of abstraction. Each such layer can have a different set of observable events. We insist on formally specifying these layers and their observable events, and then verifying each kernel module at its proper abstraction level. To support certified linking with other CPUs or threads, we prove a strong contextual refinement property for every kernel function, which states that the implementation of each such function will behave like its specification under any kernel/user context with any valid interleaving. We have successfully developed a practical concurrent OS kernel and verified its (contextual) functional correctness in Coq. Our certified kernel is written in 6500 lines of C and x86 assembly and runs on stock x86 multicore machines. To our knowledge, this is the first proof of functional correctness of a complete, general-purpose concurrent OS kernel with fine-grained locking.", "citation": "Citations (26)", "year": "2016", "departments": ["Yale University", "Yale University", "Yale University", "Yale University", "Yale University"], "conf": "osdi", "authors": ["Ronghui Gu.....http://dblp.org/pers/hd/g/Gu:Ronghui", "Zhong Shao.....http://dblp.org/pers/hd/s/Shao:Zhong", "Hao Chen.....http://dblp.org/pers/hd/c/Chen_0023:Hao", "Xiongnan (Newman) Wu.....http://dblp.org/pers/hd/w/Wu:Xiongnan_=Newman=", "Jieung Kim.....http://dblp.org/pers/hd/k/Kim:Jieung", "Vilhelm Sjöberg.....http://dblp.org/pers/hd/s/Sj=ouml=berg:Vilhelm", "David Costanzo.....http://dblp.org/pers/hd/c/Costanzo:David"], "pages": 17}