{"title": "SCMon: Leveraging segment routing to improve network monitoring.", "fields": ["hazy sighted link state routing protocol", "source routing", "routing domain", "equal cost multi path routing", "path vector protocol"], "abstract": "To guarantee correct operation of their networks, operators have to promptly detect and diagnose data-plane issues, like broken interface cards or link failures. Networks are becoming more complex, with a growing number of Equal Cost MultiPath (ECMP) and link bundles. Hence, some data-plane problems (e.g. silent packet dropping at one router) can hardly be detected with control-plane protocols or simple monitoring tools like ping or traceroute. In this paper, we propose a new technique, called SCMon, that enables continuous monitoring of the data-plane, in order to track the health of all routers and links. SCMon leverages the recently proposed Segment Routing (SR) architecture to monitor the entire network with a single box (and no additional monitoring protocol). In particular, SCMon uses SR to (i) force monitoring probes to travel over cycles; and (ii) test parallel links and bundles at a per-link granularity. We present original algorithms to compute cycles that cover all network links with a limited number of SR segments. Further, we prototype and evaluate SCMon both with simulations and Linux-based emulations. Our experiments show that SCMon quickly detects and precisely pinpoints data-plane problems, with a limited overhead.", "citation": "Citations (7)", "departments": ["Université catholique de Louvain", "Université catholique de Louvain", "Université catholique de Louvain", "Université catholique de Louvain", "Université catholique de Louvain"], "authors": ["Francois Aubry.....http://dblp.org/pers/hd/a/Aubry:Francois", "David Lebrun.....http://dblp.org/pers/hd/l/Lebrun:David", "Stefano Vissicchio.....http://dblp.org/pers/hd/v/Vissicchio:Stefano", "Minh Thanh Khong.....http://dblp.org/pers/hd/k/Khong:Minh_Thanh", "Yves Deville.....http://dblp.org/pers/hd/d/Deville:Yves", "Olivier Bonaventure.....http://dblp.org/pers/hd/b/Bonaventure:Olivier"], "conf": "infocom", "year": "2016", "pages": 9}