{"title": "Flexfly: enabling a reconfigurable dragonfly through silicon photonics.", "fields": ["latency", "world wide web", "dragonfly", "silicon photonics", "speedup", "computer engineering", "bandwidth allocation", "hop", "search engine"], "abstract": "The Dragonfly topology provides low-diameter connectivity for high-performanceleb computing with all-to-all global links at the inter-group level. Our traffic matrix characterization of various scientific applications shows consistent mismatch between the imbalanced group-to-group traffic and the uniform global bandwidth allocation of Dragonfly. Though adaptive routing has been proposed to utilize bandwidth of non-minimal paths, increased hops and cross-group interference lower efficiency. This work presents a photonic architecture, Flexfly, which \"trades\" global links among groups using low-radix Silicon photonic switches. With transparent optical switching, Flexfly reconfigures the inter-group topology based on traffic pattern, stealing additional  direct  bandwidth for communication-intensive group pairs. Simulations with applications such as GTC, Nekbone and LULESH show up to 1.8x speedup over Dragonfly paired with UGAL routing, along with halved hop count and latency for cross-group messages. We built a 32-node Flexfly prototype using a Silicon photonic switch connecting four groups and demonstrated 820 ns interconnect reconfiguration time.", "citation": "Not cited", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "authors": ["Ke Wen.....http://dblp.org/pers/hd/w/Wen:Ke", "Payman Samadi.....http://dblp.org/pers/hd/s/Samadi:Payman", "Sébastien Rumley.....http://dblp.org/pers/hd/r/Rumley:S=eacute=bastien", "Christine P. Chen.....http://dblp.org/pers/hd/c/Chen:Christine_P=", "Yiwen Shen.....http://dblp.org/pers/hd/s/Shen:Yiwen", "Meisam Bahadori.....http://dblp.org/pers/hd/b/Bahadori:Meisam", "Keren Bergman.....http://dblp.org/pers/hd/b/Bergman:Keren", "Jeremiah J. Wilke.....http://dblp.org/pers/hd/w/Wilke:Jeremiah_J="], "conf": "sc", "year": "2016", "pages": 12}