{"title": "Fast and Concurrent RDF Queries with RDMA-Based Distributed Graph Exploration.", "fields": ["data migration", "low latency", "graph database", "remote direct memory access", "sparql"], "abstract": "Many public knowledge bases are represented and stored as RDF graphs, where users can issue structured queries on such graphs using SPARQL. With massive queries over large and constantly growing RDF data, it is imperative that an RDF graph store should provide low latency and high throughput for concurrent query processing. However, prior systems still experience high per-query latency over large datasets and most prior designs have poor resource utilization such that each query is processed in sequence.\n\nWe present Wukong, a distributed graph-based RDF store that leverages RDMA-based graph exploration to provide highly concurrent and low-latency queries over large data sets. Wukong is novel in three ways. First, Wukong provides an RDMA-friendly distributed key/- value store that provides differentiated encoding and fine-grained partitioning of graph data to reduce RDMA transfers. Second, Wukong leverages full-history pruning to avoid the cost of expensive final join operations, based on the observation that the cost of one-sided RDMA operations is largely oblivious to the payload size to a certain extent. Third, countering conventional wisdom of preferring migration of execution over data, Wukong seamlessly combines data migration for low latency and execution distribution for high throughput by leveraging the low latency and high throughput of one-sided RDMA operations, and proposes a worker-obliger model for efficient load balancing.\n\nEvaluation on a 6-node RDMA-capable cluster shows that Wukong significantly outperforms state-of-the-art systems like TriAD and Trinity.RDF for both latency and throughput, usually at the scale of orders of magnitude.", "citation": "Citations (14)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Utah"], "authors": ["Jiaxin Shi.....http://dblp.org/pers/hd/s/Shi:Jiaxin", "Youyang Yao.....http://dblp.org/pers/hd/y/Yao:Youyang", "Rong Chen.....http://dblp.org/pers/hd/c/Chen_0001:Rong", "Haibo Chen.....http://dblp.org/pers/hd/c/Chen:Haibo", "Feifei Li.....http://dblp.org/pers/hd/l/Li_0001:Feifei"], "conf": "osdi", "year": "2016", "pages": 16}