{"title": "CacheDedup: In-line Deduplication for Flash Caching.", "fields": ["cache invalidation", "cache algorithms", "data deduplication", "smart cache", "cache pollution"], "abstract": "Flash caching has emerged as a promising solution to the scalability problems of storage systems by using fast flash memory devices as the cache for slower primary storage. But its adoption faces serious obstacles due to the limited capacity and endurance of flash devices. This paper presents CacheDedup, a solution that addresses these limitations using in-line deduplication. First, it proposes a novel architecture that integrates the caching of data and deduplication metadata (source addresses and fingerprints of the data) and efficiently manages these two components. Second, it proposes duplication-aware cache replacement algorithms (D-LRU, DARC) to optimize both cache performance and endurance. The paper presents a rigorous analysis of the algorithms to prove that they do not waste valuable cache space and that they are efficient in time and space usage. The paper also includes an experimental evaluation using real-world traces, which confirms that CacheDedup substantially improves I/O performance (up to 20% reduction in miss ratio and 51% in latency) and flash endurance (up to 89% reduction in writes sent to the cache device) compared to traditional cache management. It also shows that the proposed architecture and algorithms can be extended to support the combination of compression and deduplication for flash caching and improve its performance and endurance.", "citation": "Citations (8)", "departments": ["Arizona State University", "Florida International University", "Florida International University", "Florida International University", "Rensselaer Polytechnic Institute"], "authors": ["Wenji Li.....http://dblp.org/pers/hd/l/Li:Wenji", "Gregory Jean-Baptise.....http://dblp.org/pers/hd/j/Jean=Baptise:Gregory", "Juan Riveros.....http://dblp.org/pers/hd/r/Riveros:Juan", "Giri Narasimhan.....http://dblp.org/pers/hd/n/Narasimhan:Giri", "Tony Zhang.....http://dblp.org/pers/hd/z/Zhang:Tony", "Ming Zhao.....http://dblp.org/pers/hd/z/Zhao_0002:Ming"], "conf": "fast", "year": "2016", "pages": 14}