{"title": "Tagger: Deep Unsupervised Perceptual Grouping.", "fields": ["convergence", "differentiable function", "inference", "perception", "modalities"], "abstract": "We present a framework for efficient perceptual inference that explicitly reasons about the segmentation of its inputs and features. Rather than being trained for any specific segmentation, our framework learns the grouping process in an unsupervised manner or alongside any supervised task. We enable a neural network to group the representations of different objects in an iterative manner through a differentiable mechanism. We achieve very fast convergence by allowing the system to amortize the joint iterative inference of the groupings and their representations. In contrast to many other recently proposed methods for addressing multi-object scenes, our system does not assume the inputs to be images and can therefore directly handle other modalities. We evaluate our method on multi-digit classification of very cluttered images that require texture segmentation. Remarkably our method achieves improved classification performance over convolutional networks despite being fully connected, by making use of the grouping mechanism. Furthermore, we observe that our system greatly improves upon the semi-supervised result of a baseline Ladder network on our dataset. These results are evidence that grouping is a powerful tool that can help to improve sample efficiency.", "citation": "Citations (76)", "departments": ["Dalle Molle Institute for Artificial Intelligence Research", "Aalto University", "Dalle Molle Institute for Artificial Intelligence Research"], "authors": ["Klaus Greff.....http://dblp.org/pers/hd/g/Greff:Klaus", "Antti Rasmus.....http://dblp.org/pers/hd/r/Rasmus:Antti", "Mathias Berglund.....http://dblp.org/pers/hd/b/Berglund:Mathias", "Tele Hotloo Hao.....http://dblp.org/pers/hd/h/Hao:Tele_Hotloo", "Harri Valpola.....http://dblp.org/pers/hd/v/Valpola:Harri", "Jürgen Schmidhuber.....http://dblp.org/pers/hd/s/Schmidhuber:J=uuml=rgen"], "conf": "nips", "year": "2016", "pages": 9}