{"title": "Face Model Compression by Distilling Knowledge from Neurons.", "fields": ["domain knowledge", "deep learning", "software deployment", "inference", "computation"], "abstract": "The recent advanced face recognition systems were built on large Deep Neural Networks (DNNs) or their ensembles, which have millions of parameters. However, the expensive computation of DNNs make their deployment difficult on mobile and embedded devices. This work addresses model compression for face recognition, where the learned knowledge of a large teacher network or its ensemble is utilized as supervision to train a compact student network. Unlike previous works that represent the knowledge by the soften label probabilities, which are difficult to fit, we represent the knowledge by using the neurons at the higher hidden layer, which preserve as much information as the label probabilities, but are more compact. By leveraging the essential characteristics (domain knowledge) of the learned face representation, a neuron selection method is proposed to choose neurons that are most relevant to face recognition. Using the selected neurons as supervision to mimic the single networks of DeepID2+ and DeepID3, which are the state-of-the-art face recognition systems, a compact student with simple network structure achieves better verification accuracy on LFW than its teachers, respectively. When using an ensemble of DeepID2+ as teacher, a mimicked student is able to outperform it and achieves 51.6× compression ratio and 90× speed-up in inference, making this cumbersome model applicable on portable devices.", "citation": "Citations (11)", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Ping Luo.....http://dblp.org/pers/hd/l/Luo_0002:Ping", "Zhenyao Zhu.....http://dblp.org/pers/hd/z/Zhu:Zhenyao", "Ziwei Liu.....http://dblp.org/pers/hd/l/Liu_0002:Ziwei", "Xiaogang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaogang", "Xiaoou Tang.....http://dblp.org/pers/hd/t/Tang:Xiaoou"], "conf": "aaai", "year": "2016", "pages": 7}