{"title": "High-precision shortest distance estimation for large-scale social networks.", "fields": ["breadth first search", "matrix decomposition", "pairwise comparison", "k shortest path routing", "outlier"], "abstract": "Over the past decades, many large-scale social network systems, such as Facebook and Twitter, have been deployed in different countries. How to efficiently analyze the topological characteristics of large-scale social networks has been a challenging problem in the research community. One of the critical topological characteristics is the shortest distance between two nodes in a network. The existing shortest distance algorithms, such as Breadth First Search (BFS), work well with small networks. For a network with billions of nodes, calculating the pairwise shortest distances with these algorithms requires an overlong period of time. In this paper, we present a high-precision ShOrtest Distance Approximation (SODA) scheme, which utilizes a small set of pre-calculated distances to estimate the shortest distance between each pair of nodes in large-scale social networks. Compared with the existing shortest distance estimation schemes for social networks, SODA leads to high estimation accuracy since it utilizes a novel optimization method, Robust Discrete Matrix Decomposition (RDMD), to eliminate the impact of significant errors/outliers and generate the coordinates of the nodes in a network simultaneously. In addition, SODA differentiates the asymmetric distances in directed graphs. Consequently, SODA works well with both directed and undirected social networks. Finally, SODA only involves convex optimization. Therefore, SODA is highly competitive in terms of computation complexity. Our experimental results indicate that SODA outperforms the state-of-the-art shortest distance estimation schemes in terms of estimation accuracy and running time.", "citation": "Not cited", "departments": ["University of Prince Edward Island", "Harbin Institute of Technology Shenzhen Graduate School", "University of Prince Edward Island", "Harbin Institute of Technology Shenzhen Graduate School"], "authors": ["Jie Cheng.....http://dblp.org/pers/hd/c/Cheng:Jie", "Yangyang Zhang.....http://dblp.org/pers/hd/z/Zhang:Yangyang", "Qiang Ye.....http://dblp.org/pers/hd/y/Ye:Qiang", "Hongwei Du.....http://dblp.org/pers/hd/d/Du:Hongwei"], "conf": "infocom", "year": "2016", "pages": 9}