{"title": "LTE in unlicensed spectrum: are we there yet?", "fields": ["multi user mimo", "phy", "lte in unlicensed spectrum", "ieee 802 11ac", "spectrum management"], "abstract": "In this work, we explore the potential and impact of unlicensed LTE on WiFi in unlicensed spectrum. Our experiments demonstrate that the large  asymmetry  in the channel access methodologies employed by WiFi and LTE (carrier sensing/notification in WiFi, energy sensing alone in LTE-U), can result LTE-U completely blocking WiFi transmissions, and causing significant degradation to either technologies from collisions.   We address this critical sensing asymmetry with U ltron , a LTE-WiFi co-existence solution that integrates WiFi's carrier sensing and notification mechanisms into LTE, without any modifications to the LTE PHY standard. Ultron operates at the LTE base station and consists of two key components: (a)  WiFi embedding  that embeds appropriate data into the LTE-subframes through an intelligent reverse-engineering of the LTE PHY, so as to realize a WiFi PLCP preamble-header transmission over the air directly using the LTE PHY; and (b)  scalable WiFi sensing  that employs a single WiFi interface and maximizes its carrier sensing benefits to all the unlicensed channels operating at the LTE node. Our evaluations demonstrate that U ltron  can increase the WiFi and LTE throughput by 5x and 6x respectively, resulting from a sharp reduction in LTE-WiFi interference.", "citation": "Citations (10)", "departments": ["Mobile Communic ... atories America", "Mobile Communic ... atories America", "Mobile Communic ... atories America", "Mobile Communic ... atories America"], "authors": ["Eugene Chai.....http://dblp.org/pers/hd/c/Chai:Eugene", "Karthik Sundaresan.....http://dblp.org/pers/hd/s/Sundaresan:Karthik", "Mohammad Amir Khojastepour.....http://dblp.org/pers/hd/k/Khojastepour:Mohammad_Amir", "Sampath Rangarajan.....http://dblp.org/pers/hd/r/Rangarajan:Sampath"], "conf": "mobicom", "year": "2016", "pages": 14}