{"title": "Distributed optimization in energy harvesting sensor networks with dynamic in-network data processing.", "fields": ["energy harvesting", "sensor node", "stochastic optimization", "key distribution in wireless sensor networks", "network utility"], "abstract": "Energy Harvesting Wireless Sensor Networks (EH-WSNs) have been attracting increasing interest in recent years. Most current EH-WSN approaches focus on sensing and networking algorithm design, and therefore only consider the energy consumed by sensors and wireless transceivers for sensing and data transmissions respectively. In this paper, we incorporate CPU-intensive edge operations that constitute in-network data processing (e.g. data aggregation/fusion/compression) with sensing and networking; to jointly optimize their performance, while ensuring sustainable network operation (i.e. no sensor node runs out of energy). Based on realistic energy and network models, we formulate a stochastic optimization problem, and propose a lightweight on-line algorithm, namely Recycling Wasted Energy (RWE), to solve it. Through rigorous theoretical analysis, we prove that RWE achieves asymptotical optimality, bounded data queue size, and sustainable network operation. We implement RWE on a popular IoT operating system, Contiki OS, and evaluate its performance using both real-world experiments based on the FIT IoT-LAB testbed, and extensive trace-driven simulations using Cooja. The evaluation results verify our theoretical analysis, and demonstrate that RWE can recycle more than 90% wasted energy caused by battery overflow, and achieve around 300% network utility gain in practical EH-WSNs.", "citation": "Citations (8)", "departments": ["University of Liverpool", "Imperial College London", "Imperial College London", "University of Liverpool", "Imperial College London"], "authors": ["Shusen Yang.....http://dblp.org/pers/hd/y/Yang:Shusen", "Yad Tahir.....http://dblp.org/pers/hd/t/Tahir:Yad", "Po-Yu Chen.....http://dblp.org/pers/hd/c/Chen:Po=Yu", "Alan Marshall.....http://dblp.org/pers/hd/m/Marshall:Alan", "Julie A. McCann.....http://dblp.org/pers/hd/m/McCann:Julie_A="], "conf": "infocom", "year": "2016", "pages": 9}