{"title": "WalkieLokie: sensing relative positions of surrounding presenters by acoustic signals.", "fields": ["positioning system", "direction finding", "augmented reality", "robustness", "ranging"], "abstract": "In this paper, we propose and implement WalkieLokie, a novel acoustic-based relative positioning system. WalkieLokie facilitates a multitude of Augmented Reality (AR) applications: users with smart devices can passively acquire surrounding information in real time, similar to the commercial AR system Wikitude; the surrounding presenters, who want to share information or introduce themselves, can actively launch the function on demand. The key rational of WalkieLokie is that a user can perceive a series of spatial-related acoustic signals emitted from a presenter, which depicts the relation position between the user and the presenter. The proliferation of smart devices, together with the cheap accessory ( e.g. , dummy speaker) embedded in daily used items ( e.g. , smart clothes), paves the way for WalkieLokie applications. We design a novel algorithm to estimate the position and signal processing methods to support accurate positioning. The experiment results show that the mean error of ranging and direction estimation is 0.63m and 2.46 degrees respectively. Extensive experiments conducted in noisy environments validate the robustness of WalkieLokie.", "citation": "Citations (2)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China"], "authors": ["Wenchao Huang.....http://dblp.org/pers/hd/h/Huang:Wenchao", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Yan Xiong.....http://dblp.org/pers/hd/x/Xiong:Yan", "Panlong Yang.....http://dblp.org/pers/hd/y/Yang:Panlong", "Yiqing Hu.....http://dblp.org/pers/hd/h/Hu:Yiqing", "XuFei Mao.....http://dblp.org/pers/hd/m/Mao:XuFei", "Fuyou Miao.....http://dblp.org/pers/hd/m/Miao:Fuyou", "Baohua Zhao.....http://dblp.org/pers/hd/z/Zhao:Baohua", "Ju-Min Zhao.....http://dblp.org/pers/hd/z/Zhao:Ju=Min"], "conf": "huc", "year": "2016", "pages": 12}