{"title": "Counterexample Guided Abstraction Refinement for Stability Analysis.", "fields": ["counterexample", "bounded function", "existential quantification", "first order logic", "predicate abstraction"], "abstract": "In this paper, we present a counterexample guided abstraction refinement (Cegar) algorithm for stability analysis of polyhedral hybrid systems. Our results build upon a quantitative predicate abstraction and model-checking algorithm for stability analysis, which returns a counterexample indicating a potential reason for instability. The main contributions of this paper include the validation of the counterexample and refinement of the abstraction based on the analysis of the counterexample. The counterexample returned by the quantitative predicate abstraction analysis is a cycle such that the product of the weights on its edges is greater than 1. Validation involves checking if there exists an infinite diverging execution which follows the cycle infinitely many times. Unlike in the case of Cegar for safety, the validation problem is not a bounded model-checking problem. Using novel insights, we present a simple characterization for the existence of an infinite diverging execution in terms of the satisfaction of a first order logic formula which can be efficiently solved. Similarly, the refinement is more involved, since, there is a priori no bound on the number of predecessor computation steps that need to be performed to invalidate the abstract counterexample. We present strategies for refinement based on the insights from the validation step. We have implemented the validation and refinement algorithms and use the stability verification tool Averist in the back end for performing the abstraction and model-checking. We compare the Cegar algorithm with Averist and report experimental results demonstrating the benefits of counterexample guided refinement.", "citation": "Citations (5)", "year": "2016", "departments": ["Kansas State University", "Technical University of Madrid"], "conf": "cav", "authors": ["Pavithra Prabhakar.....http://dblp.org/pers/hd/p/Prabhakar:Pavithra", "Miriam Garcia Soto.....http://dblp.org/pers/hd/s/Soto:Miriam_Garcia"], "pages": 18}