{"title": "A hybrid framework combining solar energy harvesting and wireless charging for wireless sensor networks.", "fields": ["mobile wireless sensor network", "wi fi array", "fixed wireless", "wireless site survey", "key distribution in wireless sensor networks"], "abstract": "Recently, there have been a growing number of applications that power wireless sensor networks (WSNs) by wireless charging technology. Although previous studies indicate that wireless charging can deliver energy reliably, it still faces regulatory challenges to provide high power density without incurring health risks. In particular, in clustered WSNs there exists a mismatch between the high energy demands from cluster heads and the relatively low energy supplies that wireless charging can provide. Fortunately, solar energy harvesting can provide high power density which is also risk-free. However, it is subject to weather dynamics. Therefore, in this paper, we propose a hybrid framework that combines the two technologies — cluster heads are equipped with solar panels to scavenge solar energy and the rest of nodes are powered by wireless charging. First, we study a placement problem on how to deploy solar-powered cluster heads that can minimize overall cost and propose a distributed 1.61(1 + ∊)2-approximation algorithm for the placement. Second, we establish an energy balance in the network and explore how to maintain such balance when sunlight is unavailable. Third, we consider combining wireless charging and mobile data gathering in a joint tour in such networks, and propose a polynomial-time scheduling algorithm. Our extensive simulation demonstrates that the hybrid framework can reduce battery depletion by 20% and save system cost by 25% compared to previous results.", "citation": "Citations (15)", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Stony Brook University"], "authors": ["Cong Wang.....http://dblp.org/pers/hd/w/Wang_0006:Cong", "Ji Li.....http://dblp.org/pers/hd/l/Li_0001:Ji", "Yuanyuan Yang.....http://dblp.org/pers/hd/y/Yang:Yuanyuan", "Fan Ye.....http://dblp.org/pers/hd/y/Ye_0003:Fan"], "conf": "infocom", "year": "2016", "pages": 9}