{"title": "Detecting and localizing end-to-end performance degradation for cellular data services.", "fields": ["service provider", "data as a service", "training set", "application software", "troubleshooting", "software deployment", "association rule learning", "end to end principle"], "abstract": "Nowadays mobile device (e.g., smartphone) users not only have a high expectation on the availability of the cellular data service, but also increasingly depend on the high end-to-end (E2E) performance of their applications. Since the E2E performance of individual application sessions may vary greatly, depending on factors such as the cellular network condition, the content provider, the type/model of the mobile devices, and the application software, detecting and localizing service performance degradations in a timely manner at large scale is of great value to cellular service providers. In this paper, we build a holistic measurement system that tracks session-level E2E performance metrics along with the service attributes for these factors. Using data collected from a major cellular service provider, we first model the expected E2E service performance with a regression based approach, detect performance degradation conditions based on the time series of fine-grained measurement data, and finally localize the service degradation using association-rule-mining techniques. Our deployment experience reveals that in 80% of the detected problem instances, performance degradation can be attributed to non-network-location specific factors, such as a common content provider, or a set of applications running on certain models of devices.", "citation": "Not cited", "departments": ["Michigan State University", "AT&T Labs", "AT&T Labs", "Michigan State University", "AT&T Labs", "Michigan State University", "AT&T Labs", "AT&T Labs", "Michigan State University", "AT&T Labs"], "authors": ["Faraz Ahmed.....http://dblp.org/pers/hd/a/Ahmed:Faraz", "Jeffrey Erman.....http://dblp.org/pers/hd/e/Erman:Jeffrey", "Zihui Ge.....http://dblp.org/pers/hd/g/Ge:Zihui", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Jia Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jia", "He Yan.....http://dblp.org/pers/hd/y/Yan:He"], "conf": "infocom", "year": "2016", "pages": 9}