{"title": "Information source detection in networks: Possibility and impossibility results.", "fields": ["binary logarithm", "fat tree", "snapshot", "k ary tree", "exponential tree"], "abstract": "This paper studies information source detection in networks under the independent cascade (IC) model. Assume the spread of information starts from a single source in a network and a complete snapshot of the network is obtained at some time. The goal is to identify the source based on the observation. We derive the maximum a posterior (MAP) estimator of the source for tree networks and propose a Short-Fat Tree (SFT) algorithm for general networks based on the MAP estimator. The algorithm selects the Jordan infection center [1] and breaks ties according the degree of boundary infected nodes. Loosely speaking, the algorithm selects the node such that the breadth-first search (BFS) tree from it has the minimum depth but the maximum number of leaf nodes. On the Erdos-Renyi (ER) random graph, we establish the following possibility and impossibility results: (i) when the infection duration   0.5, SFT identifies the source with probability 1 (w.p.1) asymptotically (as network size increases to infinity), where n is the network size and μ is the average node degree; (ii) when the infection duration > ⌈log n/ log μ ⌉ + 2, the probability of identifying the source approaches zero asymptotically under any algorithm; and (iii) when infection duration   0, asymptotically, at least 1−δ fraction of the nodes on the BFS tree starting from the source are leaf-nodes, where δ = 3√log n/μ, i.e., the BFS tree starting from the actual source is a fat tree. 1Numerical experiments on tree networks, the ER random graphs and real world networks with different evaluation metrics show that the SFT algorithm outperforms existing algorithms.", "citation": "Citations (5)", "departments": ["Arizona State University", "Arizona State University"], "authors": ["Kai Zhu.....http://dblp.org/pers/hd/z/Zhu:Kai", "Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei"], "conf": "infocom", "year": "2016", "pages": 9}