{"title": "HyperDepth: Learning Depth from Structured Light without Matching.", "fields": ["random forest", "structured light", "stereo camera", "multipath propagation", "correspondence problem"], "abstract": "Structured light sensors are popular due to their robustness to untextured scenes and multipath. These systems triangulate depth by solving a correspondence problem between each camera and projector pixel. This is often framed as a local stereo matching task, correlating patches of pixels in the observed and reference image. However, this is computationally intensive, leading to reduced depth accuracy and framerate. We contribute an algorithm for solving this correspondence problem efficiently, without compromising depth accuracy. For the first time, this problem is cast as a classification-regression task, which we solve extremely efficiently using an ensemble of cascaded random forests. Our algorithm scales in number of disparities, and each pixel can be processed independently, and in parallel. No matching or even access to the corresponding reference pattern is required at runtime, and regressed labels are directly mapped to depth. Our GPU-based algorithm runs at a 1KHz for 1.3MP input/output images, with disparity error of 0.1 subpixels. We show a prototype high framerate depth camera running at 375Hz, useful for solving tracking-related problems. We demonstrate our algorithmic performance, creating high resolution real-time depth maps that surpass the quality of current state of the art depth technologies, highlighting quantization-free results with reduced holes, edge fattening and other stereo-based depth artifacts.", "citation": "Citations (17)", "year": "2016", "departments": ["Istituto Italiano di Tecnologia", "Microsoft", "Microsoft", "Cornell University", "Microsoft"], "conf": "cvpr", "authors": ["Sean Ryan Fanello.....http://dblp.org/pers/hd/f/Fanello:Sean_Ryan", "Christoph Rhemann.....http://dblp.org/pers/hd/r/Rhemann:Christoph", "Vladimir Tankovich.....http://dblp.org/pers/hd/t/Tankovich:Vladimir", "Adarsh Kowdle.....http://dblp.org/pers/hd/k/Kowdle:Adarsh", "Sergio Orts-Escolano.....http://dblp.org/pers/hd/o/Orts=Escolano:Sergio", "David Kim.....http://dblp.org/pers/hd/k/Kim:David", "Shahram Izadi.....http://dblp.org/pers/hd/i/Izadi:Shahram"], "pages": 10}