{"title": "Computing Connected Components with linear communication cost in pregel-like systems.", "fields": ["analytics", "spark", "connected component", "big data", "total cost"], "abstract": "The paper studies two fundamental problems in graph analytics: computing Connected Components (CCs) and computing BiConnected Components (BCCs) of a graph. With the recent advent of Big Data, developing effcient distributed algorithms for computing CCs and BCCs of a big graph has received increasing interests. As with the existing research efforts, in this paper we focus on the Pregel programming model, while the techniques may be extended to other programming models including MapReduce and Spark. The state-of-the-art techniques for computing CCs and BCCs in Pregel incur O(m × #supersteps) total costs for both data communication and computation, where m is the number of edges in a graph and #supersteps is the number of supersteps. Since the network communication speed is usually much slower than the computation speed, communication costs are the dominant costs of the total running time in the existing techniques. In this paper, we propose a new paradigm based on graph decomposition to reduce the total communication costs from O(m×#supersteps) to O(m), for both computing CCs and computing BCCs. Moreover, the total computation costs of our techniques are smaller than that of the existing techniques in practice, though theoretically they are almost the same. Comprehensive empirical studies demonstrate that our approaches can outperform the existing techniques by one order of magnitude regarding the total running time.", "citation": "Citations (6)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "University of Technology, Sydney", "University of New South Wales"], "authors": ["Xing Feng.....http://dblp.org/pers/hd/f/Feng:Xing", "Lijun Chang.....http://dblp.org/pers/hd/c/Chang:Lijun", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Lu Qin.....http://dblp.org/pers/hd/q/Qin:Lu", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie"], "conf": "icde", "year": "2016", "pages": 12}