{"title": "Community Detection on Evolving Graphs.", "fields": ["cure data clustering algorithm", "canopy clustering algorithm", "constrained clustering", "flame clustering", "brown clustering"], "abstract": "Clustering is a fundamental step in many information-retrieval and data-mining applications. Detecting clusters in graphs is also a key tool for finding the community structure in social and behavioral networks. In many of these applications, the input graph evolves over time in a continual and decentralized manner, and, to maintain a good clustering, the clustering algorithm needs to repeatedly probe the graph. Furthermore, there are often limitations on the frequency of such probes, either imposed explicitly by the online platform (e.g., in the case of crawling proprietary social networks like twitter) or implicitly because of resource limitations (e.g., in the case of crawling the web). In this paper, we study a model of clustering on evolving graphs that captures this aspect of the problem. Our model is based on the classical stochastic block model, which has been used to assess rigorously the quality of various static clustering methods. In our model, the algorithm is supposed to reconstruct the planted clustering, given the ability to query for small pieces of local information about the graph, at a limited rate. We design and analyze clustering algorithms that work in this model, and show asymptotically tight upper and lower bounds on their accuracy. Finally, we perform simulations, which demonstrate that our main asymptotic results hold true also in practice.", "citation": "Citations (3)", "departments": ["Sapienza University of Rome", "Google", "Sapienza University of Rome", "Yahoo!"], "authors": ["Aris Anagnostopoulos.....http://dblp.org/pers/hd/a/Anagnostopoulos:Aris", "Jakub Lacki.....http://dblp.org/pers/hd/l/Lacki:Jakub", "Silvio Lattanzi.....http://dblp.org/pers/hd/l/Lattanzi:Silvio", "Stefano Leonardi.....http://dblp.org/pers/hd/l/Leonardi:Stefano", "Mohammad Mahdian.....http://dblp.org/pers/hd/m/Mahdian:Mohammad"], "conf": "nips", "year": "2016", "pages": 9}