{"title": "Realizing the Fault-Tolerance Promise of Cloud Storage Using Locks with Intent.", "fields": ["snippet", "snapshot", "optimistic concurrency control", "atomicity", "cloud storage"], "abstract": "Cloud computing promises easy development and deployment of large-scale, fault tolerant, and highly available applications. Cloud storage services are a key enabler of this, because they provide reliability, availability, and fault tolerance via internal mechanisms that developers need not reason about. Despite this, challenges remain for distributed cloud applications developers. They still need to make their code robust against failures of the machines running the code, and to reason about concurrent access to cloud storage by multiple machines.\n\nWe address this problem with a new abstraction, called locks with intent, which we implement in a client library called Olive. Olive makes minimal assumptions about the underlying cloud storage, enabling it to operate on a variety of platforms including Amazon DynamoDB and Microsoft Azure Storage. Leveraging the underlying cloud storage, Olive's locks with intent offer strong exactly-once semantics for a snippet of code despite failures and concurrent duplicate executions.\n\nTo ensure exactly-once semantics, Olive incurs the unavoidable overhead of additional logging writes. However, by decoupling isolation from atomicity, it supports consistency levels ranging from eventual to transactional. This flexibility allows applications to avoid costly transactional mechanisms when weaker semantics suffice. We apply Olive's locks with intent to build several advanced storage functionalities, including snapshots, transactions via optimistic concurrency control, secondary indices, and live table re-partitioning. Our experience demonstrates that Olive eases the burden of creating correct, fault-tolerant distributed cloud applications.", "citation": "Citations (1)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Srinath T. V. Setty.....http://dblp.org/pers/hd/s/Setty:Srinath_T=_V=", "Chunzhi Su.....http://dblp.org/pers/hd/s/Su:Chunzhi", "Jacob R. Lorch.....http://dblp.org/pers/hd/l/Lorch:Jacob_R=", "Lidong Zhou.....http://dblp.org/pers/hd/z/Zhou:Lidong", "Hao Chen.....http://dblp.org/pers/hd/c/Chen:Hao", "Parveen Patel.....http://dblp.org/pers/hd/p/Patel:Parveen", "Jinglei Ren.....http://dblp.org/pers/hd/r/Ren:Jinglei"], "conf": "osdi", "year": "2016", "pages": 16}