{"title": "Lasagna: towards deep hierarchical understanding and searching over mobile sensing data.", "fields": ["deep learning", "activity recognition", "mobile device", "artificial neural network", "machine learning"], "abstract": "The proliferation of mobile devices has enabled extensive mobile-data supported applications,  e.g. , exercise and activity recognition and quantification. Typically, these applications need predefined features and are only applicable to predefined activities. In this work, we address the issue of deep understanding of arbitrary activities and semantic searching of any activity over massive mobile sensing data. The challenges stem from the rich dynamics and the wide-spectrum of activities that a human being could perform. We propose a hierarchical activity representation, extract common bases of motion data in an unsupervised manner by leveraging the power of deep neural networks, and propose a universal multi-resolution representation for all activities without prior knowledge. Based on this representation, we design an innovative system  Lasagna  to manage and search motion data semantically. We implement a prototype system and our comprehensive evaluations show that our system can achieve highly accurate activity classification (with precision 98.9%) and search (with recall almost 100% and precision about 90%) over a diverse set of activities.", "citation": "Citations (7)", "departments": ["Tsinghua University", "University of Science and Technology of China", "Tsinghua University", "Tsinghua University", "University of Science and Technology of China"], "authors": ["Cihang Liu.....http://dblp.org/pers/hd/l/Liu:Cihang", "Lan Zhang.....http://dblp.org/pers/hd/z/Zhang:Lan", "Zongqian Liu.....http://dblp.org/pers/hd/l/Liu:Zongqian", "Kebin Liu.....http://dblp.org/pers/hd/l/Liu:Kebin", "Xiangyang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiangyang", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "mobicom", "year": "2016", "pages": 14}