{"title": "Minfer: A method of inferring motif statistics from sampled edges.", "fields": ["strength of a graph", "graph bandwidth", "distance hereditary graph", "complement graph", "null graph"], "abstract": "Characterizing motif (i.e., locally connected sub-graph patterns) statistics is important for understanding complex networks such as online social networks and communication networks. Previous work made the strong assumption that the graph topology of interest is known in advance. In practice, sometimes researchers have to deal with the situation where the graph topology is unknown because it is expensive to collect and store all topological and meta information. Hence, typically what is available to researchers is only a snapshot of the graph, i.e., a subgraph of the graph. Crawling methods such as breadth first sampling can be used to generate the snapshot. However, these methods fail to sample a streaming graph represented as a high speed stream of edges. Therefore, graph mining applications such as network traffic monitoring use random edge sampling (i.e., sample each edge with a fixed probability) to collect edges and generate a sampled graph, which we called a “RESampled graph”. Clearly, a RESampled graph's motif statistics may be quite different from those of the underlying original graph. To resolve this, we propose a framework and implement a system called Minfer, which takes the given RESampled graph and accurately infers the underlying graph's motif statistics. We also apply Fisher information to bound the errors of our estimates. Experiments using large scale datasets show the accuracy and efficiency of our method.", "citation": "Citations (9)", "departments": ["Xi'an Jiaotong University", "The Chinese University of Hong Kong", "University of Massachusetts Amherst", "Xi'an Jiaotong University"], "authors": ["Pinghui Wang.....http://dblp.org/pers/hd/w/Wang:Pinghui", "John C. S. Lui.....http://dblp.org/pers/hd/l/Lui:John_C=_S=", "Donald F. Towsley.....http://dblp.org/pers/hd/t/Towsley:Donald_F=", "Junzhou Zhao.....http://dblp.org/pers/hd/z/Zhao:Junzhou"], "conf": "icde", "year": "2016", "pages": 12}