{"title": "A Bayesian method for reducing bias in neural representational similarity analysis.", "fields": ["generative model", "spurious relationship", "bayes estimator", "covariance", "similarity matrix"], "abstract": "In neuroscience, the similarity matrix of neural activity patterns in response to different sensory stimuli or under different cognitive states reflects the structure of neural representational space. Existing methods derive point estimations of neural activity patterns from noisy neural imaging data, and the similarity is calculated from these point estimations. We show that this approach translates structured noise from estimated patterns into spurious bias structure in the resulting similarity matrix, which is especially severe when signal-to-noise ratio is low and experimental conditions cannot be fully randomized in a cognitive task. We propose an alternative Bayesian framework for computing representational similarity in which we treat the covariance structure of neural activity patterns as a hyper-parameter in a generative model of the neural data, and directly estimate this covariance structure from imaging data while marginalizing over the unknown activity patterns. Converting the estimated covariance structure into a correlation matrix offers a much less biased estimate of neural representational similarity. Our method can also simultaneously estimate a signal-to-noise map that informs where the learned representational structure is supported more strongly, and the learned covariance matrix can be used as a structured prior to constrain Bayesian estimation of neural activity patterns. Our code is freely available in Brain Imaging Analysis Kit (Brainiak) (https://github.com/IntelPNI/brainiak), a python toolkit for brain imaging analysis.", "citation": "Citations (5)", "departments": ["Princeton University", "Princeton University", "Princeton University", "Princeton University"], "authors": ["Mingbo Cai.....http://dblp.org/pers/hd/c/Cai:Mingbo", "Nicolas W. Schuck.....http://dblp.org/pers/hd/s/Schuck:Nicolas_W=", "Jonathan W. Pillow.....http://dblp.org/pers/hd/p/Pillow:Jonathan_W=", "Yael Niv.....http://dblp.org/pers/hd/n/Niv:Yael"], "conf": "nips", "year": "2016", "pages": 9}