{"title": "Elastic multi-resource fairness: balancing fairness and efficiency in coupled CPU-GPU architectures.", "fields": ["distributed computing", "central processing unit", "pareto efficiency", "max min fairness", "symmetric multiprocessor system", "fairness measure", "simulation", "search engine"], "abstract": "Fairness and efficiency are two important concerns for users in a shared computer system, and there tends to be a tradeoff between them. Heterogeneous computing poses new challenging issues on the fair allocation of computational resources among users due to the availability of different kinds of computing devices (e.g., CPU and GPU). Prior work either considers the fair resource allocation separately for each computing device or is unable to balance flexibly the tradeoff between the fairness and system utilization.   In this work, we consider an emerging heterogeneous computing system with coupled CPU and GPU into a single chip. We first show that it is essential to have a new fair policy for coupled CPU-GPU architectures that is capable of considering both the CPU and the GPU as a whole in fair resource allocation and being aware of the system utilization maximization. We then propose a fair policy called Elastic Multi-Resource Fairness (EMRF) for coupled CPU-GPU architectures, by modeling CPU and GPU as two resource types and viewing the resource fairness problem as a multi-resource fairness problem. It extends DRF by adding a knob that allows users to tune and balance fairness and performance flexibly, and considers the fair allocation of computational resources as a whole for CPU and GPU devices. We show that EMRF satisfies fairness properties of  sharing incentive, envy-freeness  and  pareto efficiency.  Finally, we evaluate EMRF using real experiments, and the results show that EMRF can achieve better performance and fairness.", "citation": "Not cited", "departments": ["Tianjin University", "National University of Singapore", "Nanyang Technological University", "SAP Research &  ... tion, Singapore"], "authors": ["Shanjiang Tang.....http://dblp.org/pers/hd/t/Tang:Shanjiang", "Bingsheng He.....http://dblp.org/pers/hd/h/He:Bingsheng", "Shuhao Zhang.....http://dblp.org/pers/hd/z/Zhang:Shuhao", "Zhaojie Niu.....http://dblp.org/pers/hd/n/Niu:Zhaojie"], "conf": "sc", "year": "2016", "pages": 12}