{"title": "On signaling power: Communications over wireless energy.", "fields": ["rf power amplifier", "modulation", "radio frequency", "transmission", "physical layer"], "abstract": "Wireless RF power transmission from dedicated Energy Transmitters (ETs) is emerging as a promising approach to enable battery-less wireless networked sensor systems. However, when data communication and RF energy recharging occur in-band, sharing the RF medium and devoting separate access times for both operations raises architectural and protocol level challenges. This paper proposes a novel method of concurrent transmission of data and energy to solve this problem, allowing ETs to transmit energy and sensors to transmit data in the same band synchronously. Our key idea concerns devising a physical layer modulation scheme that allows the data transmitting node to introduce variations in the envelope of the energy signal at the intended recipient. We implemented a proof-of-concept receiver, modeled and validated through extensive experimentation. We then propose a new physical layer mechanism for guaranteed successful delivery of information in a point-to-point link. Quantitative results demonstrate the feasibility of joint energy-data transfer, along with its associated benefits and tradeoffs.", "citation": "Citations (2)", "departments": ["Polytechnic University of Catalonia", "Northeastern University", "Northeastern University", "Northeastern University", "Polytechnic University of Catalonia"], "authors": ["Raul Gomez Cid-Fuentes.....http://dblp.org/pers/hd/c/Cid=Fuentes:Raul_Gomez", "M. Yousof Naderi.....http://dblp.org/pers/hd/n/Naderi:M=_Yousof", "Stefano Basagni.....http://dblp.org/pers/hd/b/Basagni:Stefano", "Kaushik R. Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Kaushik_R=", "Albert Cabellos-Aparicio.....http://dblp.org/pers/hd/c/Cabellos=Aparicio:Albert", "Eduard Alarcón.....http://dblp.org/pers/hd/a/Alarc=oacute=n:Eduard"], "conf": "infocom", "year": "2016", "pages": 9}