{"title": "Online multi-stage decisions for robust power-grid operations under high renewable uncertainty.", "fields": ["polynomial", "renewable energy", "economic dispatch", "grid", "robustness"], "abstract": "In this paper, we are interested in online multistage decisions to ensure robust power grid operations under high renewable uncertainty. We jointly consider both the reliability assessment commitment (RAC) and the real-time dispatch problems. We first focus on the real-time dispatch problem and define “maximally robust algorithms,” which can provably ensure grid safety whenever there exists any other algorithm that can ensure grid safety under the same level of future uncertainty. We characterize a class of maximally robust algorithms using the concept of “safe dispatch set,” which also provides conditions for verifying grid safety for RAC. However, in general such safe dispatch sets may be difficult to compute. We then develop efficient computational algorithms for characterizing the safe dispatch sets. Specifically, for a simpler single-bus two-generator case, we show that the safe dispatch sets can be exactly characterized by a polynomial number of convex constraints. Then, based on this two-generator characterization, we develop a new solution for the multi-bus multi-generator case using the idea of virtual demand splitting (VDS), which can effectively compute a suitable subset of the safe-dispatch set. Our numerical results demonstrate that a VDS-based economic dispatch algorithm outperforms the standard economic dispatch algorithm in terms of robustness, without sacrificing economy.", "citation": "Citations (2)", "departments": ["Purdue University", "Purdue University", "Purdue University", "Purdue University", "The Chinese University of Hong Kong"], "authors": ["Shizhen Zhao.....http://dblp.org/pers/hd/z/Zhao:Shizhen", "Xiaojun Lin.....http://dblp.org/pers/hd/l/Lin:Xiaojun", "Dionysios Aliprantis.....http://dblp.org/pers/hd/a/Aliprantis:Dionysios", "Hugo N. Villegas.....http://dblp.org/pers/hd/v/Villegas:Hugo_N=", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua"], "conf": "infocom", "year": "2016", "pages": 9}