{"title": "Ambry: LinkedIn's Scalable Geo-Distributed Object Store.", "fields": ["clips", "latency", "asynchronous communication", "distributed object", "low latency"], "abstract": "The infrastructure beneath a worldwide social network has to continually serve billions of variable-sized media objects such as photos, videos, and audio clips. These objects must be stored and served with low latency and high throughput by a system that is geo-distributed, highly scalable, and load-balanced. Existing file systems and object stores face several challenges when serving such large objects. We present Ambry, a production-quality system for storing large immutable data (called blobs). Ambry is designed in a decentralized way and leverages techniques such as logical blob grouping, asynchronous replication, rebalancing mechanisms, zero-cost failure detection, and OS caching. Ambry has been running in LinkedIn's production environment for the past 2 years, serving up to 10K requests per second across more than 400 million users. Our experimental evaluation reveals that Ambry offers high efficiency (utilizing up to 88% of the network bandwidth), low latency (less than 50 ms latency for a 1 MB object), and load balancing (improving imbalance of request rate among disks by 8x-10x).", "citation": "Citations (9)", "year": "2016", "departments": ["University of Illinois at Urbana–Champaign", "LinkedIn", "LinkedIn", "LinkedIn", "LinkedIn"], "conf": "sigmod", "authors": ["Shadi A. Noghabi.....http://dblp.org/pers/hd/n/Noghabi:Shadi_A=", "Sriram Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Sriram", "Priyesh Narayanan.....http://dblp.org/pers/hd/n/Narayanan:Priyesh", "Sivabalan Narayanan.....http://dblp.org/pers/hd/n/Narayanan:Sivabalan", "Gopalakrishna Holla.....http://dblp.org/pers/hd/h/Holla:Gopalakrishna", "Mammad Zadeh.....http://dblp.org/pers/hd/z/Zadeh:Mammad", "Tianwei Li.....http://dblp.org/pers/hd/l/Li:Tianwei", "Indranil Gupta.....http://dblp.org/pers/hd/g/Gupta:Indranil", "Roy H. Campbell.....http://dblp.org/pers/hd/c/Campbell:Roy_H="], "pages": 13}