{"title": "Shuffler: Fast and Deployable Continuous Code Re-Randomization.", "fields": ["code reuse", "code injection", "spec", "exploit", "shuffling"], "abstract": "While code injection attacks have been virtually eliminated on modern systems, programs today remain vulnerable to code reuse attacks. Particularly pernicious are Just-In-Time ROP (JIT-ROP) techniques, where an attacker uses a memory disclosure vulnerability to discover code gadgets at runtime. We designed a code-reuse defense, called Shuffler, which continuously re-randomizes code locations on the order of milliseconds, introducing a real-time deadline on the attacker. This deadline makes it extremely difficult to form a complete exploit, particularly against server programs that often sit tens of milliseconds away from attacker machines.\n\nShuffler focuses on being fast, self-hosting, and nonintrusive to the end user. Specifically, for speed, Shuffler randomizes code asynchronously in a separate thread and atomically switches from one code copy to the next. For security, Shuffler adopts an \"egalitarian\" principle and randomizes itself the same way it does the target. Lastly, to deploy Shuffler, no source, kernel, compiler, or hardware modifications are necessary.\n\nEvaluation shows that Shuffler defends against all known forms of code reuse, including ROP, direct JIT-ROP, indirect JIT-ROP, and Blind ROP. We observed 14.9% overhead on SPEC CPU when shuffling every 50 ms, and ran Shuffler on real-world applications such as Nginx. We showed that the shuffled Nginx scales up to 24 worker processes on 12 cores.", "citation": "Citations (14)", "year": "2016", "departments": ["Columbia University", "Columbia University", "University of British Columbia", "Columbia University", "Columbia University"], "conf": "osdi", "authors": ["David Williams-King.....http://dblp.org/pers/hd/w/Williams=King:David", "Graham Gobieski.....http://dblp.org/pers/hd/g/Gobieski:Graham", "Kent Williams-King.....http://dblp.org/pers/hd/w/Williams=King:Kent", "James P. Blake.....http://dblp.org/pers/hd/b/Blake:James_P=", "Xinhao Yuan.....http://dblp.org/pers/hd/y/Yuan:Xinhao", "Patrick Colp.....http://dblp.org/pers/hd/c/Colp:Patrick", "Michelle Zheng.....http://dblp.org/pers/hd/z/Zheng:Michelle", "Vasileios P. Kemerlis.....http://dblp.org/pers/hd/k/Kemerlis:Vasileios_P=", "Junfeng Yang.....http://dblp.org/pers/hd/y/Yang:Junfeng", "William Aiello.....http://dblp.org/pers/hd/a/Aiello:William"], "pages": 16}