{"title": "gScale: Scaling up GPU Virtualization with Dynamic Sharing of Graphics Memory Space.", "fields": ["shadow", "graphics", "general purpose computing on graphics processing units", "virtualization", "central processing unit"], "abstract": "With increasing GPU-intensive workloads deployed on cloud, the cloud service providers are seeking for practical and efficient GPU virtualization solutions. However, the cutting-edge GPU virtualization techniques such as gVirt still suffer from the restriction of scalability, which constrains the number of guest virtual GPU instances.\n\nThis paper introduces gScale, a scalable GPU virtualization solution. By taking advantage of the GPU programming model, gScale presents a dynamic sharing mechanism which combines partition and sharing together to break the hardware limitation of global graphics memory space. Particularly, we propose three approaches for gScale: (1) the private shadow graphics translation table, which enables global graphics memory space sharing among virtual GPU instances, (2) ladder mapping and fence memory space pool, which allows the CPU to access host physical memory space (serving the graphics memory) bypassing global graphics memory space, (3) slot sharing, which improves the performance of vGPU under a high density of instances.\n\nThe evaluation shows that gScale scales up to 15 guest virtual GPU instances in Linux or 12 guest virtual GPU instances in Windows, which is 5x and 4x scalability, respectively, compared to gVirt. At the same time, gScale incurs a slight runtime overhead on the performance of gVirt when hosting multiple virtual GPU instances.", "citation": "Citations (5)", "departments": ["Shanghai Jiao Tong University", "Intel", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Mochi Xue.....http://dblp.org/pers/hd/x/Xue:Mochi", "Kun Tian.....http://dblp.org/pers/hd/t/Tian:Kun", "Yaozu Dong.....http://dblp.org/pers/hd/d/Dong:Yaozu", "Jiacheng Ma.....http://dblp.org/pers/hd/m/Ma:Jiacheng", "Jiajun Wang.....http://dblp.org/pers/hd/w/Wang:Jiajun", "Zhengwei Qi.....http://dblp.org/pers/hd/q/Qi:Zhengwei", "Bingsheng He.....http://dblp.org/pers/hd/h/He:Bingsheng", "Haibing Guan.....http://dblp.org/pers/hd/g/Guan:Haibing"], "conf": "usenix", "year": "2016", "pages": 12}