{"title": "Assessing social anxiety using gps trajectories and point-of-interest data.", "fields": ["global positioning system", "wearable computer", "social anxiety", "point of interest", "anxiety"], "abstract": "Mental health problems are highly prevalent and appear to be increasing in frequency and severity among the college student population. The upsurge in mobile and wearable wireless technologies capable of intense, longitudinal tracking of individuals, provide valuable opportunities to examine temporal patterns and dynamic interactions of key variables in mental health research. In this paper, we present a feasibility study leveraging non-invasive mobile sensing technology to passively assess college students' social anxiety, one of the most common disorders in the college student population. We have first developed a smartphone application to continuously track GPS locations of college students, then we built an analytic infrastructure to collect the GPS trajectories and finally we analyzed student behaviors (e.g. studying or staying at home) using Point-Of-Interest (POI). The whole framework supports intense, longitudinal, dynamic tracking of college students to evaluate how their anxiety and behaviors change in the college campus environment. The collected data provides critical information about how students' social anxiety levels and their mobility patterns are correlated. Our primary analysis based on 18 college students demonstrated that social anxiety level is significantly correlated with places students' visited and location transitions.", "citation": "Citations (8)", "departments": ["University of Virginia", "University of Virginia", "University of Virginia", "University of Virginia", "University of Virginia"], "authors": ["Yu Huang.....http://dblp.org/pers/hd/h/Huang:Yu", "Haoyi Xiong.....http://dblp.org/pers/hd/x/Xiong:Haoyi", "Kevin Leach.....http://dblp.org/pers/hd/l/Leach:Kevin", "Yuyan Zhang.....http://dblp.org/pers/hd/z/Zhang:Yuyan", "Philip Chow.....http://dblp.org/pers/hd/c/Chow:Philip", "Karl Fua.....http://dblp.org/pers/hd/f/Fua:Karl", "Bethany A. Teachman.....http://dblp.org/pers/hd/t/Teachman:Bethany_A=", "Laura E. Barnes.....http://dblp.org/pers/hd/b/Barnes:Laura_E="], "conf": "huc", "year": "2016", "pages": 6}