{"title": "Planar: Parallel lightweight architecture-aware adaptive graph repartitioning.", "fields": ["graph bandwidth", "graph", "breadth first search", "graph database", "graph partition"], "abstract": "Graph partitioning is an essential preprocessing step in distributed graph computation and scientific simulations. Existing well-studied graph partitioners are designed for static graphs, but real-world graphs, such as social networks and Web networks, keep changing dynamically. In fact, the communication and computation patterns of some graph algorithms may vary significantly, even across their different computation phases. This means that the optimal partitioning changes over time, requiring the graph to be repartitioned periodically to maintain good performance. However, the state-of-the-art graph (re)partitioners are known for their poor scalability against massive graphs. Furthermore, they usually assume a homogeneous and contention-free computing environment, which is no longer true in modern high performance computing infrastructures. In this paper, we introduce Planar, a parallel lightweight graph repartitioner, which does not require full knowledge of the graph and incrementally adapts the partitioning to changes while considering the heterogeneity and contentiousness of the underlying computing infrastructure. Using a diverse collection of datasets, we showed that, in comparison with the de-facto standard and two state-of-the-art streaming graph partitioning heuristics, Planar improved the quality of graph partitionings by up to 68%, 46%, and 69%, respectively. Furthermore, our experiments with an MPI implementation of Breadth First Search and Single Source Shortest Path showed that Planar achieved up to 10x speedups against the state-of-the-art streaming and multi-level graph (re)partitioners. Finally, we scaled Planar up to a graph with 3.6 billion edges.", "citation": "Citations (4)", "departments": ["University of Pittsburgh", "University of Pittsburgh", "University of Pittsburgh"], "authors": ["Angen Zheng.....http://dblp.org/pers/hd/z/Zheng:Angen", "Alexandros Labrinidis.....http://dblp.org/pers/hd/l/Labrinidis:Alexandros", "Panos K. Chrysanthis.....http://dblp.org/pers/hd/c/Chrysanthis:Panos_K="], "conf": "icde", "year": "2016", "pages": 12}