{"title": "Data Blocks: Hybrid OLTP and OLAP on Compressed Storage using both Vectorization and Compilation.", "fields": ["online analytical processing", "tuple", "vectorization", "sma", "online transaction processing"], "abstract": "This work aims at reducing the main-memory footprint in high performance hybrid OLTP & OLAP databases, while retaining high query performance and transactional throughput. For this purpose, an innovative compressed columnar storage format for cold data, called Data Blocks is introduced. Data Blocks further incorporate a new light-weight index structure called Positional SMA that narrows scan ranges within Data Blocks even if the entire block cannot be ruled out. To achieve highest OLTP performance, the compression schemes of Data Blocks are very light-weight, such that OLTP transactions can still quickly access individual tuples. This sets our storage scheme apart from those used in specialized analytical databases where data must usually be bit-unpacked. Up to now, high-performance analytical systems use either vectorized query execution or just-in-time (JIT) query compilation. The fine-grained adaptivity of Data Blocks necessitates the integration of the best features of each approach by an interpreted vectorized scan subsystem feeding into JIT-compiled query pipelines. Experimental evaluation of HyPer, our full-fledged hybrid OLTP & OLAP database system, shows that Data Blocks accelerate performance on a variety of query workloads while retaining high transaction throughput.", "citation": "Citations (25)", "year": "2016", "departments": ["Technische Universität München", "Technische Universität München", "Centrum Wiskunde & Informatica", "Technische Universität München", "Snowflake Compu ...  Mateo, CA, USA"], "conf": "sigmod", "authors": ["Harald Lang.....http://dblp.org/pers/hd/l/Lang:Harald", "Tobias Mühlbauer.....http://dblp.org/pers/hd/m/M=uuml=hlbauer:Tobias", "Florian Funke.....http://dblp.org/pers/hd/f/Funke:Florian", "Peter A. Boncz.....http://dblp.org/pers/hd/b/Boncz:Peter_A=", "Thomas Neumann.....http://dblp.org/pers/hd/n/Neumann_0001:Thomas", "Alfons Kemper.....http://dblp.org/pers/hd/k/Kemper:Alfons"], "pages": 16}