{"title": "Catch me in the dark: Effective privacy-preserving outsourcing of feature extractions over image data.", "fields": ["encryption", "server", "scale invariant feature transform", "private information retrieval", "outsourcing"], "abstract": "Advances in cloud computing have greatly motivated data owners to outsource their huge amount of personal multimedia data and/or computationally expensive tasks onto the semi-trusted cloud by leveraging its abundant resources for cost saving and flexibility. From the privacy perspective, however, the outsourced multimedia data and its originated applications may reveal the data owner's private information, such as the personal identity, locations or even financial profiles. This observation has recently aroused new research interest on privacy-preserving computations over outsourced multimedia data. In this paper, we propose an effective privacy-preserving computation outsourcing protocol for the prevailing scale-invariant feature transform (SIFT) over massive encrypted image data. We first show that previous solutions to this problem have either efficiency/security or practicality issues, and none can well preserve the important characteristics of the original SIFT in terms of distinctiveness and robustness. We for the first time present a new privacy-preserving outsourcing protocol for SIFT with the preservation of its key characteristics, by randomly splitting the original image data, carefully distributing the feature extraction computations to two independent cloud servers and further leveraging the garbled circuit for secure keypoints comparisons. We both carefully analyze and extensively evaluate the security and effectiveness of our design. The results show that our solution is practically secure, outperforms the state-of-the-art and performs comparably to the original SIFT in terms of various characteristics, including rotation invariance, image scale invariance, robust matching across affine distortion and change in 3D viewpoint.", "citation": "Citations (10)", "departments": ["Wuhan University", "Wuhan University", "University at Buffalo", "Wuhan University", "Wuhan University"], "authors": ["Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Shengshan Hu.....http://dblp.org/pers/hd/h/Hu:Shengshan", "Kui Ren.....http://dblp.org/pers/hd/r/Ren_0001:Kui", "Jingjun Wang.....http://dblp.org/pers/hd/w/Wang:Jingjun", "Zhibo Wang.....http://dblp.org/pers/hd/w/Wang:Zhibo", "Minxin Du.....http://dblp.org/pers/hd/d/Du:Minxin"], "conf": "infocom", "year": "2016", "pages": 9}