{"title": "Limited Discrepancy AND/OR Search and Its Application to Optimization Tasks in Graphical Models.", "fields": ["incremental heuristic search", "iterative deepening depth first search", "interpolation search", "ternary search tree", "dichotomic search"], "abstract": "Many combinatorial problems are solved with a Depth-First search (DFS) guided by a heuristic and it is well-known that this method is very fragile with respect to heuristic mistakes. One standard way to make DFS more robust is to search by increasing number of discrepancies. This approach has been found useful in several domains where the search structure is a height-bounded OR tree. In this paper we investigate the generalization of discrepancy-based search to AND/OR search trees and propose an extension of the Limited Discrepancy Search (LDS) algorithm. We demonstrate the relevance of our proposal in the context of Graphical Models. In these problems, which can be solved with either a standard OR search tree or an AND/OR tree, we show the superiority of our approach. For a fixed number of discrepancies, the search space visited by the AND/OR algorithm strictly contains the search space visited by standard LDS, and many more nodes can be visited due to the multiplicative effect of the AND/OR decomposition. Besides, if the AND/OR tree achieves a significant size reduction with respect to the standard OR tree, the cost of each iteration of the AND/OR algorithm is asymptotically lower than in standard LDS. We report experiments on the minsum problem on different domains and show that the AND/OR version of LDS usually obtains better solutions given the same CPU time.", "citation": "Citations (1)", "year": "2016", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "University of California, Irvine"], "conf": "ijcai", "authors": ["Javier Larrosa.....http://dblp.org/pers/hd/l/Larrosa:Javier", "Emma Rollon.....http://dblp.org/pers/hd/r/Rollon:Emma", "Rina Dechter.....http://dblp.org/pers/hd/d/Dechter:Rina"], "pages": 7}