{"title": "Gunrock: a high-performance graph processing library on the GPU.", "fields": ["general purpose computing on graphics processing units", "analytics", "cache oblivious algorithm", "cuda", "speedup"], "abstract": "For large-scale graph analytics on the GPU, the irregularity of data access/control flow and the complexity of programming GPUs have been two significant challenges for developing a programmable high-performance graph library. \"Gunrock,\" our high-level bulk-synchronous graph-processing system targeting the GPU, takes a new approach to abstracting GPU graph analytics: rather than designing an abstraction around  computation , Gunrock instead implements a novel  data-centric  abstraction centered on operations on a vertex or edge frontier. Gunrock achieves a balance between performance and expressiveness by coupling high-performance GPU computing primitives and optimization strategies with a high-level programming model that allows programmers to quickly develop new graph primitives with small code size and minimal GPU programming knowledge. We evaluate Gunrock on five graph primitives (BFS, BC, SSSP, CC, and PageRank) and show that Gunrock has on average at least an order of magnitude speedup over Boost and PowerGraph, comparable performance to the fastest GPU hardwired primitives, and better performance than any other GPU high-level graph library.", "citation": "Citations (146)", "year": "2016", "departments": ["University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis", "University of California, Davis"], "conf": "ppopp", "authors": ["Yangzihao Wang.....http://dblp.org/pers/hd/w/Wang:Yangzihao", "Andrew A. Davidson.....http://dblp.org/pers/hd/d/Davidson:Andrew_A=", "Yuechao Pan.....http://dblp.org/pers/hd/p/Pan:Yuechao", "Yuduo Wu.....http://dblp.org/pers/hd/w/Wu:Yuduo", "Andy Riffel.....http://dblp.org/pers/hd/r/Riffel:Andy", "John D. Owens.....http://dblp.org/pers/hd/o/Owens:John_D="], "pages": 12}