{"title": "Reed-Muller codes achieve capacity on erasure channels.", "fields": ["reed muller code", "online codes", "concatenated error correction code", "tornado code", "expander code", "fountain code"], "abstract": "We introduce a new approach to proving that a sequence of deterministic linear codes achieves capacity on an erasure channel under maximum a posteriori decoding. Rather than relying on the precise structure of the codes, our method exploits code symmetry. In particular, the technique applies to any sequence of linear codes where the block lengths are strictly increasing, the code rates converge, and the permutation group of each code is doubly transitive. In a nutshell, we show that symmetry alone implies near-optimal performance.     An important consequence of this result is that a sequence of Reed-Muller codes with increasing block length and converging rate achieves capacity. This possibility has been suggested previously in the literature, but it has only been proven for cases where the limiting code rate is 0 or 1. Moreover, these results extend naturally to affine-invariant codes and, thus, to all extended primitive narrow-sense BCH codes. This is used to resolve, in the affirmative, the existence question for capacity-achieving sequences of binary cyclic codes. The primary tools used in the proofs are the sharp threshold property for symmetric monotone boolean functions and the area theorem for extrinsic information transfer (EXIT) functions.", "citation": "Citations (23)", "year": "2016", "departments": ["Qualcomm", "Texas A&M University", "École Polytechnique Fédérale de Lausanne", "Duke University", "Intel", "Qualcomm", "Texas A&M University", "École Polytechnique Fédérale de Lausanne", "Duke University", "Intel"], "conf": "stoc", "authors": ["Shrinivas Kudekar.....http://dblp.org/pers/hd/k/Kudekar:Shrinivas", "Santhosh Kumar.....http://dblp.org/pers/hd/k/Kumar:Santhosh", "Marco Mondelli.....http://dblp.org/pers/hd/m/Mondelli:Marco", "Henry D. Pfister.....http://dblp.org/pers/hd/p/Pfister:Henry_D=", "Eren Sasoglu.....http://dblp.org/pers/hd/s/Sasoglu:Eren", "Rüdiger L. Urbanke.....http://dblp.org/pers/hd/u/Urbanke:R=uuml=diger_L="], "pages": 12}