{"title": "NOVA: A Log-structured File System for Hybrid Volatile/Non-volatile Main Memories.", "fields": ["journaling file system", "self certifying file system", "memory bus", "inode", "atomicity"], "abstract": "Fast non-volatile memories (NVMs) will soon appear on the processor memory bus alongside DRAM. The resulting hybrid memory systems will provide software with sub-microsecond, high-bandwidth access to persistent data, but managing, accessing, and maintaining consistency for data stored in NVM raises a host of challenges. Existing file systems built for spinning or solid-state disks introduce software overheads that would obscure the performance that NVMs should provide, but proposed file systems for NVMs either incur similar overheads or fail to provide the strong consistency guarantees that applications require.\n\nWe present NOVA, a file system designed to maximize performance on hybrid memory systems while providing strong consistency guarantees. NOVA adapts conventional log-structured file system techniques to exploit the fast random access that NVMs provide. In particular, it maintains separate logs for each inode to improve concurrency, and stores file data outside the log to minimize log size and reduce garbage collection costs. NOVA's logs provide metadata, data, and mmap atomicity and focus on simplicity and reliability, keeping complex metadata structures in DRAM to accelerate lookup operations. Experimental results show that in write-intensive workloads, NOVA provides 22% to 216× throughput improvement compared to state-of-the-art file systems, and 3.1× to 13.5× improvement compared to file systems that provide equally strong data consistency guarantees.", "citation": "Citations (141)", "departments": ["University of California, San Diego", "University of California, San Diego"], "authors": ["Jian Xu.....http://dblp.org/pers/hd/x/Xu:Jian", "Steven Swanson.....http://dblp.org/pers/hd/s/Swanson:Steven"], "conf": "fast", "year": "2016", "pages": 16}