{"title": "Joint Graph Learning and Video Segmentation via Multiple Cues and Topology Calibration.", "fields": ["vertex", "connected component", "pairwise comparison", "laplacian matrix", "graph"], "abstract": "Video segmentation has become an important and active research area with a large diversity of proposed approaches. Graph-based methods, enabling top performance on recent benchmarks, usually focus on either obtaining a precise similarity graph or designing efficient graph cutting strategies. However, these two components are often conducted in two separated steps, and thus the obtained similarity graph may not be the optimal one for segmentation and this may lead to suboptimal results. In this paper, we propose a novel framework, joint graph learning and video segmentation (JGLVS)}, which learns the similarity graph and video segmentation simultaneously. JGLVS learns the similarity graph by assigning adaptive neighbors for each vertex based on multiple cues (appearance, motion, boundary and spatial information). Meanwhile, the new rank constraint is imposed to the Laplacian matrix of the similarity graph, such that the connected components in the resulted similarity graph are exactly equal to the number of segmentations. Furthermore, JGLVS can automatically weigh multiple cues and calibrate the pairwise distance of superpixels based on their topology structures. Most noticeably, empirical results on the challenging dataset VSB100 show that JGLVS achieves promising performance on the benchmark dataset which outperforms the state-of-the-art by up to 11% for the BPR metric.", "citation": "Citations (10)", "departments": ["University of Trento", "University of Electronic Science and Technology of China", "University of Trento", "Northwestern Polytechnical University", "University of Electronic Science and Technology of China"], "authors": ["Jingkuan Song.....http://dblp.org/pers/hd/s/Song:Jingkuan", "Lianli Gao.....http://dblp.org/pers/hd/g/Gao:Lianli", "Mihai Marian Puscas.....http://dblp.org/pers/hd/p/Puscas:Mihai_Marian", "Feiping Nie.....http://dblp.org/pers/hd/n/Nie:Feiping", "Fumin Shen.....http://dblp.org/pers/hd/s/Shen:Fumin", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu"], "conf": "mm", "year": "2016", "pages": 10}