{"title": "A General Persistent Code Caching Framework for Dynamic Binary Translation (DBT).", "fields": ["binary translation", "code reuse", "javascript", "binary code", "instruction set"], "abstract": "Dynamic binary translation (DBT) translates binary code from one instruction set architecture (ISA) to another (same or different) ISA at runtime, which makes it very useful in many applications such as system virtualization, whole program analysis, system debugging, and system security. Many techniques have been proposed to improve the efficiency of DBT systems for long-running and loop-intensive applications. However, for applications with short running time or long-running but with few hot code regions such as JavaScript and C# applications in web services, such techniques have difficulty in amortizing the overhead incurred during binary translation.\n\nTo reduce the translation overhead for such applications, this paper presents a general persistent code caching framework, which allows the reuse of translated binary code across different executions for the same or different applications. Compared to existing approaches, the proposed approach can seamlessly handle even dynamically generated code, which is very popular in script applications today. A prototype of the proposed framework has been implemented in an existing retargetable DBT system. Experimental results on a list of applications, including C/C++ and JavaScript, demonstrate that it can achieve 76.4% performance improvement on average compared to the original DBT system without helper threads for dynamic binary translation, and 9% performance improvement on average over the same DBT system with helper threads when code reuse is combined with help threads.", "citation": "Citations (4)", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "University of Minnesota"], "authors": ["Wenwen Wang.....http://dblp.org/pers/hd/w/Wang:Wenwen", "Pen-Chung Yew.....http://dblp.org/pers/hd/y/Yew:Pen=Chung", "Antonia Zhai.....http://dblp.org/pers/hd/z/Zhai:Antonia", "Stephen McCamant.....http://dblp.org/pers/hd/m/McCamant:Stephen"], "conf": "usenix", "year": "2016", "pages": 13}