{"title": "Hunting for invisibility: Characterizing and detecting malicious web infrastructures through server visibility analysis.", "fields": ["enterprise private network", "exploit", "certificate server", "invisibility", "web server"], "abstract": "Nowadays, cyber criminals often build web infrastructures rather than a single server to conduct their malicious activities. In order to continue their malevolent activities without being detected, cyber criminals make efforts to conceal the core servers (e.g., C&C servers, exploit servers, and drop-zone servers) in the malicious web infrastructure. Such deliberate invisibility of those concealed malicious servers, however, makes them particularly distinguishable from benign web servers that are usually promoted to be public. In this paper, we conduct the first large-scale measurement study to investigate the visibility of both malicious and benign servers. From our intensive analysis of over 100,000 benign servers, 45,000 malicious servers and 40,000 redirections, we identify a set of distinct features of malicious web infrastructures from their locations, structures, roles, and relationships perspectives, and propose a lightweight yet effective detection system called VisHunter. VisHunter identifies malicious redirections from visible servers to invisible servers at the entryway of malicious web infrastructures. We evaluate VisHunter on both online public data and large-scale enterprise network traffic, and demonstrate that VisHunter can achieve an average 96.2% detection rate with only 0.9% false positive rate on the real enterprise network traffic.", "citation": "Citations (2)", "departments": ["Texas A&M University", "IBM", "IBM", "Lehigh University", "Texas A&M University"], "authors": ["Jialong Zhang.....http://dblp.org/pers/hd/z/Zhang:Jialong", "Xin Hu.....http://dblp.org/pers/hd/h/Hu_0001:Xin", "Jiyong Jang.....http://dblp.org/pers/hd/j/Jang:Jiyong", "Ting Wang.....http://dblp.org/pers/hd/w/Wang_0006:Ting", "Guofei Gu.....http://dblp.org/pers/hd/g/Gu:Guofei", "Marc Ph. Stoecklin.....http://dblp.org/pers/hd/s/Stoecklin:Marc_Ph="], "conf": "infocom", "year": "2016", "pages": 9}