{"title": "XFT: Practical Fault Tolerance beyond Crashes.", "fields": ["asynchrony", "adversary", "paxos", "raft", "crash"], "abstract": "Despite years of intensive research, Byzantine fault-tolerant (BFT) systems have not yet been adopted in practice. This is due to additional cost of BFT in terms of resources, protocol complexity and performance, compared with crash fault-tolerance (CFT). This overhead of BFT comes from the assumption of a powerful adversary that can fully control not only the Byzantine faulty machines, but at the same time also the message delivery schedule across the entire network, effectively inducing communication asynchrony and partitioning otherwise correct machines at will. To many practitioners, however, such strong attacks appear irrelevant.\n\nIn this paper, we introduce cross fault tolerance or XFT, a novel approach to building reliable and secure distributed systems and apply it to the classical state-machine replication (SMR) problem. In short, an XFT SMR protocol provides the reliability guarantees of widely used asynchronous CFT SMR protocols such as Paxos and Raft, but also tolerates Byzantine faults in combination with network asynchrony, as long as a majority of replicas are correct and communicate synchronously. This allows the development of XFT systems at the price of CFT (already paid for in practice), yet with strictly stronger resilience than CFT -- sometimes even stronger than BFT itself.\n\nAs a showcase for XFT, we present XPaxos, the first XFT SMR protocol, and deploy it in a geo-replicated setting. Although it offers much stronger resilience than CFT SMR at no extra resource cost, the performance of XPaxos matches that of the state-of-the-art CFT protocols.", "citation": "Citations (14)", "departments": ["Institut Eurécom", "IBM", "IBM", "NUDT", "Grenoble INP"], "authors": ["Shengyun Liu.....http://dblp.org/pers/hd/l/Liu:Shengyun", "Paolo Viotti.....http://dblp.org/pers/hd/v/Viotti:Paolo", "Christian Cachin.....http://dblp.org/pers/hd/c/Cachin:Christian", "Vivien Quéma.....http://dblp.org/pers/hd/q/Qu=eacute=ma:Vivien", "Marko Vukolic.....http://dblp.org/pers/hd/v/Vukolic:Marko"], "conf": "osdi", "year": "2016", "pages": 16}