{"title": "A Systematic Analysis of the Juniper Dual EC Incident.", "fields": ["randomness", "juniper", "environmental science", "firmware", "pseudorandom number generator", "agroforestry", "dual_ec_drbg", "random number generation"], "abstract": "In December 2015, Juniper Networks announced multiple security vulnerabilities stemming from unauthorized code in ScreenOS, the operating system for their NetScreen VPN routers. The more sophisticated of these vulnerabilities was a passive VPN decryption capability, enabled by a change to one of the elliptic curve points used by the Dual EC pseudorandom number generator. In this paper, we describe the results of a full independent analysis of the ScreenOS randomness and VPN key establishment protocol subsystems, which we carried out in response to this incident. While Dual EC is known to be insecure against an attacker who can choose the elliptic curve parameters, Juniper had claimed in 2013 that ScreenOS included countermeasures against this type of attack. We find that, contrary to Juniper's public statements, the ScreenOS VPN implementation has been vulnerable since 2008 to passive exploitation by an attacker who selects the Dual EC curve point. This vulnerability arises due to apparent flaws in Juniper's countermeasures as well as a cluster of changes that were all introduced concurrently with the inclusion of Dual EC in a single 2008 release. We demonstrate the vulnerability on a real NetScreen device by modifying the firmware to install our own parameters, and we show that it is possible to passively decrypt an individual VPN session in isolation without observing any other network traffic. We investigate the possibility of passively fingerprinting ScreenOS implementations in the wild. This incident is an important example of how guidelines for random number generation, engineering, and validation can fail in practice.", "citation": "Not cited", "year": "2016", "departments": ["University of Illinois at Chicago", "University of California, San Diego", "Johns Hopkins University", "University of Pennsylvania", "University of Pennsylvania"], "conf": "ccs", "authors": ["Stephen Checkoway.....http://dblp.org/pers/hd/c/Checkoway:Stephen", "Jacob Maskiewicz.....http://dblp.org/pers/hd/m/Maskiewicz:Jacob", "Christina Garman.....http://dblp.org/pers/hd/g/Garman:Christina", "Joshua Fried.....http://dblp.org/pers/hd/f/Fried:Joshua", "Shaanan Cohney.....http://dblp.org/pers/hd/c/Cohney:Shaanan", "Matthew Green.....http://dblp.org/pers/hd/g/Green_0001:Matthew", "Nadia Heninger.....http://dblp.org/pers/hd/h/Heninger:Nadia", "Ralf-Philipp Weinmann.....http://dblp.org/pers/hd/w/Weinmann:Ralf=Philipp", "Eric Rescorla.....http://dblp.org/pers/hd/r/Rescorla:Eric", "Hovav Shacham.....http://dblp.org/pers/hd/s/Shacham:Hovav"], "pages": 12}