{"title": "Deriving divide-and-conquer dynamic programming algorithms using solver-aided transformations.", "fields": ["implementation", "deductive reasoning", "program synthesis", "divide and conquer algorithms", "solver"], "abstract": "We introduce a framework allowing domain experts to manipulate computational terms in the interest of deriving better, more efficient implementations.It employs deductive reasoning to generate provably correct efficient implementations from a very high-level specification of an algorithm, and inductive constraint-based synthesis to improve automation. Semantic information is encoded into program terms through the use of refinement types.     In this paper, we develop the technique in the context of a system called Bellmania that uses solver-aided tactics to derive parallel divide-and-conquer implementations of dynamic programming algorithms that have better locality and are significantly more efficient than traditional loop-based implementations. Bellmania includes a high-level language for specifying dynamic programming algorithms and a calculus that facilitates gradual transformation of these specifications into efficient implementations. These transformations formalize the divide-and conquer technique; a visualization interface helps users to interactively guide the process, while an SMT-based back-end verifies each step and takes care of low-level reasoning required for parallelism.     We have used the system to generate provably correct implementations of several algorithms, including some important algorithms from computational biology, and show that the performance is comparable to that of the best manually optimized code.", "citation": "Citations (6)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Shachar Itzhaky.....http://dblp.org/pers/hd/i/Itzhaky:Shachar", "Rohit Singh.....http://dblp.org/pers/hd/s/Singh_0002:Rohit", "Armando Solar-Lezama.....http://dblp.org/pers/hd/s/Solar=Lezama:Armando", "Kuat Yessenov.....http://dblp.org/pers/hd/y/Yessenov:Kuat", "Yongquan Lu.....http://dblp.org/pers/hd/l/Lu:Yongquan", "Charles E. Leiserson.....http://dblp.org/pers/hd/l/Leiserson:Charles_E=", "Rezaul Alam Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Rezaul_Alam"], "conf": "oopsla", "year": "2016", "pages": 20}