{"title": "Extreme scale plasma turbulence simulations on top supercomputers worldwide.", "fields": ["scaling", "supercomputer", "tokamak", "software portability", "xeon phi"], "abstract": "The goal of the extreme scale plasma turbulence studies described in this paper is to expedite the delivery of reliable predictions on confinement physics in large magnetic fusion systems by using world-class supercomputers to carry out simulations with unprecedented resolution and temporal duration. This has involved architecture-dependent optimizations of performance scaling and addressing code portability and energy issues, with the metrics for multi-platform comparisons being \"time-to-solution\" and \"energy-to-solution\". Realistic results addressing how confinement losses caused by plasma turbulence scale from present-day devices to the much larger $25 billion international ITER fusion facility have been enabled by innovative advances in the GTC-P code including (i) implementation of one-sided communication from MPI 3.0 standard; (ii) creative optimization techniques on Xeon Phi processors; and (iii) development of a novel performance model for the key kernels of the PIC code. Results show that modeling data movement is sufficient to predict performance on modern supercomputer platforms.", "citation": "Citations (2)", "departments": ["Princeton Plasma Physics Laboratory", "Princeton University", "Princeton Plasma Physics Laboratory", "Zürich, Switzerland", "Zürich, Switzerland"], "authors": ["William M. Tang.....http://dblp.org/pers/hd/t/Tang:William_M=", "Bei Wang.....http://dblp.org/pers/hd/w/Wang:Bei", "Stéphane Ethier.....http://dblp.org/pers/hd/e/Ethier:St=eacute=phane", "Grzegorz Kwasniewski.....http://dblp.org/pers/hd/k/Kwasniewski:Grzegorz", "Torsten Hoefler.....http://dblp.org/pers/hd/h/Hoefler:Torsten", "Khaled Z. Ibrahim.....http://dblp.org/pers/hd/i/Ibrahim:Khaled_Z=", "Kamesh Madduri.....http://dblp.org/pers/hd/m/Madduri:Kamesh", "Samuel Williams.....http://dblp.org/pers/hd/w/Williams:Samuel", "Leonid Oliker.....http://dblp.org/pers/hd/o/Oliker:Leonid", "Carlos Rosales-Fernandez.....http://dblp.org/pers/hd/r/Rosales=Fernandez:Carlos", "Timothy J. Williams.....http://dblp.org/pers/hd/w/Williams:Timothy_J="], "conf": "sc", "year": "2016", "pages": 12}