{"title": "Fuzzy trajectory linking.", "fields": ["service provider", "state of affairs", "common good", "single person", "payment"], "abstract": "Today, people can access various services with smart carry-on devices, e.g., surf the web with smart phones, make payments with credit cards, or ride a bus with commuting cards. In addition to the offered convenience, the access of such services can reveal their traveled trajectory to service providers. Very often, a user who has signed up for multiple services may expose her trajectory to more than one service providers. This state of affairs raises a privacy concern, but also an opportunity. On one hand, several colluding service providers, or a government agency that collects information from such service providers, may identify and reconstruct users' trajectories to an extent that can be threatening to personal privacy. On the other hand, the processing of such rich data may allow for the development of better services for the common good. In this paper, we take a neutral standpoint and investigate the potential for trajectories accumulated from different sources to be linked so as to reconstruct a larger trajectory of a single person. We develop a methodology, called fuzzy trajectory linking (FTL) that achieves this goal, and two instantiations thereof, one based on hypothesis testing and one on Naive-Bayes. We provide a theoretical analysis for factors that affect FTL and use two real datasets to demonstrate that our algorithms effectively achieve their goals.", "citation": "Citations (1)", "departments": ["Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Agency for Science, Technology and Research", "Skolkovo Institute of Science and Technology", "Agency for Science, Technology and Research"], "authors": ["Huayu Wu.....http://dblp.org/pers/hd/w/Wu_0001:Huayu", "Mingqiang Xue.....http://dblp.org/pers/hd/x/Xue:Mingqiang", "Jianneng Cao.....http://dblp.org/pers/hd/c/Cao:Jianneng", "Panagiotis Karras.....http://dblp.org/pers/hd/k/Karras:Panagiotis", "Wee Siong Ng.....http://dblp.org/pers/hd/n/Ng:Wee_Siong", "Kee Kiat Koo.....http://dblp.org/pers/hd/k/Koo:Kee_Kiat"], "conf": "icde", "year": "2016", "pages": 12}