{"title": "Localization of LTE measurement records with missing information.", "fields": ["imt advanced", "mobile search", "small cell", "mobile database", "mobile identification number"], "abstract": "As cellular networks like 4G LTE networks get more and more sophisticated, mobiles also measure and send enormous amount of mobile measurement data (in TBs/week/metropolitan) during every call and session. The mobile measurement records are saved in data center for further analysis and mining, however, these measurement records are not geo-tagged because the measurement procedures are implemented in mobile LTE stack. Geo-tagging (or localizing) the stored measurement record is a fundamental building block towards network analytics and troubleshooting since the measurement records contain rich information on call quality, latency, throughput, signal quality, error codes etc. In this work, our goal is to localize these mobile measurement records. Precisely, we answer the following question: what was the location of the mobile when it sent a given measurement record? We design and implement novel machine learning based algorithms to infer whether a mobile was outdoor and if so, it infers the latitude-longitude associated with the measurement record. The key technical challenge comes from the fact that measurement records do not contain sufficient information required for triangulation or RF fingerprinting based techniques to work by themselves. Experiments performed with real data sets from an operational 4G network in a major metropolitan show that, the median accuracy of our proposed solution is around 20 m for outdoor mobiles and outdoor classification accuracy is more than 98%.", "citation": "Citations (1)", "departments": ["University of Texas at Austin", "AT&T Labs", "Nokia"], "authors": ["Avik Ray.....http://dblp.org/pers/hd/r/Ray:Avik", "Supratim Deb.....http://dblp.org/pers/hd/d/Deb:Supratim", "Pantelis Monogioudis.....http://dblp.org/pers/hd/m/Monogioudis:Pantelis"], "conf": "infocom", "year": "2016", "pages": 9}