{"title": "An Efficient Time Series Subsequence Pattern Mining and Prediction Framework with an Application to Respiratory Motion Prediction.", "fields": ["predictive modelling", "distance measures", "streams", "orthogonal polynomials", "parametric statistics"], "abstract": "Traditional time series analysis methods are limited on some complex real-world time series data. Respiratory motion prediction is one of such challenging problems. The memory-based nearest neighbor approaches have shown potentials in predicting complex nonlinear time series compared to many traditional parametric prediction models. However, the massive time series subsequences representation, the similarity distance measures, the number of nearest neighbors, and the ensemble functions create challenges as well as limit the performance of nearest neighbor approaches in complex time series prediction. To address these problems, we propose a flexible time series pattern representation and selection framework, called the orthogonal-polynomial-based variant-nearest-neighbor (OPVNN) approach. For the respiratory motion prediction problem, the proposed approach achieved the highest and most robust prediction performance compared to the state-of-the-art time series prediction methods. With a solid mathematical and theoretical foundation in orthogonal polynomials, the proposed time series representation, subsequence pattern mining and prediction framework has a great potential to benefit those industry and medical applications that need to handle highly nonlinear and complex time series data streams, such as quasi-periodic ones.", "citation": "Citations (4)", "departments": ["University of Texas at Arlington", "University of Texas at Arlington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Shouyi Wang.....http://dblp.org/pers/hd/w/Wang:Shouyi", "KinMing Kam.....http://dblp.org/pers/hd/k/Kam:KinMing", "Cao Xiao.....http://dblp.org/pers/hd/x/Xiao:Cao", "Stephen R. Bowen.....http://dblp.org/pers/hd/b/Bowen:Stephen_R=", "Wanpracha Art Chaovalitwongse.....http://dblp.org/pers/hd/c/Chaovalitwongse:Wanpracha_Art"], "conf": "aaai", "year": "2016", "pages": 7}