{"title": "High resolution neural connectivity from incomplete tracing data using nonnegative spline regression.", "fields": ["underdetermined system", "rank factorization", "smoothing spline", "matrix completion", "adjacency matrix"], "abstract": "Whole-brain neural connectivity data are now available from viral tracing experiments, which reveal the connections between a source injection site and elsewhere in the brain. These hold the promise of revealing spatial patterns of connectivity throughout the mammalian brain. To achieve this goal, we seek to fit a weighted, nonnegative adjacency matrix among 100 μm brain “voxels” using viral tracer data. Despite a multi-year experimental effort, injections provide incomplete coverage, and the number of voxels in our data is orders of magnitude larger than the number of injections, making the problem severely underdetermined. Furthermore, projection data are missing within the injection site because local connections there are not separable from the injection signal. We use a novel machine-learning algorithm to meet these challenges and develop a spatially explicit, voxel-scale connectivity map of the mouse visual system. Our method combines three features: a matrix completion loss for missing data, a smoothing spline penalty to regularize the problem, and (optionally) a low rank factorization. We demonstrate the consistency of our estimator using synthetic data and then apply it to newly available Allen Mouse Brain Connectivity Atlas data for the visual system. Our algorithm is significantly more predictive than current state of the art approaches which assume regions to be homogeneous. We demonstrate the efficacy of a low rank version on visual cortex data and discuss the possibility of extending this to a whole-brain connectivity matrix at the voxel scale.", "citation": "Not cited", "departments": ["University of Washington", "Allen Institute for Brain Science", "University of Washington"], "authors": ["Kameron D. Harris.....http://dblp.org/pers/hd/h/Harris:Kameron_D=", "Stefan Mihalas.....http://dblp.org/pers/hd/m/Mihalas:Stefan", "Eric Shea-Brown.....http://dblp.org/pers/hd/s/Shea=Brown:Eric"], "conf": "nips", "year": "2016", "pages": 9}