{"title": "Dynamic cluster-based over-demand prediction in bike sharing systems.", "fields": ["computer science", "monte carlo method", "sustainable transport", "simulation"], "abstract": "Bike sharing is booming globally as a green transportation mode, but the occurrence of over-demand stations that have no bikes or docks available greatly affects user experiences. Directly predicting individual over-demand stations to carry out preventive measures is difficult, since the bike usage pattern of a station is highly dynamic and context dependent. In addition, the fact that bike usage pattern is affected not only by common contextual factors (e.g., time and weather) but also by opportunistic contextual factors (e.g., social and traffic events) poses a great challenge. To address these issues, we propose a dynamic cluster-based framework for over-demand prediction. Depending on the context, we construct a weighted correlation network to model the relationship among bike stations, and dynamically group neighboring stations with similar bike usage patterns into clusters. We then adopt Monte Carlo simulation to predict the over-demand probability of each cluster. Evaluation results using real-world data from New York City and Washington, D.C. show that our framework accurately predicts over-demand clusters and outperforms the baseline methods significantly.", "citation": "Citations (11)", "departments": ["Zhejiang University", "Peking University", "Centre national de la recherche scientifique", "University of Fribourg", "Hong Kong University of Science and Technology"], "authors": ["Longbiao Chen.....http://dblp.org/pers/hd/c/Chen:Longbiao", "Daqing Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Daqing", "Leye Wang.....http://dblp.org/pers/hd/w/Wang:Leye", "Dingqi Yang.....http://dblp.org/pers/hd/y/Yang:Dingqi", "Xiaojuan Ma.....http://dblp.org/pers/hd/m/Ma:Xiaojuan", "Shijian Li.....http://dblp.org/pers/hd/l/Li:Shijian", "Zhaohui Wu.....http://dblp.org/pers/hd/w/Wu_0001:Zhaohui", "Gang Pan.....http://dblp.org/pers/hd/p/Pan_0001:Gang", "Thi Mai Trang Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Thi_Mai_Trang", "Jérémie Jakubowicz.....http://dblp.org/pers/hd/j/Jakubowicz:J=eacute=r=eacute=mie"], "conf": "huc", "year": "2016", "pages": 12}