{"title": "FastCDC: a Fast and Efficient Content-Defined Chunking Approach for Data Deduplication.", "fields": ["data deduplication", "byte", "data stream", "speedup", "chunking"], "abstract": "Content-Defined Chunking (CDC) has been playing a key role in data deduplication systems in the past 15 years or so due to its high redundancy detection ability. However, existing CDC-based approaches introduce heavy CPU overhead because they declare the chunk cutpoints by computing and judging the rolling hashes of the data stream byte by byte. In this paper, we propose FastCDC, a Fast and efficient CDC approach, that builds and improves on the latest Gear-based CDC approach, one of the fastest CDC methods to our knowledge. The key idea behind FastCDC is the combined use of three key techniques, namely, simplifying and enhancing the hash judgment to address our observed challenges facing Gear-based CDC, skipping sub-minimum chunk cut-point to further speed up CDC, and normalizing the chunk-size distribution in a small specified region to address the problem of the decreased deduplication ratio stemming from the cut-point skipping. Our evaluation results show that, by using a combination of the three techniques, FastCDC is about 10× faster than the best of open-source Rabin-based CDC, and about 3× faster than the state-of-the-art Gear- and AE-based CDC, while achieving nearly the same deduplication ratio as the classic Rabin-based approach.", "citation": "Citations (5)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "University of Texas at Arlington", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Wen Xia.....http://dblp.org/pers/hd/x/Xia:Wen", "Yukun Zhou.....http://dblp.org/pers/hd/z/Zhou:Yukun", "Hong Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Hong", "Dan Feng.....http://dblp.org/pers/hd/f/Feng_0001:Dan", "Yu Hua.....http://dblp.org/pers/hd/h/Hua_0001:Yu", "Yuchong Hu.....http://dblp.org/pers/hd/h/Hu:Yuchong", "Qing Liu.....http://dblp.org/pers/hd/l/Liu_0007:Qing", "Yucheng Zhang.....http://dblp.org/pers/hd/z/Zhang:Yucheng"], "conf": "usenix", "year": "2016", "pages": 14}