{"title": "Mercury: Metro density prediction with recurrent neural network on streaming CDR data.", "fields": ["implementation", "public transport", "recurrent neural network", "smart city", "business requirements"], "abstract": "Telecommunication companies possess mobility information of their phone users, containing accurate locations and velocities of commuters travelling in public transportation system. Although the value of telecommunication data is well believed under the smart city vision, there is no existing solution to transform the data into actionable items for better transportation, mainly due to the lack of appropriate data utilization scheme and the limited processing capability on massive data. This paper presents the first ever system implementation of real-time public transportation crowd prediction based on telecommunication data, relying on the analytical power of advanced neural network models and the computation power of parallel streaming analytic engines. By analyzing the feeds of caller detail record (CDR) from mobile users in interested regions, our system is able to predict the number of metro passengers entering stations, the number of waiting passengers on the platforms and other important metrics on the crowd density. New techniques, including geographical-spatial data processing, weight-sharing recurrent neural network, and parallel streaming analytical programming, are employed in the system. These new techniques enable accurate and efficient prediction outputs, to meet the real-world business requirements from public transportation system.", "citation": "Citations (4)", "departments": ["National University of Singapore", "University of Illinois at Urbana–Champaign", "Advanced Digita ... Ltd., Singapore", "Advanced Digita ... Ltd., Singapore", "Advanced Digita ... Ltd., Singapore"], "authors": ["Victor C. Liang.....http://dblp.org/pers/hd/l/Liang:Victor_C=", "Richard T. B. Ma.....http://dblp.org/pers/hd/m/Ma:Richard_T=_B=", "Wee Siong Ng.....http://dblp.org/pers/hd/n/Ng:Wee_Siong", "Li Wang.....http://dblp.org/pers/hd/w/Wang:Li", "Marianne Winslett.....http://dblp.org/pers/hd/w/Winslett:Marianne", "Huayu Wu.....http://dblp.org/pers/hd/w/Wu_0001:Huayu", "Shanshan Ying.....http://dblp.org/pers/hd/y/Ying:Shanshan", "Zhenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Zhenjie"], "conf": "icde", "year": "2016", "pages": 4}