{"title": "A Framework for Supporting Real-Time Applications on Dynamic Reconfigurable FPGAs.", "fields": ["control reconfiguration", "computer engineering", "simulation", "exploit", "workload", "field programmable gate array", "reconfigurable computing", "search engine", "engineering"], "abstract": "Computing platforms are evolving towards heterogeneous architectures including processors of different types and field programmable gate arrays (FPGAs), used as hardware accelerators for speeding up specific functions. The increasing capacity and performance of modern FPGAs, with their partial reconfiguration capabilities, have made them attractive in several application domains, including space applications.This paper proposes a framework for supporting the development of safety-critical real-time systems that exploit hardware accelerators developed through FPGAs with dynamic partial reconfiguration capabilities.A model is first presented and then used to derive a response-time analysis to verify the schedulability of a real-time task set under given constraints and assumptions. Although the analysis is based on a generic model, the proposed framework has been conceived to account for several real-world constraints present on today's platforms and has been practically validated on the Zynq platform, showing that it can actually be supported by state-of-the-art technologies. Finally, a number of experiments are reported to evaluate the worst-case performance of the proposed approach on synthetic workload.", "citation": "Not cited", "year": "2016", "departments": ["Max Planck Society", "Sant'Anna School of Advanced Studies", "Sant'Anna School of Advanced Studies", "Sant'Anna School of Advanced Studies", "Sant'Anna School of Advanced Studies"], "conf": "rtss", "authors": ["Alessandro Biondi.....http://dblp.org/pers/hd/b/Biondi:Alessandro", "Alessio Balsini.....http://dblp.org/pers/hd/b/Balsini:Alessio", "Marco Pagani.....http://dblp.org/pers/hd/p/Pagani:Marco", "Enrico Rossi.....http://dblp.org/pers/hd/r/Rossi:Enrico", "Mauro Marinoni.....http://dblp.org/pers/hd/m/Marinoni:Mauro", "Giorgio C. Buttazzo.....http://dblp.org/pers/hd/b/Buttazzo:Giorgio_C="], "pages": 12}