{"title": "Drinking from both glasses: combining pessimistic and optimistic tracking of cross-thread dependences.", "fields": ["thread", "transactional memory", "software system", "serializability", "enforcement"], "abstract": "It is notoriously challenging to develop parallel software systems that are both scalable and correct. Runtime support for parallelism---such as multithreaded record & replay, data race detectors, transactional memory, and enforcement of stronger memory models---helps achieve these goals, but existing commodity solutions slow programs substantially in order to track (i.e., detect or control) an execution's cross-thread dependences accurately. Prior work tracks cross-thread dependences either \"pessimistically,\" slowing every program access, or \"optimistically,\" allowing for lightweight instrumentation of most accesses but dramatically slowing accesses involved in cross-thread dependences.   This paper seeks to  hybridize  pessimistic and optimistic tracking, which is challenging because there exists a fundamental mismatch between pessimistic and optimistic tracking. We address this challenge based on insights about how dependence tracking and program synchronization interact, and introduce a novel approach called  hybrid tracking . Hybrid tracking is suitable for building efficient runtime support, which we demonstrate by building hybrid-tracking-based versions of a dependence recorder and a region serializability enforcer. An adaptive, profile-based policy makes runtime decisions about switching between pessimistic and optimistic tracking. Our evaluation shows that hybrid tracking enables runtime support to overcome the performance limitations of both pessimistic and optimistic tracking alone.", "citation": "Citations (4)", "year": "2016", "departments": ["Ohio State University", "Ohio State University", "Ohio State University", "Ohio State University"], "conf": "ppopp", "authors": ["Man Cao.....http://dblp.org/pers/hd/c/Cao:Man", "Minjia Zhang.....http://dblp.org/pers/hd/z/Zhang:Minjia", "Aritra Sengupta.....http://dblp.org/pers/hd/s/Sengupta:Aritra", "Michael D. Bond.....http://dblp.org/pers/hd/b/Bond:Michael_D="], "pages": 13}