{"title": "A simple congestion-aware algorithm for load balancing in datacenter networks.", "fields": ["convex function", "average path length", "hash function", "load management", "logical topology", "network traffic control", "marginal cost", "load balancing", "network simulation"], "abstract": "We study the problem of load balancing in datacenter networks, namely, assigning the end-to-end data flows among the available paths in order to efficiently balance the load in the network. The solutions used today rely typically on ECMP (Equal Cost Multi Path) mechanism which essentially attempts to balance the load in the network by hashing the flows to the available shortest paths. However, it is well known that ECMP performs poorly when there is asymmetry either in the network topology or the flow sizes, and thus there has been much interest recently in alternative mechanisms to address these shortcomings. In this paper, we consider a general network topology where each link has a cost which is a convex function of the link utilization. Flows among the various source-destination pairs are generated dynamically over time, each with a size (bandwidth requirement) and a duration. Once a flow is assigned to a path in the network, it consumes bandwidth equal to its size from all the links along its path for its duration. We propose a low-complexity congestion-aware algorithm that assigns the flows to the available paths in an online fashion and without splitting, and prove that it asymptotically minimizes the total network cost. Extensive simulation results are presented to verify the performance of our algorithm under a wide range of traffic conditions and under different datacenter architectures.", "citation": "Citations (4)", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University"], "authors": ["Mehrnoosh Shafiee.....http://dblp.org/pers/hd/s/Shafiee:Mehrnoosh", "Javad Ghaderi.....http://dblp.org/pers/hd/g/Ghaderi:Javad"], "conf": "infocom", "year": "2016", "pages": 9}