{"title": "Dynamic routing for network throughput maximization in software-defined networks.", "fields": ["unicast", "online algorithm", "forwarding plane", "software defined networking", "routing table"], "abstract": "This paper is driven by a simple question of whether traffic engineering in Software Defined Networking (SDN) can react quickly to bursty and unpredictable changes in traffic demand. The key challenge is to strike a careful balance between the overhead (frequently involving the SDN controller) and performance (the degree of congestion measured as the maximum load and the balance between the minimum and the maximum loads). Exploiting OpenFlow (OF) features, quick shift of routing paths for unpredictable traffic bursty is the focal point of this work. It is achieved by using a dual routing scheme and letting the data plane to select the appropriate path in reacting to uncertainty in traffic load. The proposed work is called DUCE (Demand Uncertainty Configuration sElection). Further, we describe a traffic distribution model, an optimization solution that calculates congestion-free traffic distribution plan which guarantees that each switch can select one of the paths in a distributed way, and moreover, OF details about detaching the functionality of responding to the demand uncertainty from the control plane and delegating it to the data plane. Simulations are performed validating the efficiency of DUCE under various network scenarios.", "citation": "Citations (1)", "departments": ["Zhejiang University", "Zhejiang University", "University of Alabama", "Zhejiang University", "Zhejiang University"], "authors": ["Meitian Huang.....http://dblp.org/pers/hd/h/Huang:Meitian", "Weifa Liang.....http://dblp.org/pers/hd/l/Liang:Weifa", "Zichuan Xu.....http://dblp.org/pers/hd/x/Xu:Zichuan", "Wenzheng Xu.....http://dblp.org/pers/hd/x/Xu:Wenzheng", "Song Guo.....http://dblp.org/pers/hd/g/Guo_0001:Song", "Yinlong Xu.....http://dblp.org/pers/hd/x/Xu:Yinlong"], "conf": "infocom", "year": "2016", "pages": 9}