{"title": "Exploiting channel diversity for rate adaptation in backscatter communication networks.", "fields": ["selection algorithm", "throughput", "goodput", "backscatter", "channel"], "abstract": "Backscatter communication networks receive much attention recently due to the small size and low power of backscatter nodes. As backscatter communication is often influenced by the dynamic wireless channel quality, rate adaptation becomes necessary. Most existing approaches share a common drawback: they do not distinguish channel qualities from different nodes or sub-channels. Consequently, the transmission rate may be improperly selected, resulting in low network throughput. Through extensive experimental studies, we observe that channel diversity plays a significant role in rate selection. Therefore, there are opportunities of exploiting channel diversity for better rate adaptation, improving network throughput. In this paper, we propose a Channel-Aware Rate Adaptation framework (CARA) for backscatter communication networks. By employing a lightweight channel probing scheme, we are able to obtain fine-grained channel information that enables accurate channel estimation. We further design a novel channel selection algorithm, benefiting as many backscatter nodes as possible. On each selected channel, CARA chooses data rate with respect to the node that has the best channel condition. We implement CARA on commercial readers and the experiment results show that CARA achieves up to 4× goodput gain compared with state-of-the-art rate adaptation scheme.", "citation": "Citations (2)", "departments": ["Simon Fraser University", "Hong Kong University of Science and Technology", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Wei Gong.....http://dblp.org/pers/hd/g/Gong:Wei", "Haoxiang Liu.....http://dblp.org/pers/hd/l/Liu:Haoxiang", "Kebin Liu.....http://dblp.org/pers/hd/l/Liu:Kebin", "Qiang Ma.....http://dblp.org/pers/hd/m/Ma:Qiang", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2016", "pages": 9}