{"title": "Future Vector Microprocessor Extensions for Data Aggregations.", "fields": ["dennard scaling", "frequency scaling", "test data generation", "instruction set", "simd"], "abstract": "As the rate of annual data generation grows exponentially, there is a demand to aggregate and summarise vast amounts of information quickly. In the past, frequency scaling was relied upon to push application throughput. Today, Dennard scaling has ceased and further performance must come from exploiting parallelism. Single instruction-multiple data (SIMD) instruction sets offer a highly efficient and scalable way of exploiting data-level parallelism (DLP). While microprocessors originally offered very simple SIMD support targeted at multimedia applications, these extensions have been growing both in width and functionality. Observing this trend, we use a simulation framework to model future SIMD support and then propose and evaluate five different ways of vectorising data aggregation. We find that although data aggregation is abundant in DLP, it is often too irregular to be expressed efficiently using typical SIMD instructions. Based on this observation, we propose a set of novel algorithms and SIMD instructions to better capture this irregular DLP. Furthermore, we discover that the best algorithm is highly dependent on the characteristics of the input. Our proposed solution can dynamically choose the optimal algorithm in the majority of cases and achieves speedups between 2.7 × and 7.6 × over a scalar baseline.", "citation": "Citations (4)", "year": "2016", "departments": ["Polytechnic University of Catalonia", "Polytechnic University of Catalonia", "Barcelona Supercomputing Center", "Polytechnic University of Catalonia", "Polytechnic University of Catalonia"], "conf": "isca", "authors": ["Timothy Hayes.....http://dblp.org/pers/hd/h/Hayes_0001:Timothy", "Oscar Palomar.....http://dblp.org/pers/hd/p/Palomar:Oscar", "Osman S. Unsal.....http://dblp.org/pers/hd/u/Unsal:Osman_S=", "Adrián Cristal.....http://dblp.org/pers/hd/c/Cristal:Adri=aacute=n", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo"], "pages": 13}