{"title": "Efficiency of projectional editing: a controlled experiment.", "fields": ["intentional programming", "notation", "abstract syntax tree", "witness", "language workbench"], "abstract": "Projectional editors are editors where a user's editing actions directly change the abstract syntax tree without using a parser. They promise essentially unrestricted language com position as well as flexible notations, which supports aligning languages with their respective domain and constitutes an essential ingredient of model-driven development. Such editors have existed since the 1980s and gained widespread attention with the Intentional Programming paradigm, which used projectional editing at its core. However, despite the benefits, programming still mainly relies on editing textual code, where projectional editors imply a very different -- typically perceived as worse -- editing experience, often seen as the main challenge prohibiting their widespread adoption. We present an experiment of code-editing activities in a projectional editor, conducted with 19 graduate computer-science students and industrial developers. We investigate the effects of projectional editing on editing efficiency, editing strategies, and error rates -- each of which we also compare to conventional, parser-based editing. We observe that editing is efficient for basic-editing tasks, but that editing strategies and typical errors differ. More complex tasks require substantial experience and a better understanding of the abstract-syntax-tree structure -- then, projectional editing is also efficient. We also witness a tradeoff between fewer typing mistakes and an increased complexity of code editing.", "citation": "Citations (11)", "departments": ["Chalmers University of Technology", "University of Copenhagen", "University of Copenhagen", "University of Passau", "itemis, Germany"], "authors": ["Thorsten Berger.....http://dblp.org/pers/hd/b/Berger:Thorsten", "Markus Völter.....http://dblp.org/pers/hd/v/V=ouml=lter:Markus", "Hans Peter Jensen.....http://dblp.org/pers/hd/j/Jensen:Hans_Peter", "Taweesap Dangprasert.....http://dblp.org/pers/hd/d/Dangprasert:Taweesap", "Janet Siegmund.....http://dblp.org/pers/hd/s/Siegmund:Janet"], "conf": "sigsoft", "year": "2016", "pages": 12}