{"title": "AntiLoiter: A Loitering Discovery System for Longtime Videos across Multiple Surveillance Cameras.", "fields": ["computer vision", "suspect", "facial recognition system", "artificial intelligence", "multimedia database"], "abstract": "Since loitering is a suspicious behavior that often leads to abnormal situations, such as pickpocketing and terrorist attacks, its analysis attracts increasing research attention. In this paper, we present AntiLoiter, a practical loitering discovery system for surveillance. AntiLoiter can efficiently discover loitering candidates from longtime videos across multiple cameras. Most of existing systems mainly focus on how to detect or identify loiterers by behavior tracking techniques. However, the difficulties of tracking-based methods are known as that their analysis results are heavily influenced by occlusions, overlaps, and shadows. Moreover, tracking-based methods need to track the human appearance continuously. Therefore, they are not readily applied to longtime videos across multiple cameras due to the appearance discontinuity of criminal loitering. For instance, a suspect would probably come to the same place several times on different dates for preliminary inspections before a terrorist attack happens, where the loitering behavior is discontinuous. To solve this problem, we abandon the tracking method, instead, design a novel approach to efficiently discover loiterers based on their frequent appearance patterns for longtime videos across multiple cameras. Our approach simply yet effectively adopts existing face recognition techniques for loitering discovery. We conducted extensive experiments on both synthetic and real surveillance videos to evaluate the efficiency and efficacy of our approach. The experimental results show that our system can find out loitering candidates correctly and outperforms existing method by 100 times in terms of runtime.", "citation": "Citations (5)", "departments": ["NEC", "NEC", "NEC"], "authors": ["Jianquan Liu.....http://dblp.org/pers/hd/l/Liu:Jianquan", "Shoji Nishimura.....http://dblp.org/pers/hd/n/Nishimura:Shoji", "Takuya Araki.....http://dblp.org/pers/hd/a/Araki:Takuya"], "conf": "mm", "year": "2016", "pages": 5}