{"title": "Voting with Their Feet: Inferring User Preferences from App Management Activities.", "fields": ["user experience design", "android", "voting", "upload", "mobile deep linking"], "abstract": "Smartphone users have adopted an explosive number of mobile applications (a.k.a., apps) in the recent years. App marketplaces for iOS, Android and Windows Phone platforms host millions of apps which have been downloaded for more than 100 billion times. Investigating how people manage mobile apps in their everyday lives creates a unique opportunity to understand the behavior and preferences of mobile users, to infer the quality of apps, and to improve the user experience. Existing literature provides very limited knowledge about app management activities, due to the lack of user behavioral data at scale. This paper takes the initiative to analyze a very large app management log collected through a leading Android app marketplace. The data set covers five months of detailed downloading, updating, and uninstallation activities, involving 17 million anonymized users and one million apps. We present a surprising finding that the metrics commonly used by app stores to rank apps do not truly reflect the users' real attitudes towards the apps. We then identify useful patterns from the app management activities that much more accurately predict the user preferences of an app even when no user rating is available.", "citation": "Citations (11)", "departments": ["Peking University", "University of Michigan", "Peking University", "Microsoft", "Peking University"], "authors": ["Huoran Li.....http://dblp.org/pers/hd/l/Li:Huoran", "Wei Ai.....http://dblp.org/pers/hd/a/Ai:Wei", "Xuanzhe Liu.....http://dblp.org/pers/hd/l/Liu:Xuanzhe", "Jian Tang.....http://dblp.org/pers/hd/t/Tang:Jian", "Gang Huang.....http://dblp.org/pers/hd/h/Huang_0001:Gang", "Feng Feng.....http://dblp.org/pers/hd/f/Feng_0001:Feng", "Qiaozhu Mei.....http://dblp.org/pers/hd/m/Mei:Qiaozhu"], "conf": "www", "year": "2016", "pages": 12}