{"title": "Combinatorial generation of structurally complex test inputs for commercial software applications.", "fields": ["scalability", "test data generation", "software system", "commercial software", "code coverage"], "abstract": "Despite recent progress in automated test generation research, significant challenges remain for applying these techniques on large-scale software systems. These systems under test often require structurally complex test inputs within a large input domain. It is challenging to automatically generate a reasonable number of tests that are both legal and behaviorally-diverse to exercise these systems. Constraint-based test generation is an effective approach for generating structurally complex inputs for systematic testing. While this approach can typically generate large numbers of tests, it has limited scalability – tests generated are usually only up to a small bound on input size. Combinatorial test generation, e.g., pair-wise testing, is a more scalable approach but is challenging to apply on commercial software systems that require complex input structures that cannot be formed by using arbitrary combinations. This paper introduces comKorat, which unifies constraint-based generation of structurally complex tests with combinatorial testing. Specifically, comKorat integrates Korat and ACTS test generators to generate test suites for large scale software systems with structurally complex test inputs. We have successfully applied comKorat on four software applications developed at eBay and Yahoo!. The experimental results show that comKorat outperforms existing solutions in execution time and test coverage. Furthermore, comKorat found a total of 59 previously unknown bugs in the four applications.", "citation": "Citations (2)", "departments": ["University of Texas at Austin", "University of Texas at Dallas", "University of Texas at Austin"], "authors": ["Hua Zhong.....http://dblp.org/pers/hd/z/Zhong:Hua", "Lingming Zhang.....http://dblp.org/pers/hd/z/Zhang:Lingming", "Sarfraz Khurshid.....http://dblp.org/pers/hd/k/Khurshid:Sarfraz"], "conf": "sigsoft", "year": "2016", "pages": 6}