{"title": "Accurate recovery of Internet traffic data: A tensor completion approach.", "fields": ["traffic generation model", "data recovery", "exploit", "internet traffic", "matrix completion"], "abstract": "The inference of traffic volume of the whole network from partial traffic measurements becomes increasingly critical for various network engineering tasks, such as traffic prediction, network optimization, and anomaly detection. Previous studies indicate that the matrix completion is a possible solution for this problem. However, as a two-dimension matrix cannot sufficiently capture the spatial-temporal features of traffic data, these approaches fail to work when the data missing ratio is high. To fully exploit hidden spatial-temporal structures of the traffic data, this paper models the traffic data as a 3-way traffic tensor and formulates the traffic data recovery problem as a low-rank tensor completion problem. However, the high computation complexity incurred by the conventional tensor completion algorithms prevents its practical application for the traffic data recovery. To reduce the computation cost, we propose a novel Sequential Tensor Completion algorithm (STC) which can efficiently exploit the tensor decomposition result for the previous traffic data to deduce the tensor decomposition for the current data. To the best of our knowledge, we are the first to apply the tensor to model Internet traffic data to well exploit their hidden structures and propose a sequential tensor completion algorithm to significantly speed up the traffic data recovery process. We have done extensive simulations with the real traffic trace as the input. The simulation results demonstrate that our algorithm can achieve significantly better performance compared with the literature tensor and matrix completion algorithms even when the data missing ratio is high.", "citation": "Citations (11)", "departments": ["Hunan University", "Hunan University", "Stony Brook University", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Kun Xie.....http://dblp.org/pers/hd/x/Xie:Kun", "Lele Wang.....http://dblp.org/pers/hd/w/Wang_0003:Lele", "Xin Wang.....http://dblp.org/pers/hd/w/Wang_0001:Xin", "Gaogang Xie.....http://dblp.org/pers/hd/x/Xie:Gaogang", "Jigang Wen.....http://dblp.org/pers/hd/w/Wen:Jigang", "Guangxing Zhang.....http://dblp.org/pers/hd/z/Zhang:Guangxing"], "conf": "infocom", "year": "2016", "pages": 9}