{"title": "Top-k queries for multi-category RFID systems.", "fields": ["bijection", "computation", "keying", "perfect hash function", "string"], "abstract": "This paper studies the practically important problem of top-k queries, which is to find the top k largest categories and their corresponding sizes. In this paper, we propose a Top-k Query (TKQ) protocol and a technique that we call Segmented Perfect Hashing (SPH) for optimizing TKQ. Specifically, TKQ is based on the framed slotted Aloha protocol. Each tag responds to the reader with a Single-One Geometric (SOG) string using the ON-OFF Keying modulation. TKQ leverages the length of continuous leading 1s in the combined signal to estimate the corresponding category size. TKQ can quickly eliminate the sufficiently small categories, and only needs to focus on a limited number of large-size categories that require more accurate estimation. We conduct rigorous analysis to guarantee the predefined accuracy constraints. To further improve time-efficiency, we propose the SPH scheme, which improves the average frame utilization of TKQ from 36.8% to nearly 100% by establishing a bijective mapping between tag categories and slots. To minimize the overall time cost, we optimize the key parameter that trades off between communication cost and computation cost. Experimental results show that our TKQ+SPH protocol not only achieves the required accuracy constraints, but also achieves a 2.6∼7x faster speed than the existing protocols.", "citation": "Citations (9)", "departments": ["Dalian University of Technology", "Dalian University of Technology", "Temple University", "Nanjing University", "Dalian University of Technology"], "authors": ["Xiulong Liu.....http://dblp.org/pers/hd/l/Liu:Xiulong", "Keqiu Li.....http://dblp.org/pers/hd/l/Li:Keqiu", "Jie Wu.....http://dblp.org/pers/hd/w/Wu:Jie", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Xin Xie.....http://dblp.org/pers/hd/x/Xie:Xin", "Chunsheng Zhu.....http://dblp.org/pers/hd/z/Zhu:Chunsheng", "Weilian Xue.....http://dblp.org/pers/hd/x/Xue:Weilian"], "conf": "infocom", "year": "2016", "pages": 9}