{"title": "Tuning by turning: Enabling phased array signal processing for WiFi with inertial sensors.", "fields": ["angle of arrival", "phased array", "inertial measurement unit", "antenna array", "mobile device"], "abstract": "Modern mobile devices are equipped with multiple antennas, which brings various wireless sensing applications such as accurate localization, contactless human detection and wireless human-device interaction. A key enabler for these applications is phased array signal processing, especially Angle of Arrival (AoA) estimation. However, accurate AoA estimation on commodity devices is non-trivial due to limited number of antennas and uncertain phase offsets. Previous works either rely on elaborate calibration or involve contrived human interactions. In this paper, we aim to enable practical AoA measurements on commodity off-the-shelf (COTS) mobile devices. The key insight is to involve users' natural rotation to formulate a virtual spatial-temporal antenna array and conduce a relative incident signal of measurements at two orientations. Then by taking the differential phase, it is feasible to remove the phase offsets and derive the accurate AoA of the equivalent incoming signal, while the rotation angle can also be captured by built-in inertial sensors. On this basis, we propose Differential MUSIC (D-MUSIC), a relative form of the standard MUSIC algorithm that eliminates the unknown phase offsets and achieves accurate AoA estimation on COTS mobile devices with only one rotation. We further extend D-MUSIC to 3-D space and fortify it in multipath-rich scenarios. We prototype D-MUSIC on commodity WiFi infrastructure and evaluate it in typical indoor environments. Experimental results demonstrate a superior performance with an average AoA estimation error of 13°. Requiring no modifications or calibration, D-MUSIC is envisioned as a promising scheme for practical AoA estimation on COTS mobile devices.", "citation": "Citations (4)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Hong Kong University of Science and Technology", "Tsinghua University"], "authors": ["Kun Qian.....http://dblp.org/pers/hd/q/Qian_0004:Kun", "Chenshu Wu.....http://dblp.org/pers/hd/w/Wu:Chenshu", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng", "Zimu Zhou.....http://dblp.org/pers/hd/z/Zhou:Zimu", "Xu Wang.....http://dblp.org/pers/hd/w/Wang:Xu", "Yunhao Liu.....http://dblp.org/pers/hd/l/Liu:Yunhao"], "conf": "infocom", "year": "2016", "pages": 9}