{"title": "Privacy-preserving deep packet inspection in outsourced middleboxes.", "fields": ["network packet", "encryption", "deep content inspection", "deep packet inspection", "middlebox"], "abstract": "Middleboxes are essential for a wide range of advanced traffic processing in modern enterprise networks. Recent trend of deploying middleboxes in cloud as virtualized services further expands potential benefits of middleboxes while avoiding local maintenance burdens. Despite promising, designing outsourced middleboxes still faces several security challenges. First, many middlebox processing services, like intrusion detection, require packet payload inspection, while the ever-increasing adoption of HTTPS limits the function due to the end-to-end encryption. Second, many packet inspection rules used by middleboxes can be proprietary in nature. They may contain sensitive information of enterprises, and thus need strong protection when configuring middleboxes in untrusted outsourced environments. In this paper, we propose a practical system architecture for outsourced middleboxes to perform deep packet inspection over encrypted traffic, without revealing either packet payloads or inspection rules. Our first design is an encrypted high-performance rule filter that takes randomized tokens from packet payloads for encrypted inspection. We then elaborate through carefully tailored techniques how to comprehensively support open-source real rulesets. We formally analyze the security strength. Implementations at Amazon Cloud show that our system introduces roughly 100 millisecond latency in each connection initialization, with individual processing throughput over 3500 packets/second for 500 concurrent connections.", "citation": "Citations (10)", "departments": ["City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong", "City University of Hong Kong"], "authors": ["Xingliang Yuan.....http://dblp.org/pers/hd/y/Yuan:Xingliang", "Xinyu Wang.....http://dblp.org/pers/hd/w/Wang:Xinyu", "Jianxiong Lin.....http://dblp.org/pers/hd/l/Lin:Jianxiong", "Cong Wang.....http://dblp.org/pers/hd/w/Wang_0001:Cong"], "conf": "infocom", "year": "2016", "pages": 9}