{"title": "Designing Policy Recommendations to Reduce Home Abandonment in Mexico.", "fields": ["government", "loan", "local development", "actuarial science", "census"], "abstract": "Infonavit, the largest provider of mortgages in Mexico, assists working families to obtain low-interest rate housing solutions. An increasingly prevalent problem is home abandonment: when a homeowner decides to leave their property and forego their investment. A major causal factor of this outcome is a mismatch between the homeowner's needs, in terms of access to services and employment, and the location characteristics of the home. This paper describes our collaboration with Infonavit to reduce home abandonment at two levels: develop policy recommendations for targeted improvements in location characteristics, and develop a decision-support tool to assist the homeowner in the home location decision. Using 20 years of mortgage history data combined with surveys, census, and location information, we develop a model to predict the probability of home abandonment based on both individual and location characteristics. The model is used to develop a tool that provides Infonavit the ability to give advice to Mexican workers when they apply for a loan, evaluate and improve the locations of new housing developments, and provide data-driven recommendations to the federal government to influence local development initiatives and infrastructure investments. The result is improving economic outcomes for the citizens of Mexico by pre-emptively identifying at-risk home mortgages, thereby allowing them to be altered or remedied before they result in abandonment.", "citation": "Citations (1)", "departments": ["Monash University", "University of Chicago", "University of Virginia", "University of California, San Diego", "University of Chicago"], "authors": ["Klaus Ackermann.....http://dblp.org/pers/hd/a/Ackermann:Klaus", "Eduardo Blancas Reyes.....http://dblp.org/pers/hd/r/Reyes:Eduardo_Blancas", "Sue He.....http://dblp.org/pers/hd/h/He:Sue", "Thomas Anderson Keller.....http://dblp.org/pers/hd/k/Keller:Thomas_Anderson", "Paul van der Boor.....http://dblp.org/pers/hd/b/Boor:Paul_van_der", "Romana Khan.....http://dblp.org/pers/hd/k/Khan:Romana", "Rayid Ghani.....http://dblp.org/pers/hd/g/Ghani:Rayid", "José Carlos González.....http://dblp.org/pers/hd/g/Gonz=aacute=lez:Jos=eacute=_Carlos"], "conf": "kdd", "year": "2016", "pages": 8}