{"title": "The night is young: urban crowdsourcing of nightlife patterns.", "fields": ["crowdsourcing", "social environment", "internet privacy", "multimedia", "nightlife"], "abstract": "We present a mobile crowdsourcing study to capture and examine the nightlife patterns of two youth populations in Switzerland. Our contributions are three fold. First, we developed a smartphone application to capture data on places, social context and nightlife activities, and to record mobile videos capturing the ambiance of places. Second, we conducted an \"in-the-wild\" study with more than 200 participants over a period of three months in two Swiss cities, resulting in a total of 1,394 unique place visits and 843 videos that spread across place categories (including personal homes and public parks), social and ambiance variables. Finally, we investigated the use of automatic ambiance features to estimate the loudness and brightness of places at scale, and found that while features are reliable with respect to video content, videos do not always reflect the place ambiance reported by people in-situ. We believe that the developed methodology provides an opportunity to understand the physical mobility, activities, and social context of youth as they experience different aspects of nightlife.", "citation": "Citations (6)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "University of Zurich", "University of Zurich", "Addiction Switz ... te, Switzerland"], "authors": ["Darshan Santani.....http://dblp.org/pers/hd/s/Santani:Darshan", "Joan-Isaac Biel.....http://dblp.org/pers/hd/b/Biel:Joan=Isaac", "Florian Labhart.....http://dblp.org/pers/hd/l/Labhart:Florian", "Jasmine Truong.....http://dblp.org/pers/hd/t/Truong:Jasmine", "Sara Landolt.....http://dblp.org/pers/hd/l/Landolt:Sara", "Emmanuel Kuntsche.....http://dblp.org/pers/hd/k/Kuntsche:Emmanuel", "Daniel Gatica-Perez.....http://dblp.org/pers/hd/g/Gatica=Perez:Daniel"], "conf": "huc", "year": "2016", "pages": 12}