{"title": "Visualization-aware sampling for very large databases.", "fields": ["stratified sampling", "density estimation", "overhead", "data reduction", "tuple"], "abstract": "Interactive visualizations are crucial in ad hoc data exploration and analysis. However, with the growing number of massive datasets, generating visualizations in interactive timescales is increasingly challenging. One approach for improving the speed of the visualization tool is via data reduction in order to reduce the computational overhead, but at a potential cost in visualization accuracy. Common data reduction techniques, such as uniform and stratified sampling, do not exploit the fact that the sampled tuples will be transformed into a visualization for human consumption. We propose a visualization-aware sampling (VAS) that guarantees high quality visualizations with a small subset of the entire dataset. We validate our method when applied to scatter and map plots for three common visualization goals: regression, density estimation, and clustering. The key to our sampling method's success is in choosing a set of tuples that minimizes a visualization-inspired loss function. While existing sampling approaches minimize the error of aggregation queries, we focus on a loss function that maximizes the visual fidelity of scatter plots. Our user study confirms that our proposed loss function correlates strongly with user success in using the resulting visualizations. Our experiments show that (i) VAS improves user's success by up to 35% in various visualization tasks, and (ii) VAS can achieve a required visualization quality up to 400× faster.", "citation": "Citations (18)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Yongjoo Park.....http://dblp.org/pers/hd/p/Park:Yongjoo", "Michael J. Cafarella.....http://dblp.org/pers/hd/c/Cafarella:Michael_J=", "Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan"], "conf": "icde", "year": "2016", "pages": 12}