{"title": "PRADA: prioritizing android devices for apps by mining large-scale usage data.", "fields": ["android", "profiling", "software quality", "usage data", "collaborative filtering"], "abstract": "Selecting and prioritizing major device models are critical for mobile app developers to select testbeds and optimize resources such as marketing and quality-assurance resources. The heavily fragmented distribution of Android devices makes it challenging to select a few major device models out of thousands of models available on the market. Currently app developers usually rely on some reported or estimated general market share of device models. However, these estimates can be quite inaccurate, and more problematically, can be irrelevant to the particular app under consideration. To address this issue, we propose  PRADA , the first approach to  pr ioritizing  A ndroid  d evice models for individual  a pps, based on mining large-scale usage data. PRADA adapts the concept of operational profiling (popularly used in software reliability engineering) for mobile apps -- the usage of an app on a specific device model reflects the importance of that device model for the app. PRADA includes a collaborative filtering technique to predict the usage of an app on different device models, even if the app is entirely new (without its actual usage in the market yet), based on the usage data of a large collection of apps. We empirically demonstrate the effectiveness of PRADA over two popular app categories, i.e.,  Game  and  Media , covering over 3.86 million users and 14,000 device models collected through a leading Android management app in China.", "citation": "Citations (13)", "departments": ["Peking University", "Peking University", "Peking University", "University of Illinois at Urbana–Champaign", "University of Michigan"], "authors": ["Xuan Lu.....http://dblp.org/pers/hd/l/Lu:Xuan", "Xuanzhe Liu.....http://dblp.org/pers/hd/l/Liu:Xuanzhe", "Huoran Li.....http://dblp.org/pers/hd/l/Li:Huoran", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "Qiaozhu Mei.....http://dblp.org/pers/hd/m/Mei:Qiaozhu", "Dan Hao.....http://dblp.org/pers/hd/h/Hao:Dan", "Gang Huang.....http://dblp.org/pers/hd/h/Huang_0001:Gang", "Feng Feng.....http://dblp.org/pers/hd/f/Feng_0001:Feng"], "conf": "icse", "year": "2016", "pages": 11}