{"title": "The missing link: explaining ELF static linking, semantically.", "fields": ["relocation", "hol", "linker", "correctness", "executable"], "abstract": "Beneath the surface, software usually depends on complex  linker behaviour  to work as intended. Even linking  hello_world.c  is surprisingly involved, and systems software such as  libc  and operating system kernels rely on a host of linker features. But linking is poorly understood by working programmers and has largely been neglected by language researchers.   In this paper we survey the many use-cases that linkers support and the poorly specified  linker speak  by which they are controlled: metadata in object files, command-line options, and linker-script language. We provide the first validated formalisation of a realistic executable and linkable format (ELF), and capture aspects of the Application Binary Interfaces for four mainstream platforms (AArch64, AMD64, Power64, and IA32). Using these, we develop an executable specification of static linking, covering (among other things) enough to link small C programs (we use the example of bzip2) into a correctly running executable. We provide our specification in Lem and Isabelle/HOL forms. This is the first formal specification of mainstream linking. We have used the Isabelle/HOL version to prove a sample correctness property for one case of AMD64 ABI relocation, demonstrating that the specification supports formal proof, and as a first step towards the much more ambitious goal of verified linking. Our work should enable several novel strands of research, including linker-aware verified compilation and program analysis, and better languages for controlling linking.", "citation": "Citations (5)", "departments": ["University of Cambridge", "University of Cambridge", "University of Cambridge"], "authors": ["Stephen Kell.....http://dblp.org/pers/hd/k/Kell:Stephen", "Dominic P. Mulligan.....http://dblp.org/pers/hd/m/Mulligan:Dominic_P=", "Peter Sewell.....http://dblp.org/pers/hd/s/Sewell:Peter"], "conf": "oopsla", "year": "2016", "pages": 17}