{"title": "MPMA: Mixture Probabilistic Matrix Approximation for Collaborative Filtering.", "fields": ["movielens", "mixture model", "probabilistic logic", "scalability", "collaborative filtering"], "abstract": "Matrix approximation (MA) is one of the most popular techniques for collaborative filtering (CF). Most existing MA methods train user/item latent factors based on a user-item rating matrix and then use the global latent factors to model all users/items. However, globally optimized latent factors may not reflect the unique interests shared among only subsets of users/items, without which unique interests of users may not be accurately modelled. As a result, existing MA methods, which cannot capture the uniqueness of different user/item, cannot provide optimal recommendation.\n\nIn this paper, a mixture probabilistic matrix approximation (MPMA) method is proposed, which unifies globally optimized user/item feature vectors (on the entire rating matrix) and locally optimized user/item feature vectors (on subsets of user/item ratings) to improve recommendation accuracy. More specifically, in MPMA, a method is developed to find both globally and locally optimized user/item feature vectors. Then, a Gaussian mixture model is adopted to combine global predictions and local predictions to produce accurate rating predictions. Experimental study using MovieLens and Netflix datasets demonstrates that MPMA outperforms five state-of-the-art MA based CF methods in recommendation accuracy with good scalability.", "citation": "Citations (2)", "year": "2016", "departments": ["Tongji University", "IBM", "East China Normal University", "IBM", "Univeristy of C ... lder, Colorado"], "conf": "ijcai", "authors": ["Chao Chen.....http://dblp.org/pers/hd/c/Chen:Chao", "Dongsheng Li.....http://dblp.org/pers/hd/l/Li:Dongsheng", "Qin Lv.....http://dblp.org/pers/hd/l/Lv:Qin", "Junchi Yan.....http://dblp.org/pers/hd/y/Yan:Junchi", "Stephen M. Chu.....http://dblp.org/pers/hd/c/Chu:Stephen_M=", "Li Shang.....http://dblp.org/pers/hd/s/Shang:Li"], "pages": 7}