{"title": "GTS: A Fast and Scalable Graph Processing Method based on Streaming Topology to GPUs.", "fields": ["multi core processor", "data deduplication", "conventional pci", "terabyte", "graph partition"], "abstract": "A fast and scalable graph processing method becomes increasingly important as graphs become popular in a wide range of applications and their sizes are growing rapidly. Most of distributed graph processing methods require a lot of machines equipped with a total of thousands of CPU cores and a few terabyte main memory for handling billion-scale graphs. Meanwhile, GPUs could be a promising direction toward fast processing of large-scale graphs by exploiting thousands of GPU cores. All of the existing methods using GPUs, however, fail to process large-scale graphs that do not fit in main memory of a single machine. Here, we propose a fast and scalable graph processing method GTS that handles even RMAT32 (64 billion edges) very efficiently only by using a single machine. The proposed method stores graphs in PCI-E SSDs and executes a graph algorithm using thousands of GPU cores while streaming topology data of graphs to GPUs via PCI-E interface. GTS is fast due to no communication overhead and scalable due to no data duplication from graph partitioning among machines. Through extensive experiments, we show that GTS consistently and significantly outperforms the major distributed graph processing methods, GraphX, Giraph, and PowerGraph, and the state-of-the-art GPU-based method TOTEM.", "citation": "Citations (14)", "year": "2016", "departments": ["Daegu Gyeongbuk Institute of Science and Technology", "Daegu Gyeongbuk Institute of Science and Technology", "Daegu Gyeongbuk Institute of Science and Technology", "Daegu Gyeongbuk Institute of Science and Technology", "Daegu Gyeongbuk Institute of Science and Technology"], "conf": "sigmod", "authors": ["Min-Soo Kim.....http://dblp.org/pers/hd/k/Kim_0002:Min=Soo", "Kyuhyeon An.....http://dblp.org/pers/hd/a/An:Kyuhyeon", "Himchan Park.....http://dblp.org/pers/hd/p/Park:Himchan", "Hyunseok Seo.....http://dblp.org/pers/hd/s/Seo:Hyunseok", "Jinwook Kim.....http://dblp.org/pers/hd/k/Kim:Jinwook"], "pages": 15}