{"title": "Multiple Kernel Clustering with Local Kernel Alignment Maximization.", "fields": ["polynomial kernel", "string kernel", "tree kernel", "kernel embedding of distributions", "multiple kernel learning"], "abstract": "Kernel alignment has recently been employed for multiple kernel clustering (MKC). However, we find that most of existing works implement this alignment in a global manner, which: i) indiscriminately forces all sample pairs to be equally aligned with the same ideal similarity; and ii) is inconsistent with a well-established concept that the similarity evaluated for two farther samples in a high dimensional space is less reliable. To address these issues, this paper proposes a novel MKC algorithm with a \"local\" kernel alignment, which only requires that the similarity of a sample to its k-nearest neighbours be aligned with the ideal similarity matrix. Such an alignment helps the clustering algorithm to focus on closer sample pairs that shall stay together and avoids involving unreliable similarity evaluation for farther sample pairs. We derive a new optimization problem to implement this idea, and design a two-step algorithm to efficiently solve it. As experimentally demonstrated on six challenging multiple kernel learning benchmark data sets, our algorithm significantly outperforms the state-of-the-art comparable methods in the recent literature, verifying the effectiveness and superiority of maximizing local kernel alignment.", "citation": "Citations (6)", "year": "2016", "departments": ["National University of Defense Technology", "National University of Defense Technology", "University of Wollongong", "National University of Defense Technology", "National University of Defense Technology"], "conf": "ijcai", "authors": ["Miaomiao Li.....http://dblp.org/pers/hd/l/Li:Miaomiao", "Xinwang Liu.....http://dblp.org/pers/hd/l/Liu:Xinwang", "Lei Wang.....http://dblp.org/pers/hd/w/Wang_0001:Lei", "Yong Dou.....http://dblp.org/pers/hd/d/Dou:Yong", "Jianping Yin.....http://dblp.org/pers/hd/y/Yin:Jianping", "En Zhu.....http://dblp.org/pers/hd/z/Zhu:En"], "pages": 7}