{"title": "Flamingo: Enabling Evolvable HDD-based Near-Line Storage.", "fields": ["physical design", "software deployment", "nearline storage", "stack", "latency"], "abstract": "Cloud providers and companies running large-scale data centers offer near-line, cold, and archival data storage, which trade access latency and throughput performance for cost. These often require physical rack-scale storage designs, e.g. Facebook/Open Compute Project (OCP) Cold Storage or Pelican, which co-design the hardware, mechanics, power, cooling and software to minimize costs to support the desired workload. A consequence is that the rack resources are restricted, requiring a software stack that can operate within the provided resources. The co-design makes it hard to understand the end-to-end performance impact of relatively small physical design changes and, worse, the software stacks are brittle to these changes.\n\nFlamingo supports the design of near-line HDD-based storage racks for cloud services. It requires a physical rack design, a set of resource constraints, and some target performance characteristics. Using these Flamingo is able to automatically parameterize a generic storage stack to allow it to operate on the physical rack. It is also able to efficiently explore the performance impact of varying the rack resources. It incorporates key principles learned from the design and deployment of cold storage systems. We demonstrate that Flamingo can rapidly reduce the time taken to design custom racks to support near-line storage.", "citation": "Not cited", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Sergey Legtchenko.....http://dblp.org/pers/hd/l/Legtchenko:Sergey", "Xiaozhou Li.....http://dblp.org/pers/hd/l/Li:Xiaozhou", "Antony I. T. Rowstron.....http://dblp.org/pers/hd/r/Rowstron:Antony_I=_T=", "Austin Donnelly.....http://dblp.org/pers/hd/d/Donnelly:Austin", "Richard Black.....http://dblp.org/pers/hd/b/Black:Richard"], "conf": "fast", "year": "2016", "pages": 14}