{"title": "Lurking Malice in the Cloud: Understanding and Detecting Cloud Repository as a Malicious Service.", "fields": ["small set", "cloud computing", "popularity", "adversary", "malice"], "abstract": "The popularity of cloud hosting services also brings in new security challenges: it has been reported that these services are increasingly utilized by miscreants for their malicious online activities. Mitigating this emerging threat, posed by such \"bad repositories\" (simply Bar), is challenging due to the different hosting strategy to traditional hosting service, the lack of direct observations of the repositories by those outside the cloud, the reluctance of the cloud provider to scan its customers' repositories without their consent, and the unique evasion strategies employed by the adversary. In this paper, we took the first step toward understanding and detecting this emerging threat. Using a small set of \"seeds\" (i.e., confirmed Bars), we identified a set of collective features from the websites they serve (e.g., attempts to hide Bars), which uniquely characterize the Bars. These features were utilized to build a scanner that detected over 600 Bars on leading cloud platforms like Amazon, Google, and 150K sites, including popular ones like groupon.com, using them. Highlights of our study include the pivotal roles played by these repositories on malicious infrastructures and other important discoveries include how the adversary exploited legitimate cloud repositories and why the adversary uses Bars in the first place that has never been reported. These findings bring such malicious services to the spotlight and contribute to a better understanding and ultimately eliminating this new threat.", "citation": "Citations (2)", "year": "2016", "departments": ["Georgia Institute of Technology", "Indiana University Bloomington", "Indiana University Bloomington", "Indiana University Bloomington", "Indiana University Bloomington"], "conf": "ccs", "authors": ["Xiaojing Liao.....http://dblp.org/pers/hd/l/Liao:Xiaojing", "Sumayah A. Alrwais.....http://dblp.org/pers/hd/a/Alrwais:Sumayah_A=", "Kan Yuan.....http://dblp.org/pers/hd/y/Yuan:Kan", "Luyi Xing.....http://dblp.org/pers/hd/x/Xing:Luyi", "XiaoFeng Wang.....http://dblp.org/pers/hd/w/Wang_0001:XiaoFeng", "Shuang Hao.....http://dblp.org/pers/hd/h/Hao:Shuang", "Raheem A. Beyah.....http://dblp.org/pers/hd/b/Beyah:Raheem_A="], "pages": 12}