{"title": "Efficient Synonym Filtering and Scalable Delayed Translation for Hybrid Virtual Caching.", "fields": ["cache algorithms", "cache coloring", "translation lookaside buffer", "smart cache", "cache pollution"], "abstract": "Conventional translation look-aside buffers (TLBs) are required to complete address translation with short latencies, as the address translation is on the critical path of all memory accesses even for L1 cache hits. Such strict TLB latency restrictions limit the TLB capacity, as the latency increase with large TLBs may lower the overall performance even with potential TLB miss reductions. Furthermore, TLBs consume a significant amount of energy as they are accessed for every instruction fetch and data access. To avoid the latency restriction and reduce the energy consumption, virtual caching techniques have been proposed to defer translation to after L1 cache misses. However, an efficient solution for the synonym problem has been a critical issue hindering the wide adoption of virtual caching.   Based on the virtual caching concept, this study proposes a hybrid virtual memory architecture extending virtual caching to the entire cache hierarchy, aiming to improve both performance and energy consumption. The hybrid virtual caching uses virtual addresses augmented with address space identifiers (ASID) in the cache hierarchy for common non-synonym addresses. For such non-synonyms, the address translation occurs only after last-level cache (LLC) misses. For uncommon synonym addresses, the addresses are translated to physical addresses with conventional TLBs before L1 cache accesses. To support such hybrid translation, we propose an efficient synonym detection mechanism based on Bloom filters which can identify synonym candidates with few false positives. For large memory applications, delayed translation alone cannot solve the address translation problem, as fixed-granularity delayed TLBs may not scale with the increasing memory requirements. To mitigate the translation scalability problem, this study proposes a delayed many segment translation designed for the hybrid virtual caching. The experimental results show that our approach effectively lowers accesses to the TLBs, leading to significant power savings. In addition, the approach provides performance improvement with scalable delayed translation with variable length segments.", "citation": "Citations (4)", "year": "2016", "departments": ["KAIST", "KAIST", "KAIST"], "conf": "isca", "authors": ["Chang Hyun Park.....http://dblp.org/pers/hd/p/Park:Chang_Hyun", "Taekyung Heo.....http://dblp.org/pers/hd/h/Heo:Taekyung", "Jaehyuk Huh.....http://dblp.org/pers/hd/h/Huh:Jaehyuk"], "pages": 13}