{"title": "CloudCache: On-demand Flash Cache Management for Cloud Computing.", "fields": ["cache invalidation", "page cache", "pipeline burst cache", "smart cache", "cache pollution"], "abstract": "Host-side flash caching has emerged as a promising solution to the scalability problem of virtual machine (VM) storage in cloud computing systems, but it still faces serious limitations in capacity and endurance. This paper presents CloudCache, an on-demand cache management solution to meet VM cache demands and minimize cache wear-out. First, to support on-demand cache allocation, the paper proposes a new cache demand model, Reuse Working Set (RWS), to capture only the data with good temporal locality, and uses the RWS size (RWSS) to model a workload's cache demand. By predicting the RWSS online and admitting only RWS into the cache, CloudCache satisfies the workload's actual cache demand and minimizes the induced wear-out. Second, to handle situations where a cache is insufficient for the VMs' demands, the paper proposes a dynamic cache migration approach to balance cache load across hosts by live migrating cached data along with the VMs. It includes both on-demand migration of dirty data and background migration of RWS to optimize the performance of the migrating VM. It also supports rate limiting on the cache data transfer to limit the impact to the co-hosted VMs. Finally, the paper presents comprehensive experimental evaluations using real-world traces to demonstrate the effectiveness of CloudCache.", "citation": "Citations (8)", "departments": ["Florida International University", "Florida International University", "VMware", "Arizona State University", "Parallel Machines"], "authors": ["Dulcardo Arteaga.....http://dblp.org/pers/hd/a/Arteaga:Dulcardo", "Jorge Cabrera.....http://dblp.org/pers/hd/c/Cabrera:Jorge", "Jing Xu.....http://dblp.org/pers/hd/x/Xu:Jing", "Swaminathan Sundararaman.....http://dblp.org/pers/hd/s/Sundararaman:Swaminathan", "Ming Zhao.....http://dblp.org/pers/hd/z/Zhao_0002:Ming"], "conf": "fast", "year": "2016", "pages": 15}