{"title": "Are Safer Looking Neighborhoods More Lively?: A Multimodal Investigation into Urban Life.", "fields": ["social studies", "urban planning", "safer", "visual perception", "defensible space theory"], "abstract": "Policy makers, urban planners, architects, sociologists, and economists are interested in creating urban areas that are both lively and safe. But are the safety and liveliness of neighborhoods independent characteristics? Or are they just two sides of the same coin? In a world where people avoid unsafe looking places, neighborhoods that look unsafe will be less lively, and will fail to harness the natural surveillance of human activity. But in a world where the preference for safe looking neighborhoods is small, the connection between the perception of safety and liveliness will be either weak or nonexistent. In this paper we explore the connection between the levels of activity and the perception of safety of neighborhoods in two major Italian cities by combining mobile phone data (as a proxy for activity or liveliness) with scores of perceived safety estimated using a Convolutional Neural Network trained on a dataset of Google Street View images scored using a crowdsourced visual perception survey. We find that: (i) safer looking neighborhoods are more active than what is expected from their population density, employee density, and distance to the city centre; and (ii) that the correlation between appearance of safety and activity is positive, strong, and significant, for females and people over 50, but negative for people under 30, suggesting that the behavioral impact of perception depends on the demographic of the population. Finally, we use occlusion techniques to identify the urban features that contribute to the appearance of safety, finding that greenery and street facing windows contribute to a positive appearance of safety (in agreement with Oscar Newman's defensible space theory). These results suggest that urban appearance modulates levels of human activity and, consequently, a neighborhood's rate of natural surveillance.", "citation": "Citations (6)", "departments": ["University of Trento", "University of Trento", "University of Trento", "University of Trento", "Massachusetts Institute of Technology"], "authors": ["Marco De Nadai.....http://dblp.org/pers/hd/n/Nadai:Marco_De", "Radu-Laurentiu Vieriu.....http://dblp.org/pers/hd/v/Vieriu:Radu=Laurentiu", "Gloria Zen.....http://dblp.org/pers/hd/z/Zen:Gloria", "Stefan Dragicevic.....http://dblp.org/pers/hd/d/Dragicevic:Stefan", "Nikhil Naik.....http://dblp.org/pers/hd/n/Naik:Nikhil", "Michele Caraviello.....http://dblp.org/pers/hd/c/Caraviello:Michele", "César Augusto Hidalgo.....http://dblp.org/pers/hd/h/Hidalgo:C=eacute=sar_Augusto", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu", "Bruno Lepri.....http://dblp.org/pers/hd/l/Lepri:Bruno"], "conf": "mm", "year": "2016", "pages": 9}