{"title": "Collaborative Nowcasting for Contextual Recommendation.", "fields": ["nowcasting", "exploit", "kalman filter", "mobile device", "world wide web"], "abstract": "Mobile digital assistants such as Microsoft Cortana and Google Now currently offer appealing proactive experiences to users, which aim to deliver the right information at the right time. To achieve this goal, it is crucial to precisely predict users' real-time intent. Intent is closely related to context, which includes not only the spatial-temporal information but also users' current activities that can be sensed by mobile devices. The relationship between intent and context is highly dynamic and exhibits chaotic sequential correlation. The context itself is often sparse and heterogeneous. The dynamics and co-movement among contextual signals are also elusive and complicated. Traditional recommendation models cannot directly apply to proactive experiences because they fail to tackle the above challenges. Inspired by the nowcasting practice in meteorology and macroeconomics, we propose an innovative collaborative nowcasting model to effectively resolve these challenges. The proposed model successfully addresses sparsity and heterogeneity of contextual signals. It also effectively models the convoluted correlation within contextual signals and between context and intent. Specifically, the model first extracts collaborative latent factors, which summarize shared temporal structural patterns in contextual signals, and then exploits the collaborative Kalman Filter to generate serially correlated personalized latent factors, which are utilized to monitor each user's real-time intent. Extensive experiments with real-world data sets from a commercial digital assistant demonstrate the effectiveness of the collaborative nowcasting model. The studied problem and model provide inspiring implications for new paradigms of recommendations on mobile intelligent devices.", "citation": "Citations (11)", "departments": ["University of Melbourne", "Microsoft", "Microsoft", "Microsoft", "University of Melbourne"], "authors": ["Yu Sun.....http://dblp.org/pers/hd/s/Sun:Yu", "Nicholas Jing Yuan.....http://dblp.org/pers/hd/y/Yuan:Nicholas_Jing", "Xing Xie.....http://dblp.org/pers/hd/x/Xie_0001:Xing", "Kieran McDonald.....http://dblp.org/pers/hd/m/McDonald:Kieran", "Rui Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Rui"], "conf": "www", "year": "2016", "pages": 12}