{"title": "\"I don't Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing.", "fields": ["everyday life", "clothing", "metaphor", "ambiguity", "imagination"], "abstract": "This paper explores the role dynamic textile displays play in relation to personal style: What does it mean to wear computationally responsive clothing and why would one be motivated to do so? We developed a novel textile display technology, called Ebb, and created several woven and crochet fabric swatches that explored clothing-specific design possibilities. We engaged fashion designers and non-designers in imagining how Ebb would integrate into their design practice or personal style of dressing. Participants evaluated the appeal and utility of clothing-based displays according to a very different set of criteria than traditional screen-based computational displays. Specifically, the slowness, low-resolution, and volatility of Ebb tended to be seen as assets as opposed to technical limitations in the context of personal style. Additionally, participants envisioned various ways that ambiguous, ambient, and abstract displays of information could prompt new experiences in their everyday lives. Our paper details the complex relationships between display and personal style and offers a new design metaphor and extension of Gaver et al.'s original descriptions of ambiguity in order to guide the design of clothing-based displays for everyday life.", "citation": "Citations (28)", "year": "2016", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "Google"], "conf": "chi", "authors": ["Laura Devendorf.....http://dblp.org/pers/hd/d/Devendorf:Laura", "Joanne Lo.....http://dblp.org/pers/hd/l/Lo:Joanne", "Noura Howell.....http://dblp.org/pers/hd/h/Howell:Noura", "Doris Jung Lin Lee.....http://dblp.org/pers/hd/l/Lee:Doris_Jung_Lin", "Nan-Wei Gong.....http://dblp.org/pers/hd/g/Gong:Nan=Wei", "Mustafa Emre Karagozler.....http://dblp.org/pers/hd/k/Karagozler:Mustafa_Emre", "Shiho Fukuhara.....http://dblp.org/pers/hd/f/Fukuhara:Shiho", "Ivan Poupyrev.....http://dblp.org/pers/hd/p/Poupyrev:Ivan", "Eric Paulos.....http://dblp.org/pers/hd/p/Paulos:Eric", "Kimiko Ryokai.....http://dblp.org/pers/hd/r/Ryokai:Kimiko"], "pages": 12}