{"title": "Relationship-aware code search for JavaScript frameworks.", "fields": ["snippet", "callback", "programmer", "javascript", "web search query"], "abstract": "JavaScript frameworks, such as jQuery, are widely used for developing web applications. To facilitate using these JavaScript frameworks to implement a feature (e.g., functionality), a large number of programmers often search for code snippets that implement the same or similar feature. However, existing code search approaches tend to be ineffective, without taking into account the fact that JavaScript code snippets often implement a feature based on various relationships (e.g., sequencing, condition, and callback relationships) among the invoked framework API methods. To address this issue, we present a novel Relationship-Aware Code Search (RACS) approach for finding code snippets that use JavaScript frameworks to implement a specific feature. In advance, RACS collects a large number of code snippets that use some JavaScript frameworks, mines API usage patterns from the collected code snippets, and represents the mined patterns with method call relationship (MCR) graphs, which capture framework API methods’ signatures and their relationships. Given a natural language (NL) search query issued by a programmer, RACS conducts NL processing to automatically extract an action relationship (AR) graph, which consists of actions and their relationships inferred from the query. In this way, RACS reduces code search to the problem of graph search: finding similar MCR graphs for a given AR graph. We conduct evaluations against representative real-world jQuery questions posted on Stack Overflow, based on 308,294 code snippets collected from over 81,540 files on the Internet. The evaluation results show the effectiveness of RACS: the top 1 snippet produced by RACS matches the target code snippet for 46% questions, compared to only 4% achieved by a relationship-oblivious approach.", "citation": "Citations (2)", "departments": ["Peking University", "Peking University", "Peking University", "Intel", "University of Illinois at Urbana–Champaign"], "authors": ["Xuan Li.....http://dblp.org/pers/hd/l/Li:Xuan", "Zerui Wang.....http://dblp.org/pers/hd/w/Wang:Zerui", "Qianxiang Wang.....http://dblp.org/pers/hd/w/Wang:Qianxiang", "Shoumeng Yan.....http://dblp.org/pers/hd/y/Yan:Shoumeng", "Tao Xie.....http://dblp.org/pers/hd/x/Xie_0001:Tao", "Hong Mei.....http://dblp.org/pers/hd/m/Mei:Hong"], "conf": "sigsoft", "year": "2016", "pages": 12}