{"title": "ProteusTM: Abstraction Meets Performance in Transactional Memory.", "fields": ["implementation", "bayesian optimization", "transactional memory", "collaborative filtering", "performance tuning"], "abstract": "The Transactional Memory (TM) paradigm promises to greatly simplify the development of concurrent applications. This led, over the years, to the creation of a plethora of TM implementations delivering wide ranges of performance across workloads. Yet, no universal implementation fits each and every workload. In fact, the best TM in a given workload can reveal to be disastrous for another one. This forces developers to face the complex task of tuning TM implementations, which significantly hampers their wide adoption. In this paper, we address the challenge of automatically identifying the best TM implementation for a given workload. Our proposed system, ProteusTM, hides behind the TM interface a large library of implementations. Underneath, it leverages a novel multi-dimensional online optimization scheme, combining two popular learning techniques: Collaborative Filtering and Bayesian Optimization.   We integrated ProteusTM in GCC and demonstrate its ability to switch between TMs and adapt several configuration parameters (e.g., number of threads). We extensively evaluated ProteusTM, obtaining average performance", "citation": "Citations (7)", "year": "2016", "departments": ["Instituto Superior Técnico", "Instituto Superior Técnico", "French Institute for Research in Computer Science and Automation", "École Polytechnique Fédérale de Lausanne", "Instituto Superior Técnico"], "conf": "asplos", "authors": ["Diego Didona.....http://dblp.org/pers/hd/d/Didona:Diego", "Nuno Diegues.....http://dblp.org/pers/hd/d/Diegues:Nuno", "Anne-Marie Kermarrec.....http://dblp.org/pers/hd/k/Kermarrec:Anne=Marie", "Rachid Guerraoui.....http://dblp.org/pers/hd/g/Guerraoui:Rachid", "Ricardo Neves.....http://dblp.org/pers/hd/n/Neves:Ricardo", "Paolo Romano.....http://dblp.org/pers/hd/r/Romano_0002:Paolo"], "pages": 15}