{"title": "Caching and operator cooperation policies for layered video content delivery.", "fields": ["false sharing", "cache algorithms", "scalable video coding", "smart cache", "pooling"], "abstract": "Distributed caching architectures have been proposed for bringing content close to requesters and the key problem is to design caching algorithms for reducing content delivery delay. The problem obtains an interesting new twist with the advent of advanced layered-video encoding techniques such as Scalable Video Coding (SVC). We show that the problem of finding the caching configuration of video encoding layers that minimizes average delay for a network operator is NP-Hard, and we establish a pseudopolynomial-time optimal solution using a connection with the multiple-choice knapsack problem. We also design caching algorithms for multiple operators that cooperate by pooling together their co-located caches, in an effort to aid each other, so as to avoid large delays due to downloading content from distant servers. We derive an approximate solution to this cooperative caching problem using a technique that partitions the cache capacity into amounts dedicated to own and others' caching needs. Numerical results based on real traces of SVC-encoded videos demonstrate up to 25% reduction in delay over existing (layer-agnostic) caching schemes, with increasing gains as the video popularity distribution gets steeper, and cache capacity increases.", "citation": "Citations (15)", "departments": ["University of Thessaly", "Yale University", "University of Thessaly", "Athens University of Economics and Business", "Yale University"], "authors": ["Konstantinos Poularakis.....http://dblp.org/pers/hd/p/Poularakis:Konstantinos", "George Iosifidis.....http://dblp.org/pers/hd/i/Iosifidis:George", "Antonios Argyriou.....http://dblp.org/pers/hd/a/Argyriou:Antonios", "Iordanis Koutsopoulos.....http://dblp.org/pers/hd/k/Koutsopoulos:Iordanis", "Leandros Tassiulas.....http://dblp.org/pers/hd/t/Tassiulas:Leandros"], "conf": "infocom", "year": "2016", "pages": 9}