{"title": "Tucana: Design and Implementation of a Fast and Efficient Scale-up Key-value Store.", "fields": ["overhead", "associative array", "minimum efficient scale", "random access", "nosql"], "abstract": "Given current technology trends towards fast storage devices and the need for increasing data processing density, it is important to examine key-value store designs that reduce CPU overhead. However, current key-value stores are still designed mostly for hard disk drives (HDDs) that exhibit a large difference between sequential and random access performance, and they incur high CPU overheads.\n\nIn this paper we present Tucana, a feature-rich key-value store that achieves low CPU overhead. Our design starts from a Be-tree approach to maintain asymptotic properties for inserts and uses three techniques to reduce overheads: copy-on-write, private allocation, and direct device management. In our design we favor choices that reduce overheads compared to sequential device accesses and large I/Os.\n\nWe evaluate our approach against RocksDB, a state-of-the-art key-value store, and show that our approach improves CPU efficiency by up to 9.2× and an average of 6× across all workloads we examine. In addition, Tucana improves throughput compared to RocksDB by up to 7×. Then, we use Tucana to replace the storage engine of HBase and compare it to native HBase and Cassandra two of the most popular NoSQL stores. Our results show that Tucana outperforms HBase by up to 8× in CPU efficiency and by up to 10× in throughput. Tucana's improvements are even higher when compared to Cassandra.", "citation": "Citations (7)", "departments": ["Foundation for Research & Technology – Hellas", "Foundation for Research & Technology – Hellas", "Foundation for Research & Technology – Hellas", "Foundation for Research & Technology – Hellas"], "authors": ["Anastasios Papagiannis.....http://dblp.org/pers/hd/p/Papagiannis:Anastasios", "Giorgos Saloustros.....http://dblp.org/pers/hd/s/Saloustros:Giorgos", "Pilar González-Férez.....http://dblp.org/pers/hd/g/Gonz=aacute=lez=F=eacute=rez:Pilar", "Angelos Bilas.....http://dblp.org/pers/hd/b/Bilas:Angelos"], "conf": "usenix", "year": "2016", "pages": 14}