{"title": "Routing under balance.", "fields": ["pathwidth", "hopcroft karp algorithm", "pancyclic graph", "longest path problem", "maximal independent set"], "abstract": "We introduce the notion of  balance  for directed graphs: a weighted directed graph is α-balanced if for every cut  S  ⊆  V , the total weight of edges going from  S  to  V ∖  S  is within factor α of the total weight of edges going from  V ∖  S  to  S . Several important families of graphs are nearly balanced, in particular, Eulerian graphs (with α = 1) and residual graphs of (1+є)-approximate undirected maximum flows (with α= O (1/є)).   We use the notion of balance to give a more fine-grained understanding of several well-studied routing questions that are considerably harder in directed graphs. We first revisit oblivious routings in directed graphs. Our main algorithmic result is an oblivious routing scheme for  single-source  instances that achieve an  O (α · log 3   n  / loglog n ) competitive ratio. In the process, we make several technical contributions which may be of independent interest. In particular, we give an efficient algorithm for computing  low-radius decompositions  of directed graphs parameterized by balance. We also define and construct  low-stretch arborescences , a generalization of low-stretch spanning trees to directed graphs.   On the negative side, we present new lower bounds for oblivious routing problems on directed graphs. We show that the competitive ratio of oblivious routing algorithms for directed graphs is Ω( n ) in general; this result improves upon the long-standing best known lower bound of Ω(√ n ) by Hajiaghayi et al. We also show that our restriction to single-source instances is necessary by showing an Ω(√ n ) lower bound for multiple-source oblivious routing in Eulerian graphs.   We also study the maximum flow problem in balanced directed graphs with arbitrary capacities. We develop an efficient algorithm that finds an (1+є)-approximate maximum flows in α-balanced graphs in time  O ( m  α 2  / є 2 ). We show that, using our approximate maximum flow algorithm, we can efficiently determine whether a given directed graph is α-balanced. Additionally, we give an application to the directed sparsest cut problem.", "citation": "Citations (2)", "year": "2016", "departments": ["University of Warwick", "Carnegie Mellon University", "Carnegie Mellon University", "Microsoft"], "conf": "stoc", "authors": ["Alina Ene.....http://dblp.org/pers/hd/e/Ene:Alina", "Gary L. Miller.....http://dblp.org/pers/hd/m/Miller:Gary_L=", "Jakub Pachocki.....http://dblp.org/pers/hd/p/Pachocki:Jakub", "Aaron Sidford.....http://dblp.org/pers/hd/s/Sidford:Aaron"], "pages": 14}