{"title": "Snap-To-It: A User-Inspired Platform for Opportunistic Device Interactions.", "fields": ["mobile interaction", "computer appliance", "software deployment", "snap", "use case"], "abstract": "The ability to quickly interact with any nearby appliance from a mobile device would allow people to perform a wide range of one-time tasks ( e.g. , printing a document in an unfamiliar office location). However, users currently lack this capability, and must instead manually configure their devices for each appliance they want to use. To address this problem, we created Snap-To-It, a system that allows users to opportunistically interact with any appliance simply by taking a picture of it. Snap-To-It shares the image of the appliance a user wants to interact with over a local area network. Appliances then analyze this image (along with the user's location and device orientation) to see if they are being \"selected,\" and deliver the corresponding control interface to the user's mobile device. Snap-To-It's design was informed by two technology probes that explored how users would like to select and interact with appliances using their mobile phone. These studies highlighted the need to be able to select hardware  and  software  via  a camera, and identified several novel use cases not supported by existing systems ( e.g. , interacting with disconnected objects, transferring settings between appliances). In this paper, we show how Snap-To-It's design is informed by our probes and how developers can utilize our system. We then show that Snap-To-It can identify appliances with over 95.3% accuracy, and demonstrate through a two-month deployment that our approach is robust to gradual changes to the environment.", "citation": "Citations (16)", "year": "2016", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Peking University", "Coimbatore Institute of Technology"], "conf": "chi", "authors": ["Adrian A. de Freitas.....http://dblp.org/pers/hd/f/Freitas:Adrian_A=_de", "Michael Nebeling.....http://dblp.org/pers/hd/n/Nebeling:Michael", "Xiang 'Anthony' Chen.....http://dblp.org/pers/hd/c/Chen:Xiang_=Anthony=", "Junrui Yang.....http://dblp.org/pers/hd/y/Yang:Junrui", "Akshaye Shreenithi Kirupa Karthikeyan Ranithangam.....http://dblp.org/pers/hd/r/Ranithangam:Akshaye_Shreenithi_Kirupa_Karthikeyan", "Anind K. Dey.....http://dblp.org/pers/hd/d/Dey:Anind_K="], "pages": 12}