{"title": "Distributed deterministic broadcasting algorithms under the SINR model.", "fields": ["distributed minimum spanning tree", "broadcasting", "maximal independent set", "atomic broadcast", "broadcast domain"], "abstract": "Global broadcasting is a fundamental problem in wireless multi-hop networks. In this paper, we propose two distributed deterministic algorithms for global broadcasting based on the Signal-to-Interference-plus-Noise-Ratio (SINR) model. In both algorithms, an arbitrary node can become the source node, and the rest of the nodes are divided into different layers according to their distance to the source node. A broadcast message is propagated from the source node to all the other nodes in a layer by layer fashion. Our first proposed algorithm (named TEGB) selects a Maximal Independent Set (MIS) for each layer. Subsequently, multiple subsets of the MIS are carefully selected so as to allow the most concurrent transmissions. Our theoretical analysis shows that TEGB has the time complexity of O(D log n), where n is the total number of nodes in the network and D is the diameter of the network. Compared with the popular algorithm DetGenBroadcast proposed in [1], TEGB has a logarithmic improvement in running time. Furthermore, we develop the second algorithm (named TBGB) to reduce the number of duplicated broadcast messages at each layer. To be specific, TBGB attempts to form a unidirectional spanning tree of the network. On the spanning tree, only the non-leaf nodes transmit the broadcast message. Therefore, the redundant broadcasts in the same layer are eliminated. Our theoretical analysis shows that TBGB has the time complexity of ΟDΔ log n), where Δ is the maximum node degree.", "citation": "Citations (1)", "departments": ["Qufu Normal University", "Qufu Normal University", "Texas Christian University", "Qufu Normal University", "George Washington University"], "authors": ["Xiang Tian.....http://dblp.org/pers/hd/t/Tian:Xiang", "Jiguo Yu.....http://dblp.org/pers/hd/y/Yu:Jiguo", "Liran Ma.....http://dblp.org/pers/hd/m/Ma:Liran", "Guangshun Li.....http://dblp.org/pers/hd/l/Li:Guangshun", "Xiuzhen Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiuzhen"], "conf": "infocom", "year": "2016", "pages": 9}