{"title": "NetVLAD: CNN Architecture for Weakly Supervised Place Recognition.", "fields": ["image retrieval", "ranking", "convolutional neural network", "visual word", "backpropagation", "architecture"], "abstract": "We tackle the problem of large scale visual place recognition, where the task is to quickly and accurately recognize the location of a given query photograph. We present the following three principal contributions. First, we develop a convolutional neural network (CNN) architecture that is trainable in an end-to-end manner directly for the place recognition task. The main component of this architecture, NetVLAD, is a new generalized VLAD layer, inspired by the \"Vector of Locally Aggregated Descriptors\" image representation commonly used in image retrieval. The layer is readily pluggable into any CNN architecture and amenable to training via backpropagation. Second, we develop a training procedure, based on a new weakly supervised ranking loss, to learn parameters of the architecture in an end-to-end manner from images depicting the same places over time downloaded from Google Street View Time Machine. Finally, we show that the proposed architecture significantly outperforms non-learnt image representations and off-the-shelf CNN descriptors on two challenging place recognition benchmarks, and improves over current state of-the-art compact image representations on standard image retrieval benchmarks.", "citation": "Citations (307)", "year": "2016", "departments": ["University of Oxford", "Czech Technical University in Prague", "Tokyo Institute of Technology", "Czech Technical University in Prague", "École Normale Supérieure", "École Normale Supérieure", "École Normale Supérieure", "Tokyo Institute of Technology", "Czech Technical University in Prague", "École Normale Supérieure"], "conf": "cvpr", "authors": ["Relja Arandjelovic.....http://dblp.org/pers/hd/a/Arandjelovic:Relja", "Petr Gronát.....http://dblp.org/pers/hd/g/Gron=aacute=t:Petr", "Akihiko Torii.....http://dblp.org/pers/hd/t/Torii:Akihiko", "Tomás Pajdla.....http://dblp.org/pers/hd/p/Pajdla:Tom=aacute=s", "Josef Sivic.....http://dblp.org/pers/hd/s/Sivic:Josef"], "pages": 11}