{"title": "Optimal local data exchange in fiber-wireless access network: A joint network coding and device association design.", "fields": ["network packet", "linear network coding", "passive optical network", "wireless wan", "network access device"], "abstract": "For many emerging mobile broadband services and applications, the source and destination are located in the same local region. Consequently, it is very important to design access networks to facilitate efficient local data exchange. In the past few years, most existing studies focus on either the wired or wireless domains. In this paper, we aim to exploit both the wired and wireless domains. Specifically, we consider a Fiber-Wireless access network in which a passive optical network (PON) connects densely deployed base stations. In such a scenario, we propose a novel access scheme, namely, NCDA, where the main idea is to utilize both network coding and device association. To understand the potentials of NCDA, we first formulate a mixed integer nonlinear programming (MINLP) to minimize the weighted number of packet transmissions (WNT), which is related to both the system capacity and energy consumption. We then theoretically analyze the tight upper bounds of the minimal WNT in the PON, which helps us to approximate the original problem by a mixed integer linear programming (MILP). Next, we develop efficient algorithms based on linear programming relaxation to solve the optimal NCDA problem. To validate our design, we conduct extensive simulation experiments, which demonstrate the impact of important network parameters and the promising potentials of the proposed scheme.", "citation": "Citations (2)", "departments": ["Soochow University", "Shanghai University of Electric Power", "City University of Hong Kong", "University at Buffalo"], "authors": ["Jin Wang.....http://dblp.org/pers/hd/w/Wang_0009:Jin", "Kejie Lu.....http://dblp.org/pers/hd/l/Lu:Kejie", "Jianping Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianping", "Chunming Qiao.....http://dblp.org/pers/hd/q/Qiao:Chunming"], "conf": "infocom", "year": "2016", "pages": 9}