{"title": "Panda: Neighbor discovery on a power harvesting budget.", "fields": ["testbed", "state switching", "power budget", "neighbor discovery protocol", "energy harvesting", "video tracking"], "abstract": "Object tracking applications are gaining popularity and will soon utilize energy harvesting (EH) low-power nodes that will consume power mostly for neighbor discovery (ND) (i.e.,  identifying  nodes within communication range). Although ND protocols were developed for sensor networks, the  challenges posed by emerging EH low-power transceivers were not addressed . Therefore, we  design an ND protocol tailored for the characteristics of a representative EH prototype : the TI eZ430-RF2500-SEH. We present a generalized model of ND accounting for unique prototype characteristics (i.e., energy costs for transmission/reception, and transceiver state switching times/costs). Then, we present the Power Aware ND Asynchronously (Panda) protocol, in which nodes transition between the sleep, receive, and transmit states. We analyze Panda and select its parameters to maximize the  ND rate  subject to a homogeneous power budget. We also present Panda-D, designed for  non-homogeneous  EH nodes. We perform extensive testbed evaluations using the prototypes and study various design tradeoffs. We demonstrate a small difference (less than 2%) between experimental and analytical results, thereby confirming the modeling assumptions. Moreover, we show that Panda improves the ND rate by up to    $3\\times $    compared with related protocols. Finally, we show that Panda-D operates well under non-homogeneous power harvesting.", "citation": "Citations (6)", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "authors": ["Robert Margolies.....http://dblp.org/pers/hd/m/Margolies:Robert", "Guy Grebla.....http://dblp.org/pers/hd/g/Grebla:Guy", "Tingjun Chen.....http://dblp.org/pers/hd/c/Chen:Tingjun", "Dan Rubenstein.....http://dblp.org/pers/hd/r/Rubenstein:Dan", "Gil Zussman.....http://dblp.org/pers/hd/z/Zussman:Gil"], "conf": "infocom", "year": "2016", "pages": 9}