{"title": "Incentivizing spectrum sensing in database-driven dynamic spectrum sharing.", "fields": ["geolocation", "dynamic pricing", "stochastic game", "incentive", "stackelberg competition"], "abstract": "The legacy concept of exclusion zones (EZs) is inept at enabling efficient utilization of fallow spectrum by secondary users (SUs), since legacy EZs are static and overly-conservative. The notion of a static EZ implies that it has to protect incumbent users (IUs) from the union of likely interference scenarios, leading to a worst-case, conservative solution. In this paper, we propose the concept of dynamic, multi-tier EZs, which takes advantage of participatory spectrum sensing carried out by SUs to support efficient database-driven spectrum sharing while protecting IUs against SU-induced aggregate interference. Specifically, the database directly incentivizes SUs to participate in spectrum sensing, which augments geolocation database by defining smaller EZs with dynamic boundaries and creating additional spectrum access opportunities for SUs. We propose an incentive mechanism based on a two-level game-theoretic model, in which the database conducts dynamic pricing in a first-level Stackelberg game in the presence of SUs who strategically contribute to spectrum sensing in a second-level stochastic game. The existence of an equilibrium solution is proven. According to our findings, the proposed incentive mechanism for the concept of dynamic, multi-tier EZs is effective to improve spectrum utilization efficiency while guaranteeing incumbent protection.", "citation": "Citations (3)", "departments": ["Chinese Academy of Sciences", "Virginia Tech", "Virginia Tech", "Virginia Tech", "Chinese Academy of Sciences"], "authors": ["Bo Gao.....http://dblp.org/pers/hd/g/Gao:Bo", "Sudeep Bhattarai.....http://dblp.org/pers/hd/b/Bhattarai:Sudeep", "Jung-Min \"Jerry\" Park.....http://dblp.org/pers/hd/p/Park:Jung=Min_=Jerry=", "Yaling Yang.....http://dblp.org/pers/hd/y/Yang:Yaling", "Min Liu.....http://dblp.org/pers/hd/l/Liu:Min", "Kexiong Curtis Zeng.....http://dblp.org/pers/hd/z/Zeng:Kexiong_Curtis", "Yanzhi Dou.....http://dblp.org/pers/hd/d/Dou:Yanzhi"], "conf": "infocom", "year": "2016", "pages": 9}