{"title": "A QoS-enabled holistic optimization framework for LTE-Advanced heterogeneous networks.", "fields": ["macro", "heterogeneous network", "throughput", "lte advanced", "network performance"], "abstract": "LTE-Advanced (LTE-A) macro-cell deployments are being enhanced with small cells, i.e., low-power base stations, to increase the network coverage and capacity. However, simultaneous co-channel transmissions from macro and small cells cause increased inter-cell interference and under-utilize the spectrum resources at the small cells. The following LTE-A design techniques are used to improve system performance in such deployments: (i) Carrier Aggregation (CA) to increase capacity by using additional carrier bandwidth; (ii) enhanced Inter-Cell Interference Coordination (elCIC), that includes (a) Cell Selection Biasing (CSB) to increase small cell spectrum utilization via cell range expansion; and (b) blanking data transmission on the macro cells for a certain duration of time to increase cell-edge user throughput Our objective is to maximize the CSB of the small cell, subject to user QoS constraints and blanking support from the macro cell. Towards this end, we develop an analytical model that captures the inter-dependency between elCIC techniques. We observe that, not accounting for the complex inter-dependencies between these techniques leads to a degraded network performance. We propose a framework that jointly optimizes elCIC and the assignment of multiple component carriers in an LTE-A deployment for increasing spectrum utilization at the small cells with appropriate blanking support from the macro cells. Our simulation results show that our approach increases the small cell spectrum utilization and aggregate cell-edge throughput by as much as 200%.", "citation": "Citations (2)", "departments": ["University of California, Davis", "AT&T Labs", "AT&T Labs", "Purdue University", "AT&T Labs"], "authors": ["Rajarajan Sivaraj.....http://dblp.org/pers/hd/s/Sivaraj:Rajarajan", "Ioannis Broustis.....http://dblp.org/pers/hd/b/Broustis:Ioannis", "N. K. Shankaranarayanan.....http://dblp.org/pers/hd/s/Shankaranarayanan:N=_K=", "Vaneet Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Vaneet", "Rittwik Jana.....http://dblp.org/pers/hd/j/Jana:Rittwik", "Prasant Mohapatra.....http://dblp.org/pers/hd/m/Mohapatra:Prasant"], "conf": "infocom", "year": "2016", "pages": 9}