{"title": "Continuous deployment of mobile software at facebook (showcase).", "fields": ["continuous delivery", "software quality", "long term support", "release management", "software release life cycle"], "abstract": "Continuous deployment is the practice of releasing software updates to production as soon as it is ready, which is receiving increased adoption in industry. The frequency of updates of mobile software has traditionally lagged the state of practice for cloud-based services for a number of reasons. Mobile versions can only be released periodically. Users can choose when and if to upgrade, which means that several different releases coexist in production. There are hundreds of Android hardware variants, which increases the risk of having errors in the software being deployed.     Facebook has made significant progress in increasing the frequency of its mobile deployments. Over a period of 4 years, the Android release has gone from a deployment every 8 weeks to a deployment every week. In this paper, we describe in detail the mobile deployment process at FB. We present our findings from an extensive analysis of software engineering metrics based on data collected over a period of 7 years. A key finding is that the frequency of deployment does not directly affect developer productivity or software quality. We argue that this finding is due to the fact that increasing the frequency of continuous deployment forces improved release and deployment automation, which in turn reduces developer workload. Additionally, the data we present shows that dog-fooding and obtaining feedback from alpha and beta customers is critical to maintaining release quality.", "citation": "Citations (2)", "departments": ["Facebook", "University of Michigan", "Carnegie Mellon University", "Facebook", "Facebook"], "authors": ["Chuck Rossi.....http://dblp.org/pers/hd/r/Rossi:Chuck", "Elisa Shibley.....http://dblp.org/pers/hd/s/Shibley:Elisa", "Shi Su.....http://dblp.org/pers/hd/s/Su:Shi", "Kent L. Beck.....http://dblp.org/pers/hd/b/Beck:Kent_L=", "Tony Savor.....http://dblp.org/pers/hd/s/Savor:Tony", "Michael Stumm.....http://dblp.org/pers/hd/s/Stumm:Michael"], "conf": "sigsoft", "year": "2016", "pages": 12}