{"title": "Towards Globally Optimal Crowdsourcing Quality Management: The Uniform Worker Setting.", "fields": ["crowdsourcing", "quality management", "expectation maximization algorithm", "leverage", "large numbers"], "abstract": "We study crowdsourcing quality management, that is, given worker responses to a set of tasks, our goal is to jointly estimate the true answers for the tasks, as well as the quality of the workers. Prior work on this problem relies primarily on applying Expectation-Maximization (EM) on the underlying maximum likelihood problem to estimate true answers as well as worker quality. Unfortunately, EM only provides a locally optimal solution rather than a globally optimal one. Other solutions to the problem (that do not leverage EM) fail to provide global optimality guarantees as well. In this paper, we focus on filtering, where tasks require the evaluation of a yes/no predicate, and rating, where tasks elicit integer scores from a finite domain. We design algorithms for finding the global optimal estimates of correct task answers and worker quality for the underlying maximum likelihood problem, and characterize the complexity of these algorithms. Our algorithms conceptually consider all mappings from tasks to true answers (typically a very large number), leveraging two key ideas to reduce, by several orders of magnitude, the number of mappings under consideration, while preserving optimality. We also demonstrate that these algorithms often find more accurate estimates than EM-based algorithms. This paper makes an important contribution towards understanding the inherent complexity of globally optimal crowdsourcing quality management.", "citation": "Citations (6)", "year": "2016", "departments": ["Stanford University", "University of Illinois at Urbana–Champaign", "Stanford University"], "conf": "sigmod", "authors": ["Akash Das Sarma.....http://dblp.org/pers/hd/s/Sarma:Akash_Das", "Aditya G. Parameswaran.....http://dblp.org/pers/hd/p/Parameswaran:Aditya_G=", "Jennifer Widom.....http://dblp.org/pers/hd/w/Widom:Jennifer"], "pages": 16}