{"title": "Frodo: Take off the Ring! Practical, Quantum-Secure Key Exchange from LWE.", "fields": ["key exchange", "government", "learning with errors", "quantum", "quantum computer", "mathematics", "post quantum cryptography", "distributed computing"], "abstract": "Lattice-based cryptography offers some of the most attractive primitives believed to be resistant to quantum computers. Following increasing interest from both companies and government agencies in building quantum computers, a number of works have proposed instantiations of practical post-quantum key exchange protocols based on hard problems in ideal lattices, mainly based on the Ring Learning With Errors (R-LWE) problem. While ideal lattices facilitate major efficiency and storage benefits over their non-ideal counterparts, the additional ring structure that enables these advantages also raises concerns about the assumed difficulty of the underlying problems. Thus, a question of significant interest to cryptographers, and especially to those currently placing bets on primitives that will withstand quantum adversaries, is how much of an advantage the additional ring structure actually gives in practice. Despite conventional wisdom that generic lattices might be too slow and unwieldy, we demonstrate that LWE-based key exchange is quite practical: our constant time implementation requires around 1.3ms computation time for each party; compared to the recent NewHope R-LWE scheme, communication sizes increase by a factor of 4.7x, but remain under 12 KiB in each direction. Our protocol is competitive when used for serving web pages over TLS; when partnered with ECDSA signatures, latencies increase by less than a factor of 1.6x, and (even under heavy load) server throughput only decreases by factors of 1.5x and 1.2x when serving typical 1 KiB and 100 KiB pages, respectively. To achieve these practical results, our protocol takes advantage of several innovations. These include techniques to optimize communication bandwidth, dynamic generation of public parameters (which also offers additional security against backdoors), carefully chosen error distributions, and tight security parameters.", "citation": "Not cited", "year": "2016", "departments": ["NXP Semiconductors", "Microsoft", "Google", "Microsoft", "CWI, Amsterdam, Netherlands"], "conf": "ccs", "authors": ["Joppe W. Bos.....http://dblp.org/pers/hd/b/Bos:Joppe_W=", "Craig Costello.....http://dblp.org/pers/hd/c/Costello:Craig", "Léo Ducas.....http://dblp.org/pers/hd/d/Ducas:L=eacute=o", "Ilya Mironov.....http://dblp.org/pers/hd/m/Mironov:Ilya", "Michael Naehrig.....http://dblp.org/pers/hd/n/Naehrig:Michael", "Valeria Nikolaenko.....http://dblp.org/pers/hd/n/Nikolaenko:Valeria", "Ananth Raghunathan.....http://dblp.org/pers/hd/r/Raghunathan:Ananth", "Douglas Stebila.....http://dblp.org/pers/hd/s/Stebila:Douglas"], "pages": 13}