{"title": "How to Architect a Query Compiler.", "fields": ["query optimization", "compiler construction", "query expansion", "functional compiler", "sargable"], "abstract": "This paper studies architecting query compilers. The state of the art in query compiler construction is lagging behind that in the compilers field. We attempt to remedy this by exploring the key causes of technical challenges in need of well founded solutions, and by gathering the most relevant ideas and approaches from the PL and compilers communities for easy digestion by database researchers. All query compilers known to us are more or less monolithic template expanders that do the bulk of the compilation task in one large leap. Such systems are hard to build and maintain. We propose to use a stack of multiple DSLs on different levels of abstraction with lowering in multiple steps to make query compilers easier to build and extend, ultimately allowing us to create more convincing and sustainable compiler-based data management systems. We attempt to derive our advice for creating such DSL stacks from widely acceptable principles. We have also re-created a well-known query compiler following these ideas and report on this effort.", "citation": "Citations (12)", "year": "2016", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "conf": "sigmod", "authors": ["Amir Shaikhha.....http://dblp.org/pers/hd/s/Shaikhha:Amir", "Yannis Klonatos.....http://dblp.org/pers/hd/k/Klonatos:Yannis", "Lionel Parreaux.....http://dblp.org/pers/hd/p/Parreaux:Lionel", "Lewis Brown.....http://dblp.org/pers/hd/b/Brown:Lewis", "Mohammad Dashti.....http://dblp.org/pers/hd/d/Dashti:Mohammad", "Christoph Koch.....http://dblp.org/pers/hd/k/Koch_0001:Christoph"], "pages": 16}