{"title": "Wisent: Robust downstream communication and storage for computational RFIDs.", "fields": ["ultra high frequency", "bandwidth throttling", "wireless", "channel", "communications protocol"], "abstract": "Computational RFID (CRFID) devices are emerging platforms that can enable perennial computation and sensing by eliminating the need for batteries. Although much research has been devoted to improving upstream (CRFID to RFID reader) communication rates, the opposite direction has so far been neglected, presumably due to the difficulty of guaranteeing fast and error-free transfer amidst frequent power interruptions of CRFID. With growing interest in the market where CRFIDs are forever-embedded in many structures, it is necessary for this void to be filled. Therefore, we propose Wisent — a robust downstream communication protocol for CRFIDs that operates on top of the legacy UHF RFID communication protocol: EPC C1G2. The novelty of Wisent is its ability to adaptively change the frame length sent by the reader, based on the length throttling mechanism, to minimize the transfer times at varying channel conditions. We present an implementation of Wisent for the WISP 5 and an off-the-shelf RFID reader. Our experiments show that Wisent allows transfer up to 16 times faster than a baseline, non-adaptive shortest frame case, i.e. single word length, at sub-meter distance. As a case study, we show how Wisent enables wireless CRFID reprogramming, demonstrating the world's first wirelessly reprogrammable (software defined) CRFID.", "citation": "Citations (7)", "departments": ["Delft University of Technology", "Delft University of Technology", "University of Washington", "University of Washington"], "authors": ["Jethro Tan.....http://dblp.org/pers/hd/t/Tan:Jethro", "Przemyslaw Pawelczak.....http://dblp.org/pers/hd/p/Pawelczak:Przemyslaw", "Aaron N. Parks.....http://dblp.org/pers/hd/p/Parks:Aaron_N=", "Joshua R. Smith.....http://dblp.org/pers/hd/s/Smith:Joshua_R="], "conf": "infocom", "year": "2016", "pages": 9}