{"title": "Detecting and fixing precision-specific operations for measuring floating-point errors.", "fields": ["real time computing", "precision and recall", "false positive paradox", "floating point", "theoretical computer science"], "abstract": "The accuracy of the floating-point calculation is critical to many applications and different methods have been proposed around floating-point accuracies, such as detecting the errors in the program, verifying the accuracy of the program, and optimizing the program to produce more accurate results. These approaches need a specification of the program to understand the ideal calculation performed by the program, which is usually approached by interpreting the program in a precision-unspecific way.     However, many operations programmed in existing code are inherently precision-specific, which cannot be easily interpreted in a precision-unspecific way. In fact, the semantics used in existing approaches usually fail to interpret precision-specific operations correctly.     In this paper, we present a systematic study on precision-specific operations. First, we propose a detection approach to detect precision-specific operations. Second, we propose a fixing approach to enable the tuning of precisions under the presence of precision-specific operations. Third, we studied the precision-specific operations in the GNU C standard math library based on our detection and fixing approaches. Our results show that (1) a significant number of code fragments in the standard C math library are precision-specific operations, and some large inaccuracies reported in existing studies are false positives or potential false positives due to precision-specific operations; (2) our detection approach has high precision and recall; (3) our fixing approach can lead to overall more accurate result.", "citation": "Citations (3)", "departments": ["Peking University", "Peking University", "Peking University", "Peking University", "Peking University"], "authors": ["Ran Wang.....http://dblp.org/pers/hd/w/Wang:Ran", "Daming Zou.....http://dblp.org/pers/hd/z/Zou:Daming", "Xinrui He.....http://dblp.org/pers/hd/h/He:Xinrui", "Yingfei Xiong.....http://dblp.org/pers/hd/x/Xiong:Yingfei", "Lu Zhang.....http://dblp.org/pers/hd/z/Zhang_0023:Lu", "Gang Huang.....http://dblp.org/pers/hd/h/Huang_0001:Gang"], "conf": "sigsoft", "year": "2016", "pages": 12}