{"title": "ARTcode: preserve art and code in any image.", "fields": ["image quality", "impromptu", "information hiding", "channel", "communication source"], "abstract": "The ubiquitous QR codes and some similar barcodes are becoming a convenient and popular approach to impromptu communication between mobile devices and their surrounding cyber-physical world. However, such codes suffer from two common drawbacks: poor viewing experience and inability to be identified through itself. In this work, we propose ART- code --  A daptive  R obust do T  matrix barco de , which aims to preserve ART and CODE features in one visual pattern. It works on any surface (paper or electronic displays) and is able to convert any image or any form of human-readable contents ( e.g. , a picture, a logo, a slogan) into an ART code . It  looks like  an image which retains human-readable and aesthetically pleasant contents, and in the meanwhile, it  acts as  a QR code which conveys data bits over the visual channel. The core enablers in ART code  are (1) the design of the colored dot matrix for data embedding with little distortion from the original image and (2) a comprehensive error correction scheme which enhances decoding robustness against noises and interferences from the original image in ART code . We implement ART code  with the receiver on Android phones and the sender from a PC or a phone (it can be printed in paper). We conduct extensive user survey and experiments for evaluation. It validates the effectiveness and wide applicability of ART code : It works well with all of 197 images randomly downloaded, covering representative categories of the gray-scale images, logos, colored ones with low/medium/strong contrasts. The image quality is quite acceptable in a subjective user-perception survey with 50 participants and data communication accuracy achieves as high as 99% in almost all the cases (> 96% raw accuracy in ART code  without error detection and other schemes).", "citation": "Citations (9)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Zhe Yang.....http://dblp.org/pers/hd/y/Yang:Zhe", "Yuting Bao.....http://dblp.org/pers/hd/b/Bao:Yuting", "Chuhao Luo.....http://dblp.org/pers/hd/l/Luo:Chuhao", "Xingya Zhao.....http://dblp.org/pers/hd/z/Zhao:Xingya", "Siyu Zhu.....http://dblp.org/pers/hd/z/Zhu:Siyu", "Chunyi Peng.....http://dblp.org/pers/hd/p/Peng:Chunyi", "Yunxin Liu.....http://dblp.org/pers/hd/l/Liu:Yunxin", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing"], "conf": "huc", "year": "2016", "pages": 12}