{"title": "On the Security and Performance of Proof of Work Blockchains.", "fields": ["fork", "implementation", "proof of work system", "cryptocurrency", "market capitalization", "computer security", "computer science"], "abstract": "Proof of Work (PoW) powered blockchains currently account for more than 90% of the total market capitalization of existing digital cryptocurrencies. Although the security provisions of Bitcoin have been thoroughly analysed, the security guarantees of variant (forked) PoW blockchains (which were instantiated with different parameters) have not received much attention in the literature. This opens the question whether existing security analysis of Bitcoin's PoW applies to other implementations which have been instantiated with different consensus and/or network parameters.   In this paper, we introduce a novel quantitative framework to analyse the security and performance implications of various consensus and network parameters of PoW blockchains. Based on our framework, we devise optimal adversarial strategies for double-spending and selfish mining while taking into account real world constraints such as network propagation, different block sizes, block generation intervals, information propagation mechanism, and the impact of eclipse attacks. Our framework therefore allows us to capture existing PoW-based deployments as well as PoW blockchain variants that are instantiated with different parameters, and to objectively compare the tradeoffs between their performance and security provisions.", "citation": "Not cited", "year": "2016", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "NEC Laboratorie ... elberg, Germany"], "conf": "ccs", "authors": ["Arthur Gervais.....http://dblp.org/pers/hd/g/Gervais:Arthur", "Ghassan O. Karame.....http://dblp.org/pers/hd/k/Karame:Ghassan_O=", "Karl Wüst.....http://dblp.org/pers/hd/w/W=uuml=st:Karl", "Vasileios Glykantzis.....http://dblp.org/pers/hd/g/Glykantzis:Vasileios", "Hubert Ritzdorf.....http://dblp.org/pers/hd/r/Ritzdorf:Hubert", "Srdjan Capkun.....http://dblp.org/pers/hd/c/Capkun:Srdjan"], "pages": 14}