{"title": "Beating CountSketch for heavy hitters in insertion streams.", "fields": ["beat", "integer", "without loss of generality", "binary logarithm", "data stream mining"], "abstract": "Given a stream  p  1 , …,  p   m   of items from a universe  U , which, without loss of generality we identify with the set of integers {1, 2, …,  n }, we consider the problem of returning all l 2 -heavy hitters, i.e., those items  j  for which  f   j   ≥ є √ F  2 , where  f   j   is the number of occurrences of item  j  in the stream, and  F  2  = ∑  i  ∈ [ n ]   f   i   2 . Such a guarantee is considerably stronger than the l 1 -guarantee, which finds those  j  for which  f   j   ≥ є  m . In 2002, Charikar, Chen, and Farach-Colton suggested the CountSketch data structure, which finds all such  j  using Θ(log 2   n ) bits of space (for constant є > 0). The only known lower bound is Ω(log n ) bits of space, which comes from the need to specify the identities of the items found.   In this paper we show one can achieve  O (log n  loglog n ) bits of space for this problem. Our techniques, based on Gaussian processes, lead to a number of other new results for data streams, including: (1) The first algorithm for estimating  F  2  simultaneously at all points in a stream using only  O (log n loglog n ) bits of space, improving a natural union bound. (2) A way to estimate the l ∞  norm of a stream up to additive error є √ F  2  with  O (log n loglog n ) bits of space, resolving Open Question 3 from the IITK 2006 list for insertion only streams.", "citation": "Citations (9)", "year": "2016", "departments": ["Johns Hopkins University", "ETH Zurich", "Johns Hopkins University", "IBM"], "conf": "stoc", "authors": ["Vladimir Braverman.....http://dblp.org/pers/hd/b/Braverman:Vladimir", "Stephen R. Chestnut.....http://dblp.org/pers/hd/c/Chestnut:Stephen_R=", "Nikita Ivkin.....http://dblp.org/pers/hd/i/Ivkin:Nikita", "David P. Woodruff.....http://dblp.org/pers/hd/w/Woodruff:David_P="], "pages": 14}