{"title": "Moolle: Fan-out control for scalable distributed data stores.", "fields": ["tree traversal", "response time", "queries per second", "latency", "social graph"], "abstract": "Many Online Social Networks horizontally partition data across data stores. This allows the addition of server nodes to increase capacity and throughput. For single key lookup queries such as computing a member's 1st degree connections, clients need to generate only one request to one data store. However, for multi key lookup queries such as computing a 2nd degree network, clients need to generate multiple requests to multiple data stores. The number of requests to fulfill the multi key lookup queries grows in relation to the number of partitions. Increasing the number of server nodes in order to increase capacity also increases the number of requests between the client and data stores. This may increase the latency of the query response time because of network congestion, tail-latency, and CPU bounding. Replication based partitioning strategies can reduce the number of requests in the multi key lookup queries. However, reducing the number of requests in a query can degrade the performance of certain queries where processing, computing, and filtering can be done by the data stores. A better system would provide the capability of controlling the number of requests in a query. This paper presents Moolle, a system of controlling the number of requests in queries to scalable distributed data stores. Moolle has been implemented in the LinkedIn distributed graph service that serves hundreds of thousands of social graph traversal queries per second. We believe that Moolle can be applied to other distributed systems that handle distributed data processing with a high volume of variable-sized requests.", "citation": "Not cited", "departments": ["LinkedIn", "LinkedIn", "LinkedIn", "WePay, Inc., 35 ... , United States"], "authors": ["SungJu Cho.....http://dblp.org/pers/hd/c/Cho:SungJu", "Andrew Carter.....http://dblp.org/pers/hd/c/Carter:Andrew", "Joshua Ehrlich.....http://dblp.org/pers/hd/e/Ehrlich:Joshua", "Jane Alam Jan.....http://dblp.org/pers/hd/j/Jan:Jane_Alam"], "conf": "icde", "year": "2016", "pages": 12}