{"title": "AT-GIS: Highly Parallel Spatial Query Processing with Associative Transducers.", "fields": ["spatial query", "web query classification", "parsing", "multi core processor", "query optimization"], "abstract": "Users in many domains, including urban planning, transportation, and environmental science want to execute analytical queries over continuously updated spatial datasets. Current solutions for large-scale spatial query processing either rely on extensions to RDBMS, which entails expensive loading and indexing phases when the data changes, or distributed map/reduce frameworks, running on resource-hungry compute clusters. Both solutions struggle with the sequential bottleneck of parsing complex, hierarchical spatial data formats, which frequently dominates query execution time. Our goal is to fully exploit the parallelism offered by modern multi-core CPUs for parsing and query execution, thus providing the performance of a cluster with the resources of a single machine. We describe AT-GIS, a highly-parallel spatial query processing system that scales linearly to a large number of CPU cores. AT-GIS integrates the parsing and querying of spatial data using a new computational abstraction called associative transducers (ATs). ATs can form a single data-parallel pipeline for computation without requiring the spatial input data to be split into logically independent blocks. Using ATs, AT-GIS can execute, in parallel, spatial query operators on the raw input data in multiple formats, without any pre-processing. On a single 64-core machine, AT-GIT provides 3x the performance of an 8-node Hadoop cluster with 192 cores for containment queries, and 10x for aggregation queries.", "citation": "Citations (1)", "year": "2016", "departments": ["Imperial College London", "Imperial College London", "Imperial College London"], "conf": "sigmod", "authors": ["Peter Ogden.....http://dblp.org/pers/hd/o/Ogden:Peter", "David B. Thomas.....http://dblp.org/pers/hd/t/Thomas:David_B=", "Peter R. Pietzuch.....http://dblp.org/pers/hd/p/Pietzuch:Peter_R="], "pages": 14}