{"title": "Just-in-time WLANs: On-demand interference-managed WLAN infrastructures.", "fields": ["linear programming relaxation", "rounding", "local area network", "throughput", "approximation algorithm"], "abstract": "In the past years, the centralized management of dense wireless local area networks has been emerged as a powerful paradigm for improving energy efficiency as well as avoiding severe interference. In this paper, we study the joint optimization on power-operation modes in access points (APs), channel selections and user-AP associations for improving energy efficiency and avoiding interference without sacrificing users' demands. To this end, we first formulate it as a mixed-integer programming using the popular Lyapunov approach, but it turns out to be computationally intractable, i.e., NP-hard. To address the issue, we propose a polynomial-time approximation algorithm and prove that it achieves a constant-factor approximation guarantee under mild assumptions. The main novelty underlying our algorithm design is based on a linear programming relaxation combining with two different greedy rounding schemes, where each achieves a constant-factor approximation in different regimes of parameters. We verify the performance of the proposed algorithm via extensive simulations and also demonstrate its practicability by implementing it at commercial APs using a Software-defined Networking framework, which shows that it reduces the wasted energy significantly while maintaining even higher throughput.", "citation": "Not cited", "departments": ["KAIST", "KAIST", "KAIST", "KAIST", "KAIST"], "authors": ["Kimin Lee.....http://dblp.org/pers/hd/l/Lee:Kimin", "Yeonkeun Kim.....http://dblp.org/pers/hd/k/Kim:Yeonkeun", "Seokhyun Kim.....http://dblp.org/pers/hd/k/Kim:Seokhyun", "Jinwoo Shin.....http://dblp.org/pers/hd/s/Shin:Jinwoo", "Seungwon Shin.....http://dblp.org/pers/hd/s/Shin:Seungwon", "Song Chong.....http://dblp.org/pers/hd/c/Chong:Song"], "conf": "infocom", "year": "2016", "pages": 9}