{"title": "Graph Stream Summarization: From Big Bang to Big Crunch.", "fields": ["analytics", "graph", "feedback arc set", "data stream mining", "graph database"], "abstract": "A graph stream, which refers to the graph with edges being updated sequentially in a form of a stream, has important applications in cyber security and social networks. Due to the sheer volume and highly dynamic nature of graph streams, the practical way of handling them is by summarization. Given a graph stream G, directed or undirected, the problem of graph stream summarization is to summarize G as SG with a much smaller (sublinear) space, linear construction time and constant maintenance cost for each edge update, such that SG allows many queries over G to be approximately conducted efficiently. The widely used practice of summarizing data streams is to treat each stream element independently by e.g., hash- or sample-based methods, without maintaining the connections (or relationships) between elements. Hence, existing methods can only solve ad-hoc problems, without supporting diversified and complicated analytics over graph streams. We present TCM, a novel generalized graph stream summary. Given an incoming edge, it summarizes both node and edge information in constant time. Consequently, the summary forms a graphical sketch where edges capture the connections inside elements, and nodes maintain relationships across elements. We discuss a wide range of supported queries and establish some error bounds. In addition, we experimentally show that TCM can effectively and efficiently support analytics over graph streams, which demonstrates its potential to start a new line of research and applications in graph stream management.", "citation": "Citations (12)", "year": "2016", "departments": ["Qatar Computing Research Institute", "Qatar Computing Research Institute", "Qatar Computing Research Institute"], "conf": "sigmod", "authors": ["Nan Tang.....http://dblp.org/pers/hd/t/Tang_0001:Nan", "Qing Chen.....http://dblp.org/pers/hd/c/Chen:Qing", "Prasenjit Mitra.....http://dblp.org/pers/hd/m/Mitra:Prasenjit"], "pages": 16}