{"title": "What would users change in my app? summarizing app reviews for recommending software changes.", "fields": ["software", "user expectations", "prioritization", "conceptual model", "automatic summarization"], "abstract": "Mobile app developers constantly monitor feedback in user reviews with the goal of improving their mobile apps and better meeting user expectations. Thus, automated approaches have been proposed in literature with the aim of reducing the effort required for analyzing feedback contained in user reviews via automatic classification/prioritization according to specific topics. In this paper, we introduce SURF (Summarizer of User Reviews Feedback), a novel approach to condense the enormous amount of information that developers of popular apps have to manage due to user feedback received on a daily basis. SURF relies on a conceptual model for capturing user needs useful for developers performing maintenance and evolution tasks. Then it uses sophisticated summarisation techniques for summarizing thousands of reviews and generating an interactive, structured and condensed agenda of recommended software changes. We performed an end-to-end evaluation of SURF on user reviews of 17 mobile apps (5 of them developed by Sony Mobile), involving 23 developers and researchers in total. Results demonstrate high accuracy of SURF in summarizing reviews and the usefulness of the recommended changes. In evaluating our approach we found that SURF helps developers in better understanding user needs, substantially reducing the time required by developers compared to manually analyzing user (change) requests and planning future software changes.", "citation": "Citations (55)", "departments": ["University of Sannio", "University of Zurich", "University of Zurich", "University of Sannio", "Sony Mobile Com ... ications, Japan"], "authors": ["Andrea Di Sorbo.....http://dblp.org/pers/hd/s/Sorbo:Andrea_Di", "Sebastiano Panichella.....http://dblp.org/pers/hd/p/Panichella:Sebastiano", "Carol V. Alexandru.....http://dblp.org/pers/hd/a/Alexandru:Carol_V=", "Junji Shimagaki.....http://dblp.org/pers/hd/s/Shimagaki:Junji", "Corrado Aaron Visaggio.....http://dblp.org/pers/hd/v/Visaggio:Corrado_Aaron", "Gerardo Canfora.....http://dblp.org/pers/hd/c/Canfora:Gerardo", "Harald C. Gall.....http://dblp.org/pers/hd/g/Gall:Harald_C="], "conf": "sigsoft", "year": "2016", "pages": 12}