{"title": "RDFind: Scalable Conditional Inclusion Dependency Discovery in RDF Datasets.", "fields": ["data integrity", "query optimization", "rdf", "data profiling", "data management"], "abstract": "Inclusion dependencies (INDs) form an important integrity constraint on relational databases, supporting data management tasks, such as join path discovery and query optimization. Conditional inclusion dependencies (CINDs), which define including and included data in terms of conditions, allow to transfer these capabilities to RDF data. However, CIND discovery is computationally much more complex than IND discovery and the number of CINDs even on small RDF datasets is intractable. To cope with both problems, we first introduce the notion of pertinent CINDs with an adjustable relevance criterion to filter and rank CINDs based on their extent and implications among each other. Second, we present RDFind, a distributed system to efficiently discover all pertinent CINDs in RDF data. RDFind employs a lazy pruning strategy to drastically reduce the CIND search space. Also, its exhaustive parallelization strategy and robust data structures make it highly scalable. In our experimental evaluation, we show that RDFind is up to 419 times faster than the state-of-the-art, while considering a more general class of CINDs. Furthermore, it is capable of processing a very large dataset of billions of triples, which was entirely infeasible before.", "citation": "Citations (3)", "year": "2016", "departments": ["Hasso Plattner Institute", "Hasso Plattner Institute", "Hasso Plattner Institute", "Qatar Computing Research Institute", "Qatar Computing Research Institute"], "conf": "sigmod", "authors": ["Sebastian Kruse.....http://dblp.org/pers/hd/k/Kruse_0001:Sebastian", "Anja Jentzsch.....http://dblp.org/pers/hd/j/Jentzsch:Anja", "Thorsten Papenbrock.....http://dblp.org/pers/hd/p/Papenbrock:Thorsten", "Zoi Kaoudi.....http://dblp.org/pers/hd/k/Kaoudi:Zoi", "Jorge-Arnulfo Quiané-Ruiz.....http://dblp.org/pers/hd/q/Quian=eacute==Ruiz:Jorge=Arnulfo", "Felix Naumann.....http://dblp.org/pers/hd/n/Naumann:Felix"], "pages": 15}