{"title": "The wobbly table: Increased social presence via subtle incidental movement of a real-virtual table.", "fields": ["projection screen", "speed wobble", "computer vision", "multimedia", "simulation"], "abstract": "While performing everyday interactions, we often incidentally touch and move objects in subtle ways. These objects are not necessarily directly related to the task at hand, and the movement of an object might even be entirely unintentional. If another person is touching the object at the same time, the movement can transfer through the object and be experienced — however subtly — by the other person. For example, when one person hands a drink to another, at some point both individuals will be touching the glass, and consequently exerting small (often unnoticed) forces on the other person. Despite the frequency of such subtle incidental movements of shared objects in everyday interactions, few have examined how these movements affect human-virtual human (VH) interaction. We ran an experiment to assess how presence and social presence are affected when a person experiences subtle, incidental movement through a shared real-virtual object. We constructed a real-virtual room with a table that spanned the boundary between the real and virtual environments. The participant was seated on the real side of the table, which visually extended into the virtual world via a projection screen, and the VH was seated on the virtual side of the table. The two interacted by playing a game of “Twenty Questions,” where one player asked the other a series of 20 yes/no questions to deduce what object the other player was thinking about. During the game, the “wobbly” group of subjects experienced subtle incidental movements of the real-virtual table: the entire real-virtual table tilted slightly away/toward the subject when the virtual/real human leaned on it. The control group also played the same game, except the table did not wobble. Results indicate that the wobbly group had higher presence and social presence with the virtual human in general, with statistically significant increases in presence, co-presence, and attentional allocation. We present the experiment and results, and discuss some potential implications for virtual human systems and some potential future studies.", "citation": "Citations (6)", "departments": ["University of Central Florida", "University of Central Florida", "University of Central Florida", "University of Central Florida", "University of Central Florida"], "authors": ["Myungho Lee.....http://dblp.org/pers/hd/l/Lee:Myungho", "Kangsoo Kim.....http://dblp.org/pers/hd/k/Kim:Kangsoo", "Salam Daher.....http://dblp.org/pers/hd/d/Daher:Salam", "Andrew Raij.....http://dblp.org/pers/hd/r/Raij:Andrew", "Ryan Schubert.....http://dblp.org/pers/hd/s/Schubert:Ryan", "Jeremy N. Bailenson.....http://dblp.org/pers/hd/b/Bailenson:Jeremy_N=", "Greg Welch.....http://dblp.org/pers/hd/w/Welch:Greg"], "conf": "vr", "year": "2016", "pages": 7}