{"title": "AUTOGEN: automatic discovery of cache-oblivious parallel recursive algorithms for solving dynamic programs.", "fields": ["recursion", "divide and conquer algorithms", "dynamic programming", "cache oblivious algorithm"], "abstract": "We present AUTOGEN---an algorithm that for a wide class of dynamic programming (DP) problems automatically discovers highly efficient cache-oblivious parallel recursive divide-and-conquer algorithms from inefficient iterative descriptions of DP recurrences. AUTOGEN analyzes the set of DP table locations accessed by the iterative algorithm when run on a DP table of small size, and automatically identifies a recursive access pattern and a corresponding provably correct recursive algorithm for solving the DP recurrence. We use AUTOGEN to autodiscover efficient algorithms for several well-known problems. Our experimental results show that several autodiscovered algorithms significantly outperform parallel looping and tiled loop-based algorithms. Also these algorithms are less sensitive to fluctuations of memory and bandwidth compared with their looping counterparts, and their running times and energy profiles remain relatively more stable. To the best of our knowledge, AUTOGEN is the first algorithm that can automatically discover new nontrivial divide-and-conquer algorithms.", "citation": "Citations (8)", "year": "2016", "departments": ["Stony Brook University", "Stony Brook University", "Stony Brook University", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "conf": "ppopp", "authors": ["Rezaul Alam Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Rezaul_Alam", "Pramod Ganapathi.....http://dblp.org/pers/hd/g/Ganapathi:Pramod", "Jesmin Jahan Tithi.....http://dblp.org/pers/hd/t/Tithi:Jesmin_Jahan", "Charles Bachmeier.....http://dblp.org/pers/hd/b/Bachmeier:Charles", "Bradley C. Kuszmaul.....http://dblp.org/pers/hd/k/Kuszmaul:Bradley_C=", "Charles E. Leiserson.....http://dblp.org/pers/hd/l/Leiserson:Charles_E=", "Armando Solar-Lezama.....http://dblp.org/pers/hd/s/Solar=Lezama:Armando", "Yuan Tang.....http://dblp.org/pers/hd/t/Tang:Yuan"], "pages": 12}