{"title": "Fault-tolerant real-time analytics with distributed Oracle Database In-memory.", "fields": ["analytics", "online analytical processing", "data warehouse", "high availability", "online transaction processing"], "abstract": "Modern data management systems are required to address new breeds of OLTAP applications. These applications demand real time analytical insights over massive data volumes not only on dedicated data warehouses but also on live mainstream production environments where data gets continuously ingested and modified. Oracle introduced the Database In-memory Option (DBIM) in 2014 as a unique dual row and column format architecture aimed to address the emerging space of mixed OLTAP applications along with traditional OLAP workloads. The architecture allows both the row format and the column format to be maintained simultaneously with strict transactional consistency. While the row format is persisted in underlying storage, the column format is maintained purely in-memory without incurring additional logging overheads in OLTP. Maintenance of columnar data purely in memory creates the need for distributed data management architectures. Performance of analytics incurs severe regressions in single server architectures during server failures as it takes non-trivial time to recover and rebuild terabytes of in-memory columnar format. A distributed and distribution aware architecture therefore becomes necessary to provide real time high availability of the columnar format for glitch-free in-memory analytic query execution across server failures and additions, besides providing scale out of capacity and compute to address real time throughput requirements over large volumes of in-memory data. In this paper, we will present the high availability aspects of the distributed architecture of Oracle DBIM that includes extremely scaled out application transparent column format duplication mechanism, distributed query execution on duplicated in-memory columnar format, and several scenarios of fault tolerant analytic query execution across the in-memory column format at various stages of redistribution of columnar data during cluster topology changes.", "citation": "Not cited", "departments": ["Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation", "Oracle Corporation"], "authors": ["Niloy Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Niloy", "Shasank Chavan.....http://dblp.org/pers/hd/c/Chavan:Shasank", "Maria Colgan.....http://dblp.org/pers/hd/c/Colgan:Maria", "Mike Gleeson.....http://dblp.org/pers/hd/g/Gleeson:Mike", "Xiaoming He.....http://dblp.org/pers/hd/h/He:Xiaoming", "Allison Holloway.....http://dblp.org/pers/hd/h/Holloway:Allison", "Jesse Kamp.....http://dblp.org/pers/hd/k/Kamp:Jesse", "Kartik Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni:Kartik", "Tirthankar Lahiri.....http://dblp.org/pers/hd/l/Lahiri:Tirthankar", "Juan Loaiza.....http://dblp.org/pers/hd/l/Loaiza:Juan", "Neil MacNaughton.....http://dblp.org/pers/hd/m/MacNaughton:Neil", "Atrayee Mullick.....http://dblp.org/pers/hd/m/Mullick:Atrayee", "Sujatha Muthulingam.....http://dblp.org/pers/hd/m/Muthulingam:Sujatha", "Vivekanandhan Raja.....http://dblp.org/pers/hd/r/Raja:Vivekanandhan", "Raunak Rungta.....http://dblp.org/pers/hd/r/Rungta:Raunak"], "conf": "icde", "year": "2016", "pages": 12}