{"title": "ANALOC: Efficient analytics over Location Based Services.", "fields": ["analytics", "small number", "geospatial analysis", "hotspot", "tuple"], "abstract": "Location Based Services (LBS), including standalone ones such as Google Maps and embedded ones such as “users near me” in the WeChat instant-messaging platform, provide great utility to millions of users. Not only that, they also form an important data source for geospatial and commercial information such as Point-Of-Interest (POI) locations, review ratings, user geo-distributions, etc. Unfortunately, it is not easy to tap into these LBS for tasks such as data analytics and mining, because the only access interface they offer is a limited k-Nearest-Neighbor (kNN) search interface - i.e., for a given input location, return the k nearest tuples in the database, where k is a small constant such as 50 or 100. This limited interface essentially precludes the crawling of an LBS' underlying database, as the small k mandates an extremely large number of queries that no real-world LBS would allow from an IP address or API account. We demonstrate ANALOC, a web based system that enables fast analytics over an LBS by issuing a small number of queries through its restricted kNN interface. ANALOC stands in sharp contrast with existing systems for analyzing geospatial data, as those systems mostly assume complete access to the underlying data. Specifically, ANALOC supports the approximate processing of a wide variety of SUM, COUNT and AVG aggregates over user-specified selection conditions. In the demonstration, we shall not only illustrate the design and accuracy of our underlying aggregate estimation techniques, but also showcase how these estimated aggregates can be used to enable exciting applications such as hotspot detection, infographics, etc. Our demonstration system is designed to query real-world LBS (systems or modules) such as Google Maps, WeChat and Sina Weibo at real time, in order to provide the audience with a practical understanding of the performance of ANALOC.", "citation": "Citations (2)", "departments": ["University of Texas at Arlington", "George Washington University", "George Washington University", "University of Texas at Arlington", "George Washington University"], "authors": ["Md Farhadur Rahman.....http://dblp.org/pers/hd/r/Rahman:Md_Farhadur", "Saad Bin Suhaim.....http://dblp.org/pers/hd/s/Suhaim:Saad_Bin", "Weimo Liu.....http://dblp.org/pers/hd/l/Liu:Weimo", "Saravanan Thirumuruganathan.....http://dblp.org/pers/hd/t/Thirumuruganathan:Saravanan", "Nan Zhang.....http://dblp.org/pers/hd/z/Zhang_0004:Nan", "Gautam Das.....http://dblp.org/pers/hd/d/Das_0001:Gautam"], "conf": "icde", "year": "2016", "pages": 4}