{"title": "Design and learnability of vortex whistles for managing chronic lung function via smartphones.", "fields": ["learnability", "vortex", "workload", "spirometry", "simulation"], "abstract": "Spirometry is the gold standard for managing and diagnosing obstructive lung diseases. Clinical spirometers, however, are expensive and have limited portability. Vortex whistles have shown promise as a potential substitute for clinical spirometers. While vortex whistles are low-cost and are highly portable, only a subset of common spirometry measurements can be measured reliably. Moreover, no research studies have evaluated characteristics of human interaction with vortex whistles, such as maneuver learnability and mental effort. We present a modified 3D-printed vortex whistle design that enables estimation of spirometry measures not previously attainable with traditional vortex whistles. We evaluate the whistle using a pulmonary waveform generator (a commercial standard) and map parameters of the whistle construction to spirometry test endpoints. Through a human subjects trial we evaluate how to personalize whistle parameters for different subjects and assess cognitive workload while using a vortex whistle. We show that, with personalization, vortex whistles are as effective as clinical spirometers for identifying moderate airway obstruction and require similar cognitive load to use.", "citation": "Citations (2)", "departments": ["Southern Methodist University", "Southern Methodist University", "Southern Methodist University", "Southern Methodist University", "Southern Methodist University"], "authors": ["Spencer A. Kaiser.....http://dblp.org/pers/hd/k/Kaiser:Spencer_A=", "Ashley Parks.....http://dblp.org/pers/hd/p/Parks:Ashley", "Patrick Leopard.....http://dblp.org/pers/hd/l/Leopard:Patrick", "Charlie A. Albright.....http://dblp.org/pers/hd/a/Albright:Charlie_A=", "Jake Carlson.....http://dblp.org/pers/hd/c/Carlson:Jake", "Mayank Goel.....http://dblp.org/pers/hd/g/Goel:Mayank", "Damoun Nassehi.....http://dblp.org/pers/hd/n/Nassehi:Damoun", "Eric C. Larson.....http://dblp.org/pers/hd/l/Larson:Eric_C="], "conf": "huc", "year": "2016", "pages": 12}