{"title": "An antithetic coupling approach to multi-chain based CSMA scheduling algorithms.", "fields": ["implementation", "rendering", "link state routing protocol", "queue", "queueing theory"], "abstract": "In recent years, a suite of Glauber dynamics-based CSMA algorithms have attracted great attention due to their simple, distributed implementations with guaranteed throughput-optimality. However, these algorithms often suffer from poor delay performance and the starvation problem. Among several attempts to improve the delay performance, a remarkable improvement has recently been made in a class of CSMA algorithms that utilize multiple instances of the algorithm (or Markov chains). In this paper, we develop a new approach via an antithetic coupling (AC) method, which can further improve the delay performance of those that virtually emulate multiple chains. The key enabler of utilizing AC method lies in our skilful choice of manipulating the driving sequences of random variables that govern the evolution of schedule instances, in such a way that those multiple instances of chains become negatively correlated as oppose to having them run independently. This contributes faster change of the link state, rendering it more like a periodic process and thus leading to better queueing performance. We rigorously establish an ordering relationship for the effective bandwidth of each net-input process to the queue, between our proposed algorithm (AC-CSMA) and other state-of-the-art existing algorithms in the literature, under a mild set of assumptions. The proposed algorithm involves very simple modification onto existing CSMA-based algorithms, and can be implemented in a fully distributed manner without any additional message overhead. Our extensive simulation results also confirm that AC-CSMA always delivers better queueing performance over a variety of network scenarios.", "citation": "Not cited", "departments": ["North Carolina State University", "North Carolina State University"], "authors": ["Jaewook Kwak.....http://dblp.org/pers/hd/k/Kwak:Jaewook", "Do Young Eun.....http://dblp.org/pers/hd/e/Eun:Do_Young"], "conf": "infocom", "year": "2016", "pages": 9}