{"title": "Oracle Based Active Set Algorithm for Scalable Elastic Net Subspace Clustering.", "fields": ["matrix norm", "elastic net regularization", "active set method", "subspace topology", "linear subspace"], "abstract": "State-of-the-art subspace clustering methods are based on expressing each data point as a linear combination of other data points while regularizing the matrix of coefficients with l1, l2 or nuclear norms. l1 regularization is guaranteed to give a subspace-preserving affinity (i.e., there are no connections between points from different subspaces) under broad theoretical conditions, but the clusters may not be connected. l2 and nuclear norm regularization often improve connectivity, but give a subspace-preserving affinity only for independent subspaces. Mixed l1, l2 and nuclear norm regularizations offer a balance between the subspacepreserving and connectedness properties, but this comes at the cost of increased computational complexity. This paper studies the geometry of the elastic net regularizer (a mixture of the l1 and l2 norms) and uses it to derive a provably correct and scalable active set method for finding the optimal coefficients. Our geometric analysis also provides a theoretical justification and a geometric interpretation for the balance between the connectedness (due to l2 regularization) and subspace-preserving (due to l1 regularization) properties for elastic net subspace clustering. Our experiments show that the proposed active set method not only achieves state-of-the-art clustering performance, but also efficiently handles large-scale datasets.", "citation": "Citations (28)", "year": "2016", "departments": ["Johns Hopkins University", "Beijing University of Posts and Telecommunications", "Johns Hopkins University", "Johns Hopkins University"], "conf": "cvpr", "authors": ["Chong You.....http://dblp.org/pers/hd/y/You:Chong", "Chun-Guang Li.....http://dblp.org/pers/hd/l/Li:Chun=Guang", "Daniel P. Robinson.....http://dblp.org/pers/hd/r/Robinson:Daniel_P=", "René Vidal.....http://dblp.org/pers/hd/v/Vidal:Ren=eacute="], "pages": 10}