{"title": "SnappyData: A Hybrid Transactional Analytical Store Built On Spark.", "fields": ["analytics", "use case", "online analytical processing", "in memory database", "online transaction processing"], "abstract": "In recent years, our customers have expressed frustration in the traditional approach of using a combination of disparate products to handle their streaming, transactional and analytical needs. The common practice of stitching heterogeneous environments in custom ways has caused enormous production woes by increasing development complexity and total cost of ownership. With SnappyData, an open source platform, we propose a unified engine for real-time operational analytics, delivering stream analytics, OLTP and OLAP in a single integrated solution. We realize this platform through a seamless integration of Apache Spark (as a big data computational engine) with GemFire (as an in-memory transactional store with scale-out SQL semantics). In this demonstration, after presenting a few use case scenarios, we exhibit SnappyData as our our in-memory solution for delivering truly interactive analytics (i.e., a couple of seconds), when faced with large data volumes or high velocity streams. We show that SnappyData can exploit state-of-the-art approximate query processing techniques and a variety of data synopses. Finally, we allow the audience to define various high-level accuracy contracts (HAC), to communicate their accuracy requirements with SnappyData in an intuitive fashion.", "citation": "Citations (12)", "year": "2016", "departments": ["University of Michigan", "SnappyData Inc, ... RTLAND, OR, USA", "SnappyData Inc, Pune, India", "SnappyData Inc, ... RTLAND, OR, USA", "SnappyData Inc, Pune, India"], "conf": "sigmod", "authors": ["Jags Ramnarayan.....http://dblp.org/pers/hd/r/Ramnarayan:Jags", "Barzan Mozafari.....http://dblp.org/pers/hd/m/Mozafari:Barzan", "Sumedh Wale.....http://dblp.org/pers/hd/w/Wale:Sumedh", "Sudhir Menon.....http://dblp.org/pers/hd/m/Menon:Sudhir", "Neeraj Kumar.....http://dblp.org/pers/hd/k/Kumar_0003:Neeraj", "Hemant Bhanawat.....http://dblp.org/pers/hd/b/Bhanawat:Hemant", "Soubhik Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Soubhik", "Yogesh Mahajan.....http://dblp.org/pers/hd/m/Mahajan:Yogesh", "Rishitesh Mishra.....http://dblp.org/pers/hd/m/Mishra:Rishitesh", "Kishor Bachhav.....http://dblp.org/pers/hd/b/Bachhav:Kishor"], "pages": 4}