{"title": "Flowing with the water: On optimal monitoring of water distribution networks by mobile sensors.", "fields": ["mobile wireless sensor network", "mobility model", "submodular set function", "key distribution in wireless sensor networks", "sink"], "abstract": "Contamination in drinkable water distribution networks can be potentially monitored by new and agile mobile sensor networks. These sensor networks are composed of static sensor nodes, which are pre-installed, of mobile sensor nodes, which are released into the water network for a more punctual monitoring, and of sink nodes, which are used to collect data from mobile sensor nodes. Thus, the activation of the sink nodes as well as the release locations of the mobile nodes must be carefully decided to ensure timely and accurate event detections. Unfortunately, no approach can be found in the literature to optimally determine the release locations of the mobile sensor nodes and the activation of the sink nodes. In this paper, a novel optimization approach to solve such a problem is posed. The problem is particularly challenging due to the potential large size of the networks, the undetermined movement of the mobile sensor nodes, the integer decision variables associated to the release locations of these mobile sensor nodes, and the binary decision variables associated to the activation of the sink nodes. To account for the mobile node mobility across the water distribution network, a stochastic mobility model is considered. It is shown that the objective function of the optimization problem exhibits submodular properties, which allow establishing a mobile nodes release algorithm. The benefits and efficiency of the proposed algorithm are illustrated by analysis and numerical evaluations. It is concluded that the proposed optimization based approach allows efficient monitoring of water distribution networks by mobile sensor nodes.", "citation": "Citations (4)", "departments": ["Royal Institute of Technology", "Royal Institute of Technology", "Royal Institute of Technology"], "authors": ["Rong Du.....http://dblp.org/pers/hd/d/Du:Rong", "Carlo Fischione.....http://dblp.org/pers/hd/f/Fischione:Carlo", "Ming Xiao.....http://dblp.org/pers/hd/x/Xiao:Ming"], "conf": "infocom", "year": "2016", "pages": 9}