{"title": "Non-malleable extractors and codes, with their many tampered extensions.", "fields": ["randomness extractor", "code word", "open problem", "pseudorandomness", "combinatorics", "discrete mathematics", "mathematics", "adversary"], "abstract": "Randomness extractors and error correcting codes are fundamental objects in computer science. Recently, there have been several natural generalizations of these objects, in the context and study of tamper resilient cryptography. These are seeded non-malleable extractors, introduced by Dodis and Wichs; seedless non-malleable extractors, introduced by Cheraghchi and Guruswami; and non-malleable codes, introduced by Dziembowski, Pietrzak and Wichs. Besides being interesting on their own, they also have important applications in cryptography, e.g, privacy amplification with an active adversary, explicit non-malleable codes etc, and often have unexpected connections to their non-tampered analogues.   However, the known constructions are far behind their non-tampered counterparts. Indeed, the best known seeded non-malleable extractor requires min-entropy rate at least 0.49; while explicit constructions of non-malleable two-source extractors were not known even if both sources have full min-entropy, and was left as an open problem by Cheraghchi and Guruswami.   In this paper we make progress towards solving the above problems and other related generalizations. Our contributions are as follows.   (1) We construct an explicit seeded non-malleable extractor for polylogarithmic min-entropy. This dramatically improves all previous results and gives a simpler 2-round privacy amplification protocol with optimal entropy loss, matching the best known result. In fact, we construct more general seeded non-malleable extractors (that can handle multiple adversaries) which were used in the recent construction of explicit two-source extractors for polylogarithmic min-entropy.   (2) We construct the first explicit non-malleable two-source extractor for almost full min-entropy thus resolving the open question posed by Cheraghchi and Guruswami.   (3) We motivate and initiate the study of two natural generalizations of seedless non-malleable extractors and non-malleable codes, where the sources or the codeword may be tampered many times.   By using the connection found by Cheraghchi and Guruswami and providing efficient sampling algorithms, we obtain the first explicit non-malleable codes with tampering degree  t , with near optimal rate and error. We call these stronger notions one-many and many-manynon-malleable codes. This provides a stronger information theoretic analogue of a primitive known as continuous non-malleable codes.   Our basic technique used in all of our constructions can be seen as inspired, in part, by the techniques previously used to construct cryptographic non-malleable commitments.", "citation": "Not cited", "year": "2016", "departments": ["University of Texas at Austin", "Microsoft", "Johns Hopkins University"], "conf": "stoc", "authors": ["Eshan Chattopadhyay.....http://dblp.org/pers/hd/c/Chattopadhyay:Eshan", "Vipul Goyal.....http://dblp.org/pers/hd/g/Goyal:Vipul", "Xin Li.....http://dblp.org/pers/hd/l/Li_0006:Xin"], "pages": 14}