{"title": "Unprotected computing: a large-scale study of DRAM raw error rate on a supercomputer.", "fields": ["interleaved memory", "memory errors", "search engine", "memory scrubbing", "supercomputer", "computing with memory", "job scheduler", "dram", "data science", "word error rate"], "abstract": "Supercomputers offer new opportunities for scientific computing as they grow in size. However, their growth also poses new challenges. Resilience has been recognized as one of the most pressing issues to solve for extreme scale computing. Transistor scaling in the single-digit nanometer era and power constraints might dramatically increase the failure rate of next generation machines. DRAM errors have been analyzed in the past for different supercomputers but those studies are usually based on job scheduler logs and counters produced by hardware-level error correcting codes. Consequently, little is known about errors escaping hardware checks, which lead to silent data corruption. This work attempts to fill that gap by analyzing memory errors for over a year on a cluster with about 1000 nodes featuring low-power memory without error correction. The study gathered millions of events recording detailed information of thousands of memory errors, many of them corrupting multiple bits. Several factors are analyzed, such as temporal and spatial correlation between errors, but also the influence of temperature and even the position of the sun in the sky. The study showed that most multi-bit errors corrupted non-adjacent bits in the memory word and that most errors flipped memory bits from 1 to 0. In addition, we observed thousands of cases of multiple single-bit errors occurring simultaneously in different regions of the memory. These new observations would not be possible by simply analyzing error correction counters on classical systems. We propose several directions in which the findings of this study can help the design of more reliable systems in the future.", "citation": "Not cited", "departments": ["Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "University of Bristol"], "authors": ["Leonardo Bautista-Gomez.....http://dblp.org/pers/hd/b/Bautista=Gomez:Leonardo", "Ferad Zyulkyarov.....http://dblp.org/pers/hd/z/Zyulkyarov:Ferad", "Osman S. Unsal.....http://dblp.org/pers/hd/u/Unsal:Osman_S=", "Simon McIntosh-Smith.....http://dblp.org/pers/hd/m/McIntosh=Smith:Simon"], "conf": "sc", "year": "2016", "pages": 11}