{"title": "Exponential Family Embeddings.", "fields": ["complete graph", "system dynamics", "count data", "topological graph theory", "graph", "semantic similarity", "semantic change", "stochastic gradient descent", "combinatorics", "exponential family", "machine learning", "probabilistic logic", "artificial intelligence", "embedding", "pattern recognition", "affinity analysis", "bernoulli s principle", "isomorphism", "computer science"], "abstract": "Word embeddings are a powerful approach to capturing semantic similarity among terms in a vocabulary. In this paper, we develop exponential family embeddings, which extends the idea of word embeddings to other types of high-dimensional data. As examples, we studied several types of data: neural data with real-valued observations, count data from a market basket analysis, and ratings data from a movie recommendation system. The main idea is that each observation is modeled conditioned on a set of latent embeddings and other observations, called the context, where the way the context is defined depends on the problem. In language the context is the surrounding words; in neuroscience the context is close-by neurons; in market basket data the context is other items in the shopping cart. Each instance of an embedding defines the context, the exponential family of conditional distributions, and how the embedding vectors are shared across data. We infer the embeddings with stochastic gradient descent, with an algorithm that connects closely to generalized linear models. On all three of our applications—neural activity of zebrafish, users’ shopping behavior, and movie ratings—we found that exponential family embedding models are more effective than other dimension reduction methods. They better reconstruct held-out data and find interesting qualitative structure.", "citation": "Citations (19)", "departments": ["Columbia University", "Columbia University", "Columbia University", "Columbia University", "Dresden University of Technology", "Columbia University", "Columbia University", "Dresden University of Technology", "Tufts University", "Columbia University", "Bogomoltsa 3/5, ... 58001, Ukraine", "Bogomoltsa St.  ... 58001, Ukraine"], "authors": ["Maja R. Rudolph.....http://dblp.org/pers/hd/r/Rudolph:Maja_R=", "Francisco J. R. Ruiz.....http://dblp.org/pers/hd/r/Ruiz:Francisco_J=_R=", "Stephan Mandt.....http://dblp.org/pers/hd/m/Mandt:Stephan", "David M. Blei.....http://dblp.org/pers/hd/b/Blei:David_M="], "conf": "nips", "year": "2016", "pages": 9}