{"title": "Discovering Structure in the Universe of Attribute Names.", "fields": ["semantic interpretation", "attribute grammar", "ontology", "unsupervised learning", "s attributed grammar"], "abstract": "Recently, search engines have invested significant effort to answering entity--attribute queries from structured data, but have focused mostly on queries for frequent attributes. In parallel, several research efforts have demonstrated that there is a long tail of attributes, often thousands per class of entities, that are of interest to users. Researchers are beginning to leverage these new collections of attributes to expand the ontologies that power search engines and to recognize entity--attribute queries. Because of the sheer number of potential attributes, such tasks require us to impose some structure on this long and heavy tail of attributes. This paper introduces the problem of organizing the attributes by expressing the compositional structure of their names as a rule-based grammar. These rules offer a compact and rich semantic interpretation of multi-word attributes, while generalizing from the observed attributes to new unseen ones. The paper describes an unsupervised learning method to generate such a grammar automatically from a large set of attribute names. Experiments show that our method can discover a precise grammar over 100,000 attributes of {\\sc Countries} while providing a 40-fold compaction over the attribute names. Furthermore, our grammar enables us to increase the precision of attributes from 47\\% to more than 90\\% with only a minimal curation effort. Thus, our approach provides an efficient and scalable way to expand ontologies with attributes of user interest.", "citation": "Citations (10)", "departments": ["Google", "Indian Institute of Technology Bombay", "Google", "Google", "Recruit Institu ...  View, CA, USA"], "authors": ["Alon Y. Halevy.....http://dblp.org/pers/hd/h/Halevy:Alon_Y=", "Natalya Fridman Noy.....http://dblp.org/pers/hd/n/Noy:Natalya_Fridman", "Sunita Sarawagi.....http://dblp.org/pers/hd/s/Sarawagi:Sunita", "Steven Euijong Whang.....http://dblp.org/pers/hd/w/Whang:Steven_Euijong", "Xiao Yu.....http://dblp.org/pers/hd/y/Yu:Xiao"], "conf": "www", "year": "2016", "pages": 11}