{"title": "Toward a framework for detecting privacy policy violations in android application code.", "fields": ["privacy policy", "business requirements", "information sensitivity", "eval", "privacy software"], "abstract": "Mobile applications frequently access sensitive personal informa- tion to meet user or business requirements. Because such informa- tion is sensitive in general, regulators increasingly require mobile- app developers to publish privacy policies that describe what infor- mation is collected. Furthermore, regulators have fined companies when these policies are inconsistent with the actual data practices of mobile apps. To help mobile-app developers check their pri- vacy policies against their apps’ code for consistency, we propose a semi-automated framework that consists of a policy terminology- API method map that links policy phrases to API methods that pro- duce sensitive information, and information flow analysis to detect misalignments. We present an implementation of our framework based on a privacy-policy-phrase ontology and a collection of map- pings from API methods to policy phrases. Our empirical eval- uation on 477 top Android apps discovered 341 potential privacy policy violations.", "citation": "Citations (18)", "departments": ["University of Texas at San Antonio", "University of Texas at San Antonio", "University of Texas at San Antonio", "University of Texas at Dallas", "University of Texas at San Antonio"], "authors": ["Rocky Slavin.....http://dblp.org/pers/hd/s/Slavin:Rocky", "Xiaoyin Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoyin", "Mitra Bokaei Hosseini.....http://dblp.org/pers/hd/h/Hosseini:Mitra_Bokaei", "James Hester.....http://dblp.org/pers/hd/h/Hester:James", "Ram Krishnan.....http://dblp.org/pers/hd/k/Krishnan:Ram", "Jaspreet Bhatia.....http://dblp.org/pers/hd/b/Bhatia:Jaspreet", "Travis D. Breaux.....http://dblp.org/pers/hd/b/Breaux:Travis_D=", "Jianwei Niu.....http://dblp.org/pers/hd/n/Niu_0001:Jianwei"], "conf": "icse", "year": "2016", "pages": 12}