{"title": "Accelerating Relational Databases by Leveraging Remote Memory and RDMA.", "fields": ["uniform memory access", "extended memory", "flat memory model", "computing with memory", "remote direct memory access"], "abstract": "Memory is a crucial resource in relational databases (RDBMSs). When there is insufficient memory, RDBMSs are forced to use slower media such as SSDs or HDDs, which can significantly degrade workload performance. Cloud database services are deployed in data centers where network adapters supporting remote direct memory access (RDMA) at low latency and high bandwidth are becoming prevalent. We study the novel problem of how a Symmetric Multi-Processing (SMP) RDBMS, whose memory demands exceed locally-available memory, can leverage available remote memory in the cluster accessed via RDMA to improve query performance. We expose available memory on remote servers using a lightweight file API that allows an SMP RDBMS to leverage the benefits of remote memory with modest changes. We identify and implement several novel scenarios to demonstrate these benefits, and address design challenges that are crucial for efficient implementation. We implemented the scenarios in Microsoft SQL Server engine and present the first end-to-end study to demonstrate benefits of remote memory for a variety of micro-benchmarks and industry-standard benchmarks. Compared to using disks when memory is insufficient, we improve the throughput and latency of queries with short reads and writes by 3X to 10X, while improving the latency of multiple TPC-H and TPC-DS queries by 2X to 100X.", "citation": "Citations (13)", "year": "2016", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "sigmod", "authors": ["Feng Li.....http://dblp.org/pers/hd/l/Li:Feng", "Sudipto Das.....http://dblp.org/pers/hd/d/Das:Sudipto", "Manoj Syamala.....http://dblp.org/pers/hd/s/Syamala:Manoj", "Vivek R. Narasayya.....http://dblp.org/pers/hd/n/Narasayya:Vivek_R="], "pages": 16}