{"title": "Differentially private frequent subgraph mining.", "fields": ["graph", "data mining", "information sensitivity", "lattice", "differential privacy"], "abstract": "Mining frequent subgraphs from a collection of input graphs is an important topic in data mining research. However, if the input graphs contain sensitive information, releasing frequent subgraphs may pose considerable threats to individual's privacy. In this paper, we study the problem of frequent subgraph mining (FGM) under the rigorous differential privacy model. We introduce a novel differentially private FGM algorithm, which is referred to as DFG. In this algorithm, we first privately identify frequent subgraphs from input graphs, and then compute the noisy support of each identified frequent subgraph. In particular, to privately identify frequent subgraphs, we present a frequent subgraph identification approach which can improve the utility of frequent subgraph identifications through candidates pruning. Moreover, to compute the noisy support of each identified frequent subgraph, we devise a lattice-based noisy support derivation approach, where a series of methods has been proposed to improve the accuracy of the noisy supports. Through formal privacy analysis, we prove that our DFG algorithm satisfies e-differential privacy. Extensive experimental results on real datasets show that the DFG algorithm can privately find frequent subgraphs with high data utility.", "citation": "Citations (5)", "departments": ["Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications", "Emory University", "Beijing University of Posts and Telecommunications", "Beijing University of Posts and Telecommunications"], "authors": ["Shengzhi Xu.....http://dblp.org/pers/hd/x/Xu:Shengzhi", "Sen Su.....http://dblp.org/pers/hd/s/Su:Sen", "Li Xiong.....http://dblp.org/pers/hd/x/Xiong_0001:Li", "Xiang Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Xiang", "Ke Xiao.....http://dblp.org/pers/hd/x/Xiao:Ke"], "conf": "icde", "year": "2016", "pages": 12}