{"title": "Faster Algorithms for Computing the Stationary Distribution, Simulating Random Walks, and More.", "fields": ["eulerian path", "condition number", "stationary distribution", "matrix multiplication", "big o notation"], "abstract": "In this paper, we provide faster algorithms for computing variousfundamental quantities associated with random walks on a directedgraph, including the stationary distribution, personalized PageRankvectors, hitting times, and escape probabilities. In particular, ona directed graph with n vertices and m edges, we show how tocompute each quantity in time O(m3/4n + mn2/3), wherethe O notation suppresses polylog factors in n, the desired accuracy, and the appropriate condition number (i.e. themixing time or restart probability). Our result improves upon the previous fastest running times for these problems, previous results either invoke a general purpose linearsystem solver on a n × n matrix with m non-zero entries, or depend polynomially on the desired error or natural condition numberassociated with the problem (i.e. the mixing time or restart probability). For sparse graphs, we obtain a running time of O(n7/4), breaking the O(n2) barrier of the best running time one couldhope to achieve using fast matrix multiplication. We achieve our result by providing a similar running time improvementfor solving directed Laplacian systems, a natural directedor asymmetric analog of the well studied symmetric or undirected Laplaciansystems. We show how to solve such systems in time O(m3/4n + mn2/3), and efficiently reduce a broad range of problems to solving O(1) directed Laplacian systems on Eulerian graphs. We hope these resultsand our analysis open the door for further study into directedspectral graph theory.", "citation": "Citations (2)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Michael B. Cohen.....http://dblp.org/pers/hd/c/Cohen:Michael_B=", "Jonathan A. Kelner.....http://dblp.org/pers/hd/k/Kelner:Jonathan_A=", "John Peebles.....http://dblp.org/pers/hd/p/Peebles:John", "Richard Peng.....http://dblp.org/pers/hd/p/Peng:Richard", "Aaron Sidford.....http://dblp.org/pers/hd/s/Sidford:Aaron", "Adrian Vladu.....http://dblp.org/pers/hd/v/Vladu:Adrian"], "conf": "focs", "year": "2016", "pages": 10}