{"title": "iOLAP: Managing Uncertainty for Efficient Incremental OLAP.", "fields": ["analytics", "web query classification", "online analytical processing", "sargable", "web search query"], "abstract": "The size of data and the complexity of analytics continue to grow along with the need for timely and cost-effective analysis. However, the growth of computation power cannot keep up with the growth of data. This calls for a paradigm shift from traditional batch OLAP processing model to an incremental OLAP processing model. In this paper, we propose iOLAP, an incremental OLAP query engine that provides a smooth trade-off between query accuracy and latency, and fulfills a full spectrum of user requirements from approximate but timely query execution to a more traditional accurate query execution. iOLAP enables interactive incremental query processing using a novel mini-batch execution model---given an OLAP query, iOLAP first randomly partitions the input dataset into smaller sets (mini-batches) and then incrementally processes through these mini-batches by executing a delta update query on each mini-batch, where each subsequent delta update query computes an update based on the output of the previous one. The key idea behind iOLAP is a novel delta update algorithm that models delta processing as an uncertainty propagation problem, and minimizes the recomputation during each subsequent delta update by minimizing the uncertainties in the partial (including intermediate) query results. We implement iOLAP on top of Apache Spark and have successfully demonstrated it at scale on over 100 machines. Extensive experiments on a multitude of queries and datasets demonstrate that iOLAP can deliver approximate query answers for complex OLAP queries orders of magnitude faster than traditional OLAP engines, while continuously delivering updates every few seconds.", "citation": "Citations (7)", "year": "2016", "departments": ["Microsoft", "University of California, Berkeley", "Databricks Inc. ... ncisco, CA, USA"], "conf": "sigmod", "authors": ["Kai Zeng.....http://dblp.org/pers/hd/z/Zeng_0002:Kai", "Sameer Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Sameer", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "pages": 15}