{"title": "How cars talk louder, clearer and fairer: Optimizing the communication performance of connected vehicles via online synchronous control.", "fields": ["vehicular communication systems", "broadcasting", "volatile", "dedicated short range communications", "channel"], "abstract": "The connected vehicles have been considered as a remedy for modern traffic issues, potentially saving hundreds of thousands of lives every year worldwide. The Dedicated Short-Range Communications (DSRC) technology is an essential building block of this promising vision. DSRC faces volatile vehicular environments, where not only wireless propagation channels but also network topologies vary rapidly. Moreover, traffic congestions during rush hours may lead to an unprecedentedly high density of broadcasting radios, resulting in compromised reliability, efficiency and fairness of DSRC. In order to optimize the performance of DSRC, we develop a novel Online Control Approach of power and Rates (OnCAR). Supported by systematic control theories, OnCAR performs stably even in the dynamic and unpredictable vehicular environments. To the best of our knowledge, OnCAR is the first solution to address the strong coupling between communication variables. It adopts a multi-variable control model to synchronously adjust transmission power and data rates, which are two major variables determining the performance of DSRC. In addition, OnCAR leverages receiver-side measurements of performance metrics to strike a balance between overall performance and fairness. Compared with the state of the art, OnCAR enhances the overall reliability and efficiency of DSRC by 23.7% and 30.1%, respectively. Meanwhile, these numbers are achieved with a 40.1% improvement in fairness.", "citation": "Citations (3)", "departments": ["McGill University", "McGill University", "McGill University", "General Motors", "General Motors"], "authors": ["Xi Chen.....http://dblp.org/pers/hd/c/Chen_0009:Xi", "Linghe Kong.....http://dblp.org/pers/hd/k/Kong:Linghe", "Xue Liu.....http://dblp.org/pers/hd/l/Liu_0001:Xue", "Lei Rao.....http://dblp.org/pers/hd/r/Rao:Lei", "Fan Bai.....http://dblp.org/pers/hd/b/Bai:Fan", "Qiao Xiang.....http://dblp.org/pers/hd/x/Xiang:Qiao"], "conf": "infocom", "year": "2016", "pages": 9}