{"title": "Time Matters: Multi-scale Temporalization of Social Media Popularity.", "fields": ["data mining", "social media", "machine learning", "popularity", "granularity"], "abstract": "The evolution of social media popularity exhibits rich temporality, i.e., popularities change over time at various levels of temporal granularity. This is influenced by temporal variations of public attentions or user activities. For example, popularity patterns of street snap on Flickr are observed to depict distinctive fashion styles at specific time scales, such as season-based periodic fluctuations for Trench Coat or one-off peak in days for Evening Dress. However, this fact is often overlooked by existing research of popularity modeling. We present the first study to incorporate multiple time-scale dynamics into predicting online popularity. We propose a novel computational framework in the paper, named Multi-scale Temporalization, for estimating popularity based on multi-scale decomposition and structural reconstruction in a tensor space of user, post, and time by joint low-rank constraints. By considering the noise caused by context inconsistency, we design a data rearrangement step based on context aggregation as preprocessing to enhance contextual relevance of neighboring data in the tensor space. As a result, our approach can leverage multiple levels of temporal characteristics and reduce the noise of data decomposition to improve modeling effectiveness. We evaluate our approach on two large-scale Flickr image datasets with over 1.8 million photos in total, for the task of popularity prediction. The results show that our approach significantly outperforms state-of-the-art popularity prediction techniques, with a relative improvement of 10.9%-47.5% in terms of prediction accuracy.", "citation": "Citations (15)", "year": "2016", "departments": ["Chinese Academy of Sciences", "Center for Information Technology", "Chinese Academy of Sciences", "Microsoft"], "conf": "mm", "authors": ["Bo Wu.....http://dblp.org/pers/hd/w/Wu_0018:Bo", "Wen-Huang Cheng.....http://dblp.org/pers/hd/c/Cheng:Wen=Huang", "Yongdong Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongdong", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao"], "pages": 9}