{"title": "Keyword-aware continuous kNN query on road networks.", "fields": ["data set", "vertex", "web query classification", "query expansion", "sargable"], "abstract": "It is nowadays quite common for road networks to have textual contents on the vertices, which describe auxiliary information (e.g., business, traffic, etc.) associated with the vertex. In such road networks, which are modelled as weighted undirected graphs, each vertex is associated with one or more keywords, and each edge is assigned with a weight, which can be its physical length or travelling time. In this paper, we study the problem of keyword-aware continuous k nearest neighbour (KCkNN) search on road networks, which computes the k nearest vertices that contain the query keywords issued by a moving object and maintains the results continuously as the object is moving on the road network. Reducing the query processing costs in terms of computation and communication has attracted considerable attention in the database community with interesting techniques proposed. This paper proposes a framework, called a Labelling AppRoach for Continuous kNN query (LARC), on road networks to cope with KCkNN query efficiently. First we build a pivot-based reverse label index and a keyword-based pivot tree index to improve the efficiency of keyword-aware k nearest neighbour (KkNN) search by avoiding massive network traversals and sequential probe of keywords. To reduce the frequency of unnecessary result updates, we develop the concepts of dominance interval and region on road network, which share the similar intuition with safe region for processing continuous queries in Euclidean space but are more complicated and thus require more dedicated design. For high frequency keywords, we resolve the dominance interval when the query results changed. In addition, a path-based dominance updating approach is proposed to compute the dominance region efficiently when the query keywords are of low frequency. We conduct extensive experiments by comparing our algorithms with the state-of-the-art methods on real data sets. The empirical observations have verified the superiority of our proposed solution in all aspects of index size, communication cost and computation time.", "citation": "Citations (15)", "departments": ["University of Queensland", "University of Queensland", "Nanyang Technological University", "University of Southern California", "University of Queensland"], "authors": ["Bolong Zheng.....http://dblp.org/pers/hd/z/Zheng:Bolong", "Kai Zheng.....http://dblp.org/pers/hd/z/Zheng_0001:Kai", "Xiaokui Xiao.....http://dblp.org/pers/hd/x/Xiao:Xiaokui", "Han Su.....http://dblp.org/pers/hd/s/Su:Han", "Hongzhi Yin.....http://dblp.org/pers/hd/y/Yin:Hongzhi", "Xiaofang Zhou.....http://dblp.org/pers/hd/z/Zhou:Xiaofang", "Guohui Li.....http://dblp.org/pers/hd/l/Li:Guohui"], "conf": "icde", "year": "2016", "pages": 12}