{"title": "Extracting Databases from Dark Data with DeepDive.", "fields": ["big data", "probabilistic logic", "dark data", "data integration", "information extraction"], "abstract": "DeepDive is a system for extracting relational databases from dark data: the mass of text, tables, and images that are widely collected and stored but which cannot be exploited by standard relational tools. If the information in dark data --- scientific papers, Web classified ads, customer service notes, and so on --- were instead in a relational database, it would give analysts access to a massive and highly-valuable new set of \"big data\" to exploit.   DeepDive is distinctive when compared to previous information extraction systems in its ability to obtain very high precision and recall at reasonable engineering cost; in a number of applications, we have used DeepDive to create databases with accuracy that meets that of human annotators. To date we have successfully deployed DeepDive to create data-centric applications for insurance, materials science, genomics, paleontologists, law enforcement, and others. The data unlocked by DeepDive represents a massive opportunity for industry, government, and scientific researchers.   DeepDive is enabled by an unusual design that combines large-scale probabilistic inference with a novel developer interaction cycle. This design is enabled by several core innovations around probabilistic training and inference.", "citation": "Citations (8)", "year": "2016", "departments": ["Stanford University", "Stanford University", "Stanford University", "University of Michigan", "Lattice Data, I ... o Alto, CA, USA"], "conf": "sigmod", "authors": ["Ce Zhang.....http://dblp.org/pers/hd/z/Zhang:Ce", "Jaeho Shin.....http://dblp.org/pers/hd/s/Shin_0001:Jaeho", "Christopher Ré.....http://dblp.org/pers/hd/r/R=eacute=:Christopher", "Michael J. Cafarella.....http://dblp.org/pers/hd/c/Cafarella:Michael_J=", "Feng Niu.....http://dblp.org/pers/hd/n/Niu:Feng"], "pages": 13}