{"title": "Snatch: Opportunistically reassigning power allocation between processor and memory in 3D stacks.", "fields": ["maximum power transfer theorem", "voltage regulator", "stack", "text processing", "provisioning"], "abstract": "The pin count largely determines the cost of a chip package, which is often comparable to the cost of a die. In 3D processor-memory designs, power and ground (P/G) pins can account for the majority of the pins. This is because packages include separate pins for the disjoint processor and memory power delivery networks (PDNs). Supporting separate PDNs and P/G pins for processor and memory is inefficient, as each set has to be provisioned for the worst-case power delivery requirements.   In this paper, we propose to reduce the number of P/G pins of both processor and memory in a 3D design, and dynamically and opportunistically divert some power between the two PDNs on demand. To perform the power transfer, we use a small bidirectional on-chip voltage regulator that connects the two PDNs. Our concept, called  Snatch , is effective. It allows the computer to execute code sections with high processor or memory power requirements without having to throttle performance. We evaluate Snatch with simulations of an 8-core multicore stacked with two memory dies. In a set of compute-intensive codes, the processor  snatches  memory power for 30% of the time on average, speeding-up the codes by up to 23% over advanced turbo-boosting; in memory-intensive codes, the memory snatches processor power. Alternatively, Snatch can reduce the package cost by about 30%.", "citation": "Citations (1)", "departments": ["University of Illinois at Urbana–Champaign", "Ohio State University", "Nvidia", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Dimitrios Skarlatos.....http://dblp.org/pers/hd/s/Skarlatos:Dimitrios", "Renji Thomas.....http://dblp.org/pers/hd/t/Thomas:Renji", "Aditya Agrawal.....http://dblp.org/pers/hd/a/Agrawal:Aditya", "Shibin Qin.....http://dblp.org/pers/hd/q/Qin:Shibin", "Robert C. N. Pilawa-Podgurski.....http://dblp.org/pers/hd/p/Pilawa=Podgurski:Robert_C=_N=", "Ulya R. Karpuzcu.....http://dblp.org/pers/hd/k/Karpuzcu:Ulya_R=", "Radu Teodorescu.....http://dblp.org/pers/hd/t/Teodorescu:Radu", "Nam Sung Kim.....http://dblp.org/pers/hd/k/Kim:Nam_Sung", "Josep Torrellas.....http://dblp.org/pers/hd/t/Torrellas:Josep"], "conf": "micro", "year": "2016", "pages": 12}