{"title": "Continuous and fine-grained breathing volume monitoring from afar using wireless signals.", "fields": ["breathing", "granularity", "demodulation", "autonomous system", "continuous wave"], "abstract": "In this work, we propose for the first time an autonomous system, called WiSpiro, that continuously monitors a person's breathing volume with high resolution during sleep from afar. WiSpiro relies on a phase-motion demodulation algorithm that reconstructs minute chest and abdominal movements by analyzing the subtle phase changes that the movements cause to the continuous wave signal sent by a 2.4 GHz directional radio. These movements are mapped to breathing volume, where the mapping relationship is obtained via a short training process. To cope with body movement, the system tracks the large-scale movements and posture changes of the person, and moves its transmitting antenna accordingly to a proper location in order to maintain its beam to specific areas on the frontal part of the person's body. It also incorporates interpolation mechanisms to account for possible inaccuracy of our posture detection technique and the minor movement of the person's body. We have built WiSpiro prototype, and demonstrated through a user study that it can accurately and continuously monitor user's breathing volume with a median accuracy from 90% to 95.4% (or 0.0581 to 0.111 of error) to even in the presence of body movement. The monitoring granularity and accuracy are sufficiently high to be useful for diagnosis by clinical doctor.", "citation": "Citations (12)", "departments": ["University of Colorado Denver", "University of Wisconsin-Madison", "University of Colorado Denver", "University of Colorado Denver"], "authors": ["Phuc Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Phuc", "Xinyu Zhang.....http://dblp.org/pers/hd/z/Zhang_0003:Xinyu", "Ann C. Halbower.....http://dblp.org/pers/hd/h/Halbower:Ann_C=", "Tam Vu.....http://dblp.org/pers/hd/v/Vu:Tam"], "conf": "infocom", "year": "2016", "pages": 9}