{"title": "Compensating for Distance Compression in Audiovisual Virtual Environments Using Incongruence.", "fields": ["crossmodal", "metaverse", "visual perception", "binaural recording", "phenomenon"], "abstract": "A key requirement for a sense of presence in Virtual Environments (VEs) is for a user to perceive space as naturally as possible. One critical aspect is distance perception. When judging distances, compression is a phenomenon where humans tend to underestimate the distance between themselves and target objects (termed egocentric or absolute compression), and between other objects (exocentric or relative compression). Results of studies in virtual worlds rendered through head mounted displays are striking, demonstrating significant distance compression error. Distance compression is a multisensory phenomenon, where both audio and visual stimuli are often compressed with respect to their distances from the observer. In this paper, we propose and test a method for reducing crossmodal distance compression in VEs. We report an empirical evaluation of our method via a study of 3D spatial perception within a virtual reality (VR) head mounted display. Applying our method resulted in more accurate distance perception in a VE at longer range, and suggests a modification that could adaptively compensate for distance compression at both shorter and longer ranges. Our results have a significant and intriguing implication for designers of VEs: an incongruent audiovisual display, i.e. where the audio and visual information is intentionally misaligned, may lead to better spatial perception of a virtual scene.", "citation": "Citations (7)", "year": "2016", "departments": ["University of Bath", "University of Bath", "University of Bath"], "conf": "chi", "authors": ["Daniel J. Finnegan.....http://dblp.org/pers/hd/f/Finnegan:Daniel_J=", "Eamonn O'Neill.....http://dblp.org/pers/hd/o/O=Neill:Eamonn", "Michael J. Proulx.....http://dblp.org/pers/hd/p/Proulx:Michael_J="], "pages": 13}