{"title": "FitLoc: Fine-grained and low-cost device-free localization for multiple targets over various areas.", "fields": ["signal strength", "robustness", "compressed sensing", "wireless", "software deployment", "telecommunications", "rss"], "abstract": "Many emerging applications driven the fast development of the device-free localization (DfL) technique, which does not require the target to carry any wireless devices. Most current DfL approaches have two main drawbacks in practical applications. First, as the pre-calibrated received signal strength (RSS) in each location ( i.e. , radio-map) of a specific area cannot be directly applied to the new areas, the manual calibration for different areas will lead to a high human effort cost. Second, a large number of RSS are needed to accurately localize the targets, thus causes a high communication cost and the areas variety will further exacerbate this problem. This paper proposes FitLoc, a fine-grained and low cost DfL approach that can localize multiple targets over various areas, especially in the outdoor environment and similar furnitured indoor environment. FitLoc unifies the radio-map over various areas through a rigorously designed transfer scheme, thus greatly reduces the human effort cost. Furthermore, benefiting from the compressive sensing theory, FitLoc collects a few RSS and performs a fine-grained localization, thus reduces the communication cost. Theoretical analyses validate the effectivity of the problem formulation and the bound of localization error is provided. Extensive experimental results illustrate the effectiveness and robustness of FitLoc.", "citation": "Citations (10)", "departments": ["Northwest University", "Northwest University", "University of North Carolina at Charlotte", "Northwest University", "Northwest University", "Northwest University", "Northwest University", "University of North Carolina at Charlotte", "Northwest University", "Northwest University"], "authors": ["Liqiong Chang.....http://dblp.org/pers/hd/c/Chang:Liqiong", "Xiaojiang Chen.....http://dblp.org/pers/hd/c/Chen:Xiaojiang", "Yu Wang.....http://dblp.org/pers/hd/w/Wang:Yu", "Dingyi Fang.....http://dblp.org/pers/hd/f/Fang:Dingyi", "Ju Wang.....http://dblp.org/pers/hd/w/Wang:Ju", "Tianzhang Xing.....http://dblp.org/pers/hd/x/Xing:Tianzhang", "Zhanyong Tang.....http://dblp.org/pers/hd/t/Tang:Zhanyong"], "conf": "infocom", "year": "2016", "pages": 9}