{"title": "Adaptive Indexing over Encrypted Numeric Data.", "fields": ["encryption", "client side", "client side encryption", "filesystem level encryption", "on the fly encryption"], "abstract": "Today, outsourcing query processing tasks to remote cloud servers becomes a viable option; such outsourcing calls for encrypting data stored at the server so as to render it secure against eavesdropping adversaries and/or an honest-but-curious server itself. At the same time, to be efficiently managed, outsourced data should be indexed, and even adaptively so, as a side-effect of query processing. Computationally heavy encryption schemes render such outsourcing unattractive; an alternative, Order-Preserving Encryption Scheme (OPES), intentionally preserves and reveals the order in the data, hence is unattractive from the security viewpoint. In this paper, we propose and analyze a scheme for lightweight and indexable encryption, based on linear-algebra operations. Our scheme provides higher security than OPES and allows for range and point queries to be efficiently evaluated over encrypted numeric data, with decryption performed at the client side. We implement a prototype that performs incremental, query-triggered adaptive indexing over encrypted numeric data based on this scheme, without leaking order information in advance, and without prohibitive overhead, as our extensive experimental study demonstrates.", "citation": "Citations (8)", "year": "2016", "departments": ["Rutgers University", "Skoltech, Moscow, Russian Fed.", "Skoltech, Moscow, Russian Fed.", "Skoltech, Moscow, Russian Fed.", "Skoltech, Moscow, Russian Fed."], "conf": "sigmod", "authors": ["Panagiotis Karras.....http://dblp.org/pers/hd/k/Karras:Panagiotis", "Artyom Nikitin.....http://dblp.org/pers/hd/n/Nikitin:Artyom", "Muhammad Saad.....http://dblp.org/pers/hd/s/Saad:Muhammad", "Rudrika Bhatt.....http://dblp.org/pers/hd/b/Bhatt:Rudrika", "Denis Antyukhov.....http://dblp.org/pers/hd/a/Antyukhov:Denis", "Stratos Idreos.....http://dblp.org/pers/hd/i/Idreos:Stratos"], "pages": 13}