{"title": "DAFEE: A Decomposed Approach for energy efficient networking in multi-radio multi-channel wireless networks.", "fields": ["radio resource management", "resource allocation", "optimization problem", "channel", "column generation"], "abstract": "As wireless networks are gaining increasing popularity, the network energy efficiency has become a critical issue. In this paper, we focus on energy-efficient networking in a generic multi-radio multi-channel (MR-MC) wireless network where transmission scheduling, transmit power control, radio and channel assignment are coupled together in a multi-dimensional resource space, thus requiring joint optimization and low complexity algorithms. We propose a novel Decomposed Approach For energy-efficient (DAFEE) networking in MR-MC networks, with the objective to minimize network energy consumption while guaranteeing a certain level of performance. In particular, we leverage a multi-dimensional tuple-link based model and a concept of resource allocation pattern to transform the complex optimization problem into a linear programming (LP) problem. The LP problem however has a very large solution space due to the exponentially many possible resource allocation patterns. We then exploit delay column generation and distributed learning techniques to decompose the problem and solve it with an iterative process. Furthermore, we propose a sub-optimal algorithm to speed up the iteration with constant-bounded performance. Simulation results are presented to demonstrate the effectiveness of the proposed algorithm.", "citation": "Citations (2)", "departments": ["Illinois Institute of Technology", "Southeast University", "Illinois Institute of Technology", "Illinois Institute of Technology", "Illinois Institute of Technology"], "authors": ["Lu Liu.....http://dblp.org/pers/hd/l/Liu_0004:Lu", "Xianghui Cao.....http://dblp.org/pers/hd/c/Cao:Xianghui", "Wenlong Shen.....http://dblp.org/pers/hd/s/Shen:Wenlong", "Yu Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Yu", "Lin X. Cai.....http://dblp.org/pers/hd/c/Cai:Lin_X="], "conf": "infocom", "year": "2016", "pages": 9}