{"title": "Is every flow on the right track?: Inspect SDN forwarding with RuleScope.", "fields": ["network packet", "algorithmic efficiency", "bidirectional forwarding detection", "network monitoring", "troubleshooting"], "abstract": "Software-Defined Networking (SDN) promises un-precedentedly flexible network management but it is susceptible to forwarding faults. Such faults originate from data-plane rules with missing faults and priority faults. Yet existing fault detection ignores priority faults because they are not discovered on commercial switches until recently. In this paper, we present RuleScope, a more comprehensive solution for inspecting SDN forwarding. RuleScope offers a series of accurate and efficient algorithms for detecting and troubleshooting rule faults. They inspect forwarding behavior using customized probe packets to exercise data-plane rules. The detection algorithm exposes not only missing faults but also priority faults. Beyond simply detecting rule faults, the troubleshooting algorithms uncover actual data-plane flow tables. They help track real-time forwarding status and benefit reliable network monitoring. We explore various techniques for enhancing algorithm efficiency without sacrificing inspection accuracy. Experiments with our prototype on the Ryu SDN controller and Pica8 P-3297 switch show that RuleScope achieves accurate and efficient forwarding inspection with limited bandwidth and packet-switching overhead.", "citation": "Citations (13)", "departments": ["Zhejiang University", "Northwestern University", "Zhejiang University", "Northwestern University", "Fudan University"], "authors": ["Kai Bu.....http://dblp.org/pers/hd/b/Bu:Kai", "Xitao Wen.....http://dblp.org/pers/hd/w/Wen:Xitao", "Bo Yang.....http://dblp.org/pers/hd/y/Yang:Bo", "Yan Chen.....http://dblp.org/pers/hd/c/Chen_0004:Yan", "Li Erran Li.....http://dblp.org/pers/hd/l/Li:Li_Erran", "Xiaolin Chen.....http://dblp.org/pers/hd/c/Chen:Xiaolin"], "conf": "infocom", "year": "2016", "pages": 9}