{"title": "Extreme-scale phase field simulations of coarsening dynamics on the sunway taihulight supercomputer.", "fields": ["sunway taihulight", "supercomputer", "scalability", "simulation", "ductility", "computer science", "search engine", "algorithm design"], "abstract": "Many important properties of materials such as strength, ductility, hardness and conductivity are determined by the microstructures of the material. During the formation of these microstructures, grain coarsening plays an important role. The Cahn-Hilliard equation has been applied extensively to simulate the coarsening kinetics of a two-phase microstructure. It is well accepted that the limited capabilities in conducting large scale, long time simulations constitute bottlenecks in predicting microstructure evolution based on the phase field approach. We present here a scalable time integration algorithm with large step-sizes and its efficient implementation on the Sunway TaihuLight supercomputer. The highly nonlinear and severely stiff Cahn-Hilliard equations with degenerate mobility for microstructure evolution are solved at extreme scale, demonstrating that the latest advent of high performance computing platform and the new advances in algorithm design are now offering us the possibility to simulate the coarsening dynamics accurately at unprecedented spatial and time scales.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "University of South Carolina", "Columbia University"], "authors": ["Jian Zhang.....http://dblp.org/pers/hd/z/Zhang:Jian", "Chunbao Zhou.....http://dblp.org/pers/hd/z/Zhou:Chunbao", "Yangang Wang.....http://dblp.org/pers/hd/w/Wang:Yangang", "Lili Ju.....http://dblp.org/pers/hd/j/Ju:Lili", "Qiang Du.....http://dblp.org/pers/hd/d/Du:Qiang", "Xuebin Chi.....http://dblp.org/pers/hd/c/Chi:Xuebin", "Dongsheng Xu.....http://dblp.org/pers/hd/x/Xu:Dongsheng", "Dexun Chen.....http://dblp.org/pers/hd/c/Chen:Dexun", "Yong Liu.....http://dblp.org/pers/hd/l/Liu:Yong", "Zhao Liu.....http://dblp.org/pers/hd/l/Liu:Zhao"], "conf": "sc", "year": "2016", "pages": 12}