{"title": "L3: Sensing driving conditions for vehicle lane-level localization on highways.", "fields": ["change detection", "embedded system", "real time computing", "computer science", "intelligent transportation system"], "abstract": "When vehicle road-level localization cannot satisfy people's need for convenience and safety driving, lane-level localization becomes a corner stone in Intelligent Transportation System. Existing work on tracking vehicles on lane-level mostly depends on pre-deployed infrastructures and additional hardwares. In this paper, we utilize smartphone sensing of driving conditions for vehicle lane-level localization on highways. We analyze the driving traces collected from real driving environments, finding that each type of lane change has its unique pattern on the vehicle's lateral acceleration. Based on this observation, we propose a Lane-Level Localization (L3) system, which can perform real-time vehicle localization on lane-level only using smartphones when vehicles are driving on highways. Our system first uses embedded sensors in smartphones to capture the patterns of lane change behaviors. Then a Gaussian Distribution is employed to track vehicles on lane-level with tolerance of false detections. Extensive experiments demonstrate that L3 is accurate and robust in real driving environments. The experimental results show that, on average, L3 achieves accuracy of 91.49% on lane change detection and 86.94% on lane-level localization.", "citation": "Citations (4)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Zhichen Wu.....http://dblp.org/pers/hd/w/Wu:Zhichen", "Jianda Li.....http://dblp.org/pers/hd/l/Li:Jianda", "Jiadi Yu.....http://dblp.org/pers/hd/y/Yu:Jiadi", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Guangtao Xue.....http://dblp.org/pers/hd/x/Xue:Guangtao", "Minglu Li.....http://dblp.org/pers/hd/l/Li_0001:Minglu"], "conf": "infocom", "year": "2016", "pages": 9}