{"title": "Optimizing Semi-Honest Secure Multiparty Computation for the Internet.", "fields": ["latency", "oblivious transfer", "the internet", "secure two party computation", "secure multi party computation", "leaps", "distributed computing", "situated", "theoretical computer science"], "abstract": "In the setting of secure multiparty computation, a set of parties with private inputs wish to compute some function of their inputs without revealing anything but their output. Over the last decade, the efficiency of secure  two-party  computation has advanced in leaps and bounds, with speedups of some orders of magnitude, making it fast enough to be of use in practice. In contrast, progress on the case of multiparty computation (with more than two parties) has been much slower, with very little work being done. Currently, the only implemented efficient multiparty protocol has many rounds of communication (linear in the depth of the circuit being computed) and thus is not suited for Internet-like settings where latency is not very low. In this paper, we construct highly efficient  constant-round  protocols for the setting of multiparty computation for semi-honest adversaries. Our protocols work by constructing a multiparty garbled circuit, as proposed in BMR (Beaver et al., STOC 1990). Our first protocol uses oblivious transfer and constitutes the  first  concretely-efficient constant-round multiparty protocol for the case of no honest majority. Our second protocol uses BGW, and is significantly more efficient than the FairplayMP protocol (Ben-David et al., CCS 2008) that also uses BGW.   We ran extensive experimentation comparing our different protocols with each other and with a highly-optimized implementation of semi-honest GMW. Due to our protocol being constant round, it significantly outperforms GMW in Internet-like settings. For example, with 13 parties situated in the Virginia and Ireland Amazon regions and the SHA256 circuit with 90,000 gates and of depth 4000, the overall running time of our protocol is 25 seconds compared to 335 seconds for GMW. Furthermore, our  online time  is under half a second compared to 330 seconds for GMW.", "citation": "Not cited", "year": "2016", "departments": ["Ben-Gurion University of the Negev", "Bar-Ilan University", "Ariel University"], "conf": "ccs", "authors": ["Aner Ben-Efraim.....http://dblp.org/pers/hd/b/Ben=Efraim:Aner", "Yehuda Lindell.....http://dblp.org/pers/hd/l/Lindell:Yehuda", "Eran Omri.....http://dblp.org/pers/hd/o/Omri:Eran"], "pages": 13}