{"title": "Semantic Community Identification in Large Attribute Networks.", "fields": ["semantic interpretation", "non negative matrix factorization", "inference", "network topology", "modular design"], "abstract": "Identification of modular or community structures of a network is a key to understanding the semantics and functions of the network. While many network community detection methods have been developed, which primarily explore network topologies, they provide little semantic information of the communities discovered. Although structures and semantics are closely related, little effort has been made to discover and analyze these two essential network properties together. By integrating network topology and semantic information on nodes, e.g., node attributes, we study the problems of detection of communities and inference of their semantics simultaneously. We propose a novel nonnegative matrix factorization (NMF) model with two sets of parameters, the community membership matrix and community attribute matrix, and present efficient updating rules to evaluate the parameters with a convergence guarantee. The use of node attributes improves upon community detection and provides a semantic interpretation to the resultant network communities. Extensive experimental results on synthetic and real-world networks not only show the superior performance of the new method over the state-of-the-art approaches, but also demonstrate its ability to semantically annotate the communities.", "citation": "Citations (14)", "departments": ["Washington University in St. Louis", "Tianjin University", "Chinese Academy of Sciences", "Tianjin University of Commerce", "Washington University in St. Louis"], "authors": ["Xiao Wang.....http://dblp.org/pers/hd/w/Wang:Xiao", "Di Jin.....http://dblp.org/pers/hd/j/Jin:Di", "Xiaochun Cao.....http://dblp.org/pers/hd/c/Cao:Xiaochun", "Liang Yang.....http://dblp.org/pers/hd/y/Yang_0002:Liang", "Weixiong Zhang.....http://dblp.org/pers/hd/z/Zhang:Weixiong"], "conf": "aaai", "year": "2016", "pages": 7}