{"title": "Pre-Touch Sensing for Mobile Interaction.", "fields": ["mobile interaction", "multi touch", "touchscreen", "index finger", "context menu"], "abstract": "Touchscreens continue to advance including progress towards sensing fingers proximal to the display. We explore this emerging  pre-touch modality  via a self-capacitance touchscreen that can sense multiple fingers above a mobile device, as well as grip around the screen's edges. This capability opens up many possibilities for mobile interaction. For example, using pre-touch in an  anticipatory  role affords an \"ad-lib interface\" that fades in a different UI--appropriate to the context--as the user approaches one-handed with a thumb, two-handed with an index finger, or even with a pinch or two thumbs. Or we can interpret pre-touch in a retroactive manner that leverages the approach trajectory to discern whether the user made contact with a ballistic vs. a finely-targeted motion. Pre-touch also enables  hybrid touch + hover gestures , such as selecting an icon with the thumb while bringing a second finger into range to invoke a context menu at a convenient location. Collectively these techniques illustrate how pre-touch sensing offers an intriguing new back-channel for mobile interaction.", "citation": "Citations (25)", "year": "2016", "departments": ["Microsoft", "KAIST", "Microsoft", "Microsoft", "Microsoft"], "conf": "chi", "authors": ["Ken Hinckley.....http://dblp.org/pers/hd/h/Hinckley:Ken", "Seongkook Heo.....http://dblp.org/pers/hd/h/Heo:Seongkook", "Michel Pahud.....http://dblp.org/pers/hd/p/Pahud:Michel", "Christian Holz.....http://dblp.org/pers/hd/h/Holz:Christian", "Hrvoje Benko.....http://dblp.org/pers/hd/b/Benko:Hrvoje", "Abigail Sellen.....http://dblp.org/pers/hd/s/Sellen:Abigail", "Richard Banks.....http://dblp.org/pers/hd/b/Banks:Richard", "Kenton O'Hara.....http://dblp.org/pers/hd/o/O=Hara:Kenton", "Gavin Smyth.....http://dblp.org/pers/hd/s/Smyth:Gavin", "William Buxton.....http://dblp.org/pers/hd/b/Buxton:William"], "pages": 13}