{"title": "SABRes: Atomic object reads for in-memory rack-scale computing.", "fields": ["hardware acceleration", "remote direct memory access", "atomicity", "cache", "distributed object"], "abstract": "Modern in-memory services rely on large distributed object stores to achieve the high scalability essential to service thousands of requests concurrently. The independent and unpredictable nature of incoming requests results in random accesses to the object store, triggering frequent remote memory accesses. State-of-the-art distributed memory frameworks leverage the one-sided operations offered by RDMA technology to mitigate the traditionally high cost of remote memory access. Unfortunately, the limited semantics of RDMA onesided operations bound remote memory access atomicity to a single cache block; therefore, atomic remote object access relies on software mechanisms. Emerging highly integrated rack-scale systems that reduce the latency of one-sided operations to a small multiple of DRAM latency expose the overhead of these software mechanisms as a major latency contributor.   This technology-triggered paradigm shift calls for new onesided operations with stronger semantics. We take a step in that direction by proposing SABRes, a new one-sided operation that provides atomic remote object reads in hardware. We then present LightSABRes, a lightweight hardware accelerator for SABRes that removes all atomicity-associated software overheads. Compared to a state-of-the-art software atomicity mechanism, LightSABRes improve the throughput of a microbenchmark atomically accessing 128B-8KB objects from remote memory by 15--97%, and the throughput of a modern in-memory distributed object store by 30--60%.", "citation": "Citations (3)", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Alexandros Daglis.....http://dblp.org/pers/hd/d/Daglis:Alexandros", "Dmitrii Ustiugov.....http://dblp.org/pers/hd/u/Ustiugov:Dmitrii", "Stanko Novakovic.....http://dblp.org/pers/hd/n/Novakovic:Stanko", "Edouard Bugnion.....http://dblp.org/pers/hd/b/Bugnion:Edouard", "Babak Falsafi.....http://dblp.org/pers/hd/f/Falsafi:Babak", "Boris Grot.....http://dblp.org/pers/hd/g/Grot:Boris"], "conf": "micro", "year": "2016", "pages": 13}