{"title": "Explainable User Clustering in Short Text Streams.", "fields": ["clustering high dimensional data", "topic model", "fuzzy clustering", "information retrieval", "streams", "computer science", "brown clustering", "data stream clustering", "cluster analysis"], "abstract": "User clustering has been studied from different angles: behavior-based, to identify similar browsing or search patterns, and content-based, to identify shared interests. Once user clusters have been found, they can be used for recommendation and personalization. So far, content-based user clustering has mostly focused on static sets of relatively long documents. Given the dynamic nature of social media, there is a need to dynamically cluster users in the context of short text streams. User clustering in this setting is more challenging than in the case of long documents as it is difficult to capture the users' dynamic topic distributions in sparse data settings. To address this problem, we propose a dynamic user clustering topic model (or UCT for short). UCT adaptively tracks changes of each user's time-varying topic distribution based both on the short texts the user posts during a given time period and on the previously estimated distribution. To infer changes, we propose a Gibbs sampling algorithm where a set of word-pairs from each user is constructed for sampling. The clustering results are explainable and human-understandable, in contrast to many other clustering algorithms. For evaluation purposes, we work with a dataset consisting of users and tweets from each user. Experimental results demonstrate the effectiveness of our proposed clustering model compared to state-of-the-art baselines.", "citation": "Not cited", "departments": ["Shandong University", "University College London", "University of Amsterdam", "Shandong University", "University College London"], "authors": ["Yukun Zhao.....http://dblp.org/pers/hd/z/Zhao:Yukun", "Shangsong Liang.....http://dblp.org/pers/hd/l/Liang:Shangsong", "Zhaochun Ren.....http://dblp.org/pers/hd/r/Ren:Zhaochun", "Jun Ma.....http://dblp.org/pers/hd/m/Ma_0001:Jun", "Emine Yilmaz.....http://dblp.org/pers/hd/y/Yilmaz:Emine", "Maarten de Rijke.....http://dblp.org/pers/hd/r/Rijke:Maarten_de"], "conf": "sigir", "year": "2016", "pages": 10}