{"title": "Efficiently computing reverse k furthest neighbors.", "fields": ["ranking", "spatial query", "sargable", "web search query", "online aggregation"], "abstract": "Given a set of facilities F, a set of users U and a query facility q, a reverse k furthest neighbors (RkFN) query retrieves every user u ∈ U for which q is one of its k-furthest facilities. RkFN query is the natural complement of reverse k-nearest neighbors (RkNN) query that returns every user u for which q is one of its k-nearest facilities. While RkNN query returns the users that are highly influenced by a query q, RkFN query aims at finding the users that are least influenced by a query q. RkFN query has many applications in location-based services, marketing, facility location, clustering, and recommendation systems etc. While there exist several algorithms that answer RkFN query for k = 1, we are the first to propose a solution for arbitrary value of k. Based on several interesting observations, we present an efficient algorithm to process the RkFN queries. We also present a rigorous theoretical analysis to study various important aspects of the problem and our algorithm. An extensive experimental study is conducted using both real and synthetic data sets, demonstrating that our algorithm outperforms the state-of-the-art algorithm even for k = 1. The accuracy of our theoretical analysis is also verified by the experiments.", "citation": "Citations (5)", "departments": ["University of New South Wales", "Monash University", "University of New South Wales", "University of Technology, Sydney", "Commonwealth Scientific and Industrial Research Organisation"], "authors": ["Shenlu Wang.....http://dblp.org/pers/hd/w/Wang:Shenlu", "Muhammad Aamir Cheema.....http://dblp.org/pers/hd/c/Cheema:Muhammad_Aamir", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Dongxi Liu.....http://dblp.org/pers/hd/l/Liu:Dongxi"], "conf": "icde", "year": "2016", "pages": 12}