{"title": "Taming collisions for delay reduction in low-duty-cycle wireless sensor networks.", "fields": ["network packet", "collision", "forwarder", "key distribution in wireless sensor networks", "latency"], "abstract": "Many-to-one data collection is a fundamental operation in wireless sensor networks (WSNs). To support long-term deployment of WSNs, sensor nodes normally operate at low-duty-cycles. However, the low-duty-cycle operation significantly reduces the communication chance between nodes. Consequently, the risk of data collisions significantly increases when multiple senders transmit packets to a receiver during its very short active period. Data collision not only results in wasted packet transmissions, but also incurs a large delivery latency. Under such conditions, collision-free medium access is more appealing than recovering after collision for low-duty-cycle WSNs. In this work, we propose an incast-collision-free data collection protocol, named iCore, to address the many-to-one collision problem in low-duty-cycle WSNs. iCore employs the dynamic forwarding technique and establishes a non-conflicting schedule for delay reduction. Specifically, we design efficient forwarder assignment and forwarding optimization algorithms that ensure low end-to-end latency under diverse data traffic types. Through comprehensive performance evaluations, we demonstrate that, compared with the state-of-the-art protocol, iCore effectively minimizes the end-to-end delay by 25% ∼ 57% and maintains high delivery ratio and energy efficiency for different many-to-one convergecast scenarios.", "citation": "Citations (7)", "departments": ["Beihang University", "IBM", "Beihang University", "University of Maryland, Baltimore County", "University of Texas at Dallas"], "authors": ["Long Cheng.....http://dblp.org/pers/hd/c/Cheng_0005:Long", "Yu Gu.....http://dblp.org/pers/hd/g/Gu_0001:Yu", "Jianwei Niu.....http://dblp.org/pers/hd/n/Niu_0002:Jianwei", "Ting Zhu.....http://dblp.org/pers/hd/z/Zhu:Ting", "Cong Liu.....http://dblp.org/pers/hd/l/Liu_0005:Cong", "Qingquan Zhang.....http://dblp.org/pers/hd/z/Zhang:Qingquan", "Tian He.....http://dblp.org/pers/hd/h/He_0001:Tian"], "conf": "infocom", "year": "2016", "pages": 9}