{"title": "Self-Adaptive Linear Hashing for solid state drives.", "fields": ["search cost", "linear hashing", "exploit", "bloom filter", "2 choice hashing"], "abstract": "Flash memory based solid state drives (SSDs) have emerged as a new alternative to replace magnetic disks due to their high performance and low power consumption. However, random writes on SSDs are much slower than SSD reads. Therefore, traditional index structures, which are designed based on the symmetrical I/O property of magnetic disks, cannot completely exert the high performance of SSDs. In this paper, we propose an SSD-optimized linear hashing index called Self-Adaptive Linear Hashing (SAL-Hashing) to reduce small random writes to SSDs that are caused by index operations. The contributions of our work are manifold. First, we propose to organize buckets into groups and sets to facilitate coarse-grained writes and lazy-split so as to avoid intermediate writes on the hash structure. A group consists of a fixed number of buckets and a set consists of a number of groups. Second, we attach a log region to each set, and amortize the cost of reads and writes by committing updates to the log region in batch. Third, in order to reduce search cost, each log region is equipped with Bloom filters to index update logs. We devise a cost-based online algorithm to adaptively merge the log region with the corresponding set when the set becomes search-intensive. Finally, in order to exploit the internal package-level parallelisms of SSDs, we apply coarse-grained writes for merging or split operations to achieve a high bandwidth. Our experimental results suggest that our proposal is self-adaptive according to the change of access patterns, and outperforms several competitors under various workloads on two commodity SSDs.", "citation": "Not cited", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China"], "authors": ["Chengcheng Yang.....http://dblp.org/pers/hd/y/Yang:Chengcheng", "Peiquan Jin.....http://dblp.org/pers/hd/j/Jin:Peiquan", "Lihua Yue.....http://dblp.org/pers/hd/y/Yue:Lihua", "Dezhi Zhang.....http://dblp.org/pers/hd/z/Zhang:Dezhi"], "conf": "icde", "year": "2016", "pages": 12}