{"title": "Grain graphs: OpenMP performance analysis made easy.", "fields": ["runtime system", "memory hierarchy", "zoom", "thread", "granularity"], "abstract": "Average programmers struggle to solve performance problems in OpenMP programs with tasks and parallel for-loops. Existing performance analysis tools visualize OpenMP task performance from the runtime system's perspective where task execution is interleaved with other tasks in an unpredictable order. Problems with OpenMP parallel for-loops are similarly difficult to resolve since tools only visualize aggregate thread-level statistics such as load imbalance without zooming into a per-chunk granularity. The runtime system/threads oriented visualization provides poor support for understanding problems with task and chunk execution time, parallelism, and memory hierarchy utilization, forcing average programmers to rely on experts or use tedious trial-and-error tuning methods for performance. We present  grain graphs , a new OpenMP performance analysis method that visualizes  grains  -- computation performed by a task or a parallel for-loop chunk instance -- and highlights problems such as low parallelism, work inflation and poor parallelization benefit at the grain level. We demonstrate that grain graphs can quickly reveal performance problems that are difficult to detect and characterize in fine detail using existing visualizations in standard OpenMP programs, simplifying OpenMP performance analysis. This enables average programmers to make portable optimizations for poor performing OpenMP programs, reducing pressure on experts and removing the need for tedious trial-and-error tuning.", "citation": "Citations (8)", "year": "2016", "departments": ["Royal Institute of Technology", "Royal Institute of Technology", "Royal Institute of Technology", "SICS Swedish ICT AB"], "conf": "ppopp", "authors": ["Ananya Muddukrishna.....http://dblp.org/pers/hd/m/Muddukrishna:Ananya", "Peter A. Jonsson.....http://dblp.org/pers/hd/j/Jonsson:Peter_A=", "Artur Podobas.....http://dblp.org/pers/hd/p/Podobas:Artur", "Mats Brorsson.....http://dblp.org/pers/hd/b/Brorsson:Mats"], "pages": 13}