{"title": "Answering why-not spatial keyword top-k queries via keyword adaption.", "fields": ["rdf query language", "ranking", "keyword density", "sargable", "web search query"], "abstract": "Web objects, often associated with descriptive text documents, are increasingly being geo-tagged. A spatial keyword top-k query retrieves the best k such objects according to a scoring function that considers both spatial distance and textual similarity. However, it is in some cases difficult for users to identify the exact keywords that describe their query intent. After a user issues an initial query and gets back the result, the user may find that some expected objects are missing and may wonder why. Answering the resulting why-not questions can aid users in retrieving better results. However, no existing techniques are able to answer why-not questions by adapting the query keywords. We propose techniques capable of adapting an initial set of query keywords so that expected, but missing, objects enter the result along with other relevant objects. We develop a basic algorithm with a set of optimizations that sequentially examines a sequence of candidate keyword sets. In addition, we present an index-based bound-and-prune algorithm that is able to determine the best sample out of a set of candidates in just one pass of index traversal, thus speeding up the query processing. We also extend the proposed algorithms to handle multiple missing objects. Extensive experimental results offer insight into the efficiency of the proposed techniques in terms of running time and I/O cost.", "citation": "Citations (11)", "departments": ["Hong Kong Baptist University", "Hong Kong Baptist University", "East China Normal University", "Aalborg University", "Hong Kong Polytechnic University"], "authors": ["Lei Chen.....http://dblp.org/pers/hd/c/Chen_0031:Lei", "Jianliang Xu.....http://dblp.org/pers/hd/x/Xu:Jianliang", "Xin Lin.....http://dblp.org/pers/hd/l/Lin:Xin", "Christian S. Jensen.....http://dblp.org/pers/hd/j/Jensen:Christian_S=", "Haibo Hu.....http://dblp.org/pers/hd/h/Hu:Haibo"], "conf": "icde", "year": "2016", "pages": 12}