{"title": "CLAMS: Bringing Quality to Data Lakes.", "fields": ["data quality", "big data", "raw data", "enterprise data management", "data warehouse"], "abstract": "With the increasing incentive of enterprises to ingest as much data as they can in what is commonly referred to as \"data lakes\", and with the recent development of multiple technologies to support this \"load-first\" paradigm, the new environment presents serious data management challenges. Among them, the assessment of data quality and cleaning large volumes of heterogeneous data sources become essential tasks in unveiling the value of big data. The coveted use of unstructured and semi-structured data in large volumes makes current data cleaning tools (primarily designed for relational data) not directly adoptable.   We present CLAMS, a system to discover and enforce expressive integrity constraints from large amounts of lake data with very limited schema information (e.g., represented as RDF triples). This demonstration shows how CLAMS is able to discover the constraints and the schemas they are defined on simultaneously. CLAMS also introduces a scale-out solution to efficiently detect errors in the raw data. CLAMS interacts with human experts to both validate the discovered constraints and to suggest data repairs.   CLAMS has been deployed in a real large-scale enterprise data lake and was experimented with a real data set of 1.2 billion triples. It has been able to spot multiple obscure data inconsistencies and errors early in the data processing stack, providing huge value to the enterprise.", "citation": "Citations (7)", "year": "2016", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo", "Thomson Reuters", "University of Waterloo"], "conf": "sigmod", "authors": ["Mina H. Farid.....http://dblp.org/pers/hd/f/Farid:Mina_H=", "Alexandra Roatis.....http://dblp.org/pers/hd/r/Roatis:Alexandra", "Ihab F. Ilyas.....http://dblp.org/pers/hd/i/Ilyas:Ihab_F=", "Hella-Franziska Hoffmann.....http://dblp.org/pers/hd/h/Hoffmann:Hella=Franziska", "Xu Chu.....http://dblp.org/pers/hd/c/Chu:Xu"], "pages": 4}