{"title": "String Analysis via Automata Manipulation with Logic Circuit Representation.", "fields": ["finite state machine", "attack patterns", "nondeterministic algorithm", "string", "logic optimization"], "abstract": "Many severe security vulnerabilities in web applications can be attributed to string manipulation mistakes, which can often be avoided through formal string analysis. String analysis tools are indispensable and under active development. Prior string analysis methods are primarily automata-based or satisfiability-based. The two approaches exhibit distinct strengths and weaknesses. Specifically, existing automata-based methods have difficulty in generating counterexamples at system inputs to witness vulnerability, whereas satisfiability-based methods are inadequate to produce filters amenable for firmware or hardware implementation for real-time screening of malicious inputs to a system under protection. In this paper, we propose a new string analysis method based on a scalable logic circuit representation for (nondeterministic) finite automata to support various string and automata manipulation operations. It enables both counterexample generation and filter synthesis in string constraint solving. By using the new data structure, automata with large state spaces and/or alphabet sizes can be efficiently represented. Empirical studies on a large set of open source web applications and well-known attack patterns demonstrate the unique benefits of our method compared to prior string analysis tools.", "citation": "Citations (9)", "year": "2016", "departments": ["National Taiwan University", "National Taiwan University", "National Chengchi University", "National Chengchi University", "National Taiwan University"], "conf": "cav", "authors": ["Hung-En Wang.....http://dblp.org/pers/hd/w/Wang:Hung=En", "Tzung-Lin Tsai.....http://dblp.org/pers/hd/t/Tsai:Tzung=Lin", "Chun-Han Lin.....http://dblp.org/pers/hd/l/Lin:Chun=Han", "Fang Yu.....http://dblp.org/pers/hd/y/Yu:Fang", "Jie-Hong R. Jiang.....http://dblp.org/pers/hd/j/Jiang:Jie=Hong_R="], "pages": 20}