{"title": "Combining Shape-Changing Interfaces and Spatial Augmented Reality Enables Extended Object Appearance.", "fields": ["projection mapping", "bump mapping", "3d computer graphics", "extensibility", "augmented reality"], "abstract": "We propose combining shape-changing interfaces and spatial augmented reality for extending the space of appearances and interactions of actuated interfaces. While shape-changing interfaces can dynamically alter the physical appearance of objects, the integration of spatial augmented reality additionally allows for dynamically changing objects' optical appearance with high detail. This way, devices can render currently challenging features such as high frequency texture or fast motion. We frame this combination in the context of computer graphics with analogies to established techniques for increasing the realism of 3D objects such as bump mapping. This extensible framework helps us identify challenges of the two techniques and benefits of their combination. We utilize our prototype shape-changing device enriched with spatial augmented reality through projection mapping to demonstrate the concept. We present a novel mechanical distance-fields algorithm for real-time fitting of mechanically constrained shape-changing devices to arbitrary 3D graphics. Furthermore, we present a technique for increasing effective screen real estate for spatial augmented reality through view-dependent shape change.", "citation": "Citations (11)", "year": "2016", "departments": ["Technical University of Berlin", "Aarhus University", "Aarhus University", "Aarhus University", "Technical University of Berlin"], "conf": "chi", "authors": ["David Lindlbauer.....http://dblp.org/pers/hd/l/Lindlbauer:David", "Jens Emil Grønbæk.....http://dblp.org/pers/hd/g/Gr=oslash=nb=aelig=k:Jens_Emil", "Morten Birk.....http://dblp.org/pers/hd/b/Birk:Morten", "Kim Halskov.....http://dblp.org/pers/hd/h/Halskov:Kim", "Marc Alexa.....http://dblp.org/pers/hd/a/Alexa:Marc", "Jörg Müller.....http://dblp.org/pers/hd/m/M=uuml=ller_0001:J=ouml=rg"], "pages": 12}