{"title": "Distributed Wavelet Thresholding for Maximum Error Metrics.", "fields": ["wavelet", "thresholding", "data reduction", "scalability", "greedy algorithm"], "abstract": "Modern data analytics involve simple and complex computations over enormous numbers of data records. The volume of data and the increasingly stringent response-time requirements place increasing emphasis on the efficiency of approximate query processing. A major challenge over the past years has been the efficient construction of fixed-space synopses that provide a deterministic quality guarantee, often expressed in terms of a maximum error metric. For data reduction, wavelet decomposition has proved to be a very effective tool, as it can successfully approximate sharp discontinuities and provide accurate answers to queries. However, existing polynomial time wavelet thresholding schemes that minimize maximum error metrics are constrained with impractical time and space complexities for large datasets. In order to provide a practical solution to the problem, we develop parallel algorithms that take advantage of key-properties of the wavelet decomposition and allocate tasks to multiple workers. To that end, we present i) a general framework for the parallelization of existing dynamic programming algorithms, ii) a parallel version of one such DP-based algorithm and iii) a new parallel greedy algorithm for the problem. To the best of our knowledge, this is the first attempt to scale algorithms for wavelet thresholding for maximum error metrics via a state-of-the-art distributed runtime. Our extensive experiments on both real and synthetic datasets over Hadoop show that the proposed algorithms achieve linear scalability and superior running-time performance compared to their centralized counterparts. Furthermore, our distributed greedy algorithm outperforms the distributed version of the current state-of-the-art dynamic programming algorithm by 2 to 4 times, without compromising the quality of results.", "citation": "Citations (1)", "year": "2016", "departments": ["National Technical University of Athens", "Ionian University", "National Technical University of Athens"], "conf": "sigmod", "authors": ["Ioannis Mytilinis.....http://dblp.org/pers/hd/m/Mytilinis:Ioannis", "Dimitrios Tsoumakos.....http://dblp.org/pers/hd/t/Tsoumakos:Dimitrios", "Nectarios Koziris.....http://dblp.org/pers/hd/k/Koziris:Nectarios"], "pages": 15}