{"title": "Too long; didn't watch!: extracting relevant fragments from software development video tutorials.", "fields": ["software development", "noisy data", "popularity", "stack overflow", "recommender system"], "abstract": "When knowledgeable colleagues are not available, developers resort to offline and online resources,  e.g. , tutorials, mailing lists, and Q&A websites. These, however, need to be found, read, and understood, which takes its toll in terms of time and mental energy. A more immediate and accessible resource are video tutorials found on the web, which in recent years have seen a steep increase in popularity. Nonetheless, videos are an intrinsically noisy data source, and finding the right piece of information might be even more cumbersome than using the previously mentioned resources.   We present CodeTube, an approach which mines video tutorials found on the web, and enables developers to query their contents. The video tutorials are split into coherent fragments, to return only fragments related to the query. These are complemented with information from additional sources, such as Stack Overflow discussions. The results of two studies to assess CodeTube indicate that video tutorials---if appropriately processed---represent a useful, yet still under-utilized source of information for software development.", "citation": "Citations (14)", "departments": ["University of Lugano", "Free University of Bozen-Bolzano", "University of Lugano", "University of Sannio", "University of Molise"], "authors": ["Luca Ponzanelli.....http://dblp.org/pers/hd/p/Ponzanelli:Luca", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Andrea Mocci.....http://dblp.org/pers/hd/m/Mocci:Andrea", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Rocco Oliveto.....http://dblp.org/pers/hd/o/Oliveto:Rocco", "Mir Anamul Hasan.....http://dblp.org/pers/hd/h/Hasan:Mir_Anamul", "Barbara Russo.....http://dblp.org/pers/hd/r/Russo:Barbara", "Sonia Haiduc.....http://dblp.org/pers/hd/h/Haiduc:Sonia", "Michele Lanza.....http://dblp.org/pers/hd/l/Lanza:Michele"], "conf": "icse", "year": "2016", "pages": 12}