{"title": "Learning Dense Correspondence via 3D-Guided Cycle Consistency.", "fields": ["discriminative model", "deep learning", "exploit", "convolutional neural network", "pairwise comparison"], "abstract": "Discriminative deep learning approaches have shown impressive results for problems where human-labeled ground truth is plentiful, but what about tasks where labels are difficult or impossible to obtain? This paper tackles one such problem: establishing dense visual correspondence across different object instances. For this task, although we do not know what the ground-truth is, we know it should be consistent across instances of that category. We exploit this consistency as a supervisory signal to train a convolutional neural network to predict cross-instance correspondences between pairs of images depicting objects of the same category. For each pair of training images we find an appropriate 3D CAD model and render two synthetic views to link in with the pair, establishing a correspondence flow 4-cycle. We use ground-truth synthetic-to-synthetic correspondences, provided by the rendering engine, to train a ConvNet to predict synthetic-to-real, real-to-real and realto-synthetic correspondences that are cycle-consistent with the ground-truth. At test time, no CAD models are required. We demonstrate that our end-to-end trained ConvNet supervised by cycle-consistency outperforms stateof-the-art pairwise matching methods in correspondencerelated tasks.", "citation": "Citations (70)", "year": "2016", "departments": ["University of California", "University of California", "University of California, Berkeley", "Toyota Technological Institute at Chicago", "University of California, Berkeley"], "conf": "cvpr", "authors": ["Tinghui Zhou.....http://dblp.org/pers/hd/z/Zhou:Tinghui", "Philipp Krähenbühl.....http://dblp.org/pers/hd/k/Kr=auml=henb=uuml=hl:Philipp", "Mathieu Aubry.....http://dblp.org/pers/hd/a/Aubry:Mathieu", "Qi-Xing Huang.....http://dblp.org/pers/hd/h/Huang:Qi=Xing", "Alexei A. Efros.....http://dblp.org/pers/hd/e/Efros:Alexei_A="], "pages": 10}