{"title": "Distance-aware influence maximization in geo-social network.", "fields": ["maximization", "viral marketing", "arborescence", "speedup", "pruning"], "abstract": "Influence maximization is a key problem in viral marketing. Given a social network G and a positive integer k, it aims to identify a seed set of k nodes in G that can maximize the expected influence spread in a certain propagation model. With the proliferation of geo-social networks, location-aware product promotion is becoming more necessary in real applications. However, the importance of the distance between users and the promoted location is underestimated in existing models. For instance, when opening a restaurant in downtown, through online promotion, the owner may expect to influence more customers who are close to the restaurant, instead of people that are far away from it. In this paper, we formally define the distance-aware influence maximization problem, to find a seed set that maximizes the expected influence over users who are more likely to be the potential customers of the promoted location. To efficiently calculate the influence spread, we adopt the maximum influence arborescence (MIA) model for influence approximation. To speed up the search, we propose three pruning strategies to prune unpromising nodes from expensive evaluation and achieve potential early termination in each iteration without sacrificing the final result's approximation ratio. In addition, novel index structures are developed to compute the bounds used in the three pruning strategies. By integrating these pruning strategies, we propose a priority based algorithm which searches users based on their order of influence. The algorithm achieves an approximation ratio of 1 − 1 over e under the MIA model. In the final, comprehensive experiments over real datasets demonstrate the efficiency and effectiveness of the proposed algorithms and pruning strategies.", "citation": "Citations (12)", "departments": ["University of Technology, Sydney", "University of Technology, Sydney", "University of New South Wales"], "authors": ["Xiaoyang Wang.....http://dblp.org/pers/hd/w/Wang_0002:Xiaoyang", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin"], "conf": "icde", "year": "2016", "pages": 12}