{"title": "MUSA: a multi-level simulation approach for next-generation HPC machines.", "fields": ["system software", "supercomputer", "microarchitecture", "scalability", "next generation network"], "abstract": "The complexity of High Performance Computing (HPC) systems is increasing in the number of components and their heterogeneity. Interactions between software and hardware involve many different aspects which are typically not transparent to scientific programmers and system architects. Therefore, predicting the behavior of current scientific applications on future HPC infrastructures is a challenging task.   In this paper we present MUSA, an end-to-end methodology that employs a multi-level simulation infrastructure. By combining different levels of abstraction, MUSA is able to model the communication network, microarchitectural details and system software interactions, providing different trade-offs in terms of simulation cost and accuracy. We compare detailed MUSA simulations with native executions of up to 2,048 cores and find relative errors that are within 10% in the common case. In addition, we use MUSA to simulate up to 16,384 cores and successfully identify scalability bottlenecks due to different factors, e.g. memory contention or load imbalance. We also compare different system configurations, showing how MUSA can help system designers to assess the usefulness of future technologies in next-generation HPC machines.", "citation": "Citations (4)", "departments": ["Polytechnic University of Catalonia", "Barcelona Supercomputing Center", "Barcelona Supercomputing Center", "Polytechnic University of Catalonia", "ARM Inc."], "authors": ["Thomas Grass.....http://dblp.org/pers/hd/g/Grass:Thomas", "César Allande.....http://dblp.org/pers/hd/a/Allande:C=eacute=sar", "Adrià Armejach.....http://dblp.org/pers/hd/a/Armejach:Adri=agrave=", "Alejandro Rico.....http://dblp.org/pers/hd/r/Rico:Alejandro", "Eduard Ayguadé.....http://dblp.org/pers/hd/a/Ayguad=eacute=:Eduard", "Jesús Labarta.....http://dblp.org/pers/hd/l/Labarta:Jes=uacute=s", "Mateo Valero.....http://dblp.org/pers/hd/v/Valero:Mateo", "Marc Casas.....http://dblp.org/pers/hd/c/Casas:Marc", "Miquel Moretó.....http://dblp.org/pers/hd/m/Moret=oacute=:Miquel"], "conf": "sc", "year": "2016", "pages": 12}