{"title": "TCP Ordo: The cost of ordered processing in TCP servers.", "fields": ["h tcp", "cubic tcp", "out of order delivery", "compound tcp", "zeta tcp"], "abstract": "To achieve scalable, high-throughput, low-latency packet processing, TCP implementations are parallelized across cores in multicore platforms. This, however, significantly affects the order in which packets from different flows are delivered to application processing. Our measurements record up to 75% of the packets are delivered to applications in a way that does not match the order in which they are received on the network interface. For many important classes of applications, such as financial services, bidding and trading engines, game engines, this cross-flow packet reordering affects their ability to provide fairness guarantees. To address this gap, we propose TCP-Ordo — a TCP stack which provides strict ordering of packets across multiple flows, as well as flexibility to control the degree to which ordering is enforced. TCP-Ordo outperforms existing TCP implementations in both latency and throughput. The current prototype is implemented as a user-level TCP stack for Mellanox Connectx3 NICs with 40Gbps Ethernet interfaces. Without ordering guarantees TCP-Ordo delivers one way latency of 4.75usec (a 5x improvement over the Linux kernel) for 150B packets and throughput of 22Gbps (a 2x improvement over mTCP) for 1500B packets. Furthermore, with TCP-Ordo applications are provided with strict packet order delivery, with performance that continues to be superior to the state-of-the-art, even when enforcing packet order across 800,000 connections on a 12-core platform. Finally, TCP-Ordo supports the notion of ‘ordered domains’ that offer flexibility in the degree of ordering that an application will experience, and pay for.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Mohan Kumar.....http://dblp.org/pers/hd/k/Kumar:Mohan", "Ada Gavrilovska.....http://dblp.org/pers/hd/g/Gavrilovska:Ada"], "conf": "infocom", "year": "2016", "pages": 9}