{"title": "Mining revision histories to detect cross-language clones without intermediates.", "fields": ["common intermediate language", "language family", "grammar", "intermediate language", "implementation"], "abstract": "To attract more users on different platforms, many projects release their versions in multiple programming languages (e.g., Java and C#). They typically have many code snippets that implement similar functionalities, i.e., cross-language clones. Programmers often need to track and modify cross-language clones consistently to maintain similar functionalities across different language implementations. In literature, researchers have proposed approaches to detect cross- language clones, mostly for languages that share a common intermediate language (such as the .NET language family) so that techniques for detecting single-language clones can be applied. As a result, those approaches cannot detect cross-language clones for many projects that are not implemented in a .NET language. To overcome the limitation, in this paper, we propose a novel approach, CLCMiner, that detects cross-language clones automatically without the need of an intermediate language. Our approach mines such clones from revision histories, which reflect how programmers maintain cross-language clones in practice. We have implemented a prototype tool for our approach and conducted an evaluation on five open source projects that have versions in Java and C#. The results show that CLCMiner achieves high accuracy and point to promising future work.", "citation": "Citations (2)", "departments": ["Singapore Management University", "Singapore Management University", "Department of C ... iversity, China", "Department of C ... iversity, China", "School of Softw ... iversity, China"], "authors": ["Xiao Cheng.....http://dblp.org/pers/hd/c/Cheng:Xiao", "Zhiming Peng.....http://dblp.org/pers/hd/p/Peng:Zhiming", "Lingxiao Jiang.....http://dblp.org/pers/hd/j/Jiang:Lingxiao", "Hao Zhong.....http://dblp.org/pers/hd/z/Zhong:Hao", "Haibo Yu.....http://dblp.org/pers/hd/y/Yu_0001:Haibo", "Jianjun Zhao.....http://dblp.org/pers/hd/z/Zhao:Jianjun"], "conf": "kbse", "year": "2016", "pages": 6}