{"title": "DRIMUX: Dynamic Rumor Influence Minimization with User Experience in Social Networks.", "fields": ["ising model", "information sharing", "inference", "popularity", "user experience design", "rumor"], "abstract": "Rumor blocking is a serious problem in large-scale social networks. Malicious rumors could cause chaos in society and hence need to be blocked as soon as possible after being detected. In this paper, we propose a model of dynamic rumor influence minimization with user experience (DRIMUX). Our goal is to minimize the influence of the rumor (i.e., the number of users that have accepted and sent the rumor) by blocking a certain subset of nodes. A dynamic Ising propagation model considering both the global popularity and individual attraction of the rumor is presented based on realistic scenario. In addition, different from existing problems of influence minimization, we take into account the constraint of user experience utility. Specifically, each node is assigned a tolerance time threshold. If the blocking time of each user exceeds that threshold, the utility of the network will decrease. Under this constraint, we then formulate the problem as a network inference problem with survival theory, and propose solutions based on maximum likelihood principle. Experiments are implemented based on large-scale real world networks and validate the effectiveness of our method.", "citation": "Citations (2)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Biao Wang.....http://dblp.org/pers/hd/w/Wang:Biao", "Ge Chen.....http://dblp.org/pers/hd/c/Chen:Ge", "Luoyi Fu.....http://dblp.org/pers/hd/f/Fu:Luoyi", "Li Song.....http://dblp.org/pers/hd/s/Song:Li", "Xinbing Wang.....http://dblp.org/pers/hd/w/Wang:Xinbing", "Xue Liu.....http://dblp.org/pers/hd/l/Liu:Xue"], "conf": "aaai", "year": "2016", "pages": 7}