{"title": "Crowdsourcing Annotations for Websites' Privacy Policies: Can It Really Work?", "fields": ["privacy policy", "crowdsourcing", "annotation", "privacy by design", "privacy software"], "abstract": "Website privacy policies are often long and difficult to understand. While research shows that Internet users care about their privacy, they do not have time to understand the policies of every website they visit, and most users hardly ever read privacy policies. Several recent efforts aim to crowdsource the interpretation of privacy policies and use the resulting annotations to build more effective user interfaces that provide users with salient policy summaries. However, very little attention has been devoted to studying the accuracy and scalability of crowdsourced privacy policy annotations, the types of questions crowdworkers can effectively answer, and the ways in which their productivity can be enhanced. Prior research indicates that most Internet users often have great difficulty understanding privacy policies, suggesting limits to the effectiveness of crowdsourcing approaches. In this paper, we assess the viability of crowdsourcing privacy policy annotations. Our results suggest that, if carefully deployed, crowdsourcing can indeed result in the generation of non-trivial annotations and can also help identify elements of ambiguity in policies. We further introduce and evaluate a method to improve the annotation process by predicting and highlighting paragraphs relevant to specific data practices.", "citation": "Citations (15)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "University of Central Florida"], "authors": ["Shomir Wilson.....http://dblp.org/pers/hd/w/Wilson:Shomir", "Florian Schaub.....http://dblp.org/pers/hd/s/Schaub:Florian", "Rohan Ramanath.....http://dblp.org/pers/hd/r/Ramanath:Rohan", "Norman M. Sadeh.....http://dblp.org/pers/hd/s/Sadeh:Norman_M=", "Fei Liu.....http://dblp.org/pers/hd/l/Liu_0004:Fei", "Noah A. Smith.....http://dblp.org/pers/hd/s/Smith:Noah_A=", "Frederick Liu.....http://dblp.org/pers/hd/l/Liu:Frederick"], "conf": "www", "year": "2016", "pages": 11}