{"title": "Hierarchical Deep Reinforcement Learning: Integrating Temporal Abstraction and Intrinsic Motivation.", "fields": ["intrinsic value", "error driven learning", "reinforcement learning", "abstraction", "q learning"], "abstract": "Learning goal-directed behavior in environments with sparse feedback is a major challenge for reinforcement learning algorithms. One of the key difficulties is insufficient exploration, resulting in an agent being unable to learn robust policies. Intrinsically motivated agents can explore new behavior for their own sake rather than to directly solve external goals. Such intrinsic behaviors could eventually help the agent solve tasks posed by the environment. We present hierarchical-DQN (h-DQN), a framework to integrate hierarchical action-value functions, operating at different temporal scales, with goal-driven intrinsically motivated deep reinforcement learning. A top-level q-value function learns a policy over intrinsic goals, while a lower-level function learns a policy over atomic actions to satisfy the given goals. h-DQN allows for flexible goal specifications, such as functions over entities and relations. This provides an efficient space for exploration in complicated environments. We demonstrate the strength of our approach on two problems with very sparse and delayed feedback: (1) a complex discrete stochastic decision process with stochastic transitions, and (2) the classic ATARI game -- `Montezuma's Revenge'.", "citation": "Citations (190)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Tejas D. Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni:Tejas_D=", "Karthik Narasimhan.....http://dblp.org/pers/hd/n/Narasimhan:Karthik", "Ardavan Saeedi.....http://dblp.org/pers/hd/s/Saeedi:Ardavan", "Josh Tenenbaum.....http://dblp.org/pers/hd/t/Tenenbaum:Josh"], "conf": "nips", "year": "2016", "pages": 9}