{"title": "Revisit of automatic debugging via human focus-tracking analysis.", "fields": ["debugging", "helpfulness", "software bug", "algorithmic program debugging", "fault detection and isolation"], "abstract": "In many fields of software engineering, studies on human behavior have attracted a lot of attention; however, few such studies exist in automated debugging. Parnin and Orso conducted a pioneering study comparing the performance of programmers in debugging with and without a ranking-based fault localization technique, namely Spectrum-Based Fault Localization (SBFL). In this paper, we revisit the actual helpfulness of SBFL, by addressing some major problems that were not resolved in Parnin and Orso’s study. Our investigation involved 207 participants and 17 debugging tasks. A user-friendly SBFL tool was adopted. It was found that SBFL tended not to be helpful in improving the efficiency of debugging. By tracking and analyzing programmers’ focus of attention, we characterized their source code navigation patterns and provided in-depth explanations to the observations. Results indicated that (1) a short “first scan” on the source code tended to result in inefficient debugging; and (2) inspections on the pinpointed statements during the “follow-up browsing” were normally just quick skimming. Moreover, we found that the SBFL assistance may even slightly weaken programmers’ abilities in fault detection. Our observations imply interference between the mechanism of automated fault localization and the actual assistance needed by programmers in debugging. To resolve this interference, we provide several insights and suggestions.", "citation": "Citations (11)", "departments": ["Wuhan University", "Nanjing University", "Nanjing University", "Nanjing University", "Wuhan University"], "authors": ["Xiaoyuan Xie.....http://dblp.org/pers/hd/x/Xie:Xiaoyuan", "Zicong Liu.....http://dblp.org/pers/hd/l/Liu:Zicong", "Shuo Song.....http://dblp.org/pers/hd/s/Song:Shuo", "Zhenyu Chen.....http://dblp.org/pers/hd/c/Chen_0001:Zhenyu", "Jifeng Xuan.....http://dblp.org/pers/hd/x/Xuan:Jifeng", "Baowen Xu.....http://dblp.org/pers/hd/x/Xu:Baowen"], "conf": "icse", "year": "2016", "pages": 12}