{"title": "Jamming attack on in-band full-duplex communications: Detection and countermeasures.", "fields": ["duplex", "transmitter", "frequency hopping spread spectrum", "hop", "telecommunications link"], "abstract": "Recent advances in the design of in-band full-duplex (IBFD) radios promise to double the throughput of a wireless link. However, IBFD-capable nodes are more vulnerable to jamming attacks than their out-of-band full-duplex (OBFD) counterparts, and any advantages offered by them over the OBFD nodes can be jeopardized by such attacks. A jammer needs to attack both the uplink and the downlink channels to completely break the communication link between two OBFD nodes. In contrast, he only needs to jam one channel (used for both uplink and downlink) in the case of two IBFD nodes. Even worse, a jammer with the IBFD capability can learn the transmitters' activity while injecting interference, allowing it to react instantly with the transmitter's strategies. In this paper, we investigate frequency hopping (FH) technique for countering jamming attacks in the context of IBFD wireless radios. Specifically, we develop an optimal strategy for IBFD radios to combat an “IBFD reactive sweep jammer”. First, we introduce two operational modes for IBFD radios: transmission reception and transmission-detection. These modes are intended to boost the anti-jamming capability of IBFD radios. We then jointly optimize the decision of when to switch between the modes and when to hop to a new channel using Markov decision processes. Numerical investigations show that our policy significantly improves the throughput of IBFD nodes under jamming attacks.", "citation": "Citations (3)", "departments": ["Indian Institute of Technology Bombay", "University of Arizona", "FEIT, UTS, Svdnev. Australia"], "authors": ["Manjesh Kumar Hanawal.....http://dblp.org/pers/hd/h/Hanawal:Manjesh_Kumar", "Diep N. Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Diep_N=", "Marwan Krunz.....http://dblp.org/pers/hd/k/Krunz:Marwan"], "conf": "infocom", "year": "2016", "pages": 9}