{"title": "The role of interaction in virtual embodiment: Effects of the virtual hand representation.", "fields": ["grasp", "immersion", "cave automatic virtual environment", "instructional simulation", "sense of agency"], "abstract": "How do people appropriate their virtual hand representation when interacting in virtual environments? In order to answer this question, we conducted an experiment studying the sense of embodiment when interacting with three different virtual hand representations, each one providing a different degree of visual realism but keeping the same control mechanism. The main experimental task was a Pick-and-Place task in which participants had to grasp a virtual cube and place it to an indicated position while avoiding an obstacle (brick, barbed wire or fire). An additional task was considered in which participants had to perform a potentially dangerous operation towards their virtual hand: place their virtual hand close to a virtual spinning saw. Both qualitative measures and questionnaire data were gathered in order to assess the sense of agency and ownership towards each virtual hand. Results show that the sense of agency is stronger for less realistic virtual hands which also provide less mismatch between the participant's actions and the animation of the virtual hand. In contrast, the sense of ownership is increased for the human virtual hand which provides a direct mapping between the degrees of freedom of the real and virtual hand.", "citation": "Citations (57)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "authors": ["Ferran Argelaguet.....http://dblp.org/pers/hd/a/Argelaguet:Ferran", "Ludovic Hoyet.....http://dblp.org/pers/hd/h/Hoyet:Ludovic", "Michael Trico.....http://dblp.org/pers/hd/t/Trico:Michael", "Anatole Lécuyer.....http://dblp.org/pers/hd/l/L=eacute=cuyer:Anatole"], "conf": "vr", "year": "2016", "pages": 8}