{"title": "DiagDroid: Android performance diagnosis via anatomizing asynchronous executions.", "fields": ["android", "profiling", "asynchronous communication", "concurrency", "granularity"], "abstract": "Rapid UI responsiveness is a key consideration to Android app developers. However, the complicated concurrency model of Android makes it hard for developers to understand and further diagnose the UI performance. This paper presents DiagDroid, a tool specifically designed for Android UI performance diagnosis. The key notion of DiagDroid is that UI-triggered asynchronous executions contribute to the UI performance, and hence their performance and their runtime dependency should be properly captured to facilitate performance diagnosis. However, there are tremendous ways to start asynchronous executions, posing a great challenge to profiling such executions and their runtime dependency. To this end, we properly abstract five categories of asynchronous executions as the building basis. As a result, they can be tracked and profiled based on the specifics of each category with a dynamic instrumentation approach carefully tailored for Android. DiagDroid can then accordingly profile the asynchronous executions in a task granularity, equipping it with low-overhead and high compatibility merits. The tool is successfully applied in diagnosing 33 real-world open-source apps, and we find 14 of them contain 27 performance issues. It shows the effectiveness of our tool in Android UI performance diagnosis. The tool is open-source released online.", "citation": "Citations (4)", "departments": ["The Chinese University of Hong Kong", "Fudan University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "authors": ["Yu Kang.....http://dblp.org/pers/hd/k/Kang:Yu", "Yangfan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yangfan", "Hui Xu.....http://dblp.org/pers/hd/x/Xu:Hui", "Michael R. Lyu.....http://dblp.org/pers/hd/l/Lyu:Michael_R="], "conf": "sigsoft", "year": "2016", "pages": 12}