{"title": "Strong Non-Interference and Type-Directed Higher-Order Masking.", "fields": ["probabilistic logic", "power analysis", "information flow", "adversary", "formal verification"], "abstract": "Differential power analysis (DPA) is a side-channel attack in which an adversary retrieves cryptographic material by measuring and analyzing the power consumption of the device on which the cryptographic algorithm under attack executes. An effective countermeasure against DPA is to mask secrets by probabilistically encoding them over a set of shares, and to run masked algorithms that compute on these encodings. Masked algorithms are often expected to provide, at least, a certain level of probing security. Leveraging the deep connections between probabilistic information flow and probing security, we develop a precise, scalable, and fully automated methodology to verify the probing security of masked algorithms, and generate them from unprotected descriptions of the algorithm. Our methodology relies on several contributions of independent interest, including a stronger notion of probing security that supports compositional reasoning, and a type system for enforcing an expressive class of probing policies. Finally, we validate our methodology on examples that go significantly beyond the state-of-the-art.", "citation": "Citations (19)", "year": "2016", "departments": ["IMDEA", "Thales Communications", "IMDEA", "University of Rennes", "French Institute for Research in Computer Science and Automation"], "conf": "ccs", "authors": ["Gilles Barthe.....http://dblp.org/pers/hd/b/Barthe:Gilles", "Sonia Belaïd.....http://dblp.org/pers/hd/b/Bela=iuml=d:Sonia", "François Dupressoir.....http://dblp.org/pers/hd/d/Dupressoir:Fran=ccedil=ois", "Pierre-Alain Fouque.....http://dblp.org/pers/hd/f/Fouque:Pierre=Alain", "Benjamin Grégoire.....http://dblp.org/pers/hd/g/Gr=eacute=goire:Benjamin", "Pierre-Yves Strub.....http://dblp.org/pers/hd/s/Strub:Pierre=Yves", "Rébecca Zucchini.....http://dblp.org/pers/hd/z/Zucchini:R=eacute=becca"], "pages": 14}