{"title": "An empirical investigation into the nature of test smells.", "fields": ["mining software repositories", "phenomenon", "code smell", "code refactoring", "software system"], "abstract": "Test smells have been defined as poorly designed tests and, as reported by recent empirical studies, their presence may negatively affect comprehension and maintenance of test suites. Despite this, there are no available automated tools to support identification and repair of test smells. In this paper, we firstly investigate developers' perception of test smells in a study with 19 participants. The results show that developers generally do not recognize (potentially harmful) test smells, highlighting that automated tools for identifying such smells are much needed. However, to build effective tools, deeper insights into the test smells phenomenon are required. To this aim, we conducted a large-scale empirical investigation aimed at analyzing (i) when test smells occur in source code, (ii) what their survivability is, and (iii) whether their presence is associated with the presence of design problems in production code (code smells). The results indicate that test smells are usually introduced when the corresponding test code is committed in the repository for the first time, and they tend to remain in a system for a long time. Moreover, we found various unexpected relationships between test and code smells. Finally, we show how the results of this study can be used to build effective automated tools for test smell detection and refactoring.", "citation": "Citations (15)", "departments": ["College of William & Mary", "University of Salerno", "University of Lugano", "University of Sannio", "University of Molise"], "authors": ["Michele Tufano.....http://dblp.org/pers/hd/t/Tufano:Michele", "Fabio Palomba.....http://dblp.org/pers/hd/p/Palomba:Fabio", "Gabriele Bavota.....http://dblp.org/pers/hd/b/Bavota:Gabriele", "Massimiliano Di Penta.....http://dblp.org/pers/hd/p/Penta:Massimiliano_Di", "Rocco Oliveto.....http://dblp.org/pers/hd/o/Oliveto:Rocco", "Andrea De Lucia.....http://dblp.org/pers/hd/l/Lucia:Andrea_De", "Denys Poshyvanyk.....http://dblp.org/pers/hd/p/Poshyvanyk:Denys"], "conf": "kbse", "year": "2016", "pages": 12}