{"title": "The Evolution of Engagements and Social Bonds During Child-Parent Co-design.", "fields": ["engineering design process", "co design", "management science", "participatory design", "bond"], "abstract": "Partnering with parents and children in the design process can be important for producing technologies that take into consideration the rich context of family life. However, to date, few studies have examined the actual process of designing with families and their children. Without understanding the process, we risk making poor design choices in user-interactive experiences that take into account important family dynamics. The purpose of this investigation is to understand how parent-child relationships in families shape co-design processes and how they are reshaped through co-design. We document the evolutionary process and outcomes that exist in co-design partnerships between researchers and families. We found that parents' engagement patterns shifted more slowly than that of children's from observing and facilitating to design partnering practices. Our analysis suggests the importance of establishing and nurturing social bonds among parents, children, and researchers in the co-design process.", "citation": "Citations (8)", "year": "2016", "departments": ["University of Washington", "University of Maryland, College Park", "University of Maryland, College Park", "Carnegie Mellon University", "University of Maryland, College Park"], "conf": "chi", "authors": ["Jason C. Yip.....http://dblp.org/pers/hd/y/Yip:Jason_C=", "Tamara L. Clegg.....http://dblp.org/pers/hd/c/Clegg:Tamara_L=", "June Ahn.....http://dblp.org/pers/hd/a/Ahn:June", "Judith Odili Uchidiuno.....http://dblp.org/pers/hd/u/Uchidiuno:Judith_Odili", "Elizabeth Bonsignore.....http://dblp.org/pers/hd/b/Bonsignore:Elizabeth", "Austin Beck.....http://dblp.org/pers/hd/b/Beck:Austin", "Daniel Pauw.....http://dblp.org/pers/hd/p/Pauw:Daniel", "Kelly Mills.....http://dblp.org/pers/hd/m/Mills:Kelly"], "pages": 13}