{"title": "Kraken: Leveraging Live Traffic Tests to Identify and Resolve Resource Utilization Bottlenecks in Large Scale Web Services.", "fields": ["data center", "user experience design", "component based software engineering", "workload", "performance tuning"], "abstract": "Modern web services such as Facebook are made up of hundreds of systems running in geographically-distributed data centers. Each system needs to be allocated capacity, configured, and tuned to use data center resources efficiently. Keeping a model of capacity allocation current is challenging given that user behavior and software components evolve constantly.\n\nThree insights motivate our work: (1) the live user traffic accessing a web service provides the most current target workload possible, (2) we can empirically test the system to identify its scalability limits, and (3) the user impact and operational overhead of empirical testing can be largely eliminated by building automation which adjusts live traffic based on feedback.\n\nWe build on these insights in Kraken, a new system that runs load tests by continually shifting live user traffic to one or more data centers. Kraken enables empirical testing by monitoring user experience (e.g., latency) and system health (e.g., error rate) in a feedback loop between traffic shifts. We analyze the behavior of individual systems and groups of systems to identify resource utilization bottlenecks such as capacity, load balancing, software regressions, performance tuning, and so on, which can be iteratively fixed and verified in subsequent load tests. Kraken, which manages the traffic generated by 1.7 billion users, has been in production at Facebook for three years and has allowed us to improve our hardware utilization by over 20%.", "citation": "Citations (9)", "year": "2016", "departments": ["Facebook", "Facebook", "Facebook", "Facebook", "Facebook"], "conf": "osdi", "authors": ["Kaushik Veeraraghavan.....http://dblp.org/pers/hd/v/Veeraraghavan:Kaushik", "Justin Meza.....http://dblp.org/pers/hd/m/Meza:Justin", "David Chou.....http://dblp.org/pers/hd/c/Chou:David", "Wonho Kim.....http://dblp.org/pers/hd/k/Kim:Wonho", "Sonia Margulis.....http://dblp.org/pers/hd/m/Margulis:Sonia", "Scott Michelson.....http://dblp.org/pers/hd/m/Michelson:Scott", "Rajesh Nishtala.....http://dblp.org/pers/hd/n/Nishtala:Rajesh", "Daniel Obenshain.....http://dblp.org/pers/hd/o/Obenshain:Daniel", "Dmitri Perelman.....http://dblp.org/pers/hd/p/Perelman:Dmitri", "Yee Jiun Song.....http://dblp.org/pers/hd/s/Song:Yee_Jiun"], "pages": 17}