{"title": "Towards Convolutional Neural Networks Compression via Global Error Reconstruction.", "fields": ["fold", "singular value decomposition", "convolutional neural network", "implementation", "contextual image classification"], "abstract": "In recent years, convolutional neural networks (CNNs) have achieved remarkable success in various applications such as image classification, object detection, object parsing and face alignment. Such CNN models are extremely powerful to deal with massive amounts of training data by using millions and billions of parameters. However, these models are typically deficient due to the heavy cost in model storage, which prohibits their usage on resource-limited applications like mobile or embedded devices. In this paper, we target at compressing CNN models to an extreme without significantly losing their discriminability. Our main idea is to explicitly model the output reconstruction error between the original and compressed CNNs, which error is minimized to pursuit a satisfactory rate-distortion after compression. In particular, a global error reconstruction method termed GER is presented, which firstly leverages an SVD-based low-rank approximation to coarsely compress the parameters in the fully connected layers in a layerwise manner. Subsequently, such layer-wise initial compressions are jointly optimized in a global perspective via back-propagation. The proposed GER method is evaluated on the ILSVRC2012 image classification benchmark, with implementations on two widely-adopted convolutional neural networks, i.e., the AlexNet and VGGNet-19. Comparing to several state-of-the-art and alternative methods of CNN compression, the proposed scheme has demonstrated the best rate-distortion performance on both networks.", "citation": "Citations (4)", "year": "2016", "departments": ["Xiamen University", "Xiamen University", "Tencent", "Chinese Academy of Sciences"], "conf": "ijcai", "authors": ["Shaohui Lin.....http://dblp.org/pers/hd/l/Lin:Shaohui", "Rongrong Ji.....http://dblp.org/pers/hd/j/Ji:Rongrong", "Xiaowei Guo.....http://dblp.org/pers/hd/g/Guo:Xiaowei", "Xuelong Li.....http://dblp.org/pers/hd/l/Li:Xuelong"], "pages": 7}