{"title": "Tolerating correlated failures in Massively Parallel Stream Processing Engines.", "fields": ["stream processing", "latency", "massively parallel", "backup", "real time computing"], "abstract": "Fault-tolerance techniques for stream processing engines can be categorized into passive and active approaches. A typical passive approach periodically checkpoints a processing task's runtime states and can recover a failed task by restoring its runtime state using its latest checkpoint. On the other hand, an active approach usually employs backup nodes to run replicated tasks. Upon failure, the active replica can take over the processing of the failed task with minimal latency. However, both approaches have their own inadequacies in Massively Parallel Stream Processing Engines (MPSPE). The passive approach incurs a long recovery latency especially when a number of correlated nodes fail simultaneously, while the active approach requires extra replication resources. In this paper, we propose a new fault-tolerance framework, which is Passive and Partially Active (PPA). In a PPA scheme, the passive approach is applied to all tasks while only a selected set of tasks will be actively replicated. The number of actively replicated tasks depends on the available resources. If tasks without active replicas fail, tentative outputs will be generated before the completion of the recovery process. We also propose effective and efficient algorithms to optimize a partially active replication plan to maximize the quality of tentative outputs. We implemented PPA on top of Storm, an open-source MPSPE and conducted extensive experiments using both real and synthetic datasets to verify the effectiveness of our approach.", "citation": "Citations (6)", "departments": ["University of Southern Denmark", "University of Southern Denmark"], "authors": ["Li Su.....http://dblp.org/pers/hd/s/Su:Li", "Yongluan Zhou.....http://dblp.org/pers/hd/z/Zhou:Yongluan"], "conf": "icde", "year": "2016", "pages": 12}