{"title": "Fast and Accurate Refined Nyström-Based Kernel SVM.", "fields": ["kernel", "time complexity", "support vector machine", "mathematical optimization", "machine learning"], "abstract": "In this paper, we focus on improving the performance of the Nystrom based kernel SVM. Although the Nystrom approximation has been studied extensively and its application to kernel classification has been exhibited in several studies, there still exists a potentially large gap between the performance of classifier learned with the Nystrom approximation and that learned with the original kernel. In this work, we make novel contributions to bridge the gap without increasing the training costs too much by proposing a refined Nystrom based kernel classifier. We adopt a two-step approach that in the first step we learn a sufficiently good dual solution and in the second step we use the obtained dual solution to construct a new set of bases for the Nystrom approximation to re-train a refined classifier. Our approach towards learning a good dual solution is based on a sparse-regularized dual formulation with the Nystrom approximation, which can be solved with the same time complexity as solving the standard formulation. We justify our approach by establishing a theoretical guarantee on the error of the learned dual solution in the first step with respect to the optimal dual solution under appropriate conditions. The experimental results demonstrate that (i) the obtained dual solution by our approach in the first step is closer to the optimal solution and yields improved prediction performance; and (ii) the second step using the obtained dual solution to re-train the model further improves the performance.", "citation": "Not cited", "departments": ["University of Iowa", "University of Iowa", "Nanjing University", "Alibaba Group"], "authors": ["Zhe Li.....http://dblp.org/pers/hd/l/Li:Zhe", "Tianbao Yang.....http://dblp.org/pers/hd/y/Yang:Tianbao", "Lijun Zhang.....http://dblp.org/pers/hd/z/Zhang_0005:Lijun", "Rong Jin.....http://dblp.org/pers/hd/j/Jin:Rong"], "conf": "aaai", "year": "2016", "pages": 7}