{"title": "Modeling, performance analysis, and optimization of single hop IEEE 802.11 networks with large propagation delays: Challenges and solutions.", "fields": ["stochastic modelling", "collision", "ieee 802 11", "propagation delay", "hop"], "abstract": "We consider single-hop topologies with saturated transmitting nodes, using IEEE 802.11 DCF for medium access, where the propagation delays among the nodes are not negligible compared to the backoff slot duration. In this situation, we find that there is misaligned sensing of channel idleness, and also short-term unfairness in access to the medium. We demonstrate that existing analysis techniques (or, extensions thereof) are unable to account for these features, resulting in inaccurate prediction of the performance. Focusing on the case in which transmitters are equidistant from one another, and also each receiver is equidistant from all the transmitters, we provide a detailed stochastic model that accurately captures the system evolution. Since an exact analysis of this model is computationally intractable, we develop a novel approximate, but accurate, analysis that uses a parsimonious state representation for computational tractability. Numerical experiments show, the approximate analysis predicts the system throughput to a relative accuracy of 2–3%, and collision probabilities to a relative accuracy of 3–8% compared to simulations. Interestingly, we observe that as propagation delay increases, the collision probability of a node initially increases, but then flattens out, contrary to what one might intuitively expect. Finally, we also demonstrate how to optimize slot duration using the approximate analysis for maximizing system throughput.", "citation": "Not cited", "departments": ["Indian Institute of Science", "Indian Institute of Science"], "authors": ["Abhijit Bhattacharya.....http://dblp.org/pers/hd/b/Bhattacharya:Abhijit", "Anurag Kumar.....http://dblp.org/pers/hd/k/Kumar_0001:Anurag"], "conf": "infocom", "year": "2016", "pages": 9}