{"title": "DR-ABC: Approximate Bayesian Computation with Kernel-Based Distribution Regression.", "fields": ["kernel", "bayesian linear regression", "likelihood function", "marginal likelihood", "generative model"], "abstract": "Performing exact posterior inference in complex generative models is often difficult or impossible due to an expensive to evaluate or intractable likelihood function. Approximate Bayesian computation (ABC) is an inference framework that constructs an approximation to the true likelihood based on the similarity between the observed and simulated data as measured by a predefined set of summary statistics. Although the choice of informative problem-specific summary statistics crucially influences the quality of the likelihood approximation and hence also the quality of the posterior sample in ABC, there are only few principled general-purpose approaches to the selection or construction of such summary statistics. In this paper, we develop a novel framework for solving this problem. We model the functional relationship between the data and the optimal choice (with respect to a loss function) of summary statistics using kernel-based distribution regression. Furthermore, we extend our approach to incorporate kernel-based regression from conditional distributions, thus appropriately taking into account the specific structure of the posited generative model. We show that our approach can be implemented in a computationally and statistically efficient way using the random Fourier features framework for large-scale kernel learning. In addition to that, our framework outperforms related methods by a large margin on toy and real-world data, including hierarchical and time series models.", "citation": "Citations (6)", "year": "2016", "departments": ["University of Oxford", "University of Oxford", "University of Oxford"], "conf": "icml", "authors": ["Jovana Mitrovic.....http://dblp.org/pers/hd/m/Mitrovic:Jovana", "Dino Sejdinovic.....http://dblp.org/pers/hd/s/Sejdinovic:Dino", "Yee Whye Teh.....http://dblp.org/pers/hd/t/Teh:Yee_Whye"], "pages": 10}