{"title": "Spheres of Influence for More Effective Viral Marketing.", "fields": ["set cover problem", "multiplicative function", "cascade", "maximization", "jaccard index"], "abstract": "What is the set of nodes of a social network that, under a probabilistic contagion model, would get infected if a given node $s$ gets infected? We call this set the  sphere of influence  of s. Due to the stochastic nature of the contagion model we need to define a notion of \"expected\" or \"typical\" cascade: this is a set of nodes which is the closest to all the possible cascades starting from s. We thus formalize the  Typical Cascade  problem which requires, for a given source node s, to find the set of nodes minimizing the expected Jaccard distance to all the possible cascades from s. The expected cost of a typical cascade also provides us a measure of the  stability  of cascade propagation, i.e., how much random cascades from a source node s deviate from the \"typical\" cascade. In this sense source nodes with lower expected costs are more reliable.   We show that, while computing the quality of a candidate solution is SPhard, a method based on (1) sampling random cascades and (2) computing their Jaccard Median, can obtain a multiplicative approximation with just O(1) samples. We then devise an index that allows to efficiently compute the sphere of influence for any node in the network.   Finally, we propose to approach the influence maximization problem as an instance of set cover on the spheres of influence. Through exhaustive evaluation using real-world networks and different methods of assigning the influence probability to each edge, we show that our approach  outperforms in quality  the theoretically optimal greedy algorithm.", "citation": "Citations (2)", "year": "2016", "departments": ["Pompeu Fabra University", "Institute for Scientific Interchange", "Eurecat, Barcelona, Spain"], "conf": "sigmod", "authors": ["Yasir Mehmood.....http://dblp.org/pers/hd/m/Mehmood:Yasir", "Francesco Bonchi.....http://dblp.org/pers/hd/b/Bonchi:Francesco", "David García-Soriano.....http://dblp.org/pers/hd/g/Garc=iacute=a=Soriano:David"], "pages": 16}