{"title": "Towards Stream Ciphers for Efficient FHE with Low-Noise Ciphertexts.", "fields": ["key schedule", "correlation attack", "stream cipher attack", "differential cryptanalysis", "t function"], "abstract": "Symmetric ciphers purposed for Fully Homomorphic Encryption FHE have recently been proposed for two main reasons. First, minimizing the implementation time and memory overheads that are inherent to current FHE schemes. Second, improving the homomorphic capacity, i.e. the amount of operations that one can perform on homomorphic ciphertexts before bootstrapping, which amounts to limit their level of noise. Existing solutions for this purpose suggest a gap between block ciphers and stream ciphers. The first ones typically allow a constant but small homomorphic capacity, due to the iteration of rounds eventually leading to complex Boolean functions hence large noise. The second ones typically allow a larger homomorphic capacity for the first ciphertext blocks, that decreases with the number of ciphertext blocks due to the increasing Boolean complexity of the stream ciphers' output. In this paper, we aim to combine the best of these two worlds, and propose a new stream cipher construction that allows constant and smaller noise. Its main idea is to apply a Boolean filter function to a public bit permutation of a constant key register, so that the Boolean complexity of the stream cipher outputs is constant. We also propose an instantiation of the filter function designed to exploit recent 3rd-generation FHE schemes, where the error growth is quasi-additive when adequately multiplying ciphertexts with the same amount of noise. In order to stimulate further investigation, we then specify a few instances of this stream cipher, for which we provide a preliminary security analysis. We finally highlight the good properties of our stream cipher regarding the other goal of minimizing the time and memory complexity of calculus delegation for 2nd-generation FHEi¾?schemes. We conclude the paper with open problems related to the large design space opened by these new constructions.", "citation": "Citations (14)", "year": "2016", "departments": ["PSL Research University", "Université catholique de Louvain", "Université catholique de Louvain", "Paris 8 University"], "conf": "eurocrypt", "authors": ["Pierrick Méaux.....http://dblp.org/pers/hd/m/M=eacute=aux:Pierrick", "Anthony Journault.....http://dblp.org/pers/hd/j/Journault:Anthony", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier", "Claude Carlet.....http://dblp.org/pers/hd/c/Carlet:Claude"], "pages": 33}