{"title": "Floating-point precision tuning using blame analysis.", "fields": ["operand", "floating point", "program optimization", "extended precision", "speedup"], "abstract": "While tremendously useful, automated techniques for tuning the precision of floating-point programs face important scalability challenges. We present Blame Analysis, a novel dynamic approach that speeds up precision tuning. Blame Analysis performs floating-point instructions using different levels of accuracy for their operands. The analysis determines the precision of all operands such that a given precision is achieved in the final result of the program. Our evaluation on ten scientific programs shows that Blame Analysis is successful in lowering operand precision. As it executes the program only once, the analysis is particularly useful when targeting reductions in execution time. In such case, the analysis needs to be combined with search-based tools such as Precimonious. Our experiments show that combining Blame Analysis with Precimonious leads to obtaining better results with significant reduction in analysis time: the optimized programs execute faster (in three cases, we observe as high as 39.9% program speedup) and the combined analysis time is 9 x  faster on average, and up to 38 x  faster than Precimonious alone.", "citation": "Citations (11)", "departments": ["University of California, Davis", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "authors": ["Cindy Rubio-González.....http://dblp.org/pers/hd/r/Rubio=Gonz=aacute=lez:Cindy", "Cuong Nguyen.....http://dblp.org/pers/hd/n/Nguyen_0001:Cuong", "Benjamin Mehne.....http://dblp.org/pers/hd/m/Mehne:Benjamin", "Koushik Sen.....http://dblp.org/pers/hd/s/Sen:Koushik", "James Demmel.....http://dblp.org/pers/hd/d/Demmel:James", "William Kahan.....http://dblp.org/pers/hd/k/Kahan:William", "Costin Iancu.....http://dblp.org/pers/hd/i/Iancu:Costin", "Wim Lavrijsen.....http://dblp.org/pers/hd/l/Lavrijsen:Wim", "David H. Bailey.....http://dblp.org/pers/hd/b/Bailey:David_H=", "David Hough.....http://dblp.org/pers/hd/h/Hough:David"], "conf": "icse", "year": "2016", "pages": 12}