{"title": "Cinematic virtual reality: Evaluating the effect of display type on the viewing experience for panoramic video.", "fields": ["peripheral", "narrative", "virtual reality", "spatial contextual awareness", "incidental memory"], "abstract": "The proliferation of head-mounted displays (HMD) in the market means that cinematic virtual reality (CVR) is an increasingly popular format. We explore several metrics that may indicate advantages and disadvantages of CVR compared to traditional viewing formats such as TV. We explored the consumption of panoramic videos in three different display systems: a HMD, a SurroundVideo+ (SV+), and a standard 16:9 TV. The SV+ display features a TV with projected peripheral content. A between-groups experiment of 63 participants was conducted, in which participants watched panoramic videos in one of these three display conditions. Aspects examined in the experiment were spatial awareness, narrative engagement, enjoyment, memory, fear, attention, and a viewer's concern about missing something. Our results indicated that the HMD offered a significant benefit in terms of enjoyment and spatial awareness, and our SV+ display offered a significant improvement in enjoyment over traditional TV. We were unable to confirm the work of a previous study that showed incidental memory may be lower in a HMD over a TV. Drawing attention and a viewer's concern about missing something were also not significantly different between display conditions. It is clear that passive media viewing consists of a complex interplay of factors, such as the media itself, the characteristics of the display, as well as human aspects including perception and attention. While passive media viewing presents many challenges for evaluation, identifying a number of broadly applicable metrics will aid our understanding of these experiences, and allow the creation of better, more engaging CVR content and displays.", "citation": "Citations (12)", "departments": ["University College London", "University College London"], "authors": ["Andrew MacQuarrie.....http://dblp.org/pers/hd/m/MacQuarrie:Andrew", "Anthony Steed.....http://dblp.org/pers/hd/s/Steed:Anthony"], "conf": "vr", "year": "2017", "pages": 10}