{"title": "Keep your nice friends close, but your rich friends closer - Computation offloading using NFC.", "fields": ["encryption", "near field communication", "computation offloading", "mobile cloud computing", "bluetooth"], "abstract": "The increasing complexity of smartphone applications and services necessitate high battery consumption but the growth of smartphones' battery capacity is not keeping pace with these increasing power demands. To overcome this problem, researchers gave birth to the Mobile Cloud Computing (MCC) research area. In this paper we advance on previous ideas, by proposing and implementing the first known Near Field Communication (NFC)-based computation offloading framework. This research is motivated by the advantages of NFC's short distance communication, with its better security, and its low battery consumption. We design a new NFC communication protocol that overcomes the limitations of the default protocol; removing the need for constant user interaction, the one-way communication restraint, and the limit on low data size transfer. We present experimental results of the energy consumption and the time duration of two computationally intensive representative applications: (i) RSA key generation and encryption, and (ii) gaming/puzzles. We show that when the helper device is more powerful than the device offloading the computations, the execution time of the tasks is reduced. Finally, we show that devices that offload application parts considerably reduce their energy consumption due to the low-power NFC interface and the benefits of offloading.", "citation": "Citations (2)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Aalborg University – Copenhagen", "Hong Kong University of Science and Technology"], "authors": ["Kathleen Sucipto.....http://dblp.org/pers/hd/s/Sucipto:Kathleen", "Dimitris Chatzopoulos.....http://dblp.org/pers/hd/c/Chatzopoulos:Dimitris", "Sokol Kosta.....http://dblp.org/pers/hd/k/Kosta:Sokol", "Pan Hui.....http://dblp.org/pers/hd/h/Hui:Pan"], "conf": "infocom", "year": "2017", "pages": 9}