{"title": "QDLCoding: QoS-differentiated low-cost video encoding scheme for online video service.", "fields": ["online algorithm", "encoding", "computation", "capacity planning", "server"], "abstract": "Adaptive bitrate (ABR) streaming is the de facto solution in online video services to cope with heterogeneous devices and varying network connections. However, this solution is computation intensive, demanding a large number of servers for encoding videos. Moreover, due to the time-varying nature of video generation, intelligent strategies are required in order to determine the right amount of resources for encoding. The situation is further complicated by the fact that, the two types of co-existing video content, live content and Video-on-Demand (VoD) content, have different QoS requirements for encoding. These observations posit daunting challenges for meeting the heterogeneous QoS requirements with a minimum computing capacity. This paper proposes the QoS-differentiated low-cost video encoding (QDLCoding) scheme to address these challenges. We develop a framework for scheduling the encoding workloads of the two types of videos with statistical QoS guarantees. Each type of videos is specified with a QoS criterion and a QoS loss bound. The objective is to provision the minimum amount of resources while keeping the QoS loss probabilities within the prescribed bounds. We design an online algorithm that can determine the minimum required capacity by learning content arrival distributions. The experiment results demonstrate that our method can greatly reduce the required capacity for encoding online videos while controlling the likelihood of QoS loss precisely.", "citation": "Citations (1)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Interdisciplina ... Graduate School"], "authors": ["Guanyu Gao.....http://dblp.org/pers/hd/g/Gao:Guanyu", "Yonggang Wen.....http://dblp.org/pers/hd/w/Wen:Yonggang", "Han Hu.....http://dblp.org/pers/hd/h/Hu_0003:Han"], "conf": "infocom", "year": "2017", "pages": 9}