{"title": "Multi-tenant multi-objective bandwidth allocation in datacenters using stacked congestion control.", "fields": ["temporal isolation among virtual machines", "bandwidth allocation", "bandwidth management", "dynamic bandwidth allocation", "channel allocation schemes"], "abstract": "In datacenter networks, flows can have different performance objectives. We use a tenant-objective division to denote all flows of a tenant that share the same objective. Bandwidth allocation in datacenters should support not only performance isolation among divisions but also objective-oriented scheduling among flows within the same division. This paper studies the Multi-Tenant Multi-Objective (MT-MO) bandwidth allocation problem. To our best knowledge, no existing practical work support performance isolation and objective scheduling simultaneously. We propose Stacked Congestion Control (SCC), a distributed host-based bandwidth allocation design, where an underlay congestion control (UCC) layer handles contention among divisions, and a private congestion control (PCC) layer for each division optimizes its performance objective. Via the tenant-objective tunnel abstraction, SCC achieves weighted bandwidth sharing for each division in a distributed and transparent way. By adding a rate-limiting send queue in the ingress of each tunnel, mechanisms between performance isolation and objective scheduling are completely decoupled. We evaluate SCC both on a small-scale testbed and with large-scale NS-2 simulations. Compared to the direct coexistence cases, SCC reduces latency by up to 40% for Latency-Sensitive flows, deadline miss ratio by up to 3.2× for Deadline-Sensitive flows, and average flow-completion-time by up to 53% for Completion-Sensitive flows.", "citation": "Citations (2)", "departments": ["Nanjing University", "Michigan State University", "Nanjing University", "University of California, Irvine", "Nanjing University"], "authors": ["Chen Tian.....http://dblp.org/pers/hd/t/Tian:Chen", "Ali Munir.....http://dblp.org/pers/hd/m/Munir:Ali", "Alex X. Liu.....http://dblp.org/pers/hd/l/Liu:Alex_X=", "Yingtong Liu.....http://dblp.org/pers/hd/l/Liu:Yingtong", "Yanzhao Li.....http://dblp.org/pers/hd/l/Li:Yanzhao", "Jiajun Sun.....http://dblp.org/pers/hd/s/Sun:Jiajun", "Fan Zhang.....http://dblp.org/pers/hd/z/Zhang:Fan", "Gong Zhang.....http://dblp.org/pers/hd/z/Zhang:Gong"], "conf": "infocom", "year": "2017", "pages": 9}