{"title": "CoCloud: Enabling efficient cross-cloud file collaboration based on inefficient web APIs.", "fields": ["data synchronization", "file synchronization", "file system fragmentation", "ssh file transfer protocol", "self certifying file system", "web api", "cloud storage", "metadata"], "abstract": "Cloud storage services such as Dropbox have been widely used for file collaboration among multiple users. However, this desirable functionality is yet restricted to the “walled-garden” of each service. At present, the only effective approach to cross-cloud file collaboration seems to be using web APIs, whose performance is known to be highly unstable and unpredictable. Now that using inefficient web APIs is inevitable, in this paper we attempt to achieve sound user-perceived performance for cross-cloud file collaboration. This attempt is enabled by two key observations from real-world measurements. First, for each cloud, we are always able to deploy one or several nearby (client) proxies which can efficiently access the web APIs. Second, during file collaboration, significant similarity exists among different versions of a file. This can be exploited to substantially reduce inter-proxy traffic and thus shorten the data sync time. Guided by the observations, we design and implement an open-source prototype system called CoCloud. Currently, it supports file collaboration among four popular cloud storage services in the US and China. Its performance is well acceptable to users under representative workloads, even approaching or exceeding intra-cloud performance in many cases.", "citation": "Not cited", "departments": ["Tsinghua University", "Tsinghua University", "Carnegie Mellon University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Carnegie Mellon University", "Tsinghua University", "School of SoftwareTNLIST"], "authors": ["Jinlong E.....http://dblp.org/pers/hd/e/E:Jinlong", "Yong Cui.....http://dblp.org/pers/hd/c/Cui_0001:Yong", "Peng Wang.....http://dblp.org/pers/hd/w/Wang:Peng", "Zhenhua Li.....http://dblp.org/pers/hd/l/Li_0001:Zhenhua", "Chaokun Zhang.....http://dblp.org/pers/hd/z/Zhang:Chaokun"], "conf": "infocom", "year": "2017", "pages": 9}