{"title": "Determinant-Preserving Sparsification of SDDM Matrices with Applications to Counting and Sampling Spanning Trees.", "fields": ["tutte polynomial", "minimum spanning tree", "laplacian matrix", "connected dominating set", "tremaux tree"], "abstract": "We show variants of spectral sparsification routines can preserve the totalspanning tree counts of graphs, which by Kirchhoffs matrix-tree theorem, isequivalent to determinant of a graph Laplacian minor, or equivalently, of any SDDM matrix. Our analyses utilizes this combinatorial connection to bridge between statisticalleverage scores / effective resistances and the analysis of random graphsby [Janson, Combinatorics, Probability and Computing 94]. This leads to a routine that in quadratic time, sparsifies a graph down to aboutn^(1.5) edges in ways that preserve both the determinant and the distributionof spanning trees (provided the sparsified graph is viewed as a random object). Extending this algorithm to work with Schur complements and approximateCholesky factorizations leads to algorithms for counting andsampling spanning trees which are nearly optimal for dense graphs.We give an algorithm that computes a (1 +/- δ) approximation to the determinantof any SDDM matrix with constant probability in about n^2 / δ^2 time. This is the first routine for graphs that outperforms general-purpose routines for computingdeterminants of arbitrary matrices. We also give an algorithm that generates in about n^2 / δ^2 time a spanning tree ofa weighted undirected graph from a distribution with total variationdistance of δ from the w-uniform distribution.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Massachusetts Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["David Durfee.....http://dblp.org/pers/hd/d/Durfee:David", "John Peebles.....http://dblp.org/pers/hd/p/Peebles:John", "Richard Peng.....http://dblp.org/pers/hd/p/Peng:Richard", "Anup B. Rao.....http://dblp.org/pers/hd/r/Rao:Anup_B="], "conf": "focs", "year": "2017", "pages": 12}