{"title": "The feasibility of using smartphones to assess and remediate depression in Hispanic/Latino individuals nationally.", "fields": ["socioeconomic status", "mhealth", "digital health", "psychological intervention", "economic shortage"], "abstract": "Mental Health conditions are now amongst the top five burdensome diseases in the US. Disparities in access to services and health outcomes vary due to several factors including socioeconomic status, shortage of mental health professionals, stigma and the linguistic gap between providers and non-English speaking minority population. This study explores the utility of providing Spanish (mono and bilingual) speaking Latino/Hispanics an option to access low-cost yet modern depression assessment and interventions available through smartphones. This is a fully remotely run study in order to investigate access, engagement, costs, and impact in an ecologically valid manner in a \"real life\" setting. The main purpose is to directly address issues of culture and language often overlooked in the digital health space, beginning with a thorough characterization of how these modern tools are perceived, utilized, and digested in the largest minority population in the US.", "citation": "Citations (2)", "departments": ["University of Washington", "University of California, Berkeley", "University of California", "University of Washington", "Sage Bionetworks", "University of California, Berkeley", "University of California"], "authors": ["Abhishek Pratap.....http://dblp.org/pers/hd/p/Pratap:Abhishek", "Joaquin A. Anguera.....http://dblp.org/pers/hd/a/Anguera:Joaquin_A=", "Brenna N. Renn.....http://dblp.org/pers/hd/r/Renn:Brenna_N=", "Elias Chaibub Neto.....http://dblp.org/pers/hd/n/Neto:Elias_Chaibub", "Joshua Volponi.....http://dblp.org/pers/hd/v/Volponi:Joshua", "Sean D. Mooney.....http://dblp.org/pers/hd/m/Mooney:Sean_D=", "Pat A. Areán.....http://dblp.org/pers/hd/a/Are=aacute=n:Pat_A="], "conf": "huc", "year": "2017", "pages": 7}