{"title": "Finding MARLIN: Exploiting multi-modal communications for reliable and low-latency underwater networking.", "fields": ["network packet", "swift", "reinforcement learning", "relay", "low latency"], "abstract": "This paper concerns the smart exploitation of multimodal communication capabilities of underwater nodes to enable reliable and swift underwater networking. To contrast adverse and highly varying channel conditions we define a smart framework enabling nodes to acquire knowledge on the quality of the communication to neighboring nodes over time. Following a model-based reinforcement learning approach, our framework allows senders to select the best forwarding relay for its data jointly with the best communication device to reach that relay. We name the resulting forwarding method MARLIN, for MultimodAl Reinforcement Learning-based RoutINg. Applications can choose whether to seek reliable routes to the destination, or whether faster packet delivery is more desirable. We evaluate the performance of MARLIN in varying networking scenarios where nodes communicate through two acoustic modems with widely different characteristics. MARLIN is compared to state-of-the-art forwarding protocols, including a channel-aware solution, a machine learning-based solution and to a flooding protocol extended to use multiple modems. Our results show that a smartly learned selection of relay and modem is key to obtain a packet delivery ratio that is twice as much that of other protocols, while maintaining low latencies and energy consumption.", "citation": "Citations (4)", "departments": ["Northeastern University", "Sapienza University of Rome", "Sapienza University of Rome", "Sapienza University of Rome"], "authors": ["Stefano Basagni.....http://dblp.org/pers/hd/b/Basagni:Stefano", "Valerio Di Valerio.....http://dblp.org/pers/hd/v/Valerio:Valerio_Di", "Petrika Gjanci.....http://dblp.org/pers/hd/g/Gjanci:Petrika", "Chiara Petrioli.....http://dblp.org/pers/hd/p/Petrioli:Chiara"], "conf": "infocom", "year": "2017", "pages": 9}