{"title": "OnACID: Online Analysis of Calcium Imaging Data in Real Time.", "fields": ["rendering", "machine learning", "calcium imaging", "deconvolution", "optical imaging"], "abstract": "Optical imaging methods using calcium indicators are critical for monitoring the activity of large neuronal populations in vivo. Imaging experiments typically generate a large amount of data that needs to be processed to extract the activity of the imaged neuronal sources. While deriving such processing algorithms is an active area of research, most existing methods require the processing of large amounts of data at a time, rendering them vulnerable to the volume of the recorded data, and preventing real-time experimental interrogation. Here we introduce OnACID, an Online framework for the Analysis of streaming Calcium Imaging Data, including i) motion artifact correction, ii) neuronal source extraction, and iii) activity denoising and deconvolution. Our approach combines and extends previous work on online dictionary learning and calcium imaging data analysis, to deliver an automated pipeline that can discover and track the activity of hundreds of cells in real time, thereby enabling new types of closed-loop experiments. We apply our algorithm on two large scale experimental datasets, benchmark its performance on manually annotated data, and show that it outperforms a popular offline approach.", "citation": "Citations (3)", "year": "2017", "departments": ["Columbia University", "Cold Spring Harbor Laboratory", "Cold Spring Harbor Laboratory", "Flatiron Instit ... mons Foundation", "Simons Foundation"], "conf": "nips", "authors": ["Andrea Giovannucci.....http://dblp.org/pers/hd/g/Giovannucci:Andrea", "Johannes Friedrich.....http://dblp.org/pers/hd/f/Friedrich:Johannes", "Matt Kaufman.....http://dblp.org/pers/hd/k/Kaufman:Matt", "Anne Churchland.....http://dblp.org/pers/hd/c/Churchland:Anne", "Dmitri B. Chklovskii.....http://dblp.org/pers/hd/c/Chklovskii:Dmitri_B=", "Liam Paninski.....http://dblp.org/pers/hd/p/Paninski:Liam", "Eftychios A. Pnevmatikakis.....http://dblp.org/pers/hd/p/Pnevmatikakis:Eftychios_A="], "pages": 11}