{"title": "Authenticated Garbling and Efficient Maliciously Secure Two-Party Computation.", "fields": ["secure two party computation", "authentication", "secure multi party computation", "preprocessor", "computation"], "abstract": "We propose a simple and efficient framework for obtaining efficient constant-round protocols for maliciously secure two-party computation. Our framework uses a function-independent preprocessing phase to generate authenticated information for the two parties; this information is then used to construct a single \"authenticated\" garbled circuit which is transmitted and evaluated. We also show how to efficiently instantiate the preprocessing phase with a new, highly optimized version of the TinyOT protocol by Nielsen et al.   Our protocol outperforms existing work in both the single-execution and amortized settings, with or without preprocessing:   In the single-execution setting, our protocol evaluates an AES circuit with malicious security in 37 ms with an online time of 1 ms. Previous work with the best overall time requires 62 ms (with 14 ms online time); previous work with the best online time (also 1 ms) requires 124 ms overall.  If we amortize over 1024 executions, each AES computation requires just 6.7 ms with roughly the same online time as above. The best previous work in the amortized setting has roughly the same total time but does not support function-independent preprocessing.     Our work shows that the performance penalty for maliciously secure two-party computation (as compared to semi-honest security) is much smaller than previously believed.", "citation": "Citations (9)", "year": "2017", "departments": ["University of Maryland, College Park", "George Mason University", "University of Maryland, College Park"], "conf": "ccs", "authors": ["Xiao Wang.....http://dblp.org/pers/hd/w/Wang_0012:Xiao", "Samuel Ranellucci.....http://dblp.org/pers/hd/r/Ranellucci:Samuel", "Jonathan Katz.....http://dblp.org/pers/hd/k/Katz:Jonathan"], "pages": 17}