{"title": "FEXIPRO: Fast and Exact Inner Product Retrieval in Recommender Systems.", "fields": ["singular value decomposition", "matrix decomposition", "lossless compression", "row and column spaces", "nearest neighbor search"], "abstract": "Recommender systems have many successful applications in e-commerce and social media, including Amazon, Netflix, and Yelp. Matrix Factorization ( MF ) is one of the most popular recommendation approaches; the original user-product rating matrix  R  with millions of rows and columns is decomposed into a user matrix  Q  and an item matrix  P , such that the product  Q T  P  approximates  R . Each column  q (p)  of  Q  (P) holds the latent factors of the corresponding user (item), and  q T  p  is a prediction of the rating to item p by user q. Recommender systems based on  MF  suggest to a user in q the items with the top- k  scores in  q T  P . For this problem, we propose a Fast and EXact Inner PROduct retrieval (FEXIPRO) framework, based on sequential scan, which includes three elements. First, FEXIPRO applies an SVD transformation to  P , after which the first several dimensions capture a large percentage of the inner products. This enables us to prune item vectors by only computing their partial inner products with  q . Second, we construct an integer approximation version of  P , which can be used to compute fast upper bounds for the inner products that can prune item vectors. Finally, we apply a lossless transformation to  P , such that the resulting matrix has only positive values, allowing for the inner products to be monotonically increasing with dimensionality. Experiments on real data demonstrate that our framework outperforms alternative approaches typically by an order of magnitude.", "citation": "Citations (3)", "year": "2017", "departments": ["University of Hong Kong", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "University of Hong Kong"], "conf": "sigmod", "authors": ["Hui Li.....http://dblp.org/pers/hd/l/Li:Hui", "Tsz Nam Chan.....http://dblp.org/pers/hd/c/Chan:Tsz_Nam", "Man Lung Yiu.....http://dblp.org/pers/hd/y/Yiu:Man_Lung", "Nikos Mamoulis.....http://dblp.org/pers/hd/m/Mamoulis:Nikos"], "pages": 16}