{"title": "From Part to Whole: Who is Behind the Painting?", "fields": ["random forest", "ranking", "modalities", "image scaling", "multi task learning"], "abstract": "Compared with normal modalities, the representations of paintings are much more complex due to its large intra-class and small inter-class variation. This poses more difficulties in the task of authorship identification. In this paper, we propose a multi-task multi-range (MTMR) representation framework and try to resolve this issue in two ways. First, we investigate how to improve the representation through multi-task learning. Specifically, we attempt to optimize authorship identification with subtly correlated identification tasks such as style, genre and date. Second, in order to make the representation more comprehensive and reduce the information loss from image scaling, we propose a multi-range structure which is composed of local, regional and global representations. Experiments on the two most representative large-scale painting datasets, Rijksmuseum Challenge and Wikiart, have shown that our method significantly outperforms the existing methods. To give better understanding and provide more effective predictions, we utilize random forest as the feature ranking method to analyze the importance of different features and apply external knowledge matching to further examine the predictions. Moreover, the framework's effects of identifying the authorship are visualized on the paintings' artist-characteristic regions and t-SNE is further applied to perform artist-based cluster analysis. Extensive validation has demonstrated that the proposed framework yields superior performance in the chanllenging task of painting authorship identification.", "citation": "Not cited", "departments": ["Peking University", "Peking University", "Peking University", "Peking University", "City University of Hong Kong"], "authors": ["Daiqian Ma.....http://dblp.org/pers/hd/m/Ma:Daiqian", "Feng Gao.....http://dblp.org/pers/hd/g/Gao:Feng", "Yan Bai.....http://dblp.org/pers/hd/b/Bai:Yan", "Yihang Lou.....http://dblp.org/pers/hd/l/Lou:Yihang", "Shiqi Wang.....http://dblp.org/pers/hd/w/Wang:Shiqi", "Tiejun Huang.....http://dblp.org/pers/hd/h/Huang:Tiejun", "Ling-Yu Duan.....http://dblp.org/pers/hd/d/Duan:Ling=Yu"], "conf": "mm", "year": "2017", "pages": 9}