{"title": "Automatically diagnosing and repairing error handling bugs in C.", "fields": ["categorization", "real time computing", "bebugging", "type i and type ii errors", "computer science"], "abstract": "Correct error handling is essential for building reliable and secure systems. Unfortunately, low-level languages like C often do not support any error handling primitives and leave it up to the developers to create their own mechanisms for error propagation and handling. However, in practice, the developers often make mistakes while writing the repetitive and tedious error handling code and inadvertently introduce bugs. Such error handling bugs often have severe consequences undermining the security and reliability of the affected systems. Fixing these bugs is also tiringâ  they are repetitive and cumbersome to implement. Therefore, it is crucial to develop tool supports for automatically detecting and fixing error handling bugs.   To understand the nature of error handling bugs that occur in widely used C programs, we conduct a comprehensive study of real world error handling bugs and their fixes. Leveraging the knowledge, we then design, implement, and evaluate ErrDoc, a tool that not only detects and characterizes different types of error handling bugs but also automatically fixes them. Our evaluation on five open-source projects shows that ErrDoc can detect error handling bugs with 100% to 84% precision and around 95% recall, and categorize them with 83% to 96% precision and above 90% recall. Thus, ErrDoc improves precision up to 5 percentage points, and recall up to 44 percentage points  w.r.t.  the state-of-the-art. We also demonstrate that ErrDoc can fix the bugs with high accuracy.", "citation": "Citations (1)", "departments": ["University of Virginia", "University of Virginia"], "authors": ["Yuchi Tian.....http://dblp.org/pers/hd/t/Tian:Yuchi", "Baishakhi Ray.....http://dblp.org/pers/hd/r/Ray:Baishakhi"], "conf": "sigsoft", "year": "2017", "pages": 11}