{"title": "Distributed Provenance Compression.", "fields": ["provenance", "fold", "equivalence", "latency", "equivalence class"], "abstract": "Network provenance, which records the execution history of network events as meta-data, is becoming increasingly important for network accountability and failure diagnosis. For example, network provenance may be used to trace the path that a message traversed in a network, or to reveal how a particular routing entry was derived and the parties involved in its derivation. A challenge when storing the provenance of a live network is that the large number of the arriving messages may incur substantial storage overhead. In this paper, we explore techniques to dynamically compress distributed provenance stored at scale. Logically, the compression is achieved by grouping equivalent provenance trees and maintaining only one concrete copy for each equivalence class. To efficiently identify equivalent provenance, we (1) introduce distributed event-based linear programs (DELP) to specify distributed network applications, and (2) statically analyze DELPs to allow for quick detection of provenance equivalence at runtime. Our experimental results demonstrate that our approach leads to significant storage reduction and query latency improvement over alternative approaches.", "citation": "Citations (2)", "year": "2017", "departments": ["University of Pennsylvania", "University of Pennsylvania", "Carnegie Mellon University", "University of Pennsylvania", "Carnegie Mellon University"], "conf": "sigmod", "authors": ["Chen Chen.....http://dblp.org/pers/hd/c/Chen_0019:Chen", "Harshal Tushar Lehri.....http://dblp.org/pers/hd/l/Lehri:Harshal_Tushar", "Lay Kuan Loh.....http://dblp.org/pers/hd/l/Loh:Lay_Kuan", "Anupam Alur.....http://dblp.org/pers/hd/a/Alur:Anupam", "Limin Jia.....http://dblp.org/pers/hd/j/Jia:Limin", "Boon Thau Loo.....http://dblp.org/pers/hd/l/Loo:Boon_Thau", "Wenchao Zhou.....http://dblp.org/pers/hd/z/Zhou:Wenchao"], "pages": 16}