{"title": "Crystal: Software-Defined Storage for Multi-Tenant Object Stores.", "fields": ["swift", "workload", "software defined storage", "forwarding plane", "extensibility"], "abstract": "Object stores are becoming pervasive due to their scalability and simplicity. Their broad adoption, however, contrasts with their rigidity for handling heterogeneous workloads and applications with evolving requirements, which prevents the adaptation of the system to such varied needs. In this work, we present Crystal, the first Software-Defined Storage (SDS) architecture whose core objective is to efficiently support multi-tenancy in object stores. Crystal adds a filtering abstraction at the data plane and exposes it to the control plane to enable high-level policies at the tenant, container and object granularities. Crystal translates these policies into a set of distributed controllers that can orchestrate filters at the data plane based on real-time workload information. We demonstrate Crystal through two use cases on top of OpenStack Swift: One that proves its storage automation capabilities, and another that differentiates IO bandwidth in a multi-tenant scenario. We show that Crystal is an extensible platform to deploy new SDS services for object stores with small overhead.", "citation": "Citations (4)", "departments": ["Universitat Rov ... rragona, Spain", "Universitat Rov ... rragona, Spain", "Universitat Rov ... rragona, Spain", "Universitat Rov ... rragona, Spain", "Universitat Rov ... rragona, Spain"], "authors": ["Raúl Gracia Tinedo.....http://dblp.org/pers/hd/t/Tinedo:Ra=uacute=l_Gracia", "Josep Sampé.....http://dblp.org/pers/hd/s/Samp=eacute=:Josep", "Edgar Zamora-Gómez.....http://dblp.org/pers/hd/z/Zamora=G=oacute=mez:Edgar", "Marc Sánchez Artigas.....http://dblp.org/pers/hd/a/Artigas:Marc_S=aacute=nchez", "Pedro García López.....http://dblp.org/pers/hd/l/L=oacute=pez:Pedro_Garc=iacute=a", "Yosef Moatti.....http://dblp.org/pers/hd/m/Moatti:Yosef", "Eran Rom.....http://dblp.org/pers/hd/r/Rom:Eran"], "conf": "fast", "year": "2017", "pages": 14}