{"title": "The Art and Science of Persuasion: Not All Crowdfunding Campaign Videos are The Same.", "fields": ["persuasion", "multimedia", "computer science"], "abstract": "To successfully raise money using crowdfunding, it is important for a campaign to communicate ideas or products effectively to the potential backers. One of the lesser explored but powerful components of a crowdfunding campaign is the campaign video. To better understand how videos affect campaign outcomes, we analyzed videos from 210 Kickstarter campaigns across three different project categories. In a mixed-methods study, we asked 3150 Amazon Mechanical Turk (MTurk) workers to evaluate the campaign videos. We found six recurrent factors from a qualitative analysis as well as quantitative analysis. Analysis revealed product related and video related factors that were predictive of the final outcome of campaigns over and above the static project representation features identified in previous studies. Both the qualitative and quantitative analysis showed that videos influenced perception differently for projects in different categories, and the differential perception was important for predicting successes of the projects. For example, in technology campaigns, projects perceived to have a lower level of complexity were more likely to be successful; but in design and fashion campaigns, projects perceived to have a higher level of complexity - which perhaps reflected craftsmanship - were more likely to be successful. We conclude with design implications to better support the video making process.", "citation": "Citations (4)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Sanorita Dey.....http://dblp.org/pers/hd/d/Dey:Sanorita", "Brittany R. L. Duff.....http://dblp.org/pers/hd/d/Duff:Brittany_R=_L=", "Karrie Karahalios.....http://dblp.org/pers/hd/k/Karahalios:Karrie", "Wai-Tat Fu.....http://dblp.org/pers/hd/f/Fu:Wai=Tat"], "conf": "cscw", "year": "2017", "pages": 15}