{"title": "EEG-GRAPH: A Factor-Graph-Based Model for Capturing Spatial, Temporal, and Observational Relationships in Electroencephalograms.", "fields": ["graph", "time complexity", "inference", "factor graph", "observational study"], "abstract": "This paper presents a probabilistic-graphical model that can be used to infer characteristics of instantaneous brain activity by jointly analyzing spatial and temporal dependencies observed in electroencephalograms (EEG). Specifically, we describe a factor-graph-based model with customized factor-functions defined based on domain knowledge, to infer pathologic brain activity with the goal of identifying seizure-generating brain regions in epilepsy patients. We utilize an inference technique based on the graph-cut algorithm to exactly solve graph inference in polynomial time. We validate the model by using clinically collected intracranial EEG data from 29 epilepsy patients to show that the model correctly identifies seizure-generating brain regions. Our results indicate that our model outperforms two conventional approaches used for seizure-onset localization (5-7% better AUC: 0.72, 0.67, 0.65) and that the proposed inference technique provides 3-10% gain in AUC (0.72, 0.62, 0.69) compared to sampling-based alternatives.", "citation": "Not cited", "year": "2017", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Mayo Clinic", "Mayo Clinic"], "conf": "nips", "authors": ["Yogatheesan Varatharajah.....http://dblp.org/pers/hd/v/Varatharajah:Yogatheesan", "Min Jin Chong.....http://dblp.org/pers/hd/c/Chong:Min_Jin", "Krishnakant Saboo.....http://dblp.org/pers/hd/s/Saboo:Krishnakant", "Brent M. Berry.....http://dblp.org/pers/hd/b/Berry:Brent_M=", "Benjamin H. Brinkmann.....http://dblp.org/pers/hd/b/Brinkmann:Benjamin_H=", "Gregory A. Worrell.....http://dblp.org/pers/hd/w/Worrell:Gregory_A=", "Ravishankar K. Iyer.....http://dblp.org/pers/hd/i/Iyer:Ravishankar_K="], "pages": 10}