{"title": "Transitions in Digital Personhood: Online Activity in Early Retirement.", "fields": ["design research", "self psychology", "dialogical self", "self", "phenomenon"], "abstract": "We present findings from a qualitative study about how Internet use supports self-functioning following the life transition of retirement from work. This study recruited six recent retirees and included the deployment of OnLines, a design research artifact that logged and visualized key online services used by participants at home over four-weeks. The deployment was supported by pre- and post-deployment interviews. OnLines prompted participants' reflection on their patterns of Internet use. Position Exchange Theory was used to understand retirees' sense making from a lifespan perspective, informing the design of supportive online services. This paper delivers a three-fold contribution to the field of human-computer interaction, advancing a lifespan-oriented approach by conceptualizing the self as a dialogical phenomenon that develops over time, advancing the ageing discourse by reporting on retirees' complex identities in the context of their life histories, and advancing discourse on research through design by developing OnLines to foster participant-researcher reflection informed by Self Psychology.", "citation": "Citations (2)", "year": "2017", "departments": ["Northumbria University", "Northumbria University", "Newcastle University", "University of Dundee", "University of Dundee"], "conf": "chi", "authors": ["Abigail Durrant.....http://dblp.org/pers/hd/d/Durrant:Abigail", "David S. Kirk.....http://dblp.org/pers/hd/k/Kirk:David_S=", "Diego Trujillo-Pisanty.....http://dblp.org/pers/hd/t/Trujillo=Pisanty:Diego", "Wendy Moncur.....http://dblp.org/pers/hd/m/Moncur:Wendy", "Kathryn M. Orzech.....http://dblp.org/pers/hd/o/Orzech:Kathryn_M=", "Tom Schofield.....http://dblp.org/pers/hd/s/Schofield:Tom", "Chris Elsden.....http://dblp.org/pers/hd/e/Elsden:Chris", "David J. Chatting.....http://dblp.org/pers/hd/c/Chatting:David_J=", "Andrew Monk.....http://dblp.org/pers/hd/m/Monk:Andrew"], "pages": 14}