{"title": "Flexpoint: An Adaptive Numerical Format for Efficient Training of Deep Neural Networks.", "fields": ["deep learning", "floating point", "inference", "residual", "network topology"], "abstract": "Deep neural networks are commonly developed and trained in 32-bit floating point format. Significant gains in performance and energy efficiency could be realized by training and inference in numerical formats optimized for deep learning. Despite advances in limited precision inference in recent years, training of neural networks in low bit-width remains a challenging problem. Here we present the Flexpoint data format, aiming at a complete replacement of 32-bit floating point format training and inference, designed to support modern deep network topologies without modifications. Flexpoint tensors have a shared exponent that is dynamically adjusted to minimize overflows and maximize available dynamic range. We validate Flexpoint by training AlexNet, a deep residual network and a generative adversarial network, using a simulator implemented with the \\emph{neon} deep learning framework. We demonstrate that 16-bit Flexpoint closely matches 32-bit floating point in training all three models, without any need for tuning of model hyperparameters. Our results suggest Flexpoint as a promising numerical format for future hardware for training and inference.", "citation": "Citations (9)", "year": "2017", "departments": ["Intel", "Intel", "Intel", "Intel", "Intel"], "conf": "nips", "authors": ["Urs Köster.....http://dblp.org/pers/hd/k/K=ouml=ster:Urs", "Tristan Webb.....http://dblp.org/pers/hd/w/Webb:Tristan", "Xin Wang.....http://dblp.org/pers/hd/w/Wang:Xin", "Marcel Nassar.....http://dblp.org/pers/hd/n/Nassar:Marcel", "Arjun K. Bansal.....http://dblp.org/pers/hd/b/Bansal:Arjun_K=", "William Constable.....http://dblp.org/pers/hd/c/Constable:William", "Oguz Elibol.....http://dblp.org/pers/hd/e/Elibol:Oguz", "Stewart Hall.....http://dblp.org/pers/hd/h/Hall:Stewart", "Luke Hornof.....http://dblp.org/pers/hd/h/Hornof:Luke", "Amir Khosrowshahi.....http://dblp.org/pers/hd/k/Khosrowshahi:Amir", "Carey Kloss.....http://dblp.org/pers/hd/k/Kloss:Carey", "Ruby J. Pai.....http://dblp.org/pers/hd/p/Pai:Ruby_J=", "Naveen Rao.....http://dblp.org/pers/hd/r/Rao:Naveen"], "pages": 11}