{"title": "NFVnice: Dynamic Backpressure and Scheduling for NFV Service Chains.", "fields": ["packet processing", "proportionally fair", "fair share scheduling", "round robin scheduling", "user space"], "abstract": "Managing Network Function (NF) service chains requires careful system resource management. We propose NFVnice, a user space NF scheduling and service chain management framework to provide fair, efficient and dynamic resource scheduling capabilities on Network Function Virtualization (NFV) platforms. The NFVnice framework monitors load on a service chain at high frequency (1000Hz) and employs backpressure to shed load early in the service chain, thereby preventing wasted work. Borrowing concepts such as rate proportional scheduling from hardware packet schedulers, CPU shares are computed by accounting for heterogeneous packet processing costs of NFs, I/O, and traffic arrival characteristics. By leveraging cgroups, a user space process scheduling abstraction exposed by the operating system, NFVnice is capable of controlling when network functions should be scheduled. NFVnice improves NF performance by complementing the capabilities of the OS scheduler but without requiring changes to the OS's scheduling mechanisms. Our controlled experiments show that NFVnice provides the appropriate rate-cost proportional fair share of CPU to NFs and significantly improves NF performance (throughput and loss) by reducing wasted work across an NF chain, compared to using the default OS scheduler. NFVnice achieves this even for heterogeneous NFs with vastly different computational costs and for heterogeneous workloads.", "citation": "Citations (7)", "year": "2017", "departments": ["University of Göttingen", "George Washington University", "IBM", "IBM", "University of California, Riverside"], "conf": "sigcomm", "authors": ["Sameer G. Kulkarni.....http://dblp.org/pers/hd/k/Kulkarni:Sameer_G=", "Wei Zhang.....http://dblp.org/pers/hd/z/Zhang:Wei", "Jinho Hwang.....http://dblp.org/pers/hd/h/Hwang:Jinho", "Shriram Rajagopalan.....http://dblp.org/pers/hd/r/Rajagopalan:Shriram", "K. K. Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:K=_K=", "Timothy Wood.....http://dblp.org/pers/hd/w/Wood_0001:Timothy", "Mayutan Arumaithurai.....http://dblp.org/pers/hd/a/Arumaithurai:Mayutan", "Xiaoming Fu.....http://dblp.org/pers/hd/f/Fu_0001:Xiaoming"], "pages": 14}