{"title": "ACIDRain: Concurrency-Related Attacks on Database-Backed Web Applications.", "fields": ["exploit", "web application", "adversary", "web api", "database transaction"], "abstract": "In theory, database transactions protect application data from corruption and integrity violations. In practice, database transactions frequently execute under weak isolation that exposes programs to a range of concurrency anomalies, and programmers may fail to correctly employ transactions. While low transaction volumes mask many potential concurrency-related errors under normal operation, determined adversaries can exploit them programmatically for fun and profit. In this paper, we formalize a new kind of attack on database-backed applications called an  ACIDRain  attack, in which an adversary systematically exploits concurrency-related vulnerabilities via programmatically accessible APIs. These attacks are not theoretical: ACIDRain attacks have already occurred in a handful of applications in the wild, including one attack which bankrupted a popular Bitcoin exchange. To proactively detect the potential for ACIDRain attacks, we extend the theory of weak isolation to analyze latent potential for non-serializable behavior under concurrent web API calls. We introduce a language-agnostic method for detecting potential isolation anomalies in web applications, called Abstract Anomaly Detection (2AD), that uses dynamic traces of database accesses to efficiently reason about the space of possible concurrent interleavings. We apply a prototype 2AD analysis tool to 12 popular self-hosted eCommerce applications written in four languages and deployed on over 2M websites. We identify and verify 22 critical ACIDRain attacks that allow attackers to corrupt store inventory, over-spend gift cards, and steal inventory.", "citation": "Citations (2)", "year": "2017", "departments": ["Stanford University", "Stanford University"], "conf": "sigmod", "authors": ["Todd Warszawski.....http://dblp.org/pers/hd/w/Warszawski:Todd", "Peter Bailis.....http://dblp.org/pers/hd/b/Bailis:Peter"], "pages": 16}