{"title": "Real-time Monocular Dense Mapping for Augmented Reality.", "fields": ["triangulation", "monocular", "planarity testing", "simultaneous localization and mapping", "piecewise"], "abstract": "Monocular simultaneous localization and mapping (SLAM) is a key enabling technique for many augmented reality (AR) applications. However, conventional methods for monocular SLAM can obtain only sparse or semi-dense maps in highly-textured image areas. Poorly-textured regions which widely exist in indoor and man-made urban environments can be hardly reconstructed, impeding interactions between virtual objects and real scenes in AR apps. In this paper,we present a novel method for real-time monocular dense mapping based on the piecewise planarity assumption for poorly textured regions. Specifically, a semi-dense map for highly-textured regions is first calculated by pixel matching and triangulation [6, 7]. Large textureless regions extracted by Maximally Stable Color Regions (MSCR) [11], which is a homogeneous-color region detector, are approximated using piecewise planar models which are estimated by the corresponding semi-dense 3D points and the proposed multi-plane segmentation algorithm. Plane models associated with the same 3D area across multiple overlapping views are linked and fused to ensure a consistent and accurate 3D reconstruction. Experimental results on two public datasets [15, 23] demonstrate that our method is 2.3X~2.9X faster than the state-of-the-art method DPPTAM [2], and meanwhile achieves better reconstruction accuracy and completeness. We also apply our method to a real AR application and live experiments with a hand-held camera demonstrate the effectiveness and efficiency of our method in practical scenario.", "citation": "Citations (1)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "University of Bridgeport", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Tangli Xue.....http://dblp.org/pers/hd/x/Xue:Tangli", "Hongcheng Luo.....http://dblp.org/pers/hd/l/Luo:Hongcheng", "Danpeng Cheng.....http://dblp.org/pers/hd/c/Cheng:Danpeng", "Zikang Yuan.....http://dblp.org/pers/hd/y/Yuan:Zikang", "Xin Yang.....http://dblp.org/pers/hd/y/Yang_0008:Xin"], "conf": "mm", "year": "2017", "pages": 9}