{"title": "Motif clustering and overlapping clustering for social network analysis.", "fields": ["single linkage clustering", "complete linkage clustering", "canopy clustering algorithm", "cure data clustering algorithm", "brown clustering"], "abstract": "Motivated by applications in social network community analysis, we introduce a new clustering paradigm termed motif clustering. Unlike classical clustering, motif clustering aims to minimize the number of clustering errors associated with both edges and certain higher order graph structures (motifs) that represent “atomic units” of social organizations. Our contributions are two-fold: We first introduce motif correlation clustering, in which the goal is to agnostically partition the vertices of a weighted complete graph so that certain predetermined “important” social subgraphs mostly lie within the same cluster, while “less relevant” social subgraphs are allowed to lie across clusters. We then proceed to introduce the notion of motif covers, in which the goal is to cover the vertices of motifs via the smallest number of (near) cliques in the graph. Motif cover algorithms provide a natural solution for overlapping clustering and they also play an important role in latent feature inference of networks. For both motif correlation clustering and its extension introduced via the covering problem, we provide hardness results, algorithmic solutions and community detection results for two well-studied social networks.", "citation": "Citations (2)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Pan Li.....http://dblp.org/pers/hd/l/Li:Pan", "Hoang Dau.....http://dblp.org/pers/hd/d/Dau:Hoang", "Gregory J. Puleo.....http://dblp.org/pers/hd/p/Puleo:Gregory_J=", "Olgica Milenkovic.....http://dblp.org/pers/hd/m/Milenkovic:Olgica"], "conf": "infocom", "year": "2017", "pages": 9}