{"title": "DataRaceBench: a benchmark suite for systematic evaluation of data race detection tools.", "fields": ["parallel computing", "suite", "strengths and weaknesses", "sdet", "parallel programming model"], "abstract": "Data races in multi-threaded parallel applications are notoriously damaging while extremely difficult to detect. Many tools have been developed to help programmers find data races. However, there is no dedicated OpenMP benchmark suite to systematically evaluate data race detection tools for their strengths and limitations.   In this paper, we present DataRaceBench, an open-source benchmark suite designed to systematically and quantitatively evaluate the effectiveness of data race detection tools. We focus on data race detection in programs written in OpenMP, the popular parallel programming model for multi-threaded applications. In particular, DataRaceBench includes a set of microbenchmark programs with or without data races. These microbenchmarks are either manually written, extracted from real scientific applications, or automatically generated optimization variants.   We also define several metrics to represent effectiveness and efficiency of data race detection tools. Using DataRaceBench and its metrics, we evaluate four different data race detection tools: Helgrind, ThreadSanitizer, Archer, and Intel Inspector. The evaluation results show that DataRaceBench is effective to provide comparable, quantitative results and discover strengths and weaknesses of the tools being evaluated.", "citation": "Citations (4)", "year": "2017", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory"], "conf": "sc", "authors": ["Chunhua Liao.....http://dblp.org/pers/hd/l/Liao:Chunhua", "Pei-Hung Lin.....http://dblp.org/pers/hd/l/Lin:Pei=Hung", "Joshua Asplund.....http://dblp.org/pers/hd/a/Asplund:Joshua", "Markus Schordan.....http://dblp.org/pers/hd/s/Schordan:Markus", "Ian Karlin.....http://dblp.org/pers/hd/k/Karlin:Ian"], "pages": 14}