{"title": "One more queue is enough: Minimizing flow completion time with explicit priority notification.", "fields": ["fixed priority pre emptive scheduling", "rate monotonic scheduling", "two level scheduling", "earliest deadline first scheduling", "deadline monotonic scheduling"], "abstract": "Ideally, minimizing the flow completion time (FCT) requires millions of priorities supported by the underlying network so that each flow has its unique priority. However, in production datacenters, the available switch priority queues for flow scheduling are very limited (merely 2 or 3). This practical constraint seriously degrades the performance of previous approaches. In this paper, we introduce Explicit Priority Notification (EPN), a novel scheduling mechanism which emulates fine-grained priorities (i.e., desired priorities or DP) using only two switch priority queues. EPN can support various flow scheduling disciplines with or without flow size information. We have implemented EPN on commodity switches and evaluated its performance with both testbed experiments and extensive simulations. Our results show that, with flow size information, EPN achieves comparable FCT as pFabric that requires clean-slate switch hardware. And EPN also outperforms TCP by up to 60.5% if it bins the traffic into two priority queues according to flow size. In information-agnostic setting, EPN outperforms PIAS with two priority queues by up to 37.7%. To the best of our knowledge, EPN is the first system that provides millions of priorities for flow scheduling with commodity switches.", "citation": "Not cited", "departments": ["University of Science and Technology of China", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Yuanwei Lu.....http://dblp.org/pers/hd/l/Lu:Yuanwei", "Guo Chen.....http://dblp.org/pers/hd/c/Chen:Guo", "Larry Luo.....http://dblp.org/pers/hd/l/Luo:Larry", "Kun Tan.....http://dblp.org/pers/hd/t/Tan:Kun", "Yongqiang Xiong.....http://dblp.org/pers/hd/x/Xiong:Yongqiang", "Xiaoliang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaoliang", "Enhong Chen.....http://dblp.org/pers/hd/c/Chen:Enhong"], "conf": "infocom", "year": "2017", "pages": 9}