{"title": "Understanding Fashion Trends from Street Photos via Neighbor-Constrained Embedding Learning.", "fields": ["image retrieval", "deep learning", "multimedia", "social network", "embedding"], "abstract": "Driven by the increasing popular image-dominated social networks, such as Instagram, Pinterest and Chictopica, sharing of daily-life street photos now plays an influential role in fashion adoption between fashion trend-setters and followers. In this work, we propose a deep learning based fine-grained embedding learning approach for street fashion analysis by leveraging user-generated street fashion data. Specifically, we present QuadNet, an effective CNN based image embedding network driven by both multi-task classification loss and neighbor-constrained similarity loss. The latter loss function is computed with a novel quadruplet loss function, which considers both hard and soft positive neighbors as well as a negative neighbor for each anchor image. The embedded feature learned from co-optimization is effective for both fine-grained classification task and image retrieval task. Quantitative evaluation on a newly collected large-scale multi-task street photo dataset shows that our QuadNet outperforms the state-of-the-art triplet network by a significant margin. In order to further evaluate the effectiveness of the learned embedding, we analyze and trace the fashion trends of New York City from 2011 to 2016. In our analysis, we are able to identify some short-term and long-term fashion styles.", "citation": "Not cited", "departments": ["Zhejiang University", "National University of Singapore", "Tencent", "Zhejiang University", "Zhejiang University"], "authors": ["Xiaoling Gu.....http://dblp.org/pers/hd/g/Gu:Xiaoling", "Yongkang Wong.....http://dblp.org/pers/hd/w/Wong:Yongkang", "Pai Peng.....http://dblp.org/pers/hd/p/Peng:Pai", "Lidan Shou.....http://dblp.org/pers/hd/s/Shou:Lidan", "Gang Chen.....http://dblp.org/pers/hd/c/Chen_0001:Gang", "Mohan S. Kankanhalli.....http://dblp.org/pers/hd/k/Kankanhalli:Mohan_S="], "conf": "mm", "year": "2017", "pages": 9}