{"title": "Do developers read compiler error messages?", "fields": ["source code", "eye tracking", "development environment", "java", "compiler"], "abstract": "In integrated development environments, developers receive compiler error messages through a variety of textual and visual mechanisms, such as popups and wavy red underlines. Although error messages are the primary means of communicating defects to developers, researchers have a limited understanding on how developers actually use these messages to resolve defects. To understand how developers use error messages, we conducted an eye tracking study with 56 participants from undergraduate and graduate software engineering courses at our university. The participants attempted to resolve common, yet problematic defects in a Java code base within the Eclipse development environment. We found that: 1) participants read error messages and the difficulty of reading these messages is comparable to the difficulty of reading source code, 2) difficulty reading error messages significantly predicts participants' task performance, and 3) participants allocate a substantial portion of their total task to reading error messages (13%--25%). The results of our study offer empirical justification for the need to improve compiler error messages for developers.", "citation": "Citations (10)", "departments": ["North Carolina State University", "North Carolina State University", "North Carolina State University", "Washington and Lee University", "North Carolina State University"], "authors": ["Titus Barik.....http://dblp.org/pers/hd/b/Barik:Titus", "Justin Smith.....http://dblp.org/pers/hd/s/Smith:Justin", "Kevin Lubick.....http://dblp.org/pers/hd/l/Lubick:Kevin", "Elisabeth Holmes.....http://dblp.org/pers/hd/h/Holmes:Elisabeth", "Jing Feng.....http://dblp.org/pers/hd/f/Feng:Jing", "Emerson R. Murphy-Hill.....http://dblp.org/pers/hd/m/Murphy=Hill:Emerson_R=", "Chris Parnin.....http://dblp.org/pers/hd/p/Parnin:Chris"], "conf": "icse", "year": "2017", "pages": 11}