{"title": "DAG Reduction: Fast Answering Reachability Queries.", "fields": ["reachability", "equivalence", "strongly connected component", "transitive reduction", "graph operations"], "abstract": "Answering reachability queries is one of the fundamental graph operations. The existing approaches build indexes and answer reachability queries on a directed acyclic graph ( DAG )  G , which is constructed by coalescing each strongly connected component of the given directed graph G into a node of  G . Considering that  G  can still be large to be processed efficiently, there are studies to further reduce  G  to a smaller graph. However, these approaches suffer from either inefficiency in answering reachability queries, or cannot scale to large graphs.   In this paper, we study  DAG  reduction to accelerate reachability query processing, which reduces the size of  G  by computing transitive reduction ( TR ) followed by computing equivalence reduction ( ER ). For  ER , we propose a divide-and-conquer algorithm, namely  linear-ER . Given the result  G t   of  TR ,  linear-ER  gets a smaller  DAG G  e  in linear time based on equivalence relationship between nodes in  G . Our  DAG  reduction approaches ( TR  and  ER ) significantly improve the cost of time and space, and can be scaled to large graphs. We confirm the efficiency of our approaches by extensive experimental studies for  TR ,  ER , and reachability query processing using 20 real datasets.", "citation": "Citations (1)", "year": "2017", "departments": ["Donghua University", "Yanshan University", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Shanghai Lixin  ... Shanghai, China"], "conf": "sigmod", "authors": ["Junfeng Zhou.....http://dblp.org/pers/hd/z/Zhou:Junfeng", "Shijie Zhou.....http://dblp.org/pers/hd/z/Zhou:Shijie", "Jeffrey Xu Yu.....http://dblp.org/pers/hd/y/Yu:Jeffrey_Xu", "Hao Wei.....http://dblp.org/pers/hd/w/Wei:Hao", "Ziyang Chen.....http://dblp.org/pers/hd/c/Chen:Ziyang", "Xian Tang.....http://dblp.org/pers/hd/t/Tang:Xian"], "pages": 16}