{"title": "LiCompass: Extracting orientation from polarized light.", "fields": ["irradiance", "data analysis", "perspective distortion", "adaptive optics", "ranging"], "abstract": "Accurate orientation information is the key in many applications, ranging from map reconstruction with crowdsourcing data, location data analytics, to accurate indoor localization. Many existing solutions rely on noisy magnetic and inertial sensor data, leading to limited accuracy, while others leverage multiple, dense anchor points to improve the accuracy, requiring significant deployment efforts. This paper presents LiCompass, the first system that enables a commodity camera to accurately estimate the object orientation using just a single optical anchor. Our key idea is to allow a camera to observe varying intensity level of polarized light when it is in different orientations and, hence, perform estimation directly from image pixel intensity. As the estimation relies only on pixel intensity, instead of the location of the anchor in an image, the system performs reliably at long distance, with low resolution images, and with large perspective distortion. LiCompass' core designs include an elaborate optical anchor design and a series of signal processing techniques based on trigonometric properties, which extend the range of orientation estimation to full 360 degrees. Our prototype evaluation shows that LiCompass produces very accurate estimates with median errors of merely 2.5 degrees at 5 meters and 7.4 degrees at 2.5 meters with an irradiance angle of 55 degrees.", "citation": "Not cited", "departments": ["National Taiwan University", "National Taiwan University", "National Taiwan University", "National Taiwan University", "National Chiao Tung University"], "authors": ["Yu-Lin Wei.....http://dblp.org/pers/hd/w/Wei:Yu=Lin", "Hsin-I Wu.....http://dblp.org/pers/hd/w/Wu:Hsin=I", "Han-Chung Wang.....http://dblp.org/pers/hd/w/Wang:Han=Chung", "Hsin-Mu Tsai.....http://dblp.org/pers/hd/t/Tsai:Hsin=Mu", "Kate Ching-Ju Lin.....http://dblp.org/pers/hd/l/Lin:Kate_Ching=Ju", "Rayana Boubezari.....http://dblp.org/pers/hd/b/Boubezari:Rayana", "Hoa Le Minh.....http://dblp.org/pers/hd/m/Minh:Hoa_Le", "Zabih Ghassemlooy.....http://dblp.org/pers/hd/g/Ghassemlooy:Zabih"], "conf": "infocom", "year": "2017", "pages": 9}