{"title": "Attention Transfer from Web Images for Video Recognition.", "fields": ["deep learning", "ground truth", "convolutional neural network", "upload", "video tracking"], "abstract": "Training deep learning based video classifiers for action recognition requires a large amount of labeled videos. The labeling process is labor-intensive and time-consuming. On the other hand, large amount of weakly-labeled images are uploaded to the Internet by users everyday. To harness the rich and highly diverse set of Web images, a scalable approach is to crawl these images to train deep learning based classifier, such as Convolutional Neural Networks (CNN). However, due to the domain shift problem, the performance of Web images trained deep classifiers tend to degrade when directly deployed to videos. One way to address this problem is to fine-tune the trained models on videos, but sufficient amount of annotated videos are still required. In this work, we propose a novel approach to transfer knowledge from image domain to video domain. The proposed method can adapt to the target domain (i.e. video data) with limited amount of training data. Our method maps the video frames into a low-dimensional feature space using the class-discriminative spatial attention map for CNNs. We design a novel Siamese EnergyNet structure to learn energy functions on the attention maps by jointly optimizing two loss functions, such that the attention map corresponding to a ground truth concept would have higher energy. We conduct extensive experiments on two challenging video recognition datasets (i.e. TVHI and UCF101), and demonstrate the efficacy of our proposed method.", "citation": "Citations (1)", "departments": ["National University of Singapore", "National University of Singapore", "University of Minnesota", "National University of Singapore"], "authors": ["Junnan Li.....http://dblp.org/pers/hd/l/Li:Junnan", "Yongkang Wong.....http://dblp.org/pers/hd/w/Wong:Yongkang", "Qi Zhao.....http://dblp.org/pers/hd/z/Zhao:Qi", "Mohan S. Kankanhalli.....http://dblp.org/pers/hd/k/Kankanhalli:Mohan_S="], "conf": "mm", "year": "2017", "pages": 9}