{"title": "Automatic Adjustment of Stereoscopic Content for Long-Range Projections in Outdoor Areas.", "fields": ["video camera", "projection mapping", "structure from motion", "projector", "anaglyph 3d"], "abstract": "Projecting stereoscopic content onto large general outdoor surfaces, say building facades, presents many challenges to be overcome, particularly when using red-cyan anaglyph stereo representation, so that as accurate as possible colour and depth perception can still be achieved. In this paper, we address the challenges relating to long-range projection mapping of stereoscopic content in outdoor areas and present a complete framework for the automatic adjustment of the content to compensate for any adverse projection surface behaviour. We formulate the problem of modeling the projection surface into one of simultaneous recovery of shape and appearance. Our system is composed of two standard fixed cameras, a long range fixed projector, and a roving video camera for multi-view capture. The overall computational framework comprises of four modules: calibration of a long-range vision system using the structure from motion technique, dense 3D reconstruction of projection surface from calibrated camera images, modeling the light behaviour of the projection surface using roving camera images and, iterative adjustment of the stereoscopic content. In addition to cleverly adapting some of the established computer vision techniques, the system design we present is distinct from previous work. The proposed framework has been tested in real-world applications with two non-trivial user experience studies and the results reported show considerable improvements in the quality of 3D depth and colour perceived by human participants.", "citation": "Not cited", "departments": ["Concordia University", "Concordia University", "Concordia University", "Concordia University"], "authors": ["Behnam Maneshgar.....http://dblp.org/pers/hd/m/Maneshgar:Behnam", "Leila Sujir.....http://dblp.org/pers/hd/s/Sujir:Leila", "Sudhir P. Mudur.....http://dblp.org/pers/hd/m/Mudur:Sudhir_P=", "Charalambos Poullis.....http://dblp.org/pers/hd/p/Poullis:Charalambos"], "conf": "mm", "year": "2017", "pages": 9}