{"title": "Single restart with time stamps for computational offloading in a semi-online setting.", "fields": ["job shop scheduling", "heuristic", "symmetric multiprocessor system", "multi core processor", "competitive analysis"], "abstract": "We study the problem of scheduling n tasks on m + m’ parallel processors, where the processing times on m processors are known while those on the remaining m’ processors are not known a priori. This semi-online model is an abstraction of certain heterogeneous computing systems, e.g., with the m known processors representing local CPU cores and the unknown processors representing remote servers with uncertain availability of computing cycles. Our objective is to minimize the makespan of all tasks. We initially focus on the case m' = 1 and propose a semi-online algorithm termed Single Restart with Time Stamps (SRTS), which has time complexity O(n log n). We derive its competitive ratio in comparison with the optimal offline solution. If the unknown processing times are deterministic, the competitive ratio of SRTS is shown to be either always constant or asymptotically constant in practice, respectively in cases where the processing times are independent and dependent on m. A similar result is obtained when the unknown processing times are random. Furthermore, extending the ideas of SRTS, we propose a heuristic algorithm termed SRTS-Multiple (SRTS-M) for the case m' > 1. Besides the proven competitive ratios, simulation results further suggest that SRTS and SRTS-M give superior performance on average over randomly generated task processing times, substantially reducing the makespan over the best known alternatives. Interestingly, the performance gain is more significant for task processing times sampled from heavy-tailed distributions.", "citation": "Not cited", "departments": ["University of Toronto", "University of Toronto"], "authors": ["Jaya Prakash Champati.....http://dblp.org/pers/hd/c/Champati:Jaya_Prakash", "Ben Liang.....http://dblp.org/pers/hd/l/Liang:Ben"], "conf": "infocom", "year": "2017", "pages": 9}