{"title": "Place-centric Visual Urban Perception with Deep Multi-instance Regression.", "fields": ["attractiveness", "visual perception", "expectation maximization algorithm", "convolutional neural network", "regression"], "abstract": "This paper presents a unified framework to learn to quantify perceptual attributes (e.g., safety, attractiveness) of physical urban environments using crowd-sourced street-view photos without human annotations. The efforts of this work include two folds. First, we collect a large-scale urban image dataset in multiple major cities in U.S.A., which consists of multiple street-view photos for every place. Instead of using subjective annotations as in previous works, which are neither accurate nor consistent, we collect for every place the safety score from government's crime event records as objective safety indicators. Second, we observe that the place-centric perception task is by nature a multi-instance regression problem since the labels are only available for places (bags), rather than images or image regions (instances). We thus introduce a deep convolutional neural network (CNN) to parameterize the instance-level scoring function, and develop an EM algorithm to alternatively estimate the primary instances (images or image regions) which affect the safety scores and train the proposed network. Our method is capable of localizing interesting images and image regions for each place. We evaluate the proposed method on a newly created dataset and a public dataset. Results with comparisons showed that our method can clearly outperform the alternative perception methods and more importantly, is capable of generating region-level safety scores to facilitate interpretations of the perception process.", "citation": "Not cited", "departments": ["San Diego State University", "San Diego State University", "University of Queensland", "University of California, Los Angeles", "Sun Yat-sen University"], "authors": ["Xiaobai Liu.....http://dblp.org/pers/hd/l/Liu:Xiaobai", "Qi Chen.....http://dblp.org/pers/hd/c/Chen:Qi", "Lei Zhu.....http://dblp.org/pers/hd/z/Zhu_0002:Lei", "Yuanlu Xu.....http://dblp.org/pers/hd/x/Xu:Yuanlu", "Liang Lin.....http://dblp.org/pers/hd/l/Lin:Liang"], "conf": "mm", "year": "2017", "pages": 9}