{"title": "Learning Video Object Segmentation with Visual Memory.", "fields": ["visual memory", "segmentation", "motion compensation", "video tracking", "computer vision", "computer science", "memory module", "small number", "artificial intelligence"], "abstract": "This paper addresses the task of segmenting moving objects in unconstrained videos. We introduce a novel two-stream neural network with an explicit memory module to achieve this. The two streams of the network encode spatial and temporal features in a video sequence respectively, while the memory module captures the evolution of objects over time. The module to build a “visual memory” in video, i.e., a joint representation of all the video frames, is realized with a convolutional recurrent unit learned from a small number of training video sequences. Given a video frame as input, our approach assigns each pixel an object or background label based on the learned spatio-temporal features as well as the \"visual memory\" specific to the video, acquired automatically without any manually-annotated frames. The visual memory is implemented with convolutional gated recurrent units, which allows to propagate spatial information over time. We evaluate our method extensively on two benchmarks, DAVIS and Freiburg-Berkeley motion segmentation datasets, and show state-of-the-art results. For example, our approach outperforms the top method on the DAVIS dataset by nearly 6%. We also provide an extensive ablative analysis to investigate the influence of each component in the proposed framework.", "citation": "Citations (16)", "year": "2017", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation"], "conf": "iccv", "authors": ["Pavel Tokmakov.....http://dblp.org/pers/hd/t/Tokmakov:Pavel", "Karteek Alahari.....http://dblp.org/pers/hd/a/Alahari:Karteek", "Cordelia Schmid.....http://dblp.org/pers/hd/s/Schmid:Cordelia"], "pages": 10}