{"title": "Data Tracking in Search of Workflows.", "fields": ["tracking system", "data type", "data quality", "medical equipment", "workflow"], "abstract": "Introducing data tracking of patients, doctors, medicine, or medical equipment holds promise to optimize workflows within hospitals. However, placing tracking devices and collecting data does not automatically translate into new workflows; instead, it requires careful considerations, knowledge about the activities tracked, and technical knowledge. In this paper, we study the interdisciplinary work involved when data tracking techniques are used to construe workflows within a real life work setting: architectural design of hospitals. We provide an ethnographic account from a unique study where two types of data tracking techniques were utilized in an existing hospital with the aim of informing the architectural design of a future hospital. The paper makes three contributions. First, we characterize the work involved in construing workflows based upon data tracking. Second, we discuss surveillance as an empirical category, which emerged in our study. Finally, we argue that to be able to construe workflows based upon data tracking, balancing the seamless boundary of privacy in work and surveillance in cooperation with the practitioners is of critical importance. Without support from the practitioners, data quality is at risk, and the resulting workflows might turn out 'flawed'.", "citation": "Citations (1)", "departments": ["University of Copenhagen", "University of Copenhagen", "Hitachi", "Hitachi", "New Hospital Bi ... nhagen, Denmark"], "authors": ["Naja L. Holten Møller.....http://dblp.org/pers/hd/m/M=oslash=ller:Naja_L=_Holten", "Pernille Bjørn.....http://dblp.org/pers/hd/b/Bj=oslash=rn:Pernille", "Jonas Christoffer Villumsen.....http://dblp.org/pers/hd/v/Villumsen:Jonas_Christoffer", "Tine C. Hansen Hancock.....http://dblp.org/pers/hd/h/Hancock:Tine_C=_Hansen", "Toshimitsu Aritake.....http://dblp.org/pers/hd/a/Aritake:Toshimitsu", "Shigeyuki Tani.....http://dblp.org/pers/hd/t/Tani:Shigeyuki"], "conf": "cscw", "year": "2017", "pages": 13}