{"title": "Coflex: Navigating the fairness-efficiency tradeoff for coflow scheduling.", "fields": ["operator", "scheduling", "temporal isolation among virtual machines", "real time computing", "computer network"], "abstract": "Fair and efficient coflow scheduling improves application-level networking performance in today's datacenters. Ideally, a coflow scheduler should provide isolation guarantees on the minimum coflow progress to achieve predictable networking performance. Network operators, on the other hand, strive to decrease the average coflow completion time (CCT). Unfortunately, optimal isolation guarantees and minimum average CCT are conflicting objectives and cannot be achieved at the same time. Existing coflow schedulers either optimize isolation guarantees at the expense of long CCTs (e.g., HUG [1]), or decrease the average CCT without performance isolation (e.g., Varys and Aalo [2], [3]). The lack of a smooth tradeoff in between poses a dilemma between low efficiency and no performance isolation. To bridge this gap, we develop a new coflow scheduler, Coflex, to navigate this tradeoff. Coflex allows network operators to specify the desired level of isolation guarantee using a tunable fairness knob, while at the same time decreasing the average CCT. Both our real-world deployments and trace-driven simulations have shown that Coflex offers a smooth tradeoff between fairness and efficiency. At an appropriate tradeoff level, Coflex outperforms fair schedulers by 2 χ in minimizing the average CCT.", "citation": "Not cited", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Toronto"], "authors": ["Wei Wang.....http://dblp.org/pers/hd/w/Wang_0030:Wei", "Shiyao Ma.....http://dblp.org/pers/hd/m/Ma:Shiyao", "Bo Li.....http://dblp.org/pers/hd/l/Li_0001:Bo", "Baochun Li.....http://dblp.org/pers/hd/l/Li:Baochun"], "conf": "infocom", "year": "2017", "pages": 9}