{"title": "Learning Disentangled Representations with Semi-Supervised Deep Generative Models.", "fields": ["probabilistic logic", "importance sampling", "generative grammar", "discriminative model", "encoder"], "abstract": "Variational autoencoders (VAEs) learn representations of data by jointly training a probabilistic encoder and decoder network. Typically these models encode all features of the data into a single variable. Here we are interested in learning disentangled representations that encode distinct aspects of the data into separate variables. We propose to learn such representations using model architectures that generalise from standard VAEs, employing a general graphical model structure in the encoder and decoder. This allows us to train partially-specified models that make relatively strong assumptions about a subset of interpretable variables and rely on the flexibility of neural networks to learn representations for the remaining variables. We further define a general objective for semi-supervised learning in this model class, which can be approximated using an importance sampling procedure. We evaluate our framework's ability to learn disentangled representations, both by qualitative exploration of its generative capacity, and quantitative evaluation of its discriminative ability on a variety of models and datasets.", "citation": "Citations (18)", "year": "2017", "departments": ["University of Oxford", "The Turing Institute", "Northeastern University", "University of Oxford", "University of Oxford"], "conf": "nips", "authors": ["Siddharth Narayanaswamy.....http://dblp.org/pers/hd/n/Narayanaswamy:Siddharth", "Brooks Paige.....http://dblp.org/pers/hd/p/Paige:Brooks", "Jan-Willem van de Meent.....http://dblp.org/pers/hd/m/Meent:Jan=Willem_van_de", "Alban Desmaison.....http://dblp.org/pers/hd/d/Desmaison:Alban", "Noah D. Goodman.....http://dblp.org/pers/hd/g/Goodman:Noah_D=", "Pushmeet Kohli.....http://dblp.org/pers/hd/k/Kohli:Pushmeet", "Frank D. Wood.....http://dblp.org/pers/hd/w/Wood:Frank_D=", "Philip H. S. Torr.....http://dblp.org/pers/hd/t/Torr:Philip_H=_S="], "pages": 11}