{"title": "Dynamic Multi-View Hashing for Online Image Retrieval.", "fields": ["image retrieval", "feature hashing", "visual word", "hash function", "watermark"], "abstract": "Advanced hashing technique is essential in large s-cale online image retrieval and organization, where image contents are frequently changed. While traditional multi-view hashing method has achieve promising effectiveness, its batch-based learning based scheme largely leads to very expensive updating cost. Meanwhile, existing online hashing scheme generally focuses on single-view data. Good effectiveness can not be expected when searching over real online images, which typically have multiple views. Further, both types of hashing methods only can generate hash codes with fixed length. Thus they have limited capability on comprehensive characterization of streaming image data. In this paper, we propose dynamic multi-view hashing (DMVH), which can adaptively augment hash codes according to dynamic changes of image. Meanwhile, DMVH leverages online learning to generate hash codes. It can increase the code length when current code is not able to represent new images effectively. Moreover, to gain further improvement on overall performance, each view is assigned with a weight, which can be efficiently updated in the online learning process. In order to avoid the frequent updating of code length and view weights, an intelligent buffering scheme is designed to preserve significant data to maintain good effectiveness of DMVH. Experimental results on t-wo real-world image datasets demonstrate superior performance of DWVH over several state-of-the-art hashing methods.", "citation": "Citations (9)", "departments": ["Northumbria University", "Lancaster University", "University of East Anglia"], "authors": ["Liang Xie.....http://dblp.org/pers/hd/x/Xie:Liang", "Jialie Shen.....http://dblp.org/pers/hd/s/Shen:Jialie", "Jungong Han.....http://dblp.org/pers/hd/h/Han:Jungong", "Lei Zhu.....http://dblp.org/pers/hd/z/Zhu_0002:Lei", "Ling Shao.....http://dblp.org/pers/hd/s/Shao_0001:Ling"], "conf": "ijcai", "year": "2017", "pages": 7}