{"title": "It's All Around You: Exploring 360° Video Viewing Experiences on Mobile Devices.", "fields": ["peephole", "immersion", "amateur", "viewport", "storytelling"], "abstract": "360° videos are a new kind of medium that gives the viewers a sense of real immersion as they glimpse the action from all angles and directions. Naturally, professional and amateur film-makers are actively adopting this new medium for transformative storytelling. Despite this phenomenal progress in 360° video creation, current understanding on users' viewing experience of these videos is limited. In this paper, we present the first comparative study on the user experience with 360° videos on mobile devices using different interaction techniques. We observed 18 participants' interaction with six 360°videos with different viewport characteristics (static or moving) on a smartphone, a tablet and a head mounted display (HMD) respectively and measured how they interact with the content. We then conducted semi-structured interviews with the participants in which they explained their interaction with and viewing experience of 360° videos across three devices. Our findings show that 360° videos with moving viewports elicit higher engagement from the viewers, and offer superior viewing experience. However, these videos are cognitively demanding and require constant user attention. Our participants preferred the condition with dynamic peephole interaction on a smartphone for watching 360° videos due to the simplicity in exploration and familiarity with navigation controls. Many participants reported that the HMD offers the most immersive experience however it comes at the expense of higher cognitive burden, motion sickness and physical discomfort.", "citation": "Citations (5)", "departments": ["Bell Labs", "Bell Labs", "University of Bremen"], "authors": ["Marc Van den Broeck.....http://dblp.org/pers/hd/b/Broeck:Marc_Van_den", "Fahim Kawsar.....http://dblp.org/pers/hd/k/Kawsar:Fahim", "Johannes Schöning.....http://dblp.org/pers/hd/s/Sch=ouml=ning:Johannes"], "conf": "mm", "year": "2017", "pages": 7}