{"title": "A parity check analog decoder for molecular communication based on biological circuits.", "fields": ["bit error rate", "synthetic biological circuit", "parity bit", "ranging", "molecular communication"], "abstract": "Molecular Communication (MC) is an enabling paradigm for the interconnection of future devices and networks in the biological environment, with applications ranging from bio-medicine to environmental monitoring and control. The engineering of biological circuits, which allows to manipulate the molecular information processing abilities of biological cells, is a candidate technology for the realization of MC-enabled devices. In this paper, inspired by recent studies favoring the efficiency of analog computation over digital in biological cells, an analog decoder design is proposed based on biological circuit components. In particular, this decoder computes the a-posteriori log-likelihood ratio of parity-check-encoded bits from a binary-modulated concentration of molecules. The proposed design implements the required L-value and the box-plus operations entirely in the biochemical domain by using activation and repression of gene expression, and reactions of molecular species. Each component of the circuit is designed and tuned in this paper by comparing the resulting functionality with that of the corresponding analytical expression. Despite evident differences with classical electronics, biochemical simulation data of the resulting biological circuit demonstrate very close performance in terms of Mean Squared Error (MSE) and Bit Error Rate (BER), and validate the proposed approach for the future realization of MC components.", "citation": "Citations (3)", "departments": ["Polytechnic University of Milan", "University of Nebraska–Lincoln", "Polytechnic University of Milan"], "authors": ["Alessio Marcone.....http://dblp.org/pers/hd/m/Marcone:Alessio", "Massimiliano Pierobon.....http://dblp.org/pers/hd/p/Pierobon:Massimiliano", "Maurizio Magarini.....http://dblp.org/pers/hd/m/Magarini:Maurizio"], "conf": "infocom", "year": "2017", "pages": 9}