{"title": "Why approximate when you can get the exact? Optimal targeted viral marketing at scale.", "fields": ["approximation algorithm", "viral marketing", "maximization", "exact algorithm", "stochastic programming"], "abstract": "One of the most central problems in viral marketing is Influence Maximization (IM), which finds a set of k seed users who can influence the maximum number of users in online social networks. Unfortunately, all existing algorithms to IM, including the state of the art SSA and IMM, have an approximation ratio of (1 − 1/e − e). Recently, a generalization of IM, Cost-aware Target Viral Marketing (CTVM), asks for the most cost-effective users to influence the most relevant users, has been introduced. The current best algorithm for CTVM has an approximation ratio of (1 − 1/√e − e). In this paper, we study the CTVM problem, aiming to optimally solve the problem. We first highlight that using a traditional two stage stochastic programming to exactly solve CTVM is not possible because of scalability. We then propose an almost exact algorithm TIPTOP, which has an approximation ratio of (1 — e). This result significantly improves the current best solutions to both IM and CTVM. At the heart of TIPTOP lies an innovative technique that reduces the number of samples as much as possible. This allows us to exactly solve CTVM on a much smaller space of generated samples using Integer Programming. While obtaining an almost exact solution, TIPTOP is very scalable, running on billion-scale networks such as Twitter under three hours. Furthermore, TIPTOP lends a tool for researchers to benchmark their solutions against the optimal one in large-scale networks, which is currently not available.", "citation": "Citations (4)", "departments": ["University of Florida", "University of Florida", "Virginia Commonwealth University", "University of Florida"], "authors": ["Xiang Li.....http://dblp.org/pers/hd/l/Li_0016:Xiang", "J. David Smith.....http://dblp.org/pers/hd/s/Smith:J=_David", "Thang N. Dinh.....http://dblp.org/pers/hd/d/Dinh:Thang_N=", "My T. Thai.....http://dblp.org/pers/hd/t/Thai:My_T="], "conf": "infocom", "year": "2017", "pages": 9}