{"title": "The Role of Visual Attention in Sentiment Prediction.", "fields": ["sentiment analysis", "encoding", "convolutional neural network", "online advertising", "social media"], "abstract": "Automated assessment of visual sentiment has many applications, such as monitoring social media and facilitating online advertising. In current research on automated visual sentiment assessment, images are mainly input and processed as a whole. However, human attention is biased, and a focal region with high acuity can disproportionately influence visual sentiment. To investigate how attention influences visual sentiment, we conducted experiments that reveal critical insights into human perception. We discover that negative sentiments are elicited by the focal region without a notable influence of contextual information, whereas positive sentiments are influenced by both focal and contextual information. Building on these insights, we create new deep convolutional neural networks for sentiment prediction that have additional channels devoted to encoding focal information. On two benchmark datasets, the proposed models demonstrate superior performance compared with the state-of-the-art methods. Extensive visualizations and statistical analyses indicate that the focal channels are more effective on images with focal objects, especially for images that also elicit negative sentiments.", "citation": "Not cited", "departments": ["National University of Singapore", "University of Minnesota", "National University of Singapore", "Southern Utah University", "National University of Singapore"], "authors": ["Shaojing Fan.....http://dblp.org/pers/hd/f/Fan:Shaojing", "Ming Jiang.....http://dblp.org/pers/hd/j/Jiang:Ming", "Zhiqi Shen.....http://dblp.org/pers/hd/s/Shen:Zhiqi", "Bryan L. Koenig.....http://dblp.org/pers/hd/k/Koenig:Bryan_L=", "Mohan S. Kankanhalli.....http://dblp.org/pers/hd/k/Kankanhalli:Mohan_S=", "Qi Zhao.....http://dblp.org/pers/hd/z/Zhao:Qi"], "conf": "mm", "year": "2017", "pages": 9}