{"title": "CatCharger: Deploying wireless charging lanes in a metropolitan road network through categorization and clustering of vehicle traffic.", "fields": ["software deployment", "downtime", "inductive charging", "operability", "wireless power transfer"], "abstract": "The future generation of transportation system will be featured by electrified public transportation. To fulfill metropolitan transit demands, electric vehicles (EVs) must be continuously operable without recharging downtime. Wireless Power Transfer (WPT) techniques for in-motion EV charging is a solution. It however brings up a challenge: how to deploy charging lanes in a metropolitan road network to minimize the deployment cost while enabling EVs' continuous operability. In this paper, we propose CatCharger, which is the first work that handles this challenge. From a metropolitan-scale dataset collected from multiple sources of vehicles, we observe the diversity of vehicle passing speed and daily visit frequency (called traffic attributes) at intersections (i.e., landmarks), which are important factors for charging lane deployment. To select landmarks for deployment, we first group landmarks with similar traffic attribute values using the entropy minimization clustering method, and choose better candidate landmarks from each group suitable for deployment. To determine the deployment locations from the candidate landmarks, we infer the expected vehicle residual energy at each landmark using a Kernel Density Estimator fed by the vehicles' mobility, and formulate and solve an optimization problem to minimize the total deployment cost while ensuring a certain level of expected residual energy of EVs at each landmark. Our trace-driven experiments demonstrate the superior performance of CatCharger over other methods.", "citation": "Citations (7)", "departments": ["University of Virginia", "University of Virginia", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Clemson University"], "authors": ["Li Yan.....http://dblp.org/pers/hd/y/Yan_0004:Li", "Haiying Shen.....http://dblp.org/pers/hd/s/Shen:Haiying", "Juanjuan Zhao.....http://dblp.org/pers/hd/z/Zhao:Juanjuan", "Chengzhong Xu.....http://dblp.org/pers/hd/x/Xu:Chengzhong", "Feng Luo.....http://dblp.org/pers/hd/l/Luo_0001:Feng", "Chenxi Qiu.....http://dblp.org/pers/hd/q/Qiu:Chenxi"], "conf": "infocom", "year": "2017", "pages": 9}