{"title": "Optimized Honest-Majority MPC for Malicious Adversaries - Breaking the 1 Billion-Gate Per Second Barrier.", "fields": ["secure two party computation", "adversary", "secure multi party computation", "cache", "and gate"], "abstract": "Secure multiparty computation enables a set of parties to securely carry out a joint computation of their private inputs without revealing anything but the output. In the past few years, the efficiency of secure computation protocols has increased in leaps and bounds. However, when considering the case of security in the presence of malicious adversaries (who may arbitrarily deviate from the protocol specification), we are still very far from achieving high efficiency. In this paper, we consider the specific case of three parties and an honest majority. We provide general techniques for improving efficiency of cut-and-choose protocols on multiplication triples and utilize them to significantly improve the recently published protocol of Furukawa et al. (ePrint 2016/944). We reduce the bandwidth of their protocol down from 10 bits per AND gate to 7 bits per AND gate, and show how to improve some computationally expensive parts of their protocol. Most notably, we design cache-efficient shuffling techniques for implementing cut-and-choose without randomly permuting large arrays (which is very slow due to continual cache misses). We provide a combinatorial analysis of our techniques, bounding the cheating probability of the adversary. Our implementation achieves a rate of approximately 1.15 billion AND gates per second on a cluster of three 20-core machines with a 10Gbps network. Thus, we can securely compute 212,000 AES encryptions per second (which is hundreds of times faster than previous work for this setting). Our results demonstrate that high-throughput secure computation for malicious adversaries is possible.", "citation": "Citations (6)", "departments": ["NEC", "Bar-Ilan University", "NEC", "Queens College", "Bar-Ilan University"], "authors": ["Toshinori Araki.....http://dblp.org/pers/hd/a/Araki:Toshinori", "Assi Barak.....http://dblp.org/pers/hd/b/Barak:Assi", "Jun Furukawa.....http://dblp.org/pers/hd/f/Furukawa_0001:Jun", "Tamar Lichter.....http://dblp.org/pers/hd/l/Lichter:Tamar", "Yehuda Lindell.....http://dblp.org/pers/hd/l/Lindell:Yehuda", "Ariel Nof.....http://dblp.org/pers/hd/n/Nof:Ariel", "Kazuma Ohara.....http://dblp.org/pers/hd/o/Ohara:Kazuma", "Adi Watzman.....http://dblp.org/pers/hd/w/Watzman:Adi", "Or Weinstein.....http://dblp.org/pers/hd/w/Weinstein:Or"], "conf": "sp", "year": "2017", "pages": 20}