{"title": "ShareRender: Bypassing GPU Virtualization to Enable Fine-grained Resource Sharing for Cloud Gaming.", "fields": ["rendering", "cloud gaming", "workload", "virtualization", "shared resource"], "abstract": "Cloud gaming is promising to provide high-quality game services by outsourcing game execution to cloud so that users can access games via thin clients (e.g., smartphones or tablets). However, existing cloud gaming systems su er from low GPU utilization in the virtualized environment. Moreover, GPU resources are scheduled in units of  virtual machines  (VMs) and this kind of coarse-grained scheduling at the VM-level fails to fully exploit GPU processing capacity. In this paper, we present ShareRender, a cloud gaming sys- tem that o oads graphics workloads within VMs directly to GPUs, bypassing GPU virtualization. For each game running in a VM, ShareRender starts a graphics wrapper to intercept frame rendering requests and assign them to render agents responsible for frame rendering on GPUs. Thanks to the exible workload assignment among multiple render agents, ShareRender enables ne-grained resource sharing at the frame-level to signi cantly improve GPU utilization. Further more, we design an online algorithm to determine workload assignment and migration of render agents, which considers the tradeo between minimizing the number of active server and low agent migration cost. We conduct experiments on real deployment and trace-driven simulations to evaluate the performance of ShareRender under di erent system settings. The results show that ShareRender outperforms the existing video-streaming-based cloud gaming system by over 4 times.", "citation": "Not cited", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "University of Aizu", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Wei Zhang.....http://dblp.org/pers/hd/z/Zhang_0086:Wei", "Xiaofei Liao.....http://dblp.org/pers/hd/l/Liao:Xiaofei", "Peng Li.....http://dblp.org/pers/hd/l/Li_0017:Peng", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai", "Li Lin.....http://dblp.org/pers/hd/l/Lin:Li"], "conf": "mm", "year": "2017", "pages": 9}