{"title": "Your face your heart: Secure mobile face authentication with photoplethysmograms.", "fields": ["exploit", "liveness", "adversary", "mobile device", "authentication"], "abstract": "Face authentication emerges as a powerful method for preventing unauthorized access to mobile devices. It is, however, vulnerable to photo-based forgery attacks (PFA) and videobased forgery attacks (VFA), in which the adversary exploits a photo or video containing the user's frontal face. Effective defenses against PFA and VFA often rely on liveness detection, which seeks to find a live indicator that the submitted face photo or video of the legitimate user is indeed captured in real time. In this paper, we propose FaceHeart, a novel and practical face authentication system for mobile devices. FaceHeart simultaneously takes a face video with the front camera and a fingertip video with the rear camera on COTS mobile devices. It then achieves liveness detection by comparing the two photoplethysmograms independently extracted from the face and fingertip videos, which should be highly consistent if the two videos are for the same live person and taken at the same time. As photoplethysmograms are closely tied to human cardiac activity and almost impossible to forge or control, FaceHeart is strongly resilient to PFA and VFA. Extensive user experiments on Samsung Galaxy S5 have confirmed the high efficacy and efficiency of FaceHeart.", "citation": "Citations (2)", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Arizona State University", "University of Delaware"], "authors": ["Yimin Chen.....http://dblp.org/pers/hd/c/Chen:Yimin", "Jingchao Sun.....http://dblp.org/pers/hd/s/Sun:Jingchao", "Xiaocong Jin.....http://dblp.org/pers/hd/j/Jin:Xiaocong", "Tao Li.....http://dblp.org/pers/hd/l/Li:Tao", "Rui Zhang.....http://dblp.org/pers/hd/z/Zhang_0007:Rui", "Yanchao Zhang.....http://dblp.org/pers/hd/z/Zhang:Yanchao"], "conf": "infocom", "year": "2017", "pages": 9}