{"title": "Non-concave network utility maximization: A distributed optimization approach.", "fields": ["traffic generation model", "traffic engineering", "distributed algorithm", "network utility", "network traffic control"], "abstract": "This paper proposes an algorithm for optimal decentralized traffic engineering in communication networks. We aim at distributing the traffic among the available routes such that the network utility is maximized. In some practical applications, modeling network utility using non-concave functions is of particular interest, e.g., video streaming. Therefore, we tackle the problem of optimizing a generalized class of non-concave utility functions. The approach used to solve the resulting non-convex network utility maximization (NUM) problem relies on designing a sequence of convex relaxations whose solutions converge to that of the original problem. A distributed algorithm is proposed for the solution of the convex relaxation. Each user independently controls its traffic in a way that drives the overall network traffic allocation to an optimal operating point subject to network capacity constraints. All computations required by the algorithm are performed independently and locally at each user using local information and minimal communication overhead. The only non-local information needed is binary feedback from congested links. The robustness of the algorithm is demonstrated, where the traffic is shown to be automatically rerouted in case of a link failure or having new users joining the network. Numerical simulation results are presented to validate our findings.", "citation": "Not cited", "departments": ["Pennsylvania State University", "Peking University", "Pennsylvania State University", "Pennsylvania State University", "University of Texas at Arlington"], "authors": ["Mahmoud Ashour.....http://dblp.org/pers/hd/a/Ashour:Mahmoud", "Jingyao Wang.....http://dblp.org/pers/hd/w/Wang:Jingyao", "Constantino Lagoa.....http://dblp.org/pers/hd/l/Lagoa:Constantino", "Necdet Serhat Aybat.....http://dblp.org/pers/hd/a/Aybat:Necdet_Serhat", "Hao Che.....http://dblp.org/pers/hd/c/Che:Hao"], "conf": "infocom", "year": "2017", "pages": 9}