{"title": "An efficient randomized algorithm for rumor blocking in online social networks.", "fields": ["randomized algorithm", "social network", "limiting", "greedy algorithm", "approximation algorithm", "mathematical optimization", "machine learning", "rumor"], "abstract": "Social networks allow rapid spread of ideas and innovations while the negative information can also propagate widely. When the cascades with different opinions reaching the same user, the cascade arriving first is the most likely to be taken by the user. Therefore, once misinformation or rumor is detected, a natural containment method is to introduce a positive cascade competing against the rumor. Given a budget k, the rumor blocking problem asks for k seed users to trigger the spread of the positive cascade such that the number of the users who are not influenced by rumor can be maximized. The prior works have shown that the rumor blocking problem can be approximated within a factor of (1 − 1/e− δ) by a classic greedy algorithm combined with Monte Carlo simulation with the running time of O(k 3  mn ln n/δ 2 ), where n and m are the number of users and edges, respectively. Unfortunately, the Monte-Carlo-simulation-based methods are extremely time consuming and the existing algorithms either trade performance guarantees for practical efficiency or vice versa. In this paper, we present a randomized algorithm which runs in O(km ln n/δ 2 ) expected time and provides a (1 − 1/e − δ)-approximation with a high probability. The experimentally results on both the real-world and synthetic social networks have shown that the proposed randomized rumor blocking algorithm is much more efficient than the state-of-the-art method and it is able to find the seed nodes which are effective in limiting the spread of rumor.", "citation": "Not cited", "departments": ["University of Texas at Dallas", "Taiyuan University of Technology", "Renmin University of China", "Renmin University of China", "University of Texas at Dallas"], "authors": ["Guangmo Amo Tong.....http://dblp.org/pers/hd/t/Tong:Guangmo_Amo", "Weili Wu.....http://dblp.org/pers/hd/w/Wu:Weili", "Ling Guo.....http://dblp.org/pers/hd/g/Guo:Ling", "Deying Li.....http://dblp.org/pers/hd/l/Li:Deying", "Cong Liu.....http://dblp.org/pers/hd/l/Liu_0005:Cong", "Bin Liu.....http://dblp.org/pers/hd/l/Liu:Bin", "Ding-Zhu Du.....http://dblp.org/pers/hd/d/Du:Ding=Zhu"], "conf": "infocom", "year": "2017", "pages": 9}