{"title": "Hazelnut: a bidirectionally typed structure editor calculus.", "fields": ["metatheory", "agda", "gradual typing", "structure editor", "proof assistant"], "abstract": "Structure editors  allow programmers to edit the tree structure of a program directly. This can have cognitive benefits, particularly for novice and end-user programmers. It also simplifies matters for tool designers, because they do not need to contend with malformed program text.   This paper introduces Hazelnut, a structure editor based on a small bidirectionally typed lambda calculus extended with  holes  and a  cursor . Hazelnut goes one step beyond syntactic well-formedness: its edit actions operate over statically meaningful incomplete terms. Naively, this would force the programmer to construct terms in a rigid â  outside-inâ   manner. To avoid this problem, the action semantics automatically places terms assigned a type that is inconsistent with the expected type  inside  a hole. This meaningfully defers the type consistency check until the term inside the hole is  finished .   Hazelnut is not intended as an end-user tool itself. Instead, it serves as a foundational account of typed structure editing. To that end, we describe how Hazelnutâ  s rich metatheory, which we have mechanized using the Agda proof assistant, serves as a guide when we extend the calculus to include binary sum types. We also discuss various interpretations of holes, and in so doing reveal connections with gradual typing and contextual modal type theory, the Curry-Howard interpretation of contextual modal logic. Finally, we discuss how Hazelnutâ  s semantics lends itself to implementation as an event-based functional reactive program. Our simple reference implementation is written using js_of_ocaml.", "citation": "Citations (5)", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Oregon State University", "Carnegie Mellon University", "University of Colorado Boulder"], "authors": ["Cyrus Omar.....http://dblp.org/pers/hd/o/Omar:Cyrus", "Ian Voysey.....http://dblp.org/pers/hd/v/Voysey:Ian", "Michael Hilton.....http://dblp.org/pers/hd/h/Hilton:Michael", "Jonathan Aldrich.....http://dblp.org/pers/hd/a/Aldrich:Jonathan", "Matthew A. Hammer.....http://dblp.org/pers/hd/h/Hammer:Matthew_A="], "conf": "popl", "year": "2017", "pages": 14}