{"title": "iGuard: A real-time anti-theft system for smartphones.", "fields": ["personal property", "markov process", "open problem", "phone", "android", "markov chain"], "abstract": "Smartphone theft is a non-negligible problem that causes serious concerns on personal property, privacy, and public security. The existing solutions to this problem either provide only functions like retrieving a phone, or require dedicated hardware to detect thefts. How to protect smartphones from being stolen at all times is still an open problem. In this paper, we propose iGuard, a real-time anti-theft system for smartphones. iGuard utilizes only the inertial sensing data from the smartphone. The basic idea behind iGuard is to distinguish different people holding a smartphone, by identifying the order of the motions during the ‘take-out’ behavior and how each motion is performed. For this purpose, we design a motion segmentation algorithm to detect the transition between two motions from the noisy sensing data. We then leverage the distinct feature contained in each sub-segment of a motion, instead of the entire motion, to estimate the probability that the motion is performed by the smartphone owner himself/herself. Based on such pre-processed data, we propose a Markov Chain based model to track the behavior of a smartphone user. According to this model, iGuard instantly alarms once the tracked data deviate from the smartphone owner's usual habit. We implement iGuard on Android and evaluate its performance in real environments. The experimental results show that iGuard is accurate and robust in various scenarios.", "citation": "Not cited", "year": "2017", "departments": ["Northwest University", "Tsinghua University", "Northwest University", "Northwest University", "Northwest University", "Northwest University", "Tsinghua University", "Northwest University", "Northwest University", "Northwest University"], "conf": "infocom", "authors": ["Meng Jin.....http://dblp.org/pers/hd/j/Jin:Meng", "Yuan He.....http://dblp.org/pers/hd/h/He:Yuan", "Dingyi Fang.....http://dblp.org/pers/hd/f/Fang:Dingyi", "Xiaojiang Chen.....http://dblp.org/pers/hd/c/Chen:Xiaojiang", "Xin Meng.....http://dblp.org/pers/hd/m/Meng:Xin", "Tianzhang Xing.....http://dblp.org/pers/hd/x/Xing:Tianzhang"], "pages": 9}