{"title": "Mobile Collaboration for Human and Canine Police Explosive Detection Teams.", "fields": ["explosive device", "safer", "backup", "mobile collaboration", "explosive detection"], "abstract": "We designed a communication system for law enforcement officers to use when conducting explosive detection searches with multiple agencies. Dogs trained in explosive detection work alongside human handlers to form a K9 team, which are an integral part of these searches. Officers in K9 teams have a strong bond and communication with these dogs, but noisy locations, long distances, and crowded spaces present challenges. In addition, other officers assigned as backup often lack the experience to read the cues from the canine, which hinders the speed and effectiveness of the team. Coordinating a search with teams from different municipalities presents challenges due to a lack of standard collaboration tools. Getting the right information as quickly as possible saves lives, whether this information is about the areas that have been searched or the location of an explosive device. We hope that in addition to increasing public safety, our system will make working conditions safer for law enforcement officers and their canines.", "citation": "Citations (1)", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Joelle Alcaidinho.....http://dblp.org/pers/hd/a/Alcaidinho:Joelle", "Larry Freil.....http://dblp.org/pers/hd/f/Freil:Larry", "Taylor Kelly.....http://dblp.org/pers/hd/k/Kelly:Taylor", "Kayla Marland.....http://dblp.org/pers/hd/m/Marland:Kayla", "Chunhui Wu.....http://dblp.org/pers/hd/w/Wu:Chunhui", "Bradley Wittenbrook.....http://dblp.org/pers/hd/w/Wittenbrook:Bradley", "Giancarlo Valentin.....http://dblp.org/pers/hd/v/Valentin:Giancarlo", "Melody Moore Jackson.....http://dblp.org/pers/hd/j/Jackson:Melody_Moore"], "conf": "cscw", "year": "2017", "pages": 9}