{"title": "A Simulated Annealing Based Inexact Oracle for Wasserstein Loss Minimization.", "fields": ["oracle", "gibbs sampling", "matrix decomposition", "markov chain monte carlo", "barrier function"], "abstract": "Learning under a Wasserstein loss is an emerging research topic. We call collectively the problems formulated under this framework Wasserstein loss minimization (WLM). One important appeal of WLM is the innate capability to account for the similarity between atoms or features, while the usual decomposable losses treat the features as separate dimensions. Despite being conceptually simple, WLM problems are computationally challenging because they involve minimizing over functions of quantities (i.e., Wasserstein distances) that themselves require numerical algorithms to compute. Most recent approaches use an entropy-type barrier function on the primal domain, resulting in fast optimization with a smoothed Wasserstein loss. In this paper, we introduce a new technique based on simulated annealing, a stochastic approach that implicitly uses a distance-matrix-dependent barrier on the dual domain. With this approach, we can draw on a rich body of work on Markov chain Monte Carlo. We have developed a Gibbs sampler to approximate effectively and efficiently the partial gradients of a sequence of Wasserstein losses. Our new approach has the advantages of numerical stability and readiness for warm starts. These characteristics are valuable for WLM problems that often require multiple levels of iterations in which the oracle for computing the value and gradient of a loss function is embedded. We applied the method to optimal transport with Coulomb cost and the Wasserstein non-negative matrix factorization problem, and made comparisons with the existing method of entropy regularization.", "citation": "Not cited", "year": "2017", "departments": ["Penn State College of Information Sciences and Technology", "Pennsylvania State University", "Pennsylvania State University"], "conf": "icml", "authors": ["Jianbo Ye.....http://dblp.org/pers/hd/y/Ye:Jianbo", "James Ze Wang.....http://dblp.org/pers/hd/w/Wang:James_Ze", "Jia Li.....http://dblp.org/pers/hd/l/Li_0001:Jia"], "pages": 9}