{"title": "Supporting Self-Care of Adolescents with Nut Allergy Through Video and Mobile Educational Tools.", "fields": ["patient education", "self care", "food allergy", "anaphylaxis", "branching"], "abstract": "Anaphylaxis is a life-threatening allergic reaction which is rapid in onset. Adolescents living with anaphylaxis risk often lack the knowledge and skills required to safely manage their condition or talk to friends about it. We designed an educational intervention comprising group discussion around videos of simulated anaphylaxis scenarios and a mobile application containing video-based branching anaphylaxis narratives. We trialed the intervention with 36 nut allergic adolescents. At 1-year follow-up participants had improved adrenaline auto-injector skills and carriage, disease- and age-specific Quality of Life and confidence in anaphylaxis management. At 3-year follow-up adrenaline carriage improved further and confidence remained higher. Participants expressed how the education session was a turning point in taking control of their allergy and how the app facilitated sharing about anaphylaxis with others. We contribute insights regarding design of mobile self-care and peer-support applications for health in adolescence, and discuss strengths and limitations of video-based mobile health interventions.", "citation": "Citations (1)", "year": "2017", "departments": ["Boston Children's Hospital", "Northumbria University", "Newcastle University", "Northumbria University", "Northumbria University"], "conf": "chi", "authors": ["Neil Davidson.....http://dblp.org/pers/hd/d/Davidson:Neil", "John Vines.....http://dblp.org/pers/hd/v/Vines:John", "Tom Bartindale.....http://dblp.org/pers/hd/b/Bartindale:Tom", "Selina Sutton.....http://dblp.org/pers/hd/s/Sutton:Selina", "David Philip Green.....http://dblp.org/pers/hd/g/Green:David_Philip", "Rob Comber.....http://dblp.org/pers/hd/c/Comber:Rob", "Madeline Balaam.....http://dblp.org/pers/hd/b/Balaam:Madeline", "Patrick Olivier.....http://dblp.org/pers/hd/o/Olivier:Patrick", "Gillian Vance.....http://dblp.org/pers/hd/v/Vance:Gillian"], "pages": 15}