{"title": "Secret-sharing-based secure user recruitment protocol for mobile crowdsensing.", "fields": ["cryptography", "mobile telephony", "secret sharing", "crowdsensing", "submodular set function"], "abstract": "Mobile crowdsensing is a new paradigm in which a requester can recruit a group of mobile users via a platform and coordinate them to perform some sensing tasks by using their smartphones. In mobile crowdsensing, each user might perform multiple tasks with different sensing qualities. An important problem is recruiting the minimum number of users while achieving a satisfactory sensing quality for each task. Meanwhile, in order to ease users' worries about privacy disclosures, the user recruitment process needs to protect each user's sensing quality information from being revealed to other users or to the platform. We prove that this problem is NP-hard. To solve this problem, we first propose a Basic User Recruitment (BUR) protocol based on a greedy strategy, which can recruit nearly the minimum amount of users while ensuring that the total sensing quality of each task is no less than a given threshold. Based on BUR, we further propose a Secure User Recruitment (SUR) protocol by using secret sharing schemes. We analyze the approximation ratio and prove the security of the SUR protocol in the semi-honest model. Moreover, we extend SUR to deal with a more general case where the total sensing quality of each task might be an increasing submodular function. Finally, we demonstrate the significant performance of the proposed protocol through extensive simulations and execution in real smartphones.", "citation": "Citations (1)", "departments": ["University of Science and Technology of China", "Temple University", "Nanjing University", "University of Science and Technology of China"], "authors": ["Mingjun Xiao.....http://dblp.org/pers/hd/x/Xiao:Mingjun", "Jie Wu.....http://dblp.org/pers/hd/w/Wu_0001:Jie", "Sheng Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Sheng", "Jiapeng Yu.....http://dblp.org/pers/hd/y/Yu:Jiapeng"], "conf": "infocom", "year": "2017", "pages": 9}