{"title": "Optimizing test placement for module-level regression testing.", "fields": ["test harness", "test suite", "build verification test", "regression testing", "test script"], "abstract": "Modern build systems help increase developer productivity by performing incremental building and testing. These build systems view a software project as a group of interdependent modules and perform regression test selection at the module level. However, many large software projects have imprecise dependency graphs that lead to wasteful test executions. If a test belongs to a module that has more dependencies than the actual dependencies of the test, then it is executed unnecessarily whenever a code change impacts those additional dependencies.   In this paper, we formulate the problem of wasteful test executions due to suboptimal placement of tests in modules. We propose a greedy algorithm to reduce the number of test executions by suggesting test movements while considering historical build information and actual dependencies of tests. We have implemented our technique, called TestOptimizer, on top of CloudBuild, the build system developed within Microsoft over the last few years. We have evaluated the technique on five large proprietary projects. Our results show that the suggested test movements can lead to a reduction of 21.66 million test executions (17.09%) across all our subject projects. We received encouraging feedback from the developers of these projects; they accepted and intend to implement a80% of our reported suggestions.", "citation": "Citations (3)", "departments": ["University of Illinois at Urbana–Champaign", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["August Shi.....http://dblp.org/pers/hd/s/Shi:August", "Suresh Thummalapenta.....http://dblp.org/pers/hd/t/Thummalapenta:Suresh", "Shuvendu K. Lahiri.....http://dblp.org/pers/hd/l/Lahiri:Shuvendu_K=", "Nikolaj Bjørner.....http://dblp.org/pers/hd/b/Bj=oslash=rner:Nikolaj", "Jacek Czerwonka.....http://dblp.org/pers/hd/c/Czerwonka:Jacek"], "conf": "icse", "year": "2017", "pages": 11}