{"title": "Bimodal Distribution and Co-Bursting in Review Spam Detection.", "fields": ["hidden markov model", "spambot", "spamming", "bursting", "world wide web"], "abstract": "Online reviews play a crucial role in helping consumers evaluate and compare products and services. This critical importance of reviews also incentivizes fraudsters (or spammers) to write fake or spam reviews to secretly promote or demote some target products and services. Existing approaches to detecting spam reviews and reviewers employed review contents, reviewer behaviors, star rating patterns, and reviewer-product networks for detection. In this research, we further discovered that reviewers' posting rates (number of reviews written in a period of time) also follow an interesting distribution pattern, which has not been reported before. That is, their posting rates are bimodal. Multiple spammers also tend to collectively and actively post reviews to the same set of products within a short time frame, which we call co-bursting. Furthermore, we found some other interesting patterns in individual reviewers' temporal dynamics and their co-bursting behaviors with other reviewers. Inspired by these findings, we first propose a two-mode Labeled Hidden Markov Model to model spamming using only individual reviewers' review posting times. We then extend it to the Coupled Hidden Markov Model to capture both reviewer posting behaviors and co-bursting signals. Our experiments show that the proposed model significantly outperforms state-of-the-art baselines in identifying individual spammers. Furthermore, we propose a co-bursting network based on co-bursting relations, which helps detect groups of spammers more effectively than existing approaches.", "citation": "Citations (10)", "departments": ["University of Illinois at Chicago", "University of Illinois at Chicago", "University of Illinois at Chicago", "Unversity of Il ... icago, IL, USA", "Unversity of Il ... icago, IL, USA"], "authors": ["Huayi Li.....http://dblp.org/pers/hd/l/Li:Huayi", "Geli Fei.....http://dblp.org/pers/hd/f/Fei:Geli", "Shuai Wang.....http://dblp.org/pers/hd/w/Wang:Shuai", "Bing Liu.....http://dblp.org/pers/hd/l/Liu_0001:Bing", "Weixiang Shao.....http://dblp.org/pers/hd/s/Shao:Weixiang", "Arjun Mukherjee.....http://dblp.org/pers/hd/m/Mukherjee:Arjun", "Jidong Shao.....http://dblp.org/pers/hd/s/Shao:Jidong"], "conf": "www", "year": "2017", "pages": 10}