{"title": "Freedom versus Standardization: Structured Data Generation in a Peer Production Community.", "fields": ["data modeling", "usable", "sociotechnical system", "peer production", "metadata"], "abstract": "In addition to encyclopedia articles and software, peer production communities produce structured data, e.g., Wikidata and OpenStreetMap's metadata. Structured data from peer production communities has become increasingly important due to its use by computational applications, such as CartoCSS, MapBox, and Wikipedia infoboxes. However, this structured data is usable by applications only if it follows standards. We did an interview study focused on OpenStreetMap's knowledge production processes to investigate how -- and how successfully -- this community creates and applies its data standards. Our study revealed a fundamental tension between the need to produce structured data in a standardized way and OpenStreetMap's tradition of contributor freedom. We extracted six themes that manifested this tension and three overarching concepts, correctness, community, and code, which help make sense of and synthesize the themes. We also offered suggestions for improving OpenStreetMap's knowledge production processes, including new data models, sociotechnical tools, and community practices (e.g. stronger leadership).", "citation": "Citations (4)", "year": "2017", "departments": ["University of Minnesota", "University of Minnesota", "University of Minnesota", "Northwestern University", "Macalester College"], "conf": "chi", "authors": ["Andrew Hall.....http://dblp.org/pers/hd/h/Hall:Andrew", "Sarah McRoberts.....http://dblp.org/pers/hd/m/McRoberts:Sarah", "Jacob Thebault-Spieker.....http://dblp.org/pers/hd/t/Thebault=Spieker:Jacob", "Yilun Lin.....http://dblp.org/pers/hd/l/Lin:Yilun", "Shilad Sen.....http://dblp.org/pers/hd/s/Sen:Shilad", "Brent J. Hecht.....http://dblp.org/pers/hd/h/Hecht:Brent_J=", "Loren G. Terveen.....http://dblp.org/pers/hd/t/Terveen:Loren_G="], "pages": 11}