{"title": "Automated Recurrence Analysis for Almost-Linear Expected-Runtime Bounds.", "fields": ["asymptotically optimal algorithm", "logarithm", "quadratic equation", "randomized algorithm", "recurrence relation"], "abstract": "We consider the problem of developing automated techniques for solving recurrence relations to aid the expected-runtime analysis of programs. The motivation is that several classical textbook algorithms have quite efficient expected-runtime complexity, whereas the corresponding worst-case bounds are either inefficient (e.g., Quick-Sort), or completely ineffective (e.g., Coupon-Collector). Since the main focus of expected-runtime analysis is to obtain efficient bounds, we consider bounds that are either logarithmic, linear or almost-linear (\\(\\mathcal {O}(\\log {n})\\), \\(\\mathcal {O}(n)\\), \\(\\mathcal {O}(n\\cdot \\log {n})\\), respectively, where n represents the input size). Our main contribution is an efficient (simple linear-time algorithm) sound approach for deriving such expected-runtime bounds for the analysis of recurrence relations induced by randomized algorithms. The experimental results show that our approach can efficiently derive asymptotically optimal expected-runtime bounds for recurrences of classical randomized algorithms, including Randomized-Search, Quick-Sort, Quick-Select, Coupon-Collector, where the worst-case bounds are either inefficient (such as linear as compared to logarithmic expected-runtime complexity, or quadratic as compared to linear or almost-linear expected-runtime complexity), or ineffective.", "citation": "Citations (4)", "year": "2017", "departments": ["Institute of Science and Technology Austria", "Chinese Academy of Sciences", "Indian Institute of Technology Bombay"], "conf": "cav", "authors": ["Krishnendu Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Krishnendu", "Hongfei Fu.....http://dblp.org/pers/hd/f/Fu:Hongfei", "Aniket Murhekar.....http://dblp.org/pers/hd/m/Murhekar:Aniket"], "pages": 22}