{"title": "V-Tree: Efficient kNN Search on Moving Objects with Road-Network Constraints.", "fields": ["tree", "intelligent transportation system", "vertex", "tree structure", "search tree"], "abstract": "Intelligent transportation systems, e.g., Uber, have become an important tool for urban transportation. An important problem is k nearest neighbor (kNN) search on moving objects with road-network constraints, which, given moving objects on the road networks and a query, finds k nearest objects to the query location. Existing studies focus on either kNN search on static objects or continuous kNN search with Euclidean-distance constraints. The former cannot support dynamic updates of moving objects while the latter cannot support road networks. Since the objects are dynamically moving on the road networks, there are two main challenges. The first is how to index the moving objects on road networks and the second is how to find the k nearest moving objects. To address these challenges, in this paper we proposes a new index, V-Tree, which has two salient features. Firstly, it is a balanced search tree and can support efficient kNN search. Secondly, it can support dynamical updates of moving objects. To build a V-Tree, we iteratively partition the road network into sub-networks and build a tree structure on top of the sub-networks. Then we associate the moving objects on their nearest vertices in the V-Tree. When the location of an object is updated, we only need to update the tree nodes on the path from the corresponding leaf node to the root. We design a novel kNN search algorithm using V-Tree by pruning large numbers of irrelevant vertices in the road network. Experimental results on real datasets show that our method significantly outperforms baseline approaches by 2-3 orders of magnitude.", "citation": "Citations (3)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Bilong Shen.....http://dblp.org/pers/hd/s/Shen:Bilong", "Ying Zhao.....http://dblp.org/pers/hd/z/Zhao:Ying", "Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Weimin Zheng.....http://dblp.org/pers/hd/z/Zheng:Weimin", "Yue Qin.....http://dblp.org/pers/hd/q/Qin:Yue", "Bo Yuan.....http://dblp.org/pers/hd/y/Yuan:Bo", "Yongming Rao.....http://dblp.org/pers/hd/r/Rao:Yongming"], "conf": "icde", "year": "2017", "pages": 12}