{"title": "Synchronous Collaborative Writing in the Classroom: Undergraduates' Collaboration Practices and their Impact on Writing Style, Quality, and Quantity.", "fields": ["empirical research", "writing style", "information visualization", "computer supported cooperative work", "collaborative writing"], "abstract": "Group activities that use Google Docs for simultaneous collaborative writing and editing are increasingly common in higher education. Although studies show that synchronous collaboration can bring multiple benefits, such as enhanced productivity and writing quality, little is known about these writing practices in classrooms and their impact on students' writing. Using a mixed method approach, we conducted an empirical study that explores the different styles of synchronous collaboration in 45 Google Docs documents produced by 82 undergraduate students, and how students' practices affect the specific dimensions of the final text including quality. The results suggest that (a) out of four styles, Divide and Conquer style tended to produce better quality text whereas Main Writer had the lowest quality scores, and that (b) balanced participation and amount of peer editing led to longer texts with higher quality scores for content, evidence, but not organization or mechanics. Given these results, we suggest several design features for collaborative writing systems and propose guidelines for instructional practices.", "citation": "Citations (2)", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Irvine", "University of California, Irvine", "University of California, Irvine"], "authors": ["Soobin Yim.....http://dblp.org/pers/hd/y/Yim:Soobin", "Dakuo Wang.....http://dblp.org/pers/hd/w/Wang:Dakuo", "Judith S. Olson.....http://dblp.org/pers/hd/o/Olson:Judith_S=", "Viet Vu.....http://dblp.org/pers/hd/v/Vu:Viet", "Mark Warschauer.....http://dblp.org/pers/hd/w/Warschauer:Mark"], "conf": "cscw", "year": "2017", "pages": 12}