{"title": "Chronix: Long Term Storage and Retrieval Technology for Anomaly Detection in Operational Data.", "fields": ["memory footprint", "data retrieval", "storage efficiency", "time series database", "anomaly detection"], "abstract": "Anomalies in the runtime behavior of software systems, especially in distributed systems, are inevitable, expensive, and hard to locate. To detect and correct such anomalies (like instability due to a growing memory consumption, failure due to load spikes, etc.) one has to automatically collect, store, and analyze the operational data of the runtime behavior, often represented as time series. There are efficient means both to collect and analyze the runtime behavior. But traditional time series databases do not yet focus on the specific needs of anomaly detection (generic data model, specific built-in functions, storage efficiency, and fast query execution).\n\nThe paper presents Chronix, a domain specific time series database targeted at anomaly detection in operational data. Chronix uses an ideal compression and chunking of the time series data, a methodology for commissioning Chronix' parameters to a sweet spot, a way of enhancing the data with attributes, an expandable set of analysis functions, and other techniques to achieve both faster query times and a significantly smaller memory footprint. On benchmarks Chronix saves 20%-68% of the space that other time series databases need to store the data and saves 80%-92% of the data retrieval time and 73%-97% of the runtime of analyzing functions.", "citation": "Citations (2)", "departments": ["QAware GmbH, Munich, Germany", "University Erla ... Group, Germany", "University Erla ... Group, Germany", "QAware GmbH, Munich, Germany"], "authors": ["Florian Lautenschlager.....http://dblp.org/pers/hd/l/Lautenschlager:Florian", "Michael Philippsen.....http://dblp.org/pers/hd/p/Philippsen:Michael", "Andreas Kumlehn.....http://dblp.org/pers/hd/k/Kumlehn:Andreas", "Josef Adersberger.....http://dblp.org/pers/hd/a/Adersberger:Josef"], "conf": "fast", "year": "2017", "pages": 14}