{"title": "TUM: Towards ubiquitous multi-device localization for cross-device interaction.", "fields": ["file sharing", "mobile computing", "authentication", "ambiguity", "real time computing"], "abstract": "Cross-device interaction is becoming an increasingly hot topic as we often have multiple devices at our immediate disposal in this era of mobile computing. Various cross-device applications such as file sharing, multi-screen display, and cross-device authentication have been proposed and investigated. However, one of the most fundamental enablers remains unsolved: How to achieve ubiquitous multi-device localization? Though pioneer efforts have resorted to gesture-assisted or sensing-assisted localization, they either require extensive user participation or impose some strong assumptions on device sensing abilities. This introduces extra costs and constraints, and thus degrades their practicality. To overcome these limitations, we propose TUM, an acoustic-assisted localization scheme Towards Ubiquitous Multi-device localization. The basic idea of TUM is to utilize the dual-microphones and speakers to obtain distance cues among devices. At the same time it resolves the location ambiguity with the help of MEMS sensors. We devise techniques for distance constraint extraction, static localization, continuous localization, and multi-device localization, and build a prototype that runs on commodity devices. Extensive experiments show that TUM provides a real-time 3D relative localization service under 10cm mean error for both static and continuous localization.", "citation": "Citations (1)", "departments": ["Hong Kong University of Science and Technology", "Tsinghua University", "Hong Kong University of Science and Technology", "EE, ETH", "CSE, OSU"], "authors": ["Han Xu.....http://dblp.org/pers/hd/x/Xu:Han", "Zheng Yang.....http://dblp.org/pers/hd/y/Yang_0002:Zheng", "Zimu Zhou.....http://dblp.org/pers/hd/z/Zhou:Zimu", "Ke Yi.....http://dblp.org/pers/hd/y/Yi:Ke", "Chunyi Peng.....http://dblp.org/pers/hd/p/Peng:Chunyi"], "conf": "infocom", "year": "2017", "pages": 9}