{"title": "A Multi-Task Framework for Weather Recognition.", "fields": ["discriminative model", "contextual image classification", "source code", "convolutional neural network", "multi task learning"], "abstract": "Weather recognition is important in practice, while this task has not been thoroughly explored so far. The current trend of dealing with this task is treating it as a single classification problem, i.e., determining whether a given image belongs to a certain weather category or not. However, weather recognition differs significantly from traditional image classification, since several weather features may appear simultaneously. In this case, a simple classification result is insufficient to describe the weather condition. To address this issue, we propose to provide auxiliary weather related information for comprehensive weather description. Specifically, semantic segmentation of weather-cues, such as blue sky and white clouds, is exploited as an auxiliary task in this paper. Moreover, a convolutional neural network (CNN) based multi-task framework is developed which aims to concurrently tackle weather category classification task and weather-cues segmentation task. Due to the intrinsic relationships between these two tasks, exploring auxiliary semantic segmentation of weather-cues can also help to learn discriminative features for the classification task, and thus obtain superior accuracy. To verify the effectiveness of the proposed approach, extra segmentation masks of weather-cues are generated manually on an existing weather image dataset. Experimental results have demonstrated the superior performance of our approach. The enhanced dataset, source codes and pre-trained models are available at https://github.com/wzgwzg/Multitask_Weather.", "citation": "Citations (1)", "departments": ["Chinese Academy of Sciences", "Northwestern Polytechnical University", "Chinese Academy of Sciences"], "authors": ["Xuelong Li.....http://dblp.org/pers/hd/l/Li:Xuelong", "Zhigang Wang.....http://dblp.org/pers/hd/w/Wang:Zhigang", "Xiaoqiang Lu.....http://dblp.org/pers/hd/l/Lu:Xiaoqiang"], "conf": "mm", "year": "2017", "pages": 9}