{"title": "Prediction-Based Task Assignment in Spatial Crowdsourcing.", "fields": ["quality score", "crowdsourcing", "information engineering", "grid", "budget constraint"], "abstract": "With the rapid advancement of mobile devices and crowdsourcing platforms, spatial crowdsourcing has attracted much attention from various research communities. A spatial crowdsourcing system periodically matches a number of locationbased workers with nearby spatial tasks (e.g., taking photos or videos at some specific locations). Previous studies on spatial crowdsourcing focus on task assignment strategies that maximize an assignment score based solely on the available information about workers/tasks at the time of assignment. These strategies can only achieve local optimality by neglecting the workers/tasks that may join the system in a future time. In contrast, in this paper, we aim to improve the global assignment, by considering both present and future (via predictions) workers/tasks. In particular, we formalize a new optimization problem, namely maximum quality task assignment (MQA). The optimization objective of MQA is to maximize a global assignment quality score, under a traveling budget constraint. To tackle this problem, we design an effective grid-based prediction method to estimate the spatial distributions of workers/tasks in the future, and then utilize the predictions to assign workers to tasks at any given time instance. We prove that the MQA problem is NPhard, and thus intractable. Therefore, we propose efficient heuristics to tackle the MQA problem, including MQA greedy and MQA divide-and-conquer approaches, which can efficiently assign workers to spatial tasks with high quality scores and low budget consumptions. Through extensive experiments, we demonstrate the efficiency and effectiveness of our approaches on both real and synthetic datasets.", "citation": "Citations (3)", "departments": ["Hong Kong University of Science and Technology", "Kent State University", "Hong Kong University of Science and Technology", "University of Southern California"], "authors": ["Peng Cheng.....http://dblp.org/pers/hd/c/Cheng_0003:Peng", "Xiang Lian.....http://dblp.org/pers/hd/l/Lian:Xiang", "Lei Chen.....http://dblp.org/pers/hd/c/Chen_0002:Lei", "Cyrus Shahabi.....http://dblp.org/pers/hd/s/Shahabi:Cyrus"], "conf": "icde", "year": "2017", "pages": 12}