{"title": "Malicious co-residency on the cloud: Attacks and defense.", "fields": ["cloud computing", "countermeasure", "downtime", "information leakage", "side channel attack"], "abstract": "Attacker VMs try to co-reside with victim VMs on the same physical infrastructure as a precursor to launching attacks that target information leakage. VM migration is an effective countermeasure against attempts at malicious co-residency. In this paper, we first undertake an experimental study on Amazon EC2 to obtain an in-depth understanding of the side-channels an attacker can use to ascertain co-residency with a victim. Here, we identify a new set of stealthy side-channel attacks which, we show to be more effective than currently available attacks towards verifying co-residency. Based on the study, we develop a set of guidelines to determine under what conditions victim VM migrations should be triggered given performance costs in terms of bandwidth and downtime, that a user is willing to bear. Via extensive experiments on our private in-house cloud, we show that migrations using our guidelines can limit the fraction of the time that an attacker VM co-resides with a victim VM to about 1 % of the time with bandwidth costs of a few MB and downtimes of a few seconds, per day per VM migrated.", "citation": "Not cited", "departments": ["University of California, Riverside", "University of California, Riverside", "University of California, Riverside", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Ahmed Osama Fathy Atya.....http://dblp.org/pers/hd/a/Atya:Ahmed_Osama_Fathy", "Zhiyun Qian.....http://dblp.org/pers/hd/q/Qian:Zhiyun", "Srikanth V. Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Srikanth_V=", "Thomas F. La Porta.....http://dblp.org/pers/hd/p/Porta:Thomas_F=_La", "Patrick D. McDaniel.....http://dblp.org/pers/hd/m/McDaniel:Patrick_D=", "Lisa M. Marvel.....http://dblp.org/pers/hd/m/Marvel:Lisa_M="], "conf": "infocom", "year": "2017", "pages": 9}