{"title": "Multiresolution Recurrent Neural Networks: An Application to Dialogue Response Generation.", "fields": ["perplexity", "abstraction", "natural language generation", "recurrent neural network", "technical support"], "abstract": "We introduce the multiresolution recurrent neural network, which extends the sequence-to-sequence framework to model natural language generation as two parallel discrete stochastic processes: a sequence of high-level coarse tokens, and a sequence of natural language tokens. There are many ways to estimate or learn the high-level coarse tokens, but we argue that a simple extraction procedure is sufficient to capture a wealth of high-level discourse semantics. Such procedure allows training the multiresolution recurrent neural network by maximizing the exact joint log-likelihood over both sequences. In contrast to the standard log- likelihood objective w.r.t. natural language tokens (word perplexity), optimizing the joint log-likelihood biases the model towards modeling high-level abstractions. We apply the proposed model to the task of dialogue response generation in two challenging domains: the Ubuntu technical support domain, and Twitter conversations. On Ubuntu, the model outperforms competing approaches by a substantial margin, achieving state-of-the-art results according to both automatic evaluation metrics and a human evaluation study. On Twitter, the model appears to generate more relevant and on-topic responses according to automatic evaluation metrics. Finally, our experiments demonstrate that the proposed model is more adept at overcoming the sparsity of natural language and is better able to capture long-term structure.", "citation": "Citations (30)", "departments": ["Université de Montréal", "IBM", "IBM", "IBM", "IBM"], "authors": ["Iulian Vlad Serban.....http://dblp.org/pers/hd/s/Serban:Iulian_Vlad", "Tim Klinger.....http://dblp.org/pers/hd/k/Klinger:Tim", "Gerald Tesauro.....http://dblp.org/pers/hd/t/Tesauro:Gerald", "Kartik Talamadupula.....http://dblp.org/pers/hd/t/Talamadupula:Kartik", "Bowen Zhou.....http://dblp.org/pers/hd/z/Zhou:Bowen", "Yoshua Bengio.....http://dblp.org/pers/hd/b/Bengio:Yoshua", "Aaron C. Courville.....http://dblp.org/pers/hd/c/Courville:Aaron_C="], "conf": "aaai", "year": "2017", "pages": 7}