{"title": "Joint bidding and geographical load balancing for datacenters: Is uncertainty a blessing or a curse?", "fields": ["procurement", "load management", "market price", "cost reduction", "bidding"], "abstract": "We consider the scenario where a cloud service provider (CSP) operates multiple geo-distributed datacenters to provide Internet-scale service. Our objective is to minimize the total electricity and bandwidth cost by jointly optimizing electricity procurement from wholesale markets and geographical load balancing (GLB), i.e., dynamically routing workloads to locations with cheaper electricity. Under the ideal setting where exact values of market prices and workloads are given, this problem reduces to a simple LP and is easy to solve. However, under the realistic setting where only distributions of these variables are available, the problem unfolds into a non-convex infinite-dimensional one and is challenging to solve. Our main contribution is to develop an algorithm that is proven to solve the challenging problem optimally and efficiently, by exploring the full design space of strategic bidding. Trace-driven evaluations corroborate our theoretical results, demonstrate fast convergence of our algorithm, and show that it can reduce the cost for the CSP by up to 20% as compared to baseline alternatives. Our study highlights the intriguing role of uncertainty. While variability in workloads deteriorates the cost-saving performance of joint electricity procurement and GLB, counter-intuitively, variability in market prices can be exploited to achieve a cost reduction even larger than the setting without price variability.", "citation": "Not cited", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "Xi'an Jiaotong University", "The Chinese University of Hong Kong", "Dongguan University of Technology", "The Chinese University of Hong Kong", "Xi'an Jiaotong University"], "authors": ["Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0009:Ying", "Lei Deng.....http://dblp.org/pers/hd/d/Deng:Lei", "Minghua Chen.....http://dblp.org/pers/hd/c/Chen:Minghua", "Peijian Wang.....http://dblp.org/pers/hd/w/Wang:Peijian"], "conf": "infocom", "year": "2017", "pages": 9}