{"title": "Autonomously detecting and classifying traffic accident hotspots.", "fields": ["analytics", "warning system", "cause of death", "call to action", "pedestrian"], "abstract": "The number of road traffic fatalities has been steadily increasing since 2001 and is currently the eighth leading cause of death globally, with the loss of life of 1.2 million people each year according to the World Health Organization (WHO) [11]. In addition, the National Highway Traffic Safety Administration (NHTSA) reported that the number of deaths from traffic accidents in the USA increased by 7% from 2014 to 2015, rising to 35,092 fatalities [4]. Amid growing humanitarian concerns of so many injuries and fatalities worldwide, the Department of Transport issued a call to action encouraging the continuous research into different approaches that can improve the situation. As such, there are various research studies which are geared towards how in-vehicle systems can encourage drivers to adapt their driving behaviour and help to reduce the amount of both fatal and non-fatal traffic accidents. Typically, these systems aim to prevent a collision with an upcoming vehicle or pedestrian by providing warnings to drivers, and latest studies demonstrate promising evidence that these systems can indeed have significant positive effects [2, 9, 10]. However, the vast majority of studies have focused on simulation experiments [3, 8] and controlled lab experiments [6, 13]. We have recently contributed to this field by bringing an in-vehicle warning system into a field studying setting, utilising real world location analytics on traffic accident hotspots to generate in-vehicle warnings [7]. Going one step further, the benefit of ubiquitously detecting dangerous locations from data gathered by connected vehicles, and using these locations as a source for in-vehicle warnings, has widely not been addressed in this growing domain and is the focus of our research.", "citation": "Not cited", "departments": ["ETH Zurich", "University of St. Gallen"], "authors": ["Benjamin Ryder.....http://dblp.org/pers/hd/r/Ryder:Benjamin", "Felix Wortmann.....http://dblp.org/pers/hd/w/Wortmann:Felix"], "conf": "huc", "year": "2017", "pages": 6}