{"title": "Steelix: program-state based binary fuzzing.", "fields": ["byte", "fuzz testing", "string", "code coverage", "binary number"], "abstract": "Coverage-based fuzzing is one of the most effective techniques to find vulnerabilities, bugs or crashes. However, existing techniques suffer from the difficulty in exercising the paths that are protected by magic bytes comparisons (e.g., string equality comparisons). Several approaches have been proposed to use heavy-weight program analysis to break through magic bytes comparisons, and hence are less scalable. In this paper, we propose a program-state based binary fuzzing approach, named Steelix, which improves the penetration power of a fuzzer at the cost of an acceptable slow down of the execution speed. In particular, we use light-weight static analysis and binary instrumentation to provide not only coverage information but also comparison progress information to a fuzzer. Such program state information informs a fuzzer about where the magic bytes are located in the test input and how to perform mutations to match the magic bytes efficiently. We have implemented Steelix and evaluated it on three datasets: LAVA-M dataset, DARPA CGC sample binaries and five real-life programs. The results show that Steelix has better code coverage and bug detection capability than the state-of-the-art fuzzers. Moreover, we found one CVE and nine new bugs.", "citation": "Citations (11)", "departments": ["Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University", "Nanyang Technological University"], "authors": ["Yuekang Li.....http://dblp.org/pers/hd/l/Li:Yuekang", "Bihuan Chen.....http://dblp.org/pers/hd/c/Chen:Bihuan", "Mahinthan Chandramohan.....http://dblp.org/pers/hd/c/Chandramohan:Mahinthan", "Shang-Wei Lin.....http://dblp.org/pers/hd/l/Lin:Shang=Wei", "Yang Liu.....http://dblp.org/pers/hd/l/Liu_0003:Yang", "Alwen Tiu.....http://dblp.org/pers/hd/t/Tiu:Alwen"], "conf": "sigsoft", "year": "2017", "pages": 11}