{"title": "Joint Registration and Representation Learning for Unconstrained Face Identification.", "fields": ["discriminative model", "convolutional neural network", "feature learning", "template", "deep learning"], "abstract": "Recent advances in deep learning have resulted in human-level performances on popular unconstrained face datasets including Labeled Faces in the Wild and YouTube Faces. To further advance research, IJB-A benchmark was recently introduced with more challenges especially in the form of extreme head poses. Registration of such faces is quite demanding and often requires laborious procedures like facial landmark localization. In this paper, we propose a Convolutional Neural Networks based data-driven approach which learns to simultaneously register and represent faces. We validate the proposed scheme on template based unconstrained face identification. Here, a template contains multiple media in the form of images and video frames. Unlike existing methods which synthesize all template media information at feature level, we propose to keep the template media intact. Instead, we represent gallery templates by their trained one-vs-rest discriminative models and then employ a Bayesian strategy which optimally fuses decisions of all medias in a query template. We demonstrate the efficacy of the proposed scheme on IJB-A, YouTube Celebrities and COX datasets where our approach achieves significant relative performance boosts of 3.6%, 21.6% and 12.8% respectively.", "citation": "Citations (4)", "year": "2017", "departments": ["University of Canberra", "Commonwealth Scientific and Industrial Research Organisation", "University of Science and Technology, Sana'a", "University of Canberra"], "conf": "cvpr", "authors": ["Munawar Hayat.....http://dblp.org/pers/hd/h/Hayat:Munawar", "Salman Hameed Khan.....http://dblp.org/pers/hd/k/Khan:Salman_Hameed", "Naoufel Werghi.....http://dblp.org/pers/hd/w/Werghi:Naoufel", "Roland Goecke.....http://dblp.org/pers/hd/g/Goecke:Roland"], "pages": 10}