{"title": "Celebratory Technology to Orchestrate the Sharing of Devices and Stories during Family Mealtimes.", "fields": ["human computer interaction", "multimedia", "conversation", "engineering", "computer science", "interaction design", "software deployment"], "abstract": "While the idea of \"celebratory technologies\" during family mealtimes to support positive interactions at the dinner table is promising, there are few studies that investigate how these technologies can be meaningfully integrated into family practices. This paper presents the deployment of Chorus - a mealtime technology that orchestrates the sharing of personal devices and stories during family mealtimes, explores related content from all participants' devices, and supports revisiting previously shared content. A three-week field deployment with seven families shows that Chorus augments family interactions through sharing contents of personal and familial significance, supports togetherness and in-depth discussion by combining resources from multiple devices, helps to broach sensitive topics into familial conversation, and encourages participation from all family members including children. We discuss implications of this research and reflect on design choices and opportunities that can further enhance the family mealtime experience.", "citation": "Not cited", "year": "2017", "departments": ["University of Melbourne", "University of Melbourne", "Swinburne University of Technology", "Queensland University of Technology", "Microsoft"], "conf": "chi", "authors": ["Hasan Shahid Ferdous.....http://dblp.org/pers/hd/f/Ferdous:Hasan_Shahid", "Frank Vetere.....http://dblp.org/pers/hd/v/Vetere:Frank", "Hilary Davis.....http://dblp.org/pers/hd/d/Davis:Hilary", "Bernd Ploderer.....http://dblp.org/pers/hd/p/Ploderer:Bernd", "Kenton O'Hara.....http://dblp.org/pers/hd/o/O=Hara:Kenton", "Rob Comber.....http://dblp.org/pers/hd/c/Comber:Rob", "Geremy Farr-Wharton.....http://dblp.org/pers/hd/f/Farr=Wharton:Geremy"], "pages": 13}