{"title": "Automatic speed and direction control along constrained navigation paths.", "fields": ["simulation", "virtual reality", "sitting", "computer vision", "desk"], "abstract": "Traditionally in virtual reality systems, head tracking is used in head-mounted displays (HMDs) to allow users to control viewing using 360-degree head and body rotations. Our research explores interaction considerations that enable semi-natural methods of view control that will work for seated use of virtual reality with HMDs when physically turning all the way around is not ideal, such as when sitting on a couch or at a desk. We investigate the use of amplified head rotations so physically turning in a comfortable range can allow viewing of a 360-degree virtual range. Additionally, to avoid situations where the user's neck is turned in an uncomfortable position for an extended period, we also use redirection during virtual movement to gradually realign the user's head position back to the neutral, straight-ahead position. We ran a controlled experiment to evaluate guided head rotation and amplified head rotation without realignment during movement, and we compared both to traditional one-to-one head-tracked viewing as a baseline for reference. After a navigation task, overall errors on spatial orientation tasks were relatively low with all techniques, but orientation effects, sickness, and preferences varied depending on participants' 3D gaming habits. Using the guided rotation technique, participants who played 3D games performed better, reported higher preference scores, and demonstrated significantly lower sickness results compared to non-gamers.", "citation": "Citations (4)", "departments": ["Texas A&M University", "Texas A&M University", "Texas A&M University", "Texas A&M University"], "authors": ["Seyedkoosha Mirhosseini.....http://dblp.org/pers/hd/m/Mirhosseini:Seyedkoosha", "Ievgeniia Gutenko.....http://dblp.org/pers/hd/g/Gutenko:Ievgeniia", "Sushant Ojal.....http://dblp.org/pers/hd/o/Ojal:Sushant", "Joseph Marino.....http://dblp.org/pers/hd/m/Marino:Joseph", "Arie E. Kaufman.....http://dblp.org/pers/hd/k/Kaufman:Arie_E="], "conf": "vr", "year": "2017", "pages": 8}