{"title": "TMI: thread memory isolation for false sharing repair.", "fields": ["false sharing", "exploit", "speedup", "cpu cache", "strong consistency"], "abstract": "Cache contention in the form of false sharing and true sharing arises when threads overshare cache lines at high frequency. Such oversharing can reduce or negate the performance benefits of parallel execution. Prior systems for detecting and repairing cache contention lack efficiency in detection or repair, contain subtle memory consistency flaws, or require invasive changes to the program environment.   In this paper, we introduce a new way to combat cache line oversharing via the Thread Memory Isolation (T mi ) system. T mi  operates completely in userspace, leveraging performance counters and the Linux ptrace mechanism to tread lightly on monitored applications, intervening only when necessary. T mi 's compatible-by-default design allows it to scale to real-world workloads, unlike previous proposals. T mi  introduces a novel code-centric consistency model to handle cross-language memory consistency issues. T mi  exploits the flexibility of code-centric consistency to efficiently repair false sharing while preserving strong consistency model semantics when necessary.   T mi  has minimal impact on programs without oversharing, slowing their execution by just 2% on average. We also evaluate T mi  on benchmarks with known false sharing, and manually inject a false sharing bug into the leveldb key-value store from Google. For these programs, T mi  provides an average speedup of 5.2x and achieves 88% of the speedup possible with manual source code fixes.", "citation": "Not cited", "departments": ["University of Pennsylvania", "University of Pennsylvania", "Intel", "Intel", "University of Pennsylvania"], "authors": ["Christian DeLozier.....http://dblp.org/pers/hd/d/DeLozier:Christian", "Ariel Eizenberg.....http://dblp.org/pers/hd/e/Eizenberg:Ariel", "Shiliang Hu.....http://dblp.org/pers/hd/h/Hu:Shiliang", "Gilles Pokam.....http://dblp.org/pers/hd/p/Pokam:Gilles", "Joseph Devietti.....http://dblp.org/pers/hd/d/Devietti:Joseph"], "conf": "micro", "year": "2017", "pages": 12}