{"title": "Context-aware data quality estimation in mobile crowdsensing.", "fields": ["ground truth", "data quality", "maximization", "crowdsensing", "submodular set function"], "abstract": "With the rapid growth of smart devices, mobile crowdsensing is becoming an important paradigm to acquire information from physical environments. Considering that the sensing data collected by mobile users are normally noisy and imprecise, one of the pressing problems in mobile crowdsensing is to evaluate the data quality in real time and to steer users to acquire data with high quality. However, it is challenging to estimate the data quality without the availability of ground truth data. In this paper, we observe that sensing context has a significant impact on data quality, which motivates us to propose a context-aware data quality estimation scheme. With historical sensing data, we train a context-quality classifier, which captures the relation between context information and data quality, to estimate data quality in an online manner. We apply such a context-aware data quality estimation scheme to guide user recruitment in mobile crowdsensing. We model the process of user recruitment as a stochastic submodular maximization problem, and design a random adaptive greedy algorithm to guarantee a constant approximation ratio. We evaluate our algorithm on a real-world temperature data set. The evaluation results show that our algorithm outperforms other existing techniques, in terms of prediction accuracy.", "citation": "Citations (4)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of Texas at Dallas", "Shanghai Jiao Tong University"], "authors": ["Shengzhong Liu.....http://dblp.org/pers/hd/l/Liu:Shengzhong", "Zhenzhe Zheng.....http://dblp.org/pers/hd/z/Zheng:Zhenzhe", "Fan Wu.....http://dblp.org/pers/hd/w/Wu_0006:Fan", "Shaojie Tang.....http://dblp.org/pers/hd/t/Tang:Shaojie", "Guihai Chen.....http://dblp.org/pers/hd/c/Chen:Guihai"], "conf": "infocom", "year": "2017", "pages": 9}