{"title": "Mr.MAPP: Mixed Reality for MAnaging Phantom Pain.", "fields": ["mirror box", "phantom limb", "mixed reality", "phantom pain", "amputation"], "abstract": "Phantom Limb Pain or simply, Phantom Pain is a severe chronic pain that is experienced as a vivid sensation of the pain in missing body part. Epidemiological studies obtained from a large samples indicate that the short-term incidence rate of the phantom limb pain is 72% [13], while long-term incidence rate (6 months after amputation) is 67%, [5, 13]. A wide spectrum of treatments developed for alleviating phantom limb pain includes the traditional mirror box therapy as well as recently developed virtual reality-based methods. Most of the virtual reality-based methods rely on 3D CAD models of the virtual limb, animating them using the motion data acquired either from patient's existing anatomical limb or myoelectric activity at patient's stump (of the amputated limb). Since motion activity is typically captured using body sensors (Electromyography, EMG, or inertial sensors), these methods are considered as invasive approaches. Further, in the case of virtual reality-based methods, the dependency on the pre-built 3D models degrades the immersive experience due to a mismatch in the skin color, clothes, artificial and rigid look and misalignment of the phantom limb.   In this work, we propose a novel Mixed Reality based system for MAnaging Phantom Pain (Mr.MAPP), utilizing off-the-shelf RGB-D cameras such as Microsoft Kinect V2 to capture and generate a 3D model of the patient in real-time. An illusion of the virtual limb is crafted in real-time by mirroring the patient's symmetric anatomical limb in the captured data with the help of various computer vision and graphics techniques. Along with that, a phantom limb skeleton is also generated in real-time to enable interaction with virtual objects. We conducted a multi-pronged user Quality of Experience (QoE) study of Mr.MAPP employing various rendering displays such as 3D Television, and Head mounted displays (Oculus Rift, Samsung Gear VR). The user study involved two classes of users: (a) a big pool of Subject-Matter Experts (SMEs) that includes Physical Medicine and Rehab (PMR (b) healthy non-expert users. SMEs, as well as the healthy non-expert users provided a very positive feedback of Mr. MAPP indicating the potential value of Mr.MAPP for the phantom pain management.", "citation": "Citations (1)", "departments": ["University of Texas at Dallas", "University of Texas Southwestern Medical Center", "University of Texas at Dallas"], "authors": ["Kanchan Bahirat.....http://dblp.org/pers/hd/b/Bahirat:Kanchan", "Thiru Annaswamy.....http://dblp.org/pers/hd/a/Annaswamy:Thiru", "Balakrishnan Prabhakaran.....http://dblp.org/pers/hd/p/Prabhakaran:Balakrishnan"], "conf": "mm", "year": "2017", "pages": 9}