{"title": "Interactive Mapping Specification with Exemplar Tuples.", "fields": ["intuition", "schema", "data curation", "data exchange", "tuple"], "abstract": "While schema mapping specification is a cumbersome task for data curation specialists, it becomes unfeasible for non-expert users, who are unacquainted with the semantics and languages of the involved transformations.   In this paper, we present an interactive framework for schema mapping specification suited for non-expert users. The underlying key intuition is to leverage a few exemplar tuples to infer the underlying mappings and iterate the inference process via simple user interactions under the form of boolean queries on the validity of the initial exemplar tuples. The approaches available so far are mainly assuming pairs of complete universal data examples, which can be solely provided by data curation experts, or are limited to poorly expressive mappings.   We present several exploration strategies of the space of all possible mappings that satisfy arbitrary user exemplar tuples. Along the exploration, we challenge the user to retain the mappings that fit the user's requirements at best and to dynamically prune the exploration space, thus reducing the number of user interactions. We prove that after the refinement process, the obtained mappings are correct. We present an extensive experimental analysis devoted to measure the feasibility of our interactive mapping strategies and the inherent quality of the obtained mappings.", "citation": "Citations (5)", "year": "2017", "departments": ["Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique", "Centre national de la recherche scientifique"], "conf": "sigmod", "authors": ["Angela Bonifati.....http://dblp.org/pers/hd/b/Bonifati:Angela", "Ugo Comignani.....http://dblp.org/pers/hd/c/Comignani:Ugo", "Emmanuel Coquery.....http://dblp.org/pers/hd/c/Coquery:Emmanuel", "Romuald Thion.....http://dblp.org/pers/hd/t/Thion:Romuald"], "pages": 16}