{"title": "Clustering Billions of Reads for DNA Data Storage.", "fields": ["edit distance", "dna digital data storage", "cure data clustering algorithm", "data retrieval", "synthetic data"], "abstract": "Storing data in synthetic DNA offers the possibility of improving information density and durability by several orders of magnitude compared to current storage technologies. However, DNA data storage requires a computationally intensive process to retrieve the data. In particular, a crucial step in the data retrieval pipeline involves clustering billions of strings with respect to edit distance. Datasets in this domain have many notable properties, such as containing a very large number of small clusters that are well-separated in the edit distance metric space. In this regime, existing algorithms are unsuitable because of either their long running time or low accuracy. To address this issue, we present a novel distributed algorithm for approximately computing the underlying clusters. Our algorithm converges efficiently on any dataset that satisfies certain separability properties, such as those coming from DNA data storage systems. We also prove that, under these assumptions, our algorithm is robust to outliers and high levels of noise. We provide empirical justification of the accuracy, scalability, and convergence of our algorithm on real and synthetic data. Compared to the state-of-the-art algorithm for clustering DNA sequences, our algorithm simultaneously achieves higher accuracy and a 1000x speedup on three real datasets.", "citation": "Not cited", "year": "2017", "departments": ["University of Washington", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "nips", "authors": ["Cyrus Rashtchian.....http://dblp.org/pers/hd/r/Rashtchian:Cyrus", "Konstantin Makarychev.....http://dblp.org/pers/hd/m/Makarychev:Konstantin", "Miklós Z. Rácz.....http://dblp.org/pers/hd/r/R=aacute=cz:Mikl=oacute=s_Z=", "Siena Ang.....http://dblp.org/pers/hd/a/Ang:Siena", "Djordje Jevdjic.....http://dblp.org/pers/hd/j/Jevdjic:Djordje", "Sergey Yekhanin.....http://dblp.org/pers/hd/y/Yekhanin:Sergey", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Karin Strauss.....http://dblp.org/pers/hd/s/Strauss:Karin"], "pages": 12}