{"title": "Interactive Time Series Analytics Powered by ONEX.", "fields": ["dynamic time warping", "analytics", "euclidean distance", "visual analytics", "scale invariant feature transform"], "abstract": "Modern applications in this digital age collect a staggering amount of time series data from economic growth rates to electrical household consumption habits. To make sense of it, domain analysts interactively sift through these time series collections in search of critical relationships between and recurring patterns within these time series. The ONEX (Online Exploration of Time Series) system supports effective exploratory analysis of time series collections composed of heterogeneous, variable-length and misaligned time series using robust alignment dynamic time warping (DTW) methods. To assure real-time responsiveness even for these complex and compute-intensive analytics, ONEX precomputes and then encodes time series relationships based on the inexpensive-to-compute Euclidean distance into the ONEX base. Thereafter, based on a solid formal foundation, ONEX uses DTW-enhanced analytics to correctly extract relevant time series matches on this Euclidean-prepared ONEX base. Our live interactive demonstration shows how our ONEX exploratory tool, supported by a rich array of visual interactions and expressive visualizations, enables efficient mining and interpretation of the MATTERS real data collection composed of economic, social, and education data trends across the fifty American states.", "citation": "Not cited", "year": "2017", "departments": ["Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute", "Worcester Polytechnic Institute"], "conf": "sigmod", "authors": ["Rodica Neamtu.....http://dblp.org/pers/hd/n/Neamtu:Rodica", "Ramoza Ahsan.....http://dblp.org/pers/hd/a/Ahsan:Ramoza", "Charles Lovering.....http://dblp.org/pers/hd/l/Lovering:Charles", "Cuong Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Cuong", "Elke A. Rundensteiner.....http://dblp.org/pers/hd/r/Rundensteiner:Elke_A=", "Gábor N. Sárközy.....http://dblp.org/pers/hd/s/S=aacute=rk=ouml=zy:G=aacute=bor_N="], "pages": 4}