{"title": "Efficient Exploration of Telco Big Data with Compression and Decaying.", "fields": ["analytics", "online analytical processing", "lossless compression", "big data", "online transaction processing"], "abstract": "In the realm of smart cities, telecommunication companies (telcos) are expected to play a protagonistic role as these can capture a variety of natural phenomena on an ongoing basis, e.g., traffic in a city, mobility patterns for emergency response or city planning. The key challenges for telcos in this era is to ingest in the most compact manner huge amounts of network logs, perform big data exploration and analytics on the generated data within a tolerable elapsed time. This paper introduces SPATE, an innovative telco big data exploration framework whose objectives are two-fold: (i) minimizing the storage space needed to incrementally retain data over time, and (ii) minimizing the response time for spatiotemporal data exploration queries over recent data. The storage layer of our framework uses lossless data compression to ingest recent streams of telco big data in the most compact manner retaining full resolution for data exploration tasks. The indexing layer of our system then takes care of the progressive loss of detail in information, coined decaying, as data ages with time. The exploration layer provides visual means to explore the generated spatio-temporal information space. We measure the efficiency of the proposed framework using a 5GB anonymized real telco network trace and a variety of telco-specific tasks, such as OLAP and OLTP querying, privacy-aware data sharing, multivariate statistics, clustering and regression. We show that out framework can achieve comparable response times to the state-of-the-art using an order of magnitude less storage space.", "citation": "Citations (2)", "departments": ["Max Planck Society", "External Organizations", "External Organizations", "Computer Scienc ... and Engineering"], "authors": ["Constantinos Costa.....http://dblp.org/pers/hd/c/Costa:Constantinos", "Georgios Chatzimilioudis.....http://dblp.org/pers/hd/c/Chatzimilioudis:Georgios", "Demetrios Zeinalipour-Yazti.....http://dblp.org/pers/hd/z/Zeinalipour=Yazti:Demetrios", "Mohamed F. Mokbel.....http://dblp.org/pers/hd/m/Mokbel:Mohamed_F="], "conf": "icde", "year": "2017", "pages": 12}