{"title": "Transparent Web Service Auditing via Network Provenance Functions.", "fields": ["load balancing", "component based software engineering", "software deployment", "application layer", "workflow"], "abstract": "Detecting and explaining the nature of attacks in distributed web services is often difficult -- determining the nature of suspicious activity requires following the trail of an attacker through a chain of heterogeneous software components including load balancers, proxies, worker nodes, and storage services. Unfortunately, existing forensic solutions cannot provide the necessary context to link events across complex workflows, particularly in instances where application layer semantics (e.g., SQL queries, RPCs) are needed to understand the attack. In this work, we present a transparent provenance-based approach for auditing web services through the introduction of Network Provenance Functions (NPFs). NPFs are a distributed architecture for capturing detailed data provenance for web service components, leveraging the key insight that mediation of an application's protocols can be used to infer its activities without requiring invasive instrumentation or developer cooperation. We design and implement NPF with consideration for the complexity of modern cloud-based web services, and evaluate our architecture against a variety of applications including DVDStore, RUBiS, and WikiBench to show that our system imposes as little as 9.3% average end-to-end overhead on connections for realistic workloads. Finally, we consider several scenarios in which our system can be used to concisely explain attacks. NPF thus enables the hassle-free deployment of semantically rich provenance-based auditing for complex applications workflows in the Cloud.", "citation": "Citations (3)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Florida", "University of Florida", "University of Florida"], "authors": ["Adam M. Bates.....http://dblp.org/pers/hd/b/Bates:Adam_M=", "Wajih Ul Hassan.....http://dblp.org/pers/hd/h/Hassan:Wajih_Ul", "Kevin R. B. Butler.....http://dblp.org/pers/hd/b/Butler:Kevin_R=_B=", "Alin Dobra.....http://dblp.org/pers/hd/d/Dobra:Alin", "Bradley Reaves.....http://dblp.org/pers/hd/r/Reaves:Bradley", "Patrick T. Cable II.....http://dblp.org/pers/hd/c/Cable_II:Patrick_T=", "Thomas Moyer.....http://dblp.org/pers/hd/m/Moyer:Thomas", "Nabil Schear.....http://dblp.org/pers/hd/s/Schear:Nabil"], "conf": "www", "year": "2017", "pages": 9}