{"title": "Emotional qualities of VR space.", "fields": ["immersion", "work experience", "brightness", "phenomenon", "design elements and principles"], "abstract": "The emotional response a person has to a living space is predominantly affected by light, color and texture as space-making elements. In order to verify whether this phenomenon could be replicated in a simulated environment, we conducted a user study in a six-sided projected immersive display that utilized equivalent design attributes of brightness, color and texture in order to assess to which extent the emotional response in a simulated environment is affected by the same parameters affecting real environments. Since emotional response depends upon the context, we evaluated the emotional responses of two groups of users: inactive (passive) and active (performing a typical daily activity). The results from the perceptual study generated data from which design principles for a virtual living space are articulated. Such a space, as an alternative to expensive built dwellings, could potentially support new, minimalist lifestyles of occupants, defined as the neo-nomads, aligned with their work experience in the digital domain through the generation of emotional experiences of spaces. Data from the experiments confirmed the hypothesis that perceivable emotional aspects of real-world spaces could be successfully generated through simulation of design attributes in the virtual space. The subjective response to the virtual space was consistent with corresponding responses from real-world color and brightness emotional perception. Our data could serve the virtual reality (VR) community in its attempt to conceive of further applications of virtual spaces for well-defined activities.", "citation": "Citations (1)", "departments": ["University of Texas at Dallas", "Duke University", "University of Texas at Dallas", "University of Texas at Dallas"], "authors": ["Asma Naz.....http://dblp.org/pers/hd/n/Naz:Asma", "Regis Kopper.....http://dblp.org/pers/hd/k/Kopper:Regis", "Ryan P. McMahan.....http://dblp.org/pers/hd/m/McMahan:Ryan_P=", "Mihai Nadin.....http://dblp.org/pers/hd/n/Nadin:Mihai"], "conf": "vr", "year": "2017", "pages": 9}