{"title": "Accounting for Privacy in Citizen Science: Ethical Research in a Context of Openness.", "fields": ["crowdsourcing", "citizen science", "personally identifiable information", "research ethics", "privacy by design"], "abstract": "In citizen science, volunteers collect and share data with researchers, other volunteers, and the public at large. Data shared in citizen science includes information on volunteer location or other sensitive personal information; yet, volunteers do not typically express privacy concerns. This study uses the framework of contextual integrity to understand privacy accounting in the context of citizen science, by analyzing contextual variables including roles; information types; data flows and transmission principles; and, uses, norms, and values. Findings show that uses, norms, and values-including core values shared by researchers and public volunteers, and the motivations of individual volunteers' have a significant impact on privacy accounting. Overall, citizen science volunteers and practitioners share and promote openness and data sharing over protecting privacy. Studying the context of citizen science offers an example of contextually-appropriate data sharing that can inform broader questions about research ethics in an age of pervasive data. Based on these findings, this paper offers implications for designing data and information flows and supporting technologies in public and voluntary data sharing projects.", "citation": "Citations (5)", "departments": ["Woodrow Wilson International Center for Scholars", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Anne Bowser.....http://dblp.org/pers/hd/b/Bowser:Anne", "Katie Shilton.....http://dblp.org/pers/hd/s/Shilton:Katie", "Jenny Preece.....http://dblp.org/pers/hd/p/Preece:Jenny", "Elizabeth E. Warrick.....http://dblp.org/pers/hd/w/Warrick:Elizabeth_E="], "conf": "cscw", "year": "2017", "pages": 13}