{"title": "Phase-Mapper: An AI Platform to Accelerate High Throughput Materials Discovery.", "fields": ["parameter identification problem", "matrix decomposition", "machine learning", "throughput", "solver"], "abstract": "High-Throughput materials discovery involves the rapid synthesis, measurement, and characterization of many different but structurally-related materials. A key problem in materials discovery, the phase map identification problem, involves the determination of the crystal phase diagram from the materials' composition and structural characterization data. We present Phase-Mapper, a novel AI platform to solve the phase map identification problem that allows humans to interact with both the data and products of AI algorithms, including the incorporation of human feedback to constrain or initialize solutions. Phase-Mapper affords incorporation of any spectral demixing algorithm, including our novel solver, AgileFD, which is based on a convolutive non-negative matrix factorization algorithm. AgileFD can incorporate constraints to capture the physics of the materials as well as human feedback. We compare three solver variants with previously proposed methods in a large-scale experiment involving 20 synthetic systems, demonstrating the efficacy of imposing physical constrains using AgileFD. Phase-Mapper has also been used by materials scientists to solve a wide variety of phase diagrams, including the previously unsolved Nb-Mn-V oxide system, which is provided here as an illustrative example.", "citation": "Citations (3)", "departments": ["Cornell University", "Cornell University", "Cornell University", "Cornell University", "Cornell University"], "authors": ["Yexiang Xue.....http://dblp.org/pers/hd/x/Xue:Yexiang", "Junwen Bai.....http://dblp.org/pers/hd/b/Bai:Junwen", "Ronan Le Bras.....http://dblp.org/pers/hd/b/Bras:Ronan_Le", "Brendan Rappazzo.....http://dblp.org/pers/hd/r/Rappazzo:Brendan", "Richard Bernstein.....http://dblp.org/pers/hd/b/Bernstein:Richard", "Johan Bjorck.....http://dblp.org/pers/hd/b/Bjorck:Johan", "Liane Longpre.....http://dblp.org/pers/hd/l/Longpre:Liane", "Santosh K. Suram.....http://dblp.org/pers/hd/s/Suram:Santosh_K=", "Robert Bruce van Dover.....http://dblp.org/pers/hd/d/Dover:Robert_Bruce_van", "John M. Gregoire.....http://dblp.org/pers/hd/g/Gregoire:John_M=", "Carla P. Gomes.....http://dblp.org/pers/hd/g/Gomes:Carla_P="], "conf": "aaai", "year": "2017", "pages": 9}