{"title": "An adaptive sublinear-time block sparse fourier transform.", "fields": ["sparse approximation", "fast fourier transform", "randomized algorithm", "sublinear function", "fourier series"], "abstract": "The problem of approximately computing the  k  dominant Fourier coefficients of a vector  X  quickly, and using few samples in time domain, is known as the Sparse Fourier Transform (sparse FFT) problem. A long line of work on the sparse FFT has resulted in algorithms with  O ( k log n log( n / k )) runtime [Hassanieh  et al. , STOCâ  12] and  O ( k log n ) sample complexity [Indyk  et al. , FOCSâ  14]. This paper revisits the sparse FFT problem with the added twist that the sparse coefficients approximately obey a ( k  0 , k  1 )-block sparse model. In this model, signal frequencies are clustered in  k  0  intervals with width  k  1  in Fourier space, and  k =  k  0  k  1  is the total sparsity.   Our main result is the first sparse FFT algorithm for ( k  0 ,  k  1 )-block sparse signals with a sample complexity of  O  * ( k  0  k  1  +  k  0 log(1+  k  0 )log n ) at constant signal-to-noise ratios, and sublinear runtime. Our algorithm crucially uses  adaptivity  to achieve the improved sample complexity bound, and we provide a lower bound showing that this is essential in the Fourier setting: Any  non-adaptive  algorithm must use I©( k  0  k  1 log n / k  0  k  1 ) samples for the ( k  0 , k  1 )-block sparse model, ruling out improvements over the vanilla sparsity assumption. Our main technical innovation for adaptivity is a new randomized energy-based importance sampling technique that may be of independent interest.", "citation": "Citations (1)", "year": "2017", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "conf": "stoc", "authors": ["Volkan Cevher.....http://dblp.org/pers/hd/c/Cevher:Volkan", "Michael Kapralov.....http://dblp.org/pers/hd/k/Kapralov:Michael", "Jonathan Scarlett.....http://dblp.org/pers/hd/s/Scarlett:Jonathan", "Amir Zandieh.....http://dblp.org/pers/hd/z/Zandieh:Amir"], "pages": 14}