{"title": "Online auction for IaaS clouds: Towards elastic user demands and weighted heterogeneous VMs.", "fields": ["common value auction", "competitive analysis", "server", "cost accounting", "unified model", "payment", "private information retrieval"], "abstract": "Auctions have been adopted by many major cloud providers, such as Amazon EC2. Unfortunately, only simple auctions have been implemented. Such simple auction has serious limitations, such as being unable to accept elastic user demands and having to allocate different types of VMs independently. These limitations create a big gap between the real needs of cloud users and the available services of cloud providers. In response to the limitations of the existing auction mechanisms, this paper proposes a novel online auction mechanism for IaaS clouds, with the unique features of an elastic model for inputting time-varying user demands and a unified model for requesting heterogeneous VMs together. However, several major challenges should be addressed, such as NP hardness of optimal VM allocation, time-varying user demands and potential misreports of private information of cloud users. We propose a truthful online auction mechanism for maximizing the profit of the cloud provider in IaaS clouds, which is composed of a price-based allocation rule and a payment rule. In the allocation rule, the online auction mechanism determines the number of VMs of each type to each user. In the payment rule, by introducing a marginal price function for each type of VMs, the mechanism determines how much the cloud provider should charge each cloud user. With solid theoretical analysis and trace-driven simulations, we demonstrate that our mechanism is truthful and individually rational, and has a polynomial-time complexity.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Juan Li.....http://dblp.org/pers/hd/l/Li:Juan", "Yanmin Zhu.....http://dblp.org/pers/hd/z/Zhu:Yanmin", "Jiadi Yu.....http://dblp.org/pers/hd/y/Yu:Jiadi", "Chengnian Long.....http://dblp.org/pers/hd/l/Long:Chengnian", "Guangtao Xue.....http://dblp.org/pers/hd/x/Xue:Guangtao", "Shiyou Qian.....http://dblp.org/pers/hd/q/Qian:Shiyou"], "conf": "infocom", "year": "2017", "pages": 9}