{"title": "Multi-site User Behavior Modeling and Its Application in Video Recommendation.", "fields": ["recommender system", "user modeling", "probabilistic logic", "generative model", "popularity"], "abstract": "As online video service continues to grow in popularity, video content providers compete hard for more eyeball engagement. Some users visit multiple video sites to enjoy videos of their interest while some visit exclusively one site. However, due to the isolation of data, mining and exploiting user behaviors in multiple video websites remain unexplored so far. In this work, we try to model user preferences in six popular video websites with user viewing records obtained from a large ISP in China. The empirical study shows that users exhibit both consistent cross-site interests as well as site-specific interests. To represent this dichotomous pattern of user preferences, we propose a generative model of Multi-site Probabilistic Factorization ( MPF ) to capture both the cross-site as well as site-specific preferences. Besides, we discuss the design principle of our model by analyzing the sources of the observed site-specific user preferences, namely, site peculiarity and data sparsity. Through conducting extensive recommendation validation, we show that our  MPF  model achieves the best results compared to several other state-of-the-art factorization models with significant improvements of F-measure by 12.96%, 8.24% and 6.88%, respectively. Our findings provide insights on the value of integrating user data from multiple sites, which stimulates collaboration between video service providers.", "citation": "Citations (1)", "departments": ["The Chinese University of Hong Kong", "Tsinghua University", "Tsinghua University", "Tsinghua University", "The Chinese University of Hong Kong"], "authors": ["Chunfeng Yang.....http://dblp.org/pers/hd/y/Yang:Chunfeng", "Huan Yan.....http://dblp.org/pers/hd/y/Yan:Huan", "Donghan Yu.....http://dblp.org/pers/hd/y/Yu:Donghan", "Yong Li.....http://dblp.org/pers/hd/l/Li_0008:Yong", "Dah Ming Chiu.....http://dblp.org/pers/hd/c/Chiu:Dah_Ming"], "conf": "sigir", "year": "2017", "pages": 10}