{"title": "Schema Networks: Zero-shot Transfer with a Generative Causal Model of Intuitive Physics.", "fields": ["asynchronous communication", "causal model", "generalization", "intelligent decision support system", "schema"], "abstract": "The recent adaptation of deep neural network-based methods to reinforcement learning and planning domains has yielded remarkable progress on individual tasks. Nonetheless, progress on task-to-task transfer remains limited. In pursuit of efficient and robust generalization, we introduce the Schema Network, an object-oriented generative physics simulator capable of disentangling multiple causes of events and reasoning backward through causes to achieve goals. The richly structured architecture of the Schema Network can learn the dynamics of an environment directly from data. We compare Schema Networks with Asynchronous Advantage Actor-Critic and Progressive Networks on a suite of Breakout variations, reporting results on training efficiency and zero-shot generalization, consistently demonstrating faster, more robust learning and better transfer. We argue that generalizing from limited data and learning causal relationships are essential abilities on the path toward generally intelligent systems.", "citation": "Citations (19)", "year": "2017", "departments": [], "conf": "icml", "authors": ["Ken Kansky.....http://dblp.org/pers/hd/k/Kansky:Ken", "Tom Silver.....http://dblp.org/pers/hd/s/Silver:Tom", "David A. Mély.....http://dblp.org/pers/hd/m/M=eacute=ly:David_A=", "Mohamed Eldawy.....http://dblp.org/pers/hd/e/Eldawy:Mohamed", "Miguel Lázaro-Gredilla.....http://dblp.org/pers/hd/l/L=aacute=zaro=Gredilla:Miguel", "Xinghua Lou.....http://dblp.org/pers/hd/l/Lou:Xinghua", "Nimrod Dorfman.....http://dblp.org/pers/hd/d/Dorfman:Nimrod", "Szymon Sidor.....http://dblp.org/pers/hd/s/Sidor:Szymon", "D. Scott Phoenix.....http://dblp.org/pers/hd/p/Phoenix:D=_Scott", "Dileep George.....http://dblp.org/pers/hd/g/George:Dileep"], "pages": 10}