{"title": "Fairness in Group Recommendations in the Health Domain.", "fields": ["knowledge management", "exploit", "health care", "collaborative filtering", "data mining"], "abstract": "During the last decade, the number of users who look for health-related information has impressively increased. On the other hand, health professionals have less and less time to recommend useful sources of such information online to their patients. To this direction, we target at streamlining the process of providing useful online information to patients by their caregivers and improving as such the opportunities that patients have to inform themselves online about diseases and possible treatments. Using our system, relevant and high quality information is delivered to patients based on their profile, as represented in their personal healthcare record data, facilitating an easy interaction by minimizing the necessary manual effort. Specifically, in this paper, we propose a model for group recommendations following the collaborative filtering approach. Since in collaborative filtering is crucial to identify the correct set of similar users for a user in question, in addition to the traditional ratings, we pay particular attention on how to exploit healthrelated information for computing similarities between users. Our special focus is on providing valuable suggestions to a caregiver who is responsible for a group of users. We interpret valuable suggestions as suggestions that are both highly related and fair to the users of the group. In this line, we propose an algorithm for identifying the top-z most valuable recommendations, and present its implementation in MapReduce.", "citation": "Citations (1)", "departments": ["University of Tampere", "Foundation for Research & Technology – Hellas", "University of Tampere"], "authors": ["Maria Stratigi.....http://dblp.org/pers/hd/s/Stratigi:Maria", "Haridimos Kondylakis.....http://dblp.org/pers/hd/k/Kondylakis:Haridimos", "Kostas Stefanidis.....http://dblp.org/pers/hd/s/Stefanidis:Kostas"], "conf": "icde", "year": "2017", "pages": 8}