{"title": "Sketched Ridge Regression: Optimization Perspective, Statistical Perspective, and Model Averaging.", "fields": ["sketch", "ridge", "matrix", "approximation error", "regularization", "hessian matrix", "mathematics", "pattern recognition", "artificial intelligence"], "abstract": "We address the statistical and optimization impacts of using classical or Hessian sketch to approximately solve the Matrix Ridge Regression (MRR) problem. Prior research has considered the effects of classical sketch on least squares regression (LSR), a strictly simpler problem. We establish that classical sketch has a similar effect upon the optimization properties of MRR as it does on those of LSR---namely, it recovers nearly optimal solutions. In contrast, Hessian sketch does not have this guarantee, instead, the approximation error is governed by a subtle interplay between the \"mass\" in the responses and the optimal objective value. \nFor both types of approximations, the regularization in the sketched MRR problem gives it significantly different statistical properties from the sketched LSR problem. In particular, there is a bias-variance trade-off in sketched MRR that is not present in sketched LSR. We provide upper and lower bounds on the biases and variances of sketched MRR, these establish that the variance is significantly increased when classical sketches are used, while the bias is significantly increased when using Hessian sketches. Empirically, sketched MRR solutions can have risks that are higher by an order-of-magnitude than those of the optimal MRR solutions. \nWe establish theoretically and empirically that model averaging greatly decreases this gap. Thus, in the distributed setting, sketching combined with model averaging is a powerful technique that quickly obtains near-optimal solutions to the MRR problem while greatly mitigating the statistical risks incurred by sketching.", "citation": "Not cited", "year": "2017", "departments": ["University of California, Berkeley", "University of California, Berkeley", "University of California, Berkeley"], "conf": "icml", "authors": ["Shusen Wang.....http://dblp.org/pers/hd/w/Wang:Shusen", "Alex Gittens.....http://dblp.org/pers/hd/g/Gittens:Alex", "Michael W. Mahoney.....http://dblp.org/pers/hd/m/Mahoney:Michael_W="], "pages": 9}