{"title": "ShortCut: Architectural Support for Fast Object Access in Scripting Languages.", "fields": ["optimizing compiler", "inline caching", "just in time compilation", "microarchitecture", "scripting language"], "abstract": "The same flexibility that makes dynamic scripting languages appealing to programmers is also the primary cause of their low performance. To access objects of potentially different types, the compiler creates a dispatcher with a series of if statements, each performing a comparison to a type and a jump to a handler. This induces major overhead in instructions executed and branches mispredicted.   This paper proposes architectural support to significantly improve the efficiency of accesses to objects. The idea is to modify the instruction that calls the dispatcher so that, under most conditions, it skips most of the branches and instructions needed to reach the correct handler, and sometimes even the execution of the handler itself. Our novel architecture, called ShortCut, performs two levels of optimization. Its Plain design transforms the call to the dispatcher into a call to the correct handler --- bypassing the whole dispatcher execution. Its Aggressive design transforms the call to the dispatcher into a simple load or store --- bypassing the execution of both dispatcher and handler. We implement the ShortCut software in the state-of-the-art Google V8 JIT compiler, and the ShortCut hardware in a simulator. We evaluate ShortCut with the Octane and SunSpider JavaScript application suites. Plain ShortCut reduces the average execution time of the applications by 30% running under the baseline compiler, and by 11% running under the maximum level of compiler optimization. Aggressive ShortCut performs only slightly better.", "citation": "Citations (2)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Jiho Choi.....http://dblp.org/pers/hd/c/Choi:Jiho", "Thomas Shull.....http://dblp.org/pers/hd/s/Shull:Thomas", "María Jesús Garzarán.....http://dblp.org/pers/hd/g/Garzar=aacute=n:Mar=iacute=a_Jes=uacute=s", "Josep Torrellas.....http://dblp.org/pers/hd/t/Torrellas:Josep"], "conf": "isca", "year": "2017", "pages": 13}