{"title": "TrustBase: An Architecture to Repair and Strengthen Certificate-based Authentication.", "fields": ["revocation list", "online certificate status protocol", "public key certificate", "certificate", "certificate authority"], "abstract": "We describe TrustBase, an architecture that provides certificate-based authentication as an operating system service. TrustBase enforces best practices for certificate validation for all applications and transparently enables existing applications to be strengthened against failures of the CA system. The TrustBase system allows simple deployment of authentication systems that harden the CA system. This enables system administrators, for example, to require certificate revocation checks on all TLS connections, or require STARTTLS for email servers that support it. TrustBase is the first system that is able to secure all TLS traffic, using an approach compatible with all operating systems. We design and evaluate a prototype implementation of TrustBase on Linux, evaluate its security, and demonstrate that it has negligible overhead and universal compatibility with applications. To demonstrate the utility of TrustBase, we have developed six authentication services that strengthen certificate validation for all applications.", "citation": "Citations (2)", "year": "2017", "departments": ["Brigham Young University", "Brigham Young University", "Brigham Young University"], "conf": "uss", "authors": ["Mark O'Neill.....http://dblp.org/pers/hd/o/O=Neill:Mark", "Scott Heidbrink.....http://dblp.org/pers/hd/h/Heidbrink:Scott", "Scott Ruoti.....http://dblp.org/pers/hd/r/Ruoti:Scott", "Jordan Whitehead.....http://dblp.org/pers/hd/w/Whitehead:Jordan", "Dan Bunker.....http://dblp.org/pers/hd/b/Bunker:Dan", "Luke Dickinson.....http://dblp.org/pers/hd/d/Dickinson:Luke", "Travis Hendershot.....http://dblp.org/pers/hd/h/Hendershot:Travis", "Joshua Reynolds.....http://dblp.org/pers/hd/r/Reynolds:Joshua", "Kent E. Seamons.....http://dblp.org/pers/hd/s/Seamons:Kent_E=", "Daniel Zappala.....http://dblp.org/pers/hd/z/Zappala:Daniel"], "pages": 16}