{"title": "Average-case fine-grained hardness.", "fields": ["meyer hardness test", "3sum", "indentation hardness", "average case complexity", "proof of work system", "composite material", "combinatorics", "vickers hardness test", "exponential time hypothesis", "algebraic structure", "hardness"], "abstract": "We present functions that can be computed in some fixed polynomial time but are hard  on average  for any algorithm that runs in slightly smaller time, assuming widely-conjectured  worst-case  hardness for problems from the study of fine-grained complexity. Unconditional constructions of such functions are known from before (Goldmann et al., IPL â  94), but these have been canonical functions that have not found further use, while our functions are closely related to well-studied problems and have considerable algebraic structure.   Based on the average-case hardness and structural properties of our functions, we outline the construction of a  Proof of Work  scheme and discuss possible approaches to constructing fine-grained One-Way Functions. We also show how our reductions make conjectures regarding the worst-case hardness of the problems we reduce from (and consequently the Strong Exponential Time Hypothesis)  heuristically falsifiable  in a sense similar to that of (Naor, CRYPTO â  03).   We prove our hardness results in each case by showing fine-grained reductions from solving one of three problems â   namely, Orthogonal Vectors (OV), 3SUM, and All-Pairs Shortest Paths (APSP) â   in the worst case to computing our function correctly on a uniformly random input. The conjectured hardness of OV and 3SUM then gives us functions that require  n  2â   o (1)  time to compute on average, and that of APSP gives us a function that requires  n  3â   o (1)  time. Using the same techniques we also obtain a conditional average-case time hierarchy of functions.", "citation": "Not cited", "year": "2017", "departments": ["Columbia University", "Interdisciplinary Center Herzliya", "University of California, Berkeley", "Massachusetts Institute of Technology"], "conf": "stoc", "authors": ["Marshall Ball.....http://dblp.org/pers/hd/b/Ball:Marshall", "Alon Rosen.....http://dblp.org/pers/hd/r/Rosen:Alon", "Manuel Sabin.....http://dblp.org/pers/hd/s/Sabin:Manuel", "Prashant Nalini Vasudevan.....http://dblp.org/pers/hd/v/Vasudevan:Prashant_Nalini"], "pages": 14}