{"title": "Sparse Subspace Clustering by Learning Approximation ℓ0 Codes.", "fields": ["cure data clustering algorithm", "constrained clustering", "affinity propagation", "data stream clustering", "canopy clustering algorithm"], "abstract": "Subspace clustering has been widely applied to detect meaningful clusters in high-dimensional data spaces. A main challenge in subspace clustering is to quickly calculate a \"good\" affinity matrix. l 0 , l 1 , l 2  or nuclear norm regularization is used to construct the affinity matrix in many subspace clustering methods because of their theoretical guarantees and empirical success. However, they suffer from the following problems: (1) l 2  and nuclear norm regularization require very strong assumptions to guarantee a subspace-preserving affinity; (2) although l 1  regularization can be guaranteed to give a subspace-preserving affinity under certain conditions, it needs more time to solve a large-scale convex optimization problem; (3) l 0  regularization can yield a tradeoff between computationally efficient and subspace-preserving affinity by using the orthogonal matching pursuit (OMP) algorithm, but this still takes more time to search the solution in OMP when the number of data points is large. In order to overcome these problems, we first propose a learned OMP (LOMP) algorithm to learn a single hidden neural network (SHNN) to fast approximate the l 0 code. We then exploit a sparse subspace clustering method based on l 0  code which is fast computed by SHNN. Two sufficient conditions are presented to guarantee that our method can give a subspace-preserving affinity. Experiments on handwritten digit and face clustering show that our method not only quickly computes the l 0  code, but also outperforms the relevant subspace clustering methods in clustering results. In particular, our method achieves the state-of-the-art clustering accuracy (94.32%) on MNIST.", "citation": "Citations (1)", "departments": ["Northeastern University", "Northeastern University", "Northeastern University"], "authors": ["Jun Li.....http://dblp.org/pers/hd/l/Li_0027:Jun", "Yu Kong.....http://dblp.org/pers/hd/k/Kong:Yu", "Yun Fu.....http://dblp.org/pers/hd/f/Fu_0001:Yun"], "conf": "aaai", "year": "2017", "pages": 7}