{"title": "Vocktail: A Virtual Cocktail for Pairing Digital Taste, Smell, and Color Sensations.", "fields": ["stimulus", "rgb color model", "flavor", "stimulus modality", "sensation"], "abstract": "Similar to the concept of a cocktail or mocktail, we present Vocktail (a.k.a. Virtual Cocktail) - an interactive drinking utensil that digitally simulates multisensory flavor experiences. The Vocktail system utilizes three common sensory modalities, taste, smell, and visual (color), to create virtual flavors and augment the existing flavors of a beverage. The system is coupled with a mobile application that enables users to create customized virtual flavor sensations by configuring each of the stimuli via Bluetooth. The system consists of a cocktail glass that is seamlessly fused into a 3D printed structure, which holds the electronic control module, three scent cartridges, and three micro air-pumps. When a user drinks from the system, the visual (RGB light projected on the beverage), taste (electrical stimulation at the tip of the tongue), and smell stimuli (emitted by micro air-pumps) are combined to create a virtual flavor sensation, thus altering the flavor of the beverage. In summary, this paper discusses 1) technical details of the Vocktail system and 2) user experiments that investigate the influences of these multimodal stimuli on the perception of virtual flavors in terms of five primary tastes (i.e. salty, sweet, bitter, sour, and umami). Our results suggest that the combination of these stimuli delivers richer flavor experiences, as compared to separately simulating individual modalities, and indicates that the types of pairings that can be formed between smell and electric taste stimuli.", "citation": "Citations (4)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore"], "authors": ["Nimesha Ranasinghe.....http://dblp.org/pers/hd/r/Ranasinghe:Nimesha", "Thi Ngoc Tram Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Thi_Ngoc_Tram", "Liangkun Yan.....http://dblp.org/pers/hd/y/Yan:Liangkun", "Lien-Ya Lin.....http://dblp.org/pers/hd/l/Lin:Lien=Ya", "David Tolley.....http://dblp.org/pers/hd/t/Tolley:David", "Ellen Yi-Luen Do.....http://dblp.org/pers/hd/d/Do:Ellen_Yi=Luen"], "conf": "mm", "year": "2017", "pages": 9}