{"title": "Is what you measure what you expect? Factors affecting smartphone-based mobile network measurement.", "fields": ["humanoid robot", "cellular network", "performance measurement", "mobile telephony", "simulation"], "abstract": "Many apps have been developed to measure the performance of mobile networks. Unfortunately, their measurement results may not be what users expect, because the results could be biased by various factors and the apps' descriptions may confuse users. Although a few recent studies pointed out several factors, they missed other important factors and lacked of finegrained analysis on the factors and measurement apps. Moreover, none has studied whether or not the descriptions of such apps will mislead users. In this paper, we conduct the first systematic study of the factors that could bias the result from measurement apps and their descriptions. We identify new factors, revisit known factors, and propose a novel approach with new tools to discover these factors in proprietary apps. We also develop a new measurement app named MobiScope for demonstrating how to mitigate the negative effects of these factors. Furthermore, we construct enhanced descriptions for measurement apps to provide users more information about what is measured. The extensive experimental results illustrate the negative effects of various factors, the improvement in performance measurement brought by MobiScope, and the clarity of the enhanced descriptions.", "citation": "Citations (1)", "departments": ["Hong Kong Polytechnic University", "Xi'an Jiaotong University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University"], "authors": ["Lei Xue.....http://dblp.org/pers/hd/x/Xue:Lei", "Xiaobo Ma.....http://dblp.org/pers/hd/m/Ma:Xiaobo", "Xiapu Luo.....http://dblp.org/pers/hd/l/Luo:Xiapu", "Le Yu.....http://dblp.org/pers/hd/y/Yu:Le", "Shuai Wang.....http://dblp.org/pers/hd/w/Wang_0012:Shuai", "Ting Chen.....http://dblp.org/pers/hd/c/Chen:Ting"], "conf": "infocom", "year": "2017", "pages": 9}