{"title": "Beamforming in the body: Energy-efficient and collision-free communication for implants.", "fields": ["collision", "beamforming", "decoding methods", "channel", "code division multiple access"], "abstract": "Implants are poised to revolutionize personalized healthcare by monitoring and actuating physiological functions. Such implants operate under challenging constraints of limited battery energy, heterogeneous tissue-dependent channel conditions and human-safety regulations. To address these issues, we propose a new cross-layer protocol for galvanic coupled implants wherein weak electrical currents are used in place of classical radio frequency (RF) links. As the first step, we devise a method that allows multiple implants to communicate individual sensed data to each other through CDMA code assignments, but delegates the computational burden of decoding only to the on-body surface relays. Then, we devise a distributed beamforming approach that allows coordinated transmissions from the implants to the relays by considering the specific tissue path chosen and tissue heating-related safety constraints. Our contributions are two fold: First, we devise a collision-free protocol that prevents undue interference at neighboring implants, especially for multiple deployments. Second, this is the first application of near-field distributed beamforming in human tissue. Results reveal significant improvement in the network lifetime for implants of up to 79% compared to the galvanic coupled links without beamforming.", "citation": "Not cited", "departments": ["Northeastern University", "University of Pavia", "Temple University", "University of Pavia", "Northeastern University"], "authors": ["Meenupriya Swaminathan.....http://dblp.org/pers/hd/s/Swaminathan:Meenupriya", "Anna Vizziello.....http://dblp.org/pers/hd/v/Vizziello:Anna", "Davy Duong.....http://dblp.org/pers/hd/d/Duong:Davy", "Pietro Savazzi.....http://dblp.org/pers/hd/s/Savazzi:Pietro", "Kaushik R. Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Kaushik_R="], "conf": "infocom", "year": "2017", "pages": 9}