{"title": "Two Birds One Stone: On both Cold-Start and Long-Tail Recommendation.", "fields": ["cold start", "recommender system", "multimedia", "computer science"], "abstract": "The number of \"hits\" has been widely regarded as the lifeblood of many web systems, e.g., e-commerce systems, advertising systems and multimedia consumption systems. However, users would not hit an item if they cannot see it, or they are not interested in the item. Recommender system plays a critical role of discovering interested items from near-infinite inventory and exhibiting them to potential users. Yet, two issues are crippling the recommender systems. One is \"how to handle new users\", and the other is \"how to surprise users\". The former is well-known as cold-start recommendation, and the latter can be investigated as long-tail recommendation. This paper, for the first time, proposes a novel approach which can simultaneously handle both cold-start and long-tail recommendation in a unified objective.   For the cold-start problem, we learn from side information, e.g., user attributes, user social relationships, etc. Then, we transfer the learned knowledge to new users. For the long-tail recommendation, we decompose the overall interested items into two parts: a low-rank part for short-head items and a sparse part for long-tail items. The two parts are independently revealed in the training stage, and transfered into the final recommendation for new users. Furthermore, we effectively formulate the two problems into a unified objective and present an iterative optimization algorithm. Experiments of recommendation on various real-world datasets, such as images, blogs, videos and musics, verify the superiority of our approach compared with the state-of-the-art work.", "citation": "Citations (3)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Queensland", "University of Electronic Science and Technology of China"], "authors": ["Jingjing Li.....http://dblp.org/pers/hd/l/Li:Jingjing", "Ke Lu.....http://dblp.org/pers/hd/l/Lu:Ke", "Zi Huang.....http://dblp.org/pers/hd/h/Huang:Zi", "Heng Tao Shen.....http://dblp.org/pers/hd/s/Shen:Heng_Tao"], "conf": "mm", "year": "2017", "pages": 9}