{"title": "MASH: A rate adaptation algorithm for multiview video streaming over HTTP.", "fields": ["interactivity", "the internet", "multimedia", "probabilistic logic", "user centered design"], "abstract": "Multiview videos offer unprecedented experience by allowing users to explore scenes from different angles and perspectives. Thus, such videos have been gaining substantial interest from major content providers such as Google and Facebook. Adaptive streaming of multiview videos is, however, challenging because of the Internet dynamics and the diversity of user interests and network conditions. To address this challenge, we propose a novel rate adaptation algorithm for multiview videos (called MASH). Streaming multiview videos is more user centric than single-view videos, because it heavily depends on how users interact with the different views. To efficiently support this interactivity, MASH constructs probabilistic view switching models that capture the switching behavior of the user in the current session, as well as the aggregate switching behavior across all previous sessions of the same video. MASH then utilizes these models to dynamically assign relative importance to different views. Furthermore, MASH uses a new buffer-based approach to request video segments of various views at different qualities, such that the quality of the streamed videos is maximized while the network bandwidth is not wasted. We have implemented a multiview video player and integrated MASH in it. We compare MASH versus the state-of-the-art algorithm used by YouTube for streaming multiview videos. Our experimental results show that MASH can produce much higher and smoother quality than the algorithm used by YouTube, while it is more efficient in using the network bandwidth. In addition, we conduct large-scale experiments with up to 100 concurrent multiview streaming sessions, and we show that MASH maintains fairness across competing sessions, and it does not overload the streaming server.", "citation": "Citations (1)", "departments": ["Simon Fraser University", "Simon Fraser University"], "authors": ["Khaled M. Diab.....http://dblp.org/pers/hd/d/Diab:Khaled_M=", "Mohamed Hefeeda.....http://dblp.org/pers/hd/h/Hefeeda:Mohamed"], "conf": "infocom", "year": "2017", "pages": 9}