{"title": "An HTTP/2-Based Adaptive Streaming Framework for 360° Virtual Reality Videos.", "fields": ["virtual reality", "quality of experience", "http 2", "push technology", "viewport"], "abstract": "Virtual Reality (VR) devices are becoming accessible to a large public, which is going to increase the demand for 360° VR videos. VR videos are often characterized by a poor quality of experience, due to the high bandwidth required to stream the 360° video. To overcome this issue, we spatially divide the VR video into tiles, so that each temporal segment is composed of several spatial tiles. Only the tiles belonging to the viewport, the region of the video watched by the user, are streamed at the highest quality. The other tiles are instead streamed at a lower quality. We also propose an algorithm to predict the future viewport position and minimize quality transitions during viewport changes. The video is delivered using the server push feature of the HTTP/2 protocol. Instead of retrieving each tile individually, the client issues a single push request to the server, so that all the required tiles are automatically pushed back to back. This approach allows to increase the achieved throughput, especially in mobile, high RTT networks. In this paper, we detail the proposed framework and present a prototype developed to test its performance using real-world 4G bandwidth traces. Particularly, our approach can save bandwidth up to 35% without severely impacting the quality viewed by the user, when compared to a traditional non-tiled VR streaming solution. Moreover, in high RTT conditions, our HTTP/2 approach can reach 3 times the throughput of tiled streaming over HTTP/1.1, and consistently reduce freeze time. These results represent a major improvement for the efficient delivery of 360° VR videos over the Internet.", "citation": "Citations (7)", "departments": ["Ghent University", "Adobe Systems", "University of Illinois at Urbana–Champaign", "Ghent University"], "authors": ["Stefano Petrangeli.....http://dblp.org/pers/hd/p/Petrangeli:Stefano", "Viswanathan Swaminathan.....http://dblp.org/pers/hd/s/Swaminathan:Viswanathan", "Mohammad Hosseini.....http://dblp.org/pers/hd/h/Hosseini:Mohammad", "Filip De Turck.....http://dblp.org/pers/hd/t/Turck:Filip_De"], "conf": "mm", "year": "2017", "pages": 9}