{"title": "QTEP: quality-aware test case prioritization.", "fields": ["software inspection", "test case", "modified condition decision coverage", "regression testing", "code coverage"], "abstract": "Test case prioritization (TCP) is a practical activity in software testing for exposing faults earlier. Researchers have proposed many TCP techniques to reorder test cases. Among them, coverage-based TCPs have been widely investigated. Specifically, coverage-based TCP approaches leverage coverage information between source code and test cases, i.e., static code coverage and dynamic code coverage, to schedule test cases. Existing coverage-based TCP techniques mainly focus on maximizing coverage while often do not consider the likely distribution of faults in source code. However, software faults are not often equally distributed in source code, e.g., around 80% faults are located in about 20% source code. Intuitively, test cases that cover the faulty source code should have higher priorities, since they are more likely to find faults.     In this paper, we present a quality-aware test case prioritization technique, QTEP, to address the limitation of existing coverage-based TCP algorithms. In QTEP, we leverage code inspection techniques, i.e., a typical statistic defect prediction model and a typical static bug finder, to detect fault-prone source code and then adapt existing coverage-based TCP algorithms by considering the weighted source code in terms of fault-proneness. Our evaluation with 16 variant QTEP techniques on 33 different versions of 7 open source Java projects shows that QTEP could improve existing coverage-based TCP techniques for both regression and new test cases. Specifically, the improvement of the best variant of QTEP for regression test cases could be up to 15.0% and on average 7.6%, and for all test cases (both regression and new test cases), the improvement could be up to 10.0% and on average 5.0%.", "citation": "Citations (3)", "departments": ["University of Waterloo", "University of Waterloo", "University of Waterloo"], "authors": ["Song Wang.....http://dblp.org/pers/hd/w/Wang:Song", "Jaechang Nam.....http://dblp.org/pers/hd/n/Nam:Jaechang", "Lin Tan.....http://dblp.org/pers/hd/t/Tan:Lin"], "conf": "sigsoft", "year": "2017", "pages": 12}