{"title": "LaChouTi: kernel vulnerability responding framework for the fragmented Android devices.", "fields": ["nexus", "kernel", "android", "vulnerability", "fragmentation"], "abstract": "The most criticized problem in the Android ecosystem is  fragmentation , i.e., 24,093 Android devices in the wild are made by 1,294 manufacturers and installed with extremely customized operating systems. The existence of so many different active versions of Android makes security updates and vulnerability responses across the whole range of Android devices difficult. In this paper, we seek to respond to the unpatched kernel vulnerabilities for the fragmented Android devices. Specifically, we propose and implement LaChouTi, which is an automated kernel security update framework consisting of cloud service and end application update. LaChouTi first tracks and identifies the exposed vulnerabilities according to the CVE-Patch map for the target Android kernels. Then, it generates differential binary patches for the identified results. Finally, it pushes and applies the patches to the kernels. We evaluate LaChouTi using 12 Nexus Android devices that have different Android versions, different kernel versions, different series and different manufacturers, and find 1922 unpatched kernel vulnerabilities in these devices. The results show that: (1) the security risk of unpatched vulnerabilities caused by fragmentation is serious; and (2) the proposed LaChouTi is effective in responding to such security risk. Finally, we implement LaChouTi on new commercial devices by collaborating with four internationally renowned manufacturers. The results demonstrate that LaChouTi is effective for the manufacturersâ   security updates.", "citation": "Citations (2)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["JingZheng Wu.....http://dblp.org/pers/hd/w/Wu:JingZheng", "Mutian Yang.....http://dblp.org/pers/hd/y/Yang:Mutian"], "conf": "sigsoft", "year": "2017", "pages": 6}