{"title": "Value Iteration for Long-Run Average Reward in Markov Decision Processes.", "fields": ["reward based selection", "anytime algorithm", "partially observable markov decision process", "markov decision process", "markov model"], "abstract": "Markov decision processes (MDPs) are standard models for probabilistic systems with non-deterministic behaviours. Long-run average rewards provide a mathematically elegant formalism for expressing long term performance. Value iteration (VI) is one of the simplest and most efficient algorithmic approaches to MDPs with other properties, such as reachability objectives. Unfortunately, a naive extension of VI does not work for MDPs with long-run average rewards, as there is no known stopping criterion. In this work our contributions are threefold. (1) We refute a conjecture related to stopping criteria for MDPs with long-run average rewards. (2) We present two practical algorithms for MDPs with long-run average rewards based on VI. First, we show that a combination of applying VI locally for each maximal end-component (MEC) and VI for reachability objectives can provide approximation guarantees. Second, extending the above approach with a simulation-guided on-demand variant of VI, we present an anytime algorithm that is able to deal with very large models. (3) Finally, we present experimental results showing that our methods significantly outperform the standard approaches on several benchmarks.", "citation": "Citations (6)", "year": "2017", "departments": ["Technische Universität München", "Institute of Science and Technology Austria", "Institute of Science and Technology Austria", "Technische Universität München", "Technische Universität München"], "conf": "cav", "authors": ["Pranav Ashok.....http://dblp.org/pers/hd/a/Ashok:Pranav", "Krishnendu Chatterjee.....http://dblp.org/pers/hd/c/Chatterjee:Krishnendu", "Przemyslaw Daca.....http://dblp.org/pers/hd/d/Daca:Przemyslaw", "Jan Kretínský.....http://dblp.org/pers/hd/k/Kret=iacute=nsk=yacute=:Jan", "Tobias Meggendorfer.....http://dblp.org/pers/hd/m/Meggendorfer:Tobias"], "pages": 21}