{"title": "Where the Wild Warnings Are: Root Causes of Chrome HTTPS Certificate Errors.", "fields": ["browser security", "internet privacy", "computer security", "certificate", "spurious relationship"], "abstract": "HTTPS error warnings are supposed to alert browser users to network attacks. Unfortunately, a wide range of non-attack circumstances trigger hundreds of millions of spurious browser warnings per month. Spurious warnings frustrate users, hinder the widespread adoption of HTTPS, and undermine trust in browser warnings. We investigate the root causes of HTTPS error warnings in the field, with the goal of resolving benign errors.   We study a sample of over 300 million errors that Google Chrome users encountered in the course of normal browsing. After manually reviewing more than 2,000 error reports, we developed automated rules to classify the top causes of HTTPS error warnings. We are able to automatically diagnose the root causes of two-thirds of error reports. To our surprise, we find that more than half of errors are caused by client-side or network issues instead of server misconfigurations. Based on these findings, we implemented more actionable warnings and other browser changes to address client-side error causes. We further propose solutions for other classes of root causes.", "citation": "Citations (2)", "year": "2017", "departments": ["Google", "Google", "Google", "Purdue University", "Leibniz Univers ... nnover, Germany"], "conf": "ccs", "authors": ["Mustafa Emre Acer.....http://dblp.org/pers/hd/a/Acer:Mustafa_Emre", "Emily Stark.....http://dblp.org/pers/hd/s/Stark:Emily", "Adrienne Porter Felt.....http://dblp.org/pers/hd/f/Felt:Adrienne_Porter", "Sascha Fahl.....http://dblp.org/pers/hd/f/Fahl:Sascha", "Radhika Bhargava.....http://dblp.org/pers/hd/b/Bhargava:Radhika", "Bhanu Dev.....http://dblp.org/pers/hd/d/Dev:Bhanu", "Matt Braithwaite.....http://dblp.org/pers/hd/b/Braithwaite:Matt", "Ryan Sleevi.....http://dblp.org/pers/hd/s/Sleevi:Ryan", "Parisa Tabriz.....http://dblp.org/pers/hd/t/Tabriz:Parisa"], "pages": 14}