{"title": "Spindle Net: Person Re-identification with Human Body Region Guided Feature Decomposition and Fusion.", "fields": ["discriminative model", "convolutional neural network", "fusion", "feature learning", "semantics"], "abstract": "Person re-identification (ReID) is an important task in video surveillance and has various applications. It is non-trivial due to complex background clutters, varying illumination conditions, and uncontrollable camera settings. Moreover, the person body misalignment caused by detectors or pose variations is sometimes too severe for feature matching across images. In this study, we propose a novel Convolutional Neural Network (CNN), called Spindle Net, based on human body region guided multi-stage feature decomposition and tree-structured competitive feature fusion. It is the first time human body structure information is considered in a CNN framework to facilitate feature learning. The proposed Spindle Net brings unique advantages: 1) it separately captures semantic features from different body regions thus the macro-and micro-body features can be well aligned across images, 2) the learned region features from different semantic regions are merged with a competitive scheme and discriminative features can be well preserved. State of the art performance can be achieved on multiple datasets by large margins. We further demonstrate the robustness and effectiveness of the proposed Spindle Net on our proposed dataset SenseReID without fine-tuning.", "citation": "Citations (102)", "year": "2017", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "conf": "cvpr", "authors": ["Haiyu Zhao.....http://dblp.org/pers/hd/z/Zhao:Haiyu", "Maoqing Tian.....http://dblp.org/pers/hd/t/Tian:Maoqing", "Shuyang Sun.....http://dblp.org/pers/hd/s/Sun:Shuyang", "Jing Shao.....http://dblp.org/pers/hd/s/Shao:Jing", "Junjie Yan.....http://dblp.org/pers/hd/y/Yan:Junjie", "Shuai Yi.....http://dblp.org/pers/hd/y/Yi:Shuai", "Xiaogang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaogang", "Xiaoou Tang.....http://dblp.org/pers/hd/t/Tang:Xiaoou"], "pages": 9}