{"title": "Learning Deep Match Kernels for Image-Set Classification.", "fields": ["kernel", "discriminative model", "artificial neural network", "ambiguity", "machine learning"], "abstract": "Image-set classification has recently generated great popularity due to its widespread applications in computer vision. The great challenges arise from effectively and efficiently measuring the similarity between image sets with high inter-class ambiguity and huge intra-class variability. In this paper, we propose deep match kernels (DMK) to directly measure the similarity between image sets in the match kernel framework. Specifically, we build deep local match kernels between images upon arc-cosine kernels, which can faithfully characterize the similarity between images by mimicking deep neural networks, we introduce anchors to aggregate those deep local match kernels into a global match kernel between image sets, which is learned in a supervised way by kernel alignment and therefore more discriminative. The DMK provides the first match kernel framework for image-set classification, which removes specific assumptions usually required in previous approaches and is computationally more efficient. We conduct extensive experiments on four datasets for three diverse image-set classification tasks. The DMK achieves high performance and consistently surpasses state-of-the-art methods, showing its great effectiveness for image-set classification.", "citation": "Not cited", "year": "2017", "departments": ["Shandong University", "University of Western Ontario", "University of Pennsylvania", "Shandong University", "Shandong University of Finance and Economics"], "conf": "cvpr", "authors": ["Haoliang Sun.....http://dblp.org/pers/hd/s/Sun:Haoliang", "Xiantong Zhen.....http://dblp.org/pers/hd/z/Zhen:Xiantong", "Yuanjie Zheng.....http://dblp.org/pers/hd/z/Zheng:Yuanjie", "Gongping Yang.....http://dblp.org/pers/hd/y/Yang:Gongping", "Yilong Yin.....http://dblp.org/pers/hd/y/Yin:Yilong", "Shuo Li.....http://dblp.org/pers/hd/l/Li_0001:Shuo"], "pages": 10}