{"title": "CrystalNet: Faithfully Emulating Large Production Networks.", "fields": ["network management station", "heterogeneous network", "intelligent computer network", "network traffic control", "network operations center"], "abstract": "Network reliability is critical for large clouds and online service providers like Microsoft. Our network is large, heterogeneous, complex and undergoes constant churns. In such an environment even small issues triggered by device failures, buggy device software, configuration errors, unproven management tools and unavoidable human errors can quickly cause large outages. A promising way to minimize such network outages is to proactively validate all network operations in a high-fidelity network emulator, before they are carried out in production. To this end, we present CrystalNet, a cloud-scale, high-fidelity network emulator. It runs real network device firmwares in a network of containers and virtual machines, loaded with production configurations. Network engineers can use the same management tools and methods to interact with the emulated network as they do with a production network. CrystalNet can handle heterogeneous device firmwares and can scale to emulate thousands of network devices in a matter of minutes. To reduce resource consumption, it carefully selects a boundary of emulations, while ensuring correctness of propagation of network changes. Microsoft's network engineers use CrystalNet on a daily basis to test planned network operations. Our experience shows that CrystalNet enables operators to detect many issues that could trigger significant outages.", "citation": "Citations (8)", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Hongqiang Harry Liu.....http://dblp.org/pers/hd/l/Liu:Hongqiang_Harry", "Yibo Zhu.....http://dblp.org/pers/hd/z/Zhu:Yibo", "Jitu Padhye.....http://dblp.org/pers/hd/p/Padhye:Jitu", "Jiaxin Cao.....http://dblp.org/pers/hd/c/Cao:Jiaxin", "Sri Tallapragada.....http://dblp.org/pers/hd/t/Tallapragada:Sri", "Nuno P. Lopes.....http://dblp.org/pers/hd/l/Lopes:Nuno_P=", "Andrey Rybalchenko.....http://dblp.org/pers/hd/r/Rybalchenko:Andrey", "Guohan Lu.....http://dblp.org/pers/hd/l/Lu:Guohan", "Lihua Yuan.....http://dblp.org/pers/hd/y/Yuan:Lihua"], "conf": "sosp", "year": "2017", "pages": 15}