{"title": "TCP Rapid: From theory to practice.", "fields": ["network packet", "timestamping", "network congestion", "testbed", "noise measurement"], "abstract": "Delay and rate-based alternatives to TCP congestion-control have been around for nearly three decades and have seen a recent surge in interest. However, such designs have faced significant resistance in being deployed on a wide-scale across the Internet — this has been mostly due to serious concerns about noise in delay measurements, pacing inter-packet gaps, and/or required changes to the standard TCP stack/headers. With the advent of high-speed networking, some of these concerns become even more significant. In this paper, we consider Rapid, a recent proposal for ultra-high speed congestion control, which perhaps stretches each of these challenges to the greatest extent. Rapid adopts a framework of continuous fine-scale bandwidth probing, which requires a potentially different and finely-controlled gap for every packet, high-precision timestamping of received packets, and reliance on fine-scale changes in inter-packet gaps. While simulation-based evaluations of Rapid show that it has outstanding performance gains along several important dimensions, these will not translate to the real-world unless the above challenges are addressed. We design a Linux implementation of Rapid after carefully considering each of these challenges. Our evaluations on a 10Gbps testbed confirm that the implementation can indeed achieve the claimed performance gains, and that it would not have been possible unless each of the above challenges was addressed.", "citation": "Citations (1)", "departments": ["University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill", "University of North Carolina at Chapel Hill"], "authors": ["Qianwen Yin.....http://dblp.org/pers/hd/y/Yin:Qianwen", "Jasleen Kaur.....http://dblp.org/pers/hd/k/Kaur_0001:Jasleen", "F. Donelson Smith.....http://dblp.org/pers/hd/s/Smith:F=_Donelson"], "conf": "infocom", "year": "2017", "pages": 9}