{"title": "Page Fault Support for Network Controllers.", "fields": ["conventional memory", "registered memory", "memory overcommitment", "zero page", "memory mapped file"], "abstract": "Direct network I/O allows network controllers (NICs) to expose multiple instances of themselves, to be used by untrusted software without a trusted intermediary. Direct I/O thus frees researchers from legacy software, fueling studies that innovate in multitenant setups. Such studies, however, overwhelmingly ignore one serious problem: direct memory accesses (DMAs) of NICs disallow page faults, forcing systems to either pin entire address spaces to physical memory and thereby hinder memory utilization, or resort to APIs that pin/unpin memory buffers before/after they are DMAed, which complicates the programming model and hampers performance.   We solve this problem by designing and implementing page fault support for InfiniBand and Ethernet NICs. A main challenge we tackle---unique to NICs---is handling receive DMAs that trigger page faults, leaving the NIC without memory to store the incoming data. We demonstrate that our solution provides all the benefits associated with \"regular\" virtual memory, notably (1) a simpler programming model that rids users from the need to pin, and (2) the ability to employ all the canonical memory optimizations, such as memory overcommitment and demand-paging based on actual use. We show that, as a result, benchmark performance improves by up to 1.9x.", "citation": "Citations (4)", "year": "2017", "departments": ["Technion – Israel Institute of Technology", "Technion – Israel Institute of Technology", "Mellanox Technologies", "Mellanox Technologies", "Mellanox Technologies"], "conf": "asplos", "authors": ["Ilya Lesokhin.....http://dblp.org/pers/hd/l/Lesokhin:Ilya", "Haggai Eran.....http://dblp.org/pers/hd/e/Eran:Haggai", "Shachar Raindel.....http://dblp.org/pers/hd/r/Raindel:Shachar", "Guy Shapiro.....http://dblp.org/pers/hd/s/Shapiro:Guy", "Sagi Grimberg.....http://dblp.org/pers/hd/g/Grimberg:Sagi", "Liran Liss.....http://dblp.org/pers/hd/l/Liss:Liran", "Muli Ben-Yehuda.....http://dblp.org/pers/hd/b/Ben=Yehuda:Muli", "Nadav Amit.....http://dblp.org/pers/hd/a/Amit:Nadav", "Dan Tsafrir.....http://dblp.org/pers/hd/t/Tsafrir:Dan"], "pages": 18}