{"title": "Toward Realistic Hands Gesture Interface: Keeping it Simple for Developers and Machines.", "fields": ["small set", "predicate", "coding", "gesture", "gesture recognition"], "abstract": "Development of a rich hand-gesture-based interface is currently a tedious process, requiring expertise in computer vision and/or machine learning. We address this problem by introducing a simple language for pose and gesture description, a set of development tools for using it, and an algorithmic pipeline that recognizes it with high accuracy. The language is based on a small set of basic propositions, obtained by applying four predicate types to the fingers and to palm center: direction, relative location, finger touching and finger folding state. This enables easy development of a gesture-based interface, using coding constructs, gesture definition files or an editing GUI. The language is recognized from 3D camera input with an algorithmic pipeline composed of multiple classification/regression stages, trained on a large annotated dataset. Our experimental results indicate that the pipeline enables successful gesture recognition with a very low computational load, thus enabling a gesture-based interface on low-end processors.", "citation": "Citations (1)", "year": "2017", "departments": ["Microsoft", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "conf": "chi", "authors": ["Eyal Krupka.....http://dblp.org/pers/hd/k/Krupka:Eyal", "Kfir Karmon.....http://dblp.org/pers/hd/k/Karmon:Kfir", "Noam Bloom.....http://dblp.org/pers/hd/b/Bloom:Noam", "Daniel Freedman.....http://dblp.org/pers/hd/f/Freedman:Daniel", "Ilya Gurvich.....http://dblp.org/pers/hd/g/Gurvich:Ilya", "Aviv Hurvitz.....http://dblp.org/pers/hd/h/Hurvitz:Aviv", "Ido Leichter.....http://dblp.org/pers/hd/l/Leichter:Ido", "Yoni Smolin.....http://dblp.org/pers/hd/s/Smolin:Yoni", "Yuval Tzairi.....http://dblp.org/pers/hd/t/Tzairi:Yuval", "Alon Vinnikov.....http://dblp.org/pers/hd/v/Vinnikov:Alon", "Aharon Bar-Hillel.....http://dblp.org/pers/hd/b/Bar=Hillel:Aharon"], "pages": 12}