{"title": "Learning Non-local Image Diffusion for Image Denoising.", "fields": ["non local means", "exploit", "anisotropic diffusion", "reaction diffusion system", "structural similarity"], "abstract": "Image diffusion plays a fundamental role for the task of image denoising. The recently proposed trainable nonlinear reaction diffusion (TNRD) model defines a simple but very effective framework for image denoising. However, as the TNRD model is a local model, whose diffusion behavior is purely controlled by information of local patches, it is prone to create artifacts in the homogenous regions and over-smooth highly textured regions, especially in the case of strong noise levels. Meanwhile, it is widely known that the non-local self-similarity (NSS) prior stands as an effective image prior for image denoising, which has been widely exploited in many non-local methods. In this work, we are highly motivated to embed the NSS prior into the TNRD model to tackle its weaknesses. In order to preserve the expected property that end-to-end training remains available, we exploit the NSS prior by defining a set of non-local filters, and derive our proposed trainable non-local reaction diffusion (TNLRD) model for image denoising. Together with the local filters and influence functions, the non-local filters are learned by employing loss-specific training. The experimental results show that the trained TNLRD model produces visually plausible recovered images with more textures and less artifacts, compared to its local versions. Moreover, the trained TNLRD model can achieve strongly competitive performance to recent state-of-the-art image denoising methods in terms of peak signal-to-noise ratio (PSNR) and structural similarity index (SSIM).", "citation": "Citations (2)", "departments": ["National University of Defense Technology", "National University of Defense Technology", "Shenzhen University", "National University of Defense Technology", "ULSee Inc., Hangzhou, China"], "authors": ["Peng Qiao.....http://dblp.org/pers/hd/q/Qiao:Peng", "Yong Dou.....http://dblp.org/pers/hd/d/Dou:Yong", "WenSen Feng.....http://dblp.org/pers/hd/f/Feng:WenSen", "Rongchun Li.....http://dblp.org/pers/hd/l/Li:Rongchun", "Yunjin Chen.....http://dblp.org/pers/hd/c/Chen:Yunjin"], "conf": "mm", "year": "2017", "pages": 9}