{"title": "Multihop calibration for mobile sensing: K-hop Calibratability and reference sensor deployment.", "fields": ["graph", "software deployment", "data quality", "hop", "rendezvous"], "abstract": "Mobile vehicles, equipped with low-cost sensors, can provide unprecedented opportunities for urban monitoring with a wide coverage. The quality of collected data is very important for many applications. The low-cost mobile sensors can, however, suffer from limited accuracy, high instability, and sensor drift. Therefore, they need to be frequently calibrated to preserve a good data quality. Frequent sensor calibration can be achieved by deploying static high-precision sensors (called reference sensors) and exploiting meeting points (i.e., rendezvous) between the reference sensors and mobile sensors. A calibrated mobile sensor can also be used to calibrate an uncalibrated mobile sensor when they meet, referred to as multihop calibration. In this paper, we introduce a novel concept, k-hop calibratability, in the context of multihop calibration: a sensor is k-hop calibratable if the calibration path is no larger than k. We consider the problem of how to deploy the reference sensors to ensure that all sensors in the network are k-hop calibratable. To address this problem, we formally define the rendezvous connection graph to precisely describe the relationship between mobile sensors and (virtual) reference sensors. Based on this definition, we formulate the reference sensor deployment problem as a set cover problem. We also extend our problem to consider practical deployment requirements. We propose efficient algorithms and conduct an extensive evaluation in the context of mobile air quality monitoring. We present a detailed prototype implementation of the mobile sensors and reference sensors. Evaluations using real-world datasets show the effectiveness of the algorithms.", "citation": "Citations (4)", "departments": ["Zhejiang University", "Zhejiang University", "Zhejiang University"], "authors": ["Kaibo Fu.....http://dblp.org/pers/hd/f/Fu:Kaibo", "Wei Ren.....http://dblp.org/pers/hd/r/Ren:Wei", "Wei Dong.....http://dblp.org/pers/hd/d/Dong_0001:Wei"], "conf": "infocom", "year": "2017", "pages": 9}