{"title": "doppioDB: A Hardware Accelerated Database.", "fields": ["hardware acceleration", "central processing unit", "database engine", "hardware compatibility list", "xeon", "operator", "table", "multi core processor"], "abstract": "Relational databases provide a wealth of functionality to a wide range of applications. Yet, there are tasks for which they are less than optimal, for instance when processing becomes more complex (e.g., matching regular expressions) or the data is less structured (e.g., text or long strings). In this demonstration we show the benefit of using specialized hardware for such tasks and highlight the importance of a flexible, reusable mechanism for extending database engines with hardware-based operators.   We present doppioDB which consists of MonetDB, a main-memory column store, extended with Hardware User Defined Functions (HUDFs). In our demonstration the HUDFs are used to provide seamless acceleration of two string operators,  LIKE  and  REGEXP_LIKE , and two analytics operators,  SKYLINE  and  SGD  (stochastic gradient descent).   We evaluate doppioDB on an emerging hybrid multicore architecture, the Intel Xeon+FPGA platform, where the CPU and FPGA have cache-coherent access to the same memory, such that the hardware operators can directly access the database tables. For integration we rely on HUDFs as a unit of scheduling and management on the FPGA. In the demonstration we show the acceleration benefits of hardware operators, as well as their flexibility in accommodating changing workloads.", "citation": "Not cited", "year": "2017", "departments": ["ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich", "ETH Zurich"], "conf": "sigmod", "authors": ["David Sidler.....http://dblp.org/pers/hd/s/Sidler:David", "Zsolt István.....http://dblp.org/pers/hd/i/Istv=aacute=n:Zsolt", "Muhsen Owaida.....http://dblp.org/pers/hd/o/Owaida:Muhsen", "Kaan Kara.....http://dblp.org/pers/hd/k/Kara:Kaan", "Gustavo Alonso.....http://dblp.org/pers/hd/a/Alonso:Gustavo"], "pages": 4}