{"title": "Deep Location-Specific Tracking.", "fields": ["clutter", "exploit", "bittorrent tracker", "convolutional neural network", "pooling"], "abstract": "Convolutional Neural Network (CNN) based methods have shown significant performance gains in the problem of visual tracking in recent years. Due to many uncertain changes of objects online, such as abrupt motion, background clutter and large deformation, the visual tracking is still a challenging task. We propose a novel algorithm, namely Deep Location-Specific Tracking, which decomposes the tracking problem into a localization task and a classification task, and trains an individual network for each task. The localization network exploits the information in the current frame and provides a specific location to improve the probability of successful tracking, while the classification network finds the target among many examples generated around the target location in the previous frame, as well as the one estimated from the localization network in the current frame. CNN based trackers often have massive number of trainable parameters, and are prone to over-fitting to some particular object states, leading to less precision or tracking drift. We address this problem by learning a classification network based on 1 × 1 convolution and global average pooling. Extensive experimental results on popular benchmark datasets show that the proposed tracker achieves competitive results without using additional tracking videos for fine-tuning. The code is available at https://github.com/ZjjConan/DLST", "citation": "Not cited", "departments": ["Hong Kong Polytechnic University", "Dalian University of Technology", "Hong Kong Polytechnic University", "Hong Kong Polytechnic University"], "authors": ["Lingxiao Yang.....http://dblp.org/pers/hd/y/Yang:Lingxiao", "Risheng Liu.....http://dblp.org/pers/hd/l/Liu:Risheng", "David Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:David", "Lei Zhang.....http://dblp.org/pers/hd/z/Zhang:Lei"], "conf": "mm", "year": "2017", "pages": 9}