{"title": "WORT: Write Optimal Radix Tree for Persistent Memory Storage Systems.", "fields": ["trie", "prefix", "fractal tree index", "radix tree", "performance studies"], "abstract": "Recent interest in persistent memory (PM) has stirred development of index structures that are efficient in PM. Recent such developments have all focused on variations of the B-tree. In this paper, we show that the radix tree, which is another less popular indexing structure, can be more appropriate as an efficient PM indexing structure. This is because the radix tree structure is determined by the prefix of the inserted keys and also does not require tree rebalancing operations and node granularity updates. However, the radix tree as-is cannot be used in PM. As another contribution, we present three radix tree variants, namely, WORT (Write Optimal Radix Tree), WOART (Write Optimal Adaptive Radix Tree), and ART+CoW. Of these, the first two are optimal for PM in the sense that they only use one 8-byte failure-atomic write per update to guarantee the consistency of the structure and do not require any duplicate copies for logging or CoW. Extensive performance studies show that our proposed radix tree variants perform considerable better than recently proposed B-tree variants for PM such NVTree, wB+Tree, and FPTree for synthetic workloads as well as in implementations within Memcached.", "citation": "Citations (7)", "departments": ["Ulsan National Institute of Science and Technology", "Hongik University", "Ulsan National Institute of Science and Technology", "Ulsan National Institute of Science and Technology", "Ulsan National Institute of Science and Technology"], "authors": ["Se Kwon Lee.....http://dblp.org/pers/hd/l/Lee:Se_Kwon", "K. Hyun Lim.....http://dblp.org/pers/hd/l/Lim:K=_Hyun", "Hyunsub Song.....http://dblp.org/pers/hd/s/Song:Hyunsub", "Beomseok Nam.....http://dblp.org/pers/hd/n/Nam:Beomseok", "Sam H. Noh.....http://dblp.org/pers/hd/n/Noh:Sam_H="], "conf": "fast", "year": "2017", "pages": 14}