{"title": "Dynamic base station formation for solving NLOS problem in 5G millimeter-wave communication.", "fields": ["beamforming", "base station", "nonlinear programming", "architecture", "channel"], "abstract": "Millimeter-wave communication is one of the enabling technologies to meet high data-rate requirements of 5G wireless systems. Millimeter-wave systems due large available bandwidth enable gigabit-per-second data rates for line-of-sight (LOS) transmissions in short distances. However, for non-line-of-sight (NLOS) transmissions, millimeter-wave systems suffers performance degradation because the received signal strengths at user equipments (UEs) are not satisfactory. In this paper, the NLOS problem in millimeter-wave systems is treated from SoftAir (a wireless software-defined networking architecture) perspective. In particular, a so-called dynamic base station (BS) formation is introduced, which adaptively coordinates BSs and their multiple antennas to always satisfy UEs' quality-of-service (QoS) requirements in NLOS cases. First, the architecture for software-defined millimeter-wave system is introduced, where remote radio heads (RRHs) coordination is explained and millimeter-wave channel model between RRHs and UEs is analyzed. A ubiquitous millimeter-wave coverage problem is formulated, which jointly optimizes RRH-UE associations and beamforming weights of RRHs to maximize the UE sum-rate while guaranteeing QoS and system-level constraints. After proving the np-hardness of the coverage optimization problem with non-convex constraints, an iterative algorithm is developed for dynamic BS formation that achieves ubiquitous coverage with high data rates in LOS and NLOS cases. Through successive convex approximations, the proposed dynamic BS formation algorithm transforms the original mixed-integer nonlinear programming into a mixed-integer second-order cone programming, which is efficiently solved by convex tools. Simulations validate the efficacy of our solution that completely solves NLOS problem by facilitating ubiquitous coverage in 5G millimeter-wave systems.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Shih-Chun Lin.....http://dblp.org/pers/hd/l/Lin:Shih=Chun", "Ian F. Akyildiz.....http://dblp.org/pers/hd/a/Akyildiz:Ian_F="], "conf": "infocom", "year": "2017", "pages": 9}