{"title": "f-GANs in an Information Geometric Nutshell.", "fields": ["discriminator", "exponential family", "kullback leibler divergence", "large numbers", "subset and superset"], "abstract": "Nowozin \\textit{et al} showed last year how to extend the GAN \\textit{principle} to all $f$-divergences. The approach is elegant but falls short of a full description of the supervised game, and says little about the key player, the generator: for example, what does the generator actually converge to if solving the GAN game means convergence in some space of parameters? How does that provide hints on the generator's design and compare to the flourishing but almost exclusively experimental literature on the subject? In this paper, we unveil a broad class of distributions for which such convergence happens --- namely, deformed exponential families, a wide superset of exponential families ---. We show that current deep architectures are able to factorize a very large number of such densities using an especially compact design, hence displaying the power of deep architectures and their concinnity in the $f$-GAN game. This result holds given a sufficient condition on \\textit{activation functions} --- which turns out to be satisfied by popular choices. The key to our results is a variational generalization of an old theorem that relates the KL divergence between regular exponential families and divergences between their natural parameters. We complete this picture with additional results and experimental insights on how these results may be used to ground further improvements of GAN architectures, via (i) a principled design of the activation functions in the generator and (ii) an explicit integration of proper composite losses' link function in the discriminator.", "citation": "Citations (3)", "year": "2017", "departments": ["Australian National University", "University of Sydney", "Australian National University", "Commonwealth Scientific and Industrial Research Organisation", "Australian National University", "Data61"], "conf": "nips", "authors": ["Richard Nock.....http://dblp.org/pers/hd/n/Nock:Richard", "Zac Cranko.....http://dblp.org/pers/hd/c/Cranko:Zac", "Aditya Krishna Menon.....http://dblp.org/pers/hd/m/Menon:Aditya_Krishna", "Lizhen Qu.....http://dblp.org/pers/hd/q/Qu:Lizhen", "Robert C. Williamson.....http://dblp.org/pers/hd/w/Williamson:Robert_C="], "pages": 9}