{"title": "vNFS: Maximizing NFS Performance with Compounds and Vectorized I/O.", "fields": ["latency", "unix", "posix", "parallel computing", "input output"], "abstract": "Modern systems use networks extensively, accessing both services and storage across local and remote networks. Latency is a key performance challenge, and packing multiple small operations into fewer large ones is an effective way to amortize that cost, especially after years of significant improvement in bandwidth but not latency. To this end, the NFSv4 protocol supports a  compounding  feature to combine multiple operations. Yet compounding has been underused since its conception because the synchronous POSIX file-system API issues only one (small) request at a time.   We propose  vNFS , an NFSv4.1-compliant client that exposes a vectorized high-level API and leverages NFS  compound procedures  to maximize performance. We designed and implemented vNFS as a user-space RPC library that supports an assortment of bulk operations on multiple files and directories. We found it easy to modify several UNIX utilities, an HTTP/2 server, and Filebench to use vNFS. We evaluated vNFS under a wide range of workloads and network latency conditions, showing that vNFS improves performance even for low-latency networks. On high-latency networks, vNFS can improve performance by as much as two orders of magnitude.", "citation": "Not cited", "departments": ["Stony Brook University", "Stony Brook University", "IBM", "Stony Brook University", "Harvey Mudd College", "Stony Brook University", "IBM", "Stony Brook University", "Stony Brook University", "Ward Melville High School"], "authors": ["Ming Chen.....http://dblp.org/pers/hd/c/Chen:Ming", "Dean Hildebrand.....http://dblp.org/pers/hd/h/Hildebrand:Dean", "Henry Nelson.....http://dblp.org/pers/hd/n/Nelson:Henry", "Jasmit Saluja.....http://dblp.org/pers/hd/s/Saluja:Jasmit", "Ashok Sankar Harihara Subramony.....http://dblp.org/pers/hd/s/Subramony:Ashok_Sankar_Harihara", "Erez Zadok.....http://dblp.org/pers/hd/z/Zadok:Erez"], "conf": "fast", "year": "2017", "pages": 14}