{"title": "Economic viability of a virtual ISP.", "fields": ["service provider", "upgrade", "mobile broadband", "end user", "economic impact analysis"], "abstract": "Growing mobile data usage has led to end users paying substantial data costs, while Internet service providers (ISPs) struggle to upgrade their networks to keep up with demand and maintain high quality-of-service (QoS). This problem is particularly severe for smaller ISPs with less capital. Instead of simply upgrading their network infrastructure, ISPs can pool their networks to provide a good QoS and attract more users. Such a vISP (virtual ISP), for example, Google's Project Fi, allows users to access any of its partner ISPs' networks. We provide the first systematic analysis of a vISP's economic impact, showing that the vISP provides a viable solution for smaller ISPs attempting to attract more users, but may not maintain a positive profit if users' data demands evolve. To do so, we consider users' decisions of whether to defect from their current ISP to the vISP, as well as ISPs' decisions on whether to partner with the vISP. We derive the vISP's dependence on user behavior and partner ISPs: users with very light or very heavy usage are the most likely to defect, while ISPs with heavy-usage customers can benefit from declining to partner with the vISP. Our analytical results are verified with extensive numerical simulations.", "citation": "Citations (4)", "departments": ["Princeton University", "Carnegie Mellon University", "University of California, Riverside", "City University of Hong Kong", "Zoomi Inc."], "authors": ["Liang Zheng.....http://dblp.org/pers/hd/z/Zheng_0002:Liang", "Carlee Joe-Wong.....http://dblp.org/pers/hd/j/Joe=Wong:Carlee", "Jiasi Chen.....http://dblp.org/pers/hd/c/Chen:Jiasi", "Christopher G. Brinton.....http://dblp.org/pers/hd/b/Brinton:Christopher_G=", "Chee Wei Tan.....http://dblp.org/pers/hd/t/Tan_0001:Chee_Wei", "Mung Chiang.....http://dblp.org/pers/hd/c/Chiang:Mung"], "conf": "infocom", "year": "2017", "pages": 9}