{"title": "Some Recipes Can Do More Than Spoil Your Appetite: Analyzing the Security and Privacy Risks of IFTTT Recipes.", "fields": ["malware", "internet of things", "end user", "internet privacy", "secrecy"], "abstract": "The use of end-user programming, such as if-this-then-that (IFTTT), is becoming increasingly common. Services like IFTTT allow users to easily create new functionality by connecting arbitrary Internet-of-Things (IoT) devices and online services using simple if-then rules, commonly known as recipes. However, such convenience at times comes at the cost of security and privacy risks for end users. To gain an in-depth understanding of the potential security and privacy risks, we build an information-flow model to analyze how often IFTTT recipes involve potential integrity or secrecy violations. Our analysis finds that around 50% of the 19,323 unique recipes we examined are potentially unsafe, as they contain a secrecy violation, an integrity violation, or both. We next categorize the types of harm that these potentially unsafe recipes can cause to users. After manually examining a random selection of potentially unsafe recipes, we find that recipes can not only lead to harms such as personal embarrassment but can also be exploited by an attacker, e.g., to distribute malware or carry out denial-of-service attacks. The use of IoT devices and services like IFTTT is expected only to grow in the near future; our analysis suggests users need to be both informed about and protected from these emerging threats to which they could be unwittingly exposing themselves.", "citation": "Citations (3)", "departments": ["University of Rochester", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University"], "authors": ["Milijana Surbatovich.....http://dblp.org/pers/hd/s/Surbatovich:Milijana", "Jassim Aljuraidan.....http://dblp.org/pers/hd/a/Aljuraidan:Jassim", "Lujo Bauer.....http://dblp.org/pers/hd/b/Bauer:Lujo", "Anupam Das.....http://dblp.org/pers/hd/d/Das_0001:Anupam", "Limin Jia.....http://dblp.org/pers/hd/j/Jia:Limin"], "conf": "www", "year": "2017", "pages": 10}