{"title": "Network slicing games: Enabling customization in multi-tenant networks.", "fields": ["slicing", "nash equilibrium", "next generation mobile networks", "price of anarchy", "shared resource"], "abstract": "Network slicing to enable resource sharing among multiple tenants-network operators and/or services-is considered a key functionality for next generation mobile networks. This paper provides an analysis of a well-known model for resource sharing, the ‘share-constrained proportional allocation’ mechanism, to realize network slicing. This mechanism enables tenants to reap the performance benefits of sharing, while retaining the ability to customize their own users' allocation. This results in a network slicing game in which each tenant reacts to the user allocations of the other tenants so as to maximize its own utility. We show that, under appropriate conditions, the game associated with such strategic behavior converges to a Nash equilibrium. At the Nash equilibrium, a tenant always achieves the same, or better, performance than under a static partitioning of resources, hence providing the same level of protection as such static partitioning. We further analyze the efficiency and fairness of the resulting allocations, providing tight bounds for the price of anarchy and envy-freeness. Our analysis and extensive simulation results confirm that the mechanism provides a comprehensive practical solution to realize network slicing. Our theoretical results also fill a gap in the literature regarding the analysis of this resource allocation model under strategic players.", "citation": "Citations (1)", "departments": ["University of Texas at Austin", "IMDEA", "University of Texas at Austin", "NEC Laboratorie ... elberg, Germany"], "authors": ["Pablo Caballero Garces.....http://dblp.org/pers/hd/g/Garces:Pablo_Caballero", "Albert Banchs.....http://dblp.org/pers/hd/b/Banchs:Albert", "Gustavo de Veciana.....http://dblp.org/pers/hd/v/Veciana:Gustavo_de", "Xavier Pérez Costa.....http://dblp.org/pers/hd/c/Costa:Xavier_P=eacute=rez"], "conf": "infocom", "year": "2017", "pages": 9}