{"title": "Building Structured Databases of Factual Knowledge from Massive Text Corpora.", "fields": ["text corpus", "knowledge extraction", "ranging", "relationship extraction", "annotation"], "abstract": "In today's computerized and information-based society, people are inundated with vast amounts of text data, ranging from news articles, social media post, scientific publications, to a wide range of textual information from various domains (corporate reports, advertisements, legal acts, medical reports). To turn such massive unstructured text data into structured, actionable knowledge, one of the grand challenges is to gain an understanding of the  factual information  ( e.g. , entities, attributes, relations) in the text.   In this tutorial, we introduce data-driven methods on mining structured facts (i.e., entities and their relations/attributes for types of interest) from massive text corpora, to construct structured databases of factual knowledge (called  StructDBs ). State-of-the-art information extraction systems have strong reliance on large amounts of task/corpus-specific labeled data (usually created by domain experts). In practice, the scale and efficiency of such a manual annotation process are rather limited, especially when dealing with text corpora of various kinds (domains, languages, genres). We focus on methods that are minimally-supervised, domain-independent, and language-independent for timely StructDB construction across various application domains (news, social media, biomedical, business), and demonstrate on real datasets how these StructDBs aid in data exploration and knowledge discovery.", "citation": "Not cited", "year": "2017", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "conf": "sigmod", "authors": ["Xiang Ren.....http://dblp.org/pers/hd/r/Ren:Xiang", "Meng Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Meng", "Jingbo Shang.....http://dblp.org/pers/hd/s/Shang:Jingbo", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "pages": 5}