{"title": "Integrated Face Analytics Networks through Cross-Dataset Hybrid Training.", "fields": ["analytics", "training set", "software deployment", "emotion recognition", "parsing"], "abstract": "Face analytics benefits many multimedia applications. It consists of a number of tasks, such as facial emotion recognition and face parsing, and most existing approaches generally treat these tasks independently, which limits their deployment in real scenarios. In this paper we propose an integrated Face Analytics Network (iFAN), which is able to perform multiple tasks jointly for face analytics with a novel carefully designed network architecture to fully facilitate the informative interaction among different tasks. The proposed integrated network explicitly models the interactions between tasks so that the correlations between tasks can be fully exploited for performance boost. In addition, to solve the bottleneck of the absence of datasets with comprehensive training data for various tasks, we propose a novel cross-dataset hybrid training strategy. It allows \"plug-in and play'' of multiple datasets annotated for different tasks without the requirement of a fully labeled common dataset for all the tasks. We experimentally show that the proposed iFAN achieves state-of-the-art performance on multiple face analytics tasks using a single integrated model. Specifically, iFAN achieves an overall F-score of 91.15% on the Helen dataset for face parsing, a normalized mean error of 5.81% on the MTFL dataset for facial landmark localization and an accuracy of 45.73% on the BNU dataset for emotion recognition with a single model.", "citation": "Not cited", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "National University of Singapore", "Beijing Institute of Technology"], "authors": ["Jianshu Li.....http://dblp.org/pers/hd/l/Li:Jianshu", "Shengtao Xiao.....http://dblp.org/pers/hd/x/Xiao:Shengtao", "Fang Zhao.....http://dblp.org/pers/hd/z/Zhao_0006:Fang", "Jian Zhao.....http://dblp.org/pers/hd/z/Zhao:Jian", "Jianan Li.....http://dblp.org/pers/hd/l/Li:Jianan", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng", "Terence Sim.....http://dblp.org/pers/hd/s/Sim:Terence"], "conf": "mm", "year": "2017", "pages": 9}