{"title": "Local private ordinal data distribution estimation.", "fields": ["ordinal regression", "ordinal data", "data aggregator", "ordinal number", "differential privacy"], "abstract": "The categorical data that have natural ordering between categories are termed ordinal data, which are pervasive in numerous areas, including discrete sensor readings, metering data or preference options. Though aggregating such ordinal data from the population is facilitating plenty of crowdsourcing applications, contributing such data is privacy risky and may reveal sensitive information (e.g. locations, identities) about individuals. This work studies ordinal data aggregation for distribution estimation meanwhile locally preserving individuals' data privacy (such as on their mobile devices). Under e-geo-indistinguishable constraints, which capture intrinsic dissimilarity between ordinal categories in the framework of differential privacy, we provide an efficient and effective locally private mechanism: Subset Exponential Mechanism (SEM) for ordinal data distribution estimation. The mechanism randomly responds with a fixed-size subset of the categories with calibrated probability assignment. Specially for uniform ordinal data, we propose a circling technique to symmetrically randomizing categories and estimating frequencies of categories, hence the computational/space costs and estimation performance of SEM are further optimized. Besides contributing theoretical error bounds of SEM, we also evaluate the mechanism on extensive scenarios, the evaluation results show that SEM reduces distribution estimation error on average by exp(∊/2) factor over existing private mechanisms.", "citation": "Not cited", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China"], "authors": ["Shaowei Wang.....http://dblp.org/pers/hd/w/Wang_0003:Shaowei", "Yiwen Nie.....http://dblp.org/pers/hd/n/Nie:Yiwen", "Pengzhan Wang.....http://dblp.org/pers/hd/w/Wang:Pengzhan", "Hongli Xu.....http://dblp.org/pers/hd/x/Xu:Hongli", "Wei Yang.....http://dblp.org/pers/hd/y/Yang_0011:Wei", "Liusheng Huang.....http://dblp.org/pers/hd/h/Huang:Liusheng"], "conf": "infocom", "year": "2017", "pages": 9}