{"title": "Understanding and Mitigating Packet Corruption in Data Center Networks.", "fields": ["network packet", "data center", "cloud computing", "corruption", "computer network"], "abstract": "We take a comprehensive look at packet corruption in data center networks, which leads to packet losses and application performance degradation. By studying 350K links across 15 production data centers, we find that the extent of corruption losses is significant and that its characteristics differ markedly from congestion losses. Corruption impacts fewer links than congestion, but imposes a heavier loss rate; and unlike congestion, corruption rate on a link is stable over time and is not correlated with its utilization.   Based on these observations, we developed CorrOpt, a system to mitigate corruption. To minimize corruption losses, it intelligently selects which corrupting links can be safely disabled, while ensuring that each top-of-rack switch has a minimum number of paths to reach other switches. CorrOpt also recommends specific actions (e.g., replace cables, clean connectors) to repair disabled links, based on our analysis of common symptoms of different root causes of corruption. Our recommendation engine has been deployed in over seventy data centers of a large cloud provider. Our analysis shows that, compared to current state of the art, CorrOpt can reduce corruption losses by three to six orders of magnitude and improve repair accuracy by 60%.", "citation": "Citations (3)", "departments": ["University of Washington", "Microsoft", "Microsoft", "Aalborg University", "University of Washington"], "authors": ["Danyang Zhuo.....http://dblp.org/pers/hd/z/Zhuo:Danyang", "Monia Ghobadi.....http://dblp.org/pers/hd/g/Ghobadi:Monia", "Ratul Mahajan.....http://dblp.org/pers/hd/m/Mahajan:Ratul", "Klaus-Tycho Förster.....http://dblp.org/pers/hd/f/F=ouml=rster:Klaus=Tycho", "Arvind Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Arvind", "Thomas E. Anderson.....http://dblp.org/pers/hd/a/Anderson:Thomas_E="], "conf": "sigcomm", "year": "2017", "pages": 14}