{"title": "CDB: Optimizing Queries with Crowd-Based Selections and Joins.", "fields": ["crowdsourcing", "leverage", "joins", "decision tree model", "tuple"], "abstract": "Crowdsourcing database systems have been proposed to leverage crowd-powered operations to encapsulate the complexities of interacting with the crowd. Existing systems suffer from two major limitations. Firstly, in order to optimize a query, they often adopt the traditional tree model to select an optimized table-level join order. However, the tree model provides a coarse-grained optimization, which generates the same order for different joined tuples and limits the optimization potential that different joined tuples can be optimized by different orders. Secondly, they mainly focus on optimizing the monetary cost. In fact, there are three optimization goals (i.e., smaller monetary cost, lower latency, and higher quality) in crowdsourcing, and it calls for a system to enable multi-goal optimization.   To address the limitations, we develop a crowd-powered database system  CDB  that supports crowd-based query optimizations, with focus on join and selection.  CDB  has fundamental differences from existing systems. First,  CDB  employs a graph-based query model that provides more fine-grained query optimization. Second,  CDB  adopts a unified framework to perform the multi-goal optimization based on the graph model. We have implemented our system and deployed it on AMT, CrowdFlower and ChinaCrowd. We have also created a benchmark for evaluating crowd-powered databases. We have conducted both simulated and real experiments, and the experimental results demonstrate the performance superiority of  CDB  on cost, latency and quality.", "citation": "Citations (15)", "year": "2017", "departments": ["Tsinghua University", "Tsinghua University", "Renmin University of China", "Tsinghua University", "Tsinghua University"], "conf": "sigmod", "authors": ["Guoliang Li.....http://dblp.org/pers/hd/l/Li_0001:Guoliang", "Chengliang Chai.....http://dblp.org/pers/hd/c/Chai:Chengliang", "Ju Fan.....http://dblp.org/pers/hd/f/Fan:Ju", "Xueping Weng.....http://dblp.org/pers/hd/w/Weng:Xueping", "Jian Li.....http://dblp.org/pers/hd/l/Li:Jian", "Yudian Zheng.....http://dblp.org/pers/hd/z/Zheng:Yudian", "Yuanbing Li.....http://dblp.org/pers/hd/l/Li:Yuanbing", "Xiang Yu.....http://dblp.org/pers/hd/y/Yu:Xiang", "Xiaohang Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiaohang", "Haitao Yuan.....http://dblp.org/pers/hd/y/Yuan:Haitao"], "pages": 16}