{"title": "ReGLe: Spatially Regularized Graph Learning for Visual Tracking.", "fields": ["eye tracking", "subspace topology", "minimum bounding box", "feature", "structured support vector machine"], "abstract": "Weighted patch representation of the target object has been proven to be effective for suppressing the background effects in visual tracking. In this paper, we propose a novel approach, called spatially Regularized Graph Learning (ReGLe), to automatically explore the intrinsic relationship among patches both with global and local cues for robust object representation. In particular, the target object bounding box is partitioned into a set of non-overlapping image patches, which are taken as graph nodes, and each of them is associated with a weight to represent how likely it belongs to the target object. To improve the accuracy of node weight computation, we dynamically learn the edge weights (i.e., the appearance compatibility of two nodes) according to both global and local relationship among patches. First, we pursue the low-rank representation for capturing the global low-dimensional subspace structure of patches. Second, we encode the local information into the low-rank representation by exploiting the fact that neighboring nodes usually have similar appearance. Finally, we utilize the representations to learn their affinities (i.e., graph edge weights). The node and edge weights are jointly optimized by a designed ADMM (Alternating Direction Method of Multipliers) algorithm, the object feature representation is updated by imposing the weights of patches on the extracted image features. The object location is finally predicted by maximizing the classification score in the structured SVM. Extensive experiments demonstrate the effectiveness of the proposed approach on the tracking benchmark datasets: OTB100 and Temple-Color.", "citation": "Citations (3)", "departments": ["Anhui University", "Anhui University", "Anhui University", "Anhui University"], "authors": ["Chenglong Li.....http://dblp.org/pers/hd/l/Li_0002:Chenglong", "Xiaohao Wu.....http://dblp.org/pers/hd/w/Wu:Xiaohao", "Zhimin Bao.....http://dblp.org/pers/hd/b/Bao:Zhimin", "Jin Tang.....http://dblp.org/pers/hd/t/Tang:Jin"], "conf": "mm", "year": "2017", "pages": 9}