{"title": "A Stream-based Resource for Multi-Dimensional Evaluation of Recommender Algorithms.", "fields": ["living lab", "recommender system", "streams", "scalability", "information retrieval"], "abstract": "Recommender System research has evolved to focus on developing algorithms capable of high performance in online systems. This development calls for a new evaluation infrastructure that supports multi-dimensional evaluation of recommender systems. Today's researchers should analyze algorithms with respect to a variety of aspects including predictive performance and scalability. Researchers need to subject algorithms to realistic conditions in online A/B tests. We introduce two resources supporting such evaluation methodologies: the new data set of stream recommendation interactions released for CLEF NewsREEL 2017, and the new Open Recommendation Platform (ORP). The data set allows researchers to study a stream recommendation problem closely by \"replaying\" it locally, and ORP makes it possible to take this evaluation \"live\" in a living lab scenario. Specifically, ORP allows researchers to deploy their algorithms in a live stream to carry out A/B tests. To our knowledge, NewsREEL is the first online news recommender system resource to be put at the disposal of the research community. In order to encourage others to develop comparable resources for a wide range of domains, we present a list of practical lessons learned in the development of the dataset and ORP.", "citation": "Not cited", "departments": ["Technical University of Berlin", "Technical University of Berlin", "University of Glasgow", "Radboud University Nijmegen", "Radboud University Nijmegen"], "authors": ["Benjamin Kille.....http://dblp.org/pers/hd/k/Kille:Benjamin", "Andreas Lommatzsch.....http://dblp.org/pers/hd/l/Lommatzsch:Andreas", "Frank Hopfgartner.....http://dblp.org/pers/hd/h/Hopfgartner:Frank", "Martha Larson.....http://dblp.org/pers/hd/l/Larson:Martha", "Arjen P. de Vries.....http://dblp.org/pers/hd/v/Vries:Arjen_P=_de"], "conf": "sigir", "year": "2017", "pages": 4}