{"title": "BUSH: Empowering large-scale MU-MIMO in WLANs with hybrid beamforming.", "fields": ["scalability", "multi user mimo", "beamforming", "mimo", "telecommunications link"], "abstract": "Large-scale MU-MIMO is a promising technology to scale network capacity and the capacity gain grows linearly with the numbers of antennas and users in theory. However, its practical deployment faces three critical challenges in the state-of-the-art WLANs: i) the demand of a large number of expensive RF chains; ii) the linear growth of feedback overheads with the number of antennas; iii) the lack of scalable user selection scheme for a large user population. In this paper, we design BUSH, a large-scale MU-MIMO prototype that performs scalable beam user selection with hybrid beamforming for phased-array antennas in legacy WLANs. The architecture of BUSH consists of three components. Firstly, a low complexity algorithm assigns each pair of RF chain and analog beam to the users to effectively reduce channel correlation and cross-talk interference without instantaneous CSI feedbacks. Secondly, as a prerequisite of user selection, BUSH presents a low-overhead probing scheme in multi-carrier WLANs, and designs a highly accurate blind Power Azimuth Spectrum (PAS) estimation algorithm using a single RF chain. Thirdly, the phased-array antennas use analog beamforming to steer spatial beams toward each selected downlink user, and the finite number of RF chains use beamforming to further mitigate the interference among users. We implement BUSH on the WARPv3 boards and evaluate its performance in more than 30 indoor scenarios. The experimental results show that in terms of total throughput BUSH outperforms the legacy 802.11ac by 2.08×, and an alternative benchmark system by 1.22× on average.", "citation": "Citations (1)", "departments": ["Fudan University", "Fudan University", "Fudan University", "Fudan University", "Singapore Management University"], "authors": ["Zhe Chen.....http://dblp.org/pers/hd/c/Chen:Zhe", "Xu Zhang.....http://dblp.org/pers/hd/z/Zhang:Xu", "Sulei Wang.....http://dblp.org/pers/hd/w/Wang:Sulei", "Yuedong Xu.....http://dblp.org/pers/hd/x/Xu:Yuedong", "Jie Xiong.....http://dblp.org/pers/hd/x/Xiong_0001:Jie", "Xin Wang.....http://dblp.org/pers/hd/w/Wang:Xin"], "conf": "infocom", "year": "2017", "pages": 9}