{"title": "Revisiting the Design of Data Stream Processing Systems on Multi-Core Processors.", "fields": ["massively parallel", "cache", "data stream mining", "data parallelism", "cpu socket"], "abstract": "Driven by the rapidly increasing demand for handling real-time data streams, many data stream processing (DSP) systems have been proposed. Regardless of the different architectures of those DSP systems, they are mostly aiming at scaling out using a cluster of commodity machines and built around a number of key design aspects: a) pipelined processing with message passing, b) on-demand data parallelism, and c) JVM based implementation. However, there lacks a study on those key design aspects on modern scale-up architectures, where more CPU cores are being put on the same die, and the onchip cache hierarchies are getting larger, deeper, and complex. Multiple sockets bring non-uniform memory access (NUMA) effort. In this paper, we revisit the aforementioned design aspects on a modern scale-up server. Specifically, we use a series of applications as micro benchmark to conduct detailed profiling studies on Apache Storm and Flink. From the profiling results, we observe two major performance issues: a) the massively parallel execution model causes serious front-end stalls, which are a major performance bottleneck issue on a single CPU socket, b) the lack of NUMA-aware mechanism causes major drawback on the scalability of DSP systems on multi-socket architectures. Addressing these issues should allow DSP systems to exploit modern scale-up architectures, which also benefits scaling out environments. We present our initial efforts on resolving the above-mentioned performance issues, which have shown up to 3.2x and 3.1x improvement on the performance of Storm and Flink, respectively.", "citation": "Citations (3)", "departments": ["National University of Singapore", "French Institute for Research in Computer Science and Automation"], "authors": ["Shuhao Zhang.....http://dblp.org/pers/hd/z/Zhang:Shuhao", "Bingsheng He.....http://dblp.org/pers/hd/h/He:Bingsheng", "Daniel Dahlmeier.....http://dblp.org/pers/hd/d/Dahlmeier:Daniel", "Amelie Chi Zhou.....http://dblp.org/pers/hd/z/Zhou:Amelie_Chi", "Thomas Heinze.....http://dblp.org/pers/hd/h/Heinze_0001:Thomas"], "conf": "icde", "year": "2017", "pages": 12}