{"title": "Optimizing the Four-Index Integral Transform Using Data Movement Lower Bounds Analysis.", "fields": ["loop fusion", "permutation", "four tensor", "tensor contraction", "transformation matrix"], "abstract": "The four-index integral transform is a fundamental and computationally demanding calculation used in many computational chemistry suites such as NWChem. It transforms a four-dimensional tensor from one basis to another. This transformation is most efficiently implemented as a sequence of four tensor contractions that each contract a four- dimensional tensor with a two-dimensional transformation matrix. Differing degrees of permutation symmetry in the intermediate and final tensors in the sequence of contractions cause intermediate tensors to be much larger than the final tensor and limit the number of electronic states in the modeled systems.   Loop fusion, in conjunction with tiling, can be very effective in reducing the total space requirement, as well as data movement. However, the large number of possible choices for loop fusion and tiling, and data/computation distribution across a parallel system, make it challenging to develop an optimized parallel implementation for the four-index integral transform. We develop a novel approach to address this problem, using lower bounds modeling of data movement complexity. We establish relationships between available aggregate physical memory in a parallel computer system and ineffective fusion configurations, enabling their pruning and consequent identification of effective choices and a characterization of optimality criteria. This work has resulted in the development of a significantly improved implementation of the four-index transform that enables higher performance and the ability to model larger electronic systems than the current implementation in the NWChem quantum chemistry software suite.", "citation": "Not cited", "year": "2017", "departments": ["Ohio State University", "French Institute for Research in Computer Science and Automation", "Pacific Northwest National Laboratory", "Pacific Northwest National Laboratory", "Ohio State University"], "conf": "ppopp", "authors": ["Samyam Rajbhandari.....http://dblp.org/pers/hd/r/Rajbhandari:Samyam", "Fabrice Rastello.....http://dblp.org/pers/hd/r/Rastello:Fabrice", "Karol Kowalski.....http://dblp.org/pers/hd/k/Kowalski:Karol", "Sriram Krishnamoorthy.....http://dblp.org/pers/hd/k/Krishnamoorthy:Sriram", "P. Sadayappan.....http://dblp.org/pers/hd/s/Sadayappan:P="], "pages": 14}