{"title": "A Mortality Study for ICU Patients Using Bursty Medical Events.", "fields": ["mortality rate", "intuition", "clinical research", "burstiness", "anomaly detection"], "abstract": "The study of patients in Intensive Care Units (ICUs) is a crucial task in critical care research which has significant implications both in identifying clinical risk factors and defining institutional guidances. The mortality study of ICU patients is of particular interest because it provides useful indications to healthcare institutions for improving patients experience, internal policies, and procedures (e.g. allocation of resources). To this end, many research works have been focused on the length of stay (LOS) for ICU patients as a feature for studying the mortality. In this work, we propose a novel mortality study based on the notion of burstiness, where the temporal information of patients longitudinal data is taken into consideration. The burstiness of temporal data is a popular measure in network analysis and time-series anomaly detection, where high values of burstiness indicate presence of rapidly occurring events in short time periods (i.e. burst). Our intuition is that these bursts may relate to possible complications in the patient's medical condition and hence provide indications on the mortality. Compared to the LOS, the burstiness parameter captures the temporality of the medical events providing information about the overall dynamic of the patients condition. To the best of our knowledge, we are the first to apply the burstiness measure in the clinical research domain. Our preliminary results on a real dataset show that patients with high values of burstiness tend to have higher mortality rate compared to patients with more regular medical events. Overall, our study shows promising results and provides useful insights for developing predictive models on temporal data and advancing modern critical care medicine.", "citation": "Not cited", "departments": ["University of California, San Diego"], "authors": ["Luca Bonomi.....http://dblp.org/pers/hd/b/Bonomi:Luca", "Xiaoqian Jiang.....http://dblp.org/pers/hd/j/Jiang:Xiaoqian"], "conf": "icde", "year": "2017", "pages": 8}