{"title": "AccountTrade: Accountable protocols for big data trading against dishonest consumers.", "fields": ["blame", "data type", "uniqueness", "upload", "big data"], "abstract": "We propose AccountTrade, a set of accountable protocols, for big data trading among dishonest consumers. To secure the big data trading environment, our protocols achieve book-keeping ability and accountability against dishonest consumers who may misbehave throughout the dataset transactions. Specifically, we study the responsibilities of the consumers in the dataset trading and design AccountTrade to achieve accountability against the dishonest consumers who may try to deviate from their responsibilities. Specifically, we propose uniqueness index, a new rigorous measurement of the data uniqueness, as well as several accountable trading protocols to enable data brokers to blame the dishonest consumer when misbehavior is detected. We formally define, prove, and evaluate the accountability of our protocols by an automatic verification tool as well as extensive evaluation in real-world datasets. Our evaluation shows that AccountTrade incurs negligible constant storage overhead per file (<10KB), and it is able to handle 8–1000 concurrent data uploading per server depending on the data types.", "citation": "Citations (2)", "departments": ["Illinois Institute of Technology", "University of Science and Technology of China", "University of Science and Technology of China", "Illinois Institute of Technology", "Illinois Institute of Technology"], "authors": ["Taeho Jung.....http://dblp.org/pers/hd/j/Jung:Taeho", "Xiang-Yang Li.....http://dblp.org/pers/hd/l/Li_0001:Xiang=Yang", "Wenchao Huang.....http://dblp.org/pers/hd/h/Huang:Wenchao", "Jianwei Qian.....http://dblp.org/pers/hd/q/Qian:Jianwei", "Linlin Chen.....http://dblp.org/pers/hd/c/Chen:Linlin", "Junze Han.....http://dblp.org/pers/hd/h/Han:Junze", "Jiahui Hou.....http://dblp.org/pers/hd/h/Hou:Jiahui", "Cheng Su.....http://dblp.org/pers/hd/s/Su:Cheng"], "conf": "infocom", "year": "2017", "pages": 9}