{"title": "IRGAN: A Minimax Game for Unifying Generative and Discriminative Information Retrieval Models.", "fields": ["exploit", "generative grammar", "discriminative model", "generative model", "minimax"], "abstract": "This paper provides a unified account of two schools of thinking in information retrieval modelling: the generative retrieval focusing on predicting relevant documents given a query, and the discriminative retrieval focusing on predicting relevancy given a query-document pair. We propose a game theoretical  minimax game  to iteratively optimise both models. On one hand, the discriminative model, aiming to mine signals from labelled and unlabelled data, provides guidance to train the generative model towards fitting the underlying relevance distribution over documents given the query. On the other hand, the generative model, acting as an attacker to the current discriminative model, generates difficult examples for the discriminative model in an adversarial way by minimising its discrimination objective. With the competition between these two models, we show that the unified framework takes advantage of both schools of thinking: (i) the generative model learns to fit the relevance distribution over documents via the signals from the discriminative model, and (ii) the discriminative model is able to exploit the unlabelled data selected by the generative model to achieve a better estimation for document ranking. Our experimental results have demonstrated significant performance gains as much as 23.96% on Precision@5 and 15.50% on MAP over strong baselines in a variety of applications including web search, item recommendation, and question answering.", "citation": "Citations (51)", "departments": ["University College London", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Alibaba Group", "Alibaba Group"], "authors": ["Jun Wang.....http://dblp.org/pers/hd/w/Wang_0012:Jun", "Lantao Yu.....http://dblp.org/pers/hd/y/Yu:Lantao", "Weinan Zhang.....http://dblp.org/pers/hd/z/Zhang:Weinan", "Yu Gong.....http://dblp.org/pers/hd/g/Gong:Yu", "Yinghui Xu.....http://dblp.org/pers/hd/x/Xu:Yinghui", "Benyou Wang.....http://dblp.org/pers/hd/w/Wang:Benyou", "Peng Zhang.....http://dblp.org/pers/hd/z/Zhang:Peng", "Dell Zhang.....http://dblp.org/pers/hd/z/Zhang:Dell"], "conf": "sigir", "year": "2017", "pages": 10}