{"title": "Homomorphic Secret Sharing: Optimizations and Applications.", "fields": ["homomorphic encryption", "homomorphic secret sharing", "speedup", "existential quantification", "computer science", "eval", "theoretical computer science"], "abstract": "We continue the study of Homomorphic Secret Sharing (HSS), recently introduced by Boyle et al. (Crypto 2016, Eurocrypt 2017). A (2-party) HSS scheme splits an input  x  into shares (  x 0 , x  1 ) such that (1) each share computationally hides  x , and (2) there exists an efficient homomorphic evaluation algorithm $\\Eval$ such that for any function (or \"program\")    from a given class it holds that Eval( x  0 , P )+Eval( x  1 , P )= P ( x ). Boyle et al. show how to construct an HSS scheme for branching programs, with an inverse polynomial error, using discrete-log type assumptions such as DDH.   We make two types of contributions.    Optimizations . We introduce new optimizations that speed up the previous optimized implementation of Boyle et al. by more than a factor of 30, significantly reduce the share size, and reduce the rate of leakage induced by selective failure.    Applications.  Our optimizations are motivated by the observation that there are natural application scenarios in which HSS is useful even when applied to simple computations on short inputs. We demonstrate the practical feasibility of our HSS implementation in the context of such applications.", "citation": "Not cited", "year": "2017", "departments": ["Interdisciplinary Center Herzliya", "École Normale Supérieure", "Ben-Gurion University of the Negev", "Technion – Israel Institute of Technology", "École Normale Supérieure"], "conf": "ccs", "authors": ["Elette Boyle.....http://dblp.org/pers/hd/b/Boyle:Elette", "Geoffroy Couteau.....http://dblp.org/pers/hd/c/Couteau:Geoffroy", "Niv Gilboa.....http://dblp.org/pers/hd/g/Gilboa:Niv", "Yuval Ishai.....http://dblp.org/pers/hd/i/Ishai:Yuval", "Michele Orrù.....http://dblp.org/pers/hd/o/Orr=ugrave=:Michele"], "pages": 18}