{"title": "You can have it all: abstraction and good cache performance.", "fields": ["ad hoc polymorphism", "late binding", "remainder", "cache", "garbage collection"], "abstract": "On current architectures, the optimisation of an application's performance often involves data being stored according to access affinity --- what is accessed together should be stored together, rather than logical affinity --- what belongs together logically stays together. Such low level techniques lead to faster, but more error prone code, and end up tangling the program's logic with low-level data layout details.     Our vision, which we call SHAPES --- Safe, High-level, Abstractions for oPtimisation of mEmory cacheS --- is that the layout of a data structure should be defined only once, upon instantiation, and the remainder of the code should be layout agnostic. This enables performance improvements while also guaranteeing memory safety, and supports the separation of program logic from low level concerns. In this paper we investigate how this vision can be supported by extending a programming language.     We describe the core language features supporting this vision: classes can be customized to support different layouts, and layout information is carried around in types; the remaining source code is layout-unaware and the compiler emits layout-aware code. We then discuss our SHAPES implementation through a prototype library, which we also used for preliminary evaluations. Finally, we discuss how the core could be expanded so as to deliver SHAPES's full potential: the incorporation of compacting garbage collection, ad hoc polymorphism and late binding, synchronization of representations of different collections, support for dynamic change of representation, etc.", "citation": "Citations (1)", "year": "2017", "departments": ["Imperial College London", "Uppsala University", "Imperial College London", "Imperial College London", "Dirac, Sweden"], "conf": "oopsla", "authors": ["Juliana Franco.....http://dblp.org/pers/hd/f/Franco:Juliana", "Martin Hagelin.....http://dblp.org/pers/hd/h/Hagelin:Martin", "Tobias Wrigstad.....http://dblp.org/pers/hd/w/Wrigstad:Tobias", "Sophia Drossopoulou.....http://dblp.org/pers/hd/d/Drossopoulou:Sophia", "Susan Eisenbach.....http://dblp.org/pers/hd/e/Eisenbach:Susan"], "pages": 20}