{"title": "Semantic-directed clumping of disjunctive abstract states.", "fields": ["operator", "linked list", "abstract interpretation", "silhouette", "predicate"], "abstract": "To infer complex structural invariants, shape analyses rely on expressive families of logical properties. Many such analyses manipulate abstract memory states that consist of separating conjunctions of basic predicates describing atomic blocks or summaries. Moreover, they use finite disjunctions of abstract memory states in order to account for dissimilar shapes. Disjunctions should be kept small for the sake of scalability, though precision often requires to keep additional case splits. In this context, deciding when and how to merge case splits and to replace them with summaries is critical both for the precision and for the efficiency. Existing techniques use sets of syntactic rules, which are tedious to design and prone to failure. In this paper, we design a semantic criterion to clump abstract states based on their silhouette which applies not only to the conservative union of disjuncts, but also to the weakening of separating conjunction of memory predicates into inductive summaries. Our approach allows to define union and widening operators that aim at preserving the case splits that are required for the analysis to succeed. We implement this approach in the MemCAD analyzer, and evaluate it on real-world C codes from existing libraries, including programs dealing with doubly linked lists, red-black trees and AVL-trees.", "citation": "Citations (1)", "departments": ["French Institute for Research in Computer Science and Automation", "French Institute for Research in Computer Science and Automation", "University of Colorado Boulder", "French Institute for Research in Computer Science and Automation"], "authors": ["Huisong Li.....http://dblp.org/pers/hd/l/Li:Huisong", "Francois Berenger.....http://dblp.org/pers/hd/b/Berenger:Francois", "Bor-Yuh Evan Chang.....http://dblp.org/pers/hd/c/Chang:Bor=Yuh_Evan", "Xavier Rival.....http://dblp.org/pers/hd/r/Rival:Xavier"], "conf": "popl", "year": "2017", "pages": 14}