{"title": "Multi-context Attention for Human Pose Estimation.", "fields": ["receptive field", "convolutional neural network", "residual", "convolutional code", "granularity"], "abstract": "In this paper, we propose to incorporate convolutional neural networks with a multi-context attention mechanism into an end-to-end framework for human pose estimation. We adopt stacked hourglass networks to generate attention maps from features at multiple resolutions with various semantics. The Conditional Random Field (CRF) is utilized to model the correlations among neighboring regions in the attention map. We further combine the holistic attention model, which focuses on the global consistency of the full human body, and the body part attention model, which focuses on detailed descriptions for different body parts. Hence our model has the ability to focus on different granularity from local salient regions to global semantic consistent spaces. Additionally, we design novel Hourglass Residual Units (HRUs) to increase the receptive field of the network. These units are extensions of residual units with a side branch incorporating filters with larger receptive field, hence features with various scales are learned and combined within the HRUs. The effectiveness of the proposed multi-context attention mechanism and the hourglass residual units is evaluated on two widely used human pose estimation benchmarks. Our approach outperforms all existing methods on both benchmarks over all the body parts. Code has been made publicly available.", "citation": "Citations (81)", "year": "2017", "departments": ["Baidu", "Sun Yat-sen University", "The Chinese University of Hong Kong", "University of California, Los Angeles"], "conf": "cvpr", "authors": ["Xiao Chu.....http://dblp.org/pers/hd/c/Chu:Xiao", "Wei Yang.....http://dblp.org/pers/hd/y/Yang:Wei", "Wanli Ouyang.....http://dblp.org/pers/hd/o/Ouyang:Wanli", "Cheng Ma.....http://dblp.org/pers/hd/m/Ma:Cheng", "Alan L. Yuille.....http://dblp.org/pers/hd/y/Yuille:Alan_L=", "Xiaogang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaogang"], "pages": 10}