{"title": "Surviving screen-off battery through out-of-band Wi-Fi coordination.", "fields": ["network packet", "exploit", "overhead", "testbed", "out of band management"], "abstract": "This paper identifies two energy saving opportunities of Wi-Fi interface emerged during smartphone's screen-off periods. Exploiting the opportunities, we propose a new power saving strategy, BackPSM, for screen-off Wi-Fi communications. BackPSM regulates client to send and receive packets in batches and coordinates multiple clients to communicate at different slots (i.e., beacon interval). The core problem in BackPSM is how to coordinate client without incurring extra traffic overheads. To handle the problem, we propose a novel paradigm, Out-of-Band Communication (OBC), for client-to-client direct communications. OBC exploits the TIM (Traffic Indication Map) field of Wi-Fi Beacon to create a free side-channel between clients. It is based upon the observation that a client may control 1 → 0 appearing on TIM bit by locally regulating packet receiving operations. We adopt this 1 → 0 as the basic signal, and leverage the time length in between two signals to encode information. We demonstrate that OBC can be used to convey coordination information with close to 100% accuracy. We have implemented and evaluated BackPSM on a testbed. The results show that BackPSM reduces screen-off energy by up to 60%, and outperforms state-of-the-art strategies by 16%–42%.", "citation": "Not cited", "departments": ["Northwestern Polytechnical University", "Northwestern Polytechnical University", "Northwestern Polytechnical University", "Northwestern Polytechnical University", "RMIT University"], "authors": ["Xianjin Xia.....http://dblp.org/pers/hd/x/Xia:Xianjin", "ShiNing Li.....http://dblp.org/pers/hd/l/Li:ShiNing", "Yu Zhang.....http://dblp.org/pers/hd/z/Zhang_0034:Yu", "Lin Li.....http://dblp.org/pers/hd/l/Li:Lin", "Tao Gu.....http://dblp.org/pers/hd/g/Gu:Tao", "Yongji Liu.....http://dblp.org/pers/hd/l/Liu:Yongji", "Yan Pan.....http://dblp.org/pers/hd/p/Pan:Yan"], "conf": "infocom", "year": "2017", "pages": 9}