{"title": "Why it takes so long to connect to a WiFi access point.", "fields": ["signal strength", "latency", "android", "throughput", "mobile device"], "abstract": "Today's WiFi networks deliver a large fraction of traffic. However, the performance and quality of WiFi networks are still far from satisfactory. Among many popular quality metrics (throughput, latency), the probability of successfully connecting to WiFi APs and the time cost of the WiFi connection set-up process are the two of the most critical metrics that affect WiFi users' experience. To understand the WiFi connection set-up process in real-world settings, we carry out measurement studies on 5 million mobile users from 4 representative cities associating with 7 million APs in 0.4 billion WiFi sessions, collected from a mobile “WiFi Manager” App that tops the Android/iOS App market. To the best of our knowledge, we are the first to do such large scale study on: how large the WiFi connection set-up time cost is, what factors affect the WiFi connection set-up process, and what can be done to reduce the WiFi connection set-up time cost. Based on our data-driven measurement and analysis, we reveal the insights as follows: (1) Connection set-up failure and large connection set-up time cost are common in today's WiFi use. As large as 45% of the users suffer connection set-up failures, and 15% (5%) of them have large connection set-up time costs over 5 seconds (10 seconds). (2) Contrary to the state-of-the-art work, scan, one of the subphase of four phases in the connection set-up process, contributes the most (47%) to the overall connection set-up time cost. (3) Mobile device model and AP model can greatly help us to predict the connection set-up time cost if we can make good use of the hidden information. Based on the measurement analysis, we develop a machine learning based AP selection strategy that can significantly improve WiFi connection set-up performance, against the conventional strategy purely based on signal strength, by reducing the connection set-up failures from 33% to 3.6% and reducing 80% time costs of the connection set-up processes by more than 10 times.", "citation": "Citations (1)", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Changhua Pei.....http://dblp.org/pers/hd/p/Pei:Changhua", "Zhi Wang.....http://dblp.org/pers/hd/w/Wang:Zhi", "Youjian Zhao.....http://dblp.org/pers/hd/z/Zhao:Youjian", "Zihan Wang.....http://dblp.org/pers/hd/w/Wang:Zihan", "Yuan Meng.....http://dblp.org/pers/hd/m/Meng:Yuan", "Dan Pei.....http://dblp.org/pers/hd/p/Pei:Dan", "Yuanquan Peng.....http://dblp.org/pers/hd/p/Peng:Yuanquan", "Wenliang Tang.....http://dblp.org/pers/hd/t/Tang:Wenliang", "Xiaodong Qu.....http://dblp.org/pers/hd/q/Qu:Xiaodong"], "conf": "infocom", "year": "2017", "pages": 9}