{"title": "YASS: Yet Another Spike Sorter.", "fields": ["coreset", "dirichlet process", "data reduction", "scalability", "spike sorting"], "abstract": "Spike sorting is a critical first step in extracting neural signals from large-scale electrophysiological data. This manuscript describes an efficient, reliable pipeline for spike sorting on dense multi-electrode arrays (MEAs), where neural signals appear across many electrodes and spike sorting currently represents a major computational bottleneck. We present several new techniques that make dense MEA spike sorting more robust and scalable. Our pipeline is based on an efficient multi-stage ''triage-then-cluster-then-pursuit'' approach that initially extracts only clean, high-quality waveforms from the electrophysiological time series by temporarily skipping noisy or ''collided'' events (representing two neurons firing synchronously). This is accomplished by developing a neural network detection method followed by efficient outlier triaging. The clean waveforms are then used to infer the set of neural spike waveform templates through nonparametric Bayesian clustering. Our clustering approach adapts a ''coreset'' approach for data reduction and uses efficient inference methods in a Dirichlet process mixture model framework to dramatically improve the scalability and reliability of the entire pipeline. The ''triaged'' waveforms are then finally recovered with matching-pursuit deconvolution techniques. The proposed methods improve on the state-of-the-art in terms of accuracy and stability on both real and biophysically-realistic simulated MEA data. Furthermore, the proposed pipeline is efficient, learning templates and clustering faster than real-time for a 500-electrode dataset, largely on a single CPU core.", "citation": "Citations (3)", "year": "2017", "departments": ["Columbia University", "Duke University", "Columbia University", "Columbia University", "Stanford University"], "conf": "nips", "authors": ["Jin Hyung Lee.....http://dblp.org/pers/hd/l/Lee:Jin_Hyung", "David E. Carlson.....http://dblp.org/pers/hd/c/Carlson:David_E=", "Hooshmand Shokri Razaghi.....http://dblp.org/pers/hd/r/Razaghi:Hooshmand_Shokri", "Weichi Yao.....http://dblp.org/pers/hd/y/Yao:Weichi", "Georges A. Goetz.....http://dblp.org/pers/hd/g/Goetz:Georges_A=", "Espen Hagen.....http://dblp.org/pers/hd/h/Hagen:Espen", "Eleanor Batty.....http://dblp.org/pers/hd/b/Batty:Eleanor", "E. J. Chichilnisky.....http://dblp.org/pers/hd/c/Chichilnisky:E=_J=", "Gaute T. Einevoll.....http://dblp.org/pers/hd/e/Einevoll:Gaute_T=", "Liam Paninski.....http://dblp.org/pers/hd/p/Paninski:Liam"], "pages": 11}