{"title": "Procedural Generation of Videos to Train Deep Action Recognition Networks.", "fields": ["deep learning", "motion capture", "generative grammar", "feature learning", "generative model"], "abstract": "Deep learning for human action recognition in videos is making significant progress, but is slowed down by its dependency on expensive manual labeling of large video collections. In this work, we investigate the generation of synthetic training data for action recognition, as it has recently shown promising results for a variety of other computer vision tasks. We propose an interpretable parametric generative model of human action videos that relies on procedural generation and other computer graphics techniques of modern game engines. We generate a diverse, realistic, and physically plausible dataset of human action videos, called PHAV for Procedural Human Action Videos. It contains a total of 39,982 videos, with more than 1,000 examples for each action of 35 categories. Our approach is not limited to existing motion capture sequences, and we procedurally define 14 synthetic actions. We introduce a deep multi-task representation learning architecture to mix synthetic and real videos, even if the action categories differ. Our experiments on the UCF101 and HMDB51 benchmarks suggest that combining our large set of synthetic videos with small real-world datasets can boost recognition performance, significantly outperforming fine-tuning state-of-the-art unsupervised generative models of videos.", "citation": "Citations (12)", "year": "2017", "departments": ["Federal University of São Carlos", "Xerox", "Autonomous University of Barcelona"], "conf": "cvpr", "authors": ["César Roberto de Souza.....http://dblp.org/pers/hd/s/Souza:C=eacute=sar_Roberto_de", "Adrien Gaidon.....http://dblp.org/pers/hd/g/Gaidon:Adrien", "Yohann Cabon.....http://dblp.org/pers/hd/c/Cabon:Yohann", "Antonio Manuel López Peña.....http://dblp.org/pers/hd/p/Pe=ntilde=a:Antonio_Manuel_L=oacute=pez"], "pages": 11}