{"title": "A simple re-sequencing load-balanced switch based on analytical packet reordering bounds.", "fields": ["network packet", "out of order execution", "load balanced switch", "burst switching", "wait"], "abstract": "Chang et al. proposed the load-balanced switch in their seminal work [1], which has received wide attention due to its inherent scalability properties in both size and speed. These scalability properties continue to be of significant interest due to the relentless exponential growth in Internet traffic. The main drawback of the load-balanced switch is that packets can depart out-of-order from the switch, which can significantly degrade network performance by negatively interacting with TCP congestion control. Hence, a large body of subsequent work has proposed a variety of modifications for ensuring packet ordering, but all the proposed approaches tend to increase packet delay significantly in comparison to the basic load-balanced switch. In this paper, we show that the amount of packet reordering that can occur with the load-balanced switch is actually quite limited, which means that packet reordering can simply be rectified by employing reordering buffers at the switch outputs. In particular, we formally bound the worst-case amount of time that a packet has to wait in these output reordering buffers before it is guaranteed to be ready for in-order departure with high probability, and we prove that this bound is linear with respect to the switch size. This linear bound is significant because previous approaches can add quadratic or cubic delays to the load-balanced switch. In addition, we use a hash-grouping method that further reduces resequencing delays significantly. Although simple and intuitive, our experimental results show that our output packet reordering approach substantially outperforms existing load-balanced switch architectures.", "citation": "Citations (1)", "departments": ["Georgia Institute of Technology", "University of California, San Diego", "University of Adelaide", "Georgia Institute of Technology"], "authors": ["Sen Yang.....http://dblp.org/pers/hd/y/Yang:Sen", "Bill Lin.....http://dblp.org/pers/hd/l/Lin:Bill", "Paul Tune.....http://dblp.org/pers/hd/t/Tune:Paul", "Jun (Jim) Xu.....http://dblp.org/pers/hd/x/Xu:Jun_=Jim="], "conf": "infocom", "year": "2017", "pages": 9}