{"title": "Fine-Grained Recurrent Neural Networks for Automatic Prostate Segmentation in Ultrasound Images.", "fields": ["prior probability", "serialization", "segmentation", "recurrent neural network", "merge"], "abstract": "Boundary incompleteness raises great challenges to automatic prostate segmentation in ultrasound images. Shape prior can provide strong guidance in estimating the missing boundary, but traditional shape models often suffer from hand-crafted descriptors and local information loss in the fitting procedure. In this paper, we attempt to address those issues with a novel framework. The proposed framework can seamlessly integrate feature extraction and shape prior exploring, and estimate the complete boundary with a sequential manner. Our framework is composed of three key modules. Firstly, we serialize the static 2D prostate ultrasound images into dynamic sequences and then predict prostate shapes by sequentially exploring shape priors. Intuitively, we propose to learn the shape prior with the biologically plausible Recurrent Neural Networks (RNNs). This module is corroborated to be effective in dealing with the boundary incompleteness. Secondly, to alleviate the bias caused by different serialization manners, we propose a multi-view fusion strategy to merge shape predictions obtained from different perspectives. Thirdly, we further implant the RNN core into a multiscale Auto-Context scheme to successively refine the details of the shape prediction map. With extensive validation on challenging prostate ultrasound images, our framework bridges severe boundary incompleteness and achieves the best performance in prostate boundary delineation when compared with several advanced methods. Additionally, our approach is general and can be extended to other medical image segmentation tasks, where boundary incompleteness is one of the main challenges.", "citation": "Citations (4)", "departments": ["Shenzhen University", "The Chinese University of Hong Kong", "Shenzhen University", "The Chinese University of Hong Kong", "Shenzhen University"], "authors": ["Xin Yang.....http://dblp.org/pers/hd/y/Yang_0009:Xin", "Lequan Yu.....http://dblp.org/pers/hd/y/Yu:Lequan", "Lingyun Wu.....http://dblp.org/pers/hd/w/Wu:Lingyun", "Yi Wang.....http://dblp.org/pers/hd/w/Wang_0031:Yi", "Dong Ni.....http://dblp.org/pers/hd/n/Ni:Dong", "Jing Qin.....http://dblp.org/pers/hd/q/Qin_0001:Jing", "Pheng-Ann Heng.....http://dblp.org/pers/hd/h/Heng:Pheng=Ann"], "conf": "aaai", "year": "2017", "pages": 7}