{"title": "ButterFly: Mobile collaborative rendering over GPU workload migration.", "fields": ["texture memory", "parallel rendering", "alternate frame rendering", "software rendering", "tiled rendering"], "abstract": "The ever increasing of display resolution on mobile devices raises high demand for GPU rendering details. However, the challenge of poor hardware support but fine-grained rendering details often makes user unsatisfied especially in calling for high frame rate scenarios, e.g., game. To resolve such issue, we propose BUTTERFLY, a novel system which collaboratively utilizes mobile GPUs to process high-quality rendering details for on-the-go mobile users. In particular, ButterFly achieves two technical contributions for the collaborative design: (1) a mobile device can migrate GPU workloads in buffer queue to peers, and (2) the collaborative rendering mechanism benefits user high quality details while significant power saving performance. Both techniques are compatible with the OpenGL ES standards. Furthermore, a 40-person survey perceives that ButterFly can provide excellent user experience of both rendering details and frame rate over Wi-Fi network. In addition, our comprehensive trace-driven experiments on Android prototype reveal the benefits of Butterfly have more superior performance over state-of-the-art systems, which achieves more than 28.3% power saving.", "citation": "Not cited", "departments": ["Tsinghua University", "Tsinghua University", "University of Science and Technology of China", "Tsinghua University", "Sun Yat-sen University"], "authors": ["Chao Wu.....http://dblp.org/pers/hd/w/Wu_0002:Chao", "Yaoxue Zhang.....http://dblp.org/pers/hd/z/Zhang:Yaoxue", "Lan Zhang.....http://dblp.org/pers/hd/z/Zhang:Lan", "Bowen Yang.....http://dblp.org/pers/hd/y/Yang:Bowen", "Xu Chen.....http://dblp.org/pers/hd/c/Chen_0004:Xu", "Wenwu Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Wenwu", "Lili Qiu.....http://dblp.org/pers/hd/q/Qiu:Lili"], "conf": "infocom", "year": "2017", "pages": 9}