{"title": "Beyond the touch: Interaction-aware mobile gamecasting with gazing pattern prediction.", "fields": ["energy consumption", "association rule learning", "broadcasting", "resource", "mobile device"], "abstract": "Recent years have witnessed an explosion of gamecasting applications in the market, in which game players (or gamers in short) broadcast their game scenes in real-time. Such pioneer applications as YouTube Gaming, Twitch, and Mobcrush have attracted a massive number of online broadcasters, and each of them can attract hundreds or thousands of fellow viewers. The growing number however has created significant challenges to the network and end-devices, particularly considering bandwidth- and battery-limited smartphones or tablets are becoming dominating for both gamers and viewers. Yet the unique touch operations of the mobile interface offer opportunities, too. In this paper, our crowdsourced measurement reveals that strong associations exist between the gamers' touch interactions and the viewers' gazing patterns. Motivated by this, we present a novel interaction-aware optimization framework to improve the energy utilization and stream quality for mobile gamecasting (MGC). Our framework incorporates a touch-assisted prediction module to extract association rules for gazing pattern prediction and a tile-based optimization module to utilize energy on mobile devices efficiently. Trace-driven simulations illustrate the effectiveness of our framework in terms of energy consumption and streaming quality. Our user study experiments also demonstrate much improved (3%–13%) quality satisfaction than the state-of-the-art solution with similar network resources.", "citation": "Citations (1)", "departments": ["Simon Fraser University", "Simon Fraser University", "Simon Fraser University", "Tsinghua University"], "authors": ["Cong Zhang.....http://dblp.org/pers/hd/z/Zhang:Cong", "Qiyun He.....http://dblp.org/pers/hd/h/He:Qiyun", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Zhi Wang.....http://dblp.org/pers/hd/w/Wang_0001:Zhi"], "conf": "infocom", "year": "2017", "pages": 9}