{"title": "Caching-aware recommendations: Nudging user preferences towards better caching performance.", "fields": ["recommender system", "cache", "end user", "traffic engineering", "aggregate demand"], "abstract": "Caching decisions by default seek to maximize some notion of social welfare: the content to be cached is determined so that the maximum possible aggregate demand over all users served by the cache is satisfied. Recommendation systems, on the contrary, are oriented towards user individual preferences: the recommended content should be most appealing to the user so as to elicit further content consumption. In our paper we explore how these, phenomenically conflicting, objectives can be jointly addressed. To this end, we depart radically from current practice with recommender systems, and we approach them as network traffic engineering tools that can actively shape content demand towards optimizing user- and network-centric performance objectives. We formulate the resulting joint theoretical optimization problem of deciding on the cached content and the recommendations to each user so that the cache hit ratio is maximized subject to a maximum tolerable distortion that the recommendation should undergo. We conclude on its complexity, and we propose a practical algorithm for its solution. The algorithm is essentially a form of lightweight control over the user recommendations so that the recommended content is both appealing to the end user and more friendly to the caching system and the network resources.", "citation": "Citations (5)", "departments": ["Athens University of Economics and Business", "Athens University of Economics and Business", "Athens University of Economics and Business"], "authors": ["Livia Elena Chatzieleftheriou.....http://dblp.org/pers/hd/c/Chatzieleftheriou:Livia_Elena", "Merkourios Karaliopoulos.....http://dblp.org/pers/hd/k/Karaliopoulos:Merkourios", "Iordanis Koutsopoulos.....http://dblp.org/pers/hd/k/Koutsopoulos:Iordanis"], "conf": "infocom", "year": "2017", "pages": 9}