{"title": "Feedback Networks.", "fields": ["machine learning", "logic gate", "architecture", "artificial neural network", "feed forward"], "abstract": "Urrently, the most successful learning models in computer vision are based on learning successive representations followed by a decision layer. This is usually actualized through feedforward multilayer neural networks, e.g. ConvNets, where each layer forms one of such successive representations. However, an alternative that can achieve the same goal is a feedback based approach in which the representation is formed in an iterative manner based on a feedback received from previous iterations output. We establish that a feedback based approach has several core advantages over feedforward: it enables making early predictions at the query time, its output naturally conforms to a hierarchical structure in the label space (e.g. a taxonomy), and it provides a new basis for Curriculum Learning. We observe that feedback develops a considerably different representation compared to feedforward counterparts, in line with the aforementioned advantages. We provide a general feedback based learning architecture, instantiated using existing RNNs, with the endpoint results on par or better than existing feedforward networks and the addition of the above advantages.", "citation": "Citations (11)", "year": "2017", "departments": ["Stanford University", "University of Southern California", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "conf": "cvpr", "authors": ["Amir Roshan Zamir.....http://dblp.org/pers/hd/z/Zamir:Amir_Roshan", "Te-Lin Wu.....http://dblp.org/pers/hd/w/Wu:Te=Lin", "Lin Sun.....http://dblp.org/pers/hd/s/Sun_0004:Lin", "William B. Shen.....http://dblp.org/pers/hd/s/Shen:William_B=", "Bertram E. Shi.....http://dblp.org/pers/hd/s/Shi:Bertram_E=", "Jitendra Malik.....http://dblp.org/pers/hd/m/Malik:Jitendra", "Silvio Savarese.....http://dblp.org/pers/hd/s/Savarese:Silvio"], "pages": 10}