{"title": "A lightweight privacy-preserving truth discovery framework for mobile crowd sensing systems.", "fields": ["homomorphic encryption", "cloud computing", "cryptosystem", "mobile device", "cryptography"], "abstract": "The recent proliferation of human-carried mobile devices has given rise to the mobile crowd sensing (MCS) systems. However, the sensory data provided by the participating workers are usually not reliable. As an efficient technique to extract truthful information from unreliable data, truth discovery has drawn significant attention. Currently, the privacy concern of the participating workers poses a major challenge on the design of truth discovery mechanisms. Although the existing mechanism can conduct truth discovery with high accuracy and strong privacy guarantee, tremendous overhead is incurred on the worker side. In this paper, we propose a novel lightweight privacy preserving truth discovery framework, L-PPTD, which is implemented by involving two non-colluding cloud platforms and adopting additively homomorphic cryptosystem. This framework not only achieves the protection of each worker's sensory data and reliability information but also introduces little overhead to the workers. In order to further reduce each worker's overhead in the scenarios where only the sensory data need to be protected, we propose another more lightweight framework named L 2 -PPTD. The desirable performance of the proposed frameworks is verified through extensive experiments conducted on real world MCS systems.", "citation": "Citations (2)", "departments": ["University at Buffalo", "University at Buffalo", "University at Buffalo", "University at Buffalo", "Anhui University"], "authors": ["Chenglin Miao.....http://dblp.org/pers/hd/m/Miao:Chenglin", "Lu Su.....http://dblp.org/pers/hd/s/Su:Lu", "Wenjun Jiang.....http://dblp.org/pers/hd/j/Jiang:Wenjun", "Yaliang Li.....http://dblp.org/pers/hd/l/Li:Yaliang", "Miaomiao Tian.....http://dblp.org/pers/hd/t/Tian:Miaomiao"], "conf": "infocom", "year": "2017", "pages": 9}