{"title": "Fractal: An Execution Model for Fine-Grain Nested Speculative Parallelism.", "fields": ["speculative multithreading", "memory level parallelism", "implicit parallelism", "data parallelism", "scalable parallelism"], "abstract": "Most systems that support speculative parallelization, like hardware transactional memory (HTM), do not support nested parallelism. This sacrifices substantial parallelism and precludes composing parallel algorithms. And the few HTMs that do support nested parallelism focus on parallelizing at the coarsest (shallowest) levels, incurring large overheads that squander most of their potential.   We present FRACTAL, a new execution model that supports unordered and timestamp-ordered nested parallelism. FRACTAL lets programmers seamlessly compose speculative parallel algorithms, and lets the architecture exploit parallelism at all levels. FRACTAL can parallelize a broader range of applications than prior speculative execution models. We design a FRACTAL implementation that extends the Swarm architecture and focuses on parallelizing at the finest (deepest) levels. Our approach sidesteps the issues of nested parallel HTMs and uncovers abundant fine-grain parallelism. As a result, FRACTAL outperforms prior speculative architectures by up to 88x at 256 cores.", "citation": "Citations (1)", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Suvinay Subramanian.....http://dblp.org/pers/hd/s/Subramanian:Suvinay", "Mark C. Jeffrey.....http://dblp.org/pers/hd/j/Jeffrey:Mark_C=", "Maleen Abeydeera.....http://dblp.org/pers/hd/a/Abeydeera:Maleen", "Hyun Ryong Lee.....http://dblp.org/pers/hd/l/Lee:Hyun_Ryong", "Victor A. Ying.....http://dblp.org/pers/hd/y/Ying:Victor_A=", "Joel S. Emer.....http://dblp.org/pers/hd/e/Emer:Joel_S=", "Daniel Sánchez.....http://dblp.org/pers/hd/s/S=aacute=nchez_0003:Daniel"], "conf": "isca", "year": "2017", "pages": 13}