{"title": "S3: syntax- and semantic-guided repair synthesis via programming by examples.", "fields": ["novelty", "program synthesis", "symbolic execution", "enumeration", "ranking"], "abstract": "A notable class of techniques for automatic program repair is known as semantics-based. Such techniques, e.g., Angelix, infer semantic specifications via symbolic execution, and then use program synthesis to construct new code that satisfies those inferred specifications. However, the obtained specifications are naturally incomplete, leaving the synthesis engine with a difficult task of synthesizing a general solution from a sparse space of many possible solutions that are consistent with the provided specifications but that do not necessarily generalize. We present S3, a new repair synthesis engine that leverages programming-by-examples methodology to synthesize high-quality bug repairs. The novelty in S3 that allows it to tackle the sparse search space to create more general repairs is three-fold: (1) A systematic way to customize and constrain the syntactic search space via a domain-specific language, (2) An efficient enumeration- based search strategy over the constrained search space, and (3) A number of ranking features based on measures of the syntactic and semantic distances between candidate solutions and the original buggy program. We compare S3’s repair effectiveness with state-of-the-art synthesis engines Angelix, Enumerative, and CVC4. S3 can successfully and correctly fix at least three times more bugs than the best baseline on datasets of 52 bugs in small programs, and 100 bugs in real-world large programs.", "citation": "Citations (15)", "departments": ["Singapore Management University", "Institute of Science and Technology Austria", "Singapore Management University", "Carnegie Mellon University", "Stellenbosch University"], "authors": ["Xuan-Bach D. Le.....http://dblp.org/pers/hd/l/Le:Xuan=Bach_D=", "Duc-Hiep Chu.....http://dblp.org/pers/hd/c/Chu:Duc=Hiep", "David Lo.....http://dblp.org/pers/hd/l/Lo_0001:David", "Claire Le Goues.....http://dblp.org/pers/hd/g/Goues:Claire_Le", "Willem Visser.....http://dblp.org/pers/hd/v/Visser:Willem"], "conf": "sigsoft", "year": "2017", "pages": 12}