{"title": "Tracking anemia ubiquitously, frequently, and predictively.", "fields": ["embedded system", "computer science", "analogy", "schedule"], "abstract": "What if we can monitor our health like the way we monitor the weather? The way humans manage the weather is one that is proactive rather than reactive. Weather stations are spread across the world, satellites take periodic images to track large atmospheric patterns, and water samples are made to check the ocean's health. It is an effort that allows us to have knowledge of the current state of the weather and overall health of the world climate. Not only that, it allows us to forecast the weather to plan flight schedules, tsunami warnings, or just when we should go hiking. Without this concerted effort, we would literally be flying blind. In contrast, the current paradigm for general health monitoring is reactive rather than proactive. Generally, patients seek medical attention after something is wrong, leading to higher cost of treatment due to delayed response to conditions [10, 11]. This is largely due to the vast variety of health metrics needed to be monitored to properly screen for all the different facets of human health. This is further aggravated in developing countries where the cost of these screening tools, like blood draws and labs, make it feasible only for national level hospitals to operate [3]. Furthermore, some health conditions require constant monitoring after screening has identified the issue, such as hypertension, diabetes, and different blood conditions [10, 12, 14]. In these cases, the issue becomes further complicated and the need for at home monitoring is needed. Finally, to react to changes in the patient's health, it is essential to predict when the condition may re-occur or worsen. To draw from an analogy with weather tracking, a shift to proactive health monitoring requires tracking that is more ubiquitous, frequent, and predictive.", "citation": "Not cited", "departments": ["University of Washington"], "authors": ["Edward Jay Wang.....http://dblp.org/pers/hd/w/Wang:Edward_Jay"], "conf": "huc", "year": "2017", "pages": 5}