{"title": "Learning to share: engineering adaptive decision-support for online social networks.", "fields": ["decision support system", "software architecture", "reuse", "privacy by design", "privacy software"], "abstract": "Some online social networks (OSNs) allow users to define friendship-groups as reusable shortcuts for sharing information with multiple contacts. Posting exclusively to a friendship-group gives some privacy control, while supporting communication with (and within) this group. However, recipients of such posts may want to reuse content for their own social advantage, and can bypass existing controls by copy-pasting into a new post; this cross-posting poses privacy risks. This paper presents a learning to share approach that enables the incorporation of more nuanced privacy controls into OSNs. Specifically, we propose a reusable, adaptive software architecture that uses rigorous runtime analysis to help OSN users to make informed decisions about suitable audiences for their posts. This is achieved by supporting dynamic formation of recipient-groups that benefit social interactions while reducing privacy risks. We exemplify the use of our approach in the context of Facebook.", "citation": "Not cited", "departments": ["Imperial College London", "University College London", "Imperial College London", "Open University", "University of Southampton"], "authors": ["Yasmin Rafiq.....http://dblp.org/pers/hd/r/Rafiq:Yasmin", "Luke Dickens.....http://dblp.org/pers/hd/d/Dickens:Luke", "Alessandra Russo.....http://dblp.org/pers/hd/r/Russo:Alessandra", "Arosha K. Bandara.....http://dblp.org/pers/hd/b/Bandara:Arosha_K=", "Mu Yang.....http://dblp.org/pers/hd/y/Yang:Mu", "Avelie Stuart.....http://dblp.org/pers/hd/s/Stuart:Avelie", "Mark Levine.....http://dblp.org/pers/hd/l/Levine:Mark", "Gul Calikli.....http://dblp.org/pers/hd/c/Calikli:Gul", "Blaine A. Price.....http://dblp.org/pers/hd/p/Price:Blaine_A=", "Bashar Nuseibeh.....http://dblp.org/pers/hd/n/Nuseibeh:Bashar"], "conf": "kbse", "year": "2017", "pages": 6}