{"title": "ScrubJay: deriving knowledge from the disarray of HPC performance data.", "fields": ["scripting language", "data mining", "semantics", "scalability", "theoretical computer science"], "abstract": "Modern HPC centers comprise clusters, storage, networks, power and cooling infrastructure, and more. Analyzing the efficiency of these complex facilities is a daunting task. Increasingly, facilities deploy sensors and monitoring tools, but with millions of instrumented components, analyzing collected data manually is intractable. Data from an HPC center comprises different formats, granularities, and semantics, and handwritten scripts no longer suffice to transform the data into a digestible form.   We present ScrubJay, an intuitive, scalable framework for  automatic  analysis of disparate HPC data. ScrubJay decouples the task of  specifying  data relationships from the task of  analyzing  data. Domain experts can store reusable transformations that describe relations between domains. ScrubJay also automates performance analysis. Analysts provide a query over logical domains of interest, and ScrubJay automatically derives needed steps to transform raw measurements. ScrubJay makes large-scale analysis tractable, reproducible, and provides insights into HPC facilities.", "citation": "Not cited", "year": "2017", "departments": ["University of California, Berkeley", "University of California", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "University of Oregon", "Lawrence Livermore National Laboratory"], "conf": "sc", "authors": ["Alfredo Giménez.....http://dblp.org/pers/hd/g/Gim=eacute=nez:Alfredo", "Todd Gamblin.....http://dblp.org/pers/hd/g/Gamblin:Todd", "Abhinav Bhatele.....http://dblp.org/pers/hd/b/Bhatele:Abhinav", "Chad Wood.....http://dblp.org/pers/hd/w/Wood:Chad", "Kathleen Shoga.....http://dblp.org/pers/hd/s/Shoga:Kathleen", "Aniruddha Marathe.....http://dblp.org/pers/hd/m/Marathe:Aniruddha", "Peer-Timo Bremer.....http://dblp.org/pers/hd/b/Bremer:Peer=Timo", "Bernd Hamann.....http://dblp.org/pers/hd/h/Hamann:Bernd", "Martin Schulz.....http://dblp.org/pers/hd/s/Schulz_0001:Martin"], "pages": 12}