{"title": "CCSP: A compressed certificate status protocol.", "fields": ["online certificate status protocol", "self signed certificate", "ocsp stapling", "certificate signing request", "x 509"], "abstract": "Trust in SSL-based communications is provided by Certificate Authorities (CAs) in the form of signed certificates. Checking the validity of a certificate involves three steps: (i) checking its expiration date, (ii) verifying its signature, and (iii) ensuring that it is not revoked. Currently, such certificate revocation checks are done either via Certificate Revocation Lists (CRLs) or Online Certificate Status Protocol (OCSP) servers. Unfortunately, despite the existence of these revocation checks, sophisticated cyber-attackers, may trick web browsers to trust a revoked certificate, believing that it is still valid. Consequently, the web browser will communicate (over TLS) with web servers controlled by cyber-attackers. Although frequently updated, nonced, and timestamped certificates may reduce the frequency and impact of such cyber-attacks, they impose a very large overhead to the CAs and OCSP servers, which now need to timestamp and sign on a regular basis all the responses, for every certificate they have issued, resulting in a very high overhead. To mitigate this overhead and provide a solution to the described cyber-attacks, we present CCSP: a new approach to provide timely information regarding the status of certificates, which capitalizes on a newly introduced notion called signed collections. In this paper, we present the design, preliminary implementation, and evaluation of CCSP in general, and signed collections in particular. Our preliminary results suggest that CCSP (i) reduces space requirements by more than an order of magnitude, (ii) lowers the number of signatures required by 6 orders of magnitude compared to OCSP-based methods, and (iii) adds only a few milliseconds of overhead in the overall user latency.", "citation": "Citations (1)", "departments": ["University of Crete", "University of Crete", "University of Crete", "University of Crete", "University of Crete"], "authors": ["Antonios A. Chariton.....http://dblp.org/pers/hd/c/Chariton:Antonios_A=", "Eirini Degkleri.....http://dblp.org/pers/hd/d/Degkleri:Eirini", "Panagiotis Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos:Panagiotis", "Panagiotis Ilia.....http://dblp.org/pers/hd/i/Ilia:Panagiotis", "Evangelos P. Markatos.....http://dblp.org/pers/hd/m/Markatos:Evangelos_P="], "conf": "infocom", "year": "2017", "pages": 9}