{"title": "Multi-Scale Cascade Network for Salient Object Detection.", "fields": ["deep learning", "salient", "salience", "network architecture", "cascade"], "abstract": "In this paper we present a novel network architecture, called Multi-Scale Cascade Network (MSC-Net), to identify the most visually conspicuous objects in an image. Our network consists of several stages (sub-networks) for handling saliency detection across different scales. All these sub-networks form a cascade structure (in a coarse-to-fine manner) where the same underlying convolutional feature representations are fully shared. Compared with existing CNN-based saliency models, the MSC-Net can naturally enable the learning process in the finer cascade stages to encode more global contextual information while progressively incorporating the saliency prior knowledge obtained from coarser stages and thus lead to better detection accuracy. We also design a novel refinement module to further filter out errors by considering the intermediate feedback information. Our MSC-Net is highly integrated, end-to-end trainable, and very powerful. The proposed method achieves state-of-the-art performance on five widely-used salient object detection benchmarks, outperforming existing methods and also maintaining high efficiency. Code and pre-trained models are available at https://github.com/lixin666/MSC-NET.", "citation": "Citations (1)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "North Carolina State University", "University of Electronic Science and Technology of China"], "authors": ["Xin Li.....http://dblp.org/pers/hd/l/Li:Xin", "Fan Yang.....http://dblp.org/pers/hd/y/Yang:Fan", "Hong Cheng.....http://dblp.org/pers/hd/c/Cheng:Hong", "Junyu Chen.....http://dblp.org/pers/hd/c/Chen:Junyu", "Yuxiao Guo.....http://dblp.org/pers/hd/g/Guo:Yuxiao", "Leiting Chen.....http://dblp.org/pers/hd/c/Chen:Leiting"], "conf": "mm", "year": "2017", "pages": 9}