{"title": "Wheel: Accelerating CNNs with Distributed GPUs via Hybrid Parallelism and Alternate Strategy.", "fields": ["idle", "convolutional neural network", "architecture", "computation", "server"], "abstract": "Convolutional Neural Networks (CNNs) have been widely used and achieve amazing performance, typically at the cost of very expensive computation. Some methods accelerate the CNN training by distributed GPUs those deploying GPUs on multiple servers. Unfortunately, they need to transmit a large amount of data among servers, which leads to long data transmitting time and long GPU idle time. Towards this end, we propose a novel hybrid parallelism architecture named \"Wheel\" to accelerate the CNN training by reducing the transmitted data and fully using GPUs simultaneously. Specifically, Wheel first partitions the layers of a CNN into two kinds of modules: convolutional module and fully-connected module, and deploys them following the proposed hybrid parallelism. In this way, Wheel transmits only a few parameters of CNNs among different servers, and transmits most of the parameters within the same server. The time to transmit data is significantly reduced. Second, to fully run each GPU and reduce the idle time, Wheel devises an alternate strategy deploying multiple workers on each GPU. Once one worker is suspended for receiving data, another one in the same GPU starts to execute the computing task. The workers in each GPU run concurrently and repeatedly like Wheels. Experiments are conducted to show the outperformance of the proposed scheme over the state-of-the-art parallel approaches.", "citation": "Not cited", "departments": ["University of Electronic Science and Technology of China", "Nanjing University of Science and Technology", "Nanjing University of Science and Technology", "University of Electronic Science and Technology of China"], "authors": ["Xiao-Yu Du.....http://dblp.org/pers/hd/d/Du:Xiao=Yu", "Jinhui Tang.....http://dblp.org/pers/hd/t/Tang:Jinhui", "Zechao Li.....http://dblp.org/pers/hd/l/Li:Zechao", "Zhiguang Qin.....http://dblp.org/pers/hd/q/Qin:Zhiguang"], "conf": "mm", "year": "2017", "pages": 9}