{"title": "Improving understanding of dynamically typed software developed by agile practitioners.", "fields": ["source lines of code", "kpi driven code analysis", "software visualization", "static program analysis", "software construction"], "abstract": "Agile Development values working software over documentation. Therefore, in maintenance stages of existing software, the source code is the sole software artifact that developers have for analyzing the viability and impact of a new user story. Since functionality is often spread in hundreds of lines of code, it is hard for the developer to understand the system, which may lead to under-/overestimation of the new feature cost and rework/delays in the subsequent phases of development. In a previous work, we proposed a Model-Driven Reverse Engineering approach for obtaining software visualizations from source code. Two case studies of comprehension of applications written in statically typed languages have shown the applicability of this approach. A recent experience with an industrial partner, where the systems are developed on dynamically typed languages, has motivated us to adapt the previous proposal to take as input not only the source code but also the application data schema to complete the information that is missing in the code, and then automatically generate more meaningful diagrams that help developers in maintenance tasks. In this article, we present the adaptation of the general approach to support data schema as an additional input and its instrumentation in an industrial case study where the technology is Ruby on Rails. The paper ends by explaining the precision and performance of the instrumentation when used in a Colombian company as well as lessons learned.", "citation": "Citations (1)", "departments": ["Grupo México", "University of Los Andes"], "authors": ["Jair García.....http://dblp.org/pers/hd/g/Garc=iacute=a:Jair", "Kelly Garcés.....http://dblp.org/pers/hd/g/Garc=eacute=s:Kelly"], "conf": "sigsoft", "year": "2017", "pages": 6}