{"title": "When program analysis meets mobile security: an industrial study of misusing Android internet sockets.", "fields": ["android", "vulnerability", "vulnerability assessment", "program analysis", "countermeasure"], "abstract": "Despite recent progress in program analysis techniques to identify vulnerabilities in Android apps, significant challenges still remain for applying these techniques to large-scale industrial environments. Modern software-security providers, such as Qihoo 360 and Pwnzen (two leading companies in China), are often required to process more than 10 million mobile apps at each run. In this work, we focus on effectively and efficiently identifying vulnerable usage of Internet sockets in an industrial setting. To achieve this goal, we propose a practical hybrid approach that enables lightweight yet precise detection in the industrial setting. In particular, we integrate the process of categorizing potential vulnerable apps with analysis techniques, to reduce the inevitable human inspection effort. We categorize potential vulnerable apps based on characteristics of vulnerability signatures, to reduce the burden on static analysis. We flexibly integrate static and dynamic analyses for apps in each identified family, to refine the family signatures and hence target on precise detection. We implement our approach in a practical system and deploy the system on the Pwnzen platform. By using the system, we identify and report potential vulnerabilities of 24 vulnerable apps (falling into 3 vulnerability families) to their developers, and some of these reported vulnerabilities are previously unknown. The apps of each vulnerability family in total have over 50 million downloads. We also propose countermeasures and highlight promising directions for technology transfer.", "citation": "Citations (1)", "departments": ["East China Normal University", "East China Normal University", "East China Normal University", "n.n., n.n.", "Pwnzen Infotech, China"], "authors": ["Wenqi Bu.....http://dblp.org/pers/hd/b/Bu:Wenqi", "Minhui Xue.....http://dblp.org/pers/hd/x/Xue:Minhui", "Lihua Xu.....http://dblp.org/pers/hd/x/Xu:Lihua", "Yajin Zhou.....http://dblp.org/pers/hd/z/Zhou:Yajin", "Zhushou Tang.....http://dblp.org/pers/hd/t/Tang:Zhushou", "Tao Xie.....http://dblp.org/pers/hd/x/Xie:Tao"], "conf": "sigsoft", "year": "2017", "pages": 6}