{"title": "Time Series Classification by Sequence Learning in All-Subsequence Space.", "fields": ["discriminative model", "linear classifier", "symbolic data analysis", "sequence learning", "raw data"], "abstract": "Existing approaches to time series classification can be grouped into shape-based (numeric) and structure-based (symbolic). Shape-based techniques use the raw numeric time series with Euclidean or Dynamic Time Warping distance and a 1-Nearest Neighbor classifier. They are accurate, but computationally intensive. Structure-based methods discretize the raw data into symbolic representations, then extract features for classifiers. Recent symbolic methods have outperformed numeric ones regarding both accuracy and efficiency. Most approaches employ a bag-of-symbolic-words representation, but typically the word-length is fixed across all time series, an issue identified as a major weakness in the literature. Also, there are no prior attempts to use efficient sequence learning techniques to go beyond single words, to features based on variable-length sequences of words or symbols. We study an efficient linear classification approach, SEQL, originally designed for classification of symbolic sequences. SEQL learns discriminative subsequences from training data by exploiting the all-subsequence space using greedy gradient descent. We explore different discretization approaches, from none at all to increasing smoothing of the original data, and study the effect of these transformations on the accuracy of SEQL classifiers. We propose two adaptations of SEQL for time series data, SAX-VSEQL, can deal with X-axis offsets by learning variable-length symbolic words, and SAX-VFSEQL, can deal with X-axis and Y-axis offsets, by learning fuzzy variable-length symbolic words. Our models are linear classifiers in rich feature spaces. Their predictions are based on the most discriminative subsequences learned during training, and can be investigated for interpreting the classification decision.", "citation": "Not cited", "departments": ["University College Dublin", "University College Dublin"], "authors": ["Thach Le Nguyen.....http://dblp.org/pers/hd/n/Nguyen:Thach_Le", "Severin Gsponer.....http://dblp.org/pers/hd/g/Gsponer:Severin", "Georgiana Ifrim.....http://dblp.org/pers/hd/i/Ifrim:Georgiana"], "conf": "icde", "year": "2017", "pages": 12}