{"title": "Globally-Optimal Inlier Set Maximisation for Simultaneous Camera Pose and Feature Correspondence.", "fields": ["correspondence problem", "pattern recognition", "outlier", "pose", "computer vision", "computer science", "convergence", "cardinality", "artificial intelligence"], "abstract": "Estimating the 6-DoF pose of a camera from a single image relative to a pre-computed 3D point-set is an important task for many computer vision applications. Perspective-n-Point (PnP) solvers are routinely used for camera pose estimation, provided that a good quality set of 2D-3D feature correspondences are known beforehand. However, finding optimal correspondences between 2D key-points and a 3D point-set is non-trivial, especially when only geometric (position) information is known. Existing approaches to the simultaneous pose and correspondence problem use local optimisation, and are therefore unlikely to find the optimal solution without a good pose initialisation, or introduce restrictive assumptions. Since a large proportion of outliers are common for this problem, we instead propose a globally-optimal inlier set cardinality maximisation approach which jointly estimates optimal camera pose and optimal correspondences. Our approach employs branch-and-bound to search the 6D space of camera poses, guaranteeing global optimality without requiring a pose prior. The geometry of SE(3) is used to find novel upper and lower bounds for the number of inliers and local optimisation is integrated to accelerate convergence. The evaluation empirically suppons the optimality proof and shows that the method performs much more robustly than existing approaches, including on a large-scale outdoor data-set.", "citation": "Not cited", "year": "2017", "departments": ["Australian National University", "Australian National University", "Australian National University", "Australian National University", "Australian National University", "Commonwealth Scientific and Industrial Research Organisation", "Australian National University", "Australian National University"], "conf": "iccv", "authors": ["Dylan Campbell.....http://dblp.org/pers/hd/c/Campbell:Dylan", "Lars Petersson.....http://dblp.org/pers/hd/p/Petersson:Lars", "Laurent Kneip.....http://dblp.org/pers/hd/k/Kneip:Laurent", "Hongdong Li.....http://dblp.org/pers/hd/l/Li:Hongdong"], "pages": 10}