{"title": "Neural Networks for Efficient Bayesian Decoding of Natural Images from Retinal Neurons.", "fields": ["scene statistics", "neural decoding", "autoencoder", "architecture", "bayesian inference"], "abstract": "Decoding sensory stimuli from neural signals can be used to reveal how we sense our physical environment, and is valuable for the design of brain-machine interfaces. However, existing linear techniques for neural decoding may not fully reveal or exploit the fidelity of the neural signal. Here we develop a new approximate Bayesian method for decoding natural images from the spiking activity of populations of retinal ganglion cells (RGCs). We sidestep known computational challenges with Bayesian inference by exploiting artificial neural networks developed for computer vision, enabling fast nonlinear decoding that incorporates natural scene statistics implicitly. We use a decoder architecture that first linearly reconstructs an image from RGC spikes, then applies a convolutional autoencoder to enhance the image. The resulting decoder, trained on natural images and simulated neural responses, significantly outperforms linear decoding, as well as simple point-wise nonlinear decoding. These results provide a tool for the assessment and optimization of retinal prosthesis technologies, and reveal that the retina may provide a more accurate representation of the visual scene than previously appreciated.", "citation": "Citations (3)", "year": "2017", "departments": ["Stanford University", "Columbia University", "Columbia University", "Columbia University", "Columbia University"], "conf": "nips", "authors": ["Nikhil Parthasarathy.....http://dblp.org/pers/hd/p/Parthasarathy:Nikhil", "Eleanor Batty.....http://dblp.org/pers/hd/b/Batty:Eleanor", "William Falcon.....http://dblp.org/pers/hd/f/Falcon:William", "Thomas Rutten.....http://dblp.org/pers/hd/r/Rutten:Thomas", "Mohit Rajpal.....http://dblp.org/pers/hd/r/Rajpal:Mohit", "E. J. Chichilnisky.....http://dblp.org/pers/hd/c/Chichilnisky:E=_J=", "Liam Paninski.....http://dblp.org/pers/hd/p/Paninski:Liam"], "pages": 12}