{"title": "TT-Join: Efficient Set Containment Join.", "fields": ["trie", "nice", "information engineering", "speedup", "order of magnitude"], "abstract": "In this paper, we study the problem of set containment join. Given two collections R and S of records, the set containment join R./S retrieves all record pairs f(r, s)g 2 R S such that r s. This problem has been extensively studied in the literature and has many important applications in commercial and scientific fields. Recent research focuses on the in-memory set containment join algorithms, and several techniques have been developed following intersectionoriented or union-oriented computing paradigms. Nevertheless, we observe that two computing paradigms have their limits due to the nature of the intersection and union operators. Particularly, intersection-oriented method relies on the intersection of the relevant inverted lists built on the elements of S. A nice property of the intersection-oriented method is that the join computation is verification free. However, the number of records explored during the join process may be large because there are multiple replicas for each record in S. On the other hand, the unionaornidenttehde mcaenthdoiddatgeenpearairtses aare siogbntaatiunreed fobry etahceh urneicoonrdofin thRe inverted lists of the relevant signatures. The candidate size of the union-oriented method is usually small because each record contributes only one replica in the index. Unfortunately, unionoriented method needs to verify the candidate pairs, which may be cost expensive especially when the join result size is large. As a matter of fact, the state-of-the-art union-oriented solution is not competitive compared to the intersection-oriented ones. In this paper, we propose a new union-oriented method, namely TT-Join, which not only enhances the advantage of the previous unionoriented methods but also integrates the goodness of intersectionoriented methods by imposing a variant of prefix tree structure. We conduct extensive experiments on 20 real-life datasets by comparing our method with 7 existing methods. The experiment results demonstrate that TT-Join significantly outperforms the existing algorithms on most of the datasets, and can achieve up to two orders of magnitude speedup.", "citation": "Citations (1)", "departments": ["University of New South Wales", "University of New South Wales", "University of New South Wales", "University of Technology, Sydney", "University of New South Wales"], "authors": ["Jianye Yang.....http://dblp.org/pers/hd/y/Yang:Jianye", "Wenjie Zhang.....http://dblp.org/pers/hd/z/Zhang:Wenjie", "Shiyu Yang.....http://dblp.org/pers/hd/y/Yang:Shiyu", "Ying Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Ying", "Xuemin Lin.....http://dblp.org/pers/hd/l/Lin:Xuemin"], "conf": "icde", "year": "2017", "pages": 12}