{"title": "The ART of App Compartmentalization: Compiler-based Library Privilege Separation on Stock Android.", "fields": ["firmware", "sandbox", "application lifecycle management", "bytecode", "privilege separation"], "abstract": "Third-party libraries are commonly used by app developers for alleviating the development efforts and for monetizing their apps. On Android, the host app and its third-party libraries reside in the same sandbox and share all privileges awarded to the host app by the user, putting the users' privacy at risk of intrusions by third-party libraries. In this paper, we introduce a new privilege separation approach for third-party libraries on stock Android. Our solution partitions Android applications at compile-time into isolated, privilege-separated compartments for the host app and the included third-party libraries. A particular benefit of our approach is that it leverages compiler-based instrumentation available on stock Android versions and thus abstains from modification of the SDK, the app bytecode, or the device firmware. A particular challenge for separating libraries from their host apps is the reconstruction of the communication channels and the preservation of visual fidelity between the now separated app and its libraries. We solve this challenge through new IPC-based protocols to synchronize layout and lifecycle management between different sandboxes. Finally, we demonstrate the efficiency and effectiveness of our solution by applying it to real world apps from the Google Play Store that contain advertisements.", "citation": "Not cited", "year": "2017", "departments": ["Saarland University", "Saarland University", "Saarland University", "Saarland University"], "conf": "ccs", "authors": ["Jie Huang.....http://dblp.org/pers/hd/h/Huang:Jie", "Oliver Schranz.....http://dblp.org/pers/hd/s/Schranz:Oliver", "Sven Bugiel.....http://dblp.org/pers/hd/b/Bugiel:Sven", "Michael Backes.....http://dblp.org/pers/hd/b/Backes_0001:Michael"], "pages": 13}