{"title": "Inception-v4, Inception-ResNet and the Impact of Residual Connections on Learning.", "fields": ["cls upper limits", "deep learning", "convolutional neural network", "resnet", "contextual image classification"], "abstract": "Very deep convolutional networks have been central to the largest advances in image recognition performance in recent years. One example is the Inception architecture that has been shown to achieve very good performance at relatively low computational cost. Recently, the introduction of residual connections in conjunction with a more traditional architecture has yielded state-of-the-art performance in the 2015 ILSVRC challenge; its performance was similar to the latest generation Inception-v3 network. This raises the question: Are there any benefits to combining Inception architectures with residual connections? Here we give clear empirical evidence that training with residual connections accelerates the training of Inception networks significantly. There is also some evidence of residual Inception networks outperforming similarly expensive Inception networks without residual connections by a thin margin. We also present several new streamlined architectures for both residual and non-residual Inception networks. These variations improve the single-frame recognition performance on the ILSVRC 2012 classification task significantly. We further demonstrate how proper activation scaling stabilizes the training of very wide residual Inception networks. With an ensemble of three residual and one Inception-v4 networks, we achieve 3.08% top-5 error on the test set of the ImageNet classification (CLS) challenge.", "citation": "Citations (1,229)", "departments": ["Google", "Google", "Google", "Google"], "authors": ["Christian Szegedy.....http://dblp.org/pers/hd/s/Szegedy:Christian", "Sergey Ioffe.....http://dblp.org/pers/hd/i/Ioffe:Sergey", "Vincent Vanhoucke.....http://dblp.org/pers/hd/v/Vanhoucke:Vincent", "Alexander A. Alemi.....http://dblp.org/pers/hd/a/Alemi:Alexander_A="], "conf": "aaai", "year": "2017", "pages": 7}