{"title": "Rethinking HTTP Adaptive Streaming with the Mobile User Perception.", "fields": ["computer science", "perception", "trade off", "multimedia", "mobile search"], "abstract": "Videos over HTTP adaptive streaming have been the most popular vehicle for delivering media content on mobile platform. Rather, today's mobile video streaming are excessively tailored for visual quality, imposing a heavy burden on user's data budget. In this paper, we aim to optimize mobile video streaming of low bitrate efficiency with considering human visual acuity, i.e., preferably avoid sacrificing viewing quality. First, we conduct to in-depth analysis of mobile HTTP adaptive video streaming with a focus not only on how it works, but also on the significance of bitrate saving. Second, we identify a novel research problem on excessive visual quality which leads to bitrate-inefficient video streaming, and propose a flexible system called EyeTube to address it. Specifically, we apply dynamic resolution scaling on mobile video streaming to trade off the bitrate efficiency and user viewing experience Third, we derive general principles for achieving bitrate-efficient mobile video streaming, and employ the principles to an open source web browser, i.e., Chromium, to verify its applicability. An end-to-end EyeTube system is implemented on Samsung smartphones, and the efficiency are evaluated against 10 popular YouTube videos. Experimental results show that all the bitrates of the 10 videos can be reduced by at least 54.2% on average and up to 90.9% at most when the resolution is quartered. A user study with 40 respondents has indicated that our system can achieve good performance on both bitrate saving and high viewing quality.", "citation": "Not cited", "departments": ["Tsinghua University", "Tsinghua University", "Tsinghua University", "Tsinghua University"], "authors": ["Chao Wu.....http://dblp.org/pers/hd/w/Wu_0002:Chao", "Wenwu Zhu.....http://dblp.org/pers/hd/z/Zhu_0001:Wenwu", "Qiushi Li.....http://dblp.org/pers/hd/l/Li:Qiushi", "Yaoxue Zhang.....http://dblp.org/pers/hd/z/Zhang:Yaoxue"], "conf": "mm", "year": "2017", "pages": 9}