{"title": "Rethinking Reprojection: Closing the Loop for Pose-Aware Shape Reconstruction from a Single Image.", "fields": ["deep learning", "pose", "active shape model", "computer vision", "computer science", "3d pose estimation", "solid modeling", "artificial intelligence"], "abstract": "An emerging problem in computer vision is the reconstruction of 3D shape and pose of an object from a single image. Hitherto, the problem has been addressed through the application of canonical deep learning methods to regress from the image directly to the 3D shape and pose labels. These approaches, however, are problematic from two perspectives. First, they are minimizing the error between 3D shapes and pose labels - with little thought about the nature of this “label error” when reprojecting the shape back onto the image. Second, they rely on the onerous and ill-posed task of hand labeling natural images with respect to 3D shape and pose. In this paper we define the new task of pose-aware shape reconstruction from a single image, and we advocate that cheaper 2D annotations of objects silhouettes in natural images can be utilized. We design architectures of pose-aware shape reconstruction which reproject the predicted shape back on to the image using the predicted pose. Our evaluation on several object categories demonstrates the superiority of our method for predicting pose-aware 3D shapes from natural images.", "citation": "Not cited", "year": "2017", "departments": ["Carnegie Mellon University", "Istituto Italiano di Tecnologia", "Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Istituto Italiano di Tecnologia", "Carnegie Mellon University", "Carnegie Mellon University"], "conf": "iccv", "authors": ["Rui Zhu.....http://dblp.org/pers/hd/z/Zhu_0004:Rui", "Hamed Kiani Galoogahi.....http://dblp.org/pers/hd/g/Galoogahi:Hamed_Kiani", "Chaoyang Wang.....http://dblp.org/pers/hd/w/Wang:Chaoyang", "Simon Lucey.....http://dblp.org/pers/hd/l/Lucey:Simon"], "pages": 9}