{"title": "Resurrecting the sigmoid in deep learning through dynamical isometry: theory and practice.", "fields": ["sigmoid function", "deep learning", "singular value", "isometry", "free probability"], "abstract": "It is well known that weight initialization in deep networks can have a dramatic impact on learning speed. For example, ensuring the mean squared singular value of a network's input-output Jacobian is O(1) is essential for avoiding exponentially vanishing or exploding gradients. Moreover, in deep linear networks, ensuring that all singular values of the Jacobian are concentrated near 1 can yield a dramatic additional speed-up in learning; this is a property known as dynamical isometry. However, it is unclear how to achieve dynamical isometry in nonlinear deep networks. We address this question by employing powerful tools from free probability theory to analytically compute the {\\it entire} singular value distribution of a deep network's input-output Jacobian. We explore the dependence of the singular value distribution on the depth of the network, the weight initialization, and the choice of nonlinearity. Intriguingly, we find that ReLU networks are incapable of dynamical isometry. On the other hand, sigmoidal networks can achieve isometry, but only with orthogonal weight initialization. Moreover, we demonstrate empirically that deep nonlinear networks achieving dynamical isometry learn orders of magnitude faster than networks that do not. Indeed, we show that properly-initialized deep sigmoidal networks consistently outperform deep ReLU networks. Overall, our analysis reveals that controlling the entire distribution of Jacobian singular values is an important design consideration in deep learning.", "citation": "Citations (6)", "year": "2017", "departments": ["Google", "Google", "Stanford University"], "conf": "nips", "authors": ["Jeffrey Pennington.....http://dblp.org/pers/hd/p/Pennington:Jeffrey", "Samuel S. Schoenholz.....http://dblp.org/pers/hd/s/Schoenholz:Samuel_S=", "Surya Ganguli.....http://dblp.org/pers/hd/g/Ganguli:Surya"], "pages": 11}