{"title": "BlitzG: Exploiting high-bandwidth networks for fast graph processing.", "fields": ["ethernet", "exploit", "root cause", "models of communication", "workload"], "abstract": "Nowadays, high-bandwidth networks are easily accessible in data centers. However, existing distributed graph-processing frameworks fail to efficiently utilize the additional bandwidth capacity in these networks for higher performance, due to their inefficient computation and communication models, leading to very long waiting times experienced by users for the graph-computing results. The root cause lies in the fact that the computation and communication models of these frameworks generate, send and receive messages so slowly that only a small fraction of the available network bandwidth is utilized. In this paper, we propose a high-performance distributed graph-processing framework, called BlitzG, to address this problem. This framework fully exploits the available network bandwidth capacity for fast graph processing. Our approach aims at significant reduction in (i) the computation workload of each vertex for fast message generation by using a new slimmed-down vertex-centric computation model and (ii) the average message overhead for fast message delivery by designing a lightweight message-centric communication model. Evaluation on a 40Gbps Ethernet, driven by real-world graph datasets, shows that BlitzG outperforms the state-of-the-art distributed graph-processing frameworks by up to 27x with an average of 20.7x.", "citation": "Citations (1)", "departments": ["Huazhong University of Science and Technology", "University of Texas at Arlington", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Yongli Cheng.....http://dblp.org/pers/hd/c/Cheng:Yongli", "Hong Jiang.....http://dblp.org/pers/hd/j/Jiang_0001:Hong", "Fang Wang.....http://dblp.org/pers/hd/w/Wang_0001:Fang", "Yu Hua.....http://dblp.org/pers/hd/h/Hua_0001:Yu", "Dan Feng.....http://dblp.org/pers/hd/f/Feng_0001:Dan"], "conf": "infocom", "year": "2017", "pages": 9}