{"title": "Resilient Datacenter Load Balancing in the Wild.", "fields": ["network packet", "computer network", "load balancing", "functional testing", "granularity"], "abstract": "Production datacenters operate under various uncertainties such as traffic dynamics, topology asymmetry, and failures. Therefore, datacenter load balancing schemes must be resilient to these uncertainties; i.e., they should accurately sense path conditions and timely react to mitigate the fallouts. Despite significant efforts, prior solutions have important drawbacks. On the one hand, solutions such as Presto and DRB are oblivious to path conditions and blindly reroute at fixed granularity. On the other hand, solutions such as CONGA and CLOVE can sense congestion, but they can only reroute when flowlets emerge; thus, they cannot always react timely to uncertainties. To make things worse, these solutions fail to detect/handle failures such as blackholes and random packet drops, which greatly degrades their performance.   In this paper, we introduce Hermes, a datacenter load balancer that is resilient to the aforementioned uncertainties. At its heart, Hermes leverages comprehensive sensing to detect path conditions including failures unattended before, and it reacts using timely yet cautious rerouting. Hermes is a practical edge-based solution with no switch modification. We have implemented Hermes with commodity switches and evaluated it through both testbed experiments and large-scale simulations. Our results show that Hermes achieves comparable performance to CONGA and Presto in normal cases, and well handles uncertainties: under asymmetries, Hermes achieves up to 10% and 20% better flow completion time (FCT) than CONGA and CLOVE; under switch failures, it outperforms all other schemes by over 32%.", "citation": "Citations (7)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Michigan"], "authors": ["Hong Zhang.....http://dblp.org/pers/hd/z/Zhang:Hong", "Junxue Zhang.....http://dblp.org/pers/hd/z/Zhang:Junxue", "Wei Bai.....http://dblp.org/pers/hd/b/Bai_0001:Wei", "Kai Chen.....http://dblp.org/pers/hd/c/Chen_0005:Kai", "Mosharaf Chowdhury.....http://dblp.org/pers/hd/c/Chowdhury:Mosharaf"], "conf": "sigcomm", "year": "2017", "pages": 14}