{"title": "360ProbDASH: Improving QoE of 360 Video Streaming Using Tile-based HTTP Adaptive Streaming.", "fields": ["latency", "quality of experience", "probabilistic logic", "upload", "viewport"], "abstract": "Recently, there has been a significant interest towards 360-degree panorama video. However, such videos usually require extremely high bitrate which hinders their widely spread over the Internet. Tile-based viewport adaptive streaming is a promising way to deliver 360-degree video due to its on-request portion downloading. But it is not trivial for it to achieve good Quality of Experience (QoE) because Internet request-reply delay is usually much higher than motion-to-photon latency. In this paper, we leverage a probabilistic approach to pre-fetch tiles countering viewport prediction error, and design a QoE-driven viewport adaptation system, 360ProbDASH. It treats user's head movement as probability events, and constructs a probabilistic model to depict the distribution of viewport prediction error. A QoE-driven optimization framework is proposed to minimize total expected distortion of pre-fetched tiles. Besides, to smooth border effects of mixed-rate tiles, the spatial quality variance is also minimized. With the requirement of short-term viewport prediction under a small buffer, it applies a target-buffer-based rate adaptation algorithm to ensure continuous playback. We implement 360ProbDASH prototype and carry out extensive experiments on a simulation test-bed and real-world Internet with real user's head movement traces. The experimental results demonstrate that 360ProbDASH achieves at almost 39% gains on viewport PSNR, and 46% reduction on spatial quality variance against the existed viewport adaptation methods.", "citation": "Citations (2)", "departments": ["Peking University", "Peking University", "Beijing University of Posts and Telecommunications", "Peking University", "Peking University"], "authors": ["Lan Xie.....http://dblp.org/pers/hd/x/Xie:Lan", "Zhimin Xu.....http://dblp.org/pers/hd/x/Xu:Zhimin", "Yixuan Ban.....http://dblp.org/pers/hd/b/Ban:Yixuan", "Xinggong Zhang.....http://dblp.org/pers/hd/z/Zhang:Xinggong", "Zongming Guo.....http://dblp.org/pers/hd/g/Guo:Zongming"], "conf": "mm", "year": "2017", "pages": 9}