{"title": "BigBench V2: The New and Improved BigBench.", "fields": ["star schema", "late binding", "benchmark", "unstructured data", "sql"], "abstract": "Benchmarking Big Data solutions has been gaining a lot of attention from research and industry. BigBench is one of the most popular benchmarks in this area which was adopted by the TPC as TPCx-BB. BigBench, however, has key shortcomings. The structured component of the data model is the same as the TPC-DS data model which is a complex snowflake-like schema. This is contrary to the simple star schema Big Data models in real life. BigBench also treats the semi-structured web-logs more or less as a structured table. In real life, web-logs are modeled as key-value pairs with unknown schema. Specific keys are captured at query time - a process referred to as late binding. In addition, eleven (out of thirty) of the BigBench queries are TPC-DS queries. These queries are complex SQL applied on the structured part of the data model which again is not typical of Big Data workloads. In this paper1, we present BigBench V2 to address the aforementioned limitations of the original BigBench. BigBench V2 is completely independent of TPC-DS with a new data model and an overhauled workload. The new data model has a simple structured data model. Web-logs are modeled as key-value pairs with a substantial and variable number of keys. BigBench V2 mandates late binding by requiring query processing to be done directly on key-value web-logs rather than a pre-parsed form of it. A new scale factor-based data generator is implemented to produce structured tables, key-value semistructured web-logs, and unstructured data. We implemented and executed BigBench V2 on Hive. Our proof of concept shows the feasibility of BigBench V2 and outlines different ways of implementing late binding.", "citation": "Citations (3)", "departments": ["Teradata", "Goethe University Frankfurt", "Teradata", "Teradata"], "authors": ["Ahmad Ghazal.....http://dblp.org/pers/hd/g/Ghazal:Ahmad", "Todor Ivanov.....http://dblp.org/pers/hd/i/Ivanov:Todor", "Pekka Kostamaa.....http://dblp.org/pers/hd/k/Kostamaa:Pekka", "Alain Crolotte.....http://dblp.org/pers/hd/c/Crolotte:Alain", "Ryan Voong.....http://dblp.org/pers/hd/v/Voong:Ryan", "Mohammed Al-Kateb.....http://dblp.org/pers/hd/a/Al=Kateb:Mohammed", "Waleed Ghazal.....http://dblp.org/pers/hd/g/Ghazal:Waleed", "Roberto V. Zicari.....http://dblp.org/pers/hd/z/Zicari:Roberto_V="], "conf": "icde", "year": "2017", "pages": 12}