{"title": "Fast and Scalable Distributed Set Similarity Joins for Big Data Analytics.", "fields": ["scalability", "big data", "data integration", "joins", "load balancing"], "abstract": "Set similarity join is an essential operation in big data analytics, e.g., data integration and data cleaning, that finds similar pairs from two collections of sets. To cope with the increasing scale of the data, distributed algorithms are called for to support large-scale set similarity joins. Multiple techniques have been proposed to perform similarity joins using MapReduce in recent years. These techniques, however, usually produce huge amounts of duplicates in order to perform parallel processing successfully as MapReduce is a shared-nothing framework. The large number of duplicates incurs on both large shuffle cost and unnecessary computation cost, which significantly decrease the performance. Moreover, these approaches do not provide a load balancing guarantee, which results in a skewness problem and negatively affects the scalability properties of these techniques. To address these problems, in this paper, we propose a duplicatefree framework, called FS-Join, to perform set similarity joins efficiently by utilizing an innovative vertical partitioning technique. FS-Join employs three powerful filtering methods to prune dissimilar string pairs without computing their similarity scores. To further improve the performance and scalability, FS-Join integrates horizontal partitioning. Experimental results on three real datasets show that FS-Join outperforms the state-of-theart methods by one order of magnitude on average, which demonstrates the good scalability and performance qualities of the proposed technique.", "citation": "Citations (4)", "departments": ["Arizona State University", "Tianjin Polytechnic University", "University of California, San Diego", "University of California, San Diego", "Renmin University of China", "Chinese Ministry of Education", "Mathematical an ... nces, School of"], "authors": ["Chuitian Rong.....http://dblp.org/pers/hd/r/Rong:Chuitian", "Chunbin Lin.....http://dblp.org/pers/hd/l/Lin:Chunbin", "Yasin N. Silva.....http://dblp.org/pers/hd/s/Silva:Yasin_N=", "Jianguo Wang.....http://dblp.org/pers/hd/w/Wang_0001:Jianguo", "Wei Lu.....http://dblp.org/pers/hd/l/Lu:Wei", "Xiaoyong Du.....http://dblp.org/pers/hd/d/Du:Xiaoyong"], "conf": "icde", "year": "2017", "pages": 12}