{"title": "Attributed variability models: outside the comfort zone.", "fields": ["kernel density estimation", "machine learning", "theoretical computer science", "spite", "genetic algorithm"], "abstract": "Variability models are often enriched with attributes, such as performance, that encode the influence of features on the respective attribute. In spite of their importance, there are only few attributed variability models available that have attribute values obtained from empirical, real-world observations and that cover interactions between features. But, what does it mean for research and practice when staying in the comfort zone of developing algorithms and tools in a setting where artificial attribute values are used and where interactions are neglected? This is the central question that we want to answer here. To leave the comfort zone, we use a combination of kernel density estimation and a genetic algorithm to rescale a given (real-world) attribute-value profile to a given variability model. To demonstrate the influence and relevance of realistic attribute values and interactions, we present a replication of a widely recognized, third-party study, into which we introduce realistic attribute values and interactions. We found statistically significant differences between the original study and the replication. We infer lessons learned to conduct experiments that involve attributed variability models. We also provide the accompanying tool Thor for generating attribute values including interactions. Our solution is shown to be agnostic about the given input distribution and to scale to large variability models.", "citation": "Citations (4)", "departments": ["Bauhaus University, Weimar", "University of Passau", "WU Vienna, Austria"], "authors": ["Norbert Siegmund.....http://dblp.org/pers/hd/s/Siegmund:Norbert", "Stefan Sobernig.....http://dblp.org/pers/hd/s/Sobernig:Stefan", "Sven Apel.....http://dblp.org/pers/hd/a/Apel:Sven"], "conf": "sigsoft", "year": "2017", "pages": 11}