{"title": "Reflections on the REST architectural style and \"principled design of the modern web architecture\" (impact paper award).", "fields": ["website architecture", "architectural style", "representational state transfer", "architectural pattern", "software development process"], "abstract": "Seventeen years after its initial publication at ICSE 2000, the Representational State Transfer (REST) architectural style continues to hold significance as both a guide for understanding how the World Wide Web is designed to work and an example of how principled design, through the application of architectural styles, can impact the development and understanding of large-scale software architecture. However, REST has also become an industry buzzword: frequently abused to suit a particular argument, confused with the general notion of using HTTP, and denigrated for not being more like a programming methodology or implementation framework.     In this paper, we chart the history, evolution, and shortcomings of REST, as well as several related architectural styles that it inspired, from the perspective of a chain of doctoral dissertations produced by the University of California's Institute for Software Research at UC Irvine. These successive theses share a common theme: extending the insights of REST to new domains and, in their own way, exploring the boundary of software engineering as it applies to decentralized software architectures and architectural design. We conclude with discussion of the circumstances, environment, and organizational characteristics that gave rise to this body of work.", "citation": "Citations (1)", "departments": ["Adobe Systems", "University of California, Irvine", "University of California, Irvine", "University of California, Santa Cruz", "Bloomberg, USA"], "authors": ["Roy T. Fielding.....http://dblp.org/pers/hd/f/Fielding:Roy_T=", "Richard N. Taylor.....http://dblp.org/pers/hd/t/Taylor:Richard_N=", "Justin R. Erenkrantz.....http://dblp.org/pers/hd/e/Erenkrantz:Justin_R=", "Michael M. Gorlick.....http://dblp.org/pers/hd/g/Gorlick:Michael_M=", "Jim Whitehead.....http://dblp.org/pers/hd/w/Whitehead:Jim", "Rohit Khare.....http://dblp.org/pers/hd/k/Khare:Rohit", "Peyman Oreizy.....http://dblp.org/pers/hd/o/Oreizy:Peyman"], "conf": "sigsoft", "year": "2017", "pages": 11}