{"title": "How Personality Affects our Likes: Towards a Better Understanding of Actionable Images.", "fields": ["timeline", "visual perception", "purchasing", "big five personality traits", "affect"], "abstract": "Messages like \"If You Drink Don't Drive\", \"Each water drop count\" or \"Smoking causes cancer\" are often paired with visual content in order to persuade an audience to perform specific actions, such as clicking a link, retweeting a post or purchasing a product. Despite its usefulness, the current way of discovering actionable images is entirely manual and typically requires marketing experts to filter over thousands of candidate images. To help understand the audience, marketers and social scientists have been investigating for years the role of personality in personalized services by leveraging AI technologies and social network data. In this work, we analyze how personality affects user actions on images in a social network website, and which visual stimuli contained in image content influence actions from users with certain Big Five traits. In order to achieve this goal, we ground this research on psychological studies which investigate the interplay between personality and emotions. Given a public Twitter dataset containing 1.6 million user-image timeline retweet actions, we carried out two extensive statistical analysis, which show significant correlation between personality traits and affective visual concepts in image content. We then proposed a novel model that combines user personality traits and image visual concepts for the task of predicting user actions in advance. This work is the first attempt to integrate personality traits and multimedia features, and moves an important step towards building personalized systems for automatically discovering actionable multimedia content.", "citation": "Citations (1)", "departments": ["National University of Singapore", "National University of Singapore", "Johns Hopkins University", "National University of Singapore"], "authors": ["Francesco Gelli.....http://dblp.org/pers/hd/g/Gelli:Francesco", "Xiangnan He.....http://dblp.org/pers/hd/h/He_0001:Xiangnan", "Tao Chen.....http://dblp.org/pers/hd/c/Chen:Tao", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "mm", "year": "2017", "pages": 10}