{"title": "BAC: Bandwidth-aware compression for efficient live migration of virtual machines.", "fields": ["load balancing", "live migration", "virtualization", "compression ratio", "downtime"], "abstract": "Live migration of virtual machines (VM) is one of the key characteristics of virtualization for load balancing, system maintenance, power management, etc., in data centers or clusters. In order to reduce the data transferred and shorten the migration time, the compression techniques have been widely used to accelerate VM migration. However, different compression approaches have different compression ratios and speeds. Because there is a trade-off between compression and transmission, the migration performance improvements obtained from different compression approaches are differentiated, and the improvements vary with the network bandwidth. Besides, the compression window sizes used in most compression algorithms are typically much larger than a single page size, so the traditional single page compression loses some potential compression benefits. In this paper, we design and implement a Bandwidth-Aware Compression (BAC) scheme for VM migration. BAC chooses suitable compression approach according to the network bandwidth available for the migration process, and employs multi-page compression. These features make BAC obtain more migration performance improvements from compression. Experiments under various network scenarios demonstrate that, compared with conventional compression approaches, BAC shortens the total migration time while achieving comparable performance for the total data transferred and the downtime.", "citation": "Citations (1)", "departments": ["Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology", "Huazhong University of Science and Technology"], "authors": ["Chunguang Li.....http://dblp.org/pers/hd/l/Li:Chunguang", "Dan Feng.....http://dblp.org/pers/hd/f/Feng_0001:Dan", "Yu Hua.....http://dblp.org/pers/hd/h/Hua_0001:Yu", "Wen Xia.....http://dblp.org/pers/hd/x/Xia:Wen", "Leihua Qin.....http://dblp.org/pers/hd/q/Qin:Leihua", "Yue Huang.....http://dblp.org/pers/hd/h/Huang:Yue", "Yukun Zhou.....http://dblp.org/pers/hd/z/Zhou:Yukun"], "conf": "infocom", "year": "2017", "pages": 9}