{"title": "Coarsening Massive Influence Networks for Scalable Diffusion Analysis.", "fields": ["graph reduction", "maximization", "diffusion process", "vertex", "linear space"], "abstract": "Fueled by the increasing popularity of online social networks, social influence analysis has attracted a great deal of research attention in the past decade. The diffusion process is often modeled using  influence graphs , and there has been a line of research that involves algorithmic problems in influence graphs. However, the vast size of today's real-world networks raises a serious issue with regard to computational efficiency.   In this paper, we propose a new algorithm for reducing influence graphs. Given an input influence graph, the proposed algorithm produces a vertex-weighted influence graph, which is compact and approximates the diffusion properties of the input graph. The central strategy of influence graph reduction is  coarsening , which has the potential to greatly reduce the number of edges by merging a vertex set into a single weighted vertex. We provide two implementations; a  speed-oriented  implementation which runs in  linear time  with  linear space  and a  scalability-oriented  implementation which runs in practically  linear time  with  sublinear space . Further, we present general frameworks using our compact graphs that accelerate existing algorithms for  influence maximization  and  influence estimation  problems, which are motivated by practical applications, such as viral marketing. Using these frameworks, we can quickly obtain solutions that have accuracy guarantees under a reasonable assumption. Experiments with real-world networks demonstrate that the proposed algorithm can scale to billion-edge graphs and reduce the graph size to up to 4%. In addition, our influence maximization framework achieves four times speed-up of a state-of-the-art  D-SSA  algorithm, and our influence estimation framework cuts down the computation time of a simulation-based method to 3.5%.", "citation": "Citations (2)", "year": "2017", "departments": ["University of Tokyo", "National Institute of Informatics", "Yahoo!", "National Institute of Informatics"], "conf": "sigmod", "authors": ["Naoto Ohsaka.....http://dblp.org/pers/hd/o/Ohsaka:Naoto", "Tomohiro Sonobe.....http://dblp.org/pers/hd/s/Sonobe:Tomohiro", "Sumio Fujita.....http://dblp.org/pers/hd/f/Fujita:Sumio", "Ken-ichi Kawarabayashi.....http://dblp.org/pers/hd/k/Kawarabayashi:Ken=ichi"], "pages": 16}