{"title": "Simple, Accurate, Analytical Time Modeling and Optimal Tile Size Selection for GPGPU Stencils.", "fields": ["simple set", "compiler", "stencil", "general purpose computing on graphics processing units", "stencil code"], "abstract": "Stencil computations are an important class of compute and data intensive programs that occur widely in scientific and engineeringapplications. A number of tools use sophisticated tiling, parallelization, and memory mapping strategies, and generate code that relies on vendor-supplied compilers. This code has a number of parameters, such as tile sizes, that are then tuned via empirical exploration.     We develop a model that guides such a choice. Our model is a simple set of analytical functions that predict the execution time of the generated code. It is deliberately optimistic, since tile sizes and, moreover, the optimistic assumptions are intended to enable we are targeting modeling and parameter selections yielding highly tuned codes.     We experimentally validate the model on a number of 2D and 3D stencil codes, and show that the root mean square error in the execution time is less than 10% for the subset of the codes that achieve performance within 20% of the best. Furthermore, based on using our model, we are able to predict tile sizes that achieve a further improvement of 9% on average.", "citation": "Citations (2)", "year": "2017", "departments": ["Colorado State University", "Colorado State University", "Colorado State University", "Los Alamos National Laboratory", "IRISA, Rennes, France"], "conf": "ppopp", "authors": ["Nirmal Prajapati.....http://dblp.org/pers/hd/p/Prajapati:Nirmal", "Waruna Ranasinghe.....http://dblp.org/pers/hd/r/Ranasinghe:Waruna", "Sanjay V. Rajopadhye.....http://dblp.org/pers/hd/r/Rajopadhye:Sanjay_V=", "Rumen Andonov.....http://dblp.org/pers/hd/a/Andonov:Rumen", "Hristo Djidjev.....http://dblp.org/pers/hd/d/Djidjev:Hristo", "Tobias Grosser.....http://dblp.org/pers/hd/g/Grosser:Tobias"], "pages": 15}