{"title": "Characterizing the Nature and Dynamics of Tor Exit Blocking.", "fields": ["leverage", "web crawler", "blacklisting", "computer science", "computer security", "operator", "anonymity"], "abstract": "Facing undesired traffic from the Tor anonymity network, online service providers discriminate against Tor users. In this study we characterize the extent of discrimination faced by Tor users and the nature of undesired traffic exiting from the Tor network - a task complicated by Tor's need to maintain user anonymity. We leverage multiple independent data sources: email complaints sent to exit operators, commercial threat intelligence, webpage crawls via Tor, and privacy-sensitive measurements of our own Tor exit nodes to address this challenge. We develop methods for classifying email complaints sent to abuse contacts and an interactive crawler to find subtle forms of discrimination on the Web, and deploy our own exits in various configurations to understand which are prone to discrimination. We find that conservative exit policies are ineffective in preventing the blacklisting of exit relays. However, a majority of the attacks originating from Tor generate high traffic volume, suggesting the possibility of detection and prevention without violating Tor users' privacy. Based on work published at [1].   [1]: Rachee Singh, Rishab Nithyanand, Sadia Afroz, Paul Pearce, Michael Carl Tschantz, Phillipa Gill, and Vern Paxson.", "citation": "Not cited", "year": "2017", "departments": ["University of Massachusetts Amherst", "International Computer Science Institute", "University of California, Berkeley", "International Computer Science Institute", "Stony Brook University", "Stony Brook University", "University of California, Berkeley", "University of California, Berkeley", "International Computer Science Institute", "Data & Society  ... earch Institute"], "conf": "uss", "authors": ["Rachee Singh.....http://dblp.org/pers/hd/s/Singh:Rachee", "Rishab Nithyanand.....http://dblp.org/pers/hd/n/Nithyanand:Rishab", "Sadia Afroz.....http://dblp.org/pers/hd/a/Afroz:Sadia", "Paul Pearce.....http://dblp.org/pers/hd/p/Pearce:Paul", "Michael Carl Tschantz.....http://dblp.org/pers/hd/t/Tschantz:Michael_Carl", "Phillipa Gill.....http://dblp.org/pers/hd/g/Gill:Phillipa", "Vern Paxson.....http://dblp.org/pers/hd/p/Paxson:Vern"], "pages": 17}