{"title": "Quantifying how much sensory information in a neural code is relevant for behavior.", "fields": ["sensory system", "information flow", "neural coding", "mutual information", "coding"], "abstract": "Determining how much of the sensory information carried by a neural code contributes to behavioral performance is key to understand sensory function and neural information flow. However, there are as yet no analytical tools to compute this information that lies at the intersection between sensory coding and behavioral readout. Here we develop a novel measure, termed the information-theoretic intersection information $\\III(S;R;C)$, that quantifies how much of the sensory information carried by a neural response $R$ is used for behavior during perceptual discrimination tasks. Building on the Partial Information Decomposition framework, we define $\\III(S;R;C)$ as the part of the mutual information between the stimulus $S$ and the response $R$ that also informs the consequent behavioral choice $C$. We compute $\\III(S;R;C)$ in the analysis of two experimental cortical datasets, to show how this measure can be used to compare quantitatively the contributions of spike timing and spike rates to task performance, and to identify brain areas or neural populations that specifically transform sensory information into choice.", "citation": "Citations (3)", "year": "2017", "departments": ["Istituto Italiano di Tecnologia", "Istituto Italiano di Tecnologia", "Harvard University", "University of Pittsburgh", "Harvard University"], "conf": "nips", "authors": ["Giuseppe Pica.....http://dblp.org/pers/hd/p/Pica:Giuseppe", "Eugenio Piasini.....http://dblp.org/pers/hd/p/Piasini:Eugenio", "Houman Safaai.....http://dblp.org/pers/hd/s/Safaai:Houman", "Caroline Runyan.....http://dblp.org/pers/hd/r/Runyan:Caroline", "Christopher D. Harvey.....http://dblp.org/pers/hd/h/Harvey:Christopher_D=", "Mathew E. Diamond.....http://dblp.org/pers/hd/d/Diamond:Mathew_E=", "Christoph Kayser.....http://dblp.org/pers/hd/k/Kayser:Christoph", "Tommaso Fellin.....http://dblp.org/pers/hd/f/Fellin:Tommaso", "Stefano Panzeri.....http://dblp.org/pers/hd/p/Panzeri:Stefano"], "pages": 11}