{"title": "GELL: Automatic Extraction of Epidemiological Line Lists from Open Sources.", "fields": ["outbreak", "demographics", "word2vec", "epidemiology", "information extraction"], "abstract": "Real-time monitoring and responses to emerging public health threats rely on the availability of timely surveillance data. During the early stages of an epidemic, the ready availability of  line lists  with detailed tabular information about laboratory-confirmed cases can assist epidemiologists in making reliable inferences and forecasts. Such inferences are crucial to understand the epidemiology of a specific disease early enough to stop or control the outbreak. However, construction of such line lists requires considerable human supervision and therefore, difficult to generate in real-time. In this paper, we motivate Guided Epidemiological Line List ( GELL ), the first tool for building automated line lists (in near real-time) from open source reports of emerging disease outbreaks. Specifically, we focus on deriving epidemiological characteristics of an emerging disease and the affected population from reports of illness.  GELL  uses distributed vector representations (ala word2vec) to discover a set of indicators for each line list feature. This discovery of indicators is followed by the use of dependency parsing based techniques for final extraction in tabular form. We evaluate the performance of  GELL  against a human annotated line list provided by HealthMap corresponding to MERS outbreaks in Saudi Arabia. We demonstrate that  GELL  extracts line list features with increased accuracy compared to a baseline method. We further show how these automatically extracted line list features can be used for making epidemiological inferences, such as inferring demographics and symptoms-to-hospitalization period of affected individuals.", "citation": "Not cited", "departments": ["Virginia Tech", "Virginia Tech", "Virginia Tech", "Massachusetts Institute of Technology", "Boston Children's Hospital"], "authors": ["Saurav Ghosh.....http://dblp.org/pers/hd/g/Ghosh:Saurav", "Prithwish Chakraborty.....http://dblp.org/pers/hd/c/Chakraborty:Prithwish", "Bryan L. Lewis.....http://dblp.org/pers/hd/l/Lewis:Bryan_L=", "Maimuna S. Majumder.....http://dblp.org/pers/hd/m/Majumder:Maimuna_S=", "Emily Cohn.....http://dblp.org/pers/hd/c/Cohn:Emily", "John S. Brownstein.....http://dblp.org/pers/hd/b/Brownstein:John_S=", "Madhav V. Marathe.....http://dblp.org/pers/hd/m/Marathe:Madhav_V=", "Naren Ramakrishnan.....http://dblp.org/pers/hd/r/Ramakrishnan:Naren"], "conf": "kdd", "year": "2017", "pages": 9}