{"title": "Emotion Recognition in Context.", "fields": ["text mining", "emotion classification", "emotion perception", "cognitive psychology", "convolutional neural network", "everyday life", "affective science", "emotion recognition", "facial expression"], "abstract": "Understanding what a person is experiencing from her frame of reference is essential in our everyday life. For this reason, one can think that machines with this type of ability would interact better with people. However, there are no current systems capable of understanding in detail peoples emotional states. Previous research on computer vision to recognize emotions has mainly focused on analyzing the facial expression, usually classifying it into the 6 basic emotions [11]. However, the context plays an important role in emotion perception, and when the context is incorporated, we can infer more emotional states. In this paper we present the Emotions in Context Database (EMCO), a dataset of images containing people in context in non-controlled environments. In these images, people are annotated with 26 emotional categories and also with the continuous dimensions valence, arousal, and dominance [21]. With the EMCO dataset, we trained a Convolutional Neural Network model that jointly analyzes the person and the whole scene to recognize rich information about emotional states. With this, we show the importance of considering the context for recognizing peoples emotions in images, and provide a benchmark in the task of emotion recognition in visual context.", "citation": "Citations (5)", "year": "2017", "departments": ["Commonwealth Scientific and Industrial Research Organisation", "Massachusetts Institute of Technology", "Open University of Catalonia"], "conf": "cvpr", "authors": ["Ronak Kosti.....http://dblp.org/pers/hd/k/Kosti:Ronak", "Jose M. Alvarez.....http://dblp.org/pers/hd/a/Alvarez:Jose_M=", "Adrià Recasens.....http://dblp.org/pers/hd/r/Recasens:Adri=agrave=", "Àgata Lapedriza.....http://dblp.org/pers/hd/l/Lapedriza:=Agrave=gata"], "pages": 9}