{"title": "SVC-TChain: Incentivizing good behavior in layered P2P video streaming.", "fields": ["encryption", "scalable video coding", "scalability", "incentive", "computer network"], "abstract": "Video streaming applications based on Peer-to-Peer (P2P) systems are popular for their scalability, which is hard to achieve with traditional client-server approaches. In particular, layered video streaming has been much-studied due to its ability to differentiate users' streaming qualities in heterogeneous user environments. Previous work, however, has shown that user misbehavior (e.g., free-riding and protocol deviation) poses a serious threat to P2P systems that are not equipped with proper incentive mechanisms. We propose a method to disincentivize such misbehavior. Our SVC-TChain is a layered P2P video streaming method based on scalable video coding (SVC), which uses the recently proposed T-Chain incentive mechanism to discourage free-riding. After introducing T-Chain, we present the first analytical framework to study SVC piece selection with multiple video layers, using it to efficiently choose SVC-TChain's optimal piece selection parameters and thus discourage deviations from the piece selection policy. Extensive experimental results show that SVC-TChain outperforms layered extensions of BiTos and Give-to-Get, two popular P2P video streaming approaches, both in the absence of user misbehavior and when some users misbehave.", "citation": "Not cited", "departments": ["Carnegie Mellon University", "Korea Military Academy", "University of Illinois at Urbana–Champaign", "University of C ... laorado Boulder", "University of C ... laorado Boulder"], "authors": ["Parisa Rahimzadeh.....http://dblp.org/pers/hd/r/Rahimzadeh:Parisa", "Carlee Joe-Wong.....http://dblp.org/pers/hd/j/Joe=Wong:Carlee", "Kyuyong Shin.....http://dblp.org/pers/hd/s/Shin:Kyuyong", "Youngbin Im.....http://dblp.org/pers/hd/i/Im:Youngbin", "Jongdeog Lee.....http://dblp.org/pers/hd/l/Lee:Jongdeog", "Sangtae Ha.....http://dblp.org/pers/hd/h/Ha:Sangtae"], "conf": "infocom", "year": "2017", "pages": 9}