{"title": "Feisu: Fast Query Execution over Heterogeneous Data Sources on Large-Scale Clusters.", "fields": ["business analytics", "analytics", "data analysis", "data modeling", "data integration"], "abstract": "Fast data analytics at an increasingly large scale has become a critical task in any Internet service company. For example, in Baidu, the major search engine company in China, large volumes of Web and business data in PB-scale are timely and constantly acquired and analyzed for the purposes of evaluating product revenue, tracking product demanding activities on market, predicting user behavior, upgrading product rankings, and diagnosing spam cases, and many others. Response time for queries of various data analytics not only affects user experiences, but also has a serious impact on productivity of business operations. In this paper, to meet the challenge of fast data analytics, we present Feisu (meaning fast in Chinese), a data integration system over heterogeneous storage systems, which has been widely used in Baidu's critical and daily business analytics applications after our R&D efforts. Feisu is designed and implemented to co-work together with several heterogeneous storage systems, and exploit the query similarity embedded in complex query workloads. Our experiments using real world workloads show that Feisu can significantly improve query performance in Baidu. Feisu has been in production use in Baidu for two years to effectively manage over dozens of petabytes of data for various applications.", "citation": "Not cited", "departments": ["Ohio State University"], "authors": ["An Qin.....http://dblp.org/pers/hd/q/Qin:An", "Yuan Yuan.....http://dblp.org/pers/hd/y/Yuan:Yuan", "Dai Tan.....http://dblp.org/pers/hd/t/Tan:Dai", "Pengyu Sun.....http://dblp.org/pers/hd/s/Sun:Pengyu", "Xiang Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiang", "Hao Cao.....http://dblp.org/pers/hd/c/Cao:Hao", "Rubao Lee.....http://dblp.org/pers/hd/l/Lee:Rubao", "Xiaodong Zhang.....http://dblp.org/pers/hd/z/Zhang:Xiaodong"], "conf": "icde", "year": "2017", "pages": 10}