{"title": "Are developers aware of the architectural impact of their changes?", "fields": ["software architecture", "java", "software system", "code review", "software development process"], "abstract": "Although considered one of the most important decisions in a software development lifecycle, empirical evidence on how developers perform and perceive architectural changes is still scarce. Given the large implications of architectural decisions, we do not know whether developers are aware of their changes' impact on the software's architecture, whether awareness leads to better changes, and whether automatically making developers aware would prevent degradation. Therefore, we use code review data of 4 open source systems to investigate the intent and awareness of developers when performing changes. We extracted 8,900 reviews for which the commits are available. 2,152 of the commits have changes in their computed architectural metrics, and 338 present significant changes to the architecture. We manually inspected all reviews for commits with significant changes and found that only in 38% of the time developers are discussing the impact of their changes on the architectural structure, suggesting a lack of awareness. Finally, we observed that developers tend to be more aware of the architectural impact of their changes when the architectural structure is improved, suggesting that developers should be automatically made aware when their changes degrade the architectural structure.", "citation": "Citations (4)", "departments": ["University College London", "University College London", "University College London", "University College London", "University College London"], "authors": ["Matheus Paixão.....http://dblp.org/pers/hd/p/Paix=atilde=o:Matheus", "Jens Krinke.....http://dblp.org/pers/hd/k/Krinke:Jens", "DongGyun Han.....http://dblp.org/pers/hd/h/Han:DongGyun", "Chaiyong Ragkhitwetsagul.....http://dblp.org/pers/hd/r/Ragkhitwetsagul:Chaiyong", "Mark Harman.....http://dblp.org/pers/hd/h/Harman:Mark"], "conf": "kbse", "year": "2017", "pages": 11}