{"title": "Finding the Secret of CNN Parameter Layout under Strict Size Constraint.", "fields": ["discriminative model", "contextual image classification", "convolutional neural network", "residual", "convolution"], "abstract": "Although deep convolutional neural networks (CNNs) have significantly boosted the performance of many computer vision tasks, their complexities~(the size or the number of parameters) are also dramatically increased even with slight performance improvement. However, the larger network leads to more computation requirements, which are unfavorable to resource-constrained scenarios, such as the widely used embedded systems. In this paper, we tentatively explore the essential effect of CNN parameter layout, ie, the allocation of parameters in the convolution layers, on the discriminative capability of CNN. Instead of enlarging the breadth or depth of networks, we attempt to improve the discriminative ability of CNN by changing its parameter layout under strict size constraint. Toward this end, a novel energy function is proposed to represent the CNN parameter layout, which makes it possible to model the relationship between the allocation of parameters in the convolution layers and the discriminative ability of CNN. According to extensive experimental results with plain CNN models and Residual Nets, we find that the higher the energy of a specific CNN parameter layout is, the better its discriminative ability is. Following this finding, we propose a novel approach to learn the better parameter layout. Experimental results on two public image classification datasets show that the CNN models with the learned parameter layouts achieve the better image classification results under strict size constraint.", "citation": "Not cited", "departments": ["Beijing Jiaotong University", "Beijing Jiaotong University", "Beijing Jiaotong University", "Microsoft", "Beijing Jiaotong University"], "authors": ["Lixin Liao.....http://dblp.org/pers/hd/l/Liao:Lixin", "Yao Zhao.....http://dblp.org/pers/hd/z/Zhao:Yao", "Shikui Wei.....http://dblp.org/pers/hd/w/Wei:Shikui", "Jingdong Wang.....http://dblp.org/pers/hd/w/Wang:Jingdong", "Ruoyu Liu.....http://dblp.org/pers/hd/l/Liu:Ruoyu"], "conf": "mm", "year": "2017", "pages": 9}