{"title": "Enhancements to VTK enabling scientific visualization in immersive environments.", "fields": ["scientific visualization", "information visualization", "parallel rendering", "visual analytics", "data visualization"], "abstract": "Modern scientific, engineering and medical computational simulations, as well as experimental and observational data sensing/measuring devices, produce enormous amounts of data. While statistical analysis provides insight into this data, scientific visualization is tactically important for scientific discovery, product design and data analysis. These benefits are impeded, however, when scientific visualization algorithms are implemented from scratch — a time-consuming and redundant process in immersive application development. This process can greatly benefit from leveraging the state-of-the-art open-source Visualization Toolkit (VTK) and its community. Over the past two (almost three) decades, integrating VTK with a virtual reality (VR) environment has only been attempted to varying degrees of success. In this paper, we demonstrate two new approaches to simplify this amalgamation of an immersive interface with visualization rendering from VTK. In addition, we cover several enhancements to VTK that provide near real-time updates and efficient interaction. Finally, we demonstrate the combination of VTK with both Vrui and OpenVR immersive environments in example applications.", "citation": "Citations (1)", "departments": ["Kitware", "Kitware", "Kitware", "Indiana University", "Kitware"], "authors": ["Patrick O'Leary.....http://dblp.org/pers/hd/o/O=Leary:Patrick", "Sankhesh Jhaveri.....http://dblp.org/pers/hd/j/Jhaveri:Sankhesh", "Aashish Chaudhary.....http://dblp.org/pers/hd/c/Chaudhary:Aashish", "William R. Sherman.....http://dblp.org/pers/hd/s/Sherman:William_R=", "Ken Martin.....http://dblp.org/pers/hd/m/Martin:Ken", "David Lonie.....http://dblp.org/pers/hd/l/Lonie:David", "Eric T. Whiting.....http://dblp.org/pers/hd/w/Whiting:Eric_T=", "James H. Money.....http://dblp.org/pers/hd/m/Money:James_H=", "Sandy McKenzie.....http://dblp.org/pers/hd/m/McKenzie:Sandy"], "conf": "vr", "year": "2017", "pages": 9}