{"title": "DSC: Dynamic stripe construction for asynchronous encoding in clustered file system.", "fields": ["erasure code", "clustered file system", "asynchronous communication", "block", "distributed file system"], "abstract": "Nowadays many clustered file systems adopt asynchronous encoding which transforms replicated data into erasure coding to maintain data availability with bounded storage overhead. Existing implementations of asynchronous encoding construct coding stripes with logically sequential data blocks, which suffers from heavy cross-rack traffic and necessitates data block redistribution. Recent work [12] solves this problem by carefully distributing replicated data blocks among racks at the time when they are being written, but it is not applicable to the cases when existing systems have different data layouts or the data layout changes. In this paper, we propose Dynamic Stripe Construction (DSC) to transform N-way replication to erasure coding. DSC does not induce to any cross-rack traffic for encoding, and it does not require data block redistribution after encoding. Besides, DSC is general enough to be applied to any existing CFSes with various erasure codes, and it can also be deployed on a distributed file system in a hot-plugging-in manner. To validate the effectiveness of DSC, we implement it on HDFS. Through extensive testbed experiments in a real storage cluster, we show that DSC can significantly increase the encoding throughput and reduce the foreground user response time over the traditional approach.", "citation": "Not cited", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China"], "authors": ["Shuzhan Wei.....http://dblp.org/pers/hd/w/Wei:Shuzhan", "Yongkun Li.....http://dblp.org/pers/hd/l/Li:Yongkun", "Yinlong Xu.....http://dblp.org/pers/hd/x/Xu:Yinlong", "Si Wu.....http://dblp.org/pers/hd/w/Wu:Si"], "conf": "infocom", "year": "2017", "pages": 9}