{"title": "Canopy: An End-to-End Performance Tracing And Analysis System.", "fields": ["tracing", "canopy", "personalization", "end to end principle", "debugging"], "abstract": "This paper presents Canopy, Facebook's end-to-end performance tracing infrastructure. Canopy records causally related performance data across the end-to-end execution path of requests, including from browsers, mobile applications, and backend services. Canopy processes traces in near real-time, derives user-specified features, and outputs to performance datasets that aggregate across billions of requests. Using Canopy, Facebook engineers can query and analyze performance data in real-time. Canopy addresses three challenges we have encountered in scaling performance analysis: supporting the range of execution and performance models used by different components of the Facebook stack; supporting interactive ad-hoc analysis of performance data; and enabling deep customization by users, from sampling traces to extracting and visualizing features. Canopy currently records and processes over 1 billion traces per day. We discuss how Canopy has evolved to apply to a wide range of scenarios, and present case studies of its use in solving various performance challenges.", "citation": "Citations (4)", "departments": ["Facebook", "Brown University", "Facebook", "Facebook", "Facebook"], "authors": ["Jonathan Kaldor.....http://dblp.org/pers/hd/k/Kaldor:Jonathan", "Jonathan Mace.....http://dblp.org/pers/hd/m/Mace:Jonathan", "Michal Bejda.....http://dblp.org/pers/hd/b/Bejda:Michal", "Edison Gao.....http://dblp.org/pers/hd/g/Gao:Edison", "Wiktor Kuropatwa.....http://dblp.org/pers/hd/k/Kuropatwa:Wiktor", "Joe O'Neill.....http://dblp.org/pers/hd/o/O=Neill:Joe", "Kian Win Ong.....http://dblp.org/pers/hd/o/Ong:Kian_Win", "Bill Schaller.....http://dblp.org/pers/hd/s/Schaller:Bill", "Pingjia Shan.....http://dblp.org/pers/hd/s/Shan:Pingjia", "Brendan Viscomi.....http://dblp.org/pers/hd/v/Viscomi:Brendan", "Vinod Venkataraman.....http://dblp.org/pers/hd/v/Venkataraman:Vinod", "Kaushik Veeraraghavan.....http://dblp.org/pers/hd/v/Veeraraghavan:Kaushik", "Yee Jiun Song.....http://dblp.org/pers/hd/s/Song:Yee_Jiun"], "conf": "sosp", "year": "2017", "pages": 17}