{"title": "DSAC - Differentiable RANSAC for Camera Localization.", "fields": ["ransac", "robust optimization", "differentiable function", "probabilistic logic", "deep learning"], "abstract": "RANSAC is an important algorithm in robust optimization and a central building block for many computer vision applications. In recent years, traditionally hand-crafted pipelines have been replaced by deep learning pipelines, which can be trained in an end-to-end fashion. However, RANSAC has so far not been used as part of such deep learning pipelines, because its hypothesis selection procedure is non-differentiable. In this work, we present two different ways to overcome this limitation. The most promising approach is inspired by reinforcement learning, namely to replace the deterministic hypothesis selection by a probabilistic selection for which we can derive the expected loss w.r.t. to all learnable parameters. We call this approach DSAC, the differentiable counterpart of RANSAC. We apply DSAC to the problem of camera localization, where deep learning has so far failed to improve on traditional approaches. We demonstrate that by directly minimizing the expected loss of the output camera poses, robustly estimated by RANSAC, we achieve an increase in accuracy. In the future, any deep learning pipeline can use DSAC as a robust optimization component.", "citation": "Citations (17)", "year": "2017", "departments": ["Dresden University of Technology", "Dresden University of Technology", "Microsoft", "Microsoft", "Dresden University of Technology"], "conf": "cvpr", "authors": ["Eric Brachmann.....http://dblp.org/pers/hd/b/Brachmann:Eric", "Alexander Krull.....http://dblp.org/pers/hd/k/Krull:Alexander", "Sebastian Nowozin.....http://dblp.org/pers/hd/n/Nowozin:Sebastian", "Jamie Shotton.....http://dblp.org/pers/hd/s/Shotton:Jamie", "Frank Michel.....http://dblp.org/pers/hd/m/Michel:Frank", "Stefan Gumhold.....http://dblp.org/pers/hd/g/Gumhold:Stefan", "Carsten Rother.....http://dblp.org/pers/hd/r/Rother:Carsten"], "pages": 9}