{"title": "Weakly-Supervised Learning of Visual Relations.", "fields": ["predicate", "pattern recognition", "of the form", "verb", "discriminative model", "computer science", "supervised learning", "artificial intelligence"], "abstract": "This paper introduces a novel approach for modeling visual relations between pairs of objects. We call relation a triplet of the form (subject; predicate; object) where the predicate is typically a preposition (eg. ’under’, ’in front of’) or a verb (’hold’, ’ride’) that links a pair of objects (subject; object). Learning such relations is challenging as the objects have different spatial configurations and appearances depending on the relation in which they occur. Another major challenge comes from the difficulty to get annotations, especially at box-level, for all possible triplets, which makes both learning and evaluation difficult. The contributions of this paper are threefold. First, we design strong yet flexible visual features that encode the appearance and spatial configuration for pairs of objects. Second, we propose a weakly-supervised discriminative clustering model to learn relations from image-level labels only. Third we introduce a new challenging dataset of unusual relations (UnRel) together with an exhaustive annotation, that enables accurate evaluation of visual relation retrieval. We show experimentally that our model results in state-of-theart results on the visual relationship dataset [32] significantly improving performance on previously unseen relations (zero-shot learning), and confirm this observation on our newly introduced UnRel dataset.", "citation": "Not cited", "year": "2017", "departments": ["École Normale Supérieure", "French Institute for Research in Computer Science and Automation", "École Normale Supérieure", "École Normale Supérieure", "École Normale Supérieure", "French Institute for Research in Computer Science and Automation"], "conf": "iccv", "authors": ["Julia Peyre.....http://dblp.org/pers/hd/p/Peyre:Julia", "Ivan Laptev.....http://dblp.org/pers/hd/l/Laptev:Ivan", "Cordelia Schmid.....http://dblp.org/pers/hd/s/Schmid:Cordelia", "Josef Sivic.....http://dblp.org/pers/hd/s/Sivic:Josef"], "pages": 10}