{"title": "From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring.", "fields": ["chronic condition", "informatics", "self monitoring", "participatory design", "health informatics"], "abstract": "In families composed of parents and children, the health of parents and children is often interrelated: the health of children can have an impact on the health of parents, and vice versa. However, the design of health tracking technologies typically focuses on individual self-tracking and self-management, not yet addressing family health in a unified way. To examine opportunities for family-centered health informatics, we interviewed 14 typically healthy families, interviewed 10 families with a child with a chronic condition, and conducted three participatory design sessions with children aged 7 to 11. Although we identified similarities between family-centered tracking and personal self-tracking, we also found families want to: (1) identify ripple effects between family members; (2) consider both caregivers and children as trackers to support distributing the burdens of tracking across family members; and (3) identify and pursue health guidelines that consider the state of their family (e.g., specific health guidelines for families that include a child with a chronic condition). We contribute to expanding the design lens from self-tracking to family-centered health tracking.", "citation": "Citations (12)", "departments": ["University of Washington", "University of Washington", "University of Washington", "University of Washington", "University of Washington"], "authors": ["Laura R. Pina.....http://dblp.org/pers/hd/p/Pina:Laura_R=", "Sang-Wha Sien.....http://dblp.org/pers/hd/s/Sien:Sang=Wha", "Teresa Ward.....http://dblp.org/pers/hd/w/Ward:Teresa", "Jason C. Yip.....http://dblp.org/pers/hd/y/Yip:Jason_C=", "Sean A. Munson.....http://dblp.org/pers/hd/m/Munson:Sean_A=", "James Fogarty.....http://dblp.org/pers/hd/f/Fogarty:James", "Julie A. Kientz.....http://dblp.org/pers/hd/k/Kientz:Julie_A="], "conf": "cscw", "year": "2017", "pages": 16}