{"title": "Exploiting social influence for context-aware event recommendation in event-based social networks.", "fields": ["online and offline", "exploit", "popularity", "complex event processing", "topic model"], "abstract": "Event-based Social Networks (EBSNs) which bridge the gap between online and offline interactions among users have received increasing popularity. The unique cold-start nature makes event recommendation more challenging than traditional recommendation problems, since even for two events with the same content, they may not happen at the same time, the same location, or be organized by the same host. Existing event recommendation algorithms mainly exploit the basic context information (e.g., location, time and content), while the social influence of event hosts and group members have been ignored. In this paper, we propose a Social Information Augmented Recommender System (SIARS), which fully exploits the social influence of event hosts and group members together with basic context information for event recommendation. In particular, we combine the information of EBSNs and other social networks to characterize the social influence of event hosts, and take interactions between group members into consideration for event recommendation. In addition, we propose a new content-aware recommendation model using the topic model to find the most similar topic the event belongs to, and a new location-aware recommendation model integrating location popularity with location distribution for event recommendation. Extensive experiments on real-world datasets demonstrate that SIARS outperforms other recommendation algorithms.", "citation": "Citations (1)", "departments": ["Wuhan University", "Wuhan University", "Wuhan University", "Wuhan University", "Dalian University of Technology"], "authors": ["Zhibo Wang.....http://dblp.org/pers/hd/w/Wang:Zhibo", "Yongquan Zhang.....http://dblp.org/pers/hd/z/Zhang:Yongquan", "Yijie Li.....http://dblp.org/pers/hd/l/Li:Yijie", "Qian Wang.....http://dblp.org/pers/hd/w/Wang_0002:Qian", "Feng Xia.....http://dblp.org/pers/hd/x/Xia_0001:Feng"], "conf": "infocom", "year": "2017", "pages": 9}