{"title": "Object Detection in Videos with Tubelet Proposal Networks.", "fields": ["viola jones object detection framework", "visualization", "object class detection", "object detection", "video tracking"], "abstract": "Object detection in videos has drawn increasing attention recently with the introduction of the large-scale ImageNet VID dataset. Different from object detection in static images, temporal information in videos is vital for object detection. To fully utilize temporal information, state-of-the-art methods [15, 14] are based on spatiotemporal tubelets, which are essentially sequences of associated bounding boxes across time. However, the existing methods have major limitations in generating tubelets in terms of quality and efficiency. Motion-based [14] methods are able to obtain dense tubelets efficiently, but the lengths are generally only several frames, which is not optimal for incorporating long-term temporal information. Appearance-based [15] methods, usually involving generic object tracking, could generate long tubelets, but are usually computationally expensive. In this work, we propose a framework for object detection in videos, which consists of a novel tubelet proposal network to efficiently generate spatiotemporal proposals, and a Long Short-term Memory (LSTM) network that incorporates temporal information from tubelet proposals for achieving high object detection accuracy in videos. Experiments on the large-scale ImageNet VID dataset demonstrate the effectiveness of the proposed framework for object detection in videos.", "citation": "Citations (13)", "year": "2017", "departments": ["The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong", "The Chinese University of Hong Kong"], "conf": "cvpr", "authors": ["Kai Kang.....http://dblp.org/pers/hd/k/Kang:Kai", "Hongsheng Li.....http://dblp.org/pers/hd/l/Li:Hongsheng", "Tong Xiao.....http://dblp.org/pers/hd/x/Xiao:Tong", "Wanli Ouyang.....http://dblp.org/pers/hd/o/Ouyang:Wanli", "Junjie Yan.....http://dblp.org/pers/hd/y/Yan:Junjie", "Xihui Liu.....http://dblp.org/pers/hd/l/Liu:Xihui", "Xiaogang Wang.....http://dblp.org/pers/hd/w/Wang:Xiaogang"], "pages": 9}