{"title": "Link Prediction across Aligned Networks with Sparse and Low Rank Matrix Estimation.", "fields": ["small number", "evolving networks", "hierarchical network model", "dynamic network analysis", "network science"], "abstract": "Users' addiction to online social networks is discovered to be highly correlated with their social connections in the networks. Dense social connections can effectively help online social networks retain their active users and improve the social network services. Therefore, it is of great importance to make a good prediction of the social links among users. Meanwhile, to enjoy more social network services, users nowadays are usually involved in multiple online social networks simultaneously. Formally, the social networks which share a number of common users are defined as the \"aligned networks\".With the information transferred from multiple aligned social networks, we can gain a more comprehensive knowledge about the social preferences of users in the pre-specified target network, which will benefit the social link prediction task greatly. However, when transferring the knowledge from other aligned source networks to the target network, there usually exists a shift in information distribution between different networks, namely domain difference. In this paper, we study the social link prediction problem of the target network, which is aligned with multiple social networks concurrently. To accommodate the domain difference issue, we project the features extracted for links from different aligned networks into a shared lower-dimensional feature space. Moreover, users in social networks usually tend to form communities and would only connect to a small number of users. Thus, the target network structure has both the low-rank and sparse properties. We propose a novel optimization framework, SLAMPRED, to combine both these two properties aforementioned of the target network and the information of multiple aligned networks with nice domain adaptations. Since the objective function is a linear combination of convex and concave functions involving nondifferentiable regularizers, we propose a novel optimization method to iteratively solve it. Extensive experiments have been done on real-world aligned social networks, and the experimental results demonstrate the effectiveness of the proposed model.", "citation": "Citations (7)", "departments": ["University of Illinois at Chicago", "Yahoo!", "University of Illinois at Urbana–Champaign", "Search Technologies", "Tsinghua University"], "authors": ["Jiawei Zhang.....http://dblp.org/pers/hd/z/Zhang:Jiawei", "Jianhui Chen.....http://dblp.org/pers/hd/c/Chen:Jianhui", "Shi Zhi.....http://dblp.org/pers/hd/z/Zhi:Shi", "Yi Chang.....http://dblp.org/pers/hd/c/Chang:Yi", "Philip S. Yu.....http://dblp.org/pers/hd/y/Yu:Philip_S=", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "icde", "year": "2017", "pages": 12}