{"title": "UltraStereo: Efficient Learning-Based Matching for Active Stereo Systems.", "fields": ["structured light", "hyperplane", "discriminative model", "computer stereo vision", "stereo cameras"], "abstract": "Efficient estimation of depth from pairs of stereo images is one of the core problems in computer vision. We efficiently solve the specialized problem of stereo matching under active illumination using a new learning-based algorithm. This type of active stereo i.e. stereo matching where scene texture is augmented by an active light projector is proving compelling for designing depth cameras, largely due to improved robustness when compared to time of flight or traditional structured light techniques. Our algorithm uses an unsupervised greedy optimization scheme that learns features that are discriminative for estimating correspondences in infrared images. The proposed method optimizes a series of sparse hyperplanes that are used at test time to remap all the image patches into a compact binary representation in O(1). The proposed algorithm is cast in a PatchMatch Stereo-like framework, producing depth maps at 500Hz. In contrast to standard structured light methods, our approach generalizes to different scenes, does not require tedious per camera calibration procedures and is not adversely affected by interference from overlapping sensors. Extensive evaluations show we surpass the quality and overcome the limitations of current depth sensing technologies.", "citation": "Citations (4)", "year": "2017", "departments": ["Istituto Italiano di Tecnologia", "University of Oxford", "Microsoft", "Cornell University", "Microsoft"], "conf": "cvpr", "authors": ["Sean Ryan Fanello.....http://dblp.org/pers/hd/f/Fanello:Sean_Ryan", "Julien P. C. Valentin.....http://dblp.org/pers/hd/v/Valentin:Julien_P=_C=", "Christoph Rhemann.....http://dblp.org/pers/hd/r/Rhemann:Christoph", "Adarsh Kowdle.....http://dblp.org/pers/hd/k/Kowdle:Adarsh", "Vladimir Tankovich.....http://dblp.org/pers/hd/t/Tankovich:Vladimir", "Philip L. Davidson.....http://dblp.org/pers/hd/d/Davidson:Philip_L=", "Shahram Izadi.....http://dblp.org/pers/hd/i/Izadi:Shahram"], "pages": 10}