{"title": "MAGIK: An efficient key extraction mechanism based on dynamic geomagnetic field.", "fields": ["earth s magnetic field", "randomness", "key generation", "magik", "key"], "abstract": "Secret key establishment is a fundamental requirement for private communication between two wireless entities. An intriguing solution is to extract secret keys from the inherent randomness shared between them. Although several works have been done to extract secret keys from different kinds of mediums (e.g., RSSI, CSI, CIR), the efficiency and security problems are not fully solved. In this paper, we consider the problem of secret key establishment for wireless devices, and propose MAGIK, a secure and efficient scheme based on dynamic geoMAGnetic field in Indoor environment for Key establishment. We carefully study the feasibility of utilizing indoor geomagnetic field for key extraction through extensive measurements. Our results demonstrate that geomagnetic field has several dynamic properties, including space-varying, time-varying, sensitive to measurement device, and correlative between two observed points in proximity. We also optimize the key extraction process and present two rotation-angle-based quantification methods, which can achieve faster key generation rates and lower bit mismatching ratios. Besides, we build a prototype on commodity mobile devices, and evaluate its performance by conducting real-word experiments in indoor scenarios. The experiment results confirm that our system is efficient, in terms of key extraction rate, and robust in secret key establishment without requiring additional overhead on mobile devices.", "citation": "Not cited", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "authors": ["Fudong Qiu.....http://dblp.org/pers/hd/q/Qiu:Fudong", "Zhengxian He.....http://dblp.org/pers/hd/h/He:Zhengxian", "Linghe Kong.....http://dblp.org/pers/hd/k/Kong:Linghe", "Fan Wu.....http://dblp.org/pers/hd/w/Wu_0006:Fan"], "conf": "infocom", "year": "2017", "pages": 9}