{"title": "Accelerating Multi-Column Selection Predicates in Main-Memory - The Elf Approach.", "fields": ["full table scan", "exploit", "cache", "central processing unit", "simd"], "abstract": "Evaluating selection predicates is a data-intensive task that reduces intermediate results, which are the input for further operations. With analytical queries getting more and more complex, the number of evaluated selection predicates per query and table rises, too. This leads to numerous multicolumn selection predicates. Recent approaches to increase the performance of main-memory databases for selection-predicate evaluation aim at optimally exploiting the speed of the CPU by using accelerated scans. However, scanning each column one by one leaves tuning opportunities open that arise if all predicates are considered together. To this end, we introduce Elf, an index structure that is able to exploit the relation between several selection predicates. Elf features cache sensitivity, an optimized storage layout, fixed search paths, and slight data compression. In our evaluation, we compare its query performance to state-of the-art approaches and a sequential scan using SIMD capabilities. Our results indicate a clear superiority of our approach for multicolumn selection predicate queries with a low combined selectivity. For TPC-H queries with multi-column selection predicates, we achieve a speed-up between a factor of five and two orders of magnitude, mainly depending on the selectivity of the predicates.", "citation": "Citations (1)", "departments": ["Otto-von-Guericke University Magdeburg", "Otto-von-Guericke University Magdeburg", "Otto-von-Guericke University Magdeburg", "Otto-von-Guericke University Magdeburg"], "authors": ["David Broneske.....http://dblp.org/pers/hd/b/Broneske:David", "Veit Köppen.....http://dblp.org/pers/hd/k/K=ouml=ppen:Veit", "Gunter Saake.....http://dblp.org/pers/hd/s/Saake:Gunter", "Martin Schäler.....http://dblp.org/pers/hd/s/Sch=auml=ler:Martin"], "conf": "icde", "year": "2017", "pages": 12}