{"title": "NaviLight: Indoor localization and navigation under arbitrary lights.", "fields": ["dynamic time warping", "requirements engineering", "android", "light emitting diode", "telecommunications"], "abstract": "Thanks to the highly-dense lighting infrastructure in public areas, visible light emerges as a promising means to indoor localization and navigation. State-of-the-art techniques generally require customized hardware (sensing boards), and mainly work with one single light source (e.g., customized LEDs). This greatly limits their application scope. In this paper, we propose NaviLight, a generic indoor localization and navigation framework based on existing lighting infrastructure with any unmodified light sources (e.g., LED, fluorescent, and incandescent lights). NaviLight simply adopts commercial off-the-shelf mobile phones as receivers, and light intensity values as location signatures. Unlike existing WiFi systems, a single light intensity value is not discriminative enough over space though the light intensity field does vary, which makes our design more challenging. We thus propose a LightPrint as a location signature using a vector of multiple light intensity values obtained during user's walks. Such LightPrints are created by leveraging any user movement (of varying distance and direction) in order to minimize user efforts. A set of techniques are proposed to achieve quick LightPrint matching, which includes a coarse-grained classification and a fine-grained matching over dynamic time warping. We have implemented NaviLight to provide real-time service on Android phones in three typical indoor environments, covering a total area size over 1000m 2 . Our experiments show that NaviLight can achieve sub-meter localization accuracy to meet practical engineering requirements.", "citation": "Citations (2)", "departments": ["Tianjin University", "Tianjin University", "Ohio State University", "Ohio State University", "Tianjin University"], "authors": ["Zenghua Zhao.....http://dblp.org/pers/hd/z/Zhao:Zenghua", "Jiankun Wang.....http://dblp.org/pers/hd/w/Wang:Jiankun", "Xingya Zhao.....http://dblp.org/pers/hd/z/Zhao:Xingya", "Chunyi Peng.....http://dblp.org/pers/hd/p/Peng:Chunyi", "Qian Guo.....http://dblp.org/pers/hd/g/Guo:Qian", "Bin Wu.....http://dblp.org/pers/hd/w/Wu_0001:Bin"], "conf": "infocom", "year": "2017", "pages": 9}