{"title": "ElasticPlay: Interactive Video Summarization with Dynamic Time Budgets.", "fields": ["interactive video", "multi document summarization", "automatic summarization", "software deployment", "limiting"], "abstract": "Video consumption is being shifted from sit-and-watch to selective skimming. Existing video player interfaces, however, only provide indirect manipulation to support this emerging behavior. Video summarization alleviates this issue to some extent, shortening a video based on the desired length of a summary as an input variable. But an optimal length of a summarized video is often not available in advance. Moreover, the user cannot edit the summary once it is produced, limiting its practical applications. We argue that video summarization should be an interactive, mixed-initiative process in which users have control over the summarization procedure while algorithms help users achieve their goal via video understanding. In this paper, we introduce ElasticPlay, a mixed-initiative approach that combines an advanced video summarization technique with  direct  interface manipulation to help users control the video summarization process. Users can specify a time budget for the remaining content while watching a video; our system then immediately updates the playback plan using our proposed cut-and-forward algorithm, determining which parts to skip or to fast-forward. This interactive process allows users to fine-tune the summarization result with immediate feedback. We show that our system outperforms existing video summarization techniques on the TVSum50 dataset. We also report two lab studies (22 participants) and a Mechanical Turk deployment study (60 participants), and show that the participants responded favorably to ElasticPlay.", "citation": "Not cited", "departments": ["Carnegie Mellon University", "Yahoo!", "University of Tokyo"], "authors": ["Haojian Jin.....http://dblp.org/pers/hd/j/Jin:Haojian", "Yale Song.....http://dblp.org/pers/hd/s/Song:Yale", "Koji Yatani.....http://dblp.org/pers/hd/y/Yatani:Koji"], "conf": "mm", "year": "2017", "pages": 9}