{"title": "Is Foveated Rendering Perceivable in Virtual Reality?: Exploring the Efficiency and Consistency of Quality Assessment Methods.", "fields": ["quality of experience", "foveal", "rendering", "video quality", "peripheral vision"], "abstract": "Foveated rendering leverages human visual system to increase video quality under limited computing resources for Virtual Reality (VR). More specifically, it increases the frame rate and the video quality of the foveal vision via lowering the resolution of the peripheral vision. Optimizing foveated rendering systems is, however, not an easy task, because there are numerous parameters that need to be carefully chosen, such as the number of layers, the eccentricity degrees, and the resolution of the peripheral region. Furthermore, there is no standard and efficient way to evaluate the Quality of Experiment (QoE) of foveated rendering systems. In this paper, we propose a framework to compare the performance of different subjective assessment methods on foveated rendering systems. We consider two performance metrics:  efficiency  and  consistency , using the  perceptual ratio , which is the probability of the foveated rendering is perceivable by users. A regression model is proposed to model the relationship between the human perceived quality and foveated rendering parameters. Our comprehensive study and analysis reveal several insights: 1) there is no absolute superior subjective assessment method, 2) subjects need to make more observations to confirm the foveated rendering is imperceptible than perceptible, 3) subjects barely notice the foveated rendering with an eccentricity degree of 7.5 degrees+ and peripheral region of a resolution of 540p+, and 4) QoE levels are highly dependent on the individuals and scenes. Our findings are crucial for optimizing the foveated rendering systems for future VR applications.", "citation": "Citations (2)", "departments": ["National Taiwan University", "National Taiwan University", "National Tsing Hua University", "National Chiao Tung University", "National Taiwan University"], "authors": ["Chih-Fan Hsu.....http://dblp.org/pers/hd/h/Hsu:Chih=Fan", "Anthony Chen.....http://dblp.org/pers/hd/c/Chen:Anthony", "Cheng-Hsin Hsu.....http://dblp.org/pers/hd/h/Hsu:Cheng=Hsin", "Chun-Ying Huang.....http://dblp.org/pers/hd/h/Huang:Chun=Ying", "Chin-Laung Lei.....http://dblp.org/pers/hd/l/Lei:Chin=Laung", "Kuan-Ta Chen.....http://dblp.org/pers/hd/c/Chen:Kuan=Ta"], "conf": "mm", "year": "2017", "pages": 9}