{"title": "Multipath TCP for datacenters: From energy efficiency perspective.", "fields": ["server", "transport layer", "network congestion", "multipath tcp", "cpu power dissipation"], "abstract": "Nearly 50% of the energy overhead in today's datacenters comes from host-to-host data transfers, which largely depend on the transport layer performance. Multipath TCP (MPTCP) has recently been suggested as a promising transport protocol to improve datacenter network throughput, yet it also increases the host CPU power consumption. It remains unclear whether datacenters can indeed benefit from using MPTCP from the perspective of energy efficiency. By analyzing the performance of MPTCP, we show that (1) despite consuming higher host CPU power than TCP, MPTCP can largely reduce the long flow completion time and thus save the aggregated energy; (2) link-sharing subflows in MPTCP not only has negative impact on both throughput-sensitive long flows and latency-sensitive short flows, but also noticeably increases the host CPU power, especially for short flows. We present MPTCP-D, an energy-efficient variant of multipath TCP for datacenters. MPTCP-D incorporates a novel congestion control algorithm that can provide energy efficiency by minimizing the flow completion time, and an extra subflow elimination mechanism that can preclude link-sharing subflows from increasing the host CPU power. We implement MPTCP-D in the Linux kernel and study its performance by experiments on Amazon EC2. Our results show that, without degrading the performance of the long flow throughput and short flow completion time, MPTCP-D reduces the long flow energy consumption by up to 72% compared to DCTCP for data transfers, and reduces the short flow power consumption by up to 46% compared to MPTCP with linksharing subflows.", "citation": "Citations (1)", "departments": ["Simon Fraser University", "Simon Fraser University", "University of Minnesota", "Simon Fraser University"], "authors": ["Jia Zhao.....http://dblp.org/pers/hd/z/Zhao:Jia", "Jiangchuan Liu.....http://dblp.org/pers/hd/l/Liu:Jiangchuan", "Haiyang Wang.....http://dblp.org/pers/hd/w/Wang:Haiyang", "Chi Xu.....http://dblp.org/pers/hd/x/Xu:Chi"], "conf": "infocom", "year": "2017", "pages": 9}