{"title": "DIAS: Differentially Private Interactive Algorithm Selection using Pythia.", "fields": ["weighted majority algorithm", "grasp", "algorithm selection", "limiting", "differential privacy"], "abstract": "Differential privacy has emerged as the dominant privacy standard for data analysis. Its wide acceptance has led to significant development of algorithms that meet this rigorous standard. For some tasks, such as the task of answering low dimensional counting queries, dozens of algorithms have been proposed. However, no single algorithm has emerged as the dominant performer, and in fact, algorithm performance varies drastically across inputs. Thus, it's not clear how to select an algorithm for a particular task, and choosing the wrong algorithm might lead to significant degradation in terms of analysis accuracy. We believe that the difficulty of algorithm selection is one factor limiting the adoption of differential privacy in real systems. In this demonstration we present DIAS (Differentially-private Interactive Algorithm Selection), an educational privacy game. Users are asked to perform algorithm selection for a variety of inputs and compare the performance of their choices against that of Pythia, an automated algorithm selection framework. Our hope is that by the end of the game users will understand the importance of algorithm selection and most importantly will have a good grasp on how to use differentially private algorithms for their own applications.", "citation": "Not cited", "year": "2017", "departments": ["Duke University", "Colgate University", "Duke University", "University of Massachusetts Amherst", "Colgate University"], "conf": "sigmod", "authors": ["Ios Kotsogiannis.....http://dblp.org/pers/hd/k/Kotsogiannis:Ios", "Michael Hay.....http://dblp.org/pers/hd/h/Hay:Michael", "Ashwin Machanavajjhala.....http://dblp.org/pers/hd/m/Machanavajjhala:Ashwin", "Gerome Miklau.....http://dblp.org/pers/hd/m/Miklau:Gerome", "Margaret Orr.....http://dblp.org/pers/hd/o/Orr:Margaret"], "pages": 4}