{"title": "Parallel Implementations of Masking Schemes and the Bounded Moment Leakage Model.", "fields": ["computer security model", "implementation", "bounded function", "masking", "multiplication algorithm", "leakage", "theoretical computer science"], "abstract": "In this paper, we provide a necessary clarification of the good security properties that can be obtained from parallel implementations of masking schemes. For this purpose, we first argue that (i) the probing model is not straightforward to interpret, since it more naturally captures the intuitions of serial implementations, and (ii) the noisy leakage model is not always convenient, e.g. when combined with formal methods for the verification of cryptographic implementations. Therefore we introduce a new model, the bounded moment model, that formalizes a weaker notion of security order frequently used in the side-channel literature. Interestingly, we prove that probing security for a serial implementation implies bounded moment security for its parallel counterpart. This result therefore enables an accurate understanding of the links between formal security analyses of masking schemes and experimental security evaluations based on the estimation of statistical moments. Besides its consolidating nature, our work also brings useful technical contributions. First, we describe and analyze refreshing and multiplication algorithms that are well suited for parallel implementations and improve security against multivariate side-channel attacks. Second, we show that simple refreshing algorithms (with linear complexity) that are not secure in the continuous probing model are secure in the continuous bounded moment model. Eventually, we discuss the independent leakage assumption required for masking to deliver its security promises, and its specificities related to the serial or parallel nature of an implementation.", "citation": "Not cited", "year": "2017", "departments": ["IMDEA", "University of Surrey", "Ruhr University Bochum", "French Institute for Research in Computer Science and Automation", "Université catholique de Louvain"], "conf": "eurocrypt", "authors": ["Gilles Barthe.....http://dblp.org/pers/hd/b/Barthe:Gilles", "François Dupressoir.....http://dblp.org/pers/hd/d/Dupressoir:Fran=ccedil=ois", "Sebastian Faust.....http://dblp.org/pers/hd/f/Faust:Sebastian", "Benjamin Grégoire.....http://dblp.org/pers/hd/g/Gr=eacute=goire:Benjamin", "François-Xavier Standaert.....http://dblp.org/pers/hd/s/Standaert:Fran=ccedil=ois=Xavier", "Pierre-Yves Strub.....http://dblp.org/pers/hd/s/Strub:Pierre=Yves"], "pages": 32}