{"title": "OpTile: Toward Optimal Tiling in 360-degree Video Streaming.", "fields": ["download", "uniform tiling", "streaming algorithm", "viewport", "encoder"], "abstract": "360-degree videos are encoded for adaptive streaming by first projecting the spherical surface onto two-dimensional frames, then encoding these as standard video segments. During playback of these 360-degree videos, the video player renders the portion of the spherical surface in the direction of the user's view. These user viewports typically cover only a small portion of the 360 degree surface, causing much of the downloaded bandwidth to be wasted. Tile-based approaches can reduce the wasted bandwidth by cutting video spatially into motion-constrained rectangles. Streaming logic then only needs to download the tiles necessary to render the viewport seen by the user. Existing tile-based approaches cut 360-degree videos into tiles of fixed sizes. These fixed-size tiling approaches, however, suffer from reduced encoding efficiency. Tiling cuts away portions of the video that can be copied by the encoder from adjacent frames or within the current frame that are needed for effective video compression.   In this paper, we propose a scheme called OpTile. This scheme tiles a projected 360-degree segment by first estimating per-tile storage costs, then solving an integer linear program (ILP) to obtain an optimal, potentially non-uniform tiling. The ILP objective considers both content-specific characteristics and empirical distributions over user views of the segments. Using a randomly selected training/testing set split, we show that if a streaming algorithm can perfectly predict the user head orientation, our proposed scheme can save up to 73% of downloaded data compared to the non-tiling scheme and up to 44% compared to the best-performing uniform tiling methods.", "citation": "Citations (3)", "departments": ["George Mason University", "Binghamton University", "Binghamton University", "George Mason University"], "authors": ["Mengbai Xiao.....http://dblp.org/pers/hd/x/Xiao:Mengbai", "Chao Zhou.....http://dblp.org/pers/hd/z/Zhou:Chao", "Yao Liu.....http://dblp.org/pers/hd/l/Liu_0001:Yao", "Songqing Chen.....http://dblp.org/pers/hd/c/Chen:Songqing"], "conf": "mm", "year": "2017", "pages": 9}