{"title": "Towards instantaneous collision and interference detection using in-band full duplex.", "fields": ["duplex", "network packet", "transmitter", "co channel interference", "latency"], "abstract": "Wireless devices are ubiquitous nowadays and, since most of them use the same unlicensed frequency bands, the high number of packet losses due to interference and collisions degrade performance. Reliability, energy consumption, and latency are key challenges for future dense networks. Allowing the transmitter to take action, i.e., vacating the channel, as soon as a collision or interference is detected is crucial in improving these metrics. In-band full duplex radios enable the transmitter to simultaneously transmit packets and sense the spectrum for collisions and interference. This paper studies two important questions regarding transmitter-based collision and interference detection: (1) from an overall system perspective, does such detection outperform receiver-based detection and (2) which test statistic is the most accurate and sensitive at detecting collisions and interference. First, NS-3 simulations are used to show that transmitter-based detection reduces the energy consumption while improving the throughput in a typical star topology network. Next, we present a measurement-based study of four different techniques for transmitter-based collision and interference detection. In particular, we compare the energy detector with three goodness-of-fit tests in terms of probability of detection and false alarm. Our analysis shows that transmitter-based detection can detect between 80% to 100% of the collisions and interference occurring at the receiver, depending on the distance between the transmitter and the receiver. Of those detectable by the transmitter, our measurement results show that goodness-of-fit tests can detect nearly 100% of the collisions and have at least 10 dB better sensitivity as compared to the commonly proposed energy detection test. In general, the proposed techniques can detect interfering signals that are up to 25 dB below the remaining self-interference power.", "citation": "Citations (1)", "departments": ["Katholieke Universiteit Leuven", "University of California, Los Angeles", "University of California, Los Angeles", "University of California, Los Angeles", "Katholieke Universiteit Leuven"], "authors": ["Tom Vermeulen.....http://dblp.org/pers/hd/v/Vermeulen:Tom", "Mihir Laghate.....http://dblp.org/pers/hd/l/Laghate:Mihir", "Ghaith Hattab.....http://dblp.org/pers/hd/h/Hattab:Ghaith", "Danijela Cabric.....http://dblp.org/pers/hd/c/Cabric:Danijela", "Sofie Pollin.....http://dblp.org/pers/hd/p/Pollin:Sofie"], "conf": "infocom", "year": "2017", "pages": 9}