{"title": "Predicting the Resilience of Obfuscated Code Against Symbolic Execution Attacks via Machine Learning.", "fields": ["code", "obfuscation", "cyclomatic complexity", "symbolic execution"], "abstract": "Software obfuscation transforms code such that it is more\ndifficult to reverse engineer. However, it is known that\ngiven enough resources, an attacker will successfully reverse\nengineer an obfuscated program. Therefore, an\nopen challenge for software obfuscation is estimating the\ntime an obfuscated program is able to withstand a given\nreverse engineering attack. This paper proposes a general\nframework for choosing the most relevant software\nfeatures to estimate the effort of automated attacks. Our\nframework uses these software features to build regression\nmodels that can predict the resilience of different\nsoftware protection transformations against automated\nattacks. To evaluate the effectiveness of our approach,\nwe instantiate it in a case-study about predicting the time\nneeded to deobfuscate a set of C programs, using an attack\nbased on symbolic execution. To train regression\nmodels our system requires a large set of programs as\ninput. We have therefore implemented a code generator\nthat can generate large numbers of arbitrarily complex\nrandom C functions. Our results show that features\nsuch as the number of community structures in the graphrepresentation\nof symbolic path-constraints, are far more\nrelevant for predicting deobfuscation time than other features\ngenerally used to measure the potency of controlflow\nobfuscation (e.g. cyclomatic complexity). Our best\nmodel is able to predict the number of seconds of symbolic\nexecution-based deobfuscation attacks with over\n90% accuracy for 80% of the programs in our dataset,\nwhich also includes several realistic hash functions.", "citation": "Citations (2)", "year": "2017", "departments": ["Technische Universität München", "University of Arizona", "Technische Universität München"], "conf": "uss", "authors": ["Sebastian Banescu.....http://dblp.org/pers/hd/b/Banescu:Sebastian", "Christian S. Collberg.....http://dblp.org/pers/hd/c/Collberg:Christian_S=", "Alexander Pretschner.....http://dblp.org/pers/hd/p/Pretschner:Alexander"], "pages": 18}