{"title": "Measuring the cost of regression testing in practice: a study of Java projects using continuous integration.", "fields": ["oracle", "test case", "test suite", "regression testing", "system under test"], "abstract": "Software defects cost time and money to diagnose and fix. Consequently, developers use a variety of techniques to avoid introducing defects into their systems. However, these techniques have costs of their own; the benefit of using a technique must outweigh the cost of applying it.   In this paper we investigate the costs and benefits of automated regression testing in practice. Specifically, we studied 61 projects that use Travis CI, a cloud-based continuous integration tool, in order to examine real test failures that were encountered by the developers of those projects. We determined how the developers resolved the failures they encountered and used this information to classify the failures as being caused by a flaky test, by a bug in the system under test, or by a broken or obsolete test. We consider that test failures caused by bugs represent a benefit of the test suite, while failures caused by broken or obsolete tests represent a test suite maintenance cost.   We found that 18% of test suite executions fail and that 13% of these failures are flaky. Of the non-flaky failures, only 74% were caused by a bug in the system under test; the remaining 26% were due to incorrect or obsolete tests. In addition, we found that, in the failed builds, only 0.38% of the test case executions failed and 64% of failed builds contained more than one failed test.   Our findings contribute to a wider understanding of the unforeseen costs that can impact the overall cost effectiveness of regression testing in practice. They can also inform research into test case selection techniques, as we have provided an approximate empirical bound on the practical value that could be extracted from such techniques. This value appears to be large, as the 61 systems under study contained nearly 3 million lines of test code and yet over 99% of test case executions could have been eliminated with a perfect oracle.", "citation": "Citations (4)", "departments": ["University of Waterloo", "University of Waterloo", "University of British Columbia"], "authors": ["Adriaan Labuschagne.....http://dblp.org/pers/hd/l/Labuschagne:Adriaan", "Laura Inozemtseva.....http://dblp.org/pers/hd/i/Inozemtseva:Laura", "Reid Holmes.....http://dblp.org/pers/hd/h/Holmes:Reid"], "conf": "sigsoft", "year": "2017", "pages": 10}