{"title": "NeuroStylist: Neural Compatibility Modeling for Clothing Matching.", "fields": ["ranking", "business process reengineering", "clothing", "metadata", "modalities"], "abstract": "Nowadays, as a beauty-enhancing product, clothing plays an important role in human's social life. In fact, the key to a proper outfit usually lies in the harmonious clothing matching. Nevertheless, not everyone is good at clothing matching. Fortunately, with the proliferation of fashion-oriented online communities, fashion experts can publicly share their fashion tips by showcasing their outfit compositions, where each fashion item (e.g., a top or bottom) usually has an image and context metadata (e.g., title and category). Such rich fashion data offer us a new opportunity to investigate the code in clothing matching. However, challenges co-exist with opportunities. The first challenge lies in the complicated factors, such as color, material and shape, that affect the compatibility of fashion items. Second, as each fashion item involves multiple modalities (i.e., image and text), how to cope with the heterogeneous multi-modal data also poses a great challenge. Third, our pilot study shows that the composition relation between fashion items is rather sparse, which makes traditional matrix factorization methods not applicable. Towards this end, in this work, we propose a content-based neural scheme to model the compatibility between fashion items based on the Bayesian personalized ranking (BPR) framework. The scheme is able to jointly model the coherent relation between modalities of items and their implicit matching preference. Experiments verify the effectiveness of our scheme, and we deliver deep insights that can benefit future research.", "citation": "Citations (8)", "departments": ["Shandong University", "National University of Singapore", "Shandong University", "Shandong University", "Shandong University"], "authors": ["Xuemeng Song.....http://dblp.org/pers/hd/s/Song:Xuemeng", "Fuli Feng.....http://dblp.org/pers/hd/f/Feng:Fuli", "Jinhuan Liu.....http://dblp.org/pers/hd/l/Liu:Jinhuan", "Zekun Li.....http://dblp.org/pers/hd/l/Li:Zekun", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Jun Ma.....http://dblp.org/pers/hd/m/Ma:Jun"], "conf": "mm", "year": "2017", "pages": 9}