{"title": "Performance modeling under resource constraints using deep transfer learning.", "fields": ["deep learning", "performance prediction", "generalization error", "transfer of learning", "statistical inference"], "abstract": "Tuning application parameters for optimal performance is a challenging combinatorial problem. Hence, techniques for modeling the functional relationships between various input features in the parameter space and application performance are important. We show that simple statistical inference techniques are inadequate to capture these relationships. Even with more complex ensembles of models, the minimum coverage of the parameter space required via experimental observations is still quite large. We propose a deep learning based approach that can combine information from exhaustive observations collected at a smaller scale with limited observations collected at a larger target scale. The proposed approach is able to accurately predict performance in the regimes of interest to performance analysts while outperforming many traditional techniques. In particular, our approach can identify the best performing configurations even when trained using as few as 1% of observations at the target scale.", "citation": "Citations (3)", "year": "2017", "departments": ["Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory", "Lawrence Livermore National Laboratory"], "conf": "sc", "authors": ["Aniruddha Marathe.....http://dblp.org/pers/hd/m/Marathe:Aniruddha", "Rushil Anirudh.....http://dblp.org/pers/hd/a/Anirudh:Rushil", "Nikhil Jain.....http://dblp.org/pers/hd/j/Jain:Nikhil", "Abhinav Bhatele.....http://dblp.org/pers/hd/b/Bhatele:Abhinav", "Jayaraman J. Thiagarajan.....http://dblp.org/pers/hd/t/Thiagarajan:Jayaraman_J=", "Bhavya Kailkhura.....http://dblp.org/pers/hd/k/Kailkhura:Bhavya", "Jae-Seung Yeom.....http://dblp.org/pers/hd/y/Yeom:Jae=Seung", "Barry Rountree.....http://dblp.org/pers/hd/r/Rountree:Barry", "Todd Gamblin.....http://dblp.org/pers/hd/g/Gamblin:Todd"], "pages": 12}