{"title": "Evaluation of a penalty and a constraint-based haptic rendering algorithm with different haptic interfaces and stiffness values.", "fields": ["haptic technology", "rendering", "stereotaxy", "workload", "usability"], "abstract": "This work presents an evaluation study in which the effects of a penalty-based and a constraint-based haptic rendering algorithm on the user performance and perception are analyzed. A total of N = 24 participants performed in a within-design study three variations of peg-in-hole tasks in a virtual environment after trials in an identically replicated real scenario as a reference. In addition to the two mentioned haptic rendering paradigms, two haptic devices were used, the HUG and a Sigma.7, and the force stiffness was also varied with maximum and half values possible for each device. Both objective (time and trajectory, collision performance, and muscular effort) and subjective ratings (contact perception, ergonomy, and workload) were recorded and statistically analyzed. The results show that the constraint-based haptic rendering algorithm with a lower stiffness than the maximum possible yields the most realistic contact perception, while keeping the visual inter-penetration between the objects roughly at around 15% of that caused by penalty-based algorithm (i.e., non perceptible in many cases). This result is even more evident with the HUG, the haptic device with the highest force display capabilities, although user ratings point to the Sigma.7 as the device with highest usability and lowest workload indicators. Altogether, the paper provides qualitative and quantitative guidelines for mapping properties of haptic algorithms and devices to user performance and perception.", "citation": "Citations (1)", "departments": ["German Aerospace Center", "German Aerospace Center"], "authors": ["Mikel Sagardia.....http://dblp.org/pers/hd/s/Sagardia:Mikel", "Thomas Hulin.....http://dblp.org/pers/hd/h/Hulin:Thomas"], "conf": "vr", "year": "2017", "pages": 10}