{"title": "Distance Oracle on Terrain Surface.", "fields": ["oracle", "compact space", "order of magnitude", "range query", "spatial database"], "abstract": "Due to the advance of the geo-spatial positioning and the computer graphics technology, digital terrain data become more and more popular nowadays. Query processing on terrain data has attracted considerable attention from both the academic community and the industry community. One fundamental and important query is the shortest distance query and many other applications such as proximity queries (including nearest neighbor queries and range queries), 3D object feature vector construction and 3D object data mining are built based on the result of the shortest distance query. In this paper, we study the shortest distance query which is to find the shortest distance between a point-of-interest and another point-of-interest on the surface of the terrain due to a variety of applications. As observed by existing studies, computing the exact shortest distance is very expensive. Some existing studies proposed e-approximate distance oracles where e is a non-negative real number and is an error parameter. However, the best-known algorithm has a large oracle construction time, a large oracle size and a large distance query time. Motivated by this, we propose a novel e-approximate distance oracle called the  Space Efficient distance oracle (SE)  which has a small oracle construction time, a small oracle size and a small distance query time due to its compactness storing concise information about pairwise distances between any two points-of-interest. Our experimental results show that the oracle construction time, the oracle size and the distance query time of  SE  are up to two orders of magnitude, up to 3 orders of magnitude and up to 5 orders of magnitude faster than the best-known algorithm.", "citation": "Not cited", "year": "2017", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "Queen's University Belfast", "University of Maryland, College Park"], "conf": "sigmod", "authors": ["Victor Junqiu Wei.....http://dblp.org/pers/hd/w/Wei:Victor_Junqiu", "Raymond Chi-Wing Wong.....http://dblp.org/pers/hd/w/Wong:Raymond_Chi=Wing", "Cheng Long.....http://dblp.org/pers/hd/l/Long:Cheng", "David M. Mount.....http://dblp.org/pers/hd/m/Mount:David_M="], "pages": 16}