{"title": "Deep Unsupervised Convolutional Domain Adaptation.", "fields": ["deep learning", "domain adaptation", "machine learning", "source data", "knowledge transfer"], "abstract": "In multimedia analysis, the task of domain adaptation is to adapt the feature representation learned in the source domain with rich label information to the target domain with less or even no label information. Significant research endeavors have been devoted to aligning the feature distributions between the source and the target domains in the top fully connected layers based on unsupervised DNN-based models. However, the domain adaptation has been arbitrarily constrained near the output ends of the DNN models, which thus brings about inadequate knowledge transfer in DNN-based domain adaptation process, especially near the input end. We develop an attention transfer process for convolutional domain adaptation. The domain discrepancy, measured in correlation alignment loss, is minimized on the  second-order correlation statistics  of the attention maps for both source and target domains. Then we propose Deep Unsupervised Convolutional Domain Adaptation DUCDA method, which jointly minimizes the supervised classification loss of labeled source data and the unsupervised correlation alignment loss measured on both convolutional layers and fully connected layers. The multi-layer domain adaptation process collaborately reinforces each individual domain adaptation component, and significantly enhances the generalization ability of the CNN models. Extensive cross-domain object classification experiments show DUCDA outperforms other state-of-the-art approaches, and validate the promising power of DUCDA towards large scale real world application.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Harbin Institute of Technology", "Chinese Academy of Sciences"], "authors": ["Junbao Zhuo.....http://dblp.org/pers/hd/z/Zhuo:Junbao", "Shuhui Wang.....http://dblp.org/pers/hd/w/Wang:Shuhui", "Weigang Zhang.....http://dblp.org/pers/hd/z/Zhang:Weigang", "Qingming Huang.....http://dblp.org/pers/hd/h/Huang:Qingming"], "conf": "mm", "year": "2017", "pages": 9}