{"title": "Record and replay for Android: are we there yet in industrial cases?", "fields": ["touchscreen", "expressivity", "graphical user interface testing", "strengths and weaknesses", "popularity"], "abstract": "Mobile applications, or apps for short, are gaining popularity. The input sources (e.g., touchscreen, sensors, transmitters) of the smart devices that host these apps enable the apps to offer a rich experience to the users, but these input sources pose testing complications to the developers (e.g., writing tests to accurately utilize multiple input sources together and be able to replay such tests at a later time). To alleviate these complications, researchers and practitioners in recent years have developed a variety of record-and-replay tools to support the testing expressiveness of smart devices. These tools allow developers to easily record and automate the replay of complicated usage scenarios of their app. Due to Android's large share of the smart-device market, numerous record-and-replay tools have been developed using a variety of techniques to test Android apps. To better understand the strengths and weaknesses of these tools, we present a comparison of popular record-and-replay tools from researchers and practitioners, by applying these tools to test three popular industrial apps downloaded from the Google Play store. Our comparison is based on three main metrics: (1) ability to reproduce common usage scenarios, (2) space overhead of traces created by the tools, and (3) robustness of traces created by the tools (when being replayed on devices with different resolutions). The results from our comparison show which record-and-replay tools may be the best for developers and identify future directions for improving these tools to better address testing complications of smart devices.", "citation": "Citations (2)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Tencent"], "authors": ["Wing Lam.....http://dblp.org/pers/hd/l/Lam:Wing", "Zhengkai Wu.....http://dblp.org/pers/hd/w/Wu:Zhengkai", "Dengfeng Li.....http://dblp.org/pers/hd/l/Li:Dengfeng", "Wenyu Wang.....http://dblp.org/pers/hd/w/Wang:Wenyu", "Haibing Zheng.....http://dblp.org/pers/hd/z/Zheng:Haibing", "Hui Luo.....http://dblp.org/pers/hd/l/Luo:Hui", "Peng Yan.....http://dblp.org/pers/hd/y/Yan:Peng", "Yuetang Deng.....http://dblp.org/pers/hd/d/Deng:Yuetang", "Tao Xie.....http://dblp.org/pers/hd/x/Xie:Tao"], "conf": "sigsoft", "year": "2017", "pages": 6}