{"title": "TrioVecEvent: Embedding-Based Online Local Event Detection in Geo-Tagged Tweet Streams.", "fields": ["crowdsourcing", "discriminative model", "feature learning", "ranging", "topic model"], "abstract": "Detecting local events ( e.g. , protest, disaster) at their onsets is an important task for a wide spectrum of applications, ranging from disaster control to crime monitoring and place recommendation. Recent years have witnessed growing interest in leveraging geo-tagged tweet streams for online local event detection. Nevertheless, the accuracies of existing methods still remain unsatisfactory for building reliable local event detection systems. We propose TrioVecEvent, a method that leverages multimodal embeddings to achieve  accurate  online local event detection. The effectiveness of TrioVecEvent is underpinned by its two-step detection scheme. First, it ensures a high coverage of the underlying local events by dividing the tweets in the query window into coherent geo-topic clusters. To generate quality geo-topic clusters, we capture short-text semantics by learning multimodal embeddings of the location, time, and text, and then perform online clustering with a novel Bayesian mixture model. Second, TrioVecEvent considers the geo-topic clusters as candidate events and extracts a set of features for classifying the candidates. Leveraging the multimodal embeddings as background knowledge, we introduce discriminative features that can well characterize local events, which enables pinpointing true local events from the candidate pool with a small amount of training data. We have used crowdsourcing to evaluate TrioVecEvent, and found that it improves the performance of the state-of-the-art method by a large margin.", "citation": "Citations (8)", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign"], "authors": ["Chao Zhang.....http://dblp.org/pers/hd/z/Zhang:Chao", "Liyuan Liu.....http://dblp.org/pers/hd/l/Liu:Liyuan", "Dongming Lei.....http://dblp.org/pers/hd/l/Lei:Dongming", "Quan Yuan.....http://dblp.org/pers/hd/y/Yuan_0001:Quan", "Honglei Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Honglei", "Tim Hanratty.....http://dblp.org/pers/hd/h/Hanratty:Tim", "Jiawei Han.....http://dblp.org/pers/hd/h/Han_0001:Jiawei"], "conf": "kdd", "year": "2017", "pages": 10}