{"title": "Identify Susceptible Locations in Medical Records via Adversarial Attacks on Deep Predictive Models.", "fields": ["deep learning", "cohort", "medical record", "leverage", "health informatics"], "abstract": "The surging availability of electronic medical records (EHR) leads to increased research interests in medical predictive modeling. Recently many deep learning based predicted models are also developed for EHR data and demonstrated impressive performance. However, a series of recent studies showed that these deep models are not safe: they suffer from certain vulnerabilities. In short, a well-trained deep network can be extremely sensitive to inputs with negligible changes. These inputs are referred to as adversarial examples. In the context of medical informatics, such attacks could alter the result of a high performance deep predictive model by slightly perturbing a patient's medical records. Such instability not only reflects the weakness of deep architectures, more importantly, it offers a guide on detecting susceptible parts on the inputs. In this paper, we propose an efficient and effective framework that learns a time-preferential minimum attack targeting the LSTM model with EHR inputs, and we leverage this attack strategy to screen medical records of patients and identify susceptible events and measurements. The efficient screening procedure can assist decision makers to pay extra attentions to the locations that can cause severe consequence if not measured correctly. We conduct extensive empirical studies on a real-world urgent care cohort and demonstrate the effectiveness of the proposed screening.", "citation": "Citations (1)", "departments": ["Michigan State University", "Michigan State University", "Cornell University", "Michigan State University", "JD AI Research, Beijing, China"], "authors": ["Mengying Sun.....http://dblp.org/pers/hd/s/Sun:Mengying", "Fengyi Tang.....http://dblp.org/pers/hd/t/Tang:Fengyi", "Jinfeng Yi.....http://dblp.org/pers/hd/y/Yi:Jinfeng", "Fei Wang.....http://dblp.org/pers/hd/w/Wang:Fei", "Jiayu Zhou.....http://dblp.org/pers/hd/z/Zhou:Jiayu"], "conf": "kdd", "year": "2018", "pages": 9}