{"title": "ClDiff: generating concise linked code differences.", "fields": ["abstract syntax", "program comprehension", "code", "software maintenance", "code review"], "abstract": "Analyzing and understanding source code changes is important in a variety of software maintenance tasks. To this end, many code differencing and code change summarization methods have been proposed. For some tasks (e.g. code review and software merging), however, those differencing methods generate too fine-grained a representation of code changes, and those summarization methods generate too coarse-grained a representation of code changes. Moreover, they do not consider the relationships among code changes. Therefore, the generated differences or summaries make it not easy to analyze and understand code changes in some software maintenance tasks.     In this paper, we propose a code differencing approach, named CLDIFF, to generate concise linked code differences whose granularity is in between the existing code differencing and code change summarization methods. The goal of CLDIFF is to generate more easily understandable code differences. CLDIFF takes source code files before and after changes as inputs, and consists of three steps. First, it pre-processes the source code files by pruning unchanged declara- tions from the parsed abstract syntax trees. Second, it generates concise code differences by grouping fine-grained code differences at or above the statement level and describing high-level changes in each group. Third, it links the related concise code differences according to five pre-defined links. Experiments with 12 Java projects (74,387 commits) and a human study with 10 participants have indicated the accuracy, conciseness, performance and usefulness of CLDIFF.", "citation": "Not cited", "departments": ["Fudan University", "Fudan University", "Fudan University", "Fudan University", "Fudan University"], "authors": ["Kaifeng Huang.....http://dblp.org/pers/hd/h/Huang:Kaifeng", "Bihuan Chen.....http://dblp.org/pers/hd/c/Chen:Bihuan", "Xin Peng.....http://dblp.org/pers/hd/p/Peng:Xin", "Daihong Zhou.....http://dblp.org/pers/hd/z/Zhou:Daihong", "Ying Wang.....http://dblp.org/pers/hd/w/Wang:Ying", "Yang Liu.....http://dblp.org/pers/hd/l/Liu:Yang", "Wenyun Zhao.....http://dblp.org/pers/hd/z/Zhao:Wenyun"], "conf": "kbse", "year": "2018", "pages": 12}