{"title": "Certified concurrent abstraction layers.", "fields": ["semantic data model", "abstraction", "multi core processor", "thread", "abstraction layer"], "abstract": "Concurrent abstraction layers are ubiquitous in modern computer systems because of the pervasiveness of multithreaded programming and multicore hardware. Abstraction layers are used to hide the implementation details (e.g., fine-grained synchronization) and reduce the complex dependencies among components at different levels of abstraction. Despite their obvious importance, concurrent abstraction layers have not been treated formally. This severely limits the applicability of layer-based techniques and makes it difficult to scale verification across multiple concurrent layers.     In this paper, we present CCAL---a fully mechanized programming toolkit developed under the CertiKOS project---for specifying, composing, compiling, and linking certified concurrent abstraction layers. CCAL consists of three technical novelties: a new game-theoretical, strategy-based compositional semantic model for concurrency (and its associated program verifiers), a set of formal linking theorems for composing multithreaded and multicore concurrent layers, and a new CompCertX compiler that supports certified thread-safe compilation and linking. The CCAL toolkit is implemented in Coq and supports layered concurrent programming in both C and assembly. It has been successfully applied to build a fully certified concurrent OS kernel with fine-grained locking.", "citation": "Not cited", "departments": ["Yale University", "Yale University", "Yale University", "Yale University", "Yale University"], "authors": ["Ronghui Gu.....http://dblp.org/pers/hd/g/Gu:Ronghui", "Zhong Shao.....http://dblp.org/pers/hd/s/Shao:Zhong", "Jieung Kim.....http://dblp.org/pers/hd/k/Kim:Jieung", "Xiongnan (Newman) Wu.....http://dblp.org/pers/hd/w/Wu:Xiongnan_=Newman=", "Jérémie Koenig.....http://dblp.org/pers/hd/k/Koenig:J=eacute=r=eacute=mie", "Vilhelm Sjöberg.....http://dblp.org/pers/hd/s/Sj=ouml=berg:Vilhelm", "Hao Chen.....http://dblp.org/pers/hd/c/Chen_0023:Hao", "David Costanzo.....http://dblp.org/pers/hd/c/Costanzo:David", "Tahina Ramananandro.....http://dblp.org/pers/hd/r/Ramananandro:Tahina"], "conf": "pldi", "year": "2018", "pages": 16}