{"title": "Synthesizing Personalized Training Programs for Improving Driving Habits via Virtual Reality.", "fields": ["immersion", "headset", "controller", "popularity", "virtual reality"], "abstract": "The recent popularity of consumer-grade virtual reality devices, such as Oculus Rift, HTC Vive, and Fove virtual reality headset, has enabled household users to experience highly immersive virtual environments. We take advantage of the commercial availability of these devices to provide a novel virtual reality-based driving training approach designed to help individuals improve their driving habits in common scenarios. Our approach first identifies improper driving habits of a user when he drives in a virtual city. Then it synthesizes a pertinent training program to help improve the users driving skills based on the discovered improper habits of the user. To apply our approach, a user first goes through a pre-evaluation test from which his driving habits are analyzed. The analysis results are used to drive optimization for synthesizing a training program. This training program is a personalized route which includes different traffic events. When the user drives along this route via a driving controller and an eye-tracking virtual reality headset, the traffic events he encounters will help him to improve his driving habits. To validate the effectiveness of our approach, we conducted a user study to compare our virtual reality-based driving training with other training methods. The user study results show that the participants trained by our approach perform better on average than those trained by other methods in terms of evaluation score and response time and their improvement is more persistent.", "citation": "Not cited", "departments": ["Beijing Institute of Technology", "Beijing Institute of Technology", "University of Massachusetts Boston", "Massachusetts Institute of Technology", "University of Massachusetts Boston"], "authors": ["Yining Lang.....http://dblp.org/pers/hd/l/Lang:Yining", "Liang Wei.....http://dblp.org/pers/hd/w/Wei:Liang", "Fang Xu.....http://dblp.org/pers/hd/x/Xu:Fang", "Yibiao Zhao.....http://dblp.org/pers/hd/z/Zhao:Yibiao", "Lap-Fai Yu.....http://dblp.org/pers/hd/y/Yu:Lap=Fai"], "conf": "vr", "year": "2018", "pages": 8}