{"title": "Content Attention Model for Aspect Based Sentiment Analysis.", "fields": ["sentiment analysis", "machine learning", "empirical research", "artificial intelligence", "sentence"], "abstract": "Aspect based sentiment classification is a crucial task for sentiment analysis. Recent advances in the neural attention model demonstrate that it can be helpful in aspect based sentiment classification task, in that it can help identify the focus words of the human’s statements. However, according to our empirical study, prevalent content attention mechanisms proposed for aspect based sentiment classification mostly focused on identifying the sentiment words or shifters, without considering the relevance of such words with respect to the given aspects in the sentence. Therefore, it is usually insufficient for dealing with multi-aspect sentences and the syntactically complex sentence structures. To solve this problem, we propose a novel content attention based aspect based sentiment classification model, with two attention enhancing mechanisms: the sentence-level content attention mechanism is capable of capturing the important information about given aspect from a global perspective; the context attention mechanism is responsible for taking into account the order of the words and their correlations to the given aspects simultaneously, by embedding them into a series of customized memories. Experimental results on three benchmark datasets demonstrate the proposed model outperforms the state-of-the-art, in which the proposed mechanisms play a key role.", "citation": "Citations (1)", "departments": ["University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China", "University of Electronic Science and Technology of China"], "authors": ["Qiao Liu.....http://dblp.org/pers/hd/l/Liu:Qiao", "Haibin Zhang.....http://dblp.org/pers/hd/z/Zhang:Haibin", "Yifu Zeng.....http://dblp.org/pers/hd/z/Zeng:Yifu", "Ziqi Huang.....http://dblp.org/pers/hd/h/Huang:Ziqi", "Zufeng Wu.....http://dblp.org/pers/hd/w/Wu:Zufeng"], "conf": "www", "year": "2018", "pages": 10}