{"title": "Towards Joint Attention Training for Children with ASD - a VR Game Approach and Eye Gaze Exploration.", "fields": ["autism spectrum disorder", "joint attention", "eye tracking", "gaze", "user experience design"], "abstract": "Joint attention is critical to the education and development of a child. Deficits in joint attention are considered by many researchers to be an early predictor of children with Autism Spectrum Disorder (ASD). Training of joint attention have been a significant topic in ASD intervention education research. We propose a novel joint attention training approach using a Customizable Virtual Human (CVH) and a Virtual Reality (VR) game to assist with joint attention training. Previous work has shown that CVHs potentially help the users with ASD to increase their performance in hand-eye coordination, motivate the users to play longer, as well as improve user experience in a training game. Based upon these discovered CVH benefits, we hypothesize that CVHs may also be beneficial in training joint attention for users with ASD. To test our hypothesis, we developed a CVH with customizable facial features in an educational game - Imagination Drums - and conducted a user study on adolescents with high functioning ASD to investigate the effects of CVHs. We collected users' eye-gaze data and task performance during the game to evaluate the users' joint attention with CVHs and the effectiveness of CVHs compared with Non-Customizable Virtual Humans (NCVHs). The study results showed that the CVH make the participants gaze less at the irrelevant area of the game's storyline (i.e. background), but surprisingly, also provided evidence that participants react slower to the CVH's joint attention bids, compared with NCVH. Overall, the study reveals insights of how users with ASD interact with CVHs and how these interactions affect joint attention.", "citation": "Not cited", "departments": ["Kennesaw State University", "University of Texas at San Antonio", "University of Texas at San Antonio", "University of Texas at San Antonio"], "authors": ["Chao Mei.....http://dblp.org/pers/hd/m/Mei:Chao", "Bushra Tasnim Zahed.....http://dblp.org/pers/hd/z/Zahed:Bushra_Tasnim", "Lee Mason.....http://dblp.org/pers/hd/m/Mason:Lee", "John Quarles.....http://dblp.org/pers/hd/q/Quarles:John"], "conf": "vr", "year": "2018", "pages": 8}