{"title": "A Machine Learning Approach to Prevent Malicious Calls over Telephony Networks.", "fields": ["latency", "user interface", "server", "artificial neural network", "telephony"], "abstract": "Malicious calls, i.e., telephony spams and scams, have been a long-standing challenging issue that causes billions of dollars of annual financial loss worldwide. This work presents the first machine learning-based solution without relying on any particular assumptions on the underlying telephony network infrastructures. The main challenge of this decade-long problem is that it is unclear how to construct effective features without the access to the telephony networks' infrastructures. We solve this problem by combining several innovations. We first develop a TouchPal user interface on top of a mobile App to allow users tagging malicious calls. This allows us to maintain a large-scale call log database. We then conduct a measurement study over three months of call logs, including 9 billion records. We design 29 features based on the results, so that machine learning algorithms can be used to predict malicious calls. We extensively evaluate different state-of-the-art machine learning approaches using the proposed features, and the results show that the best approach can reduce up to 90% unblocked malicious calls while maintaining a precision over 99.99% on the benign call traffic. The results also show the models are efficient to implement without incurring a significant latency overhead. We also conduct ablation analysis, which reveals that using 10 out of the 29 features can reach a performance comparable to using all features.", "citation": "Citations (1)", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "University of California, Berkeley", "TouchPal Inc.", "TouchPal Inc."], "authors": ["Huichen Li.....http://dblp.org/pers/hd/l/Li:Huichen", "Xiaojun Xu.....http://dblp.org/pers/hd/x/Xu:Xiaojun", "Chang Liu.....http://dblp.org/pers/hd/l/Liu:Chang", "Teng Ren.....http://dblp.org/pers/hd/r/Ren:Teng", "Kun Wu.....http://dblp.org/pers/hd/w/Wu:Kun", "Xuezhi Cao.....http://dblp.org/pers/hd/c/Cao:Xuezhi", "Weinan Zhang.....http://dblp.org/pers/hd/z/Zhang:Weinan", "Yong Yu.....http://dblp.org/pers/hd/y/Yu:Yong", "Dawn Song.....http://dblp.org/pers/hd/s/Song:Dawn"], "conf": "sp", "year": "2018", "pages": 17}