{"title": "Nonlinear dimension reduction via outer Bi-Lipschitz extensions.", "fields": ["lipschitz continuity", "multiplicative function", "binary logarithm", "kirszbraun theorem", "lemma"], "abstract": "We introduce and study the notion of *an outer bi-Lipschitz extension* of a map between Euclidean spaces. The notion is a natural analogue of the notion of *a Lipschitz extension* of a Lipschitz map. We show that for every map  f  there exists an outer bi-Lipschitz extension  f ′ whose distortion is greater than that of  f  by at most a constant factor. This result can be seen as a counterpart of the classic Kirszbraun theorem for outer bi-Lipschitz extensions. We also study outer bi-Lipschitz extensions of near-isometric maps and show upper and lower bounds for them. Then, we present applications of our results to prioritized and terminal dimension reduction problems, described next.    We prove a *prioritized* variant of the Johnson–Lindenstrauss lemma: given a set of points  X ⊂ ℝ  d   of size  N  and a permutation (”priority ranking”) of  X , there exists an embedding  f  of  X  into ℝ  O (log N )  with distortion  O (loglog N ) such that the point of rank  j  has only  O (log 3 + e   j ) non-zero coordinates – more specifically, all but the first  O (log 3+e   j ) coordinates are equal to 0; the distortion of  f  restricted to the first  j  points (according to the ranking) is at most  O (loglog j ). The result makes a progress towards answering an open question by Elkin, Filtser, and Neiman about prioritized dimension reductions.    We prove that given a set  X  of  N  points in ℜ  d  , there exists a *terminal* dimension reduction embedding of ℝ  d   into ℝ  d ′ , where  d ′ =  O (log N /e 4 ), which preserves distances || x − y || between points  x ∈  X  and  y  ∈ ℝ  d  , up to a multiplicative factor of 1 ± e. This improves a recent result by Elkin, Filtser, and Neiman.    The dimension reductions that we obtain are nonlinear, and this nonlinearity is necessary.", "citation": "Not cited", "year": "2018", "departments": ["Columbia University", "Northwestern University", "Toyota Technological Institute at Chicago", "Microsoft"], "conf": "stoc", "authors": ["Sepideh Mahabadi.....http://dblp.org/pers/hd/m/Mahabadi:Sepideh", "Konstantin Makarychev.....http://dblp.org/pers/hd/m/Makarychev:Konstantin", "Yury Makarychev.....http://dblp.org/pers/hd/m/Makarychev:Yury", "Ilya P. Razenshteyn.....http://dblp.org/pers/hd/r/Razenshteyn:Ilya_P="], "pages": 14}