{"title": "Rapid Adoption of Cloud Data Warehouse Technology Using Datometry Hyper-Q.", "fields": ["premises", "critical mass", "cloud database", "virtualization", "use case"], "abstract": "The database industry is about to undergo a fundamental transformation of unprecedented magnitude as enterprises start trading their well-established database stacks on premises for cloud database technology in order to take advantage of the economics cloud service providers have long promised. Industry experts and analysts expect the next years to prove a watershed moment in this transformation, as cloud databases finally reached critical mass and maturity.   Enterprises eager to move to the cloud face a significant dilemma: while moving the content of their databases to the cloud is a well-studied problem, making existing applications work with new database platforms is an enormously costly undertaking that calls for rewriting and adjusting of 100's if not 1,000's of applications.   In this paper, we present a next-generation virtualization technology that lets existing applications run natively on cloud-based database systems. Using this platform, enterprises can move rapidly to the cloud and innovate and create competitive advantage as a matter of months instead of years. We describe technology and application scenarios and demonstrate effectiveness and performance of the approach through actual customer use cases.", "citation": "Not cited", "year": "2018", "departments": ["Datometry, Inc. ... ncisco, CA, USA", "Datometry, Inc. ... ncisco, CA, USA", "Datometry, Inc. ... ncisco, CA, USA", "Datometry, Inc. ... ncisco, CA, USA", "Datometry, Inc. ... ncisco, CA, USA"], "conf": "sigmod", "authors": ["Lyublena Antova.....http://dblp.org/pers/hd/a/Antova:Lyublena", "Derrick Bryant.....http://dblp.org/pers/hd/b/Bryant:Derrick", "Tuan Cao.....http://dblp.org/pers/hd/c/Cao:Tuan", "Michael Duller.....http://dblp.org/pers/hd/d/Duller:Michael", "Mohamed A. Soliman.....http://dblp.org/pers/hd/s/Soliman:Mohamed_A=", "Florian M. Waas.....http://dblp.org/pers/hd/w/Waas:Florian_M="], "pages": 15}