{"title": "Predicting Aesthetic Score Distribution Through Cumulative Jensen-Shannon Divergence.", "fields": ["kurtosis", "jensen shannon divergence", "convolutional neural network", "ordinal number", "deep learning"], "abstract": "Aesthetic quality prediction is a challenging task in the computer vision community because of the complex interplay with semantic contents and photographic technologies. Recent studies on the powerful deep learning based aesthetic quality assessment usually use a binary high-low label or a numerical score to represent the aesthetic quality. However the scalar representation cannot describe well the underlying varieties of the human perception of aesthetics. In this work, we propose to predict the aesthetic score distribution (i.e., a score distribution vector of the ordinal basic human ratings) using Deep Convolutional Neural Network (DCNN). Conventional DCNNs which aim to minimize the difference between the predicted scalar numbers or vectors and the ground truth cannot be directly used for the ordinal basic rating distribution. Thus, a novel CNN based on the Cumulative distribution with Jensen-Shannon divergence (CJS-CNN) is presented to predict the aesthetic score distribution of human ratings, with a new reliability-sensitive learning method based on the kurtosis of the score distribution, which eliminates the requirement of the original full data of human ratings (without normalization). Experimental results on large scale aesthetic dataset demonstrate the effectiveness of our introduced CJS-CNN in this task.", "citation": "Not cited", "departments": ["Beijing Electronic Science and Technology Institute", "Beijing Electronic Science and Technology Institute", "Beijing Electronic Science and Technology Institute", "Peking University"], "authors": ["Xin Jin.....http://dblp.org/pers/hd/j/Jin:Xin", "Le Wu.....http://dblp.org/pers/hd/w/Wu:Le", "Xiaodong Li.....http://dblp.org/pers/hd/l/Li:Xiaodong", "Siyu Chen.....http://dblp.org/pers/hd/c/Chen:Siyu", "Siwei Peng.....http://dblp.org/pers/hd/p/Peng:Siwei", "Jingying Chi.....http://dblp.org/pers/hd/c/Chi:Jingying", "Shiming Ge.....http://dblp.org/pers/hd/g/Ge:Shiming", "Chenggen Song.....http://dblp.org/pers/hd/s/Song:Chenggen", "Geng Zhao.....http://dblp.org/pers/hd/z/Zhao:Geng"], "conf": "aaai", "year": "2018", "pages": 8}