{"title": "The Size Conundrum: Why Online Knowledge Markets Can Fail at Scale.", "fields": ["market failure", "diseconomies of scale", "knowledge market", "diminishing returns", "cobb douglas production function"], "abstract": "In this paper, we interpret the community question answering websites on the StackExchange platform as knowledge markets, and analyze how and why these markets can fail at scale. A knowledge market framing allows site operators to reason about market failures, and to design policies to prevent them. Our goal is to provide insights on large-scale knowledge market failures through an interpretable model. We explore a set of interpretable economic production models on a large empirical dataset to analyze the dynamics of content generation in knowledge markets. Amongst these, the Cobb-Douglas model best explains empirical data and provides an intuitive explanation for content generation through concepts of elasticity and diminishing returns. Content generation depends on user participation and also on how specific types of content (e.g. answers) depends on other types (e.g. questions). We show that these factors of content generation have constant elasticity—a percentage increase in any of the inputs leads to a constant percentage increase in the output. Furthermore, markets exhibit diminishing returns—the marginal output decreases as the input is incrementally increased. Knowledge markets also vary on their returns to scale—the increase in output resulting from a proportionate increase in all inputs. Importantly, many knowledge markets exhibit diseconomies of scale—measures of market health (e.g., the percentage of questions with an accepted answer) decrease as a function of number of participants. The implications of our work are two-fold: site operators ought to design incentives as a function of system size (number of participants); the market lens should shed insight into complex dependencies amongst different content types and participant actions in general social networks.", "citation": "Not cited", "departments": ["Google", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Peking University", "University of Illinois at Urbana–Champaign"], "authors": ["Himel Dev.....http://dblp.org/pers/hd/d/Dev:Himel", "Chase Geigle.....http://dblp.org/pers/hd/g/Geigle:Chase", "Qingtao Hu.....http://dblp.org/pers/hd/h/Hu:Qingtao", "Jiahui Zheng.....http://dblp.org/pers/hd/z/Zheng:Jiahui", "Hari Sundaram.....http://dblp.org/pers/hd/s/Sundaram:Hari"], "conf": "www", "year": "2018", "pages": 11}