{"title": "Generalized Score Functions for Causal Discovery.", "fields": ["nonparametric statistics", "exploit", "reproducing kernel hilbert space", "multiple comparisons problem", "spurious relationship"], "abstract": "Discovery of causal relationships from observational data is a fundamental problem. Roughly speaking, there are two types of methods for causal discovery, constraint-based ones and score-based ones. Score-based methods avoid the multiple testing problem and enjoy certain advantages compared to constraint-based ones. However, most of them need strong assumptions on the functional forms of causal mechanisms, as well as on data distributions, which limit their applicability. In practice the precise information of the underlying model class is usually unknown. If the above assumptions are violated, both spurious and missing edges may result. In this paper, we introduce generalized score functions for causal discovery based on the characterization of general (conditional) independence relationships between random variables, without assuming particular model classes. In particular, we exploit regression in RKHS to capture the dependence in a nonparametric way. The resulting causal discovery approach produces asymptotically correct results in rather general cases, which may have nonlinear causal mechanisms, a wide class of data distributions, mixed continuous and discrete data, and multidimensional variables. Experimental results on both synthetic and real-world data demonstrate the efficacy of our proposed approach.", "citation": "Not cited", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Max Planck Society", "Carnegie Mellon University"], "authors": ["Biwei Huang.....http://dblp.org/pers/hd/h/Huang:Biwei", "Kun Zhang.....http://dblp.org/pers/hd/z/Zhang_0001:Kun", "Yizhu Lin.....http://dblp.org/pers/hd/l/Lin:Yizhu", "Bernhard Schölkopf.....http://dblp.org/pers/hd/s/Sch=ouml=lkopf:Bernhard", "Clark Glymour.....http://dblp.org/pers/hd/g/Glymour:Clark"], "conf": "kdd", "year": "2018", "pages": 10}