{"title": "Towards Binary-Valued Gates for Robust LSTM Training.", "fields": ["overfitting", "machine translation", "backpropagation", "recurrent neural network", "binary number"], "abstract": "Long Short-Term Memory (LSTM) is one of the most widely used recurrent structures in sequence modeling. Its goal is to use gates to control the information flow (e.g., whether to skip some information/transformation or not) in the recurrent computations, although its practical implementation based on soft gates only partially achieves this goal and is easy to overfit. In this paper, we propose a new way for LSTM training, which pushes the values of the gates towards 0 or 1. By doing so, we can (1) better control the information flow: the gates are mostly open or closed, instead of in a middle state; and (2) avoid overfitting to certain extent: the gates operate at their flat regions, which is shown to correspond to better generalization ability. However, learning towards discrete values of the gates is generally difficult. To tackle this challenge, we leverage the recently developed Gumbel-Softmax trick from the field of variational methods, and make the model trainable with standard backpropagation. Experimental results on language modeling and machine translation show that (1) the values of the gates generated by our method are more reasonable and intuitively interpretable, and (2) our proposed method generalizes better and achieves better accuracy on test sets in all tasks. Moreover, the learnt models are not sensitive to low-precision approximation and low-rank approximation of the gate parameters due to the flat loss surface.", "citation": "Not cited", "departments": ["Microsoft", "Peking University", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Zhuohan Li.....http://dblp.org/pers/hd/l/Li:Zhuohan", "Di He.....http://dblp.org/pers/hd/h/He:Di", "Fei Tian.....http://dblp.org/pers/hd/t/Tian:Fei", "Wei Chen.....http://dblp.org/pers/hd/c/Chen_0034:Wei", "Tao Qin.....http://dblp.org/pers/hd/q/Qin:Tao", "Liwei Wang.....http://dblp.org/pers/hd/w/Wang_0001:Liwei", "Tie-Yan Liu.....http://dblp.org/pers/hd/l/Liu:Tie=Yan"], "conf": "icml", "year": "2018", "pages": 10}