{"title": "Submodularity-Inspired Data Selection for Goal-Oriented Chatbot Training Based on Sentence Embeddings.", "fields": ["data point", "chatbot", "retraining", "sentence", "natural language understanding"], "abstract": "Goal-oriented (GO) dialogue systems rely on an initial natural language understanding (NLU) module to determine the user's intention and parameters thereof - also known as slots. Since the systems, also known as bots, help the users with solving problems in relatively narrow domains, they require training data within those domains. This leads to significant data availability issues that inhibit the development of successful bots. To alleviate this problem, we propose a technique of data selection in the low-data regime that allows training with significantly fewer labeled sentences, thus smaller labelling costs. \nWe create a submodularity-inspired data ranking function, the ratio penalty marginal gain, to select data points to label based solely on the information extracted from the textual embedding space. We show that the distances in the embedding space are a viable source of information for data selection. This method outperforms several known active learning techniques, without using the label information. This allows for cost-efficient training of NLU units for goal-oriented bots. Moreover, our proposed selection technique does not need the retraining of the model in between the selection steps, making it time-efficient as well.", "citation": "Not cited", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "Swisscom", "Swisscom", "Swisscom"], "authors": ["Mladen Dimovski.....http://dblp.org/pers/hd/d/Dimovski:Mladen", "Claudiu Musat.....http://dblp.org/pers/hd/m/Musat:Claudiu", "Vladimir Ilievski.....http://dblp.org/pers/hd/i/Ilievski:Vladimir", "Andreea Hossmann.....http://dblp.org/pers/hd/h/Hossmann:Andreea", "Michael Baeriswyl.....http://dblp.org/pers/hd/b/Baeriswyl:Michael"], "conf": "ijcai", "year": "2018", "pages": 7}