{"title": "ElimiNet: A Model for Eliminating Options for Reading Comprehension with Multiple Choice Questions.", "fields": ["reading comprehension", "multiple choice", "artificial intelligence", "artificial neural network", "machine learning"], "abstract": "The task of Reading Comprehension with Multiple Choice Questions, requires a human (or machine) to read a given \\{\\textit{passage, question}\\} pair and select one of the $n$ given options. The current state of the art model for this task first computes a query-aware representation for the passage and then \\textit{selects} the option which has the maximum similarity with this representation. However, when humans perform this task they do not just focus on option selection but use a combination of \\textit{elimination} and \\textit{selection}. Specifically, a human would first try to eliminate the most irrelevant option and then read the document again in the light of this new information (and perhaps ignore portions corresponding to the eliminated option). This process could be repeated multiple times till the reader is finally ready to select the correct option. We propose \\textit{ElimiNet}, a neural network based model which tries to mimic this process. Specifically, it has gates which decide whether an option can be eliminated given the \\{\\textit{document, question}\\} pair and if so it tries to make the document representation orthogonal to this eliminatedd option (akin to ignoring portions of the document corresponding to the eliminated option). The model makes multiple rounds of partial elimination to refine the document representation and finally uses a selection module to pick the best option. We evaluate our model on the recently released large scale RACE dataset and show that it outperforms the current state of the art model on 7 out of the 13 question types in this dataset. Further we show that taking an ensemble of our \\textit{elimination-selection} based method with a \\textit{selection} based method gives us an improvement of 7\\% (relative) over the best reported performance on this dataset.", "citation": "Not cited", "departments": ["Indian Institute of Technology Madras", "Indian Institute of Technology Madras", "Indian Institute of Technology Madras", "Indian Institute of Technology Madras"], "authors": ["Soham Parikh.....http://dblp.org/pers/hd/p/Parikh:Soham", "Ananya Sai.....http://dblp.org/pers/hd/s/Sai:Ananya", "Preksha Nema.....http://dblp.org/pers/hd/n/Nema:Preksha", "Mitesh M. Khapra.....http://dblp.org/pers/hd/k/Khapra:Mitesh_M="], "conf": "ijcai", "year": "2018", "pages": 7}