{"title": "Your Secrets Are Safe: How Browsers' Explanations Impact Misconceptions About Private Browsing Mode.", "fields": ["geolocation", "targeted advertising", "computer science", "persistence", "world wide web"], "abstract": "All major web browsers include a private browsing mode that does not store browsing history, cookies, or temporary files across browsing sessions. Unfortunately, users have misconceptions about what this mode does. Many factors likely contribute to these misconceptions. In this paper, we focus on browsers’ disclosures, or their in-browser explanations of private browsing mode. In a 460-participant online study, each participant saw one of 13 different disclosures (the desktop and mobile disclosures of six popular browsers, plus a control). Based on the disclosure they saw, participants answered questions about what would happen in twenty browsing scenarios capturing previously documented misconceptions. We found that browsers’ disclosures fail to correct the majority of the misconceptions we tested. These misconceptions included beliefs that private browsing mode would prevent geolocation, advertisements, viruses, and tracking by both the websites visited and the network provider. Furthermore, participants who saw certain disclosures were more likely to have misconceptions about private browsing’s impact on targeted advertising, the persistence of lists of downloaded files and bookmarks, and tracking by ISPs, employers, and governments.", "citation": "Not cited", "departments": ["University of Chicago", "University of Chicago", "University of Chicago", "Leibniz Univers ... nover, Germany", "Leibniz Univers ... nover, Germany"], "authors": ["Yuxi Wu.....http://dblp.org/pers/hd/w/Wu:Yuxi", "Panya Gupta.....http://dblp.org/pers/hd/g/Gupta:Panya", "Miranda Wei.....http://dblp.org/pers/hd/w/Wei:Miranda", "Yasemin Acar.....http://dblp.org/pers/hd/a/Acar:Yasemin", "Sascha Fahl.....http://dblp.org/pers/hd/f/Fahl:Sascha", "Blase Ur.....http://dblp.org/pers/hd/u/Ur:Blase"], "conf": "www", "year": "2018", "pages": 10}