{"title": "Context Analytics: Vision, Architecture, Opportunity.", "fields": ["business analytics", "analytics", "reference architecture", "contextual design", "situated"], "abstract": "Business actions are often situated in a complex system of people, data and software, and the pace and quality of decisions often rely on how well knowledge work is coordinated. A tremendous amount of contextual data exists within an enterprise in data management, business analytics, and visualization systems, enterprise applications, and collaboration and social networking tools that capture the flow of 'work' accurately and completely across people, data and software. We believe that if such contextual data is captured and integrated, it offers significant potential to support knowledge work and to accelerate the productivity of knowledge workers. In this paper, we argue for context analytics, broadly referring to analytics on knowledge work and activity. We propose a context graph to flexibly represent knowledge work, including people, data assets, and tools, as well as the context around them. We also propose a reference architecture that is specifically designed for integration and analytics, illustrate how to populate the context graph with contextual data from a variety of systems, and show how analytics can be flexibly computed over the graph such that the graph serves as both input and output. Finally, we describe techniques such as contextual search and activity summarization to create a contextual user experience for discovery, governance, and collaboration in an enterprise setting.", "citation": "Not cited", "departments": ["IBM", "IBM", "IBM", "IBM", "IBM"], "authors": ["Eser Kandogan.....http://dblp.org/pers/hd/k/Kandogan:Eser", "Mary Roth.....http://dblp.org/pers/hd/r/Roth:Mary", "Ignacio Terrizzano.....http://dblp.org/pers/hd/t/Terrizzano:Ignacio", "Ed Seabolt.....http://dblp.org/pers/hd/s/Seabolt:Ed", "Peter M. Schwarz.....http://dblp.org/pers/hd/s/Schwarz:Peter_M=", "Harsha Krishnareddy.....http://dblp.org/pers/hd/k/Krishnareddy:Harsha", "Akshay Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Akshay"], "conf": "icde", "year": "2018", "pages": 8}