{"title": "Matching Natural Language Sentences with Hierarchical Sentence Factorization.", "fields": ["semantic matching", "deep learning", "semantic similarity", "convolutional neural network", "sentence"], "abstract": "Semantic matching of natural language sentences or identifying the relationship between two sentences is a core research problem underlying many natural language tasks. Prior research has proposed both unsupervised distance-based schemes, when training data is not available, and deep learning schemes for sentence matching, given training data. However, previous approaches either omit or fail to fully utilize the ordered, hierarchical, and flexible structures of language objects, as well as the interaction between them. In this paper, we propose \\textit{Hierarchical Sentence Factorization}—a technique that is able to factorize a sentence into a hierarchical representation, with the components at each different scale reordered into a “predicate-argument” form. The proposed sentence factorization technique leads to the invention of: 1) a new unsupervised distance metric which calculates the semantic distance between a pair of text snippets by solving a penalized optimal transport problem while preserving the logical relationship of words in the reordered sentences, and 2) new multi-scale deep learning models for supervised semantic training, based on factorized sentence hierarchies. We apply our techniques to text-pair similarity estimation and text-pair relationship classification tasks, based on multiple datasets such as STSbenchmark, the Microsoft Research paraphrase identification (MSRP) dataset, the SICK dataset, etc. Extensive experiments show that the proposed hierarchical sentence factorization can be used to significantly improve the performance of existing unsupervised distance-based metrics as well as multiple supervised deep learning models based on the convolutional neural network (CNN) and long short-term memory (LSTM).", "citation": "Not cited", "departments": ["University of Alberta", "University of Alberta", "University of Alberta", "University of Alberta", "Tencent"], "authors": ["Bang Liu.....http://dblp.org/pers/hd/l/Liu:Bang", "Ting Zhang.....http://dblp.org/pers/hd/z/Zhang:Ting", "Fred X. Han.....http://dblp.org/pers/hd/h/Han:Fred_X=", "Di Niu.....http://dblp.org/pers/hd/n/Niu:Di", "Kunfeng Lai.....http://dblp.org/pers/hd/l/Lai:Kunfeng", "Yu Xu.....http://dblp.org/pers/hd/x/Xu:Yu"], "conf": "www", "year": "2018", "pages": 10}