{"title": "Doubly-Efficient zkSNARKs Without Trusted Setup.", "fields": ["random oracle", "gas meter prover", "mathematical proof", "commitment scheme", "communication complexity"], "abstract": "We present a zero-knowledge argument for NP with low communication complexity, low concrete cost for both the prover and the verifier, and no trusted setup, based on standard cryptographic assumptions. Communication is proportional to d log G (for d the depth and G the width of the verifying circuit) plus the square root of the witness size. When applied to batched or data-parallel statements, the prover's runtime is linear and the verifier's is sub-linear in the verifying circuit size, both with good constants. In addition, witness-related communication can be reduced, at the cost of increased verifier runtime, by leveraging a new commitment scheme for multilinear polynomials, which may be of independent interest. These properties represent a new point in the tradeoffs among setup, complexity assumptions, proof size, and computational cost. We apply the Fiat-Shamir heuristic to this argument to produce a zero-knowledge succinct non-interactive argument of knowledge (zkSNARK) in the random oracle model, based on the discrete log assumption, which we call Hyrax. We implement Hyrax and evaluate it against five state-of-the-art baseline systems. Our evaluation shows that, even for modest problem sizes, Hyrax gives smaller proofs than all but the most computationally costly baseline, and that its prover and verifier are each faster than three of the five baselines.", "citation": "Not cited", "departments": ["Stanford University", "New York University", "Northeastern University", "Georgetown University", "New York University"], "authors": ["Riad S. Wahby.....http://dblp.org/pers/hd/w/Wahby:Riad_S=", "Ioanna Tzialla.....http://dblp.org/pers/hd/t/Tzialla:Ioanna", "Abhi Shelat.....http://dblp.org/pers/hd/s/Shelat:Abhi", "Justin Thaler.....http://dblp.org/pers/hd/t/Thaler:Justin", "Michael Walfish.....http://dblp.org/pers/hd/w/Walfish:Michael"], "conf": "sp", "year": "2018", "pages": 18}