{"title": "Interactive Visual Exploration of Spatio-Temporal Urban Data Sets using Urbane.", "fields": ["interactivity", "graphics hardware", "graphics pipeline", "visual analytics", "raster graphics"], "abstract": "The recent explosion in the number and size of spatio-temporal data sets from urban environments and social sensors creates new opportunities for data-driven approaches to understand and improve cities. Visual analytics systems like Urbane aim to empower domain experts to explore multiple data sets, at different time and space resolutions. Since these systems rely on computationally-intensive spatial aggregation queries that slice and summarize the data over different regions, an important challenge is how to attain interactivity. While traditional pre-aggregation approaches support interactive exploration, they are unsuitable in this setting because they do not support ad-hoc query constraints or polygons of arbitrary shapes. To address this limitation, we have recently proposed Raster Join, an approach that converts a spatial aggregation query into a set of drawing operations on a canvas and leverages the rendering pipeline of the graphics hardware (GPU). By doing so, Raster Join evaluates queries on the fly at interactive speeds on commodity laptops and desktops. In this demonstration, we showcase the efficiency of Raster Join by integrating it with Urbane and enabling interactivity. Demo visitors will interact with Urbane to filter and visualize several urban data sets over multiple resolutions.", "citation": "Not cited", "year": "2018", "departments": ["New York University", "École Polytechnique Fédérale de Lausanne", "New York University", "Federal Fluminense University", "École Polytechnique Fédérale de Lausanne"], "conf": "sigmod", "authors": ["Harish Doraiswamy.....http://dblp.org/pers/hd/d/Doraiswamy:Harish", "Eleni Tzirita Zacharatou.....http://dblp.org/pers/hd/z/Zacharatou:Eleni_Tzirita", "Fábio Miranda.....http://dblp.org/pers/hd/m/Miranda:F=aacute=bio", "Marcos Lage.....http://dblp.org/pers/hd/l/Lage:Marcos", "Anastasia Ailamaki.....http://dblp.org/pers/hd/a/Ailamaki:Anastasia", "Cláudio T. Silva.....http://dblp.org/pers/hd/s/Silva:Cl=aacute=udio_T=", "Juliana Freire.....http://dblp.org/pers/hd/f/Freire:Juliana"], "pages": 4}