{"title": "TurboFlux: A Fast Continuous Subgraph Matching System for Streaming Graph Data.", "fields": ["graph", "execution model", "throughput", "overhead", "dynamic data"], "abstract": "A dynamic graph is defined by an initial graph and a graph update  stream  consisting of edge insertions and deletions. Identifying and monitoring critical patterns in the dynamic graph is important in various application domains such as fraud detection, cyber security, and emergency response. Given a dynamic data graph and a query graph, a continuous subgraph matching system reports  positive  matches for an edge insertion and reports  negative  matches for an edge deletion. Previous systems show significantly low throughput due to either repeated subgraph matching for each edge update or expensive overheads in maintaining enormous intermediate results. We present a fast continuous subgraph matching system called  TurboFlux  which provides high throughput over a fast graph update stream.  TurboFlux  employs a concise representation of intermediate results, and its execution model allows fast incremental maintenance. Our empirical evaluation shows that  TurboFlux  significantly outperforms existing competitors by up to  six  orders of magnitude.", "citation": "Not cited", "year": "2018", "departments": ["Pohang University of Science and Technology", "Pohang University of Science and Technology", "Pohang University of Science and Technology", "Pohang University of Science and Technology", "Oracle Corporation"], "conf": "sigmod", "authors": ["Kyoungmin Kim.....http://dblp.org/pers/hd/k/Kim:Kyoungmin", "In Seo.....http://dblp.org/pers/hd/s/Seo:In", "Wook-Shin Han.....http://dblp.org/pers/hd/h/Han:Wook=Shin", "Jeong-Hoon Lee.....http://dblp.org/pers/hd/l/Lee:Jeong=Hoon", "Sungpack Hong.....http://dblp.org/pers/hd/h/Hong:Sungpack", "Hassan Chafi.....http://dblp.org/pers/hd/c/Chafi:Hassan", "Hyungyu Shin.....http://dblp.org/pers/hd/s/Shin:Hyungyu", "Geonhwa Jeong.....http://dblp.org/pers/hd/j/Jeong:Geonhwa"], "pages": 16}