{"title": "High Throughput Low Delay Wireless Multicast via Multi-Channel Moving Window Codes.", "fields": ["wireless", "large deviations theory", "multicast", "throughput", "channel"], "abstract": "A fundamental challenge in wireless multicast has been how to simultaneously achieve high-throughput and low-delay for reliably serving a large number of users. In this paper, we show how to harness substantial throughput and delay gains by exploiting multi-channel resources. We develop a new scheme called Multi-Channel Moving Window Codes (MC-MWC) for multi-channel multi-session wireless multicast. The salient features of MC-MWC are three-fold. (i) High throughput: we show that MC-MWC achieves order-optimal throughput in the many-user many-channel asymptotic regime. Moreover, the number of channels required by a conventional channel-allocation based scheme is shown to be doubly-exponentially larger than that required by MC-MWC. (ii) Low delay: using large deviations theory, we show that the delay of MC-MWC decreases linearly with the number of channels, while the delay reduction of conventional schemes is no more than a finite constant. (iii) Low feedback overhead: the feedback overhead of MC-MWC is a constant that is independent of both the number of receivers in each session and the number of sessions in the network. Finally, our trace-driven simulation and numerical results validate the analytical results and show that the implementation complexity of MC-MWC is low.", "citation": "Not cited", "departments": ["Ohio State University", "Auburn University", "Ohio State University", "Ohio State University", "Ohio State University"], "authors": ["Fei Wu.....http://dblp.org/pers/hd/w/Wu_0008:Fei", "Yin Sun.....http://dblp.org/pers/hd/s/Sun:Yin", "Lu Chen.....http://dblp.org/pers/hd/c/Chen:Lu", "Jackie Xu.....http://dblp.org/pers/hd/x/Xu:Jackie", "Kannan Srinivasan.....http://dblp.org/pers/hd/s/Srinivasan:Kannan", "Ness B. Shroff.....http://dblp.org/pers/hd/s/Shroff:Ness_B="], "conf": "infocom", "year": "2018", "pages": 9}