{"title": "Harnessing AI for Speech Reconstruction using Multi-view Silent Video Feed.", "fields": ["analytics", "voice over ip", "multimedia", "intelligibility", "speech recognition"], "abstract": "Speechreading or lipreading is the technique of understanding and getting phonetic features from a speaker's visual features such as movement of lips, face, teeth and tongue. It has a wide range of multimedia applications such as in surveillance, Internet telephony, and as an aid to a person with hearing impairments. However, most of the work in speechreading has been limited to text generation from silent videos. Recently, research has started venturing into generating (audio) speech from silent video sequences but there have been no developments thus far in dealing with divergent views and poses of a speaker. Thus although, we have multiple camera feeds for the speech of a user, but we have failed in using these multiple video feeds for dealing with the different poses. To this end, this paper presents the world's first ever multi-view speech reading and reconstruction system. This work encompasses the boundaries of multimedia research by putting forth a model which leverages silent video feeds from multiple cameras recording the same subject to generate intelligent speech for a speaker. Initial results confirm the usefulness of exploiting multiple camera views in building an efficient speech reading and reconstruction system. It further shows the optimal placement of cameras which would lead to the maximum intelligibility of speech. Next, it lays out various innovative applications for the proposed system focusing on its potential prodigious impact in not just security arena but in many other multimedia analytics problems.", "citation": "Not cited", "year": "2018", "departments": ["Adobe Systems", "Netaji Subhas Institute of Technology", "Netaji Subhas Institute of Technology", "National Institute of Informatics", "Indraprastha Institute of Information Technology"], "conf": "mm", "authors": ["Yaman Kumar.....http://dblp.org/pers/hd/k/Kumar:Yaman", "Mayank Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Mayank", "Pratham Nawal.....http://dblp.org/pers/hd/n/Nawal:Pratham", "Shin'ichi Satoh.....http://dblp.org/pers/hd/s/Satoh:Shin=ichi", "Rajiv Ratn Shah.....http://dblp.org/pers/hd/s/Shah:Rajiv_Ratn", "Roger Zimmermann.....http://dblp.org/pers/hd/z/Zimmermann:Roger"], "pages": 8}