{"title": "Calendar-Aware Proactive Email Recommendation.", "fields": ["recommender system", "field experiment", "problem domain", "leverage", "baseline"], "abstract": "In this paper, we study how to leverage calendar information to help with email re-finding using a zero-query prototype, Calendar-Aware Proactive Email Recommender System (CAPERS). CAPERS proactively selects and displays potentially useful emails to users based on their upcoming calendar events with a particular focus on meeting preparation. We approach this problem domain through a survey, a task-based experiment, and a field experiment comparing multiple email recommenders in a large technology company. We first show that a large proportion of email access is related to meetings and then study the effects of four email recommenders on user perception and engagement taking into account four categories of factors: the amount of email content, email recency, calendar-email content match, and calendar-email people match. We demonstrate that these factors all positively predict the usefulness of emails to meeting preparation and that calendar-email content match is the most important. We study the effects of different machine learning models for predicting usefulness and find that an online-learned linear model doubles user engagement compared with the baselines, which suggests the benefit of continuous online learning.", "citation": "Not cited", "departments": ["University of Minnesota", "Microsoft", "Microsoft", "Microsoft", "Microsoft"], "authors": ["Qian Zhao.....http://dblp.org/pers/hd/z/Zhao:Qian", "Paul N. Bennett.....http://dblp.org/pers/hd/b/Bennett:Paul_N=", "Adam Fourney.....http://dblp.org/pers/hd/f/Fourney:Adam", "Anne Loomis Thompson.....http://dblp.org/pers/hd/t/Thompson:Anne_Loomis", "Shane Williams.....http://dblp.org/pers/hd/w/Williams:Shane", "Adam D. Troy.....http://dblp.org/pers/hd/t/Troy:Adam_D=", "Susan T. Dumais.....http://dblp.org/pers/hd/d/Dumais:Susan_T="], "conf": "sigir", "year": "2018", "pages": 10}