{"title": "On the Limitations of First-Order Approximation in GAN Dynamics.", "fields": ["orders of approximation", "discriminator", "generative grammar", "parametric statistics", "convergence"], "abstract": "Generative Adversarial Networks (GANs) have been proposed as an approach to learning generative models. While GANs have demonstrated promising performance on multiple vision tasks, their learning dynamics are not yet well understood, neither in theory nor in practice. In particular, the work in this domain has been focused so far only on understanding the properties of the stationary solutions that this dynamics might converge to, and of the behavior of that dynamics in this solutions’ immediate neighborhood. To address this issue, in this work we take a first step towards a principled study of the GAN dynamics itself. To this end, we propose a model that, on one hand, exhibits several of the common problematic convergence behaviors (e.g., vanishing gradient, mode collapse, diverging or oscillatory behavior), but on the other hand, is sufficiently simple to enable rigorous convergence analysis. This methodology enables us to exhibit an interesting phenomena: a GAN with an optimal discriminator provably converges, while guiding the GAN training using only a first order approximation of the discriminator leads to unstable GAN dynamics and mode collapse. This suggests that such usage of the first order approximation of the discriminator, which is a de-facto standard in all the existing GAN dynamics, might be one of the factors that makes GAN training so challenging in practice. Additionally, our convergence result constitutes the first rigorous analysis of a dynamics of a concrete parametric GAN.", "citation": "Not cited", "departments": ["Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology", "Massachusetts Institute of Technology"], "authors": ["Jerry Li.....http://dblp.org/pers/hd/l/Li_0001:Jerry", "Aleksander Madry.....http://dblp.org/pers/hd/m/Madry:Aleksander", "John Peebles.....http://dblp.org/pers/hd/p/Peebles:John", "Ludwig Schmidt.....http://dblp.org/pers/hd/s/Schmidt:Ludwig"], "conf": "icml", "year": "2018", "pages": 9}