{"title": "Learning from History and Present: Next-item Recommendation via Discriminatively Exploiting User Behaviors.", "fields": ["exploit", "discriminative model", "recurrent neural network", "artificial neural network", "machine learning"], "abstract": "In the modern e-commerce, the behaviors of customers contain rich information, e.g., consumption habits, the dynamics of preferences. Recently, session-based recommendationsare becoming popular to explore the temporal characteristics of customers' interactive behaviors. However, existing works mainly exploit the short-term behaviors without fully taking the customers' long-term stable preferences and evolutions into account. In this paper, we propose a novel Behavior-Intensive Neural Network (BINN) for next-item recommendation by incorporating both users' historical stable preferences and present consumption motivations. Specifically, BINN contains two main components, i.e., Neural Item Embedding, and Discriminative Behaviors Learning. Firstly, a novel item embedding method based on user interactions is developed for obtaining an unified representation for each item. Then, with the embedded items and the interactive behaviors over item sequences, BINN discriminatively learns the historical preferences and present motivations of the target users. Thus, BINN could better perform recommendations of the next items for the target users. Finally, for evaluating the performances of BINN, we conduct extensive experiments on two real-world datasets, i.e., Tianchi and JD. The experimental results clearly demonstrate the effectiveness of BINN compared with several state-of-the-art methods.", "citation": "Citations (1)", "departments": ["University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "University of Science and Technology of China", "JD AI Research, Beijing, China"], "authors": ["Zhi Li.....http://dblp.org/pers/hd/l/Li:Zhi", "Hongke Zhao.....http://dblp.org/pers/hd/z/Zhao:Hongke", "Qi Liu.....http://dblp.org/pers/hd/l/Liu_0003:Qi", "Zhenya Huang.....http://dblp.org/pers/hd/h/Huang:Zhenya", "Tao Mei.....http://dblp.org/pers/hd/m/Mei:Tao", "Enhong Chen.....http://dblp.org/pers/hd/c/Chen:Enhong"], "conf": "kdd", "year": "2018", "pages": 10}