{"title": "The Shape of Art History in the Eyes of the Machine.", "fields": ["the renaissance", "discriminative model", "baroque", "convolutional neural network", "history of art"], "abstract": "How does the machine classify styles in art? And how does it relate to art historians's methods for analyzing style? Several studies have shown the ability of the machine to learn and predict style categories, such as Renaissance, Baroque, Impressionism, etc., from images of paintings. This implies that the machine can learn an internal representation encoding discriminative features through its visual analysis. However, such a representation is not necessarily interpretable. We conducted a comprehensive study of several of the state-of-the-art convolutional neural networks applied to the task of style classification on 77K images of paintings, and analyzed the learned representation through correlation analysis with concepts derived from art history. Surprisingly, the networks could place the works of art in a smooth temporal arrangement mainly based on learning style labels, without any a priori knowledge of time of creation, the historical time and context of styles, or relations between styles. The learned representations showed that there are few underlying factors that explain the visual variations of style in art. Some of these factors were found to correlate with style patterns suggested by Heinrich W\\\"olfflin (1846-1945). The learned representations also consistently highlighted certain artists as the extreme distinctive representative of their styles, which quantitatively confirms art historian observations.", "citation": "Not cited", "departments": ["Rutgers University", "Rutgers University", "Facebook"], "authors": ["Ahmed Elgammal.....http://dblp.org/pers/hd/e/Elgammal:Ahmed", "Bingchen Liu.....http://dblp.org/pers/hd/l/Liu:Bingchen", "Diana Kim.....http://dblp.org/pers/hd/k/Kim:Diana", "Mohamed Elhoseiny.....http://dblp.org/pers/hd/e/Elhoseiny:Mohamed", "Marian Mazzone.....http://dblp.org/pers/hd/m/Mazzone:Marian"], "conf": "aaai", "year": "2018", "pages": 9}