{"title": "Building a Bw-Tree Takes More Than Just Buzz Words.", "fields": ["database index", "indirection", "pointer", "sql", "concurrent data structure"], "abstract": "In 2013, Microsoft Research proposed the Bw-Tree (humorously termed the \"Buzz Word Tree''), a lock-free index that provides high throughput for transactional database workloads in SQL Server's Hekaton engine. The Buzz Word Tree avoids locks by appending delta record to tree nodes and using an indirection layer that allows it to atomically update physical pointers using compare-and-swap (CaS). Correctly implementing this techniques requires careful attention to detail. Unfortunately, the Bw-Tree papers from Microsoft are missing important details and the source code has not been released.   This paper has two contributions: First, it is the missing guide for how to build a lock-free Bw-Tree. We clarify missing points in Microsoft's original design documents and then present techniques to improve the index's performance. Although our focus here is on the Bw-Tree, many of our methods apply more broadly to designing and implementing future lock-free in-memory data structures. Our experimental evaluation shows that our optimized variant achieves 1.1--2.5× better performance than the original Microsoft proposal for highly concurrent workloads. Second, our evaluation shows that despite our improvements, the Bw-Tree still does  not  perform as well as other concurrent data structures that use locks.", "citation": "Citations (1)", "year": "2018", "departments": ["Carnegie Mellon University", "Carnegie Mellon University", "Carnegie Mellon University", "Technische Universität München", "Carnegie Mellon University"], "conf": "sigmod", "authors": ["Ziqi Wang.....http://dblp.org/pers/hd/w/Wang:Ziqi", "Andrew Pavlo.....http://dblp.org/pers/hd/p/Pavlo:Andrew", "Hyeontaek Lim.....http://dblp.org/pers/hd/l/Lim:Hyeontaek", "Viktor Leis.....http://dblp.org/pers/hd/l/Leis:Viktor", "Huanchen Zhang.....http://dblp.org/pers/hd/z/Zhang:Huanchen", "Michael Kaminsky.....http://dblp.org/pers/hd/k/Kaminsky:Michael", "David G. Andersen.....http://dblp.org/pers/hd/a/Andersen:David_G="], "pages": 16}