{"title": "The Cost of Digital Advertisement: Comparing User and Advertiser Views.", "fields": ["personalized marketing", "download", "byte", "newspaper", "web traffic"], "abstract": "Digital advertisements are delivered in the form of static images, animations or videos, and their purpose is to deliver a message to desktop or mobile users and promote a product, a service or an idea. Thus, the message’s promoter, or advertiser, pays a monetary cost to buy ad-space in a content provider’s medium (e.g., website) to place their advertisement in the consumer’s display. However, is it only the advertiser who pays for the advertisement delivery? Unlike traditional advertisements in mediums such as newspapers, TVs or radio, in the digital world, the end-users are also paying a cost for the advertisement delivery. Whilst the cost on the advertiser’s side is clearly monetary, on the end-user, it includes both quantifiable costs, such as network requests and transferred bytes, and qualitative costs such as privacy loss to the ad ecosystem. In this study, we aim to increase user awareness regarding the hidden costs of digital advertisement in mobile devices, and compare the user and advertiser views. Specifically, we built OpenDAMP, a transparency tool that passively analyzes users’ web traffic and estimates the costs of advertising for both users and advertisers. Using OpenDAMP, we measure the ad-related costs from both sides in a large, year-long dataset of 1270 real mobile users. Juxtaposing the costs of both sides, we identify a clear imbalance: the advertisers pay several times less to deliver ads to end-users, than the cost paid by the users to download these ads. In addition, the majority of users experience a significant privacy loss to the ad-ecosystem, through the received personalized advertisements and their delivery mechanics.", "citation": "Citations (3)", "departments": ["Foundation for Research & Technology – Hellas", "Telefónica", "FORTH-ICS, Heraklion, Greece"], "authors": ["Panagiotis Papadopoulos.....http://dblp.org/pers/hd/p/Papadopoulos:Panagiotis", "Nicolas Kourtellis.....http://dblp.org/pers/hd/k/Kourtellis:Nicolas", "Evangelos P. Markatos.....http://dblp.org/pers/hd/m/Markatos:Evangelos_P="], "conf": "www", "year": "2018", "pages": 11}