{"title": "A tale of two cities: how WebView induces bugs to Android applications.", "fields": ["world wide web", "android", "graphical user interface testing", "machine code", "theoretical computer science"], "abstract": "WebView is a widely used Android component that augments a native app with web browser capabilities. It eases the interactions between an app’s native code and web code. However, the interaction mechanism of WebView induces new types of bugs in Android apps. Understanding the characteristics and manifestation of these WebView-induced bugs (ωBugs for short) facilitates the correct usages of WebViews in Android apps. This motivates us to conduct the first empirical study on ωBugs based on those found in popular open-source Android apps. Our study identified the major root causes and consequences of ωBugs and made interesting observations that can be leveraged for detecting and diagnosing ωBugs. Based on the empirical study, we further propose an automated testing technique ωDroid to effectively expose ωBugs in Android apps. In our experiments, ωDroid successfully discovered 30 unique and previously-unknown ωBugs when applied to 146 open-source Android apps. We reported the 30 ωBugs to the corresponding app developers. Out of these 30 ωBugs, 14 were confirmed and 7 of them were fixed. This shows that ωDroid can effectively detect ωBugs that are of the developers’ concern.", "citation": "Citations (1)", "departments": ["Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology", "University of Science and Technology, Sana'a", "Hong Kong University of Science and Technology", "Hong Kong University of Science and Technology"], "authors": ["Jiajun Hu.....http://dblp.org/pers/hd/h/Hu:Jiajun", "Lili Wei.....http://dblp.org/pers/hd/w/Wei:Lili", "Yepang Liu.....http://dblp.org/pers/hd/l/Liu:Yepang", "Shing-Chi Cheung.....http://dblp.org/pers/hd/c/Cheung:Shing=Chi", "Huaxun Huang.....http://dblp.org/pers/hd/h/Huang:Huaxun"], "conf": "kbse", "year": "2018", "pages": 12}