{"title": "Hybrid Point Cloud Attribute Compression Using Slice-based Layered Structure and Block-based Intra Prediction.", "fields": ["lagrange multiplier", "algorithmic efficiency", "point cloud", "entropy encoding", "spatial correlation"], "abstract": "Point cloud compression is a key enabler for the emerging applications of immersive visual communication, autonomous driving and smart cities, etc. In this paper, we propose a hybrid point cloud attribute compression scheme built on an original layered data structure. First, a slice-partition scheme and geometry-adaptive k dimensional-tree (kd-tree) method are devised to generate the four-layer structure. Second, we introduce an efficient block-based intra prediction scheme containing a DC prediction mode and several angular modes, in order to exploit the spatial correlation between adjacent points. Third, an adaptive transform scheme based on Graph Fourier Transform (GFT) is Lagrangian optimized to achieve better transform efficiency. The Lagrange multiplier is off-line derived based on the statistics of color attribute coding. Last but not least, multiple reordering scan modes are dedicated to improve coding efficiency for entropy coding. In intra-frame compression of point cloud color attributes, results demonstrate that our method performs better than the state-of-the-art region-adaptive hierarchical transform (RAHT) system, and on average a 29.37$\\%$ BD-rate gain is achieved. Comparing with the test model for category 1 (TMC1) anchor's coding results, which were recently published by MPEG-3DG group on 121st meeting, a 16.37$\\%$ BD-rate gain is obtained.", "citation": "Not cited", "year": "2018", "departments": ["Peking University", "Peking University", "Peking University", "University of Missouri–Kansas City", "University of Missouri–Kansas City"], "conf": "mm", "authors": ["Yiting Shao.....http://dblp.org/pers/hd/s/Shao:Yiting", "Qi Zhang.....http://dblp.org/pers/hd/z/Zhang:Qi", "Ge Li.....http://dblp.org/pers/hd/l/Li:Ge", "Zhu Li.....http://dblp.org/pers/hd/l/Li:Zhu", "Li Li.....http://dblp.org/pers/hd/l/Li:Li"], "pages": 9}