{"title": "Hierarchical Nonlinear Orthogonal Adaptive-Subspace Self-Organizing Map Based Feature Extraction for Human Action Recognition.", "fields": ["deep learning", "subspace topology", "labeled data", "self organizing map", "kernel method"], "abstract": "Feature extraction is a critical step in the task of action recognition. Hand-crafted features are often restricted because of their fixed forms and deep learning features are more effective but need large-scale labeled data for training. In this paper, we propose a new hierarchical Nonlinear Orthogonal Adaptive-Subspace Self-Organizing Map (NOASSOM) to  \n\tadaptively and learn effective features from data without supervision. NOASSOM is extended from Adaptive-Subspace Self-Organizing Map (ASSOM) which only deals with linear data and is trained with supervision by the labeled data. Firstly, by adding a nonlinear orthogonal map layer, NOASSOM is able to handle the nonlinear input data and it avoids defining the specific form of the nonlinear orthogonal map by a kernel trick. Secondly, we modify loss function of ASSOM such that every input sample is used to train model individually. In this way, NOASSOM effectively learns the statistic patterns from data without supervision. Thirdly, we propose a hierarchical NOASSOM to extract more representative  \n\tfeatures. Finally, we apply the proposed hierarchical NOASSOM  \n\tto efficiently describe the appearance and motion information  \n\taround trajectories for action recognition. Experimental  \n\tresults on widely used datasets show that our method has  \n\tsuperior performance than many state-of-the-art hand-crafted  \n\tfeatures and deep learning features based methods.", "citation": "Not cited", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Yang Du.....http://dblp.org/pers/hd/d/Du:Yang", "Chunfeng Yuan.....http://dblp.org/pers/hd/y/Yuan:Chunfeng", "Bing Li.....http://dblp.org/pers/hd/l/Li:Bing", "Weiming Hu.....http://dblp.org/pers/hd/h/Hu:Weiming", "Hao Yang.....http://dblp.org/pers/hd/y/Yang:Hao", "Zhikang Fu.....http://dblp.org/pers/hd/f/Fu:Zhikang", "Lili Zhao.....http://dblp.org/pers/hd/z/Zhao:Lili"], "conf": "aaai", "year": "2018", "pages": 8}