{"title": "The Price of Usability: Designing Operationalizable Strategies for Security Games.", "fields": ["cardinality", "adversary", "predictability", "operationalization", "strategy"], "abstract": "We consider the problem of allocating scarce security resources among heterogeneous targets to thwart a possible attack. It is well known that deterministic solutions to this problem being highly predictable are severely suboptimal. To mitigate this predictability, the game-theoretic security game model was proposed which randomizes over pure ( deterministic) strategies, causing confusion in the adversary. Unfortunately, such mixed strategies typically randomize over a large number of strategies, requiring security personnel to be familiar with numerous protocols, making them hard to operationalize. Motivated by these practical considerations, we propose an easy to use approach for computing strategies that are easy to operationalize and that bridge the gap between the static solution and the optimal mixed strategy. These strategies only randomize over an optimally chosen subset of p ure strategies whose cardinality is selected by the defender, enabling them to conveniently tune the trade-off between ease of operationalization and efficiency using a single design parameter. We show that the problem of computing such operationalizable strategies is NP-hard, formulate it as a mixedinteger optimization problem, provide an algorithm for computing e-optinal equilibria, and an efficient heuristic. We evaluate the performance of our approach on the problem of screening for threats at airports and show that the Price of Usability, i.e., the loss in optimality to obtain a strategy that is easier to operationalize, is typically not high.", "citation": "Not cited", "departments": ["University of Southern California", "University of Twente", "University of Southern California", "University of Southern California", "University of Michigan"], "authors": ["Sara Marie McCarthy.....http://dblp.org/pers/hd/m/McCarthy:Sara_Marie", "Corine M. Laan.....http://dblp.org/pers/hd/l/Laan:Corine_M=", "Kai Wang.....http://dblp.org/pers/hd/w/Wang:Kai", "Phebe Vayanos.....http://dblp.org/pers/hd/v/Vayanos:Phebe", "Arunesh Sinha.....http://dblp.org/pers/hd/s/Sinha:Arunesh", "Milind Tambe.....http://dblp.org/pers/hd/t/Tambe:Milind"], "conf": "ijcai", "year": "2018", "pages": 7}