{"title": "Blind, Adaptive and Robust Flow Segmentation in Datacenters.", "fields": ["openflow", "controller", "control channel", "stochastic approximation", "traffic classification"], "abstract": "—To optimize routing of flows in datacenters, SDN controllers receive a packet-in message whenever a new flow appears in the network. Unfortunately, flow arrival rates can peak to millions per second, impairing the ability of controllers to treat them on time. Flow scheduling copes with such sheer numbers by segmenting the traffic between elephant and mice flows and by treating elephant flows in priority, as they disrupt short lived TCP flows and create bottlenecks. We propose a learning algorithm called SOFIA and able to perform optimal online flow segmentation. Our solution, based on stochastic approximation techniques, is implemented at the switch level and updated by the controller, with minimal signaling over the control channel. SOFIA is blind, i.e., it is oblivious to the flow size distribution. It is also adaptive, since it can track traffic variations over time. We prove its convergence properties and its message complexity. Moreover, we specialize our solution to be robust to traffic classification errors. Extensive numerical experiments characterize the performance of our approach in vitro. Finally, results of the implementation in a real OpenFlow controller demonstrate the viability of SOFIA as a solution in production environments.", "citation": "Not cited", "departments": ["fondazione bruno kessler", "Huawei", "French Institute for Research in Computer Science and Automation", "Huawei", "CREATE-NET, Italy"], "authors": ["Francesco De Pellegrini.....http://dblp.org/pers/hd/p/Pellegrini:Francesco_De", "Lorenzo Maggi.....http://dblp.org/pers/hd/m/Maggi:Lorenzo", "Antonio Massaro.....http://dblp.org/pers/hd/m/Massaro:Antonio", "Damien Saucez.....http://dblp.org/pers/hd/s/Saucez:Damien", "Jeremie Leguay.....http://dblp.org/pers/hd/l/Leguay:Jeremie", "Eitan Altman.....http://dblp.org/pers/hd/a/Altman:Eitan"], "conf": "infocom", "year": "2018", "pages": 9}