{"title": "Feedback-Guided Anomaly Discovery via Online Optimization.", "fields": ["information technology audit", "anomaly detection", "false positive paradox", "online optimization", "ranking"], "abstract": "Anomaly detectors are often used to produce a ranked list of statistical anomalies, which are examined by human analysts in order to extract the actual anomalies of interest. This can be exceedingly difficult and time consuming when most high-ranking anomalies are false positives and not interesting from an application perspective. In this paper, we study how to reduce the analyst's effort by incorporating their feedback about whether the anomalies they investigate are of interest or not. In particular, the feedback will be used to adjust the anomaly ranking after every analyst interaction, ideally moving anomalies of interest closer to the top. Our main contribution is to formulate this problem within the framework of online convex optimization, which yields an efficient and extremely simple approach to incorporating feedback compared to the prior state-of-the-art. We instantiate this approach for the powerful class of tree-based anomaly detectors and conduct experiments on a range of benchmark datasets. The results demonstrate the utility of incorporating feedback and advantages of our approach over the state-of-the-art. In addition, we present results on a significant cybersecurity application where the goal is to detect red-team attacks in real system audit data. We show that our approach for incorporating feedback is able to significantly reduce the time required to identify malicious system entities across multiple attacks on multiple operating systems.", "citation": "Not cited", "departments": ["Oregon State University", "Oregon State University", "Oregon State University", "Galois, Inc., P ... rtland, OR, USA", "Galois, Inc., P ... rtland, OR, USA"], "authors": ["Md Amran Siddiqui.....http://dblp.org/pers/hd/s/Siddiqui:Md_Amran", "Alan Fern.....http://dblp.org/pers/hd/f/Fern:Alan", "Thomas G. Dietterich.....http://dblp.org/pers/hd/d/Dietterich:Thomas_G=", "Ryan Wright.....http://dblp.org/pers/hd/w/Wright:Ryan", "Alec Theriault.....http://dblp.org/pers/hd/t/Theriault:Alec", "David W. Archer.....http://dblp.org/pers/hd/a/Archer:David_W="], "conf": "kdd", "year": "2018", "pages": 10}