{"title": "Investigating the Effects of Anthropomorphic Fidelity of Self-Avatars on Near Field Depth Perception in Immersive Virtual Environments.", "fields": ["immersion", "near and far field", "fidelity", "high fidelity", "depth perception"], "abstract": "Immersive Virtual Environments (IVEs) are becoming more accessible and more widely utilized for training. Previous research has shown that the matching of visual and proprioceptive information is important for calibration. While research has demonstrated that self-avatars can enhance ones' sense of presence and improve distance perception, the effects of self-avatar fidelity on near field distance estimations has yet to be investigated. This study tested the effect of avatar fidelity on the accuracy of distance estimations in the near-field. Performance with a virtual avatar was also compared to real-world performance. Three levels of fidelity were tested; 1) an immersive self-avatar with realistic limbs, 2) a low-fidelity self-avatar showing only joint locations, and 3) end-effector only. The results suggest that reach estimations become more accurate as the visual fidelity of the avatar increases, with accuracy for high fidelity avatars approaching real-world performance as compared to low-fidelity and end-effector conditions. In all conditions reach estimations became more accurate after receiving feedback during a calibration phase.", "citation": "Citations (1)", "departments": ["University of North Carolina at Wilmington", "University of North Carolina at Wilmington", "University of North Carolina at Wilmington", "University of North Carolina at Wilmington", "University of North Carolina at Wilmington"], "authors": ["Elham Ebrahimi.....http://dblp.org/pers/hd/e/Ebrahimi:Elham", "Leah S. Hartman.....http://dblp.org/pers/hd/h/Hartman:Leah_S=", "Andrew Robb.....http://dblp.org/pers/hd/r/Robb:Andrew", "Christopher C. Pagano.....http://dblp.org/pers/hd/p/Pagano:Christopher_C=", "Sabarish V. Babu.....http://dblp.org/pers/hd/b/Babu:Sabarish_V="], "conf": "vr", "year": "2018", "pages": 8}