{"title": "A Unified Approach to Quantifying Algorithmic Unfairness: Measuring Individual &Group Unfairness via Inequality Indices.", "fields": ["machine learning", "inequality", "artificial intelligence", "welfare economics", "fairness measure"], "abstract": "Discrimination via algorithmic decision making has received considerable attention. Prior work largely focuses on defining conditions for fairness, but does not define satisfactory measures of algorithmic unfairness. In this paper, we focus on the following question: Given two unfair algorithms, how should we determine which of the two is more unfair? Our core idea is to use existing inequality indices from economics to measure how unequally the outcomes of an algorithm benefit different individuals or groups in a population. Our work offers a justified and general framework to compare and contrast the (un)fairness of algorithmic predictors. This unifying approach enables us to quantify unfairness both at the individual and the group level. Further, our work reveals overlooked tradeoffs between different fairness notions: using our proposed measures, the overall individual-level unfairness of an algorithm can be decomposed into a between-group and a within-group component. Earlier methods are typically designed to tackle only between-group un- fairness, which may be justified for legal or other reasons. However, we demonstrate that minimizing exclusively the between-group component may, in fact, increase the within-group, and hence the overall unfairness. We characterize and illustrate the tradeoffs between our measures of (un)fairness and the prediction accuracy.", "citation": "Not cited", "departments": ["ETH Zurich", "MPI-SWS, Saarbruecken, Germany", "MPI-SWS, Saarbruecken, Germany", "MPI-SWS, Saarbruecken, Germany", "MPI-SWS, Saarbruecken, Germany"], "authors": ["Till Speicher.....http://dblp.org/pers/hd/s/Speicher:Till", "Hoda Heidari.....http://dblp.org/pers/hd/h/Heidari:Hoda", "Nina Grgic-Hlaca.....http://dblp.org/pers/hd/g/Grgic=Hlaca:Nina", "Krishna P. Gummadi.....http://dblp.org/pers/hd/g/Gummadi:Krishna_P=", "Adish Singla.....http://dblp.org/pers/hd/s/Singla:Adish", "Adrian Weller.....http://dblp.org/pers/hd/w/Weller:Adrian", "Muhammad Bilal Zafar.....http://dblp.org/pers/hd/z/Zafar:Muhammad_Bilal"], "conf": "kdd", "year": "2018", "pages": 10}