{"title": "Ray: A Distributed Framework for Emerging AI Applications.", "fields": ["scaling", "computer data storage", "programming paradigm", "applications of artificial intelligence", "reinforcement learning"], "abstract": "The next generation of AI applications will continuously interact with the environment and learn from these interactions. These applications impose new and demanding systems requirements, both in terms of performance and flexibility. In this paper, we consider these requirements and present Ray---a distributed system to address them. Ray implements a dynamic task graph computation model that supports both the task-parallel and the actor programming models. To meet the performance requirements of AI applications, we propose an architecture that logically centralizes the system's control state using a sharded storage system and a novel bottom-up distributed scheduler. In our experiments, we demonstrate sub-millisecond remote task latencies and linear throughput scaling beyond 1.8 million tasks per second. We empirically validate that Ray speeds up challenging benchmarks and serves as both a natural and performant fit for an emerging class of reinforcement learning applications and algorithms.", "citation": "Citations (2)", "year": "2018", "departments": [], "conf": "osdi", "authors": ["Philipp Moritz.....http://dblp.org/pers/hd/m/Moritz:Philipp", "Robert Nishihara.....http://dblp.org/pers/hd/n/Nishihara:Robert", "Stephanie Wang.....http://dblp.org/pers/hd/w/Wang:Stephanie", "Alexey Tumanov.....http://dblp.org/pers/hd/t/Tumanov:Alexey", "Richard Liaw.....http://dblp.org/pers/hd/l/Liaw:Richard", "Eric Liang.....http://dblp.org/pers/hd/l/Liang:Eric", "Melih Elibol.....http://dblp.org/pers/hd/e/Elibol:Melih", "Zongheng Yang.....http://dblp.org/pers/hd/y/Yang:Zongheng", "William Paul.....http://dblp.org/pers/hd/p/Paul:William", "Michael I. Jordan.....http://dblp.org/pers/hd/j/Jordan:Michael_I=", "Ion Stoica.....http://dblp.org/pers/hd/s/Stoica:Ion"], "pages": 17}