{"title": "Detecting Vehicle Illegal Parking Events using Sharing Bikes' Trajectories.", "fields": ["beijing", "urban planning", "cloud computing", "urban computing", "jams"], "abstract": "Illegal vehicle parking is a common urban problem faced by major cities in the world, as it incurs traffic jams, which lead to air pollution and traffic accidents. Traditional approaches to detect illegal vehicle parking events rely highly on active human efforts, e.g., police patrols or surveillance cameras. However, these approaches are extremely ineffective to cover a large city. The massive and high quality sharing bike trajectories from Mobike offer us with a unique opportunity to design a ubiquitous illegal parking detection system, as most of the illegal parking events happen at curbsides and have significant impact on the bike users. Two main components are employed to mine the trajectories in our system: 1)~trajectory pre-processing, which filters outlier GPS points, performs map-matching and builds indexes for bike trajectories; and 2)~illegal parking detection, which models the normal trajectories, extracts features from the evaluation trajectories and utilizes a distribution test-based method to discover the illegal parking events. The system is deployed on the cloud internally used by Mobike. Finally, extensive experiments and many insightful case studies based on the massive trajectories in Beijing are presented.", "citation": "Not cited", "departments": ["Harbin Institute of Technology", "Xidian University", "Xidian University", "Worcester Polytechnic Institute", "Urban Computing ...  Beijing, China"], "authors": ["Tianfu He.....http://dblp.org/pers/hd/h/He:Tianfu", "Jie Bao.....http://dblp.org/pers/hd/b/Bao_0003:Jie", "Ruiyuan Li.....http://dblp.org/pers/hd/l/Li:Ruiyuan", "Sijie Ruan.....http://dblp.org/pers/hd/r/Ruan:Sijie", "Yanhua Li.....http://dblp.org/pers/hd/l/Li:Yanhua", "Chao Tian.....http://dblp.org/pers/hd/t/Tian:Chao", "Yu Zheng.....http://dblp.org/pers/hd/z/Zheng:Yu"], "conf": "kdd", "year": "2018", "pages": 10}