{"title": "WSNet: Compact and Efficient Networks Through Weight Sampling.", "fields": ["convolution", "deep learning", "convolutional neural network", "fold", "architecture", "computation"], "abstract": "We present a new approach and a novel architecture, termed WSNet, for learning compact and efficient deep neural networks. Existing approaches conventionally learn full model parameters independently at first and then compress them via ad hoc processing like model pruning or filter factorization. Different from them, WSNet proposes learning model parameters by sampling from a compact set of learnable parameters, which naturally enforces parameter sharing throughout the learning process. We show that such novel weight sampling approach (and induced WSNet) promotes both weights and computation sharing favorably. It can more efficiently learn much smaller networks with competitive performance, compared to baseline networks with equal number of convolution filters. Specifically, we consider learning compact and efficient 1D convolutional neural networks for audio classification. Extensive experiments on multiple audio classification datasets verify the effectiveness of WSNet. Combined with weight quantization, the resulted models are up to 180x smaller and theoretically up to 16x faster than the well-established baselines, without noticeable performance drop.", "citation": "Not cited", "departments": ["National University of Singapore", "University of Illinois at Urbana–Champaign", "National University of Singapore", "National University of Singapore", "University of Illinois at Urbana–Champaign", "Adobe Systems", "National University of Singapore", "Snap", "Snap"], "authors": ["Xiaojie Jin.....http://dblp.org/pers/hd/j/Jin:Xiaojie", "Yingzhen Yang.....http://dblp.org/pers/hd/y/Yang:Yingzhen", "Ning Xu.....http://dblp.org/pers/hd/x/Xu:Ning", "Jianchao Yang.....http://dblp.org/pers/hd/y/Yang:Jianchao", "Nebojsa Jojic.....http://dblp.org/pers/hd/j/Jojic:Nebojsa", "Jiashi Feng.....http://dblp.org/pers/hd/f/Feng:Jiashi", "Shuicheng Yan.....http://dblp.org/pers/hd/y/Yan:Shuicheng"], "conf": "icml", "year": "2018", "pages": 10}