{"title": "The Paulsen problem, continuous operator scaling, and smoothed analysis.", "fields": ["infimum and supremum", "open problem", "square", "operator theory", "parseval s theorem"], "abstract": "The Paulsen problem is a basic open problem in operator theory: Given vectors  u  1 , …,  u   n   ∈ ℝ  d   that are є-nearly satisfying the Parseval’s condition and the equal norm condition, is it close to a set of vectors  v  1 , …,  v   n   ∈ ℝ  d   that exactly satisfy the Parseval’s condition and the equal norm condition? Given  u  1 , …,  u   n  , the squared distance (to the set of exact solutions) is defined as inf  v   ∑  i =1   n   ||  u   i   −  v   i   || 2  2  where the infimum is over the set of exact solutions. Previous results show that the squared distance of any є-nearly solution is at most  O ( poly ( d , n ,є)) and there are є-nearly solutions with squared distance at least Ω( d  є). The fundamental open question is whether the squared distance can be independent of the number of vectors  n .    We answer this question affirmatively by proving that the squared distance of any є-nearly solution is  O ( d  13/2  є). Our approach is based on a continuous version of the operator scaling algorithm and consists of two parts. First, we define a dynamical system based on operator scaling and use it to prove that the squared distance of any є-nearly solution is  O ( d  2   n  є). Then, we show that by randomly perturbing the input vectors, the dynamical system will converge faster and the squared distance of an є-nearly solution is  O ( d  5/2  є) when  n  is large enough and є is small enough. To analyze the convergence of the dynamical system, we develop some new techniques in lower bounding the operator capacity, a concept introduced by Gurvits to analyzing the operator scaling algorithm.", "citation": "Citations (2)", "departments": ["University of Waterloo", "University of Waterloo", "University of Washington"], "authors": ["Tsz Chiu Kwok.....http://dblp.org/pers/hd/k/Kwok:Tsz_Chiu", "Lap Chi Lau.....http://dblp.org/pers/hd/l/Lau:Lap_Chi", "Yin Tat Lee.....http://dblp.org/pers/hd/l/Lee:Yin_Tat", "Akshay Ramachandran.....http://dblp.org/pers/hd/r/Ramachandran:Akshay"], "conf": "stoc", "year": "2018", "pages": 8}