{"title": "A Structured Approach to Understanding Recovery and Relapse in AA.", "fields": ["social media", "interaction network", "alcohol use disorder", "joins", "graphical model"], "abstract": "Alcoholism, also known as Alcohol Use Disorder (AUD) is a serious problem affecting millions of people worldwide. Recovery from AUD is known to be challenging and often leads to relapse at various points after enrolling in a rehabilitation program such as Alcoholics Anonymous (AA). In this work, we take a structured approach to understand recovery and relapse from AUD using social media data. To do so, we combine linguistic and psychological attributes of users with relational features that capture useful structure in the user interaction network. We evaluate our models on AA-attending users extracted from the Twitter social network and predict recovery at two different points—90-days and 1 year after the user joins AA, respectively. Our experiments reveal that our structured approach is helpful in predicting recovery in these users. We perform extensive quantitative analysis of different groups of features and dependencies among them. Our analysis sheds light on the role of each feature group and how they combine to predict recovery and relapse. Finally, we present qualitative analysis of different reasons behind users relapsing to AUD. Our models and analysis are helpful in making meaningful predictions in scenarios where only a subset of features are available. Our analysis can potentially be helpful in identifying and preventing relapse early.", "citation": "Not cited", "departments": ["Binghamton University", "Binghamton University", "University of Maryland, College Park", "University of California, Santa Cruz", "University of California, Santa Cruz"], "authors": ["Yue Zhang.....http://dblp.org/pers/hd/z/Zhang:Yue", "Arti Ramesh.....http://dblp.org/pers/hd/r/Ramesh:Arti", "Jennifer Golbeck.....http://dblp.org/pers/hd/g/Golbeck:Jennifer", "Dhanya Sridhar.....http://dblp.org/pers/hd/s/Sridhar:Dhanya", "Lise Getoor.....http://dblp.org/pers/hd/g/Getoor:Lise"], "conf": "www", "year": "2018", "pages": 10}