{"title": "Shape of diffusion and size of monochromatic region of a two-dimensional spin system.", "fields": ["concentration inequality", "exponential distribution", "asynchronous cellular automaton", "ising model", "spatial network"], "abstract": "We consider an agent-based distributed algorithm with exponentially distributed waiting times in which agents with binary states interact locally over a geometric graph, and based on this interaction and on the value of a common intolerance threshold τ, decide whether to change their states. This model is equivalent to an Asynchronous Cellular Automaton (ACA) with extended Moore neighborhoods, a zero-temperature Ising model with Glauber dynamics, or a Schelling model of self-organized segregation in an open system, and has applications in the analysis of social and biological networks, and spin glasses systems.    We prove a shape theorem for the spread of the “affected” nodes during the process dynamics and show that in the steady state, for τ ∈ (τ * ,1−τ * ) ∖ {1/2}, where τ *  ≈ 0.488, the size of the “mono-chromatic region” at the end of the process is at least exponential in the size of the local neighborhood of interaction with probability approaching one as  N  grows. Combined with previous results on the expected size of the monochromatic region that provide a matching upper bound, this implies that in the steady state the size of the monochromatic region of any agent is exponential with high probability for the mentioned interval of τ. The shape theorem is based on a novel concentration inequality for the spreading time, and provides a precise geometrical description of the process dynamics. The result on the size of the monochromatic region considerably extends our understanding of the steady state. Showing convergence with high probability, it rules out the possibility that only a small fraction of the nodes are eventually contained in large monochromatic regions, which was left open by previous works.", "citation": "Not cited", "departments": ["University of California, San Diego", "University of California, San Diego"], "authors": ["Hamed Omidvar.....http://dblp.org/pers/hd/o/Omidvar:Hamed", "Massimo Franceschetti.....http://dblp.org/pers/hd/f/Franceschetti:Massimo"], "conf": "stoc", "year": "2018", "pages": 14}