{"title": "TEM: Tree-enhanced Embedding Model for Explainable Recommendation.", "fields": ["user identifier", "demographics", "embedding", "collaborative filtering", "decision rule"], "abstract": "While collaborative filtering is the dominant technique in personalized recommendation, it models user-item interactions only and cannot provide concrete reasons for a recommendation. Meanwhile, the rich side information affiliated with user-item interactions (e.g., user demographics and item attributes), which provide valuable evidence that why a recommendation is suitable for a user, has not been fully explored in providing explanations. On the technical side, embedding-based methods, such as Wide&Deep and neural factorization machines, provide state-of-the-art recommendation performance. However, they work like a black-box, for which the reasons underlying a prediction cannot be explicitly presented. On the other hand, tree-based methods like decision trees predict by inferring decision rules from data. While being explainable, they cannot generalize to unseen feature interactions thus fail in collaborative filtering applications. In this work, we propose a novel solution named Tree-enhanced Embedding Method that combines the strengths of embedding-based and tree-based models. We first employ a tree-based model to learn explicit decision rules (a.k.a., cross features) from the rich side information. We next design an embedding model that can incorporate explicit cross features and generalize to unseen cross features on user ID and item ID. At the core of our embedding method is an easy-to-interpret attention network, making the recommendation process fully transparent and explainable. We conduct experiments on two datasets of tourist attraction and restaurant recommendation, demonstrating the superior performance and explainability of our solution.", "citation": "Citations (5)", "departments": ["National University of Singapore", "National University of Singapore", "National University of Singapore", "Shandong University", "National University of Singapore"], "authors": ["Xiang Wang.....http://dblp.org/pers/hd/w/Wang:Xiang", "Xiangnan He.....http://dblp.org/pers/hd/h/He_0001:Xiangnan", "Fuli Feng.....http://dblp.org/pers/hd/f/Feng:Fuli", "Liqiang Nie.....http://dblp.org/pers/hd/n/Nie:Liqiang", "Tat-Seng Chua.....http://dblp.org/pers/hd/c/Chua:Tat=Seng"], "conf": "www", "year": "2018", "pages": 10}