{"title": "Deep Adversarial Learning for Multi-Modality Missing Data Completion.", "fields": ["deep learning", "modalities", "missing data", "neuroimaging", "adversarial system"], "abstract": "Multi-modality data are widely used in clinical applications, such as tumor detection and brain disease diagnosis. Different modalities can usually provide complementary information, which commonly leads to improved performance. However, some modalities are commonly missing for some subjects due to various technical and practical reasons. As a result, multi-modality data are usually incomplete, raising the multi-modality missing data completion problem. In this work, we formulate the problem as a conditional image generation task and propose an encoder-decoder deep neural network to tackle this problem. Specifically, the model takes the existing modality as input and generates the missing modality. By employing an auxiliary adversarial loss, our model is able to generate high-quality missing modality images. At the same time, we propose to incorporate the available category information of subjects in training to enable the model to generate more informative images. We evaluate our method on the Alzheimer's Disease Neuroimaging Initiative~(ADNI) database, where positron emission tomography~(PET) modalities are missing. Experimental results show that the trained network can generate high-quality PET modalities based on existing magnetic resonance imaging~(MRI) modalities, and provide complementary information to improve the detection and tracking of the Alzheimer's disease. Our results also show that the proposed methods generate higher quality images than baseline methods as measured by various image quality statistics.", "citation": "Not cited", "departments": ["Washington State University", "Washington State University", "Washington State University", "University of North Carolina at Chapel Hill", "Washington State University"], "authors": ["Lei Cai.....http://dblp.org/pers/hd/c/Cai:Lei", "Zhengyang Wang.....http://dblp.org/pers/hd/w/Wang:Zhengyang", "Hongyang Gao.....http://dblp.org/pers/hd/g/Gao:Hongyang", "Dinggang Shen.....http://dblp.org/pers/hd/s/Shen:Dinggang", "Shuiwang Ji.....http://dblp.org/pers/hd/j/Ji:Shuiwang"], "conf": "kdd", "year": "2018", "pages": 9}