{"title": "HPVM: heterogeneous parallel virtual machine.", "fields": ["multi core processor", "executable", "optimizing compiler", "software portability", "instruction set"], "abstract": "We propose a parallel program representation for heterogeneous systems, designed to enable performance portability across a wide range of popular parallel hardware, including GPUs, vector instruction sets, multicore CPUs and potentially FPGAs. Our representation, which we call HPVM, is  a hierarchical dataflow graph with shared memory and vector instructions.  HPVM supports three important capabilities for programming heterogeneous systems: a compiler intermediate representation (IR), a virtual instruction set (ISA), and a basis for runtime scheduling; previous systems focus on only one of these capabilities. As a compiler IR, HPVM aims to enable effective code generation and optimization for heterogeneous systems. As a virtual ISA, it can be used to ship executable programs, in order to achieve both functional portability and performance portability across such systems. At runtime, HPVM enables flexible scheduling policies, both through the graph structure and the ability to compile individual nodes in a program to any of the target devices on a system. We have implemented a prototype HPVM system, defining the HPVM IR as an extension of the LLVM compiler IR, compiler optimizations that operate directly on HPVM graphs, and code generators that translate the virtual ISA to NVIDIA GPUs, Intel's AVX vector units, and to multicore X86-64 processors. Experimental results show that HPVM optimizations achieve significant performance improvements, HPVM translators achieve performance competitive with manually developed OpenCL code for both GPUs and vector hardware, and that runtime scheduling policies can make use of both program and runtime information to exploit the flexible compilation capabilities. Overall, we conclude that the HPVM representation is a promising basis for achieving performance portability and for implementing parallelizing compilers for heterogeneous parallel systems.", "citation": "Not cited", "year": "2018", "departments": ["University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "University of Illinois at Urbana–Champaign", "Qualcomm", "University of Illinois at Urbana–Champaign"], "conf": "ppopp", "authors": ["Maria Kotsifakou.....http://dblp.org/pers/hd/k/Kotsifakou:Maria", "Prakalp Srivastava.....http://dblp.org/pers/hd/s/Srivastava:Prakalp", "Matthew D. Sinclair.....http://dblp.org/pers/hd/s/Sinclair:Matthew_D=", "Rakesh Komuravelli.....http://dblp.org/pers/hd/k/Komuravelli:Rakesh", "Vikram S. Adve.....http://dblp.org/pers/hd/a/Adve:Vikram_S=", "Sarita V. Adve.....http://dblp.org/pers/hd/a/Adve:Sarita_V="], "pages": 13}