{"title": "Progress & Compress: A scalable framework for continual learning.", "fields": ["fold", "active learning", "reinforcement learning", "scalability", "forgetting"], "abstract": "We introduce a conceptually simple and scalable framework for continual learning domains where tasks are learned sequentially. Our method is constant in the number of parameters and is designed to preserve performance on previously encountered tasks while accelerating learning progress on subsequent problems. This is achieved through training two neural networks: A knowledge base, capable of solving previously encountered problems, which is connected to an active column that is employed to efficiently learn the current task. After learning a new task, the active column is distilled into the knowledge base, taking care to protect any previously learnt tasks. This cycle of active learning (progression) followed by consolidation (compression) requires no architecture growth, no access to or storing of previous data or tasks, and no task-specific parameters. Thus, it is a learning process that may be sustained over a lifetime of tasks while supporting forward transfer and minimising forgetting. We demonstrate the progress & compress approach on sequential classification of handwritten alphabets as well as two reinforcement learning domains: Atari games and 3D maze navigation.", "citation": "Citations (2)", "departments": ["University of Oxford", "DeepMind", "DeepMind", "DeepMind", "DeepMind"], "authors": ["Jonathan Schwarz.....http://dblp.org/pers/hd/s/Schwarz:Jonathan", "Wojciech Czarnecki.....http://dblp.org/pers/hd/c/Czarnecki_0001:Wojciech", "Jelena Luketina.....http://dblp.org/pers/hd/l/Luketina:Jelena", "Agnieszka Grabska-Barwinska.....http://dblp.org/pers/hd/g/Grabska=Barwinska:Agnieszka", "Yee Whye Teh.....http://dblp.org/pers/hd/t/Teh:Yee_Whye", "Razvan Pascanu.....http://dblp.org/pers/hd/p/Pascanu:Razvan", "Raia Hadsell.....http://dblp.org/pers/hd/h/Hadsell:Raia"], "conf": "icml", "year": "2018", "pages": 10}