{"title": "GenAx: A Genome Sequencing Accelerator.", "fields": ["genomics", "speedup", "dna sequencing", "reference genome", "hardware acceleration"], "abstract": "Genomics can transform health-care through precision medicine. Plummeting sequencing costs would soon make genome testing affordable to the masses. Compute efficiency, however, has to improve by orders of magnitude to sequence and analyze the raw genome data. Sequencing software used today can take several hundreds to thousands of CPU hours to align reads to a reference sequence.   This paper presents GenAx, an accelerator for read alignment, a time-consuming step in genome sequencing. It consists of a seeding and seed-extension accelerator. The latter is based on an innovative automata design that was designed from the ground-up to enable hardware acceleration. Unlike conventional Levenshtein automata, it is string independent and scales quadratically with edit distance, instead of string length. It supports critical features commonly used in sequencing such as affine gap scoring and traceback.   GenAx provides a throughput of 4,058K reads/s for Illumina 101 bp reads. GenAx achieves 31.7x speedup over the standard BWA-MEM sequence aligner running on a 56--thread dualsocket 14-core Xeon E5 server processor, while reducing power consumption by 12 x and area by 5.6 x.", "citation": "Citations (1)", "departments": ["University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan", "University of Michigan"], "authors": ["Daichi Fujiki.....http://dblp.org/pers/hd/f/Fujiki:Daichi", "Arun Subramaniyan.....http://dblp.org/pers/hd/s/Subramaniyan_0001:Arun", "Tianjun Zhang.....http://dblp.org/pers/hd/z/Zhang:Tianjun", "Yu Zeng.....http://dblp.org/pers/hd/z/Zeng:Yu", "Reetuparna Das.....http://dblp.org/pers/hd/d/Das:Reetuparna", "David T. Blaauw.....http://dblp.org/pers/hd/b/Blaauw:David_T=", "Satish Narayanasamy.....http://dblp.org/pers/hd/n/Narayanasamy:Satish"], "conf": "isca", "year": "2018", "pages": 14}