{"title": "GestureGAN for Hand Gesture-to-Gesture Translation in the Wild.", "fields": ["discriminator", "generative grammar", "resnet", "gesture", "skeleton"], "abstract": "Hand gesture-to-gesture translation in the wild is a challenging task since hand gestures can have arbitrary poses, sizes, locations and self-occlusions. Therefore, this task requires a high-level understanding of the mapping between the input source gesture and the output target gesture. To tackle this problem, we propose a novel hand Gesture Generative Adversarial Network (GestureGAN). GestureGAN consists of a single generator $G$ and a discriminator $D$, which takes as input a conditional hand image and a target hand skeleton image. GestureGAN utilizes the hand skeleton information explicitly, and learns the gesture-to-gesture mapping through two novel losses, the color loss and the cycle-consistency loss. The proposed color loss handles the issue of \"channel pollution\" while back-propagating the gradients. In addition, we present the Fr\\'echet ResNet Distance (FRD) to evaluate the quality of generated images. Extensive experiments on two widely used benchmark datasets demonstrate that the proposed GestureGAN achieves state-of-the-art performance on the unconstrained hand gesture-to-gesture translation task. Meanwhile, the generated images are in high-quality and are photo-realistic, allowing them to be used as data augmentation to improve the performance of a hand gesture classifier. Our model and code are available at this https URL", "citation": "Not cited", "year": "2018", "departments": ["University of Trento", "École Polytechnique Fédérale de Lausanne", "University of Oxford", "Texas State University", "University of Trento"], "conf": "mm", "authors": ["Hao Tang.....http://dblp.org/pers/hd/t/Tang_0005:Hao", "Wei Wang.....http://dblp.org/pers/hd/w/Wang_0018:Wei", "Dan Xu.....http://dblp.org/pers/hd/x/Xu_0002:Dan", "Yan Yan.....http://dblp.org/pers/hd/y/Yan_0002:Yan", "Nicu Sebe.....http://dblp.org/pers/hd/s/Sebe:Nicu"], "pages": 9}