{"title": "On Enforcing the Digital Immunity of a Large Humanitarian Organization.", "fields": ["compromise", "impartiality", "international legal personality", "multitude", "operations security"], "abstract": "Humanitarian action, the process of aiding individuals in situations of crises, poses unique information-security challenges due to natural or manmade disasters, the adverse environments in which it takes place, and the scale and multi-disciplinary nature of the problems. Despite these challenges, humanitarian organizations are transitioning towards a strong reliance on the digitization of collected data and digital tools, which improves their effectiveness but also exposes them to computer security threats. In this paper, we conduct a qualitative analysis of the computer-security challenges of the International Committee of the Red Cross (ICRC), a large humanitarian organization with over sixteen thousand employees, an international legal personality, which involves privileges and immunities, and over 150 years of experience with armed conflicts and other situations of violence worldwide. To investigate the computer security needs and practices of the ICRC from an operational, technical, legal, and managerial standpoint by considering individual, organizational, and governmental levels, we interviewed 27 field workers, IT staff, lawyers, and managers. Our results provide a first look at the unique security and privacy challenges that humanitarian organizations face when collecting, processing, transferring, and sharing data to enable humanitarian action for a multitude of sensitive activities. These results highlight, among other challenges, the trade offs between operational security and requirements stemming from all stakeholders, the legal barriers for data sharing among jurisdictions; especially, the need to complement privileges and immunities with robust technological safeguards in order to avoid any leakages that might hinder access and potentially compromise the neutrality, impartiality, and independence of humanitarian action.", "citation": "Not cited", "departments": ["École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne", "École Polytechnique Fédérale de Lausanne"], "authors": ["Stevens Le Blond.....http://dblp.org/pers/hd/b/Blond:Stevens_Le", "Alejandro Cuevas.....http://dblp.org/pers/hd/c/Cuevas:Alejandro", "Juan Ramón Troncoso-Pastoriza.....http://dblp.org/pers/hd/t/Troncoso=Pastoriza:Juan_Ram=oacute=n", "Philipp Jovanovic.....http://dblp.org/pers/hd/j/Jovanovic:Philipp", "Bryan Ford.....http://dblp.org/pers/hd/f/Ford:Bryan", "Jean-Pierre Hubaux.....http://dblp.org/pers/hd/h/Hubaux:Jean=Pierre"], "conf": "sp", "year": "2018", "pages": 17}