{"title": "Exploiting Dynamic Thermal Energy Harvesting for Reusing in Smartphone with Mobile Applications.", "fields": ["thermal energy", "android", "thermoelectric generator", "reuse", "thermoelectric cooling"], "abstract": "Recently, mobile applications have gradually become performance- and resource- intensive, which results in a massive battery power drain and high surface temperature, and further degrades the user experience. Thus, high power consumption and surface over-heating have been considered as a severe challenge to smartphone design. In this paper, we propose DTEHR, a mobile Dynamic Thermal Energy Harvesting Reusing framework to tackle this challenge. The approach is sustainable in that it generates energy using dynamic Thermoelectric Generators (TEGs). The generated energy not only powers Thermoelectric Coolers (TECs) for cooling down hot-spots, but also recharges micro-supercapacitors (MSCs) for extended smartphone usage. To analyze thermal characteristics and evaluate DTEHR across real-world applications, we build MPPTAT (Multi-comPonent Power and Thermal Analysis Tool), a power and thermal analyzing tool for Android. The result shows that DTEHR reduces the temperature differences between hot areas and cold areas up to 15.4°C (internal) and 7°C (surface). With TEC-based hot-spots cooling, DTEHR reduces the temperature of the surface and internal hot-spots by an average of 8° and 12.8mW respectively. With dynamic TEGs, DTEHR generates 2.7-15mW power, more than hundreds of times of power that TECs need to cool down hot-spots. Thus, extra-generated power can be stored into MSCs to prolong battery life.", "citation": "Not cited", "year": "2018", "departments": ["Guizhou University", "University of Florida", "Guizhou University", "University of Florida", "University of Florida"], "conf": "asplos", "authors": ["Yuting Dai.....http://dblp.org/pers/hd/d/Dai:Yuting", "Tao Li.....http://dblp.org/pers/hd/l/Li:Tao", "Benyong Liu.....http://dblp.org/pers/hd/l/Liu:Benyong", "Mingcong Song.....http://dblp.org/pers/hd/s/Song:Mingcong", "Huixiang Chen.....http://dblp.org/pers/hd/c/Chen:Huixiang"], "pages": 14}