{"title": "Deep Multi-View Spatial-Temporal Network for Taxi Demand Prediction.", "fields": ["deep learning", "spatial relation", "big data", "smart city", "contextual image classification"], "abstract": "Taxi demand prediction is an important building block to enabling intelligent transportation systems in a smart city. An accurate prediction model can help the city pre-allocate resources to meet travel demand and to reduce empty taxis on streets which waste energy and worsen the traffic congestion. With the increasing popularity of taxi requesting services such as Uber and Didi Chuxing (in China), we are able to collect large-scale taxi demand data continuously. How to utilize such big data to improve the demand prediction is an interesting and critical real-world problem. Traditional demand prediction methods mostly rely on time series forecasting techniques, which fail to model the complex non-linear spatial and temporal relations. Recent advances in deep learning have shown superior performance on traditionally challenging tasks such as image classification by learning the complex features and correlations from large-scale data. This breakthrough has inspired researchers to explore deep learning techniques on traffic prediction problems. However, existing methods on traffic prediction have only considered spatial relation (e.g., using CNN) or temporal relation (e.g., using LSTM) independently. We propose a Deep Multi-View Spatial-Temporal Network (DMVST-Net) framework to model both spatial and temporal relations. Specifically, our proposed model consists of three views: temporal view (modeling correlations between future demand values with near time points via LSTM), spatial view (modeling local spatial correlation via local CNN), and semantic view (modeling correlations among regions sharing similar temporal patterns). Experiments on large-scale real taxi demand data demonstrate effectiveness of our approach over state-of-the-art methods.", "citation": "Citations (2)", "departments": ["Pennsylvania State University", "Pennsylvania State University", "Pennsylvania State University"], "authors": ["Huaxiu Yao.....http://dblp.org/pers/hd/y/Yao:Huaxiu", "Fei Wu.....http://dblp.org/pers/hd/w/Wu_0007:Fei", "Jintao Ke.....http://dblp.org/pers/hd/k/Ke:Jintao", "Xianfeng Tang.....http://dblp.org/pers/hd/t/Tang:Xianfeng", "Yitian Jia.....http://dblp.org/pers/hd/j/Jia:Yitian", "Siyu Lu.....http://dblp.org/pers/hd/l/Lu:Siyu", "Pinghua Gong.....http://dblp.org/pers/hd/g/Gong:Pinghua", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping", "Zhenhui Li.....http://dblp.org/pers/hd/l/Li:Zhenhui"], "conf": "aaai", "year": "2018", "pages": 8}