{"title": "Self-protection of Android systems from inter-component communication attacks.", "fields": ["android", "architectural model", "software system", "scalability", "static analysis"], "abstract": "The current security mechanisms for Android apps, both static and dynamic analysis approaches, are insufficient for detection and prevention of the increasingly dynamic and sophisticated security attacks. Static analysis approaches suffer from false positives whereas dynamic analysis approaches suffer from false negatives. Moreover, they all lack the ability to efficiently analyze systems with incremental changes—such as adding/removing apps, granting/revoking permissions, and dynamic components’ communications. Each time the system changes, the entire analysis needs to be repeated, making the existing approaches inefficient for practical use. To mitigate their shortcomings, we have developed SALMA, a novel self-protecting Android software system that monitors itself and adapts its behavior at runtime to prevent a wide-range of security risks. SALMA maintains a precise architectural model, represented as a  Multiple-Domain-Matrix , and incrementally and efficiently analyzes an Android system in response to incremental system changes. The maintained architecture is used to reason about the running Android system. Every time the system changes, SALMA determines (1) the impacted part of the system, and (2) the subset of the security analyses that need to be performed, thereby greatly improving the performance of the approach. Our experimental results on hundreds of real-world apps corroborate SALMA’s scalability and efficiency as well as its ability to detect and prevent security attacks at runtime with minimal disruption.", "citation": "Not cited", "departments": ["University of California, Irvine", "University of California, Irvine", "University of California, Irvine"], "authors": ["Mahmoud Hammad.....http://dblp.org/pers/hd/h/Hammad:Mahmoud", "Joshua Garcia.....http://dblp.org/pers/hd/g/Garcia:Joshua", "Sam Malek.....http://dblp.org/pers/hd/m/Malek:Sam"], "conf": "kbse", "year": "2018", "pages": 12}