{"title": "Improved distributed algorithms for exact shortest paths.", "fields": ["logarithm", "graph", "directed graph", "dijkstra s algorithm", "distributed algorithm"], "abstract": "Computing shortest paths is one of the central problems in the theory of distributed computing. For the last few years, substantial progress has been made on the  approximate  single source shortest paths problem, culminating in an algorithm of Henzinger, Krinninger, and Nanongkai [STOC’16] which deterministically computes (1+ o (1))-approximate shortest paths in O( D +√ n ) time, where  D  is the hop-diameter of the graph. Up to logarithmic factors, this time complexity is optimal, matching the lower bound of Elkin [STOC’04].    The question of  exact  shortest paths however saw no algorithmic progress for decades, until the recent breakthrough of Elkin [STOC’17], which established a sublinear-time algorithm for exact single source shortest paths on undirected graphs. Shortly after, Huang et al. [FOCS’17] provided improved algorithms for exact all pairs shortest paths problem on directed graphs.    In this paper, we provide an alternative single-source shortest path algorithm with complexity O( n  3/4  D  1/4 ). For polylogarithmic  D , this improves on Elkin’s O( n  5/6 ) bound and gets closer to the Ω( n  1/2 ) lower bound of Elkin [STOC’04]. For larger values of  D , we present an improved variant of our algorithm which achieves complexity O(max{  n  3/4+ o (1)  ,  n  3/4  D  1/6 } +  D  ), and thus compares favorably with Elkin’s bound of O(max{  n  5/6 ,  n  2/3  D  1/3 } +  D  ) in essentially the entire range of parameters. This algorithm provides also a qualitative improvement, because it works for the more challenging case of directed graph (i.e., graphs where the two directions of an edge can have different weights), constituting the first sublinear-time algorithm for directed graphs. Our algorithm also extends to the case of exact  r -source shortest paths, in which we provide the fastest algorithm for moderately small  r  and  D , improving on those of Huang et al.", "citation": "Citations (2)", "year": "2018", "departments": ["ETH Zurich", "Carnegie Mellon University"], "conf": "stoc", "authors": ["Mohsen Ghaffari.....http://dblp.org/pers/hd/g/Ghaffari:Mohsen", "Jason Li.....http://dblp.org/pers/hd/l/Li:Jason"], "pages": 14}