{"title": "Improving Word Embedding Compositionality using Lexicographic Definitions.", "fields": ["word2vec", "distributional semantics", "principle of compositionality", "feature learning", "word embedding"], "abstract": "We present an in-depth analysis of various popular word embeddings (Word2Vec, GloVe, fastText and Paragram) in terms of their compositionality, as well as a method to tune them towards better compositionality. We find that training the embeddings to compose lexicographic definitions improves their performance in this task significantly, while also getting similar or better performance in both word similarity evaluations and sentence embedding evaluations. Word embeddings are tuned using a simple neural network architecture with definitions and lemmas from WordNet. Since dictionary definitions can be composed into the lemmas they define, they are also suitable for tuning, as well as evaluating for compositionality. Our architecture allows for the embeddings to be composed using simple arithmetic operations, which makes these embeddings specifically suitable for production applications such as web search and data mining. We call our model structure: CompVec. In our analysis, we evaluate original embeddings, as well as tuned embeddings, using existing word similarity and sentence embedding evaluation methods. Aside from these evaluation methods used in related work, we also evaluate embeddings using a ranking method which tests composed vectors using the lexicographic definitions already mentioned. In contrast to other evaluation methods, ours is not invariant to the magnitude of the embedding vector—which we show is important for composition. We consider this new evaluation method (CompVecEval) to be a key contribution.", "citation": "Not cited", "departments": ["University of Amsterdam", "Google", "University of Amsterdam"], "authors": ["Thijs Scheepers.....http://dblp.org/pers/hd/s/Scheepers:Thijs", "Evangelos Kanoulas.....http://dblp.org/pers/hd/k/Kanoulas:Evangelos", "Efstratios Gavves.....http://dblp.org/pers/hd/g/Gavves:Efstratios"], "conf": "www", "year": "2018", "pages": 11}