{"title": "Spatial: a language and compiler for application accelerators.", "fields": ["high level synthesis", "domain specific language", "programmer", "speedup", "compiler"], "abstract": "Industry is increasingly turning to reconfigurable architectures like FPGAs and CGRAs for improved performance and energy efficiency. Unfortunately, adoption of these architectures has been limited by their programming models. HDLs lack abstractions for productivity and are difficult to target from higher level languages. HLS tools are more productive, but offer an ad-hoc mix of software and hardware abstractions which make performance optimizations difficult.     In this work, we describe a new domain-specific language and compiler called Spatial for higher level descriptions of application accelerators. We describe Spatial's hardware-centric abstractions for both programmer productivity and design performance, and summarize the compiler passes required to support these abstractions, including pipeline scheduling, automatic memory banking, and automated design tuning driven by active machine learning. We demonstrate the language's ability to target FPGAs and CGRAs from common source code. We show that applications written in Spatial are, on average, 42% shorter and achieve a mean speedup of 2.9x over SDAccel HLS when targeting a Xilinx UltraScale+ VU9P FPGA on an Amazon EC2 F1 instance.", "citation": "Not cited", "departments": ["Stanford University", "Stanford University", "Stanford University", "Stanford University", "Stanford University"], "authors": ["David Koeplinger.....http://dblp.org/pers/hd/k/Koeplinger:David", "Matthew Feldman.....http://dblp.org/pers/hd/f/Feldman:Matthew", "Raghu Prabhakar.....http://dblp.org/pers/hd/p/Prabhakar:Raghu", "Yaqi Zhang.....http://dblp.org/pers/hd/z/Zhang:Yaqi", "Stefan Hadjis.....http://dblp.org/pers/hd/h/Hadjis:Stefan", "Ruben Fiszel.....http://dblp.org/pers/hd/f/Fiszel:Ruben", "Tian Zhao.....http://dblp.org/pers/hd/z/Zhao:Tian", "Luigi Nardi.....http://dblp.org/pers/hd/n/Nardi:Luigi", "Ardavan Pedram.....http://dblp.org/pers/hd/p/Pedram:Ardavan", "Christos Kozyrakis.....http://dblp.org/pers/hd/k/Kozyrakis:Christos", "Kunle Olukotun.....http://dblp.org/pers/hd/o/Olukotun:Kunle"], "conf": "pldi", "year": "2018", "pages": 16}