{"title": "CommanderSong: A Systematic Approach for Practical Adversarial Voice Recognition.", "fields": ["speech recognition", "deep learning", "over the air", "voice command device", "adversarial system"], "abstract": "ASR (automatic speech recognition) systems like Siri, Alexa, Google Voice or Cortana has become quite popular recently. One of the key techniques enabling the practical use of such systems in people's daily life is deep learning. Though deep learning in computer vision is known to be vulnerable to adversarial perturbations, little is known whether such perturbations are still valid on the practical speech recognition. In this paper, we not only demonstrate such attacks can happen in reality, but also show that the attacks can be systematically conducted. To minimize users' attention, we choose to embed the voice commands into a song, called CommandSong. In this way, the song carrying the command can spread through radio, TV or even any media player installed in the portable devices like smartphones, potentially impacting millions of users in long distance. In particular, we overcome two major challenges: minimizing the revision of a song in the process of embedding commands, and letting the CommandSong spread through the air without losing the voice \"command\". Our evaluation demonstrates that we can craft random songs to \"carry\" any commands and the modify is extremely difficult to be noticed. Specially, the physical attack that we play the CommandSongs over the air and record them can success with 94 percentage.", "citation": "Citations (2)", "year": "2018", "departments": [], "conf": "uss", "authors": ["Xuejing Yuan.....http://dblp.org/pers/hd/y/Yuan:Xuejing", "Yuxuan Chen.....http://dblp.org/pers/hd/c/Chen:Yuxuan", "Yue Zhao.....http://dblp.org/pers/hd/z/Zhao:Yue", "Yunhui Long.....http://dblp.org/pers/hd/l/Long:Yunhui", "Xiaokang Liu.....http://dblp.org/pers/hd/l/Liu:Xiaokang", "Kai Chen.....http://dblp.org/pers/hd/c/Chen_0012:Kai", "Shengzhi Zhang.....http://dblp.org/pers/hd/z/Zhang:Shengzhi", "Heqing Huang.....http://dblp.org/pers/hd/h/Huang:Heqing", "Xiaofeng Wang.....http://dblp.org/pers/hd/w/Wang_0006:Xiaofeng", "Carl A. Gunter.....http://dblp.org/pers/hd/g/Gunter:Carl_A="], "pages": 16}