{"title": "Visually-Induced Motion Sickness Reduction via Static and Dynamic Rest Frames.", "fields": ["opacity", "tracking system", "rest frame", "field of view", "motion sickness"], "abstract": "Visually-induced motion sickness (VIMS), also known as cyber-sickness, is a major challenge for wide-spread Virtual Reality (VR) adoption. VIMS can be reduced in different ways, for example by using high-quality tracking systems and reducing the user's field of view. However, there are no universal solutions for all situations, and a wide variety of techniques are needed in order for developers to choose the most appropriate options depending on their needs. One way to reduce VIMS is through the use of rest frames-portions of the virtual environment that remain fixed in relation to the real world and do not move as the user virtually moves. We report the results of two multi-day within-subjects studies with 44 subjects who used virtual travel to navigate the environment. In the first study, we investigated the influence of static rest frames with fixed opacity on user comfort. For the second study, we present an enhanced version of rest frames that we call dynamic rest frames, where the opacity of the rest frame changes in response to visually perceived motion as users virtually traversed the virtual environment. Results show that a virtual environment with a static or dynamic rest frame allowed users to travel through more waypoints before stopping due to discomfort compared to a virtual environment without a rest frame. Further, a virtual environment with a static rest frame was also found to result in more real-time reported comfort than when there was no rest frame.", "citation": "Not cited", "departments": ["Duke University", "Duke University", "NextGen Interactions, LLC"], "authors": ["Zekun Cao.....http://dblp.org/pers/hd/c/Cao:Zekun", "Jason Jerald.....http://dblp.org/pers/hd/j/Jerald:Jason", "Regis Kopper.....http://dblp.org/pers/hd/k/Kopper:Regis"], "conf": "vr", "year": "2018", "pages": 8}