{"title": "Robust moment estimation and improved clustering via sum of squares.", "fields": ["independent component analysis", "probability theory", "poincare inequality", "explained sum of squares", "outlier"], "abstract": "We develop efficient algorithms for estimating low-degree moments of unknown distributions in the presence of adversarial outliers and design a new family of convex relaxations for  k -means clustering based on sum-of-squares method. As an immediate corollary, for any γ > 0, we obtain an efficient algorithm for learning the means of a mixture of  k  arbitrary distributions in   d   in time  d   O (1/γ)  so long as the means have separation Ω( k  γ ). This in particular yields an algorithm for learning Gaussian mixtures with separation Ω( k  γ ), thus partially resolving an open problem of Regev and Vijayaraghavan regev2017learning. The guarantees of our robust estimation algorithms improve in many cases significantly over the best previous ones, obtained in the recent works. We also show that the guarantees of our algorithms match information-theoretic lower-bounds for the class of distributions we consider. These improved guarantees allow us to give improved algorithms for independent component analysis and learning mixtures of Gaussians in the presence of outliers.    We also show a sharp upper bound on the sum-of-squares norms for moment tensors of any distribution that satisfies the  Poincare inequality . The Poincare inequality is a central inequality in probability theory, and a large class of distributions satisfy it including Gaussians, product distributions, strongly log-concave distributions, and any sum or uniformly continuous transformation of such distributions. As a consequence, this yields that all of the above algorithmic improvements hold for distributions satisfying the Poincare inequality.", "citation": "Citations (1)", "year": "2018", "departments": ["Princeton University", "Stanford University", "ETH Zurich"], "conf": "stoc", "authors": ["Pravesh K. Kothari.....http://dblp.org/pers/hd/k/Kothari:Pravesh_K=", "Jacob Steinhardt.....http://dblp.org/pers/hd/s/Steinhardt:Jacob", "David Steurer.....http://dblp.org/pers/hd/s/Steurer:David"], "pages": 12}