{"title": "Network Connectivity Optimization: Fundamental Limits and Effective Algorithms.", "fields": ["social collaboration", "greedy algorithm", "ranging", "scalability", "intelligent transportation system"], "abstract": "Network connectivity optimization, which aims to manipulate network connectivity by changing its underlying topology, is a fundamental task behind a wealth of high-impact data mining applications, ranging from immunization, critical infrastructure construction, social collaboration mining, bioinformatics analysis, to intelligent transportation system design. To tackle its exponential computation complexity, greedy algorithms have been extensively used for network connectivity optimization by exploiting its diminishing returns property. Despite the empirical success, two key challenges largely remain open. First, on the theoretic side, the hardness, as well as the approximability of the general network connectivity optimization problem are still nascent except for a few special instances. Second, on the algorithmic side, current algorithms are often hard to balance between the optimization quality and the computational efficiency. In this paper, we systematically address these two challenges for the network connectivity optimization problem. First, we reveal some fundamental limits by proving that, for a wide range of network connectivity optimization problems, (1) they are NP-hard and (2) (1-1/e) is the optimal approximation ratio for any polynomial algorithms. Second, we propose an effective, scalable and general algorithm (CONTAIN) to carefully balance the optimization quality and the computational efficiency.", "citation": "Not cited", "departments": ["Arizona State University", "Arizona State University", "Arizona State University", "Translational M ... ngeles, CA, USA"], "authors": ["Chen Chen.....http://dblp.org/pers/hd/c/Chen_0022:Chen", "Ruiyue Peng.....http://dblp.org/pers/hd/p/Peng:Ruiyue", "Lei Ying.....http://dblp.org/pers/hd/y/Ying:Lei", "Hanghang Tong.....http://dblp.org/pers/hd/t/Tong:Hanghang"], "conf": "kdd", "year": "2018", "pages": 10}