{"title": "Measuring the Utility of Search Engine Result Pages: An Information Foraging Based Measure.", "fields": ["homogeneous", "units of measurement", "web search engine", "ranking", "information foraging"], "abstract": "Web Search Engine Result Pages (SERPs) are complex responses to queries, containing many heterogeneous result elements (web results, advertisements, and specialised \"answers'') positioned in a variety of layouts. This poses numerous challenges when trying to measure the quality of a SERP because standard measures were designed for homogeneous ranked lists. In this paper, we aim to measure the utility and cost of SERPs. To ground this work we adopt the \\CWL framework which enables a direct comparison between different measures in the same units of measurement, i.e. expected (total) utility and cost. Within this framework, we propose a new measure based on information foraging theory, which can account for the heterogeneity of elements, through different costs, and which naturally motivates the development of a user stopping model that adapts behaviour depending on the rate of gain. This directly connects models of how people search with how we measure search, providing a number of new dimensions in which to investigate and evaluate user behaviour and performance. We perform an analysis over~1000 popular queries issued to a major search engine, and report the aggregate utility experienced by users over time. Then in an comparison against common measures, we show that the proposed foraging based measure provides a more accurate reflection of the utility and of observed behaviours (stopping rank and time spent).", "citation": "Citations (1)", "departments": ["University of Strathclyde", "Microsoft", "Microsoft"], "authors": ["Leif Azzopardi.....http://dblp.org/pers/hd/a/Azzopardi:Leif", "Paul Thomas.....http://dblp.org/pers/hd/t/Thomas:Paul", "Nick Craswell.....http://dblp.org/pers/hd/c/Craswell:Nick"], "conf": "sigir", "year": "2018", "pages": 10}