{"title": "Testing autonomous cars for feature interaction failures using many-objective search.", "fields": ["complex systems", "evolutionary algorithm", "feature interaction problem", "system requirements", "heuristics"], "abstract": "Complex systems such as autonomous cars are typically built as a composition of features that are independent units of functionality. Features tend to interact and impact one another's behavior in unknown ways. A challenge is to detect and manage feature interactions, in particular, those that violate system requirements, hence leading to failures. In this paper, we propose a technique to detect feature interaction failures by casting this problem into a search-based test generation problem. We define a set of hybrid test objectives (distance functions) that combine traditional coverage-based heuristics with new heuristics specifically aimed at revealing feature interaction failures. We develop a new search-based test generation algorithm, called FITEST, that is guided by our hybrid test objectives. FITEST extends recently proposed many-objective evolutionary algorithms to reduce the time required to compute fitness values. We evaluate our approach using two versions of an industrial self-driving system. Our results show that our hybrid test objectives are able to identify more than twice as many feature interaction failures as two baseline test objectives used in the software testing literature (i.e., coverage-based and failure-based test objectives). Further, the feedback from domain experts indicates that the detected feature interaction failures represent real faults in their systems that were not previously identified based on analysis of the system features and their requirements.", "citation": "Not cited", "departments": ["University of Luxembourg", "Delft University of Technology", "University of Luxembourg", "University of Luxembourg", "IEE, Luxembourg"], "authors": ["Raja Ben Abdessalem.....http://dblp.org/pers/hd/a/Abdessalem:Raja_Ben", "Annibale Panichella.....http://dblp.org/pers/hd/p/Panichella:Annibale", "Shiva Nejati.....http://dblp.org/pers/hd/n/Nejati:Shiva", "Lionel C. Briand.....http://dblp.org/pers/hd/b/Briand:Lionel_C=", "Thomas Stifter.....http://dblp.org/pers/hd/s/Stifter:Thomas"], "conf": "kbse", "year": "2018", "pages": 12}