{"title": "Testing vision-based control systems using learnable evolutionary algorithms.", "fields": ["search based software engineering", "statistical classification", "evolutionary computation", "system under test", "scenario testing"], "abstract": "Vision-based control systems are key enablers of many autonomous vehicular systems, including self-driving cars. Testing such systems is complicated by complex and multidimensional input spaces. We propose an automated testing algorithm that builds on learnable evolutionary algorithms. These algorithms rely on machine learning or a combination of machine learning and Darwinian genetic operators to guide the generation of new solutions (test scenarios in our context). Our approach combines multiobjective population-based search algorithms and decision tree classification models to achieve the following goals: First, classification models guide the search-based generation of tests faster towards  critical test scenarios  (i.e., test scenarios leading to failures). Second, search algorithms refine classification models so that the models can accurately characterize  critical regions  (i.e., the regions of a test input space that are likely to contain most critical test scenarios). Our evaluation performed on an industrial automotive automotive system shows that: (1) Our algorithm outperforms a baseline evolutionary search algorithm and generates 78% more distinct, critical test scenarios compared to the baseline algorithm. (2) Our algorithm accurately characterizes critical regions of the system under test, thus identifying the conditions that are likely to lead to system failures.", "citation": "Citations (4)", "departments": ["University of Luxembourg", "University of Luxembourg", "University of Luxembourg", "IEE S.A., Luxembourg"], "authors": ["Raja Ben Abdessalem.....http://dblp.org/pers/hd/a/Abdessalem:Raja_Ben", "Shiva Nejati.....http://dblp.org/pers/hd/n/Nejati:Shiva", "Lionel C. Briand.....http://dblp.org/pers/hd/b/Briand:Lionel_C=", "Thomas Stifter.....http://dblp.org/pers/hd/s/Stifter:Thomas"], "conf": "icse", "year": "2018", "pages": 11}