{"title": "VERSE: Versatile Graph Embeddings from Similarity Measures.", "fields": ["graph embedding", "precision and recall", "feature learning", "embedding", "similarity measure"], "abstract": "Embedding a web-scale information network into a low-dimensional vector space facilitates tasks such as link prediction, classification, and visualization. Past research has addressed the problem of extracting such embeddings by adopting methods from words to graphs, without defining a clearly comprehensible graph-related objective. Yet, as we show, the objectives used in past works implicitly utilize similarity measures among graph nodes. In this paper, we carry the similarity orientation of previous works to its logical conclusion; we propose VERtex Similarity Embeddings (VERSE), a simple, versatile, and memory-efficient method that derives graph embeddings explicitly calibrated to preserve the distributions of a chosen vertex-to-vertex similarity measure. While the default, scalable version of VERSE learns such embeddings by sampling the graph to train a single-layer neural network, we also develop a full variant that does not rely on sampling. Our experimental study on standard benchmarks and real-world datasets demonstrates that VERSE, instantiated with diverse similarity measures, outperforms state-of-the-art methods in terms of precision and recall in major data mining tasks and supersedes them in time and space efficiency, while the scalable sampling-based variant achieves equally good results as the non-scalable full variant.", "citation": "Citations (1)", "departments": ["Hasso Plattner Institute", "Hasso Plattner Institute", "Aarhus University", "Hasso Plattner Institute"], "authors": ["Anton Tsitsulin.....http://dblp.org/pers/hd/t/Tsitsulin:Anton", "Davide Mottin.....http://dblp.org/pers/hd/m/Mottin:Davide", "Panagiotis Karras.....http://dblp.org/pers/hd/k/Karras:Panagiotis", "Emmanuel Müller.....http://dblp.org/pers/hd/m/M=uuml=ller:Emmanuel"], "conf": "www", "year": "2018", "pages": 10}