{"title": "Fully Point-wise Convolutional Neural Network for Modeling Statistical Regularities in Natural Images.", "fields": ["kernel", "independent and identically distributed random variables", "convolutional neural network", "convolution", "color constancy"], "abstract": "Modeling statistical regularities is the problem of representing the pixel distributions in natural images, and usually applied to solve the ill-posed image processing problems. In this paper, we present an extremely efficient CNN architecture for modeling statistical regularities. Our method is based on the observation that, by random sampling the pixels in natural images, we can obtain a set of pixel ensembles in which the pixel value is independent identically distributed. This leads to the idea of using 1*1 (point-wise) convolution kernel instead of k*k convolution kernel to learn the feature representation efficiently. Accordingly, we design a novel architecture with fully point-wise convolutions to greatly reduce the model complexity while maintaining the representation ability. Experiments on three applications: color constancy, image dehazing and underwater image enhancement demonstrate the superior performance of our proposed network over the existing architectures, i.e., using 1/10-1/100 network parameters and computational cost over the state-of-the-art networks while achieving comparable accuracy. Codes and models will be made publicly available.", "citation": "Citations (1)", "year": "2018", "departments": ["Hangzhou Dianzi University", "University of Science and Technology of China", "University of Science and Technology of China", "Hangzhou Dianzi University", "Hangzhou Dianzi University"], "conf": "mm", "authors": ["Jing Zhang.....http://dblp.org/pers/hd/z/Zhang:Jing", "Yang Cao.....http://dblp.org/pers/hd/c/Cao:Yang", "Yang Wang.....http://dblp.org/pers/hd/w/Wang:Yang", "Chenglin Wen.....http://dblp.org/pers/hd/w/Wen:Chenglin", "Chang Wen Chen.....http://dblp.org/pers/hd/c/Chen:Chang_Wen"], "pages": 9}