{"title": "Learning Adversarial Networks for Semi-Supervised Text Classification via Policy Gradient.", "fields": ["generative model", "external data representation", "semi supervised learning", "recurrent neural network", "adversarial system"], "abstract": "Semi-supervised learning is a branch of machine learning techniques that aims to make fully use of both labeled and unlabeled instances to improve the prediction performance. The size of modern real world datasets is ever-growing so that acquiring label information for them is extraordinarily difficult and costly. Therefore, deep semi-supervised learning is becoming more and more popular. Most of the existing deep semi-supervised learning methods are built under the generative model based scheme, where the data distribution is approximated via input data reconstruction. However, this scheme does not naturally work on discrete data, e.g., text; in addition, learning a good data representation is sometimes directly opposed to the goal of learning a high performance prediction model. To address the issues of this type of methods, we reformulate the semi-supervised learning as a model-based reinforcement learning problem and propose an adversarial networks based framework. The proposed framework contains two networks: a predictor network for target estimation and a judge network for evaluation. The judge network iteratively generates proper reward to guide the training of predictor network, and the predictor network is trained via policy gradient. Based on the aforementioned framework, we propose a recurrent neural network based model for semi-supervised text classification. We conduct comprehensive experimental analysis on several real world benchmark text datasets, and the results from our evaluations show that our method outperforms other competing state-of-the-art methods.", "citation": "Not cited", "departments": ["University of Michigan", "University of Michigan"], "authors": ["Yan Li.....http://dblp.org/pers/hd/l/Li:Yan", "Jieping Ye.....http://dblp.org/pers/hd/y/Ye:Jieping"], "conf": "kdd", "year": "2018", "pages": 9}