{"title": "Interval-based memory reclamation.", "fields": ["garbage collection", "pointer", "hazard pointer", "thread", "concurrent data structure"], "abstract": "In this paper we present  interval-based reclamation  (IBR), a new approach to safe reclamation of disconnected memory blocks in nonblocking concurrent data structures. Safe reclamation is a difficult problem: a thread, before freeing a block, must ensure that no other threads are accessing that block; the required synchronization tends to be expensive. In contrast with epoch-based reclamation, in which threads reserve all blocks created after a certain time, or pointer-based reclamation (e.g., hazard pointers), in which threads reserve individual blocks, IBR allows a thread to reserve all blocks known to have existed in a bounded  interval  of time. By comparing a thread's reserved interval with the lifetime of a detached but not yet reclaimed block, the system can determine if the block is safe to free. Like hazard pointers, IBR avoids the possibility that a single stalled thread may reserve an unbounded number of blocks; unlike hazard pointers, it avoids a memory fence on most pointer-following operations. It also avoids the need to explicitly \"unreserve\" a no-longer-needed pointer.   We describe three specific IBR schemes (one with several variants) that trade off performance, applicability, and space requirements. IBR requires no special hardware or OS support. In experiments with data structure microbenchmarks, it also compares favorably (in both time and space) to other state-of-the-art approaches, making it an attractive alternative for libraries of concurrent data structures.", "citation": "Citations (1)", "year": "2018", "departments": ["University of Rochester", "University of Rochester", "University of Rochester", "University of Rochester", "University of Rochester"], "conf": "ppopp", "authors": ["Haosen Wen.....http://dblp.org/pers/hd/w/Wen:Haosen", "Joseph Izraelevitz.....http://dblp.org/pers/hd/i/Izraelevitz:Joseph", "Wentao Cai.....http://dblp.org/pers/hd/c/Cai:Wentao", "H. Alan Beadle.....http://dblp.org/pers/hd/b/Beadle:H=_Alan", "Michael L. Scott.....http://dblp.org/pers/hd/s/Scott:Michael_L="], "pages": 13}