{"title": "Clay Codes: Moulding MDS Codes to Yield an MSR Code.", "fields": ["codebase", "erasure code", "distributed data store", "data center", "parity"], "abstract": "With increase in scale, the number of node failures in a data center increases sharply. To ensure availability of data, failure-tolerance schemes such as Reed-Solomon (RS) or more generally, Maximum Distance Separable (MDS) erasure codes are used. However, while MDS codes offer minimum storage overhead for a given amount of failure tolerance, they do not meet other practical needs of today's data centers. Although modern codes such as Minimum Storage Regenerating (MSR) codes are designed to meet these practical needs, they are available only in highly-constrained theoretical constructions, that are not sufficiently mature enough for practical implementation. We present Clay codes that extract the best from both worlds. Clay (short for Coupled-Layer) codes are MSR codes that offer a simplified construction for decoding/repair by using pairwise coupling across multiple stacked layers of any single MDS code.\n\nIn addition, Clay codes provide the first practical implementation of an MSR code that offers (a) low storage overhead, (b) simultaneous optimality in terms of three key parameters: repair bandwidth, sub-packetization level and disk I/O, (c) uniform repair performance of data and parity nodes and (d) support for both single and multiple-node repairs, while permitting faster and more efficient repair.\n\nWhile all MSR codes are vector codes, none of the distributed storage systems support vector codes. We have modified Ceph to support any vector code, and our contribution is now a part of Ceph's master codebase. We have implemented Clay codes, and integrated it as a plugin to Ceph. Six example Clay codes were evaluated on a cluster of Amazon EC2 instances and code parameters were carefully chosen to match known erasure-code deployments in practice. A particular example code, with storage overhead 1:25x, is shown to reduce repair network traffic by a factor of 2:9 in comparison with RS codes and similar reductions are obtained for both repair time and disk read.", "citation": "Citations (2)", "departments": ["Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science", "Indian Institute of Science"], "authors": ["Myna Vajha.....http://dblp.org/pers/hd/v/Vajha:Myna", "Vinayak Ramkumar.....http://dblp.org/pers/hd/r/Ramkumar:Vinayak", "Bhagyashree Puranik.....http://dblp.org/pers/hd/p/Puranik:Bhagyashree", "Ganesh R. Kini.....http://dblp.org/pers/hd/k/Kini:Ganesh_R=", "Elita Lobo.....http://dblp.org/pers/hd/l/Lobo:Elita", "Birenjith Sasidharan.....http://dblp.org/pers/hd/s/Sasidharan:Birenjith", "P. Vijay Kumar.....http://dblp.org/pers/hd/k/Kumar:P=_Vijay", "Alexander Barg.....http://dblp.org/pers/hd/b/Barg:Alexander", "Min Ye.....http://dblp.org/pers/hd/y/Ye_0005:Min", "Srinivasan Narayanamurthy.....http://dblp.org/pers/hd/n/Narayanamurthy:Srinivasan", "Syed Hussain.....http://dblp.org/pers/hd/h/Hussain:Syed", "Siddhartha Nandi.....http://dblp.org/pers/hd/n/Nandi:Siddhartha"], "conf": "fast", "year": "2018", "pages": 16}