{"title": "Entire Space Multi-Task Model: An Effective Approach for Estimating Post-Click Conversion Rate.", "fields": ["deep learning", "selection bias", "impression", "ranking", "multi task learning"], "abstract": "Estimating post-click conversion rate (CVR) accurately is crucial for ranking systems in industrial applications such as recommendation and advertising. Conventional CVR modeling applies popular deep learning methods and achieves state-of-the-art performance. However it encounters several task-specific problems in practice, making CVR modeling challenging. For example, conventional CVR models are trained with samples of clicked impressions while utilized to make inference on the entire space with samples of all impressions. This causes a sample selection bias problem. Besides, there exists an extreme data sparsity problem, making the model fitting rather difficult. In this paper, we model CVR in a brand-new perspective by making good use of sequential pattern of user actions, i.e., impression -> click -> conversion. The proposed Entire Space Multi-task Model (ESMM) can eliminate the two problems simultaneously by i) modeling CVR directly over the entire space, ii) employing a feature representation transfer learning strategy. Experiments on dataset gathered from Taobao's recommender system demonstrate that ESMM significantly outperforms competitive methods. We also release a sampling version of this dataset to enable future research. To the best of our knowledge, this is the first public dataset which contains samples with sequential dependence of click and conversion labels for CVR modeling.", "citation": "Not cited", "departments": ["Alibaba Inc., Beijing, China", "Alibaba Inc., Beijing, China", "Alibaba Inc., Beijing, China", "Alibaba Inc., Beijing, China", "Alibaba Inc., Beijing, China"], "authors": ["Xiao Ma.....http://dblp.org/pers/hd/m/Ma:Xiao", "Liqin Zhao.....http://dblp.org/pers/hd/z/Zhao:Liqin", "Guan Huang.....http://dblp.org/pers/hd/h/Huang:Guan", "Zhi Wang.....http://dblp.org/pers/hd/w/Wang:Zhi", "Zelin Hu.....http://dblp.org/pers/hd/h/Hu:Zelin", "Xiaoqiang Zhu.....http://dblp.org/pers/hd/z/Zhu:Xiaoqiang", "Kun Gai.....http://dblp.org/pers/hd/g/Gai:Kun"], "conf": "sigir", "year": "2018", "pages": 4}