{"title": "Simulated Reference Frame: A Cost-Effective Solution to Improve Spatial Orientation in VR.", "fields": ["reference frame", "spatial cognition", "rest frame", "spatial disorientation", "spatial contextual awareness"], "abstract": "Virtual Reality (VR) is increasingly used in spatial cognition research, as it offers high experimental control in naturalistic multimodal environments, which is hard to achieve in real-world settings. Although recent technological advances offer a high level of photorealism, locomotion in VR is still restricted because people might not perceive their self-motion as they would in the real world. This might be related to the inability to use embodied spatial orientation processes, which support automatic and obligatory updating of our spatial awareness. Previous research has identified the roles reference frames play in retaining spatial orientation. Here, we propose using visually overlaid rectangular boxes, simulating reference frames in VR, to provide users with a better insight into spatial direction in landmark-free virtual environments. The current mixed-method study investigated how different variations of the visually simulated reference frames might support people in a navigational search task. Performance results showed that the existence of a simulated reference frame yields significant effects on participants completion time and travel distance. Though a simulated CAVE translating with the navigator (one of the simulated reference frames) did not provide significant benefits, the simulated room (another simulated reference frame depicting a rest frame) significantly boosted user performance in the task as well as improved participants preference in the post-experiment evaluation. Results suggest that adding a visually simulated reference frame to VR applications might be a cost-effective solution to the spatial disorientation problem in VR.", "citation": "Not cited", "departments": ["Simon Fraser University", "Simon Fraser University", "Simon Fraser University"], "authors": ["Thinh Nguyen-Vo.....http://dblp.org/pers/hd/n/Nguyen=Vo:Thinh", "Bernhard E. Riecke.....http://dblp.org/pers/hd/r/Riecke:Bernhard_E=", "Wolfgang Stuerzlinger.....http://dblp.org/pers/hd/s/Stuerzlinger:Wolfgang"], "conf": "vr", "year": "2018", "pages": 8}