{"title": "NeuroViNE: A Neural Preprocessor for Your Virtual Network Embedding Algorithm.", "fields": ["hopfield network", "temporal isolation among virtual machines", "network virtualization", "virtual network", "speedup"], "abstract": "Network virtualization enables increasingly diverse\nnetwork services to cohabit and share a given physical infrastructure\nand its resources, with the possibility to rely on\ndifferent network architectures and protocols optimized towards\nspecific requirements. In order to ensure a predictable performance\ndespite shared resources, network virtualization requires\na strict performance isolation and hence, resource reservations.\nMoreover, the creation of virtual networks should be fast and\nefficient. The underlying NP-hard algorithmic problem is known\nas the Virtual Network Embedding (VNE) problem and has\nbeen studied intensively over the last years. This paper presents\nNeuroViNE, a novel approach to speed up and improve a wide\nrange of existing VNE algorithms: NeuroViNE is based on a\nsearch space reduction mechanism and preprocesses a problem\ninstance by extracting relevant subgraphs, i.e., good combinations\nof substrate nodes and links. These subgraphs can then be fed\nto an existing algorithm for faster and more resource-efficient\nembeddings. NeuroViNE relies on a Hopfield network, and its\nperformance benefits are investigated in simulations for random\nnetworks, real substrate networks, and data center networks.", "citation": "Not cited", "departments": ["Technische Universität München", "Technische Universität München", "Technische Universität München", "Bell Labs", "University of Vienna"], "authors": ["Andreas Blenk.....http://dblp.org/pers/hd/b/Blenk:Andreas", "Patrick Kalmbach.....http://dblp.org/pers/hd/k/Kalmbach:Patrick", "Johannes Zerwas.....http://dblp.org/pers/hd/z/Zerwas:Johannes", "Michael Jarschel.....http://dblp.org/pers/hd/j/Jarschel:Michael", "Stefan Schmid.....http://dblp.org/pers/hd/s/Schmid_0001:Stefan", "Wolfgang Kellerer.....http://dblp.org/pers/hd/k/Kellerer:Wolfgang"], "conf": "infocom", "year": "2018", "pages": 9}