{"title": "A Nutritional Label for Rankings.", "fields": ["learning to rank", "end user", "rankers", "financial services", "ranking"], "abstract": "Algorithmic decisions often result in scoring and ranking individuals to determine credit worthiness, qualifications for college admissions and employment, and compatibility as dating partners. While automatic and seemingly objective, ranking algorithms can discriminate against individuals and protected groups, and exhibit low diversity. Furthermore, ranked results are often unstable -- small changes in the input data or in the ranking methodology may lead to drastic changes in the output, making the result uninformative and easy to manipulate. Similar concerns apply in cases where items other than individuals are ranked, including colleges, academic departments, or products. Despite the ubiquity of rankers, there is, to the best of our knowledge, no technical work that focuses on making rankers transparent.   In this demonstration we present Ranking Facts, a Web-based application that generates a \"nutritional label\" for rankings. Ranking Facts is made up of a collection of visual widgets that implement our latest research results on fairness, stability, and transparency for rankings, and that communicate details of the ranking methodology, or of the output, to the end user. We will showcase Ranking Facts on real datasets from different domains, including college rankings, criminal risk assessment, and financial services.", "citation": "Citations (1)", "year": "2018", "departments": ["Drexel University", "Drexel University", "University of Michigan", "University of Washington", "University of Michigan"], "conf": "sigmod", "authors": ["Ke Yang.....http://dblp.org/pers/hd/y/Yang:Ke", "Julia Stoyanovich.....http://dblp.org/pers/hd/s/Stoyanovich:Julia", "Abolfazl Asudeh.....http://dblp.org/pers/hd/a/Asudeh:Abolfazl", "Bill Howe.....http://dblp.org/pers/hd/h/Howe:Bill", "H. V. Jagadish.....http://dblp.org/pers/hd/j/Jagadish:H=_V=", "Gerome Miklau.....http://dblp.org/pers/hd/m/Miklau:Gerome"], "pages": 4}