{"title": "You Are How You Drive: Peer and Temporal-Aware Representation Learning for Driving Behavior Analysis.", "fields": ["graph", "exploit", "feature learning", "optimization problem", "trajectory"], "abstract": "Driving is a complex activity that requires multi-level skilled operations (e.g., acceleration, braking, turning). Analyzing driving behavior can help us assess driver performances, improve traffic safety, and, ultimately, promote the development of intelligent and resilient transportation systems. While some efforts have been made for analyzing driving behavior, existing methods can be improved via representation learning by jointly exploring the peer and temporal dependencies of driving behavior. To that end, in this paper, we develop a Peer and Temporal-Aware Representation Learning based framework (PTARL) for driving behavior analysis with GPS trajectory data. Specifically, we first detect the driving operations and states of each driver from GPS traces. Then, we derive a sequence of multi-view driving state transition graphs from the driving state sequences, in order to characterize a driver's driving behavior that varies over time. In addition, we develop a peer and temporal-aware representation learning method to learn a sequence of time-varying yet relational vectorized representations from the driving state transition graphs. The proposed method can simultaneously model both the graph-graph peer dependency and the current-past temporal dependency in a unified optimization framework. Also, we provide effective solutions for the optimization problem. Moreover, we exploit the learned representations of driving behavior to score driving performances and detect dangerous regions. Finally, extensive experimental results with big trajectory data demonstrate the enhanced performance of the proposed method for driving behavior analysis.", "citation": "Not cited", "departments": ["Missouri University of Science and Technology", "Missouri University of Science and Technology", "Florida State University", "Chinese Academy of Sciences", "JD Finance, Beijing, China"], "authors": ["Pengyang Wang.....http://dblp.org/pers/hd/w/Wang:Pengyang", "Yanjie Fu.....http://dblp.org/pers/hd/f/Fu:Yanjie", "Jiawei Zhang.....http://dblp.org/pers/hd/z/Zhang:Jiawei", "Pengfei Wang.....http://dblp.org/pers/hd/w/Wang:Pengfei", "Yu Zheng.....http://dblp.org/pers/hd/z/Zheng:Yu", "Charu C. Aggarwal.....http://dblp.org/pers/hd/a/Aggarwal:Charu_C="], "conf": "kdd", "year": "2018", "pages": 10}