{"title": "Coupled Deep Learning for Heterogeneous Face Recognition.", "fields": ["homogeneous", "feret", "sketch", "pairwise comparison", "deep learning"], "abstract": "Heterogeneous face matching is a challenge issue in face recognition due to large domain difference as well as insufﬁcient pairwise images in different modalities during training. This paper proposes a coupled deep learning (CDL) approach for the heterogeneous face matching. CDL seeks a shared feature space in which the heterogeneous face matching problem can be approximately treated as a homogeneous facematchingproblem.TheobjectivefunctionofCDLmainly includes two parts. The ﬁrst part contains a trace norm and a block-diagonal prior as relevance constraints, which not only make unpaired images from multiple modalities be clustered and correlated, but also regularize the parameters to alleviate overﬁtting. An approximate variational formulation is introduced to deal with the difﬁculties of optimizing low-rank constraint directly. The second part contains a cross modal ranking among triplet domain speciﬁc images to maximize the margin for different identities and increase data for a small amount of training samples. Besides, an alternating minimization method is employed to iteratively update the parameters of CDL. Experimental results show that CDL achieves better performance on the challenging CASIA NIR-VIS 2.0 face recognition database, the IIIT-D Sketch database, the CUHK Face Sketch (CUFS), and the CUHK Face Sketch FERET (CUFSF), which signiﬁcantly outperforms state-of-the-art heterogeneous face recognition methods.", "citation": "Citations (1)", "departments": ["Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences", "Chinese Academy of Sciences"], "authors": ["Xiang Wu.....http://dblp.org/pers/hd/w/Wu:Xiang", "Lingxiao Song.....http://dblp.org/pers/hd/s/Song:Lingxiao", "Ran He.....http://dblp.org/pers/hd/h/He:Ran", "Tieniu Tan.....http://dblp.org/pers/hd/t/Tan:Tieniu"], "conf": "aaai", "year": "2018", "pages": 8}