{"title": "Deep Learning for Practical Image Recognition: Case Study on Kaggle Competitions.", "fields": ["ensemble learning", "deep learning", "labeled data", "convolutional neural network", "contextual image classification"], "abstract": "In past years, deep convolutional neural networks (DCNN) have achieved big successes in image classification and object detection, as demonstrated on ImageNet in academic field. However, There are some unique practical challenges remain for real-world image recognition applications, e.g., small size of the objects, imbalanced data distributions, limited labeled data samples, etc. In this work, we are making efforts to deal with these challenges through a computational framework by incorporating latest developments in deep learning. In terms of two-stage detection scheme, pseudo labeling, data augmentation, cross-validation and ensemble learning, the proposed framework aims to achieve better performances for practical image recognition applications as compared to using standard deep learning methods. The proposed framework has recently been deployed as the key kernel for several image recognition competitions organized by Kaggle. The performance is promising as our final private scores were ranked 4 out of 2293 teams for fish recognition on the challenge \"The Nature Conservancy Fisheries Monitoring\" and 3 out of 834 teams for cervix recognition on the challenge \"Intel &MobileODT Cervical Cancer Screening\", and several others. We believe that by sharing the solutions, we can further promote the applications of deep learning techniques.", "citation": "Not cited", "departments": ["Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore", "Institute for I ... pore, Singapore"], "authors": ["Xulei Yang.....http://dblp.org/pers/hd/y/Yang:Xulei", "Zeng Zeng.....http://dblp.org/pers/hd/z/Zeng:Zeng", "Sin G. Teo.....http://dblp.org/pers/hd/t/Teo:Sin_G=", "Li Wang.....http://dblp.org/pers/hd/w/Wang:Li", "Vijay Chandrasekhar.....http://dblp.org/pers/hd/c/Chandrasekhar:Vijay", "Steven C. H. Hoi.....http://dblp.org/pers/hd/h/Hoi:Steven_C=_H="], "conf": "kdd", "year": "2018", "pages": 9}