{"title": "Comparing Dynamics: Deep Neural Networks versus Glassy Systems.", "fields": ["mathematics", "artificial intelligence", "artificial neural network", "machine learning"], "abstract": "We analyze numerically the training dynamics of deep neural networks (DNN) by using methods developed in statistical physics of glassy systems. The two main issues we address are the complexity of the loss-landscape and of the dynamics within it, and to what extent DNNs share similarities with glassy systems. Our findings, obtained for different architectures and datasets, suggest that during the training process the dynamics slows down because of an increasingly large number of flat directions. At large times, when the loss is approaching zero, the system diffuses at the bottom of the landscape. Despite some similarities with the dynamics of mean-field glassy systems, in particular, the absence of barrier crossing, we find distinctive dynamical behaviors in the two cases, showing that the statistical properties of the corresponding loss and energy landscapes are different. In contrast, when the network is under-parametrized we observe a typical glassy behavior, thus suggesting the existence of different phases depending on whether the network is under-parametrized or over-parametrized.", "citation": "Citations (2)", "departments": ["Columbia University", "New York University", "ENS/CEA"], "authors": ["Marco Baity-Jesi.....http://dblp.org/pers/hd/b/Baity=Jesi:Marco", "Levent Sagun.....http://dblp.org/pers/hd/s/Sagun:Levent", "Mario Geiger.....http://dblp.org/pers/hd/g/Geiger:Mario", "Stefano Spigler.....http://dblp.org/pers/hd/s/Spigler:Stefano", "Gérard Ben Arous.....http://dblp.org/pers/hd/a/Arous:G=eacute=rard_Ben", "Chiara Cammarota.....http://dblp.org/pers/hd/c/Cammarota:Chiara", "Yann LeCun.....http://dblp.org/pers/hd/l/LeCun:Yann", "Matthieu Wyart.....http://dblp.org/pers/hd/w/Wyart:Matthieu", "Giulio Biroli.....http://dblp.org/pers/hd/b/Biroli:Giulio"], "conf": "icml", "year": "2018", "pages": 10}