{"title": "Hackers vs. Testers: A Comparison of Software Vulnerability Discovery Processes.", "fields": ["hacker", "vulnerability", "software bug", "software"], "abstract": "Identifying security vulnerabilities in software is a critical task that requires significant human effort. Currently, vulnerability discovery is often the responsibility of software testers before release and white-hat hackers (often within bug bounty programs) afterward. This arrangement can be ad-hoc and far from ideal; for example, if testers could identify more vulnerabilities, software would be more secure at release time. Thus far, however, the processes used by each group — and how they compare to and interact with each other — have not been well studied. This paper takes a first step toward better understanding, and eventually improving, this ecosystem: we report on a semi-structured interview study (n=25) with both testers and hackers, focusing on how each group finds vulnerabilities, how they develop their skills, and the challenges they face. The results suggest that hackers and testers follow similar processes, but get different results due largely to differing experiences and therefore different underlying knowledge of security concepts. Based on these results, we provide recommendations to support improved security training for testers, better communication between hackers and developers, and smarter bug bounty policies to motivate hacker participation.", "citation": "Not cited", "departments": ["University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park", "University of Maryland, College Park"], "authors": ["Daniel Votipka.....http://dblp.org/pers/hd/v/Votipka:Daniel", "Rock Stevens.....http://dblp.org/pers/hd/s/Stevens:Rock", "Elissa M. Redmiles.....http://dblp.org/pers/hd/r/Redmiles:Elissa_M=", "Jeremy Hu.....http://dblp.org/pers/hd/h/Hu:Jeremy", "Michelle L. Mazurek.....http://dblp.org/pers/hd/m/Mazurek:Michelle_L="], "conf": "sp", "year": "2018", "pages": 18}