{"title": "Tackling combinatorial explosion: a study of industrial needs and practices for analyzing highly configurable systems.", "fields": ["systematic sampling", "systems engineering", "sampling", "combinatorial explosion", "software"], "abstract": "Highly configurable systems are complex pieces of software. To tackle this complexity, hundreds of dedicated analysis techniques have been conceived, many of which able to analyze system properties for all possible system configurations, as opposed to traditional, single-system analyses. Unfortunately, it is largely unknown whether these techniques are adopted in practice, whether they address actual needs, or what strategies practitioners actually apply to analyze highly configurable systems. We present a study of analysis practices and needs in industry. It relied on a survey with 27 practitioners engineering highly configurable systems and follow-up interviews with 15 of them, covering 18 different companies from eight countries. We confirm that typical properties considered in the literature (e.g., reliability) are relevant, that consistency between variability models and artifacts is critical, but that the majority of analyses for specifications of configuration options (a.k.a., variability model analysis) is not perceived as needed. We identified rather pragmatic analysis strategies, including practices to avoid the need for analysis. For instance, testing with experience-based sampling is the most commonly applied strategy, while systematic sampling is rarely applicable. We discuss analyses that are missing and synthesize our insights into suggestions for future research.", "citation": "Not cited", "departments": ["Chalmers University of Technology", "Royal Institute of Technology", "Chalmers University of Technology", "Chalmers University of Technology", "Chalmers University of Technology"], "authors": ["Mukelabai Mukelabai.....http://dblp.org/pers/hd/m/Mukelabai:Mukelabai", "Damir Nesic.....http://dblp.org/pers/hd/n/Nesic:Damir", "Salome Maro.....http://dblp.org/pers/hd/m/Maro:Salome", "Thorsten Berger.....http://dblp.org/pers/hd/b/Berger:Thorsten", "Jan-Philipp Steghöfer.....http://dblp.org/pers/hd/s/Stegh=ouml=fer:Jan=Philipp"], "conf": "kbse", "year": "2018", "pages": 12}