{"title": "Accurate and efficient refactoring detection in commit history.", "fields": ["oracle", "commit", "code refactoring", "code review", "software system"], "abstract": "Refactoring detection algorithms have been crucial to a variety of applications: (i) empirical studies about the evolution of code, tests, and faults, (ii) tools for library API migration, (iii) improving the comprehension of changes and code reviews, etc. However, recent research has questioned the accuracy of the state-of-the-art refactoring detection tools, which poses threats to the reliability of their application. Moreover, previous refactoring detection tools are very sensitive to user-provided similarity thresholds, which further reduces their practical accuracy. In addition, their requirement to build the project versions/revisions under analysis makes them inapplicable in many real-world scenarios.   To reinvigorate a previously fruitful line of research that has stifled, we designed, implemented, and evaluated RM iner,  a technique that overcomes the above limitations. At the heart of RM iner  is an AST-based statement matching algorithm that determines refactoring candidates without requiring user-defined thresholds. To empirically evaluate RM iner,  we created the most comprehensive oracle to date that uses triangulation to create a dataset with considerably reduced bias, representing 3,188 refactorings from 185 open-source projects. Using this oracle, we found that RM iner  has a precision of 98% and recall of 87%, which is a significant improvement over the previous state-of-the-art.", "citation": "Citations (2)", "departments": ["Concordia University", "Concordia University", "Concordia University", "Concordia University", "Oregon State University"], "authors": ["Nikolaos Tsantalis.....http://dblp.org/pers/hd/t/Tsantalis:Nikolaos", "Matin Mansouri.....http://dblp.org/pers/hd/m/Mansouri:Matin", "Laleh Mousavi Eshkevari.....http://dblp.org/pers/hd/e/Eshkevari:Laleh_Mousavi", "Davood Mazinanian.....http://dblp.org/pers/hd/m/Mazinanian:Davood", "Danny Dig.....http://dblp.org/pers/hd/d/Dig:Danny"], "conf": "icse", "year": "2018", "pages": 12}