{"title": "Efficient and Fair Multi-programming in GPUs via Effective Bandwidth Management.", "fields": ["general purpose computing on graphics processing units", "cache", "bandwidth management", "shared memory", "limiting"], "abstract": "Managing the thread-level parallelism (TLP) of GPGPU applications by limiting it to a certain degree is known to be effective in improving the overall performance. However, we find that such prior techniques can lead to sub-optimal system throughput and fairness when two or more applications are co-scheduled on the same GPU. It is because they attempt to maximize the performance of individual applications in isolation, ultimately allowing each application to take a disproportionate amount of shared resources. This leads to high contention in shared cache and memory. To address this problem, we propose new application-aware TLP management techniques for a multi-application execution environment such that all co-scheduled applications can make good and judicious use of all the shared resources. For measuring such use, we propose an application-level utility metric, called effective bandwidth, which accounts for two runtime metrics: attained DRAM bandwidth and cache miss rates. We find that maximizing the total effective bandwidth and doing so in a balanced fashion across all co-located applications can significantly improve the system throughput and fairness. Instead of exhaustively searching across all the different combinations of TLP configurations that achieve these goals, we find that a significant amount of overhead can be reduced by taking advantage of the trends, which we call patterns, in the way application's effective bandwidth changes with different TLP combinations. Our proposed pattern-based TLP management mechanisms improve the system throughput and fairness by 20% and 2x, respectively, over a baseline where each application executes with a TLP configuration that provides the best performance when it executes alone.", "citation": "Citations (1)", "departments": ["College of William & Mary", "Advanced Micro Devices", "College of William & Mary"], "authors": ["Haonan Wang.....http://dblp.org/pers/hd/w/Wang:Haonan", "Fan Luo.....http://dblp.org/pers/hd/l/Luo:Fan", "Mohamed Ibrahim.....http://dblp.org/pers/hd/i/Ibrahim:Mohamed", "Onur Kayiran.....http://dblp.org/pers/hd/k/Kayiran:Onur", "Adwait Jog.....http://dblp.org/pers/hd/j/Jog:Adwait"], "conf": "hpca", "year": "2018", "pages": 12}