{"title": "Dynamical Isometry and a Mean Field Theory of CNNs: How to Train 10, 000-Layer Vanilla Convolutional Neural Networks.", "fields": ["isometry", "orthogonal transformation", "initialization", "convolutional neural network", "residual"], "abstract": "In recent years, state-of-the-art methods in computer vision have utilized increasingly deep convolutional neural network architectures (CNNs), with some of the most successful models employing hundreds or even thousands of layers. A variety of pathologies such as vanishing/exploding gradients make training such deep networks challenging. While residual connections and batch normalization do enable training at these depths, it has remained unclear whether such specialized architecture designs are truly necessary to train deep CNNs. In this work, we demonstrate that it is possible to train vanilla CNNs with ten thousand layers or more simply by using an appropriate initialization scheme. We derive this initialization scheme theoretically by developing a mean field theory for signal propagation and by characterizing the conditions for dynamical isometry, the equilibration of singular values of the input-output Jacobian matrix. These conditions require that the convolution operator be an orthogonal transformation in the sense that it is norm-preserving. We present an algorithm for generating such random initial orthogonal convolution kernels and demonstrate empirically that they enable efficient training of extremely deep architectures.", "citation": "Citations (1)", "departments": ["Google", "Google", "University of California, Berkeley", "Google", "Google"], "authors": ["Lechao Xiao.....http://dblp.org/pers/hd/x/Xiao:Lechao", "Yasaman Bahri.....http://dblp.org/pers/hd/b/Bahri:Yasaman", "Jascha Sohl-Dickstein.....http://dblp.org/pers/hd/s/Sohl=Dickstein:Jascha", "Samuel S. Schoenholz.....http://dblp.org/pers/hd/s/Schoenholz:Samuel_S=", "Jeffrey Pennington.....http://dblp.org/pers/hd/p/Pennington:Jeffrey"], "conf": "icml", "year": "2018", "pages": 10}