{"title": "Collaborative Uploading in Heterogeneous Networks: Optimal and Adaptive Strategies.", "fields": ["crowdsourcing", "heterogeneous network", "data stream", "expression", "upload"], "abstract": "Collaborative uploading describes a type of crowdsourcing scenario in networked environments where a device utilizes multiple paths over neighboring devices to upload content to a centralized processing entity such as a cloud service. Intermediate devices may aggregate and preprocess this data stream. Such scenarios arise in the composition and aggregation of information, e.g., from smartphones or sensors. We use a queuing theoretic description of the collaborative uploading scenario, capturing the ability to split data into chunks that are then transmitted over multiple paths, and finally merged at the destination. We analyze replication and allocation strategies that control the mapping of data to paths and provide closed-form expressions that pinpoint the optimal strategy given a description of the paths' service distributions. Finally, we provide an online path-aware adaptation of the allocation strategy that uses statistical inference to sequentially minimize the expected waiting time for the uploaded data. Numerical results show the effectiveness of the adaptive approach compared to the proportional allocation and a variant of the join-the-shortest-queue allocation, especially for bursty path conditions.", "citation": "Not cited", "departments": ["Technische Universität Darmstadt", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "Technische Universität Darmstadt", "Technische Universität Darmstadt"], "authors": ["Wasiur R. KhudaBukhsh.....http://dblp.org/pers/hd/k/KhudaBukhsh:Wasiur_R=", "Bastian Alt.....http://dblp.org/pers/hd/a/Alt:Bastian", "Sounak Kar.....http://dblp.org/pers/hd/k/Kar:Sounak", "Amr Rizk.....http://dblp.org/pers/hd/r/Rizk:Amr", "Heinz Koeppl.....http://dblp.org/pers/hd/k/Koeppl:Heinz"], "conf": "infocom", "year": "2018", "pages": 9}