{"title": "Espresso: Brewing Java For More Non-Volatility with Non-volatile Memory.", "fields": ["persistent data structure", "espresso", "programming paradigm", "heap", "persistence"], "abstract": "Fast, byte-addressable non-volatile memory (NVM) embraces both near-DRAM latency and disk-like persistence, which has generated considerable interests to revolutionize system software stack and programming models. However, it is less understood how NVM can be combined with managed runtime like Java virtual machine (JVM) to ease persistence management. This paper proposes Espresso, a holistic extension to Java and its runtime, to enable Java programmers to exploit NVM for persistence management with high performance. Espresso first provides a general persistent heap design called Persistent Java Heap (PJH) to manage persistent data as normal Java objects. The heap is then strengthened with a recoverable mechanism to provide crash consistency for heap metadata. Espresso further provides a new abstraction called Persistent Java Object (PJO) to provide an easy-to-use but safe persistence programming model for programmers to persist application data. Evaluation confirms that Espresso significantly outperforms state-of-art NVM support for Java (i.e., JPA and PCJ) while being compatible to data structures in existing Java programs.", "citation": "Citations (1)", "year": "2018", "departments": ["Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University", "Shanghai Jiao Tong University"], "conf": "asplos", "authors": ["Mingyu Wu.....http://dblp.org/pers/hd/w/Wu:Mingyu", "Ziming Zhao.....http://dblp.org/pers/hd/z/Zhao_0003:Ziming", "Haoyu Li.....http://dblp.org/pers/hd/l/Li:Haoyu", "Heting Li.....http://dblp.org/pers/hd/l/Li:Heting", "Haibo Chen.....http://dblp.org/pers/hd/c/Chen:Haibo", "Binyu Zang.....http://dblp.org/pers/hd/z/Zang:Binyu", "Haibing Guan.....http://dblp.org/pers/hd/g/Guan:Haibing"], "pages": 14}