{"title": "Leveraging Crowdsourcing Data for Deep Active Learning An Application: Learning Intents in Alexa.", "fields": ["crowdsourcing", "deep learning", "exploit", "crowds", "bridging"], "abstract": "This paper presents a generic Bayesian framework that enables any deep learning model to actively learn from targeted crowds. Our framework inherits from recent advances in Bayesian deep learning, and extends existing work by considering the targeted crowdsourcing approach, in which multiple annotators of unknown expertise contribute an uncontrolled amount (often limited) of annotations. Specifically, our framework leverages the low-rank structure in annotations to learn individual annotator expertise, which then helps to infer the true labels from noisy and sparse annotations. It provides a unified Bayesian model to simultaneously infer the true labels and train the deep learning model in order to reach an optimal learning efficacy. Finally, our framework exploits the uncertainty of the deep learning model during prediction as well as the annotators’ estimated expertise to minimize the number of required annotations and annotators for optimally training the deep learning model.We evaluate the effectiveness of our framework in both simulated and real-world datasets, and validate its applicability in a strategic task of Alexa, Amazon’s personal assistant, namely intent classification.  Extensive experiments show that our framework can accurately learn annotator expertise, infer true labels, and effectively reduce the amount of annotations in model training as compared to state-of-the-art approaches. We further discuss the potential of our proposed framework in bridging machine learning and crowdsourcing towards improved human-in-the-loop systems.", "citation": "Not cited", "departments": ["Delft University of Technology", "Amazon.com", "Amazon.com", "Amazon.com"], "authors": ["Jie Yang.....http://dblp.org/pers/hd/y/Yang:Jie", "Thomas Drake.....http://dblp.org/pers/hd/d/Drake:Thomas", "Andreas Damianou.....http://dblp.org/pers/hd/d/Damianou:Andreas", "Yoelle Maarek.....http://dblp.org/pers/hd/m/Maarek:Yoelle"], "conf": "www", "year": "2018", "pages": 10}