{"title": "AdaError: An Adaptive Learning Rate Method for Matrix Approximation-based Collaborative Filtering.", "fields": ["recommender system", "movielens", "stochastic gradient descent", "adaptive learning", "collaborative filtering"], "abstract": "In matrix approximation (MA)-based collaborative filtering (CF) algorithms, gradient-based learning methods, e.g., stochastic gradient descent (SGD), are widely adopted to learn MA models based on observed user-item ratings. However, one of the common issues in existing gradient-based learning methods is how to determine proper learning rates, because the model convergence will be inaccurate or very slow if the learning rate is too large or too small, respectively. This paper proposes AdaError — an adaptive learning rate method for matrix approximation-based collaborative filtering. AdaError can reduce the learning rates for noisy ratings to prevent the learned models from overreacting to the noises. Meanwhile, AdaError can adaptively shrink the learning rates to eliminate the need of manually tuning the learning rates. Our theoretical and empirical analysis shows that the generalization performance of learned MA models can be improved using AdaError. Experimental studies on MovieLens and Netflix datasets demonstrate that the proposed method can outperform state-of-the-art adaptive learning rate methods in matrix approximation-based collaborative filtering. Meanwhile, by applying the proposed AdaError method on standard matrix approximation method, we can achieve statistically significant improvements in both rating prediction accuracy and top-N recommendation accuracy compared with state-of-the-art collaborative filtering methods.", "citation": "Not cited", "departments": ["IBM", "IBM", "University of Colorado Boulder", "Seagate Technology", "Fudan University"], "authors": ["Dongsheng Li.....http://dblp.org/pers/hd/l/Li:Dongsheng", "Chao Chen.....http://dblp.org/pers/hd/c/Chen:Chao", "Qin Lv.....http://dblp.org/pers/hd/l/Lv:Qin", "Hansu Gu.....http://dblp.org/pers/hd/g/Gu:Hansu", "Tun Lu.....http://dblp.org/pers/hd/l/Lu:Tun", "Li Shang.....http://dblp.org/pers/hd/s/Shang:Li", "Ning Gu.....http://dblp.org/pers/hd/g/Gu:Ning", "Stephen M. Chu.....http://dblp.org/pers/hd/c/Chu:Stephen_M="], "conf": "www", "year": "2018", "pages": 11}