{"title": "RADWAN: rate adaptive wide area network.", "fields": ["testbed", "wide area network", "gigabit", "optical fiber cable", "traffic engineering"], "abstract": "Fiber optic cables connecting data centers are an expensive but important resource for large organizations. Their importance has driven a conservative deployment approach, with redundancy and reliability baked in at multiple layers. In this work, we take a more aggressive approach and argue for adapting the capacity of fiber optic links based on their signal-to-noise ratio (SNR). We investigate this idea by analyzing the SNR of over 8,000 links in an optical backbone for a period of three years. We show that the capacity of 64% of 100 Gbps IP links can be augmented by at least 75 Gbps, leading to an overall capacity gain of over 134 Tbps. Moreover, adapting link capacity to a lower rate can prevent up to 25% of link failures. Our analysis shows that using the same links, we get higher capacity, better availability, and 32% lower cost per gigabit per second. To accomplish this, we propose RADWAN, a traffic engineering system that allows optical links to adapt their rate based on the observed SNR to achieve higher throughput and availability while minimizing the churn during capacity reconfigurations. We evaluate RADWAN using a testbed consisting of 1,540 km fiber with 16 amplifiers and attenuators. We then simulate the throughput gains of RADWAN at scale and compare them to the gains of state-of-the-art traffic engineering systems. Our data-driven simulations show that RADWAN improves the overall network throughput by 40% while also improving the average link availability.", "citation": "Citations (1)", "year": "2018", "departments": ["University of Massachusetts Amherst", "Microsoft", "University of Vienna", "Microsoft", "University of Massachusetts Amherst"], "conf": "sigcomm", "authors": ["Rachee Singh.....http://dblp.org/pers/hd/s/Singh:Rachee", "Manya Ghobadi.....http://dblp.org/pers/hd/g/Ghobadi:Manya", "Klaus-Tycho Foerster.....http://dblp.org/pers/hd/f/Foerster:Klaus=Tycho", "Mark Filer.....http://dblp.org/pers/hd/f/Filer:Mark", "Phillipa Gill.....http://dblp.org/pers/hd/g/Gill:Phillipa"], "pages": 14}