{"title": "Online Adaptive Asymmetric Active Learning for Budgeted Imbalanced Data.", "fields": ["merge", "active learning", "network security", "rate of convergence", "anomaly detection"], "abstract": "This paper investigates Online Active Learning (OAL) for imbalanced unlabeled datastream, where only a budget of labels can be queried to optimize some cost-sensitive performance measure. OAL can solve many real-world problems, such as anomaly detection in healthcare, finance and network security. In these problems, there are two key challenges: the query budget is often limited; the ratio between two classes is highly imbalanced. To address these challenges, existing work of OAL adopts either asymmetric losses or queries (an isolated asymmetric strategy) to tackle the imbalance, and uses first-order methods to optimize the cost-sensitive measure. However, they may incur two deficiencies: (1) the poor ability in handling imbalanced data due to the isolated asymmetric strategy; (2) relative slow convergence rate due to the first-order optimization. In this paper, we propose a novel Online Adaptive Asymmetric Active (OA3) learning algorithm, which is based on a new asymmetric strategy (merging both the asymmetric losses and queries strategies), and second-order optimization. We theoretically analyze its bounds, and also empirically evaluate it on four real-world online anomaly detection tasks. Promising results confirm the effectiveness and robustness of the proposed algorithm in various application domains.", "citation": "Not cited", "departments": ["South China University of Technology", "South China University of Technology", "South China University of Technology", "Tencent", "Tencent"], "authors": ["Yifan Zhang.....http://dblp.org/pers/hd/z/Zhang:Yifan", "Peilin Zhao.....http://dblp.org/pers/hd/z/Zhao:Peilin", "Jiezhang Cao.....http://dblp.org/pers/hd/c/Cao:Jiezhang", "Wenye Ma.....http://dblp.org/pers/hd/m/Ma:Wenye", "Junzhou Huang.....http://dblp.org/pers/hd/h/Huang:Junzhou", "Qingyao Wu.....http://dblp.org/pers/hd/w/Wu:Qingyao", "Mingkui Tan.....http://dblp.org/pers/hd/t/Tan:Mingkui"], "conf": "kdd", "year": "2018", "pages": 10}