{"title": "Traffic Optimization for a Mixture of Self-Interested and Compliant Agents.", "fields": ["traverse", "distributed computing", "route assignment", "network management", "computer science", "mathematical optimization", "traffic optimization"], "abstract": "This paper focuses on two commonly used path assignment policies for agents traversing a congested network: self-interested routing, and system-optimum routing. In the self-interested routing policy each agent selects a path that optimizes its own utility, while the system-optimum routing agents are assigned paths with the goal of maximizing system performance. This paper considers a scenario where a centralized network manager wishes to optimize utilities over all agents, i.e., implement a system-optimum routing policy. In many real-life scenarios, however, the system manager is unable to influence the route assignment of all agents due to limited influence on route choice decisions. Motivated by such scenarios, a computationally tractable method is presented that computes the minimal amount of agents that the system manager needs to influence (compliant agents) in order to achieve system optimal performance. Moreover, this methodology can also determine whether a given set of compliant agents is sufficient to achieve system optimum and compute the optimal route assignment for the compliant agents to do so. Experimental results are presented showing that in several large-scale, realistic traffic networks optimal flow can be achieved with as low as 13% of the agent being compliant and up to 54%.", "citation": "Not cited", "departments": ["University of Texas at Austin", "Indian Institute of Science", "Duke University", "University of Texas at Austin", "University of Texas at Austin"], "authors": ["Guni Sharon.....http://dblp.org/pers/hd/s/Sharon:Guni", "Michael Albert.....http://dblp.org/pers/hd/a/Albert:Michael", "Tarun Rambha.....http://dblp.org/pers/hd/r/Rambha:Tarun", "Stephen D. Boyles.....http://dblp.org/pers/hd/b/Boyles:Stephen_D=", "Peter Stone.....http://dblp.org/pers/hd/s/Stone:Peter"], "conf": "aaai", "year": "2018", "pages": 8}