{"title": "Accelerating Innovation Through Analogy Mining.", "fields": ["applied mathematics", "recurrent neural network", "crowdsourcing", "computer science", "analogy", "machine learning", "precision and recall", "artificial intelligence", "structural similarity"], "abstract": "The availability of large idea repositories (e.g., the U.S. patent database) could significantly accelerate innovation and discovery by providing people with inspiration from solutions to analogous problems. However, finding useful analogies in these large, messy, real-world repositories remains a persistent challenge for either human or automated methods. Previous approaches include costly hand-created databases that have high relational structure (e.g., predicate calculus representations) but are very sparse. Simpler machine-learning/information-retrieval similarity metrics can scale to large, natural-language datasets, but struggle to account for structural similarity, which is central to analogy. In this paper we explore the viability and value of learning simpler structural representations, specifically, \"problem schemas\", which specify the purpose of a product and the mechanisms by which it achieves that purpose. Our approach combines crowdsourcing and recurrent neural networks to extract purpose and mechanism vector representations from product descriptions. We demonstrate that these learned vectors allow us to find analogies with higher precision and recall than traditional information-retrieval methods. In an ideation experiment, analogies retrieved by our models significantly increased people's likelihood of generating creative ideas compared to analogies retrieved by traditional methods. Our results suggest a promising approach to enabling computational analogy at scale is to learn and leverage weaker structural representations.", "citation": "Not cited", "departments": ["Hebrew University of Jerusalem", "Carnegie Mellon University", "Carnegie Mellon University", "Hebrew University of Jerusalem", "Hebrew University of Jerusalem", "Carnegie Mellon University", "Carnegie Mellon University", "Hebrew University of Jerusalem"], "authors": ["Tom Hope.....http://dblp.org/pers/hd/h/Hope:Tom", "Joel Chan.....http://dblp.org/pers/hd/c/Chan:Joel", "Aniket Kittur.....http://dblp.org/pers/hd/k/Kittur:Aniket", "Dafna Shahaf.....http://dblp.org/pers/hd/s/Shahaf:Dafna"], "conf": "ijcai", "year": "2018", "pages": 5}