{"title": "Transferability of Spatial Maps: Augmented Versus Virtual Reality Training.", "fields": ["forgetting", "virtual reality", "memorization", "task analysis", "workflow"], "abstract": "Work space simulations help trainees acquire skills necessary to perform their tasks efficiently without disrupting the workflow, forgetting important steps during a procedure, or the location of important information. This training can be conducted in Augmented and Virtual Reality (AR, VR) to enhance its effectiveness and speed. When the skills are transferred to the actual application, it is referred to as positive training transfer. However, thus far, it is unclear which training, AR or VR, achieves better results in terms of positive training transfer. We compare the effectiveness of AR and VR for spatial memory training in a control-room scenario, where users have to memorize the location of buttons and information displays in their surroundings. We conducted a within-subject study with 16 participants and evaluated the impact the training had on short-term and long-term memory. Results of our study show that VR outperformed AR when tested in the same medium after the training. In a memory transfer test conducted two days later AR outperformed VR. Our findings have implications on the design of future training scenarios and applications.", "citation": "Not cited", "departments": ["Nara Institute of Science and Technology", "Nara Institute of Science and Technology", "Nara Institute of Science and Technology", "Nara Institute of Science and Technology", "Nara Institute of Science and Technology"], "authors": ["Nicko R. Caluya.....http://dblp.org/pers/hd/c/Caluya:Nicko_R=", "Alexander Plopski.....http://dblp.org/pers/hd/p/Plopski:Alexander", "Jayzon F. Ty.....http://dblp.org/pers/hd/t/Ty:Jayzon_F=", "Christian Sandor.....http://dblp.org/pers/hd/s/Sandor:Christian", "Takafumi Taketomi.....http://dblp.org/pers/hd/t/Taketomi:Takafumi", "Hirokazu Kato.....http://dblp.org/pers/hd/k/Kato:Hirokazu"], "conf": "vr", "year": "2018", "pages": 7}