{"title": "Contextually-Enriched Querying of Integrated Data Sources.", "fields": ["knowledge based systems", "schema", "systems architecture", "ontology", "personalization"], "abstract": "In many applications, users face the need to integrate multiple information sources to solve their tasks. While most information sources can be seen as stable, as they contain factual, objective knowledge (which is the case for most relational databases), there can be personalized contextual knowledge which enriches the available factual data and contributes to their interpretation, in the context of the knowledge of the user who queries the system. In this paper, we present CrowdSourced Semantic Enrichment (CroSSE), a social knowledge platform supporting semantic enrichment and integrated services (such as content personalization, preview, and social recommendations) within the context of scientific investigations. Semantic enrichment is especially useful in applications where data (schema and facts) evolve faster than the database itself and, while essential to the operation of the enterprise, the database lacks the flexibility to (a) prevent going stale or (b) capture user-provided and/or crowdsourced data and knowledge for more effective decision support. More specifically, in this paper, we focus on the SESQL language and the supporting system architecture, which enables users to (a) enrich a databank with semantic tagging information and (b) leverage contextualised queries to the databank for enabling contextualised data analysis.", "citation": "Not cited", "departments": ["University of Turin", "University of Turin", "University of Turin", "Arizona State University"], "authors": ["Giacomo Cavallo.....http://dblp.org/pers/hd/c/Cavallo:Giacomo", "Francesco Di Mauro.....http://dblp.org/pers/hd/m/Mauro:Francesco_Di", "Paolo Pasteris.....http://dblp.org/pers/hd/p/Pasteris:Paolo", "Maria Luisa Sapino.....http://dblp.org/pers/hd/s/Sapino:Maria_Luisa", "Kasim Selçuk Candan.....http://dblp.org/pers/hd/c/Candan:Kasim_Sel=ccedil=uk"], "conf": "icde", "year": "2018", "pages": 8}