{"title": "A Cross-Platform Consumer Behavior Analysis of Large-Scale Mobile Shopping Data.", "fields": ["consumer behaviour", "e commerce", "mobile device", "purchasing", "cross platform"], "abstract": "The proliferation of mobile devices especially smart phones brings remarkable opportunities for both industry and academia. In particular, the massive data generated from users» usage logs provide the possibilities for stakeholders to know better about consumer behaviors with the aid of data mining. In this paper, we examine the consumer behaviors across multiple platforms based on a large-scale mobile Internet dataset from a major telecom operator, which covers 9.8 million users from two regions among which 1.4 million users have visited e-commerce platforms within one week of our study. We make several interesting observations and examine users» cultural differences from different regions. Our analysis shows among the multiple e-commerce platforms available, most mobile users are loyal to their favorable sites; people (60%) tend to make quick decisions to buy something online, which usually takes less than half an hour. Furthermore, we find that people in residential areas are much easier to perform purchases than in business districts and purchases take place during non-work time. Meanwhile, people with medium socioeconomic status like browsing and purchasing on e-commerce platforms, while people with high and low socioeconomic status are much easier to conduct purchases online. We also show the predictability of cross-platform shopping behaviors with extensive experiments on the basis of our observed data. Our discoveries could be a good guide for e-commerce future strategy making.", "citation": "Not cited", "departments": ["Huazhong University of Science and Technology", "Fudan University", "Fudan University", "University of Göttingen", "Gesellschaft Fu ... ingen, Germany"], "authors": ["Hong Huang.....http://dblp.org/pers/hd/h/Huang_0001:Hong", "Bo Zhao.....http://dblp.org/pers/hd/z/Zhao:Bo", "Hao Zhao.....http://dblp.org/pers/hd/z/Zhao:Hao", "Zhou Zhuang.....http://dblp.org/pers/hd/z/Zhuang:Zhou", "Zhenxuan Wang.....http://dblp.org/pers/hd/w/Wang:Zhenxuan", "Xiaoming Yao.....http://dblp.org/pers/hd/y/Yao:Xiaoming", "Xinggang Wang.....http://dblp.org/pers/hd/w/Wang:Xinggang", "Hai Jin.....http://dblp.org/pers/hd/j/Jin_0001:Hai", "Xiaoming Fu.....http://dblp.org/pers/hd/f/Fu_0001:Xiaoming"], "conf": "www", "year": "2018", "pages": 10}