{"title": "TVM: An Automated End-to-End Optimizing Compiler for Deep Learning.", "fields": ["deep learning", "cas latency", "optimizing compiler", "end to end principle", "software portability"], "abstract": "There is an increasing need to bring machine learning to a wide diversity of hardware devices. Current frameworks rely on vendor-specific operator libraries and optimize for a narrow range of server-class GPUs. Deploying workloads to new platforms such as mobile phones, embedded devices, and accelerators (e.g., FPGAs, ASICs) requires significant manual effort. We propose TVM, a compiler that exposes graph-level and operator-level optimizations to provide performance portability to deep learning workloads across diverse hardware back-ends. TVM solves optimization challenges specific to deep learning such as high-level operator fusion, mapping to arbitrary hardware primitives, and memory latency hiding. TVM also offers automated optimization of low-level programs to hardware characteristics by employing a novel learning-based cost modeling method for rapid exploration of code optimizations. Experimental results demonstrate that TVM delivers performance across hardware back-ends that are competitive with state-of-the-art hand-tuned libraries for low-power CPU, mobile GPU, and server-class GPUs. We also demonstrate TVM's ability to target new accelerator back-ends by targeting an FPGA-based generic deep learning accelerator. The system is open sourced and in production use inside several major companies.", "citation": "Not cited", "year": "2018", "departments": [], "conf": "osdi", "authors": ["Tianqi Chen.....http://dblp.org/pers/hd/c/Chen:Tianqi", "Thierry Moreau.....http://dblp.org/pers/hd/m/Moreau:Thierry", "Ziheng Jiang.....http://dblp.org/pers/hd/j/Jiang:Ziheng", "Lianmin Zheng.....http://dblp.org/pers/hd/z/Zheng:Lianmin", "Eddie Q. Yan.....http://dblp.org/pers/hd/y/Yan:Eddie_Q=", "Haichen Shen.....http://dblp.org/pers/hd/s/Shen:Haichen", "Meghan Cowan.....http://dblp.org/pers/hd/c/Cowan:Meghan", "Leyuan Wang.....http://dblp.org/pers/hd/w/Wang:Leyuan", "Yuwei Hu.....http://dblp.org/pers/hd/h/Hu:Yuwei", "Luis Ceze.....http://dblp.org/pers/hd/c/Ceze:Luis", "Carlos Guestrin.....http://dblp.org/pers/hd/g/Guestrin:Carlos", "Arvind Krishnamurthy.....http://dblp.org/pers/hd/k/Krishnamurthy:Arvind"], "pages": 17}