{"title": "Small-Variance Asymptotics for Nonparametric Bayesian Overlapping Stochastic Blockmodels.", "fields": ["relational model", "prior probability", "markov chain monte carlo", "bilinear map", "generative model"], "abstract": "The latent feature relational model (LFRM) is a generative model for graph-structured data to learn a binary vector representation for each node in the graph. The binary vector denotes the node's membership in one or more communities. At its core, the LFRM miller2009nonparametric is an overlapping stochastic blockmodel, which defines the link probability between any pair of nodes as a bilinear function of their community membership vectors. Moreover, using a nonparametric Bayesian prior (Indian Buffet Process) enables learning the number of communities automatically from the data. However, despite its appealing properties, inference in LFRM remains a challenge and is typically done via MCMC methods. This can be slow and may take a long time to converge. In this work, we develop a small-variance asymptotics based framework for the non-parametric Bayesian LFRM. This leads to an objective function that retains the nonparametric Bayesian flavor of LFRM, while enabling us to design deterministic inference algorithms for this model, that are easy to implement (using generic or specialized optimization routines) and are fast in practice. Our results on several benchmark datasets demonstrate that our algorithm is competitive to methods such as MCMC, while being much faster.", "citation": "Not cited", "departments": ["Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur", "Indian Institute of Technology Kanpur"], "authors": ["Gundeep Arora.....http://dblp.org/pers/hd/a/Arora:Gundeep", "Anupreet Porwal.....http://dblp.org/pers/hd/p/Porwal:Anupreet", "Kanupriya Agarwal.....http://dblp.org/pers/hd/a/Agarwal:Kanupriya", "Avani Samdariya.....http://dblp.org/pers/hd/s/Samdariya:Avani", "Piyush Rai.....http://dblp.org/pers/hd/r/Rai:Piyush"], "conf": "ijcai", "year": "2018", "pages": 7}