{"title": "Memory System Design for Ultra Low Power, Computationally Error Resilient Processor Microarchitectures.", "fields": ["dennard scaling", "microarchitecture", "memory address", "memory hierarchy", "bit error rate"], "abstract": "Dennard scaling ended a decade ago. Energy reduction by lowering supply voltage has been limited because of guard bands and a subthreshold slope of over 60mV/decade in MOSFETs. On the other hand, newly-proposed logic devices maintain a high on/off ratio for drain currents even at significantly lower operating voltages. However, such ultra low power technology would eventually suffer from intermittent errors in logic as a result of operating close to the thermal noise floor. Computational error correction mitigates this issue by efficiently correcting stochastic bit errors that may occur in computational logic operating at low signal energies, thereby allowing for energy reduction by lowering supply voltage to tens of millivolts. Cores based on a Redundant Residual Number System (RRNS), which represents a number using a tuple of smaller numbers, are a promising candidate for implementing energyefficient computational error correction. However, prior RRNS core microarchitectures abstract away the memory hierarchy and do not consider the power-performance impact of RNS-based memory addressing. When compared with a non-error-correcting core addressing memory in binary, naive RNS-based memory addressing schemes cause a slowdown of over 3x/2x for inorder/out-of-order cores respectively. In this paper, we analyze RNS-based memory access pattern behavior and provide solutions in the form of novel schemes and the resulting design space exploration, thereby, extending and enabling a tangible, ultra low power RRNS based architecture.", "citation": "Not cited", "departments": ["Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology", "Georgia Institute of Technology"], "authors": ["Sriseshan Srikanth.....http://dblp.org/pers/hd/s/Srikanth:Sriseshan", "Paul G. Rabbat.....http://dblp.org/pers/hd/r/Rabbat:Paul_G=", "Eric R. Hein.....http://dblp.org/pers/hd/h/Hein:Eric_R=", "Bobin Deng.....http://dblp.org/pers/hd/d/Deng:Bobin", "Thomas M. Conte.....http://dblp.org/pers/hd/c/Conte:Thomas_M=", "Erik DeBenedictis.....http://dblp.org/pers/hd/d/DeBenedictis:Erik", "Jeanine E. Cook.....http://dblp.org/pers/hd/c/Cook:Jeanine_E=", "Michael P. Frank.....http://dblp.org/pers/hd/f/Frank:Michael_P="], "conf": "hpca", "year": "2018", "pages": 14}